[
 [
  [
   178158, 
   null, 
   "Kronus", 
   "The members of the Dover school board that were pushing for ID has been voted out.\n \n http://www.cnn.com/2005/POLITICS/11/09/evolution.intelligentdesign.ap/index.html\n \n I guess everyone hasn't gone mad. :)", 
   {
    "post_info": {
     "post_title": "Bye-bye to ID supporters"
    }
   }, 
   null, 
   null, 
   1131570000.0
  ], 
  [
   178162, 
   null, 
   "Howard Beale", 
   "The members of the Dover school board that were pushing for ID has been voted out.\n \n http://www.cnn.com/2005/POLITICS/11/09/evolution.intelligentdesign.ap/index.html\n \n I guess everyone hasn't gone mad. :)\nMaybe they moved to Kansas.", 
   {}, 
   178158, 
   null, 
   1131570600.0
  ], 
  [
   178165, 
   null, 
   "trebor", 
   "The members of the Dover school board that were pushing for ID has been voted out.\n \n http://www.cnn.com/2005/POLITICS/11/09/evolution.intelligentdesign.ap/index.html\n \n I guess everyone hasn't gone mad. :)\n\n \n \n What is nice is that people probably got tired of their blatant lies, and I am sure that the Dover trial will show the board had religious motivation in trying to push ID. It will set a nice precident , for when the kanas board gets sued.", 
   {}, 
   178158, 
   null, 
   1131570960.0
  ], 
  [
   178179, 
   null, 
   "Steeeeve", 
   "I guess we go from 2 unprovable theories to just 1. You would think ID would be allowed as well considering it hasn't changed much over the years while evolution has to to evolve in order to be remotely possible.", 
   {}, 
   178165, 
   null, 
   1131573360.0
  ], 
  [
   178183, 
   null, 
   "trebor", 
   "I guess we go from 2 unprovable theories to just 1. You would think ID would be allowed as well considering it hasn't changed much over the years while evolution has to to evolve in order to be remotely possible.\n\n \n \n Do you know what a scientific theory is?? I don't think so, because if you knew anything about science, you would not have used the terminology you did.\n \n Evolution is both a fact and a theory. IT is a fact in that it happens. It is a theory in the model of the mechanism of HOW it occurs. \n \n ID is not even a scientific theory. It does not have any evidence for it. It does not explain on HOW anything happens. It makes no predictions. It does not have a way that it can be falsified.", 
   {}, 
   178179, 
   null, 
   1131574260.0
  ], 
  [
   178203, 
   null, 
   "Howard Beale", 
   "Do you know what a scientific theory is?? I don't think so, because if you knew anything about science, you would not have used the terminology you did.\n \n Evolution is both a fact and a theory. IT is a fact in that it happens. It is a theory in the model of the mechanism of HOW it occurs. \n \n ID is not even a scientific theory. It does not have any evidence for it. It does not explain on HOW anything happens. It makes no predictions. It does not have a way that it can be falsified.\nIn addition there is not one scientist, ID proponent or otherwise, who has shown ID to be a valid scientific theory. I have asked on numerous websites and not one name has been given to me of a scientist who 10 claims ID is a valid scientific theory, 2) demonstrates and backs up with his work the claim that ID is a valid scientific theory.", 
   {}, 
   178183, 
   null, 
   1131578460.0
  ], 
  [
   178217, 
   null, 
   "OccamsRazor", 
   "I'm glad the vox populi has finally had a chance to comment on the actions of the Dover District Board:) Lets hope the Supreme Court echos their sentiment.\n \n \nI guess we go from 2 unprovable theories to just 1. You would think ID would be allowed as well considering it hasn't changed much over the years while evolution has to to evolve in order to be remotely possible.\n\n \n Balony, every field of science has had to \"evolve\" to be \"remotely possible\".\n \n Like John Bacon's statement your comment is a good piece of doublespeak- an explaination based on the factual study of the evidence of life and the tale of supernatural creation are not comparable as theory.", 
   {}, 
   178179, 
   null, 
   1131582960.0
  ], 
  [
   178232, 
   null, 
   "marc9000", 
   "In addition there is not one scientist, ID proponent or otherwise, who has shown ID to be a valid scientific theory. I have asked on numerous websites and not one name has been given to me of a scientist who 10 claims ID is a valid scientific theory, 2) demonstrates and backs up with his work the claim that ID is a valid scientific theory.\n\n \n Check this site;\n \n http://www.discovery.org/csc/aboutCSC.php\n \n \n .......supports research by scientists and other scholars developing the scientific theory known as intelligent design; \n\n \n A few notable names there are Micheal Behe, William Dembski, and Phillip Johnson. They may not fit your definition of \"scientests\", but they have some interesting things to say.", 
   {}, 
   178203, 
   null, 
   1131587820.0
  ], 
  [
   178237, 
   null, 
   "OccamsRazor", 
   "\n A few notable names there are Micheal Behe, William Dembski, and Phillip Johnson. They may not fit your definition of \"scientests\", but they have some interesting things to say.\n\n \n Behe is certainly a very talented and able scientist in the field of biochemistry- he just let his religion and incredulity get in the way when it comes to descent and evolution.\n \n Dembski isn't a scientist- he is a mathematian/theologian, and nor is Phillip E. Johnson, a Professor of Law. Johnson in particualr should stick to his areas of expertise- besides rubbishing evolution he also likes to spend time advocating that HIV and AIDS are unrelated. I bet the professional Medical community appreciates his input on that as much as paleontologists do regarding evolution.", 
   {}, 
   178232, 
   null, 
   1131588900.0
  ], 
  [
   178238, 
   null, 
   "marc9000", 
   "Behe is certainly a very talented and able scientist in the field of biochemistry- he just let his religion and incredulity get in the way when it comes to descent and evolution.\n \n Dembski isn't a scientist- he is a mathematian/theologian, and nor is Phillip E. Johnson, a Professor of Law.\n\n \n Are there not also many very talented and able scientests who let their personal atheism (and livelihood) get in the way when it comes to ID?", 
   {}, 
   178237, 
   null, 
   1131589320.0
  ], 
  [
   178240, 
   null, 
   "OccamsRazor", 
   "Are there not also many very talented and able scientests who let their personal atheism (and livelihood) get in the way when it comes to ID?\n\n \n No, as there are plenty of evolutionists who believe in God- its not a matter of religious outlook but the ability to discern the best model to explain the evidence to hand.", 
   {}, 
   178238, 
   null, 
   1131589560.0
  ], 
  [
   178246, 
   null, 
   "Howard Beale", 
   "Check this site;\n \n http://www.discovery.org/csc/aboutCSC.php\n \n \n \n A few notable names there are Micheal Behe, William Dembski, and Phillip Johnson. They may not fit your definition of \"scientests\", but they have some interesting things to say.\nI know the site well. Name the scientist who fits the parameters of my post. There isn't one, even on the Discovery.org site. As far as the ones you name:\n \n Micheal Behe acknowledges that Intelligent Design is not a valid scientific theory. He states, \"You can't prove Intelligent Design by experiment\" (TIME Magazine, August 2004). \n \n Phillip Johnson never claims and has never demonstrated that Intelligent Design is a viable scientific theory. In fact, he was very clear that the subject is a religious one, not a scientific one.\n \n William Dembski, in his book Signs of Intelligence, says that ID is not a scientific theory, it is a research project. \n \n Please give me a specific source (website or publication) where a scientist claims and then demonstrates (backed up his scientific data) that ID is a viable scientific theory. A name and a source. There aren't any.", 
   {
    "unicode_changes_made": true
   }, 
   178232, 
   null, 
   1131590160.0
  ], 
  [
   178247, 
   null, 
   "marc9000", 
   "No, as there are plenty of evolutionists who believe in God- its not a matter of religious outlook but the ability to discern the best model to explain the evidence to hand.\n\n \n There are actually plenty of both. The most vocal and often most politically influential are the ones who are closed minded about their atheism. The \"talk origins\" web site is loaded with them.", 
   {}, 
   178240, 
   null, 
   1131591000.0
  ], 
  [
   178248, 
   null, 
   "marc9000", 
   "I know the site well. Name the scientist who fits the parameters of my post. There isn't one, even on the Discovery.org site.\n\n \n The site in general fits the parameters of your post, with this statement;\n \n \n\u0095 supports research by scientists and other scholars developing the scientific theory known as intelligent design;\n\n \n Do you have some special definition of the word \"scientest\"?", 
   {}, 
   178246, 
   null, 
   1131591240.0
  ], 
  [
   178250, 
   null, 
   "Howard Beale", 
   "Marc9000:\n \n I edited my post to address the names you gave in response to someone else. As far as your quote from Dicovery.org:\n \n \nsupports research by scientists and other scholars developing the scientific theory known as intelligent design; \nThe quote practically says that ID in not a valid scientific theory. They are \"developing the scientific theory\". A lot of people are \"developing\" scientific theories. Until they are scientific theories, they don't get taught in science class. That is what I am saying.", 
   {}, 
   178248, 
   null, 
   1131591720.0
  ], 
  [
   178253, 
   null, 
   "marc9000", 
   "Marc9000:\n \n I edited my post to address the names you gave in response to someone else. As far as your quote from Dicovery.org:\n \n The quote practically says that ID in not a valid scientific theory. They are \"developing the scientific theory\". A lot of people are \"developing\" scientific theories. Until they are scientific theories, they don't get taught in science class. That is what I am saying.\n\n \n Who proclaimed that Darwinism is an unquestionable scientific theory? Can you name one scientest who can fill all the gaps in Darwinism that Phillip Johnson exposes right here? \n \n http://www.arn.org/docs/johnson/pjdogma1.htm\n \n I know you can link me to many who have tried, but did they succeed 100%?", 
   {}, 
   178250, 
   null, 
   1131592680.0
  ], 
  [
   178259, 
   null, 
   "electrolyte", 
   "In addition there is not one scientist, ID proponent or otherwise, who has shown ID to be a valid scientific theory.\nThe site in general fits the parameters of your post, with this statement;\n \n \n\u0095 supports research by scientists and other scholars developing the scientific theory known as intelligent design;\n\n\n \n Somebody saying \"I'm a scientist, and I claim that ID is a scientific theory,\" even if that person really is a scientist, is a far cry from showing ID to be a valid scientific theory. You have not refuted Howard's statement.\n \n \nWho proclaimed that Darwinism is an unquestionable scientific theory?\nYou're the first in this thread to use the word \"unquestionable.\"\n This statement makes me think you don't understand how science works. But surely you do, right? You can question evolutionary theory all you want, but you won't manage to overturn it.", 
   {}, 
   178253, 
   null, 
   1131594360.0
  ], 
  [
   178268, 
   null, 
   "Howard Beale", 
   "Who proclaimed that Darwinism is an unquestionable scientific theory? Can you name one scientest who can fill all the gaps in Darwinism that Phillip Johnson exposes right here? \n Darwin's Theory of Evolution is a scientific theory, not a fact. ID is a belief not a scientific theory. \n \n If you are seriously asking for scientists who have claimed and demonstrated that evolition is a valid scientific theory, the first publication I suggest you read is the first scientist I suggest Darwin's writings: The Voyage of the Beagle, The Origin of the Species and The Descent of Man. Here is a website where they are published.\n \n http://www.infidels.org/library/historical/charles_darwin/", 
   {
    "unicode_changes_made": true
   }, 
   178253, 
   null, 
   1131596820.0
  ], 
  [
   178269, 
   null, 
   "marc9000", 
   "Somebody saying \"I'm a scientist, and I claim that ID is a scientific theory,\" even if that person really is a scientist, is a far cry from showing ID to be a valid scientific theory. You have not refuted Howard's statement.\n\n \n Equally, somebody saying \"I'm a scientest, and I claim Darwinism is a scientific theory,\" even if that person really is a scientest, is a far cry from that person showing Darwinism to be a valid scientific theory, considering all the gaps Phillip Johnson clearly points out.\n \n \n \nYou're the first in this thread to use the word \"unquestionable.\"\n This statement makes me think you don't understand how science works. But surely you do, right? You can question evolutionary theory all you want, but you won't manage to overturn it.\n\n \n And you can promote the evolutionary theory all you want, but you won't mangage to prove it. But you don't have to, and here's why;\n \n Johnson\n \nThere are no scientific points in favor of creation and there never will be any as long as naturalists control the definition of science, because creationist explanations by definition violate the fundamental commitment of science to naturalism. When the fossil record does not provide the evidence that naturalism would like to see, it is the fossil record, and not the naturalistic explanation, that is judged to be inadequate.\n", 
   {}, 
   178259, 
   null, 
   1131597180.0
  ], 
  [
   178271, 
   null, 
   "marc9000", 
   "Darwin's Theory of Evolution is a scientific theory, not a fact. ID is a belief not a scientific theory. \n\n \n The \"discovery.org\" site that you claim to know so well doesn't agree with you. It's your choice not to believe it, if you aren't open minded.\n \n \nIf you are seriously asking for scientists who have claimed and demonstrated that evolition is a valid scientific theory, the first publication I suggest you read is the first scientist I suggest Darwin's writings: The Voyage of the Beagle, The Origin of the Species and The Descent of Man. Here is a website where they are published.\n \n http://www.infidels.org/library/historical/charles_darwin/\n\n \n They are BADLY outdated. Science has since discovered countless things that Darwin couldn't possibly have known about.", 
   {
    "unicode_changes_made": true
   }, 
   178268, 
   null, 
   1131597600.0
  ], 
  [
   178274, 
   null, 
   "Howard Beale", 
   "The \"discovery.org\" site that you claim to know so well doesn't agree with you. It's your choice not to believe it, if you aren't open minded.\n \n They are BADLY outdated. Science has since discovered countless things that Darwin couldn't possibly have known about.\nNow you&#8217;re dancing around. You still cannot give me the name of a single scientist who has published a work that has shown ID to be a valid scientific theory. Dance all you want. No one has done it. I can name 20 scientists who have published works that show (through their personal research) that evolution is a valid scientific theory.", 
   {}, 
   178271, 
   null, 
   1131598020.0
  ], 
  [
   178277, 
   null, 
   "marc9000", 
   "Now you're dancing around. You still cannot give me the name of a single scientist who has published a work that has shown ID to be a valid scientific theory. Dance all you want. No one has done it. I can name 20 scientists who have published works that show (through their personal research) that evolution is a valid scientific theory.\n\n \n Here's the reason;\n \n \nThere are no scientific points in favor of creation and there never will be any as long as naturalists control the definition of science, because creationist explanations by definition violate the fundamental commitment of science to naturalism. When the fossil record does not provide the evidence that naturalism would like to see, it is the fossil record, and not the naturalistic explanation, that is judged to be inadequate.\n\n \n And it will stay that way as long as taxpayers unwittingly continue to fund today's universities the way they do, and the way a minority of contributors continue to fund the ACLU the way they do.", 
   {
    "unicode_changes_made": true
   }, 
   178274, 
   null, 
   1131598440.0
  ], 
  [
   178279, 
   null, 
   "Howard Beale", 
   "Marc9000:\n \n \nThere are no scientific points in favor of creation and there never will be any as long as naturalists control the definition of science, because creationist explanations by definition violate the fundamental commitment of science to naturalism\"\nReally? Support the statement that \"naturalists control the definition of science\". Give me statistics. You can't because the statement is just whinning.", 
   {
    "unicode_changes_made": true
   }, 
   178277, 
   null, 
   1131598680.0
  ], 
  [
   178291, 
   null, 
   "electrolyte", 
   "Equally, somebody saying \"I'm a scientest, and I claim Darwinism is a scientific theory,\" even if that person really is a scientest, is a far cry from that person showing Darwinism to be a valid scientific theory, considering all the gaps Phillip Johnson clearly points out.\n\n You claimed that you refuted Howard Beale's point. I showed that you did not.\n Einstein, Podolsky, and Rosen pointed out a \"gap\" in our understanding of quantum mechanics. Does that mean that quantum theory isn't a scientific theory? No; it just means that quantum theory is not a complete theory. Likewise, it doesn't mean that the information we have now (e.g., wave-particle duality, Heisenberg's uncertainty principle) is either worthless or false.\n \n \n \nAnd you can promote the evolutionary theory all you want, but you won't mangage to prove it.\n\n So you really don't understand science... Science doesn't \"prove\" theories. When you're through reading this post, go learn something about science.\n By the way: way to dodge. Pretty neat how you can be busted for misrepresenting others (and science) and not give it a second thought.\n \n \n \nJohnson:\n There are no scientific points in favor of creation and there never will be any as long as naturalists control the definition of science, because creationist explanations by definition violate the fundamental commitment of science to naturalism. [emphasis added by Electrolyte]\n\n\n Ahh, I love this one. The whole Conspiracy Theory idea. We never walked on the moon, the Holocaust never took place, Elvis is alive and living in a trailer in Montana, and theistic evolutionists fabricate data to disprove the god in which they believe. Need I say more?\n By the part of the quote that I bolded, we can see that Johnson apparently acknowledges that none of the so-called \"evidence\" stands up to \"naturalistic\" reasoning, a method that has produced the greatest advancement in learning in the history of the planet.\n \n \n \nThomas Jefferson:\n \"Fix reason firmly in her seat, and call to her tribunal every fact, every opinion. Question with boldness even the existence of a God; because, if there be one, he must more approve of the homage of reason, than that of blindfolded fear.\"\nGalileo:\n \"I do not feel obliged to believe that the same God who has endowed us with sense, reason, and intellect has intended us to forgo their use.\"\nTwo great quotes from two very smart people who recognized the value of reason ... and felt that God would do the same.\n \n \n \nThey are BADLY outdated. Science has since discovered countless things that Darwin couldn't possibly have known about.\n\n Darwin didn't know about genetics. Did the (re-)discovery of genetics invalidate evolutionary theory? Quite the contrary. Your statement is meaningless except as a concession of the point Howard made. Even Darwin's \"BADLY outdated\" works show that evolutionary theory is legitimately scientific.", 
   {}, 
   178279, 
   null, 
   1131606120.0
  ], 
  [
   178347, 
   null, 
   "OccamsRazor", 
   "There are actually plenty of both. The most vocal and often most politically influential are the ones who are closed minded about their atheism. The \"talk origins\" web site is loaded with them.\n\n \n What on earth do you mean by \"closed minded about their atheism\"?", 
   {}, 
   178247, 
   null, 
   1131645900.0
  ], 
  [
   178350, 
   null, 
   "pandion", 
   "They are BADLY outdated. Science has since discovered countless things that Darwin couldn't possibly have known about.\nBut the suggestion was that you read Darwin as an example of a scientist who had demonstrated that evolution is a valid scientific theory. It is true that Darwin's writings are mostly of historical interest. But they are outdated because they have been followed by 150 years of supporting science. Darwin has been shown to have been mostly right, and even the things that Darwin couldn't possibly have known about have shown that he was right (genetics has been pointed out, and molecular biology can be added, as well as population genetics, ecology, etc.)\n \n By the way, your claim that they are outdated implies that you have actually read them. Otherwise how would you know? To repeat what someone else told you would just be you being a parrot (again), and you should state who told you that they were outdated.\n \n But I think you are not really interested in learning, otherwise you would have already made an effort. The information is so easily available that to be unaware of even the basics and yet argue against them shows a lack of integrity. You oppose evolutionary theory because you think that it challenges your primitive faith.\n \n If you really want to learn, then try the library or a bookstore. For explanations of evolutionary theory you might look for the following:\n \n Dawkins, Richard. 1995. River Out of Eden: A Darwinian View of Life. Basic Books, a division of Harper Collins, New York.\n \n Maynard Smith, John. 1997. The Theory of Evolution. Cambridge University Press, Cambridge.\n \n Jones, Steve. 2000, Darwin's Ghost: The Origin of Species Updated. Random House. New York.\n \n Futuyma, Douglas J. 1995 Science on Trial: The Case For Evolution. Sinauer Associates, Inc, Sunderland, MA\n \n Gould, Stephen Jay. 2002. The Structure of Evolutionary Theory. The Belknap Press of the Harvard University Press. Cambridge, MA\n \n The first is a small book, very basic. Uncharacteristic of Dawkins. The last is huge, but you will at least have some idea of what evolutionary theory is. Darwin's Ghost presents Darwin's theories in the order that Darwin did using modern examples. If you read the book it will become very clear that even though Darwin's book may be \"dated,\" his ideas aren't.\n \n There you go. Have fun learning something.", 
   {}, 
   178271, 
   null, 
   1131647160.0
  ], 
  [
   178493, 
   null, 
   "marc9000", 
   "Marc9000:\n \n Really? Support the statement that \"naturalists control the definition of science\". Give me statistics. You can't because the statement is just whinning.\n\n \n I support it with this one paragraph - thoughts from a Darwinist that are honest enough to not be tainted with personal desire to sway the opinion of the reader. \n \n Quote:Richard Lewontin\n \nOur willingness to accept scientific claims that are against common sense is the key to an understanding of the real struggle between science and the supernatural. We take the side of science in spite of the patent absurdity of some of its constructs, in spite of its failure to fulfill many of its extravagant promises of health and life, in spite of the tolerance of the scientific community for unsubstantiated just-so stories, because we have a prior commitment, a commitment to materialism. It is not that the methods and institutions of science somehow compel us to accept a material explanation of the phenomenal world, but, on the contrary, that we are forced by our a priori adherence to material causes to create an apparatus of investigation and a set of concepts that produce material explanations, no matter how counter-intuitive, no matter how mystifying to the uninitiated. Moreover, that materialism is absolute, for we cannot allow a Divine Foot in the door. \n\n \n You have a hard time finding a \"scientest\" who considers ID a valid scientific theory, and I have an equally hard time finding anyone who can logically prove the above paragraph wrong.", 
   {
    "unicode_changes_made": true
   }, 
   178279, 
   null, 
   1131678780.0
  ], 
  [
   178499, 
   null, 
   "marc9000", 
   "You claimed that you refuted Howard Beale's point. I showed that you did not.\n Einstein, Podolsky, and Rosen pointed out a \"gap\" in our understanding of quantum mechanics. Does that mean that quantum theory isn't a scientific theory? No; it just means that quantum theory is not a complete theory. Likewise, it doesn't mean that the information we have now (e.g., wave-particle duality, Heisenberg's uncertainty principle) is either worthless or false.\n \n \n \n So you really don't understand science... Science doesn't \"prove\" theories. When you're through reading this post, go learn something about science.\n\n \n OK, I just did. Combined with my experience with human nature, and what history I know, the Lewontin paragraph above tells me all I need to know to make personal and political decisions.\n \n \n \n \nAhh, I love this one. The whole Conspiracy Theory idea. We never walked on the moon, the Holocaust never took place, Elvis is alive and living in a trailer in Montana, and theistic evolutionists fabricate data to disprove the god in which they believe. Need I say more?\n By the part of the quote that I bolded, we can see that Johnson apparently acknowledges that none of the so-called \"evidence\" stands up to \"naturalistic\" reasoning, a method that has produced the greatest advancement in learning in the history of the planet. \n\n \n That type of learning comes up short in providing us with answers for our many non-material questions - personal and political questions.\n \n \n \n \nDarwin didn't know about genetics. Did the (re-)discovery of genetics invalidate evolutionary theory? Quite the contrary. Your statement is meaningless except as a concession of the point Howard made. Even Darwin's \"BADLY outdated\" works show that evolutionary theory is legitimately scientific.\n\n \n Darwin didn't know about a lot of things. Here's a thought from another atheist, microbiologist Micheal Denton, who lived after Darwin;\n \n \n The complexity of the simplest known type of cell is so great that it is impossible to accept that such an object could have been thrown together suddenly by some kind of freakish, vastly improbable event. Such an occurrence would be indistinguishable from a miracle. \n", 
   {}, 
   178291, 
   null, 
   1131679920.0
  ], 
  [
   178502, 
   null, 
   "marc9000", 
   "What on earth do you mean by \"closed minded about their atheism\"?\n\n \n Those who \"refuse to allow a divine foot in the door\". Those who discard any scientific evidence that corresponds with the Bible. Those who BEGIN with the belief that there is no God - a predetermined conclusion that their research must lead to.", 
   {}, 
   178347, 
   null, 
   1131680340.0
  ], 
  [
   178508, 
   null, 
   "pandion", 
   "Those who discard any scientific evidence that corresponds with the Bible.\nDo you have any scientific evidence that corresponds with the Bible.\n \n By the way, you do know that your statement is backwards. In science, one does not seek evidence to support or \"correspond\" with a point of view, even if it is mythology. The theories are build on the evidence.", 
   {}, 
   178502, 
   null, 
   1131681180.0
  ], 
  [
   178511, 
   null, 
   "marc9000", 
   "But the suggestion was that you read Darwin as an example of a scientist who had demonstrated that evolution is a valid scientific theory. It is true that Darwin's writings are mostly of historical interest. But they are outdated because they have been followed by 150 years of supporting science. Darwin has been shown to have been mostly right, and even the things that Darwin couldn't possibly have known about have shown that he was right (genetics has been pointed out, and molecular biology can be added, as well as population genetics, ecology, etc.)\n \n By the way, your claim that they are outdated implies that you have actually read them. Otherwise how would you know? To repeat what someone else told you would just be you being a parrot (again), and you should state who told you that they were outdated. \n\n \n You're not a parrot of Darwin? I'll be glad to state (one of several) who told me they were outdated. \n \n Cornelius G. Hunter\n \n Today we have far more evidence than in Darwin's day, but the situation has not changed. Evolutionists like to say there is a convergence of evidence and the weight of all this evidence taken together makes evolution the unavoidable conclusion. The convergence, however, lies not with the evidence but rather with it's religious interpretation. I discovered this when I surveyed the evolution literature and assembled all the evidence and arguments used to promote evolution. The arguments for evolution inevitably and consistently rely on an underlying conception of God........It would be far more accurate to view Darwinian evolution as a religious theory that has penetrated natural science rather than as a scientific theory that impinges on our religious understandings. In purporting to keep science free from religion, evolution foists religion on science and thereby subverts the very integrity of science. Instead of fostering science, it constitutes the greatest threat modern science has ever faced. Evolutionists have consistently promoted their theory as an objective conclusion based on a purely scientific analysis of the data. This is simply inaccurate. Evolution is an unlikely story fueled by theological presuppositions and religious sentiment, not scientific reasoning. \n\n \n \nBut I think you are not really interested in learning, otherwise you would have already made an effort. The information is so easily available that to be unaware of even the basics and yet argue against them shows a lack of integrity. You oppose evolutionary theory because you think that it challenges your primitive faith.\n\n \n Hunter's works are easily available - are you unaware of them? Do they challange your primitive Darwinian faith? \n \n \nIf you really want to learn, then try the library or a bookstore. For explanations of evolutionary theory you might look for the following:\n \n Dawkins, Richard. 1995. River Out of Eden: A Darwinian View of Life. Basic Books, a division of Harper Collins, New York.\n \n Maynard Smith, John. 1997. The Theory of Evolution. Cambridge University Press, Cambridge.\n \n Jones, Steve. 2000, Darwin's Ghost: The Origin of Species Updated. Random House. New York.\n \n Futuyma, Douglas J. 1995 Science on Trial: The Case For Evolution. Sinauer Associates, Inc, Sunderland, MA\n \n Gould, Stephen Jay. 2002. The Structure of Evolutionary Theory. The Belknap Press of the Harvard University Press. Cambridge, MA\n \n The first is a small book, very basic. Uncharacteristic of Dawkins. The last is huge, but you will at least have some idea of what evolutionary theory is. Darwin's Ghost presents Darwin's theories in the order that Darwin did using modern examples. If you read the book it will become very clear that even though Darwin's book may be \"dated,\" his ideas aren't.\n \n There you go. Have fun learning something.\n\n \n I prefer to have somebody like Hunter do all the work and condense it all into one or two paragraphs for me. The same way you let others condense the Bible for you.", 
   {}, 
   178350, 
   null, 
   1131681660.0
  ], 
  [
   178512, 
   null, 
   "Howard Beale", 
   "I support it with this one paragraph - thoughts from a Darwinist that are honest enough to not be tainted with personal desire to sway the opinion of the reader. \n \n Quote:Richard Lewontin\n \n \n You have a hard time finding a \"scientest\" who considers ID a valid scientific theory, and I have an equally hard time finding anyone who can logically prove the above paragraph wrong.\nMr. Lewontin is allowed his opinion. An opinion is not a scientific theory either. You have not named a scientists and you have not given me any factual evidence to support the statement that \"naturalists control the definition of science\". \n \n You do admit that you can't name a scientist that can't find a scientist who considers ID a valid scientific theory. In that case, the question becomes \"Do we teaching things that are not valid scientific theories in a science class?'' Do you think we do?", 
   {
    "unicode_changes_made": true
   }, 
   178493, 
   null, 
   1131681780.0
  ], 
  [
   178513, 
   null, 
   "marc9000", 
   "Do you have any scientific evidence that corresponds with the Bible. \n\n \n http://www.christiananswers.net/archaeology/home.html#general\n \n \nBy the way, you do know that your statement is backwards. In science, one does not seek evidence to support or \"correspond\" with a point of view, even if it is mythology. The theories are build on the evidence.\n \n \n Theories are often built on OTHER THEORIES. emoticon_idea", 
   {}, 
   178508, 
   null, 
   1131681960.0
  ], 
  [
   178514, 
   null, 
   "Belfrey", 
   "Those who \"refuse to allow a divine foot in the door\". Those who discard any scientific evidence that corresponds with the Bible. Those who BEGIN with the belief that there is no God - a predetermined conclusion that their research must lead to.\n\n This is an obvious appeal to authority, and ignores the many scientists (and others) who are both devoutly religious and accept evolution as the best explanation for what is observed.\n \n Moreover, materialism doesn't necessarily exclude the divine. If scientists were to encounter some material evidence supporting the existence of the divine, it could then be fit into our paradigm. Until then, it is illogical to use it as a mechanism.", 
   {}, 
   178502, 
   null, 
   1131682020.0
  ], 
  [
   178515, 
   null, 
   "Terran", 
   "the Lewontin paragraph above tells me all I need to know to make personal and political decisions.\n\n Well, good to know you consider all the evidence before making a decision\n emoticon_rolleyes \n By the way, do you know where that quote is from? Thought not. Here's another quote from the same essay:\n \nThe primary problem is not to provide the public with the knowledge of how far it is to the nearest star and what genes are made of, for that vast project is, in its entirety, hopeless. Rather, the problem is to get them to reject irrational and supernatural explanations of the world, the demons that exist only in their imaginations, and to accept a social and intellectual apparatus, Science, as the only begetter of truth. The reason that people do not have a correct view of nature is not that they are ignorant of this or that fact about the material world, but that they look to the wrong sources in their attempt to understand. It is not simply, as Sherlock Holmes thought, that the brain is like an empty attic with limited storage capacity, so that the accumulated clutter of false or useless bits of knowledge must be cleared out in a grand intellectual tag sale to make space for more useful objects. It is that most people's mental houses have been furnished according to an appallingly bad model of taste and they need to start consulting the home furnishing supplement of the Sunday New York Times in place of the stage set of The Honeymooners.\n\n from NY Times Book Review by Lewontin on \"The Demon-Haunted World: Science as a Candle in the Dark \" by Carl Sagan\n Hmm, I don't think he's saying what you think he's saying...\n \n \nHere's a thought from another atheist, microbiologist Micheal Denton, who lived after Darwin;\n \n Quote:\n The complexity of the simplest known type of cell is so great that it is impossible to accept that such an object could have been thrown together suddenly by some kind of freakish, vastly improbable event. Such an occurrence would be indistinguishable from a miracle.\n\n That's a great quote! It's an even better scarecrow though ;) Find me one scientist (besides a \"creation scientist\") who actually believes that cells came about in such a manner. Go ahead, I'll wait...\n \n \nThose who discard any scientific evidence that corresponds with the Bible.\n\n Sorry Sparky, you're a little mixed up there. See, the problem your sort has with them is they refuse to discard evidence that doesn't correspond to the bible.\n \n And why do creationists always come around to the ACLU withing 3-5 posts? Is it a rule? Is there a charter I haven't read?\n \n P.S.-It's \"scientist\", not \"scientest", 
   {}, 
   178502, 
   null, 
   1131682260.0
  ], 
  [
   178516, 
   null, 
   "marc9000", 
   "Mr. Lewontin is allowed his opinion. An opinion is not a scientific theory either. You have not named a scientists and you have not given me any factual evidence to support the statement that \"naturalists control the definition of science\". \n \n You do admit that you can't name a scientist that can't find a scientist who considers ID a valid scientific theory. In that case, the question becomes \"Do we teaching things that are not valid scientific theories in a science class?'' Do you think we do?\n\n \n No, I don't admit it - I don't know what your definition of \"scientest\" is. Dictionary.com defines one like this;\n \n \nSCIENTEST: A person having expert knowledge of one or more sciences, especially a natural or physical science.\n\n \n I guess I need your opinion of what \"expert knowledge\" is. Does your \"scientest\" have to be on the public payroll? Does Micheal Behe not fit the bill for you?\n \n Many PEOPLE consider ID to be a valid scientific theory. Why is that not good enough for you? Must we have only the intelligensia make our decisions for us? How familiar are you with the US Constitution?", 
   {
    "unicode_changes_made": true
   }, 
   178512, 
   null, 
   1131682560.0
  ], 
  [
   178517, 
   null, 
   "Terran", 
   "\n Hunter's works are easily available - are you unaware of them? Do they challange your primitive Darwinian faith? \n\n Oh, we're back to the old fall back position already? \"When all else fails, call evolution religion! If we can't beat them, we can at least drag them down to our level!\"\n please...\n \n \nTheories are often built on OTHER THEORIES. \n\n Look out guys! Here it comes! Did you know evolution is based on reincarnation as believed by Hindus? Did you know that the ancient Greeks believed in Evilution as part of their pagan faith? No? That's because it's untrue, but that won't stop Marc9000!\n \n \n \nQuote:\n Originally Posted by pandion\n Do you have any scientific evidence that corresponds with the Bible.\n \n http://www.christiananswers.net/arch...e.html#general\n\n Ever read \"The Fionovar Tapestry\" by Guy Gavriel Kay? Wonderful set of books. True story too. Oh yeah, it is! I know, I know, hard to believe, what with the dimension jumping, the gods taking avatars, the magic, the monsters, but it is a true story. How do I know? Well, it begins in the University of Toronto, and we all know that's a real place, right? Then, it moves on to a well known hotel in Toronto, one we could all go visit right now if we wanted. So, if the UofT is real, and the hotel is real, the rest of the book is factual as well!\n \n PS-ever read The Illiad? Troy's a real place. Guess that means all the Greek gods and demigods are real as well, right?", 
   {}, 
   178515, 
   null, 
   1131682860.0
  ], 
  [
   178520, 
   null, 
   "marc9000", 
   "And why do creationists always come around to the ACLU withing 3-5 posts? Is it a rule? Is there a charter I haven't read? \n\n \n There may be a lot you haven't read about the ACLU.\n \n *They are better funded, and more politically influential, than any religious organization. \n \n *Their founders, and officers, have almost NOTHING in common with the philosophy of the founders of the U.S. \n \n I could go on about the ACLU, but it's getting late. Congratulations Terran, you're the sixth - that seems to be a pretty standard ratio at these forums; six atheists vs. one creationist. I have to work for a living - I probably won't have time for it all. But it's an accomplishment to be properly ganged up on.\n \n P.S. I'll work on my spelling just for you.", 
   {}, 
   178515, 
   null, 
   1131683460.0
  ], 
  [
   178522, 
   null, 
   "Howard Beale", 
   "No, I don't admit it - I don't know what your definition of \"scientest\" is. Dictionary.com defines one like this;\n \n \n \n I guess I need your opinion of what \"expert knowledge\" is. Does your \"scientest\" have to be on the public payroll? Does Micheal Behe not fit the bill for you?\n \n Many PEOPLE consider ID to be a valid scientific theory. Why is that not good enough for you? Must we have only the intelligensia make our decisions for us? How familiar are you with the US Constitution?\nMy daughter and all her friends considered it a fact that Santa came down the chimney. Should we teach that in science class too? You're just dancing as fast as you can because you can't name one scientist who has demonstrated that ID is a valid scientific theory.\n \n As far as Micheal Behe, he acknowledges that Intelligent Design is not a valid scientific theory. He states, \"You can't prove Intelligent Design by experiment\". A valid scientific theory has to be demonstraated through experimentation.", 
   {
    "unicode_changes_made": true
   }, 
   178516, 
   null, 
   1131683760.0
  ], 
  [
   178524, 
   null, 
   "DamEtel", 
   "marc9000: Here's a thought from another atheist, microbiologist Micheal Denton, who lived after Darwin\n \n\n \n Who the hell are you trying to fool? Michael Denton an atheist?\n \n Michael Denton wrote a hardcore anti-evolution book in 1985 called \"Evolution: A Theory in Crisis\". And in 1998 he followed up with \"Nature's Destiny: How the Laws of Biology Reveal Purpose in the Universe\": a book supporting a form of deism.\n \n \n\"In August 1998, Denton's eagerly-awaited second book arrived: Nature's Destiny: How the Laws of Biology Reveal Purpose in the Universe. ... In [the place of his main arguments from his earlier book] was an unstinting advocacy of common descent, and a notion of \"directed evolution\" in which the historical unfolding of life on earth was \"built into\" the universe from the start.\n \n Denton's new ideas appeared under the banner of design. Moreover, he is a member of the editorial board of [ARN's] Origins & Design and has interacted extensively with intelligent design theorists at conferences and in correspondence.\" (A Roundtable On Nature's Destiny, Origins & Design, Issue 37 Vol 19 No. 2, Winter 1999) \n\n \n So depending upon the date of your quote, you have either a hardcore anti-evolutionist or a deist-design proponent. Hardly what one would gather from your misleading label of Denton.", 
   {}, 
   178499, 
   null, 
   1131684180.0
  ], 
  [
   178525, 
   null, 
   "DamEtel", 
   "marc9000: There may be a lot you haven't read about the ACLU.\n \n *They are better funded, and more politically influential, than any religious organization. \n\n \n Uhm, are the ACLU's holding worth more than the Catholic Church? Nope. \n \n Does the ACLU own more real estate than the Catholic Church - or any other major Christian denomination? Nope.\n \n Is there an ACLUist in the White House, or a religious person? Are there more ACLU people in Congress or religious people? \n \n Oh, and as a side note, if hundreds of members of the ACLU were known to be guilty of raping and molesting young boys, do you really believe that they would hide this from everyone and simply transfer the offenders, like the Catholic Church did?", 
   {}, 
   178520, 
   null, 
   1131684720.0
  ], 
  [
   178528, 
   null, 
   "Terran", 
   "Congratulations Terran, you're the sixth - that seems to be a pretty standard ratio at these forums; six atheists vs. one creationist.\n\n I like how you automatically assume anyone who disagrees with you is an atheist. Of course, if they were True Believers(TM), then they wouldn't disagree with you, right? Yeesh...\n \n \n\n I have to work for a living - I probably won't have time for it all.\n\n I really like the sly implication that all of us who try and educate ourselves must be unemployed. Surely no one would hire us atheistic evilutionists, right?\n \n \nBut it's an accomplishment to be properly ganged up on.\n\n Glad I could make you feel important\n \n \nP.S. I'll work on my spelling just for you.\n\n The odd spelling mistake is understandable, but you'd think when someone's trying to tear down the most solid scientific theory around they would at least know how to spell \"scientist\". It's not like it's hard. You even went to dictionary.com to get a definition, and still managed to spell it wrong!", 
   {}, 
   178525, 
   null, 
   1131685500.0
  ], 
  [
   178534, 
   null, 
   "DamEtel", 
   "pandion: Do you have any scientific evidence that corresponds with the Bible. \n \n ******************\n marc9000: http://www.christiananswers.net/arch...e.html#general\n ******************\n \n\n \n Okay, so pandion didn't state his question as clearly as possible. I'll try to improve the question:\n \n Do you have any scientific evidence that actually supports the supernatural aspects of the Bible?\n \n Getting names and places correct means that names and places are correct, not that everything said about those people in those places is true. To make sure you understand this...\n \n \n\n BUSH DECLARES WAR ON TERRA FIRMA\n By BERNIE PYLE\n \n WASHINGTON, D.C.\n In a major expansion of his War on Terror, President Bush is set to declare war on Terra Firma.\n \n \"We were at an international summit meeting discussing the environment over dinner,\" said a top White House aide who demanded anonymity. \"We were stating our usual obstructionist policies when the exasperated representative from South Africa declared, 'If you don't do something to ease global warming, our poor terra firma will retaliate with hurricanes, floods and more tsunamis.'\" \n \n \"Bush went nuts,\" said the aide. \"He shouted, 'If Terra Firma wants a fight, bring it on!' He added, 'No one is firmer in the war on terror than me.'\"\n \n \"I tried to explain to the president that that it wasn't 'terror firmer' but 'terra firma,' which is another name for the whole planet. But Bush just didn't understand. Fortunately, he forgot all about it when they brought ice cream for dessert.\"\n \n According to the aide, this isn't the first time the president has made a mistake of this kind. \"When we were touring New Delhi, for some reason he thought 'terra cotta' was a place where Osama slept.\" Said the aide. \"He wanted to bomb India.\"\n \n (Weekly World News, October 3, 2005, p12)\n \n\n \n \n Look at all of the valid names, places, events, and entities mentioned in this short news report, all of which actually exist here in the year 2005.\n \n 1. Washington, D.C. is an actual town, and sure enough, where the White House is\n 2. President Bush is the current president of the United States of America\n 3. President Bush's campaign again terror is actually called the War on Terror\n 4. the White House is the residence of President Bush\n 5. the White House does employ personnel called White House aides\n 6. South Africa is a real country\n 7. global warming is a relatively newly recognized problem, which Bush is helping accelerate\n 8. New Delhi is an actual city\n 9. New Delhi is actually in India, just as the news report indicates\n 10. Osama [bin Laden] is the terrorist Bush has been after for many years\n \n \n And here's another, even better one! \n \n \n\n TOP PRESIDENTIAL ADVISER IS A RAT - SORT OF\n By PAUL KUPPS\n \n WASHINGTON, D.C.\n Karl Rove, Condoleeza Rice, Dick Cheney, Don Rumsfeld: Familiar names as advisors to President George W. Bush. But the identity of the commander in chief's most senior adviser has been known, until now, by only a select few.\n \n \"The president's most trusted confidant is a mouse!\" confided an anonymous White House source.\n \n The unique relationship was exposed by a security camera in the corridor of a Los Angeles hotel where the president was speaking to a gathering of anti-civil liberties activists.\n \n Weekly World News has obtained a copy of this remarkable footage, starting as the president pauses before entering the ballroom to deliver his speech. He moves to a corner where, behind a screen of Secret Service agents, he takes the little white mouse from his pocket and has a hurried, whispered conversation.\n \n POTUS [President of the United States]: I'm not sure about this speech, Topo.\n \n MOUSE: It's fine, W.\n \n POTUS: It doesn't go far enough -\n \n MOUSE: So, they'll have to give up some buckaroos to get what they want.\n \n POTUS: Oh. They pay to have more say. I get it.\n \n MOUSE: You don't have to. That's what I'm here for.\n \n \"The president likes to call him Topo Gigolo, after the Italian mouse puppet that appeared on the Ed Sullivan Show in the 1960's,\" said the source. \"We know that wasn't the mouse puppet's name but we're afraid to correct him.\"\n \n ...\n \n \"Topo's pretty darned smart for a mouse,\" the source added. \"He's been involved in almost every major political decision of this administration. The one time the president didn't take his advice was on how to conduct the Iraqi war and look how that's turned out\"\n \n ...\n \n (Weekly World News, October 3, 2005, p19)\n \n\n \n Let me simply enumerate the valid names, places, events, etc. mentioned in this new report, which far outnumber those from the first one.\n \n 1. Washington, D.C.\n 2. Karl Rove\n 3. Condoleeza Rice\n 4. Dick Cheney\n 5. Don Rumsfeld\n 6. President George W. Bush. \n 7. commander in chief\n 8. senior adviser\n 9. White House\n 10. Los Angeles\n 11. Weekly World News\n 12. Secret Service agents\n 13. W [the president's nickname]\n 14. the Ed Sullivan Show from the 1960's\n 15. Iraqi war \n \n I love this part: \"... where the president was speaking to a gathering of anti-civil liberties activists.\" ROTFLMAO!!!\n \n Now, with BOTH of these news reports about President Bush being in the very same edition, less than 10 pages apart, we see that this paper is densely packed with historically factual details. Surely, then, everything it says must be true! \n \n So I suppose that in addition to believing that (1) President Bush declared war on Terra Firma, and that (2) his senior adviser is a mouse, you also believe:\n \n (3) Congress passed a bill that would send child abusers not to jail, but straight to hell (page 6)\n \n (4) History professor Ira Lovitch has pajamas that are haunted: they eerily glow at night, button themselves, and run around the room (page 20)\n \n (5) A gypsy curse has turned the entire Supreme Court into bleeding heart liberals (page 20)\n \n (6) a crew in a mini-sub recently rescued 22 survivors from the submerged Titanic, which sank to the bottom of the ocean back in 1912 (page 22)\n \n and so on.", 
   {
    "unicode_changes_made": true
   }, 
   178512, 
   null, 
   1131686820.0
  ], 
  [
   178561, 
   null, 
   "pandion", 
   "You're not a parrot of Darwin?\nNope. I never actually read Darwin until I was in graduate school. I did it them on my own.\n \nI'll be glad to state (one of several) who told me they were outdated.\nTo what purpose. I agreed that they were outdated. After all, we've learned a lot in 150 years. But I know that Darwin's books are outdated because I've read a lot of what he wrote. You don't seem to have the integrity to do so and prefer to parrot others.\n \nCornelius G. Hunter\n \n Hunter's works are easily available - are you unaware of them? Do they challange your primitive Darwinian faith?\nI suspected that you got your information from some religious claptrap. Perhaps if you actually learned what science is and how it works, and then actually learned the basics of evolutionary theory before you spoke, you wouldn't be making yourself look like such a fool. It is stupid to try to make ones religion appear scientific. I'm sorry for Hunter, but most especially for you since you are just a dupe. Hunter and his opinions aren't relevant to evolutionary biology. I'm not aware of anything that he has published in a peer reviewed journal, although I am familiar with the names of many leading evolutionary biologists, paleontologists, paleoanthropologists, and geologists. In checking on Hunter I found that he writes religious books. Fancy that.\n \n To what does \"primitive Darwinian faith\" refer? I have no idea of what that is supposed to mean. There is nothing \"Darwinian\" about my faith and my faith isn't relevant to discussions of biology. Since your's seems to be, I think you are greatly confused. Evolutionary biology is not about faith and it isn't faith.\n \nI prefer to have somebody like Hunter do all the work and condense it all into one or two paragraphs for me. The same way you let others condense the Bible for you.\nLike I said, you lack the integrity to actually read a book before expressing an opinion on it. Instead you allow yourself to be duped by someone who can make money by supplying you with your fix of religion to support your addictive faith.\n \n Who is it that you think has condensed the Bible for me? What does that have to do with the discussion? In fact, I have read the Bible cover to cover once, and other significant parts more than once. For example, I have read the Gospels (all four) in their entirety many times. I have re-read most of the epistles multiple times. Not only that, I have read them in two other languages besides English.\n \n But as an evolutionary biologist (Montana State U. and the U. of Montana) I seem to be having some cognitive dissonance with your reference to the Bible. What does that have to do with a discussion of science? Have you been smoking something you shouldn't?", 
   {}, 
   178511, 
   null, 
   1131692280.0
  ], 
  [
   178585, 
   null, 
   "Matthew S", 
   "The members of the Dover school board that were pushing for ID has been voted out.\n \n http://www.cnn.com/2005/POLITICS/11/09/evolution.intelligentdesign.ap/index.html\n \n I guess everyone hasn't gone mad. :)\n\n \n \n \n Man I guess the christian right is fuming mad over those activist voters now.\n \n Has anyone heard what robertson has to say on the issue?", 
   {}, 
   178158, 
   null, 
   1131712260.0
  ], 
  [
   178593, 
   null, 
   "trebor", 
   "Man I guess the christian right is fuming mad over those activist voters now.\n \n Has anyone heard what robertson has to say on the issue?\n\n \n Yes, he promised gods vengence on the town of dover for abandoning god.", 
   {}, 
   178585, 
   null, 
   1131719400.0
  ], 
  [
   178595, 
   null, 
   "billsco", 
   "And we're to believe ID is science based? Robertson just exposed the hypocrisy of it all. Way to go, Right Reverend.\n \n http://seattlepi.nwsource.com/national/1110AP_Robertson_Evolution.html", 
   {}, 
   178593, 
   null, 
   1131721380.0
  ], 
  [
   178802, 
   null, 
   "OccamsRazor", 
   "And we're to believe ID is science based? Robertson just exposed the hypocrisy of it all. Way to go, Right Reverend.\n \n http://seattlepi.nwsource.com/national/1110AP_Robertson_Evolution.html\n\n \n Yes, you also have to admire his philosophy on this: go against my opinion and physical harm will befall you.\n \n Who needs reason when you can threaten your opponents with death?", 
   {}, 
   178595, 
   null, 
   1131761700.0
  ], 
  [
   178814, 
   null, 
   "marc9000", 
   "Well, good to know you consider all the evidence before making a decision\n emoticon_rolleyes \n By the way, do you know where that quote is from? Thought not. Here's another quote from the same essay: \n\n \n You \"thought not\" a little too quick. I posted it with the link to the essay earlier in another debate here. You missed it. \n \n \nfrom NY Times Book Review by Lewontin on \"The Demon-Haunted World: Science as a Candle in the Dark \" by Carl Sagan\n Hmm, I don't think he's saying what you think he's saying...\n\n \n He said a lot of things in that essay, many were unrelated. What he said in the paragraph I highlighted was that scientific theories can have gaps, just like religious ones. \n \n \n \nThat's a great quote! It's an even better scarecrow though ;) Find me one scientist (besides a \"creation scientist\") who actually believes that cells came about in such a manner. Go ahead, I'll wait...\n\n \n Cells had to come about some way, are there more than two ways? Either by an intelligent designer, or by a \"freakish\" accidental event. What do scientists (you know, the non creation ones - the ones who feed at the public trough) actually believe? They don't know yet, but if we keep filling the trough, they'll try to find out?", 
   {}, 
   178515, 
   null, 
   1131764700.0
  ], 
  [
   178816, 
   null, 
   "marc9000", 
   "My daughter and all her friends considered it a fact that Santa came down the chimney. Should we teach that in science class too? You're just dancing as fast as you can because you can't name one scientist who has demonstrated that ID is a valid scientific theory.\n \n As far as Micheal Behe, he acknowledges that Intelligent Design is not a valid scientific theory. He states, \"You can't prove Intelligent Design by experiment\". A valid scientific theory has to be demonstraated through experimentation.\n\n \n You also can't prove the origin of the first life on earth happened purely by chance. Doesn't that mean all subsequental evolution is also not a valid scientific theory? Why not?", 
   {
    "unicode_changes_made": true
   }, 
   178522, 
   null, 
   1131765120.0
  ], 
  [
   178818, 
   null, 
   "marc9000", 
   "Who the hell are you trying to fool? Michael Denton an atheist?\n \n Michael Denton wrote a hardcore anti-evolution book in 1985 called \"Evolution: A Theory in Crisis\". And in 1998 he followed up with \"Nature's Destiny: How the Laws of Biology Reveal Purpose in the Universe\": a book supporting a form of deism.\n \n \n \n So depending upon the date of your quote, you have either a hardcore anti-evolutionist or a deist-design proponent. Hardly what one would gather from your misleading label of Denton.\n\n \n I really did read somewhere that Michael was an atheist. A quick search turned up this headline;\n \n http://www.freerepublic.com/forum/a382f3b453174.htm\n \n \nAnti-Evolutionst Michael Denton turns into an Evolutionist \n\n \n I guess he's kind of confused about who he is - kind of like your buddy Kenneth Miller. :p", 
   {}, 
   178524, 
   null, 
   1131765480.0
  ], 
  [
   178820, 
   null, 
   "marc9000", 
   "Uhm, are the ACLU's holding worth more than the Catholic Church? Nope. \n \n Does the ACLU own more real estate than the Catholic Church - or any other major Christian denomination? Nope.\n \n Is there an ACLUist in the White House, or a religious person? Are there more ACLU people in Congress or religious people? \n \n Oh, and as a side note, if hundreds of members of the ACLU were known to be guilty of raping and molesting young boys, do you really believe that they would hide this from everyone and simply transfer the offenders, like the Catholic Church did?\n\n \n Holdings and available money for lawsuits are two different things. The ACLU is all about lawsuits and court rulings - usually ones that attack values that are clearly in U.S. traditions, and the philosophy of it's founders.", 
   {}, 
   178525, 
   null, 
   1131765720.0
  ], 
  [
   178821, 
   null, 
   "OccamsRazor", 
   "\n Cells had to come about some way, are there more than two ways? Either by an intelligent designer, or by a \"freakish\" accidental event.\n\n \n I'd doubt there was anything accidental or freakish about the first cells, but am certain no intelligent designer was involved.\n \n If you can't imagine natural events leading to inevitabilities you really need to broaden your thinking.", 
   {}, 
   178814, 
   null, 
   1131766020.0
  ], 
  [
   178822, 
   null, 
   "marc9000", 
   "I like how you automatically assume anyone who disagrees with you is an atheist. Of course, if they were True Believers(TM), then they wouldn't disagree with you, right? Yeesh... \n\n \n It would be nice if those who attack me would actually state their position. But they seldom do. \n \n \n \nI really like the sly implication that all of us who try and educate ourselves must be unemployed. Surely no one would hire us atheistic evilutionists, right? \n\n \n That didn't come out the way I intended. I was tired. I'm in no way attacking others for having more time to post here than I do. Retired, handicapped, students with spare time, those who are able to get a little extra time to post from work - it's all none of my business. What I'm saying is that when six different argument angles come at me all at once, if I try to respond to all of them, it takes me six times as long as it did each individual poster. If I respond to only three or four, and leave out the frivolous ones (did I spell that right?) then it can look like I was stumped by the frivolous ones. Nothing I can do about it. Tends to make a creationist not want to post here. Do you prefer that creationlists not post here? Does it make you nervous?", 
   {}, 
   178528, 
   null, 
   1131766440.0
  ], 
  [
   178823, 
   null, 
   "marc9000", 
   "I'd doubt there was anything accidental or freakish about the first cells, but am certain no intelligent designer was involved.\n \n If you can't imagine natural events leading to inevitabilities you really need to broaden your thinking.\n\n \n \"Natural events leading to inevitabilities\"?? Isn't that a fancy phrase for \"accidental\"? The complexities of life are \"inevitable\"?", 
   {}, 
   178821, 
   null, 
   1131766620.0
  ], 
  [
   178827, 
   null, 
   "marc9000", 
   "Nope. I never actually read Darwin until I was in graduate school. I did it them on my own.\n To what purpose. I agreed that they were outdated. After all, we've learned a lot in 150 years. But I know that Darwin's books are outdated because I've read a lot of what he wrote. You don't seem to have the integrity to do so and prefer to parrot others.\n I suspected that you got your information from some religious claptrap. Perhaps if you actually learned what science is and how it works, and then actually learned the basics of evolutionary theory before you spoke, you wouldn't be making yourself look like such a fool. It is stupid to try to make ones religion appear scientific. I'm sorry for Hunter, but most especially for you since you are just a dupe. Hunter and his opinions aren't relevant to evolutionary biology. I'm not aware of anything that he has published in a peer reviewed journal, although I am familiar with the names of many leading evolutionary biologists, paleontologists, paleoanthropologists, and geologists. In checking on Hunter I found that he writes religious books. Fancy that.\n \n To what does \"primitive Darwinian faith\" refer? I have no idea of what that is supposed to mean. There is nothing \"Darwinian\" about my faith and my faith isn't relevant to discussions of biology. Since your's seems to be, I think you are greatly confused. Evolutionary biology is not about faith and it isn't faith.\n Like I said, you lack the integrity to actually read a book before expressing an opinion on it. Instead you allow yourself to be duped by someone who can make money by supplying you with your fix of religion to support your addictive faith.\n\n \n You're one of several here who won't admit what their position is. If you have no principle, it's hard for me to understand how you can so heartily criticise others who do.\n \n Hunter can say a lot in a few words. The main reason I'm not all that interested in evolutionary biology is because it has to presuppose origins - it can't prove them. The same way Christianity presupposes God. The presuppositions are identical. \n \n \nWho is it that you think has condensed the Bible for me? What does that have to do with the discussion? In fact, I have read the Bible cover to cover once, and other significant parts more than once. For example, I have read the Gospels (all four) in their entirety many times. I have re-read most of the epistles multiple times. Not only that, I have read them in two other languages besides English. \n\n \n That's fascinating. Is it a strange feeling to be in lockstep with those who are completly ignorant of every word in it? Do you feel like you wasted your time by reading it? Do you just not want to believe it - or do you feel like there's proof that it's false? Does Proverbs 3:5,6 offend you? \n \n \nBut as an evolutionary biologist (Montana State U. and the U. of Montana) I seem to be having some cognitive dissonance with your reference to the Bible. What does that have to do with a discussion of science? Have you been smoking something you shouldn't?\n\n \n Science is used by atheists and the ACLU to try to destroy traditional U.S. values. emoticon_idea You haven't noticed?", 
   {}, 
   178561, 
   null, 
   1131767940.0
  ], 
  [
   178834, 
   null, 
   "Terran", 
   "Science is used by atheists and the ACLU to try to destroy traditional U.S. values. You haven't noticed?\n\n Ok, really, is there some sort of flowchart you guys follow? Now we're to the part where you claim America is a nation founded on Christianity, by Christians, and its the fault of evil science and the Atheistic Conspiracy that America is \"decaying\". emoticon_rolleyes \n \n \n\"Natural events leading to inevitabilities\"?? Isn't that a fancy phrase for \"accidental\"? The complexities of life are \"inevitable\"?\n\n Chemical reactions. Read up.\n \n \nIt would be nice if those who attack me would actually state their position. But they seldom do.\n \n\n Then let me clarify it for you: It is disgraceful in the largest sense of the word to ignore facts because they disagree with your beliefs. It is dishonest to lie to protect those same beliefs. It is wrong to try to force your beliefs on those who don't share them. That about covers the basics of my position.\n \n \nDo you prefer that creationlists not post here? Does it make you nervous?\n\n Why would it make me nervous? I don't usually get nervous around those who post disgusting tripe and lies that a child can see are nonsense. I usually get angry and frustrated in those situations, not nervous.\n \n \nThe ACLU is all about lawsuits and court rulings - usually ones that attack values that are clearly in U.S. traditions, and the philosophy of it's founders.\n\n Yeah, I mean, when the founders said that thing about keeping religion and government seperate, they didn't really mean it, right?\n \n \nYou \"thought not\" a little too quick. I posted it with the link to the essay earlier in another debate here. You missed it. \n\n Oops, my mistake, I'm used to people crediting their sources when they use them, not posting a link once and expecting everyone to know about it. Silly me\n \n \nWhat he said in the paragraph I highlighted was that scientific theories can have gaps, just like religious ones. \n\n What he said in the essay as a whole is that science is extremely complex, and one man can't expect to know it all, but that is no reason to turn to silly superstition and ignore the facts. Nice cherry pick BTW\n \n \nare there more than two ways? Either by an intelligent designer, or by a \"freakish\" accidental event.\n\n Or, as Occam said, by natural processes. You don't seem to understand that chemicals react in predictable ways, and that cells weren't \"full-fledged\" in the beginning. For example,most organelles in the cell are thought to be other organisms which were \"absorbed\" by the primitive cell and put to work. It's not a case of \"poof! There's a cell!\", no matter how you try to make that out to be the only possibility. Read up a bit already, will you.\n \n \n Now at least I have an idea of your position. You're an arrogant christian, one of those ones who believes he is better than those who don't share the exact same beliefs as you. You are happy in your ignorance, content to not learn anything that may threaten your beliefs, and ignore those facts that happen to stray your way which may make your faith tremble a little bit. You think that those who believe differently are nothing more than base animals, who think of nothing but their own self preservation and elevation. You've proved that with your \"doctor\" post, and your blissful ignorance shines through in every post. I pity you", 
   {}, 
   178827, 
   null, 
   1131771960.0
  ], 
  [
   178848, 
   null, 
   "electrolyte", 
   "What he said in the paragraph I highlighted was that scientific theories can have gaps, just like religious ones.\n\n No one is disputing that scientific theories can have gaps. They can have gaps and still be valid, useful theories.\n But there is no such thing as a \"religious theory,\" using the word \"theory\" as scientists do.\n \n \nYou also can't prove the origin of the first life on earth happened purely by chance. Doesn't that mean all subsequental evolution is also not a valid scientific theory?\nAre you arguing about the origin of life, or about speciation? The theory of evolution applies to only the latter. [See below.] \n \n \nWhy not?\nIf space aliens put the first cells on Earth, does that mean that those cells didn't/couldn't replicate imperfectly such that they descended with modification? If God put the first cells on earth, does that mean that allelic frequencies couldn't change? No, it doesn't mean that at all.\n Now please, please stop basing arguments on this claim. If my above \"examples\" aren't quite enough to convince you why it follows that the origin of life has no implication on biological evolutionary theory, please let me know and I'll try again or find a link.\n \n \n \nI guess he's kind of confused about who he is - kind of like your buddy Kenneth Miller.\n\n Dr. Miller is a theistic evolutionist. There are thousands and thousands of theistic evolutionists, and they're not \"confused\" at all. They both believe in a god and accept evolutionary theory.\n \n \n \nIt would be nice if those who attack me would actually state their position. But they seldom do.\n\n In some cases, \"personal position\" is irrelevant. For example, you don't need to know if I'm a theistic evolutionist, a creationist, or an atheist in order to analyze and critique the points I make. You argue against the points, not the person or their position. Argument against the person is a logically invalid type of argument.\n \n \n \nHunter can say a lot in a few words. The main reason I'm not all that interested in evolutionary biology is because it has to presuppose origins - it can't prove them.\nWhat presupposition of origins is that? If it's the above issue (origin of life vs. descent with modification), I hope you understand it now.\n \n This last statement implies that you choose not to know much about evolutionary theory. I've already encouraged you to educate yourself on how science works, and you claim you have. I hope you can manage a repeat performance when educating yourself about basic evolutionary theory.\n \n While you're at it, pay special attention to Terran's last direct response to part of your post, which pointed out that chemicals react in predictable ways and that modern cells weren't the first life forms. Those points are particularly crucial when exploring the subject of the origin of life.", 
   {}, 
   178834, 
   null, 
   1131784320.0
  ], 
  [
   178858, 
   null, 
   "Howard Beale", 
   "You also can't prove the origin of the first life on earth happened purely by chance. Doesn't that mean all subsequental evolution is also not a valid scientific theory? Why not?\nBecause evolution is a scientific theory not a fact. Intelligent Design is a belief not a scientific theory.\n \n Your continuing inability to grasp this is mind boggling. It is high school science. You are so obsessed with proving your dogma that the truth and the facts have become your enemies.", 
   {}, 
   178816, 
   null, 
   1131796620.0
  ], 
  [
   178866, 
   null, 
   "trebor", 
   "Because evolution is a scientific theory not a fact. Intelligent Design is a belief not a scientific theory.\n \n Your continuing inability to grasp this is mind boggling. It is high school science. You are so obsessed with proving your dogma that the truth and the facts have become your enemies.\n\n \n \n I have to disagree with you about the statement about evolution. Evolution is both a fact and a theory. It is a fact in that is happens and has been observed as an ongoing process. The model on HOW it happens, and the investigation into what has happened in the past is the theory.", 
   {}, 
   178858, 
   null, 
   1131808560.0
  ], 
  [
   178873, 
   null, 
   "OccamsRazor", 
   "\"Natural events leading to inevitabilities\"?? Isn't that a fancy phrase for \"accidental\"? The complexities of life are \"inevitable\"?\n\n \n Accidental is a bad word in this content because of its connotations from day to day use.\n \n If you were to describe life and evolution as a consequence of circumstances then that would be more fitting. Again, if you cannot get your mind around such a possibility your thinking is too narrow.", 
   {}, 
   178823, 
   null, 
   1131809460.0
  ], 
  [
   178877, 
   null, 
   "Howard Beale", 
   "I have to disagree with you about the statement about evolution. Evolution is both a fact and a theory. It is a fact in that is happens and has been observed as an ongoing process. The model on HOW it happens, and the investigation into what has happened in the past is the theory.\nYou are correct. I could have been more specific. I was trying to point out the difference between a theory and a belief with regard to what is appropriate to be taught in a science class. I did not want to be sidetracked into the \"prove evolution is a fact\" false debate.", 
   {
    "unicode_changes_made": true
   }, 
   178866, 
   null, 
   1131810360.0
  ], 
  [
   178910, 
   null, 
   "DamEtel", 
   "I really did read somewhere that Michael was an atheist. A quick search turned up this headline;\n \n http://www.freerepublic.com/forum/a382f3b453174.htm\n \n \n\n \n And? \n \n First, note the statements made there that support MY side.\n \n \n\"Denton is the first anti-evolutionist and anti-Darwinist I know who uses the FT argument to prove design of the universe.\n\n \n and\n \n \n\"... and [Denton] tries to escape the randomness of the Darwinian evolutionary process by postulating 'directed evolution' (surprise!).\n\n \n and \n \n \n\"Today, Michael Denton is on the editorial board of Origins & Design, an Intelligent Design-oriented journal, along with Michael Behe, Philip Johnson, William Dembski - the whole ID gang basically.\"\n\n \n All in line with what I said, and contradictory to his being an atheist.\n \n Second, the link you provided shows people posting at a discussion forum. If one of them does happen to call Denton an atheist (I don't know, I read only the first 3 or so posts), that doesn't make it true.\n \n DENTON IS NOT AN ATHEIST.\n \n At least not as of his writing of Nature's Destiny. He has come a long way away from his original hardcore anti-evolution position, and maybe, in time, he will follow my footsteps - which he has already begun to do - and go all the way to the most logical position, that of atheism. But no one has shown that he has done so: as of about 1998 he was only part way there and there's no obvious indication that he'll complete the whole trip.\n \n \n \nmarc9000: I guess he's kind of confused about who he is - kind of like your buddy Kenneth Miller. :p\n\n \n Miller believes in God and accepts evolution. Millions of other people do too. Theistic evolutionists don't see God and evolution as necessarily self contradictory. Can you actually show that a person can't accept both without being 'confused'?", 
   {
    "unicode_changes_made": true
   }, 
   178818, 
   null, 
   1131826020.0
  ], 
  [
   178913, 
   null, 
   "DamEtel", 
   "marc9000: The ACLU is all about lawsuits and court rulings - usually ones that attack values that are clearly in U.S. traditions, and the philosophy of it's founders.\n\n \n Only to religious fundamentalists who distort not only science, but all kinds of other facts ... like American history.\n \n Your mind is controlled by religion. You are incapable of actually thinking for yourself: religion taints every thought you have. I feel sorry for you.", 
   {}, 
   178820, 
   null, 
   1131826680.0
  ], 
  [
   178922, 
   null, 
   "trebor", 
   "Only to religious fundamentalists who distort not only science, but all kinds of other facts ... like American history.\n \n Your mind is controlled by religion. You are incapable of actually thinking for yourself: religion taints every thought you have. I feel sorry for you.\n\n \n I disagree. It is not religion that taints his every thought. It is a fundamentalist religion that does.", 
   {}, 
   178913, 
   null, 
   1131829200.0
  ], 
  [
   178965, 
   null, 
   "marc9000", 
   "\n Yeah, I mean, when the founders said that thing about keeping religion and government seperate, they didn't really mean it, right? \n\n \n What \"thing\" was that?? George Washington's proclaimation of a national day of Thanksgiving? Less than two weeks away now. :) \n \n \n \nOops, my mistake, I'm used to people crediting their sources when they use them, not posting a link once and expecting everyone to know about it. Silly me \n\n \n Yes, silly you. My original reference to Lewontin's statement was in my recent formal debate, and you started a thread in reference to it, with your opinion on it. \n \n http://4forums.com/political/showthread.php?t=6701\n \n Now we see that it didn't dawn on you to actually READ IT!! LMAO Thanks for showing your true colors.", 
   {}, 
   178834, 
   null, 
   1131852360.0
  ], 
  [
   178969, 
   null, 
   "marc9000", 
   "No one is disputing that scientific theories can have gaps. They can have gaps and still be valid, useful theories.\n But there is no such thing as a \"religious theory,\" using the word \"theory\" as scientists do.\n \n Are you arguing about the origin of life, or about speciation? The theory of evolution applies to only the latter. [See below.] \n \n If space aliens put the first cells on Earth, does that mean that those cells didn't/couldn't replicate imperfectly such that they descended with modification? If God put the first cells on earth, does that mean that allelic frequencies couldn't change? No, it doesn't mean that at all.\n Now please, please stop basing arguments on this claim. If my above \"examples\" aren't quite enough to convince you why it follows that the origin of life has no implication on biological evolutionary theory, please let me know and I'll try again or find a link. \n\n \n They're not quite enough, because they're always more of the same - changing and rearranging, complicating the actual origins by putting the actual start so distant that it cannot be studied. If you push it back far enough, you seem to think that no explaination is required. \n \n This thread is about what children are being taught in public schools. If all that is being taught is science, then no explaination IS required, provided it stops at that. But it doesn't stop there. When we look at science textbooks, we see that unproven theories can be cleverly presented to appear as if the unknowns of evolution are soon to be uncovered. They're not being taught science, they're being taught scientific philosophy.or naturalism. Science by itself is not a worldview, it's simply a tool. It doesn't address goals, motivations, truthfulness, generosity, love. The secular scientific philosophy IS a worldview, a belief system. It believes that all truth can be found in only in nature. It discards God and the Bible, and is the philosophical underpinning to evolution. It teaches kids that chaos, not predetermined order, is our foundation. Kids simply aren't being shown much difference between the scientific philosophy that they're being taught, and atheism.\n \n \n \n \nDr. Miller is a theistic evolutionist. There are thousands and thousands of theistic evolutionists, and they're not \"confused\" at all. They both believe in a god and accept evolutionary theory. \n\n \n And you embrace them, as long as they disagree with the book of Genesis, right?\n \n \n \n \nIn some cases, \"personal position\" is irrelevant. For example, you don't need to know if I'm a theistic evolutionist, a creationist, or an atheist in order to analyze and critique the points I make. You argue against the points, not the person or their position. Argument against the person is a logically invalid type of argument.\n\n \n In some cases? only if you're an atheist? If it applies to Christians as well, I wish you'd enlighten some of your allies here. The ones who post these things about me;\n \n \nNow at least I have an idea of your position. You're an arrogant christian, one of those ones who believes he is better than those who don't share the exact same beliefs as you. You are happy in your ignorance, content to not learn anything that may threaten your beliefs, and ignore those facts that happen to stray your way which may make your faith tremble a little bit. You think that those who believe differently are nothing more than base animals, who think of nothing but their own self preservation and elevation. You've proved that with your \"doctor\" post, and your blissful ignorance shines through in every post. I pity you \n\n \n I could copy/paste about 10 more from the last few days, but I assume you get the idea. \n \n Those who oppose Christianity here, and take no real position of their own, have the liberty of cleverly drawing from more than one opposing position, using contradictory things to argue against something. It can be very effective, but it's not honest.", 
   {}, 
   178848, 
   null, 
   1131855240.0
  ], 
  [
   178971, 
   null, 
   "marc9000", 
   "Because evolution is a scientific theory not a fact. Intelligent Design is a belief not a scientific theory.\n \n Your continuing inability to grasp this is mind boggling. It is high school science. You are so obsessed with proving your dogma that the truth and the facts have become your enemies.\n\n \n A closed mind is easily boggled. Can you see the difference between science as a tool, and scientific philosophy as a worldview?", 
   {}, 
   178858, 
   null, 
   1131855420.0
  ], 
  [
   178973, 
   null, 
   "trebor", 
   "A closed mind is easily boggled. Can you see the difference between science as a tool, and scientific philosophy as a worldview?\n\n \n WHy, you must have experiance with being boggled.", 
   {}, 
   178971, 
   null, 
   1131855660.0
  ], 
  [
   178975, 
   null, 
   "marc9000", 
   "And? \n \n First, note the statements made there that support MY side.\n \n \n \n and\n \n \n \n and \n \n \n \n All in line with what I said, and contradictory to his being an atheist.\n \n Second, the link you provided shows people posting at a discussion forum. If one of them does happen to call Denton an atheist (I don't know, I read only the first 3 or so posts), that doesn't make it true.\n \n DENTON IS NOT AN ATHEIST.\n \n At least not as of his writing of Nature's Destiny. He has come a long way away from his original hardcore anti-evolution position, and maybe, in time, he will follow my footsteps - which he has already begun to do - and go all the way to the most logical position, that of atheism. But no one has shown that he has done so: as of about 1998 he was only part way there and there's no obvious indication that he'll complete the whole trip.\n \n \n \n \n Miller believes in God and accepts evolution. Millions of other people do too. Theistic evolutionists don't see God and evolution as necessarily self contradictory. Can you actually show that a person can't accept both without being 'confused'?\n\n \n I concede that point - my information was wrong on Denton. So anything he says means nothing now, right? But if Miller believes in God, but not in the creation account of Genesis, Miller's words mean everything?", 
   {}, 
   178910, 
   null, 
   1131855720.0
  ], 
  [
   178976, 
   null, 
   "Howard Beale", 
   "A closed mind is easily boggled. Can you see the difference between science as a tool, and scientific philosophy as a worldview?\nPlease define \"Scientific Philosophy\".", 
   {}, 
   178971, 
   null, 
   1131855960.0
  ], 
  [
   178977, 
   null, 
   "marc9000", 
   "Only to religious fundamentalists who distort not only science, but all kinds of other facts ... like American history.\n \n Your mind is controlled by religion. You are incapable of actually thinking for yourself: religion taints every thought you have. I feel sorry for you.\n\n \n Well don't feel too sorry for me :) if I'm wrong, in 100 years from now you and I will be just alike, lying in our boxes becoming fossils. But if I'm right....................I won't be needing asbestos jammies.", 
   {}, 
   178913, 
   null, 
   1131856080.0
  ], 
  [
   178978, 
   null, 
   "trebor", 
   "I concede that point - my information was wrong on Denton. So anything he says means nothing now, right? But if Miller believes in God, but not in the creation account of Genesis, Miller's words mean everything?\n\n \n No, but it does mean that someone of faith does not have to reject evolution, and does not have to take genesis as literal.", 
   {}, 
   178975, 
   null, 
   1131856320.0
  ], 
  [
   178979, 
   null, 
   "marc9000", 
   "Please define \"Scientific Philosophy\".\n\n \n It is a WORLDVIEW. Many evolutionists can argueably claim to have \"no religion\", to view everything to do with religion from an outside, neutral position. Many in the newsmedia are masters of this. But everyone has a worldview, a perspective that guides their daily lives / a lens through which they view the world. They develop largely through childhood. They deserve to see more than one in school.", 
   {}, 
   178976, 
   null, 
   1131856500.0
  ], 
  [
   178980, 
   null, 
   "trebor", 
   "Well don't feel too sorry for me :) if I'm wrong, in 100 years from now you and I will be just alike, lying in our boxes becoming fossils. But if I'm right....................I won't be needing asbestos jammies.\n\n \n \n Depends on HOW you are wrong. You might be just believing in the wrong dogma, and you might end of in the pit with all the other people who thought they were christians.. having a nice bbq.\n \n After all, \"not all who cry lord lord will be saved\".", 
   {}, 
   178977, 
   null, 
   1131856980.0
  ], 
  [
   178987, 
   null, 
   "Howard Beale", 
   "It is a WORLDVIEW. Many evolutionists can argueably claim to have \"no religion\", to view everything to do with religion from an outside, neutral position. Many in the newsmedia are masters of this. But everyone has a worldview, a perspective that guides their daily lives / a lens through which they view the world. They develop largely through childhood. They deserve to see more than one in school.\n\"It is a WORLDVIEW\" is not a definition. Scientific Philosophy is a specific study, I am just not sure that you know the meaning of the term.", 
   {}, 
   178979, 
   null, 
   1131858300.0
  ], 
  [
   178997, 
   null, 
   "Terran", 
   "Well don't feel too sorry for me if I'm wrong, in 100 years from now you and I will be just alike, lying in our boxes becoming fossils. But if I'm right....................I won't be needing asbestos jammies.\n\n And exactly why would anyone want to be in heaven, if everyone there is like you? Really, c'mon, show me your \"Official Creationist Flowchart\" already, please?\n \n \n \nThey're not quite enough, because they're always more of the same - changing and rearranging, complicating the actual origins by putting the actual start so distant that it cannot be studied. If you push it back far enough, you seem to think that no explaination is required.\n\n What he's trying to explain to you is that evolution does not have a single, solitary thing to do with the origin of life. It's really not that hard to reason through.\n \n \nThis thread is about what children are being taught in public schools. If all that is being taught is science, then no explaination IS required, provided it stops at that. But it doesn't stop there. When we look at science textbooks, we see that unproven theories can be cleverly presented to appear as if the unknowns of evolution are soon to be uncovered.\n\n So, get rid of their lies and replace them with yours? That's your solution? Do you have some examples of these lies in the science books? I can't seem to recall any from when I studied Bio.\n \n \nIf it applies to Christians as well, I wish you'd enlighten some of your allies here. The ones who post these things about me;\n\n See, now here's where you made another mistake. You assumed I was talking about all christians. I wasn't, just your \"species\" of \"christian\", the ones who can't wait til all of us are burning in hell so you can yuk it up and show how your ignorance paid off. The ones who aren't content to let people live in peace, but feel the need to have them live your way or not at all. The kind who feel some twisted superiority because they know less than any others, and feel their god will reward them for not using the brains he put in their heads. Sorry buddy, your in the \"minute\" category of christianity, not the majority, so don't think I'm talking about christians when I talk about you.\n \n \nThose who oppose Christianity here, and take no real position of their own\n\n And here's another, more fundamental mistake. I think I can speak for most of us here when I say we don't \"oppose\" christianity. We oppose deceit and ignorance. You just happen to profess christianity as your reason for it.\n \n \nYes, silly you. My original reference to Lewontin's statement was in my recent formal debate, and you started a thread in reference to it, with your opinion on it.\n\n Oh yeah, how could I have forgotten! I only wrote that three weeks ago! Much as this may confuse you, it is common practice to cite references when you use them, not just the first time you happen to quote mine them.", 
   {}, 
   178987, 
   null, 
   1131860880.0
  ], 
  [
   179023, 
   null, 
   "electrolyte", 
   "They're not quite enough, because they're always more of the same - changing and rearranging, complicating the actual origins by putting the actual start so distant that it cannot be studied. If you push it back far enough, you seem to think that no explaination is required.\n\n I am trying to explain to you why biological evolution doesn't depend on a \"natural origin of life.\" My examples show \"if life originated by means X, then biological evolution could occur\" regardless of what X is. X could be space aliens, a god or gods, gremlins, invisible pink unicorns, the Flying Spaghetti Monster, or anything else, and descent with modification could (would) still take place.\n You have not presented any reasoning that shows I am wrong on this point. You are simply accusing me of \"pushing it back,\" which I am specifically not doing.\n \n \n \nWhen we look at science textbooks, we see that unproven theories can be cleverly presented to appear as if the unknowns of evolution are soon to be uncovered.\n\n When I look at science textbooks, I see authors pointing out that our knowledge of numerous aspects of science -- not just evolution -- is growing by leaps and bounds. I have a very hard time believing that any science textbook says something along the lines of \"In just a short amount of time, we will know absolutely, positively everything there is to know about [insert complicated scientific principle here].\"\n \n \n \nThey're not being taught science, they're being taught scientific philosophy.or naturalism.\n\n They're being taught that science is an extremely powerful tool, as shown by the decades and decades of advancement in knowledge produced by the scientific method.\n \n \n \nScience by itself is not a worldview, it's simply a tool.\n\n Yes, an extremely powerful tool, as shown by the decades and decades of advancement in knowledge produced by the scientific method.\n \n \n \nThe secular scientific philosophy IS a worldview, a belief system. It believes that all truth can be found in only in nature.\n\n You seem to be confusing secularism with atheism. Secular means \"not overtly religious,\" and science is secular. As such, science makes no claims about the supernatural.\n So by definition, science cannot evaluate the truth value of statements involving only the existence of God. Therefore, science does not claim to find \"all\" truth only in nature. This is the death of your tired \"naturalistic worldview\" claim.\n \n \n \nIt discards God and the Bible [...]\n\n Science discards the Bible as scientific evidence because of the nature of science. Science is based on worldly observations and experimentation. The scientific (in)accuracy of the Bible is irrelevant to modern science.\n \n \n \n[...] and is the philosophical underpinning to evolution.\n\n Science is the underpinning to evolution, not some \"worldview.\" All one has to do is recognize the deductive power of science to understand and accept evolutionary theory. Even someone who thinks science isn't the only way to find truth could do that.\n \n \n \nIt teaches kids that chaos, not predetermined order, is our foundation.\nHaving completed many, many science courses, I honestly have no idea what you're talking about. Let me repeat what I said earlier:\n \nWhile you're at it, pay special attention to Terran's last direct response to part of your post, which pointed out that chemicals react in predictable ways and that modern cells weren't the first life forms. Those points are particularly crucial when exploring the subject of the origin of life.\nNow, is the ability to make accurate predictions more analogous to \"chaos\" or \"predetermined order,\" marc? As a scientist, I would most definitely lean toward the latter; chaos is hard to predict.\n \n \n \nKids simply aren't being shown much difference between the scientific philosophy that they're being taught, and atheism.\n\n So you want all science teachers to begin and end each class period with a quick statement of, \"By the way, class, science makes no claims about the existence of any deity or deities\"? Science teachers teach science; students are free to make their own decisions about religion. Not mentioning a god is a far, far cry from advocating the nonexistence of all gods.\n \n \n \nAnd you embrace them, as long as they disagree with the book of Genesis, right?\nWhat I embrace is irrelevant. I was simply countering your accusation that Dr. Miller is \"confused\"; he knows exactly what he believes and how his different beliefs work together.\n \n \n \nIn some cases? only if you're an atheist?\n\n I'm getting mixed signals here. It would appear you can read. But in the very passage you quoted, I answered this question.\n \n \nIn some cases, \"personal position\" is irrelevant. For example, you don't need to know if I'm a theistic evolutionist, a creationist, or an atheist in order to analyze and critique the points I make. You argue against the points, not the person or their position. Argument against the person is a logically invalid type of argument.\n\n[empasis added]\n \n Did I make a mistake in assuming you can read? I don't think I did; I think you're just trolling. (Furthermore, did I say anywhere in this thread that I'm an atheist? No, you simply assumed that anyone who disagrees with you is an atheist and is \"ganging up\" on you.)\n \n \n \nIf it applies to Christians as well, I wish you'd enlighten some of your allies here. The ones who post these things about me;\n\n It's pretty low of them to attack you because of your beliefs. But the attack you quoted doesn't seem to be doing that explicitly; rather, it seems to lambaste you for being arrogant and unwilling to educate yourself. Perhaps that's not a wonderful debate practice, but if you repeatedly refuse to read up on the subjects of which you speak, the latter attack is founded.\n Incidentally, I have no doubt that some people are hostile to you as well as others. Some people simply snap into defensive mode when faced with a dissenter. I'm not totally sure how this forum is handled; I know some forums let you issue complaints to moderators to have comments deleted or users reprimanded.\n \n \n \nThose who oppose Christianity here, and take no real position of their own, have the liberty of cleverly drawing from more than one opposing position, using contradictory things to argue against something. It can be very effective, but it's not honest.\n\n If one person uses two contradictory arguments, point it out and use that against him or her. Any argument that argues for \"A\" as well as \"not A\" is invalid. Any set of arguments that collectively argue for \"A\" and \"not A\" are contradictory. Use their flawed logic to your advantage.\n \n \n \nWell don't feel too sorry for me if I'm wrong, in 100 years from now you and I will be just alike, lying in our boxes becoming fossils. But if I'm right....................I won't be needing asbestos jammies.\n\n This is Pascal's wager, a flawed argument. It's what I like to call an \"argument from consequence.\"\n Let's take a hypothetical situation where my religion says that non-believers get reincarnated as immortal earthworms in the African jungle that get trampled repeatedly by stampeding elephants. Since these earthworms cannot die, they suffer the agonizing pain of elephants stomping on them repeatedly. However, if you're a believer, you go to a paradise with a hooker factory and beer volcanoes. (Okay, so I stole the idea for that last bit.) Obviously, you should follow my religion so you won't suffer the agonizing pain. ... You see how absurd this is, right?\n And on a side note, fossilization is really rare.\n (And of course, if you were being sarcastic, replace the above with a profane statement complaining that being aware of sarcasm through nothing but text can be difficult.)", 
   {}, 
   178997, 
   null, 
   1131874800.0
  ], 
  [
   179075, 
   null, 
   "DamEtel", 
   "marc9000: Well don't feel too sorry for me if I'm wrong, in 100 years from now you and I will be just alike, lying in our boxes becoming fossils. But if I'm right....................I won't be needing asbestos jammies. \n\n \n \nelectrolyte: This is Pascal's wager, a flawed argument.\n\n \n Yes, even the hardly intelligent Homer Simpson was able to find the flaw in it! :-)\n \n \n\"Suppose we've chosen the wrong god. Every time we go to church we're just making him madder and madder.\" (Homer Simpson)\n \n\n \n And another thing marc9000 misses is which of us pays IN THIS LIFE? I believe it was Paul who said, to the effect, that if Jesus is not the Christ then Christians should be pittied more than all others. I agree, and so should Christians. Christians miss out on a lot of fun in life and their every thought is tainted by their religion - they are captives of their own religion, not free to actually think for themselves. And the more fundamentalist Christians remain ignorant, walking around as adults with the intellect of a high school student. And they also get ridiculed alot - which the Bible says they are supposed to cherish?!?!?!?! And the good Christians also give 10% of their income to the church, and attend church twice every Sunday and probably every Wednesday too. Christians also worry about eternal damnation: something that an atheist doesn't give a second a thought too, because all that XXXX about Jesus, resurrection, afterlife, and so is just superstitious BS. So Christians lose time, money, and freedom, and worry unnecessarily, IN THIS LIFE, for their religion. This life is the only life we actually know we have, and in this life, Christians are to be pitied. \n \n \n \n Well, I guess Christians have a few \"benefits\". \n \n They can wage Holy Way against another religion, slaughtering tens of thousands of people - including innocent women and children, and those of a religion other than that they are opposing - all with God's blessing. \"Thou shall not kill\" goes out the window and \"Thou shall brutally kill\" comes into play. It was called the Crusades.\n \n Also, hundres or thousands of Christians can also molest young boys, repeatedly, and even when this becomes known, get away with their horrific acts free and clear. In fact, they would just be transferred to another region where they can start all over again!", 
   {}, 
   179023, 
   null, 
   1131912900.0
  ], 
  [
   179087, 
   null, 
   "DamEtel", 
   "Also, hundres or thousands of Christians can also molest young boys, repeatedly, and even when this becomes known, get away with their horrific acts free and clear. In fact, they would just be transferred to another region where they can start all over again!\n\n \n I keep bringing this up and some may think it's an old issue. It's not. Well, the part about the religious people being able to get away scot free with sexual abuse is probably now outdated, but the fact that they are still doing it isn't!\n \n Just become a member of the FFRF (Freedom From Religion Foundation) and you'll receive a monthly (I believe) paper called Freethough Today. In it there's a section called \"Black Collar Crime Blotter: By Their Fruits Ye Shall Know Them\" which lists recent arrests, convictions, and sentencings of religious leaders for various crimes, most of which are sexual in nature.\n \n There are many individual examples in the issue covering August; here a good sampling from just the Arrested / Charged section.\n \n \n\n Rev. Lawrence Craig, 44, Harlem, NY: assault and attempted burglary. The choir director of the Willimas Institutional Christian Methodist Episcopal Church was charged with attempting to drag a boy, 4, from his home. On failing, he drove off in a car registered to his girlfriend, State Supreme Court Justice Donna H. Mills. Wisconsin court records show he was charged in 2001 with 2nd-degree sexual assautl on a child and 2 counts of 4th-degree sexual assault. The charges were dropped after he pleaded no contest to misdemeanor sexual assault and paid a fine of $1,582.10.\n Source: NY Times 8/24/05\n \n ...\n \n Bishop Terry Hornbuckle, 43, Fort Worth, TX: violating conditions of his bail release for a 2nd time. It is the 4th time he has been arrested since March. The senior pastor of Agape Christian Fellowship in Arlington, accused of sexually assaulting 5 female parishioners, faces 5 counts of sexual assault, drug possession, tampering with a witness, and retaliation against a witness.\n Source: Fort Worth Star-Telegram 8/23/05\n \n Msgr. Joseph Schumacher, 73, Fort Worth, TX: driving while intoxicated. The vicar general of the Diocese of Forth Worth is one of the highest-ranking officiles in the diocese. He is also pastor at St. Matthew Catholic Church in Arlington. \n Source: Fort Worth Star-Telegram 8/23/05\n \n Rev. Guyo Wako Malley, Nairobi, Kenya: murder. The Catholic priest and 5 other people were charged with killing Bishop Luigi Locati of the Isiolo Diocese in order to control church funds.\n Source: NY Times 8/19/05\n \n Otto Roth, 67, Wright City, MO: statutory sodomy and 2 counts of child molestation. The director of Camp Kavod in Foristell, a nondenominational Christian camp, was charged with sexually assaulting a girl, 11. \n Source: Examiner [MO] 8/17/05\n \n Rev. Wilfred \"Fred\" Englert, 52, Jasper, IN: 4 counts of sexual battery and 1 count of deviant sexual behavior. The senior associate pastor of St. Joseph Catholic Church was placed on paid adminstrative leave. He was accused of molesting a mentally disabled man, 19, from April to June.\n Source: Evansville Courier & Press 8/12/05\n \n Kenneth \"Tripp\" Atkinson III, 31, Columbia, SC: 1st-degree sexual conduct. He was charged with raping a girl, then 13, in 2002 while he was youth minister at Pawleys Island Community Church. He is now on leave from First Baptist Church in Columbia.\n Source: The State 8/11/05\n \n Rev. Ralph E. Patterson, 47, Henderson, KY: public indecency. The associate pastor at Holy Name of Jesus Catholic Church was 1 of 8 men arrested at an Indiana part in a police sting. He was charged with exposing himself to an undercover officer. He has since been removed.\n Source: Evansville Courier & Press 8/10/05\n \n Rev. Charles Howard, Memphis, TN: sexual battery. The minister at Broadmoor Baptist Church was chaged with molesting a woman whom he was counseling. She said he suggested hypnotizing her so that \"she would obey his every command like it was ... God talking to her.\"\n Source: wreg.com 7/29/05\n \n Mark David Turner, Riverside, CA: 11 counts of possessing assault weapons and 1 count of possessing an explosive device. The pastor of Foothill Baptist Church was charged with keeping a private arsenal of unregistered assault weapons, including a grenade launcher.\n Source: Press-Enterprise 7/28/05\n \n", 
   {}, 
   179075, 
   null, 
   1131915300.0
  ], 
  [
   179165, 
   null, 
   "marc9000", 
   "I am trying to explain to you why biological evolution doesn't depend on a \"natural origin of life.\" My examples show \"if life originated by means X, then biological evolution could occur\" regardless of what X is. X could be space aliens, a god or gods, gremlins, invisible pink unicorns, the Flying Spaghetti Monster, or anything else, and descent with modification could (would) still take place.\n You have not presented any reasoning that shows I am wrong on this point. You are simply accusing me of \"pushing it back,\" which I am specifically not doing. \n\n \n I realize that biological evolution \"doesn't depend\" on many things, there are gaps. ID likewise doesn't depend on many things, there are gaps. Why the double standard - why do biological evolutionists demand all the answers for ID, and excuse themselves from providing all their own answers? An example is the six day creation story of Genesis - there are jubilant questions from evolutionists asking how plants and trees existed before the sun, yet they don't feel compelled to address \"X\", even though X is a far bigger gap than the order of ID.\n \n \n \n \nWhen I look at science textbooks, I see authors pointing out that our knowledge of numerous aspects of science -- not just evolution -- is growing by leaps and bounds. I have a very hard time believing that any science textbook says something along the lines of \"In just a short amount of time, we will know absolutely, positively everything there is to know about [insert complicated scientific principle here].\"\n\n \n You have a hard time believing it because you don't want to believe it. Here's one example from a science textbook; Biochemistry, Voet & Voet, 2nd edition / 1995, page 19 (Micheal Behe's words)\n \n \n Another example concerns the inculacating of an evolutionary worldview. Despite many difficulties, a materialistic, Darwinistic view of the unfolding of life is taught uncritically to students. For example, a biochemistry textbook by Voet & Voet contains a marvelous, full color drawing nicely capturing the orthodox position. The top third of the drawing shows a volcano, lightening, an ocean, and little rays of sunlight, to suggest how life started. The middle of the picture has a stylized drawing of a DNA molecule leading out from the origin-of-life ocean and into a bacterial cell, to show how life developed. The bottom third of the picture - no kidding - is like the Garden of Eden, depiction a number of animals that have been produced by evolution milling about. Included in the throng are a man and a woman (the woman is offering the man an apple) both expecially attractive and in the buff. This undoubtedly adds to the interest for students, but the drawing is a tease. The implicit promise that the secrets of evolution will be uncovered is never consummated. Many students learn from their textbooks how to view the world through an evolutionary lens. But they are not told that they are learning scientific philosophy, not science itself. \n\n \n Behe gives other examples. You may not believe his description above, but since he referenced the book, I don't see any way he could be lying about it.\n \n \n \n \nThey're being taught that science is an extremely powerful tool, as shown by the decades and decades of advancement in knowledge produced by the scientific method.\n \n \n Yes, an extremely powerful tool, as shown by the decades and decades of advancement in knowledge produced by the scientific method.\n\n \n Extremly powerful, as in the ONLY tool?\n \n \n \n \nYou seem to be confusing secularism with atheism. Secular means \"not overtly religious,\" and science is secular. As such, science makes no claims about the supernatural.\n So by definition, science cannot evaluate the truth value of statements involving only the existence of God. Therefore, science does not claim to find \"all\" truth only in nature. This is the death of your tired \"naturalistic worldview\" claim.\n\n \n Secularism and atheism blend together almost perfectly in politics, and you know it. That's the death of your claim.\n \n \n \n \nScience discards the Bible as scientific evidence because of the nature of science. Science is based on worldly observations and experimentation. The scientific (in)accuracy of the Bible is irrelevant to modern science.\n\n \n Science includes dating and history. The Bible is at least as relevant to history as any other history book.\n \n \n \n \nScience is the underpinning to evolution, not some \"worldview.\" All one has to do is recognize the deductive power of science to understand and accept evolutionary theory. Even someone who thinks science isn't the only way to find truth could do that.\n \n \n Having completed many, many science courses, I honestly have no idea what you're talking about. Let me repeat what I said earlier:\n \n While you're at it, pay special attention to Terran's last direct response to part of your post, which pointed out that chemicals react in predictable ways and that modern cells weren't the first life forms. Those points are particularly crucial when exploring the subject of the origin of life.\n \n Now, is the ability to make accurate predictions more analogous to \"chaos\" or \"predetermined order,\" marc? As a scientist, I would most definitely lean toward the latter; chaos is hard to predict.\n\n \n Chemicals react in predictable, orderly ways almost always only when an intelligent source is mixing them, be it God, or a scientist in a lab. They may sometimes react predictably, but almost always chaotically, and towards useless disorder, when mixed by nature. (second law of Thermodynamics)\n \n \n \n \nSo you want all science teachers to begin and end each class period with a quick statement of, \"By the way, class, science makes no claims about the existence of any deity or deities\"? Science teachers teach science; students are free to make their own decisions about religion. Not mentioning a god is a far, far cry from advocating the nonexistence of all gods.\n\n \n We could take a closer look at what Voet & Voet is feeding them. Maybe Mr. & Mrs. Voet are on the ACLU payroll?\n \n \n \nWhat I embrace is irrelevant. I was simply countering your accusation that Dr. Miller is \"confused\"; he knows exactly what he believes and how his different beliefs work together.\n\n \n Some may not consider it irrelevant, if it is in lockstep with activists who are trying to remove Judeo Christianity from the classroom via the courts, rather than by the people.\n \n \n \n \nI'm getting mixed signals here. It would appear you can read. But in the very passage you quoted, I answered this question.\n \n [empasis added]\n \n Did I make a mistake in assuming you can read? I don't think I did; I think you're just trolling. (Furthermore, did I say anywhere in this thread that I'm an atheist? No, you simply assumed that anyone who disagrees with you is an atheist and is \"ganging up\" on you.)\n\n \n I'm getting mixed signals from you. Is it an invalid argument for you to be sarcastic about my reading? \n \n \n \n \nIt's pretty low of them to attack you because of your beliefs. But the attack you quoted doesn't seem to be doing that explicitly; rather, it seems to lambaste you for being arrogant and unwilling to educate yourself. Perhaps that's not a wonderful debate practice, but if you repeatedly refuse to read up on the subjects of which you speak, the latter attack is founded.\n Incidentally, I have no doubt that some people are hostile to you as well as others. Some people simply snap into defensive mode when faced with a dissenter. I'm not totally sure how this forum is handled; I know some forums let you issue complaints to moderators to have comments deleted or users reprimanded.\n\n \n I DON'T CARE :) it's all part of the fun - if I couldn't handle it I wouldn't be here. I do it too, more subtle than many however.\n \n \n \n \nIf one person uses two contradictory arguments, point it out and use that against him or her. Any argument that argues for \"A\" as well as \"not A\" is invalid. Any set of arguments that collectively argue for \"A\" and \"not A\" are contradictory. Use their flawed logic to your advantage.\n\n \n I do, then I get attacked like this;\n \n \nSee, now here's where you made another mistake. You assumed I was talking about all christians. I wasn't, just your \"species\" of \"christian\", the ones who can't wait til all of us are burning in hell so you can yuk it up and show how your ignorance paid off.\n\n \n As I said, it's part of the fun, and it's fun for me to point it out. But it reminds me of one small part of the collegiate fallacy list - not something I'm a big fan of, but this one part is excellent, and very common. \"Attempting to change the audience's sentiments instead of their minds.\" The way Christians have that done to them here can discourage good debates.\n \n \nThis is Pascal's wager, a flawed argument. It's what I like to call an \"argument from consequence.\"\n Let's take a hypothetical situation where my religion says that non-believers get reincarnated as immortal earthworms in the African jungle that get trampled repeatedly by stampeding elephants. Since these earthworms cannot die, they suffer the agonizing pain of elephants stomping on them repeatedly. However, if you're a believer, you go to a paradise with a hooker factory and beer volcanoes. (Okay, so I stole the idea for that last bit.) Obviously, you should follow my religion so you won't suffer the agonizing pain. ... You see how absurd this is, right?\n And on a side note, fossilization is really rare.\n (And of course, if you were being sarcastic, replace the above with a profane statement complaining that being aware of sarcasm through nothing but text can be difficult.)\n\n \n It may not be as flawed as you think. Let's take another hypothetical situation where a cave man is offered two choices for his only foods, one of (1)donuts, french fries & beer, (and a cigarette for desert) or (2)carrots, bananas, and milk.(and a stick of sugarless gum for desert) Not having any guidelines about health, he's going to pick the donut one, the one more fun, the one that feels good. The other one is offered them both, but has a guideline that tells him, \"trust me, the carrot one is best for you\". He may spend several years wondering why the other cave man is having more fun eating, but he'll understand when he watches him die a slow, painful death. \n \n Yours was absurd yes, far more than mine.", 
   {}, 
   179023, 
   null, 
   1131942300.0
  ], 
  [
   179173, 
   null, 
   "Howard Beale", 
   "Marc9000:\n \n \nIt may not be as flawed as you think. Let's take another hypothetical situation where a cave man is offered two choices for his only foods, one of (1)donuts, french fries & beer, (and a cigarette for desert) or (2)carrots, bananas, and milk.(and a stick of sugarless gum for desert) Not having any guidelines about health, he's going to pick the donut one, the one more fun, the one that feels good. The other one is offered them both, but has a guideline that tells him, \"trust me, the carrot one is best for you\". He may spend several years wondering why the other cave man is having more fun eating, but he'll understand when he watches him die a slow, painful death.\nOr imagine how ###### off he'll be as the last thing he sees is the other guy munching his donuts and smoking a cigarette while a saber-tooth is munching on him.", 
   {
    "unicode_changes_made": true
   }, 
   179165, 
   null, 
   1131946380.0
  ], 
  [
   179185, 
   null, 
   "electrolyte", 
   "I realize that biological evolution \"doesn't depend\" on many things, there are gaps.\nA theory's not depending on something and having gaps aren't related.\n \n \n \nwhy do biological evolutionists demand all the answers for ID, and excuse themselves from providing all their own answers?\n\n You're kidding, right? ID makes claims about the \"un-evolvability\" of certain systems. But nobody has been able to conclusively show one. In fact, Behe's own definition of IC had to be changed because it was found that alleged \"un-evolvable\" systems actually evolved. That wasn't satisfactory, however, so Dembski came along and redefined IC yet again. (And in doing so, he makes it absolutely impossible to ever determine if anything is IC.)\n I don't think ID needs all the answers. (In fact, one could claim that ID has nothing to do with the six-day creation [see below].) But ID/IC makes one claim: some systems are un-evolvable; but ID proponents can't show a single one!\n \n And from a scientific perspective, ID is not science. When science doesn't have an answer, we search for one. ID says, \"Whoops, hey, this can't have evolved [which is untrue because it's possible {even if an alleged \"un-evolvable\" system was found} that an as-of-yet undiscovered mechanism would explain it], so there must be a designer!\" This is essentially saying, \"We don't know how it got here, therefore we know how it got here!\" This is absurd. e.g., \"I don't know how a microprocessor works; therefore, I know how a microprocessor works: magic!\"\n \n \n \nAn example is the six day creation story of Genesis\n\n As I mentioned above, ID isn't dependent upon the Genesis story, if I understand it correctly. In fact, I'm pretty sure there was recently this big hubbub including a court, a judge, lawyers, and lots and lots of press where ID proponents were trying to show that ID has nothing to do with Genesis.\n \n \n \nYou have a hard time believing it because you don't want to believe it.\nNo, I have a hard time believing it because I've seen (and have) many, many science books, and I don't recall ever seeing one make a statement like that. So let's look at what you report Behe wrote:\n \n \nThe implicit promise that the secrets of evolution will be uncovered is never consummated.\nFirst, let's note you're quoting Behe, who is critiquing the Voet & Voet textbook. Let's also note that Behe doesn't actually quote the book, at least in the passage you've provided.\n \n The quote explicitly says that there is an \"implicit promise\" that we will discover the \"secrets\" of evolution. If it's implicit, then that's simply Behe's interpretation; that is, it doesn't actually make that promise.\n \n If a biochemistry textbook actually depicts a Garden of Eden with Adam and Eve, most teachers will laugh it right out of their classrooms. (Even Behe mocks it.)\n \n Here's another tip for rules of logic: It would be an ad hominem attack if I were to say, \"Well, this passage should be ignored because Behe is an ID proponent.\" On the other hand, it would be a valid complaint (not rebuttal) to point out that (since I don't know the context of this quote) Behe might be criticizing a book in order to increase sales of his own book, and that we should treat his statements carefully and/or check Voet & Voet ourselves.\n \n Regardless of alleged ulterior motives, I've already explained why the whole \"implicit\" thing should make you skeptical, at least of this example. \n \n And while we're on the topic of other books, I took this opportunity to break out my old Biochemistry book. There is an entire chapter on evolution, and on the very first page, it says that -- though we are learning more and more -- there are still \"uncertainties.\" However, it appropriately points out that the uncertainties do not invalidate the massive amount of information that led to and supports evolutionary theory.\n \n \n \nExtremly powerful, as in the ONLY tool?\n\n As I specifically explained in my last post, science can't answer all questions, and it doesn't claim to. You're just trolling again.\n \n \n \nSecularism and atheism blend together almost perfectly in politics, and you know it.\nA secular government would let you worship a god or gods (e.g. USA). An atheistic government wouldn't (e.g. China, USSR). You are simply wrong.\n \n \n \nScience includes dating and history. The Bible is at least as relevant to history as any other history book.\n\n I'll say it again:\n \nScience is based on worldly observations and experimentation.\n\n If you want it in your history book, then complain to the historical community. (Incidentally, many Bible scholars [people who actively study the origin and authenticity of the Bible] doubt some of the stories in the Bible.)\n \n \n \nChemicals react in predictable, orderly ways almost always only when an intelligent source is mixing them, be it God, or a scientist in a lab.\n\n (Your wording sets you up for begging the question. Let's hope you don't do that. Moreover, you're using \"order\" in a different sense than you use it below; you can't have it both ways.)\n When chlorofluorocarbons are released into the atmosphere, they react with ozone in a predictable manner. That's certainly not in a lab.\n If lightning causes a forest fire, the cellulose in the trees reacts in a predictable way.\n Are either of these examples a result of \"an intelligent source\"? If not, your point has been refuted. If so, and you're claiming God is responsible, you're begging the question.\n \n \nThey may sometimes react predictably, but almost always chaotically, and towards useless disorder, when mixed by nature. (second law of Thermodynamics)\n\n The second law of thermodynamics is a classical law that applies only to closed, macroscopic systems near thermal equilibrium. It says that entropy cannot decrease in such a system. \"Chaos\" and \"disorder\" are more layman's synonyms of entropy, however you get partial credit for appropriate use of \"useless\"/unuseable. Entropy is unuseable thermal energy.\n Anyway, I'm not sure what point you're trying to make. Are you breaking out the PRATT that the second law of thermodynamics makes evolution impossible?\n We can predict the chemistry of wood burning. You suggested that this was \"orderly.\" When wood burns, the amount of unuseable thermal energy in the wood increases. You equate this with an increase in \"disorder.\" Once again, you can't have it both ways.\n For all intents and purposes, your point has been thoroughly -- wait for it ... -- roasted.\n \n \n \nWe could take a closer look at what Voet & Voet is feeding them. Maybe Mr. & Mrs. Voet are on the ACLU payroll?\n\n Very good! If the Voets were being influenced by money, then you could indeed question their motives! On the other hand, they put a pseudo-Garden of Eden in their book, so you might have a hard time convincing people that the Voets are ACLU activists.\n \n \n \nSome may not consider it irrelevant, if it is in lockstep with activists who are trying to remove Judeo Christianity from the classroom via the courts, rather than by the people.\n\n It is irrelevant. I could embrace exterminating all Jews. But if I'm not advocating the extermination of all Jews, and none of my points argue for the extermination of all Jews, then what I embrace is irrelevant. You're trolling again.\n More importantly, though, the courts already have removed forced religion from the classroom.\n \n \n \nI'm getting mixed signals from you. Is it an invalid argument for you to be sarcastic about my reading?\n\n You might construe it as an ad hominem attack, I guess. But I specifically said that I think you're capable of reading. What I accused you of is trolling, and you're doing it again.\n \n \n \nI DON'T CARE\n\n Then don't complain.\n \n \n \nI do it too, more subtle than many however.\n\n Mostly, you've just been trolling with me.\n \n \n \nI do, then I get attacked like this;\n [snip]\n\n Then he misspoke, wasn't clear, or is backpedaling. Any way, you made your point.\n And once again, you said you don't care, so don't complain.\n \n \n \nIt may not be as flawed as you think.\n\n Did you bother reading the link? There's more text on that page covering why the argument is flawed than text explaining the actual \"wager.\"\n \n \n \nYours was absurd yes, far more than mine.\n\n Glad you noticed, since mine was far more analogous to Pascal's wager than yours, and that's what's really at issue here.\n I must say I find it interesting that you associate the belief in God with drabness and a lack of fun, though, while you associate atheism with \"the one that feels good.\"\n \n \n By the way, I find that roasting someone's arguments is a lot more fun than both eliciting attacks and trolling. You should try making valid counterarguments some time; you might enjoy it.", 
   {}, 
   179173, 
   null, 
   1131952560.0
  ], 
  [
   179405, 
   null, 
   "marc9000", 
   "A theory's not depending on something and having gaps aren't related. \n\n \n If you say so, but if they aren't related in evolution, they equally aren't related in ID.\n \n \n \n \nYou're kidding, right? ID makes claims about the \"un-evolvability\" of certain systems. But nobody has been able to conclusively show one. In fact, Behe's own definition of IC had to be changed because it was found that alleged \"un-evolvable\" systems actually evolved. That wasn't satisfactory, however, so Dembski came along and redefined IC yet again. (And in doing so, he makes it absolutely impossible to ever determine if anything is IC.)\n I don't think ID needs all the answers. (In fact, one could claim that ID has nothing to do with the six-day creation [see below].) But ID/IC makes one claim: some systems are un-evolvable; but ID proponents can't show a single one! \n\n \n Can evolution show them all to be evolvable? Why does ID have the greater burden of proof?\n \n \nAnd from a scientific perspective, ID is not science. When science doesn't have an answer, we search for one. \n\n \n Science doesn't search very hard for origins, does it? Anything outside of science's very limited realm of rearrangment, it doesn't search for.\n \n \n ID says, \"Whoops, hey, this can't have evolved [which is untrue because it's possible {even if an alleged \"un-evolvable\" system was found} that an as-of-yet undiscovered mechanism would explain it], so there must be a designer!\" This is essentially saying, \"We don't know how it got here, therefore we know how it got here!\" This is absurd. e.g., \"I don't know how a microprocessor works; therefore, I know how a microprocessor works: magic!\" \n\n \n And science says \"we know how everything got here, back to a certain point. How the original things got here - we don't know and we don't care! But God didn't create it, darn it!\n \n \n \n \nAs I mentioned above, ID isn't dependent upon the Genesis story, if I understand it correctly. In fact, I'm pretty sure there was recently this big hubbub including a court, a judge, lawyers, and lots and lots of press where ID proponents were trying to show that ID has nothing to do with Genesis.\n\n \n ID proponents are allowed to disagree to the same extent that evolutionists do. Unless you have a double standard. \n \n \nNo, I have a hard time believing it because I've seen (and have) many, many science books, and I don't recall ever seeing one make a statement like that. So let's look at what you report Behe wrote:\n \n First, let's note you're quoting Behe, who is critiquing the Voet & Voet textbook. Let's also note that Behe doesn't actually quote the book, at least in the passage you've provided.\n \n The quote explicitly says that there is an \"implicit promise\" that we will discover the \"secrets\" of evolution. If it's implicit, then that's simply Behe's interpretation; that is, it doesn't actually make that promise.\n \n If a biochemistry textbook actually depicts a Garden of Eden with Adam and Eve, most teachers will laugh it right out of their classrooms. (Even Behe mocks it.) \n\n \n That's the idea - for teachers to laugh it out of their classrooms, and for the students to laugh right along. Any depiction of Adam & Eve in a public school textbook would be removed if the church/state separation movement was sincere. But if it's done in a ~mocking~ manner, then it's allright. There are other recent examples in the US where church/state separation aren't nearly as important when the religion isn't the Judeo Christian religion.\n \n \nHere's another tip for rules of logic: It would be an ad hominem attack if I were to say, \"Well, this passage should be ignored because Behe is an ID proponent.\" On the other hand, it would be a valid complaint (not rebuttal) to point out that (since I don't know the context of this quote) Behe might be criticizing a book in order to increase sales of his own book, and that we should treat his statements carefully and/or check Voet & Voet ourselves. \n\n \n He was giving a detailed description of a picture, if it wasn't accurate he would be unable to answer criticism of his analysis of it. I suspect it was a book for young children - the most impressionable. I'm impressed that you think we should \"treat his statements carefully\". If only you had the desire to treat as carefully the statements you receive from evolutionary science labs! You don't indicate that you have it. You don't suppose evolutionary \"discoveries\" and statements are out to sell books & make money?\n \n \n \nRegardless of alleged ulterior motives, I've already explained why the whole \"implicit\" thing should make you skeptical, at least of this example. \n \n And while we're on the topic of other books, I took this opportunity to break out my old Biochemistry book. There is an entire chapter on evolution, and on the very first page, it says that -- though we are learning more and more -- there are still \"uncertainties.\" However, it appropriately points out that the uncertainties do not invalidate the massive amount of information that led to and supports evolutionary theory. \n\n \n In the same way, massive new amounts of information since Darwin, as well as other actual historical information, lead to and support ID. \n \n \n \n \nAs I specifically explained in my last post, science can't answer all questions, and it doesn't claim to. You're just trolling again.\n\n \n It was a statement about how children can be midlead. Let's see, if I make a relevant, thoughtful statement that stumps you, I'm trolling. If you refer to pink unicorns, gremlins, and flying spaghetti monsters, you're not. Your definition of trolling is strange indeed. \n \n \n \nA secular government would let you worship a god or gods (e.g. USA). An atheistic government wouldn't (e.g. China, USSR). You are simply wrong. \n\n \n Michael Newdow is suing right now to get \"in God we trust\" removed from our coins. Do you know his ultimate goals? Do Pat Robertson, Jerry Falwell, etc. indicate that they want to force religion on everyone through the courts?\n \n \n \n \nI'll say it again:\n \n If you want it in your history book, then complain to the historical community. (Incidentally, many Bible scholars [people who actively study the origin and authenticity of the Bible] doubt some of the stories in the Bible.) \n\n \n And many scientists doubt some claims of Darwinism. \n \n \n \n \n(Your wording sets you up for begging the question. Let's hope you don't do that. Moreover, you're using \"order\" in a different sense than you use it below; you can't have it both ways.)\n When chlorofluorocarbons are released into the atmosphere, they react with ozone in a predictable manner. That's certainly not in a lab.\n If lightning causes a forest fire, the cellulose in the trees reacts in a predictable way.\n Are either of these examples a result of \"an intelligent source\"? If not, your point has been refuted. If so, and you're claiming God is responsible, you're begging the question. \n\n \n I used the word \"almost\". So my point wasn't refuted, and I didn't beg the question. \n \n \n \nThe second law of thermodynamics is a classical law that applies only to closed, macroscopic systems near thermal equilibrium. It says that entropy cannot decrease in such a system. \"Chaos\" and \"disorder\" are more layman's synonyms of entropy, however you get partial credit for appropriate use of \"useless\"/unuseable. Entropy is unuseable thermal energy.\n Anyway, I'm not sure what point you're trying to make. Are you breaking out the PRATT that the second law of thermodynamics makes evolution impossible? \n\n \n It doesn't make it impossible, but it makes it so highly unlikely - it reminds me of the analogy someone made of a tornado or hurricane going through a junkyard and making a Boeing 747. That's much easier to believe, because a Boeing 747 is ABC SIMPLE compared to the human body.\n \n \n \nWe can predict the chemistry of wood burning. You suggested that this was \"orderly.\" When wood burns, the amount of unuseable thermal energy in the wood increases. You equate this with an increase in \"disorder.\" Once again, you can't have it both ways.\n For all intents and purposes, your point has been thoroughly -- wait for it ... -- roasted. \n \n \n The wood is being destroyed - destruction and many other simple actions can generate heat. \n \n \n \n \nVery good! If the Voets were being influenced by money, then you could indeed question their motives! On the other hand, they put a pseudo-Garden of Eden in their book, so you might have a hard time convincing people that the Voets are ACLU activists.\n\n \n See above, it was mocking. \n \n \n \n \nIt is irrelevant. I could embrace exterminating all Jews. But if I'm not advocating the extermination of all Jews, and none of my points argue for the extermination of all Jews, then what I embrace is irrelevant. You're trolling again.\n More importantly, though, the courts already have removed forced religion from the classroom. \n\n \n What you embrace is relevant, if you embrace something that doesn't fully agree with you, to join forces against your greatest enemy. It's the enemy of my enemy is my friend thing. Many beliefs work together against Christianity. In different degrees, for different goals. \n \n \n \n \n \nYou might construe it as an ad hominem attack, I guess. But I specifically said that I think you're capable of reading. What I accused you of is trolling, and you're doing it again. \n\n \n So you're NOT TROLLING when you use ad hominem attacks? This is fascinating.\n \n \n \n \n \n \nThen he misspoke, wasn't clear, or is backpedaling. Any way, you made your point.\n And once again, you said you don't care, so don't complain.\n\n \n Pointing things out and complaining are two different things.\n \n \n \nDid you bother reading the link? There's more text on that page covering why the argument is flawed than text explaining the actual \"wager.\"\n\n \n Yes I read it, the criticisms of it seem to be mainly about the supernatural aspects of it, something atheists love to disect. What I wrote showed how life on earth can be better for it, if one makes personal choices according to what the Bible says, even if it doesn't immediately make sense.\n \n \n \n \nGlad you noticed, since mine was far more analogous to Pascal's wager than yours, and that's what's really at issue here.\n I must say I find it interesting that you associate the belief in God with drabness and a lack of fun, though, while you associate atheism with \"the one that feels good.\" \n\n \n Drabness and lack of fun would include things like doing drugs, sex before marriage, laziness, selfishness, and a whole host of other things. Things that feel good, but can have consequences later on. Atheism can claim that they found some of these out on their own, but they didn't. They often borrow from the Christian heritage to avoid facing squarely the bankruptcy of their own belief system. They don't want children to see it, hence the desperate measures to keep it out of schools.\n \n \n \nBy the way, I find that roasting someone's arguments is a lot more fun than both eliciting attacks and trolling. You should try making valid counterarguments some time; you might enjoy it.\n\n \n Your definition of the word \"roasting\" seems to be as amazing as your definition of the word \"trolling\".", 
   {}, 
   179185, 
   null, 
   1132029720.0
  ], 
  [
   179420, 
   null, 
   "Terran", 
   "If you say so, but if they aren't related in evolution, they equally aren't related in ID.\n\n I really don't see how this can possibly be made any clearer to you. Evolution is descent with modification. It doesn't matter where the first life came from, evolution began once it was here. No one here has come even close to saying that ID is to be held to a \"greater burden of proof\" in this area. Let me see if you can follow this analogy, since plain english seems to confuse you:\n If I am on trial for a crime I commited sometime between the hours of 2 AM and 4 AM on the night of November 11, 2005, does it matter where I was born? No, but it does matter what I did in the time leading up to that point.\n Not the best analogy, I'll grant you, but it illustrates the point that the origin of life does not matter a whit to evolution , just as my origins do not matter a whit concerning my actions on a given evening in my life.\n \n \nCan evolution show them all to be evolvable?\n\n All the ones Behe claimed were \"unevolvable\", yes.\n \n \nWhy does ID have the greater burden of proof?\n \n\n Ever heard \"Extraordinary claims demand extraordinary proof\"? It's pretty extraordinary to claim that a supernatural entity for which there is no evidence \"POOF!\"ed complex structures into existence, especially when we can trace the development of such structure back to less complex precursors.\n \n \nScience doesn't search very hard for origins, does it?\n\n Yes, it does. That field of study is called abiogenesis. Once again, evolution is descent with modification, not origins of life.\n \n \nAnything outside of science's very limited realm of rearrangment, it doesn't search for.\n\n Pretty much, which is why ID is not science, as science does not concern itself with the supernatural.\n \n \nAnd science says \"we know how everything got here, back to a certain point. How the original things got here - we don't know and we don't care! But God didn't create it, darn it!\n \n\n No matter how often you say it, it's not going to magically become fact.\n \n \nID proponents are allowed to disagree to the same extent that evolutionists do. \n\n Which is pretty much the point he was going for. All ID is is an attempt to fool the courts into accepting Creationism, but without all the pesky bible stuff right up front. It's easier to try and sneak religion into the classrooms that way.\n \n \n\n That's the idea - for teachers to laugh it out of their classrooms, and for the students to laugh right along.\n\n You do realize that Judeo-Christian mythology, in the western world, is quite recognized, right? The \"Adam and Eve\" story is well known, and students would recognize the figures and realize what was implied by it. The illustration was used as a tool. Rather than have a lengthy paragraph, you can show Adam and Eve, and anyone in the Western world would look and go \"Ah, beginning of life!\".\n \n \nAny depiction of Adam & Eve in a public school textbook would be removed if the church/state separation movement was sincere. But if it's done in a ~mocking~ manner, then it's allright. There are other recent examples in the US where church/state separation aren't nearly as important when the religion isn't the Judeo Christian religion.\n\n Ah, the \"persecuted christian\" routine. My favourite...\n \n \nsuspect it was a book for young children - the most impressionable.\n\n And right here you show your true colours. Of course the evilutionists are trying to brainwash the young minds! Why, I remember when I was in grade school studying biochemistry I... wait a minute, I didn't take biochemistry in grade school. Anyone else study biochem in elementary school? Did I miss out here?\n We won't mention the history of organized religion, where residential schools were setup for the specific purpose of erasing other culture's and religions by taking young children from their families and indoctrinating them for 10-12 years. Deal?\n \n \nIf only you had the desire to treat as carefully the statements you receive from evolutionary science labs! You don't indicate that you have it.\n\n Says the guy who will push any nonsense he feels like, as long as he can protect his beliefs.\n \n \nYou don't suppose evolutionary \"discoveries\" and statements are out to sell books & make money?\n\n You don't suppose there's such a thing as peer review? \n \n \nIn the same way, massive new amounts of information since Darwin, as well as other actual historical information, lead to and support ID.\n\n Hmm, this would have been an excellent place to put some of that information. Oh, wait, I see you did! Immediately after that, you put \".\" That about sums it up alright...\n \n \nLet's see, if I make a relevant, thoughtful statement that stumps you, I'm trolling. If you refer to pink unicorns, gremlins, and flying spaghetti monsters, you're not.\n\n Not really. From Wikipedia: a troll is a person who posts inflammatory messages on the internet, such as on online discussion forums, to disrupt discussion or to upset its participants.\n You deliberately tried to provoke a reaction by twisting what he said. However, when people on here talk about pink unicorns, gremlins, and flying spaghetti monsters, it is to prove a point. That point is that there is as much evidence for the preceeding as for the idea that all life was poofed into existence 6KYA.\n \n \nMichael Newdow is suing right now to get \"in God we trust\" removed from our coins.\n\n And rightly so, since religous quotes do not belong on government currency. What does that have to do with the difference between secular and atheist?\n \n \nDo Pat Robertson, Jerry Falwell, etc. indicate that they want to force religion on everyone through the courts?\n\n No, they just threaten hellfire and damnation on those who disagree with them. I especially liked their classy response to 9-11:\n http://archives.cnn.com/2001/US/09/14/Falwell.apology/\n In fact, a quick search found these pages as well:\n http://www.tylwythteg.com/enemies/falwell.html\n and\n http://en.wikipedia.org/wiki/Jerry_Falwell\n \n My favourite quotes:\n ' \"I do not believe the homosexual community deserves minority status. One's misbehavior does not qualify him or her for minority status. Blacks, Hispanics, women, etc. are God-ordained minorities who do indeed deserve minority status.\" Jerry Falwell, USA Today Chat\"\n \n \"AIDS is the wrath of a just God against homosexuals. To oppose it would be like an Israelite jumping in the Red Sea to save one of Pharaoh's charioteers . . . AIDS is not just God's punishment for homosexuals; it is God's punishment for the society that tolerates homosexuals.\" \" \n \n \"Falwell has also put the Christian world on alert that the Antichrist is among us and living as a Jewish male.\"\n \n and\n \n The beatific Reverend referred to lesbian actress Ellen Degeneres as Ellen Degenerate.\"\n \n and Robertson is so much better:\n http://en.wikipedia.org/wiki/Pat_Robertson#Controversies\n Here's a couple examples of \"Wacky Pat's\" modus operandi:\n \"Robertson has described feminism as a \"socialist, anti-family political movement that encourages women to leave their husbands, kill their children, practice witchcraft, destroy capitalism and become lesbians.\"\n \n This one is just sickening:\n \n \"Robertson has also been accused of using his tax-exempt, nonprofit organization, Operation Blessing, as a front for his own financial gain, and then using his influence in the Republican Party to cover his tracks. After making emotional pleas in 1994 on The 700 Club for cash donations to Operation Blessing to support airlifts of refugees from Rwanda to Zaire, it was later discovered, by a reporter from The Virginian Pilot, that Operation Blessing's planes were transporting diamond-mining equipment for the Robertson-owned African Development Corporation, a venture Robertson had established in cooperation of Zaire's dictator Mobutu Sese Seko.\"\n \n He pleads for money to help rescue people from the massacre in Rwanda, then uses that money to transport equipment to a diamond mine he owns?!?! That's beyond disgusting. I really hope your god does exist, because I can't wait til he gets a hold of these two and starts laying into him for what they did in his name.\n \n \nAnd many scientists doubt some claims of Darwinism.\n\n I'd replace \"many\" with \"some\" or \"a few\", but yes, some scientists don't think certain aspects are right. And the great thing about science is they can try out their ideas and see if they hold water. If they don't they're discarded.\n \n \nit reminds me of the analogy someone made of a tornado or hurricane going through a junkyard and making a Boeing 747. That's much easier to believe, because a Boeing 747 is ABC SIMPLE compared to the human body.\n \n\n I'm not even covering this. If that's your trump card, you are beyond hope.\n \n \nThe wood is being destroyed - destruction and many other simple actions can generate heat. \n\n OK, we'll add \"lack of basic chemistry skills\" to your (long) list of shortcomings.\n \n \nWhat you embrace is relevant, if you embrace something that doesn't fully agree with you, to join forces against your greatest enemy. It's the enemy of my enemy is my friend thing. Many beliefs work together against Christianity. In different degrees, for different goals.\n\n OK, not following you here, but I see your in \"persecuted christian\" mode again, so it probably wouldn't matter if I could.\n \n \nSo you're NOT TROLLING when you use ad hominem attacks? This is fascinating\n\n Read again what was written. On second thought, never mind. You've shown you read what you want, no matter what's written. Let's move on.\n \n \nDrabness and lack of fun would include things like doing drugs\n\n Never done them, so can't say if they're fun or not. Question though: ever drink coffee? Have a chocolate bar?\n \n, sex before marriage,\n\n OK, I really have to know-where in the bible does it say this is a sin?\n \n laziness,\n\n Wow, you've never slept in?\n \n selfishness,\n\n How is selfishness \"fun\"?\n \n and a whole host of other things.\n\n Oh no! Not a host!!\n \n \nYour definition of the word \"roasting\" seems to be as amazing as your definition of the word \"trolling\".\n\n Since you've demonstrated an incredible lack of reading comprehension (not to mention you don't know the meaning of the word \"trolling\"), I wouldn't poke fun of someone else's puns.", 
   {}, 
   179405, 
   null, 
   1132044540.0
  ], 
  [
   179421, 
   null, 
   "electrolyte", 
   "If you say so, but if they aren't related in evolution, they equally aren't related in ID.\n\n Two points:\n 1) Missing technical details of irrefutably observed, documented, predictable, and mostly understood phenomena don't negate the phenomena. It doesn't matter if we're talking about evolution, or gravity, or electromagnetism, etc.\n 2) ID doesn't have \"gaps\"; ID has no evidence at all.\n \n \nCan evolution show them all to be evolvable?\n\n Not at the present time. As you're fond of mentioning, we're missing some evidence. But we've determined the phylogeny of many structures. Just because we can't determine how a certain one evolved doesn't mean it couldn't have evolved.\n Behe's pet system, the bacterial flagellum, is of course being researched thoroughly now. There is building evidence that the flagellum derived from the Type III Secretory system. However, some researchers think that the Type III secretory system evolved from the bacterial flagellum. A lack of definitive knowledge doesn't mean that an intelligent designer must have been involved. (Besides, introducing an intelligent agent violates Occam's razor.)\n \n \nWhy does ID have the greater burden of proof?\n\n It doesn't have a \"greated burden of proof\" as far as the origin of life is concerned. From a scientific standpoint, ID might be viewed as having the \"greater burden of proof\" only because science works by formulating theories that are only discarded when a better theory is formulated. Because ID lacks evidence, it's not a better theory. (It's also not science, so it's doomed from a scientific standpoint anyway.) And as mentioned above, it violates Occam's razor.\n \n \n \nScience doesn't search very hard for origins, does it? Anything outside of science's very limited realm of rearrangment, it doesn't search for.\n\n First, I'm not sure what you mean by \"rearrangement.\" Regardless, science has its realm, and it doesn't reach beyond that realm. I feel I've been very clear on this point, so stop trolling.\n \n \n \nAnd science says \"we know how everything got here, back to a certain point. How the original things got here - we don't know and we don't care! But God didn't create it, darn it!\n\n Science says, \"We're pretty darn sure we know how the things that we observe today got to be the way they are.\" Asking how \"original things\" got here is perfectly valid, and it's an issue that people do care about. If the answer is divine intervention, then science can't determine it. Why? Because the supernatural is outside of the realm of science. Does that mean that science assumes that God didn't do anything? No, it does not. You're arguing against a straw man.\n If you want to look at things this way, you could consider science a way of seeing how God did things. Many, many people take that view.\n Regardless, science does not say \"God didn't do it!\" Science makes no statements about the supernatural.\n \n Evolutionary theory says, \"We don't have to know how life originated to know that it changes. Even though we don't know how life originated, we're not going to make any assumptions based on absolutely no evidence.\" Frankly, I don't see how you can have a problem with that.\n \n \nID proponents are allowed to disagree to the same extent that evolutionists do. Unless you have a double standard.\n\n You're absolutely right. My point was that the group that most strongly promotes ID just spent several weeks in court saying that ID has nothing to do with God, because they're trying to get ID into the classroom. More importantly, though, I was exhibiting that ID doesn't rely on the Genesis story, just as evolutionary theory doesn't rely on the origin of life. Don't get pissy at me, because this point helps the ID side; there's no evidence at all for the Genesis story's alleged events.\n \n \n \nBut if it's done in a ~mocking~ manner, then it's allright.\n\n Read what I said more carefully. I didn't say the book was mocking the Genesis story, I pointed out that even Behe mocked the use of the Eden-like image. Yes, that's right: the ID proponent (not the authors) is mocking Genesis.\n If you don't understand your own citation, don't use it.\n \n \n \nThere are other recent examples in the US where church/state separation aren't nearly as important when the religion isn't the Judeo Christian religion.\n\n On a side note, could you link me to two or three of these? I'd like to see them.\n \n \n \nI suspect it was a book for young children - the most impressionable.\n\n Wow. You've said some really dumb things, but this shows you're not even trying.\n \n Table of Contents for Voet & Voet textbook, including:\n [*]Protein Folding, Dynamics, and Structural Evolution.[*]Rates of Enzymatic Reactions.[*]Signal Transduction.[*]Electron Transport and Oxidative Phosphorylation.[*]Eukaryotic Gene Expression.Still think this book is for young kids? Young kids can't even pronounce those words, let alone understand them. This is a college-level textbook.\n \n But the real issue here was the alleged implication that the book \"promises\" that evolution will answer all the questions. I notice you've abandoned the argument. Good choice.\n \n \n \nIf only you had the desire to treat as carefully the statements you receive from evolutionary science labs!\n\n When those statements are peer-reviewed and approved, then I don't have to worry so much. (See? Modern scientists have such precautions worked into the system as an integral part.)\n \n \n \nYou don't suppose evolutionary \"discoveries\" and statements are out to sell books & make money?\n\n When findings are approved by peer review, the peers don't really get anything from it besides the information. Why would they lie?\n Moreover, one could make an unbelievable amount of money if he successfully debunked scientific theory. So why lie to \"save\" it?\n \n \n \nIn the same way, massive new amounts of information since Darwin, as well as other actual historical information, lead to and support ID.\n\n Sure, if your view of ID is (evolutionary theory + God explains gaps in evolutionary theory)... Rearrange the equation, and we get (ID - evolutionary theory = God explains gaps). That is, your view of ID is the \"God of the Gaps\" fallacy (argument from ignorance, argumentum ad ignorantiam)! And there you have it: your view of ID is logically invalid.\n \n \n \nIt was a statement about how children can be midlead.\n\n As I showed, the book is not for children. You have once again concocted a straw man.\n \n \n \nLet's see, if I make a relevant, thoughtful statement that stumps you, I'm trolling. If you refer to pink unicorns, gremlins, and flying spaghetti monsters, you're not. Your definition of trolling is strange indeed.\n\n You haven't stumped me at all. I called you a troll for the following:\n \n \nTherefore, science does not claim to find \"all\" truth only in nature.\nExtremly powerful, as in the ONLY tool?\nAs I specifically explained in my last post, science can't answer all questions, and it doesn't claim to. You're just trolling again.\n\n I said unequivocally that science doesn't claim to be able to find all answers, yet you asked if science is the only tool for truth. If it were, there would be a lot of philosophers without jobs.\n Reference to gremlins, IPU, and FSM were to explain that the identity of the intelligent agent is irrelevant. I picked ridiculous examples not to mock you but rather because I thought it would effectively illustrate my point.\n \n \n \nMichael Newdow is suing right now to get \"in God we trust\" removed from our coins.\n\n Removing references to God would make the government secular. Newdow isn't trying to change the text on coins to \"in the absence of gods we believe\" or in the Pledge to say, \"one nation, adhering to the belief that no gods exist, indivisible...\"\n \n \n \nDo you know his ultimate goals?\n\n I've met Mr. Newdow and talked to him. Had dinner with a group of about ten people, including him. I do know his ultimate goals: to restore the secularity of the government.\n \n \n \nDo Pat Robertson, Jerry Falwell, etc. indicate that they want to force religion on everyone through the courts?\n\n Newdow isn't forcing religion upon anyone, nor is he trying to. What Robertson and Falwell do, however unethical, aren't at issue here.\n \n \n \nAnd many scientists doubt some claims of Darwinism.\n\n 1) Not a statistically significant number of biologists.\n 2) This is like saying, \"There are many people who think the world is flat, so we can't reasonably think that the world is spherical.\"\n 3) Everybody is welcome to present evidence that is contradictory to evolutionary theory for peer review. Nobody has produced any that passed.\n \n \n \nI used the word \"almost\". So my point wasn't refuted, and I didn't beg the question.\n\n Translation: \"uh, I can't counter your points, so I'll retreat.\" But your point has very much been refuted. You said,\n \nChemicals react in predictable, orderly ways almost always only when an intelligent source is mixing them, be it God, or a scientist in a lab. [underline added]\n\n Let's suppose I have a friend named Joe. Joe is \"almost always\" wrong. Let's suppose Joe makes a truthful statement. I just have to say, \"Well, Joe was right that time, but he's almost always wrong.\" If Joe makes another truthful statement, I say, \"Well, Joe was right again, but he's almost always wrong.\"\n In the above example, if Joe is \"almost always wrong,\" what can we know certainly about any one statement he makes? Absolutely nothing. The phrase makes any statement it's attached to utterly meaningless.\n By providing counterexamples, I was able to make you concede that your statement is nothing but a red herring. Therefore, your point has been refuted.\n \n \n \nIt doesn't make it impossible, but it makes it so highly unlikely - it reminds me of the analogy someone made of a tornado or hurricane going through a junkyard and making a Boeing 747. That's much easier to believe, because a Boeing 747 is ABC SIMPLE compared to the human body.\n\n Because \"it\" occurs so often in your statement, I'm going to assume you mean:\n \"The second law of thermodynamics doesn't make evolution impossible, but the second law of thermodynamics makes evolution so highly unlikely..\"\n You're wrong, and here's why: You're still thinking in terms of \"order\" and \"complexity,\" not \"unuseable thermal energy.\" If you want to use a tornado in a junkyard analogy working with unuseable thermal energy, go right ahead and try. It will only get refuted. Why? Because the \"junkyard\" isn't a closed system. The junkyard has useable energy input. Furthermore, localized entropy decreases don't contradict the second law of thermodynamics when those decreases are offset by entropy increases elsewhere in the system. \n Since you don't seem to know, PRATT means \"point refuted a thousand times.\"\n \n \n \n \nThe wood is being destroyed - destruction and many other simple actions can generate heat. \n\n It is more accurate to say that those processes (burning, friction) are releasing the stored (useable) thermal energy. What happens when you use thermal energy in an imperfect system, as described by the second law of thermodynamics? The amount of unuseable heat energy increases! Thank you for illustrating my point.\n If you don't understand thermodynamics, don't bring it up.\n \n \n \nWhat you embrace is relevant, if you embrace something that doesn't fully agree with you, to join forces against your greatest enemy.\n\n You're declaring yourself my greatest enemy? Now there's a good one.\n \n \n \nSo you're NOT TROLLING when you use ad hominem attacks? This is fascinating.\n\n Nah, trolling is different. Trolling is spewing BS to elicit an inflammatory response. Or repeatedly bringing up questions that have been answered and points that have been refuted.\n \n \n \nYes I read it, the criticisms of it seem to be mainly about the supernatural aspects of it, something atheists love to disect.\n\n If this is your response, then you do not understand the wager. Try again.\n \n \n \nDrabness and lack of fun would include things like doing drugs, sex before marriage, laziness, selfishness, and a whole host of other things.\n\n You're entitled to your opinion. The fact remains that your \"version\" of the wager wasn't representative of Pascal's wager, probably because (as exposed above) you don't understand it. You'll have a very, very hard time countering what you don't understand, so give that link another look.\n \n \nYour definition of the word \"roasting\" seems to be as amazing as your definition of the word \"trolling\".\n\n Funny, this nice warm fire (which is converting useable heat energy to unuseable heat energy on a net basis) fueled by your debunked statements says otherwise.", 
   {}, 
   179405, 
   null, 
   1132044660.0
  ], 
  [
   179844, 
   null, 
   "marc9000", 
   "Two points:\n 1) Missing technical details of irrefutably observed, documented, predictable, and mostly understood phenomena don't negate the phenomena. It doesn't matter if we're talking about evolution, or gravity, or electromagnetism, etc. \n\n \n It also doesn't matter if we're talking about the Bible. Many consider it's details to be irrefutably observed, documented, predictable, and mosty understood. Considering today's archeological findings that harmonize with it, as well as it's documentation of many historically confirmed public figures, it's phenomena is negated only if you have a closed mind. \n \n \n \n2) ID doesn't have \"gaps\"; ID has no evidence at all.\n\n \n That's the atheist opinion, a minority opinion in the US. There are other views;\n \n \n......The second law wasn't violated, it was just counteracted by an intelligent agent making use of the fourth law. This is just one example of how design-theoretic ideas can have profound and intriguing implications for many fields of science, and how intelligent design itself is fertile ground for scientific progress. \n\n \n and;\n \n \nIf design cannot be made into a fertile new point of view that inspires exciting new areas of scientific investigation, then it deserves to wither and die. Yet before that happens, it deserves a fair chance to succeed. \n\n \n http://www.wordtrade.com/science/cosmology/dembski.htm\n \n Why don't you want to give it a chance? Are you afraid of something?\n \n \n \n \n \nNot at the present time. As you're fond of mentioning, we're missing some evidence. But we've determined the phylogeny of many structures. Just because we can't determine how a certain one evolved doesn't mean it couldn't have evolved.\n Behe's pet system, the bacterial flagellum, is of course being researched thoroughly now. There is building evidence that the flagellum derived from the Type III Secretory system. However, some researchers think that the Type III secretory system evolved from the bacterial flagellum. A lack of definitive knowledge doesn't mean that an intelligent designer must have been involved. (Besides, introducing an intelligent agent violates Occam's razor.)\n\n \n What establishes Occam's razor as the undisputed law? But let's assume that it is. It states that \"entities must not be multiplied beyond what is necessary\" - \"This rule is interpreted to mean that the simplest of two or more competing theories is preferable and that an explaination for unknown phenomena should first be attempted in terms of what is already known.\" \n \n Evolution presupposes the simplest forms of life - ID presupposes an intelligent designer. If one has an open mind and doesn't start with the conclusion that man has to be the highest form of life, an intelligent designer is the simplest conclusion.\n \n \n \n \nFirst, I'm not sure what you mean by \"rearrangement.\" Regardless, science has its realm, and it doesn't reach beyond that realm. I feel I've been very clear on this point, so stop trolling. \n\n \n Rearrangement - man cannot create nor destroy. Rearrangement is the realm we live in. \n \n \n \n \nScience says, \"We're pretty darn sure we know how the things that we observe today got to be the way they are.\" Asking how \"original things\" got here is perfectly valid, and it's an issue that people do care about. If the answer is divine intervention, then science can't determine it. Why? Because the supernatural is outside of the realm of science. Does that mean that science assumes that God didn't do anything? No, it does not. You're arguing against a straw man.\n If you want to look at things this way, you could consider science a way of seeing how God did things. Many, many people take that view.\n Regardless, science does not say \"God didn't do it!\" Science makes no statements about the supernatural. \n\n \n This would be a plausible argument, but regarding our subject here, what is taught in schools, there is one big problem - humans are not perfect. Teachers aren't robots perfectly programed to teach without human flaws. \n \n \n Worse yet, it leads faculty members to abuse their authority. The American Council of Trustees and Alumni has just released the results of the first survey to measure student perceptions of faculty partisanship. The ACTA findings are striking. Of 658 students polled at the top 50 US colleges, 49 percent said professors \"frequently comment on politics in class even though it has nothing to do with the course,\" 48 percent said some \"presentations on political issues seem totally one-sided,\" and 46 percent said that \"professors use the classroom to present their personal political views.\" That nearly half of the respondents expressed those views is all the more striking, since only 13 percent described themselves as conservative. \n\n \n http://www.townhall.com/opinion/columns/jeffjacoby/2004/12/04/13849.html\n \n This is about politics, but applies to religion as well.\n \n \n \n \nRead what I said more carefully. I didn't say the book was mocking the Genesis story, I pointed out that even Behe mocked the use of the Eden-like image. Yes, that's right: the ID proponent (not the authors) is mocking Genesis.\n If you don't understand your own citation, don't use it. \n\n \n I saw him mocking the use of it, not the image itself. But he may be playing a game he feels he has to play - if he claims to be a Christian, he won't be taken as seriously as he would by somewhat distancing himself from Christianity. It's fair - many atheists masquarade as Christians. \n \n \n \n \nOn a side note, could you link me to two or three of these? I'd like to see them.\n\n \n Two or three? How about one - I've never noticed more than one from you.\n \n \nWhat's happening here is clear: There's an unholy alliance emerging between the mush-brained, selectively intolerant secular jihadists and those Islamists who would like to use the Judeo-Christian-inspired American freedoms to undermine Western Civilization. \n\n \n http://www.freerepublic.com/focus/f-news/1129837/posts\n \n \nWow. You've said some really dumb things, but this shows you're not even trying.\n \n Table of Contents for Voet & Voet textbook, including:\n [*]Protein Folding, Dynamics, and Structural Evolution.[*]Rates of Enzymatic Reactions.[*]Signal Transduction.[*]Electron Transport and Oxidative Phosphorylation.[*]Eukaryotic Gene Expression.Still think this book is for young kids? Young kids can't even pronounce those words, let alone understand them. This is a college-level textbook. \n\n \n College level textbooks have this type of picture in them? Is it just a picture book, or does it have writing in it too? emoticon_frazzled I stand corrected.\n \n \nBut the real issue here was the alleged implication that the book \"promises\" that evolution will answer all the questions. I notice you've abandoned the argument. Good choice. \n\n \n I didn't abandon it. It was Behe's argument anyway. There are probably countless other examples of it. \n \n \n \n \nWhen those statements are peer-reviewed and approved, then I don't have to worry so much. (See? Modern scientists have such precautions worked into the system as an integral part.)\n\n \n To a much greater degree, the Bible is peer-reviewed and approved also.\n \n \n \n \nWhen findings are approved by peer review, the peers don't really get anything from it besides the information. Why would they lie?\n Moreover, one could make an unbelievable amount of money if he successfully debunked scientific theory. So why lie to \"save\" it?\n\n \n Biblical information is established. Evolutionary information is ongoing. There is far more money involved in carrot/stick evolutionary \"theories\". \n \n \n \n \nSure, if your view of ID is (evolutionary theory + God explains gaps in evolutionary theory)... Rearrange the equation, and we get (ID - evolutionary theory = God explains gaps). That is, your view of ID is the \"God of the Gaps\" fallacy (argument from ignorance, argumentum ad ignorantiam)! And there you have it: your view of ID is logically invalid. \n\n \n Then don't rearrange the equation, or don't start mindlessly clanging the fallacy bell, your choice. \n \n \n \n \nAs I showed, the book is not for children. You have once again concocted a straw man. \n\n \n Students. You have many straw man alter egos, they're all coming at me.\n \n \n \n \nYou haven't stumped me at all. I called you a troll for the following:\n \n \n I said unequivocally that science doesn't claim to be able to find all answers, yet you asked if science is the only tool for truth. If it were, there would be a lot of philosophers without jobs.\n Reference to gremlins, IPU, and FSM were to explain that the identity of the intelligent agent is irrelevant. I picked ridiculous examples not to mock you but rather because I thought it would effectively illustrate my point.\n\n \n I hope I've effectively illistrated my point by showing how secular schools can attempt to portray that science is the only source of information concerning origins.\n \n \n \nRemoving references to God would make the government secular. Newdow isn't trying to change the text on coins to \"in the absence of gods we believe\" or in the Pledge to say, \"one nation, adhering to the belief that no gods exist, indivisible...\"\n \n \n \n I've met Mr. Newdow and talked to him. Had dinner with a group of about ten people, including him. I do know his ultimate goals: to restore the secularity of the government. \n\n \n Restore? When was it ever secular in the past? \n \n It's the year 2005. (The \"year of our Lord\" 2005.) Does Newdow want to change our dating method? Is he not upset with our Thanksgiving and Christmas holidays?\n \n \n \nNewdow isn't forcing religion upon anyone, nor is he trying to. What Robertson and Falwell do, however unethical, aren't at issue here.\n\n \n That's right, because they don't try to use the courts to thwart the will of the people like Newdow does.\n \n \n \n \n1) Not a statistically significant number of biologists.\n 2) This is like saying, \"There are many people who think the world is flat, so we can't reasonably think that the world is spherical.\"\n 3) Everybody is welcome to present evidence that is contradictory to evolutionary theory for peer review. Nobody has produced any that passed.\n\n \n It's all about the source of their income.\n \n \n \n \nTranslation: \"uh, I can't counter your points, so I'll retreat.\" But your point has very much been refuted. You said,\n \n Let's suppose I have a friend named Joe. Joe is \"almost always\" wrong. Let's suppose Joe makes a truthful statement. I just have to say, \"Well, Joe was right that time, but he's almost always wrong.\" If Joe makes another truthful statement, I say, \"Well, Joe was right again, but he's almost always wrong.\"\n In the above example, if Joe is \"almost always wrong,\" what can we know certainly about any one statement he makes? Absolutely nothing. The phrase makes any statement it's attached to utterly meaningless.\n By providing counterexamples, I was able to make you concede that your statement is nothing but a red herring. Therefore, your point has been refuted.\n\n \n Your counterexamples were exceptions, but they were exceptions of random occurances with no changes that could cause any significant new things to happen. It's like saying liquids freezing is an example of disorder changing to order. It may be scientifically, but not enough to prove notable origins.\n \n \n \n \nBecause \"it\" occurs so often in your statement, I'm going to assume you mean:\n \"The second law of thermodynamics doesn't make evolution impossible, but the second law of thermodynamics makes evolution so highly unlikely..\"\n You're wrong, and here's why: You're still thinking in terms of \"order\" and \"complexity,\" not \"unuseable thermal energy.\" If you want to use a tornado in a junkyard analogy working with unuseable thermal energy, go right ahead and try. It will only get refuted. Why? Because the \"junkyard\" isn't a closed system. The junkyard has useable energy input. Furthermore, localized entropy decreases don't contradict the second law of thermodynamics when those decreases are offset by entropy increases elsewhere in the system. \n Since you don't seem to know, PRATT means \"point refuted a thousand times.\" \n \n \n It is more accurate to say that those processes (burning, friction) are releasing the stored (useable) thermal energy. What happens when you use thermal energy in an imperfect system, as described by the second law of thermodynamics? The amount of unuseable heat energy increases! Thank you for illustrating my point.\n If you don't understand thermodynamics, don't bring it up. \n\n \n So only scientists understand, and only scientists should determine if ID is science? There is one thing that hasn't changed much since the founding of the US, the minority of technically educated people, and the majority of technically uneducated people. The founders considered themselves quite intelligent when it came to politics, yet they intended for the masses to make far more political decisions than they made themselves. They would have intended for the people, not scientists, to decide if ID should be taught in public schools.\n \n \n \n \nYou're declaring yourself my greatest enemy? Now there's a good one.\n\n \n It may seem that way to you - but no, I was talking about all ID proponents.\n \n \n \n \nNah, trolling is different. Trolling is spewing BS to elicit an inflammatory response. Or repeatedly bringing up questions that have been answered and points that have been refuted.\n \n \n \n If this is your response, then you do not understand the wager. Try again.\n \n \n You're entitled to your opinion. The fact remains that your \"version\" of the wager wasn't representative of Pascal's wager, probably because (as exposed above) you don't understand it. You'll have a very, very hard time countering what you don't understand, so give that link another look. \n\n \n I was simply making thoughtful comments that the link inspired - it's called debate. By putting up the link and referring to earthworms, elephants, beer volcanoes etc, and then trying to drain me of time referring to all it's associated links, you were \"spewing BS to elict an inflammatory response\".\n \n \n \nFunny, this nice warm fire (which is converting useable heat energy to unuseable heat energy on a net basis) fueled by your debunked statements says otherwise.\n\n \n \n From Wikipedia: a troll is a person who posts inflammatory messages on the internet, such as on online discussion forums, to disrupt discussion or to upset its participants. \n\n \n Yep, that's the real you, all right. :)", 
   {}, 
   179421, 
   null, 
   1132202880.0
  ], 
  [
   179848, 
   null, 
   "Howard Beale", 
   "marc9000:\n \n I made the statement that: \"evolution is a scientific theory not a fact. Intelligent Design is a belief not a scientific theory.\"\n \n You responded:\nA closed mind is easily boggled. Can you see the difference between science as a tool, and scientific philosophy as a worldview?\nI asked you to define what you meant by \"scientific philosophy\" and you have not.\n \n I'd appreciate it if you did.\n \n Also, Can you name one scientist who has demonstrated that ID is a valid scientific theory? Please reference his research that supports his position.", 
   {
    "unicode_changes_made": true
   }, 
   178866, 
   null, 
   1132203480.0
  ], 
  [
   179864, 
   null, 
   "electrolyte", 
   "It also doesn't matter if we're talking about the Bible. Many consider it's details to be irrefutably observed, documented, predictable, and mosty understood.\n\n Now there's a fun quote. The Bible's details have been irrefutably observed? Start a thread about the accuracy of the Bible in the appropriate forum. Go ahead. I'll quickly comment on the rest of your Bible-related comment immediately below.\n \n \nConsidering today's archeological findings that harmonize with it, as well as it's documentation of many historically confirmed public figures, it's phenomena is negated only if you have a closed mind.\n\n No, it's only not negated when you ignore the plethora of evidence that doesn't \"harmonize\" with it. Start a thread and watch parts of that plethora come flooding in.\n \n \n \nThat's the atheist opinion, a minority opinion in the US.\n\n Funny, I seem to recall a prominent Christian scientist arguing my point in the Dover trial. Quite obviously, it's not an \"atheist\" opinion, nor is it the minority opinion. You are wrong.\n Even if your statement were accurate, majority opinion of laypersons means nothing. On the other hand, the fact that ID has failed to produce evidence is not only the vast majority opinion of biological scientists (i.e., non-laypersons who actually are authorities on the subject), but even some ID proponents acknowledge that ID doesn't lend itself to research or evidence.\n \n \n \n[Dembski says:]\nThe second law wasn't violated, it was just counteracted by an intelligent agent making use of the fourth law.\n\n\n The fourth law not only isn't a law, but we have evidence that it is \"violated.\" Check out the sequence of carbamoyl phosphate synthetase. Dembski is what we in the science biz call, \"making sh** up.\"\n \n \n \nWhy don't you want to give it a chance? Are you afraid of something?\n\n Now there's a troll-y comment if ever I've seen one.\n I'm not \"afraid\" of ID. I'm just opposed to ignorance.\n \n \n \nWhat establishes Occam's razor as the undisputed law? But let's assume that it is.\n\n Now there's a hilarious question coming from someone echoing advocation of a fourth law of thermodynamics. But yes, let's, because it has a great track record.\n \n \n \nIf one has an open mind and doesn't start with the conclusion that man has to be the highest form of life [...]\n\n I don't start with the conclusion that \"man has to be the highest life form.\"\n \n \n \n[...] an intelligent designer is the simplest conclusion.\n\n You think an all-powerful being is simple? Have you ever taken a course in philosophy or logic? The \"God of the Gaps\" idea is not only invalid, but it retreats each and every time we find natural explanations, not to mention it doesn't actually answer any question.\n \n \n \nthere is one big problem - humans are not perfect.\n\n And this is a problem for \"our subject here\" how, exactly? We were talking about what science does and does not say, not what teachers do and do not say. [See below for irony.]\n \n \n \nThis is about politics, but applies to religion as well.\n\n That's strange, I could've sworn we were talking about science. Not hard to see how you've forgotten, though.\n \n \n \n[...] he won't be taken as seriously as he would by somewhat distancing himself from Christianity.\n\n He (dodgingly) claims that he believes in common descent. Yet the religious right loves him.\n \n \n \nIt's fair - many atheists masquarade as Christians.\n\n If this were true, what's the relevance? There is none.\n \n \n \nTwo or three? How about one - I've never noticed more than one from you.\n\n What is it you expect me to post? You made the positive claim.\n \n \n \nhttp://www.freerepublic.com/focus/f-news/1129837/posts\n\n So you're objecting to learning about Islam in a class that teaches world religions?! The course doesn't promote the Muslim religion nor does it prevent one's faith from being followed.\n Out of curiosity, what do the students do for the Christian and Jewish units? I suspect this is a case of the pot calling the kettle black.\n \n \n \nI didn't abandon it. It was Behe's argument anyway. There are probably countless other examples of it. \n\n You presented Behe's statement to assert your argument. I dismantled it. You say you haven't abandoned it, but you don't counter my points or pick new ones. Instead you just say there are \"probably\" others. Provide examples or drop it. Don't lecture me about \"debate\" when you can't support your claims.\n \n \n \nTo a much greater degree, the Bible is peer-reviewed and approved also.\n\n Bring that up in the Bible thread. I suggest the Religion forum, but I'm not sure which would be the best.\n \n \n \nBiblical information is established.\n\n Bible accuracy thread.\n \n \n \nThen don't rearrange the equation, or don't start mindlessly clanging the fallacy bell, your choice.\n\n If I misstated your position, then explain how and refute my arguments if applicable. My explanation that you quoted was within the bounds of propositional logic, in which the argument from ignorance is a fallacy.\n \n \n \nStudents. You have many straw man alter egos, they're all coming at me.\n\n Yes, the book is for students: college students. What's your point?\n You have failed to explain why my points are straw men.\n \n \n \nI hope I've effectively illistrated my point by showing how secular schools can attempt to portray that science is the only source of information concerning origins.\n\n You've failed to show that science claims to do so. Since you like relying on instructor error, blame the instructor. Regardless, you've dodged my point. I take you can't counter, so we won't discuss it further.\n \n \n \nRestore? When was it ever secular in the past? \n\n The Pledge was changed in 1954, IIRC, and \"In God We Trust\" first appeared sometime in the mid-late 1800s, IIRC. That's a lot of time of secularity before that.\n \n \n \nIt's the year 2005. (The \"year of our Lord\" 2005.) Does Newdow want to change our dating method?\n\n That's the way the Gregorian calendar was set up. Lots of people are using BCE and CE, now. I don't know Newdow's views on this subject, not that they're relevant to our discussion.\n \n \n \nThat's right, because they don't try to use the courts to thwart the will of the people like Newdow does.\n\n The Constitution, with the exception of amendments that are a result of the will of the people (as allowed by Article V of the Constitution), supercedes the \"will of the people.\" In fact, Falwell lost a lawsuit because he tried to thwart the First Amendment...\n \n \n \nIt's all about the source of their income.\n\n Yet, all three of my points go unrefuted...\n \n \n \nYour counterexamples were exceptions [...]\n\n And my explanation (you know, the thing you just quoted) was that your statement allows you to always claim any and every counterexample is an exception! Your absurd claim has been dismantled.\n \n \n \nSo only scientists understand, and only scientists should determine if ID is science?\n\n People who know what science is should be among the authorities determining if ID is science. And they have determined that it's not science. Even Behe agrees that it's not science. Stop making this absurd claim unless you have support for your point.\n \n \n \nThey would have intended for the people, not scientists, to decide if ID should be taught in public schools.\n\n No, they would have intended that it stay out of the schools: See the First Amendment and related literature.\n \n \n \nBy putting up the link and referring to earthworms, elephants, beer volcanoes etc, and then trying to drain me of time referring to all it's associated links, you were \"spewing BS to elict an inflammatory response\".\n\n No, I was providing a parody of Pascal's wager; parodying is a common debunking method (see Guanilo). You can't pin the blame on me for your not understanding the wager.\n \n \n You have repeatedly failed to refute or counter my rebuttals. You exhibit complete infamiliarity with propositional as well as deductive logic. You've shown an incredibly resilient misunderstanding of the philosophy of science. You present unrelated comments, hoping to distract from the fact that your points have been defeated. You posted \"references\" which you did not understand. And you seem to keep making statements that you can't back up. ... Then you tell me what a debate is. Nice.\n \n I realize that you won't take the time to learn about these points that you don't understand (Pascal's wager, thermodynamics, propositional logic, the Constitution, the nature of science, the claims of ID, the claims of evolution... need I go on?), and I won't comment on any of them until you've shown you understand; otherwise there's really no point. I can't teach those not willing to learn.\n \n I look forward to hearing your responses to Howard Beale and Terran. I also look forward to a thread on Bible accuracy.", 
   {}, 
   179848, 
   null, 
   1132214400.0
  ], 
  [
   179993, 
   null, 
   "marc9000", 
   "marc9000:\n \n I made the statement that: \"evolution is a scientific theory not a fact. Intelligent Design is a belief not a scientific theory.\"\n \n I asked you to define what you meant by \"scientific philosophy\" and you have not.\n \n I'd appreciate it if you did.\n\n \n I already did - in post #74. You responded in post# 76 that you didn't accept it. That doesn't mean I didn't do it. You'll just have to re-read it.\n \n \nAlso, Can you name one scientist who has demonstrated that ID is a valid scientific theory? Please reference his research that supports his position.\n\n \n You said this in post #62;\n \n \nYou are correct. I could have been more specific. I was trying to point out the difference between a theory and a belief with regard to what is appropriate to be taught in a science class. I did not want to be sidetracked into the \"prove evolution is a fact\" false debate. \n\n \n Why not allow me the same standard you require for yourself? I don't want to be sidetracked into the \"prove ID is a fact\" false debate, when the topic is more about what is taught in schools, and how it's decided.", 
   {
    "unicode_changes_made": true
   }, 
   179848, 
   null, 
   1132278660.0
  ], 
  [
   179994, 
   null, 
   "marc9000", 
   "Now there's a fun quote. The Bible's details have been irrefutably observed? Start a thread about the accuracy of the Bible in the appropriate forum. Go ahead. I'll quickly comment on the rest of your Bible-related comment immediately below.\n \n \n No, it's only not negated when you ignore the plethora of evidence that doesn't \"harmonize\" with it. Start a thread and watch parts of that plethora come flooding in. \n\n \n I don't think I need to start a new thread - it's relavent to this one. If you think there's a plethora of evidence that doesn't harmonize with the Bible, then you've prejudged Proverbs 3:5-6, so it appears you may think that man is the highest form of intelligence. That's a legitimate opinion, but a minority opinion in the US. \n \n \n \n \nFunny, I seem to recall a prominent Christian scientist arguing my point in the Dover trial. Quite obviously, it's not an \"atheist\" opinion, nor is it the minority opinion. You are wrong.\n Even if your statement were accurate, majority opinion of laypersons means nothing.  On the other hand, the fact that ID has failed to produce evidence is not only the vast majority opinion of biological scientists (i.e., non-laypersons who actually are authorities on the subject), but even some ID proponents acknowledge that ID doesn't lend itself to research or evidence. \n\n \n I'm going to skip through all this rage pretty quickly. Below, you lecture me to learn more about the Constitution. The part I bold highlighted above shows that you know far less about the Constitution than I know about science.\n \n \n \n \n \nNow there's a troll-y comment if ever I've seen one.\n I'm not \"afraid\" of ID. I'm just opposed to ignorance.\n\n \n It's not a troll-y comment. I'm asking how balancing naturalistic worldviews of origins that are presented in schools being balanced with ID worldviews, is detrimental to students and therefore society. If you say that ID isn't science, and it is a waste of time, taking away valuable learning time for students, then that's a legitimate complaint. But is that the only one you have? If you weigh it against the many benefits Judeo Christianity has shown to be to society, it's a very weak argument. You'll find an outline of it here;\n \n http://www.heritage.org/Research/Religion/BG1064.cfm\n \n You can keep up with the broken record of how something that is not science should not be in science class. But you'll never admit that atheist theories of life origins are no more science than ID. What percentage of students in all science class actually become scientists, or get involved in any scientific profession? School generally is intended to prepare students for the real world, with it's motivations, goals, philosophies, worldviews, etc. \n \n \n \n \nNow there's a hilarious question coming from someone echoing advocation of a fourth law of thermodynamics. But yes, let's, because it has a great track record.\n\n \n You mock the fourth law of thermodynamics probably the same way Einstein's general law of Relativity was ignored and disliked nearly 100 years ago. If it's proven to be true, it will be another blow for Darwinism, won't it? Should it's possibility not be explored?\n \n \n \n \nThe Pledge was changed in 1954, IIRC, and \"In God We Trust\" first appeared sometime in the mid-late 1800s, IIRC. That's a lot of time of secularity before that.\n\n \n A lot of time of freedom of prayer in schools, Ten Commandments in public places, and other public religion that is outlawed today.\n \n \n \n \nYou have repeatedly failed to refute or counter my rebuttals. You exhibit complete infamiliarity with propositional as well as deductive logic. You've shown an incredibly resilient misunderstanding of the philosophy of science. You present unrelated comments, hoping to distract from the fact that your points have been defeated. You posted \"references\" which you did not understand. And you seem to keep making statements that you can't back up. ... Then you tell me what a debate is. Nice.\n \n I realize that you won't take the time to learn about these points that you don't understand (Pascal's wager, thermodynamics, propositional logic, the Constitution, the nature of science, the claims of ID, the claims of evolution... need I go on?), and I won't comment on any of them until you've shown you understand; otherwise there's really no point. I can't teach those not willing to learn.\n I look forward to hearing your responses to Howard Beale and Terran. I also look forward to a thread on Bible accuracy.\n\n \n Maybe it will dawn on you someday that you don't know everything. Maybe it already has, that's the reason you're so angry. I don't really understand why you (and terran) are on a discussion forum, if it makes you so angry.", 
   {}, 
   179864, 
   null, 
   1132281000.0
  ], 
  [
   180009, 
   null, 
   "Howard Beale", 
   "Marc9000:\n \n \n\n \n I made the statement that: &#8220;evolution is a scientific theory not a fact. Intelligent Design is a belief not a scientific theory.&#8221;\n \n I asked you to define what you meant by &#8220;scientific philosophy&#8221; and you have not.\n \n I&#8217;d appreciate it if you did.\n\n You responded:\n \nI already did - in post #74. You responded in post# 76 that you didn't accept it. That doesn't mean I didn't do it. You'll just have to re-read it.[/\n\n\n \n In fact, I&#8217;ll reprint it:\n \n \nIt is a WORLDVIEW. Many evolutionists can argueably claim to have \"no religion\", to view everything to do with religion from an outside, neutral position. Many in the newsmedia are masters of this. But everyone has a worldview, a perspective that guides their daily lives / a lens through which they view the world. They develop largely through childhood. They deserve to see more than one in school.\nI responded (in post #76): \"It is a WORLDVIEW\" is not a definition. Scientific Philosophy is a specific study, I am just not sure that you know the meaning of the term.\n \n You see, it isn&#8217;t a matter of &#8220;accepting&#8221; your definition, it a simply that you did not define it. Scientific Philosophy is a specific discipline and you don&#8217;t seem to have any idea what it is.\n \n I had also asked:\n \nAlso, Can you name one scientist who has demonstrated that ID is a valid scientific theory? Please reference his research that supports his position. \n\n You responded:\n \nYou said this in post #62;\n\n\n I did post that question in post #62. You still have not answered it. The question then has to be raised: If you can&#8217;t name one scientist who has demonstrated that ID is a valid scientific theory and reference his research that supports his position, why should anyone bother to take anything you say seriously?\n \n \nYou are correct. I could have been more specific. I was trying to point out the difference between a theory and a belief with regard to what is appropriate to be taught in a science class. I did not want to be sidetracked into the &#8220;prove evolution is a fact&#8221; false debate. \n\n You responded:\n \nWhy not allow me the same standard you require for yourself? I don't want to be sidetracked into the \"prove ID is a fact\" false debate, when the topic is more about what is taught in schools, and how it's decided.\n\nThis simply confirms your lack of knowledge. I did not want to get sidetracked in the &#8220;prove evolution is a fact&#8221; debate because it is a strawman debate. I repeat: Darwin's Theory of Evolution is not a scientific fact, it is a valid scientific theory.&#8221; ID is not only not a scientific fact, it is not a valid scientific theory. ID is a religious belief. \n \n Unless you can show that ID is a valid scientific theory by backing your contention up with some work done by some scientist that demonstrates that it is a valid scientific theory, it remains a religious belief no matter how you shuck and jive.\n \n Only scientific theories are appropriate to be taught in science class. Darwin&#8217;s theory has been demonstrated to be a valid scientific theory and there is plenty of research that backs it up. ID has never been demonstrated to be a valid scientific theory, there is not research to back it up as such and you can&#8217;t even name one scientist that has done that.", 
   {}, 
   179993, 
   null, 
   1132285800.0
  ], 
  [
   180016, 
   null, 
   "electrolyte", 
   "I don't think I need to start a new thread - it's relavent to this one.\n\n Because science is based on actual evidence instead of whatever is written in an old book -- regardless of how accurate that book is -- Biblical accuracy is but a tangent to the point at hand.\n \n \n \nI'm going to skip through all this rage pretty quickly.\n\n That's not rage, marc; them's the cold hard facts. Your points have been obliterated beyond salvage.\n \n \n \nBelow, you lecture me to learn more about the Constitution. The part I bold highlighted above shows that you know far less about the Constitution than I know about science.\n\n Way to quote mine and misrepresent! At that point it my post, it was quite obvious that I was talking about the layperson's view on the evolution/ID debate.\n \n \n \nI'm asking how balancing naturalistic worldviews of origins that are presented in schools being balanced with ID worldviews, is detrimental to students and therefore society.\n\n 1) For the same reasons that \"balancing\" science with flat earth theory or geocentrism is detrimental. (Your use of the word \"balance\" is ludicrous.)\n 2) For the same reasons that government advocation of any religion is detrimental.\n \n \n \nIf you say that ID isn't science, and it is a waste of time, taking away valuable learning time for students, then that's a legitimate complaint.\n\n You're damn right it is. And you've yet to refute it. Instead, you seem to think that the \"Oh, c'mon, what can it hurt?\" approach will work.\n \n \n \nBut is that the only one you have?\n\n Have you even been reading? I explained why ID is logically invalid, too. You didn't refute that, either.\n \n \n \nIf you weigh it against the many benefits Judeo Christianity has shown to be to society, it's a very weak argument. You'll find an outline of it here;\n \n http://www.heritage.org/Research/Religion/BG1064.cfm\n\n So you want me to take the word of a \"conservative think-tank\" with Rush Limbaugh quotes on the About Us page? One that denies the establishment clause of the First Amendment? Are you serious? I think all the smoke from the roasting is getting to you.\n \n I'd rather trust, say, a major world newspaper:\n \n \"Societies worse off 'when they have God on their side.'\"\n \n Funny how an academic study totally contradicts the cherry-picking of self-proclaimed right-wingers.\n \n \nBut you'll never admit that atheist theories of life origins are no more science than ID.\n\n Again, just because you say it doesn't make it so. ID has no evidence, and we've been gathering information about abiogenesis since the 1950s (or earlier if you count Oparin.)\n And you'll never admit that secular theories aren't atheistic, no matter how many times it's explained to you. Talk about a broken record...\n \n \n \nYou mock the fourth law of thermodynamics probably the same way Einstein's general law of Relativity was ignored and disliked nearly 100 years ago.\n\n You didn't check out the sequence of carbamoyl phosphate synthetase, did you? You see, Einstein's hypothesis wasn't refuted before he even made it.\n Do you think you're a science historian now? Einstein's ideas weren't \"ignored.\" Scientists were eager for a solar eclipse to test the propositions. (Also, I like how you jump from the General Theory of Relativity to the general law of relativity.)\n \n \n \nA lot of time of freedom of prayer in schools, Ten Commandments in public places, and other public religion that is outlawed today.\n\n Prohibiting religious references on government grounds in no way violates freedom of religion... Not that you've stayed on topic or anything...\n \n \n \nMaybe it will dawn on you someday that you don't know everything.\n\n I don't know everything, but I know a lot more about this subject than you do. That part is quite clear.\n \n \n \n Let's recap:\n \n You haven't refuted a single one of my points.\n You accuse me of raging when I am doing nothing of the sort.\n You purposely try (and yet still fail) to quote me out of context just to make a tangential point.\n You fail after several explanations to grasp the distinction between secularism and atheism; otherwise you do grasp it and purposely misrepresent to set up a straw man.\n You ignore my objections to ID because you don't understand them.\n You continue to speak of thermodynamics, despite your complete and utter lack of education about it.\n You continue to promote your pseudoscientific \"fourth law\" of thermodynamics after I gave you a specific example of said \"law\" being violated.\n \n \n But now I see why you refuse to learn. \"God forbid you think for yourself,\" which is what Proverbs 3:5 pretty much says. Unsurprisingly, it's what ID says too.", 
   {}, 
   180009, 
   null, 
   1132288020.0
  ], 
  [
   180036, 
   null, 
   "nox", 
   "Good riddance. People who would push religious beliefs in public schools should not be on a school board.", 
   {}, 
   178158, 
   null, 
   1132299480.0
  ], 
  [
   180464, 
   null, 
   "marc9000", 
   "Marc9000:\n I responded (in post #76): \"It is a WORLDVIEW\" is not a definition. Scientific Philosophy is a specific study, I am just not sure that you know the meaning of the term. \n\n \n From dictionary.com\n \nPHILOSOPHY;\n \n Love and pursuit of wisdom by intellectual means and moral self-discipline. \n Investigation of the nature, causes, or principles of reality, knowledge, or values, based on logical reasoning rather than empirical methods. \n A system of thought based on or involving such inquiry: the philosophy of Hume. \n The critical analysis of fundamental assumptions or beliefs. \n The disciplines presented in university curriculums of science and the liberal arts, except medicine, law, and theology. \n The discipline comprising logic, ethics, aesthetics, metaphysics, and epistemology. \n A set of ideas or beliefs relating to a particular field or activity; an underlying theory: an original philosophy of advertising. \n A system of values by which one lives: has an unusual philosophy of life. \n\n \n Note the one I bold highlighted - putting the word \"scientific\" in front of it could very well mean a system of values by which one lives from a naturalistic point of view.\n \n Now another definition;\n \nWORLDVIEW; \n \n The overall perspective from which one sees and interprets the world. \n A collection of beliefs about life and the universe held by an individual or a group. \n\n \n \nYou see, it isn't a matter of \"accepting\" your definition, it a simply that you did not define it. Scientific Philosophy is a specific discipline and you don't seem to have any idea what it is. \n\n \n I believe I did define it, so I guess we have to agree to disagree. What I don't have any idea of is what your point is.\n \n \n \n \nI did post that question in post #62. You still have not answered it. The question then has to be raised: If you can't name one scientist who has demonstrated that ID is a valid scientific theory and reference his research that supports his position, why should anyone bother to take anything you say seriously? \n\n \n Maybe because it was only your question, and you don't represent \"anyone\"? Not everyone thinks that scientists are a superior class, capable of superseding the will of the people as outlined in the Constitution. Scientists are imperfect human beings first, and scientists second, whether they are Christians or not. \n \n But from a long list of Christian Scientists, I easily found three who use phrases that clearly state what they think of ID being a scientific theory.\n \n Edward A. Boudreaux\n http://www.answersingenesis.org/home/Area/isd/boudreaux.asp\n \n \nScience tells me that evolution is certainly not scientific, while creation is not in disagreement with what is truly scientific. \n\n \n Alan Galbraith\n http://www.answersingenesis.org/creation/v22/i2/recover.asp\n \n \n I was convinced that the creation point of view, from a scientific standpoint, was the only credible position that a thinking person with a scientific background could accept.' \n\n \n Stephen Grocott\n http://www.answersingenesis.org/home/area/isd/grocott.asp\n \n \nScience is a wonderful thing. I enjoy it a great deal. As a scientist, I count myself lucky to be able to do science and to be good at it. And as a scientist, I have far more trouble trying to perform the mental gymnastics necessary to explain the world from an evolutionary, long-age viewpoint than I do from the young-earth, creationist viewpoint.\n \n Although neither viewpoint can be proven (since they are both outside science), the circumstantial evidence, the consistency of the evidence and the foundation upon the most fundamental laws of science lead me to be much more comfortable believing in creation. \n\n \n \n \n \nThis simply confirms your lack of knowledge. I did not want to get sidetracked in the \"prove evolution is a fact\" debate because it is a strawman debate. I repeat: Darwin's Theory of Evolution is not a scientific fact, it is a valid scientific theory.\" ID is not only not a scientific fact, it is not a valid scientific theory. ID is a religious belief. \n\n \n Your opinion - your wordgames, nothing more.\n \n \nUnless you can show that ID is a valid scientific theory by backing your contention up with some work done by some scientist that demonstrates that it is a valid scientific theory, it remains a religious belief no matter how you shuck and jive.\n \n Only scientific theories are appropriate to be taught in science class. Darwin's theory has been demonstrated to be a valid scientific theory and there is plenty of research that backs it up. ID has never been demonstrated to be a valid scientific theory, there is not research to back it up as such and you can't even name one scientist that has done that.\n", 
   {
    "unicode_changes_made": true
   }, 
   180009, 
   null, 
   1132466100.0
  ], 
  [
   180465, 
   null, 
   "Howard Beale", 
   "marc9000:\n \n It seems to me that it is your opinion that a science class should not be limited to the teaching of scientific theories. Is that correct?", 
   {}, 
   180464, 
   null, 
   1132466940.0
  ], 
  [
   180466, 
   null, 
   "trebor", 
   "From dictionary.com\n \n \n Note the one I bold highlighted - putting the word \"scientific\" in front of it could very well mean a system of values by which one lives from a naturalistic point of view.\n \n Now another definition;\n \n\n \n I see. So you want to redefine things to make things along your viewpoint. Sorry, but science doesn't work that way.\n \n \n \n \n \n I believe I did define it, so I guess we have to agree to disagree. What I don't have any idea of is what your point is.\n \n \n \n\n \n But from a long list of Christian Scientists, I easily found three who use phrases that clearly state what they think of ID being a scientific theory.\n \n Edward A. Boudreaux\n \n \n \n Alan Galbraith\n \n \n \n Stephen Grocott\n \n \n \n\n \n And I note that not one of those is a biologist.\n \n \n \n \n Your opinion - your wordgames, nothing more.[/QUOTE]", 
   {}, 
   180464, 
   null, 
   1132468020.0
  ], 
  [
   180467, 
   null, 
   "marc9000", 
   "marc9000:\n \n It seems to me that it is your opinion that a science class should not be limited to the teaching of scientific theories. Is that correct?\n\n \n Nope, incorrect. The above three, (and many more) say that ID is science.", 
   {}, 
   180465, 
   null, 
   1132468740.0
  ], 
  [
   180468, 
   null, 
   "electrolyte", 
   "Edward A. Boudreaux\n http://www.answersingenesis.org/home/Area/isd/boudreaux.asp\n \n\n \n \n \nEdward A. Boudreaux\n Similarly, cosmologists maintain that some sort of big-bang scenario, initiated from a unique physical singularity undergoing a quantum fluctuation in some 10^43 seconds, is the process by which the origin of the entire universe was initiated.\n\n I think he means 10^-43 seconds. That's quite a difference.\n \n \n \nEdward A. Boudreaux\n The structured portion of hemoglobin which binds iron is called a porphrin ring.\n\n That's porphyrin ring.\n \n \n \nEdward A. Boudreaux\n Proteins are composed of amino acid molecules chemically bound together by what are called polypeptide bonds.\n\n He means peptide bonds.\n \n \n \n \nEdward A. Boudreaux\n [...] I was, nonetheless, more than adequately informed as a scientist to be able to read and comprehend various technical publications on evolution.\n\n Apparently not. He did so little actual comprehension that he doesn't know how to spell porphyrin and doesn't know the name of a peptide bond, and we're supposed to regard him as an expert? He admits himself that he isn't educated in any of the strong points of evolution, and he doesn't even know the difference between Planck time and a number of seconds that hasn't even elapsed over 14 billion years. Furthermore, the entire book excerpt on his page is nothing but a silly appeal to the anthropic principle. Get real.\n \n \n Still, I guess you didn't notice that not a single one of those people said that ID is a valid scientific theory? So unless you're calling ID the same thing as creationism, you haven't found three, you've found zero.", 
   {}, 
   180464, 
   null, 
   1132469220.0
  ], 
  [
   180470, 
   null, 
   "trebor", 
   "Nope, incorrect. The above three, (and many more) say that ID is science.\n\n \n \n You are doing the logical fallacy known as 'Appeal to authority'. Not one works in the biological field. One rejects 99.5% of all science by rejecting the astrophyscal, the chemical , the geological and the physics evidence of a world being older than 6000 years.\n \n To demonstrate that I.D. is science, you can't just point to some rather minority people whose field of study has nothing to do with biology what so ever, but rather have to answer the following questions.\n \n 1) What is the evidence for I.D. This is different than critiism against the TOE.\n \n 2) What explanatory power does I.D. have for about why things are the way they are.\n \n 3) How can i.d. be tested? \n \n 4) What predictions can it make? \n \n \n As far as I can see, 1) no evidence for i.D. 2) no explanitory power, 3) it can not be tested, 4) it does not make any predictions.\n \n Until you can demonstrate that I am incorrect on all 4 of those items, I.D. is not science.", 
   {}, 
   180467, 
   null, 
   1132469580.0
  ], 
  [
   180472, 
   null, 
   "marc9000", 
   "1) For the same reasons that \"balancing\" science with flat earth theory or geocentrism is detrimental. (Your use of the word \"balance\" is ludicrous.)\n\n \n By \"geocentrism\", did you really mean egocentrism?? LMAO", 
   {}, 
   180016, 
   null, 
   1132470300.0
  ], 
  [
   180474, 
   null, 
   "trebor", 
   "By \"geocentrism\", did you really mean egocentrism?? LMAO\n\n \n \n I see. You can't answer the point, so you go with the insult.", 
   {}, 
   180472, 
   null, 
   1132470540.0
  ], 
  [
   180476, 
   null, 
   "marc9000", 
   "\n As far as I can see, 1) no evidence for i.D. 2) no explanitory power, 3) it can not be tested, 4) it does not make any predictions.\n \n Until you can demonstrate that I am incorrect on all 4 of those items, I.D. is not science.\n\n \n As far as I can see from reading what the above three scientists and many more say, there 1) is no evidence for evolutionary origins 2) no explanitory power for origins, 3) naturalistic origins cannot be tested 4) it does not make any predicitions about origins.\n \n Evolutionary theory of origins is equally not science.", 
   {}, 
   180470, 
   null, 
   1132470720.0
  ], 
  [
   180478, 
   null, 
   "marc9000", 
   "I see. You can't answer the point, so you go with the insult.\n\n \n Returning the exact same type of insult he made. Why the double standard?", 
   {}, 
   180474, 
   null, 
   1132470780.0
  ], 
  [
   180480, 
   null, 
   "pandion", 
   "That's porphyrin ring.\n \n He means peptide bonds.\n Ah! So you are a chemist or a biochemist. Nice catch. Sadly, I missed both incorrect references. But I'm a biologist.", 
   {}, 
   180468, 
   null, 
   1132471080.0
  ], 
  [
   180481, 
   null, 
   "trebor", 
   "Nope, incorrect. The above three, (and many more) say that ID is science.\n\n \n \n Then, you will be able to answer the questions I put forth. Those are the questions that I.D< has to answer for it to qualify as science. You seem to be avoiding that for some reason.", 
   {}, 
   180467, 
   null, 
   1132471140.0
  ], 
  [
   180483, 
   null, 
   "trebor", 
   "Returning the exact same type of insult he made. Why the double standard?\n\n \n \n I answered the posts you gave forth. You have not responded to them.\n \n You do seem to ignore the questions I put forth. Why is that? Why can't you answer them?\n \n Let me repeat them for you. Maybe you skipped it.\n \n \n 1) What is the evidence for I.D. This is different than critiism against the TOE.\n \n 2) What explanatory power does I.D. have for about why things are the way they are.\n \n 3) How can i.d. be tested?\n \n 4) What predictions can it make?", 
   {}, 
   180478, 
   null, 
   1132471560.0
  ], 
  [
   180485, 
   null, 
   "pandion", 
   "Nope, incorrect. The above three, (and many more) say that ID is science.\nActually not. There aren't very many more who would recognize ID creationism as science. Various lists of \"scientists who oppose evolution\" or \"scientists who accept creationism\" or \"scientists who think that ID is scientific\" are only a hundred or so people, many of whom have degrees in irrelevant fields. I mean, who really cares what someone with a degree in computer science thinks about biological evolution. On the other hand, Project Steve lists 637 PhD scientists, mostly in biological science (with some in physics, astrophysics, geology, and paleontology), all named Steve. People named Steve comprise about 1% of the population. Hopefully, you can do the math and compare 1% of scientists with relevant degrees to your list of less than 150 \"creation scientists\" (many without PhD), many in irrelevant fields.\n \n The short answer is that ID isn't science. If it were, there would be a body of knowledge published in peer reviewed literature. ID is over 10 years old and yet there has been no research, no hypotheses presented, no predictions, no testing. In short, ID is an assertion without evidentiary support. Show me otherwise. Cite the scientific literature.", 
   {}, 
   180467, 
   null, 
   1132472160.0
  ], 
  [
   180486, 
   null, 
   "electrolyte", 
   "Returning the exact same type of insult he made. Why the double standard?\n\n Disagreeing with one's use of the word \"balance\" is on par with calling someone egocentric?\n \n Notice that rather than comment on my relevant objections to your \"sources\" for ID being a science or any of the numerous points in my earlier post, you post a reply comprised solely of a single remark that is admittedly an insult.\n \n Would you please lecture us on double standards some more, marc? Oh, pretty please?", 
   {}, 
   180478, 
   null, 
   1132473780.0
  ], 
  [
   180487, 
   null, 
   "electrolyte", 
   "Ah! So you are a chemist or a biochemist. Nice catch. Sadly, I missed both incorrect references. But I'm a biologist.\n\n Technically, my degree is in chemistry, but I got it via the biochemistry option. So can't I be both? ;)\n \n And those things were a bit nit-picky, but a true authority wouldn't make those mistakes. Obviously this guy doesn't know what he's talking about when it comes to biological evolution (and probably biology in general).", 
   {}, 
   180480, 
   null, 
   1132474080.0
  ], 
  [
   180488, 
   null, 
   "Howard Beale", 
   "Nope, incorrect. The above three, (and many more) say that ID is science.\nSorry, but not one of the men you site claims that ID is a valid scientific theory. They are simply stating their belief and belief does not make an idea a valid scientific theory.", 
   {}, 
   180467, 
   null, 
   1132474140.0
  ], 
  [
   180489, 
   null, 
   "electrolyte", 
   "On the other hand, Project Steve lists 637 PhD scientists, mostly in biological science (with some in physics, astrophysics, geology, and paleontology), all named Steve.\n\n Project Steve is up to [your snicker here] 666 Steves.\n \n *** Edit: Aw, two more Steves recently, up to 668.", 
   {}, 
   180485, 
   null, 
   1132474200.0
  ], 
  [
   180599, 
   null, 
   "marc9000", 
   "You are doing the logical fallacy known as 'Appeal to authority'. Not one works in the biological field. One rejects 99.5% of all science by rejecting the astrophyscal, the chemical , the geological and the physics evidence of a world being older than 6000 years.\n \n To demonstrate that I.D. is science, you can't just point to some rather minority people whose field of study has nothing to do with biology what so ever, but rather have to answer the following questions.\n\n \n Here are three who ARE Biologists;\n \n David A. Dewitt, Arthur Jones, Lane P. Lester.\n \n http://www.answersingenesis.org/docs2002/dw_origin.asp\n \n Dewitt\n \nScientists who promote a spontaneous origin of life without a creator begin with the assumption that God does not exist. Then they devise an imaginative scenario whereby molecules come together to form a living being. Since the evolutionists have an \"explanation\", they use it to insist that life can arise without God. This is simply circular reasoning. \n\n \n This is a concise explanation of why anti-ID evolution is no more science than ID. \n \n http://www.answersingenesis.org/home/Area/isd/jones.asp\n \n Jones\n \nIt is commonly claimed by secular scientists that creationism is a \"science stopper.\" The contention is that to ascribe anything (e.g., the origin of living organisms) to the direct action of God is to cut off all scientific inquiry. This seems such simple common sense that it has been very persuasive. Nevertheless, it is not difficult to show that the argument is fallacious.\n\n \n http://www.answersingenesis.org/creation/v20/i2/genetics.asp\n \n Lester\n \nOnly by ignoring the total implications of modern genetics has it been possible to maintain the fiction of evolution.\n\n \n \n \n \n1) What is the evidence for I.D. This is different than critiism against the TOE.\n \n 2) What explanatory power does I.D. have for about why things are the way they are.\n \n 3) How can i.d. be tested? \n \n 4) What predictions can it make? \n \n \n As far as I can see, 1) no evidence for i.D. 2) no explanitory power, 3) it can not be tested, 4) it does not make any predictions.\n \n Until you can demonstrate that I am incorrect on all 4 of those items, I.D. is not science.\n\n \n That is true, as long as atheists are the only ones permitted to define science. \n \n Grocott\n \nWhat is science?\n The first place to start is with a definition of science. Many exist, but most of them come down to something like, \"If something is scientific, it is observable and testable (i.e., able to be repeated).\"\n \n Now it might surprise readers without a scientific background to hear me say that very few scientists have any real idea what science is. However, if you are a scientist you will probably acknowledge the truth of this seemingly nonsensical statement. In my undergraduate studies and postgraduate research, I can't ever recall anyone telling me what science is (and isn't!), showing me what it is, or providing me with an explanation of how it operates. If you are studying science or working with scientists and you doubt me, I challenge you to ask them for a definition of what is \"scientific.\" After a pause, most of them would not be able to give an answer much deeper than \"It is what scientists do.\"\n \n As an undergraduate, I was taught to remember, not to think. Sure, I was given tools which I could use to think, but I wasn't actually taught to think. Then, as a Ph.D. researcher I worked in a very narrow field (as do all Ph.D. researchers), and so the breadth of a question like \"What is the definition of scientific?\" was absolutely irrelevant to me. Upon graduation and working as a research scientist for 17 years and as a leader of other scientists, the question has never arisen, nor apparently needed to have been asked. My point is that most scientists don't really know what is or isn't scientific, because it rarely affects what they do.\n \n Why make a big deal of this? The reason is because creation and evolution are actually both outside the realms of science and, to know this, you need to know what science is-and as we have seen, most scientists don't.\n\n \n Who is qualified to define what science is?", 
   {
    "unicode_changes_made": true
   }, 
   180470, 
   null, 
   1132530120.0
  ], 
  [
   180602, 
   null, 
   "marc9000", 
   "Actually not. There aren't very many more who would recognize ID creationism as science. Various lists of \"scientists who oppose evolution\" or \"scientists who accept creationism\" or \"scientists who think that ID is scientific\" are only a hundred or so people, many of whom have degrees in irrelevant fields. I mean, who really cares what someone with a degree in computer science thinks about biological evolution. On the other hand, Project Steve lists 637 PhD scientists, mostly in biological science (with some in physics, astrophysics, geology, and paleontology), all named Steve. People named Steve comprise about 1% of the population. Hopefully, you can do the math and compare 1% of scientists with relevant degrees to your list of less than 150 \"creation scientists\" (many without PhD), many in irrelevant fields.\n \n The short answer is that ID isn't science. If it were, there would be a body of knowledge published in peer reviewed literature. ID is over 10 years old and yet there has been no research, no hypotheses presented, no predictions, no testing. In short, ID is an assertion without evidentiary support. Show me otherwise. Cite the scientific literature.\n\n \n It's clear that the percentage of scientists who believe ID to be science is small. As I said, scientists are human first and scientists second. All scientists who do or don't take ID seriously don't do it on the basis of their education. They do it on their human worldview. If one presupposses that God doesn't exist, evolution can't lose. If one presupposses that there is a God, then evolution can't win. \n \n All people make those presuppositions, and it has nothing to do with education. That's why the US Constitution doesn't leave so many decisions only to the educated.", 
   {}, 
   180485, 
   null, 
   1132530600.0
  ], 
  [
   180603, 
   null, 
   "marc9000", 
   "Sorry, but not one of the men you site claims that ID is a valid scientific theory. They are simply stating their belief and belief does not make an idea a valid scientific theory.\n\n \n And anyone who declares that evolutionary origins are science is simply stating his beliefs as well, and does not make it a valid scientific theory.", 
   {}, 
   180488, 
   null, 
   1132530720.0
  ], 
  [
   180605, 
   null, 
   "Howard Beale", 
   "And anyone who declares that evolutionary origins are science is simply stating his beliefs as well, and does not make it a valid scientific theory.\nSorry again, Marck. Evolution has been shown to a valid scientfic theory (and some aspects of it have been proven to be scientific fact). A statement like yours simply reveals that you do not kow what a valid scientific theory is. I suggest your read up on it. At this point you are simply defending a lie. The problem isn't that you don't know, the problem is you think you don't have anything to learn.\n \n I can say that I have read Big Bill Debmski, Mike Behe and Dr. Phil Johnson. Have you even read Darwin?", 
   {}, 
   180603, 
   null, 
   1132531260.0
  ], 
  [
   180608, 
   null, 
   "marc9000", 
   "Sorry again, Marck. Evolution has been shown to a valid scientfic theory (and some aspects of it have been proven to be scientific fact). \n\n \n I know some aspects of it have. Regarding changes yes, regarding origins, no. \n \n \nA statement like yours simply reveals that you do not kow what a valid scientific theory is. I suggest your read up on it. At this point you are simply defending a lie. The problem isn't that you don't know, the problem is you think you don't have anything to learn. \n \n I can say that I have read Big Bill Debmski, Mike Behe and Dr. Phil Johnson. Have you even read Darwin?\n\n \n Why didn't you read the very short copy/pastes I provided above? \n \n Again, who is qualified to define what science is?", 
   {}, 
   180605, 
   null, 
   1132531980.0
  ], 
  [
   180609, 
   null, 
   "trebor", 
   "I know some aspects of it have. Regarding changes yes, regarding origins, no. \n \n \n \n Why didn't you read the very short copy/pastes I provided above? \n \n Again, who is qualified to define what science is?\n\n \n Scientists are.. based on PEER REVIEW, RESULTS and TESTING.\n \n I will note you avoided the questions I had given about what I.D. did to be 'science'. Could it be that you can't answer it?? I think so.\n \n At this point, you have gotten to the point you are pouting, holding your ears and screaming at the top of your lungs 'I CAN'T HERE YOU'. You are being\n willfully ignorant.", 
   {}, 
   180608, 
   null, 
   1132532160.0
  ], 
  [
   180610, 
   null, 
   "marc9000", 
   "Scientists are.. based on PEER REVIEW, RESULTS and TESTING.\n \n I will note you avoided the questions I had given about what I.D. did to be 'science'. Could it be that you can't answer it?? I think so.\n\n \n And another one checks in who didn't read my copy/pasts by BIOLOGISTS. They answered all your questions.\n \n \nAt this point, you have gotten to the point you are pouting, holding your ears and screaming at the top of your lungs 'I CAN'T HERE YOU'. You are being\n willfully ignorant.\n\n \n That's HEAR. :p", 
   {}, 
   180609, 
   null, 
   1132532460.0
  ], 
  [
   180612, 
   null, 
   "Howard Beale", 
   "I know some aspects of it have. Regarding changes yes, regarding origins, no.\nSome aspects are actually considered facts. With regard to the origin of species, evolution is a valid scientific theory and there is considerable scientific research and experimentation which has all been reviewed that demonstrates this.\n \n Evolution does not involve itself with the origin of the universe (at least to me knowledge), if that is what you are talking about. That is the realm of quantum physics, not biology. Evolution is a theory of the science of biology, not metaphysics or quantum physics.\n \n \nWhy didn't you read the very short copy/pastes I provided above? \nI did. None of the scientists there demonstrated or even claimed that they had demonstrated that ID is a valid scientific theory. To do that they would have to formulate a hypothesis based on observation put it through the scrutiny of the scientific method of evaluation and submit it for peer review. It is impossible to demonstrate that ID is a valid scientific theory because science by definition seeks natural explanations. ID postulates or seeks to prove an extra-natural explanation. Extra-natural ohenomena is the province of metaphysics, not biology.\n \n Biology does not bother itself with extra-natural explanations, only natural ones. That focus has lead to all the progress with regard to illness and disease. A biologist has to be able to find the \"cure\" in nature in order for him to help anyone. Whether the aspect of nature had as its source an intelligent designer is irrelevant to the biologist, he just want to get the cure to the patients. \n \n \nAgain, who is qualified to define what science is?\nScience is already defined as (among other things) seeking natural explanations. That is why scientists have no problem with beliving in God or an intelligent designer, they just say it is not a natural, provable, explanation and therefore cannot help them in their limited field of study.\n \n It would be like teaching Football strategy in an English Lit class. You could do it, it just would take time away from what the class is about.", 
   {
    "unicode_changes_made": true
   }, 
   180608, 
   null, 
   1132533840.0
  ], 
  [
   180617, 
   null, 
   "electrolyte", 
   "Dewitt\n Scientists who promote a spontaneous origin of life without a creator begin with the assumption that God does not exist.\n\n This is totally false. We've already discussed theistic evolutionists. We've also discussed how origin of life is outside of evolutionary theory. Either rebut what I've told you or drop it; people simply stating otherwise doesn't cut it. Your assertion that evolution is not science remains unsupported.\n \n \nJones\n First, the argument is based on ignorance of all the different ways in which Christian faith can enter into science and of how fruitful these have been.\n\n A funny statement: it shows his complete and utter lack of understanding of the realm of science.\n \n \n \nJones\n Second, whereas the direct action of God may cut off one type of explanation, others will remain and may even be enhanced.\n\n A pointless statement: for example, \"whereas the direct action of leprechauns may cut off one type of explanation...\" This isn't how science works. Science requires evidence for the leprechauns. Moreover, how does \"theleprechaunsdidit\" enhance other explanations?\n \n \n \nJones\n Third, there is abundant documentation of the fact that evolutionary naturalism has often stopped scientific research.\n\n A ludicrous statement: ask any evolutionary biologist about the research he or she is doing. Jones' \"example\" of this claim is a hoot, too.\n \n \n If showing the argument against using God in science was really as \"not difficult\" as Jones says it is, why are his three points absolutely useless to his assertion?\n \n \n \nLester\n Only by ignoring the total implications of modern genetics has it been possible to maintain the fiction of evolution.\n\n This guy is just talking out of his XXX. 99+% of geneticists (you know, the ones who actually do something) would beg to differ.\n \n ~~~~~\n \n \nIf one presupposses that there is a God, then evolution can't win.\n\n Fine, we'll beat the dead horse. Two words: theistic evolutionists. Now stop trolling.\n \n \n\n \nSorry again, Marck. Evolution has been shown to a valid scientfic theory (and some aspects of it have been proven to be scientific fact).\n\n I know some aspects of it have. Regarding changes yes, regarding origins, no.\n\n More dead-horse beating: evolutionary theory doesn't include the origin of life.\n If you're arguing against only the origin of life, then make that clear and stop posting \"references\" and \"sources\" that talk about biological evolution.\n \n \n \nThat is true, as long as atheists are the only ones permitted to define science. [emphasis added]\n\n So science = atheism now? I'm not going to explain theistic evolution to you again. And your ignoring it won't make it go away. Get your head out of the sand so you can see the thousands upon thousands of religious scientists.\n I must say, I'm glad to finally see you admit that ID does not qualify as science as science is defined. Now we can drop this silly point.\n \n \n \nWhy didn't you read the very short copy/pastes I provided above?\n\n It's absolutely hilarious that you're trying to find Ph.D.s who claim (not show, just claim) that ID is a science, then you paste a piece berating scientists (especially Ph.D.s) for not knowing what science is. You broke my new irony meter.\n \n ~~~~~\n \n \nThe best evidence for Christianity is the intensity of the opposition to it.\n\n So much fun from just one sentence...\n 1) You were recently insisting on the importance of the Bible, but now that importance takes a backseat to dissenters. Interesting.\n 2) You're right... all other \"evidence\" for Christianity is pretty lacking.\n 3) If that logic works, just replace \"Christianity\" with \"evolutionary theory\" and we can lock this entire forum right now!", 
   {}, 
   180612, 
   null, 
   1132537440.0
  ], 
  [
   180618, 
   null, 
   "trebor", 
   "And another one checks in who didn't read my copy/pasts by BIOLOGISTS. They answered all your questions.\n \n \n \n That's HEAR. :p\n\n \n \n NO, they didn't.\n \n The first one (David DeWitt), used the logical fallacy of EQUIVICATION to mix up abiogensis and evolution. He did not address any of the points at all.\n \n The second one say nothing also, just vented , fumed, and semantically said nothing. He made claims that he could not back up with actual data. At best, he makes assertions without understanding. He did not show that Biology was not able to answer those questions I posed, nor did he show that I.D. could answer any of those questions (You have read my questions, right, and you DID read the web pages you pointed me to, right?? Arthur Jones little blurb did not even come close to what I asked for.\n \n As for Lane Lester, he did not answer those questions either. He made claims, but except for saying 'That isn't so' wasn't able to discuss WHY it wasn't so, didn't deal with any data, didn't deal with how evidence falsified how genetics and evolution. While he mentioned how variation comes into being, he did not address selection via the mechianism of natural selection.\n \n In other words, all three articles were assertions not backed up with information. It might stroke the ego of the non-thinking believer.\n \n Also, science is not 'athiestic'. It does not say there is nor is not a god. Many scientiests that accept evolution are Christians.. and accept science as it is defined. IT is NON-THEISTIC, but it is not ATHEISTIC. Do you understand the difference?? I suspect you won't", 
   {}, 
   180610, 
   null, 
   1132538220.0
  ], 
  [
   180633, 
   null, 
   "DamEtel", 
   "trebor: Also, science is not 'athiestic'. It does not say there is nor is not a god.\n\n \n I think you guys can save your breath and keystrokes. marc9000 is totally unwilling and/or incapable of listening to reason.\n \n The fact that science neither says there is or is not a God, and the following fact about there being THEISTIC EVOLUTIONISTS, has been pointed out to marc9000 dozens of times by now: I alone pointed these things out to marc9000 several times in my debate with him about humans origins a few weeks ago. Yet he pigheadedly continues to spew out the same old false 'facts'.\n \n As I've said before, marc9000 is to be pitied. He is completely incapable of thinking for himself: his every thought is tainted by his religion. Give up guys, his brain is controlled by his cult: his brain is not his own to use.", 
   {}, 
   180618, 
   null, 
   1132546800.0
  ], 
  [
   180662, 
   null, 
   "prschuster", 
   "DamEtel wrote:\n As I've said before, marc9000 is to be pitied. He is completely incapable of thinking for himself: his every thought is tainted by his religion. Give up guys, his brain is controlled by his cult: his brain is not his own to use.\n \n \n \n \n Walking -fish:\n Actually, they're all that way. And if a popular religion had a dogma maintaining the existence of the Ether & Phlogiston, there would be a political movement to teach these outdated notions in public school science classes. And physicists who dismissed these notions would be accused of being duped by atheists. It would be just as impossible to discuss the matter with them, because people have no use for logic or critical thinking when they are defending their religious dogma. Every single creationist I've tried to converse with follows the same pattern. My attitude is to just expose such people for what they are so that others who read the posts can see how pointless their arguments are. I do think it is fair to refer to creationist organizations as cults; that is a perfectly legitimate choice of words.", 
   {
    "post_info": {
     "post_title": "They're all that way"
    }
   }, 
   180633, 
   null, 
   1132590480.0
  ], 
  [
   180989, 
   null, 
   "marc9000", 
   "I think you guys can save your breath and keystrokes. marc9000 is totally unwilling and/or incapable of listening to reason.\n\n \n I can't help it if my ancestor monkeys were dumber than your ancestor monkeys! emoticon_cry \n \n \nThe fact that science neither says there is or is not a God, and the following fact about there being THEISTIC EVOLUTIONISTS, has been pointed out to marc9000 dozens of times by now: I alone pointed these things out to marc9000 several times in my debate with him about humans origins a few weeks ago. Yet he pigheadedly continues to spew out the same old false 'facts'.\n\n \n I've been hearing over and over that only \"natural\" things should be taught as science. So theistic evolution should be kept out of schools, and \"metaphysics\", (an impressive sounding name for atheist dreams) should be taught as science. emoticon_rolleyes \n \n \nAs I've said before, marc9000 is to be pitied. He is completely incapable of thinking for himself: his every thought is tainted by his religion. Give up guys, his brain is controlled by his cult: his brain is not his own to use.\n\n \n I probably am guilty of something said by one John Wilson, in the forward of a book I have;\n \n \nBut there's another, subtle danger to which almost every reader of this book is potentially vulnerable. The role of dissenter can be costly, but it can also be powerfully seductive. How easy it is, after reading a book such as this, to puff oneself up with pride, to wax dogmatic about the \"crumbling edifice of evolutionary theory,\" and to fall into the very arrogance that is characteristic of Darwinism at it's worst. \n\n \n I plead guilty as charged. But I could ask Mr. Wilson a question that he probably couldn't answer very well. If the Darwinism arrogance isn't countered on a similar level from which it comes - if we're all too polite to open our eyes and project what it can do, what can stop it from politically eroding the heritage and tradition of the U.S.?\n \n Don't know how many more years I'll be able to say it, but I'll get it out this year anyway - Y'all have a happy Thanksgiving! :)", 
   {}, 
   180633, 
   null, 
   1132714620.0
  ], 
  [
   180993, 
   null, 
   "Terran", 
   "I can't help it if my ancestor monkeys were dumber than your ancestor monkeys! emoticon_cry\n\n Even the simple things you get wrong...\n We aren't descended from monkeys\n \n \n \n \nI've been hearing over and over that only \"natural\" things should be taught as science. So theistic evolution should be kept out of schools, and \"metaphysics\", (an impressive sounding name for atheist dreams) should be taught as science. emoticon_rolleyes \n\n And you miss the point again. Really, I see you know how to turn on a computer, so you must be intentionally misunderstanding statements.\n \n \n \n \nI probably am guilty of something said by one John Wilson, in the forward of a book I have;\n \n \n \n I plead guilty as charged. But I could ask Mr. Wilson a question that he probably couldn't answer very well. If the Darwinism arrogance isn't countered on a similar level from which it comes - if we're all too polite to open our eyes and project what it can do, what can stop it from politically eroding the heritage and tradition of the U.S.?\n\n And again, the US was not founded on christianity. \n How is it polite to insist that people return to the dark ages and let \"the Church\" decide what is and isn't true? No matter how much you insist otherwise (and face it, insistence is all you have, since I have yet to see an actual reasoned argument from you) evolution is a fact, ID is a pipe dream, and creationism is a myth.\n And where is the \"Darwinism arrogance\"? Is it \"arrogance\" to think it unacceptable that we accept as truth the stories in an old book, even if our own senses and experiences contradict it? Is it \"arrogance\" to refuse to allow a very vocal minority of complete loons to decide how we shold live our lives, and what facts are true and which aren't? Give it up already\n \n \nDon't know how many more years I'll be able to say it, but I'll get it out this year anyway - Y'all have a happy Thanksgiving! :)\n\n Yeah, because all those atheistic scientists are trying to ban that holiest of holy days, Thanksgiving...\n \n And enough with the \"persecuted Christian\" routine. It's getting beyond tiresome already.", 
   {}, 
   180989, 
   null, 
   1132716060.0
  ], 
  [
   181005, 
   null, 
   "DamEtel", 
   "Kind of off topic, but consider this: compare atheism vs. religion in terms of killing others.\n \n In atheism, dead is the end. If you kill someone you have forever ended their ability to experience joy and hapiness, to interact with their loved ones, and so on. It's final.\n \n In religion (Christianity, for example), dead is not the end. If you kill someone they either go to heaven or hell, depending upon if they are saved. If they go to heaven, you've in a sense done them a favor since heaven is astronomically better than Earthly life and you've gotten them there sooner, and if you send them to hell, well, they deserved it ... it's their fault they went to hell, not yours. \n \n \n In fact, during one of the \"crusades\" (I believe involving attacking southern France) the Catholics had a saying, \"Kill them all ... God knows his own\", which came better known as, \"Kill them all, and let God sort them out\". In other words, kill the enemy and the allies, the women and the children, the guilty and the innocent: God will handle treating them appropriately in the afterlife. This \"kill them all\" position CAN be - and in fact HAS BEEN - rationalized from a Christian viewpoint; but it cannot be rationalized likewise from an atheist viewpoint.", 
   {}, 
   180993, 
   null, 
   1132719000.0
  ], 
  [
   181760, 
   null, 
   "DamEtel", 
   "trebor: No, but it does mean that someone of faith does not have to reject evolution, and does not have to take genesis as literal.\n\n \n Well, apparently no one at these forums can say how someone of faith should take Genesis. Care to explain?", 
   {}, 
   178978, 
   null, 
   1133071980.0
  ], 
  [
   181779, 
   null, 
   "trebor", 
   "Well, apparently no one at these forums can say how someone of faith should take Genesis. Care to explain?\n\n \n \n It is an allegory, on how man was formed. Most people of faith will accept that.\n \n ANd, I discussed the hebrew already", 
   {}, 
   181760, 
   null, 
   1133097300.0
  ], 
  [
   181826, 
   null, 
   "DamEtel", 
   "DamEtel: Well, apparently no one at these forums can say how someone of faith should take Genesis. Care to explain? \n\n \n \ntrebor: It is an allegory, on how man was formed. Most people of faith will accept that.\n\n \n But where in the Bible does it explain how to properly interpret this \"allegory\"? \n \n If one reads the Creation account in Genesis, one sees God creating certain animals and celestial bodies on certain days, creating Adam from the dust of the Earth, all within 6 days - oh, and yanking a rib out of Adam to create Eve.\n \n If one takes that story literally one knows \"exactly\" what is being said (though we now know it to be false).\n \n If one takes it allegorically, where does the Bible tell its readers how to properly interpret that Creation myth? Each person can interpret it differently? Then how does one come to know The Truth about Creation by reading the Bible: the Word of the Almighty God?", 
   {}, 
   181779, 
   null, 
   1133122380.0
  ], 
  [
   181840, 
   null, 
   "trebor", 
   "But where in the Bible does it explain how to properly interpret this \"allegory\"? \n \n If one reads the Creation account in Genesis, one sees God creating certain animals and celestial bodies on certain days, creating Adam from the dust of the Earth, all within 6 days - oh, and yanking a rib out of Adam to create Eve.\n \n If one takes that story literally one knows \"exactly\" what is being said (though we now know it to be false).\n \n If one takes it allegorically, where does the Bible tell its readers how to properly interpret that Creation myth? Each person can interpret it differently? Then how does one come to know The Truth about Creation by reading the Bible: the Word of the Almighty God?\n\n \n \n To properly explain the allegory, you don't go to the bible, you go to the talmud and then you see a number of different commentaries on it.\n \n \n The problem is that you are looking at a religious book as if it was scientirfic fact.. it is not, and was never meant to be (despite teh fundies insistance of it).", 
   {}, 
   181826, 
   null, 
   1133124060.0
  ], 
  [
   181848, 
   null, 
   "DamEtel", 
   "trebor: To properly explain the allegory, you don't go to the bible, you go to the talmud and then you see a number of different commentaries on it.\n\n \n Oh, so the Holy Bible is useless for its claimed purpose: it's the Talmud that should be being preached in all Christian churches as the Word of the Almighty God (for the parts that overlap). \n \n So when are all the Christians going to become as wise as you and switch books?\n \n And even then, Obvious Child, Howard Beale, and you, trebor, have been saying that the 'original texts' have to be interpreted poetically or allegorically? So where's the key that explains exactly how to come up with the ONE TRUE interpretation? \n \n \ntrebor: The problem is that you are looking at a religious book as if it was scientirfic fact..\n\n \n No, not scientific fact only; just fact in general. If the Bible is not fact, then its useless for its claimed purpose.\n \n Sure, it can be used for OTHER purposes, like.... tearing out its pages for use as toilet paper, or using the whole book for 'kindling' to light a fireplace, a paperweight, a doorstop, and so on, or maybe even reading it as a mere philosophical, 'poetic', or fiction book, like someone would find scattered about on the shelves of the local bookstore. But those aren't the Holy Bible's claimed use.", 
   {}, 
   181840, 
   null, 
   1133124720.0
  ], 
  [
   181852, 
   null, 
   "Obvious Child", 
   "Oh, so the Bible is useless for its claimed purpose\n\n Only the purpose claimed by fundamentalists and those who want a strawman.\n \n You are yet to prove that 'scripture is god-breathed' means 'every word in the Bible is infallibly, literally true in a straightforward nonallegorical way'.\n \n In the Psalms, God is often called a lion or a stone: even the fundamentalists tend to understand that metaphor is somewhat compatible with revelation: Christ explicitly uses 'parables' rather than straightforward factual statement.", 
   {}, 
   181848, 
   null, 
   1133125260.0
  ], 
  [
   181854, 
   null, 
   "DamEtel", 
   "Obvious Child: Only the purpose claimed by fundamentalists and those who want a strawman.\n\n \n It's not a strawman to point out that the Holy Bible is useless for its claimed purpose. You keep claiming that it is, but that doesn't make it fact.\n \n \nObvious Child: You are yet to prove that 'scripture is god-breathed' means 'every word in the Bible is infallibly, literally true in a straightforward nonallegorical way'.\n\n \n I don't need to. YOU need to prove that the Holy Bible - in particular, the Creation account in Genesis - is FACT. When will you do that? When do you plan to go back to the original texts and interpret them correctly - since all of the standard English Bibles apparently got it wrong - and present the FACTS of Creation to us???\n \n \nObvious Chilcd: Christ explicitly uses 'parables' rather than straightforward factual statement.\n\n \n Yeah, and hardly anyone understood them! Even Jesus's own disciples had to ask Jesus to explain some of the parables to them. So Jesus isn't even smart enough to speak in a manner that his own disciples could understand! \n \n Now, where in the Bible do we find Jesus, or God, explaining all of the allegories in the Creation account of Genesis? Please point this out to us.", 
   {}, 
   181852, 
   null, 
   1133125620.0
  ], 
  [
   181894, 
   null, 
   "Obvious Child", 
   "It's not a strawman to point out that the Holy Bible is useless for its claimed purpose. You keep claiming that it is, but that doesn't make it fact.\nYou keep on saying it's the 'claimed purpose'. I might as well say that the 'claimed purpose' of Darwinism was eugenics: after all, the Nazis claimed this. This is only the purpose claimed by some people.\n \n \nI don't need to. YOU need to prove that the Holy Bible - in particular, the Creation account in Genesis - is FACT. When will you do that? When do you plan to go back to the original texts and interpret them correctly - since all of the standard English Bibles apparently got it wrong - and present the FACTS of Creation to us???\nMy need to prove that only exists if you show that such a need is necessary for the Bible to be useful or meaningful: exactly what my post challenges you to do. Are you going to try?\n \n As for the English Bibles: they're not 'wrong', simply a limited translation: it is impossible to fully bring out all possible meanings and nuances.\n \n \nYeah, and hardly anyone understood them! Even Jesus's own disciples had to ask Jesus to explain some of the parables to them. So Jesus isn't even smart enough to speak in a manner that his own disciples could understand! \nYou assume he wanted to, and there wasn't some deliberate aim of making people work towards the truth themselves. If you'd read the Gospels closely, you'd see such an idea is present.\n \n \nNow, where in the Bible do we find Jesus, or God, explaining all of the allegories in the Creation account of Genesis? Please point this out to us.\nIf the allegories were explained, they wouldn't be allegories and would be limited to a single message. It is the uncertainty which allows an overflow of meaning capable of touching and affecting people in different ways through time.", 
   {}, 
   181854, 
   null, 
   1133141040.0
  ], 
  [
   181903, 
   null, 
   "DamEtel", 
   "DamEtel: It's not a strawman to point out that the Holy Bible is useless for its claimed purpose. You keep claiming that it is, but that doesn't make it fact. \n\n \n \nObvious Child: You keep on saying it's the 'claimed purpose'. I might as well say that the 'claimed purpose' of Darwinism was eugenics: after all, the Nazis claimed this.\n\n \n Nope, because it is known that such was not the case. The purpose of Darwinian evolution was to explain (and provide support for) the origin of species by means of natural selection; a mechanism which was was found 'simultaneously' by two other people, completely indepedently of Darwin. And nowhere in Darwin's \"On the Origin of Species\" does he promote eugenics.\n \n This is quite unlike the Holy Bible (as I explain below in response something else you say).\n \n If you have to stoop to distortions to try to make your case, I guess I've already won, both logically and ethically.\n \n \nDamEtel: I don't need to. YOU need to prove that the Holy Bible - in particular, the Creation account in Genesis - is FACT. When will you do that? When do you plan to go back to the original texts and interpret them correctly - since all of the standard English Bibles apparently got it wrong - and present the FACTS of Creation to us??? \n\n \n \nObvious Child: My need to prove that only exists if you show that such a need is necessary for the Bible to be useful or meaningful: exactly what my post challenges you to do. Are you going to try?\n\n \n It's already known by all that the Holy Bible is claimed to be the Word of the Almightly God. In fact, my Bible right here says:\n \n \n\"In working towards these goals, the translators were united in their commitment to the authority and infallibility of the Bible as God's Word in written form.\" (NIV preface)\n \n\n \n And the Holy Bible itself tells us:\n \n \n\"All Scripture is God-breathed and is useful for teaching, rebuking, correcting and training in righteousness ...\"\n (2 Timothy 3:16)\n \n\n \n And throughout the Old Testament of the Holy Bible we told, \"And God said...\"\n \n That you personally use the Holy Bible in some other sense - as a mere philosophical, poetic, historical, or fiction book - is your problem. You aren't even in the right argument!\n \n \nObvious Child: As for the English Bibles: they're not 'wrong', simply a limited translation: it is impossible to fully bring out all possible meanings and nuances.\n\n \n Okay, so now are you saying that God really did create the heavens and earth is just 6 days, creating various animals and celestrial bodies on specific days, creating Adam out of the dust of the earth, and yanking a rib out of Adam to make Even with, as described in Genesis ... just that a few nuances have been lost in translation?\n \n \nDamEtel: Yeah, and hardly anyone understood them! Even Jesus's own disciples had to ask Jesus to explain some of the parables to them. So Jesus isn't even smart enough to speak in a manner that his own disciples could understand!\n \n \n \nObvious Child: You assume he wanted to, and there wasn't some deliberate aim of making people work towards the truth themselves. If you'd read the Gospels closely, you'd see such an idea is present.\n\n \n You've made a claim, support it.\n \n \n \nDamEtel: Now, where in the Bible do we find Jesus, or God, explaining all of the allegories in the Creation account of Genesis? Please point this out to us. \n\n \n \nObvious Child: If the allegories were explained, they wouldn't be allegories and would be limited to a single message.\n\n \n Make up your mind! Jesus spoke in parables - A FACT THAT YOU YOURSELF BROUGHT UP IN SUPPORT OF ALLEGORIES - but he went on to explain, in the Bible itself, some of them. Gee, I guess they weren't parables/allegories anymore huh. So where in the Holy Bible are God's explanations of the allegories of the Creation account in Genesis?\n \n \nObvious Child: It is the uncertainty which allows an overflow of meaning capable of touching and affecting people in different ways through time.\n\n \n Uncertainty is the opposite of information. Thus you are claiming that the Bible contains little information (much uncertainty). Wow, what a great book for Christians to base their lives on!", 
   {
    "unicode_changes_made": true
   }, 
   181894, 
   null, 
   1133144160.0
  ], 
  [
   181949, 
   null, 
   "Obvious Child", 
   "Nope, because it is known that such was not the case. The purpose of Darwinian evolution was to explain (and provide support for) the origin of species by means of natural selection; a mechanism which was was found 'simultaneously' by two other people, completely indepedently of Darwin. And nowhere in Darwin's \"On the Origin of Species\" does he promote eugenics.\n \n This is quite unlike the Holy Bible (as I explain below in response something else you say).\n \n If you have to stoop to distortions to try to make your case, I guess I've already won, both logically and ethically.\n \n \n It's already known by all that the Holy Bible is claimed to be the Word of the Almightly God. In fact, my Bible right here says:\n \n And the Holy Bible itself tells us: \n \n \n And throughout the Old Testament of the Holy Bible we told, \"And God said...\"\nSome (Nazis) make the claim that Darwinism has a prescriptive component. Some (NIV translators) make the claim that the Bible is the infallible word of God.\n \n As for the 'god-breathed' quote, I've addressed that several times. It does not prove infallibility or literality.\n \n I have read many religious poems (those of Donne, or R S Thomas for example) that talk about what God says without claiming to be infallible but intending to have a meaning beyond straightforward fantasy.\n \n \nThat you personally use the Holy Bible in some other sense - as a mere philosophical, poetic, historical, or fiction book - is your problem. You aren't even in the right argument!\nWhy do you insist on talking about 'mere' philosophy or poetry. The former is the pursuit of Wisdom or Truth, and the latter Beauty. What more do you want? They are far more meaningful than seeing God's word as a textbook.\n \n \nOkay, so now are you saying that God really did create the heavens and earth is just 6 days, creating various animals and celestrial bodies on specific days, creating Adam out of the dust of the earth, and yanking a rib out of Adam to make Even with, as described in Genesis ... just that a few nuances have been lost in translation?\nI didn't say that. Are you still unaware of my central point? The meaning is in the underlying metaphors and messages, not the surface level.\n \n \nYou've made a claim, support it.\nMark 4:\n 11 And he said to them, \"To you has been given the secret of the kingdom of God, but for those outside everything is in parables, 12 so that\n \"they may indeed see but not perceive,and may indeed hear but not understand,lest they should turn and be forgiven.\"\n \n This can be read as a select elect, or a refusal to spoonfeed truth to the masses. In fact, it seems quite vindictive to me.\n \n \nMake up your mind! Jesus spoke in parables - A FACT THAT YOU YOURSELF BROUGHT UP IN SUPPORT OF ALLEGORIES - but he went on to explain, in the Bible itself, some of them. Gee, I guess they weren't parables/allegories anymore huh. So where in the Holy Bible are God's explanations of the allegories of the Creation account in Genesis?\nThe parables of Christ are explained, and therefore lose some of their richness. The deeper mysteries are not. Why does everything have to be presented in a single way?\n \n \n \n \nUncertainty is the opposite of information. Thus you are claiming that the Bible contains little information (much uncertainty). Wow, what a great book for Christians to base their lives on!\nIf you treat 'information' as straightforward fact, then maybe. It is just possible that a being who utterly transcends the cosmos and the human mind can't be dealt with in simplistic, discrete particles. If we wish to speak literally, we must talk about simply an Ultimate, maybe entirely without attributes (nirguna Brahman). But we use metaphors: God is seen as a stone, a lion, a warrior. Then this idea is heightened to God as a mother or father. No idea is entirely discarded, yet none can fully capture the nature of God.", 
   {
    "unicode_changes_made": true
   }, 
   181903, 
   null, 
   1133189700.0
  ], 
  [
   182006, 
   null, 
   "jyoshu", 
   "You know, I had no idea, until I joined these forums, that there was so much hostility out there towards intelligent design and it's supporters. I was pretty shocked. This thread is one such example.", 
   {}, 
   181949, 
   null, 
   1133203800.0
  ], 
  [
   182036, 
   null, 
   "trebor", 
   "You know, I had no idea, until I joined these forums, that there was so much hostility out there towards intelligent design and it's supporters. I was pretty shocked. This thread is one such example.\n\n \n \n When someone is using psuedo science to shove religious views down the throats of everyone else, you have to expect disrespect in return.", 
   {}, 
   182006, 
   null, 
   1133209080.0
  ], 
  [
   182372, 
   null, 
   "jitobear", 
   "You know, I had no idea, until I joined these forums, that there was so much hostility out there towards intelligent design and it's supporters. I was pretty shocked. This thread is one such example.\n\n \n \n Wouldn't bother me a bit if they weren't trying to make religion science curriculem. With a child in the public schools that concerns me greatly. There is nothing wrong with religion or learning the history or beliefs of any religion. However, religious mythology is not science and I take up issue with the possibility of my child being fed the MISINFORMATION that it is.", 
   {}, 
   182006, 
   null, 
   1133307660.0
  ], 
  [
   183158, 
   null, 
   "DamEtel", 
   "DamEtel: That you personally use the Holy Bible in some other sense - as a mere philosophical, poetic, historical, or fiction book - is your problem. You aren't even in the right argument! \n\n \n \nObvious Child: Why do you insist on talking about 'mere' philosophy or poetry.\n\n \n Because compared to what the Holy Bible is claimed to be - the Word of the Almighty God - philosophy and poems written by mere men makes them MERE philosophy and MERE poetry. \n \n If you want to downgrade the Holy Bible to mere philosophy or mere poetry, go ahead. But then why are you arguing against me?", 
   {}, 
   181949, 
   null, 
   1133669580.0
  ], 
  [
   183169, 
   null, 
   "trebor", 
   "Because compared to what the Holy Bible is claimed to be - the Word of the Almighty God - philosophy and poems written by mere men makes them MERE philosophy and MERE poetry. \n \n If you want to downgrade the Holy Bible to mere philosophy or mere poetry, go ahead. But then why are you arguing against me?\n\n \n Hum.. is it MERE? Sounds like the that is just someone downgrading the achievements of man.", 
   {}, 
   183158, 
   null, 
   1133672520.0
  ], 
  [
   183180, 
   null, 
   "DamEtel", 
   "Hum.. is it MERE? Sounds like the that is just someone downgrading the achievements of man.\n\n \n Nope, just that they utterly pale in comparison to the CLAIMED achievements of the CLAIMED omniscious, omnipotent, omnipresent supernatural being who created the entire Universe. Compared to that CLAIMED being and those CLAIMED achievements, nothing man has done comes close: anything we do is MERE compared to God's abilities, and we too are MERE compared to God. \n \n In that context, which you seem to so stubbornly refuse to acknowledge, then saying that your considering the Holy Bible, the Word of the Almighty God, to be just a philosophy or poetry book written by humans can quite correctly be called a demoting of it to a mere philosophy or mere poetry book.", 
   {}, 
   183169, 
   null, 
   1133674680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bye-bye to ID supporters", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 6810, 
  "discussion_files": [
   [
    "3652.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-print.html"
   ], 
   [
    "3653.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-10-print.html"
   ], 
   [
    "3654.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-8-print.html"
   ], 
   [
    "3655.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-6-print.html"
   ], 
   [
    "3656.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-4-print.html"
   ], 
   [
    "3657.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-5-print.html"
   ], 
   [
    "3658.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-7-print.html"
   ], 
   [
    "3659.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-9-print.html"
   ], 
   [
    "3660.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-3-print.html"
   ], 
   [
    "3661.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/6810-bye-bye-id-supporters-2-print.html"
   ]
  ], 
  "identifier": 6810
 }
]