[
 [
  [
   178819, 
   null, 
   "billsco", 
   "4Forums is pleased to announce a formal debate between Cerebro and zachvac:\n \n Resolved: Intelligent Design should be part of the public schools' science curriculum, taught as a valid alternative to the Theory of Evolution. \n \n Cerebro will argue the affirmative, zachvac the negative. A 5/4 post structure has been agreed upon. Cerebro will begin and end this debate.\n \n A time limit of one week will be allowed between each post. \n \n The judges for this debate are sinjin, jitobear, and joebrummer. Their decisions are final. \n \n Best of luck to Cerebro and zachvac.", 
   {
    "post_info": {
     "post_title": "Cerebro vs zachvac--Intelligent Design"
    }
   }, 
   null, 
   null, 
   1131765660.0
  ], 
  [
   180269, 
   null, 
   "zachvac", 
   "4Forums is pleased to announce a formal debate between Cerebro and zachvac:\n \n Resolved: Intelligent Design should be part of the public schools' science curriculum, taught as a valid alternative to the Theory of Evolution. \n \n Cerebro will argue the affirmative, zachvac the negative. A 5/4 post structure has been agreed upon. Cerebro will begin and end this debate.\n \n A time limit of one week will be allowed between each post. \n \n The judges for this debate are sinjin, jitobear, and joebrummer. Their decisions are final. \n \n Best of luck to Cerebro and zachvac.\n\n \n So umm. What's going on? This was posted a week ago plus about 4 hours ago. I frankly don't care if my opponent posts a day late and would hate to win because of time. BUT the first post was even easier, he could have been typing it as we found judges and I think he mentioned he had started already. I PMed him earlier this week reminding him of the limit and have not recieved a response. Of course maybe the fact that he hasn't logged on since 11/14 has something to do with that.", 
   {}, 
   178819, 
   null, 
   1132385160.0
  ], 
  [
   180314, 
   null, 
   "billsco", 
   "So umm. What's going on? This was posted a week ago plus about 4 hours ago. I frankly don't care if my opponent posts a day late and would hate to win because of time. BUT the first post was even easier, he could have been typing it as we found judges and I think he mentioned he had started already. I PMed him earlier this week reminding him of the limit and have not recieved a response. Of course maybe the fact that he hasn't logged on since 11/14 has something to do with that.\n\n \n I don't know why he did that zachvac. I've PMed him myself. I am sorely disappointed that a person would inconvenience people like that. Of, course, there is nothing to win here. I will probably dismantle this thread in the coming week and pretend it didn't happen. We may have to, in the future, invoke the \"Cerebro Rule\" whenever newbies to the site state their desire to engage in a formal debate. They should have a history of posting, IMO. \n \n I hope your desire to debate this or other issues remains, and a new opponent steps forward.", 
   {}, 
   180269, 
   null, 
   1132419180.0
  ], 
  [
   180666, 
   null, 
   "Cerebro", 
   "Sorry. Disasterous work week. Will post today if that's still okay.\n \n Appologies for the delay.emoticon_frazzled", 
   {}, 
   180314, 
   null, 
   1132591620.0
  ], 
  [
   180667, 
   null, 
   "billsco", 
   "I remain skeptical, but post your opening statement ASAP. \n \n Please commit to this debate or notify us of other intentions.", 
   {}, 
   180666, 
   null, 
   1132592100.0
  ], 
  [
   180721, 
   null, 
   "Cerebro", 
   "Thanks to everyone for their patience to this point. I won't press my luck in that fashion again. I had a lot more time on my hands leading up to the kickoff, but I promise to make this a priority for my time from here on in and not to cause further delay.\n \n Opening argument:\n \n In order to demonstrate that the Intelligent Design (ID) theory should be taught in public schools in the USA, there are three points to be made. \n \n First, ID is not only a plausible theory of the origin and continuing evolution of life on this planet, but that the current model taught in schools is not demonstrably more plausible theory.\n \n Second, beyond its plausibility, belief in ID does not cause harm to American society, either by slowing or misdirecting scientific progress that might otherwise provide medical or other benefits to Americans, or by interfering with Americans' right to freedom of religious expression and freedom from religious oppression.\n \n Third, as a public service provided through tax dollars to its citizens, education in the USA should reflect the prevailing beliefs of the populace funding that service, as long as the two preceding criteria are met.\n \n To demonstrate the plausibility of ID, we must first understand what the theory purports. \n \n \"The theory of intelligent design (ID) holds that certain features of the universe and of living things are best explained by an intelligent cause rather than an undirected process such as natural selection.\" -- http://www.intelligentdesignnetwork.org/index.htm\n \n ID does not state that evolution within species does not take place.\n ID does not state that the Universe is 5,000 years old.\n ID does not state that the designer of irreducibly complex features of the universe is the Christian god, or any other specific religious character.\n \n Not also that the theory holds that certain features of the universe and of living things are /best/ explained by an intelligent cause, not that those features can /only/ be explained in that manner.\n \n This means that ID recognizes facts of evolution in evidence (mutation of viruses, changed of plants and animals through breeding, etc.), but does not hold random cause to be the only explanation for evolutionary theory where historical or physical evidence is absent or questionable.\n \n As a theory, natural selection as the sole driving force of evolution is, by definition, not wholly proven to explain every aspect of the evolutionary process or the earliest origins of life. It does provide a viable hypothesis to explain these events, which is why it is taught in schools.\n \n These areas which have not yet been proven either through physical evidence or repeatable experiment must be open to speculation if a scientific approach is to be taken in demystifying those areas. Intelligent Design offers an alternate explanation for those areas. One hopes that, over time, physical evidence or experimental data may be discovered that refutes one or the other (or both!), thereby advancing scientific knowledge.\n \n That ID only offers an alternative to areas of evolutionary science which remain unproven and that the explanation if offers does not directly contradict areas of the theory which are held to be in evidence, it is therefore plausible.\n \n Teaching ID would not cause harm to American society. \n \n The argument that time taken to debate unproven areas of evolutionary theory is wasted or that important medical advancements based on evolutionary theory are refuted thusly:\n i) Debate and controversy are essential tools in the advancement of science. Any useful teaching of science must recognize and illustrate this fact.\n ii) Medical, environmental and other practical advancements made based on evolutionary theory are made based on either facts in evidence, which ID does not dispute, or speculation. Teaching ID does not restrict scientists from speculating in order to for new hypotheses any more than stochastically based evolutionary theory does. The current resistance to ID actually suggests the opposite to be true.\n \n Furthermore, teaching ID does not deprive Americans of their right to be free of religious persecution or to practice whatever religion or philosophical view they please. If ID stated that any particular religion's god or gods was the designer of life and that therefore other rules believed by that religion's followers about how we should conduct ourselves as citizens, that would be interference of religion in state affairs.\n \n Since ID only referrers to an intelligent designer in general and none specifically, it follows that no religion is endorsed by ID.\n \n One of the core questions to be answered, though, is to what degree should taxpayers be permitted to direct the use of their funds in public use? The US government permits individual states to determine whether it will use its public resources to execute its citizens. This suggests a strong national will to allow people to affect the manner of provision of public services based on the democratic process.\n \n There are certainly exceptions. States passing laws that contradict the US constitution will generally have those laws overturned, such as in cases where such laws violate an individual's constitutional rights. The teaching of ID in schools has been demonstrated above not to do so.\n \n If, then, constituents of a specific tax base (90% of public education funding comes from the state and local levels, see http://www.ed.gov/about/overview/fed/role.html) agree that subject matter should be taught in their schools, it should be not only permitted, but required as long as that material can be shown to be plausible and not to harm American society as is the case with ID as argued above.\n \n A Gallup Organization poll in December, 1994 (Quoted in George Bishop, \"What Americans really believe,\" Free Inquiry, 1999-Summer, Pages 38 to 42.) showed a strong belief in God or a universal spirit has been persistent in the USA for at least 50 years. While this does not necessarily translate into support for ID, it does suggest that a significant number of Americans believe that the universe may not be a wholly stochastic system.\n \"Do you believe in God or a universal spirit?\" \n Year Percentage \"Yes\" \n 1947 94%\n 1953-4 99%\n 1978 94%\n 1994 96%\n \n More demonstrative of the specific issue at hand is the poll conducted by Mason-Dixon Polling & Research of Washington D.C. between May 28 and June 4, 2002. The poll consisted of telephone interviews of 1,507 Ohio adults selected at random. The key results are contained in the responses to a single multiple choice question:\n \n \"Currently, the Ohio Board of Education is debating new academic standards for public school science classes, including what to teach students about the development of life on Earth. Which position do you support?\"\n Teach only evolution 8%\n Teach only intelligent design 8% \n Teach both 59% \n Teach the evidence both for and against evolution, \n but not necessarily intelligent design 15%\n Teach nothing about human development 9%\n Not sure 1% \"\n Total opposed to \"Teach only evolution\": 91%\n \n This shows that, the majority of adults in Ohio would quite probably favour the teaching of ID alongside stochastic-only evolutionary theory. In that case, on what basis do we deny those people the right to have their public services (in this case education) reflect their wishes in a situation where those wishes can be easily realized without harm to the community?", 
   {
    "unicode_changes_made": true
   }, 
   180667, 
   null, 
   1132604760.0
  ], 
  [
   181768, 
   null, 
   "zachvac", 
   "I would first like to thank billsco for setting this debate up, my opponent Cerebro for agreeing to debate, and the three judges sinjin, jitobear, and joebrummer for agreeing to judges. Thank you.\n \n First off, I think we need to determine what science is. A dictionary is always a good place to look for a definition, how about dictionary.com:\n \n sci·ence n. \n \n 1.\n a. The observation, identification, description, experimental investigation, and theoretical explanation of phenomena. \n b. Such activities restricted to a class of natural phenomena. \n c. Such activities applied to an object of inquiry or study. \n \n 2. Methodological activity, discipline, or study: I've got packing a suitcase down to a science. \n 3. An activity that appears to require study and method: the science of purchasing. \n 4. Knowledge, especially that gained through experience. \n 5. Science Christian Science. \n \n \n I think we can agree on 1a for an appropriate definition of science as taught in a classroom.\n \n I would take issue with your first statement.\n \n ?First, ID is not only a plausible theory of the origin and continuing evolution of life on this planet, but that the current model taught in schools is not demonstrably more plausible theory.?\n \n The problem with ID as a plausible theory is that not only is there no way to test it, but there would be absolutely no way to falsify it. By definition a scientific theory must be falsifiable and it must also be testable and these tests must be repeatable, so that other scientists may apply the scientific method to the test to see if they get the same kind of results as the original scientist. There is really no way to test or falsify ID. The very core of ID is that there is no other way to explain it so there must have been an intelligent ?designer?. This simply is not science. We do not simply decide that the current model doesn?t work, so we should teach another theory. Since evolution, unlike ID, is falsifiable, the steps would be to prove that there was a hole in evolution or something was wrong and then to actually perform some sort of test to show that ID could make some sort of accurate prediction about the world we live in. Because when you get right down to it, that?s the reason we have science. It?s not about what?s true, it?s about what we can find out from what we already know. So if ID has no use in science besides the fact that it may make people feel better about life and there is no way to prove it or falsify it, it has no business being in the science classroom.\n \n I would also like to address your statement:\n \n ?Third, as a public service provided through tax dollars to its citizens, education in the USA should reflect the prevailing beliefs of the populace funding that service, as long as the two preceding criteria are met.?\n \n \n This is simply false. Education isn?t 51% of the people teaching their beliefs to 49% of the people. It?s about teaching prior knowledge so that people of today don?t have to re-invent the wheel. Thus the belief of anyone in the population is irrelevant. Beliefs should not be taught in public schools simply because they are the ?prevailing? beliefs. If we can prove that these prevailing beliefs are sound science and test these beliefs, then that?s fine, but ID fails on both counts.\n \n I would like to address this statement:\n \n ?Not also that the theory holds that certain features of the universe and of living things are /best/ explained by an intelligent cause, not that those features can /only/ be explained in that manner.?\n \n These statements are simply not science. These statements are what I mentioned in the above paragraph, these ?prevailing beliefs?. Until we can come up with some evidence for the fact that these ?holes? in evolution are best explained with an intelligent creator and not a magic fairy dragon or Santa Claus, it has no business in a science classroom.\n \n You say: ?Intelligent Design offers an alternate explanation for those areas. One hopes that, over time, physical evidence or experimental data may be discovered that refutes one or the other (or both!), thereby advancing scientific knowledge.?\n \n But that is not how science works. We don?t see a flaw in a current theory, come up with an idea about it in our heads and decide to teach people that it is true and hopefully it will either be refuted or proved true. It is one thing to teach that there are holes in evolution, but another thing altogether to teach that these holes show a need for a creator. Some believe this, but some also believe the world was created in seven days, is that taught in science class?\n \n Not only that, but ID is in and of itself both unprovable and not falsifyable. No matter what our findings, we will not be able to prove the existence or absence of an intelligent designer. I challenge you to give me one way we could prove that ID was false (or even true).\n \n You claim that: ?The argument that time taken to debate unproven areas of evolutionary theory is wasted or that important medical advancements based on evolutionary theory are refuted thusly:\n i) Debate and controversy are essential tools in the advancement of science. Any useful teaching of science must recognize and illustrate this fact.\n ii) Medical, environmental and other practical advancements made based on evolutionary theory are made based on either facts in evidence, which ID does not dispute, or speculation. Teaching ID does not restrict scientists from speculating in order to for new hypotheses any more than stochastically based evolutionary theory does. The current resistance to ID actually suggests the opposite to be true.?\n \n First off debate is an essential tool in science, but there is no debate here. This is a religious issue. Do we debate why the freezing point is 32 degrees? We have proven that it is, but why? Do we offer the theory of an intelligent designer choosing that number? Debate and controversy only work when there are multiple scientific hypotheses, and even then these other hypotheses are taught as such. ID seems to be an idea someone thought up with no evidence or thorough thought, can you give me a reason this is a good alternative to debate rather than another alternative to evolution?\n \n You are right, ID doesn?t dispute evolutionary theory. In fact it has no scientific value whatsoever. It states the reason for evolution with no proof or experimentation. ID doesn?t offer a what, it offers a why. Unfortunately science is concerned with what we can gain from it. Even if we can prove that ID is true there is absolutely no reason to even teach it in the science classroom. But that?s another story altogether. ID has not been proven and it is just an unproven, useless idea that someone came up with to sneak religion into the science curriculum.\n \n You claim: ?Since ID only referrers to an intelligent designer in general and none specifically, it follows that no religion is endorsed by ID.?\n \n Yes and no. It does not endorse a specific religion, but ID is very religious in nature. It deals with the supernatural, something outside of the world that we can comprehend, and that would be religious.\n \n You say: ?One of the core questions to be answered, though, is to what degree should taxpayers be permitted to direct the use of their funds in public use? The US government permits individual states to determine whether it will use its public resources to execute its citizens. This suggests a strong national will to allow people to affect the manner of provision of public services based on the democratic process.?\n \n I?m sorry but now you are just dodging the whole topic of this debate. I think it is very clear that this isn?t a ?who has the right to regulate education? debate. I think that education is not a federal issue and that the local governments should decide, which represent the people. But that?s not the topic of this debate. This debate is dealing with the question SHOULD it be taught. Frankly I don?t care if 99% of the population wants something taught, it doesn?t change what should be. If you want to explain why it should be taught, fine, but just because everyone?s doing it doesn?t make it right, and just because everyone wants it taught doesn?t mean it should be taught. Everyone thinks it?s right to murder people, is it right?\n \n The rest of your statement deals with what people want. Again I would like to address the topic of this debate:\n Resolved: Intelligent Design should be part of the public schools' science curriculum, taught as a valid alternative to the Theory of Evolution.\n \n We should be debating the merits of ID, not how many people are on your side of the debate. If 99% of the people want to legalize murdering blacks, and I were debating this, do you think the fact that most people want it would support the fact that we SHOULD murder blacks?\n \n This tactic could be used in any debate where the majority is on your side. We are not arguing over whether the citizens should be allowed to make the decision, we are arguing if these people deciding to include ID in the curriculum are making the RIGHT decision.\n \n I believe I have addressed all the points in your statement. If I have missed anything please point it out in your next post. I will use this format for the next 2 responses as well (quoting you and responding) because I am the negative. My responsibility is not showing that ID shouldn?t be taught, only how your argument that ID should be taught is wrong. The burden of proof is on you so I will directly respond to what you have used as proof in this debate. I look forward to reading your next response.", 
   {}, 
   180721, 
   null, 
   1133076360.0
  ], 
  [
   181769, 
   null, 
   "zachvac", 
   "argh, all my \"s and 's are ?s. I just typed it in word and copy-pasted. Oh well.", 
   {}, 
   181768, 
   null, 
   1133076420.0
  ], 
  [
   183191, 
   null, 
   "zachvac", 
   "Well right now it's 20 minutes to the deadline, but I'm not optomistic. He hasn't logged in since my last post. I sent him a PM yesterday warning him that he had 24 hours, but since he hasn't logged in, I'm not surprised he didn't get it. If you can't stick to the deadline we agreed to before, you shouldn't have agreed to a formal debate. I'm sorry to say that I'm a little frustrated. Although there is the chance that a miracle will occur and he will post in the next 20 minutes. But I'm not exactly holding out hope.", 
   {}, 
   181769, 
   null, 
   1133680020.0
  ], 
  [
   183257, 
   null, 
   "billsco", 
   "I'll get the judges in here to see how they want to dispose of this case. \n \n The options are to declare zachvac the winner by default, or to render no verdict.", 
   {}, 
   183191, 
   null, 
   1133709540.0
  ], 
  [
   185052, 
   null, 
   "sinjin", 
   "Thanks to Billsco for coordinating and the other judges for their willingness.\n \n This one hardly got off the ground but that's hardly zachvac's fault.\n \n I think zachvac wins by forfeit which cannot be very satisfying.\n \n Better luck next time.\n \n Where the hell has Cerebro gone? Must have a headache.:xbanghead", 
   {
    "post_info": {
     "post_title": "4feet"
    }
   }, 
   183257, 
   null, 
   1134522960.0
  ], 
  [
   185147, 
   null, 
   "billsco", 
   "Joebrummer has PMd me with his decision: He calls it a no verdict. That means we'll wait for jitobear to cast the deciding vote on the how this case ends.", 
   {}, 
   185052, 
   null, 
   1134570780.0
  ], 
  [
   193824, 
   null, 
   "zachvac", 
   "Joebrummer has PMd me with his decision: He calls it a no verdict. That means we'll wait for jitobear to cast the deciding vote on the how this case ends.\n\n \n any word on the final vote here?", 
   {}, 
   185147, 
   null, 
   1137916320.0
  ], 
  [
   195666, 
   null, 
   "billsco", 
   "I'm not sure why jitobear does not respond. I've sent her numerous PMs. If there is no response from her by the end of the week I'll cast her vote.", 
   {}, 
   193824, 
   null, 
   1138662120.0
  ], 
  [
   196670, 
   null, 
   "billsco", 
   "Final disposition:\n \n My concern lies in the integrity of the records/rankings thread that we maintain in this debate room. There the record of who won and who lost in their respective debates becomes a \"hall of fame\", a permanently stickied record of those who have slugged and slagged their way to victory or defeat. Each name recorded thus far is in the records/rankings due to the above conditions or the debate was clearly ceded by their opponent. \n \n Neither condition is present in this incomplete debate, and therefore I'm ruling it as a no verdict. In the future, if a similar cicumstance occurs I will, as your happy moderator, simply rule it incomplete and not appeal to the judges. \n \n I'm glad to see zachvac able to complete this debate with someone else.", 
   {}, 
   195666, 
   null, 
   1139068380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cerebro vs zachvac--Intelligent Design", 
  "url": "http://www.4forums.com/political/debate-tournaments/6828-cerebro-vs-zachvac-intelligent-design.html", 
  "breadcrumbs": [
   "Debate Tournaments"
  ], 
  "id_number": 6828, 
  "discussion_files": [
   [
    "4116.html", 
    "http://www.4forums.com/political/debate-tournaments/6828-cerebro-vs-zachvac-intelligent-design-print.html"
   ]
  ], 
  "identifier": 6828
 }
]