[
 [
  [
   178880, 
   null, 
   "georged", 
   "In a classic example of out-dated and self-serving management style that continues to decimate uncompetitive US public companies, GM has 'settled' its wage and benefit negotiations:\n \n http://today.reuters.com/news/newsArticle.aspx?type=businessNews&storyID=2005-11-11T213305Z_01_SPI161388_RTRUKOC_0_US-AUTOS-GM-HEALTHCARE.xml\n \n I couldn't help but laugh at the fact the new, give-away agreement covers only hourly workers, preserving salaried lifer status quo and perpetuating the very problems of closed minds that contribute to GM's current dilemma. GM seems lost in that maze many Americans are wandering around in, that if they wait just a little longer magic beans will begin sprouting and the 'good old days' will return.", 
   {
    "post_info": {
     "post_title": "GM Problems"
    }
   }, 
   null, 
   null, 
   1131811740.0
  ], 
  [
   178894, 
   null, 
   "billsco", 
   "What is your solution to solving its financial woes, bankruptcy which allows it to get out from its staggering health care and pension costs? Or can the company build itself out of its problems, by producing world-class vehicles?\n \n If I had to choose, option 1 is more realistic. I don't think GM gets it when it comes to quality and value.", 
   {}, 
   178880, 
   null, 
   1131817740.0
  ], 
  [
   178900, 
   null, 
   "georged", 
   "What is your solution to solving its financial woes, bankruptcy which allows it to get out from its staggering health care and pension costs? Or can the company build itself out of its problems, by producing world-class vehicles?\n \n If I had to choose, option 1 is more realistic. I don't think GM gets it when it comes to quality and value.\n\n \n I see a blood in the halls BK as their most viable option, including serious political implications regarding pension issues. A major obstacle to any action GM takes, including reorganization, is their reluctance to utilize professional talent not born and bred in their own stable. The mentally inbred hierarchy GM has used forever is outdated, has been their primary downfall and any effort to rectify that existing circumstance would require outsiders without emotional or inter-company political ties to achieve any degree of success. New blood, especially at senior and middle-management operating levels. \n \n No, building world-class vehicles, even if they could escape their mindset, wouldn't do it with current (and seemingly future from the 'settlement') production costs. Their cost of goods sold is way too wacky and its highly questionable if even the sale of GMAC would restore their ability to raise capital at preferred rates as the operating costs and cost of goods sold problems wouldn't go away.", 
   {}, 
   178894, 
   null, 
   1131820620.0
  ], 
  [
   178921, 
   null, 
   "Dono", 
   "I see BK not happening soon because GM has a ton of cash to prop it up until that happens. A major problem GM has re quality and value is the buyer's perception of GM quality, real or not, that will be difficult to turn around. The wage and legacy burdens were built incrementally and that is the only way reluctant unions will give them up unless BK forces them. \n By the way, Peter Drucker, whose examination of GM's inner workings prompted his 1946 book CONCEPT OF THE CORPORATION. died yesterday. His principals of management were largely ignored by GM and were embraced by the Japanese auto makers.\n Dono", 
   {}, 
   178900, 
   null, 
   1131828780.0
  ], 
  [
   178924, 
   null, 
   "georged", 
   "I see BK not happening soon because GM has a ton of cash to prop it up until that happens. A major problem GM has re quality and value is the buyer's perception of GM quality, real or not, that will be difficult to turn around. The wage and legacy burdens were built incrementally and that is the only way reluctant unions will give them up unless BK forces them. \n By the way, Peter Drucker, whose examination of GM's inner workings prompted his 1946 book CONCEPT OF THE CORPORATION. died yesterday. His principals of management were largely ignored by GM and were embraced by the Japanese auto makers.\n Dono\n\n \n I was familiar with Drucker's philosophies and read the obituary. With regard to Drucker taking on Sloan at GM, GM seemingly did everything in its power to reward loyalty with fiefdoms, burying incentive and attempt buying off labor instead of incorporating it into the entity. They're now paying a heavy price for that arrogance. Considering the relatively short time factor, it didn't take Toyo all that that long to topple GM using the very business methodology rejected by GM.\n \n GM will burn through a bunch of that cash if labor strikes take place.", 
   {}, 
   178921, 
   null, 
   1131829980.0
  ], 
  [
   178942, 
   null, 
   "billsco", 
   "I watched a PBS documentary a few years ago that examined the Japanese method of car-building. It identified three main differences from the American model they studied. I wonder if this is related to the Drucker formula.\n \n IIRC, the three differences were:\n \n Using the same factory to produce many different models.\n \n Requiring all aspects of manufacturing--from design to finance--to be housed in the same building, literally seated knee to knee, to improve communication.\n \n Just in time inventory, which eliminated overhead costs.", 
   {}, 
   178924, 
   null, 
   1131841800.0
  ], 
  [
   179042, 
   null, 
   "georged", 
   "All major manufacturing, of most products, has gone to just in time inventory.\n \n Briefly, GM was originally several independent marques, each with their own facilities. As the company grew by merger and acquisition, consolidation was limited to some common components, R&D and product financing. That was successful with a captive US market until competition in the form of better designed imports entered the US market using advanced manufacturing and assembly techniques.\n \n GM's labor and benefit woes stemmed from WW2 when wages were frozen. All manufacturers began offering increasingly attractive benefits to circumvent the wage freeze in attracting scarce skilled workers. GM continued that practice, preferring enhanced quarterly and annual profit while deferring retirement costs and building health benefit programs that proved to be unsustainable. That effectively built a barrier between management and labor as unions rode the glory years with ever-increasing demands met by weak management still only interested in short-term profits. \n \n The fiefdom and entrenched, mentally inbred management aspects of GM became a glaring deficiency when foreign marques were able to offer a new or redesigned, greatly improved vehicle in 18-months (later reduced to one-year) while GM spent three-years changing their duplicated models, often with only sheet metal changes, and gained the reputation of poor quality control as the public then had comparative products. Anyone who had to drive a GM product during the 80/90s can attest to their shoddiness and lack of appeal and in spite of quality improvements, that reputation is difficult to overcome without at least two generations of buyers.\n \n Changing times and GM's egotistical approach to market requirements on a global scale did them in. By the time basic modernization changes were made in design and production, a large part of their market share had already been captured by their competition and they had acquired a reputation for poor quality. Adjusting to a smaller market share proved impossible as legacy costs were considered manageable on market expansion and that didn't happen, while those costs continued to escalate and devour per-unit margin. \n \n GM is now two steps below investment grade borrowing costs, further increasing their cost-per-unit and reducing availability of R&D funding, the future, still shedding market share at an alarming rate, is operating with the same, mentally inbred management and faces the same legacy costs in spite of the recent PR gesture labor/benefit negotiations. Without top-to-bottom reorganization and relief from legacy costs, their road will become an unending series of bumps, each becoming more severe, with even more loss of shareholder equity. \n \n With the exception of inventory, GM tried doing it 'their way', 180-degrees from the methodology of their successful competition. And I see no changes.", 
   {}, 
   178942, 
   null, 
   1131901080.0
  ], 
  [
   313257, 
   null, 
   "LloydRacer", 
   "As goes GM goes America", 
   {}, 
   179042, 
   null, 
   1213484460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  GM Problems", 
  "url": "http://www.4forums.com/political/stock-market/6832-gm-problems.html", 
  "breadcrumbs": [
   "Stock Market"
  ], 
  "id_number": 6832, 
  "discussion_files": [
   [
    "2021.html", 
    "http://www.4forums.com/political/stock-market/6832-gm-problems-print.html"
   ]
  ], 
  "identifier": 6832
 }
]