[
 [
  [
   179044, 
   null, 
   "simone", 
   "There is a sizeable effort afoot in the nation of the United States to create a theocracy based on what its movement members believe are the precepts of Jesus.\n \n The question is:\n \n Do these people actually embrace the true teachings of Jesus?", 
   {
    "post_info": {
     "post_title": "Jesusland"
    }
   }, 
   null, 
   null, 
   1131901440.0
  ], 
  [
   179055, 
   null, 
   "jitobear", 
   "There is a sizeable effort afoot in the nation of the United States to create a theocracy based on what its movement members believe are the precepts of Jesus.\n \n The question is:\n \n Do these people actually embrace the true teachings of Jesus?\n\n \n What the hell do I care?\n \n Their attempts are unconstitutional AND unbiblical.", 
   {}, 
   179044, 
   null, 
   1131905460.0
  ], 
  [
   179060, 
   null, 
   "Howard Beale", 
   "There is a sizeable effort afoot in the nation of the United States to create a theocracy based on what its movement members believe are the precepts of Jesus.\n \n The question is:\n \n Do these people actually embrace the true teachings of Jesus?\nNo they do not.", 
   {}, 
   179044, 
   null, 
   1131906540.0
  ], 
  [
   179133, 
   null, 
   "Ooaman", 
   "No they do not.\n\n Basically what Howard said. Not when the country is full of people who, like President Bush, claim to be Christian but fail to act like Christians. Going off to war for no reason to a country that has no reason for us to be at war with them or getting behind someone who insist on going to war for no reason to a country that has no reason for us to be going to war with.", 
   {}, 
   179060, 
   null, 
   1131930960.0
  ], 
  [
   179563, 
   null, 
   "Easyrider", 
   "There is a sizeable effort afoot in the nation of the United States to create a theocracy based on what its movement members believe are the precepts of Jesus.\n\n \n I must have missed this in the news. Sounds like just more heathen hysteria.", 
   {}, 
   179044, 
   null, 
   1132098900.0
  ], 
  [
   179571, 
   null, 
   "joebrummer", 
   "There is a sizeable effort afoot in the nation of the United States to create a theocracy based on what its movement members believe are the precepts of Jesus.\n \n The question is:\n \n Do these people actually embrace the true teachings of Jesus?\n\n \n \n Yes, you are correct there is a movement out there who want Roe vs. Wade overturned, gays put back into closets and never mentioned again, they are vert set in having biblical displays every where they can afford to carve them in stone and place them regardless of the constitution. \n \n BUT everyone's perception of the teachings of Christ seems to differ. So, they constitution provided for us a separation of chruch and state. The USA can favor one faith over another or it will seem they are choosing a state religion. The deal is these \"evangelicals\" are also fundementalist christians. They are just as dangerous as fundementalist muslims or fundementalist anything. \n \n Taking the word of any book or writing word for word without cristcal thought is dangerous. It is not consistant with what most biblical historians see is the true message of the scripture.", 
   {}, 
   179044, 
   null, 
   1132102200.0
  ], 
  [
   179574, 
   null, 
   "joebrummer", 
   "I must have missed this in the news. Sounds like just more heathen hysteria.\n\n \n \n That because you should stop reading you bible and read the news....\n \n look at christian exodus\n \n look at Jerry Falwells new University of law.\n \n Look at the 700 club\n \n Look at repent america...\n \n \n These are all political groups digusied as faith, that have a goal of making the USA a theocracy......read the news it is there. You choose not to see it!", 
   {}, 
   179563, 
   null, 
   1132102380.0
  ], 
  [
   179685, 
   null, 
   "jitobear", 
   "I must have missed this in the news. Sounds like just more heathen hysteria.\n\n \n \n that's funny\n \n Don't wanna be an American idiot\n Don't want a nation under the new mania\n And can you hear the sound of hysteria?\n the subliminal mind#### America?\n \n Welcome to a new kind of tension,\n all across the alien nation\n Everything isn't meant to be okay\n Television dreams of tomorrow\n We're not the ones who're meant to follow\n Well that's enough to argue\n \n Well maybe I'm the XXXXXX, America\n I'm not a part of a redneck agenda\n Now everybody do the propaganda!\n And sing along in the age of paranoia!\n \n Welcome to a new kind of tension,\n all across the alien nation\n Everything isn't meant to be okay\n Television dreams of tomorrow\n We're not the ones who're meant to follow\n Well that's enough to argue\n \n Don't wanna be an American idiot\n One nation controlled by the mania\n Information age of hysteria\n Is going out to idiot America\n \n ~ Green Day", 
   {}, 
   179563, 
   null, 
   1132167180.0
  ], 
  [
   179687, 
   null, 
   "Phunting", 
   "I always thought it was \"One nation controlled by the media\". \n \n Oh well, my mistake...", 
   {}, 
   179685, 
   null, 
   1132167360.0
  ], 
  [
   179689, 
   null, 
   "jyoshu", 
   "That because you should stop reading you bible and read the news....\n \n look at christian exodus\n \n look at Jerry Falwells new University of law.\n \n Look at the 700 club\n \n Look at repent america...\n \n \n These are all political groups digusied as faith, that have a goal of making the USA a theocracy......read the news it is there. You choose not to see it!\n\n \n This conspiracy theory has been out there for years. No one is going to take over America. The sky is not going to fall. Aliens will not take over your body.", 
   {}, 
   179574, 
   null, 
   1132167960.0
  ], 
  [
   179695, 
   null, 
   "joebrummer", 
   "This conspiracy theory has been out there for years. No one is going to take over America. The sky is not going to fall. Aliens will not take over your body.\n\n \n \n Funny, that is what they said in the early days of the nazi party! Denial isn't a viable means of stopping a problem.", 
   {}, 
   179689, 
   null, 
   1132169340.0
  ], 
  [
   179745, 
   null, 
   "Dr_Sprocket", 
   "Jesusland sounds like an amusement park weeee", 
   {}, 
   179695, 
   null, 
   1132180260.0
  ], 
  [
   179788, 
   null, 
   "Easyrider", 
   "The deal is these \"evangelicals\" are also fundementalist christians. They are just as dangerous as fundementalist muslims or fundementalist anything. \n\n \n The Dangers of Liberal Fundamentalists\n \n Liberal Fundamentalism is a failed and destructive philosophical enterprise, replete with a host of anti-Biblical, pseudo-religious doctrines, that seeks to elevate the ways and \"wisdom\" of man above the wisdom and desires of God. It's principle aim is the sacking of traditional Judaic and Christian values and beliefs, which are \"revisited\" through suspect liberal \"scholarship\" or politically-correct dogma in an effort to replace them with the tenets of carnal moral hedonism and the failed social doctrines of today's liberal elitists .\n The genesis of today's liberal fundamentalists were the anti-traditionalist hedonists of the 1960's and 70's. They advocated fornication and \"free-love\", illegal substance abuse, moral relativism, contempt for authority, and enjoyed a prosperous America founded on the very hard work and enterprise they sought to distance themselves from. The freedoms they enjoyed were purchased by the blood, sweat, and tears and personal sacrifices of the very forefathers they held in contempt.\n \n Personal responsibility, self-restraint and self-sacrifice were foreign concepts to them. \"Right and wrong\", \"good and evil\" were arbitrarily revisited, for such concepts had no objective meaning to them. They had no objective rationality for their hedonistic philosophy other than it \"feels good, so let's do it\". The only righteous cause that qualified for support in their carnal minds was the undermining and revising of traditional American and Judeo-Christian values. \n \n One of the most revered mantras of the liberal fundamentalists is \"equality\". The net effect of this experiment was to elevate women via the degradation of men; promote racial equality by instituting racial-based preferences and reverse-discrimination; engender class warfare against people of means via the redistribution of wealth (a concept centered in greed for other people's money, rather than rely on one's own personal initiative and work ethic); and elevate wickedness (sodomy, fornication, and other corrupt lifestyles) to the plateau of respectability at the expense of traditional Godly values. \n \n Along with the failed liberal concept of equality was the mantra of liberal \"tolerance\".However, liberal tolerance is not what it appears to be. It is a corrupted partisan philosophical perspective with its own rigid set of dogmas. It assumes, for instance, a relativistic view of moral and religious knowledge. This assumption has shaped the way many people think about issues such as homosexuality, abortion rights, and religious truth claims, leading them to believe that a liberally tolerant posture concerning these issues is the correct one and that it ought to be reflected in our laws and customs. But this posture is often dogmatic, intolerant, and coercive, for it asserts that there is only one correct view on these issues, and if one does not embrace it, one may likely face public ridicule, demagogic tactics, and perhaps even legal reprisals. Liberal tolerance is therefore neither liberal nor tolerant.\" \n \n Rather than truly embrace \"freedom\", liberal fundamentalists seek to control virtually every aspect of the lives of the masses which are unfortunate enough to be under their fundamentalist rulership. They seek to outlaw SUV's, impose smoking bans while advocating marijuana use, prohibit freedom of religious expression in government and public schools, advocate compulsory training in politically correct opinions and attitudes, seek to enforce Bible bans in schools, embrace a de-facto litmus test against possible pro-life judicial nominees, seek to criminalize pro-life demonstrations through the RICO racketeering statute, seek to squelch religious speech via \"hate-speech\" laws, and generally engage in a whole range of behaviors designed to subvert the U.S. Constitution and traditional American values.\n \n Liberal fundamentalism undermines the basic effectiveness of the government, legislatures, and other societal elements of democracy. Despite the idealistic goals of liberalism, attempts to build a utopian liberal society in America have only led to heightened outbreaks of AIDS, VD, porno-related crime, social divisions, divorce, abortion, drug addictions, deficit spending, the welfare state, a crushing tax burden, the breakdown of the family unit, moral depravity, and numerous other such scourges which have resulted in enormous societal suffering and discontent. As a result, liberal fundamentalism is strongly associated with left-wing fanaticism, reverse-racism, anti-intellectualism, elitism, nihilism, godlessness, and societal violence.", 
   {
    "unicode_changes_made": true
   }, 
   179571, 
   null, 
   1132190760.0
  ], 
  [
   179801, 
   null, 
   "trebor", 
   "The Dangers of Liberal Fundamentalists\n \n .\n\n \n \n Yes , you have cut/paste that piece of spam before. Repeating lies over and over again doesn't make it any more true.", 
   {}, 
   179788, 
   null, 
   1132194960.0
  ], 
  [
   179803, 
   null, 
   "joebrummer", 
   "The term liberal fundementalist is a buzz term and a oxymoron. There is no such thing. The point still stands and EZ's attempt to wish wash it hasn't worked.. Fundentalist christians are no different or any less dangerous as fundementalist muslims. These are people so bent on the belief, they are willing to sacrifice the lives of others to further their agenda. Inclusing Ez. Facts are facts and the facts are fundementalists are dangerous.", 
   {}, 
   179801, 
   null, 
   1132195260.0
  ], 
  [
   179806, 
   null, 
   "jyoshu", 
   "The term liberal fundementalist is a buzz term and a oxymoron. There is no such thing. \n\n \n Bull. You ARE a liberal fundamentalist.\n \n Any ideology can have a fundamentalist vein. Extremism can, unfortunately, come out of any ideology.", 
   {}, 
   179803, 
   null, 
   1132195620.0
  ], 
  [
   179807, 
   null, 
   "Howard Beale", 
   "EZ:\n \n The Dangers of Conservative Fundamentalists\n \n Conservative Fundamentalism is a failed and destructive philosophical enterprise, replete with a host of anti-Biblical, pseudo-religious doctrines, that seeks to elevate the ways and \"certainty\" of man above the wisdom and desires of God. It's principle aim is the sacking of traditional Judaic and Christian values and beliefs, which are \"revisited\" through suspect conservative \"scholarship\" or politically-correct dogma in an effort to replace them with the tenets of rigid anti-christian moral self-righteousness and the failed social doctrines of today's conservative elitists .\n The genesis of today's conservative fundamentalists were the anti-American, right wing fanatics of the 1970's and 80's. They advocated a theocratic state and the subjugation of the working class, limitation on medical research, preemptive war, contempt for minorities, and enjoyed a prosperous America founded on the very hard work and enterprise they sought to crush. The freedoms they enjoyed were purchased by the blood, sweat, and tears and personal sacrifices of the very forefathers they held in contempt.\n \n Personal responsibility, self-restraint and self-sacrifice were foreign concepts to them. \"Right and wrong\", \"good and evil\" were arbitrarily revised, for such concepts had no objective meaning to them. They had no objective rationality for their bellicose philosophy other than it \"God tell me its right, so let's do it\". The only righteous cause that qualified for support in their self-righteous minds was the undermining and revising of traditional American and Judeo-Christian values to conform to their right wing agenda. \n \n One of the most revered mantras of the conservative fundamentalists is \"God made man first\". The net effect of this misconception was to elevate men via the degradation of women; promote racial tension by exalting white supremacy and reverse-discrimination; engender class warfare against people the poor via the redistribution of wealth from the have nots to the haves (a concept centered in greed for other people's money, rather than rely on one's own personal initiative and work ethic); and elevate wickedness (sodomy, fornication, and other corrupt lifestyles) to the plateau of respectability at the expense of traditional Christian values. \n \n Along with the failed conservative concept of inequality was the mantra of conservative \"compassion\". However, conservative compassion is not what it appears to be. It is a corrupted partisan philosophical perspective with its own rigid set of dogmas. It assumes, for instance, a rigid, self-serving view of moral and religious knowledge. This assumption has shaped the way many people think about issues such as homosexuality, abortion rights, and religious truth claims, leading them to believe that a conservatively compassionate posture concerning these issues is the correct one and that it ought to be reflected in our laws and customs. But this posture is often dogmatic, intolerant, and coercive, for it asserts that there is only one correct view on these issues, and if one does not embrace it, one may likely face public ridicule, demagogic tactics, and perhaps even legal reprisals. Conservative compassion is therefore neither conservative nor \"compassionate.\" \n \n Rather than truly embrace \"freedom\", conservative fundamentalists seek to control virtually every aspect of the lives of the masses which are unfortunate enough to be under their fundamentalist rulership. They seek to outlaw criticism of the government, impose bans on independent investigative reporting while advocating expansion of governmental secrecy laws, prohibit freedom of expression in government and public schools, advocate compulsory training in religiously correct opinions and attitudes, seek to enforce Bible science in schools, embrace a de-facto litmus test against possible pro-choice judicial nominees, seek to criminalize a woman's rights over her own body, seek to squelch political speech via \"patriotic\" laws, and generally engage in a whole range of behaviors designed to subvert the U.S. Constitution and traditional American values.\n \n Conservative fundamentalism undermines the basic effectiveness of the government, legislatures, and other societal elements of democracy. Despite the idealistic goals of conservativeism, attempts to build their concept of a utopian conservative society in America have only led to heightened outbreaks of AIDS, VD, world wide hatred of America, social divisions, greater poverty, drug addictions, deficit spending, the corporate welfare state, a crushing tax burden on the middle class, the breakdown of the trust, moral relativism, and numerous other such scourges which have resulted in enormous societal suffering and discontent. As a result, conservative fundamentalism is strongly associated with right-wing fanaticism, racism, anti-intellectualism, self-righteous religious elitism, and societal violence.", 
   {
    "unicode_changes_made": true
   }, 
   179788, 
   null, 
   1132195860.0
  ], 
  [
   179812, 
   null, 
   "joebrummer", 
   "Bull. You ARE a liberal fundamentalist.\n \n Any ideology can have a fundamentalist vein. Extremism can, unfortunately, come out of any ideology.\n\n \n \n \n I think you have no idea what a fundementalist is, and even less of an idea if I should happen to be one. You are only offended by the idea that taken the bible to fundementalist extreme is dangerous. BY the facts are stact against the abortion clicnics bombed by fundementalist chrsitians.", 
   {}, 
   179806, 
   null, 
   1132196160.0
  ], 
  [
   179814, 
   null, 
   "Dr_Sprocket", 
   "The religious did not introduce morality to man kind. Morality existed long before the religious came along. Morality did not come from the religious. Morality was not invented by the religious. The religious try to use morality but are not real good at it. The religious do not own morality. The religious did not design morality. The religious are not the essence of morality. Morally exists independently of the religious. Morally exists without the presence of the religious. \n \n The religious think with out them there would be no morality or good deeds in the world. The religious are obviously incorrect and in fact the opposite is true. The religious don&#8217;t know yet that with out them the world is going to be a better place. Had the religious never existed and rational thought allowed to flourish suffering through out history would be drastically reduced and man kind would be thousands of years ahead of where he is now. The religious will take you back to the dark ages if you let them and indeed all one need do is watch the news to see that this is the case. \n \n The religious are mostly unwittingly immoral. The religious peddle bigotry. The religious peddle an ancient book of mythology as a manual for social design. The religious don&#8217;t know what they are doing, but watch out because, that never stopped them before. \n \n The religious believe they are made in gods image. The truth is the religious made in god in mans image. How egocentric can you get! The religious believe that they are god like and display false humility. The religious are egocentric elitist that believe they are like god so being that way is approved by god. The religious are intrusive and impose upon others unwittingly because they think are like god. The religious are always in possession of truth because they think are like god, but what they really are is in possession of is a bunch of old ferry tails . The religious delude themselves with old myths that tell them they are made in gods image and other such self absorbed nonsense. The religious do this at the expense of the rest of the world because, it brings them confront. The religious fill themselves up with this old useless myth, because, it brings them confront like drug users. The religious don&#8217;t like science and biology, because, it brings them confront to not think to much. The religious know they don&#8217;t have to worry about things that make them think about so do not think about things they don&#8217;t want understand. The religious like to solve problems by killing thing. The religious think mother nature is something that you screw. The religious think that the universe revolves around them that&#8217;s why they don&#8217;t like science. The religious are an arrogant, egocentric powerful majority but they are always on the defensive, because even they can see that their time of bloody horror imposed up on all of humanity is almost over, thank God.\n \n The religious teached me how to think like this, and how to spell.\n \n Oh, I almost forgot, na na na na.", 
   {}, 
   179788, 
   null, 
   1132196340.0
  ], 
  [
   179816, 
   null, 
   "joebrummer", 
   "Bull. You ARE a liberal fundamentalist.\n \n Any ideology can have a fundamentalist vein. Extremism can, unfortunately, come out of any ideology.\n\n \n \n based on the real defintion of the word FUNDEMENTLAIST, it is impossible for me to be one. Liberal added to the term is an opposite term. The two together don't belong in a phrase because the defintions contradict each other.....therfore \"liberal fundementalism\" is an oxymoron....see\n \n \n Main Entry: fun·da·men·tal·ism \n Pronunciation: -t&l-\"i-z&m\n Function: noun\n 1 a often capitalized : a movement in 20th century Protestantism emphasizing the literally interpreted Bible as fundamental to Christian life and teaching b : the beliefs of this movement c : adherence to such beliefs\n 2 : a movement or attitude stressing strict and literal adherence to a set of basic principles\n - fun·da·men·tal·ist /-t&l-ist/ noun\n - fundamentalist or fun·da·men·tal·is·tic /-\"men-t&l-'is-tik/ adjective \n \n \n \n liberal\n adj 1: showing or characterized by broad-mindedness; \"a broad\n political stance\"; \"generous and broad sympathies\"; \"a\n liberal newspaper\"; \"tolerant of his opponent's\n opinions\" [syn: broad, tolerant]", 
   {}, 
   179806, 
   null, 
   1132196640.0
  ], 
  [
   179830, 
   null, 
   "Easyrider", 
   "EZ:\n \n The Dangers of Conservative Fundamentalists...... \n\n \n More hot air from the liberal cheap seats.", 
   {}, 
   179807, 
   null, 
   1132199760.0
  ], 
  [
   179833, 
   null, 
   "Howard Beale", 
   "More hot air from the liberal cheap seats.\nSweets for the sweet. You should read it EZ then read the one you posted. the point is that either side can call each other names.", 
   {}, 
   179830, 
   null, 
   1132200360.0
  ], 
  [
   179849, 
   null, 
   "Easyrider", 
   "Sweets for the sweet. You should read it EZ then read the one you posted. the point is that either side can call each other names.\n\n \n I think the fact that you have a hard time dealing with is that Jesus himself was a religious fundamentalist. He had his own Biblically-based FUNDAMENTAL TRUTHS that he not only espoused, but that he taught and commanded his disciples to take to the entire world and make disciples of all nations.", 
   {}, 
   179833, 
   null, 
   1132203600.0
  ], 
  [
   179852, 
   null, 
   "Orion", 
   "I think the fact that you have a hard time dealing with is that Jesus himself was a religious fundamentalist.\n\n \n The evidence suggests that Jesus of Nazareth was a reformer, as were his early followers. If, in fact, he was a religious fundamentalist as we currently recognize the term, he would have had very little, if anything, to say. In fact, some would argue that, based on some of his teachings, he was quite the radical.", 
   {}, 
   179849, 
   null, 
   1132204320.0
  ], 
  [
   179854, 
   null, 
   "joebrummer", 
   "I think the fact that you have a hard time dealing with is that Jesus himself was a religious fundamentalist. He had his own Biblically-based FUNDAMENTAL TRUTHS that he not only espoused, but that he taught and commanded his disciples to take to the entire world and make disciples of all nations.\n\n \n \n It is impossible that Jesus could have been a fundie....the book fundie's use was not written in his time....", 
   {}, 
   179849, 
   null, 
   1132206000.0
  ], 
  [
   179855, 
   null, 
   "jyoshu", 
   "Main Entry: fun&#183;da&#183;men&#183;tal&#183;ism \n \n 2 : a movement or attitude stressing strict and literal adherence to a set of basic principles\n - fun&#183;da&#183;men&#183;tal&#183;ist /-t&l-ist/ noun\n - fundamentalist or fun&#183;da&#183;men&#183;tal&#183;is&#183;tic /-\"men-t&l-'is-tik/ adjective \n \n \n \n liberal\n adj 1: showing or characterized by broad-mindedness; \"a broad\n political stance\"; \"generous and broad sympathies\"; \"a\n liberal newspaper\"; \"tolerant of his opponent's\n opinions\" [syn: broad, tolerant]\n\n \n Ok, then I was wrong . . . you aren't truly liberal, only fundamentalist.", 
   {}, 
   179816, 
   null, 
   1132207080.0
  ], 
  [
   179858, 
   null, 
   "Howard Beale", 
   "I think the fact that you have a hard time dealing with is that Jesus himself was a religious fundamentalist.\nMonsignor John P. Meier a biblical scholar and professor of New Testament in the Biblical Studies Department at Catholic University of America who holds a doctorate in sacred Scripture (1976) from the Biblical Institute in Rome, and is a former president of the Catholic Biblical Association says: When you find out that Jesus actually was a radical egalitarian feminist socialist with a social agenda, one cannot help but think that a great deal of politically correct 80&#8217;s and 90&#8217;s academic life is being read back into this first-century Jew.\n \n There are many Biblical scholars who agree with him.\n \n I put the words in boldface for emphasis.", 
   {}, 
   179852, 
   null, 
   1132209420.0
  ], 
  [
   179868, 
   null, 
   "Iuris", 
   "Actually, liberal fundamentalism is possible. It would stress the fundamentals of liberalism, going either to the core of liberalism, stressing the direct freedom aspects over the side efforts that rather limit pure liberty in order to allow general liberty, or turn to the historic goals of liberalism.", 
   {}, 
   179858, 
   null, 
   1132226520.0
  ], 
  [
   179972, 
   null, 
   "Easyrider", 
   "Monsignor John P. Meier a biblical scholar and professor of New Testament in the Biblical Studies Department at Catholic University of America who holds a doctorate in sacred Scripture (1976) from the Biblical Institute in Rome, and is a former president of the Catholic Biblical Association says: When you find out that Jesus actually was a radical egalitarian feminist socialist with a social agenda, one cannot help but think that a great deal of politically correct 80's and 90's academic life is being read back into this first-century Jew.\n\n \n Oh, please. Jesus was only a radical to the perverted leaders of Israel who had a fruit-cake understanding of what God's Word was all about. In fact, Jesus is the God of the Old Testament.\n \n Was Jesus a liberal? (And don't confuse political conservatism / liberalism with Biblical conservatism / liberalism). As God, Jesus is the one who gave Moses the Levitical law against gay sex to begin with; and he's the one who inspires all Scripture (2 Timothy 3:16), including Romans 1:26-27 and I Corinthians 6:9-10. He's the one who knits together babies in their mother's wombs (Psalm 139:13) that you liberals love to butcher. He's the one who said to the adulteress, \"Go and sin no more'. Liberals often say there is no sin, and they'll do whoever they want, any way they want, whenever they want, and will do them with pride. Jesus is the one who says a man shall reap what he sows, as opposed to the liberals' greedy \"redistribution of wealth\" scheme, which says that people should reap for a living what other people sow. And Jesus is the one in the Book of Revelation who judges wicked sinners and sends them to the Lake of Fire. Liberals would never cast judgments, unless they're talking to a conservative, and then they turn into Mr. Judgmental themselves. And if liberals could recognize evil at all they'd either show tolerance towards it, endlessly debate it at the U.N., or appease it until the cows came home. Jesus a liberal? Get real.\n \n And for the record, Jesus \"conserved\" the law of God in his day. It was the corrupt pharisees, etc., who took (liberal) \"liberties\" with it to begin with.", 
   {
    "unicode_changes_made": true
   }, 
   179858, 
   null, 
   1132272300.0
  ], 
  [
   179974, 
   null, 
   "Howard Beale", 
   "EZ:\n \n Just wanted to bring to your attention that there are mainstream Christian scholars, priests and ministers who do not agree with you in hopes that you will address those who disagree with you in a more Christian manner.", 
   {}, 
   179972, 
   null, 
   1132272720.0
  ], 
  [
   179981, 
   null, 
   "trebor", 
   "EZ:\n \n Just wanted to bring to your attention that there are mainstream Christian scholars, priests and ministers who do not agree with you in hopes that you will address those who disagree with you in a more Christian manner.\n\n \n He won't. If anything, he will get more vandictive, more combative and more prejudiced.", 
   {}, 
   179974, 
   null, 
   1132274280.0
  ], 
  [
   179985, 
   null, 
   "joebrummer", 
   "So is EAsyrider really Jerry Falwell? Fred Phelps? or Pat Robertson? Maybe he is the guy from Christian Exodus. Which fruit cake is he? He talks out both sides of his mouth and seems to think he has the \"true\" message of god. He seems to think he is as infallable as the bible he spews quotes from. One question though, what if he is wrong, and that all this judgment he passes send him into the lake of fire?", 
   {}, 
   179974, 
   null, 
   1132275360.0
  ], 
  [
   179998, 
   null, 
   "Easyrider", 
   "So is EAsyrider really Jerry Falwell? Fred Phelps? or Pat Robertson? Maybe he is the guy from Christian Exodus. Which fruit cake is he? He talks out both sides of his mouth and seems to think he has the \"true\" message of god. He seems to think he is as infallable as the bible he spews quotes from. One question though, what if he is wrong, and that all this judgment he passes send him into the lake of fire?\n\n \n Your left-wing, radical, humanism is only surpassed by your inability to come to the truth that gay sex is an abomination in God's eyes.\n \n Leviticus 18:22 - \" 'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n Leviticus 20:13 - \" If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders 10nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n There's others as well.", 
   {
    "unicode_changes_made": true
   }, 
   179985, 
   null, 
   1132282020.0
  ], 
  [
   180003, 
   null, 
   "trebor", 
   "Your left-wing, radical, humanism is only surpassed by your inability to come to the truth that gay sex is an abomination in God's eyes.\n \n Leviticus 18:22 - \" 'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n Leviticus 20:13 - \" If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders 10nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n There's others as well.\n\n \n \n Well, \"Unnatural lusts\" is obvious beastality.. not girl on girl sex.\n \n And corinthians obvious is a translation based on political asperations and interpreations, rather than what the text actually says. The term HOMOSEXUAL didn't exist until modern times, and even the concept of a\n 'homosexual' didn't exist as such. That is the dishonesty I have come to expect from certain brands of Chrisitainity.", 
   {
    "unicode_changes_made": true
   }, 
   179998, 
   null, 
   1132282620.0
  ], 
  [
   180005, 
   null, 
   "joebrummer", 
   "Your left-wing, radical, humanism is only surpassed by your inability to come to the truth that gay sex is an abomination in God's eyes.\n \n Leviticus 18:22 - \" 'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n Leviticus 20:13 - \" If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders 10nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n There's others as well.\n\n \n \n \n \n ....flush...I do not believe in Your god!! so I could care less what your book says!", 
   {
    "unicode_changes_made": true
   }, 
   179998, 
   null, 
   1132282800.0
  ], 
  [
   180013, 
   null, 
   "Orion", 
   "Your left-wing, radical, humanism is only surpassed by your inability to come to the truth that gay sex is an abomination in God's eyes.\n\n \n You don't know what God thinks, EZ. Rather, your opinions are based upon a collection of ancient writings by a tribal people who came up with a list of prohibitions, one of which was against gay sex and another the eating of shellfish. That anyone would attempt to project such prohibitions into the 21st century is an example of absurdity.", 
   {}, 
   179998, 
   null, 
   1132286880.0
  ], 
  [
   180017, 
   null, 
   "Easyrider", 
   "You don't know what God thinks, EZ. Rather, your opinions are based upon a collection of ancient writings by a tribal people who came up with a list of prohibitions, one of which was against gay sex and another the eating of shellfish. That anyone would attempt to project such prohibitions into the 21st century is an example of absurdity.\n\n \n Same old failed, liberal denials. You approve of fornication (as you've confessed in other forums), and the gays love their gay sex sin. But there's going to be the devil to pay for your revisionist folly before it's all said and done.", 
   {}, 
   180013, 
   null, 
   1132288320.0
  ], 
  [
   180044, 
   null, 
   "Iuris", 
   "All right, Easyrifer, gird your loins, put your right hand on the Bible and answer this question:\n \"Have you ever eaten shellfish or pork or worn an article of clothing that stated that it was made from X% cotton and Y% something else?\"", 
   {}, 
   180017, 
   null, 
   1132305060.0
  ], 
  [
   180048, 
   null, 
   "Adept", 
   "Your left-wing, radical, humanism is only surpassed by your inability to come to the truth that gay sex is an abomination in God's eyes.\n \n Leviticus 18:22 - \" 'Do not lie with a man as one lies with a woman; that is detestable.&#8221;\n \n Leviticus 20:13 - \" If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.&#8221;\n \n Romans 1:26-27 &#8211; &#8220;Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.&#8221;\n \n 1 Corinthians 6:9-10 &#8211; &#8220;Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders 10nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.&#8221;\n \n There&#8217;s others as well.\n\n \n Oh, I'm sorry. I must have missed your post in this thread. I mean, I got the 'gay sex is teh suxxors' post, but nothing of substance.\n \n For the sake of completeness, I'll repost my open challenge here, so that you can reply and thus vindicate yourself.\n \n Can you provide conclusive evidence which indicates that the bible being wholly true and accurate is more likely than all other possible theories or explanations? Remember, failure to indicate beyond reasonable doubt that the bible being true is the most likely theory or explanation automatically invalidates your biblical support for your homosexual bias.", 
   {}, 
   179998, 
   null, 
   1132308960.0
  ], 
  [
   180197, 
   null, 
   "Easyrider", 
   "All right, Easyrifer, gird your loins, put your right hand on the Bible and answer this question:\n \"Have you ever eaten shellfish or pork or worn an article of clothing that stated that it was made from X% cotton and Y% something else?\"\n\n \n Have you ever read the book of Acts about clean foods and studied the New Testament / Covenant? \n \n Have God's moral laws against such things as murder, adultery, fornication, etc., ever passed away?\n \n Next....", 
   {}, 
   180044, 
   null, 
   1132358100.0
  ], 
  [
   180266, 
   null, 
   "Adept", 
   "Next....\n\n \n Next? But Easy, you still haven't addressed the extremely important issue of the bibles accuracy and validity. Lets deal with that before we get carried away using it as a basis of argument, shall we?", 
   {}, 
   180197, 
   null, 
   1132383060.0
  ], 
  [
   180290, 
   null, 
   "Easyrider", 
   "Next? But Easy, you still haven't addressed the extremely important issue of the bibles accuracy and validity. Lets deal with that before we get carried away using it as a basis of argument, shall we?\n\n \n Go do your own research like I had to. I didn't take you to raise.", 
   {}, 
   180266, 
   null, 
   1132410480.0
  ], 
  [
   180304, 
   null, 
   "Mucusaur", 
   "Go do your own research like I had to. I didn't take you to raise.\n\n \n But you're supposed to be a missionary, here to eductae the unenlightened. When some one asks for instruction, you tell them to get lost? How does that make sense?\n \n I suspect you cannot answer adepts question, and will continue dodge the issue.", 
   {}, 
   180290, 
   null, 
   1132416120.0
  ], 
  [
   180330, 
   null, 
   "trebor", 
   "Go do your own research like I had to. I didn't take you to raise.\n\n \n \n Well, I have. That is how I know your claims are inaccurate to say the least.", 
   {}, 
   180290, 
   null, 
   1132424880.0
  ], 
  [
   180331, 
   null, 
   "joebrummer", 
   "Go do your own research like I had to. I didn't take you to raise.\n\n \n \n Some of us have done the reseach, but come to the opposite conclusions you did.", 
   {}, 
   180290, 
   null, 
   1132424940.0
  ], 
  [
   180335, 
   null, 
   "Easyrider", 
   "Some of us have done the reseach, but come to the opposite conclusions you did.\n\n \n That's because you want to try to justify gay sex sin, so you had to twist the Bible around to suit what your itching ears want to hear.", 
   {}, 
   180331, 
   null, 
   1132425120.0
  ], 
  [
   180336, 
   null, 
   "joebrummer", 
   "That's because you want to try to justify gay sex sin, so you had to twist the Bible around to suit what your itching ears want to hear.\n\n \n \n I actually stopped believing in the bible ong before I came out. I stopped believing becuse in my opinion the bible was full of contradictions, and hateful things. For each thing it tells you to do in one chapter it tells you something else in another chapter. YOu refuse to see this and would rather rationalize to fit your own prejudice and hate. But if that helps you sleep at night, go for it.", 
   {}, 
   180335, 
   null, 
   1132425240.0
  ], 
  [
   180404, 
   null, 
   "simone", 
   "EZ:\n \n Just wanted to bring to your attention that there are mainstream Christian scholars, priests and ministers who do not agree with you in hopes that you will address those who disagree with you in a more Christian manner.\nEZ behave in a Christian manner? Impossible!", 
   {}, 
   179974, 
   null, 
   1132436520.0
  ], 
  [
   180411, 
   null, 
   "joebrummer", 
   "EZ behave in a Christian manner? Impossible!\n\n \n \n I am curious, doesn't it bother EZ that people think he is unchristian. Doesn't it make him think, if this many people think maybe I am a little unchristian well maybe I am?", 
   {}, 
   180404, 
   null, 
   1132438260.0
  ], 
  [
   180475, 
   null, 
   "Adept", 
   "That's because you want to try to justify gay sex sin, so you had to twist the Bible around to suit what your itching ears want to hear.\n\n \n Who cares? You can't validate the bible, so any argument from the bible that gay sex is bad is automatically invalid.\n \n All the research I've done indicates the bible is false. If you have conclusive evidence that indicates it is true, then share it with me and others.", 
   {}, 
   180335, 
   null, 
   1132470660.0
  ], 
  [
   180560, 
   null, 
   "Orion", 
   "That's because you want to try to justify gay sex sin, so you had to twist the Bible around to suit what your itching ears want to hear.\n\n \n You're making a number of questionable assumptions here, EZ. First, you're assuming that the person to whom you addressed this considers the Bible to be credible, and that he considers its various admonitions and prohibitions to be applicable to the 21st century. You've already discovered that a great many people do not hold to those views, and that these people are not ignorant of the Bible nor are they deluded or possessed of demons. For these people, there is therefore no need to \"justify\", say, gay sex with respect to the Bible, nor is there any need for them to \"twist\" anything contained within the Bible concerning the subject of gay sex.", 
   {}, 
   180335, 
   null, 
   1132520340.0
  ], 
  [
   180596, 
   null, 
   "Orion", 
   "You don't know what God thinks, EZ. Rather, your opinions are based upon a collection of ancient writings by a tribal people who came up with a list of prohibitions, one of which was against gay sex and another the eating of shellfish. That anyone would attempt to project such prohibitions into the 21st century is an example of absurdity.\n\n \n \nSame old failed, liberal denials. You approve of fornication (as you've confessed in other forums)...\n\n \n I haven't \"confessed\" to anything, EZ. With regard to my sexuality, there is nothing for me to \"confess\". I suggest you quit playing word games. \"Fornication\"? Another odd choice of word. Later, I'm going to engage in a bit of \"gluttony\" (lunch) followed by \"sloth\" (a nap). \n \n \n...and the gays love their gay sex sin.\n\n \n \"Sin\"? That being your opinion, I'd advise you to abstain from gay sex, EZ.\n \n \nBut there's going to be the devil to pay for your revisionist folly before it's all said and done.\n \n \n \"Revisionist folly\"? LOL! Well, EZ, let me respond by stating that I have little sympathy for your reactionary, rear guard, desperation-driven, theocratic, fire and brimstone positions :-)", 
   {}, 
   180017, 
   null, 
   1132527960.0
  ], 
  [
   180753, 
   null, 
   "Easyrider", 
   "You're making a number of questionable assumptions here, EZ. First, you're assuming that the person to whom you addressed this considers the Bible to be credible, and that he considers its various admonitions and prohibitions to be applicable to the 21st century. You've already discovered that a great many people do not hold to those views, and that these people are not ignorant of the Bible nor are they deluded or possessed of demons. For these people, there is therefore no need to \"justify\", say, gay sex with respect to the Bible, nor is there any need for them to \"twist\" anything contained within the Bible concerning the subject of gay sex.\n\n \n \n Wrong again, Orion. Gay sex remains a sin. \n \n I recommend all the gays around here receive Jesus Christ as their Lord and Savior for the remission of all their sins and let the Holy Spirit (which you get when you receive Christ) lead them into a better and more Godly life.", 
   {}, 
   180560, 
   null, 
   1132617180.0
  ], 
  [
   180762, 
   null, 
   "jitobear", 
   "Wrong again, Orion. Gay sex remains a sin. \n \n I recommend all the gays around here receive Jesus Christ as their Lord and Savior for the remission of all their sins and let the Holy Spirit (which you get when you receive Christ) lead them into a better and more Godly life.\n\n \n If it means coming out ANYTHING like you, I am here to recommend AGAINST IT!!!!\n \n You are the one who is wrong. Not about gay sex being a sin. Yep, you and your religion believe that. I have no doubt in my mind.\n \n However, what Orion was actually saying and what you really seem to fail to comprehend, is the very simple idea that not everyone here adheares to Christianity and therefore they do not feel compelled to justify anything before it, let alone you. \n \n Now you may believe that one day they will have to when Jesus comes with his big bad angels to kick all our heathen, liberal, XXXXX, baby-killing asses while you, my loving brother emoticon_rolleyes, eat popcorn. But that does not change the very real fact that there are people, here and now, who think your religion is bunk.\n \n Really they do.", 
   {}, 
   180753, 
   null, 
   1132618800.0
  ], 
  [
   180791, 
   null, 
   "Easyrider", 
   " If it means coming out ANYTHING like you, I am here to recommend AGAINST IT!!!! \n\n \n Jesus is the model, Jito. Don't ever forget that.\n \n \nHowever, what Orion was actually saying and what you really seem to fail to comprehend, is the very simple idea that not everyone here adheares to Christianity and therefore they do not feel compelled to justify anything before it, let alone you.\n\n \n Orion buries his head in the sand too, denying the very one who can save him. \n \n \nNow you may believe that one day they will have to when Jesus comes with his big bad angels to kick all our heathen, liberal, XXXXX, baby-killing asses while you, my loving brother emoticon_rolleyes, eat popcorn. But that does not change the very real fact that there are people, here and now, who think your religion is bunk. \n\n \n You people think a lot of very strange things, Jitobear. Doesn't make them true.", 
   {}, 
   180762, 
   null, 
   1132630800.0
  ], 
  [
   180804, 
   null, 
   "trebor", 
   "Jesus is the model, Jito. Don't ever forget that.\n \n\n \n Yes, the very model of a false prophet. He is reported to have done everything that Deut. warned about in a false prophet indeed.\n \n \n \n\n You people think a lot of very strange things, Jitobear. Doesn't make them true.\n\n \n The same can be said of you.", 
   {}, 
   180791, 
   null, 
   1132636800.0
  ], 
  [
   180827, 
   null, 
   "Adept", 
   "Jesus is the model, Jito. Don't ever forget that.\n \n \n \n Orion buries his head in the sand too, denying the very one who can save him. \n \n \n \n You people think a lot of very strange things, Jitobear. Doesn't make them true.\n\n \n I want to put you on ignore. I badly want to do it because you are evidently incapable of honest self-evaluation. You can't objectively ask yourself the hard questions like 'what reason do I have to believe in the Bible over the Space Monkey book?'. Thus any conversation with you is wasted, because when confronted with questions you can't answer, you simply ignore them or resort to thumping your bible even harder.\n \n However, I won't put you on ignore. Because ignoring biased, hateful and willfully ignorant people who, like yourself, seek refuge in religion is what leads to their growth in power and influence. You need to be confronted, your beliefs challenged, and the ignorance of your views exposed so that everyone who witnesses it can see for themselves how simply outrageous belief in the bible is.\n \n And so I will continue to badger you, every time you tell someone they are wrong or sinful because the bible says so. Every time you hold the bible up as a true document, I will ask \"What conclusive evidence do you have which indicates that the bible being wholly true and accurate is the most likely of all possible theories or explanations?\" And any answers you give me will be put through the wringer.", 
   {}, 
   180791, 
   null, 
   1132648320.0
  ], 
  [
   180841, 
   null, 
   "jitobear", 
   "Jesus is the model, Jito. Don't ever forget that.\n\n \n I read the Bible. Jesus was not a sharp-tongued, stereo-typing troll, who reveled in telling the world how awful they were next to him. You exemplify Christ about as a well as Mohamid Ali exemplifies Maralyn Monroe\n \n \nYou people think a lot of very strange things, Jitobear. Doesn't make them true.\n\n \n What are you claiming isn't true? That there are people who think your religion is bunk? That's not untrue. It is true - there are really people who do.", 
   {}, 
   180791, 
   null, 
   1132671360.0
  ], 
  [
   180953, 
   null, 
   "Orion", 
   "You people think a lot of very strange things, Jitobear. Doesn't make them true.\n\n \n You mean, like, demonic possession? Or the idea that some people at these fora are under Satanic influence as evidenced by the fact that they disagree with your theology? Or that biological evolution is Satan's lie? Or that heaven exists somewhere in the sky and hell exists deep within the earth? Is that what you mean by \"strange things\", EZ?", 
   {}, 
   180791, 
   null, 
   1132698780.0
  ], 
  [
   181109, 
   null, 
   "Easyrider", 
   "I want to put you on ignore. I badly want to do it because you are evidently incapable of honest self-evaluation. You can't objectively ask yourself the hard questions like 'what reason do I have to believe in the Bible over the Space Monkey book?'. Thus any conversation with you is wasted, because when confronted with questions you can't answer, you simply ignore them or resort to thumping your bible even harder.\n \n However, I won't put you on ignore. Because ignoring biased, hateful and willfully ignorant people who, like yourself, seek refuge in religion is what leads to their growth in power and influence. You need to be confronted, your beliefs challenged, and the ignorance of your views exposed so that everyone who witnesses it can see for themselves how simply outrageous belief in the bible is.\n \n And so I will continue to badger you, every time you tell someone they are wrong or sinful because the bible says so. Every time you hold the bible up as a true document, I will ask \"What conclusive evidence do you have which indicates that the bible being wholly true and accurate is the most likely of all possible theories or explanations?\" And any answers you give me will be put through the wringer.\n\n \n Spoken like a true, anti-biblical bigot. Remember, we have an objective basis for our beliefs in the Bible. You don't even have that much. Like I've asked you before, what objective basis do you have for your failed, liberal beliefs? Do you just want to whine against Jesus and the Bible or do you have something better to offer up that isn't the invention of carnal men or whining, liberal women?", 
   {}, 
   180827, 
   null, 
   1132783320.0
  ], 
  [
   181117, 
   null, 
   "Howard Beale", 
   "Spoken like a true, anti-biblical bigot. Remember, we have an objective basis for our beliefs in the Bible. You don't even have that much. Like I've asked you before, what objective basis do you have for your failed, liberal beliefs? Do you just want to whine against Jesus and the Bible or do you have something better to offer up that isn't the invention of carnal men or whining, liberal women?\nYou know, EZ, the problem is that the teachings of the Bible have been so distorted that it is being transformed into a book of hate. People are not anti-Christian when you simply tell them exactly what Jesus said. They are anti-Christian when they are told lies and distortions about what he said - and that is exactly what you do. What you think the Bible says and what it actually says are very different. You are part of the problem. People speak out against others who speak in the tone you speak in, a tone replete with venom and bile. Jesus would speak out against it to. So those people who are speaking out against your words are really following Jesus' teachings and doing God's work.", 
   {
    "unicode_changes_made": true
   }, 
   181109, 
   null, 
   1132784880.0
  ], 
  [
   181199, 
   null, 
   "Adept", 
   "Spoken like a true, anti-biblical bigot. Remember, we have an objective basis for our beliefs in the Bible. You don't even have that much. Like I've asked you before, what objective basis do you have for your failed, liberal beliefs? Do you just want to whine against Jesus and the Bible or do you have something better to offer up that isn't the invention of carnal men or whining, liberal women?\n\n \n Don't project your narrow views onto me Easy. The only, I repeat the only issue here is your continued failure to demonstrate how the bible being wholly true and accurate is the most likely of all explanations or theories.\n \n Objective basis for your beliefs? Like what?", 
   {}, 
   181109, 
   null, 
   1132806480.0
  ], 
  [
   181221, 
   null, 
   "Easyrider", 
   "Don't project your narrow views onto me Easy. The only, I repeat the only issue here is your continued failure to demonstrate how the bible being wholly true and accurate is the most likely of all explanations or theories.\n\n \n Like I told you, I don't believe you are sincere in wanting to learn. You just want someone to spend a lot of time going through the evidences for you so you can mock and reject them. If you were really sincere in wanting to learn you'd have a library of your own Biblical books by now and wouldn't have to ask about it.\n \n Go do your own research like I had to.", 
   {}, 
   181199, 
   null, 
   1132839000.0
  ], 
  [
   181224, 
   null, 
   "Adept", 
   "Like I told you, I don't believe you are sincere in wanting to learn. You just want someone to spend a lot of time going through the evidences for you so you can mock and reject them. If you were really sincere in wanting to learn you'd have a library of your own Biblical books by now and wouldn't have to ask about it.\n \n Go do your own research like I had to.\n\n \n It's not about me wanting to learn. it's about you justifying your claims that the bible is wholly true and accurate. You assert that the bible being wholly true and accurate is the most likely of all possible theories and explanations.\n \n Yet you are unable to provide any evidence to support this claim.\n \n All research I have done on my own, and all research I have read, indicates that the bible is a collection of myths and legends, containing a few historical nuggets. If you think I'm wrong, and you obviously do, then tell me why you think that.", 
   {}, 
   181221, 
   null, 
   1132839840.0
  ], 
  [
   181251, 
   null, 
   "Easyrider", 
   "It's not about me wanting to learn. it's about you justifying your claims that the bible is wholly true and accurate. You assert that the bible being wholly true and accurate is the most likely of all possible theories and explanations.\n \n Yet you are unable to provide any evidence to support this claim.\n \n All research I have done on my own, and all research I have read, indicates that the bible is a collection of myths and legends, containing a few historical nuggets. If you think I'm wrong, and you obviously do, then tell me why you think that.\n\n \n Like I told you, I feel no obligation to try to justify anything to someone like you who is just trying to pick the fly poop out of the pepper. The claims of the Bible have been defended, at length, in numerous posts in this forum - by myself and many others. Review them. Do your due diligence and fend for yourself for a change.", 
   {}, 
   181224, 
   null, 
   1132851600.0
  ], 
  [
   181254, 
   null, 
   "Adept", 
   "Like I told you, I feel no obligation to try to justify anything to someone like you who is just trying to pick the fly poop out of the pepper. The claims of the Bible have been defended, at length, in numerous posts in this forum - by myself and many others. Review them. Do your due diligence and fend for yourself for a change.\n\n \n I don't think you quite understand. Due to your inability to verify the bible, any and all claims on morality that use the bible as their source are invalid.\n \n 'Numerous posts in this forum' just doesn't cut it. I've read many, many posts on these forums. No one has ever produced any credible, let alone conclusive evidence which supports your assertation.\n \n Your argument cannot run \"Gay sex is bad because the bible says so\". That is incomplete, and in isolation is worse than meaningless.\n \n To have any credibility at all, your argument must run \"Gay sex is bad because the bible says so, and this is why the bible is true\".\n \n Since you are seemingly incapable of questioning your own beliefs, and equally incapable of providing evidence to support your absolutely nonsensical claims, your willfully ignorant stances and beliefs simply wont wash.", 
   {}, 
   181251, 
   null, 
   1132852740.0
  ], 
  [
   181259, 
   null, 
   "Easyrider", 
   "I don't think you quite understand. Due to your inability to verify the bible, any and all claims on morality that use the bible as their source are invalid....(and yada yada yada..)\n\n \n You don't understand. It's not my INABILITY to verify the Bible. I've been verifying Biblical truths for some six years now in various fora. I just don't care to waste my time on someone like you who's heart is not in the right place about wanting to learn the Bible. \n \n If you're too lazy to do your own unbiased research, then you have to live with your eternal consequences. Your funeral.", 
   {}, 
   181254, 
   null, 
   1132853160.0
  ], 
  [
   181265, 
   null, 
   "trebor", 
   "You don't understand. It's not my INABILITY to verify the Bible. I've been verifying Biblical truths for some six years now in various fora. I just don't care to waste my time on someone like you who's heart is not in the right place about wanting to learn the Bible. \n \n If you're too lazy to do your own unbiased research, then you have to live with your eternal consequences. Your funeral.\n\n \n \n Unbiased?? You say you are verifying biblcial truths?? You can't even look at things in context, with proper translations, or even be consistant.", 
   {}, 
   181259, 
   null, 
   1132854000.0
  ], 
  [
   181266, 
   null, 
   "Adept", 
   "If you're too lazy to do your own unbiased research, then you have to live with your eternal consequences. Your funeral.\n\n \n There you go again. I can only live with my eternal consequences in the bible is true. And it isn't, so I'm safe.\n \n Six years? Then you should have a ready stockpile of sources you can point to and say \"Here, see? This proves beyond all reasonable doubt that every word in the bible is true!\"\n \n But you don't. How curious.\n \n If you don't want to debate the accuracy of the bible, why are you here? Without first proving that the bible is true, all of your other arguments are completely (again, completely) irrelevant. No one is going to care what some made up fictional book says about anything. So first, you have to prove to everyone that it is, in fact, true.\n \n It's not about doing anything for me. You need to do it for your yourself, for your own arguments.", 
   {}, 
   181259, 
   null, 
   1132854120.0
  ], 
  [
   181285, 
   null, 
   "DamEtel", 
   "I don't think you quite understand. Due to your inability to verify the bible, any and all claims on morality that use the bible as their source are invalid.\n\n \n Yes, that's true. However, it goes beyond that.\n \n Even if we forget about the need for someone to support the myths in the Bible and we simply accept it as being true, using the Bible as a basis for morality is STILL invalid. That is, the Divine Command Theory view of ethics is busted: it doesn't hold water.", 
   {}, 
   181254, 
   null, 
   1132858500.0
  ], 
  [
   181457, 
   null, 
   "Easyrider", 
   " There you go again. I can only live with my eternal consequences in the bible is true. And it isn't, so I'm safe.\n\n \n How would you know? You've never really studied it. Fact is you're in dire straights.\n \n \n \nIf you don't want to debate the accuracy of the bible, why are you here? Without first proving that the bible is true, all of your other arguments are completely (again, completely) irrelevant. No one is going to care what some made up fictional book says about anything. So first, you have to prove to everyone that it is, in fact, true.\n\n \n A fictional book? Where's your evidence? You made the claim, now back it up with something other than your usual, flaming rhetoric.", 
   {}, 
   181266, 
   null, 
   1132950720.0
  ], 
  [
   181462, 
   null, 
   "trebor", 
   "\n \n \n \n A fictional book? Where's your evidence? You made the claim, now back it up with something other than your usual, flaming rhetoric.\n\n \n Let's see, you have talking snake and donkeys, wizards, dead people walking about, demons being drivin into pigs, people walking on water, sticks being turned into snakes, and it ISN'T fictional?\n \n Wow.", 
   {}, 
   181457, 
   null, 
   1132953000.0
  ], 
  [
   181580, 
   null, 
   "Adept", 
   "A fictional book? Where's your evidence? You made the claim, now back it up with something other than your usual, flaming rhetoric.\n\n \n So you stance would be that until any book is proven false, it must be assumed to be true? Then I gladly refer you to my own book entitled 'A homily to Space Simians'.\n \n This book details how the world was created, and is secretly run by invisible flying space monkeys. Failure to acknowledge their rule of the universe will result in eternal damnation in the pub with no beer, while devotees of the cult of Monkey will be rewarded with their own personal beer fountain in the afterlife.\n \n Now, prove my book is false.\n \n Heck, I'll save you the legwork - Obviously the stance that everything is true until proven false is simply outrageous, especially where outlandish and fantastical claims are concerned. The bible has, as is already mentioned many many things in it which are considered impossible. If you wish to continue to insist that these currently impossible things are true, then you have a very heavy burden of proof. You have to prove every single thing in the bible, beyond a reasonable doubt. If you can't, and you acknowledge that you can't, then any argument from the bible is flawed since the opposition can say, truthfully, that we can't be certain the bible is true.\n \n Obviously your persistance on these forums indicates that you want to use the bible as a source for your arguments. Thats fine, but you must first indicate to us that your source is valid.", 
   {}, 
   181457, 
   null, 
   1132994520.0
  ], 
  [
   181802, 
   null, 
   "Easyrider", 
   "Now, prove my (space monkey) book is false.\n\n \n I think you need help, Adept.", 
   {}, 
   181580, 
   null, 
   1133109360.0
  ], 
  [
   181806, 
   null, 
   "Howard Beale", 
   "I think you need help, Adept.\nUnless he's right!", 
   {}, 
   181802, 
   null, 
   1133112720.0
  ], 
  [
   181807, 
   null, 
   "Adept", 
   "I think you need help, Adept.\n\n \n Hey, when you can prove that invisible flying space monkeys are sillier than an invisible man in the sky, talking animals and the living dead, I'll take you seriously. Until then, your obvious dismissal of one ridiculous book logically translates into dismissal of all ridiculous books. Unless you can come up with some good reasons for it's exemption, you should ridicule the bible as much as you would my book on space monkeys.", 
   {}, 
   181802, 
   null, 
   1133113380.0
  ], 
  [
   182103, 
   null, 
   "Easyrider", 
   "Hey, when you can prove that invisible flying space monkeys are sillier than an invisible man in the sky, talking animals and the living dead, I'll take you seriously. Until then, your obvious dismissal of one ridiculous book logically translates into dismissal of all ridiculous books. Unless you can come up with some good reasons for it's exemption, you should ridicule the bible as much as you would my book on space monkeys.\n\n \n Yeah, well, the Bible is the all time # 1 Bestseller in history, and its circulation increases each year. When your pathetic Space Monkeys start making that kind of a dent we'll start taking you seriously.", 
   {}, 
   181807, 
   null, 
   1133222280.0
  ], 
  [
   182105, 
   null, 
   "Truthsayer", 
   "Yeah, well, the Bible is the all time # 1 Bestseller in history, and its circulation increases each year. When your pathetic Space Monkeys start making that kind of a dent we'll start taking you seriously.\n\n \n I get it now. It's all about sales.:p \n \n I wonder how many people still own a pet rock?emoticon_rolleyes", 
   {}, 
   182103, 
   null, 
   1133222400.0
  ], 
  [
   182108, 
   null, 
   "trebor", 
   "Yeah, well, the Bible is the all time # 1 Bestseller in history, and its circulation increases each year. When your pathetic Space Monkeys start making that kind of a dent we'll start taking you seriously.\n\n \n \n And how does circulation make things any more true? It still doesn't mean the claims in it are true. It just means there are a lot of people who are superstitiious and stuck in ignorance.", 
   {}, 
   182103, 
   null, 
   1133222700.0
  ], 
  [
   182109, 
   null, 
   "Easyrider", 
   "I get it now. It's all about sales.:p \n\n \n Is that why you buy books, so you can increase the author's and retailer's sales?\n \n Duh.", 
   {}, 
   182105, 
   null, 
   1133222760.0
  ], 
  [
   182114, 
   null, 
   "Mucusaur", 
   "Are you honestly saying the bible is true, because it is well read? Arguement to popularity?", 
   {}, 
   182109, 
   null, 
   1133223480.0
  ], 
  [
   182131, 
   null, 
   "Easyrider", 
   "Are you honestly saying the bible is true, because it is well read? Arguement to popularity?\n\n \n It's true and popular. In contrast, Adept's nonsensical space monkeys are neither. \n \n Recommend you get Jesus for the remission of your sins before you die, so your eternity won't be a disaster.", 
   {}, 
   182114, 
   null, 
   1133229720.0
  ], 
  [
   182134, 
   null, 
   "Adept", 
   "Yeah, well, the Bible is the all time # 1 Bestseller in history, and its circulation increases each year. When your pathetic Space Monkeys start making that kind of a dent we'll start taking you seriously.\n\n \n Clutching at straws? It doesn't matter how many people buy or read the bible. It's claims are, on the face of it, completely ridiculous. As are the claims of my space monkey book. If you dismiss the one book as stupid, then logically you must dismiss both. Unless you have some good reasons for (the bibles) exemption.\n \n Do you?\n \n And no, sales figures don't count. I mean geez, how many people thought the world was flat? Or that the sun orbited the earth? I mean come on, if 90% of chiildren believe in Santa, does that make it true? Of course not.", 
   {}, 
   182103, 
   null, 
   1133230020.0
  ], 
  [
   182137, 
   null, 
   "Orion", 
   "Yeah, well, the Bible is the all time # 1 Bestseller in history, and its circulation increases each year.\n\n \n Ya know, EZ, somebody is buying those supermarket tabloids, too. Somebody is buying those astrology pocket guides.", 
   {}, 
   182103, 
   null, 
   1133230380.0
  ], 
  [
   182142, 
   null, 
   "joebrummer", 
   "It's true and popular. In contrast, Adept's nonsensical space monkeys are neither. \n \n Recommend you get Jesus for the remission of your sins before you die, so your eternity won't be a disaster.\n\n \n \n \n At one point in time, the idea that the Earth was flat was not only true to then at the time, but popular, what is your point?", 
   {}, 
   182131, 
   null, 
   1133231700.0
  ], 
  [
   182151, 
   null, 
   "Easyrider", 
   "Ya know, EZ, somebody is buying those supermarket tabloids, too. Somebody is buying those astrology pocket guides.\n\n \n The same people are sucking up the revisionist Bishop Spong's follies too.", 
   {}, 
   182137, 
   null, 
   1133235300.0
  ], 
  [
   182153, 
   null, 
   "Easyrider", 
   "At one point in time, the idea that the Earth was flat was not only true to then at the time, but popular, what is your point?\n\n \n Some people think gay sex is okay with God too. What's your point?", 
   {}, 
   182142, 
   null, 
   1133235360.0
  ], 
  [
   182154, 
   null, 
   "joebrummer", 
   "Some people think gay sex is okay with God too. What's your point?\n\n \n \n \n age and poplarity don't make a myth turn into a fact!", 
   {}, 
   182153, 
   null, 
   1133235480.0
  ], 
  [
   182155, 
   null, 
   "Easyrider", 
   " Clutching at straws? It doesn't matter how many people buy or read the bible. It's claims are, on the face of it, completely ridiculous. As are the claims of my space monkey book. If you dismiss the one book as stupid, then logically you must dismiss both. Unless you have some good reasons for (the bibles) exemption.\n\n \n Some 80% of Americans identify themselves as Christians. Maybe 3% more are Jews who believe in the Biblical God of Abraham, Isaac, and Jacob. So unfortunately, you're part of an unpopular and uninformed minority who have their collective heads in the sand.", 
   {}, 
   182134, 
   null, 
   1133235660.0
  ], 
  [
   182156, 
   null, 
   "Easyrider", 
   "age and poplarity don't make a myth turn into a fact!\n\n \n Leviticus 18:22 - \" 'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n Leviticus 20:13 - \" If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders 10nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n There's others as well.", 
   {
    "unicode_changes_made": true
   }, 
   182154, 
   null, 
   1133235720.0
  ], 
  [
   182157, 
   null, 
   "joebrummer", 
   "Leviticus 18:22 - \" 'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n Leviticus 20:13 - \" If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders 10nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n There's others as well.\n\n \n \n so what! You can quote the bible, is that what you do when you don't have a real reply? Nice cop out!", 
   {
    "unicode_changes_made": true
   }, 
   182156, 
   null, 
   1133235900.0
  ], 
  [
   182164, 
   null, 
   "trebor", 
   "Leviticus 18:22 - \" 'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n Leviticus 20:13 - \" If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders 10nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n There's others as well.\n\n \n \n Hey, why quote the \"old testament\" .. didn't you say you didn't have to follow it.?\n and why use mistranslations and out of context quotes??", 
   {
    "unicode_changes_made": true
   }, 
   182156, 
   null, 
   1133237700.0
  ], 
  [
   182177, 
   null, 
   "Easyrider", 
   "Hey, why quote the \"old testament\" .. didn't you say you didn't have to follow it.?\n and why use mistranslations and out of context quotes??\n\n \n I'm sure your Orthodox Jewish friends who quote the same scriptures are screwed in the head too. \n \n Have some more Kool Aid, Trebor.", 
   {}, 
   182164, 
   null, 
   1133242320.0
  ], 
  [
   182179, 
   null, 
   "Howard Beale", 
   "trebor:\n \n Are you hoarding all the Kool Aide? EZ makes it sound sooooo temptingly good.\n \n I think EZ has a secret stash in his cellar.", 
   {}, 
   182177, 
   null, 
   1133242740.0
  ], 
  [
   182180, 
   null, 
   "joebrummer", 
   "trebor:\n \n Are you hoarding all the Kool Aide? EZ makes it sound sooooo temptingly good.\n \n I think EZ has a secret stash in his cellar.\n\n \n \n \n Ez calls it Jesus Juice!", 
   {}, 
   182179, 
   null, 
   1133242800.0
  ], 
  [
   182188, 
   null, 
   "Adept", 
   "Some 80% of Americans identify themselves as Christians. Maybe 3% more are Jews who believe in the Biblical God of Abraham, Isaac, and Jacob. So unfortunately, you're part of an unpopular and uninformed minority who have their collective heads in the sand.\n\n \n I'm sorry Easyrider, could you please address the issue to hand?\n \n Your reply fails to illustrate how you can be logically consistent in regarding one book as completely false and ridiculous, while another book with the same level of supporting evidence and which contains claims that are just as ridiculous gains your full support and belief.\n \n In essence, we have two books which are functionally identical. One contains myths about an invisible all-powerful man who lives in the sky, talking animals, and the living dead. The other contains silly stories about flying monkeys who live in space. Without further evidence to support their outlandish claims, both books should be regarded as stupid. You are obviously smart enough to decide that the space monkey book is stupid. Now you just need to apply the same standard of proof, the same level of critical thought and unbiased questioning to the bible.\n \n Your argument seems to run 'a majority of people believe it to be true, therefore it must be true'. Surely you can see how inane this is.\n \n To destroy this position is simple. Only 33% of the worlds population is Christian. Therefore, Christianity is wrong because a majority of people think so.\n \n Unless of course, popularity has nothing to do with fact.", 
   {}, 
   182155, 
   null, 
   1133247540.0
  ], 
  [
   182262, 
   null, 
   "simone", 
   "Ez calls it Jesus Juice!\nThanks, Joe! My first giggle of the day.\n \n I frightened my neighbors with my screaming when I heard about the first decision of the John Roberts Supreme Court.\n \n No! No! No!", 
   {}, 
   182180, 
   null, 
   1133283240.0
  ], 
  [
   182385, 
   null, 
   "Easyrider", 
   "I'm sorry Easyrider, could you please address the issue to hand?\n \n Your reply fails to illustrate how you can be logically consistent in regarding one book as completely false and ridiculous, while another book with the same level of supporting evidence and which contains claims that are just as ridiculous gains your full support and belief.\n \n In essence, we have two books which are functionally identical. One contains myths about an invisible all-powerful man who lives in the sky, talking animals, and the living dead. The other contains silly stories about flying monkeys who live in space. Without further evidence to support their outlandish claims, both books should be regarded as stupid. You are obviously smart enough to decide that the space monkey book is stupid. Now you just need to apply the same standard of proof, the same level of critical thought and unbiased questioning to the bible.\n \n Your argument seems to run 'a majority of people believe it to be true, therefore it must be true'. Surely you can see how inane this is.\n \n To destroy this position is simple. Only 33% of the worlds population is Christian. Therefore, Christianity is wrong because a majority of people think so.\n \n Unless of course, popularity has nothing to do with fact.\n\n \n Like I told you, I didn't take you to raise. Do your own research, preppie.", 
   {}, 
   182188, 
   null, 
   1133309340.0
  ], 
  [
   182391, 
   null, 
   "Kronus", 
   "Like I told you, I didn't take you to raise. Do your own research, preppie.\n\n \n This is a \"debate\" forum. The \"spout off but don't defend your answers\" forum is down the hall to the left.", 
   {}, 
   182385, 
   null, 
   1133311140.0
  ], 
  [
   182393, 
   null, 
   "Easyrider", 
   "This is a \"debate\" forum. The \"spout off but don't defend your answers\" forum is down the hall to the left.\n\n \n Jesus said not to cast one's pearls before the swine, or they will turn and trample you. Which is what you Christ-bashers love to do.", 
   {}, 
   182391, 
   null, 
   1133311680.0
  ], 
  [
   182396, 
   null, 
   "trebor", 
   "Jesus said not to cast one's pearls before the swine, or they will turn and trample you. Which is what you Christ-bashers love to do.\n\n \n \n Then why the heck preach here and be such a swine yourself?", 
   {}, 
   182393, 
   null, 
   1133312100.0
  ], 
  [
   182401, 
   null, 
   "Adept", 
   "Like I told you, I didn't take you to raise. Do your own research, preppie.\n\n \n By your continued presence here, you indicate that you wish to debate the issues discussed in these, and other forums.\n \n I have done my own research. It indicates that the bible is false. The claims of the bible are wildly outlandish, most of the worlds population believes it is untrue, you yourself believe ridiculous books without supporting evidence should be dismissed outof hand...\n \n I've said it before, and I'll say it again. If you want to use the bible as a basis for argument (like you did several posts ago) then you first need to prove the bible is wholly true and accurate. With reference to your anti-homosexual quotes before, I ask \"Now prove the bible is true\". Failure to do so renders these quotes completely irrelevant, thus destroying your argument. If you believe you are right, and wish to debate the subject, you must attempt to prove the bible is wholly true and accurate.", 
   {}, 
   182385, 
   null, 
   1133315820.0
  ], 
  [
   182402, 
   null, 
   "Easyrider", 
   "Then why the heck preach here and be such a swine yourself?\n\n \n I think the mentality faced here is the same one Stephen faced in Acts chapter 7:\n \n 51 \"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! 52 Was there ever a prophet your fathers did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him- 53 you who have received the law that was put into effect through angels but have not obeyed it.\"\n \n 54 When they heard this, they were furious and gnashed their teeth at him. 55 But Stephen, full of the Holy Spirit, looked up to heaven and saw the glory of God, and Jesus standing at the right hand of God. 56 \"Look,\" he said, \"I see heaven open and the Son of Man standing at the right hand of God.\" \n 57 At this they covered their ears and, yelling at the top of their voices, they all rushed at him, 58dragged him out of the city and began to stone him.", 
   {
    "unicode_changes_made": true
   }, 
   182396, 
   null, 
   1133316000.0
  ], 
  [
   182404, 
   null, 
   "Adept", 
   "51 \"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! 52 Was there ever a prophet your fathers did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him- 53 you who have received the law that was put into effect through angels but have not obeyed it.\"\n \n 54 When they heard this, they were furious and gnashed their teeth at him. 55 But Stephen, full of the Holy Spirit, looked up to heaven and saw the glory of God, and Jesus standing at the right hand of God. 56 \"Look,\" he said, \"I see heaven open and the Son of Man standing at the right hand of God.\" \n 57 At this they covered their ears and, yelling at the top of their voices, they all rushed at him, 58dragged him out of the city and began to stone him.\n\n \n To which I respond: Now prove that the book those quotes were taken from is true.", 
   {
    "unicode_changes_made": true
   }, 
   182402, 
   null, 
   1133316540.0
  ], 
  [
   182407, 
   null, 
   "Easyrider", 
   "To which I respond: Now prove that the book those quotes were taken from is true.\n\n \n Go do your own research. The Christian bookstores have tons of scholarly works you can turn your blind eye towards.", 
   {}, 
   182404, 
   null, 
   1133316720.0
  ], 
  [
   182413, 
   null, 
   "joebrummer", 
   "Go do your own research. The Christian bookstores have tons of scholarly works you can turn your blind eye towards.\n\n \n \n How about you do your reseach ....\n \n \n for as many book sin the stor in favor of your side of the story there are just as mnay in opposition to your side of tyhe story.........maybe you should read up too!", 
   {}, 
   182407, 
   null, 
   1133318880.0
  ], 
  [
   182414, 
   null, 
   "Easyrider", 
   "How about you do your reseach ....\n \n \n for as many book sin the stor in favor of your side of the story there are just as mnay in opposition to your side of tyhe story.........maybe you should read up too!\n\n \n Like Donnie does Dallas or one of those? LOL!!", 
   {}, 
   182413, 
   null, 
   1133320380.0
  ], 
  [
   182415, 
   null, 
   "joebrummer", 
   "Like Donnie does Dallas or one of those? LOL!!\n\n \n \n nice joke that nobody got....shows how uneducated you are....\n \n \n Anyway I stand by my post! You do your research, prove your god is real!", 
   {}, 
   182414, 
   null, 
   1133320800.0
  ], 
  [
   182417, 
   null, 
   "Easyrider", 
   "nice joke that nobody got....shows how uneducated you are....\n \n \n Anyway I stand by my post! You do your research, prove your god is real!\n\n \n Prove you're not an alien space monkey first.", 
   {}, 
   182415, 
   null, 
   1133320980.0
  ], 
  [
   182418, 
   null, 
   "Orion", 
   "Go do your own research.\n\n \n EZ, the not-so-subtle point which people have been trying to get across to you is as follows: if you come to a forum such as this and make repeated assertions, you are expected to defend and substantiate those assertions. If you are unwilling/unable to do so, your (repeated) assertions are seen as worthless and your credibility is diminished considerably. Cutting & pasting tracts from evangelical Christian websites is, IMO, a cheap and lazy substitute for discussion, as is your frequent rejoinder...\"see my previous posts on the subject\", or \"casting pearls before swine\".", 
   {}, 
   182407, 
   null, 
   1133321220.0
  ], 
  [
   182419, 
   null, 
   "Easyrider", 
   "EZ, the not-so-subtle point which people have been trying to get across to you is as follows: if you come to a forum such as this and make repeated assertions, you are expected to defend and substantiate those assertions. If you are unwilling/unable to do so, your (repeated) assertions are seen as worthless and your credibility is diminished considerably. Cutting & pasting tracts from evangelical Christian websites is, IMO, a cheap and lazy substitute for discussion, as is your frequent rejoinder...\"see my previous posts on the subject\", or \"casting pearls before swine\".\n\n \n \n Orion, I've busted your chops and your failed, anti-Biblical arguments for some 6 years now. You would think you'd take a breather and go lick your self-inflicted wounds for awhile. But you persist in bashing Christ (r.e. your previous \"gay Jesus\" chants), you warm up to other posters like NYGLad who called Christian women \"trailer trash,\" you've professed a wild \"all paths to God\" theory that you never could back up, and you generally engage in a wide assortment of anti-Christian rhetoric and politically-correct nonsense that has made you an enemy of Jesus Christ (though you can repent and he'll save you).\n \n So go on with your rhetoric and see where it gets you in the end.", 
   {}, 
   182418, 
   null, 
   1133321640.0
  ], 
  [
   182428, 
   null, 
   "trebor", 
   "I think the mentality faced here is the same one Stephen faced in Acts chapter 7:\n \n 51 \"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! 52 Was there ever a prophet your fathers did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him- 53 you who have received the law that was put into effect through angels but have not obeyed it.\"\n \n 54 When they heard this, they were furious and gnashed their teeth at him. 55 But Stephen, full of the Holy Spirit, looked up to heaven and saw the glory of God, and Jesus standing at the right hand of God. 56 \"Look,\" he said, \"I see heaven open and the Son of Man standing at the right hand of God.\" \n 57 At this they covered their ears and, yelling at the top of their voices, they all rushed at him, 58dragged him out of the city and began to stone him.\n\n \n You should hold up a mirror to yoruself. Those describe you perfectly.", 
   {
    "unicode_changes_made": true
   }, 
   182402, 
   null, 
   1133324280.0
  ], 
  [
   182429, 
   null, 
   "trebor", 
   "Orion, I've busted your chops and your failed, anti-Biblical arguments for some 6 years now. You would think you'd take a breather and go lick your self-inflicted wounds for awhile. But you persist in bashing Christ (r.e. your previous \"gay Jesus\" chants), you warm up to other posters like NYGLad who called Christian women \"trailer trash,\" you've professed a wild \"all paths to God\" theory that you never could back up, and you generally engage in a wide assortment of anti-Christian rhetoric and politically-correct nonsense that has made you an enemy of Jesus Christ (though you can repent and he'll save you).\n \n So go on with your rhetoric and see where it gets you in the end.\n\n \n \n Really?? It seems the only person who thinks you \"\"busted' orions chops is you.", 
   {}, 
   182419, 
   null, 
   1133324460.0
  ], 
  [
   182438, 
   null, 
   "Easyrider", 
   "Really?? It seems the only person who thinks you \"\"busted' orions chops is you.\n\n \n Of course you missed the first 5 years of countless Christians refuting his anti-Biblical nonsense, so what would you know?\n \n IMO your \"Reform Theology\" (politically-correct revisionism) is an embarrassment to the OT (and current Orthodox) Jewish faith.", 
   {}, 
   182429, 
   null, 
   1133326740.0
  ], 
  [
   182445, 
   null, 
   "Orion", 
   "Orion, I've busted your chops and your failed, anti-Biblical arguments for some 6 years now.\n\n \n Really? I don't think so, EZ. The reception you've gotten at this forum is identical to that which you received at the Atlantic Monthly Religion Forum, the New York Times Religion Forum, and the USAT Religion Forum. I'll let folks here judge the credibility of my positions. Unlike you, I pick and choose my battles. \n \n \"Anti-biblical\" arguments? Nonsense. As I've previously explained to you, I approach a study of the Judeo/Christian Bible as I do any other ancient religious text. \n \n \nYou would think you'd take a breather and go lick your self-inflicted wounds for awhile.\n\n \n \"Self-inflicted wounds\"? You've borrowed another of the aphorisms which I've previously applied to you, EZ. Imitation is a sincere form of flattery. \n \n \nBut you persist in bashing Christ (r.e. your previous \"gay Jesus\" chants)\n\n \n You have a problem with a gay Jesus? If, in fact Jesus were gay, would it discount his teachings? Would it shatter your theological world? Likewise, if Jesus had been of illegitimate birth, as suggested by at least two NT verses, would that change your opinion of Jesus' message?\n \n \nyou warm up to other posters like NYGLad who called Christian women \"trailer trash,\" you've professed a wild \"all paths to God\" theory that you never could back up, and you generally engage in a wide assortment of anti-Christian rhetoric and politically-correct nonsense that has made you an enemy of Jesus Christ (though you can repent and he'll save you).\n\n \n I am a student of comparative religion. Unlike you, I'm not an evangelist.\n \n \nOf course you missed the first 5 years of countless Christians refuting his anti-Biblical nonsense, so what would you know?\n\n \n Are you certain of that EZ? Do you know where Trebor's been? I do, and you obviously don't. But, before you demand of Trebor that he establish his credentials, please substantiate your claim.", 
   {}, 
   182438, 
   null, 
   1133330220.0
  ], 
  [
   182466, 
   null, 
   "Phunting", 
   "Easy,\n \n As much as I have sympathy for you here, you must surely see that your position here is unjustifiable.\n \n I am more than happy to give reasoning behind any view I hold. It may not always be logical, it may not always be provable. But there is a reason behind all, and I will happily give it. 'Do your own research' is not an answer, but a cop-out.\n \n All I, and countless others, are asking for is a reason you believe what you do. I don't even want you to prove the Bible to be totally true, as others have. I respect that there is an element of faith in most things. What I can't respect is your total unwillingness to say why you have that faith, why you hold one book in such esteem where you would dismiss another out of hand. There must be a reason behind it, why do you have to hide it?\n \n You say that you have explained your views before, and that the others all know them. Well I, as one of the more infrequent members, haven't seen them and wouldn't know which threads to look on to find them. So even if you believe the others all know the truth, for my sake tell me. And please don't just tell me to do my own research, that is hardly Christian. Did not Jesus himself come to teach the truth to unbelievers, why do you constantly refuse to follow his example?", 
   {}, 
   182445, 
   null, 
   1133355840.0
  ], 
  [
   183265, 
   null, 
   "johnhanks", 
   "Of course you missed the first 5 years of countless Christians refuting his anti-Biblical nonsense, so what would you know?\n\n \n Can you be sure trebor missed those five years? How do you know he isn't Nygladstoned, returned to haunt you?\n \n EZ, I didn't miss those years, and recall neither reading 'anti-Biblical nonsense' from orion, nor his reasoning being refuted by any christians, let alone 'countless' ones. (You'll be aware, of course, that 'denied' does not mean the same as 'refuted').", 
   {}, 
   182438, 
   null, 
   1133715600.0
  ], 
  [
   185101, 
   null, 
   "Easyrider", 
   "Can you be sure trebor missed those five years? How do you know he isn't Nygladstoned, returned to haunt you? EZ, I didn't miss those years, and recall neither reading 'anti-Biblical nonsense' from orion, nor his reasoning being refuted by any christians, let alone 'countless' ones. (You'll be aware, of course, that 'denied' does not mean the same as 'refuted').\n\n \n Then you've been blinded by the same kind of mentality that's evident with Orion and Trebor. I remember it all quite well. And I was debating Orion long before we ever crossed paths. I believe the late summer of 1999 was when Orion and I crossed paths the first time.", 
   {}, 
   183265, 
   null, 
   1134535560.0
  ], 
  [
   185145, 
   null, 
   "trebor", 
   "Then you've been blinded by the same kind of mentality that's evident with Orion and Trebor. I remember it all quite well. And I was debating Orion long before we ever crossed paths. I believe the late summer of 1999 was when Orion and I crossed paths the first time.\n\n \n \n I will note that you have 'always beat' Oriion in the past. You 'always have discussed' the issues elsewhere. You never can discuss them NOW, in CONTEXT, with your own words.. but rather out of context cut/pastes of evangalistic web sites that do not respond to the points made.", 
   {}, 
   185101, 
   null, 
   1134570060.0
  ], 
  [
   185166, 
   null, 
   "simone", 
   "Orion, I've busted your chops and your failed, anti-Biblical arguments for some 6 years now. You would think you'd take a breather and go lick your self-inflicted wounds for awhile. But you persist in bashing Christ (r.e. your previous \"gay Jesus\" chants), you warm up to other posters like NYGLad who called Christian women \"trailer trash,\" you've professed a wild \"all paths to God\" theory that you never could back up, and you generally engage in a wide assortment of anti-Christian rhetoric and politically-correct nonsense that has made you an enemy of Jesus Christ (though you can repent and he'll save you).\n \n So go on with your rhetoric and see where it gets you in the end.\nOooh! I am so thrilled! EZ is having a macho moment!!", 
   {}, 
   182419, 
   null, 
   1134578580.0
  ], 
  [
   185265, 
   null, 
   "Easyrider", 
   "Oooh! I am so thrilled! EZ is having a macho moment!!\n\n \n Which is something the French have serious trouble experiencing.", 
   {}, 
   185166, 
   null, 
   1134606720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Jesusland", 
  "url": "http://www.4forums.com/political/religion-debates/6835-jesusland.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 6835, 
  "discussion_files": [
   [
    "14613.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-print.html"
   ], 
   [
    "14614.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-9-print.html"
   ], 
   [
    "14615.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-7-print.html"
   ], 
   [
    "14616.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-5-print.html"
   ], 
   [
    "14617.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-4-print.html"
   ], 
   [
    "14618.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-6-print.html"
   ], 
   [
    "14619.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-8-print.html"
   ], 
   [
    "14620.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-3-print.html"
   ], 
   [
    "14621.html", 
    "http://www.4forums.com/political/religion-debates/6835-jesusland-2-print.html"
   ]
  ], 
  "identifier": 6835
 }
]