[
 [
  [
   179200, 
   null, 
   "simone", 
   "Ambiguous, quite ambiguous.\n \n http://www.nytimes.com/2005/11/13/weekinreview/13luo.html\n \n November 13, 2005\n Ideas & Trends\n On Abortion, It's the Bible of Ambiguity \n By MICHAEL LUO\n FLIP to the back of any of the fancy, leather-bound Bibles that are so common in evangelical churches these days, and chances are there is an index. Called a concordance, it offers a list of specific words mentioned in the Bible and where they are referenced in the text. \n \n There a reader can find, for example, how many times Jesus talked about the poor (at least a dozen), or what the Apostle Paul wrote about grace (a lot). But those who turn to their concordance for guidance about abortion will not find the word at all.\n \n \"I can't take you to text that says, 'Don't commit abortion,' \" said Michael J. Gorman, a professor of New Testament and early church history and dean of the Ecumenical Institute of Theology at St. Mary's Seminary and University, located in Baltimore. \"It just doesn't exist.\"\n \n Does that mean the Bible has nothing to offer on the issue? Mr. Gorman, who calls himself an evangelical, cites the early church's opposition to abortion and broader themes that suffuse the Scriptures, rather than specific verses: \"There's an impetus in the Bible toward the protection of the innocent, protection for the weak, respect for life, respect for God's creation.\"\n \n For evangelicals, who are defined in large part by their reliance on the Bible, the question of how the Scriptures should be interpreted is crucial. Catholics depend more heavily on the church's moral teachings, which are often drawn not from the Bible but what they call, \"natural law,\" the innate sense of morality that they believe is written on people's hearts and can be divined by human reason. \n \n But evangelicals - or at least the members of the vocal religious right who have dominated the issue over the last two decades or so - use the words of the Bible to make their case. And in many ways, what the Bible actually says, and according to whom, is where the battle over abortion begins.\n \n One anti-abortion group, Michigan Christians for Life, for instance, sells bumper stickers emblazoned with \"Deuteronomy 30:19.\" \n \n The verse reads: \"This day I call heaven and earth as witnesses against you that I have set before you life and death, blessings and curses. Now choose life, so that you and your children may live and that you may love the Lord your God, listen to His voice, and hold fast to Him.\"\n \n But some evangelical scholars say the passage has nothing to do with abortion. Instead, it is an exhortation to Israelites, who fled Egypt and are wandering in the desert, to obey God's word, the way to true life, said John Goldingay, a professor of Old Testament at Fuller Theological Seminary, outside of Los Angeles.\n \n \"It's saying to Israel, choosing life means choosing the way of life, choosing to obey God's word, which has been revealed over the last 30 chapters,\" Mr. Goldingay said.\n \n Like many professors at evangelical seminaries today, Mr. Goldingay teaches his students to pay attention to the genre of the biblical passage they are studying before interpreting specific verses. Some passages in the Bible are written as poetry, full of metaphoric language and imagery, and were never meant to be taken literally, he said. Others, especially in the Old Testament, are written as history and detail God's relationship with his chosen people, the Israelites, and need to be read as such. \n \n \"We're always trying to work out legal implications from them, as if they were a legal kind of text, like interpreting a constitutional document,\" Mr. Goldingay said. \"The problem is that wasn't what they were designed to do.\"\n \n But other evangelical scholars, at seminaries that read the Bible more literally, disagree. \"Just because it's not primarily about abortion doesn't mean we shouldn't draw anything from it,\" said Craig V. Mitchell, assistant professor of Christian ethics at Southwestern Baptist Theological Seminary in Forth Worth, Tex.\n \n He pointed to a passage in the Book of Psalms, often cited by anti-abortion groups. The verses, from Psalm 139, read: \"For you created my inmost being; you knit me together in my mother's womb. I praise you because I am fearfully and wonderfully made; your works are wonderful, I know that full well.\" \n \n To many evangelicals who oppose abortion, the verses speak directly to when life begins - at the moment of conception. \n \n (More)", 
   {
    "post_info": {
     "post_title": "The Bible and Abortion"
    }
   }, 
   null, 
   null, 
   1131980100.0
  ], 
  [
   179201, 
   null, 
   "simone", 
   "\"I'd summarize Psalm 139 as suggesting that in the womb, from the very first point of conception, it's God at work,\" said Scott B. Rae, a professor of Christian ethics at Talbot School of Theology and Biola University, an evangelical school outside of Los Angeles.\n \n But, again, other evangelical Bible scholars differ. In this case, the writer of Psalms, which is essentially a collection of songs, is using poetic imagery to celebrate God's special relationship with his chosen people, the Israelites, and his promise to be with them for a thousand generations, said Willem A. VanGemeren, a professor of Old Testament at Trinity Evangelical Divinity School, an evangelical seminary outside of Chicago. \n \n \"The issue is not so much of when the moment of conception is, or the beginning of life, but rather they cannot see life apart from their relationship with the Lord,\" Mr. VanGemeren said. \n \n For their part, some abortion rights supporters frequently turn to a passage in Exodus 21 that sets out guidelines for the Israelites on how to resolve a dispute in which a pregnant woman intervenes between two men fighting and is struck: \"If men who are fighting hit a pregnant woman and she gives birth prematurely but there is no serious injury, the offender must be fined whatever the woman's husband demands and the court allows. But if there is serious injury, you are to take life for life, eye for eye, tooth for tooth, hand for hand, foot for foot, burn for burn, wound for wound, bruise for bruise.\"\n \n Abortion rights activists argue that the passage shows the fetus is assigned a lower value than the woman, because if a premature birth occurs, they say, the baby dies. Then, the punishment is only a fine, compared to \"life for life, eye for eye\" if the woman is killed.\n \n \"You can't make everything of that passage,\" said Paul D. Simmons, an ethics professor at University of Louisville, who once taught at Southern Baptist Theological Seminary. \"What you can establish is there's a clear distinction between a fetus and a woman.\"\n \n But Mr. VanGemeren, of Trinity, said that conclusion is shaky, arguing the passage remains shrouded in ambiguity.\n \n \"We don't quite understand what exactly happens to that child,\" he said.\n \n According to Mr. VanGemeren and many other evangelical Bible scholars, no single passage in the Bible clearly supports the anti-abortion stance, but they argue that the broad narrative of the Bible, with its themes of creation, God's blessing on life and humanity bearing the image of God, speak against abortion.\n \n \"Of course, nothing addresses abortion directly,\" Mr. VanGemeren said, \"but the biblical inference as accepted over the centuries is a witness that cannot be ignored.\"\n \n Interpreting the Bible, as difficult as it is, becomes only more so, when theologians are asked how abortion should be legislated, if it should be legislated at all. \n \n Some scholars spoke in absolutes, others cited exceptions. Still others waxed eloquent about the need to turn society away from its individualistic ethos and the need to pay equal attention to other biblical priorities. \n \n In the end, as it turns out, it is a complicated business, bringing a complicated Bible into a complicated world.", 
   {
    "post_info": {
     "post_title": "It Depends Upon Your Interpretation"
    }
   }, 
   179200, 
   null, 
   1131980220.0
  ], 
  [
   179214, 
   null, 
   "Obvious Child", 
   "For their part, some abortion rights supporters frequently turn to a passage in Exodus 21 that sets out guidelines for the Israelites on how to resolve a dispute in which a pregnant woman intervenes between two men fighting and is struck: \"If men who are fighting hit a pregnant woman and she gives birth prematurely but there is no serious injury, the offender must be fined whatever the woman's husband demands and the court allows. But if there is serious injury, you are to take life for life, eye for eye, tooth for tooth, hand for hand, foot for foot, burn for burn, wound for wound, bruise for bruise.\"\nThe main problem with this passage is that 'gives birth prematurely' could also be translated 'miscarries'. It's unclear that violently caused 'falling' of the child (which is the verb in question), could really refer to live birth in the conditions of the early Israelites.", 
   {}, 
   179201, 
   null, 
   1131985140.0
  ], 
  [
   179541, 
   null, 
   "Steeeeve", 
   "http://4forums.com/political/showpost.php?p=158803&postcount=7\n \n I can't believe you guys still talk about Exodus 21...which backs up the anti-abortion folks, not the pro-choice folks.", 
   {}, 
   179214, 
   null, 
   1132089960.0
  ], 
  [
   179550, 
   null, 
   "Howard Beale", 
   "http://4forums.com/political/showpost.php?p=158803&postcount=7\n \n I can't believe you guys still talk about Exodus 21...which backs up the anti-abortion folks, not the pro-choice folks.\nIt truly backs up no one because the exact meaning is too obscure - especially the Hebrew word translated as \"miscarriage\". I went through this on another thread - I have forgotten which one. As far as the \"any further damage\" reference, there is a strong case to be made that the words refer to the woman -- but that case is by no means conclusive. Each side tries to twist this passage from Exodus to support their point of view. It is more a talking point for each than anything else.", 
   {
    "unicode_changes_made": true
   }, 
   179541, 
   null, 
   1132095900.0
  ], 
  [
   179708, 
   null, 
   "Tastyfish", 
   "How does...\n \n\n @The pro-choice rendering of these verses is not in harmony with the rest of Scripture or the teaching of the Early Church Fathers. Twice in the Didache, \"The Teaching of the Twelve Apostles,\" the Exodus 21:22-25 passage is referenced, \"Thou shalt not commit murder, thou shalt not commit adultery, thou shalt not commit pederasty, thou shalt not commit fornication, thou shalt not steal, thou shalt not practice witchcraft, thou shalt not murder a child by abortion nor kill that which is begotten.\" ABORTION IS CLEARLY LABELED MURDER IN BOTH SECTIONS\n\n ...make sense alongside the earlier part that says that abortion is a relatively recent thing and not mentioned in scriptures. Surely he is reading just as much as the people he accuses?", 
   {}, 
   179550, 
   null, 
   1132173540.0
  ], 
  [
   179712, 
   null, 
   "Steeeeve", 
   "It truly backs up no one because the exact meaning is too obscure &#8211; especially the Hebrew word translated as &#8220;miscarriage&#8221;. I went through this on another thread &#8211; I have forgotten which one. As far as the &#8220;any further damage&#8221; reference, there is a strong case to be made that the words refer to the woman -- but that case is by no means conclusive. Each side tries to twist this passage from Exodus to support their point of view. It is more a talking point for each than anything else.\n\n I recall you completely ignoring the website I posted in the thread you refer to.\n \n You can get over this:\n It is very important to note the same writer used the normal word Hebrew word for miscarriage \"shakal\" just two chapters later in Exodus 23:26. This clearly indicates the writer had something besides miscarriage in mind for the Exodus 21:22-25 passage\n \n It is clear that it doesn't mean miscarriage which then invalidates the whole pro-choice arguement. At the very best all you can say is that this doesn't support abortion either way....but you can't rule out that it doesn't help the pro-life side.\n \n \n If we assume for a second that everything one might question is in the Bible (in the moral sense) then one could really only conclude that abortion is against the teachings of the Bible.", 
   {}, 
   179550, 
   null, 
   1132174260.0
  ], 
  [
   179714, 
   null, 
   "Obvious Child", 
   "You can get over this:\n It is very important to note the same writer used the normal word Hebrew word for miscarriage \"shakal\" just two chapters later in Exodus 23:26. This clearly indicates the writer had something besides miscarriage in mind for the Exodus 21:22-25 passage\nOnly if this miscarriage is of the same type. A violent premature birth may have essentially meant a miscarriage in Israel at the time of Exodus.", 
   {}, 
   179712, 
   null, 
   1132175220.0
  ], 
  [
   179723, 
   null, 
   "Steeeeve", 
   "Only if this miscarriage is of the same type. A violent premature birth may have essentially meant a miscarriage in Israel at the time of Exodus.\n\n \n What? The point is...it doesn't mean miscarriage because miscarriage was used later on. If it means \"violent premature birth\"(which it doesn't) then so be it. This doesn't change anything.", 
   {}, 
   179714, 
   null, 
   1132176240.0
  ], 
  [
   179751, 
   null, 
   "Howard Beale", 
   "I recall you completely ignoring the website I posted in the thread you refer to.\nThat is because the website is not the final word on the subject. I did not criticize the website for what it says because it is a possible meaning. The problem is that there are other possible meanings and they are all equally supportable. \n \n I'm sorry if that neutral position does not satisfy you.\n \n \nYou can get over this:\n It is very important to note the same writer used the normal word Hebrew word for miscarriage \"shakal\" just two chapters later in Exodus 23:26. This clearly indicates the writer had something besides miscarriage in mind for the Exodus 21:22-25 passage.\n \n It is clear that it doesn't mean miscarriage which then invalidates the whole pro-choice arguement. At the very best all you can say is that this doesn't support abortion either way....but you can't rule out that it doesn't help the pro-life side.\n \nThat is one of the problems with the website that you posted. The Hebrew word \"shakal\" is primarily used to indicate \"without children\". In fact, in the King James Version it is translated most often as \"be bereaved\" meaning childless, often referring to grown children being taken away as in Gen 27:45 when Rebekah says to her son Esau, \"Until thy brother's anger turn away from thee, and he forget that which thou hast done to him: then I will send, and fetch thee from thence: why should I be deprived also of you both in one day?\"\n \n \"shakal\" here is translated as \"be deprived\" and refers to grown children.\n \n So, what you claim the website \"clearly indicates\", it does not. It takes a position that is as supportable as any of the others, not more so or less so, and certainly not definitive.\n \n \nIf we assume for a second that everything one might question is in the Bible (in the moral sense) then one could really only conclude that abortion is against the teachings of the Bible.\nThat is not a supportable position. You can believe it, which is fine, but you cannot claim it a definitive Christian position because Jesus never said anything like it and it is unclear what the Exodus verses mean. It is interesting that nothing is mentioned in Leviticus about it because Leviticus delineates a great number of laws and their exact punishments, but does not mention abortion. It mentions menstruation and other reproductive issues, but not abortion.", 
   {
    "unicode_changes_made": true
   }, 
   179712, 
   null, 
   1132181280.0
  ], 
  [
   179756, 
   null, 
   "Sigma", 
   "What? The point is...it doesn't mean miscarriage because miscarriage was used later on. If it means \"violent premature birth\"(which it doesn't) then so be it. This doesn't change anything.\n\n \n Whichever it meant, the fate of the child doesn't really seem to be an issue with the passage (despite what Howard says, the context seems much more likely to be in reference to the woman though it cannot be definitive). Whether the child dies or not is irrelevant, the punishment is for the harm done to the woman.\n \n This does not support the pro-life position.", 
   {}, 
   179723, 
   null, 
   1132181940.0
  ], 
  [
   179880, 
   null, 
   "Obvious Child", 
   "What? The point is...it doesn't mean miscarriage because miscarriage was used later on. If it means \"violent premature birth\"(which it doesn't) then so be it. This doesn't change anything.\nThe point is that a violent premature birth might necessarily involve the death of the child at such a time. We might say 'causing the heart to stop' or 'decapitating' assuming that this means death, even if modern medicine allows us to kick-start the heart or quickly sew the head back on (OK, the latter's unlikely).", 
   {}, 
   179723, 
   null, 
   1132242900.0
  ], 
  [
   180147, 
   null, 
   "Steeeeve", 
   "That is because the website is not the final word on the subject. I did not criticize the website for what it says because it is a possible meaning. The problem is that there are other possible meanings and they are all equally supportable. \n \n I'm sorry if that neutral position does not satisfy you.\n \n\n it isn't neutral...just wrong\n \n \n \n\n That is one of the problems with the website that you posted. The Hebrew word \"shakal\" is primarily used to indicate \"without children\". In fact, in the King James Version it is translated most often as \"be bereaved\" meaning childless, often referring to grown children being taken away as in Gen 27:45 when Rebekah says to her son Esau, \"Until thy brother's anger turn away from thee, and he forget that which thou hast done to him: then I will send, and fetch thee from thence: why should I be deprived also of you both in one day?\"\n \n \"shakal\" here is translated as \"be deprived\" and refers to grown children.\n \n So, what you claim the website \"clearly indicates\", it does not. It takes a position that is as supportable as any of the others, not more so or less so, and certainly not definitive.\n \n\n Shakal means this: \"to be bereaved at the loss of a child\" and if you learn any hebrew then you would know this.\n It shows (like the website suggests) two things. One, that this word means miscarriage and two, that miscarriage must not be what is in mind in Exodus 21. Yatsa (the word used in Exodus 21) means \"has brought you out\" or premature birth as we know it here. Once again, some simple research while avoiding religioustolerance.org will show this. \n \n \n\n That is not a supportable position. You can believe it, which is fine, but you cannot claim it a definitive Christian position because Jesus never said anything like it and it is unclear what the Exodus verses mean. It is interesting that nothing is mentioned in Leviticus about it because Leviticus delineates a great number of laws and their exact punishments, but does not mention abortion. It mentions menstruation and other reproductive issues, but not abortion.\n Perhaps you should reread what I posted. I said assuming everything we need to know was in the Bible...\n If you take the idea that fetus and child are used interchangably, the fact that God says he knew you before you were born and that he makes you in the womb etc. you can only come to one conclusion and to come up with another would not be a \"supportable position\".", 
   {
    "unicode_changes_made": true
   }, 
   179751, 
   null, 
   1132350660.0
  ], 
  [
   180368, 
   null, 
   "simone", 
   "@The pro-choice rendering of these verses is not in harmony with the rest of Scripture or the teaching of the Early Church Fathers. Twice in the Didache, \"The Teaching of the Twelve Apostles,\" the Exodus 21:22-25 passage is referenced, \"Thou shalt not commit murder, thou shalt not commit adultery, thou shalt not commit pederasty, thou shalt not commit fornication, thou shalt not steal, thou shalt not practice witchcraft, thou shalt not murder a child by abortion nor kill that which is begotten.\" ABORTION IS CLEARLY LABELED MURDER IN BOTH SECTIONS \n\n \n \nHow does...\n \n ...make sense alongside the earlier part that says that abortion is a relatively recent thing and not mentioned in scriptures. Surely he is reading just as much as the people he accuses?\n\n Tastyfish, I'm trying to see where Luo cites the Didache. I've just had a look at several translations of the didache and I did not find the specific translation that mentions abortion.\n \n Would you be so kind as to cite your source for your quote in your comment and source the translation and author of the translation that states that the fifth commandment refers specifically to abortion?", 
   {}, 
   179708, 
   null, 
   1132431420.0
  ], 
  [
   180386, 
   null, 
   "Howard Beale", 
   "Yatsa (the word used in Exodus 21) means \"has brought you out\" or premature birth as we know it here. Once again, some simple research while avoiding religioustolerance.org will show this.\nReally? \n Gen 1:12 \"And the earth brought forth grass...\"\n Gen 1:24 \"And God said, Let the earth bring forth the living creature...\" \n And on and on Gen 2:10; 4:16; 8:7; and \n Exodus 1:5 \"And all the souls that came out of the loins of Jacob were seventy souls:\" and on and on Exodus 8:20, 8:29; 8;30.\n \n The souls refered to in Ex 1:5, did they live, or were they the production of abortion?\n \n Get the picture? Read the verses, the word \"yatsa\" does not have the limited intrinsic value that you insist on. It can mean what you say, but it also may not. The verse on Exodus 21 is too vague to determine exactly. I suggest to you that if you read all the verses in Genesis and Exodus alone and you would realize that it is not a cut and dry as you would like it.\n \n \nPerhaps you should reread what I posted. I said assuming everything we need to know was in the Bible...\n If you take the idea that fetus and child are used interchangably, the fact that God says he knew you before you were born and that he makes you in the womb etc. you can only come to one conclusion and to come up with another would not be a \"supportable position\".\nIf you take the idea that what God knew your \"soul\" and not the body \"formed from dust\" and that in Genesis God \"formed man form the dust\", then breathed into his nostrils, and only after that did man become a \"living soul.\n \n Gen 2:7: And the LORD God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul.\n \n You may believe I am wrong, but you belief is not supported by the facts. It is only your opinion - to which you are entitled.", 
   {
    "unicode_changes_made": true
   }, 
   180147, 
   null, 
   1132434180.0
  ], 
  [
   180440, 
   null, 
   "Steeeeve", 
   "Really?\n Gen 1:12 \"And the earth brought forth grass...\"\n Gen 1:24 \"And God said, Let the earth bring forth the living creature...\"\n And on and on Gen 2:10; 4:16; 8:7; and\n Exodus 1:5 \"And all the souls that came out of the loins of Jacob were seventy souls:\" and on and on Exodus 8:20, 8:29; 8;30.\n \n The souls refered to in Ex 1:5, did they live, or were they the production of abortion?\n \n Get the picture? Read the verses, the word \"yatsa\" does not have the limited intrinsic value that you insist on. It can mean what you say, but it also may not. The verse on Exodus 21 is too vague to determine exactly. I suggest to you that if you read all the verses in Genesis and Exodus alone and you would realize that it is not a cut and dry as you would like it.\n \n Yeah, what are you talking about? You can't quote a view things from the Bible and claim you are right. So no I don't \"get your picture\". Yatsa was used as the word for premature birth...there is no reason to believe otherwise as a pattern is shown in the OT of \"yatsa\" being used for premature birth. Cut and dry.\n \n \nIf you take the idea that what God knew your \"soul\" and not the body \"formed from dust\" and that in Genesis God \"formed man form the dust\", then breathed into his nostrils, and only after that did man become a \"living soul.\n \n Gen 2:7: And the LORD God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul.\n \n You may believe I am wrong, but you belief is not supported by the facts. It is only your opinion - to which you are entitled.\n It is supported by what the Bible says. You have yet to show me that (assuming the Bible has everything in it) abortion is supported by the Bible.", 
   {
    "unicode_changes_made": true
   }, 
   180386, 
   null, 
   1132446960.0
  ], 
  [
   180446, 
   null, 
   "Howard Beale", 
   "Yeah, what are you talking about? You can't quote a view things from the Bible and claim you are right. \nI get it, don&#8217;t quote the Bible to you, just take you word on what the Bible says! I love it. \n \n \nSo no I don't \"get your picture\". Yatsa was used as the word for premature birth...there is no reason to believe otherwise as a pattern is shown in the OT of \"yatsa\" being used for premature birth. Cut and dry.\nIt is not cut and dry. I am willing to go through verse by verse, one at a time, the 20-30 or so verses where the word &#8220;yatsa&#8221; is used, as well as the almost 100 (a guess) verses where the word &#8220;shakal&#8221; is used &#8211; verse by verse if you are truly interested in exploring it.\n \n \nIt is supported by what the Bible says. You have yet to show me that (assuming the Bible has everything in it) abortion is supported by the Bible.\nI never said it was Steeeeve, you are the one claiming that the Bible takes a definite anti-abortion position and you can't substantiate that conclusively. My position is that (and I put it in bold for you): The Bible is not clearly opposed to abortion or condoning of abortion. It is ambiguous.", 
   {}, 
   180440, 
   null, 
   1132449060.0
  ], 
  [
   180550, 
   null, 
   "Steeeeve", 
   "I get it, don't quote the Bible to you, just take you word on what the Bible says! I love it. \n No you just quoted random passages and didn't tell me how they even related. I can quote a few passages as well.\n \n \nIt is not cut and dry. I am willing to go through verse by verse, one at a time, the 20-30 or so verses where the word \"yatsa\" is used, as well as the almost 100 (a guess) verses where the word \"shakal\" is used - verse by verse if you are truly interested in exploring i\n And yatsa will never be used to mean miscarriage and will be used to mean live birth. Shakal or (Shakol) is really the common word for miscarry. See http://www.sacrednamebible.com/kjvstrongs/STRHEB79.htm#S7921\n \n \n While the word Yatsa, is never used for miscarriage.\n http://www.sacrednamebible.com/kjvstrongs/STRHEB33.htm#S3318\n \n Oh and your numbers are way off for where \"yatsa\" is used and shakol..you have the two reversed almost. \n \n Once again, cut and dry.\n \n \nI never said it was Steeeeve, you are the one claiming that the Bible takes a definite anti-abortion position and you can't substantiate that conclusively. My position is that (and I put it in bold for you): The Bible is not clearly opposed to abortion or condoning of abortion. It is ambiguous.\n Which still avoids my question. Stop trying to avoid it. If for a second we assume the Bible takes a stance on everything (which I believe but don't wish to prove right now) then we know that God is either for or against abortion and we can find this in the Bible. From the evidence we can easily say that there are 0 passages supporting abortion and many suggesting it to be wrong.", 
   {
    "unicode_changes_made": true
   }, 
   180446, 
   null, 
   1132515240.0
  ], 
  [
   180564, 
   null, 
   "Howard Beale", 
   "Steeeeve:\n \n Even in the website you reference, \"shakol\" can mean to \"miscarry or to suffer an abortion.\" In fact the only time \"shakol\" is translated as \"miscarry\" is in Hosea 9:14 \"miscarrying womb\" which most scholars agree is synonymous with \"barren womb\"\n \n I noticed that you did not link to that same website for the word \"yatsa\". Your own referenced lexicon does not say that \"yatsa\" translates as abort or abortion. Why? Because it does not. Based on the very website you reference, your interpretation is a possible one, but not the definitive one. \n \n \nWhich still avoids my question. Stop trying to avoid it. \nI have addressed the question head on, quoted you chapter and verse from the Bible, and directed you back to the very website you reference to support your contention. \"Shakol\" is translated primarily as \"bereave\" or \"barren\"; \"yatsa' is translated primarily as, \"forth\" or \"out\". Neither has a connotation of violence.\n \n On one occasion (Hosea 9:14) \"shakol\" is translated as \"miscarrying womb\" which most scholars agree is the equivalent of \"barren womb\". \"yatsa\" is translated as \"begotten\" (Jude 8:30); as \"carry\" (Jer 39:14); as \"grow\" (Job 31:40). \"Begotten\", \"carry\" and \"grow\": very different meanings than abort or abortion.\n \n Your interpretation is a possible one but the definitive one.\n \n \nIf for a second we assume the Bible takes a stance on everything (which I believe but don't wish to prove right now) then we know that God is either for or against abortion and we can find this in the Bible. From the evidence we can easily say that there are 0 passages supporting abortion and many suggesting it to be wrong.\nSomeone else could say, \"If for a second we assume the Bible was transposed from an oral tradition, then we know that the versions we have are not accurate...\" I don't accept that assumption and I don't accept yours. I don't like to \"assume\" anything. Remember what happens when we assume.\n \n \nOh and your numbers are way off for where \"yatsa\" is used and shakol..you have the two reversed almost.\nYou're right about that one, not only were they backwards, they were incomplete - more like 1,000 for \"yatsa\".", 
   {
    "unicode_changes_made": true
   }, 
   180550, 
   null, 
   1132522560.0
  ], 
  [
   180576, 
   null, 
   "Steeeeve", 
   "\n Even in the website you reference, \"shakol\" can mean to \"miscarry or to suffer an abortion.\" In fact the only time \"shakol\" is translated as \"miscarry\" is in Hosea 9:14 \"miscarrying womb\" which most scholars agree is synonymous with \"barren womb\"\n \n I noticed that you did not link to that same website for the word \"yatsa\". Your own referenced lexicon does not say that \"yatsa\" translates as abort or abortion. Why? Because it does not. Based on the very website you reference, your interpretation is a possible one, but not the definitive one.\n I thought I did link to yatsa..\n \nWhile the word Yatsa, is never used for miscarriage.\n http://www.sacrednamebible.com/kjvst...EB33.htm#S3318\n So I am not sure what you are talkign about. Yatsa was never used as miscarriage. It was used as depart a number of time(premature birth as we know it). And we see that shakol has been used to mean miscarriage and is the word for it (as shown in the website). \n \n \n \nI have addressed the question head on, quoted you chapter and verse from the Bible, and directed you back to the very website you reference to support your contention. \"Shakol\" is translated primarily as \"bereave\" or \"barren\"; \"yatsa' is translated primarily as, \"forth\" or \"out\". Neither has a connotation of violence.\n \n On one occasion (Hosea 9:14) \"shakol\" is translated as \"miscarrying womb\" which most scholars agree is the equivalent of \"barren womb\". \"yatsa\" is translated as \"begotten\" (Jude 8:30); as \"carry\" (Jer 39:14); as \"grow\" (Job 31:40). \"Begotten\", \"carry\" and \"grow\": very different meanings than abort or abortion.\n \n Your interpretation is a possible one but the definitive one\n The only point is to show that \"yatsa\" doesn't mean miscarriage and that \"shakol\" would be the word to use for miscarriage. Thus 'yatsa\" in Exodus 21 doesn't mean miscarraige and thus doesn't help the pro-choice arguement. You are ignoring all facts here Beale.\n \n \nI don't accept that assumption and I don't accept yours. I don't like to \"assume\" anything. Remember what happens when we assume.\n WEll, I don't wish to get into why the Bible has to be 100% accurate.", 
   {
    "unicode_changes_made": true
   }, 
   180564, 
   null, 
   1132524360.0
  ], 
  [
   180587, 
   null, 
   "Howard Beale", 
   "The only point is to show that \"yatsa\" doesn't mean miscarriage and that \"shakol\" would be the word to use for miscarriage. Thus 'yatsa\" in Exodus 21 doesn't mean miscarraige and thus doesn't help the pro-choice arguement. You are ignoring all facts here Beale.\nAnd that supports those who believe that the reference is to abortion. However, there is an equal amount of evidence that it does not and some that supports the contention that the verses in Exodus after that (particularly 21:23) refer to harm to the woman not the fetus. That too is not crystal clear. It can be read (22) If a man strike a woman causing the pregnancy to be aborted, then the husband can fine the perp. (23) If the woman dies, then the perp has to die. It can also be read: (22) If the perp hits a woman causing premature birth, then the husband can fine the perp. (23) but if the fetus or child dies, then the perp is to be killed. Those are only two possible variations. Believe it or not, there are many more. \n \n Ancient Hebrew is more a poetic language than a specific language. That is why one Christian sect can claim a verse means one thing and support it and another sect can claim it means another and support that. Rather than argue about things that cannot be definitely known, I prefer to discover things that all can agree on - and even that is difficult because many Christians have their dogma stuck in their ears and fear even contemplating ideas that are different than theirs.", 
   {
    "unicode_changes_made": true
   }, 
   180576, 
   null, 
   1132526040.0
  ], 
  [
   180590, 
   null, 
   "Steeeeve", 
   "That too is not crystal clear. It can be read (22) If a man strike a woman causing the pregnancy to be aborted, then the husband can fine the perp\n No, it can't be read this way because yatsa doesn't mean aborted /miscarriage of anything of the sort. The site sites show this clearly. Yatsa has never been used to mean aborted/miscarriage and you have yet to show a reference where it has been. Please provide evidence.", 
   {}, 
   180587, 
   null, 
   1132526640.0
  ], 
  [
   180607, 
   null, 
   "Howard Beale", 
   "No, it can't be read this way because yatsa doesn't mean aborted /miscarriage of anything of the sort. The site sites show this clearly. Yatsa has never been used to mean aborted/miscarriage and you have yet to show a reference where it has been. Please provide evidence.\nI was not saying that this is a definitive translation. You have taken my words completely out of context. I said that this was one of a number of possible translations.\n \n How would you render those verses in Exodus into simple English?", 
   {}, 
   180590, 
   null, 
   1132531860.0
  ], 
  [
   180616, 
   null, 
   "Steeeeve", 
   "I was not saying that this is a definitive translation. You have taken my words completely out of context. I said that this was one of a number of possible translations.\n \n How would you render those verses in Exodus into simple English?\n\n But it is not one of the many translations. You have shown NO WHERE that yatsa could mean miscarriage or aborted. Please provide evidence that it could mean this. From the sites I have shown, it has never been used in the Bible to mean those things.", 
   {}, 
   180607, 
   null, 
   1132537380.0
  ], 
  [
   180624, 
   null, 
   "Howard Beale", 
   "But it is not one of the many translations. You have shown NO WHERE that yatsa could mean miscarriage or aborted. Please provide evidence that it could mean this. From the sites I have shown, it has never been used in the Bible to mean those things.\nPerhaps I have not been clear, but that is exactly what I have been trying to say. If one wanted to, one could attempt to make a case that \"yatsa\" meant \"abort\" but one would never be able to show that definitely. On the other hand, if one wanted to, one could attempt to make a case that \"yatsa\" meant \"miscarry\" but one would never be able to show that definitely. The words \"yatsa\" and \"shakol\" as used in Biblical Hebrew are not specific enough to narrow their usage to exactly match our english words.\n \n I asked you in good faith how you would render those verses in Exodus 21. Will you answer?", 
   {
    "unicode_changes_made": true
   }, 
   180616, 
   null, 
   1132542540.0
  ], 
  [
   180639, 
   null, 
   "Steeeeve", 
   "Perhaps I have not been clear, but that is exactly what I have been trying to say. If one wanted to, one could attempt to make a case that \"yatsa\" meant \"abort\" but one would never be able to show that definitely. On the other hand, if one wanted to, one could attempt to make a case that \"yatsa\" meant \"miscarry\" but one would never be able to show that definitely. The words \"yatsa\" and \"shakol\" as used in Biblical Hebrew are not specific enough to narrow their usage to exactly match our english words.\n \n I asked you in good faith how you would render those verses in Exodus 21. Will you answer?\n\n \n What? I guess one could think the word \"phone\" could mean \"to run\" but this doesn't make it true. The fact stands that \"shakol\" has been shown to mean miscarriage and yatsa has never been known to mean this. So it would be unreasonable to say yatsa means miscarriage...you might as well say phone means \"to run\". It is that crazy. Is someone else on your account Beale...you aren't debating like you normally do.", 
   {
    "unicode_changes_made": true
   }, 
   180624, 
   null, 
   1132550340.0
  ], 
  [
   180659, 
   null, 
   "Howard Beale", 
   "Steeeeve:\n \n I have asked you twice before, in good faith, how you would render those verses in Exodus 21. Is it simply that you don't want to answer?", 
   {}, 
   180639, 
   null, 
   1132584060.0
  ], 
  [
   181092, 
   null, 
   "theo", 
   "I have asked you twice before, in good faith, how you would render those verses in Exodus 21. Is it simply that you don't want to answer?\n\n \n Howard,\n \n Exodus 21 is pretty clear that there will be punishment for either killing or hurting either the woman or her unborn child and that the punishment will equal the crime... eye for eye, tooth for tooth, life for life.\n \n Seems pretty simple, Howard.\n \n -Theo\n \n Click here to see what bible.com has to say about abortion.", 
   {}, 
   180659, 
   null, 
   1132781700.0
  ], 
  [
   181094, 
   null, 
   "Howard Beale", 
   "Howard,\n \n Exodus 21 is pretty clear that there will be punishment for either killing or hurting either the woman or her unborn child and that the punishment will equal the crime... eye for eye, tooth for tooth, life for life.\n \n Seems pretty simple, Howard.\n \n -Theo\n \n Click here to see what bible.com has to say about abortion.\nNo, theo, it is not. As I asked Steeeeve, how would you render those passages from Exodus? Keep in mind that Biblical Hebrew is not as scientifically precise a language as English or even Latin.", 
   {}, 
   181092, 
   null, 
   1132782180.0
  ], 
  [
   181145, 
   null, 
   "Steeeeve", 
   "No, theo, it is not. As I asked Steeeeve, how would you render those passages from Exodus? Keep in mind that Biblical Hebrew is not as scientifically precise a language as English or even Latin.\n\n \n I don't see how it matters how I render the passage. The only part that matters is that \"yatsa\" has never and never will mean miscarriage. so how I render the passage could be anything without \"yatsa\" meaning miscarriage. The most accurate translation I know of is on the website I posted earlier.", 
   {}, 
   181094, 
   null, 
   1132793100.0
  ], 
  [
   181177, 
   null, 
   "Howard Beale", 
   "I don't see how it matters how I render the passage. The only part that matters is that \"yatsa\" has never and never will mean miscarriage. so how I render the passage could be anything without \"yatsa\" meaning miscarriage. The most accurate translation I know of is on the website I posted earlier.\nYou don't have give me your ideas as to how the passages are best rendered. I have already given you the number of meanings that \"yatsa\" has, chapter and verse on the number of translations from \"begotten\" to \"carry\" to \"go\" \"bring\" \"forth\", etc, etc. You insist that you know exactly what the writer intended in those passages. I am saying most scholars agree that they are ambiguous. I agree with them. If you know exactly how it should be translated, I was just curious for you to present it. You are the one who is saying there is one meaning and only one meaning to those passages in Exodus. I am the one saying they are not clear. If you won't present exactly what your version of the words is, there is no more for me to say.", 
   {
    "unicode_changes_made": true
   }, 
   181145, 
   null, 
   1132797720.0
  ], 
  [
   181190, 
   null, 
   "mae", 
   "You don't have give me your ideas as to how the passages are best rendered. I have already given you the number of meanings that \"yatsa\" has, chapter and verse on the number of translations from \"begotten\" to \"carry\" to \"go\" \"bring\" \"forth\", etc, etc. You insist that you know exactly what the writer intended in those passages. I am saying most scholars agree that they are ambiguous. I agree with them. If you know exactly how it should be translated, I was just curious for you to present it. You are the one who is saying there is one meaning and only one meaning to those passages in Exodus. I am the one saying they are not clear. If you won't present exactly what your version of the words is, there is no more for me to say.\n\n \n \"Yatsa\" ? It is all in the interpretation of that word. People will choose to interpret it in a way that suits their views on abortion. \n \n Are you guys still debating the abortion issue ? I thought it would have been exhusted by now.", 
   {
    "unicode_changes_made": true
   }, 
   181177, 
   null, 
   1132802640.0
  ], 
  [
   181192, 
   null, 
   "trebor", 
   "Well, I will point out Numbers 5.\n \n In Numbers 5, it give a procedure that a high priest follows if a man suspects that that his pregnant wife is having another man's child. \n \n The priest will give the woman 'bitter water', and if she has a miscarriage (i.e. an induced abortion), she was guilty.\n \n Inducing a miscarriage via drugs sounds like an abortion to me. While it might be to 'test' her fidelity, it is a life/death decision about a fetus.", 
   {}, 
   181190, 
   null, 
   1132803060.0
  ], 
  [
   181530, 
   null, 
   "Steeeeve", 
   "You don't have give me your ideas as to how the passages are best rendered. I have already given you the number of meanings that \"yatsa\" has, chapter and verse on the number of translations from \"begotten\" to \"carry\" to \"go\" \"bring\" \"forth\", etc, etc. You insist that you know exactly what the writer intended in those passages. I am saying most scholars agree that they are ambiguous. I agree with them. If you know exactly how it should be translated, I was just curious for you to present it. You are the one who is saying there is one meaning and only one meaning to those passages in Exodus. I am the one saying they are not clear. If you won't present exactly what your version of the words is, there is no more for me to say.\n\n \n none of the things you said were miscarriage...so can it be safe to say that \"yatsa\" doesn't mean that.", 
   {
    "unicode_changes_made": true
   }, 
   181177, 
   null, 
   1132986840.0
  ], 
  [
   181542, 
   null, 
   "Howard Beale", 
   "none of the things you said were miscarriage...so can it be safe to say that \"yatsa\" doesn't mean that.\nI truly don't understand your point. When a pregnant woman falls down the stairs and looses the child, I consider that she miscarried. Do you?", 
   {}, 
   181530, 
   null, 
   1132988160.0
  ], 
  [
   181555, 
   null, 
   "Tastyfish", 
   "\n Inducing a miscarriage via drugs sounds like an abortion to me. While it might be to 'test' her fidelity, it is a life/death decision about a fetus.\n\n I'm going to take a wild swing in the dark and hazard a guess its a matter of life or death for the woman too?", 
   {}, 
   181192, 
   null, 
   1132989780.0
  ], 
  [
   181561, 
   null, 
   "Steeeeve", 
   "I truly don't understand your point. When a pregnant woman falls down the stairs and looses the child, I consider that she miscarried. Do you?\n\n the point is, if \"yatsa\" doesn't mean miscarriage (and there is no indication it could or does) then you can't really use Exodus to support abortion.", 
   {}, 
   181542, 
   null, 
   1132990440.0
  ], 
  [
   181566, 
   null, 
   "Howard Beale", 
   "the point is, if \"yatsa\" doesn't mean miscarriage (and there is no indication it could or does) then you can't really use Exodus to support abortion.\nI have been saying that all along Steeve. You can't use Exodus to support abortion and you can't use it to condemn abortion. That has been my point. It is too vague. \n \n I asked a question in good faith so that I can understand exactly what you mean. I asked: When a pregnant woman falls down the stairs and looses the child, I consider that she miscarried. Do you?\n \n It is not a trick question. I already gave you my answer, I consider that a miscarraige. I hope you will answser because I truly am at a loss in understanding some things.", 
   {}, 
   181561, 
   null, 
   1132990860.0
  ], 
  [
   181617, 
   null, 
   "Tastyfish", 
   "However surely that Numbers reference is pretty strikingly in favour of abortion, under conditions that a lot of people wouldn't agree with now (i.e forced)? Or is there some subtle nuance that means that this is vaguer that it seems?", 
   {}, 
   181566, 
   null, 
   1133018460.0
  ], 
  [
   181644, 
   null, 
   "Obvious Child", 
   "Well, I will point out Numbers 5.\n \n In Numbers 5, it give a procedure that a high priest follows if a man suspects that that his pregnant wife is having another man's child. \n \n The priest will give the woman 'bitter water', and if she has a miscarriage (i.e. an induced abortion), she was guilty.\n \n Inducing a miscarriage via drugs sounds like an abortion to me. While it might be to 'test' her fidelity, it is a life/death decision about a fetus.\nThe water seems to be holy water and dust: the bitterness seems to be based on the curse or judgement, not some chemical form.\n \n Also the versions I've seen say that her 'belly swells' and her thigh 'falls away' or 'rots'. Is 'thigh' some sort of symonym for fetus or womb?", 
   {}, 
   181192, 
   null, 
   1133033580.0
  ], 
  [
   181668, 
   null, 
   "Tastyfish", 
   "Does the process matter? If I performed an abortion by magically swapping a fetus and a chicken around it would still result in an abortion/dead baby due to my magic.", 
   {}, 
   181644, 
   null, 
   1133037420.0
  ], 
  [
   181670, 
   null, 
   "Obvious Child", 
   "My point is that it isn't a person causing it through drugs: it's presumably God acting, and he's allowed to punish the children (or embryos) for the sins of their parents.\n \n Aslo, the next bit of my post needs looking at: I can't find a reference to miscarriage in this section at all.", 
   {}, 
   181668, 
   null, 
   1133038020.0
  ], 
  [
   181855, 
   null, 
   "Steeeeve", 
   "I have been saying that all along Steeve. You can't use Exodus to support abortion and you can't use it to condemn abortion. That has been my point. It is too vague. \n \n I asked a question in good faith so that I can understand exactly what you mean. I asked: When a pregnant woman falls down the stairs and looses the child, I consider that she miscarried. Do you?\n \n It is not a trick question. I already gave you my answer, I consider that a miscarraige. I hope you will answser because I truly am at a loss in understanding some things.\n\n \n Yeah but you haven't been saying that all along. But thats neither hear nor there.\n \n If a women falls down and looses the child(I assume you did mean looses and not losses) then I would say this is not a miscarriage as the baby did not die.", 
   {}, 
   181566, 
   null, 
   1133125620.0
  ], 
  [
   181865, 
   null, 
   "Howard Beale", 
   "Yeah but you haven't been saying that all along. But thats neither hear nor there.\n \n If a women falls down and looses the child(I assume you did mean looses and not losses) then I would say this is not a miscarriage as the baby did not die.\nIf I had been unclear in saying that previously, ,but I will review my posts to see where I was confusing.\n \n Also, I was unclear in the question. The question was acually taken from a discussion with minister. If I were to put put the question in my words I would ask, \"If a pregnant woman falls down the stairs causing the death of the fetus, I consider that she miscarried. Do you?\" Sorry for the lack of clarity.", 
   {}, 
   181855, 
   null, 
   1133126220.0
  ], 
  [
   181866, 
   null, 
   "Howard Beale", 
   "Yeah but you haven't been saying that all along. But thats neither hear nor there.\n\n \n Actually, I have been saying that all along. Here is my first post on this thread, Post #15\n \n It truly backs up no one because the exact meaning is too obscure - especially the Hebrew word translated as \"miscarriage\". I went through this on another thread - I have forgotten which one. As far as the \"any further damage\" reference, there is a strong case to be made that the words refer to the woman -- but that case is by no means conclusive. Each side tries to twist this passage from Exodus to support their point of view. It is more a talking point for each than anything else.", 
   {
    "unicode_changes_made": true
   }, 
   181855, 
   null, 
   1133126460.0
  ], 
  [
   181870, 
   null, 
   "Steeeeve", 
   "Also, I was unclear in the question. The question was acually taken from a discussion with minister. If I were to put put the question in my words I would ask, \"If a pregnant woman falls down the stairs causing the death of the fetus, I consider that she miscarried. Do you?\" Sorry for the lack of clarity.\n Clearly changes the question because \"looses\" is actually a word and doesn't imply death at all. If the baby dies because of \"spontanous\" acts (such as falling down the stairs or the baby just dieing naturally in the womb) then I believe the qualifies under what a miscarriage is. I also am assuming she did it on accident. Even if it wasn't an accident I believe it is still called a \"miscarriage\" but I don't think it is a spontanous abortion but more like a planned abortion. Hopefully that makes sense.\n http://www.teenwire.com/infocus/2005/if-20050729p371-miscarriage.php", 
   {}, 
   181866, 
   null, 
   1133127540.0
  ], 
  [
   181871, 
   null, 
   "Steeeeve", 
   "Actually, I have been saying that all along. Here is my first post on this thread, Post #15\n \n It truly backs up no one because the exact meaning is too obscure - especially the Hebrew word translated as \"miscarriage\". I went through this on another thread - I have forgotten which one. As far as the \"any further damage\" reference, there is a strong case to be made that the words refer to the woman -- but that case is by no means conclusive. Each side tries to twist this passage from Exodus to support their point of view. It is more a talking point for each than anything else.\n\n \n We probably shouldn't debate what you actually said or what you didn't say...\n \n If we agree that \"yatsa\" doesn't mean miscarriage..ever...and that Exodus doesn't talk about abortion (which is the most likely case) then it seems their is nothing to debate.", 
   {
    "unicode_changes_made": true
   }, 
   181866, 
   null, 
   1133127600.0
  ], 
  [
   181873, 
   null, 
   "Howard Beale", 
   "Clearly changes the question because \"looses\" is actually a word and doesn't imply death at all. If the baby dies because of \"spontanous\" acts (such as falling down the stairs or the baby just dieing naturally in the womb) then I believe the qualifies under what a miscarriage is. I also am assuming she did it on accident. Even if it wasn't an accident I believe it is still called a \"miscarriage\" but I don't think it is a spontanous abortion but more like a planned abortion. Hopefully that makes sense.\n http://www.teenwire.com/infocus/2005/if-20050729p371-miscarriage.php\nThanks, Steeeeve. You make perfect sense. Miscarraige and abortion have the same consequence: the pregnancy is over. There is the additional element of \"intention\" that changes the meanings. I had other thoughts about this, but maybe later.", 
   {}, 
   181870, 
   null, 
   1133128140.0
  ], 
  [
   181874, 
   null, 
   "Steeeeve", 
   "Thanks, Steeeeve. You make perfect sense. Miscarraige and abortion have the same consequence: the pregnancy is over. There is the additional element of \"intention\" that changes the meanings. I had other thoughts about this, but maybe later.\n\n \n To me it is all about intention and consequences of the intentions(in a general sense). Some say the intention of abortion is not to kill the baby but to free up the womans life. Maybe that is her reasoning but her intentions are selfish ones. And selfishness at the expense of anothers life is not gonna fly with me.", 
   {}, 
   181873, 
   null, 
   1133128320.0
  ], 
  [
   181967, 
   null, 
   "simone", 
   "Easy for you to say, Steeeeve, inasmuch as you do not have uterus and you will never have to deal with the misery of a pregnancy and the dangers of giving birth.", 
   {}, 
   181874, 
   null, 
   1133196300.0
  ], 
  [
   182042, 
   null, 
   "Steeeeve", 
   "Easy for you to say, Steeeeve, inasmuch as you do not have uterus and you will never have to deal with the misery of a pregnancy and the dangers of giving birth.\n\n \n what is your point simone? If I find one women that agrees with my arguement then your strawman attack is false (as if it isn't already). Oddly enough, there are many women that argee with me.", 
   {}, 
   181967, 
   null, 
   1133210400.0
  ], 
  [
   182104, 
   null, 
   "simone", 
   "What kind of an argument is it that ONE WOMAN may speak for ALL WOMEN?", 
   {}, 
   182042, 
   null, 
   1133222400.0
  ], 
  [
   184402, 
   null, 
   "trebor", 
   "I'm going to take a wild swing in the dark and hazard a guess its a matter of life or death for the woman too?\n\n \n If you read the passage, it has nothng to do with the life or death of the woman. Nor, does the woman have a voice in the matter. The passage appears\n to be a choice the husband makes to test the fidelity of his wife, and the 'bitter waters' are administered by the high priest. \n \n The current viewpoint is that while some of the attitude is archaic, it does show that man should be involved in life/death decisions. That would include abortions.\n \n You are right in the fact in the current modern Orthodox Jewish viewpoint, the only time abortions should be performed is when the woman's health is endangered. In the viewpoint of many of the orthodox Jews, if the woman's health is endangered, then an abortion might be REQUIRED (not just optional).\n \n FYI: The purpose of the Talmud is to examine the different passages and laws in the Torah, and then have a discussion (various opinions) on how to apply the principle described to everyday life. Needless to say, since the Jewish people are a very opinionated lot, any specific passage you will have a number of different interpretations discussed in the Talmud.", 
   {}, 
   181555, 
   null, 
   1134228120.0
  ], 
  [
   184403, 
   null, 
   "trebor", 
   "The water seems to be holy water and dust: the bitterness seems to be based on the curse or judgement, not some chemical form.\n \n Also the versions I've seen say that her 'belly swells' and her thigh 'falls away' or 'rots'. Is 'thigh' some sort of symonym for fetus or womb?\n\n \n It appears to be so. You have to remember that the early Hebrews were NOT scienitists. They used prayers for everything. And yes,the result was thought to be based on judgement. \n \n But, I am assuming that the 'bitter water' was bitter because of special herbs added. That sort of thing would at least give results every once in a while, rather than just pure water that was blessed. (purely from a practical matter, don't you think)?", 
   {}, 
   181644, 
   null, 
   1134228480.0
  ], 
  [
   184409, 
   null, 
   "Steeeeve", 
   "What kind of an argument is it that ONE WOMAN may speak for ALL WOMEN?\n\n \n Your whole argument is that I can't say anything about abortion because I am not a woman...but if I find one woman that agrees with me then it doesn't matter if I am a man or woman. So your argument is false and I suggest you stop using it but I doubt you will.", 
   {}, 
   182104, 
   null, 
   1134231900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Bible and Abortion", 
  "url": "http://www.4forums.com/political/abortion-debates/6840-bible-abortion.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 6840, 
  "discussion_files": [
   [
    "11302.html", 
    "http://www.4forums.com/political/abortion-debates/6840-bible-abortion-print.html"
   ], 
   [
    "11303.html", 
    "http://www.4forums.com/political/abortion-debates/6840-bible-abortion-4-print.html"
   ], 
   [
    "11304.html", 
    "http://www.4forums.com/political/abortion-debates/6840-bible-abortion-3-print.html"
   ], 
   [
    "11305.html", 
    "http://www.4forums.com/political/abortion-debates/6840-bible-abortion-2-print.html"
   ]
  ], 
  "identifier": 6840
 }
]