[
 [
  [
   179332, 
   null, 
   "Another opinion", 
   "The allogations of US abuse of enemy combatant prisoners, Abu Ghraib and others, along with the more recent discussions on banning torture bring to mind a few questions:\n \n 1) Outside of the administration of acute physical pain, what actions do we consider torture? Are humiliations (such as Abu Ghraib) torture? What about sleep depravation? Should we define different degrees of torture to cover different scenarios?\n \n 2) If ones enemy is not following any limits on torture, does that still oblige one to follow such limits? Are those limits there simply to ensure the safety of our own soldiers (in a mutual agreement) or should they still be followed out of an inherent sense of ethics?\n \n 3) Is torture even effective - or are prisoners simply saying anything to their captors that will make the torture stop? If not, then why pursue it?", 
   {
    "post_info": {
     "post_title": "A question of torture"
    }
   }, 
   null, 
   null, 
   1132013160.0
  ], 
  [
   179411, 
   null, 
   "daewoo", 
   "\"Torture\" covers psychological torture as well.\n \n The use of torture is a pretty pathetic last resort by a defeated interrogater. There have been a ton of studies done that confirm this. It used to be that intel gained under torture was considered \"highly suspect\" undr army standards. Those standards have changed. The fact we are torturing people means 2 things:\n \n 1. We are not getting any usable informaiton out of them\n 2. we are wasting time and money on wild goosechases following information that was given to stop the torture.\n \n Torturing people is an act of frustration and defeat, not a sound intel strategy. Even the Russians did not routinely torture people for information. They tortured people to punish them. \n \n The excpetion to this is when you need a confession written or signed. This was popular in S America (we still teach people how to do this kind of thing at the former SOA). Birng somebody in and hurt them bad enough, and you destroy their mind. They will say or sign anything you want. You torture them to the point that they are nothing but an empty shell, get their public confession, then execute them. One of our favorite tactics in S America.", 
   {}, 
   179332, 
   null, 
   1132039620.0
  ], 
  [
   179446, 
   null, 
   "Obvious Child", 
   "\"Torture\" covers psychological torture as well.\nBut is any psychological pressure, such as asking a barrage of questions without giving time to answer, shouting at someone, insulting them etc. psychological torture?", 
   {}, 
   179411, 
   null, 
   1132065120.0
  ], 
  [
   179464, 
   null, 
   "Kronus", 
   "The allogations of US abuse of enemy combatant prisoners, Abu Ghraib and others, along with the more recent discussions on banning torture bring to mind a few questions:\n \n 1) Outside of the administration of acute physical pain, what actions do we consider torture? Are humiliations (such as Abu Ghraib) torture? What about sleep depravation? Should we define different degrees of torture to cover different scenarios?\n \n 2) If ones enemy is not following any limits on torture, does that still oblige one to follow such limits? Are those limits there simply to ensure the safety of our own soldiers (in a mutual agreement) or should they still be followed out of an inherent sense of ethics?\n \n 3) Is torture even effective - or are prisoners simply saying anything to their captors that will make the torture stop? If not, then why pursue it?\n\n \n 1) Whether or not something is torture, abuse, or persuation can be argued about by the lawyers. For me, the question is this. If a foreign government was doing it to our captured troops, would we be happy. If the answer is no, than we shouldn't be doing it to anyone either.\n \n 2) You always follow the rules. That's morallity 101. If it's bad when the other guy does it, then it's bad when you do it.\n \n 3) Torture is generally considered not effective in getting information. You can use it to break people, get false confessions, that sort of thing. However, the time involved is generally such that any sensitive information that the person had would be out of date by the time it's extracted. So why do people do it? You might always get lucky...", 
   {}, 
   179332, 
   null, 
   1132072680.0
  ], 
  [
   179473, 
   null, 
   "Obvious Child", 
   "1) Whether or not something is torture, abuse, or persuation can be argued about by the lawyers. For me, the question is this. If a foreign government was doing it to our captured troops, would we be happy. If the answer is no, than we shouldn't be doing it to anyone either.\nSo we shouldn't ask them for information in any way, stop them returning to the fray or attempt to covince them of the injustice of their cause?", 
   {}, 
   179464, 
   null, 
   1132076460.0
  ], 
  [
   179480, 
   null, 
   "Kronus", 
   "So we shouldn't ask them for information in any way, stop them returning to the fray or attempt to covince them of the injustice of their cause?\n\n \n By happy I didn't mean overjoyed! Soldiers get captured and held, that's the reality of war. Obviously we aren't literally happy when our soldiers are captured, but if they're held under reasonable conditions, not mistreated, and released at the end of hostilities then we're at least content with their treatment, we wouldn't have cause for complaint. If someone were doing to our soldiers what we're doing to some detainees we'd be furious, and rightly so. If we wouldn't stand to see our own people treated a certain way, then we souldn't be doing it to others. That's the guideline I'm advocating.", 
   {}, 
   179473, 
   null, 
   1132078500.0
  ], 
  [
   179523, 
   null, 
   "Obvious Child", 
   "The problem here is that it assumes a way of thinking where the allegiance, race, religion etc. of a combatant are unimportant compared to some notion of fundamental rights. \n \n Someone might say 'I wouldn't mind them killing our prisoners if they were Jews, we only kill theirs if they are Jews'\n \n Or: 'I would be OK with them torturing senior officials of ours if they were fighting an evil aggressive war against a valid nation-state'.\n \n What counts as a valid situational consideration: 'it's OK to lock them up if they're going to rejoin the fray' from something we would consider unacceptable: 'it's OK to sterilize them if they're going to racially compromise the master race'", 
   {}, 
   179480, 
   null, 
   1132088100.0
  ], 
  [
   179557, 
   null, 
   "Kronus", 
   "The problem here is that it assumes a way of thinking where the allegiance, race, religion etc. of a combatant are unimportant compared to some notion of fundamental rights. \n\n \n How is that a problem? I'd say that's a basic moral concept. I would emphatically say that that's the way it should be.", 
   {}, 
   179523, 
   null, 
   1132097880.0
  ], 
  [
   179587, 
   null, 
   "Another opinion", 
   "Adding my own, still mixed, views to the discussion:\n \n 1) Outside of the administration of acute physical pain, what actions do we consider torture? Are humiliations (such as Abu Ghraib) torture? What about sleep depravation? Should we define different degrees of torture to cover different scenarios?\n I would think that there should be different terms for different levels of suffering - ranging from torture (physical or psychological) to harrassment. I don't have a good guideline for how to differenciate these but I would say that the administration of acute physical pain or threatening a person's loved ones should be called torture, whereas yelling at someone or giving them uncomfortable (but not debilitating) prison accomodations would merely be harrassment. \n 2) If ones enemy is not following any limits on torture, does that still oblige one to follow such limits? Are those limits there simply to ensure the safety of our own soldiers (in a mutual agreement) or should they still be followed out of an inherent sense of ethics?\n I think that our treatment of enemy prisoners should be somewhat reflective of how they treat ours - otherwise, there is no motivation for them not to mistreat our prisoners. However, I would set absolute limits in how far we should go based on ethical reasons. For example, from the examples I gave in point 1, we should not torture, but harrassment is fine. The scenarious in between those two are more problematic.\n 3) Is torture even effective - or are prisoners simply saying anything to their captors that will make the torture stop? If not, then why pursue it?\n As Daewoo mentioned and I've also heard, information derived under torture can be unreliable. I wonder about lesser forms, though, such as long-term harrassment that slowly wears down a persons defences.", 
   {}, 
   179332, 
   null, 
   1132104360.0
  ], 
  [
   179653, 
   null, 
   "Kronus", 
   "\n 2) If ones enemy is not following any limits on torture, does that still oblige one to follow such limits? Are those limits there simply to ensure the safety of our own soldiers (in a mutual agreement) or should they still be followed out of an inherent sense of ethics?\n I think that our treatment of enemy prisoners should be somewhat reflective of how they treat ours - otherwise, there is no motivation for them not to mistreat our prisoners. However, I would set absolute limits in how far we should go based on ethical reasons. For example, from the examples I gave in point 1, we should not torture, but harrassment is fine. The scenarious in between those two are more problematic.\n\n \n I can see two problems with this approach. First, it could lead to a tit for tat scenario, where each side treats prisoners worse and worse as word of prisoner abuse from the other side gets out. Second, our next enemy, which might otherwise have treated our prisoners decently, might look at our current behavior and decide that since we don't treat prisoners well, all prisoners, then they won't treat our captured troops well.", 
   {}, 
   179587, 
   null, 
   1132157100.0
  ], 
  [
   179710, 
   null, 
   "Another opinion", 
   "I can see two problems with this approach. First, it could lead to a tit for tat scenario, where each side treats prisoners worse and worse as word of prisoner abuse from the other side gets out. Second, our next enemy, which might otherwise have treated our prisoners decently, might look at our current behavior and decide that since we don't treat prisoners well, all prisoners, then they won't treat our captured troops well.\nIf we do not go as far in our harrassment as do our enemies, then the tit for tat scenario may not escalate. My main concern is that, if we treat their prisoners very well whether or not they treat our prisoners well, then they have no motivation whatsoever to treat our prisoners well. I vaguely remember hearing about our treatment of Axis power POWs being originally good until we heard about their (mainly Japanese) treatment of our prisoners, at which point we stopped the good treatment.\n \n As for the approach of our next enemy, I would hope that we can have some other examples (except for the treatment of that particular earlier enemy's prisoners) to point to to show our goodwill. Otherwise, if we can show that \"they started it\" and that they, not we, were the ones escalating the bad treatment, that might go a long way.", 
   {}, 
   179653, 
   null, 
   1132173960.0
  ], 
  [
   179725, 
   null, 
   "Kronus", 
   "If we do not go as far in our harrassment as do our enemies, then the tit for tat scenario may not escalate. My main concern is that, if we treat their prisoners very well whether or not they treat our prisoners well, then they have no motivation whatsoever to treat our prisoners well. \n\n \n Rather than lowering our own moral standards I would advocate the use of diplomatic sanctions, embargoes, war crime triubnals, etc, to punish those who mistreat prisoners. \"You're doing something wrong, so we're going to do something wrong back\" simply makes no moral sense to me, and I'm not sure it would work as a deterant. If they're acting immorrally to start with, immoral actions on our part are unlikely to bring them around.", 
   {}, 
   179710, 
   null, 
   1132176480.0
  ], 
  [
   179862, 
   null, 
   "Another opinion", 
   "Rather than lowering our own moral standards I would advocate the use of diplomatic sanctions, embargoes, war crime triubnals, etc, to punish those who mistreat prisoners. \"You're doing something wrong, so we're going to do something wrong back\" simply makes no moral sense to me, and I'm not sure it would work as a deterant. If they're acting immorrally to start with, immoral actions on our part are unlikely to bring them around.\nWhen you are already at war, your use of sanctions, embargoes, etc. does not add too much more negative impact since you are probably already using these tactics as part of your war strategy. As for whether any actions on our part are immoral, that's where we have to mutually decide where to draw that moral line. As I mentionned in a previous post, I think we should not cross the line into what I defined as torture (imposition of acute physical pain or extreme psychological pain). However, I don't have a problem with certain levels of harrassment - yelling at a prisoner, etc. If our standard would be to treat prisoners as we would have our own prisoners be treated, does that mean that we should supply all of our POWs with TVs in their cells, fun recreational activities, etc? Where do we draw the line - especially in situations where getting information from those prisoners (within limits of not using extreme interrogation methods) could save thousands of innocent lives?", 
   {}, 
   179725, 
   null, 
   1132213380.0
  ], 
  [
   179867, 
   null, 
   "Iuris", 
   "Torture was once the standard way of criminal investigation. It was abandoned for a reason: it's more likely to produce false data than real data. In a local \"witch\" trial, a questioner realized the series of questions \"Is X a witch, is Y a witch, is Z a witch,...\" was leading only to more and more \"Yes yes yes, just stop, please!!!\", so he pointed out the absurdity by asking \"Is the local bishop a witch?\". Guess the answer...", 
   {}, 
   179862, 
   null, 
   1132223520.0
  ], 
  [
   179877, 
   null, 
   "Kronus", 
   "When you are already at war, your use of sanctions, embargoes, etc. does not add too much more negative impact since you are probably already using these tactics as part of your war strategy. As for whether any actions on our part are immoral, that's where we have to mutually decide where to draw that moral line. As I mentionned in a previous post, I think we should not cross the line into what I defined as torture (imposition of acute physical pain or extreme psychological pain). \n\n If that's where you've drawn your line then I don't see how the behavior of your enemies would effect that. I'm simply advocating not sliding the line around based on what the enemy does. Not sinking to his level, as it were.\n \n \n If our standard would be to treat prisoners as we would have our own prisoners be treated, does that mean that we should supply all of our POWs with TVs in their cells, fun recreational activities, etc? \n\n That's not quite what I said. The question is how badly prisoners should be treated. We shouldn't do anything to prisoners we hold that we wouldn't want done to our troops if they're held prisoner. This policy assumes the unpleasant reality that prisoners get taken, and that it's not a happy-fun time for them. Given that, if we wouldn't except an action as a reasonable way to have our troops treated, then we shouldn't be doing it to anyone either.", 
   {}, 
   179862, 
   null, 
   1132242360.0
  ], 
  [
   179900, 
   null, 
   "Another opinion", 
   "If that's where you've drawn your line then I don't see how the behavior of your enemies would effect that. I'm simply advocating not sliding the line around based on what the enemy does. Not sinking to his level, as it were.\nEven the Nazis cared enough about the well-being of their own captured soldiers that they were willing, at least to some extent, to follow the dictates of the Geneva convention. This does not seem to have been true for the Japanese, who seemed to think of capture as such a shameful occurence that no rights are deserved. So, negotiation on prisoner treatment will work in some cases but not in others. Even in those cases where it doesn't work, the poor treatment of our prisoners by the enemy leaves open more methods for us to extract information from our POWs - again within ultimate ethical limits. By the way, I am not advocating sinking to his level - I think we should always be a step above.\nThat's not quite what I said. The question is how badly prisoners should be treated. We shouldn't do anything to prisoners we hold that we wouldn't want done to our troops if they're held prisoner. This policy assumes the unpleasant reality that prisoners get taken, and that it's not a happy-fun time for them. Given that, if we wouldn't except an action as a reasonable way to have our troops treated, then we shouldn't be doing it to anyone either.\nThere are a wide range of treatments between good treatment and treatment bordering on torture. Where would you set that line, then?", 
   {}, 
   179877, 
   null, 
   1132249740.0
  ], 
  [
   179904, 
   null, 
   "Another opinion", 
   "Torture was once the standard way of criminal investigation. It was abandoned for a reason: it's more likely to produce false data than real data. In a local \"witch\" trial, a questioner realized the series of questions \"Is X a witch, is Y a witch, is Z a witch,...\" was leading only to more and more \"Yes yes yes, just stop, please!!!\", so he pointed out the absurdity by asking \"Is the local bishop a witch?\". Guess the answer...\nI think most of us agree that the traditional forms of torture (i.e. the administration of acute physical pain) do not work - mostly for the type of reasons you mention. What I'm not clear about is the effectiveness of lesser forms of torment - such as the \"good cop - bad cop\" methods used to interrogate criminals. We have to determine which methods are effective and, if some of those effective methods are extreme, whether we feel that those extreme methods cross an ultimate moral line.", 
   {}, 
   179867, 
   null, 
   1132250760.0
  ], 
  [
   180045, 
   null, 
   "Iuris", 
   "It's the same thing. Physical torture does not make you talk, it breaks your will. Psychological torture achieves the same. It just doesn't leave visible marks. It does leave wounds, though. Deep wounds, and they rarely heal.\n \n The basic problem with any torture, from mild pressure to flaying alive, is that it starts with the assumptions that:\n -you know that the subject \"knows\"\n -that you will know when the subject tells the truth\n \n Once you realize the problem with this, you see that torture will always be unreliable, and this makes its cost-benefit ratio too low to make it acceptable.", 
   {}, 
   179904, 
   null, 
   1132306920.0
  ], 
  [
   180062, 
   null, 
   "Kronus", 
   "\n The basic problem with any torture, from mild pressure to flaying alive, is that it starts with the assumptions that:\n -you know that the subject \"knows\"\n -that you will know when the subject tells the truth\n \n Once you realize the problem with this, you see that torture will always be unreliable, and this makes its cost-benefit ratio too low to make it acceptable.\n\n \n That is, if the point of the torture is to extract information. In Vietnam torture was used to extract confessions. The fact that they were fake was irrelevant, the point was to show broken US soldiers confessing crimes to the masses, strictly for PR purposes. For that, trouture works quite well.", 
   {}, 
   180045, 
   null, 
   1132328760.0
  ], 
  [
   180076, 
   null, 
   "Obvious Child", 
   "How is that a problem? I'd say that's a basic moral concept. I would emphatically say that that's the way it should be.\nSorry, what I mean is that what is acceptable to do to one's own soldiers is varied, and thus so is the treatment of others'. For example, the Japanese would have thought that their own soldiers deserved bad treatment if they surrendered, so they weren't being inconsistent. But what about nations who thought their own soldiers would deserve this treatment if they were terrorists targetting civilians, or infidels trying to destroy the religious community?", 
   {}, 
   179557, 
   null, 
   1132331820.0
  ], 
  [
   180079, 
   null, 
   "Kronus", 
   "Sorry, what I mean is that what is acceptable to do to one's own soldiers is varied, and thus so is the treatment of others'. For example, the Japanese would have thought that their own soldiers deserved bad treatment if they surrendered, so they weren't being inconsistent. But what about nations who thought their own soldiers would deserve this treatment if they were terrorists targetting civilians, or infidels trying to destroy the religious community?\n\n \n I'm just talking about us, us being the US. We believe, at least in theory, that all people are equal. We would expect all of our soldiers to be treated with a certain minimium level of care, and we should treat others the same way. I recognize that not everyone feels that way, but what we do should be based on our standards, not theirs.", 
   {}, 
   180076, 
   null, 
   1132332600.0
  ], 
  [
   180085, 
   null, 
   "Another opinion", 
   "It's the same thing. Physical torture does not make you talk, it breaks your will. Psychological torture achieves the same. It just doesn't leave visible marks. It does leave wounds, though. Deep wounds, and they rarely heal.\n \n The basic problem with any torture, from mild pressure to flaying alive, is that it starts with the assumptions that:\n -you know that the subject \"knows\"\n -that you will know when the subject tells the truth\n \n Once you realize the problem with this, you see that torture will always be unreliable, and this makes its cost-benefit ratio too low to make it acceptable.\nI am getting the impression that the only method that you would condone of getting information out of someone is to ask them nicely. This obviously will not work for almost all situations.\n \n The truth is that there are things that certain POWs or captured enemy combatants know that could help us win the war or, in the case of captured terrorists, help us potentially save thousands of innocent lives. Some simply will not know, and we have to find ways to tell the difference. However, are you suggesting that morallity prohibits us from using any means of getting information out of those we have good reason to think do know information that could save thousands of innocent lives?", 
   {}, 
   180045, 
   null, 
   1132333440.0
  ], 
  [
   180086, 
   null, 
   "georged", 
   "\n The truth is that there are things that certain POWs or captured enemy combatants know that could help us win the war\n\n \n A line combatant with information that would help win or lose a war? That's really reaching a point of desperate rationalization by believing any para-military or military organization would allow strategic information of that nature to be possessed at line level.", 
   {}, 
   180085, 
   null, 
   1132335120.0
  ], 
  [
   180088, 
   null, 
   "Obvious Child", 
   "I'm just talking about us, us being the US. We believe, at least in theory, that all people are equal. We would expect all of our soldiers to be treated with a certain minimium level of care, and we should treat others the same way. I recognize that not everyone feels that way, but what we do should be based on our standards, not theirs.\nOK. My point was that as a principle it wouldn't stop torture by universalisation.\n \n We then have to ask: what about things the US isn't so bothered about, particularly the religious and shame-type issues (female guard seeing male naked, the right to be able to know the time to pray, halal etc.)", 
   {}, 
   180079, 
   null, 
   1132335840.0
  ], 
  [
   180096, 
   null, 
   "Kronus", 
   "OK. My point was that as a principle it wouldn't stop torture by universalisation.\n\n Sure. But I've been primarily addressing what the US should or shouldn't be doing, not how to stop torture in general. My premise has been that our torture policy should be based primarily on what's right and wrong, and not used as a tool to coerce others to act a certain way. In particular, out policy should not be \"if you mistreat our people, then we'll mistreat yours\".\n \n \n\n We then have to ask: what about things the US isn't so bothered about, particularly the religious and shame-type issues (female guard seeing male naked, the right to be able to know the time to pray, halal etc.)\n\n \n Again, how would we want our troops treated? Not the specifics, but in general? We would want our troops to be allowed to follow the basics of their religions, so we should do the same for others. We wouldn't want the basic taboos of our society violated, so we shouldn't do that to others. Of course, maintaining the security of the prison takes priority, so if someones religion involves taking long runs in the woods by themselves, they're SOL.", 
   {}, 
   180088, 
   null, 
   1132337460.0
  ], 
  [
   180103, 
   null, 
   "Another opinion", 
   "A line combatant with information that would help win or lose a war? That's really reaching a point of desperate rationalization by believing any para-military or military organization would allow strategic information of that nature to be possessed at line level.\nThat is why I use the word \"certain\" POWs or enemy combatants (not your average grunt) and I use the word \"help\" win the war, not just win the war. Every useful bit of information helps.", 
   {}, 
   180086, 
   null, 
   1132338480.0
  ], 
  [
   180387, 
   null, 
   "simone", 
   "It's the same thing. Physical torture does not make you talk, it breaks your will. Psychological torture achieves the same. It just doesn't leave visible marks. It does leave wounds, though. Deep wounds, and they rarely heal.\n \n The basic problem with any torture, from mild pressure to flaying alive, is that it starts with the assumptions that:\n -you know that the subject \"knows\"\n -that you will know when the subject tells the truth\n \n Once you realize the problem with this, you see that torture will always be unreliable, and this makes its cost-benefit ratio too low to make it acceptable.\nGad! Iuris, you are so succinct and profound! I think I love you!", 
   {}, 
   180045, 
   null, 
   1132434240.0
  ], 
  [
   180389, 
   null, 
   "simone", 
   "I am getting the impression that the only method that you would condone of getting information out of someone is to ask them nicely. This obviously will not work for almost all situations.\n \n The truth is that there are things that certain POWs or captured enemy combatants know that could help us win the war or, in the case of captured terrorists, help us potentially save thousands of innocent lives. Some simply will not know, and we have to find ways to tell the difference. However, are you suggesting that morallity prohibits us from using any means of getting information out of those we have good reason to think do know information that could save thousands of innocent lives?\nWRONG!! Hmmmm, this sounds a bit like deliberate obtuseness. What do you call that in debate?", 
   {}, 
   180085, 
   null, 
   1132434300.0
  ], 
  [
   180542, 
   null, 
   "Obvious Child", 
   "Again, how would we want our troops treated? Not the specifics, but in general? We would want our troops to be allowed to follow the basics of their religions, so we should do the same for others. We wouldn't want the basic taboos of our society violated, so we shouldn't do that to others. Of course, maintaining the security of the prison takes priority, so if someones religion involves taking long runs in the woods by themselves, they're SOL.\nThis works for you (and me), but assumes that we see our religon and 'basic taboos' as equal to those of others. A Christian might say they don't mind their taboos or religion being violated as such, they just object to unChristian behaviour, or sinful behaviour, which they see as more than a culturally relative concept.", 
   {}, 
   180096, 
   null, 
   1132512180.0
  ], 
  [
   180705, 
   null, 
   "Another opinion", 
   "WRONG!! Hmmmm, this sounds a bit like deliberate obtuseness. What do you call that in debate?\nWhat specifically are you claiming is wrong from my quote, which I repeat below, or do you like making insulting comments with no justification? I believe this forum audience is generally too intelligent to fall for that.\n \nI am getting the impression that the only method that you would condone of getting information out of someone is to ask them nicely. This obviously will not work for almost all situations.\n \n The truth is that there are things that certain POWs or captured enemy combatants know that could help us win the war or, in the case of captured terrorists, help us potentially save thousands of innocent lives. Some simply will not know, and we have to find ways to tell the difference. However, are you suggesting that morallity prohibits us from using any means of getting information out of those we have good reason to think do know information that could save thousands of innocent lives?\n", 
   {}, 
   180389, 
   null, 
   1132603200.0
  ], 
  [
   180716, 
   null, 
   "daewoo", 
   "That is why I use the word \"certain\" POWs or enemy combatants (not your average grunt) and I use the word \"help\" win the war, not just win the war. Every useful bit of information helps.\n\n \n People REALLY need to study the cell based structure these guys are using. It is well documented. \n \n Int he real world, any time somebody is captured, the entire structure morphs. Any information that is older than several hours is worthless. No single individual is likely to know the name of more than 10 operatives anywhere in the organization, including higher officials, and the minute somebody is captured, those who were assopciated with that individual go to ground and are re-integrated somewhere else int he organization.\n \n They played this game with the soviets for years and have it down to a fine art. To believe tehy are pulling any useful information out of these guys is rediculous at best. Anything they do learn is outdated and useless just due to its age, and if htey extracted it under torture is is almost guaranteed that it is compromised. \n \n Our torture facilities are about revenge and attempting to convince the public that the governmetn can and will protect them. In the real world, the government cannot protect us from these people and frankly most of what they ahve tried to date has hurt far more than it could possibly help.\n \n AQ has been run out of Afghanistan due to a large scal war. Now they are underground, spread all over the world, and impossible to infiltrate. This is becuase rather than showing some intelligent restraint and using infiltration tactics and special forces (as we did under clinton) to get top people, we rushed headlong into a full scale war. That was just stupid. Now we have supplied the best training camp any terrorist could ask for in Iraq, so instead of idealistic students we are facing battle hardened soldiers. Our brutality and utter disregard for human rights in pursuing this campaign has cost us the support fo most of the world.", 
   {}, 
   180103, 
   null, 
   1132603920.0
  ], 
  [
   180717, 
   null, 
   "simone", 
   "Originally Posted by Another opinion\n I am getting the impression that the only method that you would condone of getting information out of someone is to ask them nicely. This obviously will not work for almost all situations.\nFirst off, I take umbrage at having words put into my mouth. I can speak very well for myself.\n \n Second off, some very interesting comments have been made by intelligence officers from WWII who found that using kindness and decent care to gain the confidence of possible informatants was far more productive in producing accurate intelligence than torturing and forcing them to say stuff in order to stop the torture.", 
   {}, 
   180705, 
   null, 
   1132603980.0
  ], 
  [
   180725, 
   null, 
   "Another opinion", 
   "Since I suspect that there is some misunderstanding going on with regards to my posts, let me clarify my views:\n \n There are treatments that qualify as torture and treatments that are simply harrassment. Traditional torture involves extreme forms of physical or mental pain. I also do not condone such traditional forms of torture. Harrassment is much milder and include such things as the typical \"good cop - bad cop\" routine used during criminal interrogations. As long as we don't have a bilateral agreement prohibiting such harrassment, I would condone any such milder techniques as long as they are effective and they are used on subjects that we have strong suspicions of knowing useful information. Between those two types of treatment lie a wide range of harsher and less harsh treatments. I don't have a good feeling where to place an ultimate moral line that we do not cross - which is why I was hoping to hear a discussion on such a point.\n \n The great majority of line soldiers in a war don't know much information that is of much use. Perhaps they might know some locations of arms depots, etc. but not many things that we probably don't know otherwise. However, occasionally, an enemy gets captured (either off the line or through covert raids) that we have reason to suspect may know something useful. If that is the case, then I believe we should have the right to interrogate that prisoner, within bounds that are a limited by either bilateral agreement or an ultimate moral boundary (whichever is more lenient).\n \n I was hoping that we could have a discussion here about where to place that ultimate moral boundary but, so far, if I am understanding things correctly, I have been hearing that most of you think that we have no rights to make any interrogation - no matter how lenient. Am I reading that right?", 
   {}, 
   180705, 
   null, 
   1132605420.0
  ], 
  [
   180732, 
   null, 
   "Another opinion", 
   "People REALLY need to study the cell based structure these guys are using. It is well documented. ...\nIn my discussion about torture, I was referring to torture in general - not just in this particular war. As I mentionned in my posts, I believe we need to have reason to know that a particular POW knows something useful. As you mention about these cell structures, they are structured in such a way as to prevent the whole structure from being found-out if one person gets captured. However, I would claim that, even in such an organization, if you find someone high enough, they might have information about, say, a particular terrorist attack that you might then be able to block. \nOur torture facilities are about revenge and attempting to convince the public that the governmetn can and will protect them. In the real world, the government cannot protect us from these people and frankly most of what they ahve tried to date has hurt far more than it could possibly help.\nOnce again, I am not condoning torture. I also was discusted by what I saw at Abu Ghraib. However, I do condone milder techniques of interrogation (such as the \"good cop- bad cop\" technique - assuming that they work). Assuming that we did capture someone we had good reason to think had useful information, what are the limits that you would set on possible interrogation techniques?\n \nAQ has been run out of Afghanistan due to a large scal war. Now they are underground, spread all over the world, and impossible to infiltrate. This is becuase rather than showing some intelligent restraint and using infiltration tactics and special forces (as we did under clinton) to get top people, we rushed headlong into a full scale war. That was just stupid. Now we have supplied the best training camp any terrorist could ask for in Iraq, so instead of idealistic students we are facing battle hardened soldiers. Our brutality and utter disregard for human rights in pursuing this campaign has cost us the support fo most of the world.\nI also agree that we should never have gone into Iraq for most of the reasons you mentionned. However, once the mistake is made, it is made and one cannot undo it. One simply has to decide what is the best course to take from here. I have major concerns that, if we suddenly abandon Iraq and leave, it will lead to a civil war that would be far bloodier than anything we have seen. If we stay long enough to let Iraqi forces get strong enough to hold off the insurgents on their own, then at least it might prevent a civil war. How do-able that is, and whether we are approaching that task in the right way are certainly debateable.\n \nFirst off, I take umbrage at having words put into my mouth. I can speak very well for myself.\nMy post (#22) was in answer to Iuris, not to you, so I have no idea why you are taking any umbrage. As for Iuris, I had gotten the impression that Iuris was unwilling to do any interrogation based on his/her post (#18), which criticizes even mild interrogation techniques. It did not come out of the blue.", 
   {}, 
   180716, 
   null, 
   1132607760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A question of torture", 
  "url": "http://www.4forums.com/political/politics-debates/6842-question-torture.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 6842, 
  "discussion_files": [
   [
    "28753.html", 
    "http://www.4forums.com/political/politics-debates/6842-question-torture-print.html"
   ], 
   [
    "28754.html", 
    "http://www.4forums.com/political/politics-debates/6842-question-torture-3-print.html"
   ], 
   [
    "28755.html", 
    "http://www.4forums.com/political/politics-debates/6842-question-torture-2-print.html"
   ]
  ], 
  "identifier": 6842
 }
]