[
 [
  [
   179676, 
   null, 
   "Ooaman", 
   "I was watching the news yesterday and they said that a possible cure for the bird flu could be found in sauerkrautemoticon_ic (or as they are calling it, Powerkraut.) Does this seem acurate? Are there any pro or con ideas on this or does it just seem like a ploy to get people who, like me, revolt at the site of sauerkraut, to want to buy sauerkraut?", 
   {
    "post_info": {
     "post_title": "Cure for the Bird Flu?"
    }
   }, 
   null, 
   null, 
   1132164540.0
  ], 
  [
   179680, 
   null, 
   "Kronus", 
   "I was watching the news yesterday and they said that a possible cure for the bird flu could be found in sauerkrautemoticon_ic (or as they are calling it, Powerkraut.) Does this seem acurate? Are there any pro or con ideas on this or does it just seem like a ploy to get people who, like me, revolt at the site of sauerkraut, to want to buy sauerkraut?\n\n \n Since the bird flu has not yet mutated into a form that can spread easily through humans, it's a little premature to claim that a cure has been found. And whatever the cure is, it won't be sauerkraut. I suppose that it's possible that sauerkraut could bolster your immune system so that you're less likely to catch the flu, or it could do something to ease the symptoms, but that's not the same as curing it.", 
   {}, 
   179676, 
   null, 
   1132166040.0
  ], 
  [
   179733, 
   null, 
   "Truthsayer", 
   "I heard it was discovered by some doctor who fed infected fowl a Korean alcoholic product that is derived from cabbage much like sauerkraut is. 90% of the fowl recovered within days. Maybe they are on to something. Just don't forget to take some Beano with it.:p\n \n They will change the name from the bird flu to the fart flu.", 
   {}, 
   179680, 
   null, 
   1132177560.0
  ], 
  [
   179770, 
   null, 
   "Kronus", 
   "I heard it was discovered by some doctor who fed infected fowl a Korean alcoholic product that is derived from cabbage much like sauerkraut is. 90% of the fowl recovered within days. Maybe they are on to something. Just don't forget to take some Beano with it.:p\n \n They will change the name from the bird flu to the fart flu.\n\n \n You're probably thinking of Kimchi, Korean fermented cabbage. I remain skeptical. :)", 
   {}, 
   179733, 
   null, 
   1132183560.0
  ], 
  [
   179829, 
   null, 
   "Ooaman", 
   "Okay, here is a website about it...\n \n \n Bird Flu Cure?\n \n Does this help with explaining this?", 
   {}, 
   179770, 
   null, 
   1132199700.0
  ], 
  [
   179879, 
   null, 
   "Kronus", 
   "Okay, here is a website about it...\n \n \n Bird Flu Cure?\n \n Does this help with explaining this?\n\n \n From the article: \"Prof Kang's team claims that lactobacillus, the lactic acid bacteria created during the fermenting process, is the active ingredient that could combat bird flu.\"\n \n This is one of the reasons I hate popular science articles. The bacteria isn't reated during fermentation, it's probably one of the things that causes fermentation. That's biology 101, and the editor missed it. What else in the article is completely wrong?\n \n That having been said, I'm still skeptical. Your stomach is very good at killing bacteria; it seems unlikely that eating something with some bacteria on it would allow the bacteria to get into your blood and fight a virus. If anything is happening I would guess that the vitamins and minerals in sauerkraut or kimchi are boosting the immune system. Which means you should be able to get the same effect from eating other veggies, if you can't stand sauerkraut.", 
   {}, 
   179829, 
   null, 
   1132242900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cure for the Bird Flu?", 
  "url": "http://www.4forums.com/political/health-debates/6862-cure-bird-flu.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 6862, 
  "discussion_files": [
   [
    "21473.html", 
    "http://www.4forums.com/political/health-debates/6862-cure-bird-flu-print.html"
   ]
  ], 
  "identifier": 6862
 }
]