[
 [
  [
   9583, 
   null, 
   "grayhawk", 
   "Legal gun ownership leads to a lower or higher crime rate? Your opinons please...", 
   {
    "post_info": {
     "post_title": "Gun ownership / crime"
    }
   }, 
   null, 
   null, 
   1055485140.0
  ], 
  [
   9637, 
   null, 
   "SilentPoet", 
   "I don't have any facts or a really based opinion on this, but I don't see that there is any way that \"Legal gun ownership \" could possibly lead to a lower crime rate.\n Anyone care to elaborate?\n \n Always Stay Open Minded", 
   {}, 
   9583, 
   null, 
   1055534700.0
  ], 
  [
   9638, 
   null, 
   "Burnout", 
   "Illegalizing guns may lead to the same response of illegal drugs. People will still get them, it will just be another addition to the black market.", 
   {}, 
   9583, 
   null, 
   1055535600.0
  ], 
  [
   9641, 
   null, 
   "SilentPoet", 
   "\"Illegalizing guns may lead to the same response of illegal drugs. People will still get them, it will just be another addition to the black market.\"\n \n - Illegalizing guns would be an addition to the black market, I agree. Although illegalizing them would decline their availability.\n If drugs such as weed were legal, there would be alot more usage of them. Same concept for guns...\n \n Once again could anyone explain to me how \"Legal gun ownership \" could possibly decrease crime?\n \n Always Stay Open Minded", 
   {}, 
   9583, 
   null, 
   1055538240.0
  ], 
  [
   9707, 
   null, 
   "wjim1269", 
   "\"Illegalizing guns would be an addition to the black market, I agree. Although illegalizing them would decline their availability.\"\n \n I haven't seen anyone who has had a hard time getting drugs. The same will take place with gun control. Those who are law-abiding citizens will turn in their guns, yet the criminals will still have access.\n \n Not only will the criminals still have access to guns, but they will also have the added knowledge that either the person they intend to rob does not have a gun or they are breaking the law. The chances of the latter are small, so they know that they would have more power over that person in the case of a challenge during the crime.", 
   {}, 
   9583, 
   null, 
   1055557500.0
  ], 
  [
   9732, 
   null, 
   "kelvin90701", 
   "Originally posted by grayhawk \n Legal gun ownership leads to a lower or higher crime rate? Your opinons please... \n \n \n There is no evidence either way. Except in one case. A Department of Justsice study, somewhere in an earlier disscussion clearly shows that officers in uniform and on duty experience a lower murder rate by assault rifles after the ban. Every other group examined did not experience a lowered murder rate with assault rifles.\n \n With other guns? Everything else is uncertain, pick a source, I am sure you can support any arguement you want. By then why pass laws based on uncertainty and poor evidence?", 
   {
    "post_info": {
     "post_title": "Re: Gun ownership / crime"
    }
   }, 
   9583, 
   null, 
   1055570760.0
  ], 
  [
   9740, 
   null, 
   "grayhawk", 
   "I agree you can find whatever side of this argument you choose, but I was wondering about your personal opinion. I've heard the arguments, read the books, but was wondering about general concensus. In your mind, do YOU feel that legal gun ownership deters crime, in your opinion or by your reasoning, why do you feel this way?", 
   {}, 
   9583, 
   null, 
   1055580660.0
  ], 
  [
   9741, 
   null, 
   "Patriot", 
   "Guns are already legal... so let's not start this discussion by making it sound like the status quo is no guns.\n \n I believe that widespread gun ownership deters crime. The L.A. Times ran a story where someone took a poll of criminals incarcerated in prisons across the country. They all concured that they did not break in to homes when the occupants were there because they feared getting shot. Therefore, it is more deterrance than anything else. If someone knows that they could get killed for committing a crime, I'm sure that would make them think twice.", 
   {}, 
   9583, 
   null, 
   1055607420.0
  ], 
  [
   9742, 
   null, 
   "kelvin90701", 
   "Originally posted by grayhawk \n I agree you can find whatever side of this argument you choose, but I was wondering about your personal opinion. I've heard the arguments, read the books, but was wondering about general concensus. In your mind, do YOU feel that legal gun ownership deters crime, in your opinion or by your reasoning, why do you feel this way? \n \n \n I don't have any feelings about it. I KNOW that there is no proof that gun ownership or gun bans deter crime. There is no proof either way. There is proof in one single case: assault rifles as stated above, and the benefit was extremely marginal.\n \n The status quo right now is the legal ownership of firearms. So when I hear someone say that taking guns off the streat will reduce crime I know they are taking out of thier a**. So someone who want to take my guns is really just guessing that gun bans will reduce crime.\n \n I also know that crime and gun crimes are strongly associated with the same factors for violence. Again there are more quoted studies on other threads. Gun crime has more to do with poverty, education, employment, family stability, etc.\n \n \"Criminologists first noticed the trend late last year when the sluggish economy sent the Big Apple's jobless rate soaring to its highest level in a decade. But hold-ups have tripled this year and now happen as often as three or four times a day\". -AP", 
   {}, 
   9583, 
   null, 
   1055607600.0
  ], 
  [
   9852, 
   null, 
   "Patriot", 
   "Please, Kelvin, profanity isn't going to get us anywhere, and indeed will probably do your cause harm. We are trying to convince these guys, not alienate them.", 
   {}, 
   9583, 
   null, 
   1055717340.0
  ], 
  [
   9913, 
   null, 
   "kelvin90701", 
   "Originally posted by grayhawk \n I agree you can find whatever side of this argument you choose, but I was wondering about your personal opinion. I've heard the arguments, read the books, but was wondering about general concensus. In your mind, do YOU feel that legal gun ownership deters crime, in your opinion or by your reasoning, why do you feel this way? \n\n \n Sorry, I am not talking about opinion or feelings. I KNOW there is no definative evidence that supports that gun control or guns deter crime. When you are asking me about my feelings on the subject you are asking me to guess and make suppositions on the subject. I am not guessing, I KNOW there is no evidence either way, except for one case: assault rifle ban has made the streets safer for uniformed police officers, but for no one else.", 
   {}, 
   9583, 
   null, 
   1055742300.0
  ], 
  [
   9914, 
   null, 
   "kelvin90701", 
   "[QUOTE]Originally posted by Patriot \n Please, Kelvin, profanity isn't going to get us anywhere, and indeed will probably do your cause harm. We are trying to convince these guys, not alienate them. [/QUOT\n \n Oh sorry!", 
   {}, 
   9583, 
   null, 
   1055742600.0
  ], 
  [
   10070, 
   null, 
   "voiceofreason", 
   "There is lots of evidence that shows that more guns means more homicide. This is because guns make it easier for people to kill each other. The International Crime Victim Survey found a strong positive correlation between gun ownership and homicide and suicide rates. I've also seen other studies that support this. I don't know about other crimes, but lack of gun-control means more homicides.", 
   {}, 
   9583, 
   null, 
   1055830140.0
  ], 
  [
   10072, 
   null, 
   "grayhawk", 
   "There is lots of evidence that shows that more guns means more homicide. This is because guns make it easier for people to kill each other. \n \n \n That's why I said legal gun ownership, and not stolen gun ownership, or illegal gun ownership (felons possessing firearms etc). \n I personally believe that gun onwership among the populous deters crime. No, there is no evidence to suppot it, but if you realistically think about it, would a criminal looking for an easy mark go after someone who is armed, or a home that i known to be armed? I just don't see it. I was just wondering what the concensus was. \n I don't know that a debate will change a mind one way or another, like voice of reason's post isn't going to change my mind, or make me give up my guns, and I'd rather eat my hat and my gun case than ever support gun control. I was just wondering how people felt and why they felt that way.", 
   {}, 
   9583, 
   null, 
   1055831280.0
  ], 
  [
   10076, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n There is lots of evidence that shows that more guns means more homicide. This is because guns make it easier for people to kill each other. The International Crime Victim Survey found a strong positive correlation between gun ownership and homicide and suicide rates. I've also seen other studies that support this. I don't know about other crimes, but lack of gun-control means more homicides. \n \n \n Can you help me find the source? So I may review it? year? page number, link, etc would be helpful.\n \n \n You know as well as I do, that sources on both sides are debateable. Medical journals (JAMA NEJM etc) valid sources, are not the final story. Even amoung medical researchers in cancer, AIDs, etc, studies are debabated to the nth degree. The same of JAMA and NEJM research into gun crimes. From my memory your medical references both showed the trend you state, but they were also limited in geography and sample (two cities), and provided no casue and effect, merely a curious relationship in the numbers.", 
   {}, 
   9583, 
   null, 
   1055833680.0
  ], 
  [
   10194, 
   null, 
   "voiceofreason", 
   "Originally posted by kelvin90701 \n From my memory your medical references both showed the trend you state, but they were also limited in geography and sample (two cities), and provided no casue and effect, merely a curious relationship in the numbers. \n \n Well let's deal with one thing at a time. The NEJM study about Washington D.C. concluded that banning handguns saved 47 lives each year. The study didn't conclude that it was just a \"curious relationship in the numbers.\" Go back to that thread and read the study. \n \n If you're looking for evidence that is absolutely without any degree of uncertainty then you won't find it. You can't prove things to a 100% certainty with statistics. What you can do is show what is probably true and what is probably not true. Even in court you're not expected to prove that someone is guilty to a 100% certainty. You're expected to prove that they are guilty beyond a reasonable doubt.", 
   {}, 
   9583, 
   null, 
   1055920980.0
  ], 
  [
   10295, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n Well let's deal with one thing at a time. The NEJM study about Washington D.C. concluded that banning handguns saved 47 lives each year. The study didn't conclude that it was just a \"curious relationship in the numbers.\" Go back to that thread and read the study. \n \n \n \n That is fine for D.C. The statistics are limited by the sample. It can not be applied to the rest of the country. We should never base public policy on incomplete science.\n \n NEJM is a medical journal. Doctors would be horrified by the sample if this was a protocall for a medical procedure. You don't perscribe a drug is good for everyone when you test it only on eskimo men between the age of 18-40. With such a very small sample, then why is \"gun control procedure\" good medicine for the rest of the country? It is not.", 
   {}, 
   9583, 
   null, 
   1056008100.0
  ], 
  [
   10720, 
   null, 
   "voiceofreason", 
   "This study wasn't limited to Washington D.C. \n http://content.nejm.org/cgi/content/short/329/15/1084\n \n It found that guns kept in the home were associated with an increased risk of homicide.", 
   {}, 
   9583, 
   null, 
   1056459420.0
  ], 
  [
   10721, 
   null, 
   "voiceofreason", 
   "Originally posted by kelvin90701 \n \n You are right that gun bans do reduce homicide rates, but it does not protect people who are not killed by guns. They still get killed anyhow. \n \n\n You agreed with me before. http://www.youdebate.com/vBulletin/showthread.php/s//threadid/518/perpage/15/pagenumber/4", 
   {}, 
   9583, 
   null, 
   1056459720.0
  ], 
  [
   10831, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n This study wasn't limited to Washington D.C. \n http://content.nejm.org/cgi/content/short/329/15/1084\n \n It found that guns kept in the home were associated with an increased risk of homicide. \n \n \n I don't not question that risk. I am familiar with the associated risk, but I have made a very deliberate and informed decision to accept the risk. I am not asking someone to stop me from taking the risk. I have made the informed decision to accept it. I am deathly afraid that I will kill a loved one by accident, but I have not asked to government nor do I expect the government to protect me from myself. It is my own personal responsbility.", 
   {}, 
   9583, 
   null, 
   1056512820.0
  ], 
  [
   10833, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n You agreed with me before. http://www.youdebate.com/vBulletin/showthread.php/s//threadid/518/perpage/15/pagenumber/4 \n \n \n Sorry I don't understand your point.", 
   {}, 
   9583, 
   null, 
   1056513480.0
  ], 
  [
   12289, 
   null, 
   "JMorse39", 
   "I think legal ownership has nothing to do with the crime rate. Usually it is the upstanding citizen that goes out and purchases the weapon legally, whereas the everyday criminal is either going to steal or buy the weapon on the streets. The only thing that registering the weapon does is let law enforcement know that an individual owns a weapon and the registration verifies that the purchaser is not a known criminal or mental patient.", 
   {}, 
   9583, 
   null, 
   1059363000.0
  ], 
  [
   12303, 
   null, 
   "kelvin90701", 
   "I think legal ownership has nothing to do with the crime rate. Usually it is the upstanding citizen that goes out and purchases the weapon legally, whereas the everyday criminal is either going to steal or buy the weapon on the streets. The only thing that registering the weapon does is let law enforcement know that an individual owns a weapon and the registration verifies that the purchaser is not a known criminal or mental patient.\n\n \n Sorry, but without a doubt there is a correlation with gun availibility and gun crime. There is also a without a doubt a correlation of guns and violent crime, BUT GUNS DO NOT CAUSE CRIME. No one has proven it. There may be a statistical relationship, but guns are not the root cause of crime. The root causes of crime, gun crime, and violent crime are:\n \n 1) Poverty\n 2) Family stability\n 3) Education\n 4) Hoplessness\n 5) A poor economy\n 6) Violence\n \n From what I heave learned here, anti-gunners can rationalize that these are the root causes of murder and violent crime. You know what? Even though they can accept that these are the root causes of crime, THEY STILL WANT ALL THE GUNS!", 
   {}, 
   12289, 
   null, 
   1059449040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gun ownership / crime", 
  "url": "http://www.4forums.com/political/gun-control-debates/687-gun-ownership-crime.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 687, 
  "discussion_files": [
   [
    "24161.html", 
    "http://www.4forums.com/political/gun-control-debates/687-gun-ownership-crime-print.html"
   ], 
   [
    "24162.html", 
    "http://www.4forums.com/political/gun-control-debates/687-gun-ownership-crime-2-print.html"
   ]
  ], 
  "identifier": 687
 }
]