[
 [
  [
   9592, 
   null, 
   "undercoverbro", 
   "hemp is not a harmful drug it's bad nickname of being called weed is not true you could smoke a whole feild of hemp and get away with less than a head ache. hemp can be used for so many things such as paper and clothing and rope and even to the most radicalk state it can be made into a house if you dont believe me read the book \"the house made by hemp\" in this book it explains that hemp is so useful that it can be made in to almost anything. the hemp industry was shut down because off the manufacturing of nylon rope, the hemp industry was then illegalized and has stayed that way ever since.\n \n so if you havnt already gotten my side of the matter i do beleive that hemp should me leagle", 
   {
    "post_info": {
     "post_title": "should we use hemp as a main stable in the U.S.?"
    }
   }, 
   null, 
   null, 
   1055488680.0
  ], 
  [
   9606, 
   null, 
   "undercoverbro", 
   "please if you plan on replying try to take a look a both sides and please forgive my spellingemoticon_xbouncer :) :)", 
   {}, 
   9592, 
   null, 
   1055489880.0
  ], 
  [
   9608, 
   null, 
   "gilligan8503", 
   "you haven't said that much and what you have said was blown out of proportion.\n \n you cannot overdose on maijuana; you would pass out before you do that.\n \n marijuana is not as nearly as bad as alcohol. when 'stoned', one does know what he or she is doing; alcohol, no. when 'stoned' one will not become agressive, one will become euphoric and calm; alcohol, no.\n \n there are many misconceptions about this drug. the only reason it is so feared in america is because it is illegal. but do you know why it was made illegal? because they said it makes you 'violent and go insane' and, infact, it does only the opposite.\n \n i really wish this post could continue and i especially wish that ones opposing this would speak out. i will rebuttle.", 
   {}, 
   9592, 
   null, 
   1055490000.0
  ], 
  [
   9612, 
   null, 
   "undercoverbro", 
   "i am not talking about weed i am talking about hemp which are two totally diffrent things hemp is the plant that is used to make \"weed\" but it is nopt weed it self i am talking about legalizing hemp i do also think that legalizing \"weed\" would be a good idea also.\n \n thanx for comment please reply again", 
   {}, 
   9592, 
   null, 
   1055490420.0
  ], 
  [
   9614, 
   null, 
   "gilligan8503", 
   "i assumed you were talking about the entire plant in general due to your statement on 'smoking a field and getting a headache'. on the hemp, i never knew that was illegal... i am sold or given hemp stuff all the time.", 
   {}, 
   9592, 
   null, 
   1055490600.0
  ], 
  [
   9615, 
   null, 
   "undercoverbro", 
   "all i am saying is that hemp should be used more often it is not allowed to be grown wildley in feilds or large amounts", 
   {}, 
   9592, 
   null, 
   1055490840.0
  ], 
  [
   11703, 
   null, 
   "skylinedesire", 
   "the best responce to the pot argument ive ever heard ( sorry im straying from hemp) if it were legal (which I wish it was) the government couldnt make money on it, seriously though how many people would buy govt taxed pot when they could just grow their own. less harmfull than alcohol but less money go figure?", 
   {
    "post_info": {
     "post_title": "food for thought"
    }
   }, 
   9615, 
   null, 
   1057765680.0
  ], 
  [
   23055, 
   null, 
   "superbuddhaman", 
   "Did you know- Cannabis has the distinction of being the plant with the longest shared history with man? It has been so changed by horticulture that is has no close relatives? That this plant (aside from providing a nice buzz) is a source for rope, cloth, oils, nutrients, fuel, medicine, and about a million other uses? That its fibers are stronger and longer than any other natural fiber, making it a prime candidate for papers and fabrics? That it's oil burns hotter and cleaner than any other natural oil - that includes petroleum. That its medicinal properties are so numerous I won't even bother here. That the first flag was made of hemp, and that the Declaration of Independence and the Constitution were drafted on hemp paper? That the writers of said documents owned plantations that grew hemp?\n Why is Marijuana illegal? The prison industry. Over 70% of prison inmates are there for drug offenses, over 80% of those are marijuana related crimes. Does the prison make more from the inmate over a ten year sentence than the government would if they legalized and taxed it? Probably. Besides all the ridiculous propaganda published in the early years( You have to see 'The Burning Question' and 'Reefer Madness') that convinced americans that their teenaged daughters would go out, smoke some pot, get raped, then jump off a building. \n Ok- why is hemp illegal? Easy... the cotton industry. During the years of WW2 (and before) hemp was used to a great extent in the military, especially by the navy. There was a time when every rope, every net, every piece of rigging was made from hemp. In fact, the government condoned the growing of hemp during the war years to the extent that it paid farmers twice it's worth for growing it. The saddest thing about it is that hemp is a much better fiber than cotton. When wet it contracts, making it even stronger. It is a very simple plant, happy to grow pretty much anywhere, not subject to the climate restrictions of cotton. It doesn't deplete the soil as cotton does either. It has a renewable harvest of at least three times a year. \n It is truly a renewable resource. In this day when we are using up our resources at an astounding rate (how many acres of rainforest a day are we up to?) we seriously need to rethink our options. \n So why is it illegal again? Well, just think of the repercussions if it were made legal... and of course used for all these purposes. The cotton industry would be left in the cold, seeing as how a t-shirt made from hemp would last years longer. It would destroy the paper industry, wood mills would shut down left and right, (hey, my grandkids might actually see a forest someday!) The oil industry would collapse. We wouldn't need to bomb other countries for their oil anymore!\n Of course this is about hemp, not marijuana, so I'll not give you a long discourse on the medical properties, but they are endless, and they are wonderful.\n Several states have made industrial hemp legal, including Hawaii, Colorado, and Wisonsin... but the problem is the severe restriction regarding both it's growth (12 foot electrified fences and regular patrol) and it's sale. And of course, there aren't many cars that run on hemp oil, there aren't many paper mills in the market for hemp fiber, there aren't even any domestic plants that make the fabric (last I knew)\n And so another problem is revealed in that we would have to revamp entire industries to make way for a better product........\n lets all cross our fingers for progress", 
   {}, 
   11703, 
   null, 
   1069164000.0
  ], 
  [
   23056, 
   null, 
   "superbuddhaman", 
   "i am not talking about weed i am talking about hemp which are two totally diffrent things hemp is the plant that is used to make \"weed\" but it is nopt weed it self i am talking about legalizing hemp i do also think that legalizing \"weed\" would be a good idea also.\n \n thanx for comment please reply again\n\n \n sorry, but the difference is simple, its either male or female. the female plants carry the THC (tetra-hydo-cannabinol) that gets you stoned. They take a nice female plant, take it to the greenhouse, mess with it a bit to produce more THC, and then sell it to you for a hefty price.", 
   {}, 
   9612, 
   null, 
   1069164120.0
  ], 
  [
   53776, 
   null, 
   "weasel fierce", 
   "Extended use of weed can have side effects, in drastically reducing your capacity for learning and innovation.\n \n However, I do believe that it should be legalized, and then taxed heavily. Would make an excellent source of income for the state.\n \n It works fine in Holland so why not elsewhere", 
   {}, 
   23056, 
   null, 
   1087164960.0
  ], 
  [
   53864, 
   null, 
   "Tastyfish", 
   "Didn't some recent studies also show that it could possibly lead to the devolpment of psychosis in some people.\n \n Anyway, is hemp actually illegal? Pretty sure that there was industrial hemp farms on one of the hawaiian islands, quite a few things made fun of it being there. Or are these just experimental schemes?", 
   {}, 
   53776, 
   null, 
   1087232400.0
  ], 
  [
   58472, 
   null, 
   "a12timus", 
   "Well hemp is legal to buy and sell in the UNited States, it is just illegal to be growing/cultivating it here in the US. Has anyone ever seen the documentary on marijuana on the history channel? It shows the history of it in America, how it was mainly made illegal to try n keep Mexicans from coming here.", 
   {}, 
   53864, 
   null, 
   1090009680.0
  ], 
  [
   58538, 
   null, 
   "apathy", 
   "Extended use of weed can have side effects, in drastically reducing your capacity for learning and innovation.\n\n \n Depends on what \"study\" you believe.\n http://content.health.msn.com/content/article/70/80972.htm\n http://www.geocities.com/medicalmarijuana2003/fact07.htm\n http://www.erowid.org/plants/cannabis/cannabis_myth.shtml\n http://www.nida.nih.gov/Infofax/marijuana.html\n http://www.newscientist.com/news/news.jsp?id=ns99993543", 
   {}, 
   53776, 
   null, 
   1090026060.0
  ], 
  [
   58601, 
   null, 
   "Duo_Maxwell", 
   "I thought the main reason why hemp was banned was because it looks virtually identical to weed, and therefore made law enforcement a serious pain the butt, so it was simply easier to ban both species of plants and remove a tedious and fruitless job off the backs of law enforcement officers everywhere. \n \n So essentially the argument is, hemp looks like weed, and it's a pain to make sure they aren't growing pot. To make life easy, ban both. \n \n Tastyfish: Alledgedly Hawaiian \"weed\" is horrible. I believe they buy something similar from Asia, repack it and then sell it.", 
   {}, 
   58538, 
   null, 
   1090058340.0
  ], 
  [
   58714, 
   null, 
   "Tastyfish", 
   "I thought Hemp was the same plant but grown via cuttings/runners or whatever while weed requires sexual reproduction (is the female sections of the plant or something)", 
   {}, 
   58601, 
   null, 
   1090193820.0
  ], 
  [
   58737, 
   null, 
   "Duo_Maxwell", 
   "two different species. \n \n hemp is cannabis sativa, while marijuana is cannabis indica\n \n Sorry, can't find anything else.", 
   {}, 
   58714, 
   null, 
   1090201020.0
  ], 
  [
   58761, 
   null, 
   "a12timus", 
   "'During the period from 1937 to the late 60's the US government understood and acknowledged that Industrial Hemp and Marijuana were distinct varieties of the cannabis plant. Hemp is no longer recognized as distinct from marijuana since the passage of the Contolled Substances Act of 1970. This is despite the fact that a specific exemption for Hemp was incuded in the CSA under definition of marijuana.'", 
   {}, 
   58714, 
   null, 
   1090223460.0
  ], 
  [
   58848, 
   null, 
   "apathy", 
   "indica is justas smokable as sativa, it's actually got more thc\n if you buy a bag from your guy down the street, 99% chance it'll be sativa, not indica\n \n indo for you snoop dogg fans out there!\n \n but cheech and chong would know it better as oaxaca (whahaka) named after the state in mexico (or named for the same thing i dunno)", 
   {}, 
   58761, 
   null, 
   1090271700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  should we use hemp as a main stable in the U.S.?", 
  "url": "http://www.4forums.com/political/health-debates/688-should-we-use-hemp-main-stable-u-s.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 688, 
  "discussion_files": [
   [
    "21271.html", 
    "http://www.4forums.com/political/health-debates/688-should-we-use-hemp-main-stable-u-s-print.html"
   ], 
   [
    "21272.html", 
    "http://www.4forums.com/political/health-debates/688-should-we-use-hemp-main-stable-u-s-2-print.html"
   ]
  ], 
  "identifier": 688
 }
]