[
 [
  [
   180210, 
   null, 
   "Bassman", 
   "Just when you thought it couldn't get any wierder, get a load of this: \n \n http://caselaw.lp.findlaw.com/data2/circs/9th/0356499p.pdf\n \n It seems that our friends on the 9th circus emoticon_xclown just don't get it. It's not just about \"sex surveys,\" as it is about parental control. What do you think?", 
   {
    "post_info": {
     "post_title": "Ninth Circus at it Again!!"
    }
   }, 
   null, 
   null, 
   1132361520.0
  ], 
  [
   180291, 
   null, 
   "Bassman", 
   "Now do you see why we need to reign in the courts?", 
   {}, 
   180210, 
   null, 
   1132411140.0
  ], 
  [
   180305, 
   null, 
   "georged", 
   "You're one of those who complains the loudest about poor quality of public education. \n \n The survey's intent is to discover existing psychological barriers contributing to slow learning abilities in those age groups, what anyone not hindered by a personal belief or lack of education would consider sound, progressive educational research. \n \n As to the sexual nature of some questions, everything I've read and heard on sex education states it should take place a minimum of two years, up to five in many children depending on their displayed level of maturity, before sexual fantasies, feelings and other signs of developing sexuality enter a child's life. That many parents, generally due to plain old ignorance, avoid those issues until children experience sexual confusion is just another example of poor parenting contributing to general learning barriers. \n \n If those parents in the complaint feel, for whatever reason, that surveys of that nature conflict with their religious values (why sex education would conflict with any belief is beyond my comprehension), why don't they place those children in a private school with a curriculum they consider suitable or, if funds are an issue home school them and let the rest of the world move forward?", 
   {}, 
   180291, 
   null, 
   1132416840.0
  ], 
  [
   180325, 
   null, 
   "Sigma", 
   "Bassman, I find it amusing that you get all your talking points from the Rush Limbaugh show. Even the term \"9th circus\" was on his program.\n \n He's deceptive and certainly will not give you all the facts of an issue, I would suggest you do not take what he says at face value (to say the least).", 
   {}, 
   180305, 
   null, 
   1132423980.0
  ], 
  [
   180327, 
   null, 
   "joebrummer", 
   "Just when you thought it couldn't get any wierder, get a load of this: \n \n http://caselaw.lp.findlaw.com/data2/circs/9th/0356499p.pdf\n \n It seems that our friends on the 9th circus emoticon_xclown just don't get it. It's not just about \"sex surveys,\" as it is about parental control. What do you think?\n\n \n \n How are we ever going to learn about children's mental health if we do not explore it! The survey is hardly offensive. There is nothing in it the HS age kids haven't heard in the locker room. It is anti-intelliectual not be against learning and exploring. Survey's are hardly going to damage kids, make them do something they wouldn't. or traumatize them.\n \n What is your objection to the survey.", 
   {}, 
   180210, 
   null, 
   1132424340.0
  ], 
  [
   180333, 
   null, 
   "Bassman", 
   "My two primary objections are that the survey is being given to first, third and fifth graders. It is highly inappropriate for a six-year-old to be asked questions about sex! My other objection is that once again, the school district is thumbing their collective noses at the parents. BTW, in this case, ninth circus is very appropriate.", 
   {}, 
   180327, 
   null, 
   1132425060.0
  ], 
  [
   180337, 
   null, 
   "joebrummer", 
   "My two primary objections are that the survey is being given to first, third and fifth graders. It is highly inappropriate for a six-year-old to be asked questions about sex! My other objection is that once again, the school district is thumbing their collective noses at the parents. BTW, in this case, ninth circus is very appropriate.\n\n \n \n How else will we learn about the sexual mind if we do not study it? Would you rather we assume what kids are thinking or should we find the truth.", 
   {}, 
   180333, 
   null, 
   1132425300.0
  ], 
  [
   180340, 
   null, 
   "Bassman", 
   "How else will we learn about the sexual mind if we do not study it? Would you rather we assume what kids are thinking or should we find the truth.\n\n Children at that age have an innocence that shouldn't be shattered for the sake of \"studies in sexuality.\" Reason being is they have neither the capacity, nor the intellect to understand sexuality that early. My primary gripe is over the issue of parental control, thus reasserting my contention that it is the parent's primary role in the education of children, not the education \"establishment.\"", 
   {}, 
   180337, 
   null, 
   1132426020.0
  ], 
  [
   180342, 
   null, 
   "Ooaman", 
   "I'm not too sure of the issue here. When I was in 4th grade, we did that whole thing where the boys went in one classroom and the girls went in another to watch \"the film.\" And then the same thing was done again in the 6th grade but I don't recall a film then. I believe that this mainly started because it is about the age of 10 when girls start to mature and then a couple or so years later for guys. It also started because many parents felt uncomfortable talking with their children about it.\n We also know that all sorts of mental disorders that happen later in life (sexual or otherwise) usually get their start in children. Most of the time (especially if you asked a Freudian) it is based upon the child and some kind of sexual experience as a child. Now if finding this kind of stuff out while they are children and having the possibility of slowing down or halting a mental disorder, then I don't know what the problem is.\n So are one of these hitting the issue, or did I miss something?", 
   {}, 
   180337, 
   null, 
   1132426500.0
  ], 
  [
   180345, 
   null, 
   "Bassman", 
   "As stated ad nauseum, the issue is parental control and oversight over the content of the curricula of the schools. Schools should not have a suuposed \"right\" nor ability to circumvent parental authority.", 
   {}, 
   180342, 
   null, 
   1132426800.0
  ], 
  [
   180348, 
   null, 
   "Ooaman", 
   "As stated ad nauseum, the issue is parental control and oversight over the content of the curricula of the schools. Schools should not have a suuposed \"right\" nor ability to circumvent parental authority.\n\n But if you send your children to a public school, doesn't that suggest the \"right\" to teach what they need to learn? I mean, if you have to make sure the teachers only teach what you want your children to know, wouldn't it be better to just home school them?", 
   {}, 
   180345, 
   null, 
   1132427220.0
  ], 
  [
   180350, 
   null, 
   "Bassman", 
   "But if you send your children to a public school, doesn't that suggest the \"right\" to teach what they need to learn? I mean, if you have to make sure the teachers only teach what you want your children to know, wouldn't it be better to just home school them?\n\n Over the past 50 years, public school \"education\" has declined to a point where parental oversight is necessary. This is also why I support alternatives to the education \"establishment.\" When you get to a point where showing a class how to put a condom on a banana is more important than the three \"R's\" then something is seriously wrong.", 
   {}, 
   180348, 
   null, 
   1132427640.0
  ], 
  [
   180351, 
   null, 
   "georged", 
   "Children at that age have an innocence that shouldn't be shattered for the sake of \"studies in sexuality.\" Reason being is they have neither the capacity, nor the intellect to understand sexuality that early. My primary gripe is over the issue of parental control, thus reasserting my contention that it is the parent's primary role in the education of children, not the education \"establishment.\"\n\n \n You're taking the position individual parents are better qualified to judge the capability of a child regarding learning capacity than are educated researchers who have experience with hundreds and thousands of children? And discarding conventional wisdom that a child's formative years are the basis for that child's later years?", 
   {}, 
   180340, 
   null, 
   1132427640.0
  ], 
  [
   180353, 
   null, 
   "Bassman", 
   "You're taking the position individual parents are better qualified to judge the capability of a child regarding learning capacity than are educated researchers who have experience with hundreds and thousands of children? And discarding conventional wisdom that a child's formative years are the basis for that child's later years?\n\n As a matter of fact, I am. Some \"researcher\" with an alphabet soup by his name and big fat government grants do not know the children intimately. Unless they're parents themselves, then haven't had to feed, clothe, nor care for these children. BTW, you're making the assumption that parents are complete dolts.", 
   {}, 
   180351, 
   null, 
   1132427940.0
  ], 
  [
   180354, 
   null, 
   "georged", 
   "As a matter of fact, I am. Some \"researcher\" with an alphabet soup by his name and big fat government grants do not know the children intimately. Unless they're parents themselves, then haven't had to feed, clothe, nor care for these children. BTW, you're making the assumption that parents are complete dolts.\n\n \n Not dolts, but quite often overprotective to a point of being unable to discern existing shortcomings and underlying psychological blocks in their own children. Intimacy at all levels has a habit of developing blocks to what others would consider problems. \n \n You do have an obvious and pronounced lack of appreciation for higher education. Would you consider that a trait to be instilled in children by design or parental emulation?", 
   {}, 
   180353, 
   null, 
   1132428780.0
  ], 
  [
   180355, 
   null, 
   "Bassman", 
   "Not dolts, but quite often overprotective to a point of being unable to discern existing shortcomings and underlying psychological blocks in their own children. Intimacy at all levels has a habit of developing blocks to what others would consider problems.\n \n Well so what!! My daughter doesn't need the so-called \"experts\" to tell her that she needs this or that.\n \nYou do have an obvious and pronounced lack of appreciation for higher education. Would you consider that a trait to be instilled in children by design or parental emulation?\n\n And with good reason. The pointy headed liberal \"scholars\" in academia have done more to undermine the moral fabric of this once-great country.", 
   {}, 
   180354, 
   null, 
   1132429620.0
  ], 
  [
   180356, 
   null, 
   "Ooaman", 
   "Hey Bassman, can I just ask at what age you had your first crush or thought that some girl was hot or good-looking? I don't mean in deviant ways. I mean in ways that would be expected. (Most first crushes happen at the age of a kindergarten student through 2nd or 3rd grade.) Is that something you would have felt comfortable talking with your parents about? You probably wouldn't feel comfortable saying anything considering that's the time that when you would have believed something like all girls have cooties or something.\n Now let's extend that and say that you actually didn't have any kind of crush at all because of a home condition where your father (or any parental figure for that matter) abused you sexually. Then you can't tell anyone because, if you tell your parents, one all ready knows about it anyway and the other either doesn't care or would just deny it. As I said in a previous post, that kind of thing can lead to sexual (or other mental) disorders later in life.\n \n Now also on the subject of comfortableness; let's say that you were a single father (either through divorce or as a widower or for whatever reason you were a single father.) And your child was a girl and it's time for her to have \"the talk.\" It would be normal for you to say, \"you need to talk to your mother about this stuff\" but wait, she's not in the picture. Now how comfortable would you be talking to your daughter about something that would be easier coming from a mother when chances are, she's uncomfortable talking with a parent on the subject anyway. Well, I guess in that case, you would have equal ground.\n \n My main point here is that parents are not always the best suited in some situations. Now, I don't know, you may be someone who looks forward to telling your children this stuff but at least in an educated setting, this is something that people are trained how to teach it.", 
   {}, 
   180353, 
   null, 
   1132429620.0
  ], 
  [
   180359, 
   null, 
   "Bassman", 
   "First off, I AM the father of a girl (she's two-and-a-half), and secondly, I don't put much stock in the \"research\" that places children into this category or that category. Thirdly, yes, I am quite comfortable with talking to my daughter about sex. It's not the school's job to do that! Pure and simple.", 
   {}, 
   180356, 
   null, 
   1132429920.0
  ], 
  [
   180361, 
   null, 
   "georged", 
   "Well so what!! My daughter doesn't need the so-called \"experts\" to tell her that she needs this or that.\n \n And with good reason. The pointy headed liberal \"scholars\" in academia have done more to undermine the moral fabric of this once-great country.\n\n \n Moral fabric? What in the world does that have to do with determining the age to properly educate children in an academic manner, the proven future strength or weakness of any nation?", 
   {}, 
   180355, 
   null, 
   1132430460.0
  ], 
  [
   180362, 
   null, 
   "Ooaman", 
   "First off, I AM the father of a girl (she's two-and-a-half), and secondly, I don't put much stock in the \"research\" that places children into this category or that category. Thirdly, yes, I am quite comfortable with talking to my daughter about sex. It's not the school's job to do that! Pure and simple.\n\n Well I wouldn't suggest it to a 21/2 year old. But in the situation where some parents might feel uncomfortable, (like in the case where one parent isn't there or for whatever reason) someone who has experience in that area should tell them. Now I assume that you are married and you and your wife have a good chance of always being there for your daughter. In which case, you two will probibly be able to back eachother up with \"the talk\". But when most people put up a taboo on that kind of thing, that's when the children get curious. Now I understand that the chances of them getting that currious at an elementary school age (at least in America) is unlikely. However, I have heard (though I don't know if I entirely believe the sourse or not) that children have unprotected sex in Japan during 3rd grade (possibly during recess or something.)\n I guess my main point is that it is not always as \"pure and simple\" as it is in cases like yours.", 
   {}, 
   180359, 
   null, 
   1132430760.0
  ], 
  [
   180364, 
   null, 
   "doG", 
   "As stated ad nauseum, the issue is parental control and oversight over the content of the curricula of the schools. Schools should not have a suuposed \"right\" nor ability to circumvent parental authority.\n\n Apparently you think that parental control is sacrosanct and any detriment that causes society is inconsequential. Would it be OK with you if just one parent out there taught their son that women do not mean no when they say \"no\", that it OK for him to take what he wants? On a grander scale, should society have no input on the next generation that is society to be, only it's parents?", 
   {}, 
   180345, 
   null, 
   1132431120.0
  ], 
  [
   180366, 
   null, 
   "Diogenes99", 
   "But if you send your children to a public school, doesn't that suggest the \"right\" to teach what they need to learn? I mean, if you have to make sure the teachers only teach what you want your children to know, wouldn't it be better to just home school them?\nThe question is determining what the children need to know, and when. That is the responsibility of the parents, and the school system is nothing more than a contractor hired for expertise - just like you would hire a plumber, electrician, accountant, lawyer or doctor.\n \n The solution is vouchers, where public money is allocated to educate a student and the money goes with the student to whatever school the parents believe will provide the best education for that child (in the sense of preparation for the adult world, not necessarily the ability to put a condom on a banana).", 
   {}, 
   180348, 
   null, 
   1132431120.0
  ], 
  [
   180367, 
   null, 
   "doG", 
   "That is the responsibility of the parents\n\n Now if we had some way to make sure that children were only born to responsible parents....", 
   {}, 
   180366, 
   null, 
   1132431240.0
  ], 
  [
   180369, 
   null, 
   "Ooaman", 
   "The solution is vouchers, where public money is allocated to educate a student and the money goes with the student to whatever school the parents believe will provide the best education for that child (in the sense of preparation for the adult world, not necessarily the ability to put a condom on a banana).\n\n Okay, maybe I lack the understanding of whre sex-ed does not fall into the catagory of \"preparation for the adult world.\" If this is what the issue is on, doesn't sex-ed also teach about the R-word \"responsibility.\"", 
   {}, 
   180366, 
   null, 
   1132431540.0
  ], 
  [
   180373, 
   null, 
   "georged", 
   "Okay, maybe I lack the understanding of whre sex-ed does not fall into the catagory of \"preparation for the adult world.\" If this is what the issue is on, doesn't sex-ed also teach about the R-word \"responsibility.\"\n\n \n Yes, but the topic instigator's focus is on absolute parental control of sex-ed without benefit of higher education through public schools and a later post wants lower and middle income families to be written checks by majority taxpayers to send their children to schools of parental choice, spurning public schools currently provided by those taxpayers. \n \n Few MDs are stupid enough to attempt diagnosis of their own health issues, but apparently in America only 'Father Knows Best'.", 
   {}, 
   180369, 
   null, 
   1132432320.0
  ], 
  [
   180383, 
   null, 
   "Sigma", 
   "Well so what!! My daughter doesn't need the so-called \"experts\" to tell her that she needs this or that.\n\n \n Yikes. In this statement alone is it clear reactionary thinking is alive and well.", 
   {}, 
   180355, 
   null, 
   1132433460.0
  ], 
  [
   180403, 
   null, 
   "joebrummer", 
   "As stated ad nauseum, the issue is parental control and oversight over the content of the curricula of the schools. Schools should not have a suuposed \"right\" nor ability to circumvent parental authority.\n\n \n \n According to thed ruling, no parental rights were violated. Parents were ask prior to the kids being given the survey. They had a right to not have their children take the survey. I just don't see what your issue is here. \n \n \n Directly from the ruling, it states:\n Kristi Seymour volunteered as a \"mental health counselor\"\n at Mesquite Elementary School while she was enrolled in a\n master's degree program at the California School of Professional\n Psychology. The Palmdale School District, of which\n Mesquite was a part, collaborated with the School of Professional\n Psychology, the Children's Bureau of Southern California,\n and Seymour to develop and administer a psychological\n assessment questionnaire for first, third, and fifth grade students\n with the announced goal of \"establish[ing] a community\n baseline measure of children's exposure to early trauma (for\n example, violence).\"\n Prior to administering the survey, Seymour mailed a letter\n to the parents of the children to be surveyed informing them\n of the questionnaire's nature and purpose, and requesting their\n consent to its administration.1 The parental consent letter was", 
   {
    "unicode_changes_made": true
   }, 
   180345, 
   null, 
   1132436400.0
  ], 
  [
   180408, 
   null, 
   "Jo Bennett", 
   "Bassman, you seem to have a real chip on your shoulder about academia and intellectuals. Do you fear knowledge and research or are you just angry about not being able to fulfil your own educational aspirations?", 
   {}, 
   180403, 
   null, 
   1132437660.0
  ], 
  [
   180409, 
   null, 
   "joebrummer", 
   "First off, I AM the father of a girl (she's two-and-a-half), and secondly, I don't put much stock in the \"research\" that places children into this category or that category. Thirdly, yes, I am quite comfortable with talking to my daughter about sex. It's not the school's job to do that! Pure and simple.\n\n \n \n While you are busy sheltering her from what she is to young to learn, she is off learning it from other places. Friends, Tv, radio...\n \n Kids should be taught as much as they can learn, as young as they can learn it. Or are you afriad of having very brillant children, you would rather they only be as smart as the number of years they have been around? Sounds rather self-defeating.", 
   {}, 
   180359, 
   null, 
   1132437660.0
  ], 
  [
   180421, 
   null, 
   "Diogenes99", 
   "Okay, maybe I lack the understanding of whre sex-ed does not fall into the catagory of \"preparation for the adult world.\" If this is what the issue is on, doesn't sex-ed also teach about the R-word \"responsibility.\"\nNot in first and third grade. That's an age when health and responsibility should be focused on washing hands.\n \n \nAccording to thed ruling, no parental rights were violated. Parents were ask prior to the kids being given the survey. They had a right to not have their children take the survey. I just don't see what your issue is here.\nThe ruling specifically stated that parents do not have an exclusive right to the education of their children (which isn't very useful, since every parent knows that their kids will exchange information with classmates), and went on to implement this policy by allowing a volunteer \"mental health counselor\" to educate herself at the children's expense. The questions about sex were not included in the survey form sent home for parental approval, and the parents have every right to be outraged by this betrayal of public trust.", 
   {}, 
   180403, 
   null, 
   1132440120.0
  ], 
  [
   180554, 
   null, 
   "Steeeeve", 
   "Bassman, I find it amusing that you get all your talking points from the Rush Limbaugh show. Even the term \"9th circus\" was on his program.\n \n He's deceptive and certainly will not give you all the facts of an issue, I would suggest you do not take what he says at face value (to say the least).\n\n THe 9th circus is a common term and not always from Rush. Leave the personal attacks out Sigma...its not your style.", 
   {}, 
   180325, 
   null, 
   1132516260.0
  ], 
  [
   180555, 
   null, 
   "Steeeeve", 
   "As usual, everyone seems to think that the court should decide things based on what they feel is right as opposed to what the law actually says. The constitution has no right to privacy and thus the parents had no case. You complain to the school board and then don't elect them ever again because they are a bunch of fools. End of case.\n \n The 9th circus is inconsistent with their other rulings though, however, this doesn't matter.", 
   {}, 
   180554, 
   null, 
   1132516440.0
  ], 
  [
   180558, 
   null, 
   "georged", 
   "THe 9th circus is a common term and not always from Rush. Leave the personal attacks out Sigma...its not your style.\n\n \n I reside in their jurisdiction, have followed issues on their docket over many years including media reports from a variety of publications and never heard the term. But I don't listen to talk radio and can't imagine legitimate print media using it in their reporting. I also receive news bulletins from my elected officials, both major parties, and have never seen them use that term. What's your definition of 'common term' and who uses it that the general public would be familiar with?", 
   {}, 
   180554, 
   null, 
   1132516860.0
  ], 
  [
   180559, 
   null, 
   "Steeeeve", 
   "I reside in their jurisdiction, have followed issues on their docket over many years including media reports from a variety of publications and never heard the term. But I don't listen to talk radio and can't imagine legitimate print media using it in their reporting. I also receive news bulletins from my elected officials, both major parties, and have never seen them use that term. What's your definition of 'common term' and who uses it that the general public would be familiar with?\n\n \n Just used a lot. I heard \"9th circus\" long before I ever heard it from Rush. Maybe it came from him, maybe not, but to say Bassman heard it from Rush and thus should be discredited is a strawman.", 
   {}, 
   180558, 
   null, 
   1132516980.0
  ], 
  [
   180563, 
   null, 
   "georged", 
   "Just used a lot. I heard \"9th circus\" long before I ever heard it from Rush. Maybe it came from him, maybe not, but to say Bassman heard it from Rush and thus should be discredited is a strawman.\n\n \n If it did come from talk radio, I'd discredit it without a second thought. But since I have no faith in mythology or show business sensationalism, I'd tend to be in minority to those who do worship such things.", 
   {}, 
   180559, 
   null, 
   1132521060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ninth Circus at it Again!!", 
  "url": "http://www.4forums.com/political/current-events-debates/6882-ninth-circus-again.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6882, 
  "discussion_files": [
   [
    "940.html", 
    "http://www.4forums.com/political/current-events-debates/6882-ninth-circus-again-print.html"
   ], 
   [
    "941.html", 
    "http://www.4forums.com/political/current-events-debates/6882-ninth-circus-again-3-print.html"
   ], 
   [
    "942.html", 
    "http://www.4forums.com/political/current-events-debates/6882-ninth-circus-again-2-print.html"
   ]
  ], 
  "identifier": 6882
 }
]