[
 [
  [
   180548, 
   null, 
   "Howard Beale", 
   "Take it to the bank. Plans to cut and run are already on Donny R's desk. They will be cynically carried out by the Bush administration before the 2006 elections for partisan political reasons.\n \n The first \"withdrawals\" will start in January or early 2006. The troops will be withdrawn as needed for Republican political reasons throughout the rest of the year. They may hold off as far as between August and October of 2006 to stem the loss of congressional seats.\n \n Take it to the bank.", 
   {
    "post_info": {
     "post_title": "Bush will cut and run before 2006 election"
    }
   }, 
   null, 
   null, 
   1132514700.0
  ], 
  [
   180598, 
   null, 
   "Ooaman", 
   "What 2006 election? What is the election in 2006 for?", 
   {}, 
   180548, 
   null, 
   1132528980.0
  ], 
  [
   180606, 
   null, 
   "Howard Beale", 
   "What 2006 election? What is the election in 2006 for?\nAll of the seats in the US House of Representatives and 33 seats in the US Senate.", 
   {}, 
   180598, 
   null, 
   1132531560.0
  ], 
  [
   180619, 
   null, 
   "georged", 
   "Take it to the bank. Plans to cut and run are already on Donny R's desk. They will be cynically carried out by the Bush administration before the 2006 elections for partisan political reasons.\n \n The first \"withdrawals\" will start in January or early 2006. The troops will be withdrawn as needed for Republican political reasons throughout the rest of the year. They may hold off as far as between August and October of 2006 to stem the loss of congressional seats.\n \n Take it to the bank.\n\n \n I had the same thoughts when he abruptly switched focus from administration being in total control of that policy to stating he depended on the generals in the field to make that decision. In the past two days he went from him and Cheney damming anyone suggesting we leave Iraq 'before the mission is completed' to praising Murtha. \n \n From a political standpoint, he'll have to do something or be assured of losing congressional control. The public mood against Iraq is growing ugly, recruitment is in poor shape, moderate Republicans are turning against him and we have some serious economic problems. He has no domestic or foreign policy successes. I wonder how those Bush supporters of spreading democracy at the point of a gun will react to to such a possibility.", 
   {}, 
   180548, 
   null, 
   1132538580.0
  ], 
  [
   180620, 
   null, 
   "JPSartre12", 
   "I had the same thoughts when he abruptly switched focus from administration being in total control of that policy to stating he depended on the generals in the field to make that decision. In the past two days he went from him and Cheney damming anyone suggesting we leave Iraq 'before the mission is completed' to praising Murtha. \n \n From a political standpoint, he'll have to do something or be assured of losing congressional control. The public mood against Iraq is growing ugly, recruitment is in poor shape, moderate Republicans are turning against him and we have some serious economic problems. He has no domestic or foreign policy successes. I wonder how those Bush supporters of spreading democracy at the point of a gun will react to to such a possibility.\n\n \n The last numbers that I heard were something like 80% of Americans are AGAINST cutting and running. I think that the recent HR thrashing of the \"cut and run\" bill (403 - 3) bears that out, as well.", 
   {}, 
   180619, 
   null, 
   1132540980.0
  ], 
  [
   180621, 
   null, 
   "georged", 
   "80% seems a strange number when his overall job approval rating is at 39% and the latest Gallup (11/11) says 63% disapprove of how he's handling the Iraq situation. Any chance of a reference on the 80%?", 
   {}, 
   180620, 
   null, 
   1132541520.0
  ], 
  [
   180623, 
   null, 
   "JPSartre12", 
   "80% seems a strange number when his overall job approval rating is at 39% and the latest Gallup (11/11) says 63% disapprove of how he's handling the Iraq situation. Any chance of a reference on the 80%?\n\n \n I'll do some digging, but I believe I heard it on C-SPAN's rebroadcast of the bill debate this AM. (What can I say, I was bored this morning) :)", 
   {}, 
   180621, 
   null, 
   1132541820.0
  ], 
  [
   180626, 
   null, 
   "Howard Beale", 
   "I'll do some digging, but I believe I heard it on C-SPAN's rebroadcast of the bill debate this AM. (What can I say, I was bored this morning) :)\nI wasn't saying he'd call it cutting and running, but that is exactly what he will do. They will call it something else so that it is palatable for the people. I simply said what he will do -- remove at least half the troops between now and the 2006 elections -- and it will be for political reasons here at home. You can take that to the bank.", 
   {}, 
   180623, 
   null, 
   1132543560.0
  ], 
  [
   180628, 
   null, 
   "georged", 
   "I wasn't saying he'd call it cutting and running, but that is exactly what he will do. They will call it something else so that it is palatable for the people. I simply said what he will do -- remove at least half the troops between now and the 2006 elections -- and it will be for political reasons here at home. You can take that to the bank.\n\n \n As I said, I'm in agreement administration has to make a substantial gesture to reducing our involvement in Iraq or risk losing control of congress. Moderate Republicans are already beginning to leave the ship as evidenced by the recent budget conflict. Patriot Act extensions are the upcoming battle and support for administration desires is waning on that issue. FEMA is out of money for Katrina on 12-1, and that will make some big public waves. Funding to run this big old leaky boat with a declining tax base is rapidly becoming a major issue with three years to go. Administration has made so many policy blunders without success, foreign and domestic, that they're running out of cards in a tough game.", 
   {}, 
   180626, 
   null, 
   1132544760.0
  ], 
  [
   180629, 
   null, 
   "georged", 
   "Out of curiosity, where did the term 'cut and run' originate and when did it become predominate as a political slogan?", 
   {}, 
   180628, 
   null, 
   1132545540.0
  ], 
  [
   180637, 
   null, 
   "Ooaman", 
   "I wasn't saying he'd call it cutting and running, but that is exactly what he will do. They will call it something else so that it is palatable for the people. I simply said what he will do -- remove at least half the troops between now and the 2006 elections -- and it will be for political reasons here at home. You can take that to the bank.\n\n Leave it to Bush to come up with a more colorful name for something so it doesn't sound bad to the people who would be against it:\n No Child Left Behind;\n The Patriot Act\n \n You get the idea. Hopefully, this time, the general idea will sound better than the name.", 
   {}, 
   180626, 
   null, 
   1132548780.0
  ], 
  [
   180641, 
   null, 
   "daewoo", 
   "I had the same thoughts when he abruptly switched focus from administration being in total control of that policy to stating he depended on the generals in the field to make that decision. In the past two days he went from him and Cheney damming anyone suggesting we leave Iraq 'before the mission is completed' to praising Murtha.\n\n \n I think that it goes beyond that when you consider the realities of the situation on the ground. In all reality, it has become painfully obvious that there is going to be close ties between Iraq and Iran with things as they currently are. They have already signed a mutual defense pact, including weapons transfers in times of need. This is pretty much a \"rock and hard place\" scenario if ever there was one. The Russians and the EU are more than happy to sell weapons to the Iraqis the minute they get the clearance to do so. The Us cannot continue to deny that clearance forever, since we are talking a government that was set up under our watch. The odds of those weapons finding their way into Iran are incredibly high, however, which we certainly do not want.\n \n The top man in Iraq is Chalibi, whom we stopped dealing with because he was spying for the Iranians (I wish that whoever it was that was arguing that the Dawa party was not loyal to Iran was still around so I could rub their nose in that one....the fool). \n \n So, we are essentially in a position where to continue pushing the government we set up in Iraq will inevitably lead to a ME where Iran and Iraq are closely aligned, not to mention Syria (which already has a treaty with Iran). The Russians are already providing the Syrians with modern weapons, the EU or the Russians will be doing the same. \n \n For the US, the best thing right now would be massive and continuous civil war in Iraq. If peace continues, we certainly loose any chance of being the dominate power in the gulf. If we pull out now and a massive civil war breaks out, is will be a split between he Iranians and the Syrians because the Iranians will support the shia fundamentalist and the Syrians will support the baathists, and the Kurds will likely attack Turkey. \n \n There is simply no possible good outcome to keeping Iraq stable at this point. We have put forth American values, and they have been flatly rejected. People point to the elections as a sign that they have accepted our values, but hell, they voted under Saddam. They vote in N Korea. They vote in Iran.", 
   {}, 
   180619, 
   null, 
   1132553820.0
  ], 
  [
   180643, 
   null, 
   "Steeeeve", 
   "Leave it to Bush to come up with a more colorful name for something so it doesn't sound bad to the people who would be against it:\n No Child Left Behind;\n The Patriot Act\n \n You get the idea. Hopefully, this time, the general idea will sound better than the name.\n\n \n haha yeah, \"no child left behind\" was classic. How can you say you are against \"no child left behind\" if you are a politician? The act was a piece of XXXX though.", 
   {}, 
   180637, 
   null, 
   1132555320.0
  ], 
  [
   180657, 
   null, 
   "Jo Bennett", 
   "Out of curiosity, where did the term 'cut and run' originate and when did it become predominate as a political slogan?\n\n \n I'm not sure, but could it be something to do with cutting the anchor rope on a ship when needing to leave in a hurry?", 
   {}, 
   180629, 
   null, 
   1132574460.0
  ], 
  [
   180661, 
   null, 
   "georged", 
   "I'm not sure, but could it be something to do with cutting the anchor rope on a ship when needing to leave in a hurry?\n\n \n That's what Google says. Specifically to cut the anchor rope to run downwind.\n Both Kerry and Bush used the saying in their presidential election campaigns, but I haven't been able to determine where it originated as a political slogan.\n \n Running downwind from the mess in Iraq sounds like an excellent plan.", 
   {}, 
   180657, 
   null, 
   1132590300.0
  ], 
  [
   180663, 
   null, 
   "georged", 
   "haha yeah, \"no child left behind\" was classic. How can you say you are against \"no child left behind\" if you are a politician? The act was a piece of XXXX though.\n\n \n This administration is so arrogant they threaten to cut federal funding to any district refusing to implement and follow it and then let the district appeal.", 
   {}, 
   180643, 
   null, 
   1132590480.0
  ], 
  [
   180664, 
   null, 
   "georged", 
   "I think that it goes beyond that when you consider the realities of the situation on the ground. In all reality, it has become painfully obvious that there is going to be close ties between Iraq and Iran with things as they currently are. They have already signed a mutual defense pact, including weapons transfers in times of need. This is pretty much a \"rock and hard place\" scenario if ever there was one. The Russians and the EU are more than happy to sell weapons to the Iraqis the minute they get the clearance to do so. The Us cannot continue to deny that clearance forever, since we are talking a government that was set up under our watch. The odds of those weapons finding their way into Iran are incredibly high, however, which we certainly do not want.\n \n The top man in Iraq is Chalibi, whom we stopped dealing with because he was spying for the Iranians (I wish that whoever it was that was arguing that the Dawa party was not loyal to Iran was still around so I could rub their nose in that one....the fool). \n \n So, we are essentially in a position where to continue pushing the government we set up in Iraq will inevitably lead to a ME where Iran and Iraq are closely aligned, not to mention Syria (which already has a treaty with Iran). The Russians are already providing the Syrians with modern weapons, the EU or the Russians will be doing the same. \n \n For the US, the best thing right now would be massive and continuous civil war in Iraq. If peace continues, we certainly loose any chance of being the dominate power in the gulf. If we pull out now and a massive civil war breaks out, is will be a split between he Iranians and the Syrians because the Iranians will support the shia fundamentalist and the Syrians will support the baathists, and the Kurds will likely attack Turkey. \n \n There is simply no possible good outcome to keeping Iraq stable at this point. We have put forth American values, and they have been flatly rejected. People point to the elections as a sign that they have accepted our values, but hell, they voted under Saddam. They vote in N Korea. They vote in Iran.\n\n \n The scenario played out exactly as the Bush Senior Administration predicted. Most families do have a bad seed.", 
   {}, 
   180641, 
   null, 
   1132590720.0
  ], 
  [
   180696, 
   null, 
   "JPSartre12", 
   "This administration is so arrogant they threaten to cut federal funding to any district refusing to implement and follow it and then let the district appeal.\n\n \n See what happens when a Republican President gets in bed with Ted Kennedy. emoticon_wow", 
   {}, 
   180663, 
   null, 
   1132600080.0
  ], 
  [
   180737, 
   null, 
   "Ooaman", 
   "I guess it's my fault for actually bringing it up but in my opinion, ideas like \"no child left behind\" is a joke. I'm close friends with someone in training to be a teacher. From what I hear, teachers (whether they are more liberal or more conservative) mostly believe that \"no child left behind\" was one big joke. The high school I went to had a special section for the students who were mentally impaired. (Okay, I'm getting the idea that some one might be upset with my wording there so maybe \"special development\" would be a better word.) It's no wonder that the high school I graduated from was one of the worse in the Kansas City Metropolitan area. (I've said before I'm from Shawnee, Kansas.) \"No child left behind\" tests and grades all the students (yes, even the special ed. students) based upon what the average is for their age.\n Does anyone else find that concept stupid.\n I hope Bush doesn't actually post on here because this might give him some idea. But I would imagine a style of a new bill from him to be \"The Fluffy Act\" that would insure that all the children in the United States gets a FREE Teddy bear. The fine print that's left out is that all of those teddy bears will be built with a chip that monitors everything the family does. Including credit card usage. But what is stated is that all children will get a teddy bear (and workers at Build-A-Bear workshop will get paid overtime for this.)\n \n Truth would have the following names for acts:\n The Patriot Act: The steal all of your information because we don't trust our own neighbor and we want you to live in fear too Act.\n No Child Left Behind: :xcensored Your Child's Education.\n \n Long story short, I just hope that whatever he names the \"cut and run\" Act, he will just do it, plain and simple. I'm with the idea of Support Our Troops...by getting them home NOW!!!", 
   {}, 
   180696, 
   null, 
   1132612200.0
  ], 
  [
   180744, 
   null, 
   "Master_Shake", 
   "Truth would have the following names for acts:\n The Patriot Act: The steal all of your information because we don't trust our own neighbor and we want you to live in fear too Act.\n No Child Left Behind: :xcensored Your Child's Education.\n\n Holy XXXX! that is just about both the funniest and saddest because it's true things I've seen on here in a while!!\n I wish I had thought of that.", 
   {}, 
   180737, 
   null, 
   1132614840.0
  ], 
  [
   180769, 
   null, 
   "Ooaman", 
   "Holy XXXX! that is just about both the funniest and saddest because it's true things I've seen on here in a while!!\n I wish I had thought of that.\n\n But if you think about it, would the congressmen actually sign bills with those for titles? The congressmen may be gullible enough to sign stuff that they don't have time to see, but they probably wouldn't be stupid enough to sign a bill entitled one of those. Some how, I don't believe that many people here would sign a bill that was entitled \":xcensored Your Child's Education.\" I don't doubt that some people may go with it, but I don't believe the majority here would go for one entitled that.", 
   {}, 
   180744, 
   null, 
   1132621860.0
  ], 
  [
   180774, 
   null, 
   "georged", 
   "But if you think about it, would the congressmen actually sign bills with those for titles? The congressmen may be gullible enough to sign stuff that they don't have time to see, but they probably wouldn't be stupid enough to sign a bill entitled one of those. Some how, I don't believe that many people here would sign a bill that was entitled \":xcensored Your Child's Education.\" I don't doubt that some people may go with it, but I don't believe the majority here would go for one entitled that.\n\n \n If paid enough under the table or promised enough votes, many would sign. Scanlon, DeLay's former aide, just pleaded out including restitution of $19-million. Does that give you a hint of how much money is involved in manipulating the public at just the aide level?", 
   {}, 
   180769, 
   null, 
   1132622340.0
  ], 
  [
   180778, 
   null, 
   "Ooaman", 
   "If paid enough under the table or promised enough votes, many would sign. Scanlon, DeLay's former aide, just pleaded out including restitution of $19-million. Does that give you a hint of how much money is involved in manipulating the public at just the aide level?\n\n So the congressmen don't get paid enough to make the right decision so the wrong side will pay them more? I would argue that that is just wrong but I got to remember that humans are not logical. (And I call myself a Star Trek fan, that should be Vulcan Studies 101.) But for what it's worth, it still isn't right. But unfortunately, we live in a world of the almighty dollar.emoticon_cry But back to the subject, I hope that the president actually goes along with the idea of pulling the troops out, no matter what the name is. And I hope the congressmen make the right choice and not based upon how much money can go into their pockets.", 
   {}, 
   180774, 
   null, 
   1132624260.0
  ], 
  [
   180786, 
   null, 
   "georged", 
   "Administration has gone from White House Spokesman (means he speaks for the administration) Scott McCllean calling John Murtha a ultraliberal along the lines of Michael Moore to Bush and Cheney now describing him as a \"a good man, a Marine, a patriot.\" In three days. \n \n This change of administration opinion could be what the media calls a 'fast development'. Hopefully it leads to a fast getting out of Iraq. \n \n Where are the Iraq democracy by gunpoint supporters in this thread?", 
   {}, 
   180778, 
   null, 
   1132628820.0
  ], 
  [
   180807, 
   null, 
   "Sigma", 
   "Administration has gone from White House Spokesman (means he speaks for the administration) Scott McCllean calling John Murtha a ultraliberal along the lines of Michael Moore to Bush and Cheney now describing him as a \"a good man, a Marine, a patriot.\" In three days. \n \n\n \n Doublethink: To tell deliberate lies while genuinely believing them and to forget any fact that has become inconvenient.", 
   {}, 
   180786, 
   null, 
   1132638960.0
  ], 
  [
   180810, 
   null, 
   "JPSartre12", 
   "Administration has gone from White House Spokesman (means he speaks for the administration) Scott McCllean calling John Murtha a ultraliberal along the lines of Michael Moore to Bush and Cheney now describing him as a \"a good man, a Marine, a patriot.\" In three days. \n \n This change of administration opinion could be what the media calls a 'fast development'. Hopefully it leads to a fast getting out of Iraq. \n \n Where are the Iraq democracy by gunpoint supporters in this thread?\n\n \n So, are you saying that an ultra-liberal can't also be patriotic? What about John Kerry? Some people think he's patriotic and an ultra-liberal. I don't hold that same opinion, though.", 
   {}, 
   180786, 
   null, 
   1132639320.0
  ], 
  [
   180845, 
   null, 
   "georged", 
   "So, are you saying that an ultra-liberal can't also be patriotic? What about John Kerry? Some people think he's patriotic and an ultra-liberal. I don't hold that same opinion, though.\n\n \n No, the point was that Murtha, known throughout his career as a hawk, with excellent Pentagon relations, who has always supported the military and supported the invasion/occupation of Iraq, was the first congressional rep in his position (defense committee) to publicly advocate we're beating a dead horse in Iraq and should pull our troops. \n \n McClellan immediately denounced Murtha's statement, likening him to Michael Moore. Administration realized they had made a blunder with both Bush and Cheney then issuing statements praising his military service and putting spin on his disagreement with their policy by stating it's healthy to discuss that issue.\n \n In my recollection, this is the very first time this administration has not attempted to trample anyone in disagreement with their Iraq policies. I view that as a softening of their resolve to 'stay the course' in Iraq (their words) as public and congressional sentiment turns against continuing the Iraq folly. The reality is that if they don't withdraw from Iraq they're putting the Republican Party into a position of losing control of congress in coming elections, the thread subject.", 
   {}, 
   180810, 
   null, 
   1132674840.0
  ], 
  [
   180899, 
   null, 
   "JPSartre12", 
   "No, the point was that Murtha, known throughout his career as a hawk, with excellent Pentagon relations, who has always supported the military and supported the invasion/occupation of Iraq, was the first congressional rep in his position (defense committee) to publicly advocate we're beating a dead horse in Iraq and should pull our troops. \n \n McClellan immediately denounced Murtha's statement, likening him to Michael Moore. Administration realized they had made a blunder with both Bush and Cheney then issuing statements praising his military service and putting spin on his disagreement with their policy by stating it's healthy to discuss that issue.\n \n In my recollection, this is the very first time this administration has not attempted to trample anyone in disagreement with their Iraq policies. I view that as a softening of their resolve to 'stay the course' in Iraq (their words) as public and congressional sentiment turns against continuing the Iraq folly. The reality is that if they don't withdraw from Iraq they're putting the Republican Party into a position of losing control of congress in coming elections, the thread subject.\n\n \n All of this might be moot real soon. Iraq is discussing a timetable for American troop withdrawal based on when they feel their security forces can handle the job themselves. I'm hoping that it's soon. I don't want to see any unnecessary US casualties. If Iraq is capable of taking care of itself, then it's time for us to go.", 
   {}, 
   180845, 
   null, 
   1132686780.0
  ], 
  [
   180903, 
   null, 
   "Howard Beale", 
   "I don't disagree with what I said Bush will do. Nixon did it in Vietnam. Declare victory (in this case claim that the Iraqi troops can handle things) and get you XXX out of there. What Nixon did in Vietnam was get us out of a situation that other Presidents had really screwed up by getting us into (JFK and LBJ). Then we hid our heads in the sand as the warring factions in Vietnam settled it violently among themselves. The same will happen when we hightail it out of Iraq. The warring factions will violently settle it among themselves. Bush screwed up getting us in there and now has to declare victory and run away because of his own screw-up. Bush's blunder is one of the great presidential blunders of American foreign policy in modern times, but let's allow him to save face, let him strut around like the victor and do whatever dance he needs to do - as long as he gets our guys out of there. I think even he knows now that it was a terrible blunder. Only fools will believe that he knew what he was doing, and he may not be the swiftest horse in the race, but he's no fool.", 
   {
    "unicode_changes_made": true
   }, 
   180899, 
   null, 
   1132688040.0
  ], 
  [
   180914, 
   null, 
   "JPSartre12", 
   "No, the point was that Murtha, known throughout his career as a hawk, with excellent Pentagon relations, who has always supported the military and supported the invasion/occupation of Iraq, was the first congressional rep in his position (defense committee) to publicly advocate we're beating a dead horse in Iraq and should pull our troops. \n \n McClellan immediately denounced Murtha's statement, likening him to Michael Moore. Administration realized they had made a blunder with both Bush and Cheney then issuing statements praising his military service and putting spin on his disagreement with their policy by stating it's healthy to discuss that issue.\n \n In my recollection, this is the very first time this administration has not attempted to trample anyone in disagreement with their Iraq policies. I view that as a softening of their resolve to 'stay the course' in Iraq (their words) as public and congressional sentiment turns against continuing the Iraq folly. The reality is that if they don't withdraw from Iraq they're putting the Republican Party into a position of losing control of congress in coming elections, the thread subject.\n\n \n I have a hard time with the knee-jerk positions taken from both sides of the aisle. Republicans attack a Democrat's patriotism, Democrats respond by attacking Republicans that never served in the military, indirectly attacking their patriotism. It's all BS, IMO. I don't think that Murtha was being unpatriotic. He was venting his frustration after seeing hundreds of widows and wounded soldiers during his weekly visits to military hospitals in the Washington, DC area. I might disagree with his position, but I won't question his heart OR patriotism. He has plenty of both, IMO.", 
   {}, 
   180845, 
   null, 
   1132689780.0
  ], 
  [
   180928, 
   null, 
   "georged", 
   "I have a hard time with the knee-jerk positions taken from both sides of the aisle. Republicans attack a Democrat's patriotism, Democrats respond by attacking Republicans that never served in the military, indirectly attacking their patriotism. It's all BS, IMO. I don't think that Murtha was being unpatriotic. He was venting his frustration after seeing hundreds of widows and wounded soldiers during his weekly visits to military hospitals in the Washington, DC area. I might disagree with his position, but I won't question his heart OR patriotism. He has plenty of both, IMO.\n\n \n What disagreement would you have with his position of immediate withdrawal from Iraq? Everything we've done there has failed miserably, including reconstruction of the infrastructure we totally destroyed, oil production is below pre-invasion levels, democracy as we view it doesn't fit Islamic Law and all we're now doing is encouraging more killing and being killed, and for what reason? Our military leaders have stated Iraq can't achieve stability with its present military forces when our occupation gets in the way of whatever is going to happen there, Iraq doesn't want us there and a majority of the US public wants out of Iraq. Administration isn't that stupid, how long can they beat a dead horse?", 
   {}, 
   180914, 
   null, 
   1132693020.0
  ], 
  [
   181311, 
   null, 
   "JPSartre12", 
   "What disagreement would you have with his position of immediate withdrawal from Iraq? Everything we've done there has failed miserably, including reconstruction of the infrastructure we totally destroyed, oil production is below pre-invasion levels, democracy as we view it doesn't fit Islamic Law and all we're now doing is encouraging more killing and being killed, and for what reason? Our military leaders have stated Iraq can't achieve stability with its present military forces when our occupation gets in the way of whatever is going to happen there, Iraq doesn't want us there and a majority of the US public wants out of Iraq. Administration isn't that stupid, how long can they beat a dead horse?\n\n \n The American people don't want us to cut and run like we did in Vietnam. Why do you think the HR voted the way it did. Americans may want our troops out, but we aren't willing to oull them out and leave a vacuum as we did in SE Asia. I think that we did learn a lesson that, I hope, we won;t repeat in Iraq.", 
   {}, 
   180928, 
   null, 
   1132867620.0
  ], 
  [
   181374, 
   null, 
   "daewoo", 
   "The American people don't want us to cut and run like we did in Vietnam. Why do you think the HR voted the way it did. Americans may want our troops out, but we aren't willing to oull them out and leave a vacuum as we did in SE Asia. I think that we did learn a lesson that, I hope, we won;t repeat in Iraq.\n\n \n All that shows is that the politicians on the hill are completely out of touch and unaccountable to the people they claim to represent. Recent polls show public sentiment, and the vote int he HOR does not reflect it at all.\n \n Our politicians are still trying to pretend that some good can or will come from the situtation and that they did not lead us into the most collosal mistake of the 20th century, one that has started a war that may well lead to the demise of the united states. We have essentially lost all supprot we had in the gulf...even the sauds are not willing to play ball with us anymore, and we have alienated nations that quite frankly, we need to buy our bonds. The economic damage that our folly has caused is incalculable, but even the small portions we CAN calcuate set a new definiiton for \"worst case scenario\".", 
   {}, 
   181311, 
   null, 
   1132901340.0
  ], 
  [
   181385, 
   null, 
   "JPSartre12", 
   "All that shows is that the politicians on the hill are completely out of touch and unaccountable to the people they claim to represent. Recent polls show public sentiment, and the vote int he HOR does not reflect it at all.\n \n Our politicians are still trying to pretend that some good can or will come from the situtation and that they did not lead us into the most collosal mistake of the 20th century, one that has started a war that may well lead to the demise of the united states. We have essentially lost all supprot we had in the gulf...even the sauds are not willing to play ball with us anymore, and we have alienated nations that quite frankly, we need to buy our bonds. The economic damage that our folly has caused is incalculable, but even the small portions we CAN calcuate set a new definiiton for \"worst case scenario\".\n\n \n Oh really? According to the most recent CNN/USA Today/Gallup poll published Monday:\n \n\n The poll also found that 19 percent of Americans want to see the troops come home now, and 33 percent said they wanted them home within a year. Only 38 percent said they should remain \"as long as needed.\" \n\n I would say that the HR got the cal right. Only 19% favored cutting and running.", 
   {}, 
   181374, 
   null, 
   1132902960.0
  ], 
  [
   181393, 
   null, 
   "daewoo", 
   "Oh really? According to the most recent CNN/USA Today/Gallup poll published Monday:\n \n I would say that the HR got the cal right. Only 19% favored cutting and running.\n\n \n \n 19% favored immediate withdrawal, yet only 2 HR voted for it. \n \n The vote was little (OK, nothing) more than a publicity stunt. AFIK, a complete immediate withdrawal is not on anybodies agenda on the hill. What democarats have argued for is a phased withdrawal starting immediatly. \n \n I say it is a good idea. If the current governement of Iraq cannot hold its own wihtout 160,000 US troops on the ground, it is pretty obvious that the people of Iraq are rejectign that government. It is called \"self determination\". It is that whole \"freedom\" thing. Contrary to apparent popular belief, the definition of \"freedom\" is NOT \"doing what America tells you\"\n \n Personally, it amazes me how cowardly Americans have prioven themselves to be. We have a terrorist attack, and Americans line up to give away our civil rights in the name of security. We send our military off to invade third party nations and ignore ENORMOUS civilian casualties in the name of covering our own butts. Now we are essentially keeping our troops around to ensure that the new governemnt of Iraq can exert the same iron grip of control that saddam did, and we tell ourselves that this is necessary and that to leave would be harmful to the IRaqi people\n \n Are you people all on crack? Are you really so afraid of living outside the iron grip of government control that you would wish that prison on others? Leet the Iraqis fight it out. Let them come to their own arrangement without American influence. In the real world, that would almost certainly mean Iraq fragments into 3 seperate states. Let it happen. \n \n The absolute best we can hope for if we stay is never ending violence in IRaq, because a large percentage of Iraqis do not WANT to live under the government we set up. A lot of Iraqis do not WANT to be little Iran. Do we really have the right to force them?\n \n The aregument against this is that we are maintainingn \"stability\" in the middle east. Is stability in the middle east what is best for the people in the middle east, or what is best for the US? Stability essentially = \"maintaining the status quo\". How can we possibly claim that helping to maintain the status quo in a region where the VAST majority of the nations are ruled by tyrants and totalitarian governments is some kind of humanitarian mission?\n \n the ismple fact fo the matter is, we have helped maintain the status quo in the ME for years because we are afraid of expensive oil and afraid of what it would mean to have to deal with governments that answer to their people instead of some tyrant whose sole motivation is greed.\n \n The truth of the matter is, what SHOULD matter is not what the American public thinks, or what American politicians think, but what the Iraqi people think. 80^% of them want us down yesterday, 90% want us out by the end of the year, and 60% think that the US is the big problem in Iraq.", 
   {}, 
   181385, 
   null, 
   1132910640.0
  ], 
  [
   181421, 
   null, 
   "georged", 
   "The American people don't want us to cut and run like we did in Vietnam. Why do you think the HR voted the way it did. Americans may want our troops out, but we aren't willing to oull them out and leave a vacuum as we did in SE Asia. I think that we did learn a lesson that, I hope, we won;t repeat in Iraq.\n\n \n And other than being proven wrong, one doesn't instill democracy at the point of a gun, the same lesson we've hopefully learned in Iraq, what lesson did we learn in Vietnam?\n \n This nation is supposedly government by the people. Are you saying our leadership should ignore the wishes of the people, wage an unpopular war that continues killing both Iraqis and Americans and depletes our treasure for no sound reason? Bring on total fascism?", 
   {}, 
   181311, 
   null, 
   1132933800.0
  ], 
  [
   181437, 
   null, 
   "JPSartre12", 
   "19% favored immediate withdrawal, yet only 2 HR voted for it. \n\n If only 19% of a Congressman's district favored immediate withdrawal, how many do you think would vote in favor of it? You typically need <50% to win an election...or re-election in this case. \n \n\n The vote was little (OK, nothing) more than a publicity stunt. AFIK, a complete immediate withdrawal is not on anybodies agenda on the hill. What democarats have argued for is a phased withdrawal starting immediatly. \n\n No argument that it was a clever stunt designed to get Democratic fencesitters to commit to one side or the other. My hat's off to Hunter. I hate ambivalence in politics.\n \n\n I say it is a good idea. If the current governement of Iraq cannot hold its own wihtout 160,000 US troops on the ground, it is pretty obvious that the people of Iraq are rejectign that government. It is called \"self determination\". It is that whole \"freedom\" thing. Contrary to apparent popular belief, the definition of \"freedom\" is NOT \"doing what America tells you\"\n \n\n How about a little historical perspective. There has never been a ME Democracy, so there are no meaningful comparisons to other ME countries, but it took the US 11 years to write and adopt a Constitution. They did it in Iraq in less than a 1/5 of that time frame. In the last two years they went from a dictatorship to an interim US run gov't to an Iraqi transitional gov't to a ratified Constitution and next month, full Iraqi control. I'd say that's an aggressive timeframe for the birth of a free nation.\n \n\n Personally, it amazes me how cowardly Americans have prioven themselves to be. We have a terrorist attack, and Americans line up to give away our civil rights in the name of security. We send our military off to invade third party nations and ignore ENORMOUS civilian casualties in the name of covering our own butts. Now we are essentially keeping our troops around to ensure that the new governemnt of Iraq can exert the same iron grip of control that saddam did, and we tell ourselves that this is necessary and that to leave would be harmful to the IRaqi people\n \n Are you people all on crack? Are you really so afraid of living outside the iron grip of government control that you would wish that prison on others? Leet the Iraqis fight it out. Let them come to their own arrangement without American influence. In the real world, that would almost certainly mean Iraq fragments into 3 seperate states. Let it happen. \n\n I bet that you rooted for Pol Pot as he murdered 2 million fellow Cambodians and the Hitus as they slaughtered 800,000 Tutsis in Rwanda because that is exactly what could occur if we left with Iraq in turmoil. Until Iraq has a stable national gov't, we'd be accessories to genocide. \n \n\n The absolute best we can hope for if we stay is never ending violence in IRaq, because a large percentage of Iraqis do not WANT to live under the government we set up. A lot of Iraqis do not WANT to be little Iran. Do we really have the right to force them?\n\n The majority of Iraqis voted IN FAVOR of the Constitution so how can you claim otherwise?emoticon_wow \n \n\n The aregument against this is that we are maintainingn \"stability\" in the middle east. Is stability in the middle east what is best for the people in the middle east, or what is best for the US? Stability essentially = \"maintaining the status quo\". How can we possibly claim that helping to maintain the status quo in a region where the VAST majority of the nations are ruled by tyrants and totalitarian governments is some kind of humanitarian mission?\n\n Not being a neocon, I don't want to be the world's policemen. But I do think that all developed nations have a moral obligation to prevent genocide world-wide.\n \n\n the ismple fact fo the matter is, we have helped maintain the status quo in the ME for years because we are afraid of expensive oil and afraid of what it would mean to have to deal with governments that answer to their people instead of some tyrant whose sole motivation is greed.\n \n The truth of the matter is, what SHOULD matter is not what the American public thinks, or what American politicians think, but what the Iraqi people think. 80^% of them want us down yesterday, 90% want us out by the end of the year, and 60% think that the US is the big problem in Iraq.\n\n \n Yeah and as soon as the US troops leave, they'll be crying for the UN to prevent the genocide of the Sunnis. emoticon_rolleyes \n \n While I personally think that Iraqis are a bunch of ungrateful bastards incapable of wiping their own arses, I don't wish genocide on anyone. A Shiite Iraq with the help of Iran, if left to its own devices, would devestate the Sunnis in short order as paybacks for SH's attempt to eradicate them.\n \n On the domestic side, I agree that American response to 9-11 has been cowardly at best. We willingly traded personal freedom for a false sense of security. That troubles me. emoticon_mad", 
   {}, 
   181393, 
   null, 
   1132944660.0
  ], 
  [
   181442, 
   null, 
   "daewoo", 
   "Genocide of the sunnis? The US military cannot control the sunnis. They have nothing to fear from the shia. Yes, there is likely to be a war. Yes, a \n lot of people are likely to die. Genocide? That is just being melodramatic.\n \n You are correct that we are essentially responsible for any deaths that occur, and there are likely to be many. We already FUBAR'd the situation,though. It is too late to try to fix it nicely.\n \n If you really think there is a threat to the sunni, then leacing is the only option, and the sooner the better. IF we wait until the current government has the whole country in an iron grip, the sunni would not have a chance.\n \n Never been a democracy in the ME? Iraq was a democracy. Iran is a democracy. A democracy is what you make of it. Democracy does not automatically equate to freedom. Americans need to pull their heads out of their butts and recognize this.", 
   {}, 
   181437, 
   null, 
   1132947300.0
  ], 
  [
   181448, 
   null, 
   "georged", 
   "\n Never been a democracy in the ME? Iraq was a democracy. Iran is a democracy. A democracy is what you make of it. Democracy does not automatically equate to freedom. Americans need to pull their heads out of their butts and recognize this.\n\n \n Never happen in this generation. Our current conceit regarding ideology, religion and culture was formed following WW2 during our great reign of prosperity. We were king of the hill. Prior to that, we were pretty much content to live and let live. Hopefully, the next generation learns from our mistakes. With the debt, economic circumstances and world mistrust of the US they face, it could be a harsh lesson.", 
   {}, 
   181442, 
   null, 
   1132948500.0
  ], 
  [
   181451, 
   null, 
   "JPSartre12", 
   "Genocide of the sunnis? The US military cannot control the sunnis. They have nothing to fear from the shia. Yes, there is likely to be a war. Yes, a \n lot of people are likely to die. Genocide? That is just being melodramatic.\n \n You are correct that we are essentially responsible for any deaths that occur, and there are likely to be many. We already FUBAR'd the situation,though. It is too late to try to fix it nicely.\n \n If you really think there is a threat to the sunni, then leacing is the only option, and the sooner the better. IF we wait until the current government has the whole country in an iron grip, the sunni would not have a chance.\n \n Never been a democracy in the ME? Iraq was a democracy. Iran is a democracy.  A democracy is what you make of it. Democracy does not automatically equate to freedom. Americans need to pull their heads out of their butts and recognize this.\n\n \n \n Now you're straining credulity. A single candidate- die if you don't vote for me- election hardly equates to a democracy. Really. emoticon_rolleyes", 
   {}, 
   181442, 
   null, 
   1132948920.0
  ], 
  [
   181454, 
   null, 
   "daewoo", 
   "Now you're straining credulity. A single candidate- die if you don't vote for me- election hardly equates to a democracy. Really. emoticon_rolleyes\n\n \n Neither Iran or Iraq offered only a single candidate EVER. The last time Saddam was elected, nobody wanted to run against him, so he appointed somebody to run.\n \n Did that person have any chance? No. Neither did Badnarack, or Nader in the US, because our entire nation has now been re-districted \"fairly\", so that even if over 50% of Americans voted for a third party candidate, they still can not win. Democrats and republics worked flawlessly together to pass \"campaign finance reform\" which did absolutely nothing to make elections more fair, but DID ensure that we could never have another Ross Perot...somebody who shows up on the scene and fully funds a nationwide campaign out of private coffers. \n \n Saddam's government was a dictatorship wearing a democratic mask. Iran's government is an oligarchy, just like ours in the US. \n \n Democracy is no guarantee of freedom, just like socialism was not (though socialism frankly give you a better shot on paper). The only guarantee to freedom is a well educated, vigilant public that holds their leaders responsible. Regardless of the form of government, that is a guarantee of freedom. Even the most heavy handed dictator cannot hold a nation at bay unless they consent to be held.", 
   {}, 
   181451, 
   null, 
   1132949880.0
  ], 
  [
   181480, 
   null, 
   "JPSartre12", 
   "Neither Iran or Iraq offered only a single candidate EVER. The last time Saddam was elected, nobody wanted to run against him, so he appointed somebody to run.\n\n Still beating a dead horse, I see. emoticon_rolleyes \n \n\n Did that person have any chance? No. Neither did Badnarack, or Nader in the US, because our entire nation has now been re-districted \"fairly\", so that even if over 50% of Americans voted for a third party candidate, they still can not win. Democrats and republics worked flawlessly together to pass \"campaign finance reform\" which did absolutely nothing to make elections more fair, but DID ensure that we could never have another Ross Perot...somebody who shows up on the scene and fully funds a nationwide campaign out of private coffers.\n\n Anybody that runs for office in the US has a chance unlike elections in dictatorships that are for show only. I do agree that our system is set up with a strong two-party bias, which up until recently has been OK, IMO. Now, there's not a thimbleful of difference between Republicrats and Democans and I'd love to see the rise of a strong Constitutional-friendly Party. \n \n\n Saddam's government was a dictatorship wearing a democratic mask. Iran's government is an oligarchy, just like ours in the US. \n\n No, Iran is a theocracy. we're not. \n \n\n Democracy is no guarantee of freedom, just like socialism was not (though socialism frankly give you a better shot on paper). The only guarantee to freedom is a well educated, vigilant public that holds their leaders responsible. Regardless of the form of government, that is a guarantee of freedom. Even the most heavy handed dictator cannot hold a nation at bay unless they consent to be held.\n\n \n No argument there. We have a population of apathetic airheads that are more interested in the latest celebrity break up than the fact that we're $Trillions in debt and accelerating the rate. We boost China's industry and set up roadblocks against our own. We let environmentalists force us into a situation in which we have to buy oil from countries that would like nothing better than to destroy Western society instead of developing a self-reliance using nuclear and other non-oil sources of energy. We have met the enemy and he is us.\n emoticon_frazzled", 
   {}, 
   181454, 
   null, 
   1132959060.0
  ], 
  [
   181488, 
   null, 
   "georged", 
   "\n No argument there. We have a population of apathetic airheads that are more interested in the latest celebrity break up than the fact that we're $Trillions in debt and accelerating the rate. We boost China's industry and set up roadblocks against our own. We let environmentalists force us into a situation in which we have to buy oil from countries that would like nothing better than to destroy Western society instead of developing a self-reliance using nuclear and other non-oil sources of energy. We have met the enemy and he is us.\n emoticon_frazzled\n\n \n I agree with all but the oil part; even if enviros dropped off the face of the earth we wouldn't even come close to being self-sufficient with that resource.\n \n War is for defense or gain, nothing else. Idealistic humanitarian refocus doesn't cut it where it counts, the wallet. If administration did bend the truth in part to get us into Iraq for their oil, even that was a miserable failure. We'll get some level of troop withdrawal before the 2006 elections, but administration's arrogance seems such that total withdrawal (or expanded war) won't be faced until we get closer to the 2008 elections or an admitted economic recession. Both Republicans and Democrats are generally still afraid to jump on the withdrawal bandwagon until the sheeple get serious enough threaten their gravy trains. Let's not forget Nixon took office on a campaign plank of getting us out of Vietnam and then went into Cambodia, a reported event that drew his ratings down and set the stage for Watergate. Let's hope history doesn't again repeat itself with this administration desperate to pump GDP while in possession of the Patriot Act.", 
   {}, 
   181480, 
   null, 
   1132969860.0
  ], 
  [
   181496, 
   null, 
   "daewoo", 
   "Anybody that runs for office in the US has a chance unlike elections in dictatorships that are for show only. I do agree that our system is set up with a strong two-party bias, which up until recently has been OK, IMO. Now, there's not a thimbleful of difference between Republicrats and Democans and I'd love to see the rise of a strong Constitutional-friendly Party. \n\n \n No, they don't. Besides the fact that the latest round of redistricting was specifically aimed at breaking up voting districts with strong records of voting independant, less than half of US states still have the legal apparatus in place to allow thier electoral votes to go to a third party. My state is a good example. If 80% of the population of my state voted independant, the electoral votes would either go democrat or republican. There is simply no longer provisions in our laws to allow anything else. The two parties have worked hard together to ensure this happens across the country at the local and state level. \n \n It is mathematically impossible at this point for a third party canidate to win. Sorry if that destroys what is left of the illusion of a democracy.\n \n \nNo, Iran is a theocracy. we're not. \n\n \n No, Irans government is a theocratically based oligarchy. The oligarchy in America is not theocratically based, it is power based, but at the end of the day, that makes little difference. The end result is the same.\n \n \nNo argument there. We have a population of apathetic airheads that are more interested in the latest celebrity break up than the fact that we're $Trillions in debt and accelerating the rate. We boost China's industry and set up roadblocks against our own. We let environmentalists force us into a situation in which we have to buy oil from countries that would like nothing better than to destroy Western society instead of developing a self-reliance using nuclear and other non-oil sources of energy. We have met the enemy and he is us.\n emoticon_frazzled\n\n \n I agree with you here on everything but the oil issue. We have no alternative to oil at this point. Nuclear power is, at present, only really useful in producing electricity. We do not really use oil to produce electricity in the US, so a transition to nuclear power is not likely to make any difference when it comes to our oil usage.\n \n In fact, only 54% of our oil is used for energy at all. The remaining 46% is used either as lubricants or to produce things like plastics, fertilizers, herbicides, etc.... This is where the myth of inflation being caused soley by increased energy prices comes in. If the cost of oil is up, the cost of anything and everything made from oil can be expected to go up. As a chemist, I am certain that if you look around whatever room you happen to be sitting in right now, you will be able to list 100 things right off the bat that are essentially made from oil (don't forget your carpet).", 
   {}, 
   181480, 
   null, 
   1132976160.0
  ], 
  [
   181504, 
   null, 
   "georged", 
   "A partial conclusion on this thread:\n \n US administration will have to reduce number of Iraq occupation troops, no GDP loss as cost will remain about the same from 160k to say 100k troops. How many to sate public opinion before 2006 elections is the number now being determined by administration political resources (I wonder if Rove is still golden boy?).\n \n Assuming administration takes the correct steps to soften their current stance in Iraq and retain control of congress after 2006 elections, what happens after that to maintain domestic political power and confidence? Iraq will get as ugly as Vietnam did when we finally admitted we were pursuing a folly.", 
   {}, 
   181496, 
   null, 
   1132979280.0
  ], 
  [
   181515, 
   null, 
   "JPSartre12", 
   "I agree with all but the oil part; even if enviros dropped off the face of the earth we wouldn't even come close to being self-sufficient with that resource.\n\n That's ONLY true if you don't take into account the vast amounts of coal that can be converted into clean diesel. Estimates are that we have hundreds of years of HCs at the current consumption rate. Add to that the diminished use of HCs for power generation and you could probably extend that out for several hundred more years.\n \n\n War is for defense or gain, nothing else. Idealistic humanitarian refocus doesn't cut it where it counts, the wallet. If administration did bend the truth in part to get us into Iraq for their oil, even that was a miserable failure. We'll get some level of troop withdrawal before the 2006 elections, but administration's arrogance seems such that total withdrawal (or expanded war) won't be faced until we get closer to the 2008 elections or an admitted economic recession. Both Republicans and Democrats are generally still afraid to jump on the withdrawal bandwagon until the sheeple get serious enough threaten their gravy trains.\n\n I hope that we are out in large numbers long before the 2008 election. After all, the Dec 15th election will mark the finalization of Iraqi rule in Iraq, no US appointees, no US involvement. Once the Iraqis can defend their new democracy, we should get out.\n \n\n Let's not forget Nixon took office on a campaign plank of getting us out of Vietnam and then went into Cambodia, a reported event that drew his ratings down and set the stage for Watergate. Let's hope history doesn't again repeat itself with this administration desperate to pump GDP while in possession of the Patriot Act.\n\n \n Let's not forget that Nixon kept his promise to the American people. He sent troops into Cambodia and Laos for one reason, to cut off NV supply lines and force NV to the bargaining table. Unfortunately, America lost its nerve and with it stopped its financial support for S. Vietnam. Going broke, it finally lost its struggle in 1975, years after we withdrew from Vietnam. The Vietnamization of the war was working as long as there were funds available for the struggle. We turned off the spigot and S. Vietnam collapsed. I don't think that we're stupid enough to let that happen again in Iraq.", 
   {}, 
   181488, 
   null, 
   1132981560.0
  ], 
  [
   181524, 
   null, 
   "daewoo", 
   "That's ONLY true if you don't take into account the vast amounts of coal that can be converted into clean diesel. Estimates are that we have hundreds of years of HCs at the current consumption rate. Add to that the diminished use of HCs for power generation and you could probably extend that out for several hundred more years.\n\n \n We only have a 250 yr reserve of coal as is. If we pass peak oil, that reserve is expected be drop to 75 years as it is used to pick up the slack as heating oil becomes more expensive. You want to take that 75 yr reserve and convert it to diesel fuel? \n \n Besides, the Nazis tried this during WWII, and in the real world, the process has not changed that much. Even using slave labor and captured resources with no accounting for the price of the capture, it was unprofitable.\n \n There seems to be a major perceptual problem here. We do not just need oil/energy. It has to be CHEAP. If it is not cheap, our entire economy falls down. There is NOTHING that provides the energy advantages that oil does at a cost that is compatible with our needs. I have spent tens of thousands of dollars studying this, flown all over the world to look at different schemes, and hired countless experts to go with me to review things and make sure the right questions get asked. After all, a ground floor investment in the next cheap energy source could be worth billions in short order.\n \n There is NOTHING currently that shows any promise of replacing oil. There are a few technologies that MAY be promising 50 years down the road, but currently there is NOTHING at all. \n \n Coal conversion processes have a couple of primary problems. The first (and biggest) is that it is relatively energy intensive just to get the coal. Mining ain't cheap. As fuel costs rise, the cost of coal rises, so the cost of the finished product rises, which raises the cost of coal production, and onward to infinity. It is a self perpetuating cycle. When you also consider the cost of the actual conversion process, the finished results simply too expensive to be feasible. The argument that increased energy pricing would make it feasible is a lost argument because of the above reasons. There are also MASSIVE scalability problems with it, as well as transport difficulties (because coal has a MUCH lower energy density than crude oil). \n \n Scalability seems to be the primary drawback to most of the \"replace pumped oil\" schemes out there, as well as energy related production costs. Scalability and energy related production costs also kills biomass, oil sands, ethanol, solar, biodiesel, and a dozen other such schemes. \n \n Facts is facts and they must be faced. We have nothing to replace oil, and that is a problem. Whether it is a problem because of the continuing deterioration of the geopolitical climate, or whether it is a problem because of peaking and depletion of world oil supplies is a toss up, but the fact remains, there is a serious problem that we do not even have a first step toward addressing.", 
   {}, 
   181515, 
   null, 
   1132985100.0
  ], 
  [
   181619, 
   null, 
   "georged", 
   "\n Let's not forget that Nixon kept his promise to the American people. He sent troops into Cambodia and Laos for one reason, to cut off NV supply lines and force NV to the bargaining table. Unfortunately, America lost its nerve and with it stopped its financial support for S. Vietnam. Going broke, it finally lost its struggle in 1975, years after we withdrew from Vietnam. The Vietnamization of the war was working as long as there were funds available for the struggle. We turned off the spigot and S. Vietnam collapsed. I don't think that we're stupid enough to let that happen again in Iraq.\n\n \n You have a habit of rewriting history to suit your own purposes. Nixon broke his campaign promise by escalating that war with going into Cambodia in secret, was caught and exposed by the press. Is a lie not a lie? It was a big scandal. That started his campaign to use government agencies to spy on political adversaries, with Kissinger ordering wiretaps on 7 NSC staff and 4 reporters, cumulating in Watergate, which eventually lead to Nixon's resignation. ARVN attempted invade Laos Feb. 8, 1971 with U.S. air support - but failed to close the Ho Chi Minh trail and showed everyone but you that Vietnamization had failed. All these events were widely publicized in the media, transcriptions of White House tapes and confessions by Nixon's henchmen. While you may choose to believe N. Vietnam capitulated because of heavy bombing, the fact is we left Vietnam and did so rather than mounting a ground offensive that would have drawn Chinese troops and materials into a war that creating another Korea, or worse. Stop the macho illusion and imagine how we'd react to a million+ equipped and supplied experienced combat Chinese troops with air support poised on the Mexico/US border. It was a stupid war that offered no US gain. \n \n America lost its nerve? Congress cut off funding for Vietnam after rallies against that war exceeded 500,000 people in one instance in DC. There's a major difference between losing nerve and not pursing a hopeless situation, just as we're facing in Iraq. The only thing that will make this administration drop the hopeless occupation of Iraq is public desire to withdraw by pressure on political representation that threatens their power base, nothing else. It's another war with no US gain, loss of US life and treasure with the occupied country asking us to leave. How does anyone but an arrogant, self-serving politician continue to justify such an action against public sentiment?", 
   {}, 
   181515, 
   null, 
   1133020740.0
  ], 
  [
   181637, 
   null, 
   "JPSartre12", 
   "You have a habit of rewriting history to suit your own purposes. Nixon broke his campaign promise by escalating that war with going into Cambodia in secret, was caught and exposed by the press. Is a lie not a lie? It was a big scandal. That started his campaign to use government agencies to spy on political adversaries, with Kissinger ordering wiretaps on 7 NSC staff and 4 reporters, cumulating in Watergate, which eventually lead to Nixon's resignation. ARVN attempted invade Laos Feb. 8, 1971 with U.S. air support - but failed to close the Ho Chi Minh trail and showed everyone but you that Vietnamization had failed. All these events were widely publicized in the media, transcriptions of White House tapes and confessions by Nixon's henchmen. While you may choose to believe N. Vietnam capitulated because of heavy bombing, the fact is we left Vietnam and did so rather than mounting a ground offensive that would have drawn Chinese troops and materials into a war that creating another Korea, or worse. Stop the macho illusion and imagine how we'd react to a million+ equipped and supplied experienced combat Chinese troops with air support poised on the Mexico/US border. It was a stupid war that offered no US gain. \n\n \n You may choose to believe that the bombings of N. Vietnam weren't significant in bringing the NV back to the Paris Peace Talks, but you'd be alone in that assertion. It isn't my knowledge of history that is lacking here, it's YOURS. Unquestionably, Nixon was involved in some shady politics, but your attempt to use them to muddy the historical record on Vietnam won't fly here. I know my history; I suggest that you bone up on yours. \n \n Partial Vietnam War Timeline:\n \n\n 30 Mar 72 - The North Vietnamese launch a major offensive across the DMZ, the biggest since Tet 1968. In retaliation, Nixon orders the bombing of the Hanoi and Haiphong area\n \n 15 Apr 72 - Renewed US bombing of North Vietnam above the 20th parallel26 Apr 72 - President Nixon announced the withdrawal of 20,000 more troops\n \n 27 Apr 72 - Paris Peace talks resume\n\n \n Coincidence?\n How about \n \n\n Dec 72 - Peace talks stopped due to a change in the Communist's position. The heaviest US bombing of North Vietnam of the war followed 18-30 Dec during Operation Linebacker II which included 129 B-52 bombers striking Hanoi\n \n 8 Jan 73 - Final stage of peace talks began that would lead to the signing of a Vietnam cease fire on 27 Jan\n \n 23 Jan 73 - President Nixon announced an agreement \"to end the war and bring peace with honor in Vietnam and S.E. Asia.\"\n \n 27 Jan 73 - Official end of the Vietnam War. Between 27 Jan and 29 Mar 73, a total of 587 military and civilian prisoners were released by the North Vietnamese, and during that same period, 23,500 US troops were withdrawn from South Vietnam\n \n \n\n Another coincidence? What are the odds of that occurring? emoticon_rolleyes \n Or how about this account \n \n\n Following his reelection in 1972, Nixon temporarily abandoned diplomacy. For twelve days in December, the U.S. unleashed a ferocious bombing attack on the North Vietnamese capital of Hanoi. Nixon gave no explanation for the bombing; he wanted to appear irrational, desperate, willing to do anything to get what he wanted.\n \n The president's \"madman\" strategy paid off. In January 1973, the United States and North Vietnam negotiated a peace. Sadly, the terms were little better than the ones proposed by North Vietnam in 1969. More than 25,000 American lives had been lost in the interim. Nixon had gained little by delaying withdrawal.\n http://www.pbs.org/wgbh/amex/presidents/37_nixon/nixon_foreign.html\n \n\n As you can see below, Saigon fell TWO YEARS AFTER our official end of military involvement in Vietnam. If Vietnamization was a disaster, why'd it take the NVA two additional years after we pulled our troops out to take over Saigon?\n \n\n 29 Mar 73 - 67 more US P.O.W.'s were freed in Hanoi. The same day, the US withdrew its remaining 2,500 troops from South Vietnam. This date also marked the actual end of military involvement in Vietnam.\n \n 10 May 73 - Due to continued bombing of Laos and Cambodia, the House voted (219-188) for the first time to cut-off Indochina funds\n \n 7 Nov 73 - War Powers Act - Congress dealt President Nixon a stunning setback when it voted to override his veto of legislation limiting presidential powers to commit US forces abroad without congressional approval. Congress, with the Vietnam War and the showdown over continued bombing in Cambodia behind it, was anxious to reassert its role in the conduct of the country's foreign affairs\n \n 9 Mar 75 - A major offensive begins against South Vietnam with an attack on Ban Me Thuot in the Central Highlands. South Vietnam fell in 55 days.\n \n\n Timeline from:\n http://www.landscaper.net/timelin.htm\n \n Now, as for China, it's doubtful that China would have engaged in WWIII for North Vietnam. Vietnam and China were long-standing enemies. They only used North Vietnam as a bargaining chip for them to gain entrance into the UN. Remember, 4 years after the fall of Hanoi, China fought AGAINST Communist Vietnam in the Sino-Chinese war of 1979. With Nixon making overatures towards normalization of relations with China, they weren't about to derail their ultimate goal for the sake of their support for NV.\n \n\n Many significant gains in the war were made under the Nixon administration, however. One particularly significant achievement was the weakening of support that the North Vietnamese army received from the Soviet Union and People's Republic of China. One of Nixon's main foreign policy goals had been the achievement of a \"breakthrough\" in U.S. relations with the two nations, in terms of creating a new spirit of cooperation. To a large extent this was achieved. China and the USSR had been the principal backers of the North Vietnamese army through large amounts of military and financial support. The eagerness of both nations to improve their own U.S. relations in the face of a widening breakdown of the inter-Communist alliance led to the reduction of their aid to North Vietnam.\n http://en.wikipedia.org/wiki/Vietnam_War \n\n \n \n\n America lost its nerve? Congress cut off funding for Vietnam after rallies against that war exceeded 500,000 people in one instance in DC.\n\n Exactly my point. We lost our nerve.\n \n\n There's a major difference between losing nerve and not pursing a hopeless situation, just as we're facing in Iraq. The only thing that will make this administration drop the hopeless occupation of Iraq is public desire to withdraw by pressure on political representation that threatens their power base, nothing else. It's another war with no US gain, loss of US life and treasure with the occupied country asking us to leave. How does anyone but an arrogant, self-serving politician continue to justify such an action against public sentiment?\n\n \n I see the same sentiment now that I saw during Vietnam. We didn't finish the war in Vietnam because we were afraid of China; we cut and run because the American public lost its nerve and Congress defunded it. If we're not careful, we'll fail to learn the lesson of Vietnam and pull defeat out of the jaws of victory. Revisionists like you don't help set the record straight, either.", 
   {}, 
   181619, 
   null, 
   1133029500.0
  ], 
  [
   181639, 
   null, 
   "georged", 
   "\n \n \n I see the same sentiment now that I saw during Vietnam. If we're not careful, we'll fail to learn the lesson of Vietnam and pull defeat out of the jaws of victory. Revisionists like you don't help set the record straight, either.\n\n \n You're carrying impressions from when you were 17yrs old? Then it will stick in your mind that Nixon's history black mark record will include not getting us out of Vietnam as soon as he could, as was the final line in your abbreviated cut/paste. Do you remember people hanging from chopper skids trying to escape Saigon in that 'victory'? \n \n To support our nation building in Vietnam and call it a victory when we got our rears handed to us is as pathetic as supporting our actions in Iraq.", 
   {}, 
   181637, 
   null, 
   1133030700.0
  ], 
  [
   181643, 
   null, 
   "JPSartre12", 
   "You're carrying impressions from when you were 17yrs old? Then it will stick in your mind that Nixon's history black mark record will include not getting us out of Vietnam as soon as he could, as was the final line in your abbreviated cut/paste. Do you remember people hanging from chopper skids trying to escape Saigon in that 'victory'? \n To support our nation building in Vietnam and call it a victory when we got our rears handed to us is as pathetic as supporting our actions in Iraq.\n\n \n Who ever called Vietnam a victory?!emoticon_confused", 
   {}, 
   181639, 
   null, 
   1133033520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush will cut and run before 2006 election", 
  "url": "http://www.4forums.com/political/current-events-debates/6888-bush-will-cut-run-before-2006-election.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6888, 
  "discussion_files": [
   [
    "9517.html", 
    "http://www.4forums.com/political/current-events-debates/6888-bush-will-cut-run-before-2006-election-print.html"
   ], 
   [
    "9518.html", 
    "http://www.4forums.com/political/current-events-debates/6888-bush-will-cut-run-before-2006-election-4-print.html"
   ], 
   [
    "9519.html", 
    "http://www.4forums.com/political/current-events-debates/6888-bush-will-cut-run-before-2006-election-3-print.html"
   ], 
   [
    "9520.html", 
    "http://www.4forums.com/political/current-events-debates/6888-bush-will-cut-run-before-2006-election-2-print.html"
   ]
  ], 
  "identifier": 6888
 }
]