[
 [
  [
   181142, 
   null, 
   "daewoo", 
   "http://news.ft.com/cms/s/92fad322-5c58-11da-af92-0000779e2340.html\n \n \nQataris, including senior officials, reacted with shock on Wednesday to newspaper reports in Britain suggesting that George W Bush, the US president, had discussed bombing the Doha headquarters of the Arabic satellite TV channel al-Jazeera. \n\n \n Snip\n \n \nOn Tuesday the British government threatened newspapers with the Official Secrets Act if they revealed contents of the document, a move that reinforced suspicions in Qatar that the report might be genuine\n\n \n Maybe its just me, but I tend to see this the same way as the Qataris. If there was nothing to it, the british would not be threatening to toss people in jail for revealing it. \n \n I can't help but wonder what all was in there if they are still threatened by the conetents. It would seem that once you haev documentation of 2 leaders discussing military attacks on a civilian target....a news agency no less, becuae they do not agree with how the news is being reported, that there would not be much else to loose.\n \n \n What do you british folks think? Will the british media buckle under the pressure, or will they publish anyway? If they do not publish, do you think they are dedicated enough to getting such things out that we can expect some anonymous circulation on the internet? \n \n \nUS pressures led the Qataris to suggest that they might put al-Jazeera up for sale. This option was not welcomed by US officials, who feared a privatisation could make al-Jazeera more difficult to control.\n\n \n Maybe \"control\" is not what is needed here. I know that there are a lot of Americans who do not like Al Jazeera. You can pretty mcu bet that they have no realistic reason for this beyond the fact that they prefer to be told what they want to hear as opposed to being presented with facts. When I was in the military, AJ was considered a \"highly reliable\" source. No US network was even ranked. On several occasions I saw guys in ops rooms huddled around a television watching the AJ feed becuase they would be reporting live what it would take our human assets and electronics hours to report. \n \n AFIK, there is really no better source for what is going on in the ME. AJ is on the ground. The local population knows and likes them, which gives them access and opportunities that western services do not get. Even when the Bush administration was slamming AJ (less than a year after Bush commended them on worlwide television for their \"fair and impartial\" reporting in Afghanistan) they never quesitoned their accuracy or their facts, they just did not liek the fact that they were reporting certain things at all. \n \n US journalists were embedded with US troops. The US military had complete and absolute control over them. AJ, on the other hand, wandered around Iraq at will reporting whatever stories they deemed interesting. To keep AJ out of falluja, the US military had to declare that anybody carrying a camera in falluja would be shot on sight.\n \n I would certainly agree that some of AJs coverage is damaging to the US. That is their job, though. The media is (theoretically) supposed to report news, not just be a propoganda machine.", 
   {
    "post_info": {
     "post_title": "How to make friends and influence people"
    }
   }, 
   null, 
   null, 
   1132791960.0
  ], 
  [
   181158, 
   null, 
   "OccamsRazor", 
   "\n What do you british folks think? Will the british media buckle under the pressure, or will they publish anyway? If they do not publish, do you think they are dedicated enough to getting such things out that we can expect some anonymous circulation on the internet? \n \n\n \n I'd like to see a brave element of the press take on the government over this as Blair needs putting back in his place over matters like this ever since the travesty of an inquiry that was the Hutton report took place over the 45 minute claim and the death of David Kelly.\n \n Although they face criminalisation under the Offical Secrets Act the Government may be unable to bring charges if related evidence is to sensitive to be exposed to public scrutiny, as happened in the case of Katherine Gun.", 
   {}, 
   181142, 
   null, 
   1132794360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How to make friends and influence people", 
  "url": "http://www.4forums.com/political/current-events-debates/6913-how-make-friends-influence-people.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6913, 
  "discussion_files": [
   [
    "6803.html", 
    "http://www.4forums.com/political/current-events-debates/6913-how-make-friends-influence-people-print.html"
   ]
  ], 
  "identifier": 6913
 }
]