[
 [
  [
   181187, 
   null, 
   "joebrummer", 
   "Below is a transcript from ex-gay Stephen Bennett's Radio Show. For those of you who don't know much about this guy, he says funnier stuff than Jerry Falwell on drugs.....\n \n The laugh...count the number of times this \"ex-gay\" says...\"my wife\" \n \n \n I used to be gay, but now I have a wife. Here's my wife. Have you met my wife Irene? Say hi, Irene. You see, I used to be a promiscuous homosexual, but now Irene is my wife. You know, Irene, my wife who you just met? She's my wife, because I'm no longer XXXXX. We're here to tell others that you too can stop being XXXXX and have a wife, just like me, Stephen Bennett, who is talking to you now alongside my beautiful wife Irene. What should we talk about today, wife Irene? Oh I know, let's talk about how you can leave homosexuality, like me, Stephen Bennett. Because you see, if you actually succeed in becoming an \"ex-gay,\" you are required to talk about nothing else besides your \"former homosexuality\" for all of eternity. Isn't that right, wife Irene, who I \"former homosexually\" love. You too can become a former 'mo, if you pray real hard. Right, wife Irene? Let's talk about that.\n \n \n ME DOTH THINK ONE PROTEST TO MUCH!", 
   {
    "post_info": {
     "post_title": "Just for giggles and laughs..."
    }
   }, 
   null, 
   null, 
   1132801860.0
  ], 
  [
   181200, 
   null, 
   "Matthew S", 
   "He seems to be repeating my wife over and over again as if he is trying to convince himself. Sad really but that is the sad life of denial he has choosen for himself. He needs to lay off trying to lead others into a life denial and self loathing.", 
   {}, 
   181187, 
   null, 
   1132809660.0
  ], 
  [
   181202, 
   null, 
   "Bassman", 
   "I'm shaking my head in disbelief over the disparaging remarks you are making. First off, the \"once (insert label here), always (insert label here)\" is still a fallacy. If Mr. Bennett's conversion is genuine, then he truly is a completely changed man. Sure he will stil struggle with the temptations of the homosexual lifestyle, but the God he (and I) worship and serve has the power to change even the hardest of hearts.emoticon_xangel", 
   {}, 
   181200, 
   null, 
   1132812540.0
  ], 
  [
   181229, 
   null, 
   "Matthew S", 
   "I'm shaking my head in disbelief over the disparaging remarks you are making. First off, the \"once (insert label here), always (insert label here)\" is still a fallacy. If Mr. Bennett's conversion is genuine, then he truly is a completely changed man. Sure he will stil struggle with the temptations of the homosexual lifestyle, but the God he (and I) worship and serve has the power to change even the hardest of hearts.emoticon_xangel\n\n \n \n It is a falllicy to believe that there is anything wrong to begin with and that there is anything in need of conversion. If he still has to struggle with the issue then that only proves he is acting, trying to convince himself, and the the \"conversion\" is nothing but pure preversion of his basic nature. Maybe that is what evagelicals want keeping up apeareances at all costs. I actually fell sorry for those who call them self ex-gays they are being brainwashed and led astray by the cult of evagelical christianity.", 
   {}, 
   181202, 
   null, 
   1132841460.0
  ], 
  [
   181260, 
   null, 
   "jyoshu", 
   "It is a falllicy to believe that there is anything wrong to begin with and that there is anything in need of conversion. \n\n \n It doesn't matter. If that's what he wants to do, then it's none of your business. For people who don't want others telling you how to live your lives, you sure do spend a lot of time telling how ex-gays should live theirs.", 
   {}, 
   181229, 
   null, 
   1132853340.0
  ], 
  [
   181264, 
   null, 
   "Matthew S", 
   "It doesn't matter. If that's what he wants to do, then it's none of your business. For people who don't want others telling you how to live your lives, you sure do spend a lot of time telling how ex-gays should live theirs.\n\n \n \n If he wants to live his life this way it is his business, as I have stated before, and I am not trying to tell anyone how they should live their lives. Heck if he wants to live a life devoid of joy and selfloathing who am I to stop him.\n \n I wonder are you reading my posts correctly? \n \n We are just making comments on the fact that he seems to be in denial, as he keeps saying \"My wife\" over and over aggain as if trying to convince himself. I also take issue that there is something wrong with being gay and having gay sex when you are in fact gay. I also take issue with his preaching against gay people and tring to brianwash others into going against their inherent natures.", 
   {}, 
   181260, 
   null, 
   1132853940.0
  ], 
  [
   181273, 
   null, 
   "joebrummer", 
   "It doesn't matter. If that's what he wants to do, then it's none of your business. For people who don't want others telling you how to live your lives, you sure do spend a lot of time telling how ex-gays should live theirs.\n\n \n \n If he wants to be an ex-gay and live as a married straight guy that is one thing. Having a radio show thats sole mission is to condemn gays is another thing all together. He also profits heavily from this hatred. Books, videos, transcripts of his show. The man profits off hate and discontent for gays.\n \n His show yesterday advises parents not to invite their children's gay partners to thanksgiving dinner.....yeah sure split up the family, thats great!", 
   {}, 
   181260, 
   null, 
   1132856700.0
  ], 
  [
   181278, 
   null, 
   "Bassman", 
   "It is a falllicy to believe that there is anything wrong to begin with and that there is anything in need of conversion. If he still has to struggle with the issue then that only proves he is acting, trying to convince himself, and the the \"conversion\" is nothing but pure preversion of his basic nature. Maybe that is what evagelicals want keeping up apeareances at all costs. I actually fell sorry for those who call them self ex-gays they are being brainwashed and led astray by the cult of evagelical christianity.\n\n Matthew, your hostility toward God is very evident. You refuse to accept the fact that people can and do change their basic nature when they have a saving relationship with Christ.", 
   {}, 
   181229, 
   null, 
   1132857780.0
  ], 
  [
   181305, 
   null, 
   "Ooaman", 
   "Just by any chance, could the guy be bisexual? I mean, I don't know, that's why I ask. It could be that he is just finding out about this and doesn't even know it yet.", 
   {}, 
   181278, 
   null, 
   1132865520.0
  ], 
  [
   181323, 
   null, 
   "Matthew S", 
   "Matthew, your hostility toward God is very evident. You refuse to accept the fact that people can and do change their basic nature when they have a saving relationship with Christ.\n\n \n \n Some people refuse to accept that you can still be gay and have gay sex while still having a \"saving relationship with Christ\"\n \n \n \n I am at war with religion, esp. evangelical christianity and those who think being gay and having gay sex is a sin, not God. There is a difference between God and religion unfortuately some people are not intelligent to know the difference.", 
   {}, 
   181278, 
   null, 
   1132875000.0
  ], 
  [
   181326, 
   null, 
   "jyoshu", 
   "If he wants to be an ex-gay and live as a married straight guy that is one thing. Having a radio show thats sole mission is to condemn gays is another thing all together.\n\n \n No, it's not. It's still his business. It's a free country and he can have all the radio programs he wants. Leave the guy alone!", 
   {}, 
   181273, 
   null, 
   1132876500.0
  ], 
  [
   181344, 
   null, 
   "jitobear", 
   "No, it's not. It's still his business. It's a free country and he can have all the radio programs he wants. Leave the guy alone!\n\n \n If it's a free country he doesn't have to leave anyone alone.", 
   {}, 
   181326, 
   null, 
   1132887660.0
  ], 
  [
   181348, 
   null, 
   "Bassman", 
   "Some people refuse to accept that you can still be gay and have gay sex while still having a \"saving relationship with Christ\"\n\n That's where your wrong Matt. Salvation means a changed life. And contrary to what you might think, God forbids homosexual relations.\n \n \n \nI am at war with religion, esp. evangelical christianity and those who think being gay and having gay sex is a sin, not God. There is a difference between God and religion unfortuately some people are not intelligent to know the difference.\n\n Evangelical Christianity's message is one of repentance and eternal life. But the kicker here is that we must surrender control of our lives to God.", 
   {}, 
   181323, 
   null, 
   1132890420.0
  ], 
  [
   181351, 
   null, 
   "jyoshu", 
   "I am at war with religion, esp. evangelical christianity\n\n \n Matt, life is too short. Religion has been around since the dawn of man, and religion will always be in the world--you're fighting a losing war, my friend. \n \n A better way is to realize that most religion isn't against you, and just because people have a moral view concerning something you do, it doesn't mean they hate you. It's simply a moral view, much like many other Christian views. It's fine to disagree with it--no one is going to make you adhere or agree. But at the same time, you don't get to make others drop their beliefs either. That's what freedom of religion is all about. \n \n Your posts give every indication that you don't understand the difference between religion and extremism, because you always lump the two together.", 
   {}, 
   181323, 
   null, 
   1132891800.0
  ], 
  [
   181370, 
   null, 
   "JakeCJB", 
   "A better way is to realize that most religion isn't against you, and just because people have a moral view concerning something you do, it doesn't mean they hate you. It's simply a moral view, much like many other Christian views. It's fine to disagree with it--no one is going to make you adhere or agree. But at the same time, you don't get to make others drop their beliefs either. That's what freedom of religion is all about.\n\n \n These beliefs you express, jyoshu, are immoral. You have the freedom to believe them within your religious institution of course. How you act on those beliefs outside the institution is another matter. There also may be social pressure coming to your religious institution to change, as gay people become more accepted in society. Social change is a constant reality.", 
   {}, 
   181351, 
   null, 
   1132898220.0
  ], 
  [
   181375, 
   null, 
   "Bassman", 
   "These beliefs you express, jyoshu, are immoral. You have the freedom to believe them within your religious institution of course. How you act on those beliefs outside the institution is another matter. There also may be social pressure coming to your religious institution to change, as gay people become more accepted in society. Social change is a constant reality.\n\n How do you define \"immoral?\" Do you define it as expressing absolute truths about God and His standards of conduct? If so, then you have a misplaced set of values. Contrary to popular opinion, God's standards never change. So why should His people (concerning morality)? Again, it comes back to the homosexual mantra of \"tolerance\" where everybody must accept their lifestyle. But one cannot object nor question their misplaced \"values.\"", 
   {}, 
   181370, 
   null, 
   1132901520.0
  ], 
  [
   181390, 
   null, 
   "JakeCJB", 
   "How do you define \"immoral?\" Do you define it as expressing absolute truths about God and His standards of conduct? If so, then you have a misplaced set of values. Contrary to popular opinion, God's standards never change. So why should His people (concerning morality)? Again, it comes back to the homosexual mantra of \"tolerance\" where everybody must accept their lifestyle. But one cannot object nor question their misplaced \"values.\"\n\n \n One of the ways I would define it is: to follow a course of action or to teach a belief, with no thought as to how it may negatively affect another person. Do you think about how it may harm gay people, to be taught negative things related to their sexuality and to be excluded on the basis of their sexuality? People do change their morality, values, and beliefs. That's the only way we can right wrongs, and fix injustices. If the supposed immorality of homosexuality is an absolute, we'd all be convinced, there would not be disagreement over it being immoral. There are plenty of people who believe being gay is moral. Morality is subjective. It's not objective, something we can perceive directly with our senses. Humans create it, and change it. \n \n They also interpret what God wants, if they believe a God exists. Interpretations of what God wants have changed. Therefore, I have trouble believing in absolutes in the religious sense, as you argue for. It will vary by religion as to what God wants, and concerning any change in interpretation. We'll only know for sure if we really meet God, if God exists. I don't see this debate on homosexuality going away in many religious institutions. Those whose arguments against it are it's simply an absolute, I don't beleive will stop the human desire to think and question, and I don't think they can be removed forever from the social changes going on around them, as their members are also part of the society outside the religious institution.", 
   {}, 
   181375, 
   null, 
   1132909680.0
  ], 
  [
   181403, 
   null, 
   "Matthew S", 
   "That's where your wrong Matt. Salvation means a changed life. And contrary to what you might think, God forbids homosexual relations.\n\n \n This is only your opinion. I have met many christians, whom I don't consider evangelicals, that do not consider gay sex a sin. Infact there is are whole sects of christianity that welcome GLBT people and even bless our unions.\n http://www.ucc.org/index1.php\n http://www.mccchurch.org/AM/Template.cfm?Section=Home\n http://www.llgm.org/\n The ELCA while not formally endorsing Gay unions does nothing to stop a congragation from welcoming and accepting and blessing gay unions.\n there are many more\n \n\n Evangelical Christianity's message is one of repentance and eternal life. But the kicker here is that we must surrender control of our lives to God.\n\n \n Once again it is only your opinion that God has anythig against GLBT people. I ask you to prove this without refering to the bible. Don't point to the ex-gay movement they are being influenced by the bible thumping so your arguement would be circular.\n \n \n \nYour posts give every indication that you don't understand the difference between religion and extremism, because you always lump the two together.\n\n \n Because they are one in the same message as viewed from a gay mans prospective. Any statement of disaproval of GLBT people or their sexual practices regardless of the degree of disaproval is extreamism to me, as viewed by a gay man. I see no difference between a person making a statement that gay sex is a sin and what was yelled at the gay marchers in poland. \"Gays to the Gas Chamber\" and \"Gay sex is an Aboination before God\" are the same statement as seen from my prospective as a gay man because the latter leds to the former.", 
   {}, 
   181348, 
   null, 
   1132923120.0
  ], 
  [
   181408, 
   null, 
   "Bassman", 
   "One of the ways I would define it is: to follow a course of action or to teach a belief, with no thought as to how it may negatively affect another person. Do you think about how it may harm gay people, to be taught negative things related to their sexuality and to be excluded on the basis of their sexuality? People do change their morality, values, and beliefs. That's the only way we can right wrongs, and fix injustices. If the supposed immorality of homosexuality is an absolute, we'd all be convinced, there would not be disagreement over it being immoral. There are plenty of people who believe being gay is moral. Morality is subjective. It's not objective, something we can perceive directly with our senses. Humans create it, and change it. \n \n They also interpret what God wants, if they believe a God exists. Interpretations of what God wants have changed. Therefore, I have trouble believing in absolutes in the religious sense, as you argue for. It will vary by religion as to what God wants, and concerning any change in interpretation. We'll only know for sure if we really meet God, if God exists. I don't see this debate on homosexuality going away in many religious institutions. Those whose arguments against it are it's simply an absolute, I don't beleive will stop the human desire to think and question, and I don't think they can be removed forever from the social changes going on around them, as their members are also part of the society outside the religious institution.\n\n Since the Fall of mankind into sin, human nature has always been one of rebellion against the will of God. This means:\" I don't care what God wants, I'll do things my way!\" Attempting to redefine His Word, instead of a basic faith that trusts God to always have our best interests in mind.", 
   {}, 
   181390, 
   null, 
   1132926900.0
  ], 
  [
   181416, 
   null, 
   "jitobear", 
   "Again, it comes back to the homosexual mantra of \"tolerance\" where everybody must accept their lifestyle.\n\n \n Yet you seem to think that we all should accept and even appease your religion. You scream about the intolerance of anyone who states they think your religion is bunk, but you see no reason for having tolerance yourself. No gays are asking you not to be Christian, but you are demanding people accept your morality as absolute and you ask gays to not be gay. If you can't see the oppression in that you may as well pluck out your eyes.", 
   {}, 
   181375, 
   null, 
   1132931700.0
  ], 
  [
   181519, 
   null, 
   "Bassman", 
   "Yet you seem to think that we all should accept and even appease your religion. You scream about the intolerance of anyone who states they think your religion is bunk, but you see no reason for having tolerance yourself. No gays are asking you not to be Christian, but you are demanding people accept your morality as absolute and you ask gays to not be gay. If you can't see the oppression in that you may as well pluck out your eyes.\n\n No, it's something that all people should consider. Christ's message isn't just about love and acceptance, but, more importantly, about repentance. Being a Christian doesn't give anybody a licence to sin, pure and simple.", 
   {}, 
   181416, 
   null, 
   1132982880.0
  ], 
  [
   181544, 
   null, 
   "jitobear", 
   "No, it's something that all people should consider. Christ's message isn't just about love and acceptance, but, more importantly, about repentance. Being a Christian doesn't give anybody a licence to sin, pure and simple.\n\n \n And if they don't consider it you will force them into it at all costs anyway. It's not like your God is really interested in faith that is sincere. He just wants a bunch of groveling ijuts who obey rules.\n \n I would like to point out that you diverted rather address my post. Why is it that anyone should have to be tolerant of Christianity when Christians feel they are above tolerance?\n \n Being a Christian doesn't give you license to be oppressive a-holes to everyone who isn't either.", 
   {}, 
   181519, 
   null, 
   1132988460.0
  ], 
  [
   181603, 
   null, 
   "Matthew S", 
   "No, it's something that all people should consider. Christ's message isn't just about love and acceptance, but, more importantly, about repentance. Being a Christian doesn't give anybody a licence to sin, pure and simple.\n\n \n \n Some people just don't get it Gay sex and being gay are not sins and it doesn't matter for the non christian in a secular society. Non christians and those who do not follow this perticular book of hate should not be held by laws passed by a certian sects of outdated evangelical christianity in a secular society", 
   {}, 
   181519, 
   null, 
   1133007120.0
  ], 
  [
   181623, 
   null, 
   "Bassman", 
   "And if they don't consider it you will force them into it at all costs anyway. It's not like your God is really interested in faith that is sincere. He just wants a bunch of groveling ijuts who obey rules.\n\n OK, here is where grave misconceptions must be addressed. First, it's true that God has standards and morals that are absolute. That's His nature. But He doesn't force everyone into compliance. It's just the simple fact that tere are consequences to the decisions we make concerning His message. If we choose to accept Him through christ, then the benefits are overwhelming, to put it mildly. But when we choose to reject Him, then we'd best be prepared to face judgement.\n \\", 
   {}, 
   181544, 
   null, 
   1133024700.0
  ], 
  [
   181625, 
   null, 
   "joebrummer", 
   "OK, here is where grave misconceptions must be addressed. First, it's true that God has standards and morals that are absolute. That's His nature. But He doesn't force everyone into compliance. It's just the simple fact that tere are consequences to the decisions we make concerning His message. If we choose to accept Him through christ, then the benefits are overwhelming, to put it mildly. But when we choose to reject Him, then we'd best be prepared to face judgement.\n \\\n\n \n \n SHouldn't you move this to the religion forum? Causes really this has to do with religion not gay rights!", 
   {}, 
   181623, 
   null, 
   1133025240.0
  ], 
  [
   181638, 
   null, 
   "jitobear", 
   "OK, here is where grave misconceptions must be addressed. First, it's true that God has standards and morals that are absolute. That's His nature. But He doesn't force everyone into compliance. \n\n \n So why do you think that you get to?\n \n As long as you support laws against gay marriage or gay sex that is EXACTLY what you are doing. As there is not one shred of evidence of a valid SECULAR reason to support such legislation.\n \n And don't come back with your drivel about how it will hurt the traditional family, since I know good and well my family's existance does nothing to negate your's - but you happily disregard and would shred mine to appease your :xcensored religion.", 
   {}, 
   181623, 
   null, 
   1133030100.0
  ], 
  [
   181742, 
   null, 
   "jyoshu", 
   "These beliefs you express, jyoshu, are immoral.\n\n \n In your opinion.\n \n Besides, how can it be immoral if it's not acted out in any way? If it hurts no one? And it doesn't.\n \n \nHow you act on those beliefs outside the institution is another matter.\n\n \n And that's the point, really. As you undoubtedly know, there's a difference between holding to a moral view and hurting people. Just because I or others hold to the view that gay relationships are immoral, it doesn't mean we hurt gay people. The gay pride movement has long taken the strategy of blurring the line between those two things, because they know that it might be advantageous to lie by making people think that people who even have that view are out to harm gay people. That's why you all often make no distinction between those who commit horrible acts of murder and those who simply hold to a moral view. It's why you all intentionally use both in the same posts and points. It's a tactic, pure and simple. \n \n \nThere also may be social pressure coming to your religious institution to change, \n\n \n And I hope they stand strong as they have on so many other moral issues. Social change and political correctness is no excuse to condone immorality.", 
   {}, 
   181370, 
   null, 
   1133059020.0
  ], 
  [
   181757, 
   null, 
   "JakeCJB", 
   "In your opinion.\n \n Besides, how can it be immoral if it's not acted out in any way? If it hurts no one? And it doesn't.\n \n \n \n And that's the point, really. As you undoubtedly know, there's a difference between holding to a moral view and hurting people. Just because I or others hold to the view that gay relationships are immoral, it doesn't mean we hurt gay people. The gay pride movement has long taken the strategy of blurring the line between those two things, because they know that it might be advantageous to lie by making people think that people who even have that view are out to harm gay people. That's why you all often make no distinction between those who commit horrible acts of murder and those who simply hold to a moral view. It's why you all intentionally use both in the same posts and points. It's a tactic, pure and simple.\n\n \n My view is, that's a little naieve. Gay people get the harmful message from early in their lives that their sexuality is viewed negatively, or is somehow inferior in relation to the sexuality of the majority. Those who murder gay people got that message too.\n \n \nAnd I hope they stand strong as they have on so many other moral issues. Social change and political correctness is no excuse to condone immorality.\n\n \n Gay people are everywhere. It's becoming much more hard to keep us in closets.", 
   {}, 
   181742, 
   null, 
   1133070000.0
  ], 
  [
   181758, 
   null, 
   "Freedom Fighter", 
   "That's where your wrong Matt. Salvation means a changed life. And contrary to what you might think, God forbids homosexual relations.\n \n \n \n Evangelical Christianity's message is one of repentance and eternal life. But the kicker here is that we must surrender control of our lives to God.\n\n \n I'm actually an Evengelical Lutheran, yet I believe in marriage bettween any two loving people. I have found no reference that says God hates anyone, he loves all. There is actually no proof in the Bible about being gay as a sin either. Give me the chapters and verses, I will read them and then decide. As for now if it is truely how they believe they want to live their life, they can, there is nothing against it.", 
   {}, 
   181348, 
   null, 
   1133070360.0
  ], 
  [
   181829, 
   null, 
   "jyoshu", 
   "My view is, that's a little naieve. Gay people get the harmful message from early in their lives that their sexuality is viewed negatively\n\n \n So what you really want is no negativity. Sorry, that's not what life is like. I'm sure there are things I do that others view negatively as well, but you don't hear me complaining about it constantly. It's part of living in society--we have to accept that not everyone is going to view everything we do in life in a positive light. In short . . . suck it up and grow some skin. That's what everyone else has to do when we encounter people that doesn't view our actions in a positive light. Agree or disagree with them, but deal with it. It's life.", 
   {}, 
   181757, 
   null, 
   1133122800.0
  ], 
  [
   181856, 
   null, 
   "joebrummer", 
   "So what you really want is no negativity. Sorry, that's not what life is like. I'm sure there are things I do that others view negatively as well, but you don't hear me complaining about it constantly. It's part of living in society--we have to accept that not everyone is going to view everything we do in life in a positive light. In short . . . suck it up and grow some skin. That's what everyone else has to do when we encounter people that doesn't view our actions in a positive light. Agree or disagree with them, but deal with it. It's life.\n\n \n \n \n Are you really blind and jaded enough to think that if you took the actions out of it, somehow it would all change? Do you think that bashers would stop bashing if they heard their victim say \"oh but I am not an active gay person, I don't engage in gay sex\" Do you think this would change anything?\n \n I love this little ignorant comment....suck it up and grow some skin....hey you call up Judy Shepard and tell her that...suck it up and grow some skin......\n \n \n If this were black people, jews, women, or christians being told that early in life that the world had negative attitudes to them would you still just say ignorantly they should suck it up and grow some skin?", 
   {}, 
   181829, 
   null, 
   1133125740.0
  ], 
  [
   181892, 
   null, 
   "melsucceeds", 
   "Below is a transcript from ex-gay Stephen Bennett's Radio Show. For those of you who don't know much about this guy, he says funnier stuff than Jerry Falwell on drugs.....\n \n The laugh...count the number of times this \"ex-gay\" says...\"my wife\" \n \n \n I used to be gay, but now I have a wife. Here's my wife. Have you met my wife Irene? Say hi, Irene. You see, I used to be a promiscuous homosexual, but now Irene is my wife. You know, Irene, my wife who you just met? She's my wife, because I'm no longer XXXXX. We're here to tell others that you too can stop being XXXXX and have a wife, just like me, Stephen Bennett, who is talking to you now alongside my beautiful wife Irene. What should we talk about today, wife Irene? Oh I know, let's talk about how you can leave homosexuality, like me, Stephen Bennett. Because you see, if you actually succeed in becoming an \"ex-gay,\" you are required to talk about nothing else besides your \"former homosexuality\" for all of eternity. Isn't that right, wife Irene, who I \"former homosexually\" love. You too can become a former 'mo, if you pray real hard. Right, wife Irene? Let's talk about that.\n \n \n ME DOTH THINK ONE PROTEST TO MUCH!\n\n \n I'm surprised that some of you heterosexuals can't tell that Stephen has serious problems. He is trying to make himself believe that he is not gay or bisexual. That's why he says \"my wife\" countless times on his radio show. Sexual behavior can be changed, but sexual orientation or desires for the opposite or same sex cannot be changed.", 
   {
    "post_info": {
     "post_title": "Heterosexuals"
    }
   }, 
   181187, 
   null, 
   1133140800.0
  ], 
  [
   181899, 
   null, 
   "joebrummer", 
   "I'm surprised that some of you heterosexuals can't tell that Stephen has serious problems. He is trying to make himself believe that he is not gay or bisexual. That's why he says \"my wife\" countless times on his radio show. Sexual behavior can be changed, but sexual orientation or desires for the opposite or same sex cannot be changed.\n\n \n \n \n Mel,\n that is the giiggles part of the post! The laughs come from his statements. The reaity is, he isn't that funny, he is dangerous. He spreads of message of hate so far and wide it makes me worry!\n \n He is next on my list of targets for boycott! Stop his supporters and advertisers, he hqs a first ammendment right to say what he wants, he doesn't have a right to get paid for it! www.Voicesagainsthate.org!", 
   {}, 
   181892, 
   null, 
   1133141460.0
  ], 
  [
   181902, 
   null, 
   "melsucceeds", 
   "Mel,\n that is the giiggles part of the post! The laughs come from his statements. The reaity is, he isn't that funny, he is dangerous. He spreads of message of hate so far and wide it makes me worry!\n \n He is next on my list of targets for boycott! Stop his supporters and advertisers, he hqs a first ammendment right to say what he wants, he doesn't have a right to get paid for it! www.Voicesagainsthate.org!\n\n \n Exactly! It is really sad that other gay folks could hate on their own. I think we could help eliminate most gay prejudice if other gay people spoke out ignorance and prejudice. Unfortunately, I think most of us are wounded in a heterosexist society and some of us are just selfish cowards.", 
   {}, 
   181899, 
   null, 
   1133142780.0
  ], 
  [
   181911, 
   null, 
   "jyoshu", 
   "Are you really blind and jaded enough to think that if you took the actions out of it, somehow it would all change? Do you think that bashers would stop bashing if they heard their victim say \"oh but I am not an active gay person, I don't engage in gay sex\" Do you think this would change anything?\n\n \n I don't know about gay bashers; I am not one and that's a different topic that the moral question. I guess you'll just have to ask a gay basher sometime. I can say that, for me, it's not about the innateness issue. And I very confidently believe that that's the way it is with most people who are concerned about the moral issue.\n \n \nI love this little ignorant comment....suck it up and grow some skin....hey you call up Judy Shepard and tell her that...suck it up and grow some skin......\n\n \n Judy Shepard is the parent of someone who suffered at the hands of murderers, not people who had negativity or a moral disagreement about gay behavior. The men who killed Matthew Shepard had serious issues. If they simply had moral disapproval over gay relationships, the murder would never have taken place. \n \n \nIf this were black people, jews, women, or christians being told that early in life that the world had negative attitudes to them would you still just say ignorantly they should suck it up and grow some skin?\n\n \n Those weren't moral issues.", 
   {}, 
   181856, 
   null, 
   1133148300.0
  ], 
  [
   181916, 
   null, 
   "joebrummer", 
   "I don't know about gay bashers; I am not one and that's a different topic that the moral question. I guess you'll just have to ask a gay basher sometime. I can say that, for me, it's not about the innateness issue. And I very confidently believe that that's the way it is with most people who are concerned about the moral issue.\n \n \n \n Judy Shepard is the parent of someone who suffered at the hands of murderers, not people who had negativity or a moral disagreement about gay behavior. The men who killed Matthew Shepard had serious issues. If they simply had moral disapproval over gay relationships, the murder would never have taken place. \n \n \n \n \n \n Those weren't moral issues.\n\n \n \n Your ability to back yourself away from hate rings hollow, nice try! But most here can see through it!", 
   {}, 
   181911, 
   null, 
   1133152140.0
  ], 
  [
   181958, 
   null, 
   "jyoshu", 
   "Your ability to back yourself away from hate rings hollow, nice try! But most here can see through it!\n\n \n I don't have to back away from anything because there's nothing to back away from. I don't hate gay people; it's that simple. It's not my problem that you are determined to read hate into everything you disagree with. That's YOUR problem, not mine. [shrug]", 
   {}, 
   181916, 
   null, 
   1133192880.0
  ], 
  [
   182113, 
   null, 
   "tonybrown74", 
   "Are you really blind and jaded enough to think that if you took the actions out of it, somehow it would all change? Do you think that bashers would stop bashing if they heard their victim say \"oh but I am not an active gay person, I don't engage in gay sex\" Do you think this would change anything?\n \n\n \n I would actually classify this statement as ignorant. People are bashed because they are perceived as gay. Whether or not the victim is actually gay is irrelevant.\n \n Straight man who who likes the arts? Gay ...\n \n Straight man who is effeminate? Gay ...\n \n Tomboy? Gay ...\n \n Woman with short haircut, sensible shoes and pants? Gay ...\n \n Feminist (woman)? Gay ...\n \n Feminist (man)? Gay ...", 
   {}, 
   181856, 
   null, 
   1133223240.0
  ], 
  [
   182196, 
   null, 
   "JakeCJB", 
   "So what you really want is no negativity. Sorry, that's not what life is like. I'm sure there are things I do that others view negatively as well, but you don't hear me complaining about it constantly. It's part of living in society--we have to accept that not everyone is going to view everything we do in life in a positive light. In short . . . suck it up and grow some skin. That's what everyone else has to do when we encounter people that doesn't view our actions in a positive light. Agree or disagree with them, but deal with it. It's life.\n\n \n Speaking of dealing with it, you didn't deal with the issue at all. Why should gay people be taught by society to be ashamed of their sexuality, or to view their sexuality in any negative way by itself, or in comparison to heterosexuality?", 
   {}, 
   181829, 
   null, 
   1133250180.0
  ], 
  [
   182200, 
   null, 
   "JakeCJB", 
   "I don't know about gay bashers; I am not one and that's a different topic that the moral question. I guess you'll just have to ask a gay basher sometime. I can say that, for me, it's not about the innateness issue. And I very confidently believe that that's the way it is with most people who are concerned about the moral issue.\n \n \n \n Judy Shepard is the parent of someone who suffered at the hands of murderers, not people who had negativity or a moral disagreement about gay behavior. The men who killed Matthew Shepard had serious issues. If they simply had moral disapproval over gay relationships, the murder would never have taken place. \n \n \n \n Those weren't moral issues.\n\n \n None of this happens in a vacuum. Those who murder gay people see being gay, as a moral issue too. Also, calling something a \"moral issue\", doesn't make the negative way gay sexuality is dealt with by society, a good thing.", 
   {}, 
   181911, 
   null, 
   1133250840.0
  ], 
  [
   182252, 
   null, 
   "jyoshu", 
   "Speaking of dealing with it, you didn't deal with the issue at all. Why should gay people be taught by society to be ashamed of their sexuality, or to view their sexuality in any negative way by itself, or in comparison to heterosexuality?\n\n \n No one here is saying society should \"teach\" gay people anything! Where do you come up with this stuff??? It sounds like it comes right off of gay pride propaganda web sites, which I suspect you must visit often. I'm not talking about \"teaching\" gay people anything, I'm talking about holding to a moral view about gay behavior. Listen, no one can make you adhere to my beliefs. And I'm not even out to make you adhere to my beliefs. I'm not out to \"teach\" you anything, here. I AM defending my right to believe as I choose, and for others to believe as they choose. This is as much a freedom of religion issue as anything.\n \n \nNone of this happens in a vacuum. Those who murder gay people see being gay, as a moral issue too. \n\n \n You're right, people who murder gay people DON'T do it in a vacuum. There are any number of issues that might contribute to it. Maybe their parents mistreated them; maybe they were abused as a child; maybe they had to grow up without any parental love; maybe they're just evil people. I hope you see my point here: ANYTHING could be claimed to contribute to this. The killers of Shepard are the ones responsible for his death, not everyone else. And it's pretty much impossible to nail down what ultimately influences or leads to these horrible acts. \n \n But ironically, even if it COULD be determined that the moral view about homosexual relationships in society was a direct cause of violence, it still wouldn't be good reason to police belief or impose on people to stop believing a certain way. Instead of doing that, we should allow people to believe the way they want to, but also help them to differentiate such beliefs from violence and promote acting on such beliefs peacefully. The answer isn't to try to tell people how to believe (as you seem to think it is), but for people to be free to believe the way they want yet do it in a peaceful way. If Shepard's killers were motivated by their moral belief about gay relationships, their error wasn't in having the moral belief, but in acting on it in a violent way. And THAT is what must be dealt with.", 
   {}, 
   182196, 
   null, 
   1133281800.0
  ], 
  [
   182341, 
   null, 
   "melsucceeds", 
   "I would actually classify this statement as ignorant. People are bashed because they are perceived as gay. Whether or not the victim is actually gay is irrelevant.\n \n Straight man who who likes the arts? Gay ...\n \n Straight man who is effeminate? Gay ...\n \n Tomboy? Gay ...\n \n Woman with short haircut, sensible shoes and pants? Gay ...\n \n Feminist (woman)? Gay ...\n \n Feminist (man)? Gay ...\n\n \n Tony, I agree somewhat but I think the majority of effeminate guys are gay. I'm assuming that there might be less than one percent of straight guys who are effeminate.", 
   {}, 
   182113, 
   null, 
   1133295780.0
  ], 
  [
   182352, 
   null, 
   "tonybrown74", 
   "Tony, I agree somewhat but I think the majority of effeminate guys are gay. I'm assuming that there might be less than one percent of straight guys who are effeminate.\n\n \n That may be, but 'effeminate' can be a subjective issue as well.", 
   {}, 
   182341, 
   null, 
   1133300040.0
  ], 
  [
   182400, 
   null, 
   "JakeCJB", 
   "No one here is saying society should \"teach\" gay people anything! Where do you come up with this stuff??? It sounds like it comes right off of gay pride propaganda web sites, which I suspect you must visit often. I'm not talking about \"teaching\" gay people anything, I'm talking about holding to a moral view about gay behavior. Listen, no one can make you adhere to my beliefs. And I'm not even out to make you adhere to my beliefs. I'm not out to \"teach\" you anything, here. I AM defending my right to believe as I choose, and for others to believe as they choose. This is as much a freedom of religion issue as anything.\n\n \n You are ignoring the social affects, by repeating this mantra of morality. This is about morality for our side too.\n \n \nYou're right, people who murder gay people DON'T do it in a vacuum. There are any number of issues that might contribute to it. Maybe their parents mistreated them; maybe they were abused as a child; maybe they had to grow up without any parental love; maybe they're just evil people. I hope you see my point here: ANYTHING could be claimed to contribute to this.\n\n \n The point is, I was talking about something else that may help contribute to it. These are all bad things.\n \n \nThe killers of Shepard are the ones responsible for his death, not everyone else.\n\n \n They don't live in a vacuum, was the point I was making.\n \n \nAnd it's pretty much impossible to nail down what ultimately influences or leads to these horrible acts.\n\n \n Do you think the belief that homosexuality is inferior to heterosexuality was a significant factor? I certainly believe it is. You refuse to acknowledge this social reality, it seems to me. \n \n \nBut ironically, even if it COULD be determined that the moral view about homosexual relationships in society was a direct cause of violence, it still wouldn't be good reason to police belief or impose on people to stop believing a certain way. Instead of doing that, we should allow people to believe the way they want to, but also help them to differentiate such beliefs from violence and promote acting on such beliefs peacefully. The answer isn't to try to tell people how to believe (as you seem to think it is), but for people to be free to believe the way they want yet do it in a peaceful way. If Shepard's killers were motivated by their moral belief about gay relationships, their error wasn't in having the moral belief, but in acting on it in a violent way. And THAT is what must be dealt with.\n\n \n Both violence, and its roots, must be tackled. Yes, even if gay people are the ones affected! Do you believe because you call this a morality issue, which either side can do, there are no negative social affects on gay people worth considering? Why do you not acknowledge the affects on gay people?", 
   {}, 
   182252, 
   null, 
   1133314860.0
  ], 
  [
   182484, 
   null, 
   "jyoshu", 
   "You are ignoring the social affects, by repeating this mantra of morality.\n\n \n Social effects, whether real or imagined, should never trump one's right to hold to a moral view. Especially when you can't even really show the line between causation and effect here.\n \n \nDo you think the belief that homosexuality is inferior to heterosexuality was a significant factor? I certainly believe it is. You refuse to acknowledge this social reality, it seems to me. \n\n \n It may have been. But where they went wrong was in the way they acted on it. They used it as a justification to kill someone. \n \n \nBoth violence, and its roots, must be tackled. Yes, even if gay people are the ones affected! Do you believe because you call this a morality issue, which either side can do, there are no negative social affects on gay people worth considering? Why do you not acknowledge the affects on gay people?\n\n \n As you know, I do acknowledge the effects on gay people. But our goal should not be telling people how they should believ or what religious beliefs they should have. It should be to show them that violence is not right. Again, the error that the killers of Matthew Shepard made wasn't in their moral view (which we don't even know what they were for sure); it was the fact that they killed someone. It was in the way they acted on their morality. Lots of people hold to a moral view that homosexual relationships are wrong but they would never do what these men did.", 
   {}, 
   182400, 
   null, 
   1133367060.0
  ], 
  [
   182545, 
   null, 
   "tonybrown74", 
   "Social effects, whether real or imagined, should never trump one's right to hold to a moral view. Especially when you can't even really show the line between causation and effect here. \n\n \n \"Moral views,\" like opinions, are something everyone is entitled to. However, just like opinions, all moral values aren't valid.\n \n \nIt may have been. But where they went wrong was in the way they acted on it. They used it as a justification to kill someone. \n\n \n Well, murder based on these \"moral values\" aren't that isolated. That said, don't you think that something may be wrong with those moral values, especially since they seem to always come up when a murder or assault happenes on gay people?\n \n \nAs you know, I do acknowledge the effects on gay people. But our goal should not be telling people how they should believ or what religious beliefs they should have. It should be to show them that violence is not right. Again, the error that the killers of Matthew Shepard made wasn't in their moral view (which we don't even know what they were for sure); it was the fact that they killed someone. It was in the way they acted on their morality. Lots of people hold to a moral view that homosexual relationships are wrong but they would never do what these men did.\n\n \n You could believe that the moon is made out of swiss cheese. Does that mena I should take your beliefs seriously?\n \n Many people may beleive that homosexual relationships are wrong, and there may be relatively few people that act in such a way that Matthew Shepard's killers did. But if all the people who go out and murder or assault gay people use the same beliefs to justify their actions, shouldn't you at the very least question those beliefs?", 
   {}, 
   182484, 
   null, 
   1133393280.0
  ], 
  [
   182571, 
   null, 
   "jyoshu", 
   "\"Moral views,\" like opinions, are something everyone is entitled to. However, just like opinions, all moral values aren't valid.\n\n \n Yet you are not the one who decides that. \n \n \nWell, murder based on these \"moral values\" aren't that isolated. That said, don't you think that something may be wrong with those moral values, especially since they seem to always come up when a murder or assault happenes on gay people?\n\n \n No, no more than when it comes up when someone is killed out of a belief that any other action is morally wrong. Violence for such a thing is always wrong, and that's what should be dealt with.\n \n \nYou could believe that the moon is made out of swiss cheese. Does that mena I should take your beliefs seriously?\n\n \n I don't care whether or not you take it seriously.\n \n \nMBut if all the people who go out and murder or assault gay people use the same beliefs to justify their actions, shouldn't you at the very least question those beliefs?\n\n \n They aren't the same beliefs. Their beliefs are \"it's ok to murder gay people.\" My beliefs are \"violence is wrong against anyone\" and \"gay relatioships are wrong.\" I also hold to the view that stealing is wrong. But one can have the view that stealing is wrong EVEN IF some people have been killed for stealing things. \n \n And I certainly HAVE questioned my beliefs on this. Contrary to the hateful and condescending propaganda of your movement that anyone who holds to my views are just \"primitive\" thinking Bible-thumping grunts, I came to my conclusions after a lot of thinking and soul-searching. And after going through that process, I realized that it's ok to have such moral beliefs based in religion. I also have the moral belief that murder is very, very wrong, or any violence in this case. So rest easy--you'll never be able to use an action of violence by me against Christians everywhere, because there won't be any such action.", 
   {}, 
   182545, 
   null, 
   1133397600.0
  ], 
  [
   182613, 
   null, 
   "JakeCJB", 
   "Social effects, whether real or imagined, should never trump one's right to hold to a moral view. Especially when you can't even really show the line between causation and effect here.\n\n \n Gay people are singled out for inferior treatment, bias, discrimination, prejudice, exclusion, and violence. This happens because of the belief that homosexuality is inferior to heterosexuality, and the belief the homosexual minority is a threat to society. If those who hold those beliefs don't have a rational or logical reason to hold that belief, I will challenge it, because it does have unnecessary negative effects on gay people.", 
   {}, 
   182484, 
   null, 
   1133411820.0
  ], 
  [
   182709, 
   null, 
   "tonybrown74", 
   "Yet you are not the one who decides that. \n\n \n What makes you think that your moral values should dictate how society should treat and value me, especially if there is no empirical data to show how your moral values are justified?\n \n As a citizen, I have more than the right to challenge your beliefs if you decided to make it policy.\n \n \nNo, no more than when it comes up when someone is killed out of a belief that any other action is morally wrong. Violence for such a thing is always wrong, and that's what should be dealt with.\n\n \n And here's the thing that you deliberately ignore. I can show how it is wrong to kill someone. I can even show that, because the murderer uses his own values to justify his actions, that her/his moral values are at the very least corrupt. I can also show that, if you share the same moral values as said murderer, that your own moral values are suspect.\n \n \nI don't care whether or not you take it seriously.\n\n \n That much is obvious.\n \n \nThey aren't the same beliefs. Their beliefs are \"it's ok to murder gay people.\" My beliefs are \"violence is wrong against anyone\" and \"gay relatioships are wrong.\" I also hold to the view that stealing is wrong. But one can have the view that stealing is wrong EVEN IF some people have been killed for stealing things.\n \n \n And we have been in this place before jyoshu. You cannot say it is okay for gay peoiple to get couples benefits and then say that your morals tell you that gay relationships are wrong. It is because of this that I call bullsh*t on your morals.", 
   {}, 
   182571, 
   null, 
   1133460900.0
  ], 
  [
   182721, 
   null, 
   "Phunting", 
   "And we have been in this place before jyoshu. You cannot say it is okay for gay peoiple to get couples benefits and then say that your morals tell you that gay relationships are wrong. It is because of this that I call bullsh*t on your morals.\nWhy can Jyoshu not say that? Can one not dislike say drug use and yet support de-criminalisation? And I don't see how the morals of one really 'bullsh*it' over another.", 
   {}, 
   182709, 
   null, 
   1133463180.0
  ], 
  [
   182731, 
   null, 
   "MrWriteLA", 
   "An arbitrary \"morality\" with no explainable rationale is always bullsh*t.", 
   {}, 
   182721, 
   null, 
   1133463960.0
  ], 
  [
   182762, 
   null, 
   "tonybrown74", 
   "Why can Jyoshu not say that? Can one not dislike say drug use and yet support de-criminalisation? And I don't see how the morals of one really 'bullsh*it' over another.\n\n \n He is stating that same-sex relationships are immoral without explanation. Yet it is okay for government to support those immoral relationships by way of benefits, but not recognition?\n \n How does this even remotely compare to not liking drugs/drug use, yet support decriminalization?", 
   {}, 
   182721, 
   null, 
   1133475420.0
  ], 
  [
   191586, 
   null, 
   "Ariana", 
   "I'm surprised that some of you heterosexuals can't tell that Stephen has serious problems. He is trying to make himself believe that he is not gay or bisexual. That's why he says \"my wife\" countless times on his radio show. Sexual behavior can be changed, but sexual orientation or desires for the opposite or same sex cannot be changed.\n\n \n Hey don't lump all of us heterosexuals together. I've been laughing at Stephen for awhile now. By the way, I'm all for gay marriage. No one has ever been able to give me proof from the Constitution, Bill of Rights, or the bible that gay marriage is wrong. What 2 (or maybe more) consenting adults want to do sexually is their choice. And if religion has anything to do with it, then it is between them and god/s. Not YOU and god/s.", 
   {}, 
   181892, 
   null, 
   1137032100.0
  ], 
  [
   191589, 
   null, 
   "Matthew S", 
   "Hey don't lump all of us heterosexuals together. I've been laughing at Stephen for awhile now. By the way, I'm all for gay marriage. No one has ever been able to give me proof from the Constitution, Bill of Rights, or the bible that gay marriage is wrong. What 2 (or maybe more) consenting adults want to do sexually is their choice. And if religion has anything to do with it, then it is between them and god/s. Not YOU and god/s.\n\n \n \n HORRAY Thankyou emoticon_love emoticon_xbouncer :) emoticon_cool emoticon_xagree emoticon_xgoodemoticon_xlove", 
   {}, 
   191586, 
   null, 
   1137032280.0
  ], 
  [
   191628, 
   null, 
   "Bickazer", 
   "Personally, I think religion is going to die out in the next millennia or so...because according to Isaac Asimov, the Galactic Empire has no religion and the barbarian kingdoms near the Foundation accept science only as a religion and *babble babble*\n \n Forgive me. I read too much science fiction, which reminds me that I have to borrow Foundation's Edge (or whatever it was called...) someday...\n \n @Bassman: Are you really being SERIOUS with everything you say? I've never seen anyone act like that before, unless they were joking. I'm not sure whether I should really take you seriously, or just laugh nervously and think you're acting the way you do for laughs. I'm totally muddled. I've never seen a single Christian before in my entire life act as you do. O___O", 
   {}, 
   191589, 
   null, 
   1137037320.0
  ], 
  [
   191639, 
   null, 
   "coolcodemn3", 
   "@Bassman: Are you really being SERIOUS with everything you say? I've never seen anyone act like that before, unless they were joking. I'm not sure whether I should really take you seriously, or just laugh nervously and think you're acting the way you do for laughs. I'm totally muddled. I've never seen a single Christian before in my entire life act as you do. O___O\n\n He is just telling poeple what he and I believe in. And you cant argue about what we believe in, you wont win. I dont see what is so shocking by Bassman's actions. And religion wont ever end, there will always be some type of religion out there.", 
   {}, 
   191628, 
   null, 
   1137040980.0
  ], 
  [
   191835, 
   null, 
   "Bickazer", 
   "He is just telling poeple what he and I believe in. And you cant argue about what we believe in, you wont win. I dont see what is so shocking by Bassman's actions. And religion wont ever end, there will always be some type of religion out there.\n\n \n It's just that is statements are so extreme...I have trouble taking them seriously, and I wonder whether or not he's joking. The only times I've ever seen anyone previously act like that was in jest. I can't shake the notion that an adult human being could hold as extreme views as he does...\n \n I think all my hope for humanity just went spiraling down the drain.", 
   {}, 
   191639, 
   null, 
   1137121200.0
  ], 
  [
   191857, 
   null, 
   "coolcodemn3", 
   "It's just that is statements are so extreme...I have trouble taking them seriously, and I wonder whether or not he's joking. The only times I've ever seen anyone previously act like that was in jest. I can't shake the notion that an adult human being could hold as extreme views as he does...\n \n I think all my hope for humanity just went spiraling down the drain.\n\n How are his statements extreme?", 
   {}, 
   191835, 
   null, 
   1137127560.0
  ], 
  [
   191890, 
   null, 
   "Matthew S", 
   "How are his statements extreme?\n\n \n \n The fact that he believes Reagan was the best president ever, even better then Lincoln, and Washington.", 
   {}, 
   191857, 
   null, 
   1137163860.0
  ], 
  [
   191907, 
   null, 
   "jyoshu", 
   "He is stating that same-sex relationships are immoral without explanation. Yet it is okay for government to support those immoral relationships by way of benefits, but not recognition?\n\n \n The govt. benefit question and the morality question are two different things. I don't understand why you don't get that.", 
   {}, 
   182762, 
   null, 
   1137169080.0
  ], 
  [
   191961, 
   null, 
   "tonybrown74", 
   "The govt. benefit question and the morality question are two different things. I don't understand why you don't get that.\n\n \n There is nothing to get.\n \n If you choose to use your morals to based government recognition of same-sex couples, then I am allowed to challenge you on it, because your morals now affect me personally. The bible says nothing about same-sex couples, yet the government should not recognize them. However (according to your interpretation), the bible does speak out against sex between people of the same sex, yet it's okay for government to grant benefits based on those actions? \n \n Is your mind swirling from the inconsistencies yet?", 
   {}, 
   191907, 
   null, 
   1137177300.0
  ], 
  [
   191997, 
   null, 
   "jyoshu", 
   "There is nothing to get.\n \n If you choose to use your morals to based government recognition of same-sex couples, then I am allowed to challenge you on it, because your morals now affect me personally. The bible says nothing about same-sex couples, yet the government should not recognize them. However (according to your interpretation), the bible does speak out against sex between people of the same sex, yet it's okay for government to grant benefits based on those actions? \n\n \n Yep. Because our govt. is based on the Bible. The Bible also says that it's wrong to lie. But we don't take free-speech benefits away from liars. By your views there could be no such thing as someone who morally disagrees with homosexuality but supports legal rights for them. That's ludicrous. The religious issue and the civil one are two different matters.", 
   {}, 
   191961, 
   null, 
   1137184320.0
  ], 
  [
   192018, 
   null, 
   "tonybrown74", 
   "Yep. Because our govt. is based on the Bible. The Bible also says that it's wrong to lie. But we don't take free-speech benefits away from liars. By your views there could be no such thing as someone who morally disagrees with homosexuality but supports legal rights for them. That's ludicrous. The religious issue and the civil one are two different matters.\n\n \n Ah ...\n \n I see ...\n \n We are dealing from different realities. My bad ...\n \n In my reality, our government is not based on the bible. Otherwise adultery and idol worship would be unconstitutional. Which they aren't, at least in my reality.\n \n Still doesn't change the fact that the bible has nothing to say with regards to same-sex marriage. So why should the government in your reality not recognize same-sex marriage?", 
   {}, 
   191997, 
   null, 
   1137186480.0
  ], 
  [
   192021, 
   null, 
   "jyoshu", 
   "Ah ...\n \n I see ...\n \n We are dealing from different realities. My bad ...\n \n In my reality, our government is not based on the bible. Otherwise adultery and idol worship would be unconstitutional. Which they aren't, at least in my reality.\n \n Still doesn't change the fact that the bible has nothing to say with regards to same-sex marriage. So why should the government in your reality not recognize same-sex marriage?\n\n \n I'm sorry, I mistyped. It is NOT based on the Bible--I agree with you on this.\n \n That's the very reason that the moral question and the legal ones are separate. It was a typo, sorry", 
   {}, 
   192018, 
   null, 
   1137186600.0
  ], 
  [
   192157, 
   null, 
   "coolcodemn3", 
   "The fact that he believes Reagan was the best president ever, even better then Lincoln, and Washington.\n\n he did save the world from nuclear disaster... BBut that doesnt mean the other two weren't great presidents. And waht does that have to do with his religious belief?", 
   {}, 
   191890, 
   null, 
   1137231900.0
  ], 
  [
   192164, 
   null, 
   "Matthew S", 
   "he did save the world from nuclear disaster... BBut that doesnt mean the other two weren't great presidents. And waht does that have to do with his religious belief?\n\n \n \n What by almost causing a nuclear war?", 
   {}, 
   192157, 
   null, 
   1137242400.0
  ], 
  [
   192485, 
   null, 
   "coolcodemn3", 
   "What by almost causing a nuclear war?\n\n Actually by stopping one. Just the fact that he stopped one.", 
   {}, 
   192164, 
   null, 
   1137367140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Just for giggles and laughs...", 
  "url": "http://www.4forums.com/political/gay-rights-debates/6915-just-giggles-laughs.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 6915, 
  "discussion_files": [
   [
    "32929.html", 
    "http://www.4forums.com/political/gay-rights-debates/6915-just-giggles-laughs-print.html"
   ], 
   [
    "32930.html", 
    "http://www.4forums.com/political/gay-rights-debates/6915-just-giggles-laughs-5-print.html"
   ], 
   [
    "32931.html", 
    "http://www.4forums.com/political/gay-rights-debates/6915-just-giggles-laughs-4-print.html"
   ], 
   [
    "32932.html", 
    "http://www.4forums.com/political/gay-rights-debates/6915-just-giggles-laughs-3-print.html"
   ], 
   [
    "32933.html", 
    "http://www.4forums.com/political/gay-rights-debates/6915-just-giggles-laughs-2-print.html"
   ]
  ], 
  "identifier": 6915
 }
]