[
 [
  [
   181397, 
   null, 
   "daewoo", 
   "http://www.washingtonpost.com/wp-dyn/content/article/2005/11/22/AR2005112201516.html\n \n \nQUINCY, Mass. -- Thousands of low-income Massachusetts residents will receive discounted home heating oil this winter under an agreement signed Tuesday with Venezuela, whose government is a political adversary of the Bush administration.\n\n \n I think that is pretty much the nail int eh coffin of any proposed S American trade deal that Bush might try to pawn. Chavez is a good propaganda man. He is already spinning this as \"the Us does nto take care of their own poor, how can we expect them to care about the poor in S America??\" As well as \"I, Hugo the great, am taking care of Americas poor. Let me rule S America and I will take care of all the poor here, too\". \n \n An expensive move, but I think that is beautiful in its simplicity... and complexity. He looks good at home an din S America, makes the Bushies look like a bunch of self serving jackasses (not far off on that one anyway), and makes American big business look like a bunch of greedy killers. BUT THEN....Hugo the great steps in............\n \n Gotta love that guy, even if he is a nut job.", 
   {
    "post_info": {
     "post_title": "Brilliant move by Chavez"
    }
   }, 
   null, 
   null, 
   1132911600.0
  ], 
  [
   181423, 
   null, 
   "Jo Bennett", 
   "What makes you think he's a nutjob? Why not be optimistic and think that for the first time a leader who actually gives a damn about ordinary people has been elected and the US is in no position to depose him at present?", 
   {}, 
   181397, 
   null, 
   1132933980.0
  ], 
  [
   181425, 
   null, 
   "gamehuis", 
   "I wouldn't call Chavez a nutjob either. He's helped millions of his countrymen by teaching them how to read and write, by giving them free basic healthcare, and he has started a program to correct poor vision and blindness across the whole American continent.\n \n I'm not a big fan of socialism, but if you're gonna do it, do it like this.", 
   {}, 
   181423, 
   null, 
   1132934940.0
  ], 
  [
   181436, 
   null, 
   "daewoo", 
   "I don't think Chavez is a nutjob because of his political views. I think he is a nutjob because he is so paranoid. While some of his rantings, such as the claim that the US is putting a plan in place to invade his country, are not entirely off the wall (I personally think he may be right about that one), some of his others are just tin foil hat stuff, like his suggestion that the US may be using satellites to ruin crops.", 
   {}, 
   181425, 
   null, 
   1132944120.0
  ], 
  [
   181456, 
   null, 
   "Jo Bennett", 
   "I'd not heard that one, but given the experience of other left wing leaders in the region, a little paranoia can be forgiven, so long as it doesn't lead to totalitarianism.", 
   {}, 
   181436, 
   null, 
   1132950660.0
  ], 
  [
   181460, 
   null, 
   "daewoo", 
   "I'd not heard that one, but given the experience of other left wing leaders in the region, a little paranoia can be forgiven, so long as it doesn't lead to totalitarianism.\n\n \n It is hard to tell sometimes if comments like that actually mirror the beliefs of the guy making them, or if he is just trying to motivate the masses.", 
   {}, 
   181456, 
   null, 
   1132951800.0
  ], 
  [
   181624, 
   null, 
   "simone", 
   "I must mention Salvador Allende:\n \n \n. . . . Chile was then the site of the first democratically elected socialist government in the world, run by the socialist Salvado Allende. When the Allende government was overturned by the dictator Augusto Pinochet in a CIA backed coup. . . .\n\n \n http://www.oberlinreview.org/2003/temparchive/9/19/news/article4.htm\n \n Oh heck, I'd better mention Mohammed Mossedegh, too, who had the heretical idea that the oil of Iran belonged to Iran:\n \n \n. . . . Although official U.S. reports and published accounts described Mosaddeq's overthrow and the shah's restoration to power as inspired and carried out by Iranians, this was far from the full story. Memoirs of key CIA and British intelligence operatives and historical reconstructions of events have long established that a joint U.S.-British covert operation took place in mid-August, which had a crucial impact. . . . Now, a new volume of essays by leading historians of Iranian politics, the coup, and U.S. and British policy presents the most balanced, detailed, and up-to-date assessment of this landmark event to date. Based on new documentation and extensive interviews of participants, Mohammad Mosaddeq and the 1953 Coup in Iran (Syracuse University Press, 2004) offers an abundance of new information, analysis and insights into the staging of the overthrow as well as the historical, political, and social context which made it possible.\n \n Among the book's main conclusions is that Iranians and non-Iranians both played crucial parts in the coup's success. The CIA, with help from British intelligence, planned, funded and implemented the operation. When the plot threatened to fall apart entirely at an early point, U.S. agents on the ground took the initiative to jump-start the operation, adapted the plans to fit the new circumstances, and pressed their Iranian collaborators to keep going. Moreover, a British-led oil boycott, supported by the United States, plus a wide range of ongoing political pressures by both governments against Mosaddeq, culminating in a massive covert propaganda campaign in the months leading up to the coup helped create the environment necessary for success. . . . \n\n http://www.gwu.edu/~nsarchiv/NSAEBB/NSAEBB126/", 
   {}, 
   181460, 
   null, 
   1133025120.0
  ], 
  [
   181634, 
   null, 
   "gamehuis", 
   "I don't think Chavez is a nutjob because of his political views. I think he is a nutjob because he is so paranoid. While some of his rantings, such as the claim that the US is putting a plan in place to invade his country, are not entirely off the wall (I personally think he may be right about that one), some of his others are just tin foil hat stuff, like his suggestion that the US may be using satellites to ruin crops.\n\n Ah ok, I hadn't heard about The Evil Imperialist Satellite Scheme(tm). He definately scores some ParaPoints(tm) with that one.", 
   {}, 
   181436, 
   null, 
   1133028420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Brilliant move by Chavez", 
  "url": "http://www.4forums.com/political/economics-debates/6923-brilliant-move-chavez.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 6923, 
  "discussion_files": [
   [
    "23610.html", 
    "http://www.4forums.com/political/economics-debates/6923-brilliant-move-chavez-print.html"
   ]
  ], 
  "identifier": 6923
 }
]