[
 [
  [
   181430, 
   null, 
   "jsaid2009", 
   "Hevron Arabs Ask Jews For Help in Banishing Leftist Activists \n 12:24 Nov 24, '05 / 22 Cheshvan 5766\n By Ezra HaLevi\n \n \n \n Arab leaders in Hevron have contacted the city's Jewish leaders for help in getting rid of self-proclaimed anarchist volunteers who, they complain, are destroying their traditional way of life. \n \n \n \n The anarchists, many of whom are members of the International Solidarity Movement, flock to flashpoints throughout Judea and Samaria, ostensibly to help PA Arabs contend with IDF closures and protect them from harassment. In actuality, many of the volunteers seek confrontations with IDF soldiers and local Jewish residents, taking advantage of their Western passports to cause havoc - knowing that, at worst, they will be deported, not jailed.\n \n The local Arabs in the Hevron region whom the activists claim to be helping are now complaining that the American and European students behave in a provocative and offensive manner in Hevron's public areas. The Arabs say the activists disrespect the moral norms and standards of the local population. \n \n Several local Arab residents told the Kol Ha'Ir newspaper that the activists have been exposing the local youths to drug use and sexual promiscuity. \n \n One interviewee told Kol Ha'Ir that the volunteers show a disregard for the religious norms of the local villages and teach the local youth to reject and disrespect the traditions of their forefathers. \"These anarchists come here and undermine the education we give our children. At first we took them in with hospitality - after all, they claimed they wanted to help us, so why kick them out? But very quickly they infuriated me with their lewd behavior.\"\n \n In a bid to rid the region of the anarchists, local Arab leaders approached representatives of the Jewish community in Hevron - a rare, but not unheard of occurrence - in order to find a solution. The two sides agreed to have Arabic-speaking Jewish observers along Hevron's main thoroughfares to replace the anarchists in ensuring calm between the city's Jewish and Arab populations. The left-wing activists would then be informed by the local Arab population that they appreciate their offer to help, but that they are no longer needed.\n \n Hevron spokesman Noam Arnon confirmed the arrangement to Arutz-7, saying that the new replacement observers will be acceptable to local Arabs. He added that the international anarchists came to Hevron come from Western cultures steeped in sexual lewdness and depravity, permissiveness, and drug use. \"Their presence in Hebron serves to inflame violence because they are seeking to create provocations and encourage violence,\" Arnon said. \n \n He added that the observers end up causing more trouble for the local Arab population, by antagonizing soldiers and brazenly leading local Arabs in between Jewish homes. \n \n Arnon recalled a specific incident in which an Arab woman tried to stab an IDF soldier with a knife. The soldiers grabbed her, but were attacked by a group of anarchist volunteers who tried to free the woman and take the knife out of her hand and hide it.\n \n In recent months, Jewish organizations have also come to Hevron to stand up to the anarchist activists. The Jewish activists investigate the anarchists regarding their entry to Israel and strengthen the morale of the soldiers in withstanding attacks by leftist extremists. \n \n http://www.israelnationalnews.com/news.php3?id=93549", 
   {
    "post_info": {
     "post_title": "Hevron Arabs Ask Jews For Help in Banishing Leftist Activists"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1132937340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hevron Arabs Ask Jews For Help in Banishing Leftist Activists", 
  "url": "http://www.4forums.com/political/current-events-debates/6926-hevron-arabs-ask-jews-help-banishing-leftist-activists.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6926, 
  "discussion_files": [
   [
    "11039.html", 
    "http://www.4forums.com/political/current-events-debates/6926-hevron-arabs-ask-jews-help-banishing-leftist-activists-print.html"
   ]
  ], 
  "identifier": 6926
 }
]