[
 [
  [
   181461, 
   null, 
   "billsco", 
   "A historian in the NSA (National Security Agency) concluded that information obtained in the Gulf of Tonkin incident of August 1964 was deliberately falsified to make it appear North Vietnamese gunboats attacked an American destroyer patrolling in international waters.\n \n It has been widely assumed the attack was a mistaken cause of phantom radar blips, worsened by an edgy crew who were aware of a legitimate attack two days previous on another American ship. Most people have assumed it was an honest mistake. The historian, however, has determined that two mid-level employees deliberately manipulated intelligence information to make it appear as though the attack actually occurred.\n \n http://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2005/10/31/MNG99FGN521.DTL\n \n The Gulf of Tonkin incident gave President Lyndon Johnson the green light to escalate the war. Ten years later the quagmire was still raging on. \n \n The historian's conclusions have been known for about four years, but government officials were reluctant to release the information, fearing parallels would be drawn to the coming Iraq war. \n \n Question: Does the culpability end with the mid-level employees, or is there a wider conspiracy? Was Johnson itching for this war? He has been quoted as saying he \"knows where to look for power, where to find it, and how to use it.\"", 
   {
    "post_info": {
     "post_title": "Gulf of Tonkin Conspiracy?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1132952700.0
  ], 
  [
   181482, 
   null, 
   "Master_Shake", 
   "I'm not saying I'm sure that JBJ was invloved in making something like that happen, but I sure as heck wouldn't be surprised if he had.", 
   {}, 
   181461, 
   null, 
   1132961040.0
  ], 
  [
   181607, 
   null, 
   "Symbiote", 
   "The Gulf of Tonkin incident was certainly staged, it was as much as admitted in the Northwoods document by the joint chiefs of staff, where faking a Cuban attack on American troops/interests is described as \"creating a \"Gulf of Tonkin\" incident. I don't know who exactly would have decided for it to go ahead, it seems to me unlikely that mid-level employees would orchestrate such a thing.", 
   {}, 
   181482, 
   null, 
   1133014560.0
  ], 
  [
   181608, 
   null, 
   "Alan Ryan", 
   "Although in his national television address, LBJ described the attacks on two American destroyers as \"unprovoked\", isn't it true that the ships had in fact been monitoring South Vietnamese raids against two North Vietnamese islands, and these raids had been planned by US military advisors ? \n \n Perhaps the Tonkin incident is best described as a snare deliberately set by American agents provocateurs.", 
   {}, 
   181607, 
   null, 
   1133015460.0
  ], 
  [
   181621, 
   null, 
   "georged", 
   "\n \n The historian's conclusions have been known for about four years, but government officials were reluctant to release the information, fearing parallels would be drawn to the coming Iraq war. \n \n Question: Does the culpability end with the mid-level employees, or is there a wider conspiracy? Was Johnson itching for this war? He has been quoted as saying he \"knows where to look for power, where to find it, and how to use it.\"\n\n \n Nothing happens in our government without approval, formal or otherwise, from the top. We have a bureaucratic system, including the military, where CYA is the primary belief system.", 
   {
    "unicode_changes_made": true
   }, 
   181461, 
   null, 
   1133021460.0
  ], 
  [
   417242, 
   null, 
   "jimtranr", 
   "Having been aboard USS Turner Joy  the night of 4 August 1964, I have a wholly different take on the \"no-attack\" interpretation propounded by the two \"authoritative\" accounts of the Tonkin Gulf Incident, Edwin Moise's book and NSA historian Robert J. Hanyok's declassified-in-2005 Cryptologic Quarterly article. I've critiqued both (and then-Commander James Stockdale's memoir) at http: // jimtranr . com / Whats_Wrong_with_Tonkin_Gulf_Incident_History . html.\n \n [Ignore the spaces in the URL. As a first-time poster, I can't post a direct link.]", 
   {
    "post_info": {
     "post_title": "A wholly different take"
    }
   }, 
   181621, 
   null, 
   1289972640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gulf of Tonkin Conspiracy?", 
  "url": "http://www.4forums.com/political/history-debates/6927-gulf-tonkin-conspiracy.html", 
  "breadcrumbs": [
   "History"
  ], 
  "id_number": 6927, 
  "discussion_files": [
   [
    "1172.html", 
    "http://www.4forums.com/political/history-debates/6927-gulf-tonkin-conspiracy-print.html"
   ]
  ], 
  "identifier": 6927
 }
]