[
 [
  [
   182066, 
   null, 
   "daewoo", 
   "http://www.ameinfo.com/71519.html\n \n \nThe peak output of the Burgan oil field will now be around 1.7 million barrels per day, and not the two million barrels per day forecast for the rest of the field's 30 to 40 years of life, Chairman Farouk Al Zanki told Bloomberg. \n\n \n I am re-visiting the peak oil theory here. I have said before I am fence sitting on that one, but leaning toward the \"peak oil\" camp. \n \n That was the second biggest field in the world, and one that the peak oil pundits pointed to as evidence that the whole \"peak oil\" thing was a non issue. The peak of the Burgan field has coincided almost exactly with the estimates by the ASPO, Matt Simmons, etc....\n \n What does everybody think? It seems to me that the debate on peak oil has moved to a different arena. Originally there seemed to be a lot of infighting in the oil industry and among geologists regarding the viability of the peak oil argument. It seems to me that the argument is now primarily between geologists and economists, the latter arguing that there can be no peak \"problem\" because the laws of supply and demand eliminate such things. \n \n My personal thought is that if there IS a peak oil problem, then it is truly a food in a lifeboat scenario, where the laws of supply and demand do not exist.", 
   {
    "post_info": {
     "post_title": "Burgan oil field peaks"
    }
   }, 
   null, 
   null, 
   1133216160.0
  ], 
  [
   182076, 
   null, 
   "gamehuis", 
   "Well the biggest oil field in the Gulf of Mexico has also peaked and so have the biggest British and Norwegian oil fields.\n \n Oil production will IMO not move much higher than the 85 million bpd that we're seeing right now. \n \n The days of cheap oil are almost over and after that the whole world economy is screwed.", 
   {}, 
   182066, 
   null, 
   1133218800.0
  ], 
  [
   182110, 
   null, 
   "georged", 
   "A decent recession will lower demand. I still believe US refining capacity was not increased in anticipation of the US decline as an industrial power and migration to a service economy. As the US standard of living declines, so will oil consumption, repositioning oil consumption to China, India, etc. Peak oil, if there is such a thing, will have more to do with limitations on industrial expansion in those countries with payment ability. Creditor nations such as the US will have problems securing requirements on credit with a fading currency.", 
   {}, 
   182076, 
   null, 
   1133222820.0
  ], 
  [
   182120, 
   null, 
   "daewoo", 
   "Well the biggest oil field in the Gulf of Mexico has also peaked and so have the biggest British and Norwegian oil fields.\n \n Oil production will IMO not move much higher than the 85 million bpd that we're seeing right now. \n\n \n These fields were not \"due\" to peak for another 15 years. \n \n It is starting to look more like the peak oil crowd had it right all along.", 
   {}, 
   182076, 
   null, 
   1133224080.0
  ], 
  [
   182124, 
   null, 
   "daewoo", 
   "A decent recession will lower demand. I still believe US refining capacity was not increased in anticipation of the US decline as an industrial power and migration to a service economy. As the US standard of living declines, so will oil consumption, repositioning oil consumption to China, India, etc. Peak oil, if there is such a thing, will have more to do with limitations on industrial expansion in those countries with payment ability. Creditor nations such as the US will have problems securing requirements on credit with a fading currency.\n\n \n I have to wonder, though, if the peak oil crowd is right, if there is any chance at all of pulling out of such a recession. \n \n It seems likely that a US recession would cause some burps in the world economy, it also appears than nations are being brought online to replace us as consumers. Without the US constantly blacklisting nations and pushing for sanctions against evil nations (evil being those who do not do what we say), several markets can be brought online in a relativelys hort period of time.", 
   {}, 
   182110, 
   null, 
   1133224320.0
  ], 
  [
   182147, 
   null, 
   "lord tammerlain", 
   "Untill the central Asian republics get fully explored along with western Iraq, I will sit on the fence. I will say that the Arabian pen area is likely at or very near peak oil production.", 
   {}, 
   182124, 
   null, 
   1133234700.0
  ], 
  [
   182227, 
   null, 
   "Eddie", 
   "Then I guess low dependancy on oil (and other fossil fuels) would be a huge competative advantage for any country in the near future? The question is perhaps wether it is possible to reduce oil dependancy in a significant manner and how much it would cost to do so. \n \n The Swedish government has made a commitment to break oil dependancy by 2020. Predominantly by social engineering through taxes and funding of research and reformation of various industries (most noteably agricultural production of energy and the consumption of them). Only a few measures where aimed at conserving energy. \n \n The proposed polycie changes are naturally not enough (I thought about listing them but since they where quite technical and refered to changes in swedish legislation I don`t think it would have been interesting). But what could be done to pull it off? Or is it even possible without disrupting the economy to such a degree that it will be a net-loss (or at least too risky)?\n \n Sorry for going off-topic :)", 
   {}, 
   182147, 
   null, 
   1133270220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Burgan oil field peaks", 
  "url": "http://www.4forums.com/political/current-events-debates/6947-burgan-oil-field-peaks.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 6947, 
  "discussion_files": [
   [
    "19425.html", 
    "http://www.4forums.com/political/current-events-debates/6947-burgan-oil-field-peaks-print.html"
   ]
  ], 
  "identifier": 6947
 }
]