[
 [
  [
   182194, 
   null, 
   "coolcodemn3", 
   "Do you think Tookie should be put to death? In my opinion i say yes, he killed innocent people and he deserves death.", 
   {
    "post_info": {
     "post_title": "Opinion on Tookie?"
    }
   }, 
   null, 
   null, 
   1133249880.0
  ], 
  [
   182220, 
   null, 
   "GreenMtnBoy", 
   "Why does anyone deserve death?", 
   {}, 
   182194, 
   null, 
   1133261640.0
  ], 
  [
   182269, 
   null, 
   "Sigma", 
   "Does anyone believe he actually wrote children's books? I've been hearing someone else wrote them and put his name on them.", 
   {}, 
   182220, 
   null, 
   1133283780.0
  ], 
  [
   182575, 
   null, 
   "coolcodemn3", 
   "Ask the family members of who he killed if he deserves death. He cant kill the innocent and get away with it.", 
   {}, 
   182269, 
   null, 
   1133399940.0
  ], 
  [
   182576, 
   null, 
   "Sigma", 
   "Ask the family members of who he killed if he deserves death. He cant kill the innocent and get away with it.\n\n \n I don't think that's a valid way to make this decision. It would be akin to asking the family members of the condemned. Neither would have objective opinions.\n \n I don't know too much about the case, but nothing I'm hearing convinces me he either didn't do it or is a worthwhile fellow.", 
   {}, 
   182575, 
   null, 
   1133400060.0
  ], 
  [
   182637, 
   null, 
   "coolcodemn3", 
   "He killed 4 people execution style, and is a founder of the Crips gang. If Scott Peterson wrote a book on how to treat a spouse should that get him out of jail? Or charley Manson on how to not join cults? (get my point?) It will be pathetic if Gov. Schwarzenegger gives him clemency.", 
   {}, 
   182576, 
   null, 
   1133427720.0
  ], 
  [
   182654, 
   null, 
   "snakespit", 
   "I think this POS is getting off easy. I mean come on, lethal injection for 4 murders he actually did, and the thousands upon thousands of murders he inspired? Lethal injection is far too humane for this monster. I personally think he should be dipped in powdered sugar and left next to a hill of fire ants. Even if \"tookie\" is truely sorry for what he did, he still deserves to pay for it. Sorry does not eliminate the damage that he has done or caused over the last 27 years. I hope he cries and wets his pants like a 3 y/o when they strap him to that table.", 
   {}, 
   182637, 
   null, 
   1133451420.0
  ], 
  [
   182670, 
   null, 
   "Sigma", 
   "I think this POS is getting off easy. I mean come on, lethal injection for 4 murders he actually did, and the thousands upon thousands of murders he inspired? Lethal injection is far too humane for this monster. I personally think he should be dipped in powdered sugar and left next to a hill of fire ants. Even if \"tookie\" is truely sorry for what he did, he still deserves to pay for it. Sorry does not eliminate the damage that he has done or caused over the last 27 years. I hope he cries and wets his pants like a 3 y/o when they strap him to that table.\n\n \n True repentance would give him a chance with me, but this fellow has never apologized for what he did and so should have no chance at clemency. If one won't admit one has done wrong, one is not repentant.\n \n The death penalty is not about revenge.", 
   {}, 
   182654, 
   null, 
   1133454240.0
  ], 
  [
   182675, 
   null, 
   "daewoo", 
   "IMO, it is either wrong to kill people or it is not. If it is wrong to kill people, we should not do it. If if is not, we should not make such a fuss over it when it happens. \n \n Since there is no clear evidence indicating that there is any deterrent value to the death penalty, I have trouble rationalizing it as a punishment. I see the death penalty primarily as a show of power and ownership by the state. Nobody is allowed to kill unless the government OKs it. Personally, since the government is well known for screwing up everything they touch, I am not entirely comfortable with the idea that they legally hold the power of life and death over me or anybody else. \n \n Personally I find it a little ironic that the same people who generally do not feel that the government can be trusted to provide health insurance are generally the same folks who argue that this group of incompetent XXXXXX should be able to hand out death sentences. \n \n I recognize that the use of force is basically reserved for the government in most cases. That is what makes them the government. Deciding what restrictions are placed on that use of force, and who decides those restrictions is the benefit of a free republic. I think some folks are making some poor decisions in that regard.", 
   {}, 
   182670, 
   null, 
   1133455260.0
  ], 
  [
   182838, 
   null, 
   "JPSartre12", 
   "I say fry MFer, fry! :xcensored", 
   {}, 
   182194, 
   null, 
   1133494980.0
  ], 
  [
   182869, 
   null, 
   "coolcodemn3", 
   "I say fry MFer, fry! :xcensored\n i second that. not to mention while he was in jail he got infights, and threw chemicals and guards, and the NAACP wants him out.....", 
   {}, 
   182838, 
   null, 
   1133500380.0
  ], 
  [
   183130, 
   null, 
   "snakespit", 
   "Since there is no clear evidence indicating that there is any deterrent value to the death penalty, I have trouble rationalizing it as a punishment\n\n SO in turn, there is no clear evidence indicating that there is not a detterent value to the death penalty. How would you suggest that we measure the death penalty quantitatively? As far as the rest of your post about the government being givin the misguided power to kill people, I would simply suggest that you don't do anything that the government wants to kill you for, then you don't need to worry about it.", 
   {}, 
   182675, 
   null, 
   1133658780.0
  ], 
  [
   183132, 
   null, 
   "snakespit", 
   "i second that. not to mention while he was in jail he got infights, and threw chemicals and guards, and the NAACP wants him out.....\n\n Don't forget the other mainstream whacko group, the ACLU. He was given a punishment fitting the crimes he was convicted of. Time may have passed, he may have written some books, he may even be an anti-gang proponent, but he still has not been punished as called for by law. Time and good deeds are not the punishment he was given, it was death by execution. \n \n I find it also slightly interesting that while he appologizes for his development of and involvement in the gangs, he still proudly uses and allows the use of his gang name \"tookie\". That and the fact that he never actually appologized for the 4 murders he commited.", 
   {}, 
   182869, 
   null, 
   1133659380.0
  ], 
  [
   183385, 
   null, 
   "daewoo", 
   "SO in turn, there is no clear evidence indicating that there is not a detterent value to the death penalty. How would you suggest that we measure the death penalty quantitatively? As far as the rest of your post about the government being givin the misguided power to kill people, I would simply suggest that you don't do anything that the government wants to kill you for, then you don't need to worry about it.\n\n \n Since the evidence is not clear eaither way, it would seem that any intelligent person would prefer to err on the side of caution since the stakes are so high.", 
   {}, 
   183130, 
   null, 
   1133770140.0
  ], 
  [
   183464, 
   null, 
   "JPSartre12", 
   "Since the evidence is not clear eaither way, it would seem that any intelligent person would prefer to err on the side of caution since the stakes are so high.\n\n \n The recidivism rate amongst executed criminals is ZERO. Maybe the death penalty doesn't deter others, but it damn sure deters the stiff from committing another murder. emoticon_frazzled", 
   {}, 
   183385, 
   null, 
   1133810460.0
  ], 
  [
   183468, 
   null, 
   "Eddie", 
   "The recidivism rate amongst executed criminals is ZERO. Maybe the death penalty doesn't deter others, but it damn sure deters the stiff from committing another murder. emoticon_frazzled\n\n \n Considering that the legal costs for the death penalty is higher than the costs for life-time incarceration, I would say Daewoo`s point about erring on the side of caution applies in this case as well...", 
   {}, 
   183464, 
   null, 
   1133813160.0
  ], 
  [
   183470, 
   null, 
   "daewoo", 
   "The recidivism rate amongst executed criminals is ZERO. Maybe the death penalty doesn't deter others, but it damn sure deters the stiff from committing another murder. emoticon_frazzled\n\n \n That is assuming that they ever committed a murder in the first place:\n \n http://www.deathpenaltyinfo.org/article.php?scid=6&did=109\n \n \n Exacly how many innocent people is it acceptable to kill in order to fulfill peoples infantile need for revenge? Red through the cases. In many cases there were confessions and eye witness testimony that were later proven to be false.", 
   {}, 
   183464, 
   null, 
   1133815560.0
  ], 
  [
   183474, 
   null, 
   "snakespit", 
   "Since the evidence is not clear eaither way, it would seem that any intelligent person would prefer to err on the side of caution since the stakes are so high.\n\n What caution? What stakes? The notion that innocent people may be sentenced to death is not a death penalty problem, it is a judicial system problem. \n \n And it seems that every time we start talking about the death penalty, that we end up talking about whether or not it deters crime. Who really cares? It is called the death penalty for a reason...it is a penalty, a punishment. Any deterent value that the death penalty brings to the table is simply a nice side effect.", 
   {}, 
   183385, 
   null, 
   1133816580.0
  ], 
  [
   183477, 
   null, 
   "Eddie", 
   "I've never understood the point with wasting money on punishments that doesn`t affect the risks of individuals becomming victims of crimes. Completly pointless...", 
   {
    "unicode_changes_made": true
   }, 
   183474, 
   null, 
   1133817540.0
  ], 
  [
   183481, 
   null, 
   "daewoo", 
   "What caution? What stakes? The notion that innocent people may be sentenced to death is not a death penalty problem, it is a judicial system problem. \n\n \n Teh two are related. In the end, the question is whetehr or not our judicial system is competent enough to hand out the death penalty or not. It seems to me that since it appears that they have been handing it out to people who are undeserving, the answer is a rather obvious NO. What youa re apparently trying to do by seperating the two is construe a \"perfect world\" argument, essentially asking \"in a perfect world where there is absolutly no chance of an innocent man being convicted....\". Bad news, the argument there is flawed from the start. In a perfect world, nobody would have been murdered in the first place.\n \n \nAnd it seems that every time we start talking about the death penalty, that we end up talking about whether or not it deters crime. Who really cares? It is called the death penalty for a reason...it is a penalty, a punishment. Any deterent value that the death penalty brings to the table is simply a nice side effect.\n\n \n The question comes up becuase arguing for the deterrent effect is really the only way to justify the death penalty. Either killing people is wrong or it is not. In our society, we tend to frown on it. We have decided that it is wrong. YET, some elements ff scoiety wish to kill people as punishment fro their crimes. This leads to a rather uncomfortable double standard with them essentailly saying \"they have done something terrible, and now we are going to do it, too\". Generally only young children, or extremely ignorant people, insist that the playground rule of tit-for-tat is a justifiable policy.\n \n If the person in question is in prison, they are removed from society. They can do no more to harm society. Unless some solid benifit can be shown for killing them, it is simply a childish act of revenge. Most people prefer to believe that we are above childish acts of revenge.", 
   {}, 
   183474, 
   null, 
   1133820300.0
  ], 
  [
   183508, 
   null, 
   "georged", 
   "\n And it seems that every time we start talking about the death penalty, that we end up talking about whether or not it deters crime. Who really cares? It is called the death penalty for a reason...it is a penalty, a punishment. Any deterent value that the death penalty brings to the table is simply a nice side effect.\n\n \n I'm not aware of your preferences, but seemingly a majority of those favoring a death penalty for criminal acts are surprisingly pro-life in most other matters. How are the two reconciled?", 
   {}, 
   183474, 
   null, 
   1133828220.0
  ], 
  [
   183523, 
   null, 
   "JPSartre12", 
   "I'm not aware of your preferences, but seemingly a majority of those favoring a death penalty for criminal acts are surprisingly pro-life in most other matters. How are the two reconciled?\n\n \n If I've heard that lame question once, I've heard it a million times. I'll answer it for him. The death penalty kills the guilty; abortion kills the innocent. I'm OK with the former, but not the latter. emoticon_rolleyes \n If there was only one flavor of \"pro-life\", then every one of them would have to be a pacifist and never engage in any war. I know that I ain't no damn pacifist. emoticon_xkill emoticon_xkill emoticon_xkill", 
   {}, 
   183508, 
   null, 
   1133834340.0
  ], 
  [
   183524, 
   null, 
   "JPSartre12", 
   "I've never understood the point with wasting money on punishments that doesn`t affect the risks of individuals becomming victims of crimes. Completly pointless...\n\n \n Do you know how many convicyed murderers go on to kill again, either in prison or when they get out? Plenty! Dead men don't kill again.", 
   {
    "unicode_changes_made": true
   }, 
   183477, 
   null, 
   1133834460.0
  ], 
  [
   183528, 
   null, 
   "georged", 
   "If I've heard that lame question once, I've heard it a million times. I'll answer it for him. The death penalty kills the guilty; :\n\n \n And, as well proven, the innocent.", 
   {}, 
   183523, 
   null, 
   1133835060.0
  ], 
  [
   183529, 
   null, 
   "JPSartre12", 
   "And, as well proven, the innocent.\n\n \n I have no problem with being certain first. Places like IL, that have shown that they aren't, shouldn't be in the execution business, but if 10 people watch John Doe kill someone in cold blood, he's got to go, IMO.", 
   {}, 
   183528, 
   null, 
   1133836200.0
  ], 
  [
   183533, 
   null, 
   "daewoo", 
   "I have no problem with being certain first. Places like IL, that have shown that they aren't, shouldn't be in the execution business, but if 10 people watch John Doe kill someone in cold blood, he's got to go, IMO.\n\n \n One of thsoe case listyed on the page I linked had 4 eye witnesses and a signed confession from the killer. All 4 witnesses later retracted their statements, and it turned out the police tortured him. \n \n IL has some of the steepest safeguards against executing innocents. Death penalty cases get special consideration and those convicted get more chances to prove their innocence. It would seem that it is more probable that IL looks \"bad\" from that standpoint because more of their death row inmates end up going free. On the other hand, it seems far MORE likely that what this really means is that other states without those safeguards are likely executing innocent people.", 
   {}, 
   183529, 
   null, 
   1133839080.0
  ], 
  [
   183542, 
   null, 
   "georged", 
   "While I can well accept 'eye for an eye' revenge on a face-to-face personal basis in the event of me or my family being criminally attacked, I'm unusual in the respect that I would attempt to seek justice on my own. Most people use the system. While I'm not that concerned about how US culture will respond to the criminal death penalty eventually being removed or accelerated, I still fail to see the need to execute people when execution includes the defined probability of including innocent people. If they're locked away from society, what's the problem? Why do people who are not personally involved in a crime insist death is a necessary punishment? Is this related to blowing up abortion clinics?", 
   {}, 
   183533, 
   null, 
   1133841540.0
  ], 
  [
   183543, 
   null, 
   "JPSartre12", 
   "While I can well accept 'eye for an eye' revenge on a face-to-face personal basis in the event of me or my family being criminally attacked, I'm unusual in the respect that I would attempt to seek justice on my own.\n\n I can relate to that. There would be no mistake as to who took out the person responsible for messing with my family. I'd carve my name in the corpse. \n \n\n Most people use the system. While I'm not that concerned about how US culture will respond to the criminal death penalty eventually being removed or accelerated, I still fail to see the need to execute people when execution includes the defined probability of including innocent people. If they're locked away from society, what's the problem? Why do people who are not personally involved in a crime insist death is a necessary punishment? Is this related to blowing up abortion clinics?\n\n \n i wouldn't have a problem with \"life without parole\" if it wasn't for bleeding-heart liberals always trying to change the rules. I'd also make sure that they were kept in PC, so that they couldn't harm anyone else.", 
   {}, 
   183542, 
   null, 
   1133842020.0
  ], 
  [
   183550, 
   null, 
   "daewoo", 
   "i wouldn't have a problem with \"life without parole\" if it wasn't for bleeding-heart liberals always trying to change the rules. I'd also make sure that they were kept in PC, so that they couldn't harm anyone else.\n\n \n I keep hearign this argument for the death penalty, namely that the damn dirty liberals are doing everythign in their power to put murderers back on the street. Oddly enough, I have not ever been able to find an instance of the damn dirty liberals letting first degree murderers go. Maybe you can provide an example of this happening.", 
   {}, 
   183543, 
   null, 
   1133844420.0
  ], 
  [
   183558, 
   null, 
   "JPSartre12", 
   "I keep hearign this argument for the death penalty, namely that the damn dirty liberals are doing everythign in their power to put murderers back on the street. Oddly enough, I have not ever been able to find an instance of the damn dirty liberals letting first degree murderers go. Maybe you can provide an example of this happening.\n\n \n How soon they forget. Two words: Willy Horton\n \n\n The campaign of 1988 marked the political dominance of \"law and order\" over the counter-culture. It found expression in Willy Horton and the election of George Bush. Michael Dukakis, Bush's opponent and the governor of Massachusetts, signed a routine weekend furlough for a convict named Willy Horton, a convicted murderer, who raped a woman and savagely beat her boyfriend while out on a prison release program. The incident became the subject of an intense campaign of political advertising. The lesson of that election was not lost on either Democrats or Republicans. \n http://www.gatelessgate.org/archive/kc/too_many_prisons/\n \n\n \n History of Willy Horton\n \n\n William R. Horton Jr. (born August 12, 1951 in Chesterfield, South Carolina) is a convicted felon who was the subject of a Massachusetts weekend furlough program that released him while serving a life sentence for murder, providing him the opportunity to commit a rape and armed robbery. A political advertisement during the 1988 U.S. Presidential race was critical of the Democratic nominee and Massachusetts Governor Michael Dukakis for his support of the program.\n \n \n Willie HortonOn October 26, 1974, in Lawrence, Massachusetts, Horton and two accomplices robbed Joseph Fournier, a 17 year old gas station attendant, stabbed him 19 times, and left him in a trash can. Fournier died from blood loss. Horton was convicted of murder, sentenced to life imprisonment, and incarcerated at the Concord Correctional Facility in Massachusetts. On June 6, 1986, he was released as part of a weekend furlough program but did not return.\n \n On April 3, 1987 in Oxon Hill, Maryland, Horton assaulted local resident Clifford Barnes and raped his fiancée. He then stole Barnes' car, but was later captured by police after a chase. On October 20, Horton was sentenced in Maryland to two consecutive life terms plus 85 years. The sentencing judge refused to return Horton to Massachusetts, saying, \"I'm not prepared to take the chance that Mr. Horton might again be furloughed or otherwise released. This man should never draw a breath of free air again.\"\n http://en.wikipedia.org/wiki/Willie_Horton \n\n Keep serving up softballs and I'll hit them out of the park. :) \n Note the highlighted comment by the judge.", 
   {
    "unicode_changes_made": true
   }, 
   183550, 
   null, 
   1133849100.0
  ], 
  [
   183574, 
   null, 
   "snakespit", 
   "I keep hearign this argument for the death penalty, namely that the damn dirty liberals are doing everythign in their power to put murderers back on the street. Oddly enough, I have not ever been able to find an instance of the damn dirty liberals letting first degree murderers go. Maybe you can provide an example of this happening.\n\n cough cough cough***OJ***cough cough cough", 
   {}, 
   183550, 
   null, 
   1133867340.0
  ], 
  [
   183576, 
   null, 
   "snakespit", 
   "Teh two are related. In the end, the question is whetehr or not our judicial system is competent enough to hand out the death penalty or not. It seems to me that since it appears that they have been handing it out to people who are undeserving, the answer is a rather obvious NO. What youa re apparently trying to do by seperating the two is construe a \"perfect world\" argument, essentially asking \"in a perfect world where there is absolutly no chance of an innocent man being convicted....\". Bad news, the argument there is flawed from the start. In a perfect world, nobody would have been murdered in the first place.\n\n So if we can assume that innocent people are convicted in capital punishment cases, shouldn't we be free to assume that innocent people are being convicted in non-capital punishment cases as well? So should we be able to impose the sentence of life without parole, all the while understanding that we may have put an innocent man in prison for life? All I ask is a little consistency in the argument. And please note, I did not mention the \"perfect world\" argument that you brought up. I understand that the system is flawed, I think everyone knows that the system is flawed. Capital punishment is just that, a punishment. The judicial system is where the flaws lie. I am all for making our judicial system as efficient and accurate as possible, however eliminating capital punishment is not going to keep innocent people from being convicted of crimes. If it ain't broke, don't fix it. \n \n \nThe question comes up becuase arguing for the deterrent effect is really the only way to justify the death penalty. Either killing people is wrong or it is not. In our society, we tend to frown on it. We have decided that it is wrong. YET, some elements ff scoiety wish to kill people as punishment fro their crimes. This leads to a rather uncomfortable double standard with them essentailly saying \"they have done something terrible, and now we are going to do it, too\". Generally only young children, or extremely ignorant people, insist that the playground rule of tit-for-tat is a justifiable policy.\n\n I don't really see why I have to justify the death penalty to anyone in the first place. I believe that there are crimes and criminals deserving of the death penalty, and I support it. Nuff said. You may think of it as an arbitrary tit-for-tat policy, but I see it as a legal, court ordered punishment handed down by our judicial system for a crime to which the death penalty is applicable. It's really simple. If you don't want to face the death penalty, do not commit a crime for which you might be sentenced to death. While I have no scientific proof to back this up, I can say from personal experience that I have never commited a capital offense, and therefore have never been sentenced to death. Works for me. \n \n \nIf the person in question is in prison, they are removed from society. They can do no more to harm society. Unless some solid benifit can be shown for killing them, it is simply a childish act of revenge. Most people prefer to believe that we are above childish acts of revenge.\n\n No letting the family or friends of the victim kill the convicted person might be childish revenge. The death penalty is simply a legally imposed punishment given to felons who commited crimes for which the death penalty is applicable. And correct me if I am wrong, but aren't most death sentences recommended by a jury after deliberation of the case facts? Isn't that how our judicial system is supposed to work? It seems to me that if Americans are leaning towards the anti-capital punishment side, then we should see fewer and fewer juries handing down death sentences. \n \n And you say that most people prefer to believe that we are above childish acts of revenge. So by most you must mean the majority of Americans, right? So since the majority of Americans still support the use of capital punishment, I guess this would mean that mostAmericans do not feel that capital punishment is a childish act. \n \n Some poll numbers showing most Americans opinions about captial punishment: \n \n http://www.deathpenaltyinfo.org/article.php?scid=23&did=210#FoxNews0001", 
   {}, 
   183558, 
   null, 
   1133869500.0
  ], 
  [
   183579, 
   null, 
   "snakespit", 
   "While I can well accept 'eye for an eye' revenge on a face-to-face personal basis in the event of me or my family being criminally attacked, I'm unusual in the respect that I would attempt to seek justice on my own. Most people use the system. While I'm not that concerned about how US culture will respond to the criminal death penalty eventually being removed or accelerated, I still fail to see the need to execute people when execution includes the defined probability of including innocent people. If they're locked away from society, what's the problem? Why do people who are not personally involved in a crime insist death is a necessary punishment? Is this related to blowing up abortion clinics?\n\n So you favor vigilante justice, making you the judge, jury, and executioner of someone, all the while denying them their constitutional right to due process in our legal system? I find it stunningly ignorant how someone can make such a statement, and then suggest that we change our legal system. Why don't you leave the operation of the legal system and it's dispensing of justice to those who would use it in accordance with the laws of our country. After reading your above statement, I think I will find it difficult to take anything you have to say on the subject seriously.", 
   {}, 
   183542, 
   null, 
   1133870400.0
  ], 
  [
   183582, 
   null, 
   "snakespit", 
   "I'm not aware of your preferences, but seemingly a majority of those favoring a death penalty for criminal acts are surprisingly pro-life in most other matters. How are the two reconciled?\n\n I really do not know or care. I am pro-choice, and pro-capital punishment.", 
   {}, 
   183508, 
   null, 
   1133870760.0
  ], 
  [
   183597, 
   null, 
   "georged", 
   "So you favor vigilante justice, making you the judge, jury, and executioner of someone, all the while denying them their constitutional right to due process in our legal system? I find it stunningly ignorant how someone can make such a statement, and then suggest that we change our legal system. Why don't you leave the operation of the legal system and it's dispensing of justice to those who would use it in accordance with the laws of our country. After reading your above statement, I think I will find it difficult to take anything you have to say on the subject seriously.\n\n \n That's good. If you read the post then you do understand you've made the determination that you forgo all the trappings of a civilized society if you intentionally attempt to harm me or my family. On that note, I'd venture a guess that myself and JP are not the only posters who would bypass the system under those circumstances. I do know it holds true with a lot of individuals in the real world I inhabit. \n \n I also stated it didn't make any difference to me what the system does with regard to the death sentence. I did not advocate changing any law, I said it was stupid to enforce the death penalty when innocence was a possibility. What I fail to understand is why citizens who are personally uninvolved with a capital crime scream for the death penalty. I asked what the difference is between life imprisonment and death to any citizen not personally involved in such crimes and what is their motivation for the death of a stranger.", 
   {}, 
   183579, 
   null, 
   1133884500.0
  ], 
  [
   183599, 
   null, 
   "Eddie", 
   "Do you know how many convicyed murderers go on to kill again, either in prison or when they get out? Plenty! Dead men don't kill again.\n\n \n Is it really that common for inmates to kill other inmates? I mean, sure, I`ve seen OZ, but it can`t be that bad in the US is it?\n \n As for murderers killing when they get ot, I thought the idea of life inprisonment was to keep the prisoner for life (or possibly let him out if/when one can be certain that he has been rehabilitated)", 
   {}, 
   183524, 
   null, 
   1133884740.0
  ], 
  [
   183605, 
   null, 
   "georged", 
   "Is it really that common for inmates to kill other inmates? I mean, sure, I`ve seen OZ, but it can`t be that bad in the US is it?\n \n\n \n Very common. Child molesters, rapists and former LE members are normally segregated from a general prison population or they face almost immediate death from other prisoners. The US prison system is so overloaded and understaffed that ethnic gangs including whites pretty well rule the general populations with constant power struggles that include the rights of supplying inmates with drugs and other illegal commodities. As on the streets with that particular segment of society, death is the normal resolution of disagreements.", 
   {}, 
   183599, 
   null, 
   1133885880.0
  ], 
  [
   183612, 
   null, 
   "Eddie", 
   "Very common. Child molesters, rapists and former LE members are normally segregated from a general prison population or they face almost immediate death from other prisoners. The US prison system is so overloaded and understaffed that ethnic gangs including whites pretty well rule the general populations with constant power struggles that include the rights of supplying inmates with drugs and other illegal commodities. As on the streets with that particular segment of society, death is the normal resolution of disagreements.\n\n \n Oh... That`s just wrong. :( Is there any political will to change this at all or is the american public not concerned at waht`s going on in the prisons as long as they are not affected themselves?", 
   {}, 
   183605, 
   null, 
   1133887860.0
  ], 
  [
   183614, 
   null, 
   "georged", 
   "Oh... That`s just wrong. :( Is there any political will to change this at all or is the american public not concerned at waht`s going on in the prisons as long as they are not affected themselves?\n\n \n Here's the breakdown of offenses for US prison populations at county, state and federal facilities:\n \n Violent offenses - 25.4% (murder is 2%)\n Property crimes - 24.4% \n Drug offenses - 24.7% (possession is 10.8%)\n Public order offenses - 24.9% (drunk, drunk driving and child support)\n \n With 50% of inmates incarcerated for what should be qualified as violation of moral standards without crime against people or property, I see no other explanation than a disaffected public approving government concentration on policing belief system based morality and essentially discarding those individuals from general society into their own structure. That structure being prison with the most dangerous of criminals where survival of the strongest determines social status, inviting and perpetuating violence.", 
   {}, 
   183612, 
   null, 
   1133891040.0
  ], 
  [
   183625, 
   null, 
   "JPSartre12", 
   "That's good. If you read the post then you do understand you've made the determination that you forgo all the trappings of a civilized society if you intentionally attempt to harm me or my family. On that note, I'd venture a guess that myself and JP are not the only posters who would bypass the system under those circumstances. I do know it holds true with a lot of individuals in the real world I inhabit. \n\n \n Justice is a dish best served warm, IMO. :) \n \n\n I also stated it didn't make any difference to me what the system does with regard to the death sentence. I did not advocate changing any law, I said it was stupid to enforce the death penalty when innocence was a possibility. What I fail to understand is why citizens who are personally uninvolved with a capital crime scream for the death penalty. I asked what the difference is between life imprisonment and death to any citizen not personally involved in such crimes and what is their motivation for the death of a stranger.\n \n\n \n Two words, once again: Willy Horton\n If I could be satisfactorily convinced that a murderer had ZERO chance of committing another crime, I might be convinced to do away with the death penalty. Unfortunately, I'm way too cynical WRT our justice system and know that isn't going to happen, so fry 'em up.", 
   {}, 
   183597, 
   null, 
   1133899260.0
  ], 
  [
   183626, 
   null, 
   "JPSartre12", 
   "Here's the breakdown of offenses for US prison populations at county, state and federal facilities:\n \n Violent offenses - 25.4% (murder is 2%)\n Property crimes - 24.4% \n Drug offenses - 24.7% (possession is 10.8%)\n Public order offenses - 24.9% (drunk, drunk driving and child support)\n \n With 50% of inmates incarcerated for what should be qualified as violation of moral standards without crime against people or property, I see no other explanation than a disaffected public approving government concentration on policing belief system based morality and essentially discarding those individuals from general society into their own structure. That structure being prison with the most dangerous of criminals where survival of the strongest determines social status, inviting and perpetuating violence.\n\n \n I'd like to see the breakdown of Federal facilities. County jails are full of drunks, so including them skews the statistics for \"prison\".", 
   {}, 
   183614, 
   null, 
   1133899440.0
  ], 
  [
   183660, 
   null, 
   "Wez", 
   "Has anyone escaped from life imprisonment and murdered again in the last 50 years? \n \n I don't have a moral objection to killing certain people, but I'm still against the death penalty. It's very expensive and prone to executing the innocent. The lives saved by the death penalty, which I suspect is 0, unless the answer to the above question is \"yes\", is smaller than the innocents killed by the death penalty.\n \n Apparently, the death penalty increases the number of innocents killed.\n \n And what is the reason many support the death penalty? To protect the innocent.\n \n emoticon_rolleyes \n \n (If a murderer is released and murders again, that has nothing to do with the death penalty, rather the sentencing laws, so doesn't contribute to the number of lives saved by the death penalty).\n \n -Wez", 
   {}, 
   183626, 
   null, 
   1133908260.0
  ], 
  [
   183669, 
   null, 
   "georged", 
   "I'd like to see the breakdown of Federal facilities. County jails are full of drunks, so including them skews the statistics for \"prison\".\n\n \n County follows state and federal in statistics for drunk/child support and crimes against property. Few county lockups hold prisoners for other than trial and/or sentencing for any offense due to overcrowding. State/federal legislation has deeper pockets to expand facilities. Due to that overcrowding, few county jails hold drunks or drunk drivers, they're released with court appearance citations if no crime against people or property is involved. In my county, the jail is used only for booking of arrests where no crime against property or persons is involved. They're cited for a court appearance, booked and sent out the front door to find their way home or whatever.\n \n Where the feds really shine is in drug offense imprisonment. It swaps statistics with violent crime at the state levels, 55% at the federal level for drugs, half of those for possession and 10% for violent crime.\n \n Murder, the topic subject, gets all the attention even though it remains a minute portion of overall crime. \n \n As of 2004, US prison facilities at all levels were 132% of legal capacity. We have the highest per-capita rate of incarceration in the world, making even Russia and the Ukraine look peaceful. When someone mentions a criminal deterrence factor with death sentences, it sounds like a bad joke or total ignorance.", 
   {}, 
   183626, 
   null, 
   1133911680.0
  ], 
  [
   183697, 
   null, 
   "snakespit", 
   "What I fail to understand is why citizens who are personally uninvolved with a capital crime scream for the death penalty. I asked what the difference is between life imprisonment and death to any citizen not personally involved in such crimes and what is their motivation for the death of a stranger.\n\n Because we are all potential victims of violent crime, and I believe that there are violent crimes deserving of the death penalty.", 
   {}, 
   183597, 
   null, 
   1133920020.0
  ], 
  [
   183701, 
   null, 
   "snakespit", 
   "Oh... That`s just wrong. :( Is there any political will to change this at all or is the american public not concerned at waht`s going on in the prisons as long as they are not affected themselves?\n\n Aside from locking them down 24 / 7 and never allowing contact with other inmates (which I suppose would be considered cruel and unusual punishment), no there is nothing that can be done to prevent an inmate from killing another. It is simply a way of life in prison.", 
   {}, 
   183612, 
   null, 
   1133920440.0
  ], 
  [
   183717, 
   null, 
   "JPSartre12", 
   "Has anyone escaped from life imprisonment and murdered again in the last 50 years? \n \n I don't have a moral objection to killing certain people, but I'm still against the death penalty. It's very expensive and prone to executing the innocent. The lives saved by the death penalty, which I suspect is 0, unless the answer to the above question is \"yes\", is smaller than the innocents killed by the death penalty.\n \n Apparently, the death penalty increases the number of innocents killed.\n \n And what is the reason many support the death penalty? To protect the innocent.\n \n emoticon_rolleyes \n\n \n Since you folks keep throwing softballs, I'll keep hitting them out of the park.\n \n \n The Great Escape \n \n At the time of the December 13, 2000 breakout, the reported ringleader of the Texas Seven, 30-year-old George Rivas, was already serving 18 life sentences. Michael Anthony Rodriguez, 38, was also serving a life term, while Larry Harper, 37, Joseph Garcia and Patrick Murphy, Jr., 39, all were serving at least 50 years. \n \n Donald Keith Newbury, the member with the longest rap sheet of the group, was serving a 99-year term. The youngest member, Randy Halprin, 23, was serving a 30-year sentence for injury to a child. \n ......\n Christmas Eve \n \n Three days after arriving in the Dallas area, the seven allegedly robbed Oshman's Super Sports USA Store in Irving, Texas. The convicts allegedly struck around closing time and, holding several employees hostage, stole $70,000 in cash and checks, at least 40 firearms, ammunition and clothing. On their way out, while they were loading their vehicle with the stolen goods, Officer Aubrey Hawkins arrived at the scene. \n \n Hawkins was shot 13 times - including six bullets in his head - and was run over by the escapees' car as they fled the scene. \n Crime scene evidence also shows that there was in excess of 20 shots and that at least five .357 magnum pistols were used. Autopsy results were able to link the wounds to at least two pistols, but the others could not be matched to weapons specifically. When the guns were later found, many were dissembled and it is unknown which convict used which pistol. \n \n Rivas later said he initially fired two warning shots at Hawkins when he wouldn't follow orders to raise his arms. \n \n He said he fired one shot to each side of Hawkins' chest, knowing that Hawkins would be wearing a bulletproof vest. Rivas said he himself was then shot at twice, and when he saw \"white\" with pain, he fired three shots at Hawkins, which he concedes could have been fatal. \n \n http://www.courttv.com/trials/texas7/background.html [/quote]\n \n\n (If a murderer is released and murders again, that has nothing to do with the death penalty, rather the sentencing laws, so doesn't contribute to the number of lives saved by the death penalty).\n \n -Wez\n\n \n Excuse me, but isn't \"the death penalty\" a sentencing law? emoticon_wow Your circular logic has gotten me dizzy. emoticon_frazzled", 
   {
    "unicode_changes_made": true
   }, 
   183660, 
   null, 
   1133924220.0
  ], 
  [
   183727, 
   null, 
   "snakespit", 
   "(If a murderer is released and murders again, that has nothing to do with the death penalty, rather the sentencing laws, so doesn't contribute to the number of lives saved by the death penalty).\n \n -Wez\n\n If the same murderer had been given the death penalty, and never released in the first place, he would not be able to kill again. \n \n And I think this say's it nicely about deterence:\n \n \"If we execute murderers and there is in fact no deterrent effect, we have killed a bunch of murderers. If we fail to execute murderers, and doing so would in fact have deterred other murders, we have allowed the killing of a bunch of innocent victims. I would much rather risk the former. This, to me, is not a tough call.\" \n \n John McAdams - Marquette University/Department of Political Science, on deterrence", 
   {}, 
   183660, 
   null, 
   1133925840.0
  ], 
  [
   183729, 
   null, 
   "JPSartre12", 
   "If the same murderer had been given the death penalty, and never released in the first place, he would not be able to kill again. \n \n And I think this say's it nicely about deterence:\n \n \"If we execute murderers and there is in fact no deterrent effect, we have killed a bunch of murderers. If we fail to execute murderers, and doing so would in fact have deterred other murders, we have allowed the killing of a bunch of innocent victims. I would much rather risk the former. This, to me, is not a tough call.\" \n \n John McAdams - Marquette University/Department of Political Science, on deterrence\n\n \n Dead men aren't recidivists. :) \n \n And my condolences on the Eagles. Being an Eagles fan myself (born in Philly, raised in S.NJ), I couldn't watch it past halftime. I'm also a Rutgers grad, like McMahon and LT Smith, so this was a double whammy to me. emoticon_cry emoticon_cry emoticon_cry", 
   {}, 
   183727, 
   null, 
   1133927400.0
  ], 
  [
   183733, 
   null, 
   "snakespit", 
   "Dead men aren't recidivists. :) \n \n And my condolences on the Eagles. Being an Eagles fan myself (born in Philly, raised in S.NJ), I couldn't watch it past halftime. I'm also a Rutgers grad, like McMahon and LT Smith, so this was a double whammy to me. emoticon_cry emoticon_cry emoticon_cry\n\n My partner was at the game and she said that the only reason most people stuck around was for the halftime tribute to R. White. But even though we suck this year, I can still honestly say that I am glad TO is gone! It's about time we got rid of that loser.", 
   {}, 
   183729, 
   null, 
   1133928780.0
  ], 
  [
   183757, 
   null, 
   "Dono", 
   "If there was a justice system that was equally fair to all accused, made no mistakes and only executed the guilty, proponents of the death penalty could rightly cry, \"Fry 'um up\". We all know that such a system does not exist.\n There have been 1000 executions since the death penalty was reinstated in 1976. No doubt the majority of those executed were guilty, but some of those 1000 were innocent (an example was in today's paper about a 1993 execution). Taking an innocent life with a gun or a knife is a capital crime, but taking an innocent life with 12 \"peers\" is just an unfortunate mistake?\n Change will be slow in coming, but I believe that it will eventually happen even in this thumbs down country.\n Dono", 
   {}, 
   183701, 
   null, 
   1133942280.0
  ], 
  [
   183781, 
   null, 
   "Eddie", 
   "Aside from locking them down 24 / 7 and never allowing contact with other inmates (which I suppose would be considered cruel and unusual punishment), no there is nothing that can be done to prevent an inmate from killing another. It is simply a way of life in prison.\n\n \n Of course there are ways to prevent this. Not all countries suffer from the same abysmal environment for inmates. Or perhaps the problem runs deeper than merely the correctional facilities (allthough I suspect that they at least play an important part).", 
   {}, 
   183701, 
   null, 
   1133969580.0
  ], 
  [
   183802, 
   null, 
   "JPSartre12", 
   "If there was a justice system that was equally fair to all accused, made no mistakes and only executed the guilty, proponents of the death penalty could rightly cry, \"Fry 'um up\". We all know that such a system does not exist.\n There have been 1000 executions since the death penalty was reinstated in 1976. No doubt the majority of those executed were guilty, but some of those 1000 were innocent (an example was in today's paper about a 1993 execution). Taking an innocent life with a gun or a knife is a capital crime, but taking an innocent life with 12 \"peers\" is just an unfortunate mistake?\n Change will be slow in coming, but I believe that it will eventually happen even in this thumbs down country.\n Dono\n\n \n So, since 1976, we have had possibly ONE innocent person executed out of 1000? And how many on death row or murdering \"lifers\" have committed murder during that time? Hundreds? Thousands? \n I find it interesting that you would only allow capital punishment in a perfect world, but have no problem with repeat murderers in an imperfect one. If the world of incarceration was a perfect one, I'd be against the death penalty, but it isn't. I don't usually argue for the pragmatic solution, but in this instance, I'll make an exception, so \"Fry 'em up!\" emoticon_xkill", 
   {}, 
   183757, 
   null, 
   1133974740.0
  ], 
  [
   183803, 
   null, 
   "georged", 
   "Of course there are ways to prevent this. Not all countries suffer from the same abysmal environment for inmates. Or perhaps the problem runs deeper than merely the correctional facilities (allthough I suspect that they at least play an important part).\n\n \n That type of social change is not supported by the general US public or its leadership. Out of sight, out of mind is the current philosophy. Direction of resources to construct facilities adequate to hold our ever-escalating per-capita criminal population has been the primary social focus since the 1980s and even that effort is becoming a dismal failure. Being a debtor nation with industry switching to a service economy while engaged in a folly of an expensive war directs fearful pubic attention to the relatively small problem of murder/death sentences (the post 'we are all potential victims of violent crime' is a typical prevailing rationalization by middle America fostered by our social conditions) while our judicial and prison systems become overwhelmed. Positive social change is at the very bottom of the US 'to do' list. If it hasn't already been dropped from that list.", 
   {}, 
   183781, 
   null, 
   1133974800.0
  ], 
  [
   183814, 
   null, 
   "Wez", 
   "Since you folks keep throwing softballs, I'll keep hitting them out of the park.\n \n \n The Great Escape \n [snip]\n\n That's one case. You need to find lots more for the death penalty to save more lives than innocents that have been executed by it. I await eagerly.\n \n \n http://en.wikipedia.org/wiki/Death_penalty#Around_the_present_world\n \"Criminal proceedings are fallible. Some people facing the death penalty have been exonerated, sometimes only minutes before their scheduled execution. Others have been executed before evidence clearing them is discovered. While criminal trials not involving the death penalty can also involve mistakes, there is at least the opportunity for those mistakes to be corrected. This has been particularly relevant in cases where new forensic methods (such as DNA) have become available. Since 1973, 119 people in 25 US states have been released from death row with evidence of their innocence.\"\n \n 119 would have died innocent were executions to be more efficient and done more quickly.\n \n \nExcuse me, but isn't \"the death penalty\" a sentencing law? Your circular logic has gotten me dizzy.\n\n If I change the quote to \"If a murderer is released and murders again, that has nothing to do with the death penalty, rather the life-sentence laws, so doesn't contribute to the number of lives saved by the death penalty)\" does that clarify?\n \n \nIf the same murderer had been given the death penalty, and never released in the first place, he would not be able to kill again.\n\n He shouldn't have been released imo.\n \n \n\"If we execute murderers and there is in fact no deterrent effect, we have killed a bunch of murderers. If we fail to execute murderers, and doing so would in fact have deterred other murders, we have allowed the killing of a bunch of innocent victims. I would much rather risk the former. This, to me, is not a tough call.\"\n \n John McAdams - Marquette University/Department of Political Science, on deterrence\n\n You know the death penalty has killed innocents, but you don't know if it's saved any live. \n \n What about my main point? I take it you don't agree with it...\n \n -Wez", 
   {}, 
   183717, 
   null, 
   1133976180.0
  ], 
  [
   183854, 
   null, 
   "Dono", 
   "So, since 1976, we have had possibly ONE innocent person executed out of 1000? \n\n A ridiculous statement since there have been numerous convictions overturned on DNA evidence alone, leaving one to ponder how many bad convictions were not discovered. \n \n And how many on death row or murdering \"lifers\" have committed murder during that time? Hundreds? Thousands? \n\n Did those murders take place in the 38 states that have the death penalty? Do states with the death penalty have less murders? We both know the answer.\n \nI find it interesting that you would only allow capital punishment in a perfect world, but have no problem with repeat murderers in an imperfect one. If the world of incarceration was a perfect one, I'd be against the death penalty, but it isn't. I don't usually argue for the pragmatic solution, but in this instance, I'll make an exception, so \"Fry 'em up!\" emoticon_xkill\n\n I have no problem with repeat murderers? Not true, I just don't believe state sanctioned killing is a solution. Every western democracy except the USA has abolished the death penalty. \n In my state we execute far more than any other state, but our murder rate remains high. In the last three weeks we have had three police officers shot (two died). Does anyone really believe those murders considered the penalty before shooting? Morality aside, no evidence of deterrence aside, the death penalty costs more than life imprisonment. A 1992 Dallas Morning News study found that the cost to Texas taxpayers of a capital trial and all subsequent appeals is an average of $2.3 million per case. This figure does not include the cost of the federal appeals process where 50% to 70% of the death sentences are overturned. By comparison, the cost of housing an inmate in a single cell maximum security unit for life is approximately $750,000. \n As for fairness and the perfect system:\n Approximately ninety-percent of those on death row could not afford to hire a lawyer when they were tried.\n Tabak, in Loyola of Los Angeles Law Review (1989) \n \n One searches our chronicles in vain for the execution of any member of the affluent strata in this society.\n Justice William 0. Douglas in Furman (408 US 238) \n \n To me this is simply a matter of right and wrong, and should not be construed as sympathy for those who do evil. I have no animosity toward the \"Fry 'um\" crowd because I once was a very vocal member.\n Dono", 
   {}, 
   183802, 
   null, 
   1133991180.0
  ], 
  [
   183888, 
   null, 
   "jim's trucking", 
   "The very few innocent executees are simply collateral damage...a small price to pay for ridding society of true vermin.\n \n Kill emoticon_xkill all child molesters and those who support them!\n \n Kill emoticon_xkill all terrorists and those who support them!\n \n Kill emoticon_xkill all rapists and those who support them!\n \n Kill emoticon_xkill all murderers and those who support them!", 
   {}, 
   183854, 
   null, 
   1133999040.0
  ], 
  [
   183897, 
   null, 
   "Mucusaur", 
   "The very few innocent executees are simply collateral damage...a small price to pay for ridding society of true vermin.\n\n \n Could you put that in a percent? is 10% innocent executees acceptable, or would you go as high as 49%? Once it is a net gain for \"justice\"?", 
   {}, 
   183888, 
   null, 
   1134000360.0
  ], 
  [
   183904, 
   null, 
   "georged", 
   "The very few innocent executees are simply collateral damage...a small price to pay for ridding society of true vermin.\n \n Kill emoticon_xkill all child molesters and those who support them!\n \n Kill emoticon_xkill all terrorists and those who support them!\n \n Kill emoticon_xkill all rapists and those who support them!\n \n Kill emoticon_xkill all murderers and those who support them!\n\n \n Isn't that similar to what Gen. Sherman said regarding his march to Savannah?", 
   {}, 
   183888, 
   null, 
   1134001140.0
  ], 
  [
   183916, 
   null, 
   "snakespit", 
   "Of course there are ways to prevent this. Not all countries suffer from the same abysmal environment for inmates. Or perhaps the problem runs deeper than merely the correctional facilities (allthough I suspect that they at least play an important part).\n\n So what do you suggest? A kinder, gentler type of prison? One where people who are used to living in rat infested projects are treated like they are staying in a 4 star hotel? That might actually make the idea of prison kinda appealing. \n \n Look, I will lay down my position for everyone right here and now.\n \n It is my opinion that our society in America has gotten too soft. People are weak and too willing to roll over. Prison should be a horrible, terrible place that people do not want to go to. Murderers and other violent felons should know that they may be put to death if they commit certain crimes. I think that getting a 15 year stretch in prison is too low a price for taking an innocent life. Many criminals seem more than willing to face 15 years for killing someone. Murderers and other violent felons should be made to pay the highest price...their own life. I will agree that the death penalty is too arbitrarily applied. If we used it far more often we would probably see a huge decrease in violent crime. Bottom line is that if you do not want to face a harsh penalty, don't commit a crime deserving of a harsh penalty.", 
   {}, 
   183781, 
   null, 
   1134004680.0
  ], 
  [
   183918, 
   null, 
   "Eddie", 
   "So what do you suggest? A kinder, gentler type of prison? One where people who are used to living in rat infested projects are treated like they are staying in a 4 star hotel? That might actually make the idea of prison kinda appealing. \n\n \n Perhaps this is the problem right here... You are supposed to be the richest nation on this planet for crying out loud...", 
   {}, 
   183916, 
   null, 
   1134004800.0
  ], 
  [
   183921, 
   null, 
   "georged", 
   "Perhaps this is the problem right here... You are supposed to be the richest nation on this planet for crying out loud...\n\n \n At this point in time we're regressing in servicing our own society. When the richest nation on the planet concentrates on expanding prison facilities and can't even come close to keeping up, the mistakes/problems creating that condition are obviously flourishing. Living in a politically conditioned siege mentality as the common citizen now does creates increased hostility towards those who do break the law and that average citizen demands often unnecessary and undeserving retribution out of a sense of helplessness. We in the US have questionable at best leadership which has been self-serving for several decades. Got any ideas other than a redirection of resources out of desperation or clean sweep of entrenched politicians?", 
   {}, 
   183918, 
   null, 
   1134005880.0
  ], 
  [
   183922, 
   null, 
   "snakespit", 
   "\"Criminal proceedings are fallible. Some people facing the death penalty have been exonerated, sometimes only minutes before their scheduled execution. Others have been executed before evidence clearing them is discovered. While criminal trials not involving the death penalty can also involve mistakes, there is at least the opportunity for those mistakes to be corrected. This has been particularly relevant in cases where new forensic methods (such as DNA) have become available. Since 1973, 119 people in 25 US states have been released from death row with evidence of their innocence.\"\n \n 119 would have died innocent were executions to be more efficient and done more quickly.\n\n Exonerated? Innocent? There is a hug difference between legal innocence and factual innocence. How many of these 119 do you think were factually innocent, and how many got off on technicalities. I would bet the latter makes up for far more than the prior. \n \n \n \nIf I change the quote to \"If a murderer is released and murders again, that has nothing to do with the death penalty, rather the life-sentence laws, so doesn't contribute to the number of lives saved by the death penalty)\" does that clarify?\n\n Not really. \n \n \n \nIf a murderer is released and murders again, that has nothing to do with the death penalty\n\n This part I agree with.\n \n \nrather the life-sentence laws, so doesn't contribute to the number of lives saved by the death penalty\n\n What? This part I am not sure I understand. If it has nothing to do with the death penalty, how could it have anything to do with lives saved by the death penalty in the first place? And what does it have to do with life sentencing laws? \n \n I boil it down to this. It has to do with the potential of lives to be saved. Both the death penalty and a life sentence would have prevent further murders. \n \n \n \nYou know the death penalty has killed innocents, but you don't know if it's saved any live. \n \n What about my main point? I take it you don't agree with it...\n \n -Wez\n\n No Wez, I do not. \n \n The death penalty is a warning, just like a lighthouse throwing its beams out to sea. We hear about shipwrecks, but we do not hear about the ships the lighthouse guides safely on their way. We do not have proof of the number of ships it saves, but we do not tear the lighthouse down. - poet Hyman Barshay", 
   {}, 
   183814, 
   null, 
   1134006000.0
  ], 
  [
   183923, 
   null, 
   "Eddie", 
   "At this point in time we're regressing in servicing our own society. When the richest nation on the planet concentrates on expanding prison facilities and can't even come close to keeping up, the mistakes/problems creating that condition are obviously flourishing. Living in a politically conditioned siege mentality as the common citizen now does creates increased hostility towards those who do break the law and that average citizen demands often unnecessary and undeserving retribution out of a sense of helplessness. We in the US have questionable at best leadership which has been self-serving for several decades. Got any ideas other than a redirection of resources out of desperation or clean sweep of entrenched politicians?\n\n \n Perhaps considering breaking up the union or at least give the states more political importance? Perhaps that could foster some type of ability to demand responsibility from your elected politicians? Other than that, you could perhapsre-consider the utility of such income differences you currently have? (and I`not talking about re-distributing resources through taxation as that would most certainly be hi-jacked as well as carry negative effects on your economy)", 
   {}, 
   183921, 
   null, 
   1134006300.0
  ], 
  [
   183925, 
   null, 
   "snakespit", 
   "Morality aside, no evidence of deterrence aside, the death penalty costs more than life imprisonment. A 1992 Dallas Morning News study found that the cost to Texas taxpayers of a capital trial and all subsequent appeals is an average of $2.3 million per case. This figure does not include the cost of the federal appeals process where 50% to 70% of the death sentences are overturned. By comparison, the cost of housing an inmate in a single cell maximum security unit for life is approximately $750,000. \n As for fairness and the perfect system:\n Approximately ninety-percent of those on death row could not afford to hire a lawyer when they were tried.\n Tabak, in Loyola of Los Angeles Law Review (1989) \n\n So people who are sentenced to life in prison are not granted the right of filing appeal after appeal as long as they are incarcerated? Really? Yeah, I am sure that they don't file appeals, after all, at least they are not on death row. emoticon_rolleyes", 
   {}, 
   183854, 
   null, 
   1134006660.0
  ], 
  [
   183929, 
   null, 
   "Dono", 
   "The very few innocent executees are simply collateral damage...a small price to pay for ridding society of true vermin.\n\n I believe that depends on who is doing the paying. If it were you or a member of your family the price might not be so small. Can anyone here visualize an innocent Jim cheerfully taking the needle to rid society of true vermin while whispering his last words, \"Collateral damage\"?\n Dono", 
   {}, 
   183888, 
   null, 
   1134006960.0
  ], 
  [
   183930, 
   null, 
   "snakespit", 
   "Perhaps this is the problem right here... You are supposed to be the richest nation on this planet for crying out loud...\n\n America has it's \"Haves' and have nots'\", just like any other country. And just like most countries in the world, the money is not distributed equally amongst all of our citizens. A great example is the city where I live. 2 million dollar homes in Chestnut Hill, 1 mile away on N. Broad, slums and ghettos. Such is life throughout the US.", 
   {}, 
   183918, 
   null, 
   1134007140.0
  ], 
  [
   183932, 
   null, 
   "georged", 
   "Perhaps considering breaking up the union or at least give the states more political importance? Perhaps that could foster some type of ability to demand responsibility from your elected politicians? Other than that, you could perhapsre-consider the utility of such income differences you currently have? (and I`not talking about re-distributing resources through taxation as that would most certainly be hi-jacked as well as carry negative effects on your economy)\n\n \n I think you're correct about re-establishing states rights to provide a balance for our very diversified society. We've drifted to a corrupt, single party federal system empowered to a point where electoral and popular votes are now bought and paid for with political spoils. \n \n As to the income disparity, that's bound to magnify as our general standard of living decreases, creating a greater need for social reform at the lower end or face vast increases in crimes against property and eventual third-world prison conditions. That'll be a tough one to even conceptualize until we reach a semblance of economic stability not based on elastic debt.", 
   {}, 
   183923, 
   null, 
   1134007980.0
  ], 
  [
   183934, 
   null, 
   "JPSartre12", 
   "So what do you suggest? A kinder, gentler type of prison? One where people who are used to living in rat infested projects are treated like they are staying in a 4 star hotel? That might actually make the idea of prison kinda appealing. \n \n Look, I will lay down my position for everyone right here and now.\n \n It is my opinion that our society in America has gotten too soft. People are weak and too willing to roll over. Prison should be a horrible, terrible place that people do not want to go to. Murderers and other violent felons should know that they may be put to death if they commit certain crimes. I think that getting a 15 year stretch in prison is too low a price for taking an innocent life. Many criminals seem more than willing to face 15 years for killing someone. Murderers and other violent felons should be made to pay the highest price...their own life. I will agree that the death penalty is too arbitrarily applied. If we used it far more often we would probably see a huge decrease in violent crime. Bottom line is that if you do not want to face a harsh penalty, don't commit a crime deserving of a harsh penalty.\n\n \n Spoken like a fellow Philly boy! Way to go! My sympathy is for the victim not the slimy bastard that put him in his grave. :xcensored", 
   {}, 
   183916, 
   null, 
   1134009600.0
  ], 
  [
   183940, 
   null, 
   "Dono", 
   "So people who are sentenced to life in prison are not granted the right of filing appeal after appeal as long as they are incarcerated? Really? Yeah, I am sure that they don't file appeals, after all, at least they are not on death row. emoticon_rolleyes\n\n Did I say that? If you will reread slowly, concentrating to the best of your ability, I believe you will see that I did not. Since you bring it up, however, I will point out that the death penality has an automatic appeal process and life sentences do not.\n Dono", 
   {}, 
   183925, 
   null, 
   1134014040.0
  ], 
  [
   183941, 
   null, 
   "georged", 
   "I believe that depends on who is doing the paying. If it were you or a member of your family the price might not be so small. Can anyone here visualize an innocent Jim cheerfully taking the needle to rid society of true vermin while whispering his last words, \"Collateral damage\"?\n Dono\n\n \n \n My thoughts in wondering why some citizens are so zealous to have strangers killed on an unaffiliated basis because they in most cases erroneously feel it offers protection from the unknown and/or undesirable. I do feel in many instances it's an emotion tied to somewhat closed minds; to follow established, previously condoned societal patterns with change identified as one of those fearful unknowns. It hasn't been all that many years since public hangings were popular events.", 
   {}, 
   183929, 
   null, 
   1134014220.0
  ], 
  [
   183942, 
   null, 
   "marc9000", 
   "I believe that depends on who is doing the paying. If it were you or a member of your family the price might not be so small. Can anyone here visualize an innocent Jim cheerfully taking the needle to rid society of true vermin while whispering his last words, \"Collateral damage\"?\n Dono\n\n \n I can't visualize it, because I can't picture him putting himself close enough to a capital crime to be accused of it.\n \n I wonder how often an \"innocent\" that gets put to death was an accomplice in a robbery - someone right beside the person who commited the capital crime. I think there is a huge difference between a true innocent, and one who commited a lesser crime, while willingly putting himself close to a capital crime.", 
   {}, 
   183929, 
   null, 
   1134014940.0
  ], 
  [
   183945, 
   null, 
   "daewoo", 
   "I can't visualize it, because I can't picture him putting himself close enough to a capital crime to be accused of it.\n \n I wonder how often an \"innocent\" that gets put to death was an accomplice in a robbery - someone right beside the person who commited the capital crime. I think there is a huge difference between a true innocent, and one who commited a lesser crime, while willingly putting himself close to a capital crime.\n\n \n Maybe you need to go back and read through the explanations of those cleared in the link I provided. Snakespit, you should probably do the same, then you can drop the rediculous arguments about them mostly being some kind of technicality. I know that tricky technicalities are prevelant on television shows and unbacked anecdotes, in the real world, that is just not how things work. Occasionally somebody will get off on what may be considered a tgechnicality, like the police not bothering to obtain a warrant, or vastly overstretching the authority of the warrant....if you can really consider a gross violation of rights to get an arrest a technicality. If that is the case, then the trial itself is nothing but a technicality that should be done away with, right?", 
   {}, 
   183942, 
   null, 
   1134016380.0
  ], 
  [
   183948, 
   null, 
   "marc9000", 
   "Maybe you need to go back and read through the explanations of those cleared in the link I provided.\n\n \n I just ran through the first 16 - it didn't give circumstances of why the innocents were accused. It seems that none of them were snatched out of their homes by police while reading the evening paper, or arrested while taking the kids to soccer practice.", 
   {}, 
   183945, 
   null, 
   1134018720.0
  ], 
  [
   183952, 
   null, 
   "daewoo", 
   "I just ran through the first 16 - it didn't give circumstances of why the innocents were accused. It seems that none of them were snatched out of their homes by police while reading the evening paper, or arrested while taking the kids to soccer practice.\n\n \n No, we have no idea what they were doing or why they were accused, though it seems that mistaken identity is a majopr player in many of the cases, and in only a handful of cases are there any other charges ever mentioned which would imply fairly strongly that there was nothign else to charge them with (especially when considering the excellent chance of these guys coming back and suing the government for millions).\n \n Would Jim put himself in a situation where he may someday face the death penalty, wrongfully accused? That depends. Does he ever exchange angry words with anybody? Is there anybody he does not like? Anybody who does not like him? Is Jim distinctive looking enough that nobody would ever mistake him for somebody else?\n \n Jim ha a fight with the guy next door. The lady across the street sees it. The next day, the guys shows up dead. Another guy on the block says he saw Jim leaving the guys house after hearing a shot. We are going to assume for the purpose of this that the person the guy saw was NOT Jim. Like so many others, he mis-identified somebody. After all, it was dark. \n \n Auddenyl the police have motive and an eyewitness. Jim is on his way to becoming collateral damage.", 
   {}, 
   183948, 
   null, 
   1134020760.0
  ], 
  [
   183991, 
   null, 
   "jim's trucking", 
   "Isn't that similar to what Gen. Sherman said regarding his march to Savannah?\nNo. Sherman was actually a pretty nice fellow. He burned buildings and crops. He didn't try to slay innocents.", 
   {}, 
   183904, 
   null, 
   1134052800.0
  ], 
  [
   183994, 
   null, 
   "jim's trucking", 
   "No, we have no idea what they were doing or why they were accused, though it seems that mistaken identity is a majopr player in many of the cases, and in only a handful of cases are there any other charges ever mentioned which would imply fairly strongly that there was nothign else to charge them with (especially when considering the excellent chance of these guys coming back and suing the government for millions).\n \n Would Jim put himself in a situation where he may someday face the death penalty, wrongfully accused? That depends. Does he ever exchange angry words with anybody? Is there anybody he does not like? Anybody who does not like him? Is Jim distinctive looking enough that nobody would ever mistake him for somebody else?\n \n Jim had a fight with the guy next door. The lady across the street sees it. The next day, the guy shows up dead. Another guy on the block says he saw Jim leaving the guy's house after hearing a shot. We are going to assume for the purpose of this that the person the guy saw was NOT Jim. Like so many others, he mis-identified somebody. After all, it was dark. \n \n Suddenly the police have motive and an eyewitness. Jim is on his way to becoming collateral damage.\nAll of these hypothetical conjectures are cute, but not deserving of a cigar. I do not have a confrontational demeanor, am seldom without the company of honest people with like qualities and seldom not accompanied by a video cam and a small but high quality 24 hour digital recorder. It would have to be a conspiracy to end in a false conviction. ...and if I do someday murder someone, I should be killed.", 
   {}, 
   183952, 
   null, 
   1134053940.0
  ], 
  [
   183998, 
   null, 
   "Eddie", 
   "All of these hypothetical conjectures are cute, but not deserving of a cigar. I do not have a confrontational demeanor, am seldom without the company of honest people with like qualities and seldom not accompanied by a video cam and a small but high quality 24 hour digital recorder. It would have to be a conspiracy to end in a false conviction. ...and if I do someday murder someone, I should be killed.\n\n \n Wow... I`m never accompanied by a video camera, I am often alone and I sure as hell don`t have a 24 hour digital recorder on me. Do you think that this should be required to protect one-self from flaws in your own legal system?", 
   {}, 
   183994, 
   null, 
   1134054240.0
  ], 
  [
   184000, 
   null, 
   "jim's trucking", 
   "Could you put that in a percent? is 10% innocent executees acceptable, or would you go as high as 49%? Once it is a net gain for \"justice\"?\n\n I guess my first response to this had too graphic an ending.\n \n Come up with a realistic number and we'll talk about it. I have a friend who would not balk at 99%.\n \n An argument regarding the death penalty should be confined to discussions regarding those who have been wrongly convicted and sentenced to death. It should not include figures simply related to errant convictions.\n \n With the use of DNA evidence and the proliferation of security cameras, the likelihood of errant convictions decreases daily.", 
   {}, 
   183897, 
   null, 
   1134054840.0
  ], 
  [
   184001, 
   null, 
   "jim's trucking", 
   "Wow... I`m never accompanied by a video camera, I am often alone and I sure as hell don`t have a 24 hour digital recorder on me. Do you think that this should be required to protect one-self from flaws in your own legal system?\nNo, but you'd be surprised how handy those things can be. I misspoke, too...it's a 2.4 hr recorder...very small, very lightweight and very sensitive...comes in handy during clandestine meetings with 007!", 
   {}, 
   183998, 
   null, 
   1134055140.0
  ], 
  [
   184002, 
   null, 
   "Eddie", 
   "No, but you'd be surprised how handy those things can be. I misspoke, too...it's a 2.4 hr recorder...very small, very lightweight and very sensitive...comes in handy during clandestine meetings with 007!\n\n \n Hehe.. cool. But I got my mobilephone that could has an inbuilt videorecorder (very crappy quality though), and my mp3 player could record sound... hmmm... :p", 
   {}, 
   184001, 
   null, 
   1134055440.0
  ], 
  [
   184038, 
   null, 
   "Wez", 
   "Exonerated? Innocent? There is a hug difference between legal innocence and factual innocence. How many of these 119 do you think were factually innocent, and how many got off on technicalities. I would bet the latter makes up for far more than the prior. \n\n I have no idea what you base that assumption on. Even if only 10% get off on factual evidence, that's still 12 innocents who would have otherwise died. How many cases can you cite where someone has escaped form life imprisonment and committed murder again? I'd be willing to bet it's less than either 119 or 12.\n \n \n \nWhat? This part I am not sure I understand. If it has nothing to do with the death penalty, how could it have anything to do with lives saved by the death penalty in the first place? And what does it have to do with life sentencing laws? \n\n I asked for the number of murderers who have escaped from life imprisonment and murdered again. I asked because some people say the death penalty protects people. I wanted to point out how it's almost unheard of people escaping from a life sentence and murdering again, so saying the death penalty protects people was a ridiculous argument. I added the disclaimer, so no-one tried to cite murders committed by people who've served their full time in prison, gotten out and murdered.\n \n \n \nI boil it down to this. It has to do with the potential of lives to be saved. Both the death penalty and a life sentence would have prevent further murders.\n\n Yep. So why not just give them a life sentence rather than kill them? One way you execute some innocents, the other way you execute no innocents.:)\n \n \nNo Wez, I do not. \n \n The death penalty is a warning, just like a lighthouse throwing its beams out to sea. We hear about shipwrecks, but we do not hear about the ships the lighthouse guides safely on their way. We do not have proof of the number of ships it saves, but we do not tear the lighthouse down. - poet Hyman Barshay\n\n Life imprisonment would achieve the same.\n \n -Wez", 
   {}, 
   183922, 
   null, 
   1134071820.0
  ], 
  [
   184050, 
   null, 
   "oliphant", 
   "So far, no pro death penalty posts here have given good reasons to use it. There is no proof that it scares off potential murderers in society, and no other argument even makes sense.\n \n People always talk about how \"We need to think of John (the murdered), and have them put to death for John's sake.\" The dead don't seek revenge, and revenge can be nothing but meaningless to a person who is dead. Unless, of course, you can prove that revenge does have meaning for the dead, in which case our justice system might have reason to consider it. What these people are really doing is using the dead's name in order to get their own personal revenge. Anyone who uses the dead's name like this is defaming them, and this is absolutely wrong. If you want revenge, ask for it in your own name; don't be a coward. But, if you weren't the one murdered, what right do you have to ask for revenge in your own name? You don't. The only reason you have a right to ask for punishment at all is in the name of protecting society. We punish to ensure future safety by staving off future wrongdoings (again, the death penalty is no more effective than eternity in prison).\n \n From the American people's perspective, what is just about spending more of their money putting a man to death than they would by simply removing him from society for the rest of his life? Both accomplish the same goal of total removal. If it has ever happened that a man convicted of murder was legally released, and killed yet again, one (or even a few) incident is laughable in the face of the number of innocent people put on death row. \n \n The argument that convicted murderers might break free is also a joke. Justice is not put to use by acting under the assumption that its dictates will not be followed through. Similarly, we could assume anything about anyone we ever punished at all. Were I a teacher, I could assume that the child I sent to the corner was going to leave early, and thus escort him straight to the principle's office, just to be prudent. Such reasoning allows virtually any punishment to be extended ad infinitum because the punished might fall out of line with their punishment at any time.\n \n Then there is the argument that flaws in the death penalty lay with the judiciary system, not with the actual penalty itself. While anyone can accept that a \"perfect\" judiciary system would only send real murderers to death row, even if this were the case, it does not negate the problems mentioned before. The death penalty costs the tax payers more and benefits neither the dead, nor society, in any way, and society doesn't punish in order to \"get revenge.\" (In addition, this argument can be flipped and used against the argument that prisoners might escape. \"But that's a problem with prison security!\" Or against the inmate release argument: \"But that's a problem with releasing life-in-prison muderers, not with the punishment itself if it were properly used!\")\n \n But the worst part of it all is this \"machismo\" aura that many pro-death penalty citizens try to emulate. \"They killed so and so, therefore stick it to 'em and let 'em burn! I hope he dies slow, and wets himself, too!!\" You think this is manly? The biggest laugh of the whole death penalty argument is that the whole thing is upheld by sniveling, quivering cowards who don't appear to know what it is to be a real man (or woman) in the least.", 
   {
    "unicode_changes_made": true
   }, 
   183994, 
   null, 
   1134075600.0
  ], 
  [
   184057, 
   null, 
   "jim's trucking", 
   "So far, no pro death penalty posts here have given good reasons to use it. There is no proof that it scares off potential murderers in society, and no other argument even makes sense.\n \n People always talk about how \"We need to think of John (the murdered), and have them put to death for John's sake.\" The dead don't seek revenge, and revenge can be nothing but meaningless to a person who is dead. Unless, of course, you can prove that revenge does have meaning for the dead, in which case our justice system might have reason to consider it. What these people are really doing is using the dead's name in order to get their own personal revenge. Anyone who uses the dead's name like this is defaming them, and this is absolutely wrong. If you want revenge, ask for it in your own name; don't be a coward. But, if you weren't the one murdered, what right do you have to ask for revenge in your own name? You don't. The only reason you have a right to ask for punishment at all is in the name of protecting society. We punish to ensure future safety by staving off future wrongdoings (again, the death penalty is no more effective than eternity in prison).\n \n From the American people's perspective, what is just about spending more of their money putting a man to death than they would by simply removing him from society for the rest of his life? Both accomplish the same goal of total removal. If it has ever happened that a man convicted of murder was legally released, and killed yet again, one (or even a few) incident is laughable in the face of the number of innocent people put on death row. \n \n The argument that convicted murderers might break free is also a joke. Justice is not put to use by acting under the assumption that its dictates will not be followed through. Similarly, we could assume anything about anyone we ever punished at all. Were I a teacher, I could assume that the child I sent to the corner was going to leave early, and thus escort him straight to the principle's office, just to be prudent. Such reasoning allows virtually any punishment to be extended ad infinitum because the punished might fall out of line with their punishment at any time.\n \n Then there is the argument that flaws in the death penalty lay with the judiciary system, not with the actual penalty itself. While anyone can accept that a \"perfect\" judiciary system would only send real murderers to death row, even if this were the case, it does not negate the problems mentioned before. The death penalty costs the tax payers more and benefits neither the dead, nor society, in any way, and society doesn't punish in order to \"get revenge.\"\n \n But the worst part of it all is this \"machismo\" aura that many pro-death penalty citizens try to emulate. \"They killed so and so, therefore stick it to 'em and let 'em burn! I hope he dies slow, and wets himself, too!!\" You think this is manly? The biggest laugh of the whole death penalty argument is that the whole thing is upheld by sniveling, quivering cowards who don't appear to know what it is to be a real man (or woman) in the least.\nI doubt there will ever be any hard evidence that executions deter future criminals from committing similar crimes. I'd have as hard a time proving that as I do proving that my Elephant Repellent works. Even though I've never had elephant problems while using it, I've never had elephant problems while not using it.\n \n I suppose proof would require that we do away with the death penalty for a generation or so, then reinstate it and watch the capital crimes rates go down. I'm believing that's exactly what would happen.\n \n Knowledge of possible penalties for certain acts is likely a deterrent only for those who remain conscience of it immediately prior to the commitment to complete the act. I doubt a man who chokes his wife to death in a fit of rage stops to think that he might be executed for it, but if we categorically prohibit all executions, he will know all along that his worst prescribed punishment will include room and board. \n \n BTW, if you really think I'm a sniveling, quivering coward, let me invite you to a real duel. We'll find out whether you're afraid of death.", 
   {
    "unicode_changes_made": true
   }, 
   184050, 
   null, 
   1134076980.0
  ], 
  [
   184071, 
   null, 
   "oliphant", 
   "I'd have as hard a time proving that as I do proving that my Elephant Repellent works. Even though I've never had elephant problems while using it, I've never had elephant problems while not using it.\n\n I may be alone on this, but if I had never had elephant problems in the past, I wouldn't go through the trouble of putting on any repellant. Rationality is silly that way.\n \n \n\n BTW, if you really think I'm a sniveling, quivering coward, let me invite you to a real duel. We'll find out whether you're afraid of death. \n\n This is exactly the XXXX I'm talking about, and the death penalty debate reeks of it.", 
   {}, 
   184057, 
   null, 
   1134083160.0
  ], 
  [
   184121, 
   null, 
   "Dono", 
   "This is exactly the XXXX I'm talking about, and the death penalty debate reeks of it.\n\n A duel? Your point is well taken.\n In an earlier post I stated that change would come, albeit slowly. I am encouraged by a October '05 Gallop poll that found overall support for the death penalty was 64% (down from 80% in 1994) and another poll, May '04, revealed that when respondents were given a choice of life without parole as an alternate sentencing option, support for the death penalty was 50%. \n Dono", 
   {}, 
   184071, 
   null, 
   1134094680.0
  ], 
  [
   184136, 
   null, 
   "marc9000", 
   "No, we have no idea what they were doing or why they were accused, though it seems that mistaken identity is a majopr player in many of the cases, and in only a handful of cases are there any other charges ever mentioned which would imply fairly strongly that there was nothign else to charge them with (especially when considering the excellent chance of these guys coming back and suing the government for millions).\n\n \n Sueing the government - you're kidding right? It's not surprising that other charges wouldn't be mentioned since they would most likely not be close to capital offenses, (robbery/drug offenses) and if the person doing the reporting was anti-death penalty. \n \n \nWould Jim put himself in a situation where he may someday face the death penalty, wrongfully accused? That depends. Does he ever exchange angry words with anybody? Is there anybody he does not like? Anybody who does not like him? Is Jim distinctive looking enough that nobody would ever mistake him for somebody else?\n \n \n When and where he exchanges words with somebody would be important. It would benefit him greatly not to do it on a popular drug dealing corner at 2:00 AM. \n \n \nJim ha a fight with the guy next door. The lady across the street sees it. The next day, the guys shows up dead. Another guy on the block says he saw Jim leaving the guys house after hearing a shot. We are going to assume for the purpose of this that the person the guy saw was NOT Jim. Like so many others, he mis-identified somebody. After all, it was dark. \n \n Auddenyl the police have motive and an eyewitness. Jim is on his way to becoming collateral damage.\n\n \n That's a possible scenario, but if Jim's life was in perfect order in every other way, the chances of him getting the death penalty would be slim. \n \n HOW one is put to death is an important consideration. While an innocent, rap sheet or not, being put to death by government is a terrible thing, there are worse ways to die than a government lethal injection. Victims do all the time, whether slowly over a period of weeks like Terry Schivo, or a few days like a 5 year old girl that gets raped, tortured over a period of days, then slowly killed. I don't know what the ratio is for murder victims on the streets or in their own houses as opposed to mistaken government executions, but I suspect it's quite a contrast.", 
   {}, 
   183952, 
   null, 
   1134097860.0
  ], 
  [
   184145, 
   null, 
   "zachvac", 
   "The very few innocent executees are simply collateral damage...a small price to pay for ridding society of true vermin.\n \n Kill emoticon_xkill all child molesters and those who support them!\n \n Kill emoticon_xkill all terrorists and those who support them!\n \n Kill emoticon_xkill all rapists and those who support them!\n \n Kill emoticon_xkill all murderers and those who support them!\n\n \n Isn't that kind of how Hitler thought? Would you think this way if you were the innocent to die? Or a family member? I don't know if you have kids but if you do (and you can pretend if you don't) what if people were arguing \"well killing your kid may be killing an innocent, but it's worth it for the guilty people we'll be killing. After all we don't want to take the chance that he/she MIGHT be guilty so we'll kill him/her so he/she won't ever kill again.\n \n How would you feel about it then? You don't understand, these are real people. I have a lot of respect for you but I'm sorry, when you trivialize human lives like that (it's worth these lives) it reminds me of those who talk about the deaths in our military being \"worth it\". Of course these people aren't risking their necks or having their kids, friends, family risk their lives. Life is a precious thing (after all, you're proposing the death penalty because of killing) and even ONE incorrect execution is one too many. That was a human life. How would you feel if your kid was executed and years later they came back and said, \"oh by the way your kid was innocent, but the death penalty's worth it because your kid's life is nothing compared to the guilty we have killed\".\n \n It's cheaper by a LOT to just lock them up in solitary confinement for life (and that means LIFE, NO PAROLE, NO EXCEPTIONS other than when there is future evidence). So we save money, prevent executing innocents, and we prevent all future crimes by that person. Unless you really think that the death penalty is a deterrant (stats prove otherwise), than there is no case to have the death penalty rather than solitary confinement ($75,000 is a lot of money, but it's better than over $2 million). How about we just start randomly killing people? We could get the person who may kill in the future. We could save millions of lives. But we could also kill many innocent people. While the stats aren't quite that bad, I believe any unnecessary killing of innocents is a HORRIBLE thing, especially if not doing it saves money. Pretty much a no-brainer in my opinion.", 
   {}, 
   183888, 
   null, 
   1134100620.0
  ], 
  [
   184153, 
   null, 
   "zachvac", 
   "I doubt there will ever be any hard evidence that executions deter future criminals from committing similar crimes. I'd have as hard a time proving that as I do proving that my Elephant Repellent works. Even though I've never had elephant problems while using it, I've never had elephant problems while not using it.\n \n I suppose proof would require that we do away with the death penalty for a generation or so, then reinstate it and watch the capital crimes rates go down. I'm believing that's exactly what would happen.\n \n Knowledge of possible penalties for certain acts is likely a deterrent only for those who remain conscience of it immediately prior to the commitment to complete the act. I doubt a man who chokes his wife to death in a fit of rage stops to think that he might be executed for it, but if we categorically prohibit all executions, he will know all along that his worst prescribed punishment will include room and board. \n \n BTW, if you really think I'm a sniveling, quivering coward, let me invite you to a real duel. We'll find out whether you're afraid of death.\n\n \n No, it's easier than that. There are many countries in the world. There are many states in the country. Only some states use the death penalty, only some countries allow the death penalty. Take a look at the stats for capital crimes in these countries/states. I'm pretty sure that the states with the death penalty do NOT have better crime rates or even better capital crime rates.\n \n When a criminal will do a crime risking solitary confinement for life, I would think they would also do it risking death, because once you do it despite a life sentence, you are either saying it's worth your life or else you don't think you'll get caught, or you just don't even think about the punishment.\n \n Some criminals even commit suicide? I'm sure the death penalty would have been a great deterrant for them.", 
   {}, 
   184057, 
   null, 
   1134101340.0
  ], 
  [
   184187, 
   null, 
   "jim's trucking", 
   "Originally Posted by jim's trucking\n I'd have as hard a time proving that as I do proving that my Elephant Repellent works. Even though I've never had elephant problems while using it, I've never had elephant problems while not using it.\n \n \n \n \n \n \nI may be alone on this, but if I had never had elephant problems in the past, I wouldn't go through the trouble of putting on any repellant. Rationality is silly that way.\n\n \n \n Originally Posted by jim's trucking\n BTW, if you really think I'm a sniveling, quivering coward, let me invite you to a real duel. We'll find out whether you're afraid of death. \n \n \n \n \n\n This is exactly the XXXX I'm talking about, and the death penalty debate reeks of it.\nSurely, you don't ACTUALLY think I was serious about either of these....do you?\n \n I can assure you that I have no elephant repellant and that I do not duel.\n \n It does not follow though that I am a sniveling coward. After all, I was a Boy Scout!:p \n \n Loosen up a bit...you'll live longer!\n \n Where's my oliphant repellant?", 
   {}, 
   184071, 
   null, 
   1134108060.0
  ], 
  [
   184201, 
   null, 
   "oliphant", 
   "As far as I know, you may as well ACTUALLY believe any number of things, if you actually believe in the death penalty. Logic that does not follow is logic that does not follow.\n \n And \"loosen up?\" We aren't talking about our favorite color here, or didn't you notice? As far as I'm concerned, debates exactly like this determine the fates of innocent people's lives. That's not something to \"loosen up\" over.", 
   {}, 
   184187, 
   null, 
   1134110340.0
  ], 
  [
   184202, 
   null, 
   "jim's trucking", 
   "Isn't that kind of how Hitler thought? \nWhat a cheap and uneducated shot. Hitler was hellbent on wiping out an entire race of people along with homosexuals and gypsies. He did not want to kill only the worthless criminal bastards that I would like to see die.\n \n \n \n\n Would you think this way if you were the innocent to die? \nOf course not.\n \n \nOr a family member? \nDepends on which one...;) JK...of course not. \nI don't know if you have kids but if you do (and you can pretend if you don't) what if people were arguing \"well killing your kid may be killing an innocent, but it's worth it for the guilty people we'll be killing. \nKilling an innocent won't affect the guilty much if any.\n \n \nAfter all we don't want to take the chance that he/she MIGHT be guilty so we'll kill him/her so he/she won't ever kill again.\n If there's any doubt about the innocence or guilt, the person should have been acquitted. I know you'll likely say \"What if they didn't actually commit the crime but were found guilty?\" Convince yourself that those found guilty are by definition GUILTY. It makes no difference that they didn't actually do the crime. They are still guilty because the jury said so. That's a mistake on the jury's part and may result in the death of someone other than the one who really did it, but the execution would still be of the party found guilty by rule of law. Collateral damage.\n \n \nHow would you feel about it then? You don't understand, these are real people. \nNo more real than the victims were.\n \n \nI have a lot of respect for you but I'm sorry, when you trivialize human lives like that (it's worth these lives) it reminds me of those who talk about the deaths in our military being \"worth it\". \nYou'd rather I would trivialize the lives of the victims? ...and if you don't thinik the deaths of our soldiers was \"worth it\", you are a sick puppy.\n \n \n\n Of course these people aren't risking their necks or having their kids, friends, family risk their lives. Life is a precious thing (after all, you're proposing the death penalty because of killing) and even ONE incorrect execution is one too many. That was a human life. How would you feel if your kid was executed and years later they came back and said, \"oh by the way your kid was innocent, but the death penalty's worth it because your kid's life is nothing compared to the guilty we have killed\".\nI'd likely feel the same as I would had my child died needlessly as a result of a drunk driver running him down.\n \n \n \n\n It's cheaper by a LOT to just lock them up in solitary confinement for life (and that means LIFE, NO PAROLE, NO EXCEPTIONS other than when there is future evidence).\nOnly if you factor in the cost of the trial and appeals. I've made a standing offer regarding batch executions. I work cheap.\n \n \n \n\n So we save money, prevent executing innocents, and we prevent all future crimes by that person. Unless you really think that the death penalty is a deterrent (stats prove otherwise),\nShow me the stats that \"prove\" this. \n \n \n...than there is no case to have the death penalty rather than solitary confinement ($75,000 is a lot of money, but it's better than over $2 million). \nFor one proven guilty (of the capital crimes) a fifty cent bullet will do the trick.\n \n \nHow about we just start randomly killing people? We could get the person who may kill in the future. We could save millions of lives. But we could also kill many innocent people.\nDon't be completely silly here.\n \n \n While the stats aren't quite that bad, I believe any unnecessary killing of innocents is a HORRIBLE thing, especially if not doing it saves money. Pretty much a no-brainer in my opinion.\nWho said it was unnecessary killing that I advocate. I believe it IS necessary...and money is the least of my worries.", 
   {}, 
   184201, 
   null, 
   1134110580.0
  ], 
  [
   184204, 
   null, 
   "jim's trucking", 
   "As far as I know, you may as well ACTUALLY believe any number of things, if you actually believe in the death penalty. Logic that does not follow is logic that does not follow.\nMay I quote you on that?\n \n \n \n\n And \"loosen up?\" We aren't talking about our favorite color here, or didn't you notice? As far as I'm concerned, debates exactly like this determine the fates of innocent people's lives. That's not something to \"loosen up\" over.\nI was addressing the existence of elephant repellent.", 
   {}, 
   184201, 
   null, 
   1134111180.0
  ], 
  [
   184215, 
   null, 
   "Dono", 
   ". I'm pretty sure that the states with the death penalty do NOT have better crime rates or even better capital crime rates.\n\n You are correct. Consistent with previous years, the FBI Uniform Crime Report shows that the South (US) has the highest murder rates. The South accounts for over 80% of executions. \n Dono", 
   {}, 
   184153, 
   null, 
   1134116340.0
  ], 
  [
   184216, 
   null, 
   "coolcodemn3", 
   "all i have to say is kill Tookie, Peterson, Manson, and all other sick twisted people", 
   {}, 
   184215, 
   null, 
   1134117000.0
  ], 
  [
   184260, 
   null, 
   "jim's trucking", 
   "I concede that my attitude toward the death penalty is harsh and does permit the occasional execution of someone who didn't actually do the crime. However, if one applies the same logic to non-capital crimes for the purpose of curing all our mistakes regarding errant convictions, then we must cease to punish criminals at all. If doubt about the accuracy of the jury verdict is to keep a criminal from being executed after he commits a crime for which the penalty is precsribed as DEATH, then doubt about the accuracy of the jury verdict in a mail fraud case should keep the accused from being sent to prison or paying any fine whatsoever. We certainly don't want an innocent person to be forced to pay for something they didn't do.\n \n The problem is not with the penalty, but the justice system's inherent probability to miscue now and then by producing a mistaken verdict. That's what we need to address.\n \n There are cases where obvious guilt is circumvented by silly technicalities. There are cases where convictions are obtained by way of planted evidence and dishonest cops/lawyers. There are cases where criminals have insufficient or totally inept representation. There are cases where evidence is \"mistakenly\" witheld. All of these things need to be fixed.\n \n A computerized robotic justice system, devoid of human intervention and bias is too far down the road to be of any use to us, but it could happen someday. The only problem is that some human has to build and program it.", 
   {}, 
   184216, 
   null, 
   1134147900.0
  ], 
  [
   184262, 
   null, 
   "jim's trucking", 
   "You are correct. Consistent with previous years, the FBI Uniform Crime Report shows that the South (US) has the highest murder rates. The South accounts for over 80% of executions. \n Dono\n\n That does not support the argument that the death penalty is not a deterrent. It's just as lacking as the argument that the fact that the South convicts more blacks than other areas means the South is racist.\n \n The relative populations of compared areas dictates the discrepancy in event density.\n \n Highest murder rates and highest executions would logically go hand in hand.", 
   {}, 
   184215, 
   null, 
   1134148320.0
  ], 
  [
   184263, 
   null, 
   "georged", 
   "all i have to say is kill Tookie, Peterson, Manson, and all other sick twisted people\n\n \n If it's that important to you that they die rather than being imprisoned for life, would you be prepared to personally administer the death sentence to any one of those people even though your knowledge of them is limited to media reports? Are you a stone killer devoid of all emotion?", 
   {}, 
   184216, 
   null, 
   1134148620.0
  ], 
  [
   184264, 
   null, 
   "jim's trucking", 
   "If it's that important to you that they die rather than being imprisoned for life, would you be prepared to personally administer the death sentence to any one of those people even though your knowledge of them is limited to media reports? Are you a stone killer devoid of all emotion?\nI'm not answering for coolcodemn3, but your question begs the answer:Long ago, the Executioner wore a black hood and carried a big axe. Today, the military firing squads issue one blank shell so that nobody knows who really killed the convicted person. The job of Executioner is just a job, to be performed by a disinterested party AFTER the conviction and sentencing. I could easily do it and not lose any sleep over whether the newly dead man was truly the criminal.\n \n Knowing what you read in the media and knowing what the jury concluded are separate things.", 
   {}, 
   184263, 
   null, 
   1134149340.0
  ], 
  [
   184269, 
   null, 
   "Eddie", 
   "I'm not answering for coolcodemn3, but your question begs the answer:Long ago, the Executioner wore a black hood and carried a big axe. Today, the military firing squads issue one blank shell so that nobody knows who really killed the convicted person. The job of Executioner is just a job, to be performed by a disinterested party AFTER the conviction and sentencing. I could easily do it and not lose any sleep over whether the newly dead man was truly the criminal.\n \n Knowing what you read in the media and knowing what the jury concluded are separate things.\n\n \n \n Acutally, long ago, the executioner was a convict also sentenced to death. By agreeing to execute other convicts, he was able to postpone his death sentance. The first job for any new executioner was to execute his predecessor. This was why he was marked (so he couldn`t escape) by cutting of his ears, hence the black hood. I find it interesting that even back then during the dark ages when executions where considered a family occasion, the actual job of executing was not delegated to a civilian or even a soldier, but rather an allready condemned man.", 
   {}, 
   184264, 
   null, 
   1134150840.0
  ], 
  [
   184272, 
   null, 
   "jim's trucking", 
   "Acutally, long ago, the executioner was a convict also sentenced to death. By agreeing to execute other convicts, he was able to postpone his death sentance. The first job for any new executioner was to execute his predecessor. This was why he was marked (so he couldn`t escape) by cutting of his ears, hence the black hood. I find it interesting that even back then during the dark ages when executions where considered a family occasion, the actual job of executing was not delegated to a civilian or even a soldier, but rather an allready condemned man.\nSome other interesting executioner notes.\n \n http://executions.mysite.wanadoo-members.co.uk/page2.html", 
   {}, 
   184269, 
   null, 
   1134152220.0
  ], 
  [
   184279, 
   null, 
   "Eddie", 
   "Some other interesting executioner notes.\n \n http://executions.mysite.wanadoo-members.co.uk/page2.html\n\n \n Interesting that the proffession changed in that fashion in just a few hundred years. Perhaps that was one of the prices of the industrial revolution when human life was degraded into numbers and prices.\n \n Thanks for the link", 
   {}, 
   184272, 
   null, 
   1134152580.0
  ], 
  [
   184293, 
   null, 
   "Wez", 
   "I concede that my attitude toward the death penalty is harsh and does permit the occasional execution of someone who didn't actually do the crime. However, if one applies the same logic to non-capital crimes for the purpose of curing all our mistakes regarding errant convictions, then we must cease to punish criminals at all. \n\n You can compensate criminals if you lock them up when they were innocent. You can't compensate the dead.\n \n -Wez", 
   {}, 
   184260, 
   null, 
   1134156300.0
  ], 
  [
   184301, 
   null, 
   "Dono", 
   "...... I could easily do it and not lose any sleep over whether the newly dead man was truly the criminal.\n\n Each to his own conscience , I could not. My father witnessed an execution (electrocution) and he said it was one of the most barbaric things he had ever seen, this from a twice wounded combat veteran. I was once a supporter of the death penalty and made many of the same arguments that proponents repeat, but over time as I examined it for fairness, morality, effect, cost and all the other elements, I had to change my mind (something I don't do easily). For this reason, as I watch the pendulum of opinion slowly swinging away from death, I am encouraged.\n Dono", 
   {}, 
   184264, 
   null, 
   1134164400.0
  ], 
  [
   184303, 
   null, 
   "georged", 
   "Makes me wonder how many posters favoring a death penalty have seen sudden human death. I won't get graphic, but it's something not easily erased from the mind.", 
   {}, 
   184301, 
   null, 
   1134165480.0
  ], 
  [
   184306, 
   null, 
   "oliphant", 
   "I concede that my attitude toward the death penalty is harsh and does permit the occasional execution of someone who didn't actually do the crime. However, if one applies the same logic to non-capital crimes for the purpose of curing all our mistakes regarding errant convictions, then we must cease to punish criminals at all. If doubt about the accuracy of the jury verdict is to keep a criminal from being executed after he commits a crime for which the penalty is precsribed as DEATH, then doubt about the accuracy of the jury verdict in a mail fraud case should keep the accused from being sent to prison or paying any fine whatsoever. We certainly don't want an innocent person to be forced to pay for something they didn't do.\n \n The problem is not with the penalty, but the justice system's inherent probability to miscue now and then by producing a mistaken verdict. That's what we need to address.\n \n\n \n\n Then there is the argument that flaws in the death penalty lay with the judiciary system, not with the actual penalty itself. While anyone can accept that a \"perfect\" judiciary system would only send real murderers to death row, even if this were the case, it does not negate the problems mentioned before. The death penalty costs the tax payers more and benefits neither the dead, nor society, in any way, and society doesn't punish in order to \"get revenge.\" (In addition, this argument can be flipped and used against the argument that prisoners might escape. \"But that's a problem with prison security!\" Or against the inmate release argument: \"But that's a problem with releasing life-in-prison muderers, not with the punishment itself if it were properly used!\")\n \n\n As one can see, the argument against the death penalty does not even require the deaths of innocent people, or a flawed judicial system, in order to be valid.", 
   {
    "unicode_changes_made": true
   }, 
   184202, 
   null, 
   1134168660.0
  ], 
  [
   184307, 
   null, 
   "jim's trucking", 
   "You can compensate criminals if you lock them up when they were innocent. You can't compensate the dead.\n \n -Wez\nWe don't even do much of the former.\n \n Besides, that doesn't address the problem of an inaccurate ruling from a jury or judge.\n \n Maybe we should compensate the victim's families. I've heard of humongous settlements in wrongful death claims. Why is this not available to the families of the wrongly executed? Would the amount depend upon their age and potential earnings or just be a standard lump sum? How do you put a price on a life?", 
   {}, 
   184293, 
   null, 
   1134169260.0
  ], 
  [
   184325, 
   null, 
   "Truthsayer", 
   "What to do with Tookie? I won't lose any sleep either way. Whereas I can agree that Tookie supposedly represents a sucessful \"evidence\" of our rehabilition system and killing him would remove what little evidence we have of the system working to begin with, I would prefer to focus such rehabiliting efforts on burglars, thieves and criminals of another sort.\n \n Too late for you Tookie. Your heinous crimes disqualifies you for rehabilitation. This is about the ultimate punishment not rehabilitation. Either we do away with the death penalty altogether or enforce the damn thing. There shouldn't be so much gray area.\n \n I am not a big proponent of the death penalty. But if anybody ever deserved it, he does.\n \n Once a convict gets the death penalty, it should have some teeth. We should not send the message that jail-house conversions and writing moral bound children's books negates it's purpose.\n \n If we are to enforce capitol punishment at all, this would make a perfect last chapter in the Tookie Book of Moral Redemption.", 
   {}, 
   184307, 
   null, 
   1134175080.0
  ], 
  [
   184331, 
   null, 
   "JPSartre12", 
   "Makes me wonder how many posters favoring a death penalty have seen sudden human death. I won't get graphic, but it's something not easily erased from the mind.\n\n \n I helped unload an ambulance containing a victim bleeding out after being hit stepping off a bus. I couldn't even tell the color of his hair or clothes because they were all red. He died before we made it inside the ER. I was 13.\n I still favor the death penalty. In fact, I'd throw the switch on some \"deserving soul\".", 
   {}, 
   184303, 
   null, 
   1134178980.0
  ], 
  [
   184334, 
   null, 
   "snakespit", 
   "Makes me wonder how many posters favoring a death penalty have seen sudden human death. I won't get graphic, but it's something not easily erased from the mind.\n\n How about 3 last week. None this week yet, but I have the rest of tonight, saturday night, and sunday night to go. Given the Icy roads and the upswing of violence on the weekends, I'm sure it won't be long. And what is the hangup about death, we all do it sooner or later? Doesn't bother me in the least.", 
   {}, 
   184303, 
   null, 
   1134182880.0
  ], 
  [
   184335, 
   null, 
   "snakespit", 
   "What to do with Tookie? I won't lose any sleep either way. Whereas I can agree that Tookie supposedly represents a sucessful \"evidence\" of our rehabilition system and killing him would remove what little evidence we have of the system working to begin with, I would prefer to focus such rehabiliting efforts on burglars, thieves and criminals of another sort.\n \n Too late for you Tookie. Your heinous crimes disqualifies you for rehabilitation. This is about the ultimate punishment not rehabilitation. Either we do away with the death penalty altogether or enforce the damn thing. There shouldn't be so much gray area.\n \n I am not a big proponent of the death penalty. But if anybody ever deserved it, he does.\n \n Once a convict gets the death penalty, it should have some teeth. We should not send the message that jail-house conversions and writing moral bound children's books negates it's purpose.\n \n If we are to enforce capitol punishment at all, this would make a perfect last chapter in the Tookie Book of Moral Redemption.\n\n Again, does it bother anyone that this \"reformed\" loser still goes by his gang moniker of \"tookie\"? Aside from which, reformed or not, he was not sentenced to reform. He was sentenced to death by execution. He can be as reformed as he wants, or at least as reformed as he wants us to believe, doesn't cut any ice with me.", 
   {}, 
   184325, 
   null, 
   1134183000.0
  ], 
  [
   184339, 
   null, 
   "Master_Shake", 
   "So I'm completely up front about it, I am adamently opposed to the death penalty period. I did some hard thinking on this one and I think even if I was okay with the death penalty I would, at the very least, feel uneasy about putting this man to death if not be outright opposed to it. Among other things, what does it say about us as a society if we kill people who not only reform there own lives, but the lives of many others?", 
   {}, 
   184335, 
   null, 
   1134186120.0
  ], 
  [
   184340, 
   null, 
   "JPSartre12", 
   "So I'm completely up front about it, I am adamently opposed to the death penalty period. I did some hard thinking on this one and I think even if I was okay with the death penalty I would, at the very least, feel uneasy about putting this man to death if not be outright opposed to it. Among other things, what does it say about us as a society if we kill people who not only reform there own lives, but the lives of many others?\n\n \n It says \"Don't do the crime if you can't do the time.\" emoticon_rolleyes \n If we granted clemency to the man that started one of the two largest gangs in the country that has never acknowledged his crime and has been violent while IN prison, what does that say about our commitment to law and order?emoticon_wow", 
   {}, 
   184339, 
   null, 
   1134186540.0
  ], 
  [
   184342, 
   null, 
   "snakespit", 
   "So I'm completely up front about it, I am adamently opposed to the death penalty period. I did some hard thinking on this one and I think even if I was okay with the death penalty I would, at the very least, feel uneasy about putting this man to death if not be outright opposed to it. Among other things, what does it say about us as a society if we kill people who not only reform there own lives, but the lives of many others?\n\n It says that you may write as many books and make as many speaches as you want, but you still must pay for the crimes you are found guilty of. Good deeds do not \"make up\" for the crimes he has commited. Don't forget, his legacy lives on in every \"crip\" that gets killed or kills another. If I set someones house on fire, and then try to put it out while their house burns to the ground, I am still an arsonist.", 
   {}, 
   184339, 
   null, 
   1134187080.0
  ], 
  [
   184343, 
   null, 
   "georged", 
   "It says \"Don't do the crime if you can't do the time.\" emoticon_rolleyes \n If we granted clemency to the man that started one of the two largest gangs in the country that has never acknowledged his crime and has been violent while IN prison, what does that say about our commitment to law and order?emoticon_wow\n\n \n That with the highest per-capita incarceration number in the world, being the only westernized nation using the death penalty and under attack by an extremist organization due to our foreign policy we have some scary, deep-seated social problems?", 
   {}, 
   184340, 
   null, 
   1134187140.0
  ], 
  [
   184345, 
   null, 
   "snakespit", 
   "With all this talk about innocent people being put to death, I was wondering. Can anyone point out cases with concrete proof where we have put an innocent to death?", 
   {}, 
   184343, 
   null, 
   1134187800.0
  ], 
  [
   184349, 
   null, 
   "Master_Shake", 
   "That with the highest per-capita incarceration number in the world, being the only westernized nation using the death penalty and under attack by an extremist organization due to our foreign policy we have some scary, deep-seated social problems?\n\n Couldn't have given a better answer myself.", 
   {}, 
   184343, 
   null, 
   1134190260.0
  ], 
  [
   184350, 
   null, 
   "Master_Shake", 
   "If I set someones house on fire, and then try to put it out while their house burns to the ground, I am still an arsonist.\n\n This isn't the best analogy in the world, but yes, I know. My point was, maybe we shouldn't be giving someone like this the ultimate penalty.", 
   {}, 
   184342, 
   null, 
   1134190440.0
  ], 
  [
   184352, 
   null, 
   "snakespit", 
   "This isn't the best analogy in the world, but yes, I know. My point was, maybe we shouldn't be giving someone like this the ultimate penalty.\n\n We are not giving him the ultimate penalty. We are enforcing a penalty handed down by the jury who heard the facts of the case. Again, despite all his good acts and intentions, he has not payed the prescribed penalty for his crimes. I believe that some crimes and criminals deserve death. \"Tookies\" good works should not change the penalty called for by the jury.", 
   {}, 
   184350, 
   null, 
   1134192180.0
  ], 
  [
   184359, 
   null, 
   "zachvac", 
   "What a cheap and uneducated shot. Hitler was hellbent on wiping out an entire race of people along with homosexuals and gypsies. He did not want to kill only the worthless criminal bastards that I would like to see die.\n \n\n ok, that was a little far, but try to understand what I was saying. You said we should fry these people and that oh well if we get a few innocents, it's worth it. At least we try to make sure they are guilty. Hitler killed a whole race, you are basically saying you don't mind if we kill a bunch of innocent people as long as we get guilty people as well.\n \n \n \n\n If there's any doubt about the innocence or guilt, the person should have been acquitted. I know you'll likely say \"What if they didn't actually commit the crime but were found guilty?\" Convince yourself that those found guilty are by definition GUILTY. It makes no difference that they didn't actually do the crime. They are still guilty because the jury said so. That's a mistake on the jury's part and may result in the death of someone other than the one who really did it, but the execution would still be of the party found guilty by rule of law. Collateral damage.\n \n\n Unfortunately currently in our system lawyers can make a huge difference, and 2 different jurries could find the same person in the same trial guilty and not guilty. Also, our technology increases and we are able to discover things about what has happened in the past that we couldn't when it happened.\n \n If we put them in jail, it is reversable. Yes we have taken away years off their life, and that's bad enough. But when you have the choice of killing innocents or putting them in jail for 20 years (or however long until we find out they were really innocent), I'll put them in jail. You are willing to spend more money to kill the people and have innocent people dead. That is irreversible.\n \n \n\n No more real than the victims were.\n \n\n The death penalty doesn't reverse the death of the victim. That is unfortunate but over. It can't be reversed. Solitary confinement for life is not much better of a punishment than death, sometimes even worse. It's been shown that the death penalty won't prevent any future deaths such as this and solitary confinement will keep the world safe from them.\n \n \n\n You'd rather I would trivialize the lives of the victims? ...and if you don't thinik the deaths of our soldiers was \"worth it\", you are a sick puppy.\n \n\n I never said the deaths of our soldiers wasn't worth it. But that's all well and good when you're sitting on your couch. I've never been in war, and I'm not talking about our current situation. I'm talking about any politician or non-military person saying that the deaths are worth it. Only the death penalty is even worse. Hopefully a war is helping our country, the death penalty costs our country money and doesn't help anything.\n \n \n\n I'd likely feel the same as I would had my child died needlessly as a result of a drunk driver running him down.\n \n\n right. I doubt it. I've had an aunt die because of a drunk driver. My first thoughts? I would have wanted to kill that :xcensored. But now that it's done, I know that killing another person wouldn't have helped anything and that it would be an insult to her to kill another human on top of her just in the name of vengance.\n \n \n \n\n Only if you factor in the cost of the trial and appeals. I've made a standing offer regarding batch executions. I work cheap.\n \n\n Well when we have many innocents being killed you want to cut the appeals? Interesting approach. I thought you said you valued innocent lives.\n \n \n\n Show me the stats that \"prove\" this. \n \n\n http://www.deathpenaltyinfo.org/article.php?scid=12&did=167\n \n Note it has the stats on countries (we are at the top for murder rate) and it has a graph of death penalty states and non-death penalty states. There are only 2 non-death penalty states over the national average (Alaska and Michigan). There are 17 death penalty states over the national average. \"The average of murder rates per 100,000 population in 1999 among death penalty states was 5.5, whereas the average of murder rates among non-death penalty states was 3.6\".\n \n Shouldn't it be the other way around if the death penalty was really a deterrant?\n \n \n\n For one proven guilty (of the capital crimes) a fifty cent bullet will do the trick.\n \n\n I'm fine with this but as mentioned earlier most of the costs lie in the appeals, which have been shown to be necessary.\n \n \n\n Don't be completely silly here.\n \n\n If I didn't realize you were serious I would say the same to you when you call killing innocents \"collateral damage\". That's just sick.\n \n \n\n Who said it was unnecessary killing that I advocate. I believe it IS necessary...and money is the least of my worries.\n\n Well it's pay the money and risk killing an innocent with no advantage, or pay less money and be able to reverse the situation if we are wrong. Which would you choose?", 
   {}, 
   184202, 
   null, 
   1134195180.0
  ], 
  [
   184362, 
   null, 
   "JPSartre12", 
   "That with the highest per-capita incarceration number in the world, being the only westernized nation using the death penalty and under attack by an extremist organization due to our foreign policy we have some scary, deep-seated social problems?\n\n \n Now you know why I don't care for the candyasses across the pond. You either run with the Big Dawgs or you sit on the porch. :)", 
   {}, 
   184343, 
   null, 
   1134196260.0
  ], 
  [
   184368, 
   null, 
   "snakespit", 
   "I never said the deaths of our soldiers wasn't worth it. But that's all well and good when you're sitting on your couch. I've never been in war, and I'm not talking about our current situation. I'm talking about any politician or non-military person saying that the deaths are worth it. Only the death penalty is even worse. Hopefully a war is helping our country, the death penalty costs our country money and doesn't help anything.\n\n You do not have to have had bullets flying over your head, or in my case, through the wing of your aircraft in order to appreciate and understand that soldiers die serving something greater than themselves. It is possible that the guy sitting on his couch eating a bag of chips appreciates the fact that men and women have died so he can do so in freedom. I guess it depends on what you consider \"worth it\" in the first place.", 
   {}, 
   184359, 
   null, 
   1134202980.0
  ], 
  [
   184388, 
   null, 
   "Wez", 
   "We don't even do much of the former.\n \n Besides, that doesn't address the problem of an inaccurate ruling from a jury or judge.\n\n Well, what exactly does the death penalty achieve? There's no evidence that it actually prevents any crime (I assume you can, after all, get out of it if you admit guilt immediately and do a lot of butt-kissing) nor are innocent lives saved by it, seeing as it's all but unheard of for someone to escape a life sentence and then commit a murder.\n \n \nMaybe we should compensate the victim's families. I've heard of humongous settlements in wrongful death claims. Why is this not available to the families of the wrongly executed? Would the amount depend upon their age and potential earnings or just be a standard lump sum? How do you put a price on a life?\n\n If you didn't execute them in the first place you'd save money on the execution, save money in any compesation claims and not actually increase the danger the public faces. \n \n I don't even have a moral objection to killing certian people, I just don't see it as a pragmatic and practical. It costs a lot and achieves fairly little.\n \n -Wez", 
   {}, 
   184307, 
   null, 
   1134221820.0
  ], 
  [
   184427, 
   null, 
   "jim's trucking", 
   "That with the highest per-capita incarceration number in the world, being the only westernized nation using the death penalty and under attack by an extremist organization due to our foreign policy we have some scary, deep-seated social problems?\n...and the extremist organization goes the death penalty a step or two beyond...they blow up indiscriminatly chosen victims with surprise bombings using truly gutless methods and brainwashed followers who actually think they'll be rewarded in the afterlife for killing innocent people. [...and the orders come from \"leaders\" who are too chicken to die for the cause. Saddam paid the families of suicide bombers then cowardly surrenderred without a fight from his little rat-hole. ZarCowardly sends out dupes to do his dirty work while he hides behinds the skirts of women and mosques. Pseudo-brave bastards indeed.]\n \n Your argument is severely flawed here.", 
   {}, 
   184343, 
   null, 
   1134236400.0
  ], 
  [
   184431, 
   null, 
   "georged", 
   "...and the extremist organization goes the death penalty a step or two beyond...they blow up indiscriminatly chosen victims with surprise bombings using truly gutless methods and brainwashed followers who actually think they'll be rewarded in the afterlife for killing innocent people. [...and the orders come from \"leaders\" who are too chicken to die for the cause. Saddam paid the families of suicide bombers then cowardly surrenderred without a fight from his little rat-hole. ZarCowardly sends out dupes to do his dirty work while he hides behinds the skirts of women and mosques. Pseudo-brave bastards indeed.]\n \n Your argument is severely flawed here.\n\n \n Unless that's your reasoning, guess I made a mistake thinking this thread was about the US death penalty and discussion focused on what motivates rationale in favor of same. Sorry for the flaw.", 
   {}, 
   184427, 
   null, 
   1134237660.0
  ], 
  [
   184439, 
   null, 
   "jim's trucking", 
   "ok, that was a little far, but try to understand what I was saying. You said we should fry these people and that oh well if we get a few innocents, it's worth it. At least we try to make sure they are guilty. Hitler killed a whole race, you are basically saying you don't mind if we kill a bunch of innocent people as long as we get guilty people as well.\nI understood exactly what you said. What you're saying now is what you said is not what you meant. Another weasle trick used often by numerous people.\n \n \n \n\n Unfortunately currently in our system lawyers can make a huge difference, and 2 different jurries could find the same person in the same trial guilty and not guilty. Also, our technology increases and we are able to discover things about what has happened in the past that we couldn't when it happened.\nThose are all arguments for fixing the system, not adjusting the punishment.\n \n \n \n\n If we put them in jail, it is reversable. Yes we have taken away years off their life, and that's bad enough. But when you have the choice of killing innocents or putting them in jail for 20 years (or however long until we find out they were really innocent), I'll put them in jail. You are willing to spend more money to kill the people and have innocent people dead. That is irreversible.\nI'll give up arguing that execution is cheaper than incarceration for life.\n \n \n\n The death penalty doesn't reverse the death of the victim. That is unfortunate but over. It can't be reversed. Solitary confinement for life is not much better of a punishment than death, sometimes even worse. It's been shown that the death penalty won't prevent any future deaths such as this and solitary confinement will keep the world safe from them.\nIf the confinement did not include all the comforts of home, I might agree. But with our compassionate ACLU and bleeding hearts constantly fighting for the rights of these \"poor\" criminals, life in prison is a piece of cake, not a punishment. They need to be deprived of an enjoyable life, not pampered like innocent wayward children who were simply reacting to a bad environment.\n \n \n \n \n\n I never said the deaths of our soldiers wasn't worth it. \n\n You didn't?\n \n I have a lot of respect for you but I'm sorry, when you trivialize human lives like that (it's worth these lives) it reminds me of those who talk about the deaths in our military being \"worth it\". \n \n Those are your words from a previous post. Had you not been obviously implicated I would not have concluded same.\n \n \n\n But that's all well and good when you're sitting on your couch. I've never been in war, and I'm not talking about our current situation. I'm talking about any politician or non-military person saying that the deaths are worth it. Only the death penalty is even worse. Hopefully a war is helping our country, the death penalty costs our country money and doesn't help anything.\nIt's not required that you participate in a war to know that the deaths of those who fought to defend your freedom was worth it.\n \n \n\n right. I doubt it. I've had an aunt die because of a drunk driver. My first thoughts? I would have wanted to kill that :xcensored. But now that it's done, I know that killing another person wouldn't have helped anything and that it would be an insult to her to kill another human on top of her just in the name of vengance.\nYou missed my point. Death of an innocent person is no less unfortunate due to its cause.\n \n \n \n\n Well when we have many innocents being killed you want to cut the appeals? Interesting approach. I thought you said you valued innocent lives.\nI do. Collateral damage is unfortunate.\n \n \n\n http://www.deathpenaltyinfo.org/article.php?scid=12&did=167\n \n Note it has the stats on countries (we are at the top for murder rate) and it has a graph of death penalty states and non-death penalty states. There are only 2 non-death penalty states over the national average (Alaska and Michigan). There are 17 death penalty states over the national average. \"The average of murder rates per 100,000 population in 1999 among death penalty states was 5.5, whereas the average of murder rates among non-death penalty states was 3.6\".\n \n Shouldn't it be the other way around if the death penalty was really a deterrant?\nI'll examine this later.\n \n \n\n I'm fine with this but as mentioned earlier most of the costs lie in the appeals, which have been shown to be necessary.\nICBM, but I think the additional cost is concentrated in the first trial. A lot more effort is required of the defense team and the prosecutor. I'm not sure this is not a slam on the non-capital accused. It's saying that \"since you're not accused of a capital crime, we won't try as hard.\"\n \n \n\n If I didn't realize you were serious I would say the same to you when you call killing innocents \"collateral damage\". That's just sick.\nAs I said, collateral damage is unfortunate. Each death of innocents is unfortunate. I do not want innocents killed...at all. However, a person convicted of a capital crime is BY OUR OWN DEFINITION NOT INNOCENT.\n \n \n\n Well it's pay the money and risk killing an innocent with no advantage, or pay less money and be able to reverse the situation if we are wrong. Which would you choose?\nI don't know why money is such a concern.\n \n The irreversability of death is obvious. That's what makes collateral damage unfortunate.", 
   {}, 
   184431, 
   null, 
   1134239640.0
  ], 
  [
   184441, 
   null, 
   "jim's trucking", 
   "Unless that's your reasoning, guess I made a mistake thinking this thread was about the US death penalty and discussion focused on what motivates rationale in favor of same. Sorry for the flaw.\nI inferred that you somehow can justify the motives of an extremist organization that regularly kills randomly...justify their motives in their attacks on a country that still holds on to the death penalty.\n \n Your argument was not misplaced, just flawed in regard to the thread topic.", 
   {}, 
   184431, 
   null, 
   1134240120.0
  ], 
  [
   184444, 
   null, 
   "Wez", 
   "Those are all arguments for fixing the system, not adjusting the punishment.\n\n If you can't fix the system then you'll have to adjust the punishment though, until the system, if ever, is fixed.\n \n \nAs I said, collateral damage is unfortunate. Each death of innocents is unfortunate. I do not want innocents killed...at all. However, a person convicted of a capital crime is BY OUR OWN DEFINITION NOT INNOCENT.\n\n \n He can be guilty or innocent, what matters is if he did or didn't commit the crime. If he's found guilty, executed and it's later found out he did nothing wrong, then regardless of legal terms, he shouldn't have died.\n \n I'll restate this point: \n \n What exactly does the death penalty achieve? There's no evidence that it actually prevents any crime (I assume you can, after all, get out of it if you admit guilt immediately and do a lot of butt-kissing, so fear of death wouldn't be a factor?). Innocent lives aren't saved by it either, seeing as it's all but unheard of for someone to escape a life sentence and then commit a murder.\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   184439, 
   null, 
   1134240720.0
  ], 
  [
   184452, 
   null, 
   "georged", 
   "I inferred that you somehow can justify the motives of an extremist organization that regularly kills randomly...justify their motives in their attacks on a country that still holds on to the death penalty.\n \n Your argument was not misplaced, just flawed in regard to the thread topic.\n\n \n That threat, combined with domestic societal problems generating increased crime against people/property, helps feed individual insecurities based on anger demanding domestic retribution on an impersonal basis to provide a false sense of personal control. A futile gesture.", 
   {}, 
   184441, 
   null, 
   1134242220.0
  ], 
  [
   184471, 
   null, 
   "JPSartre12", 
   "America has it's \"Haves' and have nots'\", just like any other country. And just like most countries in the world, the money is not distributed equally amongst all of our citizens. A great example is the city where I live. 2 million dollar homes in Chestnut Hill, 1 mile away on N. Broad, slums and ghettos. Such is life throughout the US.\n\n \n Small world. Two of my three kids were born in Chestnut Hill Hospital. emoticon_wow", 
   {}, 
   183930, 
   null, 
   1134250200.0
  ], 
  [
   184472, 
   null, 
   "JPSartre12", 
   "...\n What exactly does the death penalty achieve? There's no evidence that it actually prevents any crime (I assume you can, after all, get out of it if you admit guilt immediately and do a lot of butt-kissing, so fear of death wouldn't be a factor?). Innocent lives aren't saved by it either, seeing as it's all but unheard of for someone to escape a life sentence and then commit a murder.\n \n -Wez\n\n \n Of course it prevents crime. Executed criminals NEVER commit another crime, I promise you. emoticon_rolleyes \n And there are many cases of convicted murderers murdering again. I gave you an example of one a few days ago, Willy Horton. Are you just ignoring that evidence because it doesn't fit your belief system?", 
   {
    "unicode_changes_made": true
   }, 
   184444, 
   null, 
   1134251460.0
  ], 
  [
   184483, 
   null, 
   "Wez", 
   "Of course it prevents crime. Executed criminals NEVER commit another crime, I promise you. emoticon_rolleyes \n\n Nor do ones that spend the rest of their life behind bars.\n \n \nAnd there are many cases of convicted murderers murdering again.\n\n Have you got 119 of them, the number of people 'released' from death row? I'd love to see all these alleged cases?\n \n \nI gave you an example of one a few days ago, Willy Horton. Are you just ignoring that evidence because it doesn't fit your belief system?\n\n No. What did I say to make you think I was ignoring your example? (And what is my \"belief system\"?)\n \n \"Innocent lives aren't saved by it either, seeing as it's all but unheard of for someone to escape a life sentence and then commit a murder.\"\n \n That quote doesn't ignore your link in any way, shape or form. \n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   184472, 
   null, 
   1134255300.0
  ], 
  [
   184489, 
   null, 
   "snakespit", 
   "Well, what exactly does the death penalty achieve? There's no evidence that it actually prevents any crime (I assume you can, after all, get out of it if you admit guilt immediately and do a lot of butt-kissing) nor are innocent lives saved by it, seeing as it's all but unheard of for someone to escape a life sentence and then commit a murder.-Wez\n\n \nKenneth D. Williams, 26, condemned to die for a 1999 killing after a prison escape, told the Pine Bluff (Ark.) Commercial newspaper that he shot and killed Jerrell Jenkins, 36, of Pine Bluff, Ark., in 1998. Williams claimed he killed Jenkins with two shots from a .357-caliber handgun.\n \n In 1998, Williams was convicted of kidnapping and killing University of Arkansas at Pine Bluff cheerleader Dominique Hurd, and of kidnapping and assaulting her date. He was sentenced to life in prison without parole but while serving that sentence, he escaped Oct. 3, 1999, in a barrel of slop being towed to the prison hog farm.\n \n Williams later killed farmer Cecil Boren, 57, and stole his truck. Officers from the Lebanon Police Department spotted the stolen truck Oct. 4 and Williams fled when officers attempted to stop the vehicle.\n\n -snip-\n \nTroopers and Dallas County officers continued to chase Williams on U.S. 65 to Urbana, which is on the northern edge of Dallas County. There, Williams' pickup struck another vehicle, killing the other driver, Michael Greenwood, 24, of Springfield. Williams jumped out of the truck and entered a house in Urbana, where he was apprehended by Buffalo police officers, Dallas County Sheriff's Department deputies and state troopers.\n \n\n Here's one for you.\n http://www.lebanondailyrecord.com/articles/2005/06/17/local_news/news06.txt", 
   {}, 
   184388, 
   null, 
   1134255720.0
  ], 
  [
   184501, 
   null, 
   "Wez", 
   "2 so far.\n \n -Wez", 
   {}, 
   184489, 
   null, 
   1134257220.0
  ], 
  [
   184507, 
   null, 
   "jim's trucking", 
   "That threat, combined with domestic societal problems generating increased crime against people/property, helps feed individual insecurities based on anger demanding domestic retribution on an impersonal basis to provide a false sense of personal control. A futile gesture.\n\n What does this rambling statement have to do with our most recent posts?\n \n What threat? Are you admitting that the extreme organization you mentioned is truly a threat to us?\n \n What I saw in your previous post was some personal justification of the random attacks from a terrorist group on a country that still uses the death penalty.\n \n I think insecurities are not based upon anger. Anger may result from insecurities. The anger then prompts solutions to abate the insecurities.\n \n However, it's not any insecurity on my part that prompts my favoring the death penalty. I do not live in fear of loss of the death penalty. I just happen to believe it is a system by which we can be guaranteed that the person will kill no more innocent people.", 
   {}, 
   184501, 
   null, 
   1134258180.0
  ], 
  [
   184510, 
   null, 
   "JPSartre12", 
   "Nor do ones that spend the rest of their life behind bars.\n \n \n Have you got 119 of them, the number of people 'released' from death row? I'd love to see all these alleged cases?\n \n \n No. What did I say to make you think I was ignoring your example? (And what is my \"belief system\"?)\n \n \"Innocent lives aren't saved by it either, seeing as it's all but unheard of for someone to escape a life sentence and then commit a murder.\"\n \n That quote doesn't ignore your link in any way, shape or form. \n -Wez\n\n \n Really? Here's some more food for thought.\n http://www.prodeathpenalty.com/repeat_murder.htm", 
   {
    "unicode_changes_made": true
   }, 
   184483, 
   null, 
   1134258720.0
  ], 
  [
   184527, 
   null, 
   "georged", 
   "Arnie the CA celebrity Governor is a Republican in a state majority of Democrats. He recently called a serious special election attempting to wrest control from unions and bureaucrats and after that election publicly admitted he was wrong in doing so. His political capital is very low. 68% of the state is for the death penalty. \n \n ~ In the current political climate, says Hoover Institute analyst Bill Whalen, \"It would be hard to imagine Arnold granting clemency on Christmas Eve to a battered wife who killed her abusive husband and is filled with remorse, much less Tookie Williams.\"~\n \n Odds, anyone?", 
   {
    "post_info": {
     "post_title": "Tookie's Odds"
    }, 
    "unicode_changes_made": true
   }, 
   184510, 
   null, 
   1134269400.0
  ], 
  [
   184536, 
   null, 
   "zachvac", 
   "You do not have to have had bullets flying over your head, or in my case, through the wing of your aircraft in order to appreciate and understand that soldiers die serving something greater than themselves. It is possible that the guy sitting on his couch eating a bag of chips appreciates the fact that men and women have died so he can do so in freedom. I guess it depends on what you consider \"worth it\" in the first place.\n\n \n Yes you can say that, but it's a lot harder for the person going off to war or having their son/daughter go off to war to die. I would take the weight of a person who lost their kid so they could live with freedom. Is it worth it? While many will still say yes proudly of their kid's memory, I would guess the yes percentage would be slightly down from the population of people who've never experienced a loved one dying for a cause.", 
   {}, 
   184368, 
   null, 
   1134273060.0
  ], 
  [
   184537, 
   null, 
   "zachvac", 
   "Of course it prevents crime. Executed criminals NEVER commit another crime, I promise you. emoticon_rolleyes \n \n\n same with one put behind bars for life in solitary confinement.\n \n \n\n And there are many cases of convicted murderers murdering again. I gave you an example of one a few days ago, Willy Horton. Are you just ignoring that evidence because it doesn't fit your belief system?\n\n Your example was when he was let out, right? This is the equivelant to deciding to give him the death penalty and then deciding to let him go after all. If the punishment had been carried out there would be no problem. Obviously the same is true with the death penalty. But it costs more, kills more innocents, and has no more advantages to life in prison.", 
   {}, 
   184472, 
   null, 
   1134273360.0
  ], 
  [
   184540, 
   null, 
   "zachvac", 
   "I understood exactly what you said. What you're saying now is what you said is not what you meant. Another weasle trick used often by numerous people.\n \n\n \n OK, let me explain again. You said to fry them and oh well if we get some innocent people. Hitler was like that too. He killed the people he thought were bad, but at least he only took out the \"bad people\" and didn't accidentally get people who weren't jews, gays, gypsies, disabled, etc.\n \n I understand that what he did was horrible, and that the reasoning and feriocity is different from yours, but it is the same line of thinking, those lives don't mean anything as long as we acheive a goal (\"purifying\" Germany in his case, revenge on killers in your case). That's what I meant. I was a little upset at seeing what you wrote, so maybe that was a bit far, but that's exactly what I meant.\n \n \n\n Those are all arguments for fixing the system, not adjusting the punishment.\n \n\n I agree we need to fix the system, but ALSO at this time we need to realize the system is imperfect and that we cannot put people to death with an imperfect system. If we were 100% sure of guilt I may be more inclined to support the death penalty, although it still costs more.\n \n \n\n If the confinement did not include all the comforts of home, I might agree. But with our compassionate ACLU and bleeding hearts constantly fighting for the rights of these \"poor\" criminals, life in prison is a piece of cake, not a punishment. They need to be deprived of an enjoyable life, not pampered like innocent wayward children who were simply reacting to a bad environment.\n \n\n I completely agree with you. The minimum requirements of life should be met (shelter, food) and that's it. ESPECIALLY murderers such as this should only have the bare minimum. The only reason we're keeping them alive is it's not worth it to kill them. Just as I don't want to pay money to kill them, we shouldn't be paying money for them to receive cable TV, couches, etc. Give them a room, an old bed, and 3 cheap meals a day. We're putting them there because they can't be trusted in the outside world, and as a deterrant, it should not be fun.\n \n \n \n\n You didn't?\n \n I have a lot of respect for you but I'm sorry, when you trivialize human lives like that (it's worth these lives) it reminds me of those who talk about the deaths in our military being \"worth it\". \n \n Those are your words from a previous post. Had you not been obviously implicated I would not have concluded same.\n \n\n Please re-read that. Do I ever say that it isn't worth it? I say that those sitting back on their couches (note this includes me too) have no room to talk about how other peoples' lives are worth it. They may be worth it to me, but until it is worth risking your life for other peoples' freedoms, until you will lose a loved one for the cause you are fighting, your words don't have much weight. It's like the scene in Shrek where the king says \"many of you may die [while trying to rescue the princess from the castle who will marry me], but that's a sacrifice I am willing to make\". I think you would be of the opinion that he has no room to talk, but he could be right. It could be worth it.\n \n \n\n It's not required that you participate in a war to know that the deaths of those who fought to defend your freedom was worth it.\n \n\n I understand that but until you have experienced the loss of a loved one for our country, or risked your own life in war, your words don't have quite the weight when talking about OTHER peoples' lives being worth it.\n \n \n\n You missed my point. Death of an innocent person is no less unfortunate due to its cause.\n \n\n That is the case? Then why do you spend so much time talking about the death penalty? How many people die in murders each year? How many died on 9/11?\n \n How many die in car crashes every day. I think I heard that more people died in car crashes than in the 9/11 attacks on that day. Why aren't you fighting for car safety? Those lives are no less unfortunate. Why aren't you pushing to ban cars?\n \n \n\n I do. Collateral damage is unfortunate.\n \n\n I doubt you believe that. You have a choice. Pay more money, risk collateral damage, and not acheive anything other than raw vengence, or save the innocent people who are killed and save money. Why must you kill innocent people just to give the victim's family the satisfaction of vengance which they most likely will regret later anyway?\n \n \n\n ICBM, but I think the additional cost is concentrated in the first trial. A lot more effort is required of the defense team and the prosecutor. I'm not sure this is not a slam on the non-capital accused. It's saying that \"since you're not accused of a capital crime, we won't try as hard.\"\n \n\n I don't know what ICBM means but do you have any stats on this?\n \n \n\n As I said, collateral damage is unfortunate. Each death of innocents is unfortunate. I do not want innocents killed...at all. However, a person convicted of a capital crime is BY OUR OWN DEFINITION NOT INNOCENT.\n \n\n Then we need to work on our definitions. Innocent means they did not commit the crime. Many people are judged guilty and as more evidence shows up their status is changed to not guilty, and under the eyes of our justice system they are innocent.\n I don't know why money is such a concern.\n \n \n\n The irreversability of death is obvious. That's what makes collateral damage unfortunate.\n\n \n Yet you have the opportunity to reduce collateral damage, and you choose not to. It becomes more than collateral damage at that point, it becomes preventable damage.", 
   {}, 
   184439, 
   null, 
   1134277860.0
  ], 
  [
   184541, 
   null, 
   "zachvac", 
   "By the way, who is tookie? Does someone have a good article? I've learned from this argument pretty much that he/she is a murderer who has written books in prison and reformed. If that's pretty much it, I think the punishment is the same. The punishment is for deterrance and to keep them off the streets. If you have killed once I have a hard time releasing you to the streets, and it's hardly deterrance if all you have to do is write a book and act sorry and you don't get the same crime. Obviously I disagree with the death penalty in principle. But if we would have given him/her the death penalty before, there's no reason to diminish it now.", 
   {}, 
   184540, 
   null, 
   1134278040.0
  ], 
  [
   184543, 
   null, 
   "JPSartre12", 
   "same with one put behind bars for life in solitary confinement.\n\n Why is it so difficult for you to see that there is NO such thing as solitary confinement for life. Any person that comes in contact with a lifer is another potential victim: doctor, guard, minister, etc., and that doesn't include those that manage to escape.\n \n\n \n Your example was when he was let out, right? This is the equivelant to deciding to give him the death penalty and then deciding to let him go after all. If the punishment had been carried out there would be no problem. Obviously the same is true with the death penalty. But it costs more, kills more innocents, and has no more advantages to life in prison.\n\n \n The advantage is that you never have to worry about the prisoner escaping, killing someone on the inside, getting their sentence commuted by a bleeding heart judge...or a politician. Works for me.", 
   {}, 
   184537, 
   null, 
   1134280020.0
  ], 
  [
   184546, 
   null, 
   "daewoo", 
   "OK, let me explain again. You said to fry them and oh well if we get some innocent people. Hitler was like that too. He killed the people he thought were bad, but at least he only took out the \"bad people\" and didn't accidentally get people who weren't jews, gays, gypsies, disabled, etc.\n \n I understand that what he did was horrible, and that the reasoning and feriocity is different from yours, but it is the same line of thinking, those lives don't mean anything as long as we acheive a goal (\"purifying\" Germany in his case, revenge on killers in your case). That's what I meant. I was a little upset at seeing what you wrote, so maybe that was a bit far, but that's exactly what I meant.\n\n \n Zach, you are never going to get anywhere here. Pro death penalty arguments are invariably emotion driven. They lack logic. You cannot argue logically with somebody who has made their decision based on emotion. I simply is not worth it to even try. It is like trying to argue gun control. There is no logical basis for gun control and all studies on the subject have showed the same thing, that gun control does not help lower crime. The pro death penalty argument is one born of fear and ignorance and pseudo macho bravado. For god sakes, one of the death penatly supporters here challenged somebody to a DUEL right here in the thread. How much more backwards can you possibly be? Is there a better example of BS bravdo anywhere on the net? I doubt it. \n \n \n \nI completely agree with you. The minimum requirements of life should be met (shelter, food) and that's it. ESPECIALLY murderers such as this should only have the bare minimum. The only reason we're keeping them alive is it's not worth it to kill them. Just as I don't want to pay money to kill them, we shouldn't be paying money for them to receive cable TV, couches, etc. Give them a room, an old bed, and 3 cheap meals a day. We're putting them there because they can't be trusted in the outside world, and as a deterrant, it should not be fun.\n\n \n Ok, then can we assume that you are going to pay for the extra security needed to keep those people in line personally? As long as your prisoners are sitting on a couch watching TV, they are not rioting or escaping. It also offers a layer of dicipline within the prison by giving them something they can take away for misbehaving convicts. Prisoners do not get those things beacue we want to give them to them, or becuase the dirty liberals want them to have them. They get those things becuase it is cheaper to provide cable TV than it is to assign 10-15 extra guards per shift. It is cheaper to build a game room than to build every prison out of blast proof reinforced concrete walls. It is cheaper to give them a library and some games to play than it is to pay death ebnifits to gurads families when the guards are killed during riots,.\n \n Unfortunatly, prison work programs are largely a thing of the past. When they DID have those programs, they were very popular since the main problem with prison seems to be boredom. The main problem with the prison work programs tende3d to be corruption. When you are talking a federal prison, you are generally talking 1000 or more cirminals being controlled by 20-50 gurads at any one time. There is no possible way that those few guards could control that many convicts if the convicts decided in mass that they were leaving. The television, games, etc... keeps them occupied.", 
   {}, 
   184540, 
   null, 
   1134286320.0
  ], 
  [
   184548, 
   null, 
   "doG", 
   "Good riddance to a murderous thug....", 
   {}, 
   184546, 
   null, 
   1134286740.0
  ], 
  [
   184554, 
   null, 
   "coolcodemn3", 
   "fry that man in the chair! He has no reason to live right now", 
   {}, 
   184548, 
   null, 
   1134296280.0
  ], 
  [
   184568, 
   null, 
   "jim's trucking", 
   "I have no idea what you base that assumption on. Even if only 10% get off on factual evidence, that's still 12 innocents who would have otherwise died. How many cases can you cite where someone has escaped form life imprisonment and committed murder again? I'd be willing to bet it's less than either 119 or 12.\nHere's the truth about your 119 figure.\n \n http://www.prodeathpenalty.com/Innocence.htm\n \n Read this entire link. It's quite interesting and revealing of the dubious methods anti-death penalty activists will use to get their way.\n \n \n \n \n \n\n I asked for the number of murderers who have escaped from life imprisonment and murdered again. I asked because some people say the death penalty protects people. I wanted to point out how it's almost unheard of people escaping from a life sentence and murdering again, so saying the death penalty protects people was a ridiculous argument. I added the disclaimer, so no-one tried to cite murders committed by people who've served their full time in prison, gotten out and murdered.\nThere's a link not to far back in this thread that lists many repeat killings by people who got out after serving time for murder. Several were murders of kind people who befriended the murderer and gave him a place to stay.\n \n http://www.prodeathpenalty.com/repeat_murder.htm\n \n \n \n\n Yep. So why not just give them a life sentence rather than kill them? One way you execute some innocents, the other way you execute no innocents.:)\n \n \n Life imprisonment would achieve the same.\n \n -Wez\nThere are also instances of murderers killing other prisoners and prison guards while in prison. Do these count in your tabulation of repeat murderers? Were the murdered prisoners and guards guilty of anything deserving death?\n \n When reason and all the facts prevail, support for executions will rise.--Dudley Sharp", 
   {}, 
   184038, 
   null, 
   1134317280.0
  ], 
  [
   184597, 
   null, 
   "Wez", 
   "It'll take some time to read. I'll get back to you jim and JPSartre12 once I've had time to read.:)\n \n -Wez", 
   {}, 
   184568, 
   null, 
   1134338820.0
  ], 
  [
   184707, 
   null, 
   "snakespit", 
   "Your example was when he was let out, right? This is the equivelant to deciding to give him the death penalty and then deciding to let him go after all. If the punishment had been carried out there would be no problem. Obviously the same is true with the death penalty. But it costs more, kills more innocents, and has no more advantages to life in prison.\n\n Kills more innocents than what? Exactly how many innocent people has the death penalty killed? From what I have read, there has been no conclusive evidence of an innocent person killed by the death penalty since 1900. How many people have been killed by escaped prisoners, or released prisoners, or even against other inmates in prison? I would bet that number far outweighs the number of innocents that we have executed since 1900 (that is if we have even executed an innocent person since 1900).", 
   {}, 
   184537, 
   null, 
   1134403800.0
  ], 
  [
   184738, 
   null, 
   "jyoshu", 
   "you are never going to get anywhere here. Pro death penalty arguments are invariably emotion driven. They lack logic. You cannot argue logically with somebody who has made their decision based on emotion.\n\n \n I disagree. I'm not pro-death penalty, but I think their arguments are often based on logic. There are logical reasons on both sides of the issue. In fact, one could argue that those against the death penalty often argue on a non-logical basis, mainly just because they think it's the more 'humane' or 'compassionate' thing to do without considering the whole picture, and therefore often rooted in emotion.\n \n Pro-death penalty arguments are often too logical, IMO . . . cold logic, without compassion.", 
   {}, 
   184546, 
   null, 
   1134411000.0
  ], 
  [
   184740, 
   null, 
   "jim's trucking", 
   "I disagree. I'm not pro-death penalty, but I think their arguments are often based on logic. There are logical reasons on both sides of the issue. In fact, one could argue that those against the death penalty often argue on a non-logical basis, mainly just because they think it's the more 'humane' or 'compassionate' thing to do without considering the whole picture, and therefore often rooted in emotion.\n \n Pro-death penalty arguments are often too logical, IMO . . . cold logic, without compassion.\nYou are correct about the logic. It prevails on the pro-DP side and is absent or ignored on the anti-DP side.\n \n Bleeding hearts will not accept the fact that the death penalty is a deterrent and saves innocent lives. They will not accept this PROVEN FACT!!\n \n http://www.cjlf.org/deathpenalty/DPDeterrence.htm\n \n ...proven in several independent studies^^^^^!\n \n \n ...but, do not claim pro-DPers to lack compassion. We seem to have more compassion for the victims and potential victims of murderers than we do for the murderers. Why is this not acceptable to the ACLU and their ilk?\n \n ACLU has come to mean American Criminal Lovers Union.", 
   {}, 
   184738, 
   null, 
   1134411540.0
  ], 
  [
   184749, 
   null, 
   "jyoshu", 
   "...but, do not claim pro-DPers to lack compassion. We seem to have more compassion for the victims and potential victims of murderers than we do for the murderers. Why is this not acceptable to the ACLU and their ilk?\n\n \n I think compassion AND logic are on both sides. I was responding to Daewoo's assertion that ONE side's arguments don't have logic and are enotion-driven, and that's not true in many cases. There are logical arguments on both sides of the issue. That's one reason it's an issue that persists.", 
   {}, 
   184740, 
   null, 
   1134414780.0
  ], 
  [
   184750, 
   null, 
   "JPSartre12", 
   "You are correct about the logic. It prevails on the pro-DP side and is absent or ignored on the anti-DP side.\n \n Bleeding hearts will not accept the fact that the death penalty is a deterrent and saves innocent lives. They will not accept this PROVEN FACT!!\n \n http://www.cjlf.org/deathpenalty/DPDeterrence.htm\n \n ...proven in several independent studies^^^^^!\n \n \n ...but, do not claim pro-DPers to lack compassion. We seem to have more compassion for the victims and potential victims of murderers than we do for the murderers. Why is this not acceptable to the ACLU and their ilk?\n \n ACLU has come to mean American Criminal Lovers Union.\n\n \n I'm with you, Jim. While bleeding heart anti-DPers want to show compassion for mass murderers and the like, I prefer to direct my compassion towards the victims and their families by wanting to make sure that the perp doesn't create any more victims. If nobody has the balls to fry Tookie, send me a ticket to LaLALand and I'll throw the switch or start the injection. I'd be honored to. emoticon_xkill emoticon_xchicken \n \n And I always thought the ACLU stood for Anti-Christian Liberals Unlimited. emoticon_confused :)", 
   {}, 
   184740, 
   null, 
   1134415500.0
  ], 
  [
   184759, 
   null, 
   "jim's trucking", 
   "OK, let me explain again. You said to fry them and oh well if we get some innocent people. Hitler was like that too. He killed the people he thought were bad, but at least he only took out the \"bad people\" and didn't accidentally get people who weren't jews, gays, gypsies, disabled, etc.\n \n ...\nWhat a crass, uneducated statement.\n \n \n ...and I think it's already been shown that we haven't executed an innocent person since 1900. Even the people who did the study saying that innocents had been executed admitted that they cannot prove same. That implies we've had a perfect batting average for over 100 years.", 
   {}, 
   184540, 
   null, 
   1134418080.0
  ], 
  [
   184761, 
   null, 
   "georged", 
   "What a crass, uneducated statement.\n\n \n \n I thought it was applicable levity.", 
   {}, 
   184759, 
   null, 
   1134418260.0
  ], 
  [
   184763, 
   null, 
   "jim's trucking", 
   "I thought it was applicable levity.\nYou would be expected to.", 
   {}, 
   184761, 
   null, 
   1134418680.0
  ], 
  [
   184769, 
   null, 
   "nocturnal09", 
   "no one cares aout Tookie about anymore. But the way i look at it is that whatever one person does to another, especially if it causes death or extreme hospital bills, they deserve to have it done to them as well. True, life isn't free nor does it deserve to be ended by any other human. But if necessary, it should be. Thats my opinion, whats yours?", 
   {
    "post_info": {
     "post_title": "wow...naive"
    }
   }, 
   182194, 
   null, 
   1134420060.0
  ], 
  [
   184771, 
   null, 
   "Eddie", 
   "You know, if you killed everyone in the US, your country would have a crime rate of zero. Yeah that`s right ZERO!!!. :p", 
   {}, 
   184769, 
   null, 
   1134420240.0
  ], 
  [
   184800, 
   null, 
   "JPSartre12", 
   "http://www.msnbc.msn.com/id/10355657/", 
   {
    "post_info": {
     "post_title": "Bye Bye Tookie"
    }
   }, 
   184771, 
   null, 
   1134428460.0
  ], 
  [
   184829, 
   null, 
   "Bassman", 
   "Tookie's \"redemption\" is as hollow as a chocolate bunny at Easter time. He never showed any remorse for his victims. Now Jesse Jackson and his ilk are bemoaning Gov. Schwartzenegger's decision and I seriously doubt that the SCOTUS will even entertain the idea.", 
   {}, 
   184800, 
   null, 
   1134437340.0
  ], 
  [
   184857, 
   null, 
   "snakespit", 
   "You are correct about the logic. It prevails on the pro-DP side and is absent or ignored on the anti-DP side.\n \n ...but, do not claim pro-DPers to lack compassion.\n\n Jim, I would normally think you are above this type of childish jab. Many people on both sides show no logic, compassion, or even comon sense. Many do exhibit these qualities. There are XXXXXX on both sides of every debate, the trick is to not be one of them.", 
   {}, 
   184740, 
   null, 
   1134445920.0
  ], 
  [
   184858, 
   null, 
   "jim's trucking", 
   "I wonder how long after Tookie bites the big one will come the cry of RACISM!", 
   {}, 
   184829, 
   null, 
   1134445920.0
  ], 
  [
   184860, 
   null, 
   "jim's trucking", 
   "Jim, I would normally think you are above this type of childish jab. Many people on both sides show no logic, compassion, or even comon sense. Many do exhibit these qualities. There are XXXXXX on both sides of every debate, the trick is to not be one of them.\nThen perhaps I should retract the use of \"absent\". \"Ignore\" (logic) is still a good decription of what many anti-DPers do. \n \n I have posted links (in another thread) to articles from independent studies showing that executions decrease the likelyhood of repeat murders. I haven't seen a decent response yet. It's being ignored, perhaps due to some sick logic that it will eventually be overlooked.", 
   {}, 
   184857, 
   null, 
   1134446340.0
  ], 
  [
   184861, 
   null, 
   "snakespit", 
   "Here is the real XXXX that bothers me. This is the *New Evidence* that the \"tookie\" site is posting as a last ditch effort to delay his execution. This is why I have a hard time taking the majority of the anti side seriously. It seems the closer the execution gets, the more desperate and rediculous these people get. \n \n http://www.tookie.com/documents/Affidavit.pdf", 
   {}, 
   184857, 
   null, 
   1134446340.0
  ], 
  [
   184862, 
   null, 
   "snakespit", 
   "I wonder how long after Tookie bites the big one will come the cry of RACISM!\n\n Look at his site, it has already started.", 
   {}, 
   184858, 
   null, 
   1134446520.0
  ], 
  [
   184866, 
   null, 
   "jim's trucking", 
   "Here is the real XXXX that bothers me. This is the *New Evidence* that the \"tookie\" site is posting as a last ditch effort to delay his execution. This is why I have a hard time taking the majority of the anti side seriously. It seems the closer the execution gets, the more desperate and rediculous these people get. \n \n http://www.tookie.com/documents/Affidavit.pdf\nI got through page 4 and it \"hung up\".\n \n However, I saw enough to know the race card is right around the corner.", 
   {}, 
   184861, 
   null, 
   1134447060.0
  ], 
  [
   184871, 
   null, 
   "jim's trucking", 
   "http://www.msnbc.msn.com/id/10355657/\n\n Praise the Lord and pass the needle! Tookie is due for a final fix!", 
   {}, 
   184800, 
   null, 
   1134447600.0
  ], 
  [
   184883, 
   null, 
   "Steeeeve", 
   "It would appear her is not gonna make it...got about 5 hours left in him. I hope he has asked God for forgiveness because I don't see any other way for him to make it otherwise.", 
   {}, 
   184871, 
   null, 
   1134449760.0
  ], 
  [
   184888, 
   null, 
   "snakespit", 
   "It would appear her is not gonna make it...got about 5 hours left in him. I hope he has asked God for forgiveness because I don't see any other way for him to make it otherwise.\n\n I hope he is not waiting on some fictional god to save him, he had a better chance with Arnold. Why exactly is it that people want to see him live anyway? ", 
   {}, 
   184883, 
   null, 
   1134450840.0
  ], 
  [
   184894, 
   null, 
   "JPSartre12", 
   "I hope he is not waiting on some fictional god to save him, he had a better chance with Arnold. Why exactly is it that people want to see him live anyway? \n\n \n \n Because Hollywood did a great PR job with him, made some cash on his story and now they feel guilty? Or maybe it just proves the old adage wrongly ascribed to PT Barnum \"A sucker's born every day\". \n My only question is \"where's the Tookie BBQ?\"emoticon_xhoho", 
   {}, 
   184888, 
   null, 
   1134451320.0
  ], 
  [
   184903, 
   null, 
   "Master_Shake", 
   "We are not giving him the ultimate penalty.\n\n Oh really? I had the impresion that the death penalty was the worst we had to offer. Can you inform we what is the ultimate penalty then?", 
   {}, 
   184352, 
   null, 
   1134458760.0
  ], 
  [
   184911, 
   null, 
   "snakespit", 
   "Oh really? I had the impresion that the death penalty was the worst we had to offer. Can you inform we what is the ultimate penalty then?\n\n Why don't we put that sentence into context, then perhaps even you might understand it.\n \n \nWe are not giving him the ultimate penalty. We are enforcing a penalty handed down by the jury who heard the facts of the case. Again, despite all his good acts and intentions, he has not payed the prescribed penalty for his crimes. I believe that some crimes and criminals deserve death. \"Tookies\" good works should not change the penalty called for by the jury.\n \n\n Let me repeat the important part of that. We are enforcing a penalty handed down by the jury who heard the facts of the case. He was given the penalty of death at the sentencing part of his trial some 26 years ago. Tonight, the state of California simply carried out the legally imposed punishment prescribed by the jury. \n \n But I will give you credit for digging up one sentence from 6 pages back, taking it out of context, and posting it as if it was a stand alone thought. Nice try. emoticon_xgood", 
   {}, 
   184903, 
   null, 
   1134473640.0
  ], 
  [
   184912, 
   null, 
   "jim's trucking", 
   "next!!!!!!", 
   {}, 
   184911, 
   null, 
   1134474720.0
  ], 
  [
   184916, 
   null, 
   "Steeeeve", 
   "I hope he is not waiting on some fictional god to save him, he had a better chance with Arnold. Why exactly is it that people want to see him live anyway? \n\n \n who said anything about wanting to see him live?", 
   {}, 
   184888, 
   null, 
   1134481620.0
  ], 
  [
   184924, 
   null, 
   "JPSartre12", 
   "Oh really? I had the impresion that the death penalty was the worst we had to offer. Can you inform we what is the ultimate penalty then?\n\n \n Being put in a cell with Howard Dean for life? emoticon_cry", 
   {}, 
   184903, 
   null, 
   1134485880.0
  ], 
  [
   184955, 
   null, 
   "trebor", 
   "Being put in a cell with Howard Dean for life? emoticon_cry\n\n \n No, being put in a cell with Fred Phillips for life.", 
   {}, 
   184924, 
   null, 
   1134494100.0
  ], 
  [
   184973, 
   null, 
   "Master_Shake", 
   "Why don't we put that sentence into context, then perhaps even you might understand it.\n\n That was uncalled for. I don't need your :xcensored\n \nLet me repeat the important part of that. We are enforcing a penalty handed down by the jury who heard the facts of the case. He was given the penalty of death at the sentencing part of his trial some 26 years ago. Tonight, the state of California simply carried out the legally imposed punishment prescribed by the jury.\n\n I never said that it wasn't handed down by a jury. Death is still the ultimate punishment. What difference does it make if a jury handed it down?\n \nBut I will give you credit for digging up one sentence from 6 pages back, taking it out of context, and posting it as if it was a stand alone thought. Nice try. emoticon_xgood\n\n Excuse me if I am not obsessively on this site. I have a life outside of it you know, and I was out of town for the weekend. It was not out of context, it was a very basic statement. Yes, there was more in your post that I took that from, but it is a stand alone statement anyway.", 
   {}, 
   184955, 
   null, 
   1134499260.0
  ], 
  [
   184974, 
   null, 
   "Master_Shake", 
   "No, being put in a cell with Fred Phillips for life.\n\n You mean Fred Phelps? If that is the case, I agree.", 
   {}, 
   184955, 
   null, 
   1134499320.0
  ], 
  [
   184987, 
   null, 
   "JPSartre12", 
   "You mean Fred Phelps? If that is the case, I agree.\n\n \n \n hey, at least it wouldn't be boring. ;)", 
   {}, 
   184974, 
   null, 
   1134503940.0
  ], 
  [
   184996, 
   null, 
   "Master_Shake", 
   "hey, at least it wouldn't be boring. ;)\n\n Boring, maybe not. Maddening, definitely.", 
   {}, 
   184987, 
   null, 
   1134505860.0
  ], 
  [
   185045, 
   null, 
   "Wez", 
   "What does killing him achieve over putting him behind bars for the rest of his life (bar increased legal bills)?\n \n -Wez", 
   {}, 
   184996, 
   null, 
   1134518760.0
  ], 
  [
   185047, 
   null, 
   "Bassman", 
   "It's something called \"Punishment befitting of the crime.\" In Tookie's case, the overwhelming evidence, testimony and his lack of remorse, not to mention the murders themselves, are all indicative of a person who is a prime candidate for society's ultimate sanction.", 
   {}, 
   185045, 
   null, 
   1134519420.0
  ], 
  [
   185049, 
   null, 
   "Wez", 
   "And what positive thing does it achieve, other than satiating a thirst for blood?\n \n -Wez", 
   {}, 
   185047, 
   null, 
   1134519900.0
  ], 
  [
   185050, 
   null, 
   "Bassman", 
   "Justice!! Pure and simple. Think about Tookie's victims rather than Tookie himself. When he committed those vicious murders, all bets were off! He made the choice to risk the death penalty.", 
   {}, 
   185049, 
   null, 
   1134520380.0
  ], 
  [
   185193, 
   null, 
   "Wez", 
   "Justice!! Pure and simple. Think about Tookie's victims rather than Tookie himself. When he committed those vicious murders, all bets were off! He made the choice to risk the death penalty.\n\n You didn't, ironically, justify your claim. What does killing him achieve over putting him behind bars for the rest of his life (bar increased legal bills)?\n \n What benefit is there?\n \n Going off on a tangent. What happens if the people murdered (in general, not specifically tookie's case) and their families were against the death penalty and for imprisonment?\n \n -Wez", 
   {}, 
   185050, 
   null, 
   1134587940.0
  ], 
  [
   185196, 
   null, 
   "jim's trucking", 
   "You didn't, ironically, justify your claim. What does killing him achieve over putting him behind bars for the rest of his life (bar increased legal bills)?\n \n What benefit is there?\n \n Going off on a tangent. What happens if the people murdered (in general, not specifically tookie's case) and their families were against the death penalty and for imprisonment?\n \n -Wez\nExecutions deter crime, in particular, murders. The murder rates go down when executions take place.", 
   {}, 
   185193, 
   null, 
   1134589080.0
  ], 
  [
   185200, 
   null, 
   "Wez", 
   "Here's the truth about your 119 figure.\n \n http://www.prodeathpenalty.com/Innocence.htm\n \n Read this entire link. It's quite interesting and revealing of the dubious methods anti-death penalty activists will use to get their way.\n\n I've skim read parts of it. Some interesting fact twisting going on here:\n \n \" Of those 102 DPIC \"innocent\" cases, 24 have been identified by the DPIC as being from the state of Florida. The Florida Commission on Capital Cases conducted a thorough review of those 24 cases. The Commission found that 4 of those might have a credible claim of actual innocence. (15).\n \n That reveals an 83% error by the DPIC in their Florida case descriptions. If the DPIC has a consistent error rate, nationwide, that would indicate that there is evidence for claiming 17 actual innocents within their 102 innocents claim -- or 0.2% of the 7400 sentenced to death since 1973.\"\n Trusting one survey that agrees, while simply ignoring the other study.\n \n \" At least 11 of the cases were not even on death row at the time of their \"innocence\" discovery. 6 of the DPIC listed cases were not on death row when released and were prosecuted prior to 1973, in the pre Furman v Georgia (1972) era and, therefore, have no place in a modern era discussion of \"innocents\" released from death row (19).\"\n So they don't count because at the time of their proven 'innocence' they weren't oon death row? That doesn't stop them being 'innocent' while on death row.\n \n \" As Dieter and other death penalty opponents make no distinction between the actually innocent and the legally innocent, why don't they claim that over 2500 innocents have been \"exonerated\" from death row? That is the number of legally and actually innocent released from death row since 1973 (6). The answer is obvious. \"\n Why were they on death row in the first place?\n \n \" \"A defendant whose conviction is overturned by a judge must be further exonerated in one of three ways: he must be acquitted at a new trial, or the prosecutor must drop the charges against him, or a governor must grant an absolute pardon.\" (7)\n \n Dieter is consistent.\n \n None of those exoneration categories establishes, or even suggests, actual innocence.\"\n \"Acquitted\" doesn't count as \"actual innocence\"?\n \n \" Acquittal, which is a \"not guilty\" verdict, means that the state was unable to meet the necessary burden of proof, in establishing guilt beyond a reasonable doubt. It has nothing to do with establishing actual innocence. \"\n What the hell? Acquitted means \"To free or clear from a charge or accusation.\" Their definition of \"acquitted\" is \"the state was unable to meet the necessary burden of proof,\" which is of course true, but seems to forget that that not meeting the burden of proof includes not having proof.\n \n \" Furthermore, any assertion that the death penalty is not a deterrent is false. Those studies not finding for deterrence do not say it doesn't exist. Those studies finding for deterrence state that is does. A statutory challenge caused a temporary halt to executions in Texas, in 1996. The result? \"The [Texas] execution hiatus, therefore, appears to have spared few, if any, condemned prisoners while the citizens of Texas experienced a net 90 [up to 150) additional innocent lives lost to homicide. Politicians contemplating moratoriums may wish to consider the possibility that a seemingly innocuous moratorium on executions could very well come at a heavy cost.\" (22)\"\n \n The first sentence is written as a fact. This fact is based on one quoted survey. If I produce a survey that says the death penalty isn't a deterrent what ahppens then?\n \n \n \nThere's a link not to far back in this thread that lists many repeat killings by people who got out after serving time for murder. Several were murders of kind people who befriended the murderer and gave him a place to stay.\n \n http://www.prodeathpenalty.com/repeat_murder.htm\n\n Now how many of those occurred while the prisoner was either in prison or after he escaped? Those are the only relevant ones, seeing as my argument is that the death penalty should be changed to life imprisonment.\n \n \n \nThere are also instances of murderers killing other prisoners and prison guards while in prison. Do these count in your tabulation of repeat murderers?\n\n Yep.\n \n -Wez", 
   {}, 
   184568, 
   null, 
   1134590160.0
  ], 
  [
   185201, 
   null, 
   "Wez", 
   "Executions deter crime, in particular, murders. The murder rates go down when executions take place.\n\n Evidence please.\n \n (and getting it from a site called prodeathpenalty.com might not be the best idea;))\n \n -Wez", 
   {}, 
   185196, 
   null, 
   1134590220.0
  ], 
  [
   185223, 
   null, 
   "jim's trucking", 
   "Evidence please.\n \n (and getting it from a site called prodeathpenalty.com might not be the best idea;))\n \n -Wez\nThese sites are linked from the proDP site. Suerly, you should not expect them to be referenced on an antiDP site.\n \n \n http://people.clemson.edu/~jshephe/DPpaper_fin.pdf\n \n http://www.cema.edu.ar/publicaciones/download/volumen7/zimmerman.pdf\n \n http://papers.ssrn.com/sol3/papers.cfm?abstract_id=352681\n \n http://econ.cudenver.edu/mocan/papers/GettingOffDeathRow.pdf\n \n http://www.blackwellpublishing.com/issue.asp?ref=0038-4941&vid=82&iid=2&oc=&s=&site=1\n \n http://ideas.repec.org/a/taf/applec/v33y2001i5p569-76.html\n \n \n I've read the entire paper for te first link and have started on another down the list. They are above my head in terms of statistical jargon, but I seem to be able to follow their logic. Each claims that the DP is a deterrent.", 
   {}, 
   185201, 
   null, 
   1134593640.0
  ], 
  [
   185228, 
   null, 
   "Truthsayer", 
   "He just makes me want to write poetic children's books.\n \n \n \n There once was a thug they called Tookie,\n Who stole life like stealing a cookie,\n Now Tookie said, \"Lookie, \n Bet a twenty they won't cook me,\n And he left this world oweing his bookie.\n *********************************Truthsayer", 
   {}, 
   185223, 
   null, 
   1134595500.0
  ], 
  [
   185235, 
   null, 
   "snakespit", 
   "He just makes me want to write poetic children's books.\n \n \n \n There once was a thug they called Tookie,\n Who stole life like stealing a cookie,\n Now Tookie said, \"Lookie, \n Bet a twenty they won't cook me,\n And he left this world oweing his bookie.\n *********************************Truthsayer\n\n Thanks, needed a good laugh today, that did it.", 
   {}, 
   185228, 
   null, 
   1134597000.0
  ], 
  [
   185236, 
   null, 
   "Truthsayer", 
   "I do what I can.emoticon_xhoho", 
   {}, 
   185235, 
   null, 
   1134597060.0
  ], 
  [
   185239, 
   null, 
   "snakespit", 
   "I never said that it wasn't handed down by a jury. Death is still the ultimate punishment. What difference does it make if a jury handed it down.\n\n You still seem to be missing my point. We did not give him this sentence. I did not, you did not, Jim did not, and even Dono did not. Nor did the people who pushed the drugs through him that killed him. He was given this penalty by the jury who heard the facts of the case. You said something to the effect of \"should we really be giving this man the death penalty?\" I think there is a distinction worthy of note that we did not give \"tookie\" any punishment. First off, he earned it himself by his actions. Second, a jury sentenced him with that punishment. Third, he was sentenced to death because a jury found his crimes especially heinous, and prior to \"tookie\" becoming a dime store book shelf sensation. His \"good\" actions since his conviction should not change the sentence the jury handed down.", 
   {}, 
   184973, 
   null, 
   1134597600.0
  ], 
  [
   185305, 
   null, 
   "JPSartre12", 
   "You didn't, ironically, justify your claim. What does killing him achieve over putting him behind bars for the rest of his life (bar increased legal bills)?\n \n What benefit is there?\n\n More fertilizer for daises to grow? emoticon_xkill \n \n\n Going off on a tangent. What happens if the people murdered (in general, not specifically tookie's case) and their families were against the death penalty and for imprisonment?\n\n \n It shouldn't be their call. Society sets punishment, not victims. If we wanted victims to set the punishment, we'd allow vigilanteeism.", 
   {}, 
   185193, 
   null, 
   1134617580.0
  ], 
  [
   185312, 
   null, 
   "jim's trucking", 
   "...\n \n \n It shouldn't be their call. Society sets punishment, not victims. If we wanted victims to set the punishment, we'd allow vigilanteeism.\nJust how many knife sharpeners do you have?emoticon_xhoho", 
   {}, 
   185305, 
   null, 
   1134618420.0
  ], 
  [
   185318, 
   null, 
   "JPSartre12", 
   "Just how many knife sharpeners do you have?emoticon_xhoho\n\n \n I never claimed that I wasn't personally in favor of vigilanteism. If someone screws with my family, I'll be all over them like white on rice. emoticon_xkill emoticon_xkill emoticon_xkill", 
   {}, 
   185312, 
   null, 
   1134619260.0
  ], 
  [
   185324, 
   null, 
   "jim's trucking", 
   "I never claimed that I wasn't personally in favor of vigilanteism. If someone screws with my family, I'll be all over them like white on rice. emoticon_xkill emoticon_xkill emoticon_xkill\nI was alluding to my previous comment on another thread that you are now a candidate for the sharpest knife in the drawer.emoticon_xgood\n \n ...perhaps I mistakenly assume everyone's memory is as good as mine.", 
   {}, 
   185318, 
   null, 
   1134620220.0
  ], 
  [
   185362, 
   null, 
   "snakespit", 
   "I never claimed that I wasn't personally in favor of vigilanteism. If someone screws with my family, I'll be all over them like white on rice. emoticon_xkill emoticon_xkill emoticon_xkill\n\n Nothing personal, but how is it on one hand you can talk about your absolute support for a part of the judical system (capital punishment), when you say if you were personally affected that you would circumvent that system and make yourself the judge, jury, and executioner? Maybe it is just me, but I don't get it. emoticon_confused", 
   {}, 
   185318, 
   null, 
   1134636000.0
  ], 
  [
   185388, 
   null, 
   "jim's trucking", 
   "Nothing personal, but how is it on one hand you can talk about your absolute support for a part of the judical system (capital punishment), when you say if you were personally affected that you would circumvent that system and make yourself the judge, jury, and executioner? Maybe it is just me, but I don't get it. emoticon_confused\nFamily blood is thicker and stickier than school glue. I share both of his sentiments...from afar!", 
   {}, 
   185362, 
   null, 
   1134647160.0
  ], 
  [
   185471, 
   null, 
   "Truthsayer", 
   "Family blood is thicker and stickier than school glue. I share both of his sentiments...from afar!\n\n \n Exactly. Hurt my brothers, my wife, kids, or grandbabies (or even a few select friends) or other close family members and all bet are off. Period. emoticon_xkill \n \n Any questions?\n \n Good.\n \n Case closed.\n \n Have a nice day.:)", 
   {}, 
   185388, 
   null, 
   1134675720.0
  ], 
  [
   185475, 
   null, 
   "Wez", 
   "More fertilizer for daises to grow? emoticon_xkill \n\n Hilarious.\n \n Got a real answer?\n \n (and if you want to pretend you were being serious, then I'd point out that the money spent on the execution could buy more fertiliser than the corpse of a man)\n \n \nIt shouldn't be their call. Society sets punishment, not victims. If we wanted victims to set the punishment, we'd allow vigilanteeism.\n\n I agree entirely. Why one earth does what the victim/ victim's family want matter (as Bassman implied)?\n \n jim's trucking: Plenty of studies support the death penalty and plenty oppose it. I don't see how it's much worse than life imprisonment personally. In both cases you spend the rest of your life in jail and die there.\n \n -Wez", 
   {}, 
   185305, 
   null, 
   1134676440.0
  ], 
  [
   185769, 
   null, 
   "JPSartre12", 
   "Nothing personal, but how is it on one hand you can talk about your absolute support for a part of the judical system (capital punishment), when you say if you were personally affected that you would circumvent that system and make yourself the judge, jury, and executioner? Maybe it is just me, but I don't get it. emoticon_confused\n\n \n \n Easy explanation. I believe in greasing the wheels of justice in some instances. When it gets personal, I have the patience of that cartoon vulture that proclaims \" Patience my arse, I'm gonna kill something.\" emoticon_xkill", 
   {}, 
   185362, 
   null, 
   1134767580.0
  ], 
  [
   186400, 
   null, 
   "snakespit", 
   "Easy explanation. I believe in greasing the wheels of justice in some instances. When it gets personal, I have the patience of that cartoon vulture that proclaims \" Patience my arse, I'm gonna kill something.\" emoticon_xkill\n\n So it works and is deserving of support when it involves others, but when it is you, you find yourself above the system and not bound by the laws that the rest of us go by? Sad. I just hope that if you are ever in the position of seeking vigilantee justice, and you end up facing the death penalty yourself, that you don't put up a fight when you are strapped to the table.", 
   {}, 
   185769, 
   null, 
   1134982680.0
  ], 
  [
   186688, 
   null, 
   "JPSartre12", 
   "So it works and is deserving of support when it involves others, but when it is you, you find yourself above the system and not bound by the laws that the rest of us go by? Sad. I just hope that if you are ever in the position of seeking vigilantee justice, and you end up facing the death penalty yourself, that you don't put up a fight when you are strapped to the table.\n\n \n If I ever \"murder\" someone without cause, I would deserve to die. But if I gave a rapist or murderer of a family member a \"dirt nap\" because the system failed, I don't see too many courts pushing for death. emoticon_xkill", 
   {}, 
   186400, 
   null, 
   1135093260.0
  ], 
  [
   186814, 
   null, 
   "snakespit", 
   "If I ever \"murder\" someone without cause, I would deserve to die. But if I gave a rapist or murderer of a family member a \"dirt nap\" because the system failed, I don't see too many courts pushing for death. emoticon_xkill\n\n System failed? The way you make it sound, you would never give the system a chance to do it's job in the first place. Seeking you own brand of \"justice\" through vigilanteism and denying someone their constitutional rights would make you no better than the man that murdered your family in the first place. I find murderers dispicable, and yes, I think most of them deserve to be put to death, but not until they are convicted of their crime in a court of law.", 
   {}, 
   186688, 
   null, 
   1135121040.0
  ], 
  [
   186868, 
   null, 
   "Michele", 
   "True repentance would give him a chance with me, but this fellow has never apologized for what he did and so should have no chance at clemency. If one won't admit one has done wrong, one is not repentant.\n \n \n Tookie maintained his innocence throughout the trial and all the subsequent years. How can he apologize for something he didn't do? How can he change his story now? What if he's right?\n \n No one is saying he was a nice man. Life without parole would give him a longer sentence in any case.\n \n The thing that bothers me about Tookie and Scott Peterson is that there were no witnesses. There was only circumstantial evidence. I don't believe the death penalty should be allowed for circumstantial evidenc. There must be forensic evidence...fingerprints, DNA, hairs, blood, something physical, IMHO.\n \n I am not pro-death penalty in any case. It terrifies me that the state might murder an innocent person. Maybe you think life is cheap, but I don't.\n \n We will probably never be able to prove we have killed an innocent person, but I bet we have. It is just no one looks after they are dead.", 
   {}, 
   183464, 
   null, 
   1135129800.0
  ], 
  [
   186870, 
   null, 
   "JPSartre12", 
   "System failed? The way you make it sound, you would never give the system a chance to do it's job in the first place. Seeking you own brand of \"justice\" through vigilanteism and denying someone their constitutional rights would make you no better than the man that murdered your family in the first place. I find murderers dispicable, and yes, I think most of them deserve to be put to death, but not until they are convicted of their crime in a court of law.\n\n \n I never claimed to be a patient man. In fact, my wife would tell you that I'm certainly not.", 
   {}, 
   186814, 
   null, 
   1135130340.0
  ], 
  [
   186873, 
   null, 
   "JPSartre12", 
   "True repentance would give him a chance with me, but this fellow has never apologized for what he did and so should have no chance at clemency. If one won't admit one has done wrong, one is not repentant.\n \n \n Tookie maintained his innocence throughout the trial and all the subsequent years. How can he apologize for something he didn't do? How can he change his story now? What if he's right?\n \n No one is saying he was a nice man. Life without parole would give him a longer sentence in any case.\n \n The thing that bothers me about Tookie and Scott Peterson is that there were no witnesses. There was only circumstantial evidence. I don't believe the death penalty should be allowed for circumstantial evidenc. There must be forensic evidence...fingerprints, DNA, hairs, blood, something physical, IMHO.\n \n I am not pro-death penalty in any case. It terrifies me that the state might murder an innocent person. Maybe you think life is cheap, but I don't.\n \n We will probably never be able to prove we have killed an innocent person, but I bet we have. It is just no one looks after they are dead.\n\n \n Might I suggest that you read at least a portion of the eyewitness testimony before you conclude that there was only circumstantial evidence. emoticon_rolleyes \n Here's a good synopsis complete with transcript references.\n http://crime.about.com/od/deathrow/a/tookie2.htm\n http://crime.about.com/od/deathrow/a/tookie3.htm\n http://crime.about.com/od/deathrow/a/tookie5.htm", 
   {}, 
   186868, 
   null, 
   1135131060.0
  ], 
  [
   187118, 
   null, 
   "Michele", 
   "I have read them before. These \"eyewitnesses\" for the most part, testified in order to benefit themselves. Who knows if they were truthful. Others \"heard\" about it or claimed Tookie told them. Also, not the best witnesses. \n \n Look, I am just saying, except for a bunch of criminals out to benefit themselves, there was no one to provide unbiased testimony.\n \n There was no forensic evidence. Strange, don't you think?\n \n Even if he was guilty, putting him to death solves nothing. It just makes all of us murderers.\n \n Also, someone said something about they heard someone else wrote Tookie's books. I know he had someone help him because he wasn't a writer. But no one stood in for him during teleconferences with high school classes where he talked to at-risk youths and told them how it was, how gangs were dead-ends, how to stay out and make something of themselves.\n \n He could have done that for the rest of his life and done some goood.", 
   {}, 
   186873, 
   null, 
   1135200060.0
  ], 
  [
   187121, 
   null, 
   "JPSartre12", 
   "I have read them before. These \"eyewitnesses\" for the most part, testified in order to benefit themselves. Who knows if they were truthful. Others \"heard\" about it or claimed Tookie told them. Also, not the best witnesses. \n \n Look, I am just saying, except for a bunch of criminals out to benefit themselves, there was no one to provide unbiased testimony.\n\n Imagine that. Four criminals commit crimes and the only living witnesses are the four criminals. emoticon_rolleyes \n Your logic reminds me of the defense's argument for the Menendez brothers. They pleaded for lieniency because the brothers didn't have any parents. Nevermind the fact that they didn't have parents because they MURDERED them. :xbanghead \n \n\n There was no forensic evidence. Strange, don't you think?\n\n What about the shotgun shells from Tookie's shotgun? Did you forget about that?\n \n\n Even if he was guilty, putting him to death solves nothing. It just makes all of us murderers.\n\n I can live with that burden. emoticon_xkill emoticon_xgood \n \n\n Also, someone said something about they heard someone else wrote Tookie's books. I know he had someone help him because he wasn't a writer. But no one stood in for him during teleconferences with high school classes where he talked to at-risk youths and told them how it was, how gangs were dead-ends, how to stay out and make something of themselves.\n \n He could have done that for the rest of his life and done some goood.\n\n \n He was convicted of multiple murders and sentenced to death. Why have a legal system, trials and sentencing hearings at all if we are just going to arbitrarily and capriciously apply them?emoticon_confused", 
   {}, 
   187118, 
   null, 
   1135202400.0
  ], 
  [
   187430, 
   null, 
   "Michele", 
   "Well, that's the issue isn't it? The death penalty. I don't like, don't want it, don't support it.\n \n Shotguns don't have rifling. I don't know how they decided it was his gun, but I have reasonable doubt.", 
   {}, 
   187121, 
   null, 
   1135300740.0
  ], 
  [
   187630, 
   null, 
   "JPSartre12", 
   "Well, that's the issue isn't it? The death penalty. I don't like, don't want it, don't support it.\n \n Shotguns don't have rifling. I don't know how they decided it was his gun, but I have reasonable doubt.\n\n \n Actually some shotguns DO have rifling, but there are other ways to ID a shotgun. \n http://www.firearmsid.com/A_distshotpatt.htm", 
   {}, 
   187430, 
   null, 
   1135375380.0
  ], 
  [
   187638, 
   null, 
   "Michele", 
   "Actually some shotguns DO have rifling, but there are other ways to ID a shotgun. \n http://www.firearmsid.com/A_distshotpatt.htm\n\n \n From your link: Except in some rare cases the projectiles fired from them cannot be matched back to the shotgun.\n \n Patterns and distance and all that sound like they are not specific to a particular gun. Is there any proof that 2 guns made at the same time in the same place have different patterns?\n \n Like I said, sounds like reasonable doubt to me. At least for the death penalty.", 
   {}, 
   187630, 
   null, 
   1135377420.0
  ], 
  [
   187711, 
   null, 
   "JPSartre12", 
   "From your link: Except in some rare cases the projectiles fired from them cannot be matched back to the shotgun.\n \n Patterns and distance and all that sound like they are not specific to a particular gun. Is there any proof that 2 guns made at the same time in the same place have different patterns?\n \n Like I said, sounds like reasonable doubt to me. At least for the death penalty.\n\n \n If you looked further, you would have seen that there are other ways to ID guns such as primer indentations made by firing pins, scratches on casings, etc.,", 
   {}, 
   187638, 
   null, 
   1135398300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Opinion on Tookie?", 
  "url": "http://www.4forums.com/political/crime-debates/6948-opinion-tookie.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 6948, 
  "discussion_files": [
   [
    "27591.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-print.html"
   ], 
   [
    "27592.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-15-print.html"
   ], 
   [
    "27593.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-13-print.html"
   ], 
   [
    "27594.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-12-print.html"
   ], 
   [
    "27595.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-10-print.html"
   ], 
   [
    "27596.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-8-print.html"
   ], 
   [
    "27597.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-6-print.html"
   ], 
   [
    "27598.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-4-print.html"
   ], 
   [
    "27599.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-7-print.html"
   ], 
   [
    "27600.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-9-print.html"
   ], 
   [
    "27601.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-5-print.html"
   ], 
   [
    "27602.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-14-print.html"
   ], 
   [
    "27603.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-11-print.html"
   ], 
   [
    "27604.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-3-print.html"
   ], 
   [
    "27605.html", 
    "http://www.4forums.com/political/crime-debates/6948-opinion-tookie-2-print.html"
   ]
  ], 
  "identifier": 6948
 }
]