[
 [
  [
   182792, 
   null, 
   "oliphant", 
   "What's going on with Iraq:\n \n We went in for a bad reason. We honestly thought we were right, but we weren't. Ok, now what? Well, we can leave, and put a country into horrible chaos, leading it to hate our country (even more than some say it already does), or stay and try to get it running with a constitution and army of its own. Everyone knows immediate pullout is idiotic (proven by the recent vote in Congress). So, then what?\n \n Politically in America:\n \n The President knows that we are winning in Iraq. We already have several battalions of Iraqi troops that are capable of conducting all operations virtually on their own. The ones that cannot, mostly require US aid in the areas of intelligence and supply. Many more battalions are on the way, particularly as we get better at training them. Time and again, the real experts (Bush's Generals) assure him that we are winning. And his Generals are not Republican (and will be assured their jobs if we leave the war or not).\n \n So why are the Democrats stirring so much heat? Well, for starters, if they admitted that we are winning the war, it would mean virtually the demise of the Democratic party. American trust in it would be shattered due to statements they have made throughout much of the war. \n \n Many key Democratic leaders are aware of our impending victory, and how poorly it will reflect on their party. They must do one of two things in order to keep the integrity of their party: They must convince us to pull out, thereby claiming total victory and rightness on the issue, or they must convince us to follow their timeline, which will allow them to claim victory still. Their primary concern is a new President that Congress knows will be elected at about the same time it becomes evident that we will win the war. Thus, Democrats must accomplish one of these two things quickly in order to get a Democratic president elected (that's why the issue is exploding so much, and will continue to for a while). Once a Democratic president is elected, they will truly be able to portray themselves as the victor party for turning the war into something positive (be it pulling out or making Iraq a working state). This is because the war will be ending, no matter what, sometime in the next President's term, so if it ends on a high note (a working Iraq), then they can claim to have fixed the Republican's \"mess.\" Not all Democrats realize that the war will be won (they are being duped by key leaders in their own party), which makes Democratic unity on the issue extremely tight. In addition, Republicans, most of which are aware of the impending victory, know that if Democrats get enough steam, they will be able to claim victory regardless (as explained above). This is why many Republicans (those with rubber legs) are edging away from the President.\n \n The key is that America is and will win the war if its generals are allowed to finish the job. The main questions are will it be allowed to finish, and if it does or does not, who will receive credit.\n \n You can either choose to believe what I just wrote, and know what's really going on, or you can ignore it and be duped by a political agenda war.", 
   {
    "post_info": {
     "post_title": "credit-claiming war"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1133484840.0
  ], 
  [
   182847, 
   null, 
   "Dono", 
   "\n You can either choose to believe what I just wrote, and know what's really going on, or you can ignore it and be duped by a political agenda war.\n\n In that case, please list me with the majority under \"duped\".\n Dono", 
   {}, 
   182792, 
   null, 
   1133496840.0
  ], 
  [
   182949, 
   null, 
   "simone", 
   "What does \"winning\" mean?\n \n How will we know if we have \"won the war\"?", 
   {}, 
   182847, 
   null, 
   1133545860.0
  ], 
  [
   182953, 
   null, 
   "georged", 
   "When Iran envelopes Shia Iraq and Turkey declares war on the Kurds?", 
   {}, 
   182949, 
   null, 
   1133546760.0
  ], 
  [
   182975, 
   null, 
   "Alan Ryan", 
   "\n The key is that America is and will win the war if its generals are allowed to finish the job. The main questions are will it be allowed to finish, and if it does or does not, who will receive credit.\n \n \n \n I have read these couple of sentences several times, and I still can't make sense of them.\n \n Do they contain your \"key points\" ? If so, what are they ?", 
   {}, 
   182792, 
   null, 
   1133549460.0
  ], 
  [
   185376, 
   null, 
   "oliphant", 
   "In light of the recent polls in Iraq, I thought I would \"bump\" this post up, since this is one of the first steps in vindicating its correctness. I'll be doing this every so often until it becomes blatantly obvious to the general public that the things contained herein are correct.\n \n And yes, I realize I could have made the original article easier to understand, but if you read it carefully you ought to be able to figure out what its saying without much difficulty.", 
   {}, 
   182792, 
   null, 
   1134641400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  credit-claiming war", 
  "url": "http://www.4forums.com/political/politics-debates/6976-credit-claiming-war.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 6976, 
  "discussion_files": [
   [
    "25555.html", 
    "http://www.4forums.com/political/politics-debates/6976-credit-claiming-war-print.html"
   ]
  ], 
  "identifier": 6976
 }
]