[
 [
  [
   183479, 
   null, 
   "pandion", 
   "The new specimen of Archaeopteryx was found in a private collection in Switzerland. It comes from the same limestone quarry at Solnhofen as the others. There is an article in National Geographic about it. However, the scientific description was published in the 2 Dec 2005 issue of Science. As you are all aware, National Geographic is a magazine about science and not peer reviewed scientific literature. Science is a scientific journal published by the AAAS.\n \n At any rate, there are 4 salient features of the new Archaeopteryx fossil. It is the second most complete (2nd to the Berlin specimen - HMN 1880) and the best preserved in many features.\n \n 1. It is evident from the well-preserved foot that the 2nd toe could \"hyper-extend,\" i.e., it could be raised off of the ground in the manner of Velociraptor and Troodon. This was not clear from other specimens.\n \n 2. The 1st toe (hallux) was not reversed as in modern perching birds. The reversed hallux is an adaption to perching on branches. This suggests that Archaeopteryx was probably more cursorial than perching.\n \n 3. The \"pre-tibial\" bone is clearly visible and is clearly the same as the ascending process of the astragalus in dinosaurs. Archaeopteryx had dinosaur feet and dinosaur ankles - not bird feet nor bird ankles.\n \n 4. The skull is not crushed and is preserved in dorsal view. The palatine bone in the snout is visible and has 4 prongs like theropod dinosaurs rather than three prongs like birds.\n \n The Wyoming Dinosaur Center in Thermopolis, Wyoming has acquired the specimen. It is currently in Germany. As with most of the other Archaeopteryx specimens, feather impressions are visible.\n \n The several articles mention that this is the 10th Archaeopteryx-like specimen. I count 1 feather + 7 skeletal specimens + the Thermopolis specimen. That makes 9. There is also mention of a closely related fossil specimen, but specimen 6 (S6), the Solhofen specimen of Archaeopteryx, has been reclassified as Wellnhoferia grandis because of physiological differences (tail, configuration of pedal bones). So I still get 9. I'd like to know about the one I'm missing.", 
   {
    "post_info": {
     "post_title": "New Archaeopteryx specimen discovered"
    }
   }, 
   null, 
   null, 
   1133818740.0
  ], 
  [
   183546, 
   null, 
   "beervolcano", 
   "So that's why Noah didn't send out an Archeopterix to find a fig branch!", 
   {}, 
   183479, 
   null, 
   1133842560.0
  ], 
  [
   184390, 
   null, 
   "billsco", 
   "It's a Fig Newton, not a branch. Get the story straight, will you.:) \n \n So, the significance of this new find is further proof that birds descended from dinosaurs?", 
   {}, 
   183546, 
   null, 
   1134222900.0
  ], 
  [
   184589, 
   null, 
   "OccamsRazor", 
   "Well it gives us more indication as to the mode of life of Archaeopteryx as an early bird and more common structural features with small theropods that are suggested as the ancestral stock from which birds evolved. It is worth noting that both Velociraptor and Troodon lived a long time after Archaeopteryx; the suggestion here is all three had a common ancestor from which similar features were inherited.", 
   {}, 
   184390, 
   null, 
   1134330960.0
  ], 
  [
   184913, 
   null, 
   "SkepticGunt", 
   "So, it was already established that the Archeopterix evolved from the dinosaur (we know this), but now we know more about which dinosaurs it evolved from, and when?", 
   {}, 
   184589, 
   null, 
   1134476580.0
  ], 
  [
   185127, 
   null, 
   "pandion", 
   "So, it was already established that the Archeopterix evolved from the dinosaur (we know this), but now we know more about which dinosaurs it evolved from, and when?\nNo. This is just more evidence that Archaeopteryx was a theropod dinosaur. As one of the articles I read stated, this is the nail in the coffin. Some of the characteristics that seemed to be more bird-like in other specimens can be seen to actually be dinosaurian. For good reason were two specimens classified as Compsognathus .", 
   {}, 
   184913, 
   null, 
   1134548640.0
  ], 
  [
   185354, 
   null, 
   "SkepticGunt", 
   "Fair enough.\n \n Now all we need to find is the skeleton of a human riding the skeleton of an archeopterix...", 
   {}, 
   185127, 
   null, 
   1134630780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New Archaeopteryx specimen discovered", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/7000-new-archaeopteryx-specimen-discovered.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 7000, 
  "discussion_files": [
   [
    "26485.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/7000-new-archaeopteryx-specimen-discovered-print.html"
   ]
  ], 
  "identifier": 7000
 }
]