[
 [
  [
   184420, 
   null, 
   "simone", 
   "I've gotten an old CD player hooked up and functioning that I recently rescued from a languishing storage space far away. I've finally gotten to play all of my classical Christmas music in one fell swoop--old system capable of playing multiple CDs whose technicalities I have mastered. \n \n It was delightful to see that my daughter in England sent me an electronic file of pictures of my gorgeous granddaughter in a kindergarten Christmas pageant--I think she was one of the Wise Guys. \n \n So, very early in the music I have my CD player loudly blasting classical Christmas music as I view the cute pictures of the pageant--the usual group of kids, the usual cuteness. \n \n It passes too quickly and I must return to the perusal of the news coverage I have e-mailed to me and--in stark contrast to an innocent message of Christmas hope--I am bombasted by the rhetoric of a president who loves torture and the foul corruption of Tom DeLay and all of his foul and befouled cronies. \n \n Damnation to all those foul beasts who love torture and corruption and boot the illbegotten sons of female dogs to H E L L! That's my Christmas message this year.", 
   {
    "post_info": {
     "post_title": "Oh! The Hypocrisy!"
    }
   }, 
   null, 
   null, 
   1134234120.0
  ], 
  [
   184422, 
   null, 
   "Obvious Child", 
   "Indeed.\n \n Also, I always like your thread titles, simone. On the topics screen it doesn't give the thread starter, but I knew this must be you ;)", 
   {}, 
   184420, 
   null, 
   1134234480.0
  ], 
  [
   184482, 
   null, 
   "johnhanks", 
   "Damnation to all those foul beasts who love torture and corruption and boot the illbegotten sons of female dogs to H E L L! That's my Christmas message this year.\n\n \n Amen.\n \n (Um - aren't sons of female dogs, illbegotten or not, just called ... dogs? What have they done to merit comparison with Bush and DeLay?)", 
   {}, 
   184420, 
   null, 
   1134255180.0
  ], 
  [
   184525, 
   null, 
   "oliphant", 
   "Damn them all you want, but please, please don't fool yourself into believing that their political opponents are even significantly better.", 
   {}, 
   184482, 
   null, 
   1134267600.0
  ], 
  [
   184533, 
   null, 
   "jim's trucking", 
   "...Damnation to all those foul beasts who love torture and corruption and boot the illbegotten sons of female dogs to H E L L! That's my Christmas message this year.\nThat's about as unChristmasy a message as I read anywhere.\n \n BTW, those who love torture and corruption are steadily being booted out of office...as in Iraq today. Some of them have already been booted to H E L L!", 
   {}, 
   184420, 
   null, 
   1134271440.0
  ], 
  [
   184534, 
   null, 
   "jim's trucking", 
   "Damn them all you want, but please, please don't fool yourself into believing that their political opponents are even significantly better.\nExcept in basic philosophies, there's not a dime's worth of difference between political opponents anywhere. The bell shaped curved is alive and well concerning corruption and torture...on both sides of any defined fence.", 
   {}, 
   184525, 
   null, 
   1134271620.0
  ], 
  [
   184563, 
   null, 
   "simone", 
   "http://select.nytimes.com/2005/12/11/opinion/11kristof.html\n \n December 11, 2005\n Op-Ed Columnist\n Bush Meets St. Peter\n By NICHOLAS D. KRISTOF\n If a meteorite crashed down on the White House today, the conversation at the Pearly Gates might go something like this.\n \n \"Oh-h-h. Where am I? St. Peter?\"\n \n \"Welcome, Mr. President. I just need to see if you belong here.\"\n \n \"Well, St. Peter, you know I'm a born-again Christian. I pray every day. I'm very religious. I brought Bible study classes to the White House.\"\n \n \"That's terrific. And have you helped any lepers lately?\"\n \n \"Not exactly. But my cuts in the top tax rates will create wealth that will trickle down and help lepers. I'm getting there indirectly, instead of barging through the eye of a needle.\"\n \n \"Hmm.\"\n \n \"And St. Peter, I've been upstanding in defending Christian values. We made sure that we call the tree at the White House a Christmas tree, not a holiday tree. And we sent out 1.4 million White House Christmas cards!\"\n \n \"Wow! But I don't suppose any Christmas cards went to lepers. Or to prostitutes or beggars.\"\n \n \"I don't send cards to Democrats.\"\n \n \"Mr. President, our checklist doesn't have anything about sending out Christmas cards, or putting up Christmas trees. It's more about feeding the hungry, clothing the naked and housing the homeless.\"\n \n \"Well, my administration spent $8,000 for a drapery that was used for years to cover up a breast of a female statue. That was clothing the naked.\"\n \n \"That was so silly that Lady Godiva went on a ride to protest it. We always get irritated with religious blowhards who proclaim that faith is just a matter of covering up, saying grace, looking dour and denouncing others for being lax - the Taliban approach. This latest culture war over Christmas is a perfect example of religion based on denouncing others instead of loving them.\"\n \n \"But St. Peter, they're just trying to put Christ back into Christmas. They see how faith is threatened by people saying 'Happy Holidays,' instead of 'Merry Christmas.' Fox News has covered 'Christmas Under Siege,' and one of its anchors has a new book called 'The War on Christmas.' The American Family Association is boycotting Target, and the Catholic League threatened a boycott against Wal-Mart. This hasn't been my issue, but these are my people, St. Peter. They're doing this to glorify Christ.\"\n \n \"Frankly, Mr. President, here in Heaven, I say 'Merry Christmas,' but others prefer 'Happy Holidays.' Gandhi prefers it. And a Jewish rabbi told me that his family felt more comfortable with that as well. ...\"\n \n \"But St. Peter, that's one rabbi. ...\"\n \n \"Whose name is Jesus.\"\n \n \"Oops.\"\n \n \"Jesus says Christmas shouldn't be about picking fights and organizing boycotts. All that legalistic nitpicking just reminds him of the Pharisees. Do you really think that if Jesus returns to Earth tomorrow, his priority is going to be organizing a boycott of Target stores? You think he's going to appear on Fox to say, 'Worry about genocide and hunger later - first, let's battle with liberals over what holiday greeting to use'?\"\n \n \"But St. Peter, I increased aid to Africa hugely. I launched a major program to fight AIDS.\"\n \n \"Yes, your aid programs have been almost divine. And your administration helped lead the way in fighting sex trafficking. On the other hand, Jesus has a particular thing about genocide, and you and Congressional leaders just cut out $50 million that was supposed to go to stop the slaughter in Darfur.\"\n \n \"Sorry, but it's been so hectic this month with 26 Christmas parties at the White House. I've just been too busy to deal with genocide.\"\n \n \"Which Gospel did you say you read each day? Up here, we canceled our Christmas party, and held a vigil for the victims of Darfur.\" \n \n \"St. Peter, you don't mean to say - how do I ask this? Jesus isn't ... isn't a Democrat, is he?\"\n \n \"No, no. He's nonpartisan. His gripe isn't with conservatives or liberals; it's with blowhards. We're always cheering the National Association of Evangelicals because it spends its time fighting genocide, battling sex trafficking, struggling for religious freedom. And there are so many others, like Senator Sam Brownback, who win respect from everybody because their humanitarian work shows they are trying to live the Gospels, not play charades. They're the conservative Christians who make God look great.\"\n \n \"I guess I was just too busy with Christmas to pay attention to any of this.\"\n \n \"Up here, we just pray that Christmas could be more than cards, trees and greetings. Jesus is so upset that he's talking of suing the blowhards to regain control of Christmas.\" ", 
   {}, 
   184534, 
   null, 
   1134316680.0
  ], 
  [
   184573, 
   null, 
   "simone", 
   "http://www.nytimes.com/2005/12/11/politics/11detainee.html\n \n \nDecember 11, 2005\n Pentagon Expert on Detainees Plans to Leave for State Dept. \n By ERIC SCHMITT\n WASHINGTON, Dec. 10 - The Pentagon's chief adviser on detainee issues is leaving to take a high-level policy job at the State Department, administration officials said on Saturday. \n \n The adviser, Matthew C. Waxman, will become the principal deputy director of the department's policy planning staff, said administration officials who were granted anonymity because Mr. Waxman's new job had not been officially announced. \n \n Since filling a position created nearly two years ago to help correct the damage caused by the Abu Ghraib prisoner abuse scandal, Mr. Waxman has repeatedly clashed with top aides to Vice President Dick Cheney and senior Pentagon officials. These have included Stephen A. Cambone, the under secretary of defense for intelligence policy, and William J. Haynes II, the department's general counsel, who have pushed to limit the rights of terror suspects and other detainees. \n \n Several weeks ago, David S. Addington, who was then Mr. Cheney's counsel, assailed Mr. Waxman during a briefing, objecting to his insistence that a new set of Pentagon standards for handling terror suspects adopt language from the Geneva Conventions barring cruel, humiliating and degrading treatment. \n \n Colleagues and human rights advocates said that while Mr. Waxman had expressed frustration over the internal administration policy fights, he was not being forced out, and he had started lining up his new job at the State Department before his confrontation with Mr. Addington, who is now Mr. Cheney's chief of staff.\n \n \"He's tried very hard,\" said Elisa Massimino, Washington director of the advocacy group Human Rights First. \"But everybody recognized that he was having to go up against people who both outrank him and were deeply involved setting the policies that he was challenging.\" \n \n A Pentagon spokesman, Bryan Whitman, declined to comment on Mr. Waxman's departure. \n \n Mr. Waxman, as the deputy assistant secretary for detainee affairs, was a primary adviser to Defense Secretary Donald H. Rumsfeld on detainee matters and his point man for dealing with foreign governments and international organizations on the issue. \n \n He led an internal Pentagon committee of lawyers, intelligence officers and policy analysts to coordinate detention policies and practices, and was charged with ensuring that Red Cross inspection reports from American military prisons landed on Mr. Rumsfeld's desk promptly. \n \n Mr. Waxman, 33, a Bronx-born, Yale-educated lawyer, was a National Security Council official and a clerk to Justice David H. Souter. He is expected to assume his job at the State Department early next month.\nHmmm, interesting that the NYTimes is frightened of discussing the specifics of the clash.", 
   {
    "post_info": {
     "post_title": "Merry Torture and Happy Christmas!"
    }
   }, 
   184420, 
   null, 
   1134318540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Oh! The Hypocrisy!", 
  "url": "http://www.4forums.com/political/religion-debates/7035-oh-hypocrisy.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7035, 
  "discussion_files": [
   [
    "1495.html", 
    "http://www.4forums.com/political/religion-debates/7035-oh-hypocrisy-print.html"
   ]
  ], 
  "identifier": 7035
 }
]