[
 [
  [
   184579, 
   null, 
   "Obvious Child", 
   "What is the primary purpose of the Justice System, and what other factors should be considered.\n \n Should the emphasis be on rehabilitation, detering possible future criminals or punishing the guilty?", 
   {
    "post_info": {
     "post_title": "Purpose of the Justice System"
    }
   }, 
   null, 
   null, 
   1134322320.0
  ], 
  [
   184584, 
   null, 
   "oliphant", 
   "The purpose of the justice system is to deter crime. Everything else are by-products of that function.", 
   {}, 
   184579, 
   null, 
   1134330240.0
  ], 
  [
   184602, 
   null, 
   "Wez", 
   "I'd say it's a combination of rehabilitation, protecting society and detering future criminals (which would actually fall under protecting society).\n \n -Wez", 
   {}, 
   184584, 
   null, 
   1134340320.0
  ], 
  [
   184604, 
   null, 
   "oliphant", 
   "When I say that the purpose is to deter crime, it is important to take the next step and ask oneself: what is the purpose of deterring crime. Well, it is to make society safe. Obviously, if we only consider \"deterring crime\" we can justify life in prison for any tiny infraction. However, this would not fulfill the role of making society safe (the purpose of deterring crime), because we all know that everyone commits minor infractions all the time. Hence, the overarching purpose of deterring crime does not automatically suppose that any crime can receive any punishment, because its purpose would not be fulfilled.\n \n Rehabilitation is a very difficult key function to justify because there are no standards for knowing when a person is rehabilitated. This is why, when it happens, it is good, but we can never really make this a centerpiece purpose of our justice system. \n \n Punishment is merely the device that justice uses to deter future crime. If by punishment you mean \"get revenge,\" then no, getting revenge has nothing to do with justice.", 
   {}, 
   184602, 
   null, 
   1134341400.0
  ], 
  [
   260660, 
   null, 
   "andjustice4all", 
   "Depending on your perspective, the justice system attempts to accomplish a variety of goals. Ideally, our justice system is to hold people accountable for their actions and provide appropriate punishment to offenders for the sake of victims. However, as one who works in and extensively studies the justice system, my perspective is that our current justice system intends to \"get tough\" on criminals. This movement has existed for the past 25-30 years, and potentially will continue until the political pendulum sways to the other side. In theory and in practice, deterrence does not keep people from committing crimes. It sounds good, but it really doesn't work. Rehabilitation was a significant aspect of our justice system for most of the 20th century until the mid-1970s; the establishment of the \"get tough\" movement. Punishment is always going to be a central part of the justice system, but the type of philosophy that drives it will alter. Realistically, our justice system criminalizes offenders, which has led to mass imprisonment, drastic changes in drug, sex offender, and terrorist laws, and various disparities and a disproportion of minorities caught up in the system. Conservatives may disagree, but criminologists will not dispute!", 
   {
    "post_info": {
     "post_title": "the REAL purpose..."
    }
   }, 
   184604, 
   null, 
   1177742100.0
  ], 
  [
   260663, 
   null, 
   "Symbiote", 
   "The purpose of the justice system should be restitution. You break it, you buy it.\n \n \n \n Instead we have pointless prison sentences that serve neither the perpetrator of an act nor the victim, nor society in general which essentially pays for their welfare until they get out.\n \n To make it even worse, most crimes committed today for which prison sentences are involved don't even involve victims, they're mainly drug related.\n \n Of course, a justice system based on restitution is incompatible with the prohibition of victimless crimes, so it should be unsurprising that it isn't even considered.", 
   {}, 
   260660, 
   null, 
   1177743120.0
  ], 
  [
   260668, 
   null, 
   "gman", 
   "What is the primary purpose of the Justice System, and what other factors should be considered.\n \n Should the emphasis be on rehabilitation, deterring possible future criminals or punishing the guilty?\n\n \n All of the above. \n \n But, the system has instead become a powerful source of revenue.", 
   {}, 
   184579, 
   null, 
   1177769340.0
  ], 
  [
   260681, 
   null, 
   "snakespit", 
   "Realistically, our justice system criminalizes offenders, which has led to mass imprisonment, drastic changes in drug, sex offender, and terrorist laws, and various disparities and a disproportion of minorities caught up in the system. Conservatives may disagree, but criminologists will not dispute!\n\n \n For the most part I agreed with you, until you got to this. \n \n You say the justice system \"criminalizes offenders\". Well, if offenders is simply another term used for criminals, are you not simply stating that the justice system criminalizes criminals? I'm not sure I get that.\n \n A justice system that locks up most or almost all of it's criminals to me is not excessive...it is efficient. We should have tough laws on \"hard drugs\" and dealers, sex offenders, terrorists, violent fellons, et. al. As far as a disproportionate number of minorities being \"caught up in the system\" as you say, I can only say this: There would not be a disproportionate number caught up in the system if a disproportionate number did not commit most of the crimes.", 
   {}, 
   260660, 
   null, 
   1177774200.0
  ], 
  [
   260685, 
   null, 
   "andjustice4all", 
   "Snakespit, you obviously are not a student of criminology. The numerous results of the \"get tough\" movement that I noted in my previous post, which you responded to, are mere facts. They are not my opinion, but instead what the numbers and the trends have shown over the past 25 years. Maybe I should say this, getting tough on crime or criminals is not effective in reducing or preventing crime. Instead, it's simply creating a larger network of individuals in the system. The mass imprisonment of offenders in America is a huge issue, and we should all be concerned about it. Our methods of crime control and reduction have not worked very well; it's that simple.\n \n And in regards to the \"criminalization of offenders,\" I meant that our system has created a larger offender population (in prison or on probation/parole) by enacting laws, and punishments for breaking those laws, for particular offenses. For instance, the \"War on Drugs\" during the Reagan administration. Our society chose to \"get tough\" on drug related offenders and send them to prison for long periods of time. Boy, that's really been a great idea!emoticon_rolleyes \n \n I'm not even going to address the disproportionate number of minorities issue, because there are a lot of factors that contribute to this problem. However, the bottom line is that this fact is a result of our continued racism and discrimination in our society. Here we are a country that stresses equal rights for all, but the equality of rights for everyone is not practical.", 
   {}, 
   260681, 
   null, 
   1177775280.0
  ], 
  [
   260688, 
   null, 
   "James", 
   "\n And in regards to the \"criminalization of offenders,\" I meant that our system has created a larger offender population (in prison or on probation/parole) by enacting laws, and punishments for breaking those laws, for particular offenses. \n\n \n The law doesn't \"create a large population of offenders\". An offender is someone who breaks the law: he, and it's usually a \"he\", criminalises himself. Whether some people become offenders entirely by choice, or whether they are \"driven\" to crime by the \"system\" (whatever that is), has nothing to do with the concept of impartial justice. \n \n James.", 
   {}, 
   260685, 
   null, 
   1177776780.0
  ], 
  [
   260696, 
   null, 
   "daewoo", 
   "\n But, the system has instead become a powerful source of revenue.\n\n \n I agree with you 100% here and frankly I think it is dangerous as hell. When you run a for-profit justice system how do you know who is being prosecuted because they are a problem and need to be prosecuted and who is being prosecuted as a revenue source??", 
   {}, 
   260668, 
   null, 
   1177779540.0
  ], 
  [
   260767, 
   null, 
   "TrueKnowledge", 
   "I am also a professional in the field of criminology, as well as a lifetime student of criminology. (As it is an ever-chaging field)\n \n The primary goal of the justice system is to deter crime. What a wonderful world we would live in if the justice system actually worked toward this primary goal! \n The cold hard truth is that our justice system is first and foremost a business, and like any sucessful business, they employ tactics which help to ensure repeat customers.\n The number of minorities in prison population has little to do with racisim. There are instances where race is an issue, and sadly it does happen. However, other factors play a larger role than race. Individual rights are not an issue when it comes to this matter. Every offender recieves due process of the law. It is very rare that an American (regardless of race) does not recieve proper and fair due process. \n The justice system is far from perfect, but keep in mind that what we have, as shi**y as it is; is still better than any system we have had in the past.", 
   {
    "post_info": {
     "post_title": "professional opinion"
    }
   }, 
   260696, 
   null, 
   1177828020.0
  ], 
  [
   260773, 
   null, 
   "snakespit", 
   "And in regards to the \"criminalization of offenders,\" I meant that our system has created a larger offender population (in prison or on probation/parole) by enacting laws, and punishments for breaking those laws, for particular offenses. For instance, the \"War on Drugs\" during the Reagan administration. Our society chose to \"get tough\" on drug related offenders and send them to prison for long periods of time. Boy, that's really been a great idea!emoticon_rolleyes \n\n \n So let me see. We are creating the problem by writing and enacting laws that make certain deliterious acts \"illegal\" with certain punishments due, thereby creating a larger criminal population. I get it!!! If we simply made selling crack, raping kids, and knocking over liquor stores legal, then we would not have to label these poor people as criminals, and we would not be forced to lock them up in prisons. I must say, I'm almost ashamed that I did not think of such a simple and logical solution. Perhaps if I were a great student of criminology such as yourself, I might have been able to come up with that one. \n \n Just because we say we have a \"get tough\" policy on crime does not mean that we actually have gotten tough on crime. Most prisons and jails have become revolving door facilities that are looked upon more as an inconvenient detour for criminals. Criminals actually see this as a way of life, and don't mind going to prison for the 5th time. After all, they know that they will be out in a few months and free to continue selling drugs or strealing cars. I actually like a 3 strikes rule. 3rd felony conviction...Bam...life without parole. Great concept. \n \n Before we trash the \"get tough\" policy on crime...maybe we should actually give it a try.", 
   {}, 
   260685, 
   null, 
   1177835160.0
  ], 
  [
   260819, 
   null, 
   "TrueKnowledge", 
   "So let me see. We are creating the problem by writing and enacting laws that make certain deliterious acts \"illegal\" with certain punishments due, thereby creating a larger criminal population. I get it!!! If we simply made selling crack, raping kids, and knocking over liquor stores legal, then we would not have to label these poor people as criminals, and we would not be forced to lock them up in prisons. I must say, I'm almost ashamed that I did not think of such a simple and logical solution. Perhaps if I were a great student of criminology such as yourself, I might have been able to come up with that one. \n \n Just because we say we have a \"get tough\" policy on crime does not mean that we actually have gotten tough on crime. Most prisons and jails have become revolving door facilities that are looked upon more as an inconvenient detour for criminals. Criminals actually see this as a way of life, and don't mind going to prison for the 5th time. After all, they know that they will be out in a few months and free to continue selling drugs or strealing cars. I actually like a 3 strikes rule. 3rd felony conviction...Bam...life without parole. Great concept. \n \n Before we trash the \"get tough\" policy on crime...maybe we should actually give it a try.\n\n \n The problem is not criminalizing offenders. Instead it has to do with the sentencing policies. .....A first time non-violent drug offender (who can be rehabilitated) gets a 3-15 year sentence.....Meanwhile in the same court a pedophile (who CANNOT be rehabilitated) gets 6 mos-1yr......now it does not take a rocket scientist or even a criminologist to see that something is terribly wrong with this picture..........No one is saying that certain crimes should be legalized.....you miss the point..........When speaking from a criminologist point of view the actual crime it not what is important....instead we look at what CAUSED the offender to commit the crime, how can we change the system and change the social conditions so that the crime rates actually drop. Punishment is meant to deter crime.....it is not difficult to see that this policy is not working. ......I am not bashing the system....I am just saying that there are some major problems with it.\n The 3 strikes law is fine for serious felons who cannot be rehabilitated.....however I think that FIRST the corrections industry should actually TRY rehabilitation methods....(the word rehabilitation does not even apply to our current corrections system..it is a complete sham)...A strict, get tough, no exceptions policy would eventually lead to a loss of constitutional rights....when that happens we would be living in a police state...When you begin changing laws that deal with our constitutional rights it is a tricky business.....it opens up the door for changes that will affect you an me...not just criminal offenders.", 
   {}, 
   260773, 
   null, 
   1177866600.0
  ], 
  [
   260824, 
   null, 
   "andjustice4all", 
   "Before we trash the \"get tough\" policy on crime...maybe we should actually give it a try.\n\n \n We are obviously not going to agree on this issue, but that's what makes the freedom of speech great. However, I should encourage you to ground your opinion in empirical research and theory, because you would have a much more respectable opinion. It seems that you are simply forming your opinion on what seems logical and practical. But, some things that may seem logical (e.g., sending offenders to prison for long periods of time in hopes of reducing recidivism) don't necessarily work. And in regards to your last statement, we have given \"get tough\" policy a chance to work for the past 25-30 years. We have seen, and experienced, the flaws in that ideology.\n \n \nI am also a professional in the field of criminology, as well as a lifetime student of criminology. (As it is an ever-chaging field)\n\n \n Just curious, may I ask what your role/position is in the field? Lawyer?\n \n \nThe primary goal of the justice system is to deter crime. What a wonderful world we would live in if the justice system actually worked toward this primary goal! \n The cold hard truth is that our justice system is first and foremost a business, and like any sucessful business, they employ tactics which help to ensure repeat customers.\n The number of minorities in prison population has little to do with racisim. There are instances where race is an issue, and sadly it does happen. However, other factors play a larger role than race. Individual rights are not an issue when it comes to this matter. Every offender recieves due process of the law. It is very rare that an American (regardless of race) does not recieve proper and fair due process. \n The justice system is far from perfect, but keep in mind that what we have, as shi**y as it is; is still better than any system we have had in the past. \n\n \n You say the primary goal of justice is to deter crime. That is a very arguable opinion. There are many other philosophies of punishment that the American justice system commonly employs, such as retribution, restitution, and incarceration. I would argue that it's not just one philosophy that serves as the primary goal, but multiple philosophies. That is one reason for its complexity.\n \n There are other statements that you made that shows you have a sensible understanding of the justice system. You're right, it is a business! For example, have you ever attended the American Correctional Association's annual meeting? I have not, but I have heard that it's nothing more than a large venue for private business marketing. \n \n Also, I agree with you in regards to the racism issue in that there are other factors at play here. Maybe I made too bold of statements previously. Socio-economic conditions and geographical locations also play a role. However, my point is we know that the people who live in the urban, impoverished areas of cities, where a lot of street crimes are committed, are mainly minorities. Unfortunately, a lot of children grow up in a primary social environment that condones crime. \n \n Lastly, c'mon now, we all know that not every offender receives due process rights as the book states they should. People make mistakes, even judges and lawyers. The issue is that the people who have mistakes in their judicial proceedings don't have the appropriate resources to help advocate the appeal process. Yes, there are some advocacy groups that help inmates file for appeals in their cases, and inmates help one another in prison (e.g., jailhouse lawyers). However, we know that many litigation cases are not won in defense for the inmates (2% success rate). In my opinion, I believe the system is too prideful at times to admit to mistakes. This opens a whole new can of problems, ya know?", 
   {}, 
   260767, 
   null, 
   1177869660.0
  ], 
  [
   260843, 
   null, 
   "Shooterandproud", 
   "What is the primary purpose of the Justice System, and what other factors should be considered.\n \n Should the emphasis be on rehabilitation, detering possible future criminals or punishing the guilty?\n\n \n I believe that the sole purpose of the justice system should be rehabilitation primarily, and crime deterrant as a secondary function. It should never be used to punish unless the punishment works as a deterrent or a rehab tool.", 
   {}, 
   184579, 
   null, 
   1177882380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Purpose of the Justice System", 
  "url": "http://www.4forums.com/political/crime-debates/7040-purpose-justice-system.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 7040, 
  "discussion_files": [
   [
    "9643.html", 
    "http://www.4forums.com/political/crime-debates/7040-purpose-justice-system-print.html"
   ], 
   [
    "9644.html", 
    "http://www.4forums.com/political/crime-debates/7040-purpose-justice-system-2-print.html"
   ]
  ], 
  "identifier": 7040
 }
]