[
 [
  [
   185957, 
   null, 
   "pandion", 
   "Gene implicated in human pigment variation\n \n It is interesting to note that the two identified alleles differ by a single point mutation. That mutation resulted in reduced production of melanin and therefore, white skin. In Europe, where there was less sunlight that resulted in increased sensitivity to sunlight and therefore increased production of vitamin D, and therefore, decreased rickets. That may have been the selective advantage to the mutation. It may also have been subject to increased sexual selection.\n \n Of course, according to creationists, this mutation which resulted in two alleles in the human genome where there had previously been one is a reduction in \"information.\" Everyone knows that 2 is less than 1.", 
   {
    "post_info": {
     "post_title": "Gene implicated in human pigment variation"
    }
   }, 
   null, 
   null, 
   1134834240.0
  ], 
  [
   186041, 
   null, 
   "DamEtel", 
   "Of course, according to creationists, this mutation which resulted in two alleles in the human genome where there had previously been one is a reduction in \"information.\" Everyone knows that 2 is less than 1.\n\n \n And/or, that it must have been Almighty God himself who zapped that little DNA nucleotide, because we all know that beneficial mutations never occur naturally :-)\n \n \n I liked this part, which is yet another link showing relatedness between humans and fish. Creationists just hate this kind of evidence.\n \n \nUsing positional cloning, the researchers isolated slc24a5 as the gene responsible for the golden phenotype in zebrafish and pinpointed its mutation as a stop codon that truncates the translated protein by 40%. BLAST searches confirmed their suspicion that this zebrafish gene has a closely related counterpart not only in many other vertebrates but in humans, with 69% sequence homology.\n \n When the researchers injected human slc24a5 mRNA into golden zebrafish embryos, the wild type stripes were restored. The results showed that the gene's function has been conserved over vertebrate evolution, what Barsh called a perfect demonstration \"that nature doesn't reinvent the wheel.\"\n", 
   {}, 
   185957, 
   null, 
   1134844380.0
  ], 
  [
   186602, 
   null, 
   "beervolcano", 
   "I thought races were created at the Tower of Babel, not by a loss of genetic information. Oh wait, of course, that's how the FSM did it, but the Christians have it all wrong. This mutation was not created by His Noodly Appendage at the Tower of Babel at all. It was the Pillar of Barilla. Must be an old mistranslation.", 
   {}, 
   186041, 
   null, 
   1135048320.0
  ], 
  [
   188140, 
   null, 
   "SkepticGunt", 
   "Indeed, Fellow Pastafarian, will those christians ever learn?:\n \n And indeed, DamEtel, fellow skeptic, will they ever learn? The answer is no.\n \n So... cheers.emoticon_xhoho", 
   {}, 
   186602, 
   null, 
   1135645320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gene implicated in human pigment variation", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/7097-gene-implicated-human-pigment-variation.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 7097, 
  "discussion_files": [
   [
    "24532.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/7097-gene-implicated-human-pigment-variation-print.html"
   ]
  ], 
  "identifier": 7097
 }
]