[
 [
  [
   186254, 
   null, 
   "Eddie", 
   "The Rhineland Model (can be found in countries like Austria, Belgium France, Germany and Luxembourg)\n \n The idea behind the Rhineland model is that it poses a balance between free market-forces and social and enviromental responsibility. Social justice cannot be attained through market forces only, but must be guaranteed by society. Cooperation rather than competition is the keyword. Economic security before economic flexibility. The model has basicly four elements;\n \n The market economy\n Market ecoomy is the prefered economic system due to it`s ability to assign resources efficiently and creating wealth. It also offers a general social justice that is based on hard work and thrivtyness. But the free market cannot be trusted to provide perfect social justice or assign resources optimally in all cases. Therefor:\n \n Interventions by the state\n State intervention can be in order to prevent massive social injustices in the wake of an economic schock. It can also be used to preserve productive companies, factories and sectors during times of trouble. The state finances are affected by the performance and the direction of the economy, therefor the state also have stakes in the economy and should be expected to take it`s responsibility. By encouraging long-term investments and technological improvements, the state can increase the long term performance of the economy, while share-holder companies only seek short-term profits that may endanger the long term performance. Infrastructure investments, city.planning and even subsidies and taxes are tools to be utilized in order to achieve optimal economic performance. \n \n Inteventions on the labour market is also necessary to create just working conditions for workers. It is also a tool to decrease costly unemployment figures as well as encourage highly productive enterprises and discourage low productive enterprises.\n \n A social security system \n Society has a social responsibility towards it`s populace and should honour this responsibility through ensuring that it`s citizens are protected from the worst aspects of predatory-capitalism. Unemployment benefits and wellfare payments to the poor and destitute should be a responsibility shouldered by all, hence the mandatory payment of social insurance. This security will also make individuals more willing to take risks, to invest and to better themselves. After all, they know that if they fall, society will be there to catch them.\n \n Active government polycies designed to increase matching processes between unemployed and employers are to be construed. As are reeducation- and relocation programs. \n \n Consultation between employers and employees. \n In the Anglo-Saxon model, companies are run by \"shareholders\". In the Rhineland model, companies should be run by \"stakeholders\", such as the owners, government, employees and customers. By encouraging influence from every party involved, one can achieve a better situation for everyone. By working together, instead of against eachother, costly boycots, strikes and lockouts can be avoided. \n \n A bit shorter than the Anglo-Saxon model, but I think you get the drift (I had to piece together information from many various websites in order to explain the Rhineland model). And just like in my thread on the Anglo-Saxon model, I ask you to discuss the accuracy of the model and wether you agree with it`s views or not. I`ll probably add a third model soon, the nordic model.\n \n Link to the Anglo-Saxon model thread. Feel free to quote things from that one as well (ie; considers these two threads one and the same)\n \n http://4forums.com/political/showthread.php?t=7105", 
   {
    "post_info": {
     "post_title": "The Rhineland Model"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1134933840.0
  ], 
  [
   410460, 
   null, 
   "jackvandijk", 
   "This model was also taught by Dr. Jan Pen, Dutch economist. The Rhineland model is used in The Netherlands and is anchored in the law.\n \n The countries using this model are The Netherlands, Denmark, Austria, Germany, while countries like Japan France and Canada also have a certain restriction on the excesses of management. (Interesting enough, all these countries are getting out of the economic recession before the countries with a one-tier system).", 
   {
    "post_info": {
     "post_title": "The Rhineland model"
    }
   }, 
   186254, 
   null, 
   1282504320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Rhineland Model", 
  "url": "http://www.4forums.com/political/economics-debates/7106-rhineland-model.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 7106, 
  "discussion_files": [
   [
    "16045.html", 
    "http://www.4forums.com/political/economics-debates/7106-rhineland-model-print.html"
   ]
  ], 
  "identifier": 7106
 }
]