[
 [
  [
   186397, 
   null, 
   "coolcodemn3", 
   "we need more pro gun control advocates on this forum, there are nto enough and this is such a good debate topic. I think we shoot them down so much they gave up", 
   {
    "post_info": {
     "post_title": "we need more pro-gun control advocates"
    }
   }, 
   null, 
   null, 
   1134980820.0
  ], 
  [
   186464, 
   null, 
   "Adept", 
   "If only that were the case. It's pretty easy to 'shoot down' an anti, since they rarely have any kind of evidence to support their emotional claims that guns are bad.\n \n I was engaged via private message on another forum by a user (who regularly boasted of his recreational drug use) who insisted guns were bad. When challenged with stats from the British Home Office (the person in question was a Briton) he replied something along the lines of 'Well, I don't care any more'. Which I considered odd, as it was he who initiated the debate. Given that, and other comments during our brief correspondence, I concluded that he could not reconcile the stats with his stance (the fact that rape, homicide, violent assault and theft all increased while rates of firearm ownership decreased, and the police themselves were dis-armed) and simply refused to admit his position may have been poorly informed.", 
   {}, 
   186397, 
   null, 
   1135017120.0
  ], 
  [
   186557, 
   null, 
   "zachvac", 
   "Wait, I think you 2 agree, as do I. The original poster said they wanted more pro-gun CONTROL people so he could shoot their argument down, right? I think a better debate would be when should gun control start? Some people advocate for citizens owning atomic bombs, but most people draw a line somewhere, where do you draw the line. Note that those advocating allowing atomic bombs to be owned by citizens would be the ones correct by the Constitution.", 
   {}, 
   186464, 
   null, 
   1135042500.0
  ], 
  [
   186579, 
   null, 
   "Truthsayer", 
   "I'm for gun control. I believe you should have a steady hand, firm grip, calm breath, and a smooth pull. The more control, the better the shot.emoticon_xkill", 
   {}, 
   186557, 
   null, 
   1135045680.0
  ], 
  [
   186856, 
   null, 
   "coolcodemn3", 
   "I'm for gun control. I believe you should have a steady hand, firm grip, calm breath, and a smooth pull. The more control, the better the shot.emoticon_xkill\n\n and al shots in the ten range. And in response to Zachvac i mean guns not arms (as in nukes) but im fine with automatics and such in the right hands.", 
   {}, 
   186579, 
   null, 
   1135128180.0
  ], 
  [
   186861, 
   null, 
   "zachvac", 
   "and al shots in the ten range. And in response to Zachvac i mean guns not arms (as in nukes) but im fine with automatics and such in the right hands.\n\n \n That wasn't my question. My question wasn't what you said, but what you believed. You sort of answered that. But the same people spouting off about the second ammendment being the reason for guns should also be for it defending your right to a nuclear bomb.", 
   {}, 
   186856, 
   null, 
   1135128660.0
  ], 
  [
   186895, 
   null, 
   "Bryan", 
   "I disagree with the irrational \"nuke ownership\" interpretation. I have always argued for an individual RKBA interpretation of the 2nd. Amendment. Yet I have never made the absurd argument that it cannot be limited and that I should be permitted to own a nuke. This has been a favorite sham argument marketed by gun control supporters for years. The argument suggests that since the Amendment contains no limitation we cannot dare interpret it to be an individual right. The result would be the horror of \"rednecks with nukes,\" they say. The illogic is obvious when you attempt to apply it to other unqualified rights.\n \n For example, if we accept that the equally unqualified 1st. Amendment protects an individual right to free exercise of religion, then must we also be prepared to accept the currently forbdden practice of appeasing the gods with human sacrifice? Absolutely not. \n \n Although unqualified, each of these rights is subject to rational limitation. The real question is where to strike the balance.", 
   {
    "post_info": {
     "post_title": "I believe the RKBA is indiviudal and limited...."
    }, 
    "unicode_changes_made": true
   }, 
   186861, 
   null, 
   1135138980.0
  ], 
  [
   187249, 
   null, 
   "zachvac", 
   "I disagree with the irrational \"nuke ownership\" interpretation. I have always argued for an individual RKBA interpretation of the 2nd. Amendment. Yet I have never made the absurd argument that it cannot be limited and that I should be permitted to own a nuke. This has been a favorite sham argument marketed by gun control supporters for years. The argument suggests that since the Amendment contains no limitation we cannot dare interpret it to be an individual right. The result would be the horror of \"rednecks with nukes,\" they say. The illogic is obvious when you attempt to apply it to other unqualified rights.\n \n For example, if we accept that the equally unqualified 1st. Amendment protects an individual right to free exercise of religion, then must we also be prepared to accept the currently forbdden practice of appeasing the gods with human sacrifice? Absolutely not. \n \n Although unqualified, each of these rights is subject to rational limitation. The real question is where to strike the balance.\n\n \n yes, that's the big question. I get really angry when people try to say that profanity or flag burning isn't \"protected speech\", but it isn't that far from threats. Both are against the actual wording of the amendment.\n \n As for the nukes with the second ammendment. I have heard many argue that we should own them mainly because the government does. They argue that the second amendment allows the people the power of weapons so that if the government intrudes on their rights they can defend themselves. They feel that they should have at least as powerful a weapon as the government does.\n \n But I don't agree with that, because as much distrust I have for the government, I REALLY don't trust the average joe owning a nuclear weapon. I play my music a bit too loud for my neighbor's liking, uh oh, I better hide.", 
   {
    "unicode_changes_made": true
   }, 
   186895, 
   null, 
   1135229220.0
  ], 
  [
   187283, 
   null, 
   "coolcodemn3", 
   "That wasn't my question. My question wasn't what you said, but what you believed. You sort of answered that. But the same people spouting off about the second ammendment being the reason for guns should also be for it defending your right to a nuclear bomb.\ni believe i said that im fine with people owning automatics, and i also think that that is my opinion is it not? and a nuclear bomb is not a gun its a bomb ,so i dont support the ownership of nuclear bombs.", 
   {}, 
   186861, 
   null, 
   1135239120.0
  ], 
  [
   187303, 
   null, 
   "Justawoman", 
   "I'm for gun control. I believe you should have a steady hand, firm grip, calm breath, and a smooth pull. The more control, the better the shot.emoticon_xkill\n\n \n \n Very well put. emoticon_xhoho", 
   {}, 
   186579, 
   null, 
   1135261140.0
  ], 
  [
   187432, 
   null, 
   "emclean", 
   "there is a big diffrance between a nuke and a gun, the nuke can kill just by sitting in the same room with you, a gun cant. weapons that fuction with out direct and imediet action IMO should be kept out of the hands of the genirial population. a gun need the trigger pulled to fuction, a landmine, or nuke will kill with out that.", 
   {}, 
   187303, 
   null, 
   1135301040.0
  ], 
  [
   187440, 
   null, 
   "coolcodemn3", 
   "also there is no barrel/muzzle ,stock, grip ,iron sights. etc", 
   {}, 
   187432, 
   null, 
   1135302720.0
  ], 
  [
   187443, 
   null, 
   "georged", 
   "there is a big diffrance between a nuke and a gun, the nuke can kill just by sitting in the same room with you, a gun cant. weapons that fuction with out direct and imediet action IMO should be kept out of the hands of the genirial population. a gun need the trigger pulled to fuction, a landmine, or nuke will kill with out that.\n\n \n In one form or another, all require a 'trigger'.", 
   {}, 
   187432, 
   null, 
   1135304100.0
  ], 
  [
   187559, 
   null, 
   "emclean", 
   "In one form or another, all require a 'trigger'.\n\n the nuke dose not, the radition will kill just sitting there.\n \n that is why i used the quilifer of \"with out direct and imediet action\". a gun if fired onlt when some one holding it pulls the trigger, a land mine kills when the person who set it has left and there has no controle over who detonates it.", 
   {}, 
   187443, 
   null, 
   1135355940.0
  ], 
  [
   187579, 
   null, 
   "georged", 
   "the nuke dose not, the radition will kill just sitting there.\n \n that is why i used the quilifer of \"with out direct and imediet action\". a gun if fired onlt when some one holding it pulls the trigger, a land mine kills when the person who set it has left and there has no controle over who detonates it.\n\n \n All shielded, or flight crews/submarines/surface ships would be unable to store them. The detonator, or trigger creates a small implosion that starts the chain reaction.", 
   {}, 
   187559, 
   null, 
   1135358400.0
  ], 
  [
   187608, 
   null, 
   "emclean", 
   "The detonator, or trigger creates a small implosion that starts the chain reaction.\n\n or there is a \"gun\" used to accelarate a little more into a sub-critical mass. i understand how they fuction.\n \n \nAll shielded, or flight crews/submarines/surface ships would be unable to store them.\n\n i have not said they can not be stored safly, i state that they CAN kill without being set off, the materials used to make them are deadly through raditation and the hazards of all heavy metal.", 
   {}, 
   187579, 
   null, 
   1135369380.0
  ], 
  [
   203031, 
   null, 
   "Galileo", 
   "If only that were the case. It's pretty easy to 'shoot down' an anti, since they rarely have any kind of evidence to support their emotional claims that guns are bad.\n \n I was engaged via private message on another forum by a user (who regularly boasted of his recreational drug use) who insisted guns were bad. When challenged with stats from the British Home Office (the person in question was a Briton) he replied something along the lines of 'Well, I don't care any more'. Which I considered odd, as it was he who initiated the debate. Given that, and other comments during our brief correspondence, I concluded that he could not reconcile the stats with his stance (the fact that rape, homicide, violent assault and theft all increased while rates of firearm ownership decreased, and the police themselves were dis-armed) and simply refused to admit his position may have been poorly informed.\n\n http://www.homeoffice.gov.uk/rds/pdfs2/hosb703.pdf\n It doesn't look like the UK has been doing too bad. Crime has actually been decreasing.", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   186464, 
   null, 
   1142686200.0
  ], 
  [
   211920, 
   null, 
   "Jeffersonian", 
   "we need more pro gun control advocates on this forum, there are nto enough and this is such a good debate topic. I think we shoot them down so much they gave up\n\n \n This is a free market of ideas. The good ones survive. The bad one die like dinosaurs.", 
   {
    "post_info": {
     "post_title": "ideas"
    }
   }, 
   186397, 
   null, 
   1147165140.0
  ], 
  [
   232924, 
   null, 
   "D0ntg0m0ng", 
   "i dont really know much about gun control but from what i have read it seems like guns are necessary for a milita to function and a nuke is not", 
   {
    "post_info": {
     "post_title": "?"
    }
   }, 
   187579, 
   null, 
   1159479840.0
  ], 
  [
   232925, 
   null, 
   "D0ntg0m0ng", 
   "would it be easier to write an essay pro or con on the gun control topic", 
   {
    "post_info": {
     "post_title": "question"
    }
   }, 
   232924, 
   null, 
   1159479900.0
  ], 
  [
   233950, 
   null, 
   "Count Otto", 
   "i dont really know much about gun control but from what i have read it seems like guns are necessary for a milita to function \n\n \n As are some sort of means of destroying armour - RPG's at the very least I should think - and presumably some sort of anti-aircraft ability - Stingers maybe?\n \n The right to bear arms at the inception of the constitution would have granted the people an equal technology to the army of the day. Today it does nothing like that. 'The People' could do much more damage to a government by refusing to do anything it wanted. A general strike (cf UK in the '70's), road blockades (cf France anytime the farmers get annoyed) etc.\n \n I'm from the UK so I really have no qualms with people in the US having guns (except inasmuch as the majority of our illegal weapons come from you guys). Good luck to you. I just question the veracity of some of the arguments used to justify them.", 
   {}, 
   232924, 
   null, 
   1160151360.0
  ], 
  [
   233979, 
   null, 
   "emclean", 
   "I just question the veracity of some of the arguments used to justify them.\n\n with your being a subject, i understand how you do not understand freedom. as a subject you are subject to the whims of your leaders, and by and large they are good leaders. but if the goverment would want to break a strike with violance, you would end it, and do as ordered. you would lack the abilty to effectivly fight back. i would think it would not be too hard to bring in troops from say Ireland (where they would not be likly to be symphatic) and seaze the few firearms in homes. \n as a citizen if the same were to happen here, we would be able to meet force with force. assueming the same scenario, we would be able to resist. before you tell me there is no way for a bunch of civilians couldn't beat the armed forces, let me remind you it happens, from the resistance during WWII, to Iraq today.\n \n no it is not likley to happen in the forceable future, but neather was the rise of Hitler forceable in 1920.", 
   {}, 
   233950, 
   null, 
   1160162520.0
  ], 
  [
   234033, 
   null, 
   "Shooterandproud", 
   "with your being a subject, i understand how you do not understand freedom. as a subject you are subject to the whims of your leaders, and by and large they are good leaders. but if the goverment would want to break a strike with violance, you would end it, and do as ordered. you would lack the abilty to effectivly fight back. i would think it would not be too hard to bring in troops from say Ireland (where they would not be likly to be symphatic) and seaze the few firearms in homes. \n as a citizen if the same were to happen here, we would be able to meet force with force. assueming the same scenario, we would be able to resist. before you tell me there is no way for a bunch of civilians couldn't beat the armed forces, let me remind you it happens, from the resistance during WWII, to Iraq today.\n \n no it is not likley to happen in the forceable future, but neather was the rise of Hitler forceable in 1920.\n\n Couldnt have said it better myself.", 
   {}, 
   233979, 
   null, 
   1160187780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  we need more pro-gun control advocates", 
  "url": "http://www.4forums.com/political/gun-control-debates/7109-we-need-more-pro-gun-control-advocates.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 7109, 
  "discussion_files": [
   [
    "10842.html", 
    "http://www.4forums.com/political/gun-control-debates/7109-we-need-more-pro-gun-control-advocates-print.html"
   ], 
   [
    "10843.html", 
    "http://www.4forums.com/political/gun-control-debates/7109-we-need-more-pro-gun-control-advocates-2-print.html"
   ]
  ], 
  "identifier": 7109
 }
]