[
 [
  [
   186800, 
   null, 
   "MrWriteLA", 
   "Pentagon Labels Gay Kiss-In a 'Credible Threat' \n \n WASHINGTON, DC - According to recent press reports, Pentagon officials have been spying on what they call \"suspicious\" meetings by civilian groups, including student groups opposed to the military's \"Don't Ask, Don't Tell\" ban on lesbian, gay and bisexual military personnel. The story, first reported by Lisa Myers and NBC News last week, noted that Pentagon investigators had records pertaining to April protests at the State University of New York at Albany and William Patterson College in New Jersey. A February protest at NYU was also listed, along with the law school's LGBT advocacy group OUTlaw, which was classified as \"possibly violent\" by the Pentagon. A UC-Santa Cruz \"Don't Ask, Don't Tell\" protest, which included a gay kiss-in, was labeled as a \"credible threat\" of terrorism.\n Servicemembers Legal Defense Network (SLDN) condemned the Pentagon surveillance and monitoring. \"The Pentagon is supposed to defend the Constitution, not turn it upside down,\" said SLDN executive director C. Dixon Osburn. \"Students have a first amendment right to protest and Americans have a right to expect that their government will respect our constitutional right to privacy. To suggest that a gay kiss-in is a 'credible threat' is absurd, homophobic and irrational. To suggest the Constitution does not apply to groups with views differing with Pentagon policy is chilling.\"\n \n In January, the Department of Defense confirmed a report that Air Force officials proposed developing a chemical weapon in 1994 that would turn enemies gay. The proposal, part of a plan from Wright Air Force Base in Dayton, Ohio, was to develop \"chemicals that effect (sic) human behavior so that discipline and morale in enemy units is adversely effected (sic). One distasteful but completely non-lethal example would be strong aphrodisiacs, especially if the chemical also caused homosexual behavior.\" SLDN also condemned that report, and the Pentagon later said it never intended to develop the program.\n \n \"The Pentagon seems to constantly find new and more offensive ways to demean lesbian, gay, bisexual and transgender people,\" said Osburn. \"First, we were deemed unfit to serve our country, despite winning wars, medals and the praise of fellow service members. Then, our sexual orientation was suggested as a means to destabilize the enemy. Now, our public displays of affection are equated with al Qaeda terrorist activity. It is time for new Pentagon policy consistent with the views of 21st century America.\"\n http://www.sldn.org/templates/press/record.html?record=2563", 
   {
    "post_info": {
     "post_title": "The government is spying on gays"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1135115880.0
  ], 
  [
   186803, 
   null, 
   "BobNelson2", 
   "http://www.sldn.org/templates/press/record.html?record=2563\n\n \n Well, at least now we know why the Bush administration didn't just follow existing law and get secret FISA warrants. These wouldn't have been approved, since they have nothing to do with the \"war on terrorism\".", 
   {}, 
   186800, 
   null, 
   1135116360.0
  ], 
  [
   186815, 
   null, 
   "tonybrown74", 
   "Well, at least now we know why the Bush administration didn't just follow existing law and get secret FISA warrants. These wouldn't have been approved, since they have nothing to do with the \"war on terrorism\".\n\n \n Well, that much is obvious. I am still trying to grapple with this (and the outrage I feel over the lack of outrage in the media). My god! I wasn't even born in the US and I feel so outraged over this.\n \n What is shocking in my mind is that there are people that are defending this president's actions.", 
   {}, 
   186803, 
   null, 
   1135121100.0
  ], 
  [
   186850, 
   null, 
   "beervolcano", 
   "I wonder if the FBI is monitoring white supremacist groups too.\n Like these.\n \n Or maybe this one.\n \n But then, why would they, they are merely upholding the Biblical doctrine of \"no race mixing.\" Bush likes the Bible.", 
   {}, 
   186815, 
   null, 
   1135127160.0
  ], 
  [
   186865, 
   null, 
   "JPSartre12", 
   "http://www.sldn.org/templates/press/record.html?record=2563\n\n \n I don't think the article gave me enough information to fein outrage. \n I'd like to know HOW they spied on the meetings? Were these public events? If so, what makes them any different from the FBI's monitoring of anti-war protests in the 60's and early 70's? Did they do anything illegal or were they just present at the events?\n I'm certainly not going to take the spin from a gay website with a political axe to grind as Gospel. emoticon_xdonno", 
   {}, 
   186800, 
   null, 
   1135129560.0
  ], 
  [
   186867, 
   null, 
   "joebrummer", 
   "I don't think the article gave me enough information to fein outrage. \n I'd like to know HOW they spied on the meetings? Were these public events? If so, what makes them any different from the FBI's monitoring of anti-war protests in the 60's and early 70's? Did they do anything illegal or were they just present at the events?\n I'm certainly not going to take the spin from a gay website with a political axe to grind as Gospel. emoticon_xdonno\n\n \n \n I am actually with JP here. Were they also checking in with the anti-gay groups who are more extreme like repent america or the westboro baptist church. \n \n I am not sold on the whole spying thing. From what I have read and learned I don't see it as that big of a deal It only seems to be a big deal if you are doing something illegal!", 
   {}, 
   186865, 
   null, 
   1135129800.0
  ], 
  [
   186896, 
   null, 
   "BobNelson2", 
   "If so, what makes them any different from the FBI's monitoring of anti-war protests in the 60's and early 70's?\n\n \n Well, there's been no indication of government infiltrators trying to incite violence at any of the subversive kiss-ins. Is that the sort of thing you're wondering about?", 
   {}, 
   186865, 
   null, 
   1135139400.0
  ], 
  [
   186911, 
   null, 
   "JPSartre12", 
   "Well, there's been no indication of government infiltrators trying to incite violence at any of the subversive kiss-ins. Is that the sort of thing you're wondering about?\n\n \n If they're just hanging around amongst the minions, that's perfectly legal and not spying. After all, freedom of assembly also applies to Federal agents. :)", 
   {}, 
   186896, 
   null, 
   1135143780.0
  ], 
  [
   186914, 
   null, 
   "zachvac", 
   "I agree. The \"spying\" wasn't illegal. The one slight problem I have is with this:\n \n \"A UC-Santa Cruz \"Don't Ask, Don't Tell\" protest, which included a gay kiss-in, was labeled as a \"credible threat\" of terrorism.\"\n \n Labeling it a credible threat of terrorism. I don't care whether they do that to anti-gay groups as well, it's simply not true. Of course there could be other evidence not given that could lead to this being something to do with terrorism, and labelling it as such isn't illegal even if it isn't a credible threat. Unless there is more information, I fail to see this as a huge outrage.", 
   {
    "unicode_changes_made": true
   }, 
   186911, 
   null, 
   1135146180.0
  ], 
  [
   186922, 
   null, 
   "BobNelson2", 
   "If they're just hanging around amongst the minions, that's perfectly legal and not spying. After all, freedom of assembly also applies to Federal agents. :)\n\n \n Were it so simple. For the agents to \"freely assemble\" among us they, or their superiors, must conclude that we are some sort of threat. Would that make you feel loved?\n \n On a side note, I'm always surprised at how \"conservatives\", normally so worried about government waste, take such a waste of taxpayer dollars so glibly. FBI investigating kiss-ins? Joining subversive \"terrorist\" XXXX biker groups?", 
   {}, 
   186911, 
   null, 
   1135155540.0
  ], 
  [
   186944, 
   null, 
   "JPSartre12", 
   "Were it so simple. For the agents to \"freely assemble\" among us they, or their superiors, must conclude that we are some sort of threat. Would that make you feel loved?\n\n To be honest, I don't lose any sleep wondering if the FBI loves me or not. It never crosses my mind.\n Post 9-11, it's not uncommon for the Feds to show up at all sorts of gatherings. For example, I fly rockets as a hobby. I belong to several rocket clubs and attend organized launches throughout the Midwest. It's not uncommon for us to see Feds also attending these launches, despite the fact that rocketeers are typically fiercely patriotic and possess Federal Licenses requiring FBI fingerprinting, including personal annual visits by the BATFE. \n \n\n On a side note, I'm always surprised at how \"conservatives\", normally so worried about government waste, take such a waste of taxpayer dollars so glibly. FBI investigating kiss-ins? Joining subversive \"terrorist\" XXXX biker groups?\n\n \n I'd rather see the Feds spend money on increased domestic security than spending it trying to be politically correct or burning out religious cults. \n Did you ever stop for a second and think that maybe the Feds presence was to protect the crowd from possible outside harm?", 
   {}, 
   186922, 
   null, 
   1135177980.0
  ], 
  [
   186946, 
   null, 
   "Truthsayer", 
   "Perhaps a necessary evil, sad to say.\n \n I think what bothers a lot of people is witnessing our society evolving in front of our very eyes towards authoritarian control and jack-boot mentality. The Federal agencies are starting to appear more and more each day to mildly mirror the likes of the KGB and SS. This trend scares and angers a lot of people. Others don't seem to mind at all.\n \n To some degree, who can deny, the terrorist's have won.:(", 
   {}, 
   186944, 
   null, 
   1135178520.0
  ], 
  [
   186955, 
   null, 
   "jyoshu", 
   "Did you ever stop for a second and think that maybe the Feds presence was to protect the crowd from possible outside harm?\n\n \n But that wouls require them thinking outside the box, JP! emoticon_xgood", 
   {}, 
   186944, 
   null, 
   1135180860.0
  ], 
  [
   186967, 
   null, 
   "maco", 
   "Perhaps a necessary evil, sad to say.\n \n I think what bothers a lot of people is witnessing our society evolving in front of our very eyes towards authoritarian control and jack-boot mentality. The Federal agencies are starting to appear more and more each day to mildly mirror the likes of the KGB and SS. This trend scares and angers a lot of people. Others don't seem to mind at all.\n \n To some degree, who can deny, the terrorist's have won.:(\n\n That's what I take out of a LOT of articles I've read lately. They went after a college student who was doing a report on Mao Tse-Tung and requested the Little Red Book through ILL. Groups concerned with civil rights (whether it be racial, sexual, or sexual orientation) have been monitored by the gov. lately. I think the racial part is that they're afraid people are going to call them on all the racial profiling (especially when they keep trying to associate Sikhs with terrorists). I don't understand the other two though.", 
   {}, 
   186946, 
   null, 
   1135182420.0
  ], 
  [
   187055, 
   null, 
   "tonybrown74", 
   "Perhaps a necessary evil, sad to say.\n \n I think what bothers a lot of people is witnessing our society evolving in front of our very eyes towards authoritarian control and jack-boot mentality. The Federal agencies are starting to appear more and more each day to mildly mirror the likes of the KGB and SS. This trend scares and angers a lot of people. Others don't seem to mind at all.\n \n To some degree, who can deny, the terrorist's have won.:(\n\n \n Stated better than I could have worded it myself.", 
   {}, 
   186946, 
   null, 
   1135190700.0
  ], 
  [
   187074, 
   null, 
   "JPSartre12", 
   "Perhaps a necessary evil, sad to say.\n \n I think what bothers a lot of people is witnessing our society evolving in front of our very eyes towards authoritarian control and jack-boot mentality. The Federal agencies are starting to appear more and more each day to mildly mirror the likes of the KGB and SS. This trend scares and angers a lot of people. Others don't seem to mind at all.\n \n To some degree, who can deny, the terrorist's have won.:(\n\n \n I don\\'t think that any freedom-loving American is in love with the idea of increased scrutiny of all Americans, but until US citizens start feeling secure again, this is what we have to put up with. I\\'m patient enough to be willing to ride out the temporary paranoia before returning to \"business as usual\".", 
   {}, 
   186946, 
   null, 
   1135192500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The government is spying on gays", 
  "url": "http://www.4forums.com/political/gay-rights-debates/7122-government-spying-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 7122, 
  "discussion_files": [
   [
    "22748.html", 
    "http://www.4forums.com/political/gay-rights-debates/7122-government-spying-gays-print.html"
   ], 
   [
    "22749.html", 
    "http://www.4forums.com/political/gay-rights-debates/7122-government-spying-gays-2-print.html"
   ]
  ], 
  "identifier": 7122
 }
]