[
 [
  [
   10100, 
   null, 
   "gilligan8503", 
   "would you like to know if you are going to hell or not? take this test. i am. the sixth level. the level i will be attending is reserved for heretics only. here are my stats. please, take the test TRUTHFULLY and post your results.\n \n The Dante's Inferno Test has banished you to the Sixth Level of Hell - The City of Dis!\n \n Here is how you matched up against all the levels:\n Level | Score\n Purgatory | Very Low\n Level 1 - Limbo | Moderate\n Level 2 | High\n Level 3 | Low\n Level 4 | Very Low\n Level 5 | Moderate\n Level 6 - The City of Dis | Very High\n Level 7 | Low\n Level 8- the Malebolge | Moderate\n Level 9 - Cocytus | High\n \n Level descriptions: http://www.4degreez.com/misc/dante-inferno-information.html\n Take the test: http://www.4degreez.com/misc/dante-inferno-test.mv", 
   {
    "post_info": {
     "post_title": "going to hell?"
    }
   }, 
   null, 
   null, 
   1055877000.0
  ], 
  [
   10107, 
   null, 
   "Crim", 
   "Took that a while ago, I also got Level 6 - the level of unbelievers/blasphemy/etc. I had very high there and high on purgatory, but low on the rest.", 
   {}, 
   10100, 
   null, 
   1055878740.0
  ], 
  [
   10110, 
   null, 
   "SilentPoet", 
   "Hmmmm.......\n This doesn't sound good -\n \n \"The sweet light no longer strikes against your eyes. Your shade has been banished to... the Sixth Level of Hell - The City of Dis!\" \n \n (I retook the test)\n \n Always Stay Open Minded", 
   {}, 
   10100, 
   null, 
   1055880000.0
  ], 
  [
   10128, 
   null, 
   "Burnout", 
   "I, also got the sixth level of hell, but got very low in Purgatory, low in level 1, low in level 9, and moderate in all the rest.", 
   {}, 
   10100, 
   null, 
   1055887560.0
  ], 
  [
   10130, 
   null, 
   "rellik", 
   "I too will be spending my days in the City of Dis.\n \n Level | Score\n Purgatory | Very Low\n Level 1 - Limbo | Moderate\n Level 2 | High\n Level 3 | Moderate\n Level 4 | High\n Level 5 | Low\n Level 6 - The City of Dis | Very High\n Level 7 | Low\n Level 8- the Malebolge | Moderate\n Level 9 - Cocytus | Low", 
   {}, 
   10100, 
   null, 
   1055888820.0
  ], 
  [
   10132, 
   null, 
   "Burnout", 
   "Looks like all of us will be seeing eachother soon. \n \n \n \n Of course, I am being sarcastic.", 
   {}, 
   10100, 
   null, 
   1055889420.0
  ], 
  [
   10135, 
   null, 
   "gilligan8503", 
   "yay, company! i will need someone to talk to as i am burned alive by medusas.", 
   {}, 
   10100, 
   null, 
   1055890860.0
  ], 
  [
   10137, 
   null, 
   "lurch", 
   "Sixth Level of Hell - The City of Dis\n \n Here is how you matched up against all the levels:\n (Click on a level for more info) \n Level Who are sent there? Score \n Purgatory - Repenting Believers - Very Low \n Level 1 - Limbo - Virtuous Non-Believers - High \n Level 2 - Lustful - Very High \n Level 3 - Gluttonous - High \n Level 4 - Prodigal and Avaricious - Low \n Level 5 - Wrathful and Gloomy - Moderate \n Level 6 - The City of Dis Heretics - Very High \n Level 7 - Violent - High \n Level 8 - the Malebolge Fraudulent, Malicious, Panderers - Moderate \n Level 9 - Cocytus Treacherous - Low \n \n It looks like everyone goes to the sixth level.", 
   {}, 
   10100, 
   null, 
   1055891220.0
  ], 
  [
   10139, 
   null, 
   "gilligan8503", 
   "my brother went to the 4th, 3 friends went to 1st, 2nd, and 9th, and my mother went to heaven.\n \n it isn't rigged.", 
   {}, 
   10100, 
   null, 
   1055892840.0
  ], 
  [
   10141, 
   null, 
   "Crim", 
   "Hmmm, gave me Libo this time. Whenever you get a tie, it gives you the lowest one.\n \n Purgatory (repenting believers) | Very Low\n Level 1 (virtuous nonbelievers) | Very High\n Level 2 (lustful) | High\n Level 3 (gluttonous) | Moderate\n Level 4 (prodigal and avaricious) | Low\n Level 5 (wrathful and gloomy) | Low\n Level 6 (heretics) | Very High\n Level 7 (violent) | Low\n Level 8 (fraudulant, malicious, panderers) | Moderate\n Level 9 (treacherous) | Low", 
   {}, 
   10100, 
   null, 
   1055894340.0
  ], 
  [
   10172, 
   null, 
   "letgo", 
   "im going to the fifth level, the river styx is there, i bet poetic justice will be delt and ill have some good music to listen to as my flesh is eaten away.", 
   {}, 
   10100, 
   null, 
   1055912640.0
  ], 
  [
   10183, 
   null, 
   "SilentPoet", 
   "No one deserves an eternal punishment for anything...\n (Nor does anyone deserve an eternal reward for anything...)\n \n Always Stay Open Minded", 
   {}, 
   10100, 
   null, 
   1055915880.0
  ], 
  [
   10332, 
   null, 
   "debategirl88", 
   "Im going to heaven, cant wait!", 
   {}, 
   10100, 
   null, 
   1056076800.0
  ], 
  [
   10333, 
   null, 
   "SilentPoet", 
   "Debategirl,\n \n I don't know you so not to say your not a good person, but why in the world do you think you deserve to go to heaven (a place of eternal reward / happiness)...\n What have you done that is better than I or anyone else?\n Whatever you beleive or have done... for that do you think you really deserve \"heaven\"?\n \n Always Stay Open Minded", 
   {}, 
   10100, 
   null, 
   1056076980.0
  ], 
  [
   10339, 
   null, 
   "debategirl88", 
   "I dont \"DESERVE\" anything, but Jesus paid a price for me to go to heaven, the price was His life. You know, people call me crazy all the time when i go visiting, but have you noticed, whach someone who has trusted Jesus as their personal saviour. I know that there are ALOT of Christians out there who blend in with the people of the world, heck i used to be like that. But once I confess what I did to God, I feel like a burden is lifted off of me. I mean, Im happier. I was thinking about commiting suicide not so long ago, and i talk to a friend, and I talked and prayed to God. Guess what, He helped me through it. If it wasnt for God and that Christian friend of mine helping me out, I wouldnt be here right now. I know I kinda got off subject there but i was explaining how good God is. He gave His only son to die on the cross so we wont all go to hell. I know 98% think Im crazy, but I got God and thats all I need.", 
   {}, 
   10100, 
   null, 
   1056081780.0
  ], 
  [
   10345, 
   null, 
   "SilentPoet", 
   "debategirl,\n \n Sorry I'm not going to give you a full reply right now but I'd like you to consider the following.\n \n \n \"I dont \"DESERVE\" anything, but Jesus paid a price for me to go to heaven, the price was His life.\"\n \n - Jesus lived a fair life. He was persecuted by Roman officals and hung on a cross to die. (The following is by the story of the bible) He was dead for 3 days. I assume he spent those three days in heaven. He then came back to life and returned to heaven. \n Explain to me why you think this is such a \"big sacrafice\". Is this sacrafice equal to ALL of the sins of humanity... \n I don't think it begins to compare...\n So once again, why do you think this is such a big sacrafice... He had like 4 hours of pain. Somewhere in that relative area. 4 hours of pain forgives all sins?\n I think not\n \n Thanks for reading this\n \n Always Stay Open Minded", 
   {
    "post_info": {
     "post_title": "Quick Reply"
    }
   }, 
   10100, 
   null, 
   1056084420.0
  ], 
  [
   10348, 
   null, 
   "Crim", 
   "Your family kinda XXXXXX me off, so I captured them and put them over that pit. If you let me shoot you wherever I want, I might let them go.\n \n or\n \n Your family kinda XXXXXX me off, so I captured them and put them over that pit. If you let me shoot you wherever I want (don't worry, it will just graze you in the arm), then I'll let them go and afterwards I'll give you 100 billion dollars and protection from disease and other harm.\n \n Which scenario involves a greater sacrifice from you?", 
   {}, 
   10100, 
   null, 
   1056085320.0
  ], 
  [
   10371, 
   null, 
   "SilentPoet", 
   "Crim,\n \n Excuse my ignorance but I don't see your point. Are you trying to make a comparison to a true sarcrifice (which Jesus did not make) and an easy to make sarcafrice (which really isn't one, that Jesus did make)? If so, nice example....\n If not please elabortate\n \n Always Stay Open Minded", 
   {}, 
   10100, 
   null, 
   1056088500.0
  ], 
  [
   10386, 
   null, 
   "Crim", 
   "My point was that a sacrifice is considerably less impressive when you know that it's not going to have any negative long-term impact on you and you'll be greatly greatly rewarded afterwards.", 
   {}, 
   10100, 
   null, 
   1056095940.0
  ], 
  [
   10387, 
   null, 
   "SilentPoet", 
   "Crim,\n \n That puts into diffrent words what I was saying\n \n Always Stay Open Minded", 
   {}, 
   10100, 
   null, 
   1056097980.0
  ], 
  [
   10401, 
   null, 
   "debategirl88", 
   "Well, I dont think you know what your talking about because:\n \n 1. Jesus did not go to heaven he went to hell.\n \n He couldnt go to heaven because He had all of the sins of the world on Him. If ya know anything about the Bible \n you would know that sin does not go to heaven. That means\n Jesus spent 3 days and 3 nights in hell.\n \n \n 2. He didnt only have 4 hours of pain. \n \n He got captured the night before the crucifiction, was beaten \n and tormented all night long, then He was made to carry His \n cross (while having been beatin and a crown of thorns on \n His head). Then hung on the cross for more than 4 hrs. \n \n \n Now I dont know about you but id say that was a pretty big sacrafice and more than a graze on His arm.", 
   {}, 
   10100, 
   null, 
   1056138480.0
  ], 
  [
   10403, 
   null, 
   "Burnout", 
   "Originally posted by debategirl88 \n \n 1. Jesus did not go to heaven he went to hell.\n \n He couldnt go to heaven because He had all of the sins of the world on Him. If ya know anything about the Bible \n you would know that sin does not go to heaven. That means\n Jesus spent 3 days and 3 nights in hell.\n\n \n Three days? Non Christians supposedly spend an eternity in hell, not the weekend.\n \n \n2. He didnt only have 4 hours of pain. \n \n He got captured the night before the crucifiction, was beaten \n and tormented all night long, then He was made to carry His \n cross (while having been beatin and a crown of thorns on \n His head). Then hung on the cross for more than 4 hrs. \n \n \n Now I dont know about you but id say that was a pretty big sacrafice and more than a graze on His arm. \n \n \n Ok, so he had one night of pain. all prisoners at that time would have gone through similar treatment before being crucified and left for a number of hours to die. They would, again, have gone to hell for an eternity. \n \n The point is that even though he suffered, he was later rewarded perfection when he went to heaven. \n \n That is the graze on the arm and then being awarded all the riches and wellness.", 
   {}, 
   10100, 
   null, 
   1056139500.0
  ], 
  [
   10405, 
   null, 
   "debategirl88", 
   "He couldove had the riches w/o going through all that. He didnt HAVE to be there. He chose to so we could share the riches with Him in heaven. He didnt even have to go those days of suffering.", 
   {}, 
   10100, 
   null, 
   1056140520.0
  ], 
  [
   10408, 
   null, 
   "SilentPoet", 
   "Debategirl,\n \n \"1. Jesus did not go to heaven he went to hell.\n \n He couldnt go to heaven because He had all of the sins of the world on Him. If ya know anything about the Bible \n you would know that sin does not go to heaven. That means\n Jesus spent 3 days and 3 nights in hell.\"\n \n - Alright thats a total of 72 hours in hell. Compared to uhhh eternity. Are ALL of mans sins equal to that of one man spending 72 hours in hell? I don't think so....\n I am having alot of people tell me he didn't go to hell. So until a Bible refrence is provided I'm going to have to accept what you said as false although I gave it an answer as if it was true.\n \n \n 2. He didnt only have 4 hours of pain. \n \n He got captured the night before the crucifiction, was beaten \n and tormented all night long, then He was made to carry His \n cross (while having been beatin and a crown of thorns on \n His head). Then hung on the cross for more than 4 hrs. \n \n - Once again a bible refrence would be needed here. Alright I was wrong... but this is nothing in comparison of a true sacrafice. Especially since after this small sacrafice (for all of humanity) was made he went to heaven forever....\n Once again this is real no sacrafice.\n A more elabortate example of what I'm saying can seen by reading Crim's post.\n \n \"He couldove had the riches w/o going through all that\"\n \n - Really... Once again a refrence would be needed to accept this is a true. That doesn't seem fair at all....\n \n \"He didnt HAVE to be there.\"\n \n - Have to be where?\n \n \"He chose to so we could share the riches with Him in heaven.\"\n \n - He chose. Isn't god who chose that for him. I beleive he said something like: \"Why has thou forsaken me\" - Meaning he didn't chose this. God did.\n \n \"He didnt even have to go those days of suffering.\"\n \n - Wow... Once again such a big sacrafice. \n Please give me any bible refrences you have to prove what your saying.\n \n \n Thanks for reading this\n \n \n Always Stay Open Minded", 
   {}, 
   10100, 
   null, 
   1056142440.0
  ], 
  [
   10844, 
   null, 
   "Habbit", 
   "SilentPoet-\n \n \nI assume he spent those three days in heaven. \n\n \n Once again, your assumptions are wrong. I must strress, again, do some research. \n \n \nAre ALL of mans sins equal to that of one man spending 72 hours in hell?\n\n \n RESEARCH!!! He died to save you from an eternity in Hell! Gee, common sense... \n \n \nI am having alot of people tell me he didn't go to hell. So until a Bible refrence is provided I'm going to have to accept what you said as false although I gave it an answer as if it was true.\n\n \n The people you're talking to are either liars, XXXXXX, or atheists. Isn't it pretty sad that you're trying to argue against the Bible when you know nothing about it?\n \n \"For as Jonas was three days and three nights in the whale's belly; so shall the Son of man be three days and three nights in the heart of the earth.\" Mat. 12:40 (KJV)\n \n From Cortright Fellowship:\n \n The record of over 40 hours of suffering:\n \n He was arrested in the garden of Gethsemane on the Mount of Olives late Monday night: (Matthew 26:47-56, Mark 14:43-52, Luke 22:47-53, John 18:2-12)\n \n He appeared before the high priest Annas late Monday night. During this \"trial\" one of the Temple guard \"struck Jesus with the palm of his hand.\" This phrase is translated from the one Greek word, rhapisma, which means to beat repeatedly with a whip like cane.: (John 18:13-23)\n \n He appeared before the high priest Caiaphas and the Sanhedrin (the ruling 70) in a \"night trial\" late Monday night - very early Tuesday morning. During this \"trial\" they spit in his face and buffeted him [to beat repeatedly with fists] and again \"smote him with the palms of their hands\" - to beat with a cane or rod. They blindfolded him and beat him on the face asking him to prophesy who smote him: (Matthew 26:57-75, Mark 14:53-72, Luke 22:54-65, John 18:24-27)\n \n He appeared a second time before the ruling 70 (Sanhedrin council) around daybreak for a \"morning trial\" on Tuesday: (Matthew 27:1, Mark 15:1, Luke 22:66-71)\n \n He appeared before the Roman governor of Judea, Pontius Pilate, early Tuesday morning after daybreak: (Matthew 27:2, Mark 15:1, Luke 23:1-6, John 18:28-38)\n \n He appeared before the Roman ruler of Galilee, Herod Antipas, Tuesday morning. Herod took off his clothing and dressed him in a bright ornate robe to mock his claim of kingship.: (Luke 23:7-12)\n \n He appeared again before Pontius Pilate later on Tuesday morning. During this trial, Pilate tried to release him by appealing to the Judeans present three times. Pilate had him beaten with rods [scourged- with a whip that had pieces of metal or bone in the end] and he had the soldiers place a crown of thorns on his head and again smote him with rods. They put a second purple \"royal looking\" robe on him and mocked him:(Matthew 27:11-25, Mark 15:2-14, Luke 23:13-23, John 18:39-19:15)\n \n He was finally sentenced by Pontius Pilate around noon (John 19:14) on Tuesday (Matthew 27:26, Mark 15:15, Luke 23:24-25, John 19:16)\n \n Finally, he was tortured and mocked by a whole band [\"cohort\"=four to six hundred] Roman soldiers from around noon on Tuesday until he was led to be crucified early Wednesday morning. This torture included repeated beatings with a stick, braiding a second crown of thorns which they placed on his head and then beat into his head with a reed, ripping off his blood soaked clothing and replacing it for the third and then a fourth time with a Roman military cloak and then finally with his own original clothing, and mocking his claim of kingship: (Matthew 27:26-31, Mark 15:15-20)\n \n Certainly, by this time he no longer resembled a human being - his visage more marred than any man.\n \n He was led to be crucified on Wednesday morning: ( Matthew 27:32-34, Mark 15:20-23, Luke 23:26-32, John 19:16-17)\n \n He hung crucified on the tree from approximately 9 a.m. Wednesday morning until 3 p.m. Wednesday afternoon (Matthew 27:35-49, Mark 15:24-36, Luke 23:33-46, John 19:18-30)\n \n He died about 3 p.m. Wednesday: Matthew 27:50-54, Mark 15:37-39, Luke 23:45-48, John 19:30-37)\n \n From his arrest until his death was a period of approximately forty hours. During this time he was utterly humiliated, illegally \"tried,\" savagely tortured, and relentlessly mocked. - quoted from Jesus Christ Our Passover - by Victor Paul Wierwille\n \n \n Crim-\n \n \nMy point was that a sacrifice is considerably less impressive when you know that it's not going to have any negative long-term impact on you and you'll be greatly greatly rewarded afterwards.\n\n \n First, there is a long-term impact, but it wasn't on Jesus. Why should there be a long-term impact on Jesus? He was without sin. The long-term impact is on non-Jewish people who have no other way of getting to Heaven other than through Him. \n \n Burnout-\n \n \nThree days? Non Christians supposedly spend an eternity in hell, not the weekend.\n\n \n Then you'd better hurry up and get saved, non-Christian.\n \n \nThe point is that even though he suffered, he was later rewarded perfection when he went to heaven. \n\n \n Would you punish a child who has done nothing wrong?", 
   {}, 
   10100, 
   null, 
   1056516120.0
  ], 
  [
   10853, 
   null, 
   "Burnout", 
   "Then you'd better hurry up and get saved, non-Christian.\n\n \n So, should I get scared into Christianity? \n \n This is repetitive, but is obviously not justice: be Christian or go to hell.\n \n \n \nWould you punish a child who has done nothing wrong?\n\n \n Would you punish a person who has done nothing wrong, he/she just doesn't believe in God and Jesus being his savior?", 
   {}, 
   10100, 
   null, 
   1056518040.0
  ], 
  [
   10945, 
   null, 
   "Habbit", 
   "Burnout-\n \n \nSo, should I get scared into Christianity? \n \n This is repetitive, but is obviously not justice: be Christian or go to hell.\n\n \n 1. \"Then you'd better hurry up and get saved, non-Christian.\" was just a joke. Loosen up.\n 2. Think of it this way, \"Become a child of the God who spared you from Hell and go to Heaven or go to Hell.\" \n \n \nWould you punish a person who has done nothing wrong, he/she just doesn't believe in God and Jesus being his savior?\n\n \n No, I wouldn't, but, unfortunately for you, every person of this planet has sinned. You're not perfect. Quit thinking inside your little humanistic box. You have made mistakes and have sinned and you will continue to make mistakes and sin. No, I wouldn't punish a person who is sinless but doesn't believe in God, but, I would punish a person with sin who doesn't believe in God.", 
   {}, 
   10100, 
   null, 
   1056588900.0
  ], 
  [
   10948, 
   null, 
   "Burnout", 
   "Originally posted by Habbit \n \n \\Think of it this way, \"Become a child of the God who spared you from Hell and go to Heaven or go to Hell.\"\n\n \n Same concept\n \n \n \nNo, I wouldn't, but, unfortunately for you, every person of this planet has sinned. You're not perfect. Quit thinking inside your little humanistic box. You have made mistakes and have sinned and you will continue to make mistakes and sin. No, I wouldn't punish a person who is sinless but doesn't believe in God, but, I would punish a person with sin who doesn't believe in God.\n \n \n Since everyone is prone to sin, you would punish non believers because of the one difference. Save the sinning believer because, well, he/she believes in God. Sounds like the dictatorships/monarchies now where people are forced to recognize the authority of the ruler or be punished. God, as well as a dictator will punish people for actions that they see as against their laws (which sounds more like justice). \n \n Of course, the dictators do not promise the love and perfection that God does, but they use the same base for judgement.", 
   {}, 
   10100, 
   null, 
   1056591720.0
  ], 
  [
   11009, 
   null, 
   "Chai", 
   "Originally posted by Burnout \n Three days? Non Christians supposedly spend an eternity in hell, not the weekend.\n \n \n \n \n Not completely sure why, but I found that hysterically (sp?) funny. I's so glad to be having such good friends joining me in the sixth level! I scored very high on that, high on the 2nd level, and low on everything else. If Habbit and debategirl want to believe what they believe, that's great for them. However, I still don't understand why, if Jesus died for our sins, people are still going to Hell, and why if you are a repentant murderer, you can go to Heaven, but if you are a kindly Muslim, you are sentanced to Hell.", 
   {}, 
   10100, 
   null, 
   1056669720.0
  ], 
  [
   11184, 
   null, 
   "Habbit", 
   "Burnout-\n \n \nSame concept\n\n \n True, but yours is leaving out God's mercy. \n \n \nSince everyone is prone to sin, you would punish non believers because of the one difference. Save the sinning believer because, well, he/she believes in God. \n\n \n I assume you've either all or most of the posts on this thread, correct? Assuming that's true, where have you heard anyone say Christians go to Heaven because they believe in God? That's right... Christians go to Heaven because they asked Jesus, God's son, to forgive their sins. They are still sinners and still commit sins, but their's are forgiven. \n \n Chai-\n \n \nHowever, I still don't understand why, if Jesus died for our sins, people are still going to Hell, and why if you are a repentant murderer, you can go to Heaven, but if you are a kindly Muslim, you are sentanced to Hell.\n\n \n If a former murderer recognizes his sins and asks Jesus to forgive them, Jesus will do it and he will be going to Heaven. If a Muslim doesn't recognize his sins and doesn't ask Jesus to forgive them, Jesus can't do it and the Muslim will be going to Hell.", 
   {}, 
   10100, 
   null, 
   1056810600.0
  ], 
  [
   11273, 
   null, 
   "Pikeman85", 
   "Actually, even were I a Christian I'd prefer to go to hell.\n \n I couldn't let people be tortured like that, for eternity, without being with them. It would make me sick to see that happen to my brothers and my sisters.", 
   {}, 
   11184, 
   null, 
   1056937560.0
  ], 
  [
   12021, 
   null, 
   "Dragongirl", 
   "The Dante's Inferno Test has banished you to the Sixth Level of Hell - The City of Dis!\n \n Here is how you matched up against all the levels:\n Level | Score\n Purgatory | Very Low\n Level 1 - Limbo | Low\n Level 2 | High\n Level 3 | High\n Level 4 | Moderate\n Level 5 | High\n Level 6 - The City of Dis | Very High\n Level 7 | High\n Level 8- the Malebolge | High\n Level 9 - Cocytus | High\n \n Whoo hoo! At least I'll know some people in hell.\n I agree with Pikeman. I don't think I, or anyone else, would enjoy heaven very much if you could see your family and friends tortured for eternity, for the terrible crime of not believing in something that there's no proof of. You'd probably want to join them eventually. And you christians call God merciful.\n \n Anyways, about the whole \"Great Sacrifice.\" How is this a sacrifice?\n \n You're God. You need to forgive some people, so instead of using your omnipotent powers to forgive them and let them into heaven regardless of belief, you send down your son, who incidently, is also you. You/your son go to earth, and live for thirty three years happily, until the day comes where you must endure pain, and hell for a weekend. \n \n Not much of a sacrifice, when you take into account the fact that Millions of people have and will have endured MUCH worse pain, such as witch trial torture, hell, nazis, romans, etc.\n \n Not to mention the fact that the all merciful, all powerful God can snap his fingers and forgive everyone on the planet, let them into heaven, and have a party, without the bother of torturing your kid.\n \n I hope I made you think.", 
   {}, 
   11273, 
   null, 
   1058332980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  going to hell?", 
  "url": "http://www.4forums.com/political/religion-debates/714-going-hell.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 714, 
  "discussion_files": [
   [
    "23051.html", 
    "http://www.4forums.com/political/religion-debates/714-going-hell-print.html"
   ], 
   [
    "23052.html", 
    "http://www.4forums.com/political/religion-debates/714-going-hell-3-print.html"
   ], 
   [
    "23053.html", 
    "http://www.4forums.com/political/religion-debates/714-going-hell-2-print.html"
   ]
  ], 
  "identifier": 714
 }
]