[
 [
  [
   187803, 
   null, 
   "simone", 
   "Today in the Senate, Dick \"The Grinch\" Cheney flew in just long enough to break a 50-50 tie, further gutting lifeline services for the poor while they plough full steam ahead with abolishing all tax responsibility for the wealthy.", 
   {
    "post_info": {
     "post_title": "Who Would Jesus Starve?"
    }
   }, 
   null, 
   null, 
   1135441440.0
  ], 
  [
   187811, 
   null, 
   "Easyrider", 
   "Today in the Senate, Dick \"The Grinch\" Cheney flew in just long enough to break a 50-50 tie, further gutting lifeline services for the poor while they plough full steam ahead with abolishing all tax responsibility for the wealthy. \n\n \n Yada, yada, yada...\n \n Bush has spent more on the poor during his presidency than any other President, including Bill Clinton.\n \n And I'm sorry that I'm not buying into your argument that he's abolishing all tax responsibility for the wealthy. Got a credible news article that says the wealthy will not be paying any more taxes?", 
   {}, 
   187803, 
   null, 
   1135442640.0
  ], 
  [
   188015, 
   null, 
   "Bassman", 
   "The continuous mantra from the liberal left:\"The rich are evil and greedy. Let's soak them until they have nothing and we'll just keep pumping money into the bankrupt social programs that will keep people dependent on the government and we'll just tax everyone into prosperity.\" Bunk!!:xbanghead", 
   {}, 
   187811, 
   null, 
   1135567860.0
  ], 
  [
   188019, 
   null, 
   "trebor", 
   "The continuous mantra from the liberal left:\"The rich are evil and greedy. Let's soak them until they have nothing and we'll just keep pumping money into the bankrupt social programs that will keep people dependent on the government and we'll just tax everyone into prosperity.\" Bunk!!:xbanghead\n\n \n \n Amazing how the current batch of Christians totally ignore who the first people Jesus was supposed to have reached out to. He reached out to the blind, the lame, the poor, the disease.. those people who were not allowed in the temple. \n The early christain message was kindness to the poor, and scorned the hypocracy of the ones who went to pray in public, so people who could see how piious they are.\n \n It seems to me so many alleged christians have turn into the very thing that Jesus was supposed to have ralleyed against. \n \n What ever happened to the message attributed to Jesus by Matthew?\n \n \n\n \"He will place the sheep at his right hand and the goats at his left. Then the King will say to those on the right, `Come, you who are blessed by my Father, inherit the Kingdom prepared for you from the foundation of the world. For I was hungry, and you fed me. I was thirsty, and you gave me a drink. I was a stranger, and you invited me into your home. I was naked, and you gave me clothing. I was sick, and you cared for me. I was in prison, and you visited me.' Then these righteous ones will reply, `Lord, when did we ever see you hungry and feed you? Or thirsty and give you something to drink? Or a stranger and show you hospitality? Or naked and give you clothing? When did we ever see you sick or in prison, and visit you?' And the King will tell them, `I assure you, when you did it to one of the least of these my brothers and sisters, you were doing it to me!'\"\n \n", 
   {}, 
   188015, 
   null, 
   1135572540.0
  ], 
  [
   188021, 
   null, 
   "Bassman", 
   "The idea is not to keep people on the government dole. The duties for which you speak of are the church's not the government's. Yes it is important to meet the physical needs of people, but the state should have an extremely limited role in it. However, God never condemned rich people just the way resources are used.", 
   {}, 
   188019, 
   null, 
   1135573800.0
  ], 
  [
   188028, 
   null, 
   "Easyrider", 
   "Amazing how the current batch of Christians totally ignore who the first people Jesus was supposed to have reached out to. He reached out to the blind, the lame, the poor, the disease.. those people who were not allowed in the temple. The early christain message was kindness to the poor, and scorned the hypocracy of the ones who went to pray in public, so people who could see how piious they are. It seems to me so many alleged christians have turn into the very thing that Jesus was supposed to have ralleyed against.\n\n \n This is nonsense. Of course you wouldn't dare step into a Church to see what really goes on. You just sit where you are and make up these fairy tales. Virtually every church church in America has some program going on to help the poor, or the blind, or the lame, or the sick, or all of the foregoing.\n \n What are you water-walking Reform Jews doing? I haven't heard a peep out ot them.", 
   {}, 
   188019, 
   null, 
   1135575540.0
  ], 
  [
   188030, 
   null, 
   "trebor", 
   "This is nonsense. Of course you wouldn't dare step into a Church to see what really goes on. You just sit where you are and make up these fairy tales. Virtually every church church in America has some program going on to help the poor, or the blind, or the lame, or the sick, or all of the foregoing.\n \n What are you water-walking Reform Jews doing? I haven't heard a peep out ot them.\n\n \n \n I don't ahve to step in a church. I see how YOU in speciific, and how bassman act.\n \n Selfish, egotistical, condeming of all, particularly of hte poor and needy, Delighting in death. Everything that the writers of the Gospels had Jesus condemning.", 
   {}, 
   188028, 
   null, 
   1135576080.0
  ], 
  [
   188043, 
   null, 
   "Master_Shake", 
   "Yada, yada, yada...\n \n Bush has spent more on the poor during his presidency than any other President, including Bill Clinton.\n \n And I'm sorry that I'm not buying into your argument that he's abolishing all tax responsibility for the wealthy. Got a credible news article that says the wealthy will not be paying any more taxes?\n\n Have credible evidence to support that Bush has spen more on the poor than any other president? Cuz this reeks of you-know-what to me.", 
   {}, 
   187811, 
   null, 
   1135591080.0
  ], 
  [
   188044, 
   null, 
   "trebor", 
   "Have credible evidence to support that Bush has spen more on the poor than any other president? Cuz this reeks of you-know-what to me.\n\n \n \n Well, if you include the war against iraq, to find wmd that don't exist .. well, if that is for the poor..", 
   {}, 
   188043, 
   null, 
   1135597980.0
  ], 
  [
   188047, 
   null, 
   "Bassman", 
   "Trebor, you never responded to my reply. Government should have a limited role in the well being of the people. It's up to churches, private charities and ordinary people to help those in need, not the government. The government's primary role is security and defense.", 
   {}, 
   188044, 
   null, 
   1135609080.0
  ], 
  [
   188052, 
   null, 
   "Adept", 
   "Government should have a limited role in the well being of the people. It's up to churches, private charities and ordinary people to help those in need, not the government.\n\n \n I pretty much agree with this. While I think the government should definately provide a 'hand up' for people who are currently unemployable, it should stop short of completely supporting these people indefinately.\n \n \nThe government's primary role is security and defense.\n\n \n I'd rate healthcare pretty high on the list as well.", 
   {}, 
   188047, 
   null, 
   1135613640.0
  ], 
  [
   188065, 
   null, 
   "Easyrider", 
   "I don't ahve to step in a church. I see how YOU in speciific, and how bassman act.\n \n Selfish, egotistical, condeming of all, particularly of hte poor and needy, Delighting in death. Everything that the writers of the Gospels had Jesus condemning.\n\n \n Nonsense. Now, if the following were found in the New Testament (instead of Trebor's Tanakh), the cries of anti-semitism would be deafening.\n \n \"When you spread out your hands in prayer, I will hide my eyes from you; even if you offer many prayers, I will not listen. Your hands are full of blood .\" Isaiah 1:15\n \n  \"For your hands are stained with blood  , your fingers with guilt. Your lips have spoken lies, and your tongue mutters wicked things.\" Isaiah 59:3\n \n \"For they have committed adultery  and blood is on their hands  . They committed adultery with their idols;  they even sacrificed their children, whom they bore to me .\" Ezekiel 23:37 \n \n \"May his blood fall upon the head of Joab and upon all his father's house!\" 2 Samuel 3:29\n \n They shed innocent blood , the  blood of their sons and daughters, whom they sacrificed to the idols of Canaan, and the land was desecrated by their  blood. Psalm 106:38\n \n \"Their feet rush into sin;  they are swift to shed innocent blood . Their thoughts are evil thoughts; ruin and destruction mark their ways. \" Isaiah 59:7\n \n \"For they have forsaken me and made this a place of foreign gods; they have burned sacrifices in it to gods that neither they nor their fathers nor the kings of Judah ever knew, and they have filled this place with the  blood  of the  innocent. \" Jeremiah 19:4\n \n  \"Be assured, however, that if you put me to death, you will bring the guilt of innocent blood on yourselves and on this city and on those who live in it, for in truth the LORD has sent me to you to speak all these words in your hearing.\" Jeremiah 26:15", 
   {
    "unicode_changes_made": true
   }, 
   188030, 
   null, 
   1135615380.0
  ], 
  [
   188071, 
   null, 
   "trebor", 
   "Trebor, you never responded to my reply. Government should have a limited role in the well being of the people. It's up to churches, private charities and ordinary people to help those in need, not the government. The government's primary role is security and defense.\n\n \n Frankly, the reason the government has gotten involved is churches, private charaties and originary people don't do a good enough job.\n \n End of story.", 
   {}, 
   188047, 
   null, 
   1135620060.0
  ], 
  [
   188094, 
   null, 
   "DamEtel", 
   "But God Almighty sheds the blood of the innocent every time there's a spontaneous abortion! \n \n You yourself said, EasyRider, that it is God who \"stitches\" us together in our mothers' wombs. Therefore, all of the stitching errors that lead to death of millions of fetuses every year show the handiwork of your God: the incompetent handiwork of your God.", 
   {}, 
   188065, 
   null, 
   1135627200.0
  ], 
  [
   188102, 
   null, 
   "JPSartre12", 
   "Frankly, the reason the government has gotten involved is churches, private charaties and originary people don't do a good enough job.\n \n End of story.\n\n \n You're wrong. Since the $7+Trillion War on Poverty initiated by LBJ, the number of poor people has increased. Prior to the War on Poverty, private charities dealt with the poor. It seems like Uncle Sam was only successful in breeding the poor, not helping them. When you reward illegitimacy, you get more illegitimacy. Surprised?! :xbanghead", 
   {}, 
   188071, 
   null, 
   1135630020.0
  ], 
  [
   188105, 
   null, 
   "lord tammerlain", 
   "The idea is not to keep people on the government dole. The duties for which you speak of are the church's not the government's. Yes it is important to meet the physical needs of people, but the state should have an extremely limited role in it. However, God never condemned rich people just the way resources are used.\n\n \n It is in the bible that it is easier for a camel to pass through the eye of a needle then it is for a rich man to enter heaven. That is pretty close to condemnation", 
   {}, 
   188021, 
   null, 
   1135630260.0
  ], 
  [
   188106, 
   null, 
   "JPSartre12", 
   "I pretty much agree with this. While I think the government should definately provide a 'hand up' for people who are currently unemployable, it should stop short of completely supporting these people indefinately.\n \n I'd rate healthcare pretty high on the list as well.\n\n \n Americans have rejected socialized medicine. That's what cost the Democrats control of the HR and Senate 10 years ago under Slick. We don't want the gov't controlling another 14% of the nation's GDP. We've already seen how poorly Medicare, Medicaid, SS and VA hospitals are run federally and don't want to go that route with the whole healthcare system. emoticon_xdonno", 
   {}, 
   188052, 
   null, 
   1135630320.0
  ], 
  [
   188110, 
   null, 
   "johnhanks", 
   "Americans have rejected socialized medicine.\n\n \n Indeed they have. Now, of the following three nations, which has the highest infant mortality rate?\n \n 1 Cuba\n \n 2 The United Kingdom\n \n 3 The United States\n \n Yes, it's the good old US of A, with a stonking 6.63 deaths per 1000 live births.", 
   {}, 
   188106, 
   null, 
   1135631700.0
  ], 
  [
   188113, 
   null, 
   "Bassman", 
   "It is in the bible that it is easier for a camel to pass through the eye of a needle then it is for a rich man to enter heaven. That is pretty close to condemnation\n\n Out of context. If you read the entire passage, this was referring to the rich young ruler who did not want to part with his wealth. He made wealth his god. LT you blew it on this one. God doesn't \"redistribute\" His blessings evenly. Some He blesses more than others. This doesn't mean that God looks on them any more favorably than others. As I've stated before. It's not the amount of wealth that God is concerned with, it's how we use it that's the indicator of the condition of our hearts.", 
   {}, 
   188105, 
   null, 
   1135632120.0
  ], 
  [
   188117, 
   null, 
   "lord tammerlain", 
   "Out of context. If you read the entire passage, this was referring to the rich young ruler who did not want to part with his wealth. He made wealth his god. LT you blew it on this one. God doesn't \"redistribute\" His blessings evenly. Some He blesses more than others. This doesn't mean that God looks on them any more favorably than others. As I've stated before. It's not the amount of wealth that God is concerned with, it's how we use it that's the indicator of the condition of our hearts.\n\n \n \n Reread what you wrote\n \n The rich young ruler did not want to part with his wealth, correct. To part with his wealth would require redistribution of that wealth, correct. Overall what you have just stated is that the pursuit of wealth at the expense of your fellow man, ( ie when people are suffering in your community from a specific lack of wealth ) that is when god is concerned about wealth.", 
   {}, 
   188113, 
   null, 
   1135633320.0
  ], 
  [
   188120, 
   null, 
   "JPSartre12", 
   "Indeed they have. Now, of the following three nations, which has the highest infant mortality rate?\n \n 1 Cuba\n \n 2 The United Kingdom\n \n 3 The United States\n \n Yes, it's the good old US of A, with a stonking 6.63 deaths per 1000 live births.\n\n \n And if you could actually show a causal relationship between the two, that'd probably mean something, huh? emoticon_rolleyes", 
   {}, 
   188110, 
   null, 
   1135633560.0
  ], 
  [
   188122, 
   null, 
   "Bassman", 
   "Reread what you wrote\n \n The rich young ruler did not want to part with his wealth, correct. To part with his wealth would require redistribution of that wealth, correct. Overall what you have just stated is that the pursuit of wealth at the expense of your fellow man, ( ie when people are suffering in your community from a specific lack of wealth ) that is when god is concerned about wealth.\n\n Agreed, when obtained unethically and immorally, then it becomes problematic. But to \"soak all of the rich\" to fund morally bankrupt government run social programs is just as immoral.", 
   {}, 
   188117, 
   null, 
   1135634400.0
  ], 
  [
   188123, 
   null, 
   "johnhanks", 
   "And if you could actually show a causal relationship between the two, that'd probably mean something, huh? emoticon_rolleyes\n\n \n Well, that would be hard. This is one of those occasions when we just have to weigh up the odds on coincidence. You said\n \n \nOriginally Posted by JPSartre12\n Americans have rejected socialized medicine.\n\n \n I could only quote statistics: data on causation are hard to find. So, sure; it may well be pure coincidence that most of the thirty-five countries with lower infant mortality rates than the richest and most technologically advanced nation in the world have socialized medicine. How could I prove otherwise?\n \n (Incidentally, of the G8 nations, only Russia's ahead of you in infant mortality. Outside the G8, Slovenia has something like 2/3 your rate; Sweden's well under half.)", 
   {}, 
   188120, 
   null, 
   1135634700.0
  ], 
  [
   188158, 
   null, 
   "JPSartre12", 
   "Well, that would be hard. This is one of those occasions when we just have to weigh up the odds on coincidence. \n\n Sorry, but if you can't demonstrate a causal relationship, you're just speculating. \n \n\n I could only quote statistics: data on causation are hard to find. So, sure; it may well be pure coincidence that most of the thirty-five countries with lower infant mortality rates than the richest and most technologically advanced nation in the world have socialized medicine. How could I prove otherwise?\n \n (Incidentally, of the G8 nations, only Russia's ahead of you in infant mortality. Outside the G8, Slovenia has something like 2/3 your rate; Sweden's well under half.)\n\n \n If your assertion is that the US' higher infant mortality is related to poor healthcare, then wouldn't you attempt to show a correlation between births attended by a professional and births without professional supervision. Those statistics are available, for example. The US is at 99%. The European Region average is 94%; Canada is 98%.\n http://www.who.int/healthinfo/statistics/en/\n \n I invite you to find any statistics related to healthcare that would support your contention. emoticon_rolleyes", 
   {}, 
   188123, 
   null, 
   1135652940.0
  ], 
  [
   188177, 
   null, 
   "Adept", 
   "Americans have rejected socialized medicine. That's what cost the Democrats control of the HR and Senate 10 years ago under Slick. We don't want the gov't controlling another 14% of the nation's GDP.\n\n \n I would posit that the problems your country encountered with state funded healthcare were due more specifically to the individuals involved in the administration, than the concept of using taxes to pay for hospitals and doctors.\n \n \nWe've already seen how poorly Medicare, Medicaid, SS and VA hospitals are run federally and don't want to go that route with the whole healthcare system. emoticon_xdonno\n\n \n One can easily counter with \"We've seen how well Medicare (Australian Govt version) and Australian, British and European hospitals are run.\"\n \n As much as the government should be providing protection for it's citizens, it should be (IMHO) providing healthcare. It seems incongrous to expect the government to spend billions of dollars on bombs, tanks, soldiers and planes to protect our country, but not spend money on hospital equipment, beds or staff to preserve our health.", 
   {}, 
   188106, 
   null, 
   1135665180.0
  ], 
  [
   188180, 
   null, 
   "JPSartre12", 
   "I would posit that the problems your country encountered with state funded healthcare were due more specifically to the individuals involved in the administration, than the concept of using taxes to pay for hospitals and doctors.\n \n \n \n One can easily counter with \"We've seen how well Medicare (Australian Govt version) and Australian, British and European hospitals are run.\"\n \n As much as the government should be providing protection for it's citizens, it should be (IMHO) providing healthcare. It seems incongrous to expect the government to spend billions of dollars on bombs, tanks, soldiers and planes to protect our country, but not spend money on hospital equipment, beds or staff to preserve our health.\n\n \n We're a nation that generally frowns on socialist programs that go against our basic capitalist philosophy. Unfortunately, the younger Americans are more comfortable with the concept of \"Nannyism\" while we older folks are more leary of socialism. We favor self-determination.\n We are comfortable with our government spending money on defense because that was one of the two original powers given to the Federal gov't. All other powers that it possesses today are powers usurped from the state or individual, IMO.", 
   {}, 
   188177, 
   null, 
   1135665900.0
  ], 
  [
   188181, 
   null, 
   "Adept", 
   "We're a nation that generally frowns on socialist programs that go against our basic capitalist philosophy. Unfortunately, the younger Americans are more comfortable with the concept of \"Nannyism\" while we older folks are more leary of socialism. We favor self-determination.\n\n \n Fair enough. I'd still prefer to be safe in the knowledge I, and everyone else, can recieve free or subsidised healthcare when and if we need it.", 
   {}, 
   188180, 
   null, 
   1135666320.0
  ], 
  [
   188184, 
   null, 
   "JPSartre12", 
   "Fair enough. I'd still prefer to be safe in the knowledge I, and everyone else, can recieve free or subsidised healthcare when and if we need it.\n\n \n That's part of our fear. We see Canada's national healthcare with its long waits for tests and surgery and we just aren't that patient patients. :)", 
   {}, 
   188181, 
   null, 
   1135666980.0
  ], 
  [
   188221, 
   null, 
   "simone", 
   "Out of context. If you read the entire passage, this was referring to the rich young ruler who did not want to part with his wealth. He made wealth his god. LT you blew it on this one. God doesn't \"redistribute\" His blessings evenly. Some He blesses more than others. This doesn't mean that God looks on them any more favorably than others. As I've stated before. It's not the amount of wealth that God is concerned with, it's how we use it that's the indicator of the condition of our hearts.\nYou interpret it in your little narrow way, Bassman.\n \n However, I wonder what Jesus truly meant when he said it.", 
   {}, 
   188113, 
   null, 
   1135701540.0
  ], 
  [
   188222, 
   null, 
   "simone", 
   "Sorry, but if you can't demonstrate a causal relationship, you're just speculating. . . .\nLive babies don't count?\n \n My gawd! Do you spend so much of your time counting fetuses that you never count live babies?", 
   {}, 
   188158, 
   null, 
   1135701660.0
  ], 
  [
   188251, 
   null, 
   "johnhanks", 
   "If your assertion is that the US' higher infant mortality is related to poor healthcare, then wouldn't you attempt to show a correlation between births attended by a professional and births without professional supervision.\n\n \n Why that statistic? Infant mortality includes perinatal mortality, but is not restricted to it.\n \n Something is causing the world's richest and most technologically advanced nation to be 35th in the infant mortality league, roughly on a par with Croatia and Lithuania. You may choose, if you wish, to believe that this has nothing to do with the absence of universally available healthcare free to all at point of use. Do you have a more convincing hypothesis? (This is not a burden of proof error - I'm not claiming that my hypothesis stands unless you disprove it, simply asking if you have a better one.)\n \n Your point about waiting lists in countries with socialised medicine is a red herring. People who can afford to do so can, if they wish, avoid the wait by opting for private treatment; people who can't (or on principle won't) at least get the treatment in due course. How is the alternative of their not getting it at all supposed to be better?", 
   {}, 
   188158, 
   null, 
   1135709760.0
  ], 
  [
   188274, 
   null, 
   "JPSartre12", 
   "Why that statistic? Infant mortality includes perinatal mortality, but is not restricted to it.\n \n Something is causing the world's richest and most technologically advanced nation to be 35th in the infant mortality league, roughly on a par with Croatia and Lithuania. You may choose, if you wish, to believe that this has nothing to do with the absence of universally available healthcare free to all at point of use. Do you have a more convincing hypothesis? (This is not a burden of proof error - I'm not claiming that my hypothesis stands unless you disprove it, simply asking if you have a better one.)\n\n \n My only point was that you CAN'T find a correlation between socialized healthcare and better healthcare. The reasons for US' high infant mortality are many. Crack babies, high illegitimacy rates, teenage pregnancies, etc., all contribute to the high infant mortality rate.\n \n\n Your point about waiting lists in countries with socialised medicine is a red herring. People who can afford to do so can, if they wish, avoid the wait by opting for private treatment; people who can't (or on principle won't) at least get the treatment in due course. How is the alternative of their not getting it at all supposed to be better?\n\n Red herring/ IIRC, it's illegal to go outside of the system in Canada to get private treatment. In other countries, the use of private medicine is allowed, but sets up an interesting dichotomy. My guess is that the rich truly get better healthcare than the rest of the population which ISN'T the case here in the US. Here, you really can't buy better care. The average middle class patient gets the same level of care as the rich patient.\n There's lots of misconceptions about the lack of coverage for poor Americans, but it is against the law to deny emergency or life-threatening treatment for ANYBODY in the US and the level of treatment that they get is equivalent to everyone else's. \n Where the poor in the US lack healthcare is primarily in the area of preventative healthcare and even in those cases, it is available via free clinics, etc.,\n The US pays 2-3X as much per citizen on healthcare than other OECD members. The OECD average was $ 1783, while the US average was $4178.\n In responsiveness, US was rated #1 in the world. The problem with surveys used to evaluate countries healthcare is that they don't measure quality of care, they rely more heavily on quantity of care. The US gets slammed not for the quality of care, but for the fact that 15% of Americans don't have healthcare insurance. Of course, the threee states with the largest number of uninsured people are Arizona, Texas and New Mexico. The fact that they are all border states populated with the largest number of legal and illegal immigrants from Mexico is lost in the statistics. \n I would venture a guess that any measure of the quality of healthcare in the US far exceeds the rest of the world. Most new drugs, surgical techniques, instrumentation, protocols, etc., originate in the US. That isn't by coincidence. Capitalism promotes competition and competition promotes excellence.", 
   {}, 
   188251, 
   null, 
   1135715640.0
  ], 
  [
   188277, 
   null, 
   "jim's trucking", 
   "....\n \n ....\n Your point about waiting lists in countries with socialised medicine is a red herring. People who can afford to do so can, if they wish, avoid the wait by opting for private treatment; people who can't (or on principle won't) at least get the treatment in due course. How is the alternative of their not getting it at all supposed to be better?\nAre not the rich then buying up available medical system consumables including donated parts thereby delaying treatment of the poor to the extent that \"in due course\" becomes \"whoops...too late\"?", 
   {}, 
   188251, 
   null, 
   1135718700.0
  ], 
  [
   188278, 
   null, 
   "johnhanks", 
   "In responsiveness, US was rated #1 in the world.\n\n \n And in infant mortality it's #35. As long as we have our priorities right.\n \n \nThe problem with surveys used to evaluate countries healthcare is that they don't measure quality of care, they rely more heavily on quantity of care. The US gets slammed not for the quality of care, but for the fact that 15% of Americans don't have healthcare insurance.\n\n \n But hey - those 15% don't count for much anyways, right? Why, I'll bet most of 'em don't even vote. Just as long as the other 85% are getting real quality care.", 
   {}, 
   188274, 
   null, 
   1135719900.0
  ], 
  [
   188280, 
   null, 
   "johnhanks", 
   "Are not the rich then buying up available medical system consumables including donated parts thereby delaying treatment of the poor to the extent that \"in due course\" becomes \"whoops...too late\"?\n\n \n No, not measurably. Do you have any evidence that this is so?\n \n Let me go anecdotal for a moment. Eighteen months ago I suffered a severe retinal detachment in my left eye. The A&E department of my local hospital referred me to Moorfields Eye Hospital in London - a world-class ophthalmology centre. That same evening I was admitted to Moorfields, and I had state-of-the-art corrective surgery the following day. None of this cost me a penny; nor was there any possibility that rich private patients might somehow have pre-empted my slot in theatre.\n \n Had I been a poor American, one of your 15% with no healthcare insurance, would I have had a similar experience? Or would I just be managing with the one eye right now?", 
   {}, 
   188277, 
   null, 
   1135720500.0
  ], 
  [
   188283, 
   null, 
   "jim's trucking", 
   "No, not measurably. Do you have any evidence that this is so?\nNo. Only a suspicion that supply and demand prevails and money talks.\n \n \n \n\n Let me go anecdotal for a moment. Eighteen months ago I suffered a severe retinal detachment in my left eye. The A&E department of my local hospital referred me to Moorfields Eye Hospital in London - a world-class ophthalmology centre. That same evening I was admitted to Moorfields, and I had state-of-the-art corrective surgery the following day. None of this cost me a penny; nor was there any possibility that rich private patients might somehow have pre-empted my slot in theatre.\n \n Had I been a poor American, one of your 15% with no healthcare insurance, would I have had a similar experience? Or would I just be managing with the one eye right now?\nI'm pleased to hear of your successful treatment. Apparently, the system had timely openings for you all along the path. I'm not sure that the possibility of intervention did not exist.\n \n The rest of your scene is speculation, either way I answer.", 
   {}, 
   188280, 
   null, 
   1135721880.0
  ], 
  [
   188292, 
   null, 
   "JPSartre12", 
   "And in infant mortality it's #35. As long as we have our priorities right.\n\n And I'm still waiting for some proof that the high rate is due to poor healthcare. You haven't been able to demonstrate squat. It's all conjecture on your part. As I said before, infant mortality is affected by a number of things. For example, the infant mortality rate amongst white Americans is 6.0 while the infant mortality for blacks is 2x that. \n \n\n But hey - those 15% don't count for much anyways, right? Why, I'll bet most of 'em don't even vote. Just as long as the other 85% are getting real quality care.\n\n That's the problem with socialism. You never take responsibility for your own actions and choices. As I said before, nobody is denied treatment, but it does take some effort to go get it. If someone is too lazy to seek out medical attention, I certainly am not going to force them to. \n We could very easily institute socialized medicine here in the US, but we don't want to take a step backwards in the quality of that care. \n Maybe we should start keeping health statistics on a country's compassion towards its elders. For example, the 15,000 French elderly who died of heat exhaustion because the French are too cheap to have air conditioned retirement homes, hospitals and residences. Now, THERE'S compassion for ya. emoticon_rolleyes\n \n I, also, noticed that you don't indicate what country you are from. What's the matter, are you ashamed of the country that you live in?", 
   {}, 
   188278, 
   null, 
   1135724520.0
  ], 
  [
   188304, 
   null, 
   "georged", 
   "For those interested in such things, the high rate of US infant mortality is primarily caused by lack of prenatal care attributable to no health insurance. \n \n ~Low birthweight is the primary risk factor for infant mortality and most of the decline in neonatal mortality (deaths of infants less than 28 days old) in the United States since 1970 can be attributed to increased rates of survival among low-birthweight newborns. Indeed, comparisons with countries for which data are available suggest that low birthweight newborns have better chances of survival in the United States than elsewhere. The U.S. infant mortality problem arises primarily because of its birthweight distribution; relatively more infants are born at low birthweight in the United States than in most other industrialized countries. Unfortunately, little progress has been made in reducing U.S. low birthweight rates, which would further improve infant mortality rates. \n \n Federal and state initiatives to lower infant mortality rates have focused on strategies to reduce financial barriers that limit access to prenatal care and on strategies to expand the supply of prenatal care services available to poor pregnant women. The relative advantages and disadvantages of these and other policies to reduce low birthweight and infant mortality are the focus of considerable debate. Recent expansions of the Medicaid program are enabling more low-income children and pregnant women to obtain the health care that they need. Being eligible for Medicaid does not necessarily guarantee access to care, however, especially in areas where providers are in short supply. Hence, federal programs that provide direct support for maternal and child health services and primary care for low-income populations are also important. Some policy researchers believe, moreover, that the scope of strategies to reduce infant mortality should be broadened from a relatively narrow focus on pregnancy care to the more general issue of how to improve the health status of poor women and their families.~\n \n http://www.cbo.gov/showdoc.cfm?index=6219&sequence=0\n \n It might be noted that the US also presents the highest disparity of wages in the developed world, a contribution to the foregoing conclusion, with 12.7% below the poverty level. If one believes in statistical coincidences, rare, the 15% of Americans without health insurance is very close to that 12.7% below the poverty level. \n \n When it comes down to US health care, it's definitely a case of you get what you can pay for.", 
   {}, 
   188292, 
   null, 
   1135729020.0
  ], 
  [
   188306, 
   null, 
   "Master_Shake", 
   "@Easyrider- Again I ask: Have credible evidence to support that Bush has spen more on the poor than any other president? Cuz this reeks of you-know-what to me.", 
   {}, 
   188102, 
   null, 
   1135729080.0
  ], 
  [
   188307, 
   null, 
   "JPSartre12", 
   "@Easyrider- Again I ask: Have credible evidence to support that Bush has spen more on the poor than any other president? Cuz this reeks of you-know-what to me.\n\n \n How much proof would you like?\n http://www.federalbudget.com/\n http://www.sentryoveramerica.com/24_SentryLatest_Surge_Socialism.htm\n http://www.cato.org/research/articles/rugy-030212.html\n :xbanghead", 
   {}, 
   188306, 
   null, 
   1135730100.0
  ], 
  [
   188311, 
   null, 
   "trebor", 
   "How much proof would you like?\n http://www.federalbudget.com/\n http://www.sentryoveramerica.com/24_SentryLatest_Surge_Socialism.htm\n http://www.cato.org/research/articles/rugy-030212.html\n :xbanghead\n\n \n \n I don't know about the 'federal budget .com, but I don't consider 'sentry over american' or the cato group to be reliable sources.", 
   {}, 
   188307, 
   null, 
   1135731060.0
  ], 
  [
   188313, 
   null, 
   "georged", 
   "If anyone wants to pull line items on federal spending, this is the only authoritative historical source:\n \n http://www.whitehouse.gov/omb/budget/fy2004/pdf/hist.pdf#search='historical%20federal%20social%20spending'\n \n Aside from the mind-boggling prescription bill used to buy senior votes, increases in social spending have increased only at normal COLA rates over the past five years until 2006, when the first of annual $50-billion social spending reductions transpires (passed last week) to help pay for our expanded military budget. Inner-cities are going to become very interesting in terms of social unrest as those cuts become effective.", 
   {}, 
   188311, 
   null, 
   1135731900.0
  ], 
  [
   188364, 
   null, 
   "johnhanks", 
   "I, also, noticed that you don't indicate what country you are from. What's the matter, are you ashamed of the country that you live in?\n\n \n What a remarkably mean-spirited little sneer. I had thought better of you.\n \n I think post #35 makes it fairly clear where I'm from, and that I'm quite a long way from being ashamed of it.", 
   {}, 
   188292, 
   null, 
   1135760460.0
  ], 
  [
   188367, 
   null, 
   "Orion", 
   "What a remarkably mean-spirited little sneer. I had thought better of you.\n \n I think post #35 makes it fairly clear where I'm from, and that I'm quite a long way from being ashamed of it.\n\n \n Well, other than the fact that you guys boil beef, I have nothing against the UK. I mean, Amercuns are addicted to fast food, with all the asscoiated health risks...\"want some French fries with that?\" Oh, wait, \"freedom fries\". Cholesterol city on a national scale along with rampant obesity.", 
   {}, 
   188364, 
   null, 
   1135771920.0
  ], 
  [
   188368, 
   null, 
   "johnhanks", 
   "Well, other than the fact that you guys boil beef, I have nothing against the UK. I mean, Amercuns are addicted to fast food, with all the asscoiated health risks...\"want some French fries with that?\" Oh, wait, \"freedom fries\". Cholesterol city on a national scale along with rampant obesity.\n\n \n Hi O! How's it hangin'?\n \n You know, in all my life I've never known anyone boil beef? As to fast food addiction, we're catching up fast: much anxiety recently over rising obesity in kids, and the quality of food served in school canteens.\n \n But I think we're a little off topic here.", 
   {}, 
   188367, 
   null, 
   1135776240.0
  ], 
  [
   188391, 
   null, 
   "Orion", 
   "Hi O! How's it hangin'?\n\n \n How's WHAT hangin', John? \n \n \nYou know, in all my life I've never known anyone boil beef?\n\n \n So, you're not a native of the UK? A recent immigrant, perhaps? I've been there, John. Not to make an issue, but British cuisine leavs a lot to be desired.", 
   {}, 
   188368, 
   null, 
   1135788060.0
  ], 
  [
   188400, 
   null, 
   "JPSartre12", 
   "If anyone wants to pull line items on federal spending, this is the only authoritative historical source:\n \n http://www.whitehouse.gov/omb/budget/fy2004/pdf/hist.pdf#search='historical%20federal%20social%20spending'\n \n Aside from the mind-boggling prescription bill used to buy senior votes, increases in social spending have increased only at normal COLA rates over the past five years until 2006, when the first of annual $50-billion social spending reductions transpires (passed last week) to help pay for our expanded military budget. Inner-cities are going to become very interesting in terms of social unrest as those cuts become effective.\n\n \n I chose 2001 as the start because that was the last Clinton influenced budget\n P50 - 51 of the above reference:\n \n Human Resources 2001 ; 2008(est)\n Education, training, employment, social services $57.1B; $89.4B\n Health $172B; $335B\n Medicare $217 ; $349B\n Income security $$270B ; $369B\n Veterans benefits & services $45B ; $71B\n \n They all look like healthy increases, well above COLA, to me...unfortunately. emoticon_angry", 
   {}, 
   188313, 
   null, 
   1135791780.0
  ], 
  [
   188403, 
   null, 
   "georged", 
   "I chose 2001 as the start because that was the last Clinton influenced budget\n P50 - 51 of the above reference:\n \n Human Resources 2001 ; 2008(est)\n Education, training, employment, social services $57.1B; $89.4B\n Health $172B; $335B\n Medicare $217 ; $349B\n Income security $$270B ; $369B\n Veterans benefits & services $45B ; $71B\n \n They all look like healthy increases, well above COLA, to me...unfortunately. emoticon_angry\n\n \n Looks like COLA and population to me with increases compounded over a eight-year period. Medicare is obvious with baby boomers and prescription drugs.", 
   {}, 
   188400, 
   null, 
   1135792560.0
  ], 
  [
   188407, 
   null, 
   "simone", 
   "For those interested in such things, the high rate of US infant mortality is primarily caused by lack of prenatal care attributable to no health insurance. \n \n ~Low birthweight is the primary risk factor for infant mortality and most of the decline in neonatal mortality (deaths of infants less than 28 days old) in the United States since 1970 can be attributed to increased rates of survival among low-birthweight newborns. Indeed, comparisons with countries for which data are available suggest that low birthweight newborns have better chances of survival in the United States than elsewhere. The U.S. infant mortality problem arises primarily because of its birthweight distribution; relatively more infants are born at low birthweight in the United States than in most other industrialized countries. Unfortunately, little progress has been made in reducing U.S. low birthweight rates, which would further improve infant mortality rates. \n \n Federal and state initiatives to lower infant mortality rates have focused on strategies to reduce financial barriers that limit access to prenatal care and on strategies to expand the supply of prenatal care services available to poor pregnant women. The relative advantages and disadvantages of these and other policies to reduce low birthweight and infant mortality are the focus of considerable debate. Recent expansions of the Medicaid program are enabling more low-income children and pregnant women to obtain the health care that they need. Being eligible for Medicaid does not necessarily guarantee access to care, however, especially in areas where providers are in short supply. Hence, federal programs that provide direct support for maternal and child health services and primary care for low-income populations are also important. Some policy researchers believe, moreover, that the scope of strategies to reduce infant mortality should be broadened from a relatively narrow focus on pregnancy care to the more general issue of how to improve the health status of poor women and their families.~\n \n http://www.cbo.gov/showdoc.cfm?index=6219&sequence=0\n \n It might be noted that the US also presents the highest disparity of wages in the developed world, a contribution to the foregoing conclusion, with 12.7% below the poverty level. If one believes in statistical coincidences, rare, the 15% of Americans without health insurance is very close to that 12.7% below the poverty level. \n \n When it comes down to US health care, it's definitely a case of you get what you can pay for.\nGeorged, I note that no one has been able to refute this.", 
   {}, 
   188304, 
   null, 
   1135793040.0
  ], 
  [
   188408, 
   null, 
   "georged", 
   "I don't know what would generate such personal venom in a response to known statistics about poor quality and distribution of US health care, but infant mortality is the global gauge for a nation's quality of health care and that is directly related to our disparity in income and health insurance. We in the US spend far more on prolonging the last years of life for the elderly through government funding than any other single health issue. And that will escalate beyond imagination as baby boomers line up for that freebie. \n \n Smart people with money now fly to Thailand and India for superior, low-cost private health care for serious matters, not the US. Unless, of course, they're ousted dictators who require extreme security precautions.", 
   {}, 
   188364, 
   null, 
   1135793160.0
  ], 
  [
   188413, 
   null, 
   "johnhanks", 
   "I really don't give two shits what you think of ... US healthcare.\n\n \n Those two shits seemed to take an awful lot of posting to get out of your system.\n \n I have no argument at all with your high opinion of the quality of US healthcare. I've experienced it at first hand, after a road accident in Florida about 30 years ago. It was fine, really - first rate, in fact. The only difference from the treatment we'd have got at home was the hospital bill (oh, and the ambulance bill); but we could afford to pay, and as non-US-taxpayers it was right and proper that we should.\n \n I'll post no more on the topic at this time: feel free to have the last word.\n \n \nAnd neither am I ashamed at being from the country that bailed your asses out of WWII\n\n \n Really? You're Russian? Had me fooled. emoticon_xangel", 
   {}, 
   188364, 
   null, 
   1135793640.0
  ], 
  [
   188415, 
   null, 
   "georged", 
   "\n Really? You're Russian? Had me fooled. emoticon_xangel\n\n \n Few Americans recognize USSR WW2 contributions because their ideology ended with ism.", 
   {}, 
   188413, 
   null, 
   1135793940.0
  ], 
  [
   188428, 
   null, 
   "JPSartre12", 
   "Looks like COLA and population to me with increases compounded over a eight-year period. Medicare is obvious with baby boomers and prescription drugs.\n\n \n \n The COLA average from 2000 - 2004 was ~2.5%. If you apply that over 7 years (2008 - 2001), you get an increase of ~19% (if I did the math correctly). \n \n Human Resources 2001 ; 2008(est)\n Education, training, employment, social services $57.1B; $89.4B 56.6% Increase\n Health $172B; $335B 94.8% increase\n Medicare $217 ; $349B 60.8% increase\n Income security $$270B ; $369B 36.7% increase\n Veterans benefits & services $45B ; $71B 57.8% increase\n \n All of those significantly surpass the average COLAs for the past 4 years. Now, I agree that the Medicare and probably a significant portion of the \"Health\" category are due to demographics, but Income security and Education, etc., shouldn't be. Correct?", 
   {}, 
   188403, 
   null, 
   1135797960.0
  ], 
  [
   188429, 
   null, 
   "jim's trucking", 
   "...I've been there, John. Not to make an issue, but British cuisine leavs a lot to be desired.\nCome to think of it, I've never heard anyone say, \"Let's go to that nice little British restuarant for dinner.\"emoticon_xgood\n \n Last time I ate at one, I left saying, \"Jesus!...I'm starving!\"emoticon_xbye", 
   {}, 
   188391, 
   null, 
   1135798380.0
  ], 
  [
   188430, 
   null, 
   "johnhanks", 
   "Come to think of it, I've never heard anyone say, \"Let's go to that nice little British restuarant for dinner.\"emoticon_xgood\n \n Last time I ate at one, I left saying, \"Jesus!...I'm starving!\"emoticon_xbye\n\n \n Where was this? When was this?\n \n World's top five restaurants, as voted in May 2005:\n \n 1 Fat Duck, Bray (Best in World/Best in Europe)\n 2 El Bulli, Spain (Chef's Choice)\n 3 French Laundry, Yountville (Best in America)\n 4 Tetsuya's, Sydney (Best in Australasia)\n 5 Gordon Ramsay Royal Hospital Road, London\n \n Source: http://www.50bestrestaurants.co.uk/\n \n Admittedly the source is a British-based publication; however they say in mitigation\n \nBut then, with the US-based Gourmet magazine recently declaring London \"The best place to eat on the planet\", maybe it's a fair reflection of its place in world-restaurant ranking.\n\n We don't serve warm beer either. emoticon_xhoho\n \n Time to update your experience, fellas?", 
   {}, 
   188429, 
   null, 
   1135799280.0
  ], 
  [
   188431, 
   null, 
   "JPSartre12", 
   "Few Americans recognize USSR WW2 contributions because their ideology ended with ism.\n\n \n It's dejaVu all over again. I've had this argument many times in the past. If not for lend-lease and then military aid, the UK could be speaking German today. The presence of US men and material made it necessary for Germany to fight on two fronts. While the majority of German forces were in Russia, Germany was having its factories and more importantly, its oil refineries, bombed back home by US and UK bombers, weakening its ability to send supplies to the Russian Front....but all this belongs in a separate thread.", 
   {}, 
   188415, 
   null, 
   1135799520.0
  ], 
  [
   188434, 
   null, 
   "georged", 
   "The COLA average from 2000 - 2004 was ~2.5%. If you apply that over 7 years (2008 - 2001), you get an increase of ~19% (if I did the math correctly). \n \n Human Resources 2001 ; 2008(est)\n Education, training, employment, social services $57.1B; $89.4B 56.6% Increase\n Health $172B; $335B 94.8% increase\n Medicare $217 ; $349B 60.8% increase\n Income security $$270B ; $369B 36.7% increase\n Veterans benefits & services $45B ; $71B 57.8% increase\n \n All of those significantly surpass the average COLAs for the past 4 years. Now, I agree that the Medicare and probably a significant portion of the \"Health\" category are due to demographics, but Income security and Education, etc., shouldn't be. Correct?\n\n \n I haven't done the math, compounded annually, but when taking COLA, population and expanded usage due to our shift from industrial to service economy into consideration, I'd think 8-10% would be about right. I don't have access to program growth percentages, so that's a guess on my part. But I don't remember legislation expanding any programs but education and medicare (prescriptions). Both NCLB and prescription drugs, for all practical purposes, remain unfunded. If it was a business plan, I'd use 15% based solely on the continuing change to a pure two-tier system, with wealth moving upward and general wages at the bottom stagnating, forcing expansion of existing social programs.", 
   {}, 
   188428, 
   null, 
   1135800000.0
  ], 
  [
   188436, 
   null, 
   "jim's trucking", 
   "...\n \n We don't serve warm beer either. emoticon_xhoho\n ...\nOne of the best meals I can remember included openfired pork steaks, sauce, warm bread and warm beer.", 
   {}, 
   188430, 
   null, 
   1135800240.0
  ], 
  [
   188447, 
   null, 
   "johnhanks", 
   "One of the best meals I can remember included openfired pork steaks, sauce, warm bread and warm beer.\n\n \n Well, three out or four's not bad.", 
   {}, 
   188436, 
   null, 
   1135804200.0
  ], 
  [
   188448, 
   null, 
   "johnhanks", 
   "If not for lend-lease and then military aid, the UK could be speaking German today.\n\n \n Would you like to tell me the date on which the US declared war on Germany?\n \n On edit:\n \n \n....but all this belongs in a separate thread.\n\n \n Which, of course, is true.", 
   {}, 
   188431, 
   null, 
   1135804320.0
  ], 
  [
   188451, 
   null, 
   "JPSartre12", 
   "Would you like to tell me the date on which the US declared war on Germany?\n \n On edit:\n \n Which, of course, is true.\n\n \n If you'd care to debate it further, start a new thread and send me the link. I'll be happy to join you. History is one of my hobbies.", 
   {}, 
   188448, 
   null, 
   1135805340.0
  ], 
  [
   188452, 
   null, 
   "johnhanks", 
   "If you'd care to debate it further, start a new thread and send me the link. I'll be happy to join you. History is one of my hobbies.\n\n \n Please define 'it'. If our expectations are the same, I'll be happy to start a thread on the History board.\n \n History is one of my hobbies too.", 
   {}, 
   188451, 
   null, 
   1135805640.0
  ], 
  [
   188453, 
   null, 
   "Wraith", 
   "It's dejaVu all over again. I've had this argument many times in the past. If not for lend-lease and then military aid, the UK could be speaking German today. The presence of US men and material made it necessary for Germany to fight on two fronts. While the majority of German forces were in Russia, Germany was having its factories and more importantly, its oil refineries, bombed back home by US and UK bombers, weakening its ability to send supplies to the Russian Front....but all this belongs in a separate thread.\n\n \n \n You are the sort of American that gives the U.S.A. a bad press in my opinion.\n \n Did you fight in the war? Did you give your life? Were you even born?\n \n Is it right to blame the children for the sins of the father?\n Is it then right for the children to claim the prestiege the father won?\n \n When ever I read **** like this I feel like saying the arrogant American that he could stick his help, leave Britian to it's fate and then the the entire Nazi world would be after America.\n \n Truly this along with other comments in this thread by you are truly some of the worst examples of American arrogance I have openly seen posted in quite a while.", 
   {}, 
   188431, 
   null, 
   1135806300.0
  ], 
  [
   188455, 
   null, 
   "georged", 
   "You are the sort of American that gives the U.S.A. a bad press in my opinion.\n \n Did you fight in the war? Did you give your life? Were you even born?\n \n Is it right to blame the children for the sins of the father?\n Is it then right for the children to claim the prestiege the father won?\n \n When ever I read **** like this I feel like saying the arrogant American that he could stick his help, leave Britian to it's fate and then the the entire Nazi world would be after America.\n \n Truly this along with other comments in this thread by you are truly some of the worst examples of American arrogance I have openly seen posted in quite a while.\n\n \n JP also believes Vietnam was a just war and despises the French whom we financed all the way to colonial defeat there, so one can well imagine his opinion of Russia's contribution to WW2.", 
   {}, 
   188453, 
   null, 
   1135806900.0
  ], 
  [
   188463, 
   null, 
   "JPSartre12", 
   "You are the sort of American that gives the U.S.A. a bad press in my opinion.\n \n Did you fight in the war? Did you give your life? Were you even born?\n \n Is it right to blame the children for the sins of the father?\n Is it then right for the children to claim the prestiege the father won?\n \n When ever I read **** like this I feel like saying the arrogant American that he could stick his help, leave Britian to it's fate and then the the entire Nazi world would be after America.\n \n Truly this along with other comments in this thread by you are truly some of the worst examples of American arrogance I have openly seen posted in quite a while.\n\n \n Well, I'm sorry if I upset your delicate sensibilities, but maybe if your fellow countrymen would give the US bashing a rest, we could improve the level of discourse. I didn't jump in this thread and start making claims about the UK's poor healthcare delivery system, but that's exactly what your fellow countrymen did WRT the US and I'm not going to apologize for replying in kind, especially when the claims of poor healthcare are based on only one small aspect of healthcare. The US spends, mimimally, 2X as much per person as any other OECD nation on healthcare and is ranked #1 in responsiveness, world-wide, but those statistics weren't considered. \n If you view my replies as American arrogance, so be it. I view the original anti-American posts as \"holier than thou pomposity\", so I guess we're even.:)", 
   {}, 
   188453, 
   null, 
   1135809360.0
  ], 
  [
   188464, 
   null, 
   "JPSartre12", 
   "JP also believes Vietnam was a just war and despises the French whom we financed all the way to colonial defeat there, so one can well imagine his opinion of Russia's contribution to WW2.\n\n \n Quite the contrast WRT Russia. (Pretty close on France, though) emoticon_xgood Russia's contribution to the defeat of Hitler was tremendous as it should have been since it was in their national best interests to repel Germany from its soil. Most of Russia's losses in WWII occurred on Russian soil, defending the Motherland. There were no altruistic intentions in Russia's involvement; it was a purely motivated by survival. Hitler hated Communism and the Slavs. Defeating Russia would have given Hitler his needed resources AND wiped out his philosophical enemies. (If it wasn't for Hitler seeing a weakness in the Russian army when they were stalled in Finland by their own ineptitude, Hitler may have never even looked towards a conquest of Russia in the first place.) \n Hitler didn't want US involvement in WWII. That's why he attempted to strike a deathblow to Russia quickly. Operation Barbarosa was designed as a quick kill, not as a protracted engagement. But, again..this belongs in another thread.", 
   {}, 
   188455, 
   null, 
   1135810140.0
  ], 
  [
   188465, 
   null, 
   "JPSartre12", 
   "Please define 'it'. If our expectations are the same, I'll be happy to start a thread on the History board.\n \n History is one of my hobbies too.\n\n \n \"It\" being the significance of US involvement in WWII.", 
   {}, 
   188452, 
   null, 
   1135810200.0
  ], 
  [
   188466, 
   null, 
   "johnhanks", 
   "There were no altruistic intentions in Russia's involvement...\n\n \n And where, exactly, were America's 'altruistic' intentions? Given that it didn't enter the conflict until attacked on its own territory, and that it was Germany that declared war on the US?", 
   {}, 
   188464, 
   null, 
   1135810500.0
  ], 
  [
   188472, 
   null, 
   "JPSartre12", 
   "And where, exactly, were America's 'altruistic' intentions? Given that it didn't enter the conflict until attacked on its own territory, and that it was Germany that declared war on the US?\n\n \n How soon they forget lend-lease. emoticon_rolleyes", 
   {}, 
   188466, 
   null, 
   1135814340.0
  ], 
  [
   188539, 
   null, 
   "Orion", 
   "Come to think of it, I've never heard anyone say, \"Let's go to that nice little British restuarant for dinner.\"emoticon_xgood\n \n Last time I ate at one, I left saying, \"Jesus!...I'm starving!\"emoticon_xbye\n\n \n The following is totally off-topic, but I'll chance it nevertheless. I consider John Hanks to be a dear friend and I respect his opinions. We go quite aways back.\n \n The UK is delightful, and London is a fabulous city. In terms of culture, heritage, and attractions, I'd rate London way above any city in America, although SF or NYC might be a close second. One of the joys of London is that you are presented with a wide choice of cuisine: Indian, Chinese (several variants), French, Italian, Middle Eastern, etc. There is a reason for this, and the reason becomes obvious when you sample the local menu. Anything beyond fish and chips, and you're forced to go the international route. I must say, though, British breakfast is exceptional: choice of eggs, sausage, ham, a unique bacon, and muffins/scones.", 
   {}, 
   188429, 
   null, 
   1135833960.0
  ], 
  [
   188545, 
   null, 
   "Orion", 
   "You know, in all my life I've never known anyone boil beef? \n\n \n Corned beef?", 
   {}, 
   188368, 
   null, 
   1135834980.0
  ], 
  [
   188573, 
   null, 
   "johnhanks", 
   "Corned beef?\n\n \n Touche. I do indeed cook corned beef hash.", 
   {}, 
   188545, 
   null, 
   1135853760.0
  ], 
  [
   188574, 
   null, 
   "johnhanks", 
   "How soon they forget lend-lease. emoticon_rolleyes\n\n \n Oh, we remember it. And we're still paying you back: the last instalment is due on 31 December 2006. Lend-lease kept us fighting; but Americans often talk of it as though it were a gift. It was a loan, on which the UK is still paying interest.", 
   {}, 
   188472, 
   null, 
   1135854420.0
  ], 
  [
   188582, 
   null, 
   "Wraith", 
   "Well, I'm sorry if I upset your delicate sensibilities, but maybe if your fellow countrymen would give the US bashing a rest, we could improve the level of discourse. I didn't jump in this thread and start making claims about the UK's poor healthcare delivery system, but that's exactly what your fellow countrymen did WRT the US and I'm not going to apologize for replying in kind, especially when the claims of poor healthcare are based on only one small aspect of healthcare. The US spends, mimimally, 2X as much per person as any other OECD nation on healthcare and is ranked #1 in responsiveness, world-wide, but those statistics weren't considered. \n If you view my replies as American arrogance, so be it. I view the original anti-American posts as \"holier than thou pomposity\", so I guess we're even.:)\n\n \n I'm not responsible for other people's comments on this thread, just as other American's aren't responsible for the appauling comments you've made.\n \n \n \n I can just imagine you standing in front of all the surviving British Veterans, in the poppy field cemetaries in france, saying \"I'm not sorry for my comments, keep your country men from upsetting me or I'll verbally XXXX all over your memory some more\".", 
   {}, 
   188463, 
   null, 
   1135859880.0
  ], 
  [
   188629, 
   null, 
   "JPSartre12", 
   "I'm not responsible for other people's comments on this thread, just as other American's aren't responsible for the appauling comments you've made.\n\n You're certainly entitled to your opinion as I am entitled to mine. And I offer no apology for speaking the truth. If you dispute what I wrote, show me the facts. We can start a new thread in the history forum. I'd be more than happy to participate as would others in this thread. My thesis is that the US bailed the UK out of WWII. Please prove me wrong....if you can. \n \n\n I can just imagine you standing in front of all the surviving British Veterans, in the poppy field cemetaries in france, saying \"I'm not sorry for my comments, keep your country men from upsetting me or I'll verbally XXXX all over your memory some more\".\n\n \n Oh come now, melodrama is so beneath you. emoticon_rolleyes", 
   {}, 
   188582, 
   null, 
   1135878120.0
  ], 
  [
   189115, 
   null, 
   "jim's trucking", 
   "The following is totally off-topic, but I'll chance it nevertheless. I consider John Hanks to be a dear friend and I respect his opinions. We go quite aways back.\n \n The UK is delightful, and London is a fabulous city. In terms of culture, heritage, and attractions, I'd rate London way above any city in America, although SF or NYC might be a close second. One of the joys of London is that you are presented with a wide choice of cuisine: Indian, Chinese (several variants), French, Italian, Middle Eastern, etc. There is a reason for this, and the reason becomes obvious when you sample the local menu. Anything beyond fish and chips, and you're forced to go the international route. I must say, though, British breakfast is exceptional: choice of eggs, sausage, ham, a unique bacon, and muffins/scones.\nRelax, mates!\n \n It was just a joke...related to the title of this thread...that followed an opening six miles wide. I'm well aware of the British contribution to fine foods.\n \n It's just that at those famous name-brand dining establishments they use a small spoon to arrange a score of peas artistically next to a medalion of beef on a small plate as opposed to momma using a ladle for the peas and leavin' a lot of juice around a big fat sirloin that's hangin' off one end of my own personal platter.\n \n ...and you're certainly right about the breakfast.", 
   {}, 
   188539, 
   null, 
   1136059260.0
  ], 
  [
   189126, 
   null, 
   "johnhanks", 
   "I'm well aware of the British contribution to fine foods.\n\n \n To be honest, orion has it exactly right: the British contribution to fine foods has been to cultivate and encourage the cuisine of other nations. This evening I cooked a chili con carne that I still feel proud of; last night number one son cooked a Chinese dish, and the night before we ate out at the local Portuguese restaurant. Tuesday night number two son cooked fajitas. Do you know that the UK's national dish right now, by popular acclaim, is chicken tikka masala? (Not, admittedly, a dish that ever existed in India.)\n \n Can you spell multicultural? 'Cos we sure can; and it tastes delicious.", 
   {}, 
   189115, 
   null, 
   1136066220.0
  ], 
  [
   189128, 
   null, 
   "JPSartre12", 
   "The following is totally off-topic, but I'll chance it nevertheless. I consider John Hanks to be a dear friend and I respect his opinions. We go quite aways back.\n \n The UK is delightful, and London is a fabulous city. In terms of culture, heritage, and attractions, I'd rate London way above any city in America, although SF or NYC might be a close second. One of the joys of London is that you are presented with a wide choice of cuisine: Indian, Chinese (several variants), French, Italian, Middle Eastern, etc. There is a reason for this, and the reason becomes obvious when you sample the local menu. Anything beyond fish and chips, and you're forced to go the international route. I must say, though, British breakfast is exceptional: choice of eggs, sausage, ham, a unique bacon, and muffins/scones.\n\n \n What?! No spam...spam...spam...spam...spam...spam...:)", 
   {}, 
   188539, 
   null, 
   1136066700.0
  ], 
  [
   189129, 
   null, 
   "johnhanks", 
   "What?! No spam...spam...spam...spam...spam...spam...:)\n\n \n Not for several decades now. An American invention I believe - Hormel Foods?\n \n On edit: orion omits black pudding from his list. No traditional British breakfast is complete without it.", 
   {}, 
   189128, 
   null, 
   1136067000.0
  ], 
  [
   189154, 
   null, 
   "JPSartre12", 
   "Not for several decades now. An American invention I believe - Hormel Foods?\n \n On edit: orion omits black pudding from his list. No traditional British breakfast is complete without it.\n\n \n A Monty Python favorite.emoticon_xgood\n \n http://www.detritus.org/spam/skit.html", 
   {}, 
   189129, 
   null, 
   1136080080.0
  ], 
  [
   189155, 
   null, 
   "jim's trucking", 
   "To be honest, orion has it exactly right: the British contribution to fine foods has been to cultivate and encourage the cuisine of other nations. This evening I cooked a chili con carne that I still feel proud of; last night number one son cooked a Chinese dish, and the night before we ate out at the local Portuguese restaurant. Tuesday night number two son cooked fajitas. Do you know that the UK's national dish right now, by popular acclaim, is chicken tikka masala? (Not, admittedly, a dish that ever existed in India.)\n \n Can you spell multicultural? 'Cos we sure can; and it tastes delicious.\nYou want multicultural? Come eat in the United States...the melting pot of cultures.", 
   {}, 
   189126, 
   null, 
   1136080080.0
  ], 
  [
   189158, 
   null, 
   "JPSartre12", 
   "You want multicultural? Come eat in the United States...the melting pot of cultures.\n\n \n That's for sure. There are Greek, Italian, Chinese, Thai, Mediterranian, and a half dozen fast food joints within a mile from my house.", 
   {}, 
   189155, 
   null, 
   1136080800.0
  ], 
  [
   189159, 
   null, 
   "georged", 
   "You want multicultural? Come eat in the United States...the melting pot of cultures.\n\n \n Depends. Judging by the selection in what that industry calls 'casual dining restaurants', meat & potatoes generally fried are still the most common fare of the US masses along with pizza, limited salad and fried chicken offerings. Our county's weight problem is a testimony to that. \n \n I live near a couple of small towns which fortunately have a variety of fine restaurants and hole-in-the-wall ethnic specialty places due to an influx of retirees with coin and some local wealth. But one doesn't see many local working people in those places, they're lined up at the chain joints for their fine dining. I still find it difficult to understand why people pay $20+ for a cooked piece of meat that costs me $10-12 and a little fuel to cook exactly as I want it done. I'd rather spend that money on a meal out that saves hours in the kitchen.", 
   {}, 
   189155, 
   null, 
   1136081760.0
  ], 
  [
   189160, 
   null, 
   "DamEtel", 
   "jim's trucking: You want multicultural? Come eat in the United States...the melting pot of cultures. \n\n \n \nJPSartre12: That's for sure. There are Greek, Italian, Chinese, Thai, Mediterranian, and a half dozen fast food joints within a mile from my house.\n\n \n And all those people are welcome ... as long as they pray to Jesus Christ.", 
   {}, 
   189158, 
   null, 
   1136083020.0
  ], 
  [
   189162, 
   null, 
   "JPSartre12", 
   "Depends. Judging by the selection in what that industry calls 'casual dining restaurants', meat & potatoes generally fried are still the most common fare of the US masses along with pizza, limited salad and fried chicken offerings. Our county's weight problem is a testimony to that.\n\n \n Somebody must be eating at these ethnic restaurants, they're always opening more. \n \n\n I live near a couple of small towns which fortunately have a variety of fine restaurants and hole-in-the-wall ethnic specialty places due to an influx of retirees with coin and some local wealth. But one doesn't see many local working people in those places, they're lined up at the chain joints for their fine dining. I still find it difficult to understand why people pay $20+ for a cooked piece of meat that costs me $10-12 and a little fuel to cook exactly as I want it done. I'd rather spend that money on a meal out that saves hours in the kitchen.\n\n \n I'm a big superhot Thai fan. My family won't let me cook it at home. They say it makes their eyes burn. Wimps. LOL\n \n I, also agree about eating steak out. I went to a restaurant in Janesville, WI where you cook your own steak over a large community grill. It was OK as a novelty, but I'll be damned if I'm going to cook my own meal at a restaurant.emoticon_xdonno", 
   {}, 
   189159, 
   null, 
   1136083620.0
  ], 
  [
   189165, 
   null, 
   "jim's trucking", 
   "That's for sure. There are Greek, Italian, Chinese, Thai, Mediterranian, and a half dozen fast food joints within a mile from my house.\n\n I speak of one-of -a-kind ethnic restuarants run by families of the same ethnicity as the food. There's a small Thai restuarant downtown, the southern Bar BQ all over, the Chinese place where you can order duck feet and get them, the Cuban family-run cafe that makes the best Cuban sandwich in the world, the New York Italian brothers that put out the best quick pizza I've eaten anywhere, that oyster shack on the coast that serves half-shells by the ton and thousands of other places I've eaten some how do not compare with a home cooked, home served ethnic meal. Except for some absolutely inedible animal parts, I've sampled all the ethnic food ever put before me. In my humble opinion, the Cajun, the Mexican and the Old South Black quisine are all miles ahead of others in overall appeal.", 
   {}, 
   189162, 
   null, 
   1136088780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who Would Jesus Starve?", 
  "url": "http://www.4forums.com/political/religion-debates/7168-who-would-jesus-starve.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7168, 
  "discussion_files": [
   [
    "28517.html", 
    "http://www.4forums.com/political/religion-debates/7168-who-would-jesus-starve-print.html"
   ], 
   [
    "28518.html", 
    "http://www.4forums.com/political/religion-debates/7168-who-would-jesus-starve-6-print.html"
   ], 
   [
    "28519.html", 
    "http://www.4forums.com/political/religion-debates/7168-who-would-jesus-starve-4-print.html"
   ], 
   [
    "28520.html", 
    "http://www.4forums.com/political/religion-debates/7168-who-would-jesus-starve-5-print.html"
   ], 
   [
    "28521.html", 
    "http://www.4forums.com/political/religion-debates/7168-who-would-jesus-starve-3-print.html"
   ], 
   [
    "28522.html", 
    "http://www.4forums.com/political/religion-debates/7168-who-would-jesus-starve-2-print.html"
   ]
  ], 
  "identifier": 7168
 }
]