[
 [
  [
   188048, 
   null, 
   "Bassman", 
   "Recently, there has been a rash of fights in two high schools here in Buffalo. Lafayette and Riverside high Schools were the scene of at least five fights where either teachers/administrators were hurt and/or arrests were made within a week! Over the years, I've seen an increasing lax in school discipline. Just 25 or 30 years ago, school officials were not afraid to apply the \"Board of Education\" to the \"Seat of Knowledge.\" On top of that, with the laxadaisical involvement from parents, and the lack of good discipline from home, troublesome pupils aren't held accountable anymore. Your thoughts?", 
   {
    "post_info": {
     "post_title": "Schools a war zone?"
    }
   }, 
   null, 
   null, 
   1135609740.0
  ], 
  [
   188050, 
   null, 
   "Adept", 
   "I don't believe corporal punishment was ever really such a good thing. Not when, with proper discipline and even halfway decent parenting the same results can be achieved. Students shouldn't be afraid of misbehaving. They shouldn't want to misbehave in the first place.\n \n Without knowing more details about the situations you describe, I can't offer any further opinions.", 
   {}, 
   188048, 
   null, 
   1135613280.0
  ], 
  [
   188053, 
   null, 
   "Bassman", 
   "\"Students shouldn't be afraid of misbehaving?\" Without penalties for misbehavior, students don't learn a healthy respect for authority.", 
   {}, 
   188050, 
   null, 
   1135613700.0
  ], 
  [
   188054, 
   null, 
   "simone", 
   "I'd like more information about these incidents.\n \n What's the class ratio in Buffalo where these occurred? Any clues as to why these incidents occurred as opposed to the \"lax school discipline\" argument? What's the whole background of all this?\n \n Just wondering.", 
   {}, 
   188050, 
   null, 
   1135613700.0
  ], 
  [
   188129, 
   null, 
   "jitobear", 
   "There are certainly violence problems all over - and they are showing up in our schools - and I do believe many schools are taking it seriously. Many are adopting zero tolerance of things like weapons and bullying. I under no circumstances condone corporal punishment in schools. I would break the neck of any SOB who touched my kid without my approval. Not everyone approves of corporal punishment - and that goes for both parents and teachers. It is an extremely personal form of punishment. The idea of a school administration using it makes me physically ill. Let the school call you and you can do your beating at home if you find that the most effective way of dealing out consequences to your kids.\n \n I personally don't have a problem with spanking, especially with little ones, but don't think it works for every kid and should be abondonded as soon as you can find punishment that fits reality and goes hand in hand with reason. As an example, a baseball that breaks a wndow should earn a kid a lot work to pay for the repair, not a spanking. Only one of those really teaches the impact of the damage done, the other just makes the kid afraid authority. Personally I want my kid to reason better than that.", 
   {}, 
   188054, 
   null, 
   1135638300.0
  ], 
  [
   188134, 
   null, 
   "Bassman", 
   "Unfortunately, without consequences for bad behavior, a healthy respect for authority cannot be established. With the PC crowd in the schools screaming, \"don't discipline the kids,\" the kids turn out to become gangbanging thugs, criminals, or miscreants.", 
   {}, 
   188129, 
   null, 
   1135643280.0
  ], 
  [
   188142, 
   null, 
   "nocturnal09", 
   "Unfortunately, without consequences for bad behavior, a healthy respect for authority cannot be established. With the PC crowd in the schools screaming, \"don't discipline the kids,\" the kids turn out to become gangbanging thugs, criminals, or miscreants.\n\n \n thats not really true. Schools don't scream \"don't discipline the kids\" at all. Schools are against violent or immoral punishments, but not discipline in general. Spanking, slapping, or hitting of any child should be done at home. So long as it doesn't cross the line of abuse and the child deserves the punishment. A child, under no circumstance, should be hit bya teacher or another student while at school. Time outs (for little kids), detentions, suspensions, and expulsions (for Zero Tolerence Policies) are fine. If a child doesn't learn that what they did was wrong, then the school needs to confront the parents while the child is PRESENT. Many issues that a child has begins at home and is brought to the school through anger, embarassment, or if the child's sibling is the one that hits them and is at school with them. \n \n A child has a fragile mind....and it is up to NO adult whether or not they get to abuse it. thats my opinion. \n \n chew on that emoticon_xgood", 
   {}, 
   188134, 
   null, 
   1135645740.0
  ], 
  [
   188148, 
   null, 
   "Fishbulb", 
   "Sorry Bassman, but your claim is just plain factually wrong.\n \n http://www.ojp.usdoj.gov/bjs/pub/press/iscs04pr.htm\n \n \nCrime in the nation's schools continued to fall between 1992 and 2002, reflecting the decline in the national crime rate, according to the Department of Justice's Bureau of Justice Statistics (BJS) and the Department of Education's National Center for Education Statistics (NCES). During these years, school crime dropped from 48 violent victimizations per 1,000 students to 24 per 1,000. Between 1995 and 2003, the percentage of students who reported being a victim of a crime of violence or theft at school also declined-from 10 percent to 5 percent. In 2002, as in previous years, students from 12-18 years of age were more likely to be victims of nonfatal serious violent crime away from school than at school.\n\n \n Also:\n \nAmong high school students in grades 9-12, the percentage reporting having been in a fight on school property declined between 1993 and 2003 from 16 percent to 13 percent. In 2003, about 9 percent of 9th -12th grade students reported being threatened with injury or having suffered an injury from a weapon while at school. Twelve percent of male students and 6 percent of female students reported experiencing a threat or injury in that year.\n\n \n Similar statistics are also reported here:\n http://www.safeyouth.org/scripts/faq/physfightstats.asp\n \nThere has actually been a significant decline in physical fighting in the last decade. Between 1991 and 2001, physical fighting among high school students decreased by almost 22%. In 1991, 42.5% of students reported involvement in a fight in the past 12 months, while in 2001, 33.2% of students reported fighting.\n\n \n While the incidents you speak of in Buffalo are indeed a problem (could you possibly provide a link to a news article?), they are hardly indicative of any kind of national trend, as you might like to believe. As with any behavioral problem, it is necessary to look at every factor that might contribute, such as the students' home life, and exactly how the school or district deals with such issues (could you provide a link for this as well?).", 
   {
    "unicode_changes_made": true
   }, 
   188134, 
   null, 
   1135647600.0
  ], 
  [
   188200, 
   null, 
   "Justawoman", 
   "All you have to do is be in public for 5 minutes and you realize that most parents don't dicipline their children. I think the child brings this, \" I can do anything\" attitude to school with them. \n \n If a child fights or is destructively disruptive the law is brought in here. They take the chld to the city judge, call the parents, and a fine follows suit. Then the child has to attend school in a seperate building from the other students to finish out their punishment. This setting is next door to the city police building. It takes three disruptive offenses to get you there and one time fighting. \n \n Fighting, bullying, and just plan disrespectful behavior is way down. Hasn't completely stopped because human nature is still just that unpredictable. Now if they could just figure out how to work on teen pregnancies.", 
   {}, 
   188148, 
   null, 
   1135696080.0
  ], 
  [
   188214, 
   null, 
   "Alan Ryan", 
   "Schools are not isolated from the cultural realities of the society in which they operate. It is most unreasonable to expect classrooms to be havens of peaceful learning and respect for others, when every child is at the very least habituated to vicarious and reported violence on the television, computer games, etc. \n \n Schools are not monasteries and they can only reflect the dominant attitudes, norms, and values by which society is influenced at any given time.", 
   {}, 
   188200, 
   null, 
   1135700880.0
  ], 
  [
   188215, 
   null, 
   "simone", 
   "Oooh, the buzzword \"PC\". Is that the chosen buzzword of 2006, Bassman?\n \n All this whining about \"PC\" and attacking Christmas.\n \n Stop the whining and get to work on the problem.", 
   {}, 
   188214, 
   null, 
   1135701120.0
  ], 
  [
   188220, 
   null, 
   "georged", 
   "All you have to do is be in public for 5 minutes and you realize that most parents don't dicipline their children. I think the child brings this, \" I can do anything\" attitude to school with them. \n \n\n \n I agree with that, and if they do discipline them for many parents it seems like screaming at them in public is now the preferred method. \n \n Justice department statistics showing decreases in school violence makes for good political reading, but how much of those not real impressive reductions were accomplished by greatly increased numbers of on-campus guards, metal detectors at funneled down school entry points and closed campuses? Some inner-city high schools I've viewed have the appearance of medium security prisons, including high fences to discourage entry during non-school hours and students leaving during school hours. Containing campus violence through increased security to show good numbers has no impact on the primary cause of violence and below standard reading/math skills, which is poor parenting and social conditions creating indifference to personal responsibility.", 
   {}, 
   188200, 
   null, 
   1135701360.0
  ], 
  [
   188312, 
   null, 
   "jitobear", 
   "Unfortunately, without consequences for bad behavior, a healthy respect for authority cannot be established. With the PC crowd in the schools screaming, \"don't discipline the kids,\" the kids turn out to become gangbanging thugs, criminals, or miscreants.\n\n \n There are many things that make a criminal. And nobody is saying not to discipline kids. Where do you get this stuff? One must be 100% in agreement with you on every detail or they just oppose? My word what an ego!", 
   {}, 
   188134, 
   null, 
   1135731060.0
  ], 
  [
   188316, 
   null, 
   "Bassman", 
   "ANYWAYS!!! I digress. There will be an anternative school set up in the city for September '06. Let's make sure that we don't just throw any more money at the problem.", 
   {
    "post_info": {
     "post_title": "Yeah! My ego is so big that it fills my apartment, LOL!"
    }
   }, 
   188312, 
   null, 
   1135732740.0
  ], 
  [
   188569, 
   null, 
   "Charliegone", 
   "Well, there can be many factors that lead to school violence or lack of control of students.\n \n 1. Parents\n They aren't there or just plain irresponsible and don't care about where their kids are, who their friends are, etc etc.\n \n 2. Teachers\n Some just care about their pay check and can care less if the kids get educated or not. Some are just \"chalk and talk\" and do not create an environment of learning. If they want kids in school, adapt learning to their environment. Lets say some kids are \"drug runners\" (I know I might get flamed for this but..). If, lets say, the math teacher wants the kids to get educated, she will make math problems that will reflect their \"profession.\" Like \"how much crack does Johnny need to sell in order to make ... blah blah \" you get the point. A teachers job is, of course, to educate on stuff like math, science etc. Not moral values. That belongs to the number 1 up there.\n \n 3. I would say the lack of social capital.\n Too many people now a days are no longer involved in the \"community,\" but instead are involved in groups like the NRA or NOW, which hardly requires free personal time. People are not involved anymore. It has gotten so bad that some people do not even care what their politicians or leaders do. They just go along like the sheep they are. Well, how does this affect a child? Well, just think about it. If a child is being a problem, the community as a whole will be always willing to help. I am in no way advocating socialism or communism, in fact, I hate those two things (because they DO NOT work.), but what I mean is that if people want to put a stop at violence, poor education, etc people have to stick together. If they just keep acting selfish, nothing will ever be accomplished.", 
   {}, 
   188316, 
   null, 
   1135850760.0
  ], 
  [
   188863, 
   null, 
   "Wez", 
   "2. Teachers\n Some just care about their pay check and can care less if the kids get educated or not. Some are just \"chalk and talk\" and do not create an environment of learning. If they want kids in school, adapt learning to their environment. Lets say some kids are \"drug runners\" (I know I might get flamed for this but..). If, lets say, the math teacher wants the kids to get educated, she will make math problems that will reflect their \"profession.\" Like \"how much crack does Johnny need to sell in order to make ... blah blah \" you get the point. A teachers job is, of course, to educate on stuff like math, science etc. Not moral values. That belongs to the number 1 up there.\n\n What happens if the parents don't teach moral values? Who will do it?\n \n If teachers souldn't teach moral values, why can't kids swear, lie and abuse people in school?\n \n I'll make a new thread about it.\n \n \n3. I would say the lack of social capital.[...]I am in no way advocating socialism or communism, in fact, I hate those two things (because they DO NOT work.), \n\n Hmm. Which countries have the best educaiton systems?:p It's certainly not the, comparitively, conservative US. It's more 'socialist' countries like Germany...\n \n -Wez", 
   {}, 
   188569, 
   null, 
   1135954860.0
  ], 
  [
   188873, 
   null, 
   "simone", 
   "Showing respect for people by not swearing and by not abusing them is a subset of morality that teachers are obligated to teach their students if their students have not been subjected to respectable behaviour in their homes.\n \n I don't quite see not swearing or not abusing people to be narrowly defined as \"morality,\" whatever the Hades \"morality\" is.", 
   {}, 
   188863, 
   null, 
   1135957680.0
  ], 
  [
   188885, 
   null, 
   "Wez", 
   "Showing respect for people by not swearing and by not abusing them is a subset of morality that teachers are obligated to teach their students if their students have not been subjected to respectable behaviour in their homes.\n\n That's the kind of 'morality' I'm talking about though. I don't mean morality with regards to abortion, the death penalty, homosexuality etc. I don't think 5-8 year olds should really be taking part in discussions on such issues.\n \n -Wez", 
   {}, 
   188873, 
   null, 
   1135959900.0
  ], 
  [
   188894, 
   null, 
   "simone", 
   "Actually, such \"morality\" teaching, if you are referring to respecting others, learning to listen, learning to use appropriate language, begins in kindergarten or pre-kindergarten if pre-kindergarten is available.\n \n Kids are taught to be reasonably unwiggly, to maintain short periods of silence and keeping still and learning to listen to others. I really think that extremely healthy fitness instructors should teach kindergarten level and primary level kids, that kids at those ages should be kept relatively active so that they can develop their large motor skills appropriately and not grow up to be fat little couch retards who watch television all the time.\n \n Even through high school kids should not be kept silent and inactive, as long as they know how to break the silence in appropriate ways--save for times when revolution is necessary.\n \n Every student, male and female, should have access to noncompetitive sports.\n \n For some reason, competitive sports, male-dominated competitive sports, seem to be the most important aspect of a school system, especially in Texas. This stupid competitiveness can lead to gang warfare between schools and probably generally contributes to the gang mentality that runs rampant in the United States.", 
   {}, 
   188885, 
   null, 
   1135962480.0
  ], 
  [
   188899, 
   null, 
   "simone", 
   "http://www.nytimes.com/2005/12/30/opinion/30fri2.html\n \n December 30, 2005\n Editorial\n A College Sports Scam \n The myth of salvation through college and professional sports is a blight on poor communities all over the country. Suckered into chasing a chimerical \"ticket out of the ghetto,\" young people devote every waking moment to athletics while neglecting studies that would actually prepare them for reachable careers. Those who get to college at all often play their hearts out until they are no longer eligible and end up back on the streets - without hope, prospects or even college degrees. \n \n The National Collegiate Athletic Association has tried to break this cycle by gradually raising admissions requirements for athletes. The point was to force parents, schools and players to get serious about their high school education. But a recent scandal at a Florida diploma mill, exposed by Pete Thamel and Duff Wilson of The Times, shows that the N.C.A.A. has a lot more work to do before it reaches this goal. \n \n The story involves University High School, a transparently bogus correspondence school that offered high school degrees for a pittance, but had no classes or instructors and operated virtually without oversight. Athletes who had failed courses they needed to qualify were offered easy-listening studies and pathetically simple tests that allowed them to polish up their transcripts in no time at all. They were then funneled into some of the most important football programs in the country and, predictably, have not fared well.\n \n The N.C.A.A., which was slow off the mark when the scam came to light, has since appointed a panel that will examine correspondence schools and other \"nontraditional\" institutions that feed athletes into the billion-dollar business known as college sports. \n \n The panel should not stop there. At the very least, it needs to develop methods for scanning academic records for unexplained jumps in student achievement. Something is clearly fishy when a failing athlete switches schools and ends up with a transcript that conveniently meets the N.C.A.A. qualifications for college athletes. \n \n The N.C.A.A. academic reforms, started two decades ago, were supposed to end the exploitation of athletes and send the message that players needed to learn and graduate if they wanted to compete at the big-time college level. The dust-up in Florida should remind everyone involved that the job of reforming college sports is far from finished.", 
   {
    "post_info": {
     "post_title": "How Black Kids Are Screwed by the Sports Illusion"
    }
   }, 
   188894, 
   null, 
   1135963260.0
  ], 
  [
   188911, 
   null, 
   "Wez", 
   "Actually, such \"morality\" teaching, if you are referring to respecting others, learning to listen, learning to use appropriate language, begins in kindergarten or pre-kindergarten if pre-kindergarten is available.\n\n I'm not sure why you've added \"Actually\", seeing as nothing I said disagreed with that paragraph.\n \n I agree with less competative sport. Not only does it keep people fit, but team sports force people to work together. If the teams are chosen by teachers, or decided on in a fair way, you end up with fun games where kids who normally wouldn't work together, do.\n \n \nHow Black Kids Are Screwed by the Sports Illusion\n\n The article said nothing about blacks. It mentioned 'the poor', (so more likely to be black), but wasn't exclusively about them.\n \n -Wez", 
   {}, 
   188894, 
   null, 
   1135970700.0
  ], 
  [
   189002, 
   null, 
   "Mickey Shane", 
   "Unfortunately, without consequences for bad behavior, a healthy respect for authority cannot be established. With the PC crowd in the schools screaming, \"don't discipline the kids,\" the kids turn out to become gangbanging thugs, criminals, or miscreants.\nI think that they are kids. They are only scary to each other, not to me. I grew up in military schools. I was beaten silly for major infractions, like my shirt tail being untucked. I'm 50 years old, and I'm just now starting to feel comfortable around authority figures. I guess it's because I'm old enough to be their father now. They are starting to treat me with a little respect.\n \n I don't know how to fix the problem of violent kids in school that don't get any disipline at home, but I can tell you one thing for sure:\n \n YOU CANNOT ESTABLISH A HEALTHY RESPECT FOR AUTHORITY IN A CHILD BY BEATING THEM.\n \n rant over,\n \n I think that someone needs to mentor some of these young gang banging, fatherless, motherless children.\n \n Positive reinforcement through a genuine care.", 
   {}, 
   188134, 
   null, 
   1135994760.0
  ], 
  [
   189051, 
   null, 
   "Heads_On_Pikes", 
   "\n \n I don't know how to fix the problem of violent kids in school that don't get any disipline at home, but I can tell you one thing for sure:\n \n YOU CANNOT ESTABLISH A HEALTHY RESPECT FOR AUTHORITY IN A CHILD BY BEATING THEM.\n \n \n\n \n I don't know about that.\n \n I well recall a middle school gym teacher who had a thick paddle with holes drilled in it for better aerodynamics that the woods shop teacher made for him. Swimming class was the worst. If you were caught horsing around or dunking other kids you came out of the water and stood at the edge of the pool at the deep end. You then bent over and grabbed your ankles and were whacked in the arse hard enough to knock you into the pool. In wet swimming trunks...talk about stinging!\n \n Mr. Vernetti and the woods shop teacher Mr. Green were far and away the most respected teachers in the school.", 
   {}, 
   189002, 
   null, 
   1136008500.0
  ], 
  [
   189058, 
   null, 
   "Bassman", 
   "Not to mention that when you got into trouble at school, there was more wating trouble waiting for you at home.", 
   {}, 
   189051, 
   null, 
   1136013960.0
  ], 
  [
   189093, 
   null, 
   "Mickey Shane", 
   "I don't know about that.\n \n I well recall a middle school gym teacher who had a thick paddle with holes drilled in it for better aerodynamics that the woods shop teacher made for him. Swimming class was the worst. If you were caught horsing around or dunking other kids you came out of the water and stood at the edge of the pool at the deep end. You then bent over and grabbed your ankles and were whacked in the arse hard enough to knock you into the pool. In wet swimming trunks...talk about stinging!\n \n Mr. Vernetti and the woods shop teacher Mr. Green were far and away the most respected teachers in the school.\nThick paddles and the tight trousers of the time were bad enough. I would guess that wet swimming trunks were just that much worse! \n \n I'm not against paddling. I was beat up by a 30 something gym teacher for drawing cartoon characterizations of the faculty during an especially boring 'health class'. I was 13 and skinny at the time. This fat man was repeatedly punching me in the chest with the palm of his hand and throwing me around, bouncing me off of the lockers in the privacy of the locker room. I was so sore that I couldn't take a deep breath for two weeks.\n \n Should anyone from Minot N. Dakota be reading this, his name is Mr. Hurd. He would be in his mid to late sixties now.", 
   {}, 
   189051, 
   null, 
   1136046780.0
  ], 
  [
   189097, 
   null, 
   "simone", 
   "I don't know about that.\n \n I well recall a middle school gym teacher who had a thick paddle with holes drilled in it for better aerodynamics that the woods shop teacher made for him. Swimming class was the worst. If you were caught horsing around or dunking other kids you came out of the water and stood at the edge of the pool at the deep end. You then bent over and grabbed your ankles and were whacked in the arse hard enough to knock you into the pool. In wet swimming trunks...talk about stinging!\n \n Mr. Vernetti and the woods shop teacher Mr. Green were far and away the most respected teachers in the school.\nWooohoohooo! Talk about the underlying sexual context of these teachers' attacks! Tsk! Tsk!", 
   {}, 
   189051, 
   null, 
   1136050080.0
  ], 
  [
   189167, 
   null, 
   "Justawoman", 
   "I don't know about that.\n \n I well recall a middle school gym teacher who had a thick paddle with holes drilled in it for better aerodynamics that the woods shop teacher made for him. Swimming class was the worst. If you were caught horsing around or dunking other kids you came out of the water and stood at the edge of the pool at the deep end. You then bent over and grabbed your ankles and were whacked in the arse hard enough to knock you into the pool. In wet swimming trunks...talk about stinging!\n \n Mr. Vernetti and the woods shop teacher Mr. Green were far and away the most respected teachers in the school.\n\n \n \n Did you actually respect these two men or just fear being punished? There is a difference. You kick an animal long enough and it learns to avoid your foot, or it lashes back out eventually. But if you show respect you get respect back. How would you have felt towards the swim coach if he had made you do several more laps for horseplay, instead of the paddling?", 
   {}, 
   189051, 
   null, 
   1136093220.0
  ], 
  [
   189174, 
   null, 
   "Heads_On_Pikes", 
   "Did you actually respect these two men or just fear being punished? There is a difference. You kick an animal long enough and it learns to avoid your foot, or it lashes back out eventually. But if you show respect you get respect back. How would you have felt towards the swim coach if he had made you do several more laps for horseplay, instead of the paddling?\n\n \n Oh, I respected both teachers, very much so. I can count on one hand the teachers I remember by name after all these years. (graduated high school 1979) If you remember their name after so much time, you know you respected them.\n \n At the time I could do nearly two pool lengths underwater just for fun! And, the paddling thing....there was a bit of humor to it, a \"had to be there kind of humor\". We kept a running tally of who had the most wet arse smackings into the pool. \n \n (Simone, calm yourself!)\n \n My point is; these types of teachers are damn good teachers. They know how to teach and they also know how to teach about life.", 
   {}, 
   189167, 
   null, 
   1136099820.0
  ], 
  [
   189215, 
   null, 
   "simone", 
   "So, did the bullies cease being bullies after being subjected to the paddle treatment?", 
   {}, 
   189174, 
   null, 
   1136137440.0
  ], 
  [
   190345, 
   null, 
   "Bell", 
   "Did you actually respect these two men or just fear being punished?\n\n \n While I am against physical violence and corporal punishment, and hate to admit this, I can personally attest that getting physical in some schools, with some students, is the only way to exert your authority and get them to straighten up and respect you. Students, and many people, respect physical superiority. And in the some situations, I wouldn't care if the students feared me or respected me, so long as the work was getting learned.\n \n I was working as a teacher in an inner city school with gun, drug, and violence problems in Cincinnati. I had a conflict with a young man of 18 for several months. It finally came to a head when he grabbed my chest from behind and made very suggestive comments. My martial arts training kicked in, and I turned around and threw that boy about five feet. He was shocked, as was all his classmates who witnessed. After that point, I had no problems with discipline with any students. I was not brought up on any charges; in fact, the school's posted cop wanted to charge him with assault. \n \n I would encourage all teachers to learn martial arts or self-defense of some kind. It's unfortunate, and as a passifist I have a hard time admitting it, but if every student knew the teacher could physically and intellectually better them, it may help to create an environment more conducive to learning.", 
   {}, 
   189215, 
   null, 
   1136599020.0
  ], 
  [
   190633, 
   null, 
   "jitobear", 
   "While I am against physical violence and corporal punishment, and hate to admit this, I can personally attest that getting physical in some schools, with some students, is the only way to exert your authority and get them to straighten up and respect you. Students, and many people, respect physical superiority. And in the some situations, I wouldn't care if the students feared me or respected me, so long as the work was getting learned.\n \n I was working as a teacher in an inner city school with gun, drug, and violence problems in Cincinnati. I had a conflict with a young man of 18 for several months. It finally came to a head when he grabbed my chest from behind and made very suggestive comments. My martial arts training kicked in, and I turned around and threw that boy about five feet. He was shocked, as was all his classmates who witnessed. After that point, I had no problems with discipline with any students. I was not brought up on any charges; in fact, the school's posted cop wanted to charge him with assault. \n \n I would encourage all teachers to learn martial arts or self-defense of some kind. It's unfortunate, and as a passifist I have a hard time admitting it, but if every student knew the teacher could physically and intellectually better them, it may help to create an environment more conducive to learning.\n\n \n Sounds like self defense, which is a far cry from corporal punishment. If my kid pulled a stunt like that on a staff person I would expect he get tossed accross the room - and face charges.", 
   {}, 
   190345, 
   null, 
   1136764500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Schools a war zone?", 
  "url": "http://www.4forums.com/political/education-debates/7177-schools-war-zone.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 7177, 
  "discussion_files": [
   [
    "10123.html", 
    "http://www.4forums.com/political/education-debates/7177-schools-war-zone-print.html"
   ], 
   [
    "10124.html", 
    "http://www.4forums.com/political/education-debates/7177-schools-war-zone-3-print.html"
   ], 
   [
    "10125.html", 
    "http://www.4forums.com/political/education-debates/7177-schools-war-zone-2-print.html"
   ]
  ], 
  "identifier": 7177
 }
]