[
 [
  [
   188086, 
   null, 
   "Matthew S", 
   "I just saw brokeback and it does follow the book exactly. Very very sad I left the theatre crying. This is definatly a love story between two men who happen to be cowboys. I was also shaking with rage that people would have to actully live thier lives like the two guys in the movie. Stories like this highten my dislike heterosexism that makes people deny love so they don't get beaten to death.\n \n To all my gay brothers and lesbian sisters, please go see this movie there wasn't a dry eye in the full theatre. If brokeback makes money more mainstream glbt themed movies will be made.", 
   {
    "post_info": {
     "post_title": "Brokeback mountain"
    }
   }, 
   null, 
   null, 
   1135625280.0
  ], 
  [
   188149, 
   null, 
   "Steeeeve", 
   "get over yourself...the movie is shown in like 200 places located in gay areas. It isn't really a blockbuster.", 
   {}, 
   188086, 
   null, 
   1135648560.0
  ], 
  [
   188160, 
   null, 
   "joebrummer", 
   "get over yourself...the movie is shown in like 200 places located in gay areas. It isn't really a blockbuster.\n\n \n \n \n hold your breathy buddy, full release of the film doesn't occur until the mid of january. then what will you say?", 
   {}, 
   188149, 
   null, 
   1135653300.0
  ], 
  [
   188170, 
   null, 
   "Matthew S", 
   "get over yourself...the movie is shown in like 200 places located in gay areas. It isn't really a blockbuster.\n\n \n \n I saw it in ann arbor, on friday, at the 20 theatre megaplex right off I94 and us23. Brokeback is top billed as big as day on the marquee. The theatre was packed at 150pm and not a dry eye in the place, I even heard sobbing (me mostly). Word of warning there were 15 min of previews, mostly for crappy movies. The movie is stunning and it will win the oscar. Jake and Heath bring these characters to life and make a very strong presence on the screen. I strongly suggest y'all go see this movie. Besides Jake is just so darn cute, yes he is the bottom.", 
   {}, 
   188149, 
   null, 
   1135659780.0
  ], 
  [
   188172, 
   null, 
   "Steeeeve", 
   "No doubt it will win all the awards but it won't be for the \"quality\" of the movie. Hollywood loves a movie that goes \"against\" the grain even if it wasn't that great. \n \n Why hasn' this film been out anyway?", 
   {}, 
   188170, 
   null, 
   1135661340.0
  ], 
  [
   188173, 
   null, 
   "Missouri Mule", 
   "I hate \"message\" films. I won't be seeing it although I happen to like westerns very much. No tears here.", 
   {}, 
   188172, 
   null, 
   1135661820.0
  ], 
  [
   188176, 
   null, 
   "joebrummer", 
   "I hate \"message\" films. I won't be seeing it although I happen to like westerns very much. No tears here.\n\n it isn't a message film, more of a love story.", 
   {}, 
   188173, 
   null, 
   1135664460.0
  ], 
  [
   188182, 
   null, 
   "Missouri Mule", 
   "How can it not be a \"message\" film since the subject matter is bound by its subject matter to be so controversial?\n \n I haven't seen the movie, have no plans to see the film but would have suggested that the hint of the subject matter have been extremely discreet. From what I have seen it is far too blatant and that highlights the subject matter and detracts from an entertainment movie that I would want to see. Therefore, I conclude it is a \"message\" film.", 
   {}, 
   188176, 
   null, 
   1135666440.0
  ], 
  [
   188185, 
   null, 
   "Steeeeve", 
   "the love story protrayed is very generic which is why I think it is overhyped. It may very well be a well done movie but the fact that it is unappealing to a large audience (families) and is generic overshadowes any quality in acting etc...", 
   {}, 
   188182, 
   null, 
   1135668240.0
  ], 
  [
   188188, 
   null, 
   "coolcodemn3", 
   "The one thing im mad about is how this movie will win all of these oscars and The passion of the Christ which was a very good movie, and a box office hit won nothing,I cant recall if they were even nominated.", 
   {}, 
   188185, 
   null, 
   1135677720.0
  ], 
  [
   188239, 
   null, 
   "Missouri Mule", 
   "The one thing im mad about is how this movie will win all of these oscars and The passion of the Christ which was a very good movie, and a box office hit won nothing,I cant recall if they were even nominated.\n\n \n The reason is simple. The \"Passion of the Christ\" was not politically correct. The left-wing political types controls the Oscars and they nominate and vote in what they want to fit their political agenda. Ever wonder why \"Shakespeare in Love\" beat out \"Saving Private Ryan?\" Wonder no more.\n \n So we will get a movie about a couple of fictional gay cowboys and it will \"break new ground\" and the liberal elites will fawn all over it. We'll get to see the producers and director cry on stage and how this is all so good for humanity, blah, blah, blah. Just a further road down the road to total human depravity. Hollywood leads the way.\n \n The only thing that traditional Americans can do is to boycott the Oscar presentations. Hit them in the wallet where it counts.", 
   {}, 
   188188, 
   null, 
   1135707720.0
  ], 
  [
   188244, 
   null, 
   "joebrummer", 
   "The one thing im mad about is how this movie will win all of these oscars and The passion of the Christ which was a very good movie, and a box office hit won nothing,I cant recall if they were even nominated.\n\n \n \n Sorry to say, Passion was long, in another language with subtitles. It was more blood and gore than substance in the script. It was a good movie, but not excellent.", 
   {}, 
   188188, 
   null, 
   1135708620.0
  ], 
  [
   188246, 
   null, 
   "joebrummer", 
   "How can it not be a \"message\" film since the subject matter is bound by its subject matter to be so controversial?\n \n I haven't seen the movie, have no plans to see the film but would have suggested that the hint of the subject matter have been extremely discreet. From what I have seen it is far too blatant and that highlights the subject matter and detracts from an entertainment movie that I would want to see. Therefore, I conclude it is a \"message\" film.\n\n \n \n If it were a message film, then it would be focused on the fact they are gay. It isn't focused on that. In fact it is never discussed at all.\n \n The focus of the story is their relationship, not their sexuality. It doesn't really focus on sex at all.", 
   {}, 
   188182, 
   null, 
   1135708800.0
  ], 
  [
   188248, 
   null, 
   "Steeeeve", 
   "Sorry to say, Passion was long, in another language with subtitles. It was more blood and gore than substance in the script. It was a good movie, but not excellent.\n\n \n Passion of the Christ was a really good movie but I am not sure it deserved Movie of the Year (and it didn't get it) although it shoulda been nominated because it was one of the better movies. I am not too sure about the blood and gore thing...it depicted the pain very well I thought...kinda like Saving Private Ryan did...it wasn't that long either and the fact that it was in a different language was impressive IMO...it's not easy to do a successful movie that way. \n \n \nIf it were a message film, then it would be focused on the fact they are gay. It isn't focused on that. In fact it is never discussed at all.\n \n The focus of the story is their relationship, not their sexuality. It doesn't really focus on sex at all.\n It does focus on the fact that they are gay...thats the whole point of the movie...they can't be together because society doesn't accept them etc...It has the same plot as every lifetime movie but with 2 men instead of a guy and girl.", 
   {}, 
   188244, 
   null, 
   1135709520.0
  ], 
  [
   188262, 
   null, 
   "joebrummer", 
   "\n It does focus on the fact that they are gay...thats the whole point of the movie...they can't be together because society doesn't accept them etc...It has the same plot as every lifetime movie but with 2 men instead of a guy and girl.\n\n \n Sorry, but you are just wrong. I have read the story and it focuses much more on their lives and relationships. It never mentions them being gay. It isn't discussed in the movie or the book except for one line.\n \n \n So you would call every lifetime movie a \"straight\" move. Do those movies focus on the fact the boy and girl are straight or do they just focus on the lives and relationships. Reverse the scenario and see if you argument still makes sense.", 
   {}, 
   188248, 
   null, 
   1135712760.0
  ], 
  [
   188267, 
   null, 
   "Missouri Mule", 
   "If it were a message film, then it would be focused on the fact they are gay. It isn't focused on that. In fact it is never discussed at all.\n \n The focus of the story is their relationship, not their sexuality. It doesn't really focus on sex at all.\n\n \n Why is it controversial, then?", 
   {}, 
   188246, 
   null, 
   1135713960.0
  ], 
  [
   188271, 
   null, 
   "joebrummer", 
   "Why is it controversial, then?\n\n \n \n WHy is anything controversial? This time it is because the romance in the film is between to men. But the focus of the film is on the romance, not the fact it is between two men.", 
   {}, 
   188267, 
   null, 
   1135714740.0
  ], 
  [
   188286, 
   null, 
   "BobNelson2", 
   "Why is it controversial, then?\n\n \n In part, because some people (including you) can't get past the gay stuff. If BBM was about a hetero couple and had the same cinematography, the same level of acting, it would be getting the much of the same praise it's getting now. \n \n I can't for the life of me, however, think of what sort of story line would account for keeping the lovers apart their entire lives. Can you? Maybe Steeeeve can. He watches Lifetime alot, apparently.", 
   {}, 
   188267, 
   null, 
   1135722960.0
  ], 
  [
   188287, 
   null, 
   "BobNelson2", 
   "the love story protrayed is very generic \n\n \n What an absurd thing to say. What percentage of love stories involve couples kept apart for their entire lives?\n \n Name a couple.", 
   {}, 
   188185, 
   null, 
   1135723020.0
  ], 
  [
   188288, 
   null, 
   "BobNelson2", 
   "The one thing im mad about is how this movie will win all of these oscars and The passion of the Christ which was a very good movie, and a box office hit won nothing,I cant recall if they were even nominated.\n\n \n PotC was a mediocre movie which struck a very deep chord for many people. It was intensely manipulative. It may have been an important experience for many people... it wasn't a great film.", 
   {}, 
   188188, 
   null, 
   1135723200.0
  ], 
  [
   188296, 
   null, 
   "Steeeeve", 
   "What an absurd thing to say. What percentage of love stories involve couples kept apart for their entire lives?\n \n Name a couple.\n\n \n Romeo and Juliet to name one famous one...2 people that can't be together because of circumstances outside their control. I can think of some more later...I gotta ask a chick flick expert first for the actual names as I try not to remember them.", 
   {}, 
   188287, 
   null, 
   1135727100.0
  ], 
  [
   188297, 
   null, 
   "Steeeeve", 
   "PotC was a mediocre movie which struck a very deep chord for many people. It was intensely manipulative. It may have been an important experience for many people... it wasn't a great film.\n\n \n Based on what? Was it generic? No, it has never been done to this level and was done in a different language. Was it well directed? Yes, hard to say otherwise. Did it do a good job protraying what it was supposed to (plot)? Very much so. Did the audience like it? It was one of the top movies in 04. For a movie that was supposed to flop it sure did pretty well.\n \n The gore part really bugs me...What did you think it was gonna be? Rainbows and butterflies? As the story goes, Jesus had the full wrath of God on him for that time period...This is supposed to be the sickest, most hurtful, gut wrenching thing you have ever seen....it seems it did that very well and now you have a little taste of what Jesus through (for those of you that believe in Him atleast)", 
   {}, 
   188288, 
   null, 
   1135727280.0
  ], 
  [
   188309, 
   null, 
   "Missouri Mule", 
   "WHy is anything controversial? This time it is because the romance in the film is between to men. But the focus of the film is on the romance, not the fact it is between two men.\n\n \n Are you kidding me? It is purely a gay propaganda film.", 
   {}, 
   188271, 
   null, 
   1135730640.0
  ], 
  [
   188310, 
   null, 
   "Truthsayer", 
   "WHy is anything controversial? This time it is because the romance in the film is between to men. But the focus of the film is on the romance, not the fact it is between two men.\n\n \n It shouldn't be controversial but it is. Too many people living today still are not able to get beyond the fact that the romance involves two dudes.", 
   {}, 
   188271, 
   null, 
   1135730880.0
  ], 
  [
   188317, 
   null, 
   "Missouri Mule", 
   "It shouldn't be controversial but it is. Too many people living today still are not able to get beyond the fact that the romance involves two dudes.\n\n \n The idea that two males having anal intercourse is disgusting to me. I can't speak for everyone but I think this is what most normal people believe. Would I be wrong?", 
   {}, 
   188310, 
   null, 
   1135732920.0
  ], 
  [
   188321, 
   null, 
   "JakeCJB", 
   "The idea that two males having anal intercourse is disgusting to me. I can't speak for everyone but I think this is what most normal people believe. Would I be wrong?\n\n \n That's a question of personal taste, like any sexual position.", 
   {}, 
   188317, 
   null, 
   1135734420.0
  ], 
  [
   188327, 
   null, 
   "Matthew S", 
   "Come on guys see the movie there are several hetero sex scenes in this movie too. Heaths character, Ennis, has more on screen sex with his wife then he has with Jakes character, Jack. There is even female breasts shown, for the lesbians I assume. The first 30min they are just herding sheep and doing cowboy stuff.\n \n I am not sure anyone should negatively put down this movie without seeing it first.\n It is a love story much as Romeo and Juliet except it is Romeo and Romeo.", 
   {}, 
   188321, 
   null, 
   1135735560.0
  ], 
  [
   188340, 
   null, 
   "joebrummer", 
   "The idea that two males having anal intercourse is disgusting to me. I can't speak for everyone but I think this is what most normal people believe. Would I be wrong?\n\n \n \n \n Just the fact you had to make this speech is suspect enough!\n \n \n Most normal people don't give a rats...", 
   {}, 
   188317, 
   null, 
   1135740660.0
  ], 
  [
   188342, 
   null, 
   "Steeeeve", 
   "actually, I think most people don't want to see 2 dudes having sex on a movie screen. I would like to know why you think otherwise.", 
   {}, 
   188340, 
   null, 
   1135741200.0
  ], 
  [
   188344, 
   null, 
   "joebrummer", 
   "actually, I think most people don't want to see 2 dudes having sex on a movie screen. I would like to know why you think otherwise.\n\n \n \n To start with, that isn't in the movie\n \n to finish with.....most people don't care. If they don't want to see it they won't.", 
   {}, 
   188342, 
   null, 
   1135742220.0
  ], 
  [
   188345, 
   null, 
   "Matthew S", 
   "To start with, that isn't in the movie\n \n to finish with.....most people don't care. If they want to see it they won't.\n\n \n \n Thats not quite true there is one gay sex scene in the movie but not alot of skin.", 
   {}, 
   188344, 
   null, 
   1135742700.0
  ], 
  [
   188347, 
   null, 
   "joebrummer", 
   "Thats not quite true there is one gay sex scene in the movie but not alot of skin.\n\n it is implied, but you don't see anything. not to mention it is very short.\n \n \n mostly I don't think a bunch of straight guys should bother making comments about something they don't really know about. It they read the short story or saw the movie I would give some creed to their opinions, but their opinions so far are based on assumptions not facts. Basically worthless.", 
   {}, 
   188345, 
   null, 
   1135743120.0
  ], 
  [
   188349, 
   null, 
   "Matthew S", 
   "it is implied, but you don't see anything. not to mention it is very short.\n \n \n mostly I don't think a bunch of straight guys should bother making comments about something they don't really know about. It they read the short story or saw the movie I would give some creed to their opinions, but their opinions so far are based on assumptions not facts. Basically worthless.\n\n \n \n Argeed. emoticon_xgood \n \n So when Ennis pulls his pants down turns Jack over pulls Jacks pants down and Jack grunts: that is some how implied?", 
   {}, 
   188347, 
   null, 
   1135744200.0
  ], 
  [
   188350, 
   null, 
   "joebrummer", 
   "Argeed. emoticon_xgood \n \n So when Ennis pulls his pants down turns Jack over pulls Jacks pants down and Jack grunts: that is some how implied?\n\n \n \n \n if you don't see it, but you are suppose to understand what is happening, yes, it is implied. You didn't see it happen, but you that it did.", 
   {}, 
   188349, 
   null, 
   1135744260.0
  ], 
  [
   188352, 
   null, 
   "Steeeeve", 
   "To start with, that isn't in the movie\n \n to finish with.....most people don't care. If they don't want to see it they won't.\n\n \n If they don't want to see it then doesn't that mean that they care not to see it and those give a rats.... as you say. \n \n \n As much as I don't want to see this movie...I might just have to so I can confirm everything I already know..but you are right, I can't speak too much about it without actually seeing it, when it comes within 300miles of where I live I might be able to see it :p", 
   {}, 
   188344, 
   null, 
   1135746240.0
  ], 
  [
   188372, 
   null, 
   "Matthew S", 
   "If they don't want to see it then doesn't that mean that they care not to see it and those give a rats.... as you say. \n \n \n As much as I don't want to see this movie...I might just have to so I can confirm everything I already know..but you are right, I can't speak too much about it without actually seeing it, when it comes within 300miles of where I live I might be able to see it :p\n\n \n It is in Washington DC, which I believe is within 300 miles of anywhere in virginia. \n 10.\n Loews Cineplex Dupont 5\n 1350 19th St. NW \n Washington, DC \n 202-872-9556 \n \n 2.19 Mi\n \n The tiny Dupont theater that focuses on indie films.\n Average Reader Rating: \n Map http://www.washingtonpost.com/ac2/wp-dyn?node=cityguide/map&mode=single&id=796012&lat=38.9084000&lon=-77.0436000&nm=0&lon=-77.0436000&displaySearchTerm=&displaySearchLocation=washington%20DC \n \n Showtimes for Wed., Dec. 28\n | Other Showtimes \n Capote (Buy movie tickets) 2:10 pm, 4:50 pm, 7:30 pm, 10:10 pm\n \n Brokeback Mountain (Buy movie tickets) 2:00 pm, 3:00 pm, 4:00 pm, 5:00 pm, 6:00 pm, 7:00 pm, 8:00 pm, 9:00 pm, 10:00 pm", 
   {}, 
   188352, 
   null, 
   1135780980.0
  ], 
  [
   188385, 
   null, 
   "Steeeeve", 
   "clearly I am not going to drive 299miles to watch a movie, oh, and parts of VA are 300 miles away from DC but I am a little closer than that :p perhaps I should says 200.", 
   {}, 
   188372, 
   null, 
   1135786860.0
  ], 
  [
   188401, 
   null, 
   "jyoshu", 
   "PotC was a mediocre movie which struck a very deep chord for many people. It was intensely manipulative. It may have been an important experience for many people... it wasn't a great film.\n\n \n That's a matter of opinion, of course. \n \n In terms of cinemetography thought it was one of the most beautiful films ever made.", 
   {}, 
   188288, 
   null, 
   1135792500.0
  ], 
  [
   188437, 
   null, 
   "joebrummer", 
   "That's a matter of opinion, of course. \n \n In terms of cinemetography thought it was one of the most beautiful films ever made.\n\n \n While The Passion of the Christ undoubtedly satisfies Gibson's goal of portraying Christ's last hours consistently with what is in the bible, it does not work as a movie apart from that agenda. Claustrophobic and lacking in context, this is like some sort of instructional film for those who already know the story well. For others, it is a brutal, yet strangely unaffecting picture of vicious torture. If this was any story other than that of a religious icon, it would be roundly trashed for its self importance, its cardboard, oversimplified characters, its failure to explain who is who and what arises from what, and its ponderous self importance. Instead, of course, the debate is over whether it fairly depicts one religious group or another. \n \n The movie covers Jesus' (James Caviezel) story from after the last supper through to his death. While there are a few flashbacks to earlier times, these are rare, and mostly only of Christ's words during the last supper. We are expected to already know the story, thereby giving the brutality of Jewish religious leaders and the Romans a context. From the perspective purely of cinema, particularly for non-Christians, this is a massive failure. To work, this movie needs three times as many flashbacks so we know what it all means, and only a fraction of the brutality - what's the purpose of having us sit through so much of Jesus' torture? It's like showing Gandhi on his deathbed, without bothering to show anything of what he did before, or Martin Luther King at the moment he is shot, again without any context. This will work for some devout Christians, but most viewers will regret the absence of anything more. \n \n Essentially, this movie is a two-hour death scene, and a graphically awful one at that. A lashing at the hands of sadistic Romans leaves Jesus' flesh ripped to shreds, and then - when Jewish leaders stir the gathered Jerusalem throng into a frenzy of hate against the 'blasphemer' - he is sentenced to die, setting the scene for a long and painful (both for him and for us watching) trek carrying the cross to where he will die. \n \n The claustrophobia of the film comes both from its perspective - zeroed right in on the events of this day with few glimpses of what came before and therefore what it all means - and from Gibson's decision to keep the camera close in on Jesus for almost the entire film. We see the crowd around him now and again, but the only visuals in this film that you will remember are of Jesus' torn flesh and blood. This might be exactly what Gibson intended, as it appears the film is intended more as a religious act of personal significance to the filmmaker than it is a film reaching out for a broad audience - particularly of those less familiar with the story as laid out in the New Testament. For moviegoers without a similar agenda, The Passion of the Christ is nothing but an unpleasant experience. \n http://www.apolloguide.com/mov_fullrev.asp?CID=5128", 
   {
    "unicode_changes_made": true
   }, 
   188401, 
   null, 
   1135800360.0
  ], 
  [
   188471, 
   null, 
   "Steeeeve", 
   "If Jesus were gay or a minority this would have been the best film ever made emoticon_angry I don't like critics at all.", 
   {}, 
   188437, 
   null, 
   1135814160.0
  ], 
  [
   188473, 
   null, 
   "Matthew S", 
   "If Jesus were gay or a minority this would have been the best film ever made emoticon_angry I don't like critics at all.\n\n \n \n Jesus was gay. Come on an unmarried middleaged man who treated women as equals, and hung around with 12 hunky guys. :)\n \n Joe is right POTC was a movie that preached to the chior. You had to be christian to get the message, that and be able to read subtitles quickly. I have the feeling it will be the same with brokeback you have to be gay to get the message.", 
   {}, 
   188471, 
   null, 
   1135814580.0
  ], 
  [
   188482, 
   null, 
   "BobNelson2", 
   "The gore part really bugs me...What did you think it was gonna be?\n\n \n Something resembling standard Roman crucifixion practices maybe??? The horror of crucifixion isn't the over-the-top abuse of the victim BEFORE crucifixion, it's hanging there for days in agony. There is no biblical nor historical basis for the gore-fest that Gibson dreamed up. It's just an extension of the violence in his Mad Max series and cop movies.\n \n I'm surprised (OK, I'm not really surprised) that you wouldn't expect \"biblical accuracy\" in a movie like PofC.", 
   {}, 
   188297, 
   null, 
   1135819740.0
  ], 
  [
   188509, 
   null, 
   "jyoshu", 
   " For moviegoers without a similar agenda, The Passion of the Christ is nothing but an unpleasant experience. \n\n \n Then maybe you sort of somehow DID get the point of it.", 
   {}, 
   188437, 
   null, 
   1135826700.0
  ], 
  [
   188510, 
   null, 
   "jyoshu", 
   "Something resembling standard Roman crucifixion practices maybe??? The horror of crucifixion isn't the over-the-top abuse of the victim BEFORE crucifixion, it's hanging there for days in agony. There is no biblical nor historical basis for the gore-fest that Gibson dreamed up.\n\n \n Apparently you have an awfully naive idea of what a flogging with a Roman whip really did to a person.\n \n (Hint: Yes, things really were brutal and cruel at times in history, the Roman Empire included)", 
   {}, 
   188482, 
   null, 
   1135826880.0
  ], 
  [
   188551, 
   null, 
   "Steeeeve", 
   "Something resembling standard Roman crucifixion practices maybe??? The horror of crucifixion isn't the over-the-top abuse of the victim BEFORE crucifixion, it's hanging there for days in agony. There is no biblical nor historical basis for the gore-fest that Gibson dreamed up. It's just an extension of the violence in his Mad Max series and cop movies.\n \n I'm surprised (OK, I'm not really surprised) that you wouldn't expect \"biblical accuracy\" in a movie like PofC.\n\n \n not a biblical account? He was given the full wrath of God...the movie can't even possibly show that. Perhaps you should read the Bible before you comment on it.", 
   {}, 
   188482, 
   null, 
   1135836420.0
  ], 
  [
   188643, 
   null, 
   "Truthsayer", 
   "The idea that two males having anal intercourse is disgusting to me. I can't speak for everyone but I think this is what most normal people believe. Would I be wrong?\n\n \n I try to keep ideas like that out of my mind as well, but I do know several \"normal\" people that have no problem with the thought of two gay dudes engaging in whatever it is they engage in. I know several in fact. Some on this very site. I would agree that \"most\" normal people would find that utterly disgusting. But I would be slow to say that is what makes them \"normal.\" It is very possible to be normal and not think that way at all.\n \n In fact, the few gay people I do know are just as normal as anybody else I figure. Even \"normal\" people have quirks that other normal people might find abnormal. Nobody owns the \"definition of normal\" these days.\n \n Personally, I think anyone who would eat Parmesan cheese or blood pudding is abnormal. Anyone who actually enjoys gangsta-rap I find to be abnormal.\n Anyone who absorbs Coulter or O'Reilly swill I consider to be abnormal. Anyone who goes door to door passing out religious tracks I find abnormal. I find the artsy-fartsy people who practice fung-shua (sp?) and oriental herbal alternative medicines to be abnormal. Vegetarians.\n \n However, I do not assume the arrogance of projecting my personal definitions of \"normal\" on the rest of society. And those that do....I find abnormal.emoticon_xdonno", 
   {}, 
   188317, 
   null, 
   1135879800.0
  ], 
  [
   188658, 
   null, 
   "Matthew S", 
   "The idea that two males having anal intercourse is disgusting to me. I can't speak for everyone but I think this is what most normal people believe. Would I be wrong?\n\n \n \n Well the idea that a man and a women having intercourse of any kind is disgusting and makes my skin crawl. From my point of view I am normal so any one who believes male/female relations is normal would be considered abnormal.", 
   {}, 
   188317, 
   null, 
   1135881540.0
  ], 
  [
   188744, 
   null, 
   "Truthsayer", 
   "Eating eels, bovine testecles, and monkey brains are considered normal in some places.", 
   {}, 
   188658, 
   null, 
   1135900740.0
  ], 
  [
   188746, 
   null, 
   "tonybrown74", 
   "I love blood pudding!!!", 
   {}, 
   188744, 
   null, 
   1135901220.0
  ], 
  [
   188760, 
   null, 
   "BobNelson2", 
   "not a biblical account? He was given the full wrath of God...the movie can't even possibly show that. Perhaps you should read the Bible before you comment on it.\n\n \n \"the full wrath of God\"... hmm... you'd think that would result in vaporization or something.\n \n As for reading the Bible, been there, done that, more than once. \n \n Maybe my Catholic theology teachers were just too mushy for folks like you. They always emphasized the agony of \"why have you forsaken me?\" over the lashings of the whip.", 
   {}, 
   188551, 
   null, 
   1135906320.0
  ], 
  [
   188761, 
   null, 
   "BobNelson2", 
   "Apparently you have an awfully naive idea of what a flogging with a Roman whip really did to a person.\n \n (Hint: Yes, things really were brutal and cruel at times in history, the Roman Empire included)\n\n \n And you are happy to give a pass to S&M porn. \n \n As for things being brutal and cruel, Hint: Things are still brutal and cruel today.", 
   {}, 
   188510, 
   null, 
   1135906500.0
  ], 
  [
   188929, 
   null, 
   "Steeeeve", 
   "\"the full wrath of God\"... hmm... you'd think that would result in vaporization or something\n Maybe a third read is the charm.", 
   {}, 
   188761, 
   null, 
   1135977180.0
  ], 
  [
   188932, 
   null, 
   "jyoshu", 
   "\"the full wrath of God\"... hmm... you'd think that would result in vaporization or something.\n \n They always emphasized the agony of \"why have you forsaken me?\" over the lashings of the whip.\n\n \n I think that's pretty much the point Steeeve is trying to get you to see. How the heck did you expect Gibson to portray the severity of God forsaking His Son? The physical violence in The Passion is in large part symbolic. Apparently you missed the whole point of the film.", 
   {}, 
   188760, 
   null, 
   1135977900.0
  ], 
  [
   188934, 
   null, 
   "jyoshu", 
   "And you are happy to give a pass to S&M porn.\n\n \n Huh? Where the heck did that come from? Talk about being out of context . . .", 
   {}, 
   188761, 
   null, 
   1135978020.0
  ], 
  [
   188935, 
   null, 
   "jyoshu", 
   "Maybe a third read is the charm.\n\n \n When people read with preconcieved bias against what they are reading, they're always going to read it the way they expected to because of what they bring to it. Even when it's not really that way.", 
   {}, 
   188929, 
   null, 
   1135978200.0
  ], 
  [
   188958, 
   null, 
   "BobNelson2", 
   "I think that's pretty much the point Steeeve is trying to get you to see. How the heck did you expect Gibson to portray the severity of God forsaking His Son? \n\n \n Uh... good acting. Music. Cinematography maybe. That's what a great film can do. Using physical violence to convey meaning or ellicit emotion is a cheap and easy tactic. That's part of the reason that PofC doesn't make the cut and why Gibson isn't considered a great director.\n \n \nThe physical violence in The Passion is in large part symbolic. \n\n \n You've been arguing that it's an accurate portrayal of Roman crucifixion practices. Now you're telling me it's symbolic. GASP! Are you questioning biblical accuracy!?!??!?!?!??!\n \n \nApparently you missed the whole point of the film.\n\n \n Apparently, you can't keep your argument straight.", 
   {}, 
   188932, 
   null, 
   1135981920.0
  ], 
  [
   188959, 
   null, 
   "BobNelson2", 
   "Huh? Where the heck did that come from? Talk about being out of context . . .\n\n \n It's not out of context at all. Some folks enjoy watching that sort of thing.", 
   {}, 
   188934, 
   null, 
   1135982100.0
  ], 
  [
   188960, 
   null, 
   "jyoshu", 
   "That's part of the reason that PofC doesn't make the cut and why Gibson isn't considered a great director.\n\n \n ??? emoticon_wow \n \n The man is an academy award winning director for cryin' out loud. Not to mention Best Picture for a film that HE oversaw everything. Apparenty being gay isn't the ONLY minority you are a part of.\n \n I understand that some people have an aversion to violence. But Gibson wasn't trying to make a film with universal appeal in this case. It was film version of the passion of Christ. No one's trying to make you like it.\n \n \nYou've been arguing that it's an accurate portrayal of Roman crucifixion practices. \n\n \n The violence was both symbolic AND accurate, for the particular crucifixion written about in the Bible. That was Gibson's goal. (He did take some symbolic and artistic license in some places, of course). But all the Biblical elements are there and the times he took artistic license do not detract in any way from the Biblical message.", 
   {}, 
   188958, 
   null, 
   1135982820.0
  ], 
  [
   188961, 
   null, 
   "joebrummer", 
   "When people read with preconcieved bias against what they are reading, they're always going to read it the way they expected to because of what they bring to it. Even when it's not really that way.\n\n \n \n Sounds like you reading any pro-gay post on this board.\n \n You read what you want, take it for what you wany regardless what it really says. You should heed your own advice.", 
   {}, 
   188935, 
   null, 
   1135982940.0
  ], 
  [
   188979, 
   null, 
   "BobNelson2", 
   "??? emoticon_wow \n \n The man is an academy award winning director for cryin' out loud. Not to mention Best Picture for a film that HE oversaw everything. Apparenty being gay isn't the ONLY minority you are a part of.\n\n \n One win does not make one a \"great director\". My \"great\" set must be smaller than yours.\n \n \nI understand that some people have an aversion to violence. But Gibson wasn't trying to make a film with universal appeal in this case. It was film version of the passion of Christ. No one's trying to make you like it.\n\n \n I can separate my appreciation of film as an art form from whether I actually like a film. It seems that you cannot. Gibson is to be credited for taking a difficult subject matter and making an important film. He's to be credited for taking a substantial risk (mostly financial). I have all sorts of disagreements with him on theology (so does the Pope), but I admire his willingness to put his money where his mouth is. (I kind of wish his deep Catholicism was reflected in his choice of roles over the years, but hey, without all that pointless voilence and crude behavior, he wouldn't have had the bucks to make PotC.)\n \n All that said, he took the easy route by exploiting violence to move people. It's a simple tactic used by everyone from political extremists to the folks who want to stop the seal hunt in the Arctic. When the violence depicted is REAL or an accurate representation of REAL violence, its use is valid. When it is unrealistically over-the-top -- \"symbolic\" to you -- I think it's a cheap trick. It isn't art, it's exploitation. There are a few, very few, exceptions in film history. PotC, in my mind, is not one of them.\n \n \nThe violence was both symbolic AND accurate, for the particular crucifixion written about in the Bible. That was Gibson's goal. (He did take some symbolic and artistic license in some places, of course). But all the Biblical elements are there and the times he took artistic license do not detract in any way from the Biblical message.\n\n \n Gibson's goal was to elicit emotion. He succeeded. \n \n Can you not concede that the \"symbolic and artistic license in some places\" was, in fact, not representative of what purportedly happened? If you can't, then stop insisting that the movie was about the (supposedly real) Passion of the Christ.\n \n You look so silly when you argue both sides within such a small number of posts.", 
   {}, 
   188960, 
   null, 
   1135987200.0
  ], 
  [
   188990, 
   null, 
   "jyoshu", 
   "I can separate my appreciation of film as an art form from whether I actually like a film. It seems that you cannot. Gibson is to be credited for taking a difficult subject matter and making an important film. He's to be credited for taking a substantial risk (mostly financial). I have all sorts of disagreements with him on theology (so does the Pope), but I admire his willingness to put his money where his mouth is. (I kind of wish his deep Catholicism was reflected in his choice of roles over the years, but hey, without all that pointless voilence and crude behavior, he wouldn't have had the bucks to make PotC.)\n\n \n So are you saying you appreciate it as art but you don't like the film? I have no problem with that.\n \n \nAll that said, he took the easy route by exploiting violence to move people.\n\n \n Why should he have taken any other route than one which shows the violence? The crucifixion of the Bible was a very violent account.\n \n \nWhen it is unrealistically over-the-top -- \"symbolic\" to you -- I think it's a cheap trick. It isn't art, it's exploitation. There are a few, very few, exceptions in film history. PotC, in my mind, is not one of them.\n\n \n It's what was told in the gospels. It's one of the first, if not THE first, film protrayal that wasn't watered down from what the gospels tell. The cheap way out would have been to do what other Jesus films have done and pretend the account wasn't a violent one, or portray it is less malevolent for whatever reason.\n \n \nCan you not concede that the \"symbolic and artistic license in some places\" was, in fact, not representative of what purportedly happened?\n\n \n Of course! Why do you think I called it \"artistic license?\"", 
   {}, 
   188979, 
   null, 
   1135992180.0
  ], 
  [
   188997, 
   null, 
   "BobNelson2", 
   "So are you saying you appreciate it as art but you don't like the film? I have no problem with that.\n\n \n No. I think it's easy, and therefore clumsy, art. AND I didn't like it.\n \n \nWhy should he have taken any other route than one which shows the violence? The crucifixion of the Bible was a very violent account.\n\n \n He should have shown violence. I don't think he needed to show violence beyond the \"reality\". He chose to. Fine with me. It's his film. My quibble -- which you keep boinging back and forth between challenging and accepting -- is that he exceeded the violence in the gospels.\n \n \nIt's what was told in the gospels. It's one of the first, if not THE first, film protrayal that wasn't watered down from what the gospels tell. The cheap way out would have been to do what other Jesus films have done and pretend the account wasn't a violent one, or portray it is less malevolent for whatever reason.\n\n \n Jyoshu, if the Romans treated criminals the way Gibson portrayed, hardly anyone would have actually survived long enough to even get crucified. You appreciated the violence for what is symbolizes. I think is the easy way out for a director.\n \n \nOf course! Why do you think I called it \"artistic license?\"\n\n \n So, you agree with me. At last.\n \n Now, back to the subject of the thread:\n  The critically acclaimed drama \"Brokeback Mountain,\" starring Heath Ledger and Jake Gyllenhaal, rode into the top 10 in its second weekend after distributor Focus Features expanded it to 69 theaters in 21 markets from just a handful the previous weekend.\n \n The love story between two cowboys finished in eighth place after taking in an estimated $2.4 million. It had an outstanding per-screen average of $34,194, by far the highest of any film in release.\n \n \"Forget about it just playing to the gay community, it's playing to everyone,\" said Focus Features distribution head Jack Foley. \"It's a phenomenon.\"\n \n \"Brokeback,\" which has taken in $3.3 million so far in limited release, appears to be on its way to setting a new box office benchmark for a gay-themed film. Foley said audiences have ranged from \"baby boomers in the suburbs to the smart set in downtown urban areas to seniors in places like La Jolla and Phoenix, and the gay community\n \n Advertisement\n \n is continuing to go aggressively.\"\n \n Because of its unexpected popularity, Focus is scrapping its original idea to continue to open the film slowly and plans to begin adding theaters Friday in the suburbs of New York, Los Angeles and San Francisco, where the film has played through the roof.\n \n \"This is lightening in a bottle, and we have to maintain the rollout in concert with the heat on the film,\" Foley said. \"We have to see if exhibitors can work with us, if they have screens available. I think a lot of them will make room.\" \n http://www.dailynews.com/news/ci_3322153", 
   {}, 
   188990, 
   null, 
   1135992960.0
  ], 
  [
   189000, 
   null, 
   "BobNelson2", 
   "So are you saying you appreciate it as art but you don't like the film? I have no problem with that.\n\n \n Clearly, you're going to keep disagreeing with my posts and agreeing with my point. It's getting beyond tiresome.\n \n Here's a compromise: I will agree that PotC is greatest film ever made in Aramaic (that I'm aware of).\n \n Deal?", 
   {}, 
   188990, 
   null, 
   1135993800.0
  ], 
  [
   189014, 
   null, 
   "jyoshu", 
   "No. I think it's easy, and therefore clumsy, art. AND I didn't like it.\n\n \n Well, I disagree of course, but everyone is entitled to their own opinion. There are plenty of movies I dislike too for the same reasons, so I respect your opinion.\n \n \nHe should have shown violence. I don't think he needed to show violence beyond the \"reality\". \n \n Jyoshu, if the Romans treated criminals the way Gibson portrayed, hardly anyone would have actually survived long enough to even get crucified.\n\n \n See, that's where I think you have missed the point. The movie wasn't necessarily about the way Romans treated criminals in the ancient world. It wasn't necessarily about crucifixion in general. It was about the account of the crucifixion in the gospels. It was about that one event. Or you could even say that it's simply about the account in Bible, even if you don't believe the account in the Bible is true.\n \n \nThe critically acclaimed drama \"Brokeback Mountain,\" starring Heath Ledger and Jake Gyllenhaal, rode into the top 10 in its second weekend after distributor Focus Features expanded it to 69 theaters in 21 markets from just a handful the previous weekend.\n\n \n 69 theaters and $3.3 million dollars? That's not a phenomenon at all. It's a pretty limited release movie.\n \n I find it interesting that some of you seem to badly want this movie to be some breakthrough moment in gay pride history. I just don't get it. There have been many, many movies out there that were sympathetic to gay people. It's not like this thing is getting wide distribution. $3.3 million is generally considered a failure in the movie industry. Is it just wishful thinking or something?", 
   {}, 
   188997, 
   null, 
   1135998780.0
  ], 
  [
   189055, 
   null, 
   "JakeCJB", 
   "69 theaters and $3.3 million dollars? That's not a phenomenon at all. It's a pretty limited release movie.\n \n I find it interesting that some of you seem to badly want this movie to be some breakthrough moment in gay pride history. I just don't get it. There have been many, many movies out there that were sympathetic to gay people. It's not like this thing is getting wide distribution. $3.3 million is generally considered a failure in the movie industry. Is it just wishful thinking or something?\n \n \n Considering the limited number of theatres it has been released in, its profits are impressive. It's moving to wider distribution in the U.S. and Canada soon. Perhaps if you want to understand more about the film, and why it may be different from other films with gay themes(if you have watched any of those), you should go see Brokeback Mountain.", 
   {}, 
   189014, 
   null, 
   1136011020.0
  ], 
  [
   189057, 
   null, 
   "joebrummer", 
   "\n 69 theaters and $3.3 million dollars? That's not a phenomenon at all. It's a pretty limited release movie.\n \n I find it interesting that some of you seem to badly want this movie to be some breakthrough moment in gay pride history. I just don't get it. There have been many, many movies out there that were sympathetic to gay people. It's not like this thing is getting wide distribution. $3.3 million is generally considered a failure in the movie industry. Is it just wishful thinking or something?\n\n \n \n Perhaps the wishful thinking lands on you seeing as though you have nothing good to say about a movie that the critics, the dollars, and the moviegoers are loving to pieces. Maybe it is you hoping this will fail.", 
   {}, 
   189014, 
   null, 
   1136013720.0
  ], 
  [
   189179, 
   null, 
   "joebrummer", 
   "Even before they had seen the movie, exgay network Exodus and its prime benefactor Focus on the Family feared that Brokeback Mountain might prompt conservative Christians -- in particular, the relatives of gay individuals -- to rethink how they treat homosexual sinners. And upon rethinking their own role in the homosexual problem, Christian movie viewers might realize that the culture-war tactics of Exodus and James Dobson are self-serving, sinful, counterproductive, and sometimes dishonest.\n \n Whatever the intent of its makers, the movie is neither liberal nor revolutionary -- unlike an Oliver Stone or Michael Moore flick, it does not beat the viewer over the head with some dumb Hollywood agenda. The movie does not glamorize sex: The main characters are not supermodels, there is no explicit sex, and the one implied sex scene looks rather painful. The movie does not prefer homosexual love over heterosexual marriage; it weighs the two and exposes the very hard struggles of both.\n \n The film does contain heroes -- but they are not the main characters.\n \n Ennis and Jack are deeply and perhaps fatally flawed; the real heroes are the wives, children and a short-changed foreman played by Randy Quaid. In the showing that I recently attended in liberal Bethesda, Maryland, the audience was aghast at an onscreen wife's plight when she discovers the main characters in a romantic embrace. Earlier, when the cowboys neglect their duties, sheep die and an annoyed foreman must take harsh action to protect his business. Here again, the audience must confront the irresponsibility of the main characters -- and the rational reaction of their employer.\n \n Many reviewers have said that Brokeback Mountain might teach mainstream America that two men can really love one another. But this is just one of many points made by the film, and in several respects the film paints an unflattering portrait -- not of same-sex-attracted men in particular, but of men who recklessly pursue their passions -- and men who conceal their feelings from people who have a compelling need to know. Decades ago, society rejected the Marlboro Man myth as cancerous, racist, and inhuman -- a twisted caricature of masculinity that damaged families when misguided men actually tried to emulate the myth. This movie reminds us of those days gone by -- and points to the unhealthy myths that some social conservatives now wish to impose upon the real world.\n \n While some liberals might blame societal hate for any of the movie protagonists' dysfunctions, the film does not join in this buck-passing. The reactions of the cowboys' peers to the relationship is often hostile, but sometimes that hostility is not only sensible, but perhaps even a bit too polite.\n \n Yes, Jack and Ennis truly loved one another. But some things in life are just as important as love -- maybe more important. One of Ennis's central character flaws is social paralysis -- an inability to choose in timely fashion among life's competing opportunities, responsibilities, and consequences. Jack's key flaw stands in contrast: A dangerous failure to weigh the consequence of choosing love over all else.\n \n The movie does not glamorize these flaws -- it lays them bare in the pain of the spouses, the losses suffered by the foreman, and the characters' own fate.\n \n When movies practice great restraint in their message, as Brokeback Mountain does, then audiences may disagree on what the \"moral of the story\" was. Here are the moral lessons that I drew from the film:\n \n 1. If you are same-sex-attracted, don't marry the opposite gender.\n 2. If you are married, don't commit adultery.\n 3. It is not somehow worse for gay men to give up and divorce their spouses, than it is for philandering heterosexual spouses to give up and do likewise. But divorce should not be taken lightly -- and this movie recognizes that divorce does not fix deep-rooted problems, whatever the orientation of the partners.\n 4. Don't waste your life waiting to make key choices. If you do, others acting in their own interest will make your choices for you.\n 5. Don't make major decisions carelessly.\n 6. Avoid keeping secrets. That secrecy harms others.\n 7. Avoid people and communities whose own hypocrisies might prompt them to harm you for being honest.\n http://www.exgaywatch.com/blog/archives/2005/12/the_moral_lesso.html", 
   {
    "post_info": {
     "post_title": "a great summary"
    }
   }, 
   189057, 
   null, 
   1136103240.0
  ], 
  [
   189240, 
   null, 
   "jyoshu", 
   "Considering the limited number of theatres it has been released in, its profits are impressive. It's moving to wider distribution in the U.S. and Canada soon. Perhaps if you want to understand more about the film, and why it may be different from other films with gay themes(if you have watched any of those), you should go see Brokeback Mountain.\n\n \n I may rent it when it comes out as a rental. But let's be honest: compared to other \"mainstream\" films, this one's pretty anemic at best in how well it's done. I think the reason is that it's really still not a mainstream movie. Most people still think of it as a 'gay movie.'", 
   {}, 
   189055, 
   null, 
   1136149080.0
  ], 
  [
   189289, 
   null, 
   "JakeCJB", 
   "I may rent it when it comes out as a rental. But let's be honest: compared to other \"mainstream\" films, this one's pretty anemic at best in how well it's done. I think the reason is that it's really still not a mainstream movie. Most people still think of it as a 'gay movie.'\n\n \n Whoa, hold on a minute! A film that is considered mainstream or most popular, does not necessarily have the best qualities from a critical perspective. I don't believe you are qualified to say Brokeback Mountain is \"anemic\", for how well it's done, when you have not seen the film. You seem to be judging it on its popularity, and saying it's not the most popular because it is gay. Most people will avoid it because it is a \"gay movie\" in your view, however that doesn't determine how well the film is done, if you were suggesting it does. What else were you thinking of in concluding it is not well done?", 
   {}, 
   189240, 
   null, 
   1136170260.0
  ], 
  [
   189309, 
   null, 
   "joebrummer", 
   "Whoa, hold on a minute! A film that is considered mainstream or most popular, does not necessarily have the best qualities from a critical perspective. I don't believe you are qualified to say Brokeback Mountain is \"anemic\", for how well it's done, when you have not seen the film. You seem to be judging it on its popularity, and saying it's not the most popular because it is gay. Most people will avoid it because it is a \"gay movie\" in your view, however that doesn't determine how well the film is done, if you were suggesting it does. What else were you thinking of in concluding it is not well done?\n\n \n \n \n Jake, hjis mind is closed. He made up his mind about this movie as soon as he knew it was \"gay\" from that point on, he will say nothing good about it and he hasn't. Why do you bother?", 
   {}, 
   189289, 
   null, 
   1136172900.0
  ], 
  [
   189319, 
   null, 
   "jyoshu", 
   "Whoa, hold on a minute! A film that is considered mainstream or most popular, does not necessarily have the best qualities from a critical perspective. I don't believe you are qualified to say Brokeback Mountain is \"anemic\", for how well it's done, when you have not seen the film.\n\n \n I'm not saying it's anemic in content (I can't make that judgement yet); I'm saying its success in terms of sales and people who are seeing it is anemic for a mainstream film. I think it was pretty clear that my post was talking about how well the film has done, not the content of the film.", 
   {}, 
   189289, 
   null, 
   1136174580.0
  ], 
  [
   189346, 
   null, 
   "BobNelson2", 
   "I think it was pretty clear that my post was talking about how well the film has done, not the content of the film.\n\n \n For it to be clear, one has to assume that \"it's\" means \"it has\" and not \"it is\". Plus one would have to blot out pretty much everything else you've said in this thread to come to the conclusion that you meant the former.", 
   {}, 
   189319, 
   null, 
   1136199480.0
  ], 
  [
   189347, 
   null, 
   "BobNelson2", 
   "I saw BBM again tonight. (Multiple sold-out showings.)\n \n It was interesting to see the difference in audience reaction from the first time. When I saw it the first time, it was at a benefit for Frameline, an organization that promotes LGBT films. The audience was almost completely gay men, with some lesbians and a few hetero film buffs. At the end of the movie, there was almost complete silence until the end of the credits. You could hear a few snuffles, but it was mostly silence followed by a lot of clapping as the lights came up.\n \n Tonight, with a very mixed audience that was at least half hetero, there was a lot of sniffling and several people were really balling, men emoticon_cry and women emoticon_cryemoticon_cry. It was much harder for me to watch it this second time around, but I managed to keep a lid on it.", 
   {}, 
   189346, 
   null, 
   1136200380.0
  ], 
  [
   189472, 
   null, 
   "Matthew S", 
   "I saw BBM again tonight. (Multiple sold-out showings.)\n \n It was interesting to see the difference in audience reaction from the first time. When I saw it the first time, it was at a benefit for Frameline, an organization that promotes LGBT films. The audience was almost completely gay men, with some lesbians and a few hetero film buffs. At the end of the movie, there was almost complete silence until the end of the credits. You could hear a few snuffles, but it was mostly silence followed by a lot of clapping as the lights came up.\n \n Tonight, with a very mixed audience that was at least half hetero, there was a lot of sniffling and several people were really balling, men emoticon_cry and women emoticon_cryemoticon_cry. It was much harder for me to watch it this second time around, but I managed to keep a lid on it.\n\n \n \n <edited by bobs request< emoticon_cry emoticon_cry I was hoping to see the young Jack waving to Ennis as the camera pans out the window. As in the book Ennis begins to dream about Jack.", 
   {}, 
   189347, 
   null, 
   1136246160.0
  ], 
  [
   189476, 
   null, 
   "jyoshu", 
   "Even before they had seen the movie, exgay network Exodus and its prime benefactor Focus on the Family feared that Brokeback Mountain might prompt conservative Christians -- in particular, the relatives of gay individuals -- to rethink how they treat homosexual sinners. \n\n \n Heh, I've heard MUCH more wishful thinking outloud that this movie will be some social groundbreaker from the gay lobby than from conservatives. It seems they're the ones who want it to be some thumb in the eye of those they dislike.\n \n \nDecades ago, society rejected the Marlboro Man myth as cancerous, racist, and inhuman -- a twisted caricature of masculinity that damaged families when misguided men actually tried to emulate the myth. \n\n \n I'm not sure what the heck is meant by this. Is this talking about manly masculinity? Cowboy smoking? Or what?\n \n \nThis movie reminds us of those days gone by -- and points to the unhealthy myths that some social conservatives now wish to impose upon the real world.\n\n \n If this is referring to conservatives celebrating masculinity, I say get over it. One doesn' have to be of any political persuasion to be masculine. Good grief, this reviewer obviously has some issues or something.", 
   {}, 
   189179, 
   null, 
   1136247000.0
  ], 
  [
   189486, 
   null, 
   "BobNelson2", 
   "I know it tears me up\n\n \n Take that out of your post!!!! You're spilling the beans!!!!\n \n pleeeeeeze", 
   {}, 
   189472, 
   null, 
   1136249100.0
  ], 
  [
   189488, 
   null, 
   "BobNelson2", 
   "Heh, I've heard MUCH more wishful thinking outloud that this movie will be some social groundbreaker from the gay lobby than from conservatives. It seems they're the ones who want it to be some thumb in the eye of those they dislike.\n\n \n Thumb in the eye? I would think it would open their eyes... if they were brave enough to see it. As for wishful thinking, what misunderstood minority hasn't looked to art to help the rest of humanity see it more clearly?\n \n \nI'm not sure what the heck is meant by this. Is this talking about manly masculinity? Cowboy smoking? Or what?\n\n \n Go see the movie. Maybe you'll figure it out.\n \n \n \nIf this is referring to conservatives celebrating masculinity, I say get over it. One doesn' have to be of any political persuasion to be masculine. Good grief, this reviewer obviously has some issues or something.\n\n \n I doubt that was the myth the reviewer had in mind. You're the one with issues.", 
   {}, 
   189476, 
   null, 
   1136249400.0
  ], 
  [
   189491, 
   null, 
   "JakeCJB", 
   "I'm not saying it's anemic in content (I can't make that judgement yet); I'm saying its success in terms of sales and people who are seeing it is anemic for a mainstream film. I think it was pretty clear that my post was talking about how well the film has done, not the content of the film.\n\n \n Okay, I see now. You wrote \"considering how well it's done\". I took \"it's\" to mean it is, not it has.", 
   {}, 
   189319, 
   null, 
   1136251440.0
  ], 
  [
   190866, 
   null, 
   "BobNelson2", 
   "Well, it's open in 80 cities now and continues to rake in the viewers and the bucks. \n \n http://news.yahoo.com/s/usatoday/20060109/en_usatoday/brokebackdefiesgaycowboylabel;_ylt=Aue.rfkvAkLvYZsBFFFEXpys0NUE;_ylu=X3oDMTA3YXYwNDRrBHNlYwM3NjI-\n \n and in another story a little insight in the process:\n During filming of the cowboys' final meeting, there was evidence the story would appeal to a broad audience. \"Ang suddenly noticed everyone was crying,\" Shamus says. \"This was the crew, folks who are just there to do a day's work. Right then, we thought, 'We have something here.' \"\n http://www.usatoday.com/life/movies/news/2006-01-09-brokeback-date-movie-main_x.htm", 
   {}, 
   189491, 
   null, 
   1136837040.0
  ], 
  [
   190872, 
   null, 
   "Steeeeve", 
   "I wish they woulda just released it in all theaters so we could actually get a good comparison of how this movie is really doing...the slow release is almost skewing the numbers with low earnings but high per screen average. Could you imagine if Titantic were released like that? People would be killing just to get a ticket.", 
   {}, 
   190866, 
   null, 
   1136838180.0
  ], 
  [
   190892, 
   null, 
   "BobNelson2", 
   "I wish they woulda just released it in all theaters so we could actually get a good comparison of how this movie is really doing...the slow release is almost skewing the numbers with low earnings but high per screen average. Could you imagine if Titantic were released like that? People would be killing just to get a ticket.\n\n \n Hollywood blockbusters come out one way. Small, independent films come out another. \n \n As for skewing the numbers, the marketing of the movie is quite important... to the investors. It can mean the difference between bankruptcy and financial success. The marketers in this case were very, very cautious but have expanded the release in response to critical acclaim and popularity. You can't fault them for not setting up a political popularity poll... that's not where their responsibilities lie.", 
   {}, 
   190872, 
   null, 
   1136842020.0
  ], 
  [
   190896, 
   null, 
   "Steeeeve", 
   "Hollywood blockbusters come out one way. Small, independent films come out another. \n \n As for skewing the numbers, the marketing of the movie is quite important... to the investors. It can mean the difference between bankruptcy and financial success. The marketers in this case were very, very cautious but have expanded the release in response to critical acclaim and popularity. You can't fault them for not setting up a political popularity poll... that's not where their responsibilities lie.\n\n \n Who said I was faulting? I think it was a great idea although I figured it was big enough to push into many theaters like Passion of the Christ did (which was semi-independent as well as I recall). All I am saying is that it is hard to say whether the movie is doing \"well\" or not because \"well\" is going to have to be realitive to other movies (in my mind) and you can't do that with this movie.", 
   {}, 
   190892, 
   null, 
   1136843160.0
  ], 
  [
   190910, 
   null, 
   "BobNelson2", 
   "Who said I was faulting? I think it was a great idea although I figured it was big enough to push into many theaters like Passion of the Christ did (which was semi-independent as well as I recall). All I am saying is that it is hard to say whether the movie is doing \"well\" or not because \"well\" is going to have to be realitive to other movies (in my mind) and you can't do that with this movie.\n\n \n PotC (which keeps being brought up for the oddest reasons) was hardly marketed as a small film. It openned in 3000+ theatres. It was released much as Star Wars III was.", 
   {}, 
   190896, 
   null, 
   1136847180.0
  ], 
  [
   190917, 
   null, 
   "jyoshu", 
   "PotC (which keeps being brought up for the oddest reasons) was hardly marketed as a small film. It openned in 3000+ theatres. It was released much as Star Wars III was.\n\n \n It was still an indie film. Just has a really well-known director. Who'd ever heard of Icon Productions until then?", 
   {}, 
   190910, 
   null, 
   1136848380.0
  ], 
  [
   190921, 
   null, 
   "BobNelson2", 
   "It was still an indie film. Just has a really well-known director. Who'd ever heard of Icon Productions until then?\n\n \n Yes, it was produced independently (though hardly as most independent films are), but not as a \"small film\". It was marketed as a blockbuster and proved to be one.\n \n You guys' constant comparisons to PotC is kind of plerplexing. Well not really. There is very little these two movies have in common. The only link is in your minds... between what you think of as a \"moral\" subject and what you think of as an \"immoral\" subject matter. You're just trying to encourage misunderstanding and discord.", 
   {}, 
   190917, 
   null, 
   1136848860.0
  ], 
  [
   190923, 
   null, 
   "Matthew S", 
   "Saw brokeback again on saturday. Still made me cry then shake with rage.", 
   {}, 
   190921, 
   null, 
   1136849040.0
  ], 
  [
   190933, 
   null, 
   "tonybrown74", 
   "I saw it on Wednesday. Even though I read the essay beforehand and knew how it would end, I would have to say that it was well acted, particularly the second half.\n \n One thing I have to note from the movie, is how these people, from Alma, to Jack Twist, and even the waitress that Ennis dated (cannot remember the character's name), all fell in love with a man unable to communicate his feelings. Three of the most telling scenes in the movie (for me) was 1) Ennis and Alma in the kitchen \"discussing\" the truth about Ennis and Jack's freindship, 2) the scene where Jack was angry when told that Ennis would not be able to see him until November, and 3) when the waitress that Ennis saw briefly came into the diner one night with a new boyfriend.\n \n Anyone else have an opinion on this?", 
   {}, 
   190923, 
   null, 
   1136850240.0
  ], 
  [
   190935, 
   null, 
   "beervolcano", 
   ":)\n \n I'm surprised no one on this board has brought up Gene Shailt's Today Show review of the movie.\n \n http://news.yahoo.com/news?tmpl=story&cid=2621&ncid=2621&e=15&u=/eo/20060107/en_movies_eo/18098\n \n http://www.glaad.org/action/alerts_detail.php?id=3849&PHPSESSID=e8c92d09e76a106bc57734655e3d8f58#\n (with video of the review)\n \n Gene calls one of the characters a \"sexual predator.\" That's what got GLAAD all steamed.\n \n \n\"Shalit's bizarre characterization of Jack as a 'predator' and Ennis as a victim reflects a fundamental lack of understanding about the central relationship in the film and about gay relationships in general,\" GLAAD said in a statement. \"It seems highly doubtful that Shalit would similarly claim that Titanic's Jack was a 'sexual predator' because he was pursuing a romantic relationship with Rose.\"\n\n \n I haven't seen the movie (too cheap, I'll download it or wait until it's in the $1 bin at the rental place), but from what I hear, the two men cheat on their wives to go have their flings. They both have children, I think, and they abandon them to go cheat on their wives, who are heartbroken or something. (If this is inaccurate, please clear this up.)\n \n So maybe Shalit might have called Jack in Titanic a \"sexual predator\" if he pursued a married-with-children Rose and convinced her to cheat on her husband with him.\n \n (Again, I haven't seen the movie. Just posting this to stir up sh- erm debate.)\n \n And I'm still waiting for BBMII starring Angelina Jolie and Jessica Alba, or maybe Charlize Theron.", 
   {
    "post_info": {
     "post_title": "Gene Shalit"
    }
   }, 
   190923, 
   null, 
   1136850300.0
  ], 
  [
   190938, 
   null, 
   "Steeeeve", 
   "PotC (which keeps being brought up for the oddest reasons) was hardly marketed as a small film. It openned in 3000+ theatres. It was released much as Star Wars III was.\n\n \n I didn't say small did I? I said semi-independent. I know Brokeback was meant to start small...thats obvious because thats what they did. I was just wondering with the awards and recongintion why it couldn't go into all theaters at the beginning.", 
   {}, 
   190910, 
   null, 
   1136850660.0
  ], 
  [
   190942, 
   null, 
   "MrWriteLA", 
   " I haven't seen the movie (too cheap, I'll download it or wait until it's in the $1 bin at the rental place), but from what I hear, the two men cheat on their wives to go have their flings. They both have children, I think, and they abandon them to go cheat on their wives, who are heartbroken or something. (If this is inaccurate, please clear this up.)\n The relationship begins before either of them are married or have children, and continues--emotionally, at least--after one of them is divorced and, arguably, even beyond death. \n \n Not exactly \"having a fling.\"", 
   {}, 
   190935, 
   null, 
   1136851020.0
  ], 
  [
   190945, 
   null, 
   "Matthew S", 
   "I saw it on Wednesday. Even though I read the essay beforehand and knew how it would end, I would have to say that it was well acted, particularly the second half.\n \n One thing I have to note from the movie, is how these people, from Alma, to Jack Twist, and even the waitress that Ennis dated (cannot remember the character's name), all fell in love with a man unable to communicate his feelings. Three of the most telling scenes in the movie (for me) was 1) Ennis and Alma in the kitchen \"discussing\" the truth about Ennis and Jack's freindship, 2) the scene where Jack was angry when told that Ennis would not be able to see him until November, and 3) when the waitress that Ennis saw briefly came into the diner one night with a new boyfriend.\n \n Anyone else have an opinion on this?\n\n \n Ennis is frightened by what his father showed him as a boy ( I don't want to give too much away) So that is what permeates his relationship with Jack. He is afraid of getting bashed and killed, parents can F'UP their childrens minds sometimes. As to his relationship with Alma and the waitress it is called the closet. He knows Alma is sleeping with Monroe He dosn't bat an eye. He sees the waitress with another man he wishes her good luck. Remember Jack is his true love he was not torn up, or threaten to kill Alma or the waitress for sleeping with another man but he does this to Jack. Ennis says to Jack \"I got a say this to you one time, Jack, and I ain't foolin. What I don't know, all them things I don't know could get you killed if I come to know them.\" This was in reference to Jacks' trips for sex to mexico. Ennis is filled with a jealous rage.(Heath did a great job). In the kitchen Ennis's only threat of violence towards Alma is when she insults Jack. I don't know why the two women fall in love with Ennis as I do not understand it from a womans perspective. I do understand Jacks love for Ennis who hasn't been 19 and in love, as Jack was on Brokeback mountain with Ennis.", 
   {
    "post_info": {
     "post_title": "Spoiler alert"
    }
   }, 
   190933, 
   null, 
   1136851560.0
  ], 
  [
   190947, 
   null, 
   "BobNelson2", 
   "I didn't say small did I? \n\n \n No, I did, when I started this sub-thread.\n \n \nI said semi-independent. I know Brokeback was meant to start small...thats obvious because thats what they did. I was just wondering with the awards and recongintion why it couldn't go into all theaters at the beginning.\n\n \n Because theatre bookings are made months in advance and because, mostly, it's up to the marketing staff to decide how films get released.", 
   {}, 
   190938, 
   null, 
   1136851920.0
  ], 
  [
   190949, 
   null, 
   "BobNelson2", 
   "I'm surprised no one on this board has brought up Gene Shailt's Today Show review of the movie.\n \n\n \n I'm not sure I'd qualify that as a \"review\". His take is bizarre, as anyone who sees the movie will recognize.", 
   {}, 
   190935, 
   null, 
   1136852040.0
  ], 
  [
   190960, 
   null, 
   "jyoshu", 
   "You guys' constant comparisons to PotC is kind of plerplexing. Well not really. There is very little these two movies have in common. The only link is in your minds... between what you think of as a \"moral\" subject and what you think of as an \"immoral\" subject matter. You're just trying to encourage misunderstanding and discord.\n\n \n Actually, no not at all. The only reason it's been brought up (if at all) by me is that it happens to be recent, successful independent film that was released in mainstream cinema theaters. That's what the two films have in common (though Brokeback isn't nearly as successful.)", 
   {}, 
   190921, 
   null, 
   1136853420.0
  ], 
  [
   190980, 
   null, 
   "tonybrown74", 
   "Ennis is frightened by what his father showed him as a boy ( I don't want to give too much away) So that is what permeates his relationship with Jack. He is afraid of getting bashed and killed, parents can F'UP their childrens minds sometimes. As to his relationship with Alma and the waitress it is called the closet. He knows Alma is sleeping with Monroe He dosn't bat an eye. He sees the waitress with another man he wishes her good luck. Remember Jack is his true love he was not torn up, or threaten to kill Alma or the waitress for sleeping with another man but he does this to Jack. Ennis says to Jack \"I got a say this to you one time, Jack, and I ain't foolin. What I don't know, all them things I don't know could get you killed if I come to know them.\" This was in reference to Jacks' trips for sex to mexico. Ennis is filled with a jealous rage.(Heath did a great job). In the kitchen Ennis's only threat of violence towards Alma is when she insults Jack. I don't know why the two women fall in love with Ennis as I do not understand it from a womans perspective. I do understand Jacks love for Ennis who hasn't been 19 and in love, as Jack was on Brokeback mountain with Ennis.\n\n \n Actually, leaving aside Ennis for the moment, I had noticed that all these people had an attraction towards a person who does not really emotionally connect with people (or at the very least has a real hard time doing so). Ennis himself is so emotionally stunted (due to what his father showed him) that it took a threat of Jack leaving him to actually bring out some sincere emotion from him.\n \n The fact that Alma was still upset after all those years (during the confrontation in the kitchen), tells me that she was still in love with Ennis. The same with the waitress, who said as much. I think the movie says a lot about those charaters (including the older daughter, Alma Jr., who you can tell is desperate for any show of affection from her father, Ennis) as it does about Jack and Ennis.\n \n That being said, the most emotional point in the movie for me, was when Jack was so upset about having to postpone their rendevous unitl November that he lashes out (verbally) at Ennis, and Ennis, not really knowing what to say, just mumbles out \"you did this to me!\" The emotion from Ennis seemed so sincere that I started crying with him right there.", 
   {}, 
   190945, 
   null, 
   1136859120.0
  ], 
  [
   190999, 
   null, 
   "Matthew S", 
   "Actually, leaving aside Ennis for the moment, I had noticed that all these people had an attraction towards a person who does not really emotionally connect with people (or at the very least has a real hard time doing so). Ennis himself is so emotionally stunted (due to what his father showed him) that it took a threat of Jack leaving him to actually bring out some sincere emotion from him.\n \n The fact that Alma was still upset after all those years (during the confrontation in the kitchen), tells me that she was still in love with Ennis. The same with the waitress, who said as much. I think the movie says a lot about those charaters (including the older daughter, Alma Jr., who you can tell is desperate for any show of affection from her father, Ennis) as it does about Jack and Ennis.\n \n That being said, the most emotional point in the movie for me, was when Jack was so upset about having to postpone their rendevous unitl November that he lashes out (verbally) at Ennis, and Ennis, not really knowing what to say, just mumbles out \"you did this to me!\" The emotion from Ennis seemed so sincere that I started crying with him right there.\n\n \n \n Who knows maybe Ennis was a great top. Maybe Ennis being abandoned by all the important people in his life led him to be so afraid to show any emotion. If you don't get close to people it is easy to lose them if they abandon you. His mother and father die. His sister abandons him and his brother. His brother discards him infavor of a wife. Alma knows and uses this against Ennis when she wants to move into town. I think it is that all three saw a hurt little boy they wanted to protect. Ennis is afraid that Jack will abandon him if they live together. Notice that he gets physically sick when Jack leaves the first time.\n \n Ohh and I really started crying after the last scene between Javk and Ennis because I knew what was comming next.", 
   {}, 
   190980, 
   null, 
   1136862060.0
  ], 
  [
   191248, 
   null, 
   "BobNelson2", 
   "I ran across this site the other day, then lost the link. \n \n Today I found it again :) \n \n http://www.davecullen.com/brokebackmountain/\n \n Everything Brokeback!", 
   {}, 
   190999, 
   null, 
   1136947140.0
  ], 
  [
   191250, 
   null, 
   "MrWriteLA", 
   "The gay cowboy romance, which has been cleaning up in early awards races, was considered a difficult box-office sell nationwide because of its subject matter. (Related story: Brokeback draws couples)\n \n But Brokeback Mountain is averaging $10,000-plus per screen in such markets as San Antonio, Nashville and Columbus, Ohio, according to Nielsen EDI.\n \n The Ang Lee film was ninth at the box office this weekend with $5.8 million on 483 screens, a healthy $11,904 per-screen average. That's a higher average than the No. 1 movie of the week, Hostel.\n \n \"It's been humbling to see how the movie is getting received across the country,\" says Jack Foley, head of distribution for Focus Features. \"We knew we were getting good reviews and doing well at the awards. But that's never a guarantee you can sell your movie across the country - particularly the most conservative parts of it.\"\n \n Not every theater is thrilled with the R-rated movie. In Sandy, Utah, a Salt Lake City suburb, a theater owned by Utah Jazz owner Larry Miller canceled plans last week to show Brokeback Mountain. Julie Withers, a manager for the Jordan Commons Megaplex, declined to comment Sunday.\n \n Still, the film's strong box-office performance solidifies Brokeback's position as the film to beat at the Academy Awards on March 5.\n \n The movie has earned positive reviews from nearly 90% of reviewers, according to rottentomatoes.com. And Brokeback has won more than a dozen pre-Oscar awards.\n \n Those raves \"helped open the door for box office, and the movie has really taken advantage of it,\" says Brandon Gray of Box Office Mojo. \"It's gone from being 'the gay cowboy movie' to being the must-see film of the awards season.\"\n \n Foley says the studio had hoped to have the film in more than 30 major markets by the end of January. But the film has played so well, it is now in more than 80 cities.\n http://www.usatoday.com/life/movies/news/2006-01-09-brokeback-sidebar_x.htm", 
   {
    "post_info": {
     "post_title": "Don't look now, but Brokeback Mountain is selling in the heartland."
    }, 
    "unicode_changes_made": true
   }, 
   191248, 
   null, 
   1136947740.0
  ], 
  [
   191254, 
   null, 
   "Steeeeve", 
   "The Ang Lee film was ninth at the box office this weekend with $5.8 million on 483 screens, a healthy $11,904 per-screen average. That's a higher average than the No. 1 movie of the week, Hostel.\n A misleading fact though. If you have 5 million gallons of water pouring out of 3000 faucets then the per faucet average will be lower than 3 million gallons of water pouring out of 300 faucets. In the end though, less water is coming out of the 300 faucets eventhough more water went through each one.", 
   {}, 
   191250, 
   null, 
   1136949240.0
  ], 
  [
   191272, 
   null, 
   "jyoshu", 
   "A misleading fact though. If you have 5 million gallons of water pouring out of 3000 faucets then the per faucet average will be lower than 3 million gallons of water pouring out of 300 faucets. In the end though, less water is coming out of the 300 faucets eventhough more water went through each one.\n\n \n Now Steeeeve, how could you spoil the party with a dose of reality? Besides, it's a 'gay cowboy movie', so there's gotta be a silver lining somewhere . . . . emoticon_xgood Why, you'd think it was Titanic or something the way some people keep talking about these \"success\" figures. But hey, I guess anything could be a \"success\" if the standard for success is low enough. \n \n Interesting how they keep trying to pass this movie off as another mainstream film with, of course, no agenda, yet squander no opportunity in a gay rights forum to boast about the \"success\" of this (ahem) mainstream film?", 
   {}, 
   191254, 
   null, 
   1136952300.0
  ], 
  [
   191284, 
   null, 
   "Matthew S", 
   "I ran across this site the other day, then lost the link. \n \n Today I found it again :) \n \n http://www.davecullen.com/brokebackmountain/\n \n Everything Brokeback!\n\n \n \n Thankyou :)", 
   {}, 
   191248, 
   null, 
   1136953740.0
  ], 
  [
   191357, 
   null, 
   "BobNelson2", 
   "Interesting how they keep trying to pass this movie off as another mainstream film with, of course, no agenda, yet squander no opportunity in a gay rights forum to boast about the \"success\" of this (ahem) mainstream film?\n\n \n YOU are the only one comparing it to mainstream films.\n \n Telling our stories is the only agenda at work here. Are we wrong to want to see ourselves in film? In art? In society? Are we wrong to want others to see us?\n \n Regardless of the answers to those questions (which I'm sure are \"yes, yes, yes, yes, and yes), do we post threads for every movie with a gay theme? In the time I've been coming here, I think this is the first one. Were there others?\n \n The publicity the movie is receiving is because it is a GREAT film. YOU don't and probably CAN'T think so, of course, but people will talk about this movie for a long, long time to come. NOT because it's gay, but because it's beautifully made, exquisitely acted, and has a moving story.\n \n If you had the cojones, you'd keep your uninformed opinions to yourself until you had at least seen it.", 
   {}, 
   191272, 
   null, 
   1136965980.0
  ], 
  [
   191376, 
   null, 
   "Matthew S", 
   "I like Rex's take on the film http://www.365gay.com/opinion/wocknerWire/wocknerWire.htm emoticon_cry", 
   {}, 
   191357, 
   null, 
   1136987340.0
  ], 
  [
   191401, 
   null, 
   "tonybrown74", 
   "A misleading fact though. If you have 5 million gallons of water pouring out of 3000 faucets then the per faucet average will be lower than 3 million gallons of water pouring out of 300 faucets. In the end though, less water is coming out of the 300 faucets eventhough more water went through each one.\n\n \n \n How silly does this sound? \n \n Even if the movie opened with wider release, and none of the other theatres pulled in any audience, it would have still been ninth best grossing film of the week. Chances are, even with lower averages per theatre on wider release, it would have made more money.", 
   {}, 
   191254, 
   null, 
   1137001020.0
  ], 
  [
   191418, 
   null, 
   "Steeeeve", 
   "How silly does this sound? \n \n Even if the movie opened with wider release, and none of the other theatres pulled in any audience, it would have still been ninth best grossing film of the week. Chances are, even with lower averages per theatre on wider release, it would have made more money.\n\n \n But it wouldn't have that high of a per screen average. It would have been more comparable. \n \n If you look at the past two weekends..as the number of theaters increased the per screen average dropped by 33% or so. So that high per screen average is just a bad number which is misleading...as my faucet example shows.\n \n \n Look at the movie(documentary) Galapagos....has a 19,000 per screen average ...playing on one theater.\n http://movies.yahoo.com/mv/boxoffice/weekend/\n \n That doesn't really give a good picture does it?", 
   {}, 
   191401, 
   null, 
   1137002820.0
  ], 
  [
   191428, 
   null, 
   "tonybrown74", 
   "But it wouldn't have that high of a per screen average. It would have been more comparable. \n\n \n Indeed. But the writer of the article is being honest since the article does mention that the movie is in limited release. What is impressive is that the movie made the top ten in terms of gross for the week in spite of being in limited release.\n \n \nIf you look at the past two weekends..as the number of theaters increased the per screen average dropped by 33% or so. So that high per screen average is just a bad number which is misleading...as my faucet example shows.\n\n \n That may be. However, the movie is grossing very well per theatre. That and the movie had the ninth highest gross revenue for the week in spite of being in limited release.\n \n \n \n Look at the movie(documentary) Galapagos....has a 19,000 per screen average ...playing on one theater.\n http://movies.yahoo.com/mv/boxoffice/weekend/\n \n That doesn't really give a good picture does it?\n\n \n Huh?\n \n It was released in an IMAX theatre. So what?", 
   {}, 
   191418, 
   null, 
   1137005220.0
  ], 
  [
   191433, 
   null, 
   "Steeeeve", 
   "Indeed. But the writer of the article is being honest since the article does mention that the movie is in limited release. What is impressive is that the movie made the top ten in terms of gross for the week in spite of being in limited release.\n Well, it is limited release with tons of coverage....I think the person that decided on a limited release was genius. \n \n \nThat may be. However, the movie is grossing very well per theatre. That and the movie had the ninth highest gross revenue for the week in spite of being in limited release.\n \n I'm not saying it isn't doing well. I am saying that the per screen average is a misleading number. In a full release I am sure it would have been a top 5 movie in the weekend of its release.\n \n \nHuh?\n \n It was released in an IMAX theatre. So what?\n The point is, that movie has a higher per screen average, it doesn't mean anything though. \n \n \n I personally believe that total gross is the best way to see how a movie did compared to others. If it was a \"limited release\" then that tells me that your movie wasn't good enough to be in all the theaters. If you wanted it to be a limited release then too bad. However, this not what is going to happen. Oh well.", 
   {}, 
   191428, 
   null, 
   1137005820.0
  ], 
  [
   191449, 
   null, 
   "tonybrown74", 
   "Well, it is limited release with tons of coverage....I think the person that decided on a limited release was genius. \n\n \n I think it was done for two reasons. They wanted it do get to audiences that would critically acclaim it (in order to make it oscar worthy) and to get it out to enough people to dispel the myth that it was a \"gay\" movie.\n \n \n I'm not saying it isn't doing well. I am saying that the per screen average is a misleading number. In a full release I am sure it would have been a top 5 movie in the weekend of its release.\n\n \n Not necessarily. What you would have to take into consideration is the fact that it is popular in certain markets. What is surprising (for some) is that it seems to be doing quite well even in markets that are (for whatever reason) less receptive of indie market films.\n \n \nThe point is, that movie has a higher per screen average, it doesn't mean anything though. \n \n \n What is surprising is that it is doing well in markets not considered liberal or gay/gay-friendly.\n \n \n I personally believe that total gross is the best way to see how a movie did compared to others. If it was a \"limited release\" then that tells me that your movie wasn't good enough to be in all the theaters. If you wanted it to be a limited release then too bad. However, this not what is going to happen. Oh well.\n\n \n I disagree. \n \n I would amend your statement to say that the movie wasn't POPULAR enough for it to be in all theatres. At least, that is what the marketers believed. I think that indie movie makers should take note: release movie in limited markets and then let the word get out about the movie. If it generates a lot of buzz and good reviews, then slowly release into wider markets.", 
   {}, 
   191433, 
   null, 
   1137008400.0
  ], 
  [
   191458, 
   null, 
   "Steeeeve", 
   "Not necessarily. What you would have to take into consideration is the fact that it is popular in certain markets. What is surprising (for some) is that it seems to be doing quite well even in markets that are (for whatever reason) less receptive of indie market films.\n It has close to 500 theaters of release...Is that the max it plans on obtaining? Only in the past week has this movie been within 100 movies of where I live.\n \n \nI would amend your statement to say that the movie wasn't POPULAR enough for it to be in all theatres\n I meant popular when I said \"good\". However, when it comes to comparing (for award purposes) aren't the people really a judge of what is or isn't a good movie? SpiderMan2 got tons of money and was well liked by many but it got 0 awards and I believe no nominations. You will never see a movie like \"wedding crashers\" get an award although that was a great movie....no category for \"funny\" I suppose. It seems like the blockbuster movies never get awards while serious, emotional films that are \"against the grain\" tend to win so many awards because they are \"against the grain\"...it just makes no sense to me.", 
   {}, 
   191449, 
   null, 
   1137009600.0
  ], 
  [
   191464, 
   null, 
   "Matthew S", 
   "When will enough money be enough to show that it is a popular and good movie 100,000,000? 200,000,000? What is the criteria? Is it just a matter of the number of theaters or is it the amount of dollars it makes? If it is ends up in only 500 theatres and still makes 100,000,000 What then? will it be a blockbuster?", 
   {}, 
   191458, 
   null, 
   1137010080.0
  ], 
  [
   191481, 
   null, 
   "BobNelson2", 
   "I think the solution here is to build home theatres in everyone's house. Then ALL films should be screened by EVERYONE.\n \n Only in this way, will we ever be able to determine which is the \"best\" movie.\n \n Also, that would allow less time for people to log onto message boards and make the silly argument that the entire film industry press in incapable of determining for itself whether a film is doing extraordinarily well or not and the equally silly idea that the constant stream of positive articles about Brokeback Mountain is just part of some gay conspiracy to advance our agenda.\n \n (Kudos, by the way, to all the gay copy boys secretly slipping all the positive articles into press under the noses of the editors.)", 
   {}, 
   191449, 
   null, 
   1137012840.0
  ], 
  [
   191485, 
   null, 
   "BobNelson2", 
   "It has close to 500 theaters of release...Is that the max it plans on obtaining? Only in the past week has this movie been within 100 movies of where I live.\n \n I meant popular when I said \"good\". However, when it comes to comparing (for award purposes) aren't the people really a judge of what is or isn't a good movie? SpiderMan2 got tons of money and was well liked by many but it got 0 awards and I believe no nominations. You will never see a movie like \"wedding crashers\" get an award although that was a great movie....no category for \"funny\" I suppose. It seems like the blockbuster movies never get awards while serious, emotional films that are \"against the grain\" tend to win so many awards because they are \"against the grain\"...it just makes no sense to me.\n\n \n See, my solution would help here. Obviously, you and quite a few people never get to see a lot of movies because you're a long way from urban centers. Only by seeing all movies can you truly decide if Spidie is more worthy than, say, Capote.\n \n For what it's worth, I suspect that the famous image of dogs sitting around a table playing poker can be found on more walls in this country than copies of, say, any Caravaggio or any Velasquez or any Rembrandt. I don't know many folks who would put the former on par with the latter. Would you?", 
   {}, 
   191458, 
   null, 
   1137013200.0
  ], 
  [
   191486, 
   null, 
   "Matthew S", 
   "Also, that would allow less time for people to log onto message boards and make the silly argument that the entire film industry press in incapable of determining for itself whether a film is doing extraordinarily well or not and the equally silly idea that the constant stream of positive articles about Brokeback Mountain is just part of some gay conspiracy to advance our agenda.\n \n (Kudos, by the way, to all the gay copy boys secretly slipping all the positive articles into press under the noses of the editors.)\n\n \n \n Well if you are brainwashed and trained from birth to see devils and demons around every corner and under every bush, as many evangelicals are taught, then you would find demons and devils everywhere you look.", 
   {}, 
   191481, 
   null, 
   1137013320.0
  ], 
  [
   191500, 
   null, 
   "Steeeeve", 
   "When will enough money be enough to show that it is a popular and good movie 100,000,000? 200,000,000? What is the criteria? Is it just a matter of the number of theaters or is it the amount of dollars it makes? If it is ends up in only 500 theatres and still makes 100,000,000 What then? will it be a blockbuster?\n\n \n I never said it was a bad movie..how would I know. I am saying it is hard to say the popularity of it because it isn't in full release. Being a top 5 movie for the year would surely show a blockbuster though.", 
   {}, 
   191464, 
   null, 
   1137014340.0
  ], 
  [
   191530, 
   null, 
   "jyoshu", 
   "Also, that would allow less time for people to log onto message boards and make the silly argument that the entire film industry press in incapable of determining for itself whether a film is doing extraordinarily well or not and the equally silly idea that the constant stream of positive articles about Brokeback Mountain is just part of some gay conspiracy to advance our agenda.\n\n \n One word: WaterWorld. Hughly unpopular, but nominated for an academy award.\n \n It seems to me that a problem here is that we are talking about 2 thing here--not just one: Both financial/number-of-theater success, AND artistic value. From a critically acclaimed standpoint, hey, maybe it's the best movie ever made, who knows? But from a financial standpoint, it's still (yes, still) limited in its scope and success. Spielberg and James Cameron might call it a failure in that regard. If the entertainment industry wants to give its completely unbiased (ahem) opinion all day long and say that Brokeback is the best movie ever to grace the screen, more power to 'em. But when it comes to dollars measuring success, it's pretty easy to see the real picture.", 
   {}, 
   191481, 
   null, 
   1137017940.0
  ], 
  [
   191537, 
   null, 
   "Matthew S", 
   "The point is if the movie makes 100,000,000$ does it really matter how many threatres or what the threater to $ amount average is?", 
   {}, 
   191530, 
   null, 
   1137018840.0
  ], 
  [
   191540, 
   null, 
   "BobNelson2", 
   "One word: WaterWorld. Hughly unpopular, but nominated for an academy award.\n\n \n U.S. Box Office: $88,214,660\n So, better than almost everything made last year.\n \n emoticon_rolleyes \n \n \nIt seems to me that a problem here is that we are talking about 2 thing here--not just one: Both financial/number-of-theater success, AND artistic value. From a critically acclaimed standpoint, hey, maybe it's the best movie ever made, who knows? But from a financial standpoint, it's still (yes, still) limited in its scope and success. Spielberg and James Cameron might call it a failure in that regard. If the entertainment industry wants to give its completely unbiased (ahem) opinion all day long and say that Brokeback is the best movie ever to grace the screen, more power to 'em. But when it comes to dollars measuring success, it's pretty easy to see the real picture.\n\n \n The real picture is that you and steeeeve dismiss artistic merit with financial success and measure financial success only in terms of gross sales.\n \n Neither of these approaches is sensible and neither is the way the industry measures itself.\n \n Oh, and you both do it without having seen the movie...", 
   {}, 
   191530, 
   null, 
   1137019740.0
  ], 
  [
   191541, 
   null, 
   "jyoshu", 
   "The point is if the movie makes 100,000,000$ does it really matter how many threatres or what the threater to $ amount average is?\n\n \n No, but Brokeback hasn't even come close to that. It's just under 24 million dollars. (http://www.boxofficemojo.com/movies/?id=brokebackmountain.htm)\n \n It cost around 14 million just to make it, so yeah in terms of the idea that it's made a profit, I guess you could say it's doing well.", 
   {}, 
   191537, 
   null, 
   1137020100.0
  ], 
  [
   191542, 
   null, 
   "jyoshu", 
   "The real picture is that you and steeeeve dismiss artistic merit with financial success and measure financial success only in terms of gross sales.\n\n \n Um, no. the real picture is that we weren't talking about artistic success, and you used artistic success to answer our observations about it's financial status.", 
   {}, 
   191540, 
   null, 
   1137020220.0
  ], 
  [
   191545, 
   null, 
   "Steeeeve", 
   "Um, no. the real picture is that we weren't talking about artistic success, and you used artistic success to answer our observations about it's financial status.\n\n \n exactly, we were having a discussion about the finanacials of the movie and I was saying that per-screen is misleading... TonyBrown PMed me saying it was a nice debate about the finances dealing with the movie.", 
   {}, 
   191542, 
   null, 
   1137021360.0
  ], 
  [
   191550, 
   null, 
   "MrWriteLA", 
   "To someone who works for a company that's in the Hollywood marketing research business, these convoluted attempts to cast Brokeback Mountain's box office in a negative light are laughably and transparently desperate. Nobody--repeat, nobody--in Hollywood considers Brokeback anything less than a huge success, despite the fact that it's still in theaters and has yet to fully \"go wide.\" Success isn't gauged here by how a movie does compared to this or that other film, but by how much more it pulls in than it cost to make. (It's called \"return on your investment.\") \n \n At last report, Brokeback had grossed almost double its production cost. It has also wildly exceeded the expectations of its makers. It has been showered with awards and nominations, and is a shoo-in for a Best Picture Oscar nomination, as are Ang Lee, Heath Ledger, the cinematographer, and the adapters. The attempts by some here to paint this as some kind of failure are so divorced from any kind of reality as to be surreal. \n \n Sorry, folks, it's a hit, even with many, many straight people (it would have to be, as we all \"know\" how few gay people there really are, right?). Refusing to acknowledge the fact just makes your already-blatant prejudice all the more evident.", 
   {}, 
   188086, 
   null, 
   1137022680.0
  ], 
  [
   191554, 
   null, 
   "Steeeeve", 
   "To someone who works for a company that's in the Hollywood marketing research business, these convoluted attempts to cast Brokeback Mountain's box office in a negative light are laughably and transparently desperate. Nobody--repeat, nobody--in Hollywood considers Brokeback anything less than a huge success, despite the fact that it's still in theaters and has yet to fully \"go wide.\" Success isn't gauged here by how a movie does compared to this or that other film, but by how much more it pulls in than it cost to make. (It's called \"return on your investment.\") \n \n At last report, Brokeback had grossed almost double its production cost. It has also wildly exceeded the expectations of its makers. It has been showered with awards and nominations, and is a shoo-in for a Best Picture Oscar nomination, as are Ang Lee, Heath Ledger, the cinematographer, and the adapters. The attempts by some here to paint this as some kind of failure are so divorced from any kind of reality as to be surreal. \n \n Sorry, folks, it's a hit, even with many, many straight people (it would have to be, as we all \"know\" how few gay people there really are, right?). Refusing to acknowledge the fact just makes your already-blatant prejudice all the more evident.\n\n \n Who is calling it a failure? I think we called it \"not a blockbuster\" and we are downplaying the per-screen average and we are a little skepticial of making this movie \"best picture\" seemingly because it is between 2 gay men. We are just downplaying the movies financials because you can't compare them to other movies.", 
   {}, 
   191550, 
   null, 
   1137023460.0
  ], 
  [
   191555, 
   null, 
   "jyoshu", 
   "To someone who works for a company that's in the Hollywood marketing research business, these convoluted attempts to cast Brokeback Mountain's box office in a negative light are laughably and transparently desperate. Nobody--repeat, nobody--in Hollywood considers Brokeback anything less than a huge success, despite the fact that it's still in theaters and has yet to fully \"go wide.\" Success isn't gauged here by how a movie does compared to this or that other film, but by how much more it pulls in than it cost to make. (It's called \"return on your investment.\") \n \n At last report, Brokeback had grossed almost double its production cost. It has also wildly exceeded the expectations of its makers. It has been showered with awards and nominations, and is a shoo-in for a Best Picture Oscar nomination, as are Ang Lee, Heath Ledger, the cinematographer, and the adapters. The attempts by some here to paint this as some kind of failure are so divorced from any kind of reality as to be surreal. \n\n \n Wow, by THAT standard, Waterworld (generally considered to be a failure in Hollywood) was a pretty darn good success. It took in $264,218,220, and cost $175 million to make. But I've never heard of anyone who said it was a success as a movie. No, it's not profit that decides whether or a film is a success, but rather whether or not it reaches or exceeds expectations of profit. I guess that's why so many gay rights people think this film is apparently the next Titanic, because they must have had awfully low expectations to begin with. Let me tell you, I'm really not surprised the film has made a profit.\n \n And I also don't think anyone here has said it was truly a \"failure.\" Sometimes I wonder if a few of you are reading the same thread as everyone else.", 
   {}, 
   191550, 
   null, 
   1137023580.0
  ], 
  [
   191564, 
   null, 
   "BobNelson2", 
   "No, but Brokeback hasn't even come close to that. It's just under 24 million dollars. (http://www.boxofficemojo.com/movies/?id=brokebackmountain.htm)\n \n It cost around 14 million just to make it, so yeah in terms of the idea that it's made a profit, I guess you could say it's doing well.\n\n \n That's U.S. theatre receipts. Other income already exceeds $20,000,000.", 
   {}, 
   191541, 
   null, 
   1137025680.0
  ], 
  [
   191566, 
   null, 
   "BobNelson2", 
   "Um, no. the real picture is that we weren't talking about artistic success, and you used artistic success to answer our observations about it's financial status.\n\n \n The movie is garnering overwhelming praise on its artistic merit and glowing appraisal of its financial success from the movie industry. \n \n It really matters little what you think and it makes you look so, so biased when you argue with how the film industry evaluates itself.\n \n y a w n", 
   {}, 
   191542, 
   null, 
   1137026040.0
  ], 
  [
   191568, 
   null, 
   "MrWriteLA", 
   "That's U.S. theatre receipts. Other income already exceeds $20,000,000.\n \nThe acclaimed Ang Lee drama generated its largest weekend gross to date and averaged a strong $11,856 per theater outperforming the averages of all other major releases once again. Brokeback climbed to $22.4M and is on course to collect much more. \n http://www.boxofficeguru.com/weekend.htm", 
   {}, 
   191564, 
   null, 
   1137026400.0
  ], 
  [
   191573, 
   null, 
   "Steeeeve", 
   "you quoted the part I have a problem with....per screen average is a bad fact for reasons already stated in this thread.", 
   {}, 
   191568, 
   null, 
   1137030660.0
  ], 
  [
   191785, 
   null, 
   "tonybrown74", 
   "you quoted the part I have a problem with....per screen average is a bad fact for reasons already stated in this thread.\n\n \n The thing is though, now that the movie is in wider release, the per screen averages are still high. Even more interesting is the fact that the movie is doing extremely well in areas that aren't considered liberal or gay bastions.", 
   {}, 
   191573, 
   null, 
   1137103740.0
  ], 
  [
   191896, 
   null, 
   "Matthew S", 
   "The thing is though, now that the movie is in wider release, the per screen averages are still high. Even more interesting is the fact that the movie is doing extremely well in areas that aren't considered liberal or gay bastions.\n\n \n \n Don't waste your breath they won't believe it untill it brings in 100,000,000$", 
   {}, 
   191785, 
   null, 
   1137165240.0
  ], 
  [
   192821, 
   null, 
   "MrWriteLA", 
   "And actors in other pro-GLBT films won two more. \n\"Brokeback Mountain\" is moseying along the Academy Awards trail, its four Golden Globe wins -- best drama among them -- positioning the cowboy love story for Oscar glory.\n \n Homosexual and transsexual themes dominated Monday's Golden Globes with the key wins by \"Brokeback Mountain,\" plus acting honors for the film biography \"Capote\" and the gender-bending \"Transamerica.\"\n http://www.cnn.com/2006/SHOWBIZ/Movies/01/17/golden.globes.ap/index.html\n \n It should be amusing watching our resident anti-gay duo contort themselves into pretzels minimizing the significance of these wins.\n \n (By the way, \"Brokeback\" has now more than doubled its $14M production cost: http://www.boxofficemojo.com/movies/?id=brokebackmountain.htm)", 
   {
    "post_info": {
     "post_title": "Brokeback wins 4 Golden Globes"
    }
   }, 
   188086, 
   null, 
   1137517200.0
  ], 
  [
   192829, 
   null, 
   "jyoshu", 
   "It should be amusing watching our resident anti-gay duo contort themselves into pretzels minimizing the significance of these wins.\n\n \n Hey Steeeve, I think he's talking about us (even though we're not really anti-gay). Cool, never been part of a \"duo\" before! emoticon_xhoho \n \n Anyway, congrats to the Brokeback film for winning the awards. Good for them.", 
   {}, 
   192821, 
   null, 
   1137519480.0
  ], 
  [
   192838, 
   null, 
   "MrWriteLA", 
   "Brokeback Mountain continues to expand into small markets, gaining slowly but surely in suburban and rural areas whilst its big-city box office starts to lose its lustre. Focus' strategy on this one seems to be working beautifully: Oscar buzz keeps getting louder as the picture, slowly but surely, rolls out wider, making for non-existant overall drop-offs even as the film runs out of first-time viewers in urban markets.\n http://cinematical.com/2006/01/16/brokeback-mounts-small-markets-variety-in-60-seconds/ \nReported Variety: \n In the few big cities where \"Brokeback\" debuted, it performed extremely well, grossing well over $20,000 in Tucson, Ariz.; Little Rock, Ark.; and Pittsburgh.\n http://www.arktimes.com/weblogs/WeblogItemDetail.aspx?WebLogItemID=52a3c3d3-34b7-4d12-98e3-3f4ab9c55617&WeblogID=7af43c0e-2954-4e7f-83d7-fbc43cf3e696 \nMy only complaint was concerning the late release in Nebraska. I don't understand why such a great movie wouldn't have been accepted with open arms by the Omaha community. However considering that the movie theater was packed a week after release, I'm glad to see that we can now show the theaters that we aren't as close minded as they may assume.\n http://www.unogateway.com/vnews/display.v/ART/2006/01/17/43cc5add2c0dc \n\"The only comments I've heard is asking when we're getting it,\" said Jeff Shew, manager of Surf Cinemas in Southport, N.C. \"We got a few e-mails and six or seven calls. You figure every call probably represents 6 or 7 people. So that's quite a bit of buzz.\"\n http://www.myrtlebeachonline.com/mld/myrtlebeachonline/news/local/13642741.htm", 
   {}, 
   188086, 
   null, 
   1137522480.0
  ], 
  [
   192841, 
   null, 
   "MrWriteLA", 
   "Jason Walsmith stunned his wife last weekend when he told her that he wanted to see ''Brokeback Mountain.''\n \n \"I heard a story on National Public Radio talking about it and it piqued my interest,\" said Walsmith, 31, of Des Moines, best known as a member of the band the Nadas. ''She was surprised. Then she was bitter because she thought of all the other movies she wanted to me to see but didn't think I wanted to see.''...\n \n Katie Cox, 22, of West Des Moines, said she needed to do a little - but not much - persuading to get her husband, Ben, to go. The cultural shorthand for the film is that it's ''the gay cowboy movie,'' which has made it fodder for water-cooler discussions.\n \n ''There had been a lot of hype surrounding the movie and I was curious what it was really about,'' she said. \"It's a different movie than what you normally see. By the end you forgot that it was about homosexuals.''\n \n Lou Lyle didn't hesitate to see the film with his wife, Julie, who ''has a thing'' for Heath Ledger, who co-stars in ''Brokeback Mountain'' with Jake Gyllenhaal. Lyle was familiar with the films of director Ang Lee (\"Crouching Tiger, Hidden Dragon,\" \"Hulk\") and decided the movie would be worth seeing.\n \n ''It's a good love story,'' said Lyle, 31, of Des Moines. ''It's very down to earth, true, heartfelt . . . There's tragedy and there's happiness - it portrays what real life is about.''\n \n Becky Quinn and her friend, Denis Graber, went to the film to see if it was as good as the reviews indicated. ''I thought it was a heartbreaking story,'' said Graber, 54. ''Two desperately lonely people looking for a connection.''\n \n Julie Butterworth, manager of the Fleur Cinema, said lots of couples have been coming to see the movie. A number of screenings have sold out, she said.\n \n ''We have customers that are seeing it three to four times because it's so powerful and moving,'' she said. ''Our customers are telling us that the performances are amazing and that's what keeps them coming back to see it.''\n http://desmoinesregister.com/apps/pbcs.dll/article?AID=/20060114/ENT03/60115002/1049", 
   {
    "post_info": {
     "post_title": "And in Iowa..."
    }, 
    "unicode_changes_made": true
   }, 
   188086, 
   null, 
   1137522900.0
  ], 
  [
   192845, 
   null, 
   "MrWriteLA", 
   "If you are looking for a cultural signpost to the future of gay marriage, you need look no further than the reaction to the saga of love-struck cowboys. Never mind that \"Brokeback Mountain'' has a good chance to corral more than its share of major awards at the Golden Globes ceremony on Monday. The big news is that the film is being embraced even in red states.\n \n There were early signs that this might happen when \"Brokeback'' played to big crowds in December at the cineplex in Plano, Texas. This month, according to the Dallas Morning News, the film has more than quadrupled the number of theaters where it's playing, to 269 screens, and its audiences have increased by more than 60 percent. We're talking about audiences in the heart of the Midwest and in the South -- not exactly the demographic you'd expect to warm to a tale about gay Marlboro men.\n \n Universal love story\n \n But that's the power of a beautifully filmed love story. The appeal is universal. As tragic on-screen lovers go, Ali MacGraw and Ryan O'Neal have nothing on the two \"Brokeback'' cowboys. No wonder it seems to be turning into a date movie -- for heterosexuals.\n \n When Ann Davidson went to the film in Palo Alto recently, she saw what appeared to be mostly heterosexual couples in the audience, many of whom were middle-aged. It was the same for Mary Ann Woodall when she saw it at Santana Row in San Jose and for Joyce Miller when she saw it at the PruneYard in Campbell.\n \n \"I think this will be a turning point for people who have not thought about gay and lesbian relationships,'' said Davidson, whose son is gay. \"They will be moved by the power of this film without any labels being attached to it.''\n \n Davidson, Woodall and Miller have a special interest in \"Brokeback Mountain'' because they are members of the South Bay chapter of PFLAG, or Parents, Families and Friends of Lesbians and Gays. They say the time is right for a movie to bust through the stereotypes of gays as urban interior decorators and drag queens. It's time to see gay relationships portrayed as simply human, not as a \"lifestyle'' or an \"issue.''\n \n Story rings true\n \n Miller, whose son is gay, runs a PFLAG support group for straight men and women divorced from gay spouses, and she said the film really hit home: \"This movie may be the best way for people to see that denying others the right to love who they want to love causes major collateral damage.''\n \n Meanwhile, gay-marriage bans continue to lose traction. A recent California poll showed a trend toward more approval of gay marriage, with as many people for it as against it. That's a significant change from only five years ago, when a clear majority opposed it. Polls also show that people under 30 are far more accepting of gay marriage.\n \n But if you really want to get a sense of the inevitability of gay marriage, just go to your local theater and check out the response to \"Brokeback Mountain.'' When I saw it last month, with a crowd that appeared to be all heterosexual couples and families, I went through an entire purse-packet of Kleenex. And I wasn't the only one.\n \n I thought about cowboy Ennis Del Mar's line when he tried to explain to Jack Twist, the love of his life, why they could never be together: \"If you can't fix it, you gotta stand it.''\n \n They had to stand for being kept apart, but the time is coming when even cowboys like Jack and Ennis won't have to stand for it anymore.\n http://www.mercurynews.com/mld/mercurynews/entertainment/13626084.htm", 
   {
    "post_info": {
     "post_title": "`Brokeback' may herald acceptance of gay marriage"
    }
   }, 
   192841, 
   null, 
   1137523500.0
  ], 
  [
   192883, 
   null, 
   "jyoshu", 
   "FROM THE WIRES . . . . At last report, Brokeback Mountain is slated to completely do away with world hunger within a matter of days, if it maintains its current pace. Some experts are even predicting the film will usher in worldwide utopia and an end to oppressive regimes everywhere. emoticon_xangel", 
   {}, 
   192845, 
   null, 
   1137535380.0
  ], 
  [
   192902, 
   null, 
   "Matthew S", 
   "FROM THE WIRES . . . . At last report, Brokeback Mountain is slated to completely do away with world hunger within a matter of days, if it maintains its current pace. Some experts are even predicting the film will usher in worldwide utopia and an end to oppressive regimes everywhere. emoticon_xangel\n\n \n \n I don't know about everywhere but it would be fine with me if it helped end the Shrubs regime.", 
   {}, 
   192883, 
   null, 
   1137540660.0
  ], 
  [
   193157, 
   null, 
   "beervolcano", 
   "The relationship begins before either of them are married or have children, and continues--emotionally, at least--after one of them is divorced and, arguably, even beyond death. \n \n Not exactly \"having a fling.\"\n\n \n If they were gay, why did they get married to women? Or are they bisexual or something? Either way, if I had a girlfriend in college, then married someone else, then went off and screwed the ex-girlfriend, that would be adultery (cheating), wouldn't it? That would be \"having a fling.\" Does the movie allow any sympathy for the wives in this movie? How does it treat the wives? Does it show them to be tormented by all this or are they the tormenters? What happens to the children?\n \n I guess I have to see the movie to understand, but I'll wait for the video (or download it). No way am I paying $9 to sit through some sappy movie, especially one with nothing but man love, and especially just to know what all the fuss is about.", 
   {}, 
   190942, 
   null, 
   1137634920.0
  ], 
  [
   193187, 
   null, 
   "joebrummer", 
   "If they were gay, why did they get married to women? Or are they bisexual or something? Either way, if I had a girlfriend in college, then married someone else, then went off and screwed the ex-girlfriend, that would be adultery (cheating), wouldn't it? That would be \"having a fling.\" Does the movie allow any sympathy for the wives in this movie? How does it treat the wives? Does it show them to be tormented by all this or are they the tormenters? What happens to the children?\n \n I guess I have to see the movie to understand, but I'll wait for the video (or download it). No way am I paying $9 to sit through some sappy movie, especially one with nothing but man love, and especially just to know what all the fuss is about.\n\n \n \n The moive isn't really sappy, and has some significant violence. There is plenty of naked, heterosexual sex in it as well. There is much more to this movie than a gay thing.", 
   {}, 
   193157, 
   null, 
   1137645420.0
  ], 
  [
   193229, 
   null, 
   "jyoshu", 
   "The moive isn't really sappy, and has some significant violence. There is plenty of naked, heterosexual sex in it as well. There is much more to this movie than a gay thing.\n\n \n If it's not strictly a 'gay movie', then why are you guys acting like the gay pride movement's messiah has arrived in its airing?", 
   {}, 
   193187, 
   null, 
   1137687120.0
  ], 
  [
   193232, 
   null, 
   "joebrummer", 
   "If it's not strictly a 'gay movie', then why are you guys acting like the gay pride movement's messiah has arrived in its airing?\n\n \n \n \n because it's not strictly a gay thing, it has a universal appeal.", 
   {}, 
   193229, 
   null, 
   1137688380.0
  ], 
  [
   193236, 
   null, 
   "MrWriteLA", 
   "because it's not strictly a gay thing, it has a universal appeal.\n Evidently.\n \n Tuesday it was number one at the box office: http://movies.yahoo.com/mv/boxoffice/daily/\n \n And last night, too, for that matter.\n \n As well as being the two most popular audio downloads, according to iTunes: number one for the recording of the story and number two for the soundtrack.", 
   {}, 
   193232, 
   null, 
   1137690000.0
  ], 
  [
   193277, 
   null, 
   "BobNelson2", 
   "If it's not strictly a 'gay movie', then why are you guys acting like the gay pride movement's messiah has arrived in its airing?\n\n \n Because it's a great movie and one of the very few that depict some of our lives. \n \n Of course, much of the volume of this thread from our side is defending the movie from asinine comments from people who haven't even seen it...\n \n Why are you even commenting on it if you haven't seen it? I realize it's not likely to play anywhere near where you live anytime soon, but you could just hold your tongue till you've seen it.\n \n By the way, on another board, the resident \"devil's advocate\" and scoffer at things gay (kind of like you, jyoshu, though hardly as prolific in his posts) saw the film and said he can't get it out of his head.", 
   {}, 
   193229, 
   null, 
   1137707760.0
  ], 
  [
   193281, 
   null, 
   "jyoshu", 
   "Because it's a great movie and one of the very few that depict some of our lives. \n \n Of course, much of the volume of this thread from our side is defending the movie from asinine comments from people who haven't even seen it...\n \n Why are you even commenting on it if you haven't seen it? I realize it's not likely to play anywhere near where you live anytime soon, but you could just hold your tongue till you've seen it.\n\n \n Sure it's playing near where I live. But I'll probably wait for the rental if I see it at all.", 
   {}, 
   193277, 
   null, 
   1137708180.0
  ], 
  [
   193304, 
   null, 
   "beervolcano", 
   "The moive isn't really sappy, and has some significant violence. There is plenty of naked, heterosexual sex in it as well. There is much more to this movie than a gay thing.\n\n I see.\n \n Is there any way you could explain how the wives are treated in this movie?\n And I ask again, if the men went off and married women does that mean they are really bisexual? What would drive them to marry women and have children? I've known gay men that had girlfriends before \"coming out\" and others who are utterly turned off by women. I would think the ones that went out with girls weren't completely homosexual, but more like bisexual with a preference for other guys.", 
   {}, 
   193187, 
   null, 
   1137714420.0
  ], 
  [
   193338, 
   null, 
   "joebrummer", 
   " I see.\n \n Is there any way you could explain how the wives are treated in this movie?\n \n \n\n \n The wives suffered or at least one of them. It is portrayed in a sad and honest way. It would have been no different if the men had been cheating on their wives with women. In this case it was a man. The pain is there either way. Sad, if we didn't live in a society that teaches men to try and be something they are not, less gay guys would marry woemn to cover up their feelings.\n \n\n And I ask again, if the men went off and married women does that mean they are really bisexual? \n \n\n No not necessarily. It means they forced themself to play along with what people expected them to do. The moive as explains this in a non-verbal way in the l;ove scenes between Ennis and his wife. I can't explain it because you would need to see it.\n \n \n\n What would drive them to marry women and have children? I've known gay men that had girlfriends before \"coming out\" and others who are utterly turned off by women. I would think the ones that went out with girls weren't completely homosexual, but more like bisexual with a preference for other guys.\n\n \n \n Well that may be in some cases. What drives men to marry women and have children? That one should be obvious but I realize it isn't. Look around you in this society, also keep in my in this movie it is a different time and place. People just weren't gay. You went and got married that is what you did. You lie about it, fake it. Doesn't mean they are bisexual, I never considered myself bi-sexual and I am not turned on by women, but I have been with women. You can \"go though the motions\" doesn't mean ti is that enjoyable.", 
   {}, 
   193304, 
   null, 
   1137722700.0
  ], 
  [
   193621, 
   null, 
   "JakeCJB", 
   "because it's not strictly a gay thing, it has a universal appeal.\n\n \n Yes. I saw Brokeback Mountain tonight. It's a very sensitive and affecting love story. It demonstrates that feeling of heart-aching true love more profoundly than I have ever before seen in a film. Gay or straight, it doesn't matter. Yes, it has universal appeal, to everyone who does not have a heart of stone. I can't imagine anyone not being moved after seeing this film.", 
   {}, 
   193232, 
   null, 
   1137835380.0
  ], 
  [
   193633, 
   null, 
   "Matthew S", 
   "Yes. I saw Brokeback Mountain tonight. It's a very sensitive and affecting love story. It demonstrates that feeling of heart-aching true love more profoundly than I have ever before seen in a film. Gay or straight, it doesn't matter. Yes, it has universal appeal, to everyone who does not have a heart of stone. I can't imagine anyone not being moved after seeing this film.\n\n \n \n Pat Robertson, Jerry Falwell, Fred Phelps, G. W. Bush, Pope Benedict XVI, and many many many other anti gay people who do have hearts of stone when it comes to glbt issues.", 
   {}, 
   193621, 
   null, 
   1137852540.0
  ], 
  [
   193729, 
   null, 
   "jyoshu", 
   "Yes. I saw Brokeback Mountain tonight. It's a very sensitive and affecting love story. It demonstrates that feeling of heart-aching true love more profoundly than I have ever before seen in a film. Gay or straight, it doesn't matter. Yes, it has universal appeal, to everyone who does not have a heart of stone. I can't imagine anyone not being moved after seeing this film.\n\n \n Isn't it about a gay adulterous fling? I mean, no matter how much a filmaker makes something look dramatic and heartwarming, that's what it is, when it's all boiled down. Is it really a good thing to be so \"moved\" by an adulterous relationship anyway? How can I support something like that by going to see it?", 
   {}, 
   193621, 
   null, 
   1137875040.0
  ], 
  [
   193730, 
   null, 
   "Matthew S", 
   "Isn't it about a gay adulterous fling? I mean, no matter how much a filmaker makes something look dramatic and heartwarming, that's what it is, when it's all boiled down. Is it really a good thing to be so \"moved\" by an adulterous relationship anyway? How can I support something like that by going to see it?\n\n \n \n That is not the point. If the heterosexual dominated society didn't demand that they get married or get beaten to death then they would have stayed together and never married women. To force two gay men into an unatural situation then to condem them for acting on their ture nature is outrageous.", 
   {}, 
   193729, 
   null, 
   1137875880.0
  ], 
  [
   193733, 
   null, 
   "jyoshu", 
   "That is not the point. If the heterosexual dominated society didn't demand that they get married or get beaten to death then they would have stayed together and never married women. To force two gay men into an unatural situation then to condem them for acting on their ture nature is outrageous.\n\n \n It sounds like Brokeback is based entirely on the assumption that being gay is ok and it's just a natural thing. Did they even note the other side of the issue in any way (other than making it look demonic which is often how it's protrayed)? Obviously it's based on the writer's viewpoint on all this and it's an attempt to give it an everyday application and look.\n \n And adultery is still wrong, in my view. No matter how much it \"feels\" natural to do it.", 
   {}, 
   193730, 
   null, 
   1137876120.0
  ], 
  [
   193742, 
   null, 
   "Matthew S", 
   "It sounds like Brokeback is based entirely on the assumption that being gay is ok and it's just a natural thing. \n\n \n \n What part of it is natural do you not understand?", 
   {}, 
   193733, 
   null, 
   1137877440.0
  ], 
  [
   193747, 
   null, 
   "JakeCJB", 
   "It sounds like Brokeback is based entirely on the assumption that being gay is ok and it's just a natural thing. Did they even note the other side of the issue in any way (other than making it look demonic which is often how it's protrayed)? Obviously it's based on the writer's viewpoint on all this and it's an attempt to give it an everyday application and look.\n \n And adultery is still wrong, in my view. No matter how much it \"feels\" natural to do it.\n\n \n Jyoshu, you really do need to see this film, before you can make assumptions about it. The assumptions you are making seem very foolish to those of us who have seen Brokeback Mountain. The film did not condone adultery. The film showed the horrible pain of Ennis' wife, upon discovering her husband was having an affair. It showed the pain she was in, while keeping this knowledge to herself, for many years. It showed the tension between both of them, as a result of the secret. Ennis, in particular, is shown as a character, warts and all, along with his good points. He isn't so great to his wife, he can have a violent temper, and he loves his daughter. He loves Jack, but through most of the film, has difficulty expressing it. Ennis has trouble expressing himself and his feelings.", 
   {}, 
   193733, 
   null, 
   1137879540.0
  ], 
  [
   193751, 
   null, 
   "jyoshu", 
   "Jyoshu, you really do need to see this film, before you can make assumptions about it. The assumptions you are making seem very foolish to those of us who have seen Brokeback Mountain. The film did not condone adultery. The film showed the horrible pain of Ennis' wife, upon discovering her husband was having an affair. It showed the pain she was in, while keeping this knowledge to herself, for many years. It showed the tension between both of them, as a result of the secret. Ennis, in particular, is shown as a character, warts and all, along with his good points. He isn't so great to his wife, he can have a violent temper, and he loves his daughter. He loves Jack, but through most of the film, has difficulty expressing it. Ennis has trouble expressing himself and his feelings.\n\n \n Ok, I'll have to rent it in a few months when it comes out on video.", 
   {}, 
   193747, 
   null, 
   1137880500.0
  ], 
  [
   195809, 
   null, 
   "MrWriteLA", 
   "On Tuesday, the story of two romantically involved male ranch hands -- which already has won best picture honors from the Golden Globes (drama), Broadcast Film Critics Association and New York Film Critics Circle -- crowned its status as Oscar front-runner by leading all films with eight nominations for the 78th annual Academy Awards. \nhttp://www.cnn.com/2006/SHOWBIZ/Movies/01/31/oscar.nominations/index.html\n \n To date it's earned $51 million domestically and almost $11 million internationally, and will no doubt reap much more as a result of the nominations and eventual wins.", 
   {
    "post_info": {
     "post_title": "&quot;Brokeback Mountain&quot; gets 8 Oscar nominations"
    }
   }, 
   188086, 
   null, 
   1138735080.0
  ], 
  [
   195861, 
   null, 
   "Missouri Mule", 
   "Ok, I'll have to rent it in a few months when it comes out on video.\n\n \n I'll rent this after I rent Michael Moore's \"9/11\" and Linda Lovelace's \"Deep Throat.\" Which will be never. I don't want pornography.", 
   {}, 
   193751, 
   null, 
   1138748460.0
  ], 
  [
   195868, 
   null, 
   "jyoshu", 
   "I'll rent this after I rent Michael Moore's \"9/11\" and Linda Lovelace's \"Deep Throat.\" Which will be never. I don't want pornography.\n\n \n I haven't seen it, but based on what I've heard here and elsewhere I really don't think it's comparable to either film you mention. Like I said, I haven't seen it so I may discover differently when I do see it at some point.", 
   {}, 
   195861, 
   null, 
   1138750200.0
  ], 
  [
   195889, 
   null, 
   "BobNelson2", 
   "I don't want pornography.\n\n \n Don't be such a prude. They only show the wife's boobies for about 30 seconds.", 
   {}, 
   195861, 
   null, 
   1138751820.0
  ], 
  [
   195908, 
   null, 
   "Wez", 
   "I'll rent this after I rent Michael Moore's \"9/11\" and Linda Lovelace's \"Deep Throat.\" Which will be never. I don't want pornography.\n\n Kissing and naked people don't make something pornography.\n \n Reminds me of whoever it was that showed a tit on TV for 1/2 a second and millions started whining.\n \n (and I hated the 9/11 film as well: it was shockingly bad)\n \n -Wez", 
   {}, 
   195861, 
   null, 
   1138754100.0
  ], 
  [
   195917, 
   null, 
   "Matthew S", 
   "Kissing and naked people don't make something pornography.\n \n Reminds me of whoever it was that showed a tit on TV for 1/2 a second and millions started whining.\n \n (and I hated the 9/11 film as well: it was shockingly bad)\n \n -Wez\n\n \n \n 911 was one of the best films ever. Some people can't handle the truth.", 
   {}, 
   195908, 
   null, 
   1138755180.0
  ], 
  [
   196017, 
   null, 
   "Wez", 
   "911 was one of the best films ever. Some people can't handle the truth.\n\n *creates new thread*\n \n http://4forums.com/political/showthread.php?p=196016#post196016\n \n -Wez", 
   {}, 
   195917, 
   null, 
   1138811100.0
  ], 
  [
   196339, 
   null, 
   "MrWriteLA", 
   "This is pretty hilarious:\n \n http://www.youtube.com/watch?v=zfODSPIYwpQ", 
   {}, 
   188086, 
   null, 
   1138930620.0
  ], 
  [
   196357, 
   null, 
   "emoreno2292", 
   "Heavens to betsy, that is a hoot with a capital HEWT.", 
   {}, 
   196339, 
   null, 
   1138939440.0
  ], 
  [
   196363, 
   null, 
   "Matthew S", 
   "This is pretty hilarious:\n \n http://www.youtube.com/watch?v=zfODSPIYwpQ\n\n \n \n That was horrible unspeakable. I don't know wether to laugh or scream in rage.", 
   {}, 
   196339, 
   null, 
   1138942980.0
  ], 
  [
   196436, 
   null, 
   "emoreno2292", 
   "That was horrible unspeakable. I don't know wether to laugh or scream in rage.\n\n Oh, lighten up, matthew. sometimes you're no better than those islamic extremists who go bonkers over a few drawings.", 
   {}, 
   196363, 
   null, 
   1138986660.0
  ], 
  [
   196473, 
   null, 
   "Wez", 
   "That was horrible unspeakable. I don't know wether to laugh or scream in rage.\n\n Why would you scream in rage?emoticon_confused \n \n -Wez", 
   {}, 
   196363, 
   null, 
   1138993560.0
  ], 
  [
   196500, 
   null, 
   "BobNelson2", 
   "Why would you scream in rage?emoticon_confused \n \n -Wez\n\n \n Maybe Back to the Future is Matthew's favorite movie....", 
   {}, 
   196473, 
   null, 
   1138999080.0
  ], 
  [
   197179, 
   null, 
   "BobNelson2", 
   "Great review of BBM in the New York Review of Books. Right on target in all ways.\n \n http://www.nybooks.com/articles/18712\n \n \n\n The real achievement of Brokeback Mountain is not that it tells a universal love story that happens to have gay characters in it, but that it tells a distinctively gay story that happens to be so well told that any feeling person can be moved by it. If you insist, as so many have, that the story of Jack and Ennis is OK to watch and sympathize with because they're not really homosexual-that they're more like the heart of America than like \"gay people\"-you're pushing them back into the closet whose narrow and suffocating confines Ang Lee and his collaborators have so beautifully and harrowingly exposed.\n \n", 
   {
    "unicode_changes_made": true
   }, 
   196500, 
   null, 
   1139359200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Brokeback mountain", 
  "url": "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 7181, 
  "discussion_files": [
   [
    "15494.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-print.html"
   ], 
   [
    "15495.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-12-print.html"
   ], 
   [
    "15496.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-10-print.html"
   ], 
   [
    "15497.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-8-print.html"
   ], 
   [
    "15498.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-6-print.html"
   ], 
   [
    "15499.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-4-print.html"
   ], 
   [
    "15500.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-5-print.html"
   ], 
   [
    "15501.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-7-print.html"
   ], 
   [
    "15502.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-9-print.html"
   ], 
   [
    "15503.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-11-print.html"
   ], 
   [
    "15504.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-3-print.html"
   ], 
   [
    "15505.html", 
    "http://www.4forums.com/political/gay-rights-debates/7181-brokeback-mountain-2-print.html"
   ]
  ], 
  "identifier": 7181
 }
]