[
 [
  [
   188598, 
   null, 
   "Santafeur", 
   "seeing as I'm in thailand for the next year (and possibly more), I figured I might as well post a few things on thai cooking. this post is just an overview- I'll be coming back to post individual recipes as I have the time -recipes such as Pad Thai, gapao muu, and muu ping- as well as ways of making 'staple' foods, such as sticky rice, and ways to grow your own thai herbs for the truly hardcore among you- herbs such as lemon grass and pric, the thai chilli peppers.\n \n first, if you're going to cook a small animal (such as a fish, or chicken), the thais cook the whole animal (they seperate out some of the bits- like the entrails, feet, and head- but they still eat all of it, yes even the head, the intestines and whatever). and whatever they cook, they eat, folks.\n \n second, there are a few ingredients the thais prefer to use and a few that they never use (because they simply aren't available): lemons are virtually nonexistant in thailand, but limes are very common. pork is easily and by far the most common meat (at least in the north), and all of it is eaten- there are even special dishes for preparing parts such as the skin, feet, head, tongue and organs (I'm not kidding about this, folks, they really eat the skin too- because it's the best part!).\n \n next, tomatoes are generally pretty small and served cooked in a stew or soup- and generally not completely ripe either.\n \n next, if you want to do some *serious* thai cooking, you need fish sauce (naam bplaa), which is basically a vinegary mixture of an anchove-like fish that is boiled in seawater and then left to decay/ferment for at least one year (no, there aren't any visible bits of fish floating around in it). this is used as a salt substitute by the thai people and is generally served alongside your food with fresh hot peppers cut up into it.\n \n next, rice noodles: traditional thai noodles are made from rice paste and are pressed and dried. when cooked, they become clear with a slight white tint.\n \n lets not forget pepers: called 'pric', the smaller they are the spicier (not quite as hot as a habanero, but considerably hotter than a jalapeno). in the north and northeast, they are eaten raw or chopped up and served (stem and all) in dishes such as gapao muu. there are probably a dozen varieties of peppers (that I've seen) that are commonly eaten here, and all of them are hot (belle peppers generally go bad too quickly due to the high sugar content, so most thais don't bother with them).\n \n last but not least is sticky rice. sticky rice (and this is based on observation, I've never been allowed to prepare it or shown how) is just regular rice that is steamed instead of boiled: they have a special bamboo 'basket' in a roughly cone shape that they put the rice into, and then they put that (point down) over a pot of boiling water (in a special pot that looks something like a spitoon). this is left to steam for half an hour or so, then shaken to ensure even saturation of the rice and left to steam some more. to eat sticky rice, just grab a ball of it and dip it into anything you want to eat (this is part of the reason so many thai recipes are for soups) in the same way westerners eat bread with their stew- soak up some of the juices with it, and then use your thumb to 'pinch' a bit of meat or vegetable onto the mass and pop it all in your mouth.\n \n thats all for now, good luck and happy cooking.", 
   {
    "post_info": {
     "post_title": "thai cooking"
    }
   }, 
   null, 
   null, 
   1135870020.0
  ], 
  [
   193514, 
   null, 
   "safiatou", 
   "Very nice. Thai food is up there in my favorites list. I like to cook it. I like to eat it. I like to go to a restaurant where they prepare it for me. It always tastes better when somebody else cooks it but I enjoy cooking too.", 
   {}, 
   188598, 
   null, 
   1137797940.0
  ], 
  [
   209476, 
   null, 
   "jim's trucking", 
   "Very nice. Thai food is up there in my favorites list. I like to cook it. I like to eat it. I like to go to a restaurant where they prepare it for me. It always tastes better when somebody else cooks it but I enjoy cooking too.\nAgree! There's a Thai restuarant right around the corner from here...kindy spicey. I go there when I need to break out in a cold sweat to appear nervous or sick when I'm actually not...comes in handy when playing poker! LOL\n \n I have some friends who are Thai and they visit family there every summer for about three weeks. I'm planning to go with them in 2007. I want to see the elephants playing soccer and walking between men's live bodies lying down with only a foot of space between them. (Elephants watch where they put their front feet and then put their back feet in the same spot...hopefully!)", 
   {}, 
   193514, 
   null, 
   1145924640.0
  ], 
  [
   214545, 
   null, 
   "SubtleRedFlag", 
   "I absolutely love Thai food. There is a Thai-Lao restuarant only 2 blocks away from me. I get the sea food medley all of the time... squid, shrimp, scallops, fishballs... i love it. I'm a huge fan of the heat too... always ask them to make it as hot as they can.\n \n I wish I could make it on my own but the sauce is a mystery to me. \n \n Is the sticky rice the same that is used in sushi... I want to learn to make that too... save myself some money.", 
   {}, 
   209476, 
   null, 
   1148708460.0
  ], 
  [
   228803, 
   null, 
   "Aivlis", 
   "I believe that Japanese sushi rice and thai sticky rice are very different. Japanese have sushi rice and sticky right, sushi rice is usually much shorter and rounder. \n \n I once ordered sticky rice in a thai restaurant thinking it would be like japanese rice but I was wrong. It came in this cone-shaped bamboo container and it was so stuck together I don't think I would have even been able to separate it with a fork! It was also kinda sweet......i thought it was like the desert rice that is green w/ mangoes you get in thai places.", 
   {}, 
   214545, 
   null, 
   1156454280.0
  ], 
  [
   286902, 
   null, 
   "spicylemonade", 
   "I heard that most thai curry pastes contain fish or seafood derivatives. I'm a strict vegetarian and wondering if anyone knows of some that don't?", 
   {}, 
   228803, 
   null, 
   1191727800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  thai cooking", 
  "url": "http://www.4forums.com/political/cooking/7204-thai-cooking.html", 
  "breadcrumbs": [
   "Cooking"
  ], 
  "id_number": 7204, 
  "discussion_files": [
   [
    "28412.html", 
    "http://www.4forums.com/political/cooking/7204-thai-cooking-print.html"
   ]
  ], 
  "identifier": 7204
 }
]