[
 [
  [
   189321, 
   null, 
   "jim's trucking", 
   "I thought it was hilarious when the White House had to defend cookie gathering when it is legal and widespread among websites the world over. Cookie blocking and cookie deletions are not that hard to perform at the end of a surfing trip. \n \n http://www.redherring.com/Article.aspx?a=15101&hed=White+House+Crumbles+a+Cookie\n \n Can anyone who has been around systems imagine an entity as technically unsophisticated as the group that doesn&#8217;t know this?", 
   {
    "post_info": {
     "post_title": "Bush Cookies"
    }
   }, 
   null, 
   null, 
   1136176260.0
  ], 
  [
   189378, 
   null, 
   "Alan Ryan", 
   "It's another puerile attempt to whip up a fuss in a teacup. I suppose there is an \"ideological\" point in it somewhere...............?", 
   {}, 
   189321, 
   null, 
   1136219160.0
  ], 
  [
   189382, 
   null, 
   "daewoo", 
   "6 months ago it might have been a big deal. Now it is just another example of the Bush administration flipping the general public the bird. With their blantant disregard for the constitution, and federal law, I don't think anybody should be surprised that they are ignoring OMB directives.", 
   {}, 
   189378, 
   null, 
   1136220120.0
  ], 
  [
   189384, 
   null, 
   "georged", 
   "I thought it was hilarious when the White House had to defend cookie gathering when it is legal and widespread among websites the world over. Cookie blocking and cookie deletions are not that hard to perform at the end of a surfing trip. \n \n http://www.redherring.com/Article.aspx?a=15101&hed=White+House+Crumbles+a+Cookie\n \n Can anyone who has been around systems imagine an entity as technically unsophisticated as the group that doesn't know this?\n\n \n Sounds like you consider NSA breaking formal OMB policy a minor matter and that citizens should be responsible for correcting their errors. But as you support the occupation of Iraq, illegal wire tapping by NSA under presidential order and administration spending us into a ditch, that's not surprising.", 
   {
    "unicode_changes_made": true
   }, 
   189321, 
   null, 
   1136221440.0
  ], 
  [
   189412, 
   null, 
   "jim's trucking", 
   "Sounds like you consider NSA breaking formal OMB policy a minor matter and that citizens should be responsible for correcting their errors. But as you support the occupation of Iraq, illegal wire tapping by NSA under presidential order and administration spending us into a ditch, that's not surprising.\nSounds like you misinterpreted my remarks. I'm laughing at the ridiculous policy...and the need to defend the use of cookies by ANY webpage. Free cookies are likely passed out at most websites. They don't constitute hacking, that I know of. They can be used to track purchases and preferred topics of the computer users so ANYONE who drops the right cookie in your face when you visit their website can do just about anything they want with information gained from your leaving the cookie in your system OR LETTING IT IN TO START WITH. \n \n Your assumptions regarding my alleged support of things are misleading. I don't support \"the occupation\" of Iraq. I supported Saddam's ouster and I support the ongoing efforts to force peace in the area by responding to and killing terrorists. I'm expecting a day that we will have presense there no more than we do in other countries we have been through...and we certainly don't \"occupy\" those countries.\n \n I do not support illegal wiretapping. As I see it, the legality of what was done is in question. The Justice department is investigating the LEAK that exposed the secret practice in light of its effect on national security. There must be a whole slew of people that doubt that it was illegal.\n \n I do not support the \"administration spending us into a ditch.\" I can suggest many cuts in the budget and reductions of government featherbed jobs. Much of the spending appears to be driven by something other than a desire to spend. Some of his spending benefits the US economy. Too much of his spending is WASTED!", 
   {}, 
   189384, 
   null, 
   1136231760.0
  ], 
  [
   189426, 
   null, 
   "daewoo", 
   "Sounds like you misinterpreted my remarks. I'm laughing at the ridiculous policy...and the need to defend the use of cookies by ANY webpage. Free cookies are likely passed out at most websites. They don't constitute hacking, that I know of. They can be used to track purchases and preferred topics of the computer users so ANYONE who drops the right cookie in your face when you visit their website can do just about anything they want with information gained from your leaving the cookie in your system OR LETTING IT IN TO START WITH. \n\n \n It is not hte fact that cookies were used. It was the type of cookie, and the fact that the OMB had issued a directive banning their usage on government web pages. \n \n These are not cookies that track your usage within a single web site, or that that holds the contents of your shopping cart. These are cookies that track all your web browsing. \n \n \n \nI do not support illegal wiretapping. As I see it, the legality of what was done is in question. The Justice department is investigating the LEAK that exposed the secret practice in light of its effect on national security. There must be a whole slew of people that doubt that it was illegal.\n\n \n Maybe you could list some fo those folks who doubt it was, and is illegal. The investigation of the leak is just mroe of the same from the white house, hunt down, kill, and eat anybody who exposes their dealings. \n \n Bushs arguent that it is not illegal is based on his calims that the executive branch has a whole mess of powers that the constitution specifically prohibts them from having. He has already been smacked down by the supreme court on several occasions for this. Unfortunatly for Bush and his supporters, our constitution simply did not create a dictatorship were the president is above the law and holds unlimited power.", 
   {}, 
   189412, 
   null, 
   1136234280.0
  ], 
  [
   189433, 
   null, 
   "georged", 
   "Sounds like you misinterpreted my remarks. I'm laughing at the ridiculous policy...and the need to defend the use of cookies by ANY webpage. Free cookies are likely passed out at most websites. They don't constitute hacking, that I know of. They can be used to track purchases and preferred topics of the computer users so ANYONE who drops the right cookie in your face when you visit their website can do just about anything they want with information gained from your leaving the cookie in your system OR LETTING IT IN TO START WITH. \n \n Your assumptions regarding my alleged support of things are misleading. I don't support \"the occupation\" of Iraq. I supported Saddam's ouster and I support the ongoing efforts to force peace in the area by responding to and killing terrorists. I'm expecting a day that we will have presense there no more than we do in other countries we have been through...and we certainly don't \"occupy\" those countries.\n \n I do not support illegal wiretapping. As I see it, the legality of what was done is in question. The Justice department is investigating the LEAK that exposed the secret practice in light of its effect on national security. There must be a whole slew of people that doubt that it was illegal.\n \n I do not support the \"administration spending us into a ditch.\" I can suggest many cuts in the budget and reductions of government featherbed jobs. Much of the spending appears to be driven by something other than a desire to spend. Some of his spending benefits the US economy. Too much of his spending is WASTED!\n\n \n Brush up on cookies. \n \n Assumptions? Your rationalized response eliminated any question of that.", 
   {}, 
   189412, 
   null, 
   1136237100.0
  ], 
  [
   189478, 
   null, 
   "jim's trucking", 
   "\n Brush up on cookies. \nI do sport a moustache for that very purpose. My cookie blocking/cookie deletion comment should have clued you in to the realization that regardless of what kind of cookie someone is dispensing, it can be blocked or simply deleted after visiting any particular site. If their cookie can instantly grab your network surfing history, then I would certainly think it a total violation of rights. If it reports your future visits to other sites, it is overcome by deletion immediately after leaving that site. I know several people who operate cookie free. There are computer wizards all over the world trying to and succeeding in listening in, intercepting messages and personal data that clearly fall under the rules of privacy rights. Where I go on the net is nobody&#8217;s business, but I&#8217;m not inclined to worry about who&#8217;s listening in or keeping track or where I go whether it be the local criminals or the local police.\n \n \n \n \n\n Assumptions? Your rationalized response eliminated any question of that.\nHow so? You made assumptions based on my previous posting history and your opinion of it, not what I wrote in the opening post. If you read my words in the OP, you&#8217;ll find:\n \n I thought it was hilarious when the White House had to defend cookie gathering when it is legal and widespread among websites the world over. Cookie blocking and cookie deletions are not that hard to perform at the end of a surfing trip. \n \n &#8230;.\n \n \n Can anyone who has been around systems imagine an entity as technically unsophisticated as the group that doesn&#8217;t know this?\nThe first line merely identifies something I find humorous. The second line is merely a statement of what should be accepted as fact by anyone who has been around systems. The third line is merely a question regarding the second.\n \n Nowhere do I reveal any thoughts regarding the &#8220;occupation&#8221; of Iraq (France was occupied&#8230;until the Allies beat the occupiers&#8230;we have no intention of governing Iraq.) nor do I show any support of anything illegal or deficit spending.\n \n You simply made those three assumptions based on your uneducated suppositions about me.", 
   {}, 
   189433, 
   null, 
   1136247420.0
  ], 
  [
   189482, 
   null, 
   "daewoo", 
   "I do sport a moustache for that very purpose. My cookie blocking/cookie deletion comment should have clued you in to the realization that regardless of what kind of cookie someone is dispensing, it can be blocked or simply deleted after visiting any particular site. If their cookie can instantly grab your network surfing history, then I would certainly think it a total violation of rights. If it reports your future visits to other sites, it is overcome by deletion immediately after leaving that site. I know several people who operate cookie free. There are computer wizards all over the world trying to and succeeding in listening in, intercepting messages and personal data that clearly fall under the rules of privacy rights. Where I go on the net is nobody's business, but I'm not inclined to worry about who's listening in or keeping track or where I go whether it be the local criminals or the local police.\n \n\n \n that is the point here, Jim. If these were standard cookies it would be OK. They are not. They are stealth cookies that are not easily erased (and frankly, if you have not caught that distinction, any cookie deletion you are doing is worthless...quit wasting your time)", 
   {
    "unicode_changes_made": true
   }, 
   189478, 
   null, 
   1136248200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush Cookies", 
  "url": "http://www.4forums.com/political/news-forum/7227-bush-cookies.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 7227, 
  "discussion_files": [
   [
    "32601.html", 
    "http://www.4forums.com/political/news-forum/7227-bush-cookies-print.html"
   ]
  ], 
  "identifier": 7227
 }
]