[
 [
  [
   189678, 
   null, 
   "Bassman", 
   "The Campaign Finance \"Reform\" laws on the books since 2002 contains the following major provisions (from Wikipedia):\n \n * A wholesale prohibition on soft money contributions and expenditure to national political parties -- unlimited donations nominally made for non-campaign purposes, but potentially used to influence federal elections.\n * A prohibition on soft money contributions and expenditure to state and local political parties, with a few limited exceptions.\n * Federal candidates and officeholders prohibited from accepting or spending soft money.\n * A ban on supposedly non-partisan \"issue ads\" funded by soft money from corporations and labor unions - those referring to candidates for federal election without expressly advocating their election or defeat -- in the 60 days prior to a general election, or 30 days prior to a primary election.\n * Disclosure of sources of finance for \"electioneering communications\" in excess of $10,000 per year.\n * A political party spending money in a general election campaign must choose between making coordinated expenditures on behalf of its candidate, or independent expenditures on behalf of its candidate, but not both. (Ruled unconstitutional in McConnell v. FEC, but later upheld by the Supreme Court)\n * Minors are prohibited from making contributions to candidates and political parties. (Ruled unconstitutional in McConnell v. FEC, but later upheld by the Supreme Court)\n * Hard money legal limits raised:\n * Limit for individual contributions per candidate per election increased from $1,000 to $2,000.\n * Limit for individual contributions to National Party Committees increased from $20,000 to $25,000 per year.\n * Limit for individual contributions to state and local party committees increased from $5,000 to $10,000\n \n Now this all seems good, but there is one key loophole: The 527s. You know them; MoveOn.org. George Soros, et al. The law puts the kaibash on response ads from political opponents. All of the \"soft\" money that influenced candidates in the past continues to do so. Now, opposing candidates cannot respond. Your thoughts?", 
   {
    "post_info": {
     "post_title": "Thank You McCain &amp; Feingold!!!"
    }
   }, 
   null, 
   null, 
   1136346720.0
  ], 
  [
   189682, 
   null, 
   "georged", 
   "Add 'em up and rephrase your summary sentence:\n \n http://www.opensecrets.org/527s/527cands.asp?cycle=2006", 
   {}, 
   189678, 
   null, 
   1136348580.0
  ], 
  [
   189687, 
   null, 
   "Bassman", 
   "And your point is?...", 
   {}, 
   189682, 
   null, 
   1136349780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Thank You McCain & Feingold!!!", 
  "url": "http://www.4forums.com/political/politics-debates/7235-thank-you-mccain-feingold.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 7235, 
  "discussion_files": [
   [
    "32543.html", 
    "http://www.4forums.com/political/politics-debates/7235-thank-you-mccain-feingold-print.html"
   ]
  ], 
  "identifier": 7235
 }
]