[
 [
  [
   189686, 
   null, 
   "John Milosevic", 
   "Dear Readers~\n Schools should not sell junk food. Now, here in D.C. they sell soda, candy, and greasy food like Pizza, lots of sugary foods. This should not be allowed. What ever happened to lunch ladies cooking the food themselves? Now a day, they just pop a bunch of already mixed food into a pot and cook it up and serve it. Kids need to eat healthy foods. More vegetables, and less junk. Maybe offer milk and water instead of soda and sugary drinks. High schoolers should not be allowed off campus lunch anymore either. Cause the lunches I am talking about serving at high schools would cause them to eat out more and cost them a lot of money. \n High schools, or any school for that matter, should feed kids healthier meals. Soda should not be allowed at lunch. Soda has an affect on children. It makes them hyper and sometimes to alert and distracted. \n If we cut back on the unhealthy foods a bit in our schools, maybe kids in America will not be as obese. America is rapidly becoming the fattest. We need to deal with this.\n -John Milosevic", 
   {
    "post_info": {
     "post_title": "School food"
    }
   }, 
   null, 
   null, 
   1136349720.0
  ], 
  [
   189695, 
   null, 
   "Heads_On_Pikes", 
   "I agree mostly.\n \n Back in my day, lol, the school cafeteria served some damn good hot meals. Note I said SOME. We had open campus in high school at that time, and a McDonalds was strategicaly located a block away from my high school. Unfortunatly for me, or not, I was not one of the rich kids who could afford to go there every day. For a buck and a quarter the school meal was usually pretty good and well balanced.\n \n Opinion circu 1970's.\n \n Flashforward to the year 2000.\n \n My daughter's middle school had mini Wendy's, Subway, and Pizza Hut stations set up in the cafeteria competing with the school lunch, on top of pop machines, not only in the cafeteria, but in several of the hallways!\n \n This came to light at the first parent/teacher confrence....as the grand affair was held in right in the CAFETERIA! This was an environmental science orientated public school...and I kid you not...each individual school in the district was making their own contracts with the local beverage distributors for the almighty buck. My daughter's environmental science teacher proudly told me he was in charge of turning another buck on all of the alumunum cans.", 
   {}, 
   189686, 
   null, 
   1136353560.0
  ], 
  [
   189760, 
   null, 
   "simone", 
   "Junk food is a blight on American lives--particularly the lives of America's young who should be cute and muscular and active instead of little pudgy couch potatoes.", 
   {}, 
   189695, 
   null, 
   1136393880.0
  ], 
  [
   189789, 
   null, 
   "Obvious Child", 
   "Also, unhealthy food (both in terms of sugar and fat and lack of vitamins etc) reduces concentration and energy. A bit more spent on school food might make a lot of difference to grades.", 
   {}, 
   189760, 
   null, 
   1136397960.0
  ], 
  [
   190132, 
   null, 
   "John Milosevic", 
   "But, what I am getting at, is why do we serve our kids disgusting foods? Why do the schools feed our kids this stuff?\n Food should be nutritious. Your own government is feeding your kids. Some of the schools I go to, and some of the documentaries on this issue I have seen, the USDA sends premade food to our schools and the cooks just slop it up.\n Food is meant to be nutritious. You all are right. Unhealthy food affects their behavior, and their stamina. Soda pop machines should be banned from schools. I mean, teachers lounges, fine. But, access to soda for kids, is not a great idea. \n Unhealthy things we serve our kids today should not be allowed.\n In most of the schools here in Washington D.C., these kids when going through the lunch line, either have the option of a tray lunch, or our A La Carte line where on that line, we have: Pizza, breadsticks, candy i.e.( lifesavers, gummi bears, sour, warheads, skittles, starbursts) cheesesticks, chips, soda, country time (which has as much sugar as a soda) and so on.\n The last two years, I have watched for healthy things. The only healthy things on your childs lunch choices are water, triscuits, soup, and Fragensaft. That is all I have seen. Of course, not every school in this country is the same.\n My father who is a principal in New Mexico, says the superintendant and the board of education in his city has banned soda in schools, candy and unhealthy foods in their lunch lines, and he says his schools kitchen is also cooking food that is not premade. They make their food homemade. So, my question is, why isn't everyone doing this? The kids focus and do better in school at his school, compared to the hyped up kids at my schools. \n I can see the diffrence. My father and the school district he works for, has replaced vending machines with candy. If the kids want something out of the vending machines, they have healthy food. A little bag of triscuits, wheat thins, pretzels, and gatorade, powerade, and juice. Now, that school district sounds like it is being run perfectly. Now, you still see some kids with soda at school. They bring it from home. But, taking away the machines lowered the level of kids being able to have soda. \n The lunch lines in the district he works for, has banned chips, candy, grease food, soda, country time, and other unhealthy items. The kids eat the food at lunch, or bring a pack lunch. High school kids are not even allowed off campus because, that would be an everyday thing for them being as lunch doesn't have the flare it did.\n America is becoming the fattest nation in America, and we are doing nothing to prevent this. We should. We should not be supplying our kids with bad food. \n -John Milosevic", 
   {
    "post_info": {
     "post_title": "Yes!"
    }
   }, 
   189789, 
   null, 
   1136526300.0
  ], 
  [
   190167, 
   null, 
   "simone", 
   "Not MY government! It's the bloody corporations!", 
   {}, 
   190132, 
   null, 
   1136565480.0
  ], 
  [
   190403, 
   null, 
   "GreenMtnBoy", 
   "I saw a show recently, IIRC, on PBS. They found that school lunch is terrible, yet healthy food would cost the same. The problem is finding people willing to cook at a school. \n \n We almost got a bunch of fast foods at my HS, but they went with a regular service....and it wasn't much different. They had four \"stations\"...pizza, grinders (processed meat), burger+fries, and pasta (greasy mac and cheese,etc)\n \n Eating \"heavy food\" is just fine, it's the processed heavy food is the real problem. That and the lazyness of people these days. I eat 6,000 calories a day and my weight is unchanged for years.", 
   {}, 
   190167, 
   null, 
   1136635020.0
  ], 
  [
   191117, 
   null, 
   "Justawoman", 
   " \n My father who is a principal in New Mexico, says the superintendant and the board of education in his city has banned soda in schools, candy and unhealthy foods in their lunch lines, and he says his schools kitchen is also cooking food that is not premade. They make their food homemade. So, my question is, why isn't everyone doing this? The kids focus and do better in school at his school, compared to the hyped up kids at my schools. \n I can see the diffrence. My father and the school district he works for, has replaced vending machines with candy. If the kids want something out of the vending machines, they have healthy food. \n \n\n \n Same thing in our school district. It is working. Even the teachers have to bring their own junk food if they want it. My girls don't come home so hungry anymore either.", 
   {}, 
   190132, 
   null, 
   1136915640.0
  ], 
  [
   191380, 
   null, 
   "emclean", 
   "They make their food homemade. So, my question is, why isn't everyone doing this?\n\n $$$$$$$$$$$$$$$$$$$$$$$$$$\n sorry GreenMtnBoy, but go to the store, look at the prices, what is the cheapest? in meat it tends to be the prossesed, fatie meats, the lean cuts are more. also it costs more to make \"home made\" lunches in the itme and sttaff needed to prepare it. i would also guess that where there are fast food in the school, the school is geting money direct from them for the space.\n \n \nSoda pop machines should be banned from schools.\n\n so if too much is bad, ban it? or should we be trying to teach the kids how to make better desisions, not making it a \"forbidden fruit\"", 
   {}, 
   191117, 
   null, 
   1136992200.0
  ], 
  [
   191633, 
   null, 
   "Bickazer", 
   "As a student, my view is different--I LIKE that my school serves junk food though it soon won't be, so I buy snacks as often as possible. I LIKE that my school has soda machines. I don't want to be fed a bunch of low-fat, low-card, organic garbage. If that happens I may well start bringing my lunch--I can just see it now, chocolate, candy, greasy pizza, soda.", 
   {}, 
   191380, 
   null, 
   1137039360.0
  ], 
  [
   191643, 
   null, 
   "Matthew S", 
   "As a student, my view is different--I LIKE that my school serves junk food though it soon won't be, so I buy snacks as often as possible. I LIKE that my school has soda machines. I don't want to be fed a bunch of low-fat, low-card, organic garbage. If that happens I may well start bringing my lunch--I can just see it now, chocolate, candy, greasy pizza, soda.\n\n \n \n I used to bring my lunch. PB&J, potato chips, and chocolate pudding.", 
   {}, 
   191633, 
   null, 
   1137041820.0
  ], 
  [
   191780, 
   null, 
   "Obvious Child", 
   "As a student, my view is different--I LIKE that my school serves junk food though it soon won't be, so I buy snacks as often as possible. I LIKE that my school has soda machines. I don't want to be fed a bunch of low-fat, low-card, organic garbage. If that happens I may well start bringing my lunch--I can just see it now, chocolate, candy, greasy pizza, soda.\nWell, you could do that now. Also, it allows parental control.", 
   {}, 
   191633, 
   null, 
   1137102360.0
  ], 
  [
   191830, 
   null, 
   "Bickazer", 
   "Well, you could do that now. Also, it allows parental control.\n\n \n I'd love to bring lunchables, but unfortunately, in junior high, you're viewed as a baby if you do and it's not convenient to transport Lunchables throughout the day.\n \n On topic to the debate--yeah I know soy organic junk is better for me, but I will NEVER allow myself to be fed \"healthy food\" so long as it doesn't taste as good as its high-calorie versions. Until scientists can figure out how to make healthy food taste as good as junk food, I will not completely change my diet to good healthy organic vegetarian soymilk stuff.", 
   {}, 
   191780, 
   null, 
   1137119700.0
  ], 
  [
   191920, 
   null, 
   "simone", 
   "How's your complexion, kid?", 
   {}, 
   191830, 
   null, 
   1137170820.0
  ], 
  [
   191926, 
   null, 
   "Mucusaur", 
   "As a student, my view is different--I LIKE that my school serves junk food though it soon won't be, so I buy snacks as often as possible. I LIKE that my school has soda machines. I don't want to be fed a bunch of low-fat, low-card, organic garbage. If that happens I may well start bringing my lunch--I can just see it now, chocolate, candy, greasy pizza, soda.\n\n \n You'll be K.O. in no time at all.", 
   {}, 
   191633, 
   null, 
   1137171180.0
  ], 
  [
   191943, 
   null, 
   "Alan Ryan", 
   "School food gets a bad knock these days. The food cooked at my school was pretty good. In fact it was good enough to be worth devising schemes to get second and third helpings - even if this meant some late arrivals in the dining room (or 'refectory' as it was called) got no lunch.", 
   {}, 
   191926, 
   null, 
   1137173640.0
  ], 
  [
   191950, 
   null, 
   "Mucusaur", 
   "Junk food is an addictive substance. It should be avoided and eaten only on occasion.", 
   {}, 
   191926, 
   null, 
   1137175980.0
  ], 
  [
   192064, 
   null, 
   "Justawoman", 
   " \n On topic to the debate--yeah I know soy organic junk is better for me, but I will NEVER allow myself to be fed \"healthy food\" so long as it doesn't taste as good as its high-calorie versions. I will not completely change my diet to good healthy organic vegetarian soymilk stuff.\n\n \n This totally makes me laugh. The wonderful, innocent, \" I am young and untouchable\" attitude. \n \n Tell yourself this when you hit midlife and your doctor says,\" your cholesterol is through the roof, your are a diabetic, etc......etc.... etc....\" Better to learn to eat right now and the importance of exercise before disease hits your untouchable body. Plus the cost of healthy food is far less expensive than the handful of pills you just might be on when you are in your 40's, if not earlier.", 
   {}, 
   191830, 
   null, 
   1137197760.0
  ], 
  [
   192495, 
   null, 
   "jitobear", 
   "On topic to the debate--yeah I know soy organic junk is better for me, but I will NEVER allow myself to be fed \"healthy food\" so long as it doesn't taste as good as its high-calorie versions. Until scientists can figure out how to make healthy food taste as good as junk food, I will not completely change my diet to good healthy organic vegetarian soymilk stuff.\n\n \n \nThis totally makes me laugh. The wonderful, innocent, \" I am young and untouchable\" attitude. \n \n Tell yourself this when you hit midlife and your doctor says,\" your cholesterol is through the roof, your are a diabetic, etc......etc.... etc....\" Better to learn to eat right now and the importance of exercise before disease hits your untouchable body. Plus the cost of healthy food is far less expensive than the handful of pills you just might be on when you are in your 40's, if not earlier.\n\n \n It is more than possible to eat a healthy diet that is not gross tasting, soy, vegetarian stuff. It's about appropriate balance and portions, and eating food rather than processed XXXX. Learn to eat right now and you will not have weight problems. You will have lower stress, your skin will be clearer, you will always look younger and you will have more energy. I wish I had learned at your age.", 
   {}, 
   192064, 
   null, 
   1137371700.0
  ], 
  [
   192532, 
   null, 
   "Justawoman", 
   "Isn't it funny how when you mention healthy food most folks think, \"ick yuck can't possibly taste good because it is good for you.\"", 
   {}, 
   192495, 
   null, 
   1137387060.0
  ], 
  [
   192546, 
   null, 
   "jazyjason", 
   "At the high school I attend the lunch is horribly unhealthy. Our school made an \"effort\" to make our meals healthier by instead of serving soda they now serve powerade. Ahem both have dye, sugar, and caffine. I cannot see how these people can sit back and watch us (being the student body) of 4,000 students literally kill ourselves. I have hardly any energy myself when I eat a school lunch, so I bring a couple of ham sandwiches, salad, and some green tea. The result is I have a higher concentration level then with eating the school meals. Also they have raised the price for our slop by .75 ove rthe last three years due to the comapny the school buys the food from is $500,000 in debt. So now they serve smaller portions and even run out of food well before half the students have been served. Disgraceful.", 
   {}, 
   192532, 
   null, 
   1137390780.0
  ], 
  [
   193360, 
   null, 
   "Bickazer", 
   "How's your complexion, kid?\n\n \n The food you eat has nothing to do with acne, and besides, I don't see anything wrong with acne. The less attractive I am physically, the better off I'll be in life anyway. At the very least, no one will want to hit on me.\n \n \nand eating food rather than processed XXXX.\n\n \n Why is it that \"processed XXXX\" always tastes better than \"food\"? Hell, I might as well get into nutritional science and figure out a way to make junk food good for you but still as tasty.", 
   {}, 
   191920, 
   null, 
   1137733260.0
  ], 
  [
   193388, 
   null, 
   "Jo Bennett", 
   "The food you eat has nothing to do with acne, and besides, I don't see anything wrong with acne. The less attractive I am physically, the better off I'll be in life anyway. At the very least, no one will want to hit on me.\n \n \n \n Why is it that \"processed XXXX\" always tastes better than \"food\"? Hell, I might as well get into nutritional science and figure out a way to make junk food good for you but still as tasty.\n\n \n It doesn't, get a lamb joint, a food mixer, some garlic, rosemary and a bit of onion and make your own burgers, much nicer than the XXXX you buy in the shops. There's a burger bar on my uni campus that makes all its burgers from fresh ingredients. You pay a bit more but that difference is unbelievable. The chicken burger is two chargrilled chicken breasts in a bun.", 
   {}, 
   193360, 
   null, 
   1137756660.0
  ], 
  [
   193497, 
   null, 
   "jitobear", 
   "Why is it that \"processed XXXX\" always tastes better than \"food\"? Hell, I might as well get into nutritional science and figure out a way to make junk food good for you but still as tasty.\n\n \n Please don't.\n \n I prefer the flavor of freash food to a Dorito any day.\n \n Bla", 
   {}, 
   193360, 
   null, 
   1137791700.0
  ], 
  [
   193522, 
   null, 
   "safiatou", 
   "Schools should not sell junk food....\n Kids need to eat healthy foods. More vegetables, and less junk. Maybe offer milk and water instead of soda and sugary drinks..... High schoolers should not be allowed off campus lunch anymore either. Soda has an affect on children. \n\n \n I agree with most of what you have said. Vegetables and fruit are a must, but real meat should be a part of the diet. It's not only soda that's making the kids obese. It's chicken nuggets, fries, pizzas, hot pockets, etc. Since when do children have to eat those things for lunch? A hot bowl of soup, a nice salad, and some juice. Nice lunch. A piece of chicken, rice, vegetables, and peaches. Nice lunch. A turkey sandwich, carrot and celery sticks, and a fruit salad. Nice lunch. \n \n Healthy snacks should be available in the vending machines: carrots and lowfat dip, crackers, fruit, juice, etc. They have bake chips too.\n \n \n \nHigh schoolers should not be allowed off campus lunch \n\n I oppose that. It's unconstitutional. They're not prisoners. They have the right to leave at lunch time.", 
   {}, 
   189686, 
   null, 
   1137799740.0
  ], 
  [
   193528, 
   null, 
   "jim's trucking", 
   "Having been schooled many years ago, I can't speak to the condition of today's school lunch programs except to the extent I read and here about them. Back in the 'good ole days' we had a cafeteria serving line, a huge kitchen with huge pots and huge ovens and several real cooks who would prepare lunches with varying degrees of pallatability. We had no drink machines (except for milk cartons) and we had no candy machines. I suppose that's why the students who could catch or had a ride would frequent Shipley Do-Nuts and Brown's Delish Shop for a guaranteed pleasure. Our nutritionist was always battling the school board trying to attain mandatory lunches at school, but the students and parents never came close to wanting it that way.\n \n IMO, the school system is not the place for commercial fast food marketing. There's enough of that abuse going on after school hours.\n \n Children shouldn't be so relentless in shunning healthy foods in favor of the 'in' things to eat.", 
   {}, 
   193522, 
   null, 
   1137801360.0
  ], 
  [
   193615, 
   null, 
   "zachvac", 
   "Dear Readers~\n Schools should not sell junk food. Now, here in D.C. they sell soda, candy, and greasy food like Pizza, lots of sugary foods. This should not be allowed. What ever happened to lunch ladies cooking the food themselves? Now a day, they just pop a bunch of already mixed food into a pot and cook it up and serve it. Kids need to eat healthy foods. More vegetables, and less junk. Maybe offer milk and water instead of soda and sugary drinks. High schoolers should not be allowed off campus lunch anymore either. Cause the lunches I am talking about serving at high schools would cause them to eat out more and cost them a lot of money. \n High schools, or any school for that matter, should feed kids healthier meals. Soda should not be allowed at lunch. Soda has an affect on children. It makes them hyper and sometimes to alert and distracted. \n If we cut back on the unhealthy foods a bit in our schools, maybe kids in America will not be as obese. America is rapidly becoming the fattest. We need to deal with this.\n -John Milosevic\n\n \n We currently have a closed lunch (mainly because we are between the DC beltway and another major highway), no soda, and a limit on sugar and fat in food. I agree mostly, healthy food should be available. But I believe that if a kid wants to buy junk food, they should be able to. You think it will solve the problem banning junk food in schools for kids? They go home and grab a couple sodas, a few candy bars, just as bad as at school. If kids don't have that choice in high school, they get to college, or get a job, are they going to have those restrictions? We need to teach them about the effects of junk food on their bodies, but even though it's bad for you, soda isn't all that bad if had in moderation.\n \n I think this kind of thing starts at home. If the parents don't care about giving their kid healthy food, they're not going to learn. I almost never have sodas at home. We have some and on special occaisions we will be allowed to have them. Usually at a restaurant I'll get a soda, but other than that at most I have a soda a month. But I know kids who get home and have 2 sodas at night. Banning them from schools isn't going to help these kids.", 
   {}, 
   189686, 
   null, 
   1137831720.0
  ], 
  [
   193616, 
   null, 
   "zachvac", 
   "But, what I am getting at, is why do we serve our kids disgusting foods? Why do the schools feed our kids this stuff?\n Food should be nutritious. Your own government is feeding your kids. Some of the schools I go to, and some of the documentaries on this issue I have seen, the USDA sends premade food to our schools and the cooks just slop it up.\n Food is meant to be nutritious. You all are right. Unhealthy food affects their behavior, and their stamina. Soda pop machines should be banned from schools. I mean, teachers lounges, fine. But, access to soda for kids, is not a great idea. \n Unhealthy things we serve our kids today should not be allowed.\n In most of the schools here in Washington D.C., these kids when going through the lunch line, either have the option of a tray lunch, or our A La Carte line where on that line, we have: Pizza, breadsticks, candy i.e.( lifesavers, gummi bears, sour, warheads, skittles, starbursts) cheesesticks, chips, soda, country time (which has as much sugar as a soda) and so on.\n The last two years, I have watched for healthy things. The only healthy things on your childs lunch choices are water, triscuits, soup, and Fragensaft. That is all I have seen. Of course, not every school in this country is the same.\n My father who is a principal in New Mexico, says the superintendant and the board of education in his city has banned soda in schools, candy and unhealthy foods in their lunch lines, and he says his schools kitchen is also cooking food that is not premade. They make their food homemade. So, my question is, why isn't everyone doing this? The kids focus and do better in school at his school, compared to the hyped up kids at my schools. \n I can see the diffrence. My father and the school district he works for, has replaced vending machines with candy. If the kids want something out of the vending machines, they have healthy food. A little bag of triscuits, wheat thins, pretzels, and gatorade, powerade, and juice. Now, that school district sounds like it is being run perfectly. Now, you still see some kids with soda at school. They bring it from home. But, taking away the machines lowered the level of kids being able to have soda. \n The lunch lines in the district he works for, has banned chips, candy, grease food, soda, country time, and other unhealthy items. The kids eat the food at lunch, or bring a pack lunch. High school kids are not even allowed off campus because, that would be an everyday thing for them being as lunch doesn't have the flare it did.\n America is becoming the fattest nation in America, and we are doing nothing to prevent this. We should. We should not be supplying our kids with bad food. \n -John Milosevic\n\n \n \n I see, so adults can make decisions on what to drink, but not kids? It's not the government's or the school's job to stop kids from getting fat. They should give them the opportunity to eat healthy, and this I agree with you. We have not one healthy food in our school lunches. That's why I bring a lunch.", 
   {}, 
   190132, 
   null, 
   1137832020.0
  ], 
  [
   193617, 
   null, 
   "zachvac", 
   "The food you eat has nothing to do with acne, and besides, I don't see anything wrong with acne. The less attractive I am physically, the better off I'll be in life anyway. At the very least, no one will want to hit on me.\n \n \n \n Why is it that \"processed XXXX\" always tastes better than \"food\"? Hell, I might as well get into nutritional science and figure out a way to make junk food good for you but still as tasty.\n\n \n Have you ever had strawberries? Blueberries? Raspberries? Oranges? Grapefruits? I can't name quite as many vegetables that I think are good, but you get the point. There are many fruits that at least in my opinion beat the junk food in cafeterias any day. How about some real meat? You like cheese? You like ham? Turkey? roast beef? Salami? I'm sure I'm missing some but you can make a very good sandwhich with any of these. Along with this I don't think it would hurt much to have something like a candy bar as well.\n \n I usually have: ham and cheese sandwhich, muffin, a fruit, a vegetable, crackers or something like that, a desert of some kind (candy bar, cookies, etc.). Still tastes good, but it is a LOT healthier than the school lunches (and in my opinion tastes better too).", 
   {}, 
   193360, 
   null, 
   1137832620.0
  ], 
  [
   194570, 
   null, 
   "John Milosevic", 
   "I think Zacvack is closer than any of us. He is a smart kid. I will give him that. He is starting to sound smarter than me. Listen, I never thought about the students bringing junk from home.\n Also, the only thing I oppose that zacvack said is the informatives on junk food. I think atleast 98% of the kids in Amerika know the causes of to much junk food. (bad teeth, future organ and body problems, obese bodies, hyperness, exhaustion, etc.) but, the food kids eat now a day is in a way addicting. For god sakes, I am one of those people that has a gallon of soda a day. I am smart enough to brush my teeth real good later to avoid cavities and so on. But, I think the food is addicting. It is like they love it so much they don't care what it does to them, unless it actually happens. My kid told me once when I taught her about nutrition, I told her skittles and lots of those energy drinks (i.e. red bull, full throttle, monster) I told her that that not only makes you hyper and tired, but sugar can turn to fat and pack on some pounds. She said, \"Well, unless I get as fat as grandma, I will keep eating this stuff.\" Within a month she packed on ten pounds. Now, she also eats Mcdonalds, or some fast food every day during her off campus lunch.\n She woke up one day, weighed herself, and decided to eat healthy. This food should be highly restricted. I agree with Zac very well. He is sincerely right. He is also right about the parents taking responsibility on the kids diet. Well, some parents did not care. When I was a kid, (god, atleast twenty nine years ago, wink wink) my parents did not give a damn about what I ate. I ate junk, had fast food, so on. I weighed nearly three hundred pounds when I graduated. I was on my own to lose the weight and start over the smart way eating. I now weigh one ninety five. But, I don't eat junk food as much as I did. I learned the hard way. But, most parents, like mine, do not care what their kids eat. Now a day, it is like, \"Mom, I am going to go eat at Mcdonalds with Keisha\"\n \"Ok.\"\n The parent is thinking, great. I don't have to kook dinner and I can lay on my butt. Some laziness plays in here too.\n Anyway, I just wanted to praise Zacvac. He is right on the ball. Smart for a kid that is a yougin.\n Lets give it up for Zack.\n -John Milosevic", 
   {
    "post_info": {
     "post_title": "Zacvac is a great kid"
    }
   }, 
   193617, 
   null, 
   1138163640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  School food", 
  "url": "http://www.4forums.com/political/education-debates/7238-school-food.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 7238, 
  "discussion_files": [
   [
    "10939.html", 
    "http://www.4forums.com/political/education-debates/7238-school-food-print.html"
   ], 
   [
    "10940.html", 
    "http://www.4forums.com/political/education-debates/7238-school-food-2-print.html"
   ]
  ], 
  "identifier": 7238
 }
]