[
 [
  [
   189804, 
   null, 
   "unkerpaulie", 
   "ok.. .whoa! hold on... its inevitable that a topic like this will strike a few nerves, so ill address that first. before anybody thinks \"oh this is just another liberal bush-bashing\" please calm down just a little bit. this is by no means an angry rant or a political slander post at all. i happen to have a lot of friends and family members who are both staunch christians and avid bush supporters. my intention is not to belittle or bash the president at all, but i really hope that maybe some of you will at least read this with even a hint of open-mindedness\n \n first of all, we are almost all aware that the bible talks about the appearance of the anti-christ and the war between christianity and \"the beast\" as a sign that jesus' return is at hand. the entire epic prophesy is cover in daniel 7 and 8, matthew 24 and most of revelation. in revelation, we get the prophecy in its most detailed terms, and it connects the pieces from the sources together to form a wholistic picture.\n \n revelation tells us of 2 beasts, one with seven heads rising from the mid-east/europe region (babylon), which will be the antichrist (rev 13:1-2), and a second, in the form of a lamb but with the voice of a dragon, which will be the false prophet (rev 13: 11-12).\n \n the general concensus is that the antichrist, represented by the leopard is essentially the islamic religion. the fundamentalists of this religion is clearly intent on warring against christianity. not only that, but the leopard is said to represent northwest africa and surrounds, where the animal is found.\n \n look closely at verse 12. one of the first things the lamb-like beast does is to use his power to heal the almost fatal wound of the first beast.\n \n in matthew 24:24, jesus says that this same false prophet (which was later described in rev) would appear as the christ and deceive many, including the \"elect\" or believers. we know that george bush lied about his mission to invade iraq. not only has the religious right forgiven bush for lying to them, they are rallying behind him in his mission to heal the wounded beast of babylon as we speak.\n \n we are spending billions on what can only be described as a crusade bush has personally taken upon himself to restore iraq to a powerful status. bush has openly admitted that this is his intent. yet the deception lies in making his followers thing its for their good. and they are being deceived. churches all over america are prayeing for bush's success. even the non-religious stck magnets to their cars that say \"support our troops\". its a very sticky deception, and even after reading this most people will still go about like if nothing happened, which is exactly how the deception works\n \n the fact is that restoring iraq to super-power status can NOT benefit the american citizen in anyway, unless they have business interests in iraq. but millions of bush followers still think that bush is the ultimate authority. he charges into confrontation recklessly, yet bumbles around his office and ranch with an immature demeanor that makes him look simple, homely, and yes, lamb-like even.\n \n if youve read this far, i really hope you take a serious look at the reasons you are supporting bush and his babylon reconstruction mission. ask yourself: whats in it for me and my children and the future of the average american? how can a stronger and more viable iraq, run by muslims, and funded by america, be better for us? why does bush need to keep up the deception? \n \n are you being deceived?", 
   {
    "post_info": {
     "post_title": "is bush the antichrist?"
    }
   }, 
   null, 
   null, 
   1136400960.0
  ], 
  [
   189812, 
   null, 
   "Obvious Child", 
   "It may be run by Muslims (ie the population), but there will be an American military presence and it will be democratic. \n \n It's a very neat idea, would make a great story. But it relies on Revelation, and more specifically a certain interpretation. It also relies on considering the Religious Right the 'elect', which they think themselves but others may not.", 
   {}, 
   189804, 
   null, 
   1136402400.0
  ], 
  [
   189818, 
   null, 
   "unkerpaulie", 
   "It may be run by Muslims (ie the population), but there will be an American military presence and it will be democratic. \n \n It's a very neat idea, would make a great story. But it relies on Revelation, and more specifically a certain interpretation. It also relies on considering the Religious Right the 'elect', which they think themselves but others may not.\n\n democracy is not a religion. and democracy doesnt affect islam in the slightest. by installing a system of democracy in iraq, we are giving islam the infrastructure to meet us on our level. their government and economic system would become assimilated to mesh with ours, but their beliefs about god and religion will remain as is", 
   {}, 
   189812, 
   null, 
   1136403300.0
  ], 
  [
   189821, 
   null, 
   "daewoo", 
   "It may be run by Muslims (ie the population), but there will be an American military presence and it will be democratic. \n \n It's a very neat idea, would make a great story. But it relies on Revelation, and more specifically a certain interpretation. It also relies on considering the Religious Right the 'elect', which they think themselves but others may not.\n\n \n We have stopped construction of our permanent bases in Iraq once the authorities there made it VERY clear that there WILL BE no American military presence once order is restored and the infrastructure is rebuilt (at our expense). \n \n Our plan in Iraq, to knock out Saddam and install a pro western, secular government has fallen to pieces. Our hand picked guy (Allawi) has been soundly rejected as a leader in Iraq. The Shia findamentalists, little more than puppets of Tehran, are running the country. \n \n Democratic does not mean a whole lot, and a constitution is worthless if your government does not uphold it. Saddam won 2 referedums and an election.", 
   {}, 
   189812, 
   null, 
   1136403780.0
  ], 
  [
   189895, 
   null, 
   "Easyrider", 
   "Our plan in Iraq, to knock out Saddam and install a pro western, secular government has fallen to pieces..... Saddam won 2 referedums and an election. \n\n \n Au contraire. Saddam is in fact deposed, and is now standing trial for his murderous crimes. A terrorist government is no longer running the show, the terrorists are being eliminated wherever they can be found, and so far we've had 3 successful elections.\n \n By the way, your argument that \"Saddam won 2 referedums and an election\" fails when you look at how he and his henchmen rigged those elections.\n \n No doubt many in the liberal left would love to see Saddam and his rape and torture rooms still in power.", 
   {}, 
   189821, 
   null, 
   1136419500.0
  ], 
  [
   189902, 
   null, 
   "daewoo", 
   "Au contraire. Saddam is in fact deposed, and is now standing trial for his murderous crimes. A terrorist government is no longer running the show, the terrorists are being eliminated wherever they can be found, and so far we've had 3 successful elections.\n\n \n A terrorist government is now in control of Iraq. Iran has always supported anti American terrorist,s includign Bin Laden. Saddm never did. In fact, Saddam attacked Al Queda camps in Iraq...camps that were funded and supported by Iran. Now the Iranians have control of Iraq.\n \n \nBy the way, your argument that \"Saddam won 2 referedums and an election\" fails when you look at how he and his henchmen rigged those elections.\n\n \n That is my point. Democracy is only as good as the government backing it (or allowing it, as the case may be). Checks and balances in the Iraqi constitution are virtually non existant. The entire document is fluid. \n \n \nNo doubt many in the liberal left would love to see Saddam and his rape and torture rooms still in power.\n\n \n I wouldn't know. You are the one on the left here.", 
   {}, 
   189895, 
   null, 
   1136420700.0
  ], 
  [
   189925, 
   null, 
   "Easyrider", 
   "A terrorist government is now in control of Iraq. Iran has always supported anti American terrorist,s includign Bin Laden. Saddm never did. In fact, Saddam attacked Al Queda camps in Iraq...camps that were funded and supported by Iran.....\n\n \n Not so. There was a pro Al Queda camp in northern Iraq (the Ansar al-Islam group) that he let slide - the ones who were instrumental in trying to poison the UK with Ricin. Saddam also paid suicide terrorist families who killed Israeli's $25,000 a pop. Here's some more:\n \n Osama-Saddam links \n 9-11 commission missed\n Overwhelming evidence of connection \n between al-Qaida, Iraq before attack\n \n \n http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=39025\n \n \n \n \nThat is my point. Democracy is only as good as the government backing it (or allowing it, as the case may be). Checks and balances in the Iraqi constitution are virtually non existant. The entire document is fluid. \n\n \n \n By your standard the founding fathers should have given up on America, since it took 13 years for us to get a Constitution.", 
   {}, 
   189902, 
   null, 
   1136428740.0
  ], 
  [
   189926, 
   null, 
   "Mucusaur", 
   "There is \"evidence\" floating about the in'ernet \"proving\" that Bush is the Antichrist. The proofs are quiet convincing - if you are a literalist\n \n EDIT: Easily Found\n \n http://www.bushisantichrist.com/", 
   {}, 
   189925, 
   null, 
   1136429640.0
  ], 
  [
   189930, 
   null, 
   "daewoo", 
   "Not so. There was a pro Al Queda camp in northern Iraq (the Ansar al-Islam group) that he let slide - the ones who were instrumental in trying to poison the UK with Ricin. Saddam also paid suicide terrorist families who killed Israeli's $25,000 a pop. Here's some more:\n \n Osama-Saddam links \n 9-11 commission missed\n Overwhelming evidence of connection \n between al-Qaida, Iraq before attack\n \n \n http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=39025\n \n\n \n That is june of 2004 (your article). All of that rediculous BS has been disproven or cleared. The Ansar al-Islam camp i Nothern Iraq was under the US \"no fly zone\" and in the territory of Kurdish autonomy, which the US was enforcing. They were training largely to destroy Saddam.\n \n It does not take a genius to understand that fundamental muslim militants whose stated goal is to remove secular, non muslim presence from the ME alltogether DO NOT generally get along with secular dictators.\n \n I understand why you do not want to accept this, but it is time to give up the ghost on this one. There was no connection, there is no connection, and frankly anybody who ever really thought there was is an idiot. Bin Laden has been publicly calling for saddams head for almost 20 years. To claim that Saddam was supporting an organization who placed his death high on their \"to do\" list is just stupid. \n \n I know that borders on rude, but I think it has been long enough. Originally believing the Bush administrations stupid claims could be written off to failure to pay attention to what is going on in the world. At this point, you have to be either living in a cave or absolutly delusional to still buy that BS.\n \n \n \nBy your standard the founding fathers should have given up on America, since it took 13 years for us to get a Constitution.\n\n \n Completely invalid comparison.", 
   {}, 
   189925, 
   null, 
   1136432040.0
  ], 
  [
   189981, 
   null, 
   "unkerpaulie", 
   "No doubt many in the liberal left would love to see Saddam and his rape and torture rooms still in power.\n\n right here is where the bushies totally miss the point. its not that we want to see saddam and his torture methods remain active today. the point is that whether saddam is in power in iraq or not has NOTHING to do with the welfare of america. you are blind if you dont see it. we are not eliminating terrorism. there are functional and state-supported terrorist camps in sudan, libya, jordan, yemen and even our beloved saudi arabia right now, and america is doing absolutely zilch to eliminate them. yet there were a total of zero terrorist camps in iraq, yet america hurled billions of dollars and hundreds of thousands of soldiers there.\n \n why should we care if saddam was torturing his own people 30 years ago when the terrorist that killed 3000 americans just 4 years ago are still out there free to attack us when they like?", 
   {}, 
   189895, 
   null, 
   1136476020.0
  ], 
  [
   201146, 
   null, 
   "DamEtel", 
   "Bush is not the anti-Christ: Caesar Nero was.\n \n And the whore of Babylon was Rome.", 
   {}, 
   189981, 
   null, 
   1141516680.0
  ], 
  [
   201149, 
   null, 
   "johnson", 
   "Bush is not the anti-Christ: Caesar Nero was.\n \n And the whore of Babylon was Rome.\n\n \n \n It's kinda funny how people don't get this about the whole thing isn't it !", 
   {}, 
   201146, 
   null, 
   1141518720.0
  ], 
  [
   201151, 
   null, 
   "johnson", 
   " the general concensus is that the antichrist, represented by the leopard is essentially the islamic religion. the fundamentalists of this religion is clearly intent on warring against christianity.\n\n \n \n You don't believe this do you ? Wouldn't it be more accurate to say they are intent on warring against The West, or America ?", 
   {}, 
   189804, 
   null, 
   1141519080.0
  ], 
  [
   201152, 
   null, 
   "Matthew S", 
   "No he is just the assistant.", 
   {}, 
   201151, 
   null, 
   1141521180.0
  ], 
  [
   201169, 
   null, 
   "johnson", 
   "No he is just the assistant.\n\n \n Thats impossible,.. considering Bush works for Cheney.", 
   {}, 
   201152, 
   null, 
   1141533840.0
  ], 
  [
   201330, 
   null, 
   "unkerpaulie", 
   "You don't believe this do you ? Wouldn't it be more accurate to say they are intent on warring against The West, or America ?\n\n not really. the warring faction of islam - those that seek to spread their religion by violence - believe they must put the non-muslim infidel to death, regardless of where they are. last year their were 2 terrorist bombings in europe: london and madrid, so clearly the us is not the exclusive target.", 
   {}, 
   201151, 
   null, 
   1141659660.0
  ], 
  [
   201513, 
   null, 
   "johnson", 
   "not really. the warring faction of islam - those that seek to spread their religion by violence - believe they must put the non-muslim infidel to death, regardless of where they are. target.\n\n \n And the infidel could be of any religion. Again I think to say they are targeting christianity is wrong. they are targeting whoever doesn't agree with their beliefs. At the moment it would be safe to say \" the west \" as it would best define their idea of waht an infidel would be. It's not about a religion, .. it's about not being a member of theirs.", 
   {}, 
   201330, 
   null, 
   1141709520.0
  ], 
  [
   201730, 
   null, 
   "unkerpaulie", 
   "And the infidel could be of any religion. Again I think to say they are targeting christianity is wrong. they are targeting whoever doesn't agree with their beliefs. At the moment it would be safe to say \" the west \" as it would best define their idea of waht an infidel would be. It's not about a religion, .. it's about not being a member of theirs.\n\n the non-muslims of other countries besides the us are also targets, and i gave you examples. i would say america in particular is the most problematic enemy to the fundamentalist muslims because of america's persistence to interfere in the area known as the \"holy lands\", particularly saudi arabia where mecca is situated. because of america's total disregard to the sacred land in their pursuit of oil interests the fundamentalists are gravely offended and its a big reason for their hatred and violence to us\n \n if there is anything \"safe to say\" i think it would be if saudi arabia wasnt sitting on the world's bigest oil reserve and america wasnt so addicted to oil production control, the muslims and america would proably be much more peaceful today", 
   {}, 
   201513, 
   null, 
   1141833960.0
  ], 
  [
   204552, 
   null, 
   "Prototype", 
   "Just to answer the original question: Is Bush the AntiChrist?\n \n I don't know what version of bible you read, but I read the King James Version of the bible and by good fortune I read about this event just today in my devotions.\n \n According to the KJV, Bush could not be the antichrist. The Antichrist will come and decieve that nations for seven years. It has been six years and none of the events listed that will happen during that period of the Antichrist has occured.\n \n Based on that, I have to disagree. Bush is not even probably the antichrist. I think we can rest easy on that. If you'd like refrences to the verses which talk about the events occuring during the Antichrist's reign, I can give you some.", 
   {}, 
   201730, 
   null, 
   1143677220.0
  ], 
  [
   204645, 
   null, 
   "unkerpaulie", 
   "Just to answer the original question: Is Bush the AntiChrist?\n \n I don't know what version of bible you read, but I read the King James Version of the bible and by good fortune I read about this event just today in my devotions.\n \n According to the KJV, Bush could not be the antichrist. The Antichrist will come and decieve that nations for seven years. It has been six years and none of the events listed that will happen during that period of the Antichrist has occured.\n \n Based on that, I have to disagree. Bush is not even probably the antichrist. I think we can rest easy on that. If you'd like refrences to the verses which talk about the events occuring during the Antichrist's reign, I can give you some.\n\n well, bush has sucessfully decievd the majority of america and europe in his term. it seems that even the religious right are fully supporting bush and going along with his intercontinental war that clear has no intended end.\n \n id love to hear your take on what other signs will identify the antichrist if it isnt bush", 
   {}, 
   204552, 
   null, 
   1143738240.0
  ], 
  [
   204649, 
   null, 
   "Prototype", 
   "I've no doubt you could say anything about Bush, just as well as someone might say the same stuff about John Kerry. However, I'll use verses to back up my belief that Bush is not the antichrist.\n \n During the first 6 years of teh antichrists reign, these things should have happened already.\n \n Chapter 8 Revelations:\n \n 1And when he had opened the seventh seal, there was silence in heaven about the space of half an hour. \n \n 2And I saw the seven angels which stood before God; and to them were given seven trumpets. \n \n 3And another angel came and stood at the altar, having a golden censer; and there was given unto him much incense, that he should offer it with the prayers of all saints upon the golden altar which was before the throne. \n \n 4And the smoke of the incense, which came with the prayers of the saints, ascended up before God out of the angel's hand. \n \n 5And the angel took the censer, and filled it with fire of the altar, and cast it into the earth: and there were voices, and thunderings, and lightnings, and an earthquake. \n \n 6And the seven angels which had the seven trumpets prepared themselves to sound. \n \n 7The first angel sounded, and there followed hail and fire mingled with blood, and they were cast upon the earth: and the third part of trees was burnt up, and all green grass was burnt up. \n \n 8And the second angel sounded, and as it were a great mountain burning with fire was cast into the sea: and the third part of the sea became blood; \n \n 9And the third part of the creatures which were in the sea, and had life, died; and the third part of the ships were destroyed. \n \n 10And the third angel sounded, and there fell a great star from heaven, burning as it were a lamp, and it fell upon the third part of the rivers, and upon the fountains of waters; \n \n 11And the name of the star is called Wormwood: and the third part of the waters became wormwood; and many men died of the waters, because they were made bitter. \n \n 12And the fourth angel sounded, and the third part of the sun was smitten, and the third part of the moon, and the third part of the stars; so as the third part of them was darkened, and the day shone not for a third part of it, and the night likewise. \n \n 13And I beheld, and heard an angel flying through the midst of heaven, saying with a loud voice, Woe, woe, woe, to the inhabiters of the earth by reason of the other voices of the trumpet of the three angels, which are yet to sound!\n \n Chapter 9:\n \n 1And the fifth angel sounded, and I saw a star fall from heaven unto the earth: and to him was given the key of the bottomless pit. \n \n 2And he opened the bottomless pit; and there arose a smoke out of the pit, as the smoke of a great furnace; and the sun and the air were darkened by reason of the smoke of the pit. \n \n 3And there came out of the smoke locusts upon the earth: and unto them was given power, as the scorpions of the earth have power. \n \n 4And it was commanded them that they should not hurt the grass of the earth, neither any green thing, neither any tree; but only those men which have not the seal of God in their foreheads. \n \n 5And to them it was given that they should not kill them, but that they should be tormented five months: and their torment was as the torment of a scorpion, when he striketh a man. \n \n 6And in those days shall men seek death, and shall not find it; and shall desire to die, and death shall flee from them. \n \n 7And the shapes of the locusts were like unto horses prepared unto battle; and on their heads were as it were crowns like gold, and their faces were as the faces of men. \n \n 8And they had hair as the hair of women, and their teeth were as the teeth of lions. \n \n 9And they had breastplates, as it were breastplates of iron; and the sound of their wings was as the sound of chariots of many horses running to battle. \n \n 10And they had tails like unto scorpions, and there were stings in their tails: and their power was to hurt men five months. \n \n 11And they had a king over them, which is the angel of the bottomless pit, whose name in the Hebrew tongue is Abaddon, but in the Greek tongue hath his name Apollyon. \n \n 12One woe is past; and, behold, there come two woes more hereafter. \n \n 13And the sixth angel sounded, and I heard a voice from the four horns of the golden altar which is before God, \n \n 14Saying to the sixth angel which had the trumpet, Loose the four angels which are bound in the great river Euphrates. \n \n 15And the four angels were loosed, which were prepared for an hour, and a day, and a month, and a year, for to slay the third part of men. \n \n 16And the number of the army of the horsemen were two hundred thousand thousand: and I heard the number of them. \n \n 17And thus I saw the horses in the vision, and them that sat on them, having breastplates of fire, and of jacinth, and brimstone: and the heads of the horses were as the heads of lions; and out of their mouths issued fire and smoke and brimstone. \n \n 18By these three was the third part of men killed, by the fire, and by the smoke, and by the brimstone, which issued out of their mouths. \n \n 19For their power is in their mouth, and in their tails: for their tails were like unto serpents, and had heads, and with them they do hurt.\n \n \n This is from the KJV of the Bible. Considering these events have not occured, I seriously doubt that Bush is the antichrist. He may have lied or decieved people before, but much more is required to be the antichrist, at least, in my view.", 
   {}, 
   204645, 
   null, 
   1143739620.0
  ], 
  [
   204658, 
   null, 
   "unkerpaulie", 
   "im very familiar with the passage, but i was hoping youd give your take on what the actual signs would be. i mean, i dont think you really expect giant locusts aith human heads and scorpion tails to be flying around torturing people, right? what does all this actually refer to?\n \n oh, and by the way, please dont take this to be a smear campaign against bush or a promotion for kerry. kerry sickened me in his election run. id puke to think of his actions as president. look at the events objectively if you can. there is no point denying facts because your personal bias for something wont allow you to accept truth\n \n 7The first angel sounded, and there followed hail and fire mingled with blood, and they were cast upon the earth: and the third part of trees was burnt up, and all green grass was burnt up. \n\n deforestation hasnt been a big focus as it was say 10 years ago, but its still taking place. perhaps we could do some research to see how much of the forests have been destroyed in the last 7 years?\n \n \n 8And the second angel sounded, and as it were a great mountain burning with fire was cast into the sea: and the third part of the sea became blood; \n \n 9And the third part of the creatures which were in the sea, and had life, died; and the third part of the ships were destroyed. \n\n i suppose this would be a meteor of some form? however, in the last few years (during bush's presidency) the was a massive mountainous piece of land that fell in the sea, i.e., the rift that caused the tsunami. that would definitely come close to the revelation description\n \n \n 10And the third angel sounded, and there fell a great star from heaven, burning as it were a lamp, and it fell upon the third part of the rivers, and upon the fountains of waters; \n \n 11And the name of the star is called Wormwood: and the third part of the waters became wormwood; and many men died of the waters, because they were made bitter. \n\n this certainly seems to be the poisoning of some major source of water, either underground or at the locked up sources of water like polar ice caps, perhaps. i dont think there's anything that happened recently that could resemble this phenomenon\n \n 12And the fourth angel sounded, and the third part of the sun was smitten, and the third part of the moon, and the third part of the stars; so as the third part of them was darkened, and the day shone not for a third part of it, and the night likewise. \n \n 13And I beheld, and heard an angel flying through the midst of heaven, saying with a loud voice, Woe, woe, woe, to the inhabiters of the earth by reason of the other voices of the trumpet of the three angels, which are yet to sound!\n\n possibly another polar shift that would cause the daytime to last 1/3rd of of the day rather than half? i mean, during winter the northern hemisphere sometimes gets as little as 8 hours of light, but in the summer the long days balance it out. this is nothing new, so i cant say something like this has happened recently\n \n \n1And the fifth angel sounded, and I saw a star fall from heaven unto the earth: and to him was given the key of the bottomless pit. \n \n 2And he opened the bottomless pit; and there arose a smoke out of the pit, as the smoke of a great furnace; and the sun and the air were darkened by reason of the smoke of the pit. \n \n 3And there came out of the smoke locusts upon the earth: and unto them was given power, as the scorpions of the earth have power. \n \n 4And it was commanded them that they should not hurt the grass of the earth, neither any green thing, neither any tree; but only those men which have not the seal of God in their foreheads. \n \n 5And to them it was given that they should not kill them, but that they should be tormented five months: and their torment was as the torment of a scorpion, when he striketh a man. \n \n 6And in those days shall men seek death, and shall not find it; and shall desire to die, and death shall flee from them. \n \n 7And the shapes of the locusts were like unto horses prepared unto battle; and on their heads were as it were crowns like gold, and their faces were as the faces of men. \n \n 8And they had hair as the hair of women, and their teeth were as the teeth of lions. \n \n 9And they had breastplates, as it were breastplates of iron; and the sound of their wings was as the sound of chariots of many horses running to battle. \n \n 10And they had tails like unto scorpions, and there were stings in their tails: and their power was to hurt men five months. \n \n 11And they had a king over them, which is the angel of the bottomless pit, whose name in the Hebrew tongue is Abaddon, but in the Greek tongue hath his name Apollyon. \n \n 12One woe is past; and, behold, there come two woes more hereafter. \n\n this is totally beyond me. i cant begin to think what this could possibly be refering to. perhaps some volcanic eruption that produces a poisonous gas? perhaps biological and chemical warfare? maybe, and that would certainly point to bush. whats your idea of what this means?\n \n 13And the sixth angel sounded, and I heard a voice from the four horns of the golden altar which is before God, \n \n 14Saying to the sixth angel which had the trumpet, Loose the four angels which are bound in the great river Euphrates. \n \n 15And the four angels were loosed, which were prepared for an hour, and a day, and a month, and a year, for to slay the third part of men. \n \n 16And the number of the army of the horsemen were two hundred thousand thousand: and I heard the number of them. \n \n 17And thus I saw the horses in the vision, and them that sat on them, having breastplates of fire, and of jacinth, and brimstone: and the heads of the horses were as the heads of lions; and out of their mouths issued fire and smoke and brimstone. \n \n 18By these three was the third part of men killed, by the fire, and by the smoke, and by the brimstone, which issued out of their mouths. \n \n 19For their power is in their mouth, and in their tails: for their tails were like unto serpents, and had heads, and with them they do hurt.\n\n ah, the good old euphrates river. the main vein of ancient babylon and now iraq and iran. interestingly enough, thats exactly where bush has unleashed his legions of destruction upon. and the average number of troops deployed in iraq during this war? 200,000. we are pretty much on the right track to kill about 1/3rd of the iraqi population (well, not that many, but by the \"end\" of this war it may well be\n \n of course not all the signs may apply to bush, but he certainly fits in e possibility for most of them, and i dont think anybody else fit so many of the antichrist criteria. what do you think? who else could it be? or how else would you interpret the signs from revelation?", 
   {}, 
   204649, 
   null, 
   1143742560.0
  ], 
  [
   204697, 
   null, 
   "Prototype", 
   "im very familiar with the passage, but i was hoping youd give your take on what the actual signs would be. i mean, i dont think you really expect giant locusts aith human heads and scorpion tails to be flying around torturing people, right? what does all this actually refer to?\n \n oh, and by the way, please dont take this to be a smear campaign against bush or a promotion for kerry. kerry sickened me in his election run. id puke to think of his actions as president. look at the events objectively if you can. there is no point denying facts because your personal bias for something wont allow you to accept truth\n \n deforestation hasnt been a big focus as it was say 10 years ago, but its still taking place. perhaps we could do some research to see how much of the forests have been destroyed in the last 7 years?\n \n \n i suppose this would be a meteor of some form? however, in the last few years (during bush's presidency) the was a massive mountainous piece of land that fell in the sea, i.e., the rift that caused the tsunami. that would definitely come close to the revelation description\n \n \n this certainly seems to be the poisoning of some major source of water, either underground or at the locked up sources of water like polar ice caps, perhaps. i dont think there's anything that happened recently that could resemble this phenomenon\n \n possibly another polar shift that would cause the daytime to last 1/3rd of of the day rather than half? i mean, during winter the northern hemisphere sometimes gets as little as 8 hours of light, but in the summer the long days balance it out. this is nothing new, so i cant say something like this has happened recently\n \n \n this is totally beyond me. i cant begin to think what this could possibly be refering to. perhaps some volcanic eruption that produces a poisonous gas? perhaps biological and chemical warfare? maybe, and that would certainly point to bush. whats your idea of what this means?\n \n ah, the good old euphrates river. the main vein of ancient babylon and now iraq and iran. interestingly enough, thats exactly where bush has unleashed his legions of destruction upon. and the average number of troops deployed in iraq during this war? 200,000. we are pretty much on the right track to kill about 1/3rd of the iraqi population (well, not that many, but by the \"end\" of this war it may well be\n \n of course not all the signs may apply to bush, but he certainly fits in e possibility for most of them, and i dont think anybody else fit so many of the antichrist criteria. what do you think? who else could it be? or how else would you interpret the signs from revelation?\n\n \n Pretty much, I believe the verses are literally true. I believe the same thing about the locusts. I don't know how BIG they'll be, but I do believe that will happen. Consdering the fact that I believe things even more supernatural have already occured (I.E. Creation, parting of the Red Sea, people coming back to life) I don't have any problem accepting that.\n \n And I still hold fast to the fact that only six years of Bush's 'reign' have passed. I won't bring up the verses, but the Bible clearly states that the devil will have a mark stamped either on the right hand or forehead of those who choose to follow him. 666, The Bible mentions the specific number as well. None of that has happened and Bush now has one more year to make seven. I believe the antichrist would take such action much sooner.\n \n --7The first angel sounded, and there followed hail and fire mingled with blood, and they were cast upon the earth: and the third part of trees was burnt up, and all green grass was burnt up. --\n \n This doesn't sound like a simple environment destruction, I literally believe that the THIRD part will be destroyed at once, not just a large part over a period of years.\n \n --this certainly seems to be the poisoning of some major source of water, either underground or at the locked up sources of water like polar ice caps, perhaps. i dont think there's anything that happened recently that could resemble this phenomenon--\n \n No... it seems more like a Star(comet, asteroid) will fall from heaven and poison the waters. emoticon_wow \n \n And a large piece of land falling into the sea could not kill an entire THIRD of the life in the sea, and it certainly couldn't destroy a THIRD of the ships sailing. You would need like.. an entire continent to do something like that.", 
   {}, 
   204658, 
   null, 
   1143754020.0
  ], 
  [
   204799, 
   null, 
   "unkerpaulie", 
   "Pretty much, I believe the verses are literally true. I believe the same thing about the locusts. I don't know how BIG they'll be, but I do believe that will happen. Consdering the fact that I believe things even more supernatural have already occured (I.E. Creation, parting of the Red Sea, people coming back to life) I don't have any problem accepting that.\n\n i see. a literalist. exactly as it says in the bible is exactly what will happen, and theres nothing figurative or metaphorical about the descriptions. right?\n \n \n1And the fifth angel sounded, and I saw a star fall from heaven unto the earth: and to him was given the key of the bottomless pit. \n \n 2And he opened the bottomless pit; and there arose a smoke out of the pit, as the smoke of a great furnace; and the sun and the air were darkened by reason of the smoke of the pit. \n \n 3And there came out of the smoke locusts upon the earth: and unto them was given power, as the scorpions of the earth have power. \n \n 4And it was commanded them that they should not hurt the grass of the earth, neither any green thing, neither any tree; but only those men which have not the seal of God in their foreheads. \n \n 5And to them it was given that they should not kill them, but that they should be tormented five months: and their torment was as the torment of a scorpion, when he striketh a man. \n \n 6And in those days shall men seek death, and shall not find it; and shall desire to die, and death shall flee from them. \n \n 7And the shapes of the locusts were like unto horses prepared unto battle; and on their heads were as it were crowns like gold, and their faces were as the faces of men. \n \n 8And they had hair as the hair of women, and their teeth were as the teeth of lions. \n \n 9And they had breastplates, as it were breastplates of iron; and the sound of their wings was as the sound of chariots of many horses running to battle. \n \n 10And they had tails like unto scorpions, and there were stings in their tails: and their power was to hurt men five months\n\n so a meteorite will strike, and crack open a rift in the earth, which will release enough smoke to cover the sky and darken the sun. then, from the smoke, a massive swarm of giant locusts will materialise, in the shapes of horses, with heads like having gold growns, with human faces and long feminine hair locks and teeth of lions. these locusts would also have iron-like breastplates and tails with scorpion stings in them. i suppose the stage would look something like this?", 
   {}, 
   204697, 
   null, 
   1143823500.0
  ], 
  [
   204805, 
   null, 
   "trebor", 
   "I've no doubt you could say anything about Bush, just as well as someone might say the same stuff about John Kerry. However, I'll use verses to back up my belief that Bush is not the antichrist.\n \n During the first 6 years of teh antichrists reign, these things should have happened already.\n \n Chapter 8 Revelations:\n \n 1And when he had opened the seventh seal, there was silence in heaven about the space of half an hour. \n \n 2And I saw the seven angels which stood before God; and to them were given seven trumpets. \n \n 3And another angel came and stood at the altar, having a golden censer; and there was given unto him much incense, that he should offer it with the prayers of all saints upon the golden altar which was before the throne. \n \n 4And the smoke of the incense, which came with the prayers of the saints, ascended up before God out of the angel's hand. \n \n 5And the angel took the censer, and filled it with fire of the altar, and cast it into the earth: and there were voices, and thunderings, and lightnings, and an earthquake. \n \n 6And the seven angels which had the seven trumpets prepared themselves to sound. \n \n 7The first angel sounded, and there followed hail and fire mingled with blood, and they were cast upon the earth: and the third part of trees was burnt up, and all green grass was burnt up. \n \n 8And the second angel sounded, and as it were a great mountain burning with fire was cast into the sea: and the third part of the sea became blood; \n \n 9And the third part of the creatures which were in the sea, and had life, died; and the third part of the ships were destroyed. \n \n 10And the third angel sounded, and there fell a great star from heaven, burning as it were a lamp, and it fell upon the third part of the rivers, and upon the fountains of waters; \n \n 11And the name of the star is called Wormwood: and the third part of the waters became wormwood; and many men died of the waters, because they were made bitter. \n \n 12And the fourth angel sounded, and the third part of the sun was smitten, and the third part of the moon, and the third part of the stars; so as the third part of them was darkened, and the day shone not for a third part of it, and the night likewise. \n \n 13And I beheld, and heard an angel flying through the midst of heaven, saying with a loud voice, Woe, woe, woe, to the inhabiters of the earth by reason of the other voices of the trumpet of the three angels, which are yet to sound!\n \n Chapter 9:\n \n 1And the fifth angel sounded, and I saw a star fall from heaven unto the earth: and to him was given the key of the bottomless pit. \n \n 2And he opened the bottomless pit; and there arose a smoke out of the pit, as the smoke of a great furnace; and the sun and the air were darkened by reason of the smoke of the pit. \n \n 3And there came out of the smoke locusts upon the earth: and unto them was given power, as the scorpions of the earth have power. \n \n 4And it was commanded them that they should not hurt the grass of the earth, neither any green thing, neither any tree; but only those men which have not the seal of God in their foreheads. \n \n 5And to them it was given that they should not kill them, but that they should be tormented five months: and their torment was as the torment of a scorpion, when he striketh a man. \n \n 6And in those days shall men seek death, and shall not find it; and shall desire to die, and death shall flee from them. \n \n 7And the shapes of the locusts were like unto horses prepared unto battle; and on their heads were as it were crowns like gold, and their faces were as the faces of men. \n \n 8And they had hair as the hair of women, and their teeth were as the teeth of lions. \n \n 9And they had breastplates, as it were breastplates of iron; and the sound of their wings was as the sound of chariots of many horses running to battle. \n \n 10And they had tails like unto scorpions, and there were stings in their tails: and their power was to hurt men five months. \n \n 11And they had a king over them, which is the angel of the bottomless pit, whose name in the Hebrew tongue is Abaddon, but in the Greek tongue hath his name Apollyon. \n \n 12One woe is past; and, behold, there come two woes more hereafter. \n \n 13And the sixth angel sounded, and I heard a voice from the four horns of the golden altar which is before God, \n \n 14Saying to the sixth angel which had the trumpet, Loose the four angels which are bound in the great river Euphrates. \n \n 15And the four angels were loosed, which were prepared for an hour, and a day, and a month, and a year, for to slay the third part of men. \n \n 16And the number of the army of the horsemen were two hundred thousand thousand: and I heard the number of them. \n \n 17And thus I saw the horses in the vision, and them that sat on them, having breastplates of fire, and of jacinth, and brimstone: and the heads of the horses were as the heads of lions; and out of their mouths issued fire and smoke and brimstone. \n \n 18By these three was the third part of men killed, by the fire, and by the smoke, and by the brimstone, which issued out of their mouths. \n \n 19For their power is in their mouth, and in their tails: for their tails were like unto serpents, and had heads, and with them they do hurt.\n \n \n This is from the KJV of the Bible. Considering these events have not occured, I seriously doubt that Bush is the antichrist. He may have lied or decieved people before, but much more is required to be the antichrist, at least, in my view.\n\n \n \n Except, of course, those aren't about the end of the world. Those are about the situation of Rome at the time. It is about Nero, and the burning of Jerusalum.", 
   {}, 
   204649, 
   null, 
   1143825240.0
  ], 
  [
   204819, 
   null, 
   "Prototype", 
   "Except, of course, those aren't about the end of the world. Those are about the situation of Rome at the time. It is about Nero, and the burning of Jerusalum.\n\n \n Of course they're NOT!emoticon_xdonno \n \n These things are prescribing the end times when the antichrist will come. You can believe this happened during then, but then there would be no reason to believe the bible. The antichrist wasn't on earth back then, and if he was, there would no earth to day! There would be no way for me to type-", 
   {}, 
   204805, 
   null, 
   1143827520.0
  ], 
  [
   204824, 
   null, 
   "Prototype", 
   "i see. a literalist. exactly as it says in the bible is exactly what will happen, and theres nothing figurative or metaphorical about the descriptions. right?\n \n \n so a meteorite will strike, and crack open a rift in the earth, which will release enough smoke to cover the sky and darken the sun. then, from the smoke, a massive swarm of giant locusts will materialise, in the shapes of horses, with heads like having gold growns, with human faces and long feminine hair locks and teeth of lions. these locusts would also have iron-like breastplates and tails with scorpion stings in them. i suppose the stage would look something like this?\n\n \n Interesting picture. I wonder a little at that bluish devil man, but other than that, it looks pretty interesting.\n \n I have seen many places where the bible was being metaphorical. Like in.. Psalms, I believe that's where it is. It says even as a snail melteth. Now I know a snail doesn't melt, that's just a metaphor.\n \n But why would these prophecies be metaphorical? I don't think it was being metaphorical about the mark of the beast, or about the seven angles, or about the lamb who could open the book and loose the seals. I believe this last book is literally true, there would be no reason to write metaphorically or mysteriously about the end times. God gave John the dreams so he could warn us Christians about the things that may come to pass at any time. Why would he give as a cloudy obscure vision of what MIGHT happen instead of being particular in detail? It says that the number of the antichrist himself is 666, that's pretty clear.", 
   {}, 
   204799, 
   null, 
   1143827760.0
  ], 
  [
   204838, 
   null, 
   "trebor", 
   "Of course they're NOT!emoticon_xdonno \n \n These things are prescribing the end times when the antichrist will come. You can believe this happened during then, but then there would be no reason to believe the bible. The antichrist wasn't on earth back then, and if he was, there would no earth to day! There would be no way for me to type-\n\n \n \n The 'anti-christ' was refering to Nero.\n \n You are making assumptions from later interpretations that the writer did not have.", 
   {}, 
   204819, 
   null, 
   1143831660.0
  ], 
  [
   204906, 
   null, 
   "Prototype", 
   "The 'anti-christ' was refering to Nero.\n \n You are making assumptions from later interpretations that the writer did not have.\n\n \n No, I'm not. \n \n Let me just ask you this one simple question, see if you can answer it correctly.\n \n If Nero was the Antichrist, then why is the world still here? Why is there still time? The Antichrist comes at the end of the world, so if Nero was, why are we still here?", 
   {}, 
   204838, 
   null, 
   1143849480.0
  ], 
  [
   204909, 
   null, 
   "trebor", 
   "No, I'm not. \n \n Let me just ask you this one simple question, see if you can answer it correctly.\n \n If Nero was the Antichrist, then why is the world still here? Why is there still time? The Antichrist comes at the end of the world, so if Nero was, why are we still here?\n\n \n \n Because, according to the ancient writer, the 'anti-christ' was someone who opposed christ. that mythology of the anti-christ being the end of the world developed later.\n \n DOH.", 
   {}, 
   204906, 
   null, 
   1143852840.0
  ], 
  [
   204915, 
   null, 
   "DamEtel", 
   "Of course they're NOT!emoticon_xdonno \n \n These things are prescribing the end times when the antichrist will come. You can believe this happened during then, but then there would be no reason to believe the bible. The antichrist wasn't on earth back then, and if he was, there would no earth to day! There would be no way for me to type-\n\n \n I'll repeat an earlier post of mine from this thread....\n \n \nDamEtel: Bush is not the anti-Christ: Caesar Nero was.\n \n And the whore of Babylon was Rome.\n\n \n Jesus was a Jewish apocalypticist, who saw the end as being imminent. Some of his earlier followers followed his lead, like the person who wrote Revelation, who was writing symbolically about his own times and the near future.\n \n As to your question of why the end has not come yet if Revelation was really about ancient Rome and Caesar Nero, I'll ask you why the end has not come yet considering that Jesus Himself said ...\n \n \nThen Jesus said to his disciples, ... \"For the Son of Man is going to come in his Father's glory with the angels, and then he will reward each person according to what he has done. I tell you the truth, some who are standing here will not taste death before they see the Son of Man coming in his kingdom.\"\n (Matthew 16:24, 27-28)\n \n", 
   {
    "unicode_changes_made": true
   }, 
   204819, 
   null, 
   1143861300.0
  ], 
  [
   204942, 
   null, 
   "Prototype", 
   "Because, according to the ancient writer, the 'anti-christ' was someone who opposed christ. that mythology of the anti-christ being the end of the world developed later.\n \n DOH.\n\n \n Gee, I guess every person who has oppose Christ in one form or another is the antichrist!\n \n That is untrue. John most certainly did write about the antichrist and did so write that it occured at the end of the world. Please read Revelations over again more carefully.\n \n Nero has been dead for over 1800 years, and time is still running. If he is the antichrist, than why is time still running? An Angel was included in the prophecies that after the anti christ's reign, Time was no longer to be.\n \n Please, just answer this one question. Why is time still running?", 
   {}, 
   204909, 
   null, 
   1143870000.0
  ], 
  [
   204945, 
   null, 
   "trebor", 
   "Gee, I guess every person who has oppose Christ in one form or another is the antichrist!\n \n That is untrue. John most certainly did write about the antichrist and did so write that it occured at the end of the world. Please read Revelations over again more carefully.\n \n Nero has been dead for over 1800 years, and time is still running. If he is the antichrist, than why is time still running? An Angel was included in the prophecies that after the anti christ's reign, Time was no longer to be.\n \n Please, just answer this one question. Why is time still running?\n\n \n \n So, you retrofit your theology into a book written 1800 years ago. Frankly, you have not said a thing that backs up your belief.\n \n On the other hand, Kummel, in his book, \"Introduction to the New Testament\", wrote the following.\n \n \n\n According to the oldest tradition [in Iren., Adv. Haer. 5.30.3] Rev was written toward the end of the reign of Domitian (81-96). The book's own testimony indicates that it originated in the province of Asia in a time of severe oppression of Christians, which is most readily conceivable under Domitian. In the letters included in Rev, persecutions by the officials are expected (2:10), the blood of the martyrs has already flowed (2:13; 6:9), the whole of Christianity is threatened with a fearful danger (3:10): the immediate prospect is for the outbreak of a general persecution of Christians throughout the Roman Empire. In 17:6 John sees the harlot who is Babylon-Rome drunk on the blood of the saints and the blood of the witnesses of Jesus (cf. 6:10; 16:6; 18:24; 19:2). In 20:4 participation in the thousand-year reign is promised to the martyrs who have been beheaded because of their testimony for Jesus and for the word of God, and who have not worshiped the beast and his image and have not accepted his sign on their forehead and in their hand, i.e., those who have refused divine honors to the emperor (13:4, 12 ff; 14:9, 11; 16:2; 19:20). Christianity has collided with the state and with the state religion, the Christ cult with the imperial cult. In the interest of faith, Rev raises passionate objections to Rome and the imperial cult. That corresponds to the situation under Domitian.\n \n Prior to Domitian, the state religion did not direct itself against the Christians. Nero's mad acts in Rome against the Christians had nothing to do with the imperial cult. Under Domitian, who according to the Eastern pattern laid claim to divine honors for himself as emperor during his own lifetime, there arose for the first time the persecution of Christians by the state on religious grounds. In 96 in Rome members of the imperial household were called to account for the charge of &#945;&#952;&#949;&#959;&#964;&#951;&#963;; i.e., violation of the state religion. And in the Christian tradition Domitian is unanimously regarded as the first persecutor of Christians after Nero. In the province of Asia imperial cult was promoted with special zeal. Under Domitian, Ephesus received a new imperial temple. Thus it was precisely in the province of Asia, the classical land of the imperial cult, that at the time of Domitian all the prerequisites were present for a severe conflict between Christianity and the state cult, which is what Rev has in view (cf. also I Pet). The seer nowhere points directly to Domitian as the then reigning emperor, and the Antichrist, the \"beast\" (13:1 ff, etc.), does not bear the features of any specific ruler but rather those of the demonic form of Nero redivivus, which was still a popular expectation in that time. But the temporal scene which Rev sketches fits no epoch of primitive Christianity so well as the time of the persecution under Domitian.\n \n\n \n More can be found here\n \n You willl find a number of Biblical scholars feel the same way (if you bother to research it.", 
   {}, 
   204942, 
   null, 
   1143873000.0
  ], 
  [
   204954, 
   null, 
   "johnhanks", 
   "That is untrue. John most certainly did write about the antichrist and did so write that it occured at the end of the world. Please read Revelations over again more carefully.\n \n Nero has been dead for over 1800 years, and time is still running. If he is the antichrist, than why is time still running? An Angel was included in the prophecies that after the anti christ's reign, Time was no longer to be.\n \n Please, just answer this one question. Why is time still running?\n\n \n The author of Revelation (singular, by the way) was a member of an apocalypticist cult who seems to have believed that the end of the world was imminent in his day, and that Nero was the antichrist who would be its harbinger.\n \n The reason time is still running is that this author was utterly deluded in his belief - as is anyone today who extrapolates Revelation from its contemporary context into the present.", 
   {}, 
   204942, 
   null, 
   1143882540.0
  ], 
  [
   205239, 
   null, 
   "Easyrider", 
   "Gee, I guess every person who has oppose Christ in one form or another is the antichrist!\n \n That is untrue. John most certainly did write about the antichrist and did so write that it occured at the end of the world. Please read Revelations over again more carefully.\n\n \n John did talk about the spirit of antichrist. He wrote, \"Who is the liar? It is the person who denies that Jesus is the Christ. Such a man is (an) antichrist.\" I John 2:22", 
   {}, 
   204942, 
   null, 
   1144027740.0
  ], 
  [
   205289, 
   null, 
   "Prototype", 
   "The author of Revelation (singular, by the way) was a member of an apocalypticist cult who seems to have believed that the end of the world was imminent in his day, and that Nero was the antichrist who would be its harbinger.\n \n The reason time is still running is that this author was utterly deluded in his belief - as is anyone today who extrapolates Revelation from its contemporary context into the present.\n\n \n I've no doubt the Christians who read John's message (which were dreams from God, he wasn't deluded) thought Nero was an insane killer, but he wasn't the antichrist. He reigned much longer than just seven years and- had he been the antichrist, many events John was told would happen would have happened, but they didn't. There is no delusion, God did not purposefully trick John to make him look stupid to the people of today. The end of the world just hasn't happene yet.", 
   {}, 
   204954, 
   null, 
   1144080660.0
  ], 
  [
   205300, 
   null, 
   "Prototype", 
   "So, you retrofit your theology into a book written 1800 years ago. Frankly, you have not said a thing that backs up your belief.\n \n On the other hand, Kummel, in his book, \"Introduction to the New Testament\", wrote the following.\n \n \n \n More can be found here\n \n You willl find a number of Biblical scholars feel the same way (if you bother to research it.\n\n \n I won't deny that some scholars believe this, but I'm having trouble trusting their reasons for believing it.\n \n I looked up their references for thinking the book was written in 90-95. (I am still using a KJV) And this is what the verses say. (And their is no eleventh chapter in Phillipians, at least not in the KJV. Polycarp?)\n \n Revelation\n \n 2:8 And unto the angel of the church in Smyrna write; These things saith the first and the last, which was dead, and is alive; \n \n 9 I know thy works, and tribulation, and poverty, (but thou art rich) and I know the blasphemy of them which say they are Jews, and are not, but are the synagogue of Satan. \n \n 10 Fear none of those things which thou shalt suffer: behold, the devil shall cast some of you into prison, that ye may be tried; and ye shall have tribulation ten days: be thou faithful unto death, and I will give thee a crown of life. \n \n 11 He that hath an ear, let him hear what the Spirit saith unto the churches; He that overcometh shall not be hurt of the second death. \n \n These verses say that the church of Smyrna was poor. Considering the way the Bible talks about poor people and says that they're rich, I believe in this context that it talks of the Christians who are walking in Christ. The ones who would be killed and improsoned. The ten days is probably just an immediate warning for that day, meaning nothing for the future.\n \n as to Laodicea, http://en.wikipedia.org/wiki/Laodicea_on_the_Lycus\n \n It seems that the men are trying to construct another view based on possible mistakes the Bible made. I could be wrong in my assumption, but it seems like they're trying to discredit the Book of Revelation and say it was written some time other than 61-65. What motive they have, I do not know. But I'd like to see better reasons than those.", 
   {}, 
   204945, 
   null, 
   1144083120.0
  ], 
  [
   205311, 
   null, 
   "johnhanks", 
   "I've no doubt the Christians who read John's message (which were dreams from God, he wasn't deluded) thought Nero was an insane killer, but he wasn't the antichrist.\n\n \n Please cite the evidence (other than his own say-so) on which anyone should believe that the Revelation author's accounts tell of 'dreams from god'.\n \n \nGod did not purposefully trick John to make him look stupid to the people of today.\n\n \n Nor did I suggest any such thing. The author of Revelation does not in any case look stupid - merely raving.", 
   {}, 
   205289, 
   null, 
   1144085400.0
  ], 
  [
   205387, 
   null, 
   "Prototype", 
   "Please cite the evidence (other than his own say-so) on which anyone should believe that the Revelation author's accounts tell of 'dreams from god'.\n \n \n \n Nor did I suggest any such thing. The author of Revelation does not in any case look stupid - merely raving.\n\n \n Well, if you think he was raving, then okay.\n \n Sorry, not dreams, visions.", 
   {}, 
   205311, 
   null, 
   1144108260.0
  ], 
  [
   205391, 
   null, 
   "trebor", 
   "Well, if you think he was raving, then okay.\n \n Sorry, not dreams, visions.\n\n \n \n A young lady I know sees visions. She sees the spriits of dead people all the time, and hear them whispering in her head.\n \n She thinks it is psychic power.\n \n Her mother thinks she needs medication for schizophrenia, as do the doctors.", 
   {}, 
   205387, 
   null, 
   1144110360.0
  ], 
  [
   205439, 
   null, 
   "johnhanks", 
   "Sorry, not dreams, visions.\n\n \n OK; now please cite the evidence (other than his own say-so) on which anyone should believe that the Revelation author's accounts tell of 'visions from god'.", 
   {}, 
   205387, 
   null, 
   1144141860.0
  ], 
  [
   205460, 
   null, 
   "Prototype", 
   "OK; now please cite the evidence (other than his own say-so) on which anyone should believe that the Revelation author's accounts tell of 'visions from god'.\n\n \n Here it is.\n \n Revelations 1:1 The Revelation of Jesus Christ, which God gave unto him, to shew unto his servants things which must shortly come to pass; and he sent and signified it by his angel unto his servant John: \n \n 2 Who bare record of the word of God, and of the testimony of Jesus Christ, and of all things that he saw. \n \n 3 Blessed is he that readeth, and they that hear the words of this prophecy, and keep those things which are written therein: for the time is at hand. \n \n 4 John to the seven churches which are in Asia: Grace be unto you, and peace, from him which is, and which was, and which is to come; and from the seven Spirits which are before his throne; \n \n 5 And from Jesus Christ, who is the faithful witness, and the first begotten of the dead, and the prince of the kings of the earth. Unto him that loved us, and washed us from our sins in his own blood, \n \n 6 And hath made us kings and priests unto God and his Father; to him be glory and dominion for ever and ever. Amen. \n \n 7 Behold, he cometh with clouds; and every eye shall see him, and they also which pierced him: and all kindreds of the earth shall wail because of him. Even so, Amen. \n \n 8 I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty. \n \n 9 I John, who also am your brother, and companion in tribulation, and in the kingdom and patience of Jesus Christ, was in the isle that is called Patmos, for the word of God, and for the testimony of Jesus Christ. \n \n 10 I was in the Spirit on the Lord's day, and heard behind me a great voice, as of a trumpet, \n \n 11 Saying, I am Alpha and Omega, the first and the last: and, What thou seest, write in a book, and send it unto the seven churches which are in Asia; unto Ephesus, and unto Smyrna, and unto Pergamos, and unto Thyatira, and unto Sardis, and unto Philadelphia, and unto Laodicea. \n \n 12 And I turned to see the voice that spake with me. And being turned, I saw seven golden candlesticks; \n \n 13 And in the midst of the seven candlesticks one like unto the Son of man, clothed with a garment down to the foot, and girt about the paps with a golden girdle. \n \n 14 His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire; \n \n 15 And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. \n \n 16 And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength. \n \n 17 And when I saw him, I fell at his feet as dead. And he laid his right hand upon me, saying unto me, Fear not; I am the first and the last: \n \n 18 I am he that liveth, and was dead; and, behold, I am alive for evermore, Amen; and have the keys of hell and of death. \n \n 19 Write the things which thou hast seen, and the things which are, and the things which shall be hereafter; \n \n 20 The mystery of the seven stars which thou sawest in my right hand, and the seven golden candlesticks. The seven stars are the angels of the seven churches: and the seven candlesticks which thou sawest are the seven churches.\n \n If you can't see it, I would encourage you to use a Bible search site or something and read through Revelations. If you don't have a Bible yourself.", 
   {}, 
   205439, 
   null, 
   1144165500.0
  ], 
  [
   205472, 
   null, 
   "trebor", 
   "Here it is.\n \n Revelations 1:1 The Revelation of Jesus Christ, which God gave unto him, to shew unto his servants things which must shortly come to pass; and he sent and signified it by his angel unto his servant John: \n \n 2 Who bare record of the word of God, and of the testimony of Jesus Christ, and of all things that he saw. \n \n 3 Blessed is he that readeth, and they that hear the words of this prophecy, and keep those things which are written therein: for the time is at hand. \n \n 4 John to the seven churches which are in Asia: Grace be unto you, and peace, from him which is, and which was, and which is to come; and from the seven Spirits which are before his throne; \n \n 5 And from Jesus Christ, who is the faithful witness, and the first begotten of the dead, and the prince of the kings of the earth. Unto him that loved us, and washed us from our sins in his own blood, \n \n 6 And hath made us kings and priests unto God and his Father; to him be glory and dominion for ever and ever. Amen. \n \n 7 Behold, he cometh with clouds; and every eye shall see him, and they also which pierced him: and all kindreds of the earth shall wail because of him. Even so, Amen. \n \n 8 I am Alpha and Omega, the beginning and the ending, saith the Lord, which is, and which was, and which is to come, the Almighty. \n \n 9 I John, who also am your brother, and companion in tribulation, and in the kingdom and patience of Jesus Christ, was in the isle that is called Patmos, for the word of God, and for the testimony of Jesus Christ. \n \n 10 I was in the Spirit on the Lord's day, and heard behind me a great voice, as of a trumpet, \n \n 11 Saying, I am Alpha and Omega, the first and the last: and, What thou seest, write in a book, and send it unto the seven churches which are in Asia; unto Ephesus, and unto Smyrna, and unto Pergamos, and unto Thyatira, and unto Sardis, and unto Philadelphia, and unto Laodicea. \n \n 12 And I turned to see the voice that spake with me. And being turned, I saw seven golden candlesticks; \n \n 13 And in the midst of the seven candlesticks one like unto the Son of man, clothed with a garment down to the foot, and girt about the paps with a golden girdle. \n \n 14 His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire; \n \n 15 And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. \n \n 16 And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength. \n \n 17 And when I saw him, I fell at his feet as dead. And he laid his right hand upon me, saying unto me, Fear not; I am the first and the last: \n \n 18 I am he that liveth, and was dead; and, behold, I am alive for evermore, Amen; and have the keys of hell and of death. \n \n 19 Write the things which thou hast seen, and the things which are, and the things which shall be hereafter; \n \n 20 The mystery of the seven stars which thou sawest in my right hand, and the seven golden candlesticks. The seven stars are the angels of the seven churches: and the seven candlesticks which thou sawest are the seven churches.\n \n If you can't see it, I would encourage you to use a Bible search site or something and read through Revelations. If you don't have a Bible yourself.\n\n \n \n And how does this answer John's question? This just makes the concept of the writer have delusionary 'visions' all much more likely actually.", 
   {}, 
   205460, 
   null, 
   1144168380.0
  ], 
  [
   205480, 
   null, 
   "johnhanks", 
   "OK; now please cite the evidence (other than his own say-so) on which anyone should believe that the Revelation author's accounts tell of 'visions from god'.\n\n \n Does the emphasis make a difference? (Oh, and the book is still called Revelation. Singular.)", 
   {}, 
   205439, 
   null, 
   1144174020.0
  ], 
  [
   205520, 
   null, 
   "Prototype", 
   "And how does this answer John's question? This just makes the concept of the writer have delusionary 'visions' all much more likely actually.\n\n \n If you want to read the bible and validate it's truthfulness, you have to retain an open mind in order to accept that the miracles and visions are not delusionary and are not hallucinations.\n \n It answers John's request for evidence that John (The other one in Revelation) was given a vision from God. Only God knows the future (from the biblical view) and he is the only one who could show him these things. Not a delusion.", 
   {}, 
   205472, 
   null, 
   1144191660.0
  ], 
  [
   205631, 
   null, 
   "unkerpaulie", 
   "Interesting picture. I wonder a little at that bluish devil man, but other than that, it looks pretty interesting.\n \n I have seen many places where the bible was being metaphorical. Like in.. Psalms, I believe that's where it is. It says even as a snail melteth. Now I know a snail doesn't melt, that's just a metaphor.\n \n But why would these prophecies be metaphorical? I don't think it was being metaphorical about the mark of the beast, or about the seven angles, or about the lamb who could open the book and loose the seals. I believe this last book is literally true, there would be no reason to write metaphorically or mysteriously about the end times. God gave John the dreams so he could warn us Christians about the things that may come to pass at any time. Why would he give as a cloudy obscure vision of what MIGHT happen instead of being particular in detail? It says that the number of the antichrist himself is 666, that's pretty clear.\n\n the reason why we can safely agree that the prophecies are metaphorical is that we have examples within the very bible itself that demonstrates almost exact things happening and they were metaphorical\n \n bear in mind that john was describing a vision, which is a dream-like scene he witnessed while in a trance-like state. do we agree on this?\n \n case 1. in genesis 41, pharoah dreams that he sees seven fat cows and seven thin weak cows standing by the nile grazing. and the seven thin cows eat up the seven good ones. similarly, with the seven strong ears of wheat against the seven sick ears. pharaoh immediately recognized this as a sign of the near future. however, even he knew better than monitor the banks of the nile river looking for 7 weak but canibalistic cows. the cows were figurative, repersenting a metaphor of seven years of good production followed by 7 years of drought\n \n case 2. nebuchadnezar also dreamed of a huge statue that daniel had to both recall and interpret. it was also a sign of the following eras in the middle-east world, and represented the regime changes that would take place for the next 400-500 years, as well as the metaphor of jesus' arrival. however, the dream that nebuchadnezar had was of a huge statue made of different metals and materials, and a massive stone slamming into the great statue and destroying it. yet nobody expected that such a statue literally existed, nor that a chunk of mountain would fall out of the sky and smash it to pieces\n \n i hope you see the point here. dreams and visions recorded by prophets in the bible were never about literal events that would take place. to think that the signs of the emergence of the anti-christ would be an actual chasm opening up in the ground somewhere, with horse-sized locusts with long human hair and scorpion stings flying out of the sky, would be misunderstanding the way biblical propecies work. no biblical prophecy works that way, so why should revelation?\n \n dont be misled by people who preach these fantastical doomsday sermons. it doesnt work that way. lots of people that preach about biblical prophecy dont have a clue", 
   {}, 
   204824, 
   null, 
   1144252140.0
  ], 
  [
   205735, 
   null, 
   "Prototype", 
   "One of the reasons I believe Revelation to be literally true is because I don't believe God would be metaphorical in such a matter. Now, in your example of Daniel and the King's dream and also the Pharoah's dream of the cows, those were metaphorical. But remember, those were explained and revealed to the dreamer in a literal fashion later because they were difficult to understand; as the dreamer knew there was a more complex meaning behind it. John's vision was particular and detailed and the meaning was clear, it needed no intrepetation.\n \n I don't believe God would be metaphorical and mysterious about the last days and the things that would happen. This isn't a Psalm or Proverb with colorful expressions, I believe it to be literally true. It is a clear warning of the specific events that will follow the end of the world.", 
   {}, 
   205631, 
   null, 
   1144305780.0
  ], 
  [
   205766, 
   null, 
   "unkerpaulie", 
   "One of the reasons I believe Revelation to be literally true is because I don't believe God would be metaphorical in such a matter. Now, in your example of Daniel and the King's dream and also the Pharoah's dream of the cows, those were metaphorical. But remember, those were explained and revealed to the dreamer in a literal fashion later because they were difficult to understand; as the dreamer knew there was a more complex meaning behind it. John's vision was particular and detailed and the meaning was clear, it needed no intrepetation.\n \n I don't believe God would be metaphorical and mysterious about the last days and the things that would happen. This isn't a Psalm or Proverb with colorful expressions, I believe it to be literally true. It is a clear warning of the specific events that will follow the end of the world.\n\n actually, thats not the case. john's written work is the description of a vision. this is very important to bear in mind. like dreams, visions are images that you can only access through the unconscious. its not like watching a movie or animation. in your mind, you see images and actions that are surrealistic. when you become conscious, you try to take the message of what the dream meant.\n \n from what we know about biblical prophecies concerning dreams and visions, they were never images of actual literal events. this is different from angellic visits of forewarnings, in which the message was literal, no imagery was used, and the subject was awake (mary, moses, joshua, etc). another example was joseph and his own dream of the sun, moon and stars bowing to him, as well as his brother's wheat bowing to his wheat. this represented the future on joseph's life prophetically, and had nothing to do with literal stars and celestial bodies bowing or even deviating from their normal orbits.\n \n see what im getting at? by assuming that the surrealistic imagery described in revelation meant that these things will literally occur, like mamoth 10 horned beasts and dragons coming out of the sea, i think you are being misdirected from the actual message of the prophecy. its a regular thing for a vision to figuratively represent a prophecy, not a preview of actual events. this is how the bible always renders dreams and visions, and there is no reason to assume that john's vision is any different", 
   {}, 
   205735, 
   null, 
   1144337880.0
  ], 
  [
   205804, 
   null, 
   "Prototype", 
   "Well then, if Revelation is- as you say, not entirely concrete in its descriptions, what do you believe his visions represent? In particular, what about the seven year reign, the mark 666 of the beast and the wormwood comet that will destroy an entire third of the population of the sea? Shouldn't these things have come to pass if Bush was the antichrist? Or what about John. His dream said that it would happen right before the end of the world, I still feel that part of his vision is literally true. That bit is perhaps the one thing I'm standing on that makes me believe Nero wasn't the antichrist regardless of possible metaphorical mysteries.", 
   {}, 
   205766, 
   null, 
   1144354920.0
  ], 
  [
   205809, 
   null, 
   "johnhanks", 
   "Well then, if Revelation is- as you say, not entirely concrete in its descriptions, what do you believe his visions represent? ... Shouldn't these things have come to pass if Bush was the antichrist?\n\n \n I can see you have a problem here. Of course, their not having come to pass is entirely consistent with the whole of Revelation being the deluded ravings of a madman.\n \n \nIn particular, what about the seven year reign, the mark 666 of the beast and the wormwood comet that will destroy an entire third of the population of the sea?\n\n \n I've posted on this before, so forgive me if you've already read it. At the time Revelation was written, there had been no widespread adoption of Arabic numerals or the place system. The number six hundred and sixty six would nowhere have been represented as three adjacent figure sixes. In a province of the Roman Empire in the first century AD, it would have been written as DCLXVI. The 'mark 666 of the beast' is a recent fabrication.", 
   {}, 
   205804, 
   null, 
   1144355820.0
  ], 
  [
   205813, 
   null, 
   "unkerpaulie", 
   "prototype, go back to post 22 in this thread. i provided a not-so-indepth, but still interesting justification of why i think bush s the antichrist, according to the revelatino passage. go through it and tell me what you think", 
   {}, 
   205809, 
   null, 
   1144358820.0
  ], 
  [
   205953, 
   null, 
   "Prototype", 
   "I can see you have a problem here. Of course, their not having come to pass is entirely consistent with the whole of Revelation being the deluded ravings of a madman.\n\n \n That; or it is going to happen and it just hasn't happened yet. It's just as consistent there. But I guess that's your view.\n \n \n \nI've posted on this before, so forgive me if you've already read it. At the time Revelation was written, there had been no widespread adoption of Arabic numerals or the place system. The number six hundred and sixty six would nowhere have been represented as three adjacent figure sixes. In a province of the Roman Empire in the first century AD, it would have been written as DCLXVI. The 'mark 666 of the beast' is a recent fabrication.\n\n \n A frabrication, but not a weak fabrication sown together with old rotting threads. A specific amount depicting the number could have shown him the number.\n \n Revelation 13:18 Here is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is Six hundred threescore and six.\n \n Is it so ridiculous to believe today- based on these things, to assume that the number of the mark of the beast will be 666?", 
   {}, 
   205809, 
   null, 
   1144428180.0
  ], 
  [
   205958, 
   null, 
   "trebor", 
   "That; or it is going to happen and it just hasn't happened yet. It's just as consistent there. But I guess that's your view.\n \n \n \n \n A frabrication, but not a weak fabrication sown together with old rotting threads. A specific amount depicting the number could have shown him the number.\n \n Revelation 13:18 Here is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is Six hundred threescore and six.\n \n Is it so ridiculous to believe today- based on these things, to assume that the number of the mark of the beast will be 666?\n\n \n \n Yes, it is ridiculous to believe that today.", 
   {}, 
   205953, 
   null, 
   1144429320.0
  ], 
  [
   205960, 
   null, 
   "Prototype", 
   "deforestation hasnt been a big focus as it was say 10 years ago, but its still taking place. perhaps we could do some research to see how much of the forests have been destroyed in the last 7 years? \n\n \n I don't think Revelation was referring to a long period of environment destruction. Deforestation? I think it means quite literally that an entire third of the trees and grass (And any amount of bushes and other foliage along with those) will be destroyed by fire.\n \n \ni suppose this would be a meteor of some form? however, in the last few years (during bush's presidency) the was a massive mountainous piece of land that fell in the sea, i.e., the rift that caused the tsunami. that would definitely come close to the revelation description\n\n \n The third part of the ocean didn't become blood though. And an entire third of ocean life wasn't killed by this. Niether was a third of the ships destroyed. This is talking about the entire world here, it would take an awfully large mountain to do this, way beyond that of a single Tsunami.\n \n \nthis certainly seems to be the poisoning of some major source of water, either underground or at the locked up sources of water like polar ice caps, perhaps. i dont think there's anything that happened recently that could resemble this phenomenon \n\n \n Neither can I.\n \n \npossibly another polar shift that would cause the daytime to last 1/3rd of of the day rather than half? i mean, during winter the northern hemisphere sometimes gets as little as 8 hours of light, but in the summer the long days balance it out. this is nothing new, so i cant say something like this has happened recently \n\n \n Obviously it is a bit different from that; otherwise it should never have been mentioned.\n \n this is totally beyond me. i cant begin to think what this could possibly be refering to. perhaps some volcanic eruption that produces a poisonous gas? perhaps biological and chemical warfare? maybe, and that would certainly point to bush. whats your idea of what this means?[/QUOTE]\n \n I think it means that a bottomless pit will be opened and smoke will erupt from it. Then the locusts would come from the smoke with all their different descriptions and torment the people who don't have the mark of Christ.\n \n \nah, the good old euphrates river. the main vein of ancient babylon and now iraq and iran. interestingly enough, thats exactly where bush has unleashed his legions of destruction upon. and the average number of troops deployed in iraq during this war? 200,000. we are pretty much on the right track to kill about 1/3rd of the iraqi population (well, not that many, but by the \"end\" of this war it may well be\n\n \n It says the third part of men. I think that means a third part of men, not just a third of the population of a certain race.\n \n \nof course not all the signs may apply to bush, but he certainly fits in e possibility for most of them, and i dont think anybody else fit so many of the antichrist criteria. what do you think? who else could it be? or how else would you interpret the signs from revelation? \n\n \n In my opinion, I would need a leader that would fit these description and his actions to the mark. He would deceive all men, not just America, and he would use his mark as a way to single out all those who believe in God and torture them and kill them. It would be like a one-world unity thing like you might see in the Tribulation series or Left Behind. That seems to look more like the things Revelation describes.", 
   {}, 
   204658, 
   null, 
   1144429620.0
  ], 
  [
   208714, 
   null, 
   "Dr_Sprocket", 
   "Is Bush the antichrist? \n \n Calling Bush the antichrist is grandiose.\n \n He is just another pathetic XXXXX, nothing more.", 
   {}, 
   205960, 
   null, 
   1145642760.0
  ], 
  [
   209630, 
   null, 
   "johnson", 
   "prototype, go back to post 22 in this thread. i provided a not-so-indepth, but still interesting justification of why i think bush s the antichrist, according to the revelatino passage. go through it and tell me what you think\n\n \n This is impossible considering that George Bush works for Dick Cheney...\n \n Dick is the antichrist!!!", 
   {}, 
   205813, 
   null, 
   1146010140.0
  ], 
  [
   209634, 
   null, 
   "Easyrider", 
   "Is Bush the antichrist? \n \n Calling Bush the antichrist is grandiose.\n \n He is just another pathetic XXXXX, nothing more.\n\n \n <chuckle<\n \n Well, he certainly outwitted Al Gore and John Kerry, who are both crying in their beers now. What does that make them?", 
   {}, 
   208714, 
   null, 
   1146011640.0
  ], 
  [
   209638, 
   null, 
   "johnson", 
   "<chuckle<\n \n Well, he certainly outwitted Al Gore and John Kerry, who are both crying in their beers now. What does that make them?\n\n \n It makes them not president,... and him a president with a very low approval rating. But I understand you could care less about an approval rating.. you seem to only be concerned with being right, and have demonstrated that you will ignore any logic or reason that may have the audacity to dissagree with your self proclaimed book of truths.", 
   {}, 
   209634, 
   null, 
   1146013080.0
  ], 
  [
   209675, 
   null, 
   "Easyrider", 
   "It makes them not president,... and him a president with a very low approval rating. But I understand you could care less about an approval rating.. you seem to only be concerned with being right, and have demonstrated that you will ignore any logic or reason that may have the audacity to dissagree with your self proclaimed book of truths.\n\n \n It makes them not president.... \n \n I saw them (Gore and Kerry) the next day(s)... looked like a couple of run over deers trying to figure out what happened. LOL! They're still trying to figure it out. STILL TRYING TO FIGURE IT OUT. And if you guys put another liberal (like Hillary) on the ticket you'll get run over again (and again, and again....). Then maybe you won't try picking someone who puts their finger up in the wind to try to figure out what's right and wrong. emoticon_xbouncer", 
   {}, 
   209638, 
   null, 
   1146023220.0
  ], 
  [
   209682, 
   null, 
   "johnson", 
   "It makes them not president.... \n \n I saw them (Gore and Kerry) the next day(s)... looked like a couple of run over deers trying to figure out what happened. LOL! They're still trying to figure it out. STILL TRYING TO FIGURE IT OUT. And if you guys put another liberal (like Hillary) on the ticket you'll get run over again (and again, and again....). Then maybe you won't try picking someone who puts their finger up in the wind to try to figure out what's right and wrong. emoticon_xbouncer\n\n \n We can all hope for another idiot, just like the one we got, ...\n \n And then EZ can continue to tell us all how great this next idiot would be.\n \n I don't believe for a minuet that you would support the kind of stupidity Bush has given us if he weren't a ( self proclaimed ) christian !!\n \n Oh and by the way,.. I've already made it plainly clear that my spelling is bad, so it's not nessasary to avoid the issues in an effort to convince yourself your right because I'm some kind of idiot.", 
   {}, 
   209675, 
   null, 
   1146024180.0
  ], 
  [
   209758, 
   null, 
   "unkerpaulie", 
   "<chuckle<\n \n Well, he certainly outwitted Al Gore and John Kerry, who are both crying in their beers now. What does that make them?\n\n one of the key skills of the anti-christ is the ability to decieve. bush outwitting the population (not the dems) is just more evidence that supports my case. thanks, i had forgotten about that!", 
   {}, 
   209634, 
   null, 
   1146073920.0
  ], 
  [
   210175, 
   null, 
   "juleacatz", 
   "When I was searching around for a few good things to comment on, I saw the title of this thread and couldn't help but laugh. I have heard many ignorant comments from people who think they hate Bush, but I have never heard something so hilarious! Why would you think that he is the antichrist? That is the most ridiculour thing I have ever heard! There are many things he has done that are good. I see no reason to suppose that he is the antichrist. I came to this site because i wanted to hear other views, but it seems that everyone hates Bush.", 
   {
    "post_info": {
     "post_title": "haha"
    }
   }, 
   201169, 
   null, 
   1146199200.0
  ], 
  [
   210188, 
   null, 
   "juleacatz", 
   "about my comment right above i want you to know that im not just some conservative i am a centrist and im closer to being liberal than i am to being conservative so dont just assume that", 
   {
    "post_info": {
     "post_title": "And"
    }
   }, 
   210175, 
   null, 
   1146202740.0
  ], 
  [
   278462, 
   null, 
   "richbrmly", 
   "Quote \"the leopard is essentially the Islamic religion\" Can't be, first reason is that Christians never left. They are still there. Lebanon is nearly a Christian Nation, it's very close. 3% of the Palestinians are Christian. Islam holds Jesus in high regard while no other faith (other than Christianity itself naturally) does.\n \n Now if an Antichrist is anti-Christian then by the fruits of ones actions you may have a point. The Christians in Afghanistan and Iraq are clearly in trouble. They have been running since we got there. Afghanistan almost killed a Guy for Going Christian and the Saudis (our ally) will not allow Christianity in their country. So you have a point. Clearly our actions have been anti-Christian to say the least.", 
   {
    "unicode_changes_made": true
   }, 
   189804, 
   null, 
   1187195640.0
  ], 
  [
   279337, 
   null, 
   "samiinh", 
   "When I was searching around for a few good things to comment on, I saw the title of this thread and couldn't help but laugh. I have heard many ignorant comments from people who think they hate Bush, but I have never heard something so hilarious! Why would you think that he is the antichrist? That is the most ridiculour thing I have ever heard! There are many things he has done that are good. I see no reason to suppose that he is the antichrist. I came to this site because i wanted to hear other views, but it seems that everyone hates Bush.\n\n \n What are the good things that you credit the Bushies with? As far as I can see, they've done nothing that has been good for America, but their wealthy friends have certainly benefited from this administration.", 
   {}, 
   210175, 
   null, 
   1187560920.0
  ], 
  [
   280481, 
   null, 
   "richbrmly", 
   "Not so. There was a pro Al Queda camp in northern Iraq (the Ansar al-Islam group) that he let slide - the ones who were instrumental in trying to poison the UK with Ricin. Saddam also paid suicide terrorist families who killed Israeli's $25,000 a pop. Here's some more:\n \n Osama-Saddam links \n 9-11 commission missed\n Overwhelming evidence of connection \n between al-Qaida, Iraq before attack\n \n \n http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=39025\n \n \n \n \n \n By your standard the founding fathers should have given up on America, since it took 13 years for us to get a Constitution.\n\n \n Saddam had to let slide the pro-AL Qeada camp, we where fling over it. In fact AL Qeada could not be in Iraq even today without U.S. troops; Oh true! They blew up the Golden Mosque and the much larger Shia Militias would kill off AL Qeada in under a month.\n \n Saddam was secular. He would not allow Osama's faith openly worship. We ever do that? Ben Ladden had a deep hatrid of Saddam. \n \n Saddam did indeed pay money to the family's of Palestinians but he never touched the amounts of funds the Saudi's paid.\n \n \n The President of the United States admited, Saddam had NO connection...None to Osama. nothing.\n \n The CIA report is public. Still says...NO connection to Saddam and Islamic terror.\n \n \n Oh and as far as a constitution?? Israel doesn't have one. They are working on it. They promise to give minorities rights equal to other countries but they have yet to specify which countries they speak of.", 
   {}, 
   189925, 
   null, 
   1188049620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  is bush the antichrist?", 
  "url": "http://www.4forums.com/political/bible-doctrine/7242-bush-antichrist.html", 
  "breadcrumbs": [
   "Bible Doctrine"
  ], 
  "id_number": 7242, 
  "discussion_files": [
   [
    "31738.html", 
    "http://www.4forums.com/political/bible-doctrine/7242-bush-antichrist-print.html"
   ], 
   [
    "31739.html", 
    "http://www.4forums.com/political/bible-doctrine/7242-bush-antichrist-5-print.html"
   ], 
   [
    "31740.html", 
    "http://www.4forums.com/political/bible-doctrine/7242-bush-antichrist-4-print.html"
   ], 
   [
    "31741.html", 
    "http://www.4forums.com/political/bible-doctrine/7242-bush-antichrist-3-print.html"
   ], 
   [
    "31742.html", 
    "http://www.4forums.com/political/bible-doctrine/7242-bush-antichrist-2-print.html"
   ]
  ], 
  "identifier": 7242
 }
]