[
 [
  [
   189922, 
   null, 
   "simone", 
   "http://www.nytimes.com/2006/01/01/fashion/sundaystyles/01LOVE.html?pagewanted=2\n \n January 1, 2006\n Modern Love\n Paradise Lost (Domestic Division) \n By TERRY MARTIN HEKKER\n A WHILE back, at a baby shower for a niece, I overheard the expectant mother being asked if she intended to return to work after the baby was born. The answer, which rocked me, was, \"Yes, because I don't want to end up like Aunt Terry.\"\n \n That would be me.\n \n In the continuing case of Full-Time Homemaker vs. Working Mother, I offer myself as Exhibit A. Because more than a quarter-century ago I wrote an Op-Ed article for The New York Times on the satisfaction of being a full-time housewife in the new age of the liberated woman. I wrote it from my heart, thoroughly convinced that homemaking and raising my children was the most challenging and rewarding job I could ever want.\n \n \"I come from a long line of women,\" I wrote, \"most of them more Edith Bunker than Betty Freidan, who never knew they were unfulfilled. I can't testify that they were happy, but they were cheerful. ...They took pride in a clean, comfortable home and satisfaction in serving a good meal because no one had explained that the only work worth doing is that for which you get paid.\"\n \n I wasn't advocating that mothers forgo careers to stay home with their children; I was simply defending my choice as a valid one. The mantra of the age may have been \"Do your own thing,\" but as a full-time homemaker, that didn't seem to mean me. \n \n The column morphed into a book titled \"Ever Since Adam and Eve,\" followed by a national tour on which I, however briefly, became the authority on homemaking as a viable choice for women. I ultimately told my story on \"Today\" and to Dinah Shore, Charlie Rose and even to Oprah, when she was the host of a local TV show in Baltimore. \n \n In subsequent years I lectured on the rewards of homemaking and housewifery. While others tried to make the case that women like me were parasites and little more than legalized prostitutes, I spoke to rapt audiences about the importance of being there for your children as they grew up, of the satisfactions of \"making a home,\" preparing family meals and supporting your hard-working husband.\n \n So I was predictably stunned and devastated when, on our 40th wedding anniversary, my husband presented me with a divorce. I knew our first anniversary would be paper, but never expected the 40th would be papers, 16 of them meticulously detailing my faults and flaws, the reason our marriage, according to him, was over.\n \n We had been married by a bishop with a blessing from the pope in a country church filled with honeysuckle and hope. Five children and six grandchildren later we were divorced by a third-rate judge in a suburban courthouse reeking of dust and despair. \n \n Our long marriage had its full share of love, complications, illnesses, joy and stress. Near the end we were in a dismal period, with my husband in treatment for alcoholism. And although I had made more than my share of mistakes, I never expected to be served with divorce papers. I was stunned to find myself, at this stage of life, marooned. And it was small comfort that I wasn't alone. There were many other confused women of my age and circumstance who'd been married just as long, sharing my situation. \n \n I WAS in my teens when I first read Dickens's \"Great Expectations,\" with the tale of Miss Haversham, who, stood up by her groom-to-be, spent decades in her yellowing wedding gown, sitting at her cobweb-covered bridal banquet table, consumed with plotting revenge. I felt then that to be left waiting at the altar with a church full of people must be the most crushing thing that could happen to a woman.\n \n I was wrong. No jilted bride could feel as embarrassed and humiliated as a woman in her 60's discarded by her husband. I was confused and scared, and the pain of being tossed aside by the love of my life made bitterness unavoidable. In those first few bewildering months, as I staggered and wailed though my life, I made Miss Haversham look like a good sport.\n \n Sitting around my kitchen with two friends who had also been dumped by their husbands, I figured out that among the three of us we'd been married 110 years. We'd been faithful wives, good mothers, cooks and housekeepers who'd married in the 50's, when \"dress for success\" meant a wedding gown and \"wife\" was a tenured position.\n \n (More)", 
   {
    "post_info": {
     "post_title": "In Praise of Feminism"
    }
   }, 
   null, 
   null, 
   1136427660.0
  ], 
  [
   189923, 
   null, 
   "simone", 
   "Turns out we had a lot in common with our outdated kitchen appliances. Like them we were serviceable, low maintenance, front loading, self-cleaning and (relatively) frost free. Also like them we had warranties that had run out. Our husbands sought sleeker models with features we lacked who could execute tasks we'd either never learned or couldn't perform without laughing.\n \n Like most loyal wives of our generation, we'd contemplated eventual widowhood but never thought we'd end up divorced. And \"divorced\" doesn't begin to describe the pain of this process. \"Canceled\" is more like it. It began with my credit cards, then my health insurance and checkbook, until, finally, like a used postage stamp, I felt canceled too.\n \n I faced frightening losses and was overwhelmed by the injustice of it all. He got to take his girlfriend to Cancun, while I got to sell my engagement ring to pay the roofer. When I filed my first nonjoint tax return, it triggered the shocking notification that I had become eligible for food stamps. \n \n The judge had awarded me alimony that was less than I was used to getting for household expenses, and now I had to use that money to pay bills I'd never seen before: mortgage, taxes, insurance and car payments. And that princely sum was awarded for only four years, the judge suggesting that I go for job training when I turned 67. Not only was I unprepared for divorce itself, I was utterly lacking in skills to deal with the brutal aftermath.\n \n I read about the young mothers of today - educated, employed, self-sufficient - who drop out of the work force when they have children, and I worry and wonder. Perhaps it is the right choice for them. Maybe they'll be fine. But the fragility of modern marriage suggests that at least half of them may not be.\n \n Regrettably, women whose husbands are devoted to their families and are good providers must nevertheless face the specter of future abandonment. Surely the seeds of this wariness must have been planted, even if they can't believe it could ever happen to them. Many have witnessed their own mothers jettisoned by their own fathers and seen divorced friends trying to rear children with marginal financial and emotional support.\n \n These young mothers are often torn between wanting to be home with their children and the statistical possibility of future calamity, aware that one of the most poverty-stricken groups in today's society are divorced older women. The feminine and sexual revolutions of the last few decades have had their shining victories, but have they, in the end, made things any easier for mothers?\n \n I cringe when I think of that line from my Op-Ed article about the long line of women I'd come from and belonged to who were able to find fulfillment as homemakers \"because no one had explained\" to us \"that the only work worth doing is that for which you get paid.\" For a divorced mother, the harsh reality is that the work for which you do get paid is the only work that will keep you afloat.\n \n These days couples face complex negotiations over work, family, child care and housekeeping. I see my children dealing with these issues in their marriages, and I understand the stresses and frustrations. It becomes evident that where traditional marriage through the centuries had been a partnership based on mutual dependency, modern marriage demands greater self-sufficiency. \n \n WHILE today's young women know from the start they'll face thorny decisions regarding careers, marriage and children, those of us who married in the 50's anticipated lives similar to our mothers' and grandmothers'. Then we watched with bewilderment as all the rules changed, and the goal posts were moved. \n \n If I had it to do over again, I'd still marry the man I married and have my children: they are my treasure and a powerful support system for me and for one another. But I would have used the years after my youngest started school to further my education. I could have amassed two doctorates using the time and energy I gave to charitable and community causes and been better able to support myself.\n \n But in a lucky twist, my community involvement had resulted in my being appointed to fill a vacancy on our Village Board. I had been serving as titular deputy mayor of my hometown (Nyack, N.Y.) when my husband left me. Several weeks later the mayor chose not to run again because of failing health, and I was elected to succeed him, becoming the first female mayor. \n \n I held office for six years, a challenging, full-time job that paid a whopping annual salary of $8,000. But it consumed me and gave me someplace to go every day and most nights, and as such it saved my sanity. Now, mostly retired except for some part-time work, I am kept on my toes by 12 amazing grandchildren.\n \n My anachronistic book was written while I was in a successful marriage that I expected would go on forever. Sadly, it now has little relevance for modern women, except perhaps as a cautionary tale: never its intended purpose. So I couldn't imagine writing a sequel. But my friend Elaine did come up with a perfect title: \"Disregard First Book.\"\n \n Terry Martin Hekker is a writer in Nyack, N.Y.", 
   {}, 
   189922, 
   null, 
   1136427720.0
  ], 
  [
   189955, 
   null, 
   "Bassman", 
   "Strange, Susan B. Anthony is probably spinning in her grave if she saw what the modern feminist movement has evolved to. BTW, if I recall, stay at home moms were always ostracized by the feminists for \"not realizing their 'potential'\". Now, there is a reversal towards women reclaiming their traditional roles in society.", 
   {}, 
   189923, 
   null, 
   1136442780.0
  ], 
  [
   189976, 
   null, 
   "Obvious Child", 
   "I don't know exactly what point that article's making: more money for divorcees? Don't go irreversibly down one route? Don't act in marriage on the assumption it's forever? Learn to provide 'special features' for your husband? The mind boggles.\n \n Still, at least I guessed this would be you, simone ;)", 
   {}, 
   189955, 
   null, 
   1136470740.0
  ], 
  [
   190006, 
   null, 
   "simone", 
   "Seems to me that if a woman's lifework is to be the helpmate of her husband, to be the homemaker who keeps a nice home for him, the woman who bears her husband's children and is the primary caretaker for these children--it just seems to me that after all her years of unpaid and, obviously, unappreciated labors, that it is monstrously unfair to casually put her aside, turn her out of her home and leave her penniless.\n \n If that's how you feel about women it just goes to show that feminist-haters are rabid haters of women in general and don't appreciate what a woman does as a homemaker and a mother.", 
   {}, 
   189976, 
   null, 
   1136481120.0
  ], 
  [
   190029, 
   null, 
   "Obvious Child", 
   "Seems to me that if a woman's lifework is to be the helpmate of her husband, to be the homemaker who keeps a nice home for him, the woman who bears her husband's children and is the primary caretaker for these children--it just seems to me that after all her years of unpaid and, obviously, unappreciated labors, that it is monstrously unfair to casually put her aside, turn her out of her home and leave her penniless.\nHow can you get from this that she was unappreciated, or that she was 'casually' put aside? She makes clear she wasn't penniless. If you're saying he acted badly, then based on this one-sided account, I would agree.\n \n \nIf that's how you feel about women it just goes to show that feminist-haters are rabid haters of women in general and don't appreciate what a woman does as a homemaker and a mother.\nIs this addressed at me? If so, why would you think I hate women?\n \n \n You still haven't answered my question: what point is this article making?", 
   {}, 
   190006, 
   null, 
   1136486760.0
  ], 
  [
   190043, 
   null, 
   "simone", 
   "Hekker happens, because she had some income as a writer, to be in a slightly better position as a woman abandoned summarily by her husband.\n \n However, as a feminist, I have been able to observe personally the painful situations of women who were not so lucky and I have personally observed how little women's work is valued in the United States, how little \"family values\" are truly valued.\n \n As a matter of fact women are vastly concerned about the economic inequality suffered by women:\n \n The truth is we have to quit lying to our daughters. No female can have a successful male-patterned career and have a family. I've never met one, I've never heard of one who has. Now, one can do like you and X and a few others who nurse along a \"job\" that pays more than most, but you (meaning all women who try) do not have the financial nor career success that a man has who had a wife who supported him in going full blast. \n \n Simone: If we had true \"family values\" we would value the unpaid work that women do as helpmates to their husbands, as homemakers, as the women who give birth to and are usually the primary caretakers of their husbands' children. However, in Bush's world we do not. Feminists value the work of a woman as a homemaker and a mother but realize that Christian society does not and that women have to have a plan in place in case a husband discards them for a \"newer model.\"\n \n So we should tell our girls as this woman advocates to keep yourself totally stressed out trying to work part-time and raise a family over time, so that in case you get dumped by your husband you will be able to continue to work at your menial paying job? My cleaning lady makes more than I could as a nurse with years of experience. I don't know any jobs other than MD where a woman could make enough to maintain near the same standard of living she could when she was married. It is a gamble millions of woman have to take - to be a reasonably good mother, \"working\" or not you are going to be a in world of financial and social trouble if you get dumped. Not fair is very true, but if this woman had 2 PhDs instead of all her volunteer work, so what maybe she could work at her local college making $18K/yr? Old profs with little experience who have not done the aggressive male patterned tenured track get paid tiddly squat. It would have done her no good.\n \n Simone: This is a reflection of an American values system which does not value \"intellectual\" work, which despises so-called \"women's\" work in the nursing and teaching professions. \"Intellectual\" work is also deemed feminine in nature and so deemed as not deserving the same sort of respect and financial reward given to predatory capitalistic endeavors. Pure and simple raw money and piling up a huge pile of it is the worshipped goal in good old \"Christian\" America.\n \n Her only protection would have been to not have children and only do half of the homemaking while keeping an aggressive career. Then she would not have 12 grandchildren which is her true long term contribution to society. \n \n Simone: I had the great fortune to be primarily a homemaker and primary caretaker of children--although my ex-husband must be given a great deal of credit for being a pretty participatory parent--I think the guy actually likes kids--and he made enough money that it was possible for me, the other parent, to stay at home. In these days of the Reagan legacy and Bush policies, it is no longer possible to be a one-income family. However, underlying all of this is the historical American tendency to disdain the work of women paid and unpaid and one of the goals of feminism is to value the work of women.\n \n And therefore we should have aggressive laws to finanically support divoreced grandmothers! She should have moved to a cheaper place to live and dated or married. Some other man might have appreciated her talents, but she's fooling herself to think that she could have made as much money as her husband if she had \"worked\" all those years. \n \n Simone: At this point, a feminist asks, why is it always necessary for a woman to sacrifice and live a lesser life? We feminists do not believe that the male sex is next to God in the hierarchy of humanity and believe that women must be fully realized as human and equal to men.\n \n The other reality is that if she had \"worked\" he would have spent all her money and much of her income would have gone to taxes, so all she would really have is current income. She would have been used to a double income lifestyle and still would have had to move down in the world. Maybe someone can forward this back to her. I don't see how she could have made any better choices or protected herself any better.\n \n Simone: If a man spends all of a woman's money it is time for her to set up a separate and discreet bank account and to keep an eye on the total income and outgo of money within a family structure. Women do themselves a great disservice if they don't know the nuts and bolts of finance, if they do not have any control over the finances of a family. Even women who do not bring in income can play a major role in managing household finances and being frugal and using money wisely. No woman in a relationship should be financially stupid.", 
   {}, 
   190029, 
   null, 
   1136488740.0
  ], 
  [
   190583, 
   null, 
   "Obvious Child", 
   "Hmm, still not terribly clear.\n \n Are you saying that the system needs reform AND women need to keep a foot in the door of economic self-sufficiency AND they need more financial awareness within marriage?", 
   {}, 
   190043, 
   null, 
   1136738760.0
  ], 
  [
   259157, 
   null, 
   "jlcabler", 
   "The point of the article was that this woman spent years declaring the importance of being a stay at home mother, and she found that she was wrong. The article hails feminism because it has given women the choice of being a stay-at-home mom, a working mom, or not being a mom at all. I think the article was enlightening, and I personally like to hear older women voice their opinions. I don't really think men have a place in condemning feminism or feminist theory. I can't speak for feminists 40 years ago, but as a modern day feminist our movement supports the right of women to choose their own life paths. I fully support stay-at-home mom's, but I have to agree with the author. Stay-at-home mother's that lack education or skills might be setting themselves up for failure. With the current trends in divorce rates, women should be prepared for divorce even when it seems unlikely. Otherwise, even more women and children will be living below the poverty line.", 
   {
    "post_info": {
     "post_title": "The point"
    }
   }, 
   190583, 
   null, 
   1176838980.0
  ], 
  [
   259274, 
   null, 
   "jitobear", 
   "Strange, Susan B. Anthony is probably spinning in her grave if she saw what the modern feminist movement has evolved to. BTW, if I recall, stay at home moms were always ostracized by the feminists for \"not realizing their 'potential'\". Now, there is a reversal towards women reclaiming their traditional roles in society.\n\n \n You mean us single women who dare to do well for oursleves and even are happy that way? If Susan don't like it, let the bitch spin.\n \n Really there is nothing wrong with being a home-maker (male or female) if your situation makes that affordable. But anything can happen (divorce, death, serious injury, lay-offs) and each individual should ensure they have the skills to provide for themselves and possibly their family.", 
   {}, 
   189955, 
   null, 
   1176916980.0
  ], 
  [
   259894, 
   null, 
   "Matthew S", 
   "The point of the article was that this woman spent years declaring the importance of being a stay at home mother, and she found that she was wrong. The article hails feminism because it has given women the choice of being a stay-at-home mom, a working mom, or not being a mom at all. I think the article was enlightening, and I personally like to hear older women voice their opinions. I don't really think men have a place in condemning feminism or feminist theory. I can't speak for feminists 40 years ago, but as a modern day feminist our movement supports the right of women to choose their own life paths. I fully support stay-at-home mom's, but I have to agree with the author. Stay-at-home mother's that lack education or skills might be setting themselves up for failure. With the current trends in divorce rates, women should be prepared for divorce even when it seems unlikely. Otherwise, even more women and children will be living below the poverty line.\n\n \n Agreed\n \n As long as the stay at home moms do not fight to take your choices away.", 
   {}, 
   259157, 
   null, 
   1177289580.0
  ], 
  [
   261596, 
   null, 
   "valet_dave", 
   "I'm not really sure what to make of this article. The individual rightly points out the seriousness of the choice between staying at home or maintaining a career, but it's hardly earth shattering news to modern day couples. From my own perspective, I don't even see it is a realistic choice many couples can make, given the hardships in paying mortgages, working, commuting, etc. etc. but that obviously depends on sacrifice and preference.\n \n Because the opinions this person is expressing are based on an entirely different generation to mine (I hope), I don't see it as particularly relevant to me. In fact, I could even consider it offensive to suggest that a male partner is not equally effected in many ways when one partner ceases making an income to assist in raising a family. An \"informed choice\" doesn't necessarily mean that a woman is actually choosing to give up anything.\n \n That such a choice could result in a future divorce is hardly a result of an unequal empowerment. More likely, the divorce is indicative of a failure in communication, a lack of nurturing, trust, or perhaps even the result of a shaky foundation upon which a relationship was built. For that, both partners need to take some responsibility, whether that be for their actions, or inactions. Both men and women can be victims in these scenarios, and only by being exposed and trusting in one another can they experience a fulfilling life together. And surely that's not what we want to guard against.", 
   {
    "unicode_changes_made": true
   }, 
   259894, 
   null, 
   1178258760.0
  ], 
  [
   261957, 
   null, 
   "simone", 
   "Or, in the case of Newt Gingrich, wanting to shed an old, unattractive wife for a new \"trophy\" wife.", 
   {}, 
   261596, 
   null, 
   1178471220.0
  ], 
  [
   262020, 
   null, 
   "E Mutz", 
   "Or, in the case of Newt Gingrich, wanting to shed an old, unattractive wife for a new \"trophy\" wife.\n\n \n Or JFK and Marilyn Monroe\n \n Gary Hart and Donna Rice...\n \n Bill Clinton and (fill-in-the-bank...)\n \n And so forth and so on...", 
   {}, 
   261957, 
   null, 
   1178514960.0
  ], 
  [
   262053, 
   null, 
   "Liminus", 
   "Strange, Susan B. Anthony is probably spinning in her grave if she saw what the modern feminist movement has evolved to. BTW, if I recall, stay at home moms were always ostracized by the feminists for \"not realizing their 'potential'\". Now, there is a reversal towards women reclaiming their traditional roles in society.\n\n \n I wouldn't call it a 'reversal' as such; these things happen all the time as new ideologies spring up; at first everyone goes wild for them (feminism especially as it was relevant to half the human race) and then after a while, some people 'drop out' or don't subscribe to the new ideology, while others still do. The culture thus incorporates the new ideology, plus the values that existed before the new ideology, plus a mixture of the two.\n \n I wouldn't use the word 'reclaiming' either; some women simply want to be full-time homemakers and mothers, others want a successful, possibly high-powered career, others want to try to balance the two. The difference today is that women have the choice and that choice is largely respected by society, something that would have been impossible in the past.\n \n It is also fairly common knowledge that a reasonably significant proportion of men have recently started to take on the role of homemakers; again I think it is largely, if indirectly, due to the impact of the feminist movement that men can take on such a role without being ridiculed.\n \n The point is that since the 'cultural revolution' (whatever you call it) of the mid-20th century both sexes are now free to make such a choice without haveing to fear the judgement of their peers.", 
   {}, 
   189955, 
   null, 
   1178552040.0
  ], 
  [
   262362, 
   null, 
   "simone", 
   "The odd thing, however, is that JFK, Clinton and Hart stayed attached to their wives and did not abandon their wives and children in the cruel way that Gingrich did.", 
   {}, 
   262053, 
   null, 
   1178733960.0
  ], 
  [
   262368, 
   null, 
   "E Mutz", 
   "Ah, I see your point in that regard. My point was that any individual who betrays the solemn vow of marriage is utterly untrustworthy and unfit for public confidence, regardless of their political affiliation. You make no more solemn vow than you do before God to bear true faith to your spouse. If you can break a vow before God made to the person who bears the greatest trust in you, how can anyone trust you to deal justly on any other matter. \n \n There are indeed issues of black and white and this is one of them.", 
   {}, 
   262362, 
   null, 
   1178742360.0
  ], 
  [
   262495, 
   null, 
   "simone", 
   "I am very surprised to learn that you make vows before God and hold them sacred.", 
   {}, 
   262368, 
   null, 
   1178816280.0
  ], 
  [
   262510, 
   null, 
   "E Mutz", 
   "I am very surprised to learn that you make vows before God and hold them sacred.\n\n \n Pray tell, why is that?", 
   {}, 
   262495, 
   null, 
   1178823900.0
  ], 
  [
   262518, 
   null, 
   "simone", 
   "You strike me as being quite irreverent.", 
   {}, 
   262510, 
   null, 
   1178827500.0
  ], 
  [
   262555, 
   null, 
   "E Mutz", 
   "You strike me as being quite irreverent.\n\n \n Better to be irreverent than irrelevant, just as it is better to be imitated that to be imolated.\n \n Generally speaking you are correct but I have zero tolerance for infidelity. Fidelity is the cornerstone of integrity.", 
   {}, 
   262518, 
   null, 
   1178850900.0
  ], 
  [
   262764, 
   null, 
   "simone", 
   "Fidelity to what?", 
   {}, 
   262555, 
   null, 
   1178983800.0
  ], 
  [
   262842, 
   null, 
   "Matthew S", 
   "Ah, I see your point in that regard. My point was that any individual who betrays the solemn vow of marriage is utterly untrustworthy and unfit for public confidence, regardless of their political affiliation. You make no more solemn vow than you do before God to bear true faith to your spouse. If you can break a vow before God made to the person who bears the greatest trust in you, how can anyone trust you to deal justly on any other matter. \n \n There are indeed issues of black and white and this is one of them.\n\n \n Yet you have no idea what kind of marriage Bill and Hillary have. They could have and open marriage, or a swingers understanding. Bill gets to have his way with all the women he wants too and so does Hillary.", 
   {}, 
   262368, 
   null, 
   1179037320.0
  ], 
  [
   263082, 
   null, 
   "E Mutz", 
   "Yet you have no idea what kind of marriage Bill and Hillary have. They could have and open marriage, or a swingers understanding. Bill gets to have his way with all the women he wants too and so does Hillary.\n\n \n There is plenty of evidence on what kind of marriage the Clintons have. I am not making this up out of whole cloth, I am referring to the Jr. Senator's own words in her memoir \"Living History\":\n \n Hillary Rodham Clinton felt \"dumbfounded, heartbroken and outraged\" when she learned of the affair and said that she could \"hardly breathe\" when she learned the rumors of the affair were true.\n \n \"Gulping for air, I started crying and yelling at him: 'What do you mean? Why did you lie to me?\" Mrs Clinton writes. \n \n Doesn't sound like such a swingin good time ey what? But don't take my word for it, go down to the library and read pg 502. \n \n I stand by my previous thesis.", 
   {}, 
   262842, 
   null, 
   1179178680.0
  ], 
  [
   263326, 
   null, 
   "Zardoz", 
   "I'd maintain that her novel was more than likely created to present a facade for her current endevors and to put her in a sympathetic light.\n \n Mr. Clinton had a history of such indiscretions in the past. She should not have been surprised when they happened again.\n \n Mutz, I'd take you for a far more cynical person that one who'd believe a such a story.\n \n The question would be, why didn't she dump his arse?\n Is she using him for her own gains?", 
   {}, 
   263082, 
   null, 
   1179320640.0
  ], 
  [
   263343, 
   null, 
   "E Mutz", 
   "I'd maintain that her novel was more than likely created to present a facade for her current endevors and to put her in a sympathetic light.\n \n Mr. Clinton had a history of such indiscretions in the past. She should not have been surprised when they happened again.\n \n Mutz, I'd take you for a far more cynical person that one who'd believe a such a story.\n \n The question would be, why didn't she dump his arse?\n Is she using him for her own gains?\n\n \n Oh, I don't trust Hilrod at all. Problem is folks like Matthew do. Fortunately you can quote from her scripture and they must accept it as the inerrant word of She Who Must Be President. \n \n The fact that she stood by her man is amusing in light of her early 1992 campaign comment blasting Tammy Wynnette for doing same.", 
   {
    "unicode_changes_made": true
   }, 
   263326, 
   null, 
   1179329100.0
  ], 
  [
   263370, 
   null, 
   "simone", 
   "There's just something about Bill, though. . .", 
   {}, 
   263343, 
   null, 
   1179336060.0
  ], 
  [
   265430, 
   null, 
   "Jill White", 
   "Now, there is a reversal towards women reclaiming their traditional roles in society.\n\n You are probably the only person here who believes that.\n \n Realistically economic forces are precluding that from happening.", 
   {}, 
   189955, 
   null, 
   1180537200.0
  ], 
  [
   265431, 
   null, 
   "Jill White", 
   "Ah, I see your point in that regard. My point was that any individual who betrays the solemn vow of marriage is utterly untrustworthy and unfit for public confidence, regardless of their political affiliation. You make no more solemn vow than you do before God to bear true faith to your spouse. If you can break a vow before God made to the person who bears the greatest trust in you, how can anyone trust you to deal justly on any other matter. \n \n There are indeed issues of black and white and this is one of them.\n\n And in the process you have eliminated roughly 1 / 3 of the greatest men and women who ever lived.\n \n You fail to take into account the reality of the human condition.\n \n I had a boss that used to tell me about business dealings, it does not matter how much paper you have between you the law of the jungle prevails.\n \n Clinton was the last good president we had.", 
   {}, 
   262368, 
   null, 
   1180537800.0
  ], 
  [
   265687, 
   null, 
   "simone", 
   "Sigh! And one of the sexiest ever!!", 
   {}, 
   265431, 
   null, 
   1180628460.0
  ], 
  [
   265710, 
   null, 
   "jim's trucking", 
   "And in the process you have eliminated roughly 1 / 3 of the greatest men and women who ever lived.\n \n You fail to take into account the reality of the human condition.\n \n I had a boss that used to tell me about business dealings, it does not matter how much paper you have between you the law of the jungle prevails.\n \n Clinton was the last good president we had.\nI really hate to go using the quote button on you, but that last sentence of yours is so far from the truth it hurts. Boortz recently did a poll on his website asking people the rank the past few presidents we've had. It was prompted by Jimmy Carter's comment that GWBush is the worst we've had this century (or something like that). The response was: Carter 80 somethin' percent followed by Slick WIlly as the second worst.\n \n Evidently, you went to the liberal charm school and partook of the kool-aid too often.\n \n Carter was a total loss. Slick Willy Clinton was a sleazy, low-life, no-good, POS pseudo-leader who couldn't keep little willy in his pants...just the thing we need to lead the socialists into total perverseness. Oral sex not being real sex has enpowered our young people to start a lot earlier now...thanks to Slick Willy and his high standards. Screw Bill Clinton and that POS \"wife\" of his. Pray for Chelsea to turn out better.", 
   {}, 
   265431, 
   null, 
   1180634340.0
  ], 
  [
   265725, 
   null, 
   "simone", 
   "Chelsea, by the way, has turned out very nicely.\n \n She happens not to be given to drunken sluttiness like a couple of twins I could name.", 
   {}, 
   265710, 
   null, 
   1180638600.0
  ], 
  [
   265730, 
   null, 
   "Jill White", 
   "Jim that is a very interesting pile of conjecture but the last thing I am going to do is have a dialog with someone who is brainwashed unless its about religion.", 
   {}, 
   265725, 
   null, 
   1180642260.0
  ], 
  [
   265887, 
   null, 
   "jim's trucking", 
   "Chelsea, by the way, has turned out very nicely.\n \n She happens not to be given to drunken sluttiness like a couple of twins I could name.\nLikely, they'll all turn out nicely. I did see a photo of Chelsea half naked, though I usually suspect photoshop in that kind of exposure. I don't begrudge teenagers the joy of sex whether you want to call them sluts or whats. Abstinance is unnatural.\n \n \nJim that is a very interesting pile of conjecture but the last thing I am going to do is have a dialog with someone who is brainwashed unless its about religion.\nNo conjecture on my part.\n \n I've not been brainwashed , dear. \n \n Had I been, I'd be a liberal.\n \n Your hesistancy to establish dialog here, based upon some idiotic conjecture regarding brainwashing is indicative of insecurity on your part and a tacit admission that you cannot compete adequately with written argumenative techniques. You'd probably rather have a shouting match wherein nobody can really remember what was said. No wonder you have an aversion to the quote button.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Just remember...", 
   {}, 
   265730, 
   null, 
   1180716960.0
  ], 
  [
   265890, 
   null, 
   "Jill White", 
   "Your hesistancy to establish dialog here, based upon some idiotic conjecture regarding brainwashing is indicative of insecurity on your part and a tacit admission that you cannot compete adequately with written argumenative techniques. You'd probably rather have a shouting match wherein nobody can really remember what was said. No wonder you have an aversion to the quote button.\n\n Ok let me rephrase that: \n \n The last thing I am going to do is have a dialog with someone who takes them selves to seriously unless its about religion.\n \n Seriously, no that is not my goal.\n \n Over the years I have found it generally does not really matter what the topic is.\n \n If anything is true it's that the stupidest ones are often the best.", 
   {
    "unicode_changes_made": true
   }, 
   265887, 
   null, 
   1180717860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  In Praise of Feminism", 
  "url": "http://www.4forums.com/political/society-debates/7246-praise-feminism.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 7246, 
  "discussion_files": [
   [
    "25418.html", 
    "http://www.4forums.com/political/society-debates/7246-praise-feminism-print.html"
   ], 
   [
    "25419.html", 
    "http://www.4forums.com/political/society-debates/7246-praise-feminism-3-print.html"
   ], 
   [
    "25420.html", 
    "http://www.4forums.com/political/society-debates/7246-praise-feminism-2-print.html"
   ]
  ], 
  "identifier": 7246
 }
]