[
 [
  [
   189962, 
   null, 
   "Steeeeve", 
   "If any of you saw the USC v Texas game you will know it was one of the best games of all time. What a thriller! Congrats to Texas for winning and congrats to USC for a great run and great game.", 
   {
    "post_info": {
     "post_title": "Best Rose Bowl of All Time"
    }
   }, 
   null, 
   null, 
   1136446140.0
  ], 
  [
   189979, 
   null, 
   "Mickey Shane", 
   "'Twas a GREAT game!\n \n Kudos to all of the players and fans for both sides for a super display of sportmanship.\n \n Today, the red State of Texas...\n \n Is Orange!", 
   {}, 
   189962, 
   null, 
   1136474820.0
  ], 
  [
   190055, 
   null, 
   "Truthsayer", 
   "Woooohooooo!!! Hook 'em Horns!emoticon_xgood", 
   {}, 
   189979, 
   null, 
   1136492640.0
  ], 
  [
   190068, 
   null, 
   "Steeeeve", 
   "I'm a Hokie myself but glad to see the Horns win since USC beat VT in what was a questionable call at best (last year). Maybe Pete Carroll can get over himself now.", 
   {}, 
   190055, 
   null, 
   1136494800.0
  ], 
  [
   190097, 
   null, 
   "Waxy", 
   "I still think USC is the better team. \n \n Vince Young, despite his performance, didn't impress me at all. He's a tailback that takes the snap, I can't see him going anywhere beyond college football as a QB.\n \n I can't believe that USC allowed him to run wild. QB draw? Geee, I didn't see that coming. emoticon_rolleyes USC got beat by a one man team.\n \n I would have forced him to throw the ball - just like playing Michael Vick. Better yet, make him hand it off.\n \n Reggie Bush is going to be special, but White is a keeper too. Leinart will have a future as an NFL QB, even if he wasn't all that impressive last night. \n \n I'd like to see a best of three LOL, if for no other reason than we'd get to see two more amazing games.\n \n Waxy", 
   {}, 
   190068, 
   null, 
   1136504400.0
  ], 
  [
   190136, 
   null, 
   "Steeeeve", 
   "USC would win the second and Texas the third with an average margin of victory of 2.\n \n Vince Young just runs? Do you forget he has a completed 65% of his passes and 75% in the Rose Bowl. I don't know how well the two quarterbacks will do in the NFL though....I mean Tom Brady is one of the best right now and he was drafted way back. You are right about Bush though...he is going places.", 
   {}, 
   190097, 
   null, 
   1136527920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Best Rose Bowl of All Time", 
  "url": "http://www.4forums.com/political/sports-debates/7248-best-rose-bowl-all-time.html", 
  "breadcrumbs": [
   "Sports"
  ], 
  "id_number": 7248, 
  "discussion_files": [
   [
    "13554.html", 
    "http://www.4forums.com/political/sports-debates/7248-best-rose-bowl-all-time-print.html"
   ]
  ], 
  "identifier": 7248
 }
]