[
 [
  [
   190171, 
   null, 
   "georged", 
   "In a move that showed rare consideration for taxpayers but dealt one of the Bush boys and organized religion a setback, Florida's Supreme Court struck down a voucher program for students attending failing schools, saying the state Constitution bars Florida from using taxpayer money to finance a private alternative to the public system. \n \n http://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2006/01/06/MNGLOGIG1D1.DTL\n \n The article also describes SCOTUS's prior ruling on the issue, that taxpayers would not be required to fund secular education and religious education, eliminating any federal appeal of the state ruling.", 
   {
    "post_info": {
     "post_title": "School Vouchers Eliminated in Florida"
    }
   }, 
   null, 
   null, 
   1136566380.0
  ], 
  [
   190182, 
   null, 
   "simone", 
   "Woohooohoo! Thanks, Georged!", 
   {}, 
   190171, 
   null, 
   1136568660.0
  ], 
  [
   190317, 
   null, 
   "Bassman", 
   "Well, so much for school choice. Unless, of course you're one of the elitist media types. I guess that the NEA and the education monopoly won that round.", 
   {}, 
   190182, 
   null, 
   1136590440.0
  ], 
  [
   190332, 
   null, 
   "georged", 
   "And the taxpayers.", 
   {}, 
   190317, 
   null, 
   1136594580.0
  ], 
  [
   190334, 
   null, 
   "Bassman", 
   "Unfortunately, those of us who have serious reservations about the public screwl monopoly and the moral cesspools they've become. What choice do we have? As the father of a child who will be starting school soon, I want to be assured that my daughter, as she gets older, won't be fed the moral relativism that permiates the screwl system, now.", 
   {}, 
   190332, 
   null, 
   1136595780.0
  ], 
  [
   190336, 
   null, 
   "jitobear", 
   "Unfortunately, those of us who have serious reservations about the public screwl monopoly and the moral cesspools they've become. What choice do we have? As the father of a child who will be starting school soon, I want to be assured that my daughter, as she gets older, won't be fed the moral relativism that permiates the screwl system, now.\n\n \n So pay for a freakin private school if you don't want her hanging out with people who might have a different religion or idea than you.\n \n I hate vouchers - they free all of us from the responsibility of ensuring all schools provide a quality education and helps serve the idea that some kids just don't matter.", 
   {}, 
   190334, 
   null, 
   1136596200.0
  ], 
  [
   190337, 
   null, 
   "georged", 
   "Unfortunately, those of us who have serious reservations about the public screwl monopoly and the moral cesspools they've become. What choice do we have? As the father of a child who will be starting school soon, I want to be assured that my daughter, as she gets older, won't be fed the moral relativism that permiates the screwl system, now.\n\n \n Pay for private school.", 
   {}, 
   190334, 
   null, 
   1136596260.0
  ], 
  [
   190338, 
   null, 
   "Bassman", 
   "Unfortunately, most of us don't earn a six-figure income to do so. You on the Left want to see the education monopoly and the status-quo remain as is. Reread my thread:\"Charter School Success: Public Schools have lost their monopoly.\" You'll see that low income families (myself included) want the options and the choice of where we send our children. Not just public school cesspools.", 
   {}, 
   190337, 
   null, 
   1136596440.0
  ], 
  [
   190341, 
   null, 
   "georged", 
   "Unfortunately, most of us don't earn a six-figure income to do so. You on the Left want to see the education monopoly and the status-quo remain as is. Reread my thread:\"Charter School Success: Public Schools have lost their monopoly.\" You'll see that low income families (myself included) want the options and the choice of where we send our children. Not just public school cesspools.\n\n \n You're erroneously labeling me on the left when you've been corrected on that several times in the past. \n \n You do advocate unlimited federal control. Either become an activist to change what you think is wrong, get a second job as many parents do to afford private school or change professions for more money. If you're low income, you don't pay any taxes to support schools, so what gives you the ability and right to judge their quality?", 
   {}, 
   190338, 
   null, 
   1136597340.0
  ], 
  [
   190355, 
   null, 
   "daewoo", 
   "Unfortunately, most of us don't earn a six-figure income to do so. You on the Left want to see the education monopoly and the status-quo remain as is. Reread my thread:\"Charter School Success: Public Schools have lost their monopoly.\" You'll see that low income families (myself included) want the options and the choice of where we send our children. Not just public school cesspools.\n\n \n I would imagine that a lot of low income families would also like the option of driving a luxury car, or taking vacations to exotic locations. I would imagine that many of them would like to live in mansions and surround themselves with nice things.\n \n Unfortunatly, that is not how our system works. If you want something, you pay for it. If you cannot pay for it, you don't get it. The taxpayers are generous enough to provide enough money for basic needs (food, shelter, etc..) to ensure that the low income types do not riot in the streets. Beyond that, they are on their own.", 
   {}, 
   190338, 
   null, 
   1136601360.0
  ], 
  [
   190360, 
   null, 
   "Bassman", 
   "You're erroneously labeling me on the left when you've been corrected on that several times in the past. \n \n You do advocate unlimited federal control. Either become an activist to change what you think is wrong, get a second job as many parents do to afford private school or change professions for more money. If you're low income, you don't pay any taxes to support schools, so what gives you the ability and right to judge their quality?\nWow! How elitist of you. What gives me the right to criticize the public screwls is that as a parent, especially a parent of faith, is that my child should not be subjected to the Darwinian atheism and socialist indoctrination that permiates the school systems.", 
   {}, 
   190341, 
   null, 
   1136603340.0
  ], 
  [
   190363, 
   null, 
   "georged", 
   "Wow! How elitist of you. What gives me the right to criticize the public screwls is that as a parent, especially a parent of faith, is that my child should not be subjected to the Darwinian atheism and socialist indoctrination that permiates the school systems.\n\n \n Then you need to belly up to the bar and provide schooling of your choice. We taxpayers aren't going to accommodate that cost. That's a market served by private religious and secular schools. Don't blame others for your limited personal circumstances, change them.", 
   {}, 
   190360, 
   null, 
   1136604420.0
  ], 
  [
   190396, 
   null, 
   "Bassman", 
   "Then you need to belly up to the bar and provide schooling of your choice. We taxpayers aren't going to accommodate that cost. That's a market served by private religious and secular schools. Don't blame others for your limited personal circumstances, change them.\n\n So, let's see. It's either a six-figure income or be stuck with the public schools...WAIT A MINUTE!!! Charter Schools!! Charters are proven to run rings around the \"traditional\" district schools and are not beholden to the teacher's unions.", 
   {}, 
   190363, 
   null, 
   1136621340.0
  ], 
  [
   190418, 
   null, 
   "daewoo", 
   "So, let's see. It's either a six-figure income or be stuck with the public schools...WAIT A MINUTE!!! Charter Schools!! Charters are proven to run rings around the \"traditional\" district schools and are not beholden to the teacher's unions.\n\n \n Except that less than half of them nationwide survive past the end of their first charter. Not beholden to the teachers unions? they don't have teachers?\n \n I actually took a look at some info regarding charter schools becuse of your strong support for the concept. What I found is not quite as exciting. while charter school students typically test better than regular public school kids (though not as good as most private school kids), AND have higher colege entrance rates, public school kids and private school kids are almost 3x more likely to actually graduate from college than the charter school kids.\n \n The prevailing theory is that since charter schools largely owe their success to individual attention to students, they do a dismal job of preparing the kids for college, where a student is a number and either makes it or not on their own. \n \n Rural high schools have the same problem in many cases. The small classes (often only 30 students in a graduating class) and personal attention is great for test scores, but terrible when it comes to preparing them for college.\n \n Part of high school is learning how to function once you get out. If you turn your high school into another grade school as many charter schools do, you FAIL at that task.", 
   {}, 
   190396, 
   null, 
   1136644620.0
  ], 
  [
   190429, 
   null, 
   "Bassman", 
   "That's not the case here in Buffalo. Most of the charters have been well established for at least four years. As for college? Not everyone is cut out for college. But I will check out the stats for Buffalo charters as far as college placement. I believe there is only one charter high school here. As far as smaller class sizes and individual attention being a drawback for preparing for college? An argument can be made for private and parochial school students doing exceptionally well in college.", 
   {}, 
   190418, 
   null, 
   1136649660.0
  ], 
  [
   190430, 
   null, 
   "Matthew S", 
   "YEP hooooooray down with vouchers. I do not like the idea of paying taxes for children to go to private schools where they will be taught to hate my people.", 
   {}, 
   190429, 
   null, 
   1136650020.0
  ], 
  [
   190434, 
   null, 
   "daewoo", 
   "That's not the case here in Buffalo. Most of the charters have been well established for at least four years. As for college? Not everyone is cut out for college. But I will check out the stats for Buffalo charters as far as college placement. I believe there is only one charter high school here. As far as smaller class sizes and individual attention being a drawback for preparing for college? An argument can be made for private and parochial school students doing exceptionally well in college.\n\n \n The rate of college placement is meaningless. It is the rate of sucessful graduation that matters. College placement tends to correlate closely with test scores. College graduation tends to correlate mroe closely to how well kids were actually prepared for college. A kid who has never been in a class of more than 20 students, where there is a lot of 1 on 1 instruction available is not prepared for a lecture hall situation where there are 300 students and the professor doesn't do 1 on 1.", 
   {}, 
   190429, 
   null, 
   1136650620.0
  ], 
  [
   190437, 
   null, 
   "Wez", 
   "http://en.wikipedia.org/wiki/Charter_school\n \n Depending on which study you take, Charter schools can be better or worse than normal schools:\n \n \nA Harvard study also released in December 2004 that included 99 percent of all elementary charter school students found that they performed favorably in both math and reading compared to similar students in nearby conventional public schools, and that the longer the charter school had been in operation, the more favorably its students compared.\n\n \nOn August 16, 2004, the Department of Education released a great number of reports without public announcement. Buried in the mountains of data was the first national comparison of test scores among children in charter schools and regular public schools. These results, from a study of 6000 4th grade pupils in 2003, showed charter school students performing worse in both mathematics and reading than comparable students in regular public schools.\n\n Time will tell I guess.\n \n daewoo: Where did you get your figures from?\n \n -Wez", 
   {}, 
   190434, 
   null, 
   1136651520.0
  ], 
  [
   190441, 
   null, 
   "georged", 
   "So, let's see. It's either a six-figure income or be stuck with the public schools...WAIT A MINUTE!!! Charter Schools!! Charters are proven to run rings around the \"traditional\" district schools and are not beholden to the teacher's unions.\n\n \n They are public schools and therefore secular. Your main complaint against public schools has specifically been that they don't conform to your belief system faith regarding science and personal political ideology. A charter school is not going to 'bend the rules' for your children. According to your posts, you want a private religious school catering to your belief system sect.", 
   {}, 
   190396, 
   null, 
   1136653740.0
  ], 
  [
   190445, 
   null, 
   "daewoo", 
   "\n daewoo: Where did you get your figures from?\n \n -Wez\n\n \n \n Missouri department of education. Missouri had one of the first charter school programs. The Kansas City school districts charter program was widely lauded as a huge step forward in education, unitl it was revealed that they were cheating to make themselves look better.", 
   {}, 
   190437, 
   null, 
   1136654520.0
  ], 
  [
   190522, 
   null, 
   "Bassman", 
   "They are public schools and therefore secular. Your main complaint against public schools has specifically been that they don't conform to your belief system faith regarding science and personal political ideology. A charter school is not going to 'bend the rules' for your children. According to your posts, you want a private religious school catering to your belief system sect.\n\n Morality is only part of the equation. Before the 1960's schools not only taught academics, but also taught morality in terms of absolutes, not relativism. And the children of that time did much better than today.", 
   {}, 
   190441, 
   null, 
   1136700540.0
  ], 
  [
   190528, 
   null, 
   "daewoo", 
   "Morality is only part of the equation. Before the 1960's schools not only taught academics, but also taught morality in terms of absolutes, not relativism. And the children of that time did much better than today.\n\n \n Aren't you forgetting about a huge number of dope smoking atheist hippies, many of whom recieved the majority of their education in the 50's?\n \n Better by whose standards, and how did they do better?\n \n You do realize that charter schools, being publicly funded, are not going to be teaching morality in the form of absolutes if the other public schools around them are not, right?\n \n And why would you of all people chapion moral absolutes? You have quite possibly the most liquid morals of anybody I have ever encountered.", 
   {}, 
   190522, 
   null, 
   1136703000.0
  ], 
  [
   190529, 
   null, 
   "Bassman", 
   "\n You do realize that charter schools, being publicly funded, are not going to be teaching morality in the form of absolutes if the other public schools around them are not, right?\n\n As I've stated, morality is part of the equation. The academic and discipline standards have become all too lax in the \"mainstream\" schools.", 
   {}, 
   190528, 
   null, 
   1136703300.0
  ], 
  [
   190530, 
   null, 
   "daewoo", 
   "As I've stated, morality is part of the equation. The academic and discipline standards have become all too lax in the \"mainstream\" schools.\n\n \n You have stated that morality is part of some ill defined equasion, but have failed to relate that in any way to charter schools, or to address the fact that charter schools are still public schools, and still bound by the rules under whihc publicly funded schools operate, such as rules against teaching religon. \n \n You have failed to address any of my questions. Are you once again confused to find that your views make no sense when actually thought through?", 
   {}, 
   190529, 
   null, 
   1136703600.0
  ], 
  [
   190538, 
   null, 
   "chaoticgnome", 
   "Mentioning the Charter schools reminds me of when I first heard the arguement for vouchers from Milton Friedman in his book Right to Choose.\n \n I liked his ideas on economic freedom but thought his application of such ideology into social issues was misguided. Case in point, he argued that the market would drive schools to improve.\n \n The problem with this is shown with charter schools: around half of them fail within the first year, just like new businesses; I have no idea how many survive to 10. These failing schools, however, don't just put people out of work and leave over extra widgets, they stunt the education of every person who was placed through them.", 
   {}, 
   190530, 
   null, 
   1136707020.0
  ], 
  [
   190539, 
   null, 
   "chaoticgnome", 
   "Moral absolutes are a tough sell.\n \n There was a C S Lewis book over this who's name I can't remember. It argued that morality is absolute, even with the exclusion of humans. He argued a waterfall is sublime whether or not a human is there to witness it.\n \n Moral absolutes don't require humans to define them, which is the tough sell. There are lots of humans out there and a lot of worldviews that each one has.\n \n Teaching moral relativism serves two purposes:\n \n It allows children to (Inshallah) form their own opinions about the world and how the world should be and\n \n It allows children to become tolerant of other people with different worldviews, which is essential today.\n \n Now if our children are being taught that there is no such thing as right and wrong and anything is acceptable, that's nihilism, which in its own twisted sense, is a moral absolute. And that would be a problem, but I don't recall anything like that and I'm just recently out of the system.", 
   {}, 
   190538, 
   null, 
   1136707380.0
  ], 
  [
   190540, 
   null, 
   "daewoo", 
   "Mentioning the Charter schools reminds me of when I first heard the arguement for vouchers from Milton Friedman in his book Right to Choose.\n \n I liked his ideas on economic freedom but thought his application of such ideology into social issues was misguided. Case in point, he argued that the market would drive schools to improve.\n\n \n Milton Friedman...one of those who has raised capitalism to an almost religous level. Unfortunately he fails to accept the shortcomings of the capitalist system. The biggest shortcoming, ironically enough, is also the biggest shrotcoming of socialism...the fact that both systems rely on human participants, and humans tend to be stupid, greedy creatures. \n \n As far as I am concerned, one of the basic tenant of the capitalist system, that it drives manufacturers to produce the best product at the best price, is fatally flawed. Manufacturers are not driven to produce the best product, they are driven to produce the lowest quality product that they can get people to buy at the highest possible markup.\n \n \nThe problem with this is shown with charter schools: around half of them fail within the first year, just like new businesses; I have no idea how many survive to 10. These failing schools, however, don't just put people out of work and leave over extra widgets, they stunt the education of every person who was placed through them.\n\n \n Not to mention the fact that each failed experiment costs us several million dollars and harms not only the students who attended, but the students in the schools they end up at when their charter experiment fails.", 
   {}, 
   190538, 
   null, 
   1136707800.0
  ], 
  [
   190561, 
   null, 
   "Wez", 
   "Morality is only part of the equation. Before the 1960's schools not only taught academics, but also taught morality in terms of absolutes, not relativism. And the children of that time did much better than today.\n\n This doesn't make much sense. Better at what? Better in what terms?\n \n Weren't you against the 60's hippy generation?\n \n -Wez", 
   {}, 
   190522, 
   null, 
   1136730120.0
  ], 
  [
   190587, 
   null, 
   "simone", 
   "So, I guess cheating on charter school results is a \"moral\" value.", 
   {}, 
   190561, 
   null, 
   1136739480.0
  ], 
  [
   190596, 
   null, 
   "georged", 
   "Morality is only part of the equation. Before the 1960's schools not only taught academics, but also taught morality in terms of absolutes, not relativism. And the children of that time did much better than today.\n\n \n I was educated in the 1950s and early 1960s and I don't recall any lessons on specific morality. The purpose of education then and now is preparing individuals with the capability of assimilation into society at the time of entry. Times do change. But I didn't attend schools with belief system orientation and sponsorship.\n \n To me, it sounds like you're still demanding public education adopt your belief system's principles of morality because you state you're unable to financially afford private schooling for your children with that orientation. Mixing slogans like morality in terms of absolutes, not relativism into discussions sounds like an agenda, not enhancement of public education.", 
   {}, 
   190522, 
   null, 
   1136745180.0
  ], 
  [
   190613, 
   null, 
   "Bassman", 
   "Those principles of morality are what kept kids from engaging in very destructive behaviors such as premarital sex, drug use, etc. Needless to say, we've gone off topic here.\n \n Back to the issue of school choice, which is why I advocate vouchers. What if a student is stuck in a failing public school system and the parents cannot afford the tens of thousands of dollars for private schooling?", 
   {}, 
   190596, 
   null, 
   1136757000.0
  ], 
  [
   190614, 
   null, 
   "Big_Bear_Scot", 
   "Those principles of morality are what kept kids from engaging in very destructive behaviors such as premarital sex, drug use, etc. Needless to say, we've gone off topic here.\n \n Back to the issue of school choice, which is why I advocate vouchers. What if a student is stuck in a failing public school system and the parents cannot afford the tens of thousands of dollars for private schooling?\n\n \n Increase Taxes to pay for a decent public Schooling System, rather than take money out of that system and give it to private Schools.", 
   {}, 
   190613, 
   null, 
   1136757600.0
  ], 
  [
   190617, 
   null, 
   "Bassman", 
   "Increase Taxes to pay for a decent public Schooling System, rather than take money out of that system and give it to private Schools.\n\n As you know, higher taxes hurt economic growth and development. Look at New York State, and especially Buffalo. We spend more money per capita on students than any other community (except NYC) and we consistently have the lowest acheivement scores. Throwing money at education is typical liberalism at its finest.", 
   {}, 
   190614, 
   null, 
   1136757960.0
  ], 
  [
   190621, 
   null, 
   "daewoo", 
   "Those principles of morality are what kept kids from engaging in very destructive behaviors such as premarital sex, drug use, etc. Needless to say, we've gone off topic here.\n\n \n Bad news. Premarital sex was not at all uncommon prior to the 60's, nor was drug use...and it was absolutly rampant in the 60s and 70s, largely by folks who attended school in the 50s. \n \n for some reason those who long for the past generally have a distorted view of it.\n \n \nBack to the issue of school choice, which is why I advocate vouchers. What if a student is stuck in a failing public school system and the parents cannot afford the tens of thousands of dollars for private schooling?\n\n \n Then be grateful that the taxpayers are generous enough to provide any education at all. Many places they don't.", 
   {}, 
   190613, 
   null, 
   1136760120.0
  ], 
  [
   190623, 
   null, 
   "georged", 
   "\n Back to the issue of school choice, which is why I advocate vouchers. What if a student is stuck in a failing public school system and the parents cannot afford the tens of thousands of dollars for private schooling?\n\n \n This is becoming a broken record. If you can't afford private schooling, why should you have access to it at taxpayer expense?\n \n The public schools system accommodates those students at all levels who are unable, for whatever reason, to afford private schooling. Give me one good reason why taxpayers should bear the expense of two, separate systems. If you don't like the general performance of public schools, start looking at the simple fact many, many students do achieve a successful education in public schools. Did you ever stop to think that parental and student motivation are part of that system and how well it functions? \n \n In this and several other threads your complaints regarding public school systems have been based on your own moralistic values, not academic opportunity. If your personal position on morality is such that only a private school offers that in the form of religious dogma, you'll never accept secular public education as being adequate. Isn't that the real issue to you?", 
   {}, 
   190613, 
   null, 
   1136760240.0
  ], 
  [
   190624, 
   null, 
   "Big_Bear_Scot", 
   "As you know, higher taxes hurt economic growth and development.\n\n \n Do they, look at Sweden and Norway they have some of Highest Taxes in the World. Those Countries have a pretty decent Economic Growth, they also have a decent Public Education System.\n \n And finally I am not a Liberal, I would ask you not to Label me as such.\n \n I might also be speaking from a biased position because I am product of a Public Educational System, where I have never had to pay a penny even when I went onto University.", 
   {}, 
   190617, 
   null, 
   1136760300.0
  ], 
  [
   190627, 
   null, 
   "georged", 
   "\n And finally I am not a Liberal, I would ask you not to Label me as such.\n\n \n Anything in disagreement with the poster's opinion is liberal, including other political systems. If you don't like Bush, government spying on its own citizens or invading non-threatening nations not only is one labeled liberal, but unpatriotic. Advocating civil liberties such as women's rights for abortion and equality for gays will get one labeled liberal, unpatriotic and communist/atheist. Could be an identity problem considering the demand for taxpayers to foot the bill for private schooling.", 
   {}, 
   190624, 
   null, 
   1136761020.0
  ], 
  [
   190628, 
   null, 
   "georged", 
   "As you know, higher taxes hurt economic growth and development. Look at New York State, and especially Buffalo. We spend more money per capita on students than any other community (except NYC) and we consistently have the lowest acheivement scores. Throwing money at education is typical liberalism at its finest.\n\n \n I'm tempted, but I won't.", 
   {}, 
   190617, 
   null, 
   1136761200.0
  ], 
  [
   190631, 
   null, 
   "georged", 
   "\n I might also be speaking from a biased position because I am product of a Public Educational System, where I have never had to pay a penny even when I went onto University.\n\n \n I know many Americans who attended only public schools (US definition) over a period of many decades, including inner-city and rural areas who are as mentally sharp and personally acheived as people I know who attended nothing but private schools.", 
   {}, 
   190624, 
   null, 
   1136761980.0
  ], 
  [
   190632, 
   null, 
   "jitobear", 
   "In the US we do not generally underund education. There are some problems with our system that money does not solve. For one, most education in the US is controlled by local schoolboards. They tend to be loaded with elected folks with an agenda that they firmly believe in, time on their hands, and little or no experience handling money or running an organization.\n \n Bassman is a pretty good example of the kind of person you find on a local school board in the US. Very passionate about his ill defined ideals and very excited about plans that, on review, do not make any sense at all and are dirven by tidbits of inaccurate information.\n \n How good an education do you think that your kids would get if it was controlled by a board full of bassmans? Do you really think it would matter how much money you threw at it?\n\n \n Mark this day on your calendar. I usually don't agree with you.\n \n Schools should be adequately funded, run by people who have a clue about management and education, staffed by good teachers - but in the end, the main thing that makes education work - is the dedicated mind of the student and the involvement of his or her parents.", 
   {}, 
   190614, 
   null, 
   1136764260.0
  ], 
  [
   190637, 
   null, 
   "daewoo", 
   "Mark this day on your calendar. I usually don't agree with you.\n \n Schools should be adequately funded, run by people who have a clue about management and education, staffed by good teachers - but in the end, the main thing that makes education work - is the dedicated mind of the student and the involvement of his or her parents.\n\n \n To me, this one is the biggie. I have seen a lot of parents complain about the school system, and when you ask them what was on their kids last report card, or what they are working on in a specific class, they are clueless. Often they do not even know what classes their kids are taking!\n \n A huge number of kids pass though our educational system each year, the vast majority of them sucessfully. Our college system is such that if you manage to either graduate from high school, or obtain a GED, you are virtually assured a chance to go to a degree mill. If you do not make it through high school and a degree mill, but others in your class did, I don't think the problem is the school. \n \n This is beside the point in this case, though, because what bassman wants is not an education for his kids. He wants somebody to raise his kids for him. It is the typical American rush away from personal responsibility. He does not want to teach his kids morals, or he believes he lacks the ability to do so effectively, so he wants the schools to do it. He doubts his ability to properly indoctorinate his kids to the mythical belief system that he values, so he wants the schools to ensure that they are properly brainwashed.", 
   {}, 
   190632, 
   null, 
   1136766900.0
  ], 
  [
   190681, 
   null, 
   "Matthew S", 
   "Morality is only part of the equation. Before the 1960's schools not only taught academics, but also taught morality in terms of absolutes, not relativism. And the children of that time did much better than today.\n\n \n \n Apearantly someone has never seen westside story or greese. Gangs, violence, and cigerettes. One could say that these are only stories but they do reflect life in the 50's. In both cases the adults are treated as comedic figures. The 50's are gone and will never come again the sooner people realize this and let the myth die a better world we will have.", 
   {}, 
   190522, 
   null, 
   1136774400.0
  ], 
  [
   190779, 
   null, 
   "Bassman", 
   "This is beside the point in this case, though, because what bassman wants is not an education for his kids. He wants somebody to raise his kids for him. It is the typical American rush away from personal responsibility. He does not want to teach his kids morals, or he believes he lacks the ability to do so effectively, so he wants the schools to do it. He doubts his ability to properly indoctorinate his kids to the mythical belief system that he values, so he wants the schools to ensure that they are properly brainwashed.\n\n I have no problem teaching my daughter morality and right and wrong. My problem is with the environment for which my daughter would be subjected to. Will she be harassed and intimidated for her faith? Or will she succumb to negative peer pressure and engage in destructive behaviors? Or will she be in an environment that will aid in the nurture and cultivation of those core values?\n (Note I said aid)", 
   {}, 
   190637, 
   null, 
   1136792640.0
  ], 
  [
   190787, 
   null, 
   "daewoo", 
   "I have no problem teaching my daughter morality and right and wrong. My problem is with the environment for which my daughter would be subjected to. Will she be harassed and intimidated for her faith? Or will she succumb to negative peer pressure and engage in destructive behaviors? Or will she be in an environment that will aid in the nurture and cultivation of those core values?\n (Note I said aid)\n\n \n She will probably be in an environment similar to what she can expect to see for the rest of her life. If she succumbs to negative peer pressure and engages is destructive behavior, you have failed as a parent. It is YOUR responsibility to raise your kids. Not mine, not the schools, not the governments. The schools job is to teach her facts and enoguh basic social skills to get her through life effectively. Some of those, like keeping your mouth shut about your mythical belief system when it is appropriate to do so, you may not like. Unfortunatly it is part of life and getting along in our society, so it is worth learning.", 
   {}, 
   190779, 
   null, 
   1136794560.0
  ], 
  [
   190788, 
   null, 
   "Bassman", 
   "\"Facts\" like homosexuality is OK, Darwinian evolution is gospel truth? Outcome-based \"education\"? This is what the public screwls teach today.", 
   {}, 
   190787, 
   null, 
   1136795040.0
  ], 
  [
   190789, 
   null, 
   "daewoo", 
   "\"Facts\" like homosexuality is OK, Darwinian evolution is gospel truth? Outcome-based \"education\"? This is what the public screwls teach today.\n\n \n If you want to turn her into an ignorant homophobe, why not just educate her at home? Even the local catholic school has backed off of the \"homosexuals are going to burn in hell\" garbage, and they teach evolution. Pretty much ALL private schools teach evolution because regardless of ownership or faith, those kids still have to pass state standardized tests, and those test do not include \"god did it\" as an option in their biology section.", 
   {}, 
   190788, 
   null, 
   1136796060.0
  ], 
  [
   190792, 
   null, 
   "Matthew S", 
   "\"Facts\" like homosexuality is OK, Darwinian evolution is gospel truth? Outcome-based \"education\"? This is what the public screwls teach today.\n\n \n \n And this is some how wrong? Sounds very good to me.", 
   {}, 
   190788, 
   null, 
   1136802540.0
  ], 
  [
   190798, 
   null, 
   "Big_Bear_Scot", 
   "It sounds like Bassman wants some sort of redistribution of wealth where the Tax Payers pay for private Schooling of the less well off. \n \n I am all for redistribution of Wealth but I don't like to see the money that is redistributed leave the public sector and go into the private sector.", 
   {}, 
   190792, 
   null, 
   1136809500.0
  ], 
  [
   190823, 
   null, 
   "georged", 
   "It sounds like Bassman wants some sort of redistribution of wealth where the Tax Payers pay for private Schooling of the less well off. \n \n\n \n US public schools are already funded by redistribution of wealth. Bassman's problem is a desire to have the public also pay for educating his children using his mythical belief system moral parameters because he knows that's not going to happen in secular public schools. With a parental instilled hatred of any education not based on those parameters, children will have a tough time gaining a decent education in any school. Even private schools are held to scholastic standards. Not to mention overcoming deeply implanted social barriers. Home schooling is his best option, with professional tutoring to pass the GED. Children educated within such a narrow band of 'acceptable' subjects learned by rote will then face hardships in adapting to higher education where use of their minds is required and encouraged as is social interaction. Almost a textbook plan for rebellion.", 
   {}, 
   190798, 
   null, 
   1136825400.0
  ], 
  [
   190837, 
   null, 
   "daewoo", 
   "US public schools are already funded by redistribution of wealth. Bassman's problem is a desire to have the public also pay for educating his children using his mythical belief system moral parameters because he knows that's not going to happen in secular public schools. With a parental instilled hatred of any education not based on those parameters, children will have a tough time gaining a decent education in any school. Even private schools are held to scholastic standards. Not to mention overcoming deeply implanted social barriers. Home schooling is his best option, with professional tutoring to pass the GED. Children educated within such a narrow band of 'acceptable' subjects learned by rote will then face hardships in adapting to higher education where use of their minds is required and encouraged as is social interaction. Almost a textbook plan for rebellion.\n\n \n \n I think it is highly irresponsible of you to suggest that Bassman should homeschool his children. \n \n I can't say much more on that subject without risking at least a warning from the admin.", 
   {}, 
   190823, 
   null, 
   1136829480.0
  ], 
  [
   190844, 
   null, 
   "Adept", 
   "I think it is highly irresponsible of you to suggest that Bassman should homeschool his children.\n\n \n Quoted for emphasis.", 
   {}, 
   190837, 
   null, 
   1136830380.0
  ], 
  [
   190847, 
   null, 
   "Wez", 
   "Bassman: Why should the taxpayer pay for vouchers for your daughter? They already pay for the state system, which while not great, is used by millions of others.\n \n The idea of private schools being superior in terms of anything other than results amuses me. I don't see private schools kids being better in any way than normal kids. Drugs, bullying etc. are all still there.\n \n daewoo: In England, to get round the problem of religious objections to evolution, questions about evolution are often phrased as \"The evolutionary theory states... what?\" rather than \"How did xxx come about\".\n \n -Wez", 
   {}, 
   190788, 
   null, 
   1136831460.0
  ], 
  [
   190850, 
   null, 
   "georged", 
   "I think it is highly irresponsible of you to suggest that Bassman should homeschool his children. \n \n I can't say much more on that subject without risking at least a warning from the admin.\n\n \n He has clearly and repeatedly stated his contempt for public school, higher education and society in general based solely on his definition of morality. I posted on the unsuitability of injecting blatant hatred into a child's education, but under those parameters home schooling is his only option. The challenge will be totally isolating a child from society including media who is educated under those circumstances or risking full rebellion in pre or early teen years.", 
   {}, 
   190837, 
   null, 
   1136832420.0
  ], 
  [
   190865, 
   null, 
   "daewoo", 
   "daewoo: In England, to get round the problem of religious objections to evolution, questions about evolution are often phrased as \"The evolutionary theory states... what?\" rather than \"How did xxx come about\".\n \n -Wez\n\n \n \n In the US, the creationist would probably be happy with that. Most have given up on the idea of actually having creationism taught in the classroom.\n \n The anti-creationists on the other hand would throw an absolute hissy fit about it. \n \n The entire creation/evolution debate in the US is essentially 2 groups of adult behaving like children. They are more interested in scoring cheap points than anything else.", 
   {}, 
   190847, 
   null, 
   1136836560.0
  ], 
  [
   190887, 
   null, 
   "jitobear", 
   "\"Facts\" like homosexuality is OK, Darwinian evolution is gospel truth? Outcome-based \"education\"? This is what the public screwls teach today.\n\n \n Evolution is science and will be taught with science curriculem. You may not agree with it, but it is science and the appropriate subject matter. If you think it's wrong - open up your yap and tell her so. That is what will happen in my house if creationism or ID ends up in my son's science classes. He is also aware of this marvelous place called a LIBRARY - where he can access other ideas.\n \n I have yet to see the \"homosexuality is OK' class. She might have to come to terms that homosexuals exist. Some of her classmates may have them in their families - or when high school comes around - may even BE gay.\n \n Send your daughter to school Bassman. Some day she will have to deal with the fact that not everyone looks like her, thinks like her, or believes what she does. You don't have to agree with a thing to know it, and knowledge makes you stronger.", 
   {}, 
   190788, 
   null, 
   1136841060.0
  ], 
  [
   190976, 
   null, 
   "Bassman", 
   "I understand where you're coming from, Jito. I've been reevaluating my position and look at it this way. If my daughter's morals are firmly rooted on the Word as her foundation, then the moral problems will be much easier to handle.", 
   {}, 
   190887, 
   null, 
   1136858460.0
  ], 
  [
   190991, 
   null, 
   "daewoo", 
   "I understand where you're coming from, Jito. I've been reevaluating my position and look at it this way. If my daughter's morals are firmly rooted on the Word as her foundation, then the moral problems will be much easier to handle.\n\n \n Like Catholic school girls. I knew some catholic school girls in high school that were just the picture of morality grounded in the word. Fun dates. They always kind of went like this:\n \n :) :xcensored :xcensored :xcensored :) emoticon_xgood \n \n Remember that the harder you shove things down your kids throats, the harder they are going to rebel against them when they start testing their wings. \n \n Moderation as far as shoving dicipline and morals down their throats is probably a good thing. Trust me, you don't want to know what came between :) and emoticon_xgood", 
   {}, 
   190976, 
   null, 
   1136860680.0
  ], 
  [
   191022, 
   null, 
   "Bassman", 
   "LOL!!\n \n ANYWAYS!!!\n \n By the same token, I'm encouraged by the SCOTUS decisions that allow STUDENT LED Bible studies on campus.", 
   {}, 
   190991, 
   null, 
   1136865300.0
  ], 
  [
   191023, 
   null, 
   "georged", 
   "LOL!!\n \n ANYWAYS!!!\n \n By the same token, I'm encouraged by the SCOTUS decisions that allow STUDENT LED Bible studies on campus.\n\n \n Smoking dope is also popular on campus, as is sex, booze, exotic foods and intense discussions on every subject known and imagined. What's your point?", 
   {}, 
   191022, 
   null, 
   1136866260.0
  ], 
  [
   191027, 
   null, 
   "Bassman", 
   "Smoking dope is also popular on campus, as is sex, booze, exotic foods and intense discussions on every subject known and imagined. What's your point?\n\n The point is that it's a step towards giving students a positive influence that will affect their lives tremendously.", 
   {}, 
   191023, 
   null, 
   1136866680.0
  ], 
  [
   191106, 
   null, 
   "georged", 
   "The point is that it's a step towards giving students a positive influence that will affect their lives tremendously.\n\n \n That's obviously a personal opinion and has little relation to school vouchers.", 
   {}, 
   191027, 
   null, 
   1136913240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  School Vouchers Eliminated in Florida", 
  "url": "http://www.4forums.com/political/education-debates/7255-school-vouchers-eliminated-florida.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 7255, 
  "discussion_files": [
   [
    "27098.html", 
    "http://www.4forums.com/political/education-debates/7255-school-vouchers-eliminated-florida-print.html"
   ], 
   [
    "27099.html", 
    "http://www.4forums.com/political/education-debates/7255-school-vouchers-eliminated-florida-5-print.html"
   ], 
   [
    "27100.html", 
    "http://www.4forums.com/political/education-debates/7255-school-vouchers-eliminated-florida-4-print.html"
   ], 
   [
    "27101.html", 
    "http://www.4forums.com/political/education-debates/7255-school-vouchers-eliminated-florida-3-print.html"
   ], 
   [
    "27102.html", 
    "http://www.4forums.com/political/education-debates/7255-school-vouchers-eliminated-florida-2-print.html"
   ]
  ], 
  "identifier": 7255
 }
]