[
 [
  [
   190615, 
   null, 
   "simone", 
   "From the NYTimes:\n \n EDITORIAL DESK \n Paradise Found, Limbo Lost \n By HAROLD BLOOM (NYT)\n Published: January 1, 2006\n I feel both personal and literary regrets that, if Pope Benedict XVI gets his way, in perhaps a year or so Limbo will be in limbo (as it were). The issue spurs a reminiscence. Walking down Broadway on a chilly Upper West Side morning in 1972, I bumped into my good acquaintance, the novelist Anthony Burgess, and at his request I resigned to him the bottle of Fundador I had just purchased at a nearby liquor store. Standing in a tattered robe and blinking in the sun, after a night devoted to composition, Burgess required immediate medication. \n Besides, he had introduced me to this invigorating Spanish brandy only a few weeks before, so I urged him to retain the bottle after he had absorbed two prodigious swigs outdoors. As I wended back to the liquor shop, he called out after me: ''The debt shall be paid, Bloom! When you arrive in Limbo, I will await you there with a bottle of Fundador.'' \n \n \n A lapsed Roman Catholic (like his idol, James Joyce), Burgess was being unduly optimistic about our reunion on the Other Shore, since neither of us qualified for Limbo, a state that the church, largely at the prodding of Thomas Aquinas, designated for unbaptized babies and the Hebrew patriarchs who preceded Jesus. \n \n Dante, of course, in Canto IV of ''The Inferno,'' went beyond Aquinas, and thronged Limbo with the philosophers and poets of the ancient world; primarily his beloved guide, Virgil, but also Homer, Horace, Ovid and others, and even literary characters like Hector and Aeneas. Rather surprisingly, Dante also admitted three Muslims: the warrior Saladin and the philosophers Avicenna and Averroes. \n \n Limbo has a rich literary history, in honor of which I hope the pope and his International Theological Commission will refrain from exiling this amiably ambiguous realm. Hell, Purgatory and Heaven may seem rather strictly demarcated and limited destinations, without Limbo as an interesting outrider. In the Italian Renaissance poet Luduvico Ariosto's ''Orlando Furioso,'' the knight Astolfo visits the moon's Limbo and discovers there all of earth's wastages: talents locked up in named vases, bribes hanging on gold hooks, and much besides. \n \n In ''Henry VIII,'' Shakespeare uses the ''Limbo of the Fathers'' as a synonym for prison, while John Milton in ''Paradise Lost'' gives us the Paradise of Fools as a ''limbo large and broad,'' where winds blow about Roman Catholic cowls, hoods, habits, relics, beads, indulgences, pardons and Papal Bulls. \n \n The 18th-century satirical poet Alexander Pope expands on Ariosto and Milton in ''The Rape of the Lock,'' where the lunar Limbo contains ''the smiles of harlots and the tears of heirs.'' Much more somber is the ''Limbo'' of the Romantic poet Samuel Taylor Coleridge, most famous for ''The Rime of the Ancient Mariner'' and ''Kubla Khan.'' Coleridge's Limbo is not on the moon, nor on Hell's borders, but on the phantasmagoric line between what is and what is not, the waking nightmares of an opium addict: ''The sole true Something -- This! In Limbo's Den/It frightens Ghosts, as here Ghosts frighten men.'' \n \n The Vatican's motives for changing its theology doubtless are benign: worried African and Asian converts whose babies die before baptism will be reassured that Paradise, not Limbo, awaits the lost infants. And in any case, non-Catholics like myself need not mix in matters relevant only to the faithful. Still, a few days ago I received an anonymous phone call from a woman who assured me that my most recent book certainly would send me to Hell. I would prefer Limbo, if only to share Fundador again with Anthony Burgess.", 
   {
    "post_info": {
     "post_title": "Limbo in Limbo"
    }
   }, 
   null, 
   null, 
   1136757720.0
  ], 
  [
   190616, 
   null, 
   "simone", 
   "January 7, 2006\n Limbo Serves a Purpose \n To the Editor:\n \n Not included in Harold Bloom's reflections on limbo's fall from grace in Roman Catholic doctrine (Op-Ed, Jan. 1) was an appreciation of how limbo solved an important problem for church theologians: the fate of souls not absolved of original sin through baptism.\n \n Lacking that absolution, such souls could not be granted the same final destiny of souls freed from the shared inherited guilt of original sin. Limbo gave them a blissful destination, lacking only the sight of God.\n \n In dropping the concept of limbo, do the church authorities no longer consider the problem important? Is the doctrine of original sin to be cast aside as well? \n \n What is most curious about limbo is that with our new knowledge of human reproduction, it becomes the most populous of the four realms of heaven, hell, purgatory and limbo. This follows from the doctrine that the soul begins at conception and that a majority of fertilized human eggs never produce a pregnancy.\n \n Thus, the typical soul in the afterlife never acquired consciousness, never walked the earth, was never known by another soul and passed to the afterlife without a name. \n \n Charles Sawyer -- Boxford, Mass., Jan. 1, 2006", 
   {
    "post_info": {
     "post_title": "A NYTimes Reader Responds to Bloom"
    }
   }, 
   190615, 
   null, 
   1136757900.0
  ], 
  [
   190800, 
   null, 
   "Alan Ryan", 
   "\n \n What is most curious about limbo is that with our new knowledge of human reproduction, it becomes the most populous of the four realms of heaven, hell, purgatory and limbo. This follows from the doctrine that the soul begins at conception and that a majority of fertilized human eggs never produce a pregnancy.\n \n Thus, the typical soul in the afterlife never acquired consciousness, never walked the earth, was never known by another soul and passed to the afterlife without a name. \n \n Charles Sawyer -- Boxford, Mass., Jan. 1, 2006\n\n \n The observations in these couple of paragraphs dissolve the concept of limbo into vacuous nonsense. Though, to be absolutely impartial, a belief in limbo does not appear to be among the essential doctrines of Catholicism. In other words, a fundamental doctrine to which one is obliged to assent in order to remain within the Catholic church.\n \n After his death on the cross, Jesus is supposed to have \"harrowed hell\" - or at least the fringes of it (limbo means \"on the border\") - to rescue the souls of the \"righteous\" who had expired before the New Deal inaugurated by God through the sacrifice of Calvary.", 
   {}, 
   190616, 
   null, 
   1136809860.0
  ], 
  [
   190838, 
   null, 
   "billsco", 
   "It appears that in the great train ride of life, an audit of the station Limbo was conducted and the finding was that not enough revenue was generated there to justify keeping it open. \n \n It was also noted that the Muslim Express was carrying infants non-stop to heaven and thus a huge PR problem was present. \n \n All in all, a good call by the railroad magnate. Two birds have been stoned.", 
   {}, 
   190800, 
   null, 
   1136829780.0
  ], 
  [
   196646, 
   null, 
   "maximus", 
   "January 7, 2006\n Limbo Serves a Purpose \n To the Editor:\n \n Not included in Harold Bloom's reflections on limbo's fall from grace in Roman Catholic doctrine (Op-Ed, Jan. 1) was an appreciation of how limbo solved an important problem for church theologians: the fate of souls not absolved of original sin through baptism.\n \n Lacking that absolution, such souls could not be granted the same final destiny of souls freed from the shared inherited guilt of original sin. Limbo gave them a blissful destination, lacking only the sight of God.\n \n In dropping the concept of limbo, do the church authorities no longer consider the problem important? Is the doctrine of original sin to be cast aside as well? \n \n What is most curious about limbo is that with our new knowledge of human reproduction, it becomes the most populous of the four realms of heaven, hell, purgatory and limbo. This follows from the doctrine that the soul begins at conception and that a majority of fertilized human eggs never produce a pregnancy.\n \n Thus, the typical soul in the afterlife never acquired consciousness, never walked the earth, was never known by another soul and passed to the afterlife without a name. \n \n Charles Sawyer -- Boxford, Mass., Jan. 1, 2006\n\n Another knee-jerk reaction to one incomplete and pending story from the Vatican.\n \n I have the feeling that the Catholic Church would catch a lot of heat (pun intended) if it put forth that all souls not baptized went to hell. But it does the charitable thing in keeping with the 2 Peter 3:9 and puts forth a theological assertion (not dogma) that there may be another possibility. Then it is chastised for it. Damned if you do and damned if you don't (yes, pun intended).\n \n And it may very well be that limbo is the most inhabited of the realms. But Jesus will one day make all things new. It is not beyond the mercy of God to reconcile an immensely populated limbo. And God knows them all by name.", 
   {}, 
   190616, 
   null, 
   1139041020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Limbo in Limbo", 
  "url": "http://www.4forums.com/political/religion-debates/7269-limbo-limbo.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7269, 
  "discussion_files": [
   [
    "18861.html", 
    "http://www.4forums.com/political/religion-debates/7269-limbo-limbo-print.html"
   ]
  ], 
  "identifier": 7269
 }
]