[
 [
  [
   191093, 
   null, 
   "Neron", 
   "That recent Russian-Ukrainian dispute over gas supplies made me really uneasy. First Ukraine claimed it had the right to \"take both fuel and money\" for gas transit. Then wily Ukrainians prompted they could \"divert\" some of the gas passing through their territories in case of the temperatures failed further. Ukrainian officials were playing words and didn't bother about failing temperatures in gas recipient countries in Europe. Sure this scornful attitude damaged their image in Europe greatly.\n \n Whatever the words, this was THEFT of the gas destined for Europe!! \n \n And Yuschenko couldn't hide the fact. Actually he was once and forever downgraded from promising European political heavy weight into petty thief! I guess it's a real political disaster for Yuschenko. Some experts say Yuschenko had the money to pay for gas but preferred to save it to win in the elections. If so, that was a big political gaffe on his part. Now I don't even exclude the possibility of his resignation or impeachment or anything of the kind. \n In any case he's not the man in the Ukraine Europeans can fully rely upon. Frankly, I've always suspected him playing into American hand rather than that of Europe. Could it be different for Yuschenko having an American as a wife? So this disgusting gas story was actually an eye opening one for us, which is no bad at all. At least now we know \"who is who\".", 
   {
    "post_info": {
     "post_title": "Petty Theft"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1136910300.0
  ], 
  [
   191193, 
   null, 
   "Alan Ryan", 
   "\n In any case he's not the man in the Ukraine Europeans can fully rely upon. Frankly, I've always suspected him playing into American hand rather than that of Europe. Could it be different for Yuschenko having an American as a wife? So this disgusting gas story was actually an eye opening one for us, which is no bad at all. At least now we know \"who is who\".\n\n Who are the \"we\", and who is the \"who\"?", 
   {
    "unicode_changes_made": true
   }, 
   191093, 
   null, 
   1136927040.0
  ], 
  [
   191199, 
   null, 
   "Iuris", 
   "The we is probably the spambot together with the guy that programs it and sets it loose.\n \n As for the who, he's insinuating the whole mess was started at the behest of the USA to drive a wedge between the EU and the \"young Europe\".\n \n The only bot I can think of that's more annoying than this one is the vritems.com bot that spams on diablo's battle.net realms, and thats because he can get you killed...", 
   {}, 
   191193, 
   null, 
   1136927520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Petty Theft", 
  "url": "http://www.4forums.com/political/european-politics-economics/7283-petty-theft.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 7283, 
  "discussion_files": [
   [
    "9754.html", 
    "http://www.4forums.com/political/european-politics-economics/7283-petty-theft-print.html"
   ]
  ], 
  "identifier": 7283
 }
]