[
 [
  [
   191404, 
   null, 
   "simone", 
   "http://www.cwluherstory.com/CWLUMemoir/Johnson.html\n \n Part I\n \n Over the years, I have become convinced that patriarchal capitalism is a system women cannot revise any more than we can \"reform\" water so that we might breathe it. As long as the law is male, women must be outlaws. I became an outlaw when I joined \"Jane,\" a group of women in Chicago who, between 1969 and 1973, did more than 11,000 abortions.\n \n Jane, as the Abortion Counseling Service, a work group of the Chicago Women's Liberation Union, has come to be called, began in the mid-1960s when of personal necessity, a couple women friends who lived in the Hyde Park neighborhood of Chicago found a couple men, representing themselves as physicians, who did good, clean abortions. In addition to referring women to decent abortionists, these women were what then was called \"patient advocates\". Patient advocates can be loosely defined as the unintimidated surrogate accompanying the \"patient\" to the \"doctor's\" office for the sole purpose of dislodging information relevant to that \"patient\" from that \"doctor\". That a person has a right to information about oneself did. Not make that information any less difficult to obtain given \"standard medical practice,\" that stone wall behind which was kept what (often little) information was extant. The Service became one of many referral services across the United States referring women who wanted abortions to a person who could be trusted with a speculum, a dilator, and a curette. In the United States' in the 1960s the grounds for obtaining a legally/medically/male-sanctioned abortion were narrowly defined. Capriciously shifting, and rigorously mediated. Then as now, few protested the War Against women, that continuing war of the patriarchy against women, though there are and had been many, I among them, who had seen and had protested the United States' oppression of racial minorities, had seen and had protested US imperialism in Viet Nam.\n \n By 1970 when I joined Jane, which we always called \"The Service,\" I had begun to see that men have power though no right, to colonize women's bodies; that men have power, though no right, to make up laws which effect women and that what I could do about it this time was not again protest through lobbying, convincing, begging, litigating, demonstrating, educating, theorizing, waiting and waiting and waiting to get male intercession or permission. Instead, this time, what I could do was to act outside male law, male control, with women on our behalf. How I expressed this then was by saving that I wanted to \"do something real\".\n \n The history of Jane is not in this essay. My history of me in that group is. We each tend to remember different things and to remember things differently: if collectively uninterpreted, all the stories of all the Janes would form the history/herstory of that group. The purpose of this essay is to offer a distillate of how I remember things, to spin my hit of the web, create my portion of what, if and when taken together, becomes context, becomes a history of Jane, \"history\" not being the monolith we are taught to believe it is.\n \n In 1970 I had returned to Chicago where I was born and had grown up, from Nebraska, where I had taken my undergraduate degree and had also taken to getting married and pregnant. Two marriages, one miscarriage, one self-induced quinine abortion and two children later, I was twenty-three; twenty-three and for some reason convinced I could do anything. My father used to call me \"bullheaded,\" my mother used to pray for me. I know I have always believed in conscience and justice whether expressed in terms of collective action, God, or lawlessness.\n \n (More)", 
   {
    "post_info": {
     "post_title": "Chicago Women's Project"
    }
   }, 
   null, 
   null, 
   1137001380.0
  ], 
  [
   191405, 
   null, 
   "simone", 
   "1970 is the year Robin Morgan's anthology, Sisterhood Is Powerful, came out: its publication doubled the number of feminist books I knew about. I had begun reading deBeauvoir's Second Sex in 1967, in self-defense; my first husband had called me a \"feminist\" while we were arguing. He'd said, \"You know what you are...\" I discovered the word in deBeauvoir and claimed it, feeling better and more myself than ever I had before.\n \n By 1970 I was substitute-teaching in Chicago's public grade schools for work; my second husband was working civil service at the downtown post office. Having fled flimsy middle-income high-rise housing, we'd found a sunny first floor Northside flat on Gordon Terrace, a street which had once been on the lakeshore before the park and the Outer Drive had been set into place on landfill. This apartment was in a grand old Chicago house filled with woodwork and wainscoting, a third floor ballroom and several fireplaces. Eventually, this wonderful apartment, with its front bathroom and huge front bedroom, was one of the houses the Service often used for doing abortions.\n \n In 1970, I saw an announcement in The Chicago Tribune for a National Organization of Women meeting and decided to attend. At this meeting the organizers talked about staging a cocktail party for advertising executives at which it would be our mission to convince these executives that using various female body parts to sell their products was not acceptable practice. Once again, I would be part of asking something of someone in charge: we ourselves were never those someones, and we were in charge of nothing but asking. \"Strategy\" was confined to trying to determine how to ask someone something effectively.\n \n To me, fighting for Women's Rights was not, is not, a matter of asking or of educating the patriarchs--at parties or anywhere else. Appealing to members of the same group who maintain the custom of precluding rights was then, is now, simply a bad idea.\n \n \"Something real\" is how I characterized what I wanted to do. I asked a woman who was standing next to me at the NOW meeting, \"Is there anything real going on in Chicago for women? This cocktail party stuff is ridiculous. I want to do something real\". She chuckled, as I remember it, and asked for my phone number saying she'd call me in a week or two. I thought, sure, right, but then she did call and she invited me to a meeting of women about abortion, \"if you're still interested\". I said that if it were to be about making cocktails while lobbying for abortion rights, I wouldn't be interested. She said it wasn't like that.\n \n It wasn't like that.\n \n The evening in 1970 I attended my first meeting of the Abortion Counseling Service, fifteen or so white and Semitic women were gathered at someone's house. I remember sitting on the floor wondering what exactly was going on. Eventually, I remember it dawning on me; I remember thinking, \"These women are talking about DOING abortions\". I hoped that what I surmised was correct, that, indeed, no one in this group would ask me to write to congress, to lobby, to convince anyone of anything, or to wait; maybe I was going to be able to do something real. Doing abortions with the Service has always felt that way to me: real. It is the best work I ever did.\n \n (More)", 
   {}, 
   191404, 
   null, 
   1137001500.0
  ], 
  [
   191407, 
   null, 
   "simone", 
   "Virtually every woman, heterosexual and lesbian, contemplates the possibility (or understands the importance) of abortion. At the beginning of the Service, the Hyde Park women would schedule abortions with the abortionists one day per week. Always, more women need abortions than can find ways to have abortions, so, at some point between 1967-l97O, the women and the one (sometimes two) abortionist(s) began working two days per week. Even at $4OO-5OO per abortion (every cent of which the man kept) these good, illegal abortions became the abortions of choice in Chicago.\n \n Eventually and so that the man who wore a white coat and called himself a doctor could concentrate on the \"medical\"/ medicalized/\"technical\"/\"important\" aspects of abortion, and could, therefore, do more abortions per workday, the women began \"assisting\". \"Assisting\" was, at first, finding and equipping a workspace: then, gradually, it became that and giving the pre-abortion injection (of the antibiotic) tetracycline; then it became placing the speculum; then finding, holding onto (with a tenaculum), and swabbing the cervix (with the antiseptic Betadyne). Cleaning the blood off the women having abortions and off the bed on which the abortions were done was an early and constant part of assisting. When what the \"doctor\" had to do was walk into a room in which lay a calm, well-informed woman who wanted an abortion, what he would do would be to anaesthetize the cervix (with xylocaine), dilate the cervix/os curette the uterus, and then walk on to the next similar situation; his time spent per woman dropped and he was consequently convinced to reduce his charge to $275 per abortion (every cent of which he himself kept).\n \n Besides assisting, however, what the women came to learn was that the abortionist was not a doctor. Without that mystique of \"doctorness\" abortion became what it is (and what most other forms of \"medicine\"/healing actually are a series of things to do carefully, most of which the women were already doing. The simple deduction was profound; if he can do abortions, we can do abortions.\n \n From 1971,when the women began doing most of the abortions and sometimes hiring male abortionists to work with them/us, the charge per abortion became $100, or what the woman determined she could afford. The average amount paid was about $40 per abortion, with everyone having an abortion paying something. By the Spring of 1973, when Jane mostly folded (after the January 1973 Roe v. Wade US Supreme Court decision and the appearance of the first \"legal\" abortion clinics in Chicago), we worked 3 days per week doing 25-30 abortions per day--about 80 per week.\n \n From the money we charged for abortions, we deducted our supplies, phone and laundry bills. When Jane women were doing most of the abortions, we decided to pay (by the day) the women abortionists (abortionists who held the instruments--mostly, all of us in Jane thought of ourselves as abortionists) and the Jane who organized the phone messages onto 3x5 cards.\n \n From my talk with other former Janes over the years, I know now there was debate over these pay decisions then, but I don't recall that. Some women remember bitter arguments over a possible loss of altruism should any of us pay ourselves for our work; some women remember arguing about \"volunteerism\" and not seeming to value our own work if we didn't pay ourselves; some women argued about creating an hierarchical pay scale--and how could we avoid it and who should be paid...\n \n (More)", 
   {}, 
   191405, 
   null, 
   1137001560.0
  ], 
  [
   191408, 
   null, 
   "simone", 
   "It is an amazing part of this for me what each Jane remembers, what remains vivid for each of us. I tend to remember procedure and not Service politics; I still remember the feel of a speculum in my hand but I do not remember who liked whom and why, who said what and why. For some of us, the Service was all-consuming; for others of us it was, as it was for me, absolutely naturally integrated into my sense of living a life I believed in. I was comfortable with all I was doing; was neither wary, suspicious, nor paranoid as others since have said they were then. I remember telling my parents matter-of-factly that should I be arrested, I would like them to take care of my kids I didn't ask their approval or their opinion. They took it as matter-of-factly as I told them; my kids grew up knowing, this fact of my life incorporated along with many other facts Others are still wary of talking about Jane or aspects of how it was for them in Jane. For me, it is the best work I ever did.\n \n Part II\n How the Service worked was like this: a woman who had found the Jane phone number would call and get our answering machine. Our message said, in those days when answering machines were rare:\n \n Hello, this is Jane from Women's Liberation. Leave your name and number and speak slowly and clearly. Someone will return your call. If you do not hear from us in two or three days, call us back.\n \n Women found our phone number in a variety of ways--from underground/movement papers and bulletin boards in universities and Laundromats; from a friend, physician, clergy, or cop. Women got our phone number from the mother of a friend or from her own mother, oncologist, co-worker, pusher, social worker, or father. Illegal and legal, out of state and in, overt and covert sources passed along our phone number to women.\n \n Remember that fewer than a hundred or so years ago women had not yet been culturally organized/trained to go to men for any such thing as to have an abortion. Before \"professionalization\" and \"medicalization\" (predicated on institutionalized male power) women's bodies were literally in the hands of other women: physicians were little more than grave robbers, dentists with an attitude, barbers with extra straight razors/scalpels, and ghouls.\n \n In the early 1970s, there were phone numbers other than ours floating around: phone numbers good for a day or two, a week, maybe a year or two: phone numbers connecting women to masked quacks in Chicago, docs on the take in Detroit, guys working themselves through bartending or medical school or out the back of a van in California, St. Louis, and Weehawken. Phone numbers connected women to opportunists in Florida and to fly-by-nighters in Queens, and here and there was a phone number of a reliable someone working alone or in sync with conscience. With most of the abortionist-profiteers, women would find themselves blindfolded, blindsided, picked up on corners, bound to secrecy or to a kitchen table or motel coffee table. Often, others would do abortions too quickly and without anesthesia, compassion, the exchange of names, or so much as a hello, women finding themselves dumped back at some train station or onto a remote street corner without follow-up, friends, recourse, or information, and out several hundred dollars whether the abortion was complete or not, antiseptic or not, successful or not.\n \n But, when they found the Jane number, the Service number, our number, women found something neither entrepreneurial nor impersonal, neither medicalized nor professionalized. When women found the Jane number, they found other women working together with, for, because of, and among women, however ancient and unique that seemed in 1.970, or now.\n \n (More)", 
   {}, 
   191407, 
   null, 
   1137001680.0
  ], 
  [
   191409, 
   null, 
   "simone", 
   "Several times a day, whomever was \"Janeing\" took messages from the tape, writing the information onto 3x9 cards she'd then take to our weekly meetings, the business of which, primarily, was to disperse the cards among the dozen or twenty women working any given week. We chose cards idiosyncratically, noting some similarity or difference in circumstance, neighborhood, ethnicity, or blood factor between ourselves and the name of the woman on the 3x5 card.\n \n Calling back the phone numbers of the women on the cards, we'd find out that some of the women had already gotten an abortion elsewhere, some had gotten their period, some had given birth, kept it or given it up, and didn't want or need to speak with us. Some women had died. Some women were bleeding or had tubes or gauze or rags stuffed into their uterus; they needed advice, referral to a physician who wouldn't injure them further or turn them in, or advice on what they could do for themselves just then. Some phone numbers had been incorrectly given or received. Some women couldn't talk then but could they call us back some midnight from untraceable pay phone to untraceable pay phone. Often, a boyfriend or father called trying to arrange things for or in spite of the woman whose name, along with his number, he'd left on the Jane tape. However, most often, the woman whose name I had on the 3x5 card talked to me herself and was eager to meet so that I could describe and we could discuss the abortion she'd called to initiate.\n \n I preferred to meet with women one to one, though other Service women preferred to meet with women in groups. I usually invited the woman to my house evenings after I'd put my kids to bed, suggesting she bring a friend along, if she'd like. Ordinarily I would have made tea for us and had some cookies out on a plate: we'd sit around my dining room table or in the livingroom, maybe in front of a fire, and we'd talk. On the 3x5 cards, I'd write down what she told me about her menstrual history, any children, pregnancies, allergies, or difficulties she had, and information about any medication she took regularly.\n \n I'd tell the woman what a dilation and curettage (D&C) abortion was like. The choice to have an abortion was hers until the opening of the cervix to the uterus, was dilated; after dilation, emptying the uterus became inevitable. In those days, I saw little mind-changing; women had their decision firmly made, usually, and were eager to get on with the abortion. Frequently, they hoped I might do it then and there; women were unaccustomed to being told anything much about what was to be done to us--often the woman's attitude was, \"don't tell me any(more)thing, just get on with it\". But we insisted that SHE KNOW; that the abortion was something we were going to be doing together, that this was her decision and she could, should, and must know all about it.\n \n I would illustrate what I was saying by showing the woman diagrams/drawings from the newsprint edition then available of the Boston Women's Health Collective's Our Bodies, Ourselves; we had this edition by the cartons full and would give them to interested women. I would show the woman a plastic version of a metal speculum, and I would talk to her about how it held open the vaginal walls allowing us, and her with a mirror if she chose, to see the cervix and the os. Often, the example-speculurn I had lying around the house had eyes and mouths painted on them; the kids clacked them about as toy puppet ducks opening and closing the \"beaks\" to make them appear to speak.\n \n The first time I saw a cervix was the first day I assisted; the woman on the bed could see, too, using a mirror. I knew the cervix to be the tapered neck of the uterus which extends down into the upper vagina, the os at the bottom of it being the opening through which sperm enters the uterus and which, in full term labor, opens to about ten centimeters. A pregnant uterus is engorged, purpled, as it is just before a period. \n \n But knowing is not the same as seeing. Seeing, I remember thinking how beautiful the cervix is and how it looks like a glistening pink doughnut. I felt happy and fascinated. Seeing her cervix, I knew that this woman was not pregnant; it was instinctual, inherent knowledge, a body reading the semiotics of a body. A pregnancy test had been incorrect, which had caused this women to find us. For the woman on the bed, her believing our reading her as not pregnant did not have to be an act of faith; it was, instead, a matter of corporeal epiphany.\n \n (More)", 
   {
    "unicode_changes_made": true
   }, 
   191408, 
   null, 
   1137001800.0
  ], 
  [
   191410, 
   null, 
   "simone", 
   "Towards the close of my one-to-one meetings with the women who wanted abortions, I would write down the date, time, and address of her appointment; I'd write down my phone number, too, in case she had questions or problems after her abortion. I said I wouldn't call her unless the Pap test we'd do prior to the abortion was inconclusive or abnormal.\n \n The address I'd write down would get her to the \"Front,\" the apartment at which she (and a friend, if she chose) would wait before and to which she'd return after the abortion. Another one of the Service women, another Jane, would drive her and a group of other women wanting abortions, room the Front to the second apartment, the \"Place,\" where she would have the abortion. Only Jane women and women having abortions would be at the Place.\n \n Jane women would be at the Front to talk with and counsel with the women wanting abortions, and to keep the bowls full of Triscuit, the apricot nectar flowing; we always brought food and drink for the women come for abortions, and for their friends, as we brought nourishment and treats for any of the rest of us when we got together any other time. Often, the second group of women waiting for abortions sat quietly until midmorning when the first careful of women returned. Women returned happy: things went well; they were relieved; they were no longer pregnant; they had put their own decision into effect by finding other competent, caring, and determined women.\n \n Both the Front and the Place were someone's apartment or house. We would volunteer our apartments or houses as we could. Our lives were in evidence in the photos and books on our shelves, the Melmac, teddy bears, or vibrator overlooked in a dining room or bedroom; the glass beads in the doorway, Joplin poster on the wall; in the sheets on our beds on which the abortions were done. The Service used some of the money collected from doing abortions to pay for the Places' laundry to be done professionally; I and many of the rest of the Janes used our best sheets on days our homes were being used as the Place.\n \n At the Place we checked the information on the 3x9 cards again with the women whose information it was. Whenever we were asked if we were doctors, we said, \"NO. We are not doctors. We are abortionists\". None of the women who did those 11,000 abortions had been medically schooled.\n \n We women in Jane learned how to do abortions from one another, as peer-apprentices, though no one called it that. Our home-done abortions had a lower infection rate (about 2%) than do most hospital surgeries. We killed no one, a fact which contrasts with what happened when legislators legalized abortion allowing physicians who had not necessarily ever been trained to do abortions, to do abortions. Quite simply, women died from legal abortions because the law granted authority (to physicians) without regard to proficiency. Similarly, those without license are not granted legal authority to do abortions, without regard to proficiency, the test for what is \"legal\" having to do with power and who has (granted themselves) the right to wield it. I have always been amazed at how relatively simple the physical process of performing abortions is, how readily it is learned; what keeps most of us away from that realization is that closed guild which is organized medicine. \n \n (More)", 
   {}, 
   191409, 
   null, 
   1137001860.0
  ], 
  [
   191412, 
   null, 
   "simone", 
   "Part III\n I remember that the physical procedure to abort the pregnancy began with giving the pregnant woman an intramuscular injection of tetracycline (in the buttocks). A week's supply of tetracycline in capsule form (which, at the time, cost us about a penny apiece) was sent home with each woman after her abortion, with instructions to take them until they were gone. We also suggested she would be wise to eat some cultured milk products, like yogurt or sour cream, while taking an(y) antibiotic, since tetracycline/antibiotics help(s) prevent/control infection by indiscriminately destroying both good and bad bacteria In the body.\n \n When a woman knew she had (relatively)rare RH negative blood, she would be given the name of a \"sympathetic\" physician who would follow-up her abortion with an injection of RhoGam which is used to immunize the woman to prevent possibly fatal RH-incompatibility reactions in future pregnancies.\n \n We secured the necessary equipment and medications from various pharmacies and medical supply stores around town. Obtaining the supplies required no prescription--one merely had to appear to know what she was doing to purchase specula, sterilizing trays, gloves, tenacula, and the rest. Tetracycline is a prescription drug but was only slightly more difficult to purchase.\n \n After the tetracycline injection, the woman would be asked to lie down so that we could position a sterilized metal speculum into her vagina to locate her cervix. We used no draping, no stirrups, no shaving, no masks, and no doctors. We used precise instruments but neither medical guise/guys nor props.\n \n We then used cotton swabs to do a Pap test, taking sloughed cells from first inside the os, then around the face of the cervix. We placed the cells, in turn, on a glass slide labeled with her name and the date, used fixative, and, later, sent that slide along with the others from the day's work out to a lab which read it and sent back results which we later relayed to the women whose results they were. The lab charged us about a dollar per slide for their reading and report. Later in Jane's existence,. we purchased a microscope; we were going to learn to read the slides ourselves, but the cops confiscated the microscope in the May 1972 bust. I don't know that we ever got the microscope back.\n \n After the Pap test we would wash the cervix with Betadyne, then inject xylocaine at 12, 6, 3, & 9 to create a paracervical block, using a tenaculum to hold the cervix in place, if necessary. Dilation of the os we accomplished by using either a graduated series of thin to less thin rods or by using a manual dilator, coaxing the os gradually to open. \n \n We assumed that women with normal thigh muscles could hold their legs as was necessary and, by god, each woman did. We told women: you're a part of this not an object of this; this is an ensemble production. Abortion was to be a matter of informed choice; decision-making is a revolutionary act. And we talked ~ along, giving information, asking and answering questions, a woman at the pregnant woman's shoulders holding her hand or maybe wiping her forehead. Those women who said they didn't want to know what was happening were told why we thought it important to know, why it is important not to detach oneself from one's body or to submit to anyone else, even to someone who is helping, who you have chosen to help, even to us.\n \n The Jane who was holding most of the instruments would tell the woman whose abortion it was what was going on, asking her to relax, to lie as still as possible, and to keep her legs up and apart. We concentrated on what was going on and often we also talked and laughed and told jokes to and amongst one another--not because it was \"therapeutic\" or because we took abortion, ourselves, or the woman choosing abortion lightly, but because we were doing important things together as the people we were, and we loved doing those things and doing them together.\n \n (More)", 
   {}, 
   191410, 
   null, 
   1137001980.0
  ], 
  [
   191413, 
   null, 
   "simone", 
   "My favorite instrument was the sound. It is beautiful, silver , and pliable, has a rounded tip, and is calibrated. It is moved about inside the uterus to discern the size, shape, and topography of the uterus, the location of the pregnancy. When the tip touches solidity, the sound bends slightly; the hand holding the sound can feel that: it is a highly responsive instrument.\n \n One woman who, in confirming the information on the 3x9 card noting her ten pregnancies, her ten living children, said, indeed, she was certain she was pregnant because she hadn't had her period in five months. Her cervix was grey, not the fuschia with engorgement of a usual 12-16 week pregnancy, and though starchy diets over a long time often produce such grey tissue, still, pregnant, the uterus should have at least flushed pink. Though the sound virtually disappeared into her huge, spongy, and seemingly empty uterus, none of us could find the pregnancy.\n \n It did not occur to us to tell her, as her physician had, that a) she wasn't pregnant--he could find no pregnancy (either), and b) an eleventh child would make no difference in her life--the physician had told her to \"show him\" her pregnancy by having the child.\n \n Finally, one of us, with the sound, found a tiny tunnel on the top and to the back of her uterus, a bubble of the uterus above and behind the tunnel, in which lay the small, underdeveloped pregnancy, a pregnancy which we removed, as we removed other pregnancies, with a curette.\n \n Most often we aborted pregnancies by dilation and curettage (D&c). By about 1972, the technique of manual vacuum aspiration was available, and we used it, too, frequently for women six weeks pregnant or less, though curettage always completed those abortions. The aspiration was less uncomfortable but then we felt it was not always entirely reliable when used alone. For women 6-12 weeks pregnant, we always did the D&C.\n \n For women 12-16 weeks pregnant, or beyond, labor was induced, most commonly by breaking the amniotic sac with forceps. Both laminaria and luenbach paste, which separate the placenta from the uterine wall, were available during some of those years, but their presence is clinically detectable while a broken amniotic sac, drained fluid, and a dilated os can all be attributed to natural process. The os dilated, the sac broken, labor induced, the pregnancy comes out.\n \n After a direct abortion, an abortion in which labor was not induced, but during which both fetus and placenta were removed, the newly not-pregnant woman would be returned to the Front where she would meet up with whatever friend she'd brought along, talk with Jane women, celebrate, recover a bit, or talk with the other women there for the same reason. If she had come alone, she would call someone to pick her up. When she left the Front she'd leave with a packet of tetracycline in hand and a list of phone numbers for her to call in case she had a problem or wanted to talk about the abortion. We told her we'd call her in a few days if her Pap test needed to be followed up on. We told her (again, as this is part of what we'd talked about the first time she would have spoken personally with a Jane) if there was more bleeding after the abortion than during her normal period, she should lie down, put her feet up and put ice over the area o~ her ovaries and uterus. If this wouldn't slow down the bleeding, we said she should go (or we would take her, if she wished) to her doctor, a doctor, or to a non-Catholic emergency room, where, invariably she'd be told to lie down, put her feet up and put ice on her \"tummy\". If she were filling a Kotex in 15 minutes or less, we told her to consider that flow hemmorhaging and to go directly to an emergency room where we'd meet her (if she wished). More frequently than we took women to doctors or to emergency rooms where we took them was into our homes, our confidence, and, frequently, into the Service. Indeed, if a woman expressed interest in joining us, someone would call her up, as someone had called me up, and invite her to one of our meetings.\n \n (More)", 
   {}, 
   191412, 
   null, 
   1137002100.0
  ], 
  [
   191414, 
   null, 
   "simone", 
   "Eventually, the Service rented two apartments, one on the North Side which we used solely for women who did not have insurance, green card (government assisted health care), or circumstance to deliver the fetus in a hospital, or who did not choose to deliver at her own home and who had nowhere else to go. The other apartment we rented was on the South Side and, for a brief while, became our regular Place, at which point only the Fronts changed each workday.\n \n It was at the South Side apartment that seven of us were busted on the May day in 1972 that J. Edgar Hoover finally died. Neither the Chicago Police nor the Outfit/Mafia had previously bothered us though each knew of our work: we were clean, damn good, and made too little money to interest them.\n \n From all accounts, what happened to cause the bust was that the police, who reputedly knew and had known about us and who had photos of us at various political demonstrations and at our various residences over time, had been hounded by a Catholic sister-in-law of a woman who had chosen to have an abortion. The cops had put her off, apparently, but she was persistent and outraged that abortions could be going on at all and further outraged at the cops' reaction, or lack thereof, to her complaint.\n \n The cops took everyone around that day, scooping up people first at the Place, then, at the Front--friends, boyfriends, mothers--there must have been a couple dozen people busted in mid-afternoon who didn't get tossed into jail until midnight. Seven Service women were charged with \"battery\" and the like. All charges were subsequently dropped ostensibly because the law was changed (Roe v. Wade, 1973) although the law never changed enough to \"allow\" non-physicians to do abortions.\n \n The arrest was one of several points during the history of the Service when women dropped out. For instance, when the male abortionists were \"found out\" many of the women in the Service said. something like \"They're not doctors!\" and while some of us had a look of panic, horror, or terror on our faces, others, like me, smiled broadly saying it. Just after the bust I remember a discussion in which some women asked if we should continue doing abortions. I was impatient with talk like that. The arrests changed nothing for me; our doing abortions was (still) both right and illegal.\n \n When Jane finally did disband (late 1973), after abortion was effectively \"legalized,\" we unconsciously made the same error that the Suffragists had made after Suffrage had been \"granted\" in the US: we thought we'd won, changed something, that someone somewhere was wising up, seeing the light. But what we did was to remand women back into the realm of male law, male custom, medical custody. Bad idea then as now.\n \n (More)", 
   {}, 
   191413, 
   null, 
   1137002220.0
  ], 
  [
   191415, 
   null, 
   "simone", 
   "Those of us in Jane, in the Women's Movement then and now, had not done, have yet to do, our homework, either that or we are far too trusting, or maybe we believe that the system is only in need of revision and that it will somehow at some time begin to include us (structurally), work for us. What we must understand is that the system of patriarchal imperialism is inimical to women: it always has been and it always will be. We live by the tolerance or privilege or oversight of the patriarchs.\n \n We didn't win at Suffrage. We didn't win at Roe v. Wade. There is no winning. A hundred years of hindsight has us asking how could the Suffragists have thought that getting the vote in a rigged, white, male, heterosexual system was a win. We understand that they should have not organized to become a part of such a system, but, instead, worked to take apart that system. Why do we not ask the same of ourselves?\n \n Decisions/laws hold only as long as they work for or do not work against the decision/law makers. The acts of \"asking permission,\" of marching, of lobbying, and demonstrating acknowledge the very power imbalance women must change.\n \n We should all know by now that the rights of women are legally unacknowledged and structurally, fundamentally incompatible with patriarchy. We are treason and heresy: I think we should, embrace that, consider it kernel, foundation, nucleus, and core to being women.\n \n It is no wonder that abortion law does not reflect women's needs, rights, and thought: which laws do? We must notice that other patriarchal imperialist traditions such as rape, pornography, and the male beating up on women are patriarchal perks--rites as well as rights of patriarchy; these are the same rights/rites conquering forces often exert, then traditionalize, systematize. These \"traditions,\" these \"values\" are so deeply incorporated into gender relations that, for instance, normative heterosexual behavior is virtually indistinguishable from some outcroppings of violence against women, like rape and pornography.\n \n Abortion is part of the power patriarchy holds over women. Abortion is an issue of hegemony and imperialism: men to other men are explorers; to men, women are the moon, enigmatic frontier and flow, \"virgin\"/empty land to be owned and controlled and into which flags can be rammed. Men have made women their territory, abortion theirs to control, mystify, and sell back to women; abortion is not simply a medical procedure, it is a medicalized procedure, a procedure medicalized, like childbirth and Pap tests, and for the same reasons--control and profit.\n \n The Pap test consists of inserting a' speculum into a vagina, locating the cervix, then inserting, in turn, two long cotton-tipped swabs one at a time through the vagina to the cervix. The first swab pets cells from the os the second, pets cells off the surface of the cervix. The cells from the swabs are placed onto a glass slide next to a note regarding their place of origin, then a fixative is sprayed over the cells and the slide is sent to a lab to be read. The Pap test is no more difficult to do, little more' invasive or complex, than flossing a tooth. Indeed, the tissue of the vagina is similar to the tissue in the mouth, only cleaner. Clearly, the logistics of doing it oneself takes practice though that difficulty can be overcome by women doing each others' Pap tests. This is not a \"medical procedure,\" but a procedure colonized by professionalization.\n \n The Pap test, abortion, and childbirth are each procedures to perform carefully and knowledgeably; why they are \"medical(ized)\" procedures has to do with issues of control. To misquote and meld Marx and Engels: \"He who is in control of the means of re-production is in control of an essential form of labor\". One has but to look at the history of labor (of all kinds) under capitalism to trace the colonization and Pacification of a cheap (free/unpaid, in this case) work force to see how this operates.\n \n Remember, too, if you will, the days before \"birthing suites\" at the local hospital; remember when women fought for their lovers, boyfriends and/or husbands to be with them at the birth of their children? Remember the Physicians' response to those demands? Unequivocal negative response. Unequivocal that is, until the physicians found a way to colonize \"birthing,\" incorporate it into their business arena, and then sell it back to women along with their other \"services\". Their answer to our demands was a variety of ways of saying no--it was 'Unsanitary,\" \"unworkable\"--too many people in the delivery room at ~ time; it was \"against standard medical practice\"--until it wasn't any of those things--until the medical business found a way to sell \"birthing\" back to women.\n \n I suggest we not only demedicalize abortion but that women begin (again) to do abortions ourselves. Bring back safe, \"illegal\" abortions done by women for and because of women. Groups of women can certainly do our own safe abortions; women have always done our own safe abortions. The medicalization of health and the colonization of women's bodies have obscured what can and must be done. Going back again and again to the patriarchs whose right/rite it is to rape women, beat women, and to force impregnation and childbirth is not what women want to continue doing. Women need to practice disobedience (civil..if you like) to law: we must not obey laws which we did not write and which are written at our expense and which keep us oppressed and keep us asking permission.", 
   {}, 
   191414, 
   null, 
   1137002280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Chicago Women's Project", 
  "url": "http://www.4forums.com/political/abortion-debates/7294-chicago-womens-project.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7294, 
  "discussion_files": [
   [
    "20698.html", 
    "http://www.4forums.com/political/abortion-debates/7294-chicago-womens-project-print.html"
   ]
  ], 
  "identifier": 7294
 }
]