[
 [
  [
   192506, 
   null, 
   "jyoshu", 
   "http://news.yahoo.com/s/po/20060115/co_po/cnndonatestogayjournalistscholarship\n \n A scholarship for \"LGBT\" people? What's next? A Kleptomaniac's College Fund? Or maybe a vegetarian scholarship (since someone suggested that as more benign analogy)?\n \n This push by the gay lobby that's been going on the last few years to equate homosexual living as some sort of civil rights minorty when it's really a behavioral thing is transparent. No wonder all the good CNN anchors go to Fox, and it's no wonder that CNN's ratings trail behind Fox every year, as out of touch with reality and Americans as they are.\n \n I may just have to cancel my CNN Pipeline subscription.", 
   {
    "post_info": {
     "post_title": "CNN donates to gay journalist scholarship"
    }
   }, 
   null, 
   null, 
   1137378600.0
  ], 
  [
   192510, 
   null, 
   "joebrummer", 
   "Your unfounded opinion that homosexuality is a behavior and not a state of being is what is really transparent. It doesn't stand up to logic let alone science.\n \n \n Like I have said before, if I was on a deserted island in the middle of nowhere, I would still be gay. I would still be attracted to men. No behavior there.", 
   {}, 
   192506, 
   null, 
   1137379920.0
  ], 
  [
   192512, 
   null, 
   "jyoshu", 
   "Your unfounded opinion that homosexuality is a behavior and not a state of being is what is really transparent. It doesn't stand up to logic let alone science.\n \n Like I have said before, if I was on a deserted island in the middle of nowhere, I would still be gay. I would still be attracted to men. No behavior there.\n\n \n Being left-handed is a state of being too, but it doesn't make me a civil rights minority. But then I'm not trying to get people to give me special rights because of it, either. State of being or not, it's silly to view it as some civil rights matter.", 
   {}, 
   192510, 
   null, 
   1137380160.0
  ], 
  [
   192516, 
   null, 
   "jitobear", 
   "A scholarship for \"LGBT\" people? What's next? A Kleptomaniac's College Fund? Or maybe a vegetarian scholarship (since someone suggested that as more benign analogy)?\n \n This push by the gay lobby that's been going on the last few years to equate homosexual living as some sort of civil rights minorty when it's really a behavioral thing is transparent. No wonder all the good CNN anchors go to Fox, and it's no wonder that CNN's ratings trail behind Fox every year, as out of touch with reality and Americans as they are.\n \n I may just have to cancel my CNN Pipeline subscription\n.\n \n What's it to you?\n \n Somebody chose to start this fund and somebody else decided to donate to it. Why do you care? There all kinds of scholarship funds for all kinds of folks. It's not an \"agenda\" - it's people deciding what to do with their money. \n \n Being Christian, I would like to point out, is a behavior - yet there are laws against discrimination on the basis of religion and I would be willing to bet dollars to pesos, there are more than a few Christian scholarship funds out there.\n \n You just can't stand to have a single homosexual thing be positive can you? They can't march in a parade, create a scholorship fund, have a magazine - nothing without you screaming about their \"agenda\". The fact is, anything they do, short of hiding in the closet, is seen as a radical agenda to you. \n \n So you want to cancel your subscription to CNN because they chose to do something positive for gay people. Oh heaven forbid! You gonna join the Ford boycott, too? Can't have them gays driving, you know.\n \n \n \nBeing left-handed is a state of being too, but it doesn't make me a civil rights minority. But then I'm not trying to get people to give me special rights because of it, either. State of being or not, it's silly to view it as some civil rights matter.\n\n \n It wouldn't be a civil rights matter if they did not face discrimination for being gay. The fact that it has become a civil rights matter has more to do with you than them.\n \n \n \"Did I disappoint you \n Or leave a bad taste in your mouth \n You act like you never had love \n And you want me to go without\"\n \n One, U2/Bono", 
   {}, 
   192512, 
   null, 
   1137381840.0
  ], 
  [
   192520, 
   null, 
   "Matthew S", 
   "http://news.yahoo.com/s/po/20060115/co_po/cnndonatestogayjournalistscholarship\n \n A scholarship for \"LGBT\" people? What's next? A Kleptomaniac's College Fund? Or maybe a vegetarian scholarship (since someone suggested that as more benign analogy)?\n \n This push by the gay lobby that's been going on the last few years to equate homosexual living as some sort of civil rights minorty when it's really a behavioral thing is transparent. No wonder all the good CNN anchors go to Fox, and it's no wonder that CNN's ratings trail behind Fox every year, as out of touch with reality and Americans as they are.\n \n I may just have to cancel my CNN Pipeline subscription.\n\n \n So churches and religious organizations can give out scholarships to christians but someone isn't allowed to give one out to a glbt person?", 
   {}, 
   192506, 
   null, 
   1137382980.0
  ], 
  [
   192525, 
   null, 
   "joebrummer", 
   "Being left-handed is a state of being too, but it doesn't make me a civil rights minority. But then I'm not trying to get people to give me special rights because of it, either. State of being or not, it's silly to view it as some civil rights matter.\n\n \n \n by use of the word \"too\" are we to assume that you have changed your opinion that being gay is a state of being and not just a behavior? \n \n I will add to that, people are not denied rights for being left handed, if they were it would most certainly be a civil rights issue. The fact gays and lesbians are denied rights and protections based on something they cannot change, that is what makes it a civil rights group.", 
   {}, 
   192512, 
   null, 
   1137383580.0
  ], 
  [
   192528, 
   null, 
   "jyoshu", 
   "You just can't stand to have a single homosexual thing be positive can you? They can't march in a parade, create a scholorship fund, have a magazine - nothing without you screaming about their \"agenda\". The fact is, anything they do, short of hiding in the closet, is seen as a radical agenda to you.\n\n \n Something like that shouldn't be a point of pride. It's ridiculous. But I'll grant you that if they want to give their money in that way, that's their business. I won't support it. I can think of so many better ways to help people, such as giving it as a scholarship to underprivileged low-income people who can't afford college. Not because they're gay.\n \n \nIt wouldn't be a civil rights matter if they did not face discrimination for being gay. The fact that it has become a civil rights matter has more to do with you than them.\n\n \n It's become a civil rights matter because the gay lobby went out of its way to portray it as such. \n \n \nby use of the word \"too\" are we to assume that you have changed your opinion that being gay is a state of being and not just a behavior?\n\n \n I've never denied it might be an innate thing. But even if it is, it's beside the point.\n \n \nI will add to that, people are not denied rights for being left handed, if they were it would most certainly be a civil rights issue.\n\n \n One certainly COULD argue that left-handed people are discriminated against--most things in society are designed and built to be for right handed people. Check your keyboard on the computer you're typing on (assuming its not a laptop)---which side is the numberpad on?\n \n But guess what . . . we don't make an issue of it and we sure aren't trying to pass ourselves off as a civil rights group.", 
   {}, 
   192516, 
   null, 
   1137385560.0
  ], 
  [
   192544, 
   null, 
   "JustineCredible", 
   "Being left-handed is a state of being too, but it doesn't make me a civil rights minority. But then I'm not trying to get people to give me special rights because of it, either. State of being or not, it's silly to view it as some civil rights matter.\n\n \n \n jyoshu, you're just jealous. \n \n Plain and simple. \n \n I'm a lefty, I'm also dyslexic as well as being a lesbian. Which of my \"quirks\" puts me a more of a social disadvantage? \n \n Being Black shouldn't be a reason to have a \"special\" scholarship fund, but it is. Why? \n Because Blacks are at a distinct disadvantage to straight, WASP kids.\n \n Being Gay, Lesbian, Bi-sexual or Transgendered SHOULDN'T be a reason to have a special scholarship fund, but it IS because they are at a distinct disadvantage. \n \n Why is that? Because of bigotted, hate-filled bias jerks who simply can't deal with the fact that there are people on this planet who are different but just as deserving of EQUALITY and EQUAL OPPORTUNITY! \n \n Until you can deal with gays and lesbians being completely equal to you, you are condemming yourself to the lable above. (Which was not directed at you personally...but if the shoe fits...)", 
   {}, 
   192512, 
   null, 
   1137389760.0
  ], 
  [
   192547, 
   null, 
   "jitobear", 
   "Something like that shouldn't be a point of pride. It's ridiculous. But I'll grant you that if they want to give their money in that way, that's their business. I won't support it. I can think of so many better ways to help people, such as giving it as a scholarship to underprivileged low-income people who can't afford college. Not because they're gay.\n\n \n Do you get this up in arms about other scholarships funds that aren't aimed at the economically disadvantaged? Or just ones aimed at homosexuals?\n \n And by the way - you don't get to define what is or is not a point of pride for others. \n \n \nIt's become a civil rights matter because the gay lobby went out of its way to portray it as such. \n\n \n Are you claiming gay people have not been discriminated against? That they made this all up just to bug you? \n \n \nOne certainly COULD argue that left-handed people are discriminated against--most things in society are designed and built to be for right handed people. Check your keyboard on the computer you're typing on (assuming its not a laptop)---which side is the numberpad on?\n\n \n Actually many of these things have designs for lefties and can be obtained. And it is far cry different to have difficulty in obtaining tools for being left-handed than being denied legal protections for being left-handed.\n \n You might have a valid comparison if we there was a huge effort to keep left-handed tools illegal and to boycott the selling of such tools. Or to not allow left handed people to marry or adopt. Or to not grant them protection from discrimation in employment or housing. Or if you were being accused of being the cause of hurricanes and other disasters. Or if being left handed got you beat on the street. It's things such as these that make this a civil rights issue.", 
   {}, 
   192528, 
   null, 
   1137390780.0
  ], 
  [
   192575, 
   null, 
   "BobNelson2", 
   "One certainly COULD argue that left-handed people are discriminated against--most things in society are designed and built to be for right handed people. Check your keyboard on the computer you're typing on (assuming its not a laptop)---which side is the numberpad on?\n \n But guess what . . . we don't make an issue of it and we sure aren't trying to pass ourselves off as a civil rights group.\n\n \n Guess what, yourself. The reason gay rights is a civil rights issue isn't because WE made it an issue. It's because there were and still are civil laws which limit our legal rights as equal citizens.\n \n Civil rights Civil is from the Latin Cives (citizen).\n \n One big DUH!\n \n Oh, and remember, it was your fellow \"traditionalists\" and \"conservatives\" who wrote those oppressive laws under the influence of your religious friends. Take your whining to them. If they had never outlawed us and treated us so badly, we would never have had to fight for our rights.", 
   {}, 
   192528, 
   null, 
   1137411180.0
  ], 
  [
   192586, 
   null, 
   "jyoshu", 
   "Why is that? Because of bigotted, hate-filled bias jerks who simply can't deal with the fact that there are people on this planet who are different but just as deserving of EQUALITY and EQUAL OPPORTUNITY! \n \n Until you can deal with gays and lesbians being completely equal to you, you are condemming yourself to the lable above. (Which was not directed at you personally...but if the shoe fits...)\n\n \n Justine!! Where you been? Back in full form I see. This isn't just another issue of some people being different and being treated that way. It's a moral issue, and that's at the heart of why \"gay rights\" are opposed in this country. \n \n \nDo you get this up in arms about other scholarships funds that aren't aimed at the economically disadvantaged? Or just ones aimed at homosexuals? And by the way - you don't get to define what is or is not a point of pride for others.\n\n \n Depends on the situation. If there is a genuine need there such as the American Negro College Fund, then no, I don't oppose it. But that's a case where kids are truly underprivileged because of the way society treated them.\n \n \nAre you claiming gay people have not been discriminated against? That they made this all up just to bug you? \n\n \n On SOME level, sure they've been discriminated against. Lefties are disciriminated against too, for that matter.\n \n \nActually many of these things have designs for lefties and can be obtained. And it is far cry different to have difficulty in obtaining tools for being left-handed than being denied legal protections for being left-handed.\n\n \n And I suppose a leftie having to operate dangerous right-hand-designed machinery on the job is not a case of being denied legal protections? Or being denied the job itself because of the lack of left-handed machinery? emoticon_rolleyes \n \n Don't get me wrong here--I'm not interested in starting up a big huge pride movement and throwing the issue in society's faces over it. That's the point--that discrimination exists all in society. Nobody OWES gay people anything. Get over it.\n \n \nOh, and remember, it was your fellow \"traditionalists\" and \"conservatives\" who wrote those oppressive laws under the influence of your religious friends. Take your whining to them. If they had never outlawed us and treated us so badly, we would never have had to fight for our rights.\n\n \n Nope--conservatives and everyone else were not divided on this issue originally. There WAS no gay rights movement, in any significant form anyway, up until the 60s and 70s. Society just knew homosexual relations were wrong and the idea calling that a marriage was ludicrous. It still is really, it's just that your movement has done a pretty good job of getting the definition of marriage changed in this country to a more anything-goes institution.", 
   {}, 
   192544, 
   null, 
   1137426120.0
  ], 
  [
   192625, 
   null, 
   "joebrummer", 
   "jyoshu,\n Please explained to me ho it doesn't matter if being gay is innate or unchangable. It most certainly matters because you are asking people to take who there are and pretend it doesn't matter if they are at a disadvantage.\n \n \n Explain your position on this.", 
   {}, 
   192586, 
   null, 
   1137432360.0
  ], 
  [
   192632, 
   null, 
   "jyoshu", 
   "jyoshu,\n Please explained to me ho it doesn't matter if being gay is innate or unchangable. It most certainly matters because you are asking people to take who there are and pretend it doesn't matter if they are at a disadvantage.\n \n \n Explain your position on this.\n\n \n We've been over this before. The reason it's beside the point is that opposition to homosexuality on moral grounds isn't based on innateness. It's based on behavior. It's no more immoral to have homosexual innateness than it is, say, for a person to have a genetic disposition toward wanting alcohol. It's not immoral to have an inner need for alcohol, but it is for a person like this (an alcoholic) to drink. Preachers,for instance, who preach against homosexuality aren't talking about innateness. They're talking about homosexual activities.", 
   {}, 
   192625, 
   null, 
   1137435600.0
  ], 
  [
   192633, 
   null, 
   "joebrummer", 
   "We've been over this before. The reason it's beside the point is that opposition to homosexuality on moral grounds isn't based on innateness. It's based on behavior. It's no more immoral to have homosexual innateness than it is, say, for a person to have a genetic disposition toward wanting alcohol. It's not immoral to have an inner need for alcohol, but it is for a person like this (an alcoholic) to drink. Preachers,for instance, who preach against homosexuality aren't talking about innateness. They're talking about homosexual activities.\n\n \n \n Just like to clarify that you really would want people to go through life without companions, without eros, alone. You may think that is just fine, but for millions of people that would be cruel and mean. You seem to think it is moral, I think it is cruel. You have your opinion, I have mine.", 
   {}, 
   192632, 
   null, 
   1137436380.0
  ], 
  [
   192637, 
   null, 
   "jyoshu", 
   "Just like to clarify that you really would want people to go through life without companions, without eros, alone. You may think that is just fine, but for millions of people that would be cruel and mean. You seem to think it is moral, I think it is cruel. You have your opinion, I have mine.\n\n \n If someone came along and said that \"I am only attracted to underage teenagers--I should be able to marry one because I'm entitled to a life of compassion, and love,\" would you support it?", 
   {}, 
   192633, 
   null, 
   1137437460.0
  ], 
  [
   192638, 
   null, 
   "Steeeeve", 
   "If someone came along and said that \"I am only attracted to underage teenagers--I should be able to marry one because I'm entitled to a life of compassion, and love,\" would you support it?\n\n \n This is not even a hypothical. There are many people like that....", 
   {}, 
   192637, 
   null, 
   1137437760.0
  ], 
  [
   192640, 
   null, 
   "joebrummer", 
   "If someone came along and said that \"I am only attracted to underage teenagers--I should be able to marry one because I'm entitled to a life of compassion, and love,\" would you support it?\n\n \n \n \n Nice try at spinning but we are not talking about people breaking laws, we are talking about consenting adults...address the issue at hand and stop changing the subject by muddying the waters. \n \n You expect consenting adults to live lonely lives without companionship, and love based on your morals. Millions of people, just miserable. That is cruel...", 
   {}, 
   192637, 
   null, 
   1137438960.0
  ], 
  [
   192641, 
   null, 
   "jyoshu", 
   "Nice try at spinning but we are not talking about people breaking laws, we are talking about consenting adults...address the issue at hand and stop changing the subject by muddying the waters. \n \n You expect consenting adults to live lonely lives without companionship, and love based on your morals. Millions of people, just miserable. That is cruel...\n\n \n First it was people, now it's just \"consenting adults.\" Just how many qualifiers are you going to add to make sure the discussion is limited to homosexuals with nothing else to compare it to?\n \n As far as your \"we are not talking about people breaking laws\" statement above, it used to BE people breaking the law--gay sex used to be unlawful in most places. Why should the example I used not count, just because you don't like it?", 
   {}, 
   192640, 
   null, 
   1137439680.0
  ], 
  [
   192643, 
   null, 
   "joebrummer", 
   "First it was people, now it's just \"consenting adults.\" Just how many qualifiers are you going to add to make sure the discussion is limited to homosexuals with nothing else to compare it to?\n \n As far as your \"we are not talking about people breaking laws\" statement above, it used to BE people breaking the law--gay sex used to be unlawful in most places. Why should the example I used not count, just because you don't like it?\n\n \n \n There is nothing to compare it to....why do we need to compare it.\n \n Let really look at what you are saying.\n \n You want gays an lesbians to deny their feelings because it is immoral.\n You are saying when gays and lesbians meet someone and have strong, happy feelings of companionship and love that would make them feel complete, they should deny it because you think it is immoral.\n You want gays and lesbians to to not \"act\" on the feelings of passion and love because you feel it is immoral.\n You want them to pretend they are straight, because you think who they really are, and what would really make them happy is immoral.\n \n You would rather they live alone, depressed and isolated because you think there relationships are immoral.\n \n I think your wish for the gay and lesbians in the world is cruel, and immoral!", 
   {}, 
   192641, 
   null, 
   1137441780.0
  ], 
  [
   192649, 
   null, 
   "jyoshu", 
   "There is nothing to compare it to....why do we need to compare it.\n\n \n Comparisons are valuable because they help to get a point across and to understand the issue better. \n \n \nLet really look at what you are saying.\n \n You want gays an lesbians to deny their feelings because it is immoral.\n You are saying when gays and lesbians meet someone and have strong, happy feelings of companionship and love that would make them feel complete, they should deny it because you think it is immoral.\n You want gays and lesbians to to not \"act\" on the feelings of passion and love because you feel it is immoral.\n You want them to pretend they are straight, because you think who they really are, and what would really make them happy is immoral.\n \n You would rather they live alone, depressed and isolated because you think there relationships are immoral.\n \n I think your wish for the gay and lesbians in the world is cruel, and immoral!\n\n \n People wanting to marry underage teenagers could make the same arguments you are.", 
   {}, 
   192643, 
   null, 
   1137442500.0
  ], 
  [
   192659, 
   null, 
   "BobNelson2", 
   "Depends on the situation. If there is a genuine need there such as the American Negro College Fund, then no, I don't oppose it. But that's a case where kids are truly underprivileged because of the way society treated them.\n\n \n Do you object to scholarship funds directed at the thousands of gay and lesbian kids tossed out of their homes by their \"convervative\" \"pro-family\" parents?\n \n In your world, are we allowed to help them?", 
   {}, 
   192586, 
   null, 
   1137445200.0
  ], 
  [
   192660, 
   null, 
   "joebrummer", 
   "Comparisons are valuable because they help to get a point across and to understand the issue better. \n \n \n \n People wanting to marry underage teenagers could make the same arguments you are.\n\n \n \n no they cannot, because because they are not dealing with consenting adults, those are people breaking the law.\n \n You also can't seem to stay focused on the claim you made about gays and lesbians being born gay and that it doesn't matter. Why doesn't it matter?", 
   {}, 
   192649, 
   null, 
   1137445260.0
  ], 
  [
   192661, 
   null, 
   "jyoshu", 
   "no they cannot, because because they are not dealing with consenting adults, those are people breaking the law.\n\n \n The law doesn't define marriage that way. You're the one trying to draw the line at \"consenting adults.\" \n \n \nYou also can't seem to stay focused on the claim you made about gays and lesbians being born gay and that it doesn't matter. Why doesn't it matter?\n\n \n I just told you, 2 or 3 posts ago!", 
   {}, 
   192660, 
   null, 
   1137445500.0
  ], 
  [
   192663, 
   null, 
   "BobNelson2", 
   "We've been over this before. The reason it's beside the point is that opposition to homosexuality on moral grounds isn't based on innateness. \n\n \n You're right. It's based on the endorsement of the highly selective application of a bronze age morality which itself was based on gross misunderstandings of humanity.", 
   {}, 
   192632, 
   null, 
   1137445620.0
  ], 
  [
   192665, 
   null, 
   "BobNelson2", 
   "I see someone has reset the jyoshu-bot to square one...", 
   {}, 
   192663, 
   null, 
   1137445680.0
  ], 
  [
   192886, 
   null, 
   "jitobear", 
   " People wanting to marry underage teenagers could make the same arguments you are.\n\n \n This is damaging to the minor who is not emotionally or physically ready for this kind of relationship. That is not the case for adult homosexuals.", 
   {}, 
   192649, 
   null, 
   1137536280.0
  ], 
  [
   192891, 
   null, 
   "jyoshu", 
   "This is damaging to the minor who is not emotionally or physically ready for this kind of relationship. That is not the case for adult homosexuals.\n\n \n So you think every teenager magically becomes emotionally mature the moment he hits his 18th birthday, and any teenager before that is not mature enough? Nah. There are probably some 16 year olds more emotionally mature than some 18 year olds.", 
   {}, 
   192886, 
   null, 
   1137537480.0
  ], 
  [
   192924, 
   null, 
   "jitobear", 
   "So you think every teenager magically becomes emotionally mature the moment he hits his 18th birthday, and any teenager before that is not mature enough? Nah. There are probably some 16 year olds more emotionally mature than some 18 year olds.\n\n \n Almost certainly. But unless you want to figure out and fund a \"maturity testing program\" for teens - they had to pick the the age one becomes an adult and 18 won.", 
   {}, 
   192891, 
   null, 
   1137547140.0
  ], 
  [
   192952, 
   null, 
   "Easyrider", 
   "One would hope that CNN's funding of a gay journalist is based on their professional work and not their illicit lifestyle.\n \n But then CNN is owned and run by a radical Christian hater, so what else would you expect.\n \n Which is why FOX is eating their lunch big time, according to the ratings.", 
   {}, 
   192637, 
   null, 
   1137551760.0
  ], 
  [
   192955, 
   null, 
   "jyoshu", 
   "Almost certainly. But unless you want to figure out and fund a \"maturity testing program\" for teens - they had to pick the the age one becomes an adult and 18 won.\n\n \n Indeed, which takes us back to the analogy inherent with this issue of marrying underage teens.", 
   {}, 
   192924, 
   null, 
   1137552900.0
  ], 
  [
   192959, 
   null, 
   "JustineCredible", 
   "We've been over this before. The reason it's beside the point is that opposition to homosexuality on moral grounds isn't based on innateness.\n\n \n Yes, and that's because those who know that being glb or t is indeed an innateness and to agrue against such would be a loosing battle.\n \n \n It's based on behavior. \n\n \n Yes, because it's much easier to make up lies than it is to stick to the truth.\n \n \nIt's no more immoral to have homosexual innateness than it is, say, for a person to have a genetic disposition toward wanting alcohol.\n\n \n Of course you really haven't got a clue as to the difference between a chemical and biological predispossition to BECOME addicted to alcohol, than someone who simply \"likes\" alcohol. \n \n \n It's not immoral to have an inner need for alcohol, but it is for a person like this (an alcoholic) to drink.\n\n \n Even that addiction could be argued to not be immoral but to act upon it may or may not dependent upon the danger to the person who is addicted or those affected by that person, his addiction or the addiction itself. \n But something tells me you probably aren't up for such a discussion here.\n \n \n Preachers,for instance, who preach against homosexuality aren't talking about innateness. They're talking about homosexual activities.\n\n \n Specifically by utilizing a literal and obtuse translation of the Bible. \n \n So are you attempting to equate a biochemical addiction to homosexuality? \n Your poor attempt of a comparission would suggest so. Something tells me you really are aware the two are NOT in any way, shape or form even slightly similar. So, why don't you just quit yankin' our chains on this and admit when you don't know what you're talking about?", 
   {}, 
   192632, 
   null, 
   1137553980.0
  ], 
  [
   193018, 
   null, 
   "JakeCJB", 
   "Justine!! Where you been? Back in full form I see. This isn't just another issue of some people being different and being treated that way. It's a moral issue, and that's at the heart of why \"gay rights\" are opposed in this country.\n\n \n It's a moral issue, that's why gay rights are supported in the country. What are these \"morals\" that oppose it, based on?\n \n \nDepends on the situation. If there is a genuine need there such as the American Negro College Fund, then no, I don't oppose it. But that's a case where kids are truly underprivileged because of the way society treated them.\n\n \n Gay people have their own set of problems due to the way they are treated by society.\n \n \nAnd I suppose a leftie having to operate dangerous right-hand-designed machinery on the job is not a case of being denied legal protections? Or being denied the job itself because of the lack of left-handed machinery? emoticon_rolleyes \n \n Don't get me wrong here--I'm not interested in starting up a big huge pride movement and throwing the issue in society's faces over it. That's the point--that discrimination exists all in society. Nobody OWES gay people anything. Get over it.\n\n \n Oh, I see, so you don't really care if a leftie has to operate dangerous right-handed machinery. That was just a red herring, a diversion. The fact that discrimination and inequality and injustice, exists, well your answer is the victim of such treatment should just get over it. That's the angry white man's easy answer to the issue. \n \n \nNope--conservatives and everyone else were not divided on this issue originally.\n\n \n Things change.\n \n \nThere WAS no gay rights movement, in any significant form anyway, up until the 60s and 70s.\n\n \n Will you be making that argument for the next 30 years? This doesn't mean the goals of a gay rights movement are not good.\n \n \nSociety just knew homosexual relations were wrong and the idea calling that a marriage was ludicrous.\n\n \n And how did they know this? It seems to me society changes what it thinks it knows from time to time.\n \n \nIt still is really, it's just that your movement has done a pretty good job of getting the definition of marriage changed in this country to a more anything-goes institution.\n\n \n \"A more anything-goes instiution\", because one thing is changed. Well, if that's so, marriage was going that way for a long time, because it has never been static.", 
   {}, 
   192586, 
   null, 
   1137564540.0
  ], 
  [
   193021, 
   null, 
   "JakeCJB", 
   "Indeed, which takes us back to the analogy inherent with this issue of marrying underage teens.\n\n \n No law is perfect, but there is at least a logical reason why the marriage age is set. What is the reason marriage is denied to same-sex couples?", 
   {}, 
   192955, 
   null, 
   1137565020.0
  ], 
  [
   193068, 
   null, 
   "jyoshu", 
   "It's a moral issue, that's why gay rights are supported in the country. What are these \"morals\" that oppose it, based on?\n\n \n Do we really need to go through this again? This has been covered here many, many times.\n \n \nGay people have their own set of problems due to the way they are treated by society.\n\n \n I don't argue with that. I think society HAS mistreated gays at times. But that's a different matter than the moral question. I do believe gay relations are immoral, but I also believe that mistreating people is immoral, so violence and prejudice against gay people is wrong as well. These are seperate matters.\n \n \nOh, I see, so you don't really care if a leftie has to operate dangerous right-handed machinery. That was just a red herring, a diversion. The fact that discrimination and inequality and injustice, exists, well your answer is the victim of such treatment should just get over it.\n\n \n In some cases, that's right. Life is often about learning to adapt in a world that's not perfectly suited for each person, not expecting the world to change in every way to be a perfect fit for every possible issue that comes around. I think a lot of people have gotten to where they think society owes them something so they don't have to make the effort to deal with and accept their differences. I don't go whining to the govt. to start enforcing laws to make everything ambidextrous just because I'm a leftie in a right-handed world--I learn to deal with it. I do think gays could do more of that as well when it comes to living in a straight world.\n \n \nAnd how did they know this? It seems to me society changes what it thinks it knows from time to time.\n\n \n My opinion is that people just naturally know it--perhaps an evolutionary part of our species that knows heterosexuality is the only natural way that has the capacity to procreate. IOW, my opinion is that it's in our genes to know. Even many gay people seem to often know, deep down, that what they are doing just isn't right.\n \n \n\"A more anything-goes instiution\", because one thing is changed. Well, if that's so, marriage was going that way for a long time, because it has never been static.\n\n \n It has at its fundamental level, which is that it's between a man and a woman.\n \n \nNo law is perfect, but there is at least a logical reason why the marriage age is set. What is the reason marriage is denied to same-sex couples?\n\n \n Marriage isn't denied to same-sex couples. You can marry the same way I can. But legal same-sex unions are often denied. They shouldn't be in terms of getting couples' benefits, but then again marriage should be left alone too, and not redefined.", 
   {}, 
   193018, 
   null, 
   1137605100.0
  ], 
  [
   193082, 
   null, 
   "tonybrown74", 
   "Do we really need to go through this again? This has been covered here many, many times. \n\n \n Indeed. However, you have never logically justified your morals. \"God says so\" has never wrung true, particularly since the only evidence of that you have - at best - is a book with passages that speak out against ACTIONS.\n \n \nI don't argue with that. I think society HAS mistreated gays at times. But that's a different matter than the moral question. I do believe gay relations are immoral, but I also believe that mistreating people is immoral, so violence and prejudice against gay people is wrong as well. These are seperate matters.\n\n \n Actually, it is not different. \n \n And you contradict yourself in this very same paragraph.\n \n \n \n In some cases, that's right. Life is often about learning to adapt in a world that's not perfectly suited for each person, not expecting the world to change in every way to be a perfect fit for every possible issue that comes around. I think a lot of people have gotten to where they think society owes them something so they don't have to make the effort to deal with and accept their differences. I don't go whining to the govt. to start enforcing laws to make everything ambidextrous just because I'm a leftie in a right-handed world--I learn to deal with it. I do think gays could do more of that as well when it comes to living in a straight world.\n\n \n The problem is that as perceptions change, so does the world. What people like you want to do is keep a certain mythical \"utopia\" for a select group, because you fear change. The ofunny thing is that you yourself cannot identify what you fear.\n \n \n \n \nMy opinion is that people just naturally know it--perhaps an evolutionary part of our species that knows heterosexuality is the only natural way that has the capacity to procreate. IOW, my opinion is that it's in our genes to know. Even many gay people seem to often know, deep down, that what they are doing just isn't right.\n\n \n Eveyone know how procreation is done \"naturally\", but somehow they manage to know that love and intimacy is also natural. And more people now realize that there is nothing wrong with forms of love and intimacy that may be different from theirs provided that there is informed consent involved.\n \n \nIt has at its fundamental level, which is that it's between a man and a woman.\n\n \n Back to marriage, I see. Marriage is a social construct that initially had nothing to do with religion. And as we all know, marriage does not create a child.\n \n \nMarriage isn't denied to same-sex couples. You can marry the same way I can. But legal same-sex unions are often denied. They shouldn't be in terms of getting couples' benefits, but then again marriage should be left alone too, and not redefined.\n\n \n Actually, it is. Restricting marriage based on the gender of the participants denies marriage to same-sex couples outright.", 
   {}, 
   193068, 
   null, 
   1137611280.0
  ], 
  [
   193097, 
   null, 
   "JakeCJB", 
   "Do we really need to go through this again? This has been covered here many, many times.\n\n \n This is the circular way you argue. No rational reason is given, it's your presupposition.\n \n \nI don't argue with that. I think society HAS mistreated gays at times. But that's a different matter than the moral question.\n\n \n \nI do believe gay relations are immoral, but I also believe that mistreating people is immoral, so violence and prejudice against gay people is wrong as well. These are seperate matters.\n\n \n A contradiction as tonybrown said. If society has mistreated gay people, and you believe mistreating people is immoral, than you cannot say the mistreatment of gay people is different from the moral question.\n \n \nIn some cases, that's right. Life is often about learning to adapt in a world that's not perfectly suited for each person, not expecting the world to change in every way to be a perfect fit for every possible issue that comes around. I think a lot of people have gotten to where they think society owes them something so they don't have to make the effort to deal with and accept their differences. I don't go whining to the govt. to start enforcing laws to make everything ambidextrous just because I'm a leftie in a right-handed world--I learn to deal with it.\n\n \n That may be a good idea. We should be able to evaluate it, based on its own merits and negative points. The only reason to oppose it should not be, that the minority must simply deal with living in a majority ruled world.\n \n \nMy opinion is that people just naturally know it--\n\n \n Well, I don't. Most of the people I know, don't know that.\n \n \nperhaps an evolutionary part of our species that knows heterosexuality is the only natural way that has the capacity to procreate. IOW, my opinion is that it's in our genes to know.\n\n \n There have always been homosexuality in nature and among humans. Not everything in nature does procreate, kin selection is an example of that fact.\n \n \nEven many gay people seem to often know, deep down, that what they are doing just isn't right.\n\n \n They believe that because of social conditioning.\n \n \nIt has at its fundamental level, which is that it's between a man and a woman.\n\n \n No, its often been between one man and many women. That was once thought of as a fundamental level. We could call everything fundamental, until it changed, depending on our persepective.\n \n \nMarriage isn't denied to same-sex couples. You can marry the same way I can. But legal same-sex unions are often denied.\n\n \n That doesn't make any sense, it's a contradiction. Same-sex unions are made up of same-sex couples.", 
   {}, 
   193068, 
   null, 
   1137616680.0
  ], 
  [
   193104, 
   null, 
   "jyoshu", 
   "This is the circular way you argue. No rational reason is given, it's your presupposition.\n\n \n a.) You've been given the rational reasons many times. You just have a different idea of what's rational\n b.) it doesn't have to be \"rational\" by your standards in the first place. People can believe what they want.\n \n \nA contradiction as tonybrown said. If society has mistreated gay people, and you believe mistreating people is immoral, than you cannot say the mistreatment of gay people is different from the moral question.\n\n \n Not diffrent from THE moral question, but 2 different moral questions. I agree with you that gay people shouldn't be mistreated. I don't agree that gay relations are ok (which is not a position that, in and of itself, mistreats).\n \n \nWell, I don't. Most of the people I know, don't know that.\n\n \n I think you probably do deep down, or once did, anyway. You've convinced yourself that it's ok, because it's what you want to hear, and your pride movement told you it was.\n \n \nThere have always been homosexuality in nature and among humans. Not everything in nature does procreate, kin selection is an example of that fact.\n\n \n So? The fact it exists in nature has nothing to do with whether it's moral or not.\n \n \nNo, its often been between one man and many women. That was once thought of as a fundamental level. \n\n \n The change from polygamy to monogamy was a good change, and had nothing to do with gender. Sure, things can change, particularly when one group of people selfishly take another group's institution and try to redefine it to fit their way of living. But law or no law, to many of us marriage will always be an opposite-sex matter no matter now much others twist it and warp it to fit the arrangement-of-the-month from whatever group comes along.\n \n \nThat doesn't make any sense, it's a contradiction. Same-sex unions are made up of same-sex couples.\n\n \n Same-sex unions aren't marriage in the true sense, in my view. You HAVE the right to be married, but of course that would mean you'd have to marry an opposite-sex person than you are. But since it's unfair to deny benefits to gay people because of the guarantee of equal protection, you still have couple's benefits under our constitution, even with a gay live-in relationship. So you should be granted those benefits. But not by redefining marriage.", 
   {}, 
   193097, 
   null, 
   1137619560.0
  ], 
  [
   193112, 
   null, 
   "tonybrown74", 
   "a.) You've been given the rational reasons many times. You just have a different idea of what's rational\n b.) it doesn't have to be \"rational\" by your standards in the first place. People can believe what they want. \n\n \n This is why you cannot be taken seriously. You say that you have made rational arguments, don't list the rational arguments, and then conclude by saying that our standard for rational is different than yours ... which is silly.\n \n All we ask is that your arguments follow some sort of logical progression. The fact that they do not just shows how weak your position is.\n \n And I think you know that.\n \n \nSo? The fact it exists in nature has nothing to do with whether it's moral or not.\n\n \n You need to pick an argument. If you are saying that it's not natural, we can refute your argument by showing it does exist in nature. When you comment on how natural-ness does not determine morality, we refute that morals, if based on some sort of logical progression or arguments, which are - at the very least - neutral on the subject.\n \n \nThe change from polygamy to monogamy was a good change, and had nothing to do with gender. Sure, things can change, particularly when one group of people selfishly take another group's institution and try to redefine it to fit their way of living. But law or no law, to many of us marriage will always be an opposite-sex matter no matter now much others twist it and warp it to fit the arrangement-of-the-month from whatever group comes along.\n\n \n Milk and cookies for you then. But how does that allow you to determine what is right for the rest of us?\n \n \n Same-sex unions aren't marriage in the true sense, in my view. \n\n \n In your view, but in our view it is. And by our view, I do not just refer to gay people.\n \n \n You HAVE the right to be married, but of course that would mean you'd have to marry an opposite-sex person than you are. \n\n \n This is a disingenuous argument. The law treats different genders equally. That said, you have no legal or moral justification to deny marriage to same-sex couples.\n \n \n But since it's unfair to deny benefits to gay people because of the guarantee of equal protection, you still have couple's benefits under our constitution, even with a gay live-in relationship. So you should be granted those benefits. But not by redefining marriage.\n\n \n There is no legal or rational justification to deny marriage to same-sex couples. The terminology is more than just symbolic. There are legal ramifications to denying the term to same-sex couples, the biggest being portability.", 
   {}, 
   193104, 
   null, 
   1137620880.0
  ], 
  [
   193125, 
   null, 
   "Chris Ferrie", 
   "Jyoshu, I've never posted here, but I've been lurking for quite a bit. Reading your posts about how left-handed people are discriminated against to an equal extent to glbt people, I decided to post a reply:\n \n First of all, there is a big difference between being gay and being left-handed. No-one I can think of has got an argument of morality against left-handed people. There are no Christian ministries that speak about hatred of left-handed people. There is, as far as I know, no website like godhateslefties.com. The AFA doesn't protest about how 'god abhors lefties'. Left-handed people are not blamed by cithgaps (Thanks for that word Matthew S) for 9/11 or the American soldiers being killed in Iraq. There are no radio shows like Paul Bennet's that preach hatred of gay people. No-one makes false accusations of left-handed people or use bogus science or discredited medical reports to get people to hate them. People don't treat being left-handed as a disorder and try to cure it through therapy and electrode treatment. If a child tels their parents they are left-handed, they would definitely not be kicked out and disowned by their family. People don't boycott films or tv shows which feature left-handed people. Nor do they boycott motor companies for advertising to left-handed people. Left-handed people don't get beaten within an inch of death and called horrible names like ### or XXXX.", 
   {}, 
   193112, 
   null, 
   1137627900.0
  ], 
  [
   193134, 
   null, 
   "Easyrider", 
   "There is no legal or rational justification to deny marriage to same-sex couples. \n\n \n If our rights come via our \"Creator\" in the Declaration of Independence, and if the majority of our founding fathers were Christians or other God-believing men of faith (most of whom were Biblically based), then it is proper to employ the rationale of the God they believe in to decide whether gay marriage should or should not be legalized. It's also proper and American for the populace itself to decide, which is what has occurred in many states where gay marriages have been outlawed.", 
   {}, 
   193112, 
   null, 
   1137629280.0
  ], 
  [
   193135, 
   null, 
   "jyoshu", 
   "Jyoshu, I've never posted here, but I've been lurking for quite a bit. Reading your posts about how left-handed people are discriminated against to an equal extent to glbt people, I decided to post a reply:\n\n \n Welcome, and thanks for your response. But before I begin replying, let me say that handedness, like any analogy, can only go so far. It was never my intention to be on any sort of soapbox about discrimination against left-handed people, but to simply use an analogy to show that discrimination is a common part of any culture; discrimination alone doesn't necessarily mean much.\n \n \nFirst of all, there is a big difference between being gay and being left-handed. No-one I can think of has got an argument of morality against left-handed people. \n\n \n This is true. Handedness is not a moral issue the way homosexuality is.\n \n \nThere are no Christian ministries that speak about hatred of left-handed people. There is, as far as I know, no website like godhateslefties.com. The AFA doesn't protest about how 'god abhors lefties'. Left-handed people are not blamed by cithgaps (Thanks for that word Matthew S) for 9/11 or the American soldiers being killed in Iraq. There are no radio shows like Paul Bennet's that preach hatred of gay people. No-one makes false accusations of left-handed people or use bogus science or discredited medical reports to get people to hate them. People don't treat being left-handed as a disorder and try to cure it through therapy and electrode treatment. If a child tels their parents they are left-handed, they would definitely not be kicked out and disowned by their family. People don't boycott films or tv shows which feature left-handed people. Nor do they boycott motor companies for advertising to left-handed people. Left-handed people don't get beaten within an inch of death and called horrible names like ### or XXXX.\n\n \n No, they don't, that I am aware of. But I would say that you are (for the most part) addressing a different issue than discrimination alone: abuse. And I wouldn't consider handedness an applicable analogy in the context of psychological or physical abuse. To me, the need to oppose physical and definitive psychological abuse goes without saying. Those should NEVER happen.", 
   {}, 
   193125, 
   null, 
   1137629580.0
  ], 
  [
   193142, 
   null, 
   "BobNelson2", 
   "This is true. Handedness is not a moral issue the way homosexuality is.\n\n \n Well, if it isn't anymore, it certainly used to be. \n \n Of course, when it was, it was \"traditional\" and was, therefore, something you would have supported.", 
   {}, 
   193135, 
   null, 
   1137631080.0
  ], 
  [
   193146, 
   null, 
   "jyoshu", 
   "Well, if it isn't anymore, it certainly used to be. \n\n \n Take it up with the poster who said it's not. I was responding to him.", 
   {}, 
   193142, 
   null, 
   1137632100.0
  ], 
  [
   193208, 
   null, 
   "JakeCJB", 
   "a.) You've been given the rational reasons many times. You just have a different idea of what's rational\n b.) it doesn't have to be \"rational\" by your standards in the first place. People can believe what they want.\n\n \n The fact that something is a belief does not determine it is rational. People believe all sorts of wild and uneducated and paranoid things.\n \n \nNot diffrent from THE moral question, but 2 different moral questions. I agree with you that gay people shouldn't be mistreated. I don't agree that gay relations are ok (which is not a position that, in and of itself, mistreats).\n\n \n People want to be respected for who they are and how they express their difference from you. You want them to treat you that same way.\n \n \nI think you probably do deep down, or once did, anyway.\n\n \n No.\n \n \nYou've convinced yourself that it's ok, because it's what you want to hear, and your pride movement told you it was.\n\n \n I'm convinced of what I know by a lot of reading and reasoning and by being secure and confident in myself. It wasn't simply by seeing a rainbow flag waved or raised. That's how I can see the bs of the anti-gay industry.\n \n \nThe change from polygamy to monogamy was a good change, and had nothing to do with gender.\n\n \n This particular change is about gender, otherwise it wouldn't be another change. It's a good change.\n \n \nSure, things can change, particularly when one group of people selfishly take another group's institution and try to redefine it to fit their way of living.\n\n \n Why is this a selfish change? Gay couples have the same needs as straight couples for the institution with all of its tangible and intangible benefits.\n \n \nBut law or no law, to many of us marriage will always be an opposite-sex matter no matter now much others twist it and warp it to fit the arrangement-of-the-month from whatever group comes along.\n\n \n That sounds like bitterness. We are not talking about giving it to a different group every month, come now. \n \n \nSame-sex unions aren't marriage in the true sense, in my view. You HAVE the right to be married, but of course that would mean you'd have to marry an opposite-sex person than you are.\n\n \n I live in Canada, so I do have the right to marry someone of the same sex. Your choice is like telling a straight person he or she can marry someone of the same sex.\n \n \nBut since it's unfair to deny benefits to gay people because of the guarantee of equal protection, you still have couple's benefits under our constitution, even with a gay live-in relationship.\n\n \n Well, how would it \"warp\" marriage then, as you say, if it wouldn't warp or twist things here?\n \n \nSo you should be granted those benefits. But not by redefining marriage.\n", 
   {}, 
   193104, 
   null, 
   1137655260.0
  ], 
  [
   193230, 
   null, 
   "jyoshu", 
   "The fact that something is a belief does not determine it is rational. People believe all sorts of wild and uneducated and paranoid things.\n\n \n And they believe things that aren't \"wild and uneducated and paranoid.\" For the context of the moral debate, whether or not it fits some arbitrary gay-pride standard of rationality is irrelevant.\n \n \nPeople want to be respected for who they are and how they express their difference from you. You want them to treat you that same way.\n\n \n No one is arguing they not be respected. That's a different debate than the moral one. I agree with you on the respect issue.\n \n \nI'm convinced of what I know by a lot of reading and reasoning and by being secure and confident in myself. It wasn't simply by seeing a rainbow flag waved or raised. That's how I can see the bs of the anti-gay industry.\n\n \n Sorry, but I don't believe you. I've seen blind ahherence too many times in your movement, and you fit the bill quite well. No offense, but it's true.\n \n \nWhy is this a selfish change? Gay couples have the same needs as straight couples for the institution with all of its tangible and intangible benefits.\n\n \n It's selfish for people to take what's not theirs. You should get benefits, but marriage is a straight thing.\n \n \nThat sounds like bitterness. We are not talking about giving it to a different group every month, come now. \n\n \n If not, we might as well be.\n \n \nYour choice is like telling a straight person he or she can marry someone of the same sex.\n\n \n Then it wouldn't be marriage.", 
   {}, 
   193208, 
   null, 
   1137687780.0
  ], 
  [
   193247, 
   null, 
   "tonybrown74", 
   "If our rights come via our \"Creator\" in the Declaration of Independence, and if the majority of our founding fathers were Christians or other God-believing men of faith (most of whom were Biblically based), then it is proper to employ the rationale of the God they believe in to decide whether gay marriage should or should not be legalized. It's also proper and American for the populace itself to decide, which is what has occurred in many states where gay marriages have been outlawed.\n\n \n 1) Please cite evidence where G-d says that gay marriage is wrong.\n \n 2) If the sexes are treated equally under the law, please cite your logic in determining that two people of the same sex should not be married.\n \n 3) Romer v. Evans states that a state cannot make a group of citizens strangers to its laws. That said, how is it constitutional to allow the majority to vote against the rights of a minority without due process?", 
   {}, 
   193134, 
   null, 
   1137694920.0
  ], 
  [
   193260, 
   null, 
   "JakeCJB", 
   "And they believe things that aren't \"wild and uneducated and paranoid.\" For the context of the moral debate, whether or not it fits some arbitrary gay-pride standard of rationality is irrelevant.\n\n \n Please explain what a \"gay-pride standard of rationality\" is, in your view. Please explain your standard of rationality. If it is simply a belief, when no logical process is shown as to how you obtained the belief, we are not talking about rationality. It is ridiculous to talk about different standards of rationality and logic, as tonybrown has mentioned. However, I feel as though we are talking to a brick wall. Your mind is narrow and closed, to the point where either you don't know you are not arguing with logic, or perhaps know this, but your simple fear of the unknown trumps your ability to think.\n \n \nNo one is arguing they not be respected. That's a different debate than the moral one. I agree with you on the respect issue.\n\n \n You don't respect someone by telling them how they express their difference from you is not okay. It is not treating others as you would want to be treated. It's not moral.\n \n \nSorry, but I don't believe you. I've seen blind ahherence too many times in your movement, and you fit the bill quite well. No offense, but it's true.\n\n \n If you really believe this, tell me what I am being blind to. What would you like me to consider?\n \n \nIt's selfish for people to take what's not theirs. You should get benefits, but marriage is a straight thing.\n\n \n This is circular. It's saying marriage simply is straight, end of debate, don't question.\n \n \nIf not, we might as well be.\n\n \n How do you figure this?", 
   {}, 
   193230, 
   null, 
   1137700380.0
  ], 
  [
   193266, 
   null, 
   "jyoshu", 
   "Please explain what a \"gay-pride standard of rationality\" is, in your view. Please explain your standard of rationality. If it is simply a belief, when no logical process is shown as to how you obtained the belief, we are not talking about rationality.\n\n \n The point is that it doesn't matter. I believe it is rational on the basis of preventing harm, but even if it weren't, it makes no difference. People are entitled to their morality, regardless of whether it fits any certain person's rationality.\n \n \nIt is ridiculous to talk about different standards of rationality and logic, as tonybrown has mentioned.\n\n \n Absolutely! It's ridiculous because it makes no difference. It not only varies from person to person, it is a serparate issue from the moral debate.\n \n \nHowever, I feel as though we are talking to a brick wall. Your mind is narrow and closed, to the point where either you don't know you are not arguing with logic, or perhaps know this, but your simple fear of the unknown trumps your ability to think.\n\n \n The conclusions I've come to came about, in part, as a result of thinking things through. Personally, I don't get why you are so hung up with other peoples' morality--it's their right and it's their business. Whether or not it fits your definition of what's rational doesn't matter. I've already told you I am in favor of gay couples getting benefits.\n \n \nYou don't respect someone by telling them how they express their difference from you is not okay.\n\n \n For someone who believe that type of expression is wrong, it's a greater act of respect to say so than to not. But even aside from that, no one said you are entitled to everyone's respect. Where did you get the idea that you automatically are?\n \n \nIf you really believe this, tell me what I am being blind to. What would you like me to consider?\n\n \n A lot of the gay rights industry is about demonization of Christianity and it's people. You are blind to that, because you don't see it (or if you do, you don't acknowledge it, which is worse). \n \n You are also blind to the fact that people are entitled to whatever morality they want, and you have no say in that matter. \n \n And you are blind to the fact that the moral issue and the the issue of abuse toward gays are two different issues. Actually I suspect you know they are separate, but you intentionally blur the line at any chance you get because it's a way (albeit a a disengenuous one) to fight the moral issue.", 
   {}, 
   193260, 
   null, 
   1137701400.0
  ], 
  [
   193273, 
   null, 
   "tonybrown74", 
   "The point is that it doesn't matter. I believe it is rational on the basis of preventing harm, but even if it weren't, it makes no difference. People are entitled to their morality, regardless of whether it fits any certain person's rationality.\n\n \n It sure the hell does matter.\n \n If you are going to use your morality to restrict my rights or deny me due process, then you damn well need to have a better justification than, \"my morals say this!\"\n \n \nThe conclusions I've come to came about, in part, as a result of thinking things through. Personally, I don't get why you are so hung up with other peoples' morality--it's their right and it's their business. Whether or not it fits your definition of what's rational doesn't matter. I've already told you I am in favor of gay couples getting benefits.\n\n \n Because you are using your morals as a basis to restrict my rights. Once you do that, your morality gets called into question.\n \n \nA lot of the gay rights industry is about demonization of Christianity and it's people. You are blind to that, because you don't see it (or if you do, you don't acknowledge it, which is worse). \n\n \n Now it's an industry? My, how far you'll reach.\n \n But most, if not all of the objection to gay-rights comes from evangelicals christians. You choose to deny that because you do not want to admit that there is a dark side to Christianity (the religion).\n \n \nYou are also blind to the fact that people are entitled to whatever morality they want, and you have no say in that matter. \n \n \n Everyone is not entitled to their morality. Religions that condone or promote cannibalism, mass-suicides, child rape, polygamy and human sacrifice, are severely curtailed ore banned.\n \n \n And you are blind to the fact that the moral issue and the the issue of abuse toward gays are two different issues. Actually I suspect you know they are separate, but you intentionally blur the line at any chance you get because it's a way (albeit a a disengenuous one) to fight the moral issue.\n\n \n They are identical because you say that you get your morality from the same place. Your bible says nothing about two people of the same sex joining in matrimony. Yet you would deny gay people marriage based on it anyway. Arguably, you can say that the bible does speak out about people of the same-sex being intimate, yet you would allow benefits based on that intimacy?", 
   {}, 
   193266, 
   null, 
   1137706500.0
  ], 
  [
   193279, 
   null, 
   "BobNelson2", 
   "The point is that it doesn't matter. I believe it is rational on the basis of preventing harm, but even if it weren't, it makes no difference. People are entitled to their morality, regardless of whether it fits any certain person's rationality.\n\n \n Speaking of harm....\n \n http://www.365gay.com/Newscon06/01/011906njAppeal.htm\n \n New Jersey Town Rejects Plea From Dying Worker", 
   {}, 
   193266, 
   null, 
   1137708000.0
  ], 
  [
   193280, 
   null, 
   "BobNelson2", 
   "It's selfish for people to take what's not theirs. You should get benefits, but marriage is a straight thing.\n\n \n Someone never learned to share.", 
   {}, 
   193230, 
   null, 
   1137708060.0
  ], 
  [
   193282, 
   null, 
   "jyoshu", 
   "You know, it would make so much more sense for gay lobbyists to level their scripted accusations of \"use your morality to restrict my rights or deny me due process\" toward those who actually do that and particularly those in power to do that rather than focusing those accusations on a discussion forum at people who don't restrict rights. Holding TO the moral view isn't the same as using it or imposing it. Would that some here would come to see the difference.", 
   {}, 
   193280, 
   null, 
   1137708360.0
  ], 
  [
   193292, 
   null, 
   "tonybrown74", 
   "You know, it would make so much more sense for gay lobbyists to level their scripted accusations of \"use your morality to restrict my rights or deny me due process\" toward those who actually do that and particularly those in power to do that rather than focusing those accusations on a discussion forum at people who don't restrict rights.\n\n \n So typical of you. Ignore the debate, and accuse us of targeting the wrong people in the wrong place.\n \n This is tired!\n \n \n Holding TO the moral view isn't the same as using it or imposing it. Would that some here would come to see the difference.\n\n \n Holding to your moral view is your concern. Using it to hold other people down is the problem, especially when there is no legal reasoning behind it.", 
   {}, 
   193282, 
   null, 
   1137711480.0
  ], 
  [
   193295, 
   null, 
   "MrWriteLA", 
   " especially when there is no legal reasoning behind it.\n Or logical reasoning. \n \n And as you've pointed out repeatedly (and as far as I can ascertain, futilely) what \"moral\" distinction makes civil unions acceptable and same-sex marriage not? (Since he's on record as approving one but not the other.) After all, it's the same \"behavior,\" whatever you call it. \n \n I've been through his ancient Book of Who To Hate countless times, and I'm damned if I can find the passage where it draws the line. (Or mentions either one, for that matter.)", 
   {}, 
   193292, 
   null, 
   1137711900.0
  ], 
  [
   193306, 
   null, 
   "beervolcano", 
   "Being left-handed is a state of being too, but it doesn't make me a civil rights minority. But then I'm not trying to get people to give me special rights because of it, either. State of being or not, it's silly to view it as some civil rights matter.\n\n and neither would having red hair because that doesn't really affect the way you live and there aren't any obstacles because of it (except that if yer a ginger kid, you have no soul, help find a cure!)\n \n no really, if you are left handed and there were no left handed scissors ever made, or no left handed cigarettes then you'd be pretty angry and feel discriminated against, wouldn't you?\n \n yer born gay, but you ain't born christian\n \n \n \nComparisons are valuable because they help to get a point across and to understand the issue better. \n \n \n \n People wanting to marry underage teenagers could make the same arguments you are.\n\n \n emoticon_wow \n \n isn't it obvious that there exists an age of consent ?", 
   {}, 
   192512, 
   null, 
   1137714720.0
  ], 
  [
   193317, 
   null, 
   "BobNelson2", 
   "I've been through his ancient Book of Who To Hate countless times\n\n \n Whom!!!!\n \n A prime example of Biblical revisionism at work...\n \n emoticon_xangel", 
   {}, 
   193295, 
   null, 
   1137717240.0
  ], 
  [
   193377, 
   null, 
   "JakeCJB", 
   "The point is that it doesn't matter. I believe it is rational on the basis of preventing harm, but even if it weren't, it makes no difference. People are entitled to their morality, regardless of whether it fits any certain person's rationality.\n \n \n \n Absolutely! It's ridiculous because it makes no difference. It not only varies from person to person, it is a serparate issue from the moral debate.\n \n \n \n The conclusions I've come to came about, in part, as a result of thinking things through. Personally, I don't get why you are so hung up with other peoples' morality--it's their right and it's their business. Whether or not it fits your definition of what's rational doesn't matter. I've already told you I am in favor of gay couples getting benefits.\n \n \n \n For someone who believe that type of expression is wrong, it's a greater act of respect to say so than to not. But even aside from that, no one said you are entitled to everyone's respect. Where did you get the idea that you automatically are?\n \n \n \n A lot of the gay rights industry is about demonization of Christianity and it's people. You are blind to that, because you don't see it (or if you do, you don't acknowledge it, which is worse). \n \n You are also blind to the fact that people are entitled to whatever morality they want, and you have no say in that matter. \n \n And you are blind to the fact that the moral issue and the the issue of abuse toward gays are two different issues. Actually I suspect you know they are separate, but you intentionally blur the line at any chance you get because it's a way (albeit a a disengenuous one) to fight the moral issue.\n\n \n Your so-called morality has no rational basis. Its basis is irrational, illogical, anti-gay or anti-homosexuality bias. Naturally you do not feel you need to give a logical reason. You don't have one. Your reason is that you simply don't like homosexuality. Issues of abuse of varying degrees towards a group happen due to those irrational biases, whatever they are.\n \n Demonizing Christianity, you say? I think most demonize the way it deals with gays, in some cases. If someone is talking about how everything Christianity is about is horrible, and needs to end, that person is at the extreme end of things.", 
   {}, 
   193266, 
   null, 
   1137742080.0
  ], 
  [
   193412, 
   null, 
   "jyoshu", 
   "I've been through his ancient Book of Who To Hate countless times\n\n \n Calling it that is a sure sign you've never given it an indepth reading at all.", 
   {}, 
   193295, 
   null, 
   1137773160.0
  ], 
  [
   193413, 
   null, 
   "jyoshu", 
   "Your so-called morality has no rational basis. Its basis is irrational, illogical, anti-gay or anti-homosexuality bias. Naturally you do not feel you need to give a logical reason. You don't have one. Your reason is that you simply don't like homosexuality. Issues of abuse of varying degrees towards a group happen due to those irrational biases, whatever they are.\n\n \n Whether I have a \"rational\" basis or not, it doesn't matter. Rationality doesn't have to be the sole basis of morality (or any at all). In fact, I'd hate to think I had a morality that WAS merely based on rationality.", 
   {}, 
   193377, 
   null, 
   1137773340.0
  ], 
  [
   193446, 
   null, 
   "MrWriteLA", 
   "Demonizing Christianity, you say? \n The poster in question has been painting gays with the same, broad anti-religion brush for months, despite the easily demonstrable fact that many gays--even on this very forum--are deeply religious and Christian. I myself, in another thread, posted about a dozen links to gay religious websites, many of which were Christian. He persistently chooses to ignore this fact, in favor of trying to create the impression that homosexuality is inherently anti-religious (while not being inherent itself, apparently).\n \n No gay person \"demonizes\" the beliefs of Gene Robinson, Peter Gomes, Shelby Spong, or Desmond Tutu--true Christians all. What they do object to, and rightly, is the despicable attitudes of those who use religion--any religion--to demonize gays, as the poster in question has done in post after post. The Phelpses, the Sheldons, the Falwells, the Robertsons. That's not \"Christianity.\" Christ would vomit to hear their lies about gay people. That's anti-Christianity, and it deserves to be demonized.\n \n We don't demonize Christianity. The true Word of Christ is inclusive, and one of love. We demonize the blasphemers who twist that Word until it means its opposite, which is about as evil a thing to do as can be imagined. Who better to demonize than those who do that?", 
   {}, 
   193377, 
   null, 
   1137780960.0
  ], 
  [
   193452, 
   null, 
   "Steeeeve", 
   "Your so-called morality has no rational basis. Its basis is irrational, illogical, anti-gay or anti-homosexuality bias. Naturally you do not feel you need to give a logical reason. You don't have one. Your reason is that you simply don't like homosexuality. Issues of abuse of varying degrees towards a group happen due to those irrational biases, whatever they are.\n \n Demonizing Christianity, you say? I think most demonize the way it deals with gays, in some cases. If someone is talking about how everything Christianity is about is horrible, and needs to end, that person is at the extreme end of things.\n\n \n I would say a persons view on what is logical is rather limited. Logic is also limited by our understanding which we assume is logical to start out with.....So Jyoshu doesn't like gay-marriage promoting a gay lifestyle because it is against his moral code, this is 100% logical in my view...if you don't believe in something then you don't believe in it...a=a. So tell me, how is logical to suppot homosexual causes..since you think logic has everything to do with it.", 
   {}, 
   193377, 
   null, 
   1137781560.0
  ], 
  [
   193453, 
   null, 
   "jyoshu", 
   "We don't demonize Christianity. The true Word of Christ is inclusive, and one of love. We demonize the blasphemers who twist that Word until it means its opposite, which is about as evil a thing to do as can be imagined. Who better to demonize than those who do that?\n\n \n Of course not--you just refer to the Christian Bible as the \"Book of Who to Hate.\" Why, one is absolutely swept away with such friendliness and respect toward Christians and what they hold sacred! emoticon_rolleyes", 
   {}, 
   193446, 
   null, 
   1137782100.0
  ], 
  [
   193454, 
   null, 
   "jyoshu", 
   "I would say a persons view on what is logical is rather limited. Logic is also limited by our understanding which we assume is logical to start out with.....So Jyoshu doesn't like gay-marriage promoting a gay lifestyle because it is against his moral code, this is 100% logical in my view...if you don't believe in something then you don't believe in it...a=a. So tell me, how is logical to suppot homosexual causes..since you think logic has everything to do with it.\n\n \n Can you imagine living under a morality solely guided by cold logic as opposed to also principle and compassion? I'd hate to think my morality was such.", 
   {}, 
   193452, 
   null, 
   1137782280.0
  ], 
  [
   193462, 
   null, 
   "JakeCJB", 
   "Can you imagine living under a morality solely guided by cold logic as opposed to also principle and compassion? I'd hate to think my morality was such.\n\n \n The only principal of your morality is the principal of your dislike of homosexuality.", 
   {}, 
   193454, 
   null, 
   1137784680.0
  ], 
  [
   193466, 
   null, 
   "jyoshu", 
   "The only principal of your morality is to state that you don't like homosexuality.\n\n \n Not at all. Not only is that particular sentiment NOT behind any part of my morality, views about homosexuality are not even remotely close to being the extent of my moral belief.\n \n This, IMO, is pretty typical of most Christians, including most evangelicals. I honestly think many gay activists would be quite surprised if they went to a typical evangelical church, at how little the issue of homosexuality is usually even brought up. I think what keeps it fueled is the gay pride movement constantly trying to provoke responses on the matter.", 
   {}, 
   193462, 
   null, 
   1137785220.0
  ], 
  [
   193470, 
   null, 
   "hucklebuck", 
   "Being left-handed is a state of being too, but it doesn't make me a civil rights minority. But then I'm not trying to get people to give me special rights because of it, either. State of being or not, it's silly to view it as some civil rights matter.\n\n \n On a lighter note:\n \n There is a left-handed scholarship, Juniata's Buckley Scholarship:\n \n http://money.cnn.com/2004/02/24/pf/college/scholarships/\n \n Also, here is yahoo's directory for left-handed sites, which it does list as a culture or group:\n \n http://dir.yahoo.com/Society_and_Culture/Cultures_and_Groups/Left_Handers/\n \n And here's the left-handed keyboard you've been looking for;\n \n http://ergokomfort.com/catalog/4096_left_handed_keyboards_3922368.htm", 
   {}, 
   192512, 
   null, 
   1137786720.0
  ], 
  [
   193483, 
   null, 
   "BobNelson2", 
   "In fact, I'd hate to think I had a morality that WAS merely based on rationality.\n\n \n Don't worry. You're in no danger of being ethical...", 
   {}, 
   193413, 
   null, 
   1137789540.0
  ], 
  [
   193485, 
   null, 
   "BobNelson2", 
   "I honestly think many gay activists would be quite surprised if they went to a typical evangelical church, at how little the issue of homosexuality is usually even brought up.\n\n \n Been there, done that, heard enough, walked out.", 
   {}, 
   193466, 
   null, 
   1137789720.0
  ], 
  [
   193490, 
   null, 
   "Steeeeve", 
   "The only principal of your morality is the principal of your dislike of homosexuality.\n\n Do you just make this stuff up? Logic doesn't work so well with morality. I could ask you why you don't logically kill someone. If we took that make far enough you would find out that you have a moral belief against killing people (assuming you don't want to kill people of course). We then would ask where you get this belief from...logic? How is it logical?...well you got a moral belief against..and a big circle comes. Moral beliefs based on faith end on the faith note...they don't go in circles.", 
   {}, 
   193462, 
   null, 
   1137791040.0
  ], 
  [
   193491, 
   null, 
   "JakeCJB", 
   "Not at all. Not only is that particular sentiment NOT behind any part of my morality, views about homosexuality are not even remotely close to being the extent of my moral belief.\n\n \n Anti-homosexuality bias, is the basis of your morality on homosexuality.", 
   {}, 
   193466, 
   null, 
   1137791220.0
  ], 
  [
   193493, 
   null, 
   "JakeCJB", 
   "Do you just make this stuff up? Logic doesn't work so well with morality. I could ask you why you don't logically kill someone. If we took that make far enough you would find out that you have a moral belief against killing people (assuming you don't want to kill people of course). We then would ask where you get this belief from...logic? How is it logical?...well you got a moral belief against..and a big circle comes. Moral beliefs based on faith end on the faith note...they don't go in circles.\n\n \n Yes, it is logical, the belief that murder is immoral. It's in everyone's mutual self-interest to believe that murder is wrong. There is a perceivable threat.", 
   {}, 
   193490, 
   null, 
   1137791460.0
  ], 
  [
   193499, 
   null, 
   "jyoshu", 
   "Anti-homosexuality bias, is the basis of your morality on homosexuality.\n\n \n Bzzzt. Wrong again. emoticon_xangel", 
   {}, 
   193491, 
   null, 
   1137792240.0
  ], 
  [
   193500, 
   null, 
   "JakeCJB", 
   "Bzzzt. Wrong again. emoticon_xangel\n\n \n It is correct. Either yourself, your religion, or your higher power or being, simply dislike homosexuality. There is nothing else involved.", 
   {}, 
   193499, 
   null, 
   1137792480.0
  ], 
  [
   193517, 
   null, 
   "MrWriteLA", 
   "Either yourself, your religion, or your higher power or being, simply dislike homosexuality. There is nothing else involved.\n Certainly no evidence of anything else has been presented... though it has been requested, time and time again.", 
   {}, 
   193500, 
   null, 
   1137798540.0
  ], 
  [
   193529, 
   null, 
   "Steeeeve", 
   "Yes, it is logical, the belief that murder is immoral. It's in everyone's mutual self-interest to believe that murder is wrong. There is a perceivable threat.\n\n \n I disagree that it is in everyones interest that murder is illegal. To someone that killed someone it seems like it is not in their interest at all.\n \n I must say though...this thread is one of the worst I have seen....talk about going no where and insulting to get there. \n \n Also, logic is higly overrated because everyone has a random idea of what is logical. The only logic that plays in with morals is consistentency.", 
   {}, 
   193493, 
   null, 
   1137801480.0
  ], 
  [
   193531, 
   null, 
   "jyoshu", 
   "It is correct. Either yourself, your religion, or your higher power or being, simply dislike homosexuality. There is nothing else involved.\n\n \n I already told you, my conclusions came from rationality--I just came to different conclusions than you did. But there's no personal animosity I have toward homosexuality or homosexuals. As far as my \"higher power\", there's just not much I can do about that. You'll have to take it up with the \"higher power.\" :) \n \n The real problem here is that you can't seem to separate the idea of a moral belief about a behavior from the concept of judging the behavior. Moral belief about something is not the same as making a value judgement about it, or the people involved. It doesn't mean gay people are bad. At least in my view. I think you are having a hard time with this because you automatically associate moral view with judgementalism, and that's not the case.", 
   {}, 
   193500, 
   null, 
   1137801840.0
  ], 
  [
   193613, 
   null, 
   "JakeCJB", 
   "I disagree that it is in everyones interest that murder is illegal. To someone that killed someone it seems like it is not in their interest at all.\n\n \n That person will then have to look over his or her shoulder, wondering if he or she will be murdered, and so on and so on.", 
   {}, 
   193529, 
   null, 
   1137830520.0
  ], 
  [
   193619, 
   null, 
   "JakeCJB", 
   "I already told you, my conclusions came from rationality--I just came to different conclusions than you did.\n\n \n No, there is no rational thinking involved in your conclusion that homosexuality is wrong. It's a presupposition. You beg the question, why is it wrong? You have no answer, but expect us to just accept your assertion that homosexuality is wrong, to share your morality. I wish that people will continue to move away from your morality. My morals here are based on principals, but they are logical. They recognize that no person is an island, and we are inter-dependent socially as a species. Everyone wants to be fully socially accepted, and no one wants to be excluded in any way. There should be a very good reason to do so, when we act that way toward our fellow humans. This is not the case with non-acceptance of homosexuality. We can see that gay people, acting homosexually, fall in love, have families, make comitments, and do not harm society. \n \n \nBut there's no personal animosity I have toward homosexuality or homosexuals.\n\n \n You don't like it from what I can tell.\n \n \nAs far as my \"higher power\", there's just not much I can do about that. You'll have to take it up with the \"higher power.\" :)\n\n \n Such a higher power, who gives us the ability to think and to reason, but dislikes it when we put that into action with homosexuality or homosexuals, or any select group, isn't worth much in my book. I don't believe in such a god or higher power. \n \n \nThe real problem here is that you can't seem to separate the idea of a moral belief about a behavior from the concept of judging the behavior. Moral belief about something is not the same as making a value judgement about it, or the people involved. It doesn't mean gay people are bad. At least in my view. I think you are having a hard time with this because you automatically associate moral view with judgementalism, and that's not the case.\n\n \n We judge, according to our morals. Our morals are based on values and judgements. This course of action is acceptable, that one is not, this is right, that is wrong. When you said same-sex relations were \"not okay\", you were judging same-sex relations as \"not okay\". Yes, I am having a difficult time understanding.", 
   {}, 
   193531, 
   null, 
   1137833880.0
  ], 
  [
   193732, 
   null, 
   "jyoshu", 
   "No, there is no rational thinking involved in your conclusion that homosexuality is wrong.\n\n \n In your opinion. But since we need to get to the bottom of this I guess, go ahead and give me the phone number and address for the [i]Natl Rationalism Committee that sets all the standards. That way I can call them and find out who's standard of what's best is the correct one.\n \n \nYou beg the question, why is it wrong? You have no answer\n\n \n I've been through this already with you, what I consider harmful about it. You've never refuted it or shown anything that disproves anything.\n \n \nSuch a higher power, who gives us the ability to think and to reason, but dislikes it when we put that into action with homosexuality or homosexuals, or any select group, isn't worth much in my book. I don't believe in such a god or higher power.\n\n \n Well when you judge everything in life, including religious belief through the lens of one single issue, I'm not surprised. It's pretty arrogant to assume that God's or any person's stance on YOUR pet issue is the sole determining factor in whether or not God or a person is bad and evil. And again, in my case reason IS part of the reason that I believe gay relations are bad.\n \n \nWe judge, according to our morals.\n\n \n But that doesn't mean we HAVE to judge. It certainly doesn't mean judgement is automatically there when it's not, in the case of what you think.\n \n \nWhen you said same-sex relations were \"not okay\", you were judging same-sex relations as \"not okay\". Yes, I am having a difficult time understanding.\n\n \n But not in the sense of a value judgement. You are only seeing this in the sense of inferiority versus not being inferior, and it's not that way--that doesn't even apply. That's the crux of the problem, and has been all along.", 
   {}, 
   193619, 
   null, 
   1137875880.0
  ], 
  [
   193744, 
   null, 
   "JakeCJB", 
   "In your opinion. But since we need to get to the bottom of this I guess, go ahead and give me the phone number and address for the [i]Natl Rationalism Committee that sets all the standards. That way I can call them and find out who's standard of what's best is the correct one.\n\n \n There are standards for logical thinking. I am glad to see people are engaging in this more and more when it comes to homosexuality, and are moving away from your presupposed assertion. I'm glad to see people are not afraid to ask \"why\", because they want a society that is inclusive.\n \n \nI've been through this already with you, what I consider harmful about it. You've never refuted it or shown anything that disproves anything.\n\n \n You have put up a smokescreen of propaganda that has been easily refuted as nothing but fallacies and lies. You have no evidence or proof that homosexuality is harmful. \n \n \nWell when you judge everything in life, including religious belief through the lens of one single issue, I'm not surprised. It's pretty arrogant to assume that God's or any person's stance on YOUR pet issue is the sole determining factor in whether or not God or a person is bad and evil.\n\n \n It is one factor. I made it clear, it is the way in which gay people or any other group are excluded or not accepted, without a reason why, which is the issue.\n \n \nAnd again, in my case reason IS part of the reason that I believe gay relations are bad.\n\n \n You fail to show any reason. You state that it is immoral. You state that it is harmful. These are not reasons.\n \n \nBut that doesn't mean we HAVE to judge. It certainly doesn't mean judgement is automatically there when it's not, in the case of what you think.\n\n \n You can say something is \"not okay\" or not acceptable or wrong, without judging it?\n \n \nBut not in the sense of a value judgement. You are only seeing this in the sense of inferiority versus not being inferior, and it's not that way--that doesn't even apply. That's the crux of the problem, and has been all along.\n\n \n So you are saying homosexuality is just not part of your personal morality, and you do not try to impart that to others as a vaule? You would never come to a message board and try to convince people that homosexuality is harmful, and you would never try to say that homosexuality doesn't fit the ideal or the value of marriage? I think you are making a value judgment. Unless value judgment means something different to you.", 
   {}, 
   193732, 
   null, 
   1137877980.0
  ], 
  [
   193754, 
   null, 
   "jyoshu", 
   "There are standards for logical thinking.\n \n You fail to show any reason. You state that it is immoral. You state that it is harmful. These are not reasons.\n\n \n Alll right, I've explained this over and over, but I'm going to explain it one more time. Please read all this carefully. Moral beliefs don't have to be rooted in anyone's particular version of 'reason.' I don't get why you are making such a big deal out of this. People all the time hold to moral views without necessarily running them through a logical process, and it's no big deal. Religious people often hold to the moral view that belief in God is a good thing too. So what? If rationality alone is to be the sole standard for morality, then any morality would not be able to have religion involved AT ALL, because religion is based on faith. So one could say that your stance that reason has to be what morality is based on would be intolerant toward religious people--it only allows for atheism. Sorry, you can keep that; I want no part in it. This idea of yours that morality has to be based on reason is just silly.\n \n What DOES have to be rooted in reason is law. Everyone is entitled to equal protection; because of that, I reason that gay people should have the same benefits (protections) that married people have. So that's why I support the idea that gay people should have a form of civil unions that provide the same benefits. Such a structure should be put in place.\n \n But that's a wholly different matter than morality, which is a subjective matter.\n \n \nYou have put up a smokescreen of propaganda that has been easily refuted as nothing but fallacies and lies. You have no evidence or proof that homosexuality is harmful. \n\n \n You've refuted nothing. You only given a \"no it's not\" sort of answer. \n \n \nIt is one factor. I made it clear, it is the way in which gay people or any other group are excluded or not accepted, without a reason why, which is the issue.\n\n \n \"Accepting gay people\" and moral belief about a behavior are not the same thing.\n \n \nYou can say something is \"not okay\" or not acceptable or wrong, without judging it?\n\n \n Without making a value judgement? Of course! Can't you?\n \n \nSo you are saying homosexuality is just not part of your personal morality, and you do not try to impart that to others as a vaule? You would never come to a message board and try to convince people that homosexuality is harmful, and you would never try to say that homosexuality doesn't fit the ideal or the value of marriage? \n\n \n I'm not here to convert anyone. I am here because I enjoy debate and discussion.\n \n \nI think you are making a value judgment.\n\n \n Well, you're certainly entitled to be wrong all you want. emoticon_xangel", 
   {}, 
   193744, 
   null, 
   1137881520.0
  ], 
  [
   193775, 
   null, 
   "JakeCJB", 
   "Alll right, I've explained this over and over, but I'm going to explain it one more time. Please read all this carefully. Moral beliefs don't have to be rooted in anyone's particular version of 'reason.' I don't get why you are making such a big deal out of this. People all the time hold to moral views without necessarily running them through a logical process, and it's no big deal. Religious people often hold to the moral view that belief in God is a good thing too. So what? If rationality alone is to be the sole standard for morality, then any morality would not be able to have religion involved AT ALL, because religion is based on faith. So one could say that your stance that reason has to be what morality is based on would be intolerant toward religious people--it only allows for atheism. Sorry, you can keep that; I want no part in it. This idea of yours that morality has to be based on reason is just silly.\n\n \n The moral beliefs that stand the test of time, have an element of reason. If one were to assert that theism(belief in God) is immoral, would you accept that as a rational, logical, unbiased, belief or morality? I doubt you would, nor should you. Nor would anyone hopefully for long, once they thought on it further. There are logical reasons to believe it is moral, or at least neutral. It doesn't harm any one person or society for one thing. \n \n \nWhat DOES have to be rooted in reason is law. Everyone is entitled to equal protection; because of that, I reason that gay people should have the same benefits (protections) that married people have. So that's why I support the idea that gay people should have a form of civil unions that provide the same benefits. Such a structure should be put in place.\n\n \n It is also about equal recognition under the law.\n \n \nYou've refuted nothing. You only given a \"no it's not\" sort of answer.\n\n \n You are making the claim, so the onus is on you to prove it. Generalizations about homosexuals, do not prove a causal link that homosexuality causes harm. That applies to any group.\n \n \n\"Accepting gay people\" and moral belief about a behavior are not the same thing.\n\n \n It's about acceptance of the whole person. Gay people are the only people who behave, homosexually. What if one said he accepts theists, but does not accept theistic behaviour? I don't think that makes much sense. People behave according to who they are in these cases.\n \n \nWithout making a value judgement? Of course! Can't you?\n\n \n How do you define value judgement? Does not someone who accepts homosexuality have different values than you have? Isn't it a value of accepting homosexuality?", 
   {}, 
   193754, 
   null, 
   1137895500.0
  ], 
  [
   194869, 
   null, 
   "tonybrown74", 
   "I already told you, my conclusions came from rationality--I just came to different conclusions than you did. But there's no personal animosity I have toward homosexuality or homosexuals. As far as my \"higher power\", there's just not much I can do about that. You'll have to take it up with the \"higher power.\" :) \n\n \n Rationality my left cheek. You cannot show any harm that comes from two people of the same sex having consensual intercourse. \"It is an abomination,\" is not a rational argument.\n \n Belief in a higher power is no justification for discrimination.\n \n \nThe real problem here is that you can't seem to separate the idea of a moral belief about a behavior from the concept of judging the behavior. Moral belief about something is not the same as making a value judgement about it, or the people involved. It doesn't mean gay people are bad. At least in my view. I think you are having a hard time with this because you automatically associate moral view with judgementalism, and that's not the case.\n\n \n No, my friend. The actual problem is that your morals are based on nothing but a puff of smoke. You can't prove that god exists, yet god says so is supposed to be enough reason for you to use your morals to deny my rights?\n \n I don't think so.", 
   {}, 
   193531, 
   null, 
   1138298100.0
  ], 
  [
   194880, 
   null, 
   "jyoshu", 
   "The moral beliefs that stand the test of time, have an element of reason. \n\n \n Who's reason? Again, what's the address and phone number for this apparently well-known Standards-of-Reason Office? I want to meet the comittee members! emoticon_xangel \n \n \nIf one were to assert that theism(belief in God) is immoral, would you accept that as a rational, logical, unbiased, belief or morality? \n\n \n It doesn't have to be logical and \"rational.\" Belief in God and God's statutes are often a matter of faith.\n \n \nIt is also about equal recognition under the law.\n\n \n That's the legal issue--a different issue. I'm with you on that one. You do realize that your view doesn't even allow for the possibility of personal belief that homosexuality is immoral yet full support of gay rights, don't you?\n \n \nYou are making the claim, so the onus is on you to prove it. Generalizations about homosexuals, do not prove a causal link that homosexuality causes harm. That applies to any group.\n\n \n The evidence has been presented here numerous times. You don't like it, so you do the on-line equivilent of covering your ears.\n \n \nIt's about acceptance of the whole person. Gay people are the only people who behave, homosexually. What if one said he accepts theists, but does not accept theistic behaviour? I don't think that makes much sense. People behave according to who they are in these cases.\n\n \n Nope. Legal acceptance and personal moral acceptance are two different matters. This is always the case in law. For instance, there are many people out there who dislike guns--they just don't like them, but they still support the 2nd amendment. They know that law and their moral belief are two different things.\n \n You're a smart guy, and there is no doubt to me that you know this. I think, in all honesty, you're just being argumentative here. You have to be. It's hard for me to believe you don't get this. If you really believed the moral issue and the legal one can't be separate, then you'd be condemning every supporter of gat rights that also had moral qualms about it, that ever lived. And that's not that unusual of a case.\n \n \nHow do you define value judgement? Does not someone who accepts homosexuality have different values than you have? Isn't it a value of accepting homosexuality?\n\n \n You tell me. You're the one who seems to assume that the moral issue I and others have is an issue of worth or inferiority of gay people when it's in fact not. If that's not what you think is happening, then say so.", 
   {}, 
   193775, 
   null, 
   1138300500.0
  ], 
  [
   194903, 
   null, 
   "BobNelson2", 
   "Nope. Legal acceptance and personal moral acceptance are two different matters. This is always the case in law. For instance, there are many people out there who dislike guns--they just don't like them, but they still support the 2nd amendment. They know that law and their moral belief are two different things.\n \n You're a smart guy, and there is no doubt to me that you know this. I think, in all honesty, you're just being argumentative here. You have to be. It's hard for me to believe you don't get this. If you really believed the moral issue and the legal one can't be separate, then you'd be condemning every supporter of gat rights that also had moral qualms about it, that ever lived. And that's not that unusual of a case.\n\n \n You make a very convincing argument that folks like you can support fully equal civil marriage. So, why don't you?", 
   {}, 
   194880, 
   null, 
   1138306860.0
  ], 
  [
   194933, 
   null, 
   "jyoshu", 
   "You make a very convincing argument that folks like you can support fully equal civil marriage. So, why don't you?\n\n \n They can if they want. I DO support fully equal civil benefits, which is really the issue anyway.", 
   {}, 
   194903, 
   null, 
   1138312440.0
  ], 
  [
   194941, 
   null, 
   "BobNelson2", 
   "They can if they want. I DO support fully equal civil benefits, which is really the issue anyway.\n\n \n So my partner and I can get \"benefitted\"????", 
   {}, 
   194933, 
   null, 
   1138313460.0
  ], 
  [
   194957, 
   null, 
   "jyoshu", 
   "So my partner and I can get \"benefitted\"????\n\n \n I don't know. But I bet there's a clergyperson somewhere that'll do it if you pay 'em enough . . . emoticon_xgood \n As for benefits, you should get them. There's no legal reason not too.", 
   {}, 
   194941, 
   null, 
   1138317240.0
  ], 
  [
   194986, 
   null, 
   "BobNelson2", 
   "I don't know. But I bet there's a clergyperson somewhere that'll do it if you pay 'em enough . . . emoticon_xgood \n\n \n I have ZERO interest in having any member of the clergy do anything to or for me.\n \n \n \nAs for benefits, you should get them. There's no legal reason not too.\n\n \n But I can't get them because I can't get married here (not yet anyway) and I don't want to move to Massachusetts.", 
   {}, 
   194957, 
   null, 
   1138321980.0
  ], 
  [
   194990, 
   null, 
   "jyoshu", 
   "But I can't get them because I can't get married here (not yet anyway) and I don't want to move to Massachusetts.\n\n \n Yes, that's why we need a civil union system that, as far as benefits are concerned, does what marriage does now.", 
   {}, 
   194986, 
   null, 
   1138325100.0
  ], 
  [
   195014, 
   null, 
   "JakeCJB", 
   "Who's reason? Again, what's the address and phone number for this apparently well-known Standards-of-Reason Office? I want to meet the comittee members! emoticon_xangel\n\n \n You know what reason is. You do not use any one element of reason.\n \n \nIt doesn't have to be logical and \"rational.\" Belief in God and God's statutes are often a matter of faith.\n\n \n That is not logical and rational then.\n \n \nThat's the legal issue--a different issue. I'm with you on that one. You do realize that your view doesn't even allow for the possibility of personal belief that homosexuality is immoral yet full support of gay rights, don't you?\n\n \n I don't lagree with either situation that is irrational, illogical, or biased. Of course, people have the right to their beliefs, and I have the right to challenge them.\n \n \nThe evidence has been presented here numerous times. You don't like it, so you do the on-line equivilent of covering your ears.\n\n \n Oh my. Why don't you tell me specifically what so-called evidence you are referring to. Sorry, I don't just assume you are correct because you say you are correct.\n \n \nNope. Legal acceptance and personal moral acceptance are two different matters. This is always the case in law. For instance, there are many people out there who dislike guns--they just don't like them, but they still support the 2nd amendment. They know that law and their moral belief are two different things.\n \n You're a smart guy, and there is no doubt to me that you know this. I think, in all honesty, you're just being argumentative here. You have to be. It's hard for me to believe you don't get this. If you really believed the moral issue and the legal one can't be separate, then you'd be condemning every supporter of gat rights that also had moral qualms about it, that ever lived. And that's not that unusual of a case.\n\n \n I would challenge such a person as to what his or her moral beliefs are based on, sure. I didn't say these weren't separate.\n \n \nYou tell me. You're the one who seems to assume that the moral issue I and others have is an issue of worth or inferiority of gay people when it's in fact not. If that's not what you think is happening, then say so.\n\n \n Well, what is it about gay people and how they act, that is a threat to marriage? Why do gay people need to be kept out? You talk about homosexuality being harmful, without showing the proper evidence or proof of this. Surely, something that is harmful is inferior.", 
   {}, 
   194880, 
   null, 
   1138335180.0
  ], 
  [
   195128, 
   null, 
   "tonybrown74", 
   "Well, what is it about gay people and how they act, that is a threat to marriage? Why do gay people need to be kept out? You talk about homosexuality being harmful, without showing the proper evidence or proof of this. Surely, something that is harmful is inferior.\n\n \n \n This is the part of his argument that is so outlandishly dishonest. The action is the part that gives him the most angst, but he is willing to give benefits based on those actions. But gay marriage, which his [suspect] belief system does not mention at all, gives him the vapors.\n \n His argument is just tired.", 
   {}, 
   195014, 
   null, 
   1138404240.0
  ], 
  [
   195132, 
   null, 
   "jyoshu", 
   "You know what reason is. You do not use any one element of reason.\n\n \n At least whatever standards YOU think apply.\n \n \nI don't lagree with either situation that is irrational, illogical, or biased. Of course, people have the right to their beliefs, and I have the right to challenge them.\n\n \n As long as you realize that the position you and tonybrown74 take allows for NO ONE to support your rights without giving gay sex full personal moral acceptance. You have a very black-and-white scorched-earth way of looking at it. It's not like my position is THAT uncommon.\n \n \nI didn't say these weren't separate.\n\n \n Yet you are spending an awful lot of energy arguing with me about my position that they are.\n \n \nWell, what is it about gay people and how they act, that is a threat to marriage? Why do gay people need to be kept out? You talk about homosexuality being harmful, without showing the proper evidence or proof of this. Surely, something that is harmful is inferior.\n\n \n Regarding the moral question it's irrelevant whether you have what you consider proof or not. \"Inferior\" and \"harmful\" are not going hand-in-hand here. Not to me, anyway. Gay sex may be immoral (in my view), but gay people are not somehow less or inferior. That probably makes a good mischaracterization for the gay rights movement to make, but doesn't make it so.\n \n And Tonybrown74, I assume you'll be renouncing any and all support from any people out there that supports the rights and benefits for gay people, but doesn't agree with them from a moral standpoint. After all, that's what your position on this calls for and is the only way you could be consistent.", 
   {}, 
   195014, 
   null, 
   1138405140.0
  ], 
  [
   195136, 
   null, 
   "tonybrown74", 
   "As long as you realize that the position you and tonybrown74 take allows for NO ONE to support your rights without giving gay sex full personal moral acceptance. You have a very black-and-white scorched-earth way of looking at it. It's not like my position is THAT uncommon.\n \n ...\n \n Regarding the moral question it's irrelevant whether you have what you consider proof or not. \"Inferior\" and \"harmful\" are not going hand-in-hand here. Not to me, anyway. Gay sex may be immoral (in my view), but gay people are not somehow less or inferior. That probably makes a good mischaracterization for the gay rights movement to make, but doesn't make it so.\n \n And Tonybrown74, I assume you'll be renouncing any and all support from any people out there that supports the rights and benefits for gay people, but doesn't agree with them from a moral standpoint. After all, that's what your position on this calls for and is the only way you could be consistent.\n\n \n Complete non-sequitor. You are the one who is supposedly using your arbitrary (since that is your word Du Jour) morality to justify your opposition to same-sex marriage. I am simply challenging your beliefs. If you cannot justify your beliefs, you need to take it up with your religious leader/guide/shaman/whatever.", 
   {}, 
   195132, 
   null, 
   1138405740.0
  ], 
  [
   195140, 
   null, 
   "jyoshu", 
   "Complete non-sequitor. You are the one who is supposedly using your arbitrary (since that is your word Du Jour) morality to justify your opposition to same-sex marriage. I am simply challenging your beliefs. If you cannot justify your beliefs, you need to take it up with your religious leader/guide/shaman/whatever.\n\n \n It doesn't matter what my beliefs are. As far as you're concerned anyway. People can have whatever beliefs they want and that's not yours to dictate.", 
   {}, 
   195136, 
   null, 
   1138406280.0
  ], 
  [
   195143, 
   null, 
   "tonybrown74", 
   "It doesn't matter what my beliefs are. As far as you're concerned anyway. People can have whatever beliefs they want and that's not yours to dictate.\n\n \n \n People can have whatever beliefs they want. However if you, and those like you, use your beliefs to restrict my rights under the law, then I have every right to challenge them. You are using you beliefs as an argument for restricting my rights. You beleifs are now being called into question.\n \n Why do you not answer the question?", 
   {}, 
   195140, 
   null, 
   1138406520.0
  ], 
  [
   195148, 
   null, 
   "jyoshu", 
   "You are using you beliefs as an argument for restricting my rights. You beleifs are now being called into question.\n\n \n No, YOU'RE using my beliefs to claim I'm restricting your rights. I'm in no position to do that, and even if I were, I've already told you I'm all for you having couples' benefits.", 
   {}, 
   195143, 
   null, 
   1138410780.0
  ], 
  [
   195193, 
   null, 
   "JakeCJB", 
   "At least whatever standards YOU think apply.\n\n \n You said you don't have to use logic and reason, because you use faith. Are you using faith alone, or logic and reason?\n \n \nAs long as you realize that the position you and tonybrown74 take allows for NO ONE to support your rights without giving gay sex full personal moral acceptance. You have a very black-and-white scorched-earth way of looking at it. It's not like my position is THAT uncommon.\n\n \n No, it isn't that uncommon, but so what? I just want full acceptance when I express who I am, show how I am different from the majority, like everyone else wants.\n \n \nRegarding the moral question it's irrelevant whether you have what you consider proof or not. \"Inferior\" and \"harmful\" are not going hand-in-hand here. Not to me, anyway. Gay sex may be immoral (in my view), but gay people are not somehow less or inferior. That probably makes a good mischaracterization for the gay rights movement to make, but doesn't make it so.\n\n \n Yes, gay people are all well and good to you, however expressing what makes them different from you, which is their homosexuality, is immoral in your view. So why is gay sex immoral? Tell me why some are so concerned with gay people's sex lives, as their morality? Without a rational explanation that is also a strange thing to be focused on.", 
   {}, 
   195132, 
   null, 
   1138431300.0
  ], 
  [
   195203, 
   null, 
   "JustineCredible", 
   "Come on guys, the fact that jyoshu has been posting dishonnest and duplicitously for over two years now should be a clue that his mind is made up and no amount of truth will ever confuse him.", 
   {}, 
   195193, 
   null, 
   1138435200.0
  ], 
  [
   195329, 
   null, 
   "jyoshu", 
   "Come on guys, the fact that jyoshu has been posting dishonnest and duplicitously for over two years now\n\n \n How so? Care to give specifics of what you mean by this or is this just another example of one of your hit-and-run hate posts?", 
   {}, 
   195203, 
   null, 
   1138504140.0
  ], 
  [
   195374, 
   null, 
   "JustineCredible", 
   "How so? Care to give specifics of what you mean by this or is this just another example of one of your hit-and-run hate posts?\n\n \n \n Whine all you wish, you do anyway. \n What you call \"Hit and Run\" I call RUNNING A BUSINESS!!! (Two actually...as well as working a third \"job\"), on top of getting my son ready for college, shuffling him off to various music \"gigs\" and the like. \n \n Some of us actually have LIVES...\n \n If that's a concept you just can't wrap your mind around, don't come whining to me about it. I'm not sorry your trivial complaints aren't on the top of my \"to do\" list. \n Why don't you just see that being gay/lesbian doesn't mean we're any different than anyone else (except that maybe we're a bit more \"INVOLVED\" as parents...something I see all too little of from straight parents)?", 
   {}, 
   195329, 
   null, 
   1138520880.0
  ], 
  [
   195456, 
   null, 
   "jyoshu", 
   "Whine all you wish, you do anyway. \n What you call \"Hit and Run\" I call RUNNING A BUSINESS!!! (Two actually...as well as working a third \"job\"), on top of getting my son ready for college, shuffling him off to various music \"gigs\" and the like. \n \n Some of us actually have LIVES...\n \n If that's a concept you just can't wrap your mind around, don't come whining to me about it. I'm not sorry your trivial complaints aren't on the top of my \"to do\" list. \n Why don't you just see that being gay/lesbian doesn't mean we're any different than anyone else (except that maybe we're a bit more \"INVOLVED\" as parents...something I see all too little of from straight parents)?\n\n \n Well, if you aren't willing to take the time to back up what you said and give specifics, I'll give your post all the attention and thought it deserves. :)", 
   {}, 
   195374, 
   null, 
   1138571400.0
  ], 
  [
   196136, 
   null, 
   "tonybrown74", 
   "No, YOU'RE using my beliefs to claim I'm restricting your rights. I'm in no position to do that, and even if I were, I've already told you I'm all for you having couples' benefits.\n\n \n \n You are using you beliefs to claim that gay people do not have the right to civil marriage. There is no legal or logical reason to do so. You are the one who insists on claiming that your morality is what determines your reasoning.\n \n You are the one keeps bringing your beliefs into the equaltion. If you insist on doing so, then I challenge your beliefs as supsect.", 
   {}, 
   195148, 
   null, 
   1138830960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  CNN donates to gay journalist scholarship", 
  "url": "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 7346, 
  "discussion_files": [
   [
    "11541.html", 
    "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship-print.html"
   ], 
   [
    "11542.html", 
    "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship-7-print.html"
   ], 
   [
    "11543.html", 
    "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship-5-print.html"
   ], 
   [
    "11544.html", 
    "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship-4-print.html"
   ], 
   [
    "11545.html", 
    "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship-6-print.html"
   ], 
   [
    "11546.html", 
    "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship-3-print.html"
   ], 
   [
    "11547.html", 
    "http://www.4forums.com/political/gay-rights-debates/7346-cnn-donates-gay-journalist-scholarship-2-print.html"
   ]
  ], 
  "identifier": 7346
 }
]