[
 [
  [
   192606, 
   null, 
   "Dr_Sprocket", 
   "Is marriage a civil or religious rite, or is it something else?", 
   {
    "post_info": {
     "post_title": "Is marriage a civil or religious RITE (NOT RIGHT) or something else?"
    }
   }, 
   null, 
   null, 
   1137429480.0
  ], 
  [
   192626, 
   null, 
   "trebor", 
   "Is marriage a civil or religious rite, or is it something else?\n\n \n \n You can get married without a church. \n \n A church does not have to 'reconize' a marriage from a religious point of view.\n \n \n So, it is a bit of both.\n \n \n Legally, it is a civil right. You do not need a church to get married, and there are legal implications to that marriage.", 
   {}, 
   192606, 
   null, 
   1137434160.0
  ], 
  [
   192631, 
   null, 
   "Dr_Sprocket", 
   "You can get married without a church. \n \n A church does not have to 'reconize' a marriage from a religious point of view.\n \n \n So, it is a bit of both.\n \n \n Legally, it is a civil right. You do not need a church to get married, and there are legal implications to that marriage.\n\n I think you got this post confused with the other post, this one is rite not right.\n \n See the other post for an explanation.\n \n But thank you for your comments. :)", 
   {}, 
   192626, 
   null, 
   1137435180.0
  ], 
  [
   192933, 
   null, 
   "Easyrider", 
   "I suppose gays can get \"married\" in the secular sense, but that gay institution is an abomination in the eyes of God and good men everywhere.", 
   {}, 
   192631, 
   null, 
   1137548880.0
  ], 
  [
   192936, 
   null, 
   "trebor", 
   "I suppose gays can get \"married\" in the secular sense, but that gay institution is an abomination in the eyes of God and good men everywhere.\n\n \n How would you know what good men would want?? I am sorry, but you seem to be more interested in yourself than any good man... (except when you start discussing anal sex.. of course, then your true colors show)", 
   {}, 
   192933, 
   null, 
   1137549240.0
  ], 
  [
   192942, 
   null, 
   "Easyrider", 
   "How would you know what good men would want?? I am sorry, but you seem to be more interested in yourself than any good man... (except when you start discussing anal sex.. of course, then your true colors show)\n\n \n More nonsense from Treborville. Gay sex is a sin in your own Tanakh (Lev. 18:22, 20:13). But of course you sell Moses down the river like your forefathers did about 4,000 years ago. I guess nothing's changed in your camp.", 
   {}, 
   192936, 
   null, 
   1137550200.0
  ], 
  [
   192956, 
   null, 
   "trebor", 
   "More nonsense from Treborville. Gay sex is a sin in your own Tanakh (Lev. 18:22, 20:13). But of course you sell Moses down the river like your forefathers did about 4,000 years ago. I guess nothing's changed in your camp.\n\n \n And what does that have to do with anything? Lev was specificlaly talking about purity for the temple..\n \n Of course, that is over your head.", 
   {}, 
   192942, 
   null, 
   1137553440.0
  ], 
  [
   192968, 
   null, 
   "Easyrider", 
   "And what does that have to do with anything? Lev was specificlaly talking about purity for the temple..\n \n Of course, that is over your head.\n\n \n Nonsense. Leviticus 20:1 is addressed to the Israelites as a people - not to the priesthood in particular. It goes to describe adultery as a sin (Lev. 20:10), as well as consulting mediums, engaging in incest (20:12), having sex with animals (20:15) and so on. \n \n And if those things are an abomination to God in just the priesthood, but having sex with an animal is okay with the general populace, then you've got a real problem defending all that.", 
   {}, 
   192956, 
   null, 
   1137558540.0
  ], 
  [
   192980, 
   null, 
   "Matthew S", 
   "Nonsense. Leviticus 20:1 is addressed to the Israelites as a people - not to the priesthood in particular. It goes to describe adultery as a sin (Lev. 20:10), as well as consulting mediums, engaging in incest (20:12), having sex with animals (20:15) and so on. \n \n And if those things are an abomination to God in just the priesthood, but having sex with an animal is okay with the general populace, then you've got a real problem defending all that.\n\n \n \n Of course this is only your opinion and the rest of us have a different take on things. We should not be, and shall never be bound by your opinion.", 
   {}, 
   192968, 
   null, 
   1137559800.0
  ], 
  [
   192981, 
   null, 
   "Easyrider", 
   "Of course this is only your opinion and the rest of us have a different take on things. We should not be, and shall never be bound by your opinion.\n\n \n No, that's what the Word of God states, unless you're for sex with animals and adultery too (as Leviticus forbids). Are those things okay with you too?", 
   {}, 
   192980, 
   null, 
   1137559860.0
  ], 
  [
   192985, 
   null, 
   "trebor", 
   "No, that's what the Word of God states, unless you're for sex with animals and adultery too (as Leviticus forbids). Are those things okay with you too?\n\n \n \n Matthew is not Jewish. he is not bound by Leviticus. Neither are you, which you make abundantly clear when people point out you eat pork, have cheese burgers, and are generally unclean in the eyes of god.", 
   {}, 
   192981, 
   null, 
   1137560100.0
  ], 
  [
   192990, 
   null, 
   "Easyrider", 
   "Matthew is not Jewish. he is not bound by Leviticus. Neither are you, which you make abundantly clear when people point out you eat pork, have cheese burgers, and are generally unclean in the eyes of god.\n\n \n Matthew Levi was a Jew, Trebor, as were all of the Apostles (though they later became followers of another Jew, Jesus). And since you still claim to be an Old Testament Jew, then you need to embrace your own teachings I think. Or else show me in your Tanakh where they've been done away with.", 
   {}, 
   192985, 
   null, 
   1137560460.0
  ], 
  [
   192993, 
   null, 
   "Matthew S", 
   "Matthew Levi was a Jew, Trebor, as were all of the Apostles (though they later became followers of another Jew, Jesus). And since you still claim to be an Old Testament Jew, then you need to embrace your own teachings I think. Or else show me in your Tanakh where they've been done away with.\n\n \n \n Apparently someone doesn't read. Trebor was talking about me not being jewish in the following quote.\n \n \nMatthew is not Jewish. he is not bound by Leviticus. Neither are you, which you make abundantly clear when people point out you eat pork, have cheese burgers, and are generally unclean in the eyes of god.\n", 
   {}, 
   192990, 
   null, 
   1137560700.0
  ], 
  [
   192998, 
   null, 
   "trebor", 
   "Matthew Levi was a Jew, Trebor, as were all of the Apostles (though they later became followers of another Jew, Jesus). And since you still claim to be an Old Testament Jew, then you need to embrace your own teachings I think. Or else show me in your Tanakh where they've been done away with.\n\n \n Considering how you can't demonstrate that 'Mathew Levi\" wrote the gospel of matthew, that is irrelavant.\n \n First of all, Matthew is high dependant on Mark. Second of all, it is apparent that Matthew was written in Greek, and doesn't appear to know araemic.\n \n Such is life. Scholarship certainly is not your forte , that is for sure.", 
   {}, 
   192990, 
   null, 
   1137561360.0
  ], 
  [
   193001, 
   null, 
   "Easyrider", 
   "Considering how you can't demonstrate that 'Mathew Levi\" wrote the gospel of matthew, that is irrelavant.\n \n First of all, Matthew is high dependant on Mark. Second of all, it is apparent that Matthew was written in Greek, and doesn't appear to know araemic.\n \n Such is life. Scholarship certainly is not your forte , that is for sure.\n\n \n More hubris. \n \n The authorship of Matthew BY Matthew was unchallenged in the early church, and was verified by Eusebius quoting Origen. And it was not originally written in Aramaic, but Hebrew, i.e.\n \n ... but with regard to Matthew he (Papias) has made the following statements]: Matthew put together the oracles [of the Lord] in the Hebrew language, and each one interpreted them as best he could....\n Fragments of Papias, Fragment VI, (Quoted by Eusebius)\n \n ... Matthew also issued a written Gospel among the Hebrews in their own dialect ... .\n Irenaeus, Against Heresies, Book III, Chapter I (This Quote is also found in Eusebius, Ecclesiastical History, Book V, Chapter VIII)\n \n 6. For Matthew, who had at first preached to the Hebrews, when he was about to go to other peoples, committed his Gospel to writing in his native tongue ... .\n Eusebius, Ecclesiastical History, Book III, Chapter XXIV, &#167; 6\n \n 3 Pantaenus ... is said to have gone to India. It is reported that among persons there who knew of Christ, he found the Gospel according to Matthew, which had anticipated his own arrival. For Bartholomew, one of the apostles, had preached to them, and left with them the writing of Matthew in the Hebrew language, which they had preserved till that time.\n Eusebius, Ecclesiastical History, Book V, Chapter X, &#167; 3\n \n 4 \"Among the four Gospels, which are the only indisputable ones in the Church of God under heaven, I have learned by tradition that the first was written by Matthew, who was once a publican, but afterwards an apostle of Jesus Christ, and it was prepared for the converts from Judaism, and published in the Hebrew language.\n Eusebius, Ecclesiastical History, Book VI, Chapter XXV, &#167; 4 (quoting Origen)\n \n \n I guess that's all new to you?\n \n Nice try...", 
   {}, 
   192998, 
   null, 
   1137561720.0
  ], 
  [
   193002, 
   null, 
   "doG", 
   "The authorship of Matthew BY Matthew was unchallenged in the early church\n\n The same church that believed that the universe resolved around the Earth?", 
   {}, 
   193001, 
   null, 
   1137562020.0
  ], 
  [
   193004, 
   null, 
   "Easyrider", 
   "The same church that believed that the universe resolved around the Earth?\n\n \n \n \"resolved\"? \n \n Got a Scripture from the Bible that says the universe revolved around the earth? \n \n p.s. the heathens taught that I know....emoticon_xkill", 
   {}, 
   193002, 
   null, 
   1137562140.0
  ], 
  [
   193014, 
   null, 
   "doG", 
   "Got a Scripture from the Bible that says the universe revolved around the earth? \n\n Who claimed the bible says that? Are you denying that the church believed in an Earth centered universe?", 
   {}, 
   193004, 
   null, 
   1137563640.0
  ], 
  [
   193019, 
   null, 
   "JPSartre12", 
   "Is marriage a civil or religious rite, or is it something else?\n\n \n It's a religious rite, IMO, and one reserved for heteros.", 
   {}, 
   192606, 
   null, 
   1137564780.0
  ], 
  [
   193025, 
   null, 
   "Orion", 
   "Originally Posted by Dr_Sprocket\n Is marriage a civil or religious rite, or is it something else?\n \n \nIt's a religious rite, IMO, and one reserved for heteros.\n\n \n Marriage is a civil function - ask any divorce attorney. Whatever religious institutions have to say concerning marriage becomes irrelevant with regard to civil law, and civil law is binding. \n \n To whatever extent same-sex marriage is prohibited by state law will eventually become moot, not unlike racial and sexual discrimination. You can either get on the train, watch it pass by, or attempt to obstruct it. Your choice.", 
   {}, 
   193019, 
   null, 
   1137567540.0
  ], 
  [
   193036, 
   null, 
   "Matthew S", 
   "\n To whatever extent same-sex marriage is prohibited by state law will eventually become moot, not unlike racial and sexual discrimination. You can either get on the train, watch it pass by, or attempt to obstruct it. Your choice.\n\n \n \n It will be like that Onion 2056 issue http://www.theonion.com/2056-06-22/index_b.php . If you look to the left in the box with the green flashing, rotating words labled \"popular Monocultures\" there is a headline that says \" Grave robbers pry valuable rifle from Charlton Heston's cold, dead hands\". I know this has nothing to do with the topic of the thread, except to laugh at the Stubbornness of people in fighting the enevitable.", 
   {}, 
   193025, 
   null, 
   1137593700.0
  ], 
  [
   193046, 
   null, 
   "trebor", 
   "More hubris. \n \n The authorship of Matthew BY Matthew was unchallenged in the early church, and was verified by Eusebius quoting Origen. And it was not originally written in Aramaic, but Hebrew, i.e.\n \n \n\n \n Of course, no scholar worth their name things that 'Mathew\" wrote matthew. \n \n We are a lot more sophistocated and knowledgeable that we were back then.\n \n Well, most of us.\n \n \n\n ... but with regard to Matthew he (Papias) has made the following statements]: Matthew put together the oracles [of the Lord] in the Hebrew language, and each one interpreted them as best he could....\n Fragments of Papias, Fragment VI, (Quoted by Eusebius)\n \n\n \n Of course, there is no real evidence out side of Eusebius of this. And, Eusebus was not above lying, such as his insertion of that 'antiquities 18) into Jospehus.. Such an honest person.\n \n \n\n \n ... Matthew also issued a written Gospel among the Hebrews in their own dialect ... .\n Irenaeus, Against Heresies, Book III, Chapter I (This Quote is also found in Eusebius, Ecclesiastical History, Book V, Chapter VIII)\n \n \n\n Yes, that is the claim. However, it certainly wasn't the Gospel of Matthew as we have it in current form. That was originally written in Greek. No aremic\n version has been found. \n \n \n\n 6. For Matthew, who had at first preached to the Hebrews, when he was about to go to other peoples, committed his Gospel to writing in his native tongue ... .\n Eusebius, Ecclesiastical History, Book III, Chapter XXIV, § 6\n \n\n \n This is the claim. HOwever, the Gospel of Matthew was written in Greek, an no amarmeic version has been found. Could it be a different Matthew? Or, was Eurebius blowing it out his butt?\n \n \n\n 3 Pantaenus ... is said to have gone to India. It is reported that among persons there who knew of Christ, he found the Gospel according to Matthew, which had anticipated his own arrival. For Bartholomew, one of the apostles, had preached to them, and left with them the writing of Matthew in the Hebrew language, which they had preserved till that time.\n Eusebius, Ecclesiastical History, Book V, Chapter X, § 3\n \n\n \n Gosh, Eusebius made lots of claims.... no external evidence of the writing of matthew in the Hebrew language was found. Internal evidnece in the GOspel of Matthew proves it was written in Greek. \n \n \n\n 4 \"Among the four Gospels, which are the only indisputable ones in the Church of God under heaven, I have learned by tradition that the first was written by Matthew, who was once a publican, but afterwards an apostle of Jesus Christ, and it was prepared for the converts from Judaism, and published in the Hebrew language.\n Eusebius, Ecclesiastical History, Book VI, Chapter XXV, § 4 (quoting Origen)\n \n \n I guess that's all new to you?\n \n\n \n What Eusibus claims is irrelanvent. He is writing 200 years later, and internal evidence to the gospel of Matthew shows it was written in Greek. No 'Gospel of Matthew' was ever found that was not a translation from the greek into the Aremic. \n \n From http://www.earlychristianwritings.com/matthew.html\n \n\n It is also the consensus position that the evangelist was not the apostle Matthew. Such an idea is based on the second century statements of Papias and Irenaeus. As quoted by Eusebius in Hist. Eccl. 3.39, Papias states: \"Matthew put together the oracles [of the Lord] in the Hebrew language, and each one interpreted them as best he could.\" In Adv. Haer. 3.1.1, Irenaeus says: \"Matthew also issued a written Gospel among the Hebrews in their own dialect while Peter and Paul were preaching at Rome and laying the foundations of the church.\" We know that Irenaeus had read Papias, and it is most likely that Irenaeus was guided by the statement he found there. That statement in Papias itself is considered to be unfounded because the Gospel of Matthew was written in Greek and relied largely upon Mark, not the author's first-hand experience.\n \n\n \n \n \n Nice try...[/QUOTE]", 
   {}, 
   193001, 
   null, 
   1137599580.0
  ], 
  [
   193131, 
   null, 
   "Easyrider", 
   "Of course, no scholar worth their name things that 'Mathew\" wrote matthew. \n\n \n Wrong. You might bone up on someone outside radical liberal theologians to get a more mainstream view on this. \n \n \n HOwever, the Gospel of Matthew was written in Greek, an no amarmeic version has been found. Could it be a different Matthew? Or, was Eurebius blowing it out his butt?\n\n \n Already refuted in my previous post, where historical references point to Matthew having originally been written in Hebrew. Which is more than you have to the contrary.\n \n Next....", 
   {}, 
   193046, 
   null, 
   1137628680.0
  ], 
  [
   193150, 
   null, 
   "Truthsayer", 
   "Is marriage a civil or a religious union? That would depend on who you ask. My wife, a lifelong Catholic, would tell you it is a religious sacrement. \n \n Myself, not being religious at all, look at it as a legal and civil cohabitation arrangement. I never thought of marriage as a \"right\" though. More of an obligation.\n \n \n But I was smart enough to make sure this union was held in a church. If my wife insisted, I would have done it in a bowling alley. But she insisted the church. I wasn't born yesterday. You KNOW where I got married.emoticon_wow", 
   {}, 
   193131, 
   null, 
   1137633120.0
  ], 
  [
   193167, 
   null, 
   "JPSartre12", 
   "Originally Posted by Dr_Sprocket\n Is marriage a civil or religious rite, or is it something else?\n \n \n \n Marriage is a civil function - ask any divorce attorney. Whatever religious institutions have to say concerning marriage becomes irrelevant with regard to civil law, and civil law is binding. \n \n To whatever extent same-sex marriage is prohibited by state law will eventually become moot, not unlike racial and sexual discrimination. You can either get on the train, watch it pass by, or attempt to obstruct it. Your choice.\n\n \n I could care less if someone wants to cohabitate with their horse as long as they don't call it marriage. emoticon_xdonno", 
   {}, 
   193025, 
   null, 
   1137640620.0
  ], 
  [
   193184, 
   null, 
   "Orion", 
   "I could care less if someone wants to cohabitate with their horse...\n \n \n I assume you mean here that you couldn't care less.\n \n \n...as long as they don't call it marriage.\n\n \n Why not? What possible difference could it make to you as to what it's called? Assuming that you've entered into a traditional marriage, do you consider that marriage to be somehow threatened by same-sex marriage? More of a threat than, say, divorce? Or extra-marital adultery? If so, please elaborate. Would you feel better with the term \"same-sex civil union\"? Whatever you wish to call it, gays and lesbians (and their supporters) are rightfully demanding that they be allowed the same rights and civil status accorded to couples in a traditional marriage. And this will eventually come about. The wheels turn slowly, as anyone who witnessed the black civil rights movement of the 50s and 60s or the women's fight for equality in the 70s can attest. To the extent that today's children are puzzled as to why previous generations discriminated against blacks, tomorrow's children will wonder why it was that our and previous generations discriminated against, and hunted down, and punished, gays and lesbians. To see just how far we've come, I invite you to consider the following...\n \n http://www.turing.org.uk/turing/", 
   {}, 
   193167, 
   null, 
   1137644160.0
  ], 
  [
   193190, 
   null, 
   "JPSartre12", 
   "I assume you mean here that you couldn't care less.\n \n\n Here, read this. http://www.word-detective.com/061405.html#could%20care%20less\n \n\n Why not? What possible difference could it make to you as to what it's called? Assuming that you've entered into a traditional marriage, do you consider that marriage to be somehow threatened by same-sex marriage? More of a threat than, say, divorce? Or extra-marital adultery? If so, please elaborate. Would you feel better with the term \"same-sex civil union\"? \n \n\n Yes, I would. I've already stated that I believe that marriage is a religious rite, not a civil contract. I feel no compunction to change that belief, a belief held by the majority of Americans, I might add. I can live with the term \"civil union\". \n \n\n Whatever you wish to call it, gays and lesbians (and their supporters) are rightfully demanding that they be allowed the same rights and civil status accorded to couples in a traditional marriage. And this will eventually come about. The wheels turn slowly, as anyone who witnessed the black civil rights movement of the 50s and 60s or the women's fight for equality in the 70s can attest. To the extent that today's children are puzzled as to why previous generations discriminated against blacks, tomorrow's children will wonder why it was that our and previous generations discriminated against, and hunted down, and punished, gays and lesbians. To see just how far we've come, I invite you to consider the following...\n \n http://www.turing.org.uk/turing/\n\n \n We may have \"come a long way\" but I'm not convinced that we're heading in the right direction. emoticon_confused", 
   {}, 
   193184, 
   null, 
   1137646560.0
  ], 
  [
   193195, 
   null, 
   "trebor", 
   "\n Yes, I would. I've already stated that I believe that marriage is a religious rite, not a civil contract. I feel no compunction to change that belief, a belief held by the majority of Americans, I might add. I can live with the term \"civil union\". \n \n\n \n \n Then, if two gays find an affirming religion, and get marrieed under the religion, they can call it a marriage? \n \n And, the 'license' that the government gives out should be entirely 'civil unions\", and not mention marriage at all? \n \n That is the implications of what you say.", 
   {}, 
   193190, 
   null, 
   1137647040.0
  ], 
  [
   193196, 
   null, 
   "Easyrider", 
   "Indeed. How far have we really come from Sodom and Gomorrah when institutionalized sin in the form of gay marriage seeks to become normalized?", 
   {}, 
   193190, 
   null, 
   1137647100.0
  ], 
  [
   193203, 
   null, 
   "JPSartre12", 
   "Then, if two gays find an affirming religion, and get marrieed under the religion, they can call it a marriage? \n\n No, I don't believe that it should be called \"marriage\" under any circumstances. \n \n\n And, the 'license' that the government gives out should be entirely 'civil unions\", and not mention marriage at all? \n \n That is the implications of what you say.\n\n \n I don't have a problem with Uncle Sam getting out of the marriage business.", 
   {}, 
   193195, 
   null, 
   1137651000.0
  ], 
  [
   193204, 
   null, 
   "JPSartre12", 
   "Indeed. How far have we really come from Sodom and Gomorrah when institutionalized sin in the form of gay marriage seeks to become normalized?\n\n \n We may live under a secular gov't, but I don't have to sit idly by while they attempt to redefine a religious rite that I happen to hold sacred.", 
   {}, 
   193196, 
   null, 
   1137651240.0
  ], 
  [
   193206, 
   null, 
   "doG", 
   "No, I don't believe that it should be called \"marriage\" under any circumstances. \n\n But there are gay churches and their numbers are growing. How will you control what they choose to do, petition for legislation over the church?", 
   {}, 
   193203, 
   null, 
   1137653760.0
  ], 
  [
   193207, 
   null, 
   "Orion", 
   "I've already stated that I believe that marriage is a religious rite, not a civil contract.\n\n \n But, in fact, it is a civil contract. Again, ask any divorce attorney. I've been through the process and I can affirm that the nuts and bolts had nothing whatsoever to do with religion. \n \n \nWe may have \"come a long way\" but I'm not convinced that we're heading in the right direction.\n\n \n Would you prefer that we go back to the 50s and 60s, the \"good old days\", when blacks and women knew their place and were not quite so 'uppity'? Or when gays and lesbians were confined to the closet, as opposed to 'normal Amercuns'? Please, explain yourself.", 
   {}, 
   193190, 
   null, 
   1137654840.0
  ], 
  [
   193223, 
   null, 
   "trebor", 
   "No, I don't believe that it should be called \"marriage\" under any circumstances. \n \n \n I don't have a problem with Uncle Sam getting out of the marriage business.\n\n \n \n Then, you are imposing YOUR religious view via law on other religions. Marriage is either religious or civil. If it is religious, then any religioun can say something is a marriage. If it is civil, then religion doesn't matter.\n \n That certainly is a double standard. WHile it does not invalidiate yoru position, it does invalidate your stated reasons for that position.", 
   {}, 
   193203, 
   null, 
   1137683160.0
  ], 
  [
   193242, 
   null, 
   "simone", 
   "Marriage has become a religious rite only recently in European history. It cannot be claimed as a \"sacred\" religious rite.", 
   {}, 
   193223, 
   null, 
   1137691620.0
  ], 
  [
   193261, 
   null, 
   "JPSartre12", 
   "But, in fact, it is a civil contract. Again, ask any divorce attorney. I've been through the process and I can affirm that the nuts and bolts had nothing whatsoever to do with religion. \n\n In my religion, marriage is a sacrament. The contract is between husband/wife/God. I don't have any problem with Uncle Sam getting out of the religious rite business and ONLY get involved in civil unions.\n \n\n Would you prefer that we go back to the 50s and 60s, the \"good old days\", when blacks and women knew their place and were not quite so 'uppity'? Or when gays and lesbians were confined to the closet, as opposed to 'normal Amercuns'? Please, explain yourself.\n\n \n I love it when intellectually losing arguments revert back to playing the race/gender card. In that intellectually vacuous argument, one must assume an all or nothing scenario which is a necessary construct for it to carry any weight. I don't buy the all or nothing assumption, so the argument fails.\n It is possible to evaluate each change on its own merits without having to throw the baby out with the bath water so you're left with an absurd premise and conclusion.", 
   {}, 
   193207, 
   null, 
   1137700620.0
  ], 
  [
   193265, 
   null, 
   "JPSartre12", 
   "Then, you are imposing YOUR religious view via law on other religions. Marriage is either religious or civil. If it is religious, then any religioun can say something is a marriage. If it is civil, then religion doesn't matter.\n \n That certainly is a double standard. WHile it does not invalidiate yoru position, it does invalidate your stated reasons for that position.\n\n \n The government sets legal definitions all of the time. It defines a \"dependent\" for tax purposes. It defines the terms \"disabled\", \"minority\" and a host of other groups for various purposes. I don't see keeping the definition of marriage as one man/one woman as the government being in the business of religion. After all, it defines the term \"minority\" without being in the business of making babies, doesn't it? emoticon_confused", 
   {}, 
   193223, 
   null, 
   1137701100.0
  ], 
  [
   193270, 
   null, 
   "trebor", 
   "The government sets legal definitions all of the time. It defines a \"dependent\" for tax purposes. It defines the terms \"disabled\", \"minority\" and a host of other groups for various purposes. I don't see keeping the definition of marriage as one man/one woman as the government being in the business of religion. After all, it defines the term \"minority\" without being in the business of making babies, doesn't it? emoticon_confused\n\n \n Why not define it as 'Civil Union' for all people, and let each individual church worry about 'marriage'?\n \n Let religion worry about religion, and government worry about legal contracts.", 
   {}, 
   193265, 
   null, 
   1137704640.0
  ], 
  [
   193302, 
   null, 
   "JPSartre12", 
   "Why not define it as 'Civil Union' for all people, and let each individual church worry about 'marriage'?\n \n Let religion worry about religion, and government worry about legal contracts.\n\n \n I believe that's what I said. emoticon_confused", 
   {}, 
   193270, 
   null, 
   1137713400.0
  ], 
  [
   193320, 
   null, 
   "trebor", 
   "I believe that's what I said. emoticon_confused\n\n \n But, you also said you object to any kind of union between two gays be called marriage, even if it WAS through their religion, not yours.\n \n Which is it.. do you object the government getting involved, or object to any relationship between two same gendered people be called 'marriage'.", 
   {}, 
   193302, 
   null, 
   1137717600.0
  ], 
  [
   193325, 
   null, 
   "JPSartre12", 
   "But, you also said you object to any kind of union between two gays be called marriage, even if it WAS through their religion, not yours.\n \n Which is it.. do you object the government getting involved, or object to any relationship between two same gendered people be called 'marriage'.\n\n \n The latter. When I said that I objected to the government getting involved I meant getting involved in the redefinition of marriage.", 
   {}, 
   193320, 
   null, 
   1137718860.0
  ], 
  [
   193342, 
   null, 
   "trebor", 
   "The latter. When I said that I objected to the government getting involved I meant getting involved in the redefinition of marriage.\n\n \n \n Yet, if the government calls all licences 'civil unions', and a church choose to go through the marriage ceremony with two same-gendered people, you also object.\n \n That is the point I am bringing up. Double standards.", 
   {}, 
   193325, 
   null, 
   1137723720.0
  ], 
  [
   193347, 
   null, 
   "JPSartre12", 
   "Yet, if the government calls all licences 'civil unions', and a church choose to go through the marriage ceremony with two same-gendered people, you also object.\n \n That is the point I am bringing up. Double standards.\n\n \n No double standard. I'm against churches redeifing marriage as well.:xbanghead", 
   {}, 
   193342, 
   null, 
   1137727260.0
  ], 
  [
   193349, 
   null, 
   "Orion", 
   "In my religion, marriage is a sacrament.\n\n \n No problem, so long as you recognize that in this country, marriage is an institution governed by civil law, and when civil law prohibits two consenting adults who happen to be of the same sex or who happen to be of mixed race from entering into a state of legal marriage, the law is engaging in a violation of civil rights based upon unjustifiable discrimination. I couldn't care less as to what your church has to say about the matter. I've discussed this issue with quite a few gays and most of them appear to have no interest in a church-based marriage ceremony. They recognize that civil law trumps church doctrine.\n \n BTW, as an aside, just in passing, do you consider pedophilia on the part of clergy to be a 'sacrament', too? Or attempts by Church officials to cover it up? \n \n \nI love it when intellectually losing arguments revert back to playing the race/gender card.\n \n \n I suspect that, instead, you feel uncomfortable with the comparison. Good. Let me remind you that discrimination based upon race, gender, and sexual orientation are found within your 'Wholly Babble'. Oh, wait, I forgot - that same 'Word-O-God' discriminates against 'cripples', too. \n \n As I mentioned earlier, legal machinery is slow in its operation. There is at least some merit in this in that, for the most part, such machinery eventually makes decisions based upon deliberation rather than haste. And so it is that discrimination based upon sexual orientation will one day go by the wayside, and our children will wonder why it took so long.", 
   {}, 
   193261, 
   null, 
   1137727920.0
  ], 
  [
   193366, 
   null, 
   "Adept", 
   "No double standard. I'm against churches redeifing marriage as well.:xbanghead\n\n \n So as I understand your position;\n \n 1 - A civil union is not a marriage.\n \n 2 - A couple can only be married if they go through the relevant religious ceremony.\n \n Where I get a little hazy on your stance;\n \n 1 - You respect all religious ceremonies equally? Which is to say, a married Jewish couple is no less 'married' than a married Christian couple, or a married Hindu couple?\n \n 2 - Your religion is the only one allowed to define marriage?\n \n Because the situation is;\n \n There exist homosexual churches. Or at the least, churches accepting of homosexual people. In this case, there is no religious reason to prevent a consenting couple from getting a civil union, nor is there any reason for you to protest against them getting married by going through with their own religious ceremony. \n \n The only way you can protest is if you believe that all religions ceremonies are not equally valid (in which case you'd need sufficient evidence to support your choice to victimise homosexual ceremonies, and not Muslim ceremonies...) or that your own religion is the only one allowed to define marriage. And then you'd need to indicate why other religions should abide by the rules and mandates of your own.\n \n Of course, there is the third option - Irrational bias and fear couple with a lack of critical thinking and introspection.", 
   {}, 
   193347, 
   null, 
   1137735660.0
  ], 
  [
   193367, 
   null, 
   "JPSartre12", 
   "No problem, so long as you recognize that in this country, marriage is an institution governed by civil law, and when civil law prohibits two consenting adults who happen to be the same sex or who happen to be of mixed race from entering into a state of legal marriage, the law is engaging in a violation of civil rights based upon unjustifiable discrimination.\n\n That's YOUR opinion, not the law. The law defines marriage as one man/one woman. Ever read the DOMA? It is currently the law of the land. In addition, 19 states have recently passed state laws defining marriage as one man/one woman. And I would venture a guess that if the SCOTUS attempted to intervene, you'd quickly see a new US Constitutional Amendment banning same sex marriage that would be impossible for SCOTUS to over-rule since it would represent the most current Constitutional holding.\n \n\n I couldn't care less as to what your church has to say about the matter. I've discussed this issue with quite a few gays and most of them appear to have no interest in a church-based marriage ceremony. They recognize that civil law trumps church doctrine. \n\n And I don't particularly care what your gay friends think. As long as we're still free to vote and the First Amendment applies, I am going to exercise both rights. \n \n\n I suspect that, instead, you feel uncomfortable with the comparison. Good. Let me remind you that discrimination based upon race, gender, and sexual orientation are found within your 'Wholly Babble'. Oh, wait, I forgot - that same 'Word-O-God' discriminates against 'cripples', too. \n\n Nice try. I've already told you that I'm no Bible thumper, so making disparaging remarks about the Bible is just a feeble attempt on your part to provoke me. \n \n\n As I mentioned earlier, legal machinery is slow in its operation. There is at least some merit in this in that, for the most part, such machinery eventually makes decisions based upon deliberation rather than haste. And so it is that discrimination based upon sexual orientation will one day go by the wayside, and our children will wonder why it took so long.\n\n \n Maybe, maybe not. The country has certainly turned more Conservative in recent years. Who knows what tomorrow may bring.", 
   {}, 
   193349, 
   null, 
   1137736740.0
  ], 
  [
   193368, 
   null, 
   "JPSartre12", 
   "So as I understand your position;\n \n 1 - A civil union is not a marriage.\n \n 2 - A couple can only be married if they go through the relevant religious ceremony.\n \n Where I get a little hazy on your stance;\n \n 1 - You respect all religious ceremonies equally? Which is to say, a married Jewish couple is no less 'married' than a married Christian couple, or a married Hindu couple?\n \n 2 - Your religion is the only one allowed to define marriage?\n \n Because the situation is;\n \n There exist homosexual churches. Or at the least, churches accepting of homosexual people. In this case, there is no religious reason to prevent a consenting couple from getting a civil union, nor is there any reason for you to protest against them getting married by going through with their own religious ceremony. \n \n The only way you can protest is if you believe that all religions ceremonies are not equally valid (in which case you'd need sufficient evidence to support your choice to victimise homosexual ceremonies, and not Muslim ceremonies...) or that your own religion is the only one allowed to define marriage. And then you'd need to indicate why other religions should abide by the rules and mandates of your own.\n \n Of course, there is the third option - Irrational bias and fear couple with a lack of critical thinking and introspection.\n\n \n Not that I need to answer to you or anyone else for my beliefs, but in this society I'm free to believe, and more importantly, vote any way I wish. \n Do I think that same sex unions in the Michael Fitzpatrick/Patrick Fitzmichael Church of Holy Holes changes the definition of marriage? No, why would it?emoticon_confused \n \n And it's not my religion that gets to decide what constitutes a marriage, it's the tens of millions of like-minded Americans voting in a secular election that do. That's the way it works on this side of the world.emoticon_xgood", 
   {}, 
   193366, 
   null, 
   1137737520.0
  ], 
  [
   193369, 
   null, 
   "doG", 
   "... it's the tens of millions of like-minded Americans voting in a secular election that do. That's the way it works on this side of the world.\n\n So you support mob-rule, majoritarianism, over the republican form of government that we have? Should we just toss the constitution and it's implied liberty for all?", 
   {}, 
   193368, 
   null, 
   1137738780.0
  ], 
  [
   193373, 
   null, 
   "Orion", 
   "That's YOUR opinion, not the law. The law defines marriage as one man/one woman.\n\n \n The 'law' at one time, defined a \"negro\" as not quite a human being, but more as an object of property, to be bought and sold. This, from the highest court in the land. That view eventually changed, perhaps to your disappointment? Whatever. Expect more of the same with regard to the civil status of gay marriage. As I indicated earlier, you can either get on the train, watch it pass by, or attempt to obstruct it. It's your choice.", 
   {}, 
   193367, 
   null, 
   1137740220.0
  ], 
  [
   193380, 
   null, 
   "Adept", 
   "Not that I need to answer to you or anyone else for my beliefs, but in this society I'm free to believe, and more importantly, vote any way I wish.\n\n \n Of course.\n \n \nDo I think that same sex unions in the Michael Fitzpatrick/Patrick Fitzmichael Church of Holy Holes changes the definition of marriage? No, why would it?emoticon_confused\n\n \n And heres the kicker - It does change the definition, as far as the 'flock' of that church is concerned. You can have your religious definition, and they can have theirs. Both equally valid under the eyes of a secular government.\n \n \nAnd it's not my religion that gets to decide what constitutes a marriage, it's the tens of millions of like-minded Americans voting in a secular election that do. That's the way it works on this side of the world.emoticon_xgood\n\n \n Thats great for you. I assume the same applies in places like Canada, Scotland or Ireland, where gay marriages are legal and accepted.\n \n My queries remain unanswered. Why are gay marriages bad? Why can't a gay church have it's own definition of Marriage, like other religions do? The solution seems pretty simple as I see it. All civil unions equal under the eyes of the law, and all mariages equal under the eyes of their respective churches. And of course, any two consenting adults can get a civil union, regardless of their gender.", 
   {}, 
   193368, 
   null, 
   1137748320.0
  ], 
  [
   193383, 
   null, 
   "Dr_Sprocket", 
   "The topic is \"Is marriage a civil or religious RITE (NOT RIGHT) or something else?\" \n \n I have been criticized in the past in other posts for misspelling words but, dam it you guys at least I can READ!", 
   {
    "unicode_changes_made": true
   }, 
   193380, 
   null, 
   1137750780.0
  ], 
  [
   193387, 
   null, 
   "Alan Ryan", 
   "Marriage is always a civil contract (at least here in \"the West\"). It need not be, but it can also be a religious rite. \n \n When a marriage takes place in church, the priest and witnesses sign the civil papers which certify that the parties concerned are married in accordance with the law. \n \n I don't know whether the Catholic Church still maintains that any marriage ceremony involving a catholic that is conducted by another denomination or a civil marriage for that matter, is not valid in a spiritual sense. In other words, a confirmed catholic marrying outside the church, would not be considered as married in \"the eyes of God\".", 
   {}, 
   193383, 
   null, 
   1137754560.0
  ], 
  [
   193402, 
   null, 
   "Matthew S", 
   "Marriage is always a civil contract (at least here in \"the West\"). It need not be, but it can also be a religious rite. \n \n When a marriage takes place in church, the priest and witnesses sign the civil papers which certify that the parties concerned are married in accordance with the law. \n \n I don't know whether the Catholic Church still maintains that any marriage ceremony involving a catholic that is conducted by another denomination or a civil marriage for that matter, is not valid in a spiritual sense. In other words, a confirmed catholic marrying outside the church, would not be considered as married in \"the eyes of God\".\n\n \n \n The catholic church has always been behind the times it only took 359 years to say that Galileo was right. http://www.bibletopics.com/biblestudy/71.htm", 
   {}, 
   193387, 
   null, 
   1137769140.0
  ], 
  [
   193424, 
   null, 
   "jyoshu", 
   "So you support mob-rule, majoritarianism, over the republican form of government that we have? Should we just toss the constitution and it's implied liberty for all?\n\n \n Voting and democracy are not \"mob-rule.\"", 
   {}, 
   193369, 
   null, 
   1137776100.0
  ], 
  [
   193429, 
   null, 
   "Steeeeve", 
   "I realize we aren't talking about \"civil RIGHTs\" here but it still amazes me that no one has a clue about what that word even means....Here is just a simple definition of it:\n \n http://dictionary.reference.com/search?q=civil%20right\n \n Main Entry: civil right\n Function: noun\n : CIVIL LIBERTY; especially : any of the civil liberties guaranteed by the 13th, 14th, and 15th Amendments to the Constitution and by the Civil Rights Acts -usually used in pl. -see also Civil Rights Act of 1964 in the IMPORTANT LAWS section \n \n civil right\n \n n : right or rights belonging to a person by reason of citizenship including especially the fundamental freedoms and privileges guaranteed by the 13th and 14th amendments and subsequent acts of Congress including the right to legal and social and economic equality [syn: civil rights]", 
   {
    "unicode_changes_made": true
   }, 
   193424, 
   null, 
   1137777660.0
  ], 
  [
   193465, 
   null, 
   "doG", 
   "Voting and democracy are not \"mob-rule.\"\n\n A true democracy or majority rule is mob rule. Also known as Ochlocracy, a pejorative term for democracy and more specifically, majoritarianism. The majority out votes the minority effectively blocking their views.", 
   {}, 
   193424, 
   null, 
   1137785100.0
  ], 
  [
   193467, 
   null, 
   "JPSartre12", 
   "Of course.\n \n And heres the kicker - It does change the definition, as far as the 'flock' of that church is concerned. You can have your religious definition, and they can have theirs. Both equally valid under the eyes of a secular government.\n \n\n Again, that's your opinion, but not the law. US Law defines marriage as 1 man/1 woman. Just as my church can't redefine the legal term \"minority\" to gain preferrential treatment, a church can't redefine marriage for legal purposes. \n \n\n Thats great for you. I assume the same applies in places like Canada, Scotland or Ireland, where gay marriages are legal and accepted.\n\n Fine. They can do whatever the Hell they like. I'm not a Canadian, Scottish or Irish citizen, so I shouldn't have any say in what they do....Just as an Aussie has ZERO say in what the US choses to call marriage. :p \n \n\n My queries remain unanswered. Why are gay marriages bad? Why can't a gay church have it's own definition of Marriage, like other religions do? The solution seems pretty simple as I see it. All civil unions equal under the eyes of the law, and all mariages equal under the eyes of their respective churches. And of course, any two consenting adults can get a civil union, regardless of their gender.\n\n \n \"Gay marriage\" is a misnomer. It isn't recognized as a legitimate use of the term \"marriage\" here in the US. I have no problem with it being called what it is, a civil union. You can call it anything you like in OZ.", 
   {}, 
   193380, 
   null, 
   1137785520.0
  ], 
  [
   193468, 
   null, 
   "JPSartre12", 
   "The catholic church has always been behind the times it only took 359 years to say that Galileo was right. http://www.bibletopics.com/biblestudy/71.htm\n\n \n Still taking shots at Catholicism? When's it my turn to take shots at gays? Oh, I forgot, gays are a protected species in this forum but religions aren't. emoticon_rolleyes", 
   {}, 
   193402, 
   null, 
   1137785700.0
  ], 
  [
   193475, 
   null, 
   "Jo Bennett", 
   "I realize we aren't talking about \"civil RIGHTs\" here but it still amazes me that no one has a clue about what that word even means....Here is just a simple definition of it:\n \n http://dictionary.reference.com/search?q=civil%20right\n \n Main Entry: civil right\n Function: noun\n : CIVIL LIBERTY; especially : any of the civil liberties guaranteed by the 13th, 14th, and 15th Amendments to the Constitution and by the Civil Rights Acts -usually used in pl. -see also Civil Rights Act of 1964 in the IMPORTANT LAWS section \n \n civil right\n \n n : right or rights belonging to a person by reason of citizenship including especially the fundamental freedoms and privileges guaranteed by the 13th and 14th amendments and subsequent acts of Congress including the right to legal and social and economic equality [syn: civil rights]\n\n \n It's a little bit... americo-centric that definition.", 
   {
    "unicode_changes_made": true
   }, 
   193429, 
   null, 
   1137787320.0
  ], 
  [
   193476, 
   null, 
   "trebor", 
   "\n \"Gay marriage\" is a misnomer. It isn't recognized as a legitimate use of the term \"marriage\" here in the US. I have no problem with it being called what it is, a civil union. You can call it anything you like in OZ.\n\n \n \n Not in the state of Massachuess and Vermont.", 
   {}, 
   193467, 
   null, 
   1137787440.0
  ], 
  [
   193553, 
   null, 
   "Adept", 
   "Again, that's your opinion, but not the law. US Law defines marriage as 1 man/1 woman. Just as my church can't redefine the legal term \"minority\" to gain preferrential treatment, a church can't redefine marriage for legal purposes.\n\n \n When debating over the internet, specifically on issues like this, specific countries laws often prove more of a hindrance than a help. On a global level, the definition of marriage has changed. Gay people can now get married. You might not like it, but there it is. They might not be allowed in the US, but that doesn't mean the definition has not changed.\n \n \n\"Gay marriage\" is a misnomer. It isn't recognized as a legitimate use of the term \"marriage\" here in the US. I have no problem with it being called what it is, a civil union. You can call it anything you like in OZ.\n\n \n But why do you have a problem with it being called marriage? All it would be doing is changing your definition of the word, and I've seen no supporting arguments that would indicate that your definition is any better than anyone elses. Other places have already accepted the change, what reasons do you have for opposing it?", 
   {}, 
   193467, 
   null, 
   1137813000.0
  ], 
  [
   193554, 
   null, 
   "JPSartre12", 
   "The 'law' at one time, defined a \"negro\" as not quite a human being, but more as an object of property, to be bought and sold. This, from the highest court in the land. That view eventually changed, perhaps to your disappointment?  Whatever. Expect more of the same with regard to the civil status of gay marriage. As I indicated earlier, you can either get on the train, watch it pass by, or attempt to obstruct it. It's your choice.\n\n \n Your pathetic attempts to take shots at me belies the vacuous nature of your position. emoticon_rolleyes", 
   {}, 
   193373, 
   null, 
   1137813960.0
  ], 
  [
   193555, 
   null, 
   "JPSartre12", 
   "When debating over the internet, specifically on issues like this, specific countries laws often prove more of a hindrance than a help. On a global level, the definition of marriage has changed. Gay people can now get married. You might not like it, but there it is. They might not be allowed in the US, but that doesn't mean the definition has not changed.\n \n\n I believe that I've been quite clear that I'm speaking about the US. emoticon_confused We have a law that defines marriage. It's usually referred to as DOMA (defense of marriage act). It states that marriage is legally defined as 1 man/1 woman ONLY.\n \n\n But why do you have a problem with it being called marriage? All it would be doing is changing your definition of the word, and I've seen no supporting arguments that would indicate that your definition is any better than anyone elses. Other places have already accepted the change, what reasons do you have for opposing it?\n\n \n No, you would be changing more than the meaning. You'd be changing the value of the term as well. And just because others do it makes for a lousy position in an argument. Didn't your parents ever tell you \"I don't care what others do, you aren't going to do it\"? :)", 
   {}, 
   193553, 
   null, 
   1137814320.0
  ], 
  [
   193557, 
   null, 
   "Adept", 
   "I believe that I've been quite clear that I'm speaking about the US. emoticon_confused We have a law that defines marriage. It's usually referred to as DOMA (defense of marriage act). It states that marriage is legally defined as 1 man/1 woman ONLY.\n\n \n As I said, a hindrance not a help. When we get down to the 'Well, things in this country are just the way I want, and will never change!\" arguments, then the debate stagnates. Personally, I'd rather debate the merits of allowing gay marriage.\n \n Your DOMA has one definition of marriage. Others exist, and in many places they include gay marriage. I've yet to see a reason why the USA should not adopt those more liberal definitions.\n \n \nNo, you would be changing more than the meaning. You'd be changing the value of the term as well.\n\n \n So, it'd be going from a ten to an eight? Or maybe a six...\n \n Surely you can see how vaccuous the term 'vallue' is when used without qualifiers? Changing the value? Do you think married couples in Scotland are less married because they now alllow gay couples to be married?\n \n \nAnd just because others do it makes for a lousy position in an argument. Didn't your parents ever tell you \"I don't care what others do, you aren't going to do it\"? :)\n\n \n I thought you opposed the all or nothing arguments? The example my mother used was 'If everyone else was jumping off a bridge, would you do it too?' to which I (silently, mind) responded 'Well, they aren't jumping off a bridge.' Gay marriage not harmful to anyone or anything. What reason is there to deny it to people?", 
   {}, 
   193555, 
   null, 
   1137814980.0
  ], 
  [
   193558, 
   null, 
   "JPSartre12", 
   "As I said, a hindrance not a help. When we get down to the 'Well, things in this country are just the way I want, and will never change!\" arguments, then the debate stagnates. Personally, I'd rather debate the merits of allowing gay marriage.\n\n The topic was is marriage a civil or religious rite, not \"what are the merits of gay marriage\".\n \n\n Your DOMA has one definition of marriage. Others exist, and in many places they include gay marriage. I've yet to see a reason why the USA should not adopt those more liberal definitions.\n \n\n How about this for a reason. The majority of Americans don't support gay marriage and they vote accordingly. \n \n\n So, it'd be going from a ten to an eight? Or maybe a six...\n \n\n Try Zero\n \n\n Surely you can see how vaccuous the term 'vallue' is when used without qualifiers? Changing the value? Do you think married couples in Scotland are less married because they now alllow gay couples to be married?\n\n Value as a religious rite. Remember the topic?\n \n\n I thought you opposed the all or nothing arguments? The example my mother used was 'If everyone else was jumping off a bridge, would you do it too?' to which I (silently, mind) responded 'Well, they aren't jumping off a bridge.' Gay marriage not harmful to anyone or anything. What reason is there to deny it to people?\n\n This isn't the place to debate the relative benefits of gay marriage. That belongs in the gay forum, not the religion forum.", 
   {}, 
   193557, 
   null, 
   1137816180.0
  ], 
  [
   193560, 
   null, 
   "Orion", 
   "Originally Posted by Orion\n No problem, so long as you recognize that in this country, marriage is an institution governed by civil law, and when civil law prohibits two consenting adults who happen to be the same sex or who happen to be of mixed race from entering into a state of legal marriage, the law is engaging in a violation of civil rights based upon unjustifiable discrimination.\n \n \nThat's YOUR opinion, not the law. The law defines marriage as one man/one woman. Ever read the DOMA? It is currently the law of the land. In addition, 19 states have recently passed state laws defining marriage as one man/one woman.\n\n \n This just in...\n \n Associated Press - Updated: 3:52 p.m. ET Jan. 20, 2006\n \n Maryland ban on gay marriage is struck down\n \n Judge finds 33-year-old state law to be unconstitutional\n \n BALTIMORE - A judge on Friday struck down a 33-year-old Maryland law against same-sex marriage, agreeing with 19 gay men and women that it violates the state constitution&#8217;s guarantee of equal rights. \n \n Source: MSNBC", 
   {}, 
   193367, 
   null, 
   1137816480.0
  ], 
  [
   193561, 
   null, 
   "JPSartre12", 
   "Originally Posted by Orion\n No problem, so long as you recognize that in this country, marriage is an institution governed by civil law, and when civil law prohibits two consenting adults who happen to be the same sex or who happen to be of mixed race from entering into a state of legal marriage, the law is engaging in a violation of civil rights based upon unjustifiable discrimination.\n \n \n \n This just in...\n \n Associated Press - Updated: 3:52 p.m. ET Jan. 20, 2006\n \n Maryland ban on gay marriage is struck down\n \n Judge finds 33-year-old state law to be unconstitutional\n \n BALTIMORE - A judge on Friday struck down a 33-year-old Maryland law against same-sex marriage, agreeing with 19 gay men and women that it violates the state constitution's guarantee of equal rights. \n \n Source: MSNBC\n\n \n Maybe this one will go to the SCOTUS and then we can see the fur fly.", 
   {
    "unicode_changes_made": true
   }, 
   193560, 
   null, 
   1137816540.0
  ], 
  [
   193565, 
   null, 
   "Adept", 
   "The topic was is marriage a civil or religious rite, not \"what are the merits of gay marriage\".\n\n \n Indeed. But what you've effectively said is, \"I don't care if it is religious or secular in nature. No church should ever be allowed to carry out a gay marriage.\"\n \n \nHow about this for a reason. The majority of Americans don't support gay marriage and they vote accordingly.\n\n \n I find it an odd thing to vote on, really. You wouldn't vote on a law stopping gay people from going to the cinema, would you? I understand how it works. A political candidate makes it known that he opposes gay marriage, and then people vote for him, so you aren't specifically voting on a bill that would prevent gay marriage.\n \n My question is, should the majority have a say in what the minority want to do? Providing all the people involved are consenting adults, what right does the majority have to stick their noses in?\n \n Importantly, If a church was set up to carry out gay marriage ceremonies, what grounds would the government have to step in and prevent it?\n \n You've said it's okay for gay couples to get a civil union. Why can't they also get married, if their church allows it?\n \n \nTry Zero\n \n Value as a religious rite. Remember the topic?\n\n \n Thats not a qualifier. Saying the value of marriage goes to zero would indicate that all marriages become null and void once the government allows gay marriage. Like people suddenly become 'un-married' or something. How would that work?", 
   {}, 
   193558, 
   null, 
   1137817140.0
  ], 
  [
   193569, 
   null, 
   "JPSartre12", 
   "Indeed. But what you've effectively said is, \"I don't care if it is religious or secular in nature. No church should ever be allowed to carry out a gay marriage.\"\n I find it an odd thing to vote on, really. You wouldn't vote on a law stopping gay people from going to the cinema, would you? I understand how it works. A political candidate makes it known that he opposes gay marriage, and then people vote for him, so you aren't specifically voting on a bill that would prevent gay marriage.\n\n Wrong. 19 states SPECIFIC had anti-gay marriage initiatives on the 2004 ballot and every anti-gay initiative won overwhelmingly.\n \n\n My question is, should the majority have a say in what the minority want to do? Providing all the people involved are consenting adults, what right does the majority have to stick their noses in?\n\n Because marriage is regulated by law and laws are made by politicians who are voted in office by voters, who vote in accordance with their beliefs which happen to be mostly Christian in the US. \n \n\n Importantly, If a church was set up to carry out gay marriage ceremonies, what grounds would the government have to step in and prevent it?\n\n They wouldn't prevent it; it just wouldn't be legally recognized.\n \n\n You've said it's okay for gay couples to get a civil union. Why can't they also get married, if their church allows it?\n\n No, I said that I didn't mind civil unions. There are more people who don't think it's OK either. And I've already answered the question above.\n \n\n Thats not a qualifier. Saying the value of marriage goes to zero would indicate that all marriages become null and void once the government allows gay marriage. Like people suddenly become 'un-married' or something. How would that work?\n\n If I earn a medal of honor in battle today and tomorrow Uncle Sam decides to send them out in the mail to every US citizen, do you think my medal would be devalued? I do.", 
   {}, 
   193565, 
   null, 
   1137818400.0
  ], 
  [
   193570, 
   null, 
   "Adept", 
   "Wrong. 19 states SPECIFIC had anti-gay marriage initiatives on the 2004 ballot and every anti-gay initiative won overwhelmingly.\n\n \n Wow. Thats appalling.\n \n \nThey wouldn't prevent it; it just wouldn't be legally recognized.\n\n \n But if they also had a civil union...\n \n \nIf I earn a medal of honor in battle today and tomorrow Uncle Sam decides to send them out in the mail to every US citizen, do you think my medal would be devalued? I do.\n\n \n So, being married is like earning a medal of honour? And allowing gay marriage would equate to everyone in the country getting married?\n \n Your analogy makes no sense. Getting married is in no way similar to earning a medal, and allowing gay marriage would in no way equate to everyone getting a medal, or in the case of the analogy, getting married.", 
   {}, 
   193569, 
   null, 
   1137819060.0
  ], 
  [
   193571, 
   null, 
   "JPSartre12", 
   "Wow. Thats appalling.\n\n In your opinion.\n \n\n But if they also had a civil union...\n\n Some states would recognize it, but not many.\n \n\n So, being married is like earning a medal of honour? And allowing gay marriage would equate to everyone in the country getting married?\n \n\n As I said before, marriage is a sacrament to many people.\n \n\n Your analogy makes no sense. Getting married is in no way similar to earning a medal, and allowing gay marriage would in no way equate to everyone getting a medal, or in the case of the analogy, getting married.\n\n Sacraments aren't handed out to just anyone, but I wasn't trying to argue that they were equivalent only that the principle was the same.:xbanghead", 
   {}, 
   193570, 
   null, 
   1137819420.0
  ], 
  [
   193574, 
   null, 
   "Orion", 
   "My question is, should the majority have a say in what the minority want to do? Providing all the people involved are consenting adults, what right does the majority have to stick their noses in?\n \n Importantly, If a church was set up to carry out gay marriage ceremonies, what grounds would the government have to step in and prevent it?\n \n You've said it's okay for gay couples to get a civil union. Why can't they also get married, if their church allows it?\n\n \n To a considerable extent, the politics of many American Christian conservatives/fundamentalists is rooted in fear - specifically, the fear that traditional values, developed back in the 'good old days', are coming under increasing attack by Bible-bashing, God-hating liberals. What they often forget is that those traditional values included such things as slavery, the subjugation of women, the near-extermination of native peoples, racial and sexual discrimination, imperialism, and an almost complete disregard as to the protection of natural environment. Blacks, Mexicans, and Chinese were viewed as somewhat less than human, and Jews (in many cases) were prohibited from joining country clubs. The anti-Gay backlash we see today in America on the part of many Christian conservatives/fundamentalists is simply an extension of this desire to return to the 'good old days'.", 
   {}, 
   193565, 
   null, 
   1137820980.0
  ], 
  [
   193578, 
   null, 
   "Adept", 
   "In your opinion.\n\n \n Of course. It makes me wonder what goes through the minds of people who wish to limit and prohibit the actions of others, especially when such actions are harmless. I can understand prohibiting train surfing or base diving. That gets people killed. I can understand prohibiting underground 'fight clubs'. People get injured, or worse. But gay marriage? Nope.\n \n \nSome states would recognize it, but not many.\n\n \n So if they got a civil union, then married by a religious ceremony in their own church, some states would accept that? By the by, how similar are the legal workings of a marriage and a civil union?\n \n \nAs I said before, marriage is a sacrament to many people.\n\n \n Sure. A sacrament being a formal religious act which confers grace on those who recieve or go through it. How does allowing gay (or even atheist) marriages make those who have recieved this sacrament any less blessed?\n \n \nSacraments aren't handed out to just anyone\n\n \n Sure they are. I could go to church tomorrow and get one.\n \n \nbut I wasn't trying to argue that they were equivalent only that the principle was the same.:xbanghead\n\n \n But it's not. A marriage is a formalised relationship between two people, recieving a medal is acknowledgment of actions above and beyond the call of duty. They are in all respects, completely different. The principle is completely different. Your analogy proposes that if everyone shares the same type of relationship, that relationship is meaningless.\n \n So, if everyone had a mother, the relationship between mother and child would be meaningless.\n \n Having a gay couple get married no more devalues your own marriage, or anyone elses, than having a hetro couple get married. Sure, it's not a valid marriage as far as your religion is concerned. But then, neither are mormon marriages, jewish marriages, or muslim marriages.", 
   {}, 
   193571, 
   null, 
   1137823200.0
  ], 
  [
   193582, 
   null, 
   "Orion", 
   "Wrong. 19 states SPECIFIC had anti-gay marriage initiatives on the 2004 ballot and every anti-gay initiative won overwhelmingly.\n \n Because marriage is regulated by law and laws are made by politicians who are voted in office by voters, who vote in accordance with their beliefs which happen to be mostly Christian in the US.\n\n \n Evidence of the genius of this country's founders is that they gave the judiciary the power to protect a numerical minority (or even a single individual) from the potential tyranny of a numerical majority, or from abuses instigated by the State. I suggest that you ponder that fact. \n \n Re: \n \n Associated Press - Updated: 3:52 p.m. ET Jan. 20, 2006\n \n Maryland ban on gay marriage is struck down\n \n Judge finds 33-year-old state law to be unconstitutional\n \n BALTIMORE - A judge on Friday struck down a 33-year-old Maryland law against same-sex marriage, agreeing with 19 gay men and women that it violates the state constitution's guarantee of equal rights. \n \n Source: MSNBC", 
   {}, 
   193569, 
   null, 
   1137823740.0
  ], 
  [
   193609, 
   null, 
   "JPSartre12", 
   "Evidence of the genius of this country's founders is that they gave the judiciary the power to protect a numerical minority (or even a single individual) from the potential tyranny of a numerical majority, or from abuses instigated by the State. I suggest that you ponder that fact. \n \n Re: \n \n Associated Press - Updated: 3:52 p.m. ET Jan. 20, 2006\n \n Maryland ban on gay marriage is struck down\n \n Judge finds 33-year-old state law to be unconstitutional\n \n BALTIMORE - A judge on Friday struck down a 33-year-old Maryland law against same-sex marriage, agreeing with 19 gay men and women that it violates the state constitution's guarantee of equal rights. \n \n Source: MSNBC\n\n \n Tell me, how many more times are you going to post this reference in this thread? I believe the forum doesn't allow multiple posting of the same thing.", 
   {}, 
   193582, 
   null, 
   1137827940.0
  ], 
  [
   193612, 
   null, 
   "Orion", 
   "Tell me, how many more times are you going to post this reference in this thread? I believe the forum doesn't allow multiple posting of the same thing.\n\n \n I suspect that twice is enough, given the extreme brevity of the AP quote which I posted. My intent was to impart upon you a civics lesson, a lession which you seem reluctant to accept, and which contradicts your earlier assertions as to the supremacy of voter initiatives. Judicial Review is not to be taken lightly.", 
   {}, 
   193609, 
   null, 
   1137829560.0
  ], 
  [
   193737, 
   null, 
   "JPSartre12", 
   "I suspect that twice is enough, given the extreme brevity of the AP quote which I posted. My intent was to impart upon you a civics lesson, a lession which you seem reluctant to accept, and which contradicts your earlier assertions as to the supremacy of voter initiatives. Judicial Review is not to be taken lightly.\n\n \n And what you fail to grasp is that the composition of the most powerful Judicial body has taken a decidedly detour from its liberal activist past. I expect the new SCOTUS to be stronger supporters of State's Rights unlike its predecessors who strongarmed federalism down state's throats in the form of Roe v Wade and other activist rulings.", 
   {}, 
   193612, 
   null, 
   1137877080.0
  ], 
  [
   193783, 
   null, 
   "Orion", 
   "And what you fail to grasp is that the composition of the most powerful Judicial body has taken a decidedly detour from its liberal activist past. I expect the new SCOTUS to be stronger supporters of State's Rights unlike its predecessors who strongarmed federalism down state's throats in the form of Roe v Wade and other activist rulings.\n\n \n I remember when Roe came down. I was barely two years out of college. For my generation, that decision was no big thing. Abortion services were readily available. A couple of discreet questions would yield you the address of a doctor's office. Of course, things were not quite as rosy for women who, out of desperation, chose the do-it-yourself route, using a coat hanger or bleach. \n \n Do you really believe that, after 35 years, the American people would tolerate a reversal of Roe? If you believe so, I can only conclude that your naivety is breathtaking.", 
   {}, 
   193737, 
   null, 
   1137899220.0
  ], 
  [
   193788, 
   null, 
   "JPSartre12", 
   "I remember when Roe came down. I was barely two years out of college. For my generation, that decision was no big thing. Abortion services were readily available. A couple of discreet questions would yield you the address of a doctor's office. Of course, things were not quite as rosy for women who, out of desperation, chose the do-it-yourself route, using a coat hanger or bleach. \n \n Do you really believe that, after 35 years, the American people would tolerate a reversal of Roe? If you believe so, I can only conclude that your naivety is breathtaking.\n\n \n I can almost guarantee you an overturning of Roe v Wade. Alito was nominated by Bush for more than just his charm. Read his application for a job in the Reagan Admin. He spells it out quite clearly. And it should be overturned. It's bad law. Whether or not you oppose abortion is really irrelevent. Roe v Wade is a giant gash in the fabric of our system of checks and balances that needs to be mended. Period.", 
   {}, 
   193783, 
   null, 
   1137899700.0
  ], 
  [
   193795, 
   null, 
   "Orion", 
   "I can almost guarantee you an overturning of Roe v Wade. \n\n \n That, and $1.00, will buy you a cup of coffee. Again, your naivety comes across as breathtaking. Were abortions performed prior to Roe? Of course they were. Where demand for a service exists, that demand will be satisfied. What I find most amusing, however, is that opponents of abortion are (in many cases) equally opposed to sex education for children within our public schools.", 
   {}, 
   193788, 
   null, 
   1137902460.0
  ], 
  [
   193796, 
   null, 
   "JPSartre12", 
   "That, and $1.00, will buy you a cup of coffee. Again, your naivety comes across as breathtaking. Were abortions performed prior to Roe? Of course they were. Where demand for a service exists, that demand will be satisfied. What I find most amusing, however, is that opponents of abortion are (in many cases) equally opposed to sex education for children within our public schools.\n\n \n No, my friend, it is you that is naive. Mark my words. It doesn't matter if you're pro-abortion or pro-life, the SCOTUS ruling was fatally flawed and represents a giant black eye in our legal system. While some of the damage was repaired in subsequent rulings, it still represents the height of judicial activism and is discussed in law schools throughout the US as an example of the SCOTUS' usurpation of legislative authority. It's the thorn in any strict Constitutionalist's foot and we have/will have several of them on the SCOTUS.", 
   {}, 
   193795, 
   null, 
   1137905460.0
  ], 
  [
   193803, 
   null, 
   "Orion", 
   "It doesn't matter if you're pro-abortion or pro-life,\n\n \n I don't know of anyone who is 'pro-abortion', but I've encountered a considerable number of individuals who are opposed to sex education for our children. I recall a survey taken awhile back which suggested that a considerable number of American teenage girls failed to make the connection between sexual intercourse and pregnancy. \n \n \n...the SCOTUS ruling was fatally flawed and represents a giant black eye in our legal system.\n \n \n Blackmun (a Nixon appointee) did the best he could. Roe was nothing less than a judicial affirmation of what everyone already knew: a woman in need of an abortion will obtain an abortion. That's not going to change. The best we can hope for is to reduce the number of abortions as close as possible to zero, and that can only come about through education as well as the easy availability of birth control mechanisms. You can thank me later for the reality check.", 
   {}, 
   193796, 
   null, 
   1137908220.0
  ], 
  [
   193806, 
   null, 
   "JPSartre12", 
   "I don't know of anyone who is 'pro-abortion', but I've encountered a considerable number of individuals who are opposed to sex education for our children. I recall a survey taken awhile back which suggested that a considerable number of American teenage girls failed to make the connection between sexual intercourse and pregnancy. \n\n I know lots of people, liberal and conservative, who don't want schools teaching their kids about sex. As parents, they take that as part of their responsibility. Schools aren't little test tubes for social indoctrination; they're places for kids to be educated. When we started thinking of schools as one stop shopping for all of our kids needs, we fell behind the rest of the world in education. \n \n\n Blackmun (a Nixon appointee) did the best he could. Roe was nothing less than a judicial affirmation of what everyone already knew: a woman in need of an abortion will obtain an abortion. \n\n No, as Justice Black remarked, it was a display of raw judicial power. The only thing it did was establish the SCOTUS as a superlegislature and that's a dangerous thing to do. Our founding fathers were leary about giving that much power to a few unelected judges.\n \n \n That's not going to change. The best we can hope for is to reduce the number of abortions as close as possible to zero, and that can only come about through education as well as the easy availability of birth control mechanisms. You can thank me later for the reality check.\n\n Whether or not abortions should be allowed in a state is the state's right to decide, not the SCOTUS. I, too, think that the key to reducing the number of abortions is through education. I guess we just disagree with who should do the teaching.", 
   {}, 
   193803, 
   null, 
   1137908940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is marriage a civil or religious rite, or something else?", 
  "url": "http://www.4forums.com/political/religion-debates/7355-marriage-civil-religious-rite-something-else.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7355, 
  "discussion_files": [
   [
    "20508.html", 
    "http://www.4forums.com/political/religion-debates/7355-marriage-civil-religious-rite-something-else-print.html"
   ], 
   [
    "20509.html", 
    "http://www.4forums.com/political/religion-debates/7355-marriage-civil-religious-rite-something-else-6-print.html"
   ], 
   [
    "20510.html", 
    "http://www.4forums.com/political/religion-debates/7355-marriage-civil-religious-rite-something-else-4-print.html"
   ], 
   [
    "20511.html", 
    "http://www.4forums.com/political/religion-debates/7355-marriage-civil-religious-rite-something-else-5-print.html"
   ], 
   [
    "20512.html", 
    "http://www.4forums.com/political/religion-debates/7355-marriage-civil-religious-rite-something-else-3-print.html"
   ], 
   [
    "20513.html", 
    "http://www.4forums.com/political/religion-debates/7355-marriage-civil-religious-rite-something-else-2-print.html"
   ]
  ], 
  "identifier": 7355
 }
]