[
 [
  [
   192766, 
   null, 
   "maximus", 
   "Do the proponents of \"safe sex\" with condoms and contraceptives support or oppose laws regarding statutory rape?", 
   {
    "post_info": {
     "post_title": "Safe sex and statutory rape"
    }
   }, 
   null, 
   null, 
   1137475680.0
  ], 
  [
   192770, 
   null, 
   "Linus", 
   "I don't understand the relevance of the this question to the subject of abortion rights. \n Considering \"statutory rape\" is an extremely vague definition...as long as a government believes a 12 year old has reached the \"statutory age of consent\" then you would technically support sex between a 12 year old and 53 year old. \n I don't even see why those that believe in safe sex need to only reply to this question either.", 
   {}, 
   192766, 
   null, 
   1137476700.0
  ], 
  [
   192773, 
   null, 
   "Steeeeve", 
   "how are the two related? It seems like this is saying something like \"Do the people that eat at Burger King twice a week support or oppose buying stock in IBM?\"", 
   {}, 
   192770, 
   null, 
   1137477960.0
  ], 
  [
   192782, 
   null, 
   "maximus", 
   "Qualification: Do the proponents of \"safe sex\" for teens with condoms and contraceptives support or oppose laws regarding statutory rape?\n \n You are probably right in that this may not exactly fit with the abortion forum but it may be closely related.", 
   {}, 
   192773, 
   null, 
   1137480060.0
  ], 
  [
   192784, 
   null, 
   "Linus", 
   "You do realize you are asking a question to an issue that has multiple definitions with a pigeonholed response? It is like asking group X whether they support or condemn sex but not defining sex with who, with or when. Most people would respond with a yes but this doesn't mean they'd condone rape. \n To either support or condemn statuary consent laws incredibly depends on the multiple definitions of \"age of consent\" provided by the lawmakers.", 
   {
    "unicode_changes_made": true
   }, 
   192782, 
   null, 
   1137481860.0
  ], 
  [
   192785, 
   null, 
   "Steeeeve", 
   "I am still kinda confused by this but I think people will say \"yes\"...so just assume yes and state your point.", 
   {}, 
   192784, 
   null, 
   1137482400.0
  ], 
  [
   192789, 
   null, 
   "Iuris", 
   "I think the connection that maximus sees is the issue of underage sex overall, once viewed from the idea of sex for teens is OK, just teach them to use condoms and once viewed from the idea that teens can't consent to sex due to sexual immaturity, which is the idea behind statutory rape.\n \n Personally, I'm not really ll for statutory rape, as it is implemented currently. I'd always go for the criteria of \"was the free will of those involved violated\", but shifting the burden of proof to more mature person.", 
   {}, 
   192785, 
   null, 
   1137488700.0
  ], 
  [
   193023, 
   null, 
   "maximus", 
   "I think the connection that maximus sees is the issue of underage sex overall, once viewed from the idea of sex for teens is OK, just teach them to use condoms and once viewed from the idea that teens can't consent to sex due to sexual immaturity, which is the idea behind statutory rape.\n \n Personally, I'm not really ll for statutory rape, as it is implemented currently. I'd always go for the criteria of \"was the free will of those involved violated\", but shifting the burden of proof to more mature person.\n\n Iuris has perceptively seen the connection between safe sex for teens and statutory rape to which I was alluding. I was asking a leading question. Most would say that they condemn statutory rape due to the immaturity/ vulnerability of the young person, the possibility of manipulation on the part of the older person, etc. But these people would at the same time be in favor of issuing condoms and birth control pills to teens for sex. If we are going to say that statutory rape should be condemned due to teens not being ready for sex and not being able to make sound decisions, due to the serious emotional and pyschological consequences they might suffer...then why would we then equip teens, so that two sexually immature persons might together participate in sex and suffer the various consequences. The abstinence approach seems more consistent.", 
   {}, 
   192789, 
   null, 
   1137566040.0
  ], 
  [
   193026, 
   null, 
   "Steeeeve", 
   "yeah, i was a little confused on what you were getting at. No one said laws were ever consistent....look at the fact that if you kill a mother and unborn it is 2 people killed while if the mother does it no one is killed. \n \n I'm not all sure how I feel on the issue though...this should probably be in the crime debate forum by the way emoticon_xangel \n \n But anyway, time for bed...emoticon_zzzz always wanted to use that", 
   {}, 
   193023, 
   null, 
   1137568200.0
  ], 
  [
   193029, 
   null, 
   "Linus", 
   "I predicted that it was a leading question...which is why I demanded that you define your vague and dubious question because I could easily smell a motive behind it. The fact that you couldn't explain it really added value to this prediction. I dislike it when people pussyfoot around when trying to explain their views. \n Any ways, your question is probably better suited for the Health, Current Events or Education forums. \n However I will say a few things from my own personal observations; abstinence is a lot like communism. Both had strong, zealous supporters and their ideology often blinded them from reality. Even when millions have been infected by HIV or purged both are still eager to advocate their ideology as safe and effective. Of course, reality discloses otherwise. Abstinence, much like communism, only works when all parties agree to it. The whole \"lets teach abstinence and let the consequences be damned\" culture has easily propelled my state (North Carolina) into the top 10 states within the Union to have the highest HIV infection rate.", 
   {
    "unicode_changes_made": true
   }, 
   193026, 
   null, 
   1137571020.0
  ], 
  [
   193031, 
   null, 
   "Jo Bennett", 
   "There is no inconsistency here. Virtually nobody wants minors to be having sex, but most people acknowledge that some will be, and seek to mitigate the effects.", 
   {}, 
   193029, 
   null, 
   1137589680.0
  ], 
  [
   196641, 
   null, 
   "maximus", 
   "I predicted that it was a leading question...which is why I demanded that you define your vague and dubious question because I could easily smell a motive behind it. The fact that you couldn't explain it really added value to this prediction. I dislike it when people pussyfoot around when trying to explain their views. \n Any ways, your question is probably better suited for the Health, Current Events or Education forums. \n However I will say a few things from my own personal observations; abstinence is a lot like communism. Both had strong, zealous supporters and their ideology often blinded them from reality. Even when millions have been infected by HIV or purged both are still eager to advocate their ideology as safe and effective. Of course, reality discloses otherwise. Abstinence, much like communism, only works when all parties agree to it. The whole \"lets teach abstinence and let the consequences be damned\" culture has easily propelled my state (North Carolina) into the top 10 states within the Union to have the highest HIV infection rate.\n\n \"Right is right, even if nobody does it. Wrong is wrong even if everybody is wrong about it.\" G.K. Chesterton\n \n We must continue to put forth the message of abstinence. All most kids need is someone to talk to them about it...a mentor that steps in and tells kids that it is okay to be abstinent often takes away the pressures of having sex. It is much better than the everybody is doing it, it's natural approach.\n \n What leads you to link the abstinence movement and the increased HIV infection rate in your state is related?", 
   {
    "unicode_changes_made": true
   }, 
   193029, 
   null, 
   1139040060.0
  ], 
  [
   196644, 
   null, 
   "maximus", 
   "There is no inconsistency here. Virtually nobody wants minors to be having sex, but most people acknowledge that some will be, and seek to mitigate the effects.\n\n No inconsistency? Let's seek to mitigate the effects of sex by giving minors the tools for sex?? What about the emotional, self-esteem, and relationship effects outside of the physical realm? Do the tools of mitigation help this? \n \n What if we had the same approach with statutory rape? Give the minors condoms and contraception to mitigate the effects. What if we reformulated your response in this way, \"Virtually nobody wants minors to be having sex with adults, but most people acknowledge that some will be, and seek to mitigate the effects.\"", 
   {}, 
   193031, 
   null, 
   1139040300.0
  ], 
  [
   196647, 
   null, 
   "Master_Shake", 
   "Iuris has perceptively seen the connection between safe sex for teens and statutory rape to which I was alluding. I was asking a leading question. Most would say that they condemn statutory rape due to the immaturity/ vulnerability of the young person, the possibility of manipulation on the part of the older person, etc. But these people would at the same time be in favor of issuing condoms and birth control pills to teens for sex. If we are going to say that statutory rape should be condemned due to teens not being ready for sex and not being able to make sound decisions, due to the serious emotional and pyschological consequences they might suffer...then why would we then equip teens, so that two sexually immature persons might together participate in sex and suffer the various consequences. The abstinence approach seems more consistent.\n\n Believing there should be some sort of statutory rape law and believing that teenagers should have access to and knowledge of birth control is not inconsistent, it's realistic. Yes, statutory rape is about protecting people for the reasons you state. But the fact of the matter is, teenagers have sex, at least let them o it with condoms. I'm all for abstinence maximus. Few people want XXXXXX (aka 15 year oldsemoticon_xangel ) having sex and producing more XXXXXX, than me, but the reality is that if abstinence isn't established in the home, it isn't going to be established. Therefore we have to do what we can to equip these teenagers to do what they can to protect themselves and the rest of us.\n \nWe must continue to put forth the message of abstinence. All most kids need is someone to talk to them about it...a mentor that steps in and tells kids that it is okay to be abstinent often takes away the pressures of having sex. It is much better than the everybody is doing it, it's natural approach.\n\n This is a bit of a straw man here maximus and I know you're smart enough to know that. The \"everybody's doing it, it's natural\" approach isn't an approach at all. It's what kids say to each other, it isn't what proponents of safe sex education are saying.\n \nWhat leads you to link the abstinence movement and the increased HIV infection rate in your state is related?\n\n I think he believes it to be related because abstinence only education (as much as I would like it to) does not lead to teenagers having less sex, it leads to teenagers having less safe sex. Consequently, STDs are spread more rapidly.", 
   {}, 
   196641, 
   null, 
   1139041080.0
  ], 
  [
   196778, 
   null, 
   "Doomhörn", 
   "Not exactly sure what you are saying but I'll put in my two cents. You are asking if teens use contraceptives, they are not breaking the statutory rape thing or are they? Technically, the male partner would be :xcensored and the girl is fine (on the side of the law but in all other respects is stigmatised by her pregnancy if she is pregnant).", 
   {}, 
   196647, 
   null, 
   1139161260.0
  ], 
  [
   197325, 
   null, 
   "Master_Shake", 
   "Maximus? Anything?\n \n Post 1,000 Wahoooemoticon_smile \n A bit uneventlful post for 1,000, but ya know. That's the way the cookie crumbles.", 
   {}, 
   196778, 
   null, 
   1139428380.0
  ], 
  [
   197360, 
   null, 
   "Master_Shake", 
   "That's weird. That last one was my 1,000th, but now it's the 999th. One of my posts must have got deleted. That's happened a few times before, and I :xcensoreding hate that admin doesn't at least notify you. Especially since I have no idea what post it was.", 
   {}, 
   197325, 
   null, 
   1139440560.0
  ], 
  [
   197399, 
   null, 
   "maximus", 
   "Master Shake,\n \nBelieving there should be some sort of statutory rape law and believing that teenagers should have access to and knowledge of birth control is not inconsistent, it's realistic. Yes, statutory rape is about protecting people for the reasons you state. But the fact of the matter is, teenagers have sex, at least let them o it with condoms. I'm all for abstinence maximus. Few people want XXXXXX (aka 15 year oldsemoticon_xangel ) having sex and producing more XXXXXX, than me, but the reality is that if abstinence isn't established in the home, it isn't going to be established. Therefore we have to do what we can to equip these teenagers to do what they can to protect themselves and the rest of us.\n\n Sorry for the delay, I've been focused on the religion forum lately.\n \n I agree with you that the best chance for abstinence to be effective is if it's established in the home. But I don't believe it can't be established outside of the home. I know that there are A LOT of VERY EFFECTIVE abstinence speakers out there that make profound impressions on the youth in schools or other public venues. All some of these teenagers need is for someone to intervene in their life...someone to tell them it is okay, safe, cool, and good to be abstinent...someone to give them an alternative. They want to do the right thing they just don't know what the right thing is or they are pressured too much to do the wrong thing.\n \n \"But the fact of the matter is, teenagers have sex\" with adults, \"at least let them do it with condoms.\" Does this work? We put barriers in place with the laws that are meant to discourage the behavior, not encourage it. Safe sex does not put barriers, it encourages the behavior. And remember, safe sex does nothing to prevent the emotional and pyschological consequences that may accompany bad sexual relationships or premature ones.\n \n \nThis is a bit of a straw man here maximus and I know you're smart enough to know that. The \"everybody's doing it, it's natural\" approach isn't an approach at all. It's what kids say to each other, it isn't what proponents of safe sex education are saying.\n\n You may be right but I'm not absolutely certain. I am sure there are groups that tell kids to explore their sexuality too early because it is \"normal\" and \"natural.\" They also disseminate a self-fulfilling prophecy by saying I know they're going to do it so it might as well be safe.\n \n \nI think he believes it to be related because abstinence only education (as much as I would like it to) does not lead to teenagers having less sex, it leads to teenagers having less safe sex. Consequently, STDs are spread more rapidly.\n\n Do the statistics when gathered ask these people contracting the disease if they have had abstinence education? How direct can this supposed correlation be?\n \n Does it ask them if they were practicing \"safe sex\" and a condom failed? Or did they think that contraception would protect them from things other than pregnancy? Did they realize that certain practices and contacts might still allow them to contract human papilloma virus even if they used a condom for intercourse?\n \n If they were not using \"safe sex\" practices then would these people be the people that ignored abstinence education alone or would they also be the people that ignored safe sex education as well? If so then why blame it on abstinence education?\n \n Peace.", 
   {}, 
   196647, 
   null, 
   1139457420.0
  ], 
  [
   197400, 
   null, 
   "maximus", 
   "Shake,\n What the heck is Calvin Ball by the way?", 
   {}, 
   197399, 
   null, 
   1139457480.0
  ], 
  [
   197432, 
   null, 
   "Obvious Child", 
   "\"Right is right, even if nobody does it. Wrong is wrong even if everybody is wrong about it.\" G.K. Chesterton\nYes, but we are understanding 'right' in this case as the course which causes least damage to vulnerable teens. As the psychological upset involved is rather lesser than getting HIV, other STDs or teenage pregnancy, it seems contraception is the 'right' way. Especially as the Virgin Pledges in certain American states seem to have had zero effect on teenage sex, and only succeeded in higher STD and pregnancy rates due to poor education\n \n \nWe must continue to put forth the message of abstinence. All most kids need is someone to talk to them about it...a mentor that steps in and tells kids that it is okay to be abstinent often takes away the pressures of having sex. It is much better than the everybody is doing it, it's natural approach.\nSuch a mentor would be acceptable to all. But if the teenager decides to do it anyway (perhaps they actually WANT to?), then it's best to have another line of defence.", 
   {}, 
   196641, 
   null, 
   1139486400.0
  ], 
  [
   197889, 
   null, 
   "Adept", 
   "We must continue to put forth the message of abstinence. All most kids need is someone to talk to them about it...a mentor that steps in and tells kids that it is okay to be abstinent often takes away the pressures of having sex.\n\n \n You gotta be kidding me...\n \n Kids like having sex. It's fun. They are going to do it absolutely regardless of how many times someone says they shouldn't. It's one of, if not the most powerful human urges.\n \n Refusing to teach contraceptive methods to teens because it runs counter to the 'abstinence is better' line is only going to result in increased teen pregnancy, and increased rates of sexually transmitted diseases.", 
   {}, 
   196641, 
   null, 
   1139748420.0
  ], 
  [
   197897, 
   null, 
   "simone", 
   "That's absolutely right, Adept, and that's why people like me should be standing right over these dadblasted youngsters, brolly in hand, ready to bash 'em if they get out of line.\n \n \"You there! Stop fondling that child's. . . .\"", 
   {}, 
   197889, 
   null, 
   1139763540.0
  ], 
  [
   197898, 
   null, 
   "simone", 
   "The only problem is, my shift watching over the priesthood is so long I don't have time to watch the kiddypoos.", 
   {}, 
   197897, 
   null, 
   1139763660.0
  ], 
  [
   197962, 
   null, 
   "Master_Shake", 
   "Master Shake,\n \n Sorry for the delay, I've been focused on the religion forum lately.\n\n No worries. That was probably a bit jerkish of me anyway emoticon_xangel . Some people just cut and run sometimes ya know. Besides, now it's been three days for me :-)\n \nI agree with you that the best chance for abstinence to be effective is if it's established in the home. But I don't believe it can't be established outside of the home. I know that there are A LOT of VERY EFFECTIVE abstinence speakers out there that make profound impressions on the youth in schools or other public venues. All some of these teenagers need is for someone to intervene in their life...someone to tell them it is okay, safe, cool, and good to be abstinent...someone to give them an alternative. They want to do the right thing they just don't know what the right thing is or they are pressured too much to do the wrong thing.\n\n I agree. Teenagers do need someone in their life to tell them that it's okay, safe, cool, and good to be abstinent. And you're right, if they don't get it in the home, someone else needs to say it for the kids that will be reached this way. The problem is, I just don't think all that many kids are going to be reached that way. Therefore there needs to be additional education. I also haven't seen any evidence supporting the effectiveness of abstinence only education.\n \n\"But the fact of the matter is, teenagers have sex\" with adults, \"at least let them do it with condoms.\" Does this work?\n\n Again, I don't agree with the connection you have made between safe sex education and statutory rape laws\n \nWe put barriers in place with the laws that are meant to discourage the behavior, not encourage it. Safe sex does not put barriers, it encourages the behavior.\n\n I do not believes it encourages the behavior. It simply gives a way to better protect those who are going to choose to have sex anyway.\n \nAnd remember, safe sex does nothing to prevent the emotional and pyschological consequences that may accompany bad sexual relationships or premature ones.\n\n Of course it doesn't. I would never claim it does. We need to do the best we can to enable people to make good decisions. Sex education shouldn't be just about abstinence and birth control. It should also be about decision-making processes. But, in the end, this is also primarily a public and private health issue that is being addressed. Some kids are simply not going to be reached by the abstinence method. This is where education about birth control steps in. So that the people that are not going to choose to remain abstinent can do the best they can to protect themselves and the rest of us.\n \nYou may be right but I'm not absolutely certain. I am sure\n there are groups that tell kids to explore their sexuality too early because it is \"normal\" and \"natural.\" They also disseminate a self-fulfilling prophecy by saying I know they're going to do it so it might as well be safe.\n\n What \"groups\" exactly? I've never heard a health teacher tell their students to go explore their sexuality. Besides, if that were to happen, that's a problem with the teacher, not the idea of sex ed as whole.\n \nPeace.\n\n Ditto", 
   {}, 
   197898, 
   null, 
   1139791920.0
  ], 
  [
   197963, 
   null, 
   "Master_Shake", 
   "Shake,\n What the heck is Calvin Ball by the way?\n\n You need to read some Calvin and Hobbes my friend! You will better understand it if you do, but basically it's a game that Calvin and Hobbes play where the rules are made up and constantly changing as you play. :)", 
   {}, 
   197400, 
   null, 
   1139792040.0
  ], 
  [
   198076, 
   null, 
   "Wez", 
   "No inconsistency? Let's seek to mitigate the effects of sex by giving minors the tools for sex?? What about the emotional, self-esteem, and relationship effects outside of the physical realm? Do the tools of mitigation help this? \n \n What if we had the same approach with statutory rape? Give the minors condoms and contraception to mitigate the effects. What if we reformulated your response in this way, \"Virtually nobody wants minors to be having sex with adults, but most people acknowledge that some will be, and seek to mitigate the effects.\"\n\n Essentially, teens will have sex with or without condoms. There's nothing you can do about that. Absolutely nothing. This now gives us two options: Should teens be given condoms when they have sex or shouldn't they?\n \n People will rape minors. There's nothing you can do about this either. \n \n I don't see the connection really. No-one's condoning statutory rape, or even underage sex, but given that both do and will happen you might as well limit the damaging effects.\n \n -Wez", 
   {}, 
   196644, 
   null, 
   1139842020.0
  ], 
  [
   199994, 
   null, 
   "maximus", 
   "Were teen pregnancy rates any different in the 1950s than they are today? Any one have any stats on that?", 
   {}, 
   198076, 
   null, 
   1140767760.0
  ], 
  [
   199995, 
   null, 
   "Master_Shake", 
   "Were teen pregnancy rates any different in the 1950s than they are today? Any one have any stats on that?\n\n That is a good question. I haven't done any looking yet, but I imagine you'd run into a couple problems. One, I imagine that it'd be hard to find stats in the first place. Two, any stats found are probably not going to be too reliable. This is because, as abortion was illegal at the time, we have no way of knowing how many teen pregnancies ended this way. Also, in many instances at the time when a teenager had a child, the pregnancy and birth were kept as secret as possible by the family and the child was immeadiately put up for adoption without consideration of the mother's wishes.\n In other words, it would be nice to know and have a comparison, but I doubt this is really possible.", 
   {}, 
   199994, 
   null, 
   1140768300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Safe sex and statutory rape", 
  "url": "http://www.4forums.com/political/abortion-debates/7362-safe-sex-statutory-rape.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7362, 
  "discussion_files": [
   [
    "15226.html", 
    "http://www.4forums.com/political/abortion-debates/7362-safe-sex-statutory-rape-print.html"
   ], 
   [
    "15227.html", 
    "http://www.4forums.com/political/abortion-debates/7362-safe-sex-statutory-rape-2-print.html"
   ]
  ], 
  "identifier": 7362
 }
]