[
 [
  [
   193186, 
   null, 
   "John Milosevic", 
   "I don't mean to be stupid as usual. But, I got some questions and predictions I would like to share and discuss with all. (I especially want the wise and helpful Daewoo to answer too. He is very wise and has changed my views a little I want your input Daewoo)\n Anyway. Is America falling? I think it is pretty close because:\n 1. People question the governments decision. The government could ban abortion and millions of ###### off Americans would probably protest and hate this government more.\n 2. Other countries, (Argentina, Bolivia, most Arab countries, some European countries, and some others I might be forgetting. Maybe some African countries. Anyway, they question us. \n Some things I hear in Russia whenever I go to visit and I have political discussions with my friend Boris, he says, \"America is an evil empire that wants to rule the world.\" I have heard other things like, \"Countries shouldn't be demanded to be ruled by imperialism or something\" I have heard many other anti-American things.\n Is America falling down? We have spend trillions if not billions on the Iraq war, and the war on Terrorism. Two countries cost that much. Expensive! I belong to a couple other political forum websites, and I have heard that all the money we spent on the war on terrorism, is making America bankrupt. \n Are we going bankrupt?\n Now, we will probably spend more money on this war in the future. It is not over yet.\n Now, many countries in the world hate the thought of freedom, democracy, and so on. Many countries got this idea that we are invading Iraq and Afghanistan because we want to rule the world. Who doesn't. That is not why we invaded, but, many countries today if they could would invade a country and make it part of theirs. \n Now, a good example would be the old Soviet Union. Now, anyway. That is not why we invaded. We invaded countries to spread democracy. To bring peace. \n I have a saying that war sometimes is the only way to get peace.\n Our government unlike others, spends it's time going on trips to have talks with communists, and countries like Iran and North Korea to solve international concerns, and so on. Our government just wants peace and freedom in the world. We do not want a one man governed world. This will and would never happen. But, our government tries to solve the North Korean problems, the Iran problem, the other countries.\n Now, I think America could fall, but more than likely could not fall. See, I had this discussion earlier with a diffrent forum.\n \"The soviet Union was never supposed to fall, the third reich was never suposed to fall, Rome was never supposed to fall.\"\n Well, the Soviet Union and the third Reich were either communist governments, or a dictatorship. Neither of the two work. Rome fell because it attacked countries. America does not attack other countries for land, but Rome conquered the Etruscans, the Phenecians, and the Greeks for land. They also did not use money well, and their form of government did not work. They let dictators take over in time of need. We do not do this.\n They also had severe inflation, and in the final years, a lack of military and so on. Now, America on the other hand, spends it's time:\n -Solving international problems\n -Helping countries in need. (Pakistan)\n -Defending national and international security\n -Talking with leaders for alliances in war\n -Making discoveries to better the American health.\n But, America is striving in my eyes. We are a huge military nation. \n Our nation's economy is strong. Bush even said so. \n So my questions are:\n 1. Is America going bankrupt?\n 2. Will America fall in our life time or within a hundred years?\n Sometimes I wonder why citizens in diffrent countries think freedom and democracy is bad. They protest against it.\n We should have a serious discussion about this.\n -John", 
   {
    "post_info": {
     "post_title": "Is America Falling?"
    }
   }, 
   null, 
   null, 
   1137645120.0
  ], 
  [
   193213, 
   null, 
   "Jo Bennett", 
   "People questionning government decisions is a sign of healthy democracy, not imminent collapse. It is when the government is not questionned that you should start worrying.", 
   {}, 
   193186, 
   null, 
   1137669360.0
  ], 
  [
   193216, 
   null, 
   "Iuris", 
   "The USA is at the pinnacle of its power, but the foundations of the pinnacle are shaky, that's true. However, it may end in a fast fall or a more gradual descent, resulting in drastically different scenarios.\n \n Personally, I think the US will get a bit stronger first, expanding its influence. Next, it will lose its direct military dominance as it won't be able to afford its wars any more, and then continue in a more gradual decline as economic crisis sets in.", 
   {}, 
   193213, 
   null, 
   1137670560.0
  ], 
  [
   193225, 
   null, 
   "emclean", 
   "IMHO, the US has stumbled some after the cold war ended. it takes competition to keep a counrty sharp, and the people of the US do not see any one els \"on our level\" so we slack off a bit.", 
   {}, 
   193216, 
   null, 
   1137683340.0
  ], 
  [
   193268, 
   null, 
   "Mickey Shane", 
   "Rome had many problems from attacking other countries for land on a regular basis, but the true fall was from within. The homeless masses of beggars in the streets woke up one day and realized that they out numbered the 'haves' by more than two to one. \"Could I borrow a match, kind Sir\"?", 
   {}, 
   193225, 
   null, 
   1137702360.0
  ], 
  [
   193289, 
   null, 
   "Wez", 
   "Our government unlike others, spends it's time going on trips to have talks with communists, and countries like Iran and North Korea to solve international concerns, and so on. Our government just wants peace and freedom in the world.\n\n So do a lot of European governments, but you don't praise them.\n \n \nOur nation's economy is strong. Bush even said so. \n\n Yes, the man says a lot of things.\n \n I don't know when America will \"fall\", but it will eventually. A natural disaster, oil crisis, large-scale war etc. could all make America \"fall\" but all of these are somewhat hard to predict accurately.\n \n Otherwise I agree with Jo.:)\n \n -Wez", 
   {}, 
   193268, 
   null, 
   1137710880.0
  ], 
  [
   193384, 
   null, 
   "Iuris", 
   "Rome is a good comparison for the US, many paralells can be drawn between the two. I'd imagine the fall of USA would follow the same lines, too. And I'm not too happy about the idea of US warlords...", 
   {}, 
   193289, 
   null, 
   1137751380.0
  ], 
  [
   194837, 
   null, 
   "Inyx", 
   "This comparison between the US and the Roman Empire is really quite interesting. I was thinkig about it along the same lines myself not so long ago . But we can find the some other similarities, how US is behaving today, in much youger history - I am thinking Hitler's Germany analogy. Only not so radical, not yet anyway.", 
   {}, 
   193384, 
   null, 
   1138285620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is America Falling?", 
  "url": "http://www.4forums.com/political/politics-debates/7372-america-falling.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 7372, 
  "discussion_files": [
   [
    "12031.html", 
    "http://www.4forums.com/political/politics-debates/7372-america-falling-print.html"
   ]
  ], 
  "identifier": 7372
 }
]