[
 [
  [
   193288, 
   null, 
   "David2004", 
   "Israeli, Military Industrial Complex, Energy, Lobbies\n \n What is the difference between Hamas Party and Likud Party? Both are parties of the extremists that don't recognize the rights of the people on the other side. The Israeli and United States government are doing there best to see that the Hamas Party has a strong showing in January election. The Zionists and Likud Party do not recognize the Palestinian people's right to there own nation. They use the Torah turning God into a real state broker, who gives the Holy Land exclusively to the Jewish people. Only recently did the Israeli government recognize the Palestinian people where before they were only known as Arabs or Jordanians. \n \n American Jewish Temples, Jewish groups large and small with the support of Christians and Jewish people alike finance the Jewish extremist movement for the Greater State of Israel. \n \n http://www.zionism-israel.com/dic/Likud.htm\n \n http://www.rense.com/general69/col.htm\n \n http://msnbc.msn.com/id/7615249/site/newsweek/\n \n At the end of Prime Minister Sharon political career he moved away from the Likud Party's Platform realizing it be in the best interest of long-term security for the State of Israel. In 1998 the Jewish Holocaust victims won a 1.25 settlement against the Swiss banks.\n \n http://www.haaretz.com/hasen/spages/671550.html\n \n Today the Palestinian people are the victims of the Israeli governments policies and actions over the last 58+ years. The Israeli want to be the victim and victor, you can't have it both ways. The Israeli have become a regional nuclear military super power that has bombed all of her neighbors as well as Iraq. The Israeli government says it will bomb Iran Nuclear program. The American-Israeli government's Middle East Policies and actions are putting the people in the world of great danger. \n \n http://www.adl.org/special_reports/buchanan_own_words/buchanan_intro.asp\n \n Without American straightening out her problems at home there will be no end to the war we fight on Israel behalf as well as oil. According to the CIA the United States spends over 276 billion dollars on military expenditures with total in the world's military expenditures being just over 741 billions dollars. \n \n http://www.nationmaster.com/graph-T/mil_exp_dol_fig\n \n Only by getting the Washington's lobbies out of the pockets of the politicians. Will common sense become part of the decision making process in government. The Israeli, Military Industrial Complex, Energy, as well as many other lobbies have corrupted the American political system.", 
   {
    "post_info": {
     "post_title": "Israeli, Military Industrial Complex, Energy, Lobbies"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1137710880.0
  ], 
  [
   193365, 
   null, 
   "snakespit", 
   "I don't think it is just limited to oil and Israel. I certainly think they are part of it, but there are many other factors at play that brought us to and keep us in Iraq. \n If the war was simply for oil, wouldn't we be paying about $.50 per gallon for our gas? \n \n And if the war was to provide Israel with stability in the ME, we probably would have chosen Syria, Iran, and the Palestinian population as targets rather than Saddam and Iraq, as these are all bigger threats to Israel than Iraq was.", 
   {}, 
   193288, 
   null, 
   1137735480.0
  ], 
  [
   193826, 
   null, 
   "David2004", 
   "There are many Jewish and Islamic people in the Holy Land work together for the human rights of the Palestinian people. Many of the Jewish people who speak out on behalf of the Palestinian cause are label by other Jewish people as self-hating Jews. Most of the Jewish people living in side the West Bank in Jewish settlements are from Eastern Europe, United States, and the former Soviet Union block. Many are Orthodox Jewish extremists who are there on a religious calling. Taking passages from the Old Testament in the Bible claiming they have a God given right to the land. \n \n Many of these Jewish extremists see the Palestinians as Arabs because there never was a Palestine. They setup settlements on the hilltops in the West Bank cities like Hebron. Five hundred or so heavily armed Jewish settlers living in the City of Hebron with a Palestinian population of 130,00 people. Jewish only roads and open space has been created for the safety of the Jewish settlers that divide the City of Hebron. Palestinian people can't go from one side of the West Bank to the other side without going through Israel security checkpoints. \n \n Most of Israel's population are Jewish people that emigrated from other foreign countries. They moved to Israel to fulfill a life-long dream. Many of the Jewish people leaving behind lives of torture and persecution only to bring it onto other people today who happen to be Palestinians. Today Israel has become a Jewish militant state that possess many nuclear warheads. According to the CIA the State of Israel has the top military ranking for the most military dollars spent per person. \n \n http://www.nationmaster.com/graph-T/mil_exp_dol_fig_percap\n \n That Israel spends 9.1 billion dollars a year on military spending. \n http://www.cia.gov/cia/publications/factbook/rankorder/2067rank.html\n According to the CIA there were 276,000 Palestinian refugees that were removed from their home in northern Israel. (2004) \n \n http://www.cia.gov/cia/publications/factbook/geos/is.html#Military", 
   {
    "post_info": {
     "post_title": "Israel is a Jewish Militant State"
    }, 
    "unicode_changes_made": true
   }, 
   193288, 
   null, 
   1137917040.0
  ], 
  [
   193829, 
   null, 
   "Symbiote", 
   "To the extent Iraq was about oil it was more probably about Iraq's increasing ties to Europe and plans to sell its oil in Euros rather than $$$s, rather than direct control of oilfields.\n \n Remember the US's strategy is not to directly advance its own cause, improving its people, it is a strategy to stay on top. The US administration is more than willing to hurt Americans, so long as they believe they can hurt their competitors, such as the EU member states and China, more.", 
   {}, 
   193826, 
   null, 
   1137917820.0
  ], 
  [
   194173, 
   null, 
   "beervolcano", 
   "http://energybulletin.net/12125.html\n \n http://www.informationclearinghouse.info/article8354.htm\n \n \n It's all about oil, but not about taking cheap oil. \n It's about suppressing supply while keeping oil trading for dollars. \n It really doesn't have much to do with Israel, but they are a factor in dealing with Arabs.", 
   {}, 
   193829, 
   null, 
   1138045740.0
  ], 
  [
   194247, 
   null, 
   "David2004", 
   "The Jewish people are one of the smallest in numbers of people yet they are one of the most powerful groups of people in the world.\n http://www.jewishvirtuallibrary.org/jsource/Judaism/jewpop.html The Jewish people great wealth and power is well known worldwide. The Jewish people being so educated and affluent in the world making the Palestinian-Israeli Crisis more complex and harder to solve. With approximately 1/3 of the Jewish population in Israel and 1/3 in the United States and the other 1/3 of the Jewish people around the rest of the world. \n \n As Jesus Christ is to the Christians and Mohammad is to the Muslims, the Jewish State of Israel is to the Jewish people for they were a people with no nation. One can't question the religious beliefs and traditions of another without a conflict and or becoming ones enemy. Great wealth has been made by many Jewish families around the world with so much of their wealth going to Israel. The political spectrum of the Jewish community is very broad coving all side including Palestinian-Israel Crisis. Today many of the Pro Palestinian Jewish groups are far better organized and stronger than many of their Arab counterparts. \n \n The Holy Land the crown jewel of the worlds greatest empires. The Old City of Jerusalem the center of so many conflicts throughout history that were mostly created by outsiders. The United States, Great Britain and France are greatly responsible for the current conditions in the Middle East. Whether it is the bounders or leaders of Arab nations, the oil deals or the creation of the Jewish State of Israel the western nations through the United Nations imposed it upon the people of the Middle East. Today in the Middle East and Holy Land the level of tension and conflict is spiraling out of control because of amount of misinformation that leads to mistrust on both sides. \n \n The United State and the rest of the industrial world are in real trouble with their energy policies and current ways. Economies built on consumption with little regard for the environment and non-renewable natural resources. How one obtains wealth (tangible) and security (non-tangible) is not one of the same. As history has proven the most advanced military forces can't secure unfair and inhumane policies over another people for long without leading to war. The United States government military spending is about 1/3 of the whole world combined with the State of Israel spending almost nine billion dollars a year. The following two CIA charts show the problems the United States and the State of Israel has in trying to defend policies that are unfair and inhumane. \n \n http://www.nationmaster.com/graph-T/mil_exp_dol_fig\n \n http://www.nationmaster.com/graph-T/mil_exp_dol_fig_percap\n \n The amount of money the State of Israel and the United States spend every year on the military is immoral in its self.", 
   {
    "post_info": {
     "post_title": "The United States and Israel are in Real Trouble"
    }, 
    "unicode_changes_made": true
   }, 
   194173, 
   null, 
   1138066260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Israeli, Military Industrial Complex, Energy, Lobbies", 
  "url": "http://www.4forums.com/political/peace-middle-east/7375-israeli-military-industrial-complex-energy-lobbies.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 7375, 
  "discussion_files": [
   [
    "26955.html", 
    "http://www.4forums.com/political/peace-middle-east/7375-israeli-military-industrial-complex-energy-lobbies-print.html"
   ]
  ], 
  "identifier": 7375
 }
]