[
 [
  [
   193525, 
   null, 
   "David2004", 
   "The higher world oil prices have increased the flow of dollars into the wealthy Arab nation by the tens of billions of dollars. If the people of Palestine are going to have any chance of building a prosperous society they are going to need the financial help of other wealthy nations and people. This aid will be needed in two forms. Long-term financial investment and institutional grants are needed to rebuild the infrastructure of the Palestinian economy. Starting with the Gaza Strip makes the most sense given the condition of the situation on the ground. \n \n To wait for a final settlement in the Palestinian-Israeli Crisis before improving the living conditions of ordinary Palestinian families is leading to the same old cycle of violence. The Gaza Strip with 1.3 million Palestinians many of who are refugees in there own homeland with very little job opportunities. The wealthy Arab nations with the support of the international community of nations should focus on improving the living conditions of the people of the Gaza Strip. Then with improving conditions on the ground and continuing negotiations between the Palestinian-Israelis a final settlement can be reach. \n \n The crisis between the Palestinian-Israeli was an international creation. It will take an international effort to resolve it. Restitution must be made to the Palestinian society similar to the restitution made to the Jewish people. As the Nazis were the victimizers and the Jewish people were the victims the Palestinian people carried an unfair portion the compensation made to the Jewish people after World War II. Today the question is not whether Israel is going to exist but how is the State of Israel going to exist. The same can be said for the people of Palestine. With so mush disparity on one side and so much prosperity on the other side. Things have to be brought into balance before they will ever be right. The mission is to bring the standard of living of the Palestinian people closer to the Israeli standard of living. Then there will be peace and security among the people in the Holy Land.", 
   {
    "post_info": {
     "post_title": "Gaza Strip of Palestine"
    }
   }, 
   null, 
   null, 
   1137800940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gaza Strip of Palestine", 
  "url": "http://www.4forums.com/political/peace-middle-east/7383-gaza-strip-palestine.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 7383, 
  "discussion_files": [
   [
    "15304.html", 
    "http://www.4forums.com/political/peace-middle-east/7383-gaza-strip-palestine-print.html"
   ]
  ], 
  "identifier": 7383
 }
]