[
 [
  [
   193536, 
   null, 
   "Bassman", 
   "From www.homelandsecurityus.org:\n \n \n* 19 January, 2006\n \n Al Jazeera's english-language website bannered a breaking news report that it has recieved an audio tape from Osama bin Laden warning of an \"imminent attack\".\n \n \n Breaking News: Thursday, January 19, 2006\n \n Al Jazeera's english-language website bannered a breaking news report that it has recieved an audio tape from Osama bin Laden warning of an \"imminent attack\".\n \n According to the current American media reporting on this audio tape bin Laden is directly addressing the American people. Western media are giving translations of bin Laden's words as offering \"conditional truce\" to the American people if we withdraw our troops from Aghanistan. At the same time bin Laden reportedly goes on to say that new attacks are being prepared and \"you will see them\".\n \n Up to this point we do not believe bin Laden has ever offered the US any \"conditional truce\" as was the case with Europe. This is an indicator of the audio tape prossibly being a recent construct. Bin Laden's offer of a conditional truce to the west included no conditions for a truce in the portion released by Al-Jazeera:\n \n \"We do not mind offering you a long-term truce with fair conditions that we adhere to. We are a nation that God has forbidden to lie and cheat. So both sides can enjoy security and stability under this truce so we can build Iraq and Afghanistan, which have been destroyed in this war. There is no shame in this solution, which prevents the wasting of billions of dollars that have gone to those with influence and merchants of war in America.\"\n \n This bin Laden audio release appears to be a blatant attempt to divert attention from the ongoing nuclear crisis between the western allies and Iran. Based upon our analysis we believe Osama bin Laden has long found safe haven in the Islamic Republic of Iran along with his son, Saad, and other key Al Qaeda leadership.\n \n Should Osama bin Laden's threat of attacks upon the US homeland come to fruition, Iran should be pre-emptively placed on notice and held accountable that any such potential terrorist attacks will be considered de facto acts of war by the Islamic Republic of Iran upon the United States of America.\n \n * 19 January, 2006: Further Developments-\n \n The bin Laden audio tape has been authenticated. Furthermore, it has been dated to within the past 45 days. This has been the longest period without a video or audio taped message from Bin Laden. The last released message was more than one year ago.\n \n While Al-Jazeera has broadcast portions of this audiotape from Osama bin Laden, there are larger portions of the tape which have not been released at this time.\n \n As the audio tape is being translated, the Northeast Intelligence Network has received confirmation that several direct threats are made against locations and interests within the United States itself.\n \n This partial release of bin Laden's message holds a dire and direct relationship to the recent news reports and stories concerning suspect un-traceable cell-phone purchases.\n\n \n Which leads me to speculate that this nutjob has another attack planned.", 
   {
    "post_info": {
     "post_title": "He's joking, right??(nudge, nudge; wink, wink)"
    }
   }, 
   null, 
   null, 
   1137804540.0
  ], 
  [
   193541, 
   null, 
   "Diogenes99", 
   "Or maybe Osama is getting the same sort of heat the Left throws at Bush: \"Where's the progress? What's our exit strategy?\" And Osama replies, \"Patience, patience. We have big plans in the works\" (reminiscent of Hitler in 1943 and 1944).\n \n That said, the portions of the message that I've heard sound remarkably like a montage of Howard Dean, Ted Kennedy, John Kerry, Dick Durbin, Barbara Boxer, Harry Reid, Jack Murtha, Michael Moore...", 
   {}, 
   193536, 
   null, 
   1137806220.0
  ], 
  [
   193543, 
   null, 
   "Bassman", 
   "Well, latest word is that the alphabet soup is taking the threat seriously.", 
   {}, 
   193541, 
   null, 
   1137807300.0
  ], 
  [
   193544, 
   null, 
   "Big_Bear_Scot", 
   "\n Should Osama bin Laden's threat of attacks upon the US homeland come to fruition, Iran should be pre-emptively placed on notice and held accountable that any such potential terrorist attacks will be considered de facto acts of war by the Islamic Republic of Iran upon the United States of America.\n \n\n \n That is strange the last I read Bin Laden absolutely hates the regime in Iran, mainly becasue Iran is run by the Shia and Bin Laden is a Sunni. \n \n \nSome Wahhabis say that bin Laden is influenced by Qutbee ideology, and is in fact a \"Qutbee\". Osama bin Laden himself has never identified himself with a particular sect of Islam, but was raised in Wahabi Saudi Arabia, in a Wahabi family, but Wahabis claim he has been influenced by the writings of the Muslim Brotherhood and Sayyid Qutb. Bin Laden himself quotes Ibn Taymiya frequently, a medieval scholar to whom Wahabis often refer, and his theology is much closer to Wahabi theology, rather than the Muslim Brotherhood's. The Muslim Brotherhood does not takfir, or declare, Shia Muslims as apostates, unlike Wahabis and bin Laden.\n\n \n So Iran should be held accountable for actions of Bin Laden ? It seems like before(Iraq) people are trying to conjure up links between the real terrorist threat(AQ) and unrelated Nation.", 
   {}, 
   193543, 
   null, 
   1137808140.0
  ], 
  [
   193546, 
   null, 
   "Bassman", 
   "The idea is that Iran has been a harbinger for terrorists for at least 26 years, and therefore in the crosshairs of our Minuteman III ICBM's. I agree with Doug Hagmann on this one. Bin Laden is likey in Iran.", 
   {}, 
   193544, 
   null, 
   1137808500.0
  ], 
  [
   193551, 
   null, 
   "Big_Bear_Scot", 
   "The idea is that Iran has been a harbinger for terrorists for at least 26 years, and therefore in the crosshairs of our Minuteman III ICBM's. I agree with Doug Hagmann on this one. Bin Laden is likey in Iran.\n\n \n http://www.csmonitor.com/2001/1213/p1s1-wosc.html\n \n I have heard he is in Pakistan(the US Intelligence Service believe he is on the Afghan/Pakistan border), does that mean we should bomb them as well ? \n \n Whoops America has already done that.\n \n http://news.bbc.co.uk/1/hi/world/south_asia/4619422.stm\n \n It does seem like some people want to build case for an Invasion of Iran by saying they have links to Bin Laden. \n \n So the strategy is[*]Pick any Middle Eastern Country at random[*]Say Bin Laden is hiding there/or has links with[*]Invade[*]Find out there are no links\n This gets us no closer to getting Bin Laden. We are like a drunken brawler, sure we may land a few punches but most of them are totally wide of the mark.", 
   {}, 
   193546, 
   null, 
   1137809820.0
  ], 
  [
   193564, 
   null, 
   "snakespit", 
   "That is strange the last I read Bin Laden absolutely hates the regime in Iran, mainly becasue Iran is run by the Shia and Bin Laden is a Sunni. \n\n Quite true, that Bin Laden is not fond of the regime in Iran. However, Iran and Bin Laden share much of the same philosophy when it comes to the west and Israel. This does not however mean that Bin Laden is sitting in Tehran. Bombing Iran for an AQ attack would be a big mistake. \n \n \n \n \nSo Iran should be held accountable for actions of Bin Laden ? It seems like before(Iraq) people are trying to conjure up links between the real terrorist threat(AQ) and unrelated Nation.\n\n No. Iran should be held accountable for it's own actions, just as Bin Laden is responsible for his actions and that of his followers. Iran is a problem that is individual from Bin Laden. The international community needs to deal with the threat presented by Iran independent of what Bin Laden is doing.", 
   {}, 
   193544, 
   null, 
   1137816840.0
  ], 
  [
   193640, 
   null, 
   "Bassman", 
   "But the possibility of OBL in Iran cannot be discounted, either.", 
   {}, 
   193564, 
   null, 
   1137855060.0
  ], 
  [
   193642, 
   null, 
   "Big_Bear_Scot", 
   "But the possibility of OBL in Iran cannot be discounted, either.\n\n \n I suppose is it like pin the tail on the donkey ?\n \n Have a map of the middle east on the wall, blindfold the President and then ask him to place the pin on the map. Where he places the pin then that where Bin Laden is hiding, and that is where we attack.", 
   {}, 
   193640, 
   null, 
   1137855480.0
  ], 
  [
   193644, 
   null, 
   "Bassman", 
   "So what do you suggest we do? Wait for the next attack? It'll have to come to that and a retalitory strike. In case you conveniently forgot, it's not just OBL, but the nations that harbor and sponsor terrorists as well that's in our crosshairs.", 
   {}, 
   193642, 
   null, 
   1137855900.0
  ], 
  [
   193647, 
   null, 
   "Big_Bear_Scot", 
   "So what do you suggest we do? Wait for the next attack? It'll have to come to that and a retalitory strike. In case you conveniently forgot, it's not just OBL, but the nations that harbor and sponsor terrorists as well that's in our crosshairs.\n\n \n Attacking Iran is exactly the wrong thing to do because like Iraq(at the time) they have nothing to do with AQ. Go after AQ instead of this pointless refocus. \n \n If we invade Iran we are repeating the same mistakes as we done with Iraq, diverting resources away from the real enemy which is AQ. What is the well know saying ?\n \n Those who don't learn form the mistakes from the past are doomed to repeat them\n \n It usually applies to things in the distant past, but I did not think it would apply to something that only happened a couple of years ago.\n \n I have to agree that Iran might become a problem in the future with nuclear weapons but at the moment they are at least a decade away from getting a viable weapon. We have got time to deal with Iran at future date, the Iranian Government is not stupid if they even dared to launch a Nuclear weapon at the US or one of her allies they would be wiped of the map in seconds.", 
   {
    "unicode_changes_made": true
   }, 
   193644, 
   null, 
   1137856800.0
  ], 
  [
   193650, 
   null, 
   "Bassman", 
   "Well, your buddy, Bill Clinton had three opportunities for Bin Laden's head, but while he was *monica lewinsky* otherwise occupied, he either ignored or blatantly disregarded this. Now we have to clean up his mess.", 
   {}, 
   193647, 
   null, 
   1137857520.0
  ], 
  [
   193652, 
   null, 
   "Big_Bear_Scot", 
   "Well, your buddy, Bill Clinton had three opportunities for Bin Laden's head, but while he was *monica lewinsky* otherwise occupied, he either ignored or blatantly disregarded this. Now we have to clean up his mess.\n \n \n Since I am not American and never having met Clinton then I don't see how he could be my buddy. If you really want to blame past Presidents foe the current threat from AQ then I would look back at the Presidents who where in office during the Soviet invasion of Afghanistan.\n \n If you remember the US funded the Afghan Mujahdeen(Bin Laden was a leading member) against the Soviets so in fact the mess goes back a lot farther that Clinton - to Carter and Reagan, I think Reagan described them as freedom fighters.", 
   {}, 
   193650, 
   null, 
   1137858240.0
  ], 
  [
   193653, 
   null, 
   "Bassman", 
   "But if you recall, it was Clinton and his doctrine of appeasement and mollycoddling that allowed these whackjobs to stregnthen in the first place. Oh, and yes I'm aware of the Mujadeen and the beast they've become. But if you also recall, we've had to make ties with the Northern Alliance when we started our strike in Afghanistan. Sometimes you have to make deals with the devil.", 
   {}, 
   193652, 
   null, 
   1137858600.0
  ], 
  [
   193677, 
   null, 
   "daewoo", 
   "But if you recall, it was Clinton and his doctrine of appeasement and mollycoddling that allowed these whackjobs to stregnthen in the first place. Oh, and yes I'm aware of the Mujadeen and the beast they've become. But if you also recall, we've had to make ties with the Northern Alliance when we started our strike in Afghanistan. Sometimes you have to make deals with the devil.\n\n \n Unless you prefer to take a more moral approch to things, draw a line and defend it. Americans do nto have the cahones to fight their own battles anymore. They prefwer to turn a monster loose to do their fighting for them. This has 2 down sides. First, you create stronger monsters, and secodn, it igves your politicians the ability to run roughshod over the rest of the world without the American public having a clue what is going on (mostly due to laziness and apathy).\n \n Do you think that if our politicians had gotten up on stage one day and said \"we are going to send US troops to depose the democratically elected president of Chile and replace him with a ruthless dictator\" they would have gone for it? I seriously doubt it. BUT, if you support that ruthless dictator secretly, the US public never has to know until it is too late. Sure, the people of Chile might live under a reign of terror for 11 years, but that is unimportant to any group as selfish as Americans.\n \n Do you thik the American public would have supported the invasion of S America in the name of destroying elected socialist governments? Of course not. So you support things like Operation Condor, whihc cuts a bloody swath through the entire continent for years.\n \n In the end you just see Saddam syndrom over and over again. We put these devils in power and support them until they bite the hand that feeds them, then we declare them a grave threat and spend a fortune taking them back out of power.", 
   {}, 
   193653, 
   null, 
   1137866580.0
  ], 
  [
   193680, 
   null, 
   "Symbiote", 
   "What a surprise, Bassman pre-emptively cheering on the invasion of Iran. Was it Jesus you worshipped or George W Bush, I keep forgetting.", 
   {}, 
   193677, 
   null, 
   1137867300.0
  ], 
  [
   193708, 
   null, 
   "Wez", 
   "The US attacking Iran because OSB might be there is equivalent to a drunk attacking a wall because there might be a leprechaun on the other side with a barrel of beer.\n \n \nBut the possibility of OBL in Iran cannot be discounted, either.\n\n Nor can the possibility that he's in the USA or Israel.\n \n \nBut if you recall, it was Clinton and his doctrine of appeasement and mollycoddling that allowed these whackjobs to stregnthen in the first place.\n\n On the basis that Reagan and Carter were Presidents before Clinton, it seems unlikely that the phrase \"in the first place\" could be used in conjunction with Clinton's actions. Blame Clinton if you want, but claiming he's responsible for OSB's strength \"in the first place\" is historically incorrect.\n \n -Wez", 
   {}, 
   193677, 
   null, 
   1137871200.0
  ], 
  [
   193748, 
   null, 
   "Gator", 
   "The US attacking Iran because OSB might be there is equivalent to a drunk attacking a wall because there might be a leprechaun on the other side with a barrel of beer.\nJust curious, did someone prominent actually say that Iran is harboring bin Laden and that an attack on Iran would be warranted if bin Laden strikes again... or is the thread just sporting some fun, perhaps imagining Pat Robertson's next remark?\n \n As for the analogy of a drunk attacking a wall, I'm not sure it's entirely apt, since no matter how misguided, the drunk is unlikely to hurt any but himself.", 
   {}, 
   193708, 
   null, 
   1137879960.0
  ], 
  [
   193794, 
   null, 
   "snakespit", 
   "But the possibility of OBL in Iran cannot be discounted, either.\n\n The possibility that he is in your bedroom has not been ruled out either, so what should we do? Would you rather we:\n \n A. Blow up your house, just in case he might be in there. \n -or-\n B. Check the house, search for conclusive evidence of his location, and then kill him with the minimal amount of collateral damage possible. \n \n It's funny how the \"Bin Laden in Iran\" crowd did not start up until the Iran nuke debate started. Up until then it was widely believed and accepted that he was at the Pak/Afg border.", 
   {}, 
   193640, 
   null, 
   1137901800.0
  ], 
  [
   193798, 
   null, 
   "JPSartre12", 
   "Personally, I'm not a fan of speculative bombing. If OBL is in Iran, then terrorism surely makes for strange bedfellows.emoticon_wow", 
   {}, 
   193794, 
   null, 
   1137907800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  He's joking, right??(nudge, nudge; wink, wink)", 
  "url": "http://www.4forums.com/political/peace-middle-east/7386-hes-joking-right-nudge-nudge-wink-wink.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 7386, 
  "discussion_files": [
   [
    "2661.html", 
    "http://www.4forums.com/political/peace-middle-east/7386-hes-joking-right-nudge-nudge-wink-wink-print.html"
   ], 
   [
    "2662.html", 
    "http://www.4forums.com/political/peace-middle-east/7386-hes-joking-right-nudge-nudge-wink-wink-2-print.html"
   ]
  ], 
  "identifier": 7386
 }
]