[
 [
  [
   10578, 
   null, 
   "gilligan8503", 
   "i enjoy the philosophy section, and i see that it isn't kicking off that well, so, who is your favorite philosopher?\n \n mine is definately nietzsche.\n \n i especially like what he says about music.", 
   {
    "post_info": {
     "post_title": "favorite philosopher?"
    }
   }, 
   null, 
   null, 
   1056314520.0
  ], 
  [
   10581, 
   null, 
   "SilentPoet", 
   "Gilligan,\n \n \n Plato\n \n I generally agree with most of what I have heard that he has said.\n \n Always Stay Open Minded", 
   {}, 
   10578, 
   null, 
   1056317700.0
  ], 
  [
   10583, 
   null, 
   "DirtyNumbAngel", 
   "\"Plato\n \n I generally agree with most of what I have heard that he has said.\"\n \n \n Do you agree that this world is a shaddow of another world and in that world there are Forms of which the things in this world resemble? Do you also believe that 'philosophers' should run the state?", 
   {}, 
   10578, 
   null, 
   1056318180.0
  ], 
  [
   10584, 
   null, 
   "SilentPoet", 
   "\"Do you agree that this world is a shaddow of another world and in that world there are Forms of which the things in this world resemble?\"\n \n \n - Not quite sure....\n \n 'Do you also believe that 'philosophers' should run the state?\"\n \n - I see nothing wrong with a seperate philosophy commitee in place of Congress to handle issues such as abortion, capital punishment etc... Things such as these should not be left up to the Supreme Court which follows the constitution to no end.\n \n Thanks for reading this\n \n Always Stay Open Minded", 
   {}, 
   10578, 
   null, 
   1056318480.0
  ], 
  [
   10647, 
   null, 
   "dsadevil", 
   "John Stuart Mill (after his stint with Utilitarianism, I like his stuff in \"On Liberty\")", 
   {}, 
   10578, 
   null, 
   1056340380.0
  ], 
  [
   11228, 
   null, 
   "Evolution", 
   "Do you agree that this world is a shaddow of another world and in that world there are Forms of which the things in this world resemble? Do you also believe that 'philosophers' should run the state?\n \n \n \n if you believe the universe to be infinate. then by the laws of chance it would only be a matter of distance (10 with 24 zeros behind it/miles) till you found another exact earth. there would infact be an infante number of earths. if the universe was infinate. however, i don't believe the matter in the universe to be infinate (ie galaxies ect..) but possibly large enough to warant another planet similar to earth. \n \n i'd rather philosophers than greed driven (the reason we are in iraq, oil and fear) christian (the reason for faith based intiative as well as a desire to erode church and state principles) poloticians (what could be worse) ie bush.", 
   {}, 
   10647, 
   null, 
   1056872100.0
  ], 
  [
   12964, 
   null, 
   "dreamweaver", 
   "As far as philosophy goes, Socrates. The center of wester philosophy. A bit typical I know, but hey!", 
   {}, 
   11228, 
   null, 
   1060447200.0
  ], 
  [
   13111, 
   null, 
   "gilligan8503", 
   "socrates was fat. :)", 
   {}, 
   12964, 
   null, 
   1060625100.0
  ], 
  [
   13124, 
   null, 
   "dreamweaver", 
   "socrates was fat. :)\n\n Yep, he pretty much wore the same cloack all year round, barefoot in all weathers, and he was considered extremely ugly . Little is known about him, even his real name is in question.", 
   {}, 
   13111, 
   null, 
   1060638960.0
  ], 
  [
   13784, 
   null, 
   "prometheus", 
   "It was Socrates who made the ultimate sacrifice in the defence of wisdom and free speach. In his martadam I believe his spirit shall stay imortal in the hearts of men. In grasping this realisation I am sure that is why he was so quick to down the hemlock. Who would miss an opertunity like that. The weak of mind?\n \n Should thinkers run the state. What a inspireing change that would make. A great example of this being the case is Markus Aurelius. (off Gladiator Fame). This man put the empire on its feet and gave it another good 400 years.\n \n Nietzsche on the other hand may have went mad in office. We would be left with another Nero. In the persute of ultimate truth it is important to have a solid spiritual base. Poor old Nietzsche was unbalanced. This is obvious in his works. It was very dificult to control his mind he let it power of like a rocket. The emotional imbalance is obvious in his works. It is also true to say he was before his time. He fortold of the coming colapse within european christian culture and was single handedly trying to stop it.\n \n It is obvious Nietzsche could have become a hitler and it is remarcable the simularities in there emotional states. They were simply expressed in different mediums. I in no way wish to asert that Hitler was any where as smart as Nietzsche however I do believe hitler was smarter than generaly given credit for. Thoes intulectuals that to not ground their minds with a solid spiritual base somtimes end up insane. I believe this is what happened to Hitler. Thier are striking simularities between Nietzches Man and the actions of the Furer. I do not believe Nietzsche advocated National Socialism I believe he was saying that it would occur if the underliying hypocrasy with in Theoligy was not adressed. He did go mad anything is possible when your out there. Some people come back not many.", 
   {
    "post_info": {
     "post_title": "Yes Socrates"
    }
   }, 
   13124, 
   null, 
   1062075780.0
  ], 
  [
   14654, 
   null, 
   "epaphras_faith", 
   "Dallas Willard:\n \n Fabulous philospher and professor at USC. Has a website www.dwillard.org \n \n His logic is impeccable and He has a fascination for truth.", 
   {
    "post_info": {
     "post_title": "favorite philosopher"
    }
   }, 
   13784, 
   null, 
   1063061400.0
  ], 
  [
   15747, 
   null, 
   "letgo", 
   "epicurus or whatever, long time ago, dont even remember what he said just that i liked it alot.", 
   {}, 
   14654, 
   null, 
   1063811640.0
  ], 
  [
   15765, 
   null, 
   "montalban", 
   "epicurus or whatever, long time ago, dont even remember what he said just that i liked it alot.\n\n \n If you like him, do you like Lucretius? I've got the Penguin Classics version of \"On the Nature of the Universe\"\n \n \n Personally I don't know the whole works of any one philisopher.\n \n I like Michel de Montaigne \"The Essays: A Selection\" (Penguin Classics)\n and\n Soren Kierkagaard \"The Sickness Unto Death\" (also Penguin)\n \n Fr. Seraphim Rose \"Orthodoxy and the Religion of the Future\"\n \"Genesis, Creation and Early Man: The Orthodox Christian Vision\"\n and \"God's Revelation to the Human Heart\"\n \n If you're talking about the philosophy of political theory, then Gerrard Winstanley and a wee bit of John Locke.", 
   {}, 
   15747, 
   null, 
   1063815060.0
  ], 
  [
   15808, 
   null, 
   "letgo", 
   "yeh i need to start reading agian. \"a long time ago\" haha it was only 4 years ago but i cant remember any of it cuz i was smoking so much pot, oh well no more of that im gonna become intelegent again.\n \n i got the XXXXXX guide to astronomy yesterday, not philosophy but maybe it will get those nurons firing again.\n \n i remember liking philosophy alot though all the stuff that i read, aristotle, kahil gibran, plato. to bad theres no jobs in the philosophy market.", 
   {}, 
   15765, 
   null, 
   1063848720.0
  ], 
  [
   15818, 
   null, 
   "montalban", 
   "yeh i need to start reading agian. \"a long time ago\" haha it was only 4 years ago but i cant remember any of it cuz i was smoking so much pot, oh well no more of that im gonna become intelegent again.\n \n i got the XXXXXX guide to astronomy yesterday, not philosophy but maybe it will get those nurons firing again.\n \n i remember liking philosophy alot though all the stuff that i read, aristotle, kahil gibran, plato. to bad theres no jobs in the philosophy market.\n\n \n There was a time when there was no distinction between astronomy and astrology.\n \n Some astronomers are very philosophical, believing in extra-terrestrial life... or at least are interested in searching for it.", 
   {}, 
   15808, 
   null, 
   1063851420.0
  ], 
  [
   15842, 
   null, 
   "letgo", 
   "yes yes, thats how i see it. science, philosophy, and spirtuality all are tools that can help people find elightenment and truth, or alteast find there path.", 
   {}, 
   15818, 
   null, 
   1063859460.0
  ], 
  [
   16065, 
   null, 
   "gilligan8503", 
   "marijuana effects your short-term memory, not your long-time...", 
   {}, 
   15842, 
   null, 
   1063947900.0
  ], 
  [
   16158, 
   null, 
   "prometheus", 
   "Yes Mull is not the problem coke is. There is a coke head in the white house we are all in big trouble.", 
   {}, 
   15842, 
   null, 
   1063985040.0
  ], 
  [
   19287, 
   null, 
   "Parcum", 
   "Thomas Aquinas.", 
   {}, 
   16158, 
   null, 
   1066168920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  favorite philosopher?", 
  "url": "http://www.4forums.com/political/philosophy-debates/739-favorite-philosopher.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 739, 
  "discussion_files": [
   [
    "17455.html", 
    "http://www.4forums.com/political/philosophy-debates/739-favorite-philosopher-print.html"
   ], 
   [
    "17456.html", 
    "http://www.4forums.com/political/philosophy-debates/739-favorite-philosopher-2-print.html"
   ]
  ], 
  "identifier": 739
 }
]