[
 [
  [
   193659, 
   null, 
   "maximus", 
   "Norma McCorvey, the original Roe of Roe v. Wade has changed her views on abortion. Do you think she had a legitimate cause for challenging the original court ruling on abortion from 1973?\n \n http://www.cnn.com/2004/LAW/09/14/roe.v.wade/\n \n Here is the website of her pro-life ministry:\n \n http://www.crossingoverministry.org/", 
   {
    "post_info": {
     "post_title": "Do you know Norma McCorvey? (aka Roe)"
    }
   }, 
   null, 
   null, 
   1137861780.0
  ], 
  [
   193669, 
   null, 
   "simone", 
   "I know people who know her and they think she's a lesbian nutcase. I have to give her credit for recognizing her sexual orientation if she still thinks she's a lesbian.", 
   {}, 
   193659, 
   null, 
   1137864240.0
  ], 
  [
   193687, 
   null, 
   "Steeeeve", 
   "The Doe in Doe vs Bolten is also pro-life", 
   {}, 
   193669, 
   null, 
   1137868800.0
  ], 
  [
   193710, 
   null, 
   "simone", 
   "I already said she was a nutcase.", 
   {}, 
   193687, 
   null, 
   1137871320.0
  ], 
  [
   193714, 
   null, 
   "Steeeeve", 
   "I already said she was a nutcase.\n\n \n lol you know the Doe in Doe vs Bolten too... :-/ right.", 
   {}, 
   193710, 
   null, 
   1137871680.0
  ], 
  [
   193722, 
   null, 
   "Linus", 
   "\"Do you think she had a legitimate cause for challenging the original court ruling on abortion from 1973?\"\n\n \n I don't think her case alone is legitimate. \n The grounds for criminalizing abortion were just as shaky as the constitutional grounds used to legalize it. It may only be a matter of time until something reinforces it. \n Yeah, good ol' Norma hasn't been the same since she converted. She is kind of whacky. Perhaps she is really a double agent trying to infiltrate and discredit the pro-life movement by saying some real off the wall stuff. \n \n \"I personally think it's the pro-abortion people who are doing this to collect on their insurance, so they can go out and build bigger and better killing centers.\" - Norma McCorvey (aka Jane Roe) tells CNN that violent acts like clinic bombings are the work of the Pro-Choice forces\n \n Not to mention she has raided an abortion clinic...but only to collect dead fetuses. She didn't go for the register.", 
   {
    "unicode_changes_made": true
   }, 
   193714, 
   null, 
   1137873360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Do you know Norma McCorvey? (aka Roe)", 
  "url": "http://www.4forums.com/political/abortion-debates/7391-do-you-know-norma-mccorvey-aka-roe.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7391, 
  "discussion_files": [
   [
    "3140.html", 
    "http://www.4forums.com/political/abortion-debates/7391-do-you-know-norma-mccorvey-aka-roe-print.html"
   ]
  ], 
  "identifier": 7391
 }
]