[
 [
  [
   193673, 
   null, 
   "VTCruiser", 
   "Abortion, It's an unspeakable tragedy.47 million babies have died since January 22, 1973 as a result of an unconstitutional supreme court decision. That number is higher than the population of some countries. That would be wiping out a number of whole states. The world was appropriately horrified and shocked when we lost about a couple thousand people on Sept. 11.... What we're talking about here is that sort of loss multiplied dramatically but in this case we are killing our own people.\n \n Most of the people reading this right now have consciences that are seared by growing up in societies where death is the default rather than letting someone live. Its just a normal thing to them. This to me only reveals their lack of knowledge on the subject, but also their lack of moving past preconceived ideas that they get from their own intellect and actually asking the question, \"do i really care about human life or do i just only care about my own?\"\n \n Our society needs to put in context the enormous amount of loss that we've suffered -- the enormous amount of intelligence, the enormous amount of creativity, the enormous amount of productivity. This is genocide and we have to stop it.", 
   {
    "post_info": {
     "post_title": "do you really care about human life?"
    }
   }, 
   null, 
   null, 
   1137864900.0
  ], 
  [
   193678, 
   null, 
   "Symbiote", 
   "I don't particularly care about the life lost through abortions no. I have far more empathy with a friends' pet dog than with any or all of those lives, if you could call them back put together.\n \n You don't care either, about the lives that is. The difference is I don't pretend to.\n \n If (real) genocide were going on around me, say someone was rounding up the chinese people in my street and shooting them, and my response was to post on internet forums some half-arsed message about how \"we have to stop it\" which is plainly convincing to no one, would you conclude I \"cared\" about these people, or would you conclude I merely enjoyed the moral highground the topic offered me?\n \n In the face of their support for an immoral and unjust police state at home and the killing of innocents abroad, the sacrifice of the lives of young men and women in a pointless war, today's self-titled \"conservative\" can only pretend they possess morality by foaming at the mouth about sex outside a heterosexual marriage.\n \n If you really care about millions of people being murdered, why have you done nothing about it? Because you don't.", 
   {}, 
   193673, 
   null, 
   1137866820.0
  ], 
  [
   193683, 
   null, 
   "Cone", 
   "If you really care about millions of people being murdered, why have you done nothing about it? Because you don't.\n\n I am astounded by your omniscience.", 
   {}, 
   193678, 
   null, 
   1137868260.0
  ], 
  [
   193685, 
   null, 
   "Symbiote", 
   "Are you hitting on me?", 
   {}, 
   193683, 
   null, 
   1137868560.0
  ], 
  [
   193706, 
   null, 
   "Wez", 
   "Symbiote, that was awesome.emoticon_xhoho \n \n (And no, I'm not hitting you on... darling;)).\n \n -Wez", 
   {}, 
   193685, 
   null, 
   1137870600.0
  ], 
  [
   193720, 
   null, 
   "Linus", 
   "47,000,000 aborted fetuses that generally had no previous emotions, desires nor even a functional body consisting of clinical signs of life isn't a huge loss. However it is a huge loss to a minority within this country; pro-lifers. \n For someone who is pandering to the question \"do you really care about human life?\" why is it that you decided to start calculating abortions performed only after January 22, 1973? What happened on that date? Did human embryos magically morph to the status of a person once abortion was legalized on the grounds of the constitution? Because abortion, whether it was legal or not, was extremely popular even before the ruling. \n Isn't an abortion an abortion no matter where, when and how it is being performed? Apparently not.", 
   {
    "unicode_changes_made": true
   }, 
   193706, 
   null, 
   1137872700.0
  ], 
  [
   193723, 
   null, 
   "Steeeeve", 
   "47,000,000 aborted fetuses that generally had no previous emotions, desires nor even a functional body consisting of clinical signs of life isn't a huge loss. However it is a huge loss to a minority within this country; pro-lifers. \n For someone who is pandering to the question \"do you really care about human life?\" why is it that you decided to start calculating abortions performed only after January 22, 1973? What happened on that date? Did human embryos magically morph to the status of a person once abortion was legalized on the grounds of the constitution? Because abortion, whether it was legal or not, was extremely popular even before the ruling. \n Isn't an abortion an abortion no matter where, when and how it is being performed? Apparently not.\n\n \n It is kinda hard to know the numbers prior to that but he was giving a date in reference to the supreme court case. To infer anything beyond that is not needed. For example if you say \"10,000 people died in a car accident last year\" you don't downplaying the ones that died in 2004\n \n \n47,000,000 aborted fetuses that generally had no previous emotions, desires nor even a functional body consisting of clinical signs of life isn't a huge loss\n Why does this matter? Is this your own personal view of what a person is?", 
   {
    "unicode_changes_made": true
   }, 
   193720, 
   null, 
   1137873540.0
  ], 
  [
   193757, 
   null, 
   "Cone", 
   "Are you hitting on me?\n\n What a lame question. No, I was merely taken aback by your uncanny ability to tell others that they don't care about this issue even though you don't know anything about them. In light of that, I surmised that the only way you could make the statement you did was if you possessed omniscience. Frankly I am happy to have conversed with someone so wise as yourself, even if it is over a forum. It's not everyday that one has the privelage of interacting with an omniscient being as you have demonstrated yourself to be here.\n \n I hope that clears up my original post, and if it doesn't, I'll try again.", 
   {}, 
   193685, 
   null, 
   1137881940.0
  ], 
  [
   193762, 
   null, 
   "Linus", 
   " \"It is kinda hard to know the numbers prior to that...\"\n\n \n That isn't an acceptable excuse...numbers that tally legal abortions aren't even accurate either. \n \n \n \n\n \"...but he was giving a date in reference to the supreme court case. To infer anything beyond that is not needed.\"\n\n \n It is unless you personally feel legal abortions only kill a human being. This is what the poster implies; only fetuses killed by legal abortion matter, never criminal ones. So why did the poster only provide the number aborted since Roe v Wade? Shouldn't we incorporate all abortions? \n \n \n \n\n \"For example if you say \"10,000 people died in a car accident last year\" you don't downplaying the ones that died in 2004\"\n\n \n But you know it is more then just that. The poster gave a specific date that is relevant to when abortion was legalized. It shows the poster is being selective and may hold prejudice to fetuses who aren't aborted by legal abortions. You see, it is the pro-life movement's selective outrages that makes me think they aren't serious about abortion as a whole. \n \n \n \n\n \"Why does this matter? Is this your own personal view of what a person is?\" \n\n \n No, this is more of an ethical stand point. A fetus is incapable of feeling outraged or offended by being aborted then why is it an outrage by others to begin with? The only party that stakes out a vital rule in condemning abortion is the fetus...and unfortunately for that minority the fetus is a neutral party. \n However clinical signs of life do define us as a living person. Not conception. So no living people is being aborted...at least in the majority of abortion cases.", 
   {
    "unicode_changes_made": true
   }, 
   193757, 
   null, 
   1137884940.0
  ], 
  [
   193772, 
   null, 
   "jitobear", 
   "What a lame question. No, I was merely taken aback by your uncanny ability to tell others that they don't care about this issue even though you don't know anything about them. In light of that, I surmised that the only way you could make the statement you did was if you possessed omniscience. Frankly I am happy to have conversed with someone so wise as yourself, even if it is over a forum. It's not everyday that one has the privelage of interacting with an omniscient being as you have demonstrated yourself to be here.\n \n I hope that clears up my original post, and if it doesn't, I'll try again.\n\n \n It wasn't any worse than the assumptions in the initial post. Personally I am sick of being told that not having the same opinion on a matter as people who are pro-life means I don't care.", 
   {}, 
   193757, 
   null, 
   1137894240.0
  ], 
  [
   193799, 
   null, 
   "VTCruiser", 
   "I don't particularly care about the life lost through abortions no. I have far more empathy with a friends' pet dog than with any or all of those lives, if you could call them back put together.\n\n \n Tell me this, why would i get arrested for killing a puppy in its mother's womb and not get arrested if i told my girlfriend to go get an abortion? How much more should their be a consequence for the killing of an innocent child who did nothing but want to live and breathe.\n \n \nYou don't care either, about the lives that is. The difference is I don't pretend to...\n\n \n Wow i should hire you as my spokesman. You seem to know everything about me.. At least i know that you dont care, and that was obvious with your first statement. You have no evidence to prove to me that i dont care.\n \n \nIf (real) genocide were going on around me, say someone was rounding up the chinese people in my street and shooting them, and my response was to post on internet forums some half-arsed message about how \"we have to stop it\" which is plainly convincing to no one, would you conclude I \"cared\" about these people, or would you conclude I merely enjoyed the moral highground the topic offered me?..\n\n \n Thats what every german wouldve said 10 years prior to them watching Jews be herded into trains to be exterminated. 10 years prior to abortion being legal, the youth of america were learning the truth about human life in the womb. 10 years after 1973, americas youth were learning that there the life is just a blob of tissue. Seems like an interesting degrading of morality to me. Even worse than that of hitler's regime rewriting their history books.\n \n \n In the face of their support for an immoral and unjust police state at home and the killing of innocents abroad, the sacrifice of the lives of young men and women in a pointless war, today's self-titled \"conservative\" can only pretend they possess morality by foaming at the mouth about sex outside a heterosexual marriage..\n\n \n a total of 2222 soldiers have died in iraq from 3 years of war. 4400 babies die a day because america has turned their mother's wombs into the bloodiest battle fields our nation has ever seen.\n \n \n \nIf you really care about millions of people being murdered, why have you done nothing about it? Because you don't.\n\n \n Well, i vote, that seems to be working enough seeing that 2 pro-life judges have been appointed within 1 year. interesting, im takin a cheesecake break..", 
   {}, 
   193678, 
   null, 
   1137907860.0
  ], 
  [
   193809, 
   null, 
   "Linus", 
   "\n \"Tell me this, why would i get arrested for killing a puppy in its mother's womb...\"\n\n \n No, you wouldn't. Breeders administer a drug called ALIZIN which induces an abortion in dogs. Perfectly legal, my PETA friend. \n While we are on the subject of animal rights I would like to point out millions of male chickens are forcibly crushed to death by induced post-hatch abortions! And I KNOW pro-lifers are eating omelets! Why can't pro-lifers respect life!?! UGH!\n \n \n \n\n \"...and not get arrested if i told my girlfriend to go get an abortion?\"\n\n \n You wouldn't even get arrested for that either. I mean you talk about forcing women into childbirth and no one has arrested you for that, have they? \n \n \n \n\n \"How much more should their be a consequence for the killing of an innocent child who did nothing but want to live and breathe.\"\n\n \n Do you receive a lot of e-mails, phone calls and letters from post-aborted fetuses telling you how they wanted to live? \n \n \n \n\n \"10 years prior to abortion being legal, the youth of america were learning the truth about human life in the womb. 10 years after 1973, americas youth were learning that there the life is just a blob of tissue. Seems like an interesting degrading of morality to me. Even worse than that of hitler's regime rewriting their history books.\" \n\n \n You are starting to get hysterical, kido. I have been through the public school system and no one suggested or taught me that a zygote is a \"blob of tissue.\" Come on, that is bogus...everyone knows a zygote is nothing more but an undistinguished cell that will some day form into hundreds of other cells in your body. Suggesting it is \"tissue\" is a gross intellectual error on all levels of science. \n \n \n\n \"a total of 2222 soldiers have died in iraq from 3 years of war. 4400 babies die a day \n\n \n 4400 \"babies\" that don't have any emotions or clinical signs of life...so what is the big deal? Doesn't sound like a big loss to me...however 2222 dead soldiers who had emotions, clinically alive and etc. seems like a terrible loss. Oh well, if it makes you feel any better over 16,000,000 precious unborn babies are destroyed by selfish women every year when they attempt to get pregnant. Where is the pro-life outrage over this!?! \n \n \n\n because america has turned their mother's wombs into the bloodiest battle fields our nation has ever seen.\n\n \n \n That is a little over the top. When was the last time you saw a M1A2 crawl up into a woman's vagina and blast a hot HE round into her uterus? Such active imaginations tonight!", 
   {
    "unicode_changes_made": true
   }, 
   193799, 
   null, 
   1137910440.0
  ], 
  [
   193820, 
   null, 
   "Symbiote", 
   "So in your mind VTCruiser, you are watching Jews being sent of to gas chambers, and the most you have done about it is post about it on an internet forum?\n \n This is a great deal of evidence you don't care.\n \n Now the people who blow up abortion centres, who force women to remain pregnant against their will, who provide support to poor women so they do not have to have abortions for financial reasons - I can believe they care. \n \n The sermonising morality police however, I absolutely don't.\n \n If you really care, why aren't you doing something about it? You vote? What a joke. If you had voted the opposite way would it have made any difference? Absolutely not. Your vote counts for nothing except making yourself feel good, just like your so-called opposition to abortions.", 
   {}, 
   193809, 
   null, 
   1137914820.0
  ], 
  [
   193821, 
   null, 
   "VTCruiser", 
   "No, you wouldn't. Breeders administer a drug called ALIZIN which induces an abortion in dogs. Perfectly legal, my PETA friend. \n While we are on the subject of animal rights I would like to point out millions of male chickens are forcibly crushed to death by induced post-hatch abortions! And I KNOW pro-lifers are eating omelets! Why can't pro-lifers respect life!?! UGH!\n\n \n In florida if you kill a dog you get arrested. Killing a dog even in its mother's womb is still killing a dog.... there you have it.\n \n \nYou wouldn't even get arrested for that either. I mean you talk about forcing women into childbirth and no one has arrested you for that, have they? \n\n \n Have you ever heard such madness?? Childbirth being forced... HA. Childbirth is natural. A squirrel doesnt force its mate to go through childbirth. It just happens because it's natural. It is unnatural to stop it in the midst of its process of being pregnant though. So which is truly forced??\n \n \n Do you receive a lot of e-mails, phone calls and letters from post-aborted fetuses telling you how they wanted to live? \n\n \n Boy i wish i was as smart as you. If i had your brain, i could take over the world. Its times like this that im glad even people like yourself werent aborted.\n \n \nYou are starting to get hysterical, kido. I have been through the public school system and no one suggested or taught me that a zygote is a \"blob of tissue.\" Come on, that is bogus...everyone knows a zygote is nothing more but an undistinguished cell that will some day form into hundreds of other cells in your body. Suggesting it is \"tissue\" is a gross intellectual error on all levels of science. \n\n \n This is where you are wrong kiddo. Sorry to say, but every abortion clinic in america's education to their patients is \"its only a blob of tissue\". Sad to say that we are teaching our kids that sex is okay to have because if you get pregnant you dont have to live with the consequence of your choice. There should be no choice to have an abortion because that choice was made when the person had sex. The baby shouldnt have to suffer the consequences of the parents.\n \n \n4400 \"babies\" that don't have any emotions or clinical signs of life...so what is the big deal? Doesn't sound like a big loss to me...however 2222 dead soldiers who had emotions, clinically alive and etc. seems like a terrible loss. Oh well, if it makes you feel any better over 16,000,000 precious unborn babies are destroyed by selfish women every year when they attempt to get pregnant. Where is the pro-life outrage over this!?! !\n\n \n Sorry to say but this comment had no weight to it.\n \n \nThat is a little over the top. When was the last time you saw a M1A2 crawl up into a woman's vagina and blast a hot HE round into her uterus? Such active imaginations tonight!\n\n \n Only a sick minded freak would think of that one... im not going to point any fingers at who im talkin about either. It's people like this that think abortion is ok.", 
   {
    "unicode_changes_made": true
   }, 
   193809, 
   null, 
   1137915480.0
  ], 
  [
   193823, 
   null, 
   "VTCruiser", 
   "So in your mind VTCruiser, you are watching Jews being sent of to gas chambers, and the most you have done about it is post about it on an internet forum?\n\n \n um, i have yet to see in my lifetime a jew be gassed in a gas chamber, so how could i be watching jews be sent off to gas chambers? i dont know what you were try to get at with this comment. I will say that i have visited the holocaust museum in D.C. and it was quite moving. Maybe you should go too.\n \n \nThis is a great deal of evidence you don't care.\n\n \n Wow, you sure know a lot about me. Im very impressed that you can look at your computer screen and be able to tell everything about me.\n \n \nNow the people who blow up abortion centres, who force women to remain pregnant against their will, who provide support to poor women so they do not have to have abortions for financial reasons - I can believe they care. .\n\n \n Im not going to assume this but i have to ask, do you think i have blown up abortion clinics??\n \n \nIf you really care, why aren't you doing something about it? You vote? What a joke. If you had voted the opposite way would it have made any difference? Absolutely not. Your vote counts for nothing except making yourself feel good, just like your so-called opposition to abortions.\n\n \n BAHAHAHA. I couldnt help but laugh outloud at how rediculously stupid this comment was. I dont even need to say anything more. ha.", 
   {}, 
   193820, 
   null, 
   1137916080.0
  ], 
  [
   193827, 
   null, 
   "Symbiote", 
   "Im not going to assume this but i have to ask, do you think i have blown up abortion clinics??\n\n \n No. If you had, I would believe you truly cared about the many abortions occurring every day. You would be wrong, but at least you would be sincere.\n \n If you really cared about abortions in the way you say you do, you would have done everything in your power to prevent them or decrease their numbers. \n \n You have done nothing substantial whatsoever to reduce the number of abortions occurring, you merely use the \"abortion\" topic to denigrate the morality of political opponents.", 
   {}, 
   193823, 
   null, 
   1137917100.0
  ], 
  [
   193831, 
   null, 
   "Linus", 
   "\n \"In florida if you kill a dog you get arrested.\" \n\n \n So they don't put dog asleep in Florida? Come on, it depends of the context of why someone is killed...not killing itself. Just like with people. \n \n \n \n\n \"Have you ever heard such madness?? Childbirth being forced... HA. Childbirth is natural.\" \n\n \n Coercion childbirth isn't natural but then again killing is natural too. So I guess I can't force anyone into death either...your logic, not mine. \n \n \n \n\n \"A squirrel doesnt force its mate to go through childbirth. It just happens because it's natural. It is unnatural to stop it in the midst of its process of being pregnant though. So which is truly forced??\"\n\n \n Stressed squirrels and other species of rodents eat their young too. So I guess what Yates did was \"natural\" under your logic. Just like it is natural that people die. You are crazy...one moment you are telling us not to kill fetuses and next you are suggesting infanticide is a-okay. Which is it? \n \n \n \n\n Boy i wish i was as smart as you. \n\n \n I tell myself that each day when I look into the mirror. So any ways, when are you going to address the question? \n \n \n \n\n This is where you are wrong kiddo. Sorry to say, but every abortion clinic in america's education to their patients is \"its only a blob of tissue\". \n\n \n What do you mean by \"every abortion clinic in America's education\"? Are you suggesting that abortion clinics run our fine institute of public education here in America? \n \n \n \n\n \"Sad to say that we are teaching our kids that sex is okay to have because if you get pregnant you dont have to live with the consequence of your choice. There should be no choice to have an abortion because that choice was made when the person had sex.\" \n\n \n Who is we? Is it the government? Parents? \n No one has ever taught me sex is okay because if I get someone pregnant they can have an abortion. That is the silliest thing I have ever heard and even you know it is so bogus you couldn't even prove it. Like you said, \"Sorry to say but this comment had no weight to it.\"\n Try again and proceed with your conspiracy theories. \n \n \n \n\n \"The baby shouldnt have to suffer the consequences of the parents.\"\n\n \n Is this your opinion or the fetus's? \n \n \n \n\n Sorry to say but this comment had no weight to it.\n\n \n That isn't a proper debunk, kido. \n \n \n \n\n \"Only a sick minded freak would think of that one... im not going to point any fingers at who im talkin about either. It's people like this that think abortion is ok.\"\n\n \n Sorry, but when I hear some guy suggesting we are at war with fetuses I can't help but laugh.", 
   {
    "unicode_changes_made": true
   }, 
   193823, 
   null, 
   1137917880.0
  ], 
  [
   193846, 
   null, 
   "Wez", 
   "VTCruiser: You know millions of poeple are being slaughtered, yet you've done nothing about it. Why not? Don't you care?\n \n -Wez", 
   {}, 
   193673, 
   null, 
   1137936600.0
  ], 
  [
   193862, 
   null, 
   "Easyrider", 
   "Would you consider abortion in the following four situations?\n \n There's a preacher and wife who are very, very, poor. They already have 14 kids. Now she finds out she's pregnant with 15th. They're living in tremendous poverty. Considering their poverty and the excessive world population, would you consider recommending she get an abortion?\n \n \n The father is sick with sniffles, the mother has TB. They have four children. The 1st is blind, 2nd has died, 3rd is deaf, 4th has TB. She finds she's pregnant again. Given the extreme situation, would you consider recommending abortion?\n \n A white man raped a 13 year old black girl and she got pregnant. If you were her parents, would you consider recommending abortion?\n \n A teenage girl is pregnant. She's not married. Her fiancé is not the father of the baby, and he's very upset. Would you consider recommending abortion?\n \n If you said yes...\n \n In the first case, you have just killed John Wesley. One of the great evangelists in the 19th century.\n \n In the second case, you have just killed Beethoven.\n \n In the third case, you have just killed Ethel Waters, the great black gospel singer.\n \n If you said yes to the fourth case, you have just declared the murder of Jesus Christ.", 
   {}, 
   193846, 
   null, 
   1137942780.0
  ], 
  [
   193863, 
   null, 
   "Easyrider", 
   "The liberals have shot themselves in the foot with their bloody abortion carnage.\n \n Over 44 million new taxpayers for their social programs, teachers, scientists, social workers, gay activists, etc., have been butchered in their mother's wombs.\n \n What supposed divine insight do these pro-abortionists think they have to where they can destroy what God in some way creates in a mother's womb (Psalm 139:13; Jeremiah 1:5, etc.)?", 
   {}, 
   193862, 
   null, 
   1137943080.0
  ], 
  [
   193881, 
   null, 
   "Wez", 
   "Would you consider abortion in the following four situations?\n \n There's a preacher and wife who are very, very, poor. They already have 14 kids. Now she finds out she's pregnant with 15th. They're living in tremendous poverty. Considering their poverty and the excessive world population, would you consider recommending she get an abortion?\n \n \n The father is sick with sniffles, the mother has TB. They have four children. The 1st is blind, 2nd has died, 3rd is deaf, 4th has TB. She finds she's pregnant again. Given the extreme situation, would you consider recommending abortion?\n \n A white man raped a 13 year old black girl and she got pregnant. If you were her parents, would you consider recommending abortion?\n \n A teenage girl is pregnant. She's not married. Her fianc&#233; is not the father of the baby, and he's very upset. Would you consider recommending abortion?\n \n If you said yes...\n \n In the first case, you have just killed John Wesley. One of the great evangelists in the 19th century.\n \n In the second case, you have just killed Beethoven.\n \n In the third case, you have just killed Ethel Waters, the great black gospel singer.\n \n If you said yes to the fourth case, you have just declared the murder of Jesus Christ.\n\n In any of those caes, if the girl wanted an abortion I'd have been for her having one.\n \n Had Saddam's mum had an abortion (or many), the world would have been a better place. The same goes for any other 'evil' dictator. It works both ways; abortion may have prevented another genocide (although I'm sure someone will now say 'but aboriton laws created a genocide').\n \n \nOver 44 million new taxpayers for their social programs, teachers, scientists, social workers, gay activists, etc., have been butchered in their mother's wombs.\n\n http://www.guttmacher.org/pubs/journals/2504499.html\n 'Liberal' countries have lower abortion rates. Presumably 'liberals' have fewer aboritons? [/url]. If we presume a son is more likely to be liberal if their parents are liberal, surely aboriton has increased the ratio of 'liberals' to 'non-liberals'?\n \n Either way, the trends suggest the more conservative the place, the more abortions occur.\n \n -Wez", 
   {}, 
   193862, 
   null, 
   1137947400.0
  ], 
  [
   193894, 
   null, 
   "Steeeeve", 
   "No, this is more of an ethical stand point. A fetus is incapable of feeling outraged or offended by being aborted then why is it an outrage by others to begin with? The only party that stakes out a vital rule in condemning abortion is the fetus...and unfortunately for that minority the fetus is a neutral party.\n However clinical signs of life do define us as a living person. Not conception. So no living people is being aborted...at least in the majority of abortion cases.\n\n I would first like to note that I haven't read the rest of the thread since you posted this...\n \n That being said, is this your own personal view point of why a fetus is not a human or person? If so, why do you think that viewpoint should be inflicted upon others...mainly the fetus. Secondly, you talk about clinical signs of life and claim that the unborn is not a living person (a fetus would be as it has signs those brain waves and heart beats to which I believe you are referring to). If the early unborn is not \"living\" then we either have dead or doesn't exist....or if you want to refer to \"life\" and \"death\" as human entities then your claim would leave that the unborn is dead, non-existent, or part of another such as a liver. The unborn is not dead though as something that is dead for 9 months doesn't come back to life normally. The unborn surely exists as we are talking about he/she. The unborn is not a liver or a heart as he/she has its own set of DNA and in fact does seperate from the mother after 9 months and lives...if you take your liver out after 9 months it will not live. \n \n In the end, how can you claim something is not a human when you can't establish what a human is. I obviously can't go around saying everyone from Canada is not a human and then claim that the people from Canada have no say in deciding this because they aren't human. It comes down to what is reasonable field of things we should call human. Since you can't pinpoint exactly when it happens it is probably best to go from the earliest point a human is growing another human to the point of death. I doubt you would find one person that thought it might be earlier than that (in other words 100% of people think that life and death begins somewhere between conception and death)....that seems like the most reasonable and fair approach.", 
   {}, 
   193881, 
   null, 
   1137951420.0
  ], 
  [
   193895, 
   null, 
   "Linus", 
   "The liberals have shot themselves in the foot with their bloody abortion carnage.\n Over 44 million new taxpayers for....\n\n \n The fertility rate never decreased after Roe v Wade. Again, there were as many women having children in 1972 as there were in 1973. Not a big difference how many taxpayers there are today.", 
   {}, 
   193863, 
   null, 
   1137951780.0
  ], 
  [
   193896, 
   null, 
   "Linus", 
   "Would you consider abortion in the following four situations?\n\n \n And if I did then so what? Hiter's Mom and Saddam's Mom both were given the option to abort their pregnancies by nurses and decided against it.\n So I guess this makes pro-lifers responsible for the holocaust and the slaughter of Kurds?", 
   {}, 
   193862, 
   null, 
   1137951900.0
  ], 
  [
   193926, 
   null, 
   "Steeeeve", 
   "The fertility rate never decreased after Roe v Wade. Again, there were as many women having children in 1972 as there were in 1973. Not a big difference how many taxpayers there are today.\n\n \n Not exactly true\n \n \nWhile the U.S. fertility rate has declined from 2.5 to 2.0 since 1970, out-of-wedlock births as a percentage of all births has more than tripled to 36 percent and two-parent families have declined from 87 to 70 percent of all families in 1999. Among non-Hispanic whites, the proportion of single-parent families has doubled to 21 percent, and among African-Americans this number has increased from 36 to 60 percent. Most single-parent families are headed by women.\n", 
   {}, 
   193895, 
   null, 
   1137955440.0
  ], 
  [
   193949, 
   null, 
   "Linus", 
   "Not exactly true\n \n While the U.S. fertility rate has declined from 2.5 to 2.0 since 1970, out-of-wedlock births as a percentage of all births has more than tripled to 36 percent and two-parent families have declined from 87 to 70 percent of all families in 1999. Among non-Hispanic whites, the proportion of single-parent families has doubled to 21 percent, and among African-Americans this number has increased from 36 to 60 percent. Most single-parent families are headed by women. \n\n \n Reflective would have been a better word over decrease but fertility rate between 1972 and 1973 are pretty much the same. The decrease between 1972 and 1973 isn't big. When the abortion rate jumped the decrease continued to stay static to what it was back in 1972. \n fertility rate/number of legal abortions performed after Roe v Wade\n \n 1970 - 2.5/\n 1971 - 2.3/\n 1972 - 2.05/\n 1973 - 2.0/600,000\n 1974 - 1.8/800,000\n 1975 - 1.7/850,000\n 1976 - 1.6/1,00,000\n \n Personally, there isn't a huge difference between the fertility rate in the 1930s and the 1970s but the Baby Boom kinda skews it and the changing roles of women within society that began in the 1960s.", 
   {}, 
   193926, 
   null, 
   1137961020.0
  ], 
  [
   194045, 
   null, 
   "AnneleizeWho?", 
   "Would you consider abortion in the following four situations?\n \n There's a preacher and wife who are very, very, poor. They already have 14 kids. Now she finds out she's pregnant with 15th. They're living in tremendous poverty. Considering their poverty and the excessive world population, would you consider recommending she get an abortion?\n \n \n The father is sick with sniffles, the mother has TB. They have four children. The 1st is blind, 2nd has died, 3rd is deaf, 4th has TB. She finds she's pregnant again. Given the extreme situation, would you consider recommending abortion?\n \n A white man raped a 13 year old black girl and she got pregnant. If you were her parents, would you consider recommending abortion?\n \n A teenage girl is pregnant. She's not married. Her fianc&#233; is not the father of the baby, and he's very upset. Would you consider recommending abortion?\n \n If you said yes...\n \n In the first case, you have just killed John Wesley. One of the great evangelists in the 19th century.\n \n In the second case, you have just killed Beethoven.\n \n In the third case, you have just killed Ethel Waters, the great black gospel singer.\n \n If you said yes to the fourth case, you have just declared the murder of Jesus Christ.\n\n \n \n \n \n Looking back I was 16 pregnant and scared. Today I'm very soon to be a grandmother. Rachel is not a rocket scientist but she works hard at saving newborn lives in a neonatal care unit . . . My crystal ball did not tell me that would be so today. I remember wondering what our lives would be like if I even lived to be eighteen. Me, I'm not a great scholar, a presidential candidate, or a great righter even. I'm just a mom of to beautiful girls with a grand baby on the way. \n \n Rachel's daddy and I were both XXXXXX, God knows it. So do some of you. It is only how He see me that I will concern myself with. All said and done, He worked it for our good. It is horrible to even think what I could have missed out on if I had listened to the council of those who peer into their so called crystal balls and presumptuously espouse we have the right to take another's life. \n \n God is good all the time and all the time God is good. Even to the worst of sinners who will humbly submit to His Grace. It would be foolish to question that He will work for the good of those who love Him in all things even when we surely fall short of being a great black gospel singer or a rocket scientist even.\n \n \n Happy Day, Pete!\n \n :)", 
   {}, 
   193862, 
   null, 
   1137979500.0
  ], 
  [
   194061, 
   null, 
   "Steeeeve", 
   "Reflective would have been a better word over decrease but fertility rate between 1972 and 1973 are pretty much the same. The decrease between 1972 and 1973 isn't big. When the abortion rate jumped the decrease continued to stay static to what it was back in 1972. \n fertility rate/number of legal abortions performed after Roe v Wade\n \n 1970 - 2.5/\n 1971 - 2.3/\n 1972 - 2.05/\n 1973 - 2.0/600,000\n 1974 - 1.8/800,000\n 1975 - 1.7/850,000\n 1976 - 1.6/1,00,000\n \n Personally, there isn't a huge difference between the fertility rate in the 1930s and the 1970s but the Baby Boom kinda skews it and the changing roles of women within society that began in the 1960s.\n\n Development of medication too. It still goes down with an increase in abortion. Not to mention that abortion WAS legal in many states prior to 1973.", 
   {}, 
   193949, 
   null, 
   1137985020.0
  ], 
  [
   194092, 
   null, 
   "Iuris", 
   "I wonder how many people care about the principle and how many actually care for all those people.\n \n You see, it's easy to condemn the \"killing of innocents\", especially in the rhetoric. However, actually caring for all those people is quite another thing. Caring about them means thinking about programmes to help poor families. it means thinking about low cost schooling. It means thinking about counteracting the employers' monopoly and eliminating the \"reserve unemployed pool\". This is what caring for all those people is.\n \n And if we were to extend this a bit, we get to thinking about aid to Africa and other third world countries, where overpopulation is a serious issue. It means thinking of all those \"illegal aliens\" that will do ANYTHING to get to the \"promised land\".\n \n Seen from this point, I think people don't really care about all those dead. Not when the alternative explanation is much more likely. The explanation that involves shifting burdens from the strong to the weak. The explanation that involves the society-strenghtening effect of irrational beliefs.", 
   {}, 
   194061, 
   null, 
   1138009980.0
  ], 
  [
   194101, 
   null, 
   "OccamsRazor", 
   "Development of medication too. It still goes down with an increase in abortion. Not to mention that abortion WAS legal in many states prior to 1973.\n\n \n Actually Steeeeve, your assertion is baseless unless you can illusrate that the decline in fertility you blame on the legalisation of abortion is actually that. Quoting a decline in fertility figures from 1972 and saying it is a consequence of Rode vs. Wade is meaningless because we do not know if there was already a trend of declining fertility in the preceeding x years prior to the legalisation of abortion in the US.\n \n So perhaps you might be right, but you need to provide some data for fertility rates before Roe vs. Wade to show it. 50 years would be a good starting point, back to around 1925.", 
   {}, 
   194061, 
   null, 
   1138025280.0
  ], 
  [
   194238, 
   null, 
   "earthd320", 
   "I'm new to the forums and I can be both liberal and conservative depending on the issue (pro death penalty, but pro choice for example).\n \n Basically there's really only one thing I can pick at pro-life people, because they have some good arguments definitely. And in all abortion debates I participate in, I refuse to debate when a baby is alive or if the baby has rights or any of that stuff that's ridicously open to intrepretation based on the individual. The one thing that bothers me however is pro life advocate's innate sense of self-righteousness. If you're pro life, you believe that people getting abortions are obviously murdering babies. That belief can be reasonably justified I suppose, but the fact of the matter is, it's not you that's getting an abortion. So let a girl (and perhaps with support from her boyfriend) go get an abortion and soil her/their hands with \"murder\" and let them be damned to hell or whatever. \n Pro life people appear to be afraid either that someone they aren't being \"good\" and letting babies be killed or they are somehow better than everyone else and have the right to interject and \"save\" the \"lives\" of babies. On a personal level, go slap happy advising your friends not to get an abortion because you think it's bad. That's ok, why? Because you care about your friends and your friends' unborn kids. But the second you start wanting amendments/laws dictating for the entire nation, you are now essentially just looking down at complete strangers and playing Jesus or some other savior, in an effort to make yourself feel better that you did something \"good\" and \"right.\" And you know what, perhaps you guys are right, and abortions are awful in the eyes of God or some other code of ethics, but I would rather kill a kid before she/he is anywhere close to consciousness than let them suffer a life of poverty, abuse and general despair (this is assuming obviously poor, unchangeable conditions, which isn't always the case for everyone pondering an abortion, I realize that), even if it means I hurt my own reputation/karma, because I just don't want my kid to suffer like that.\n As to the argument about killing potential future talented people, that's a rather illogically cynical view of humankind. Perhaps the abortion that my friend just got ended the life of a modern day Beethoven, but that's not to say there is absolutely no chance of a modern day Beethoven being born by someone else, somewhere else. That's like saying since that one baby who hasn't even been born yet, much less decided on a career path, was, is and will be the only one ever in all of eternity who could be a modern day Beethoven. It doesn't bother her because it wouldn't make sense to be bothered. That's like getting a glance at some person once at a party, then going home and crying because you missed out on the love of your life. Even if an all seeing entity knows that person is the one, you as a person do not since you never even talked to them and got to know them.", 
   {}, 
   194101, 
   null, 
   1138064520.0
  ], 
  [
   194244, 
   null, 
   "earthd320", 
   "Oh and to answer the topic question, yes I do really care about human life. I'd be heart broken if my friends, co-workers, classmates, siblings, my parents, etc. (basically all the people I know) died. I wouldn't be care however if the \"life\" of the \"baby\" of some girl getting an abortion in Oklahoma died (I live in CT by the way). And I refuse to pretend that I do in an effort to appear caring (even though I easily could since this is just an online text message devoid of seeing my facial expression or tone when I say things). Also, if you consider this attitude selfish, it doesn't matter to me because this system of caring about the people you know and that's it actually works to maintain a healthy society because everyone has people they want to look out for. It's not like your friend who I don't know needs me to care about her potential abortion or not, it's you who needs to advise her (if you so choose to advise her at all). And I use those quotation marks not in a mocking fashion, but rather to indicate that those could be debated over what counts as alive, but are beyond the scope of my post here.", 
   {}, 
   194238, 
   null, 
   1138065660.0
  ], 
  [
   194267, 
   null, 
   "Steeeeve", 
   "Actually Steeeeve, your assertion is baseless unless you can illusrate that the decline in fertility you blame on the legalisation of abortion is actually that. Quoting a decline in fertility figures from 1972 and saying it is a consequence of Rode vs. Wade is meaningless because we do not know if there was already a trend of declining fertility in the preceeding x years prior to the legalisation of abortion in the US.\n \n So perhaps you might be right, but you need to provide some data for fertility rates before Roe vs. Wade to show it. 50 years would be a good starting point, back to around 1925.\n\n \n You make a baseless claim about what I meant. I never suggested that abortion laws were the reason for the decline. I was just refuting Linus's claim that it didn't decline. I also wanted to note that from the data he provided there was a decrease in fertility as abortion increased...is there a link? I don't know. I doubt abortion is the sole cause for any problem or fix...like everything, it is complicated.\n \n Since abortion has been around long before Roe vs Wade I would say it is hard to know if abortion plays any rule..but here is a chart.\n \n http://www.prb.org/pdf/USFertilityTrends2.pdf", 
   {}, 
   194101, 
   null, 
   1138072200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  do you really care about human life?", 
  "url": "http://www.4forums.com/political/abortion-debates/7394-do-you-really-care-about-human-life.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7394, 
  "discussion_files": [
   [
    "14365.html", 
    "http://www.4forums.com/political/abortion-debates/7394-do-you-really-care-about-human-life-print.html"
   ], 
   [
    "14366.html", 
    "http://www.4forums.com/political/abortion-debates/7394-do-you-really-care-about-human-life-3-print.html"
   ], 
   [
    "14367.html", 
    "http://www.4forums.com/political/abortion-debates/7394-do-you-really-care-about-human-life-2-print.html"
   ]
  ], 
  "identifier": 7394
 }
]