[
 [
  [
   194339, 
   null, 
   "Phunting", 
   "So, a Tory victory in Canada. What are people's reactions? Especially Canadians themselves. Personally, whilst I had no love for Martin I still agree with the Liberal policies slightly more than the Tory ones and would have preferred a Liberal victory.", 
   {
    "post_info": {
     "post_title": "Conservative Victory"
    }
   }, 
   null, 
   null, 
   1138115100.0
  ], 
  [
   194413, 
   null, 
   "Steeeeve", 
   "I saw them on CSPAN last night....I think it is kind of neat to see them win after 12 years...can anyone explain to me how Canadas government works though? I could probably look it up but I'd rather have someone from the country tell me...mainly how the prime minster comes to power...is it like the British government?", 
   {}, 
   194339, 
   null, 
   1138133160.0
  ], 
  [
   194426, 
   null, 
   "sanguinekane", 
   "And I would like to know, are the Conservatives of Canada conservative? Do they resemble he Republicans in the US? Or is this another case of \"conservative\" meaning something else in another country?", 
   {}, 
   194413, 
   null, 
   1138135620.0
  ], 
  [
   194599, 
   null, 
   "Phunting", 
   "mainly how the prime minster comes to power...is it like the British government?\nWell I'm not Canadian, but yes the Canadian system is essentially the same as the British one.\n \n \n \nAnd I would like to know, are the Conservatives of Canada conservative? Do they resemble he Republicans in the US? Or is this another case of \"conservative\" meaning something else in another country?\nNobody is like the Republicans! The Canadian Conservatives are like most other conservative parties, they are on the (centre) right of the political spectrum, and have broadly conservative policies. The society in general is much further to the right as a starting point in the US, hence the Republicans are much further right than a Conservative like myself would ever vote.", 
   {}, 
   194413, 
   null, 
   1138189980.0
  ], 
  [
   194604, 
   null, 
   "Matthew S", 
   "They won a minority government 124 seats to the liberals 103 seats. http://365gay.com/Newscon06/01/012406canada.htm. 365gay is a Candian site. Many of the Tories elected are moderates and not conservative. I am not a Candian citizen, only in my heart am I Canadian, so I can not speak to what Canadian citizens were thinking.", 
   {}, 
   194599, 
   null, 
   1138193100.0
  ], 
  [
   194685, 
   null, 
   "Waxy", 
   "I saw them on CSPAN last night....I think it is kind of neat to see them win after 12 years...can anyone explain to me how Canadas government works though? I could probably look it up but I'd rather have someone from the country tell me...mainly how the prime minster comes to power...is it like the British government?\n\n \n Everything you ever wanted to know and more -\n \n http://www.parl.gc.ca/information/library/PRBpubs/bp437-e.htm\n \n The really simple answer - There's 308 electoral ridings, the leader of the party that wins the most ridings becomes the Prime Minister.\n \n Waxy", 
   {}, 
   194413, 
   null, 
   1138217460.0
  ], 
  [
   194687, 
   null, 
   "Waxy", 
   "And I would like to know, are the Conservatives of Canada conservative? Do they resemble he Republicans in the US? Or is this another case of \"conservative\" meaning something else in another country?\n\n \n The Conservative Party of Canada would likely be labelled \"liberal\" by most Republicans.\n \n They are right of center, but not nearly to the degree that the Republicans are, especially socially (and regarding religion).\n \n The do share conservative ideologies - smaller gov't, lower taxes, greater personal freedom/responsibility, pro-business, increased military spending, etc... \n \n Waxy", 
   {}, 
   194426, 
   null, 
   1138217640.0
  ], 
  [
   194958, 
   null, 
   "jyoshu", 
   "Nobody is like the Republicans!\n\n \n Except maybe the Democrats. emoticon_xangel At least when it comes to not being center.", 
   {}, 
   194599, 
   null, 
   1138317600.0
  ], 
  [
   195030, 
   null, 
   "Jo Bennett", 
   "Except maybe the Democrats. emoticon_xangel At least when it comes to not being center.\n\n \n Indeed, they're both on the far right...", 
   {}, 
   194958, 
   null, 
   1138360680.0
  ], 
  [
   195204, 
   null, 
   "JakeCJB", 
   "I don't think the Conservatives will be able to do much that is ideologically conservative, or too far right, in the Canadian sense. They have won a slim minority government. There are four parties in Canada's parliament. The Conservatives have slightly more seats than any one party, but they do not have the majority of seats in the entire Parliament. The Conservatives have to win votes from the other three parties, which are generally to the left of it, ideologically, to pass any new legislation.", 
   {}, 
   195030, 
   null, 
   1138435440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Conservative Victory", 
  "url": "http://www.4forums.com/political/government-debates/7420-conservative-victory.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 7420, 
  "discussion_files": [
   [
    "26070.html", 
    "http://www.4forums.com/political/government-debates/7420-conservative-victory-print.html"
   ]
  ], 
  "identifier": 7420
 }
]