[
 [
  [
   194735, 
   null, 
   "jyoshu", 
   "http://www.cnn.com/2006/US/01/25/army.study.ap/index.html\n \"Stretched by frequent troop rotations to Iraq and Afghanistan, the Army has become a \"thin green line\" that could snap unless relief comes soon, according to a study for the Pentagon.\n \n Andrew Krepinevich, a retired Army officer who wrote the report under a Pentagon contract, concluded that the Army cannot sustain the pace of troop deployments to Iraq long enough to break the back of the insurgency.\"The military is getting awfully stretched. We need to get this Iraq mess over with soon.", 
   {
    "post_info": {
     "post_title": "Army stretched to breaking point, report says"
    }
   }, 
   null, 
   null, 
   1138229280.0
  ], 
  [
   194738, 
   null, 
   "jyoshu", 
   "http://news.yahoo.com/s/ap/20060125/ap_on_go_ca_st_pe/rumsfeld_7\n \n \"Secretary of Defense Donald Rumsfeld on Wednesday disputed reports suggesting that the U.S. military is stretched thin and close to a snapping point from operations in Iraq and Afghanistan, asserting \"the force is not broken.\"Rumsfeld is being overly optimistic, or trying to put on a face. The amount of deployable troops IS getting thin, but that doesn't mean it's to the breaking point.", 
   {
    "post_info": {
     "post_title": "Rumsfeld's Response"
    }
   }, 
   194735, 
   null, 
   1138229580.0
  ], 
  [
   194749, 
   null, 
   "Wez", 
   "*cough* Vietnam *cough* \n \n -Wez", 
   {}, 
   194738, 
   null, 
   1138231920.0
  ], 
  [
   194753, 
   null, 
   "Maineiac", 
   "I read something about that yesterday. It just shows what poor planing Bush had going into this mess. It seems they didn't take into account that young men and women wouldn't jump at a chance to enlist, just to be shipped off to actually fight it a war. Recruiting numbers are down.\n \n Even the \"back door draft\" they pulled on deployed troops didn't help the situation. I believe this is an indication the we need to at least pull some of our troops out.\n \n Bush still doesn't have an exit plan.", 
   {}, 
   194749, 
   null, 
   1138232580.0
  ], 
  [
   194760, 
   null, 
   "Bassman", 
   "How about the fact that Bill Clinton decimated the military to a point where we would wind up being stretched thin.", 
   {}, 
   194753, 
   null, 
   1138234920.0
  ], 
  [
   194761, 
   null, 
   "Truthsayer", 
   "This ain't on nobody BUT Bush.\n \n Russia or China might be thinking that this might be a good time to capitolize on the situation. Heck, just about anybody might want to take advantage of us at this stage. We don't have a whole lotta friends left out there. I hope they don't 'cause if they do, we're screwed and tattoo'd. But then again, we always have the \"ultimate deterrent\" I suppose. (But so do theyemoticon_cry )", 
   {}, 
   194760, 
   null, 
   1138235640.0
  ], 
  [
   194765, 
   null, 
   "Big_Bear_Scot", 
   "How about the fact that Bill Clinton decimated the military to a point where we would wind up being stretched thin.\n\n \n When did Clinton leave Office ?", 
   {}, 
   194760, 
   null, 
   1138236780.0
  ], 
  [
   194768, 
   null, 
   "jyoshu", 
   "I read something about that yesterday. It just shows what poor planing Bush had going into this mess. It seems they didn't take into account that young men and women wouldn't jump at a chance to enlist, just to be shipped off to actually fight it a war. Recruiting numbers are down.\n \n Even the \"back door draft\" they pulled on deployed troops didn't help the situation. I believe this is an indication the we need to at least pull some of our troops out.\n\n \n If there was poor planning on his part, it was that he didn't take into account a concerted effort by the left to make the war a political attack issue. Who'd have thought they would even go so far as to weaken national security? The reason the military is in decline is because of the anti-war movement and the media which has dominated news services and television with propaganda, unbalanced reporting about the war, and distraction from U.S. goals. The anti-war movement has been successful in large part in reducing our troop numbers. Too bad they threw caution to the wind when it comes to the fact that the military helps ensure national security. Every propaganda commercial and/or unbalanced news story that comes out which discourages people from military service undermines the possibility of success in Iraq. Not to mention the effect on the morale of currently enlisted servicepeople. Bush probably never accounted for the reality that the U.S. would be facing TWO enemies--an insurgency AND an enemy at home.", 
   {}, 
   194753, 
   null, 
   1138237260.0
  ], 
  [
   194771, 
   null, 
   "Mucusaur", 
   "How about the fact that Bill Clinton decimated the military to a point where we would wind up being stretched thin.\n\n \n How about that \"Fact\"?", 
   {}, 
   194760, 
   null, 
   1138237800.0
  ], 
  [
   194781, 
   null, 
   "daewoo", 
   "If there was poor planning on his part, it was that he didn't take into account a concerted effort by the left to make the war a political attack issue. Who'd have thought they would even go so far as to weaken national security? The reason the military is in decline is because of the anti-war movement and the media which has dominated news services and television with propaganda, unbalanced reporting about the war, and distraction from U.S. goals. The anti-war movement has been successful in large part in reducing our troop numbers. Too bad they threw caution to the wind when it comes to the fact that the military helps ensure national security. Every propaganda commercial and/or unbalanced news story that comes out which discourages people from military service undermines the possibility of success in Iraq. Not to mention the effect on the morale of currently enlisted servicepeople. Bush probably never accounted for the reality that the U.S. would be facing TWO enemies--an insurgency AND an enemy at home.\n\n \n You really do live in a fantasy world, don't you? People are not enlisting because they do not want to be shipped off to the desert to be shot. It is as simple as that. Military recruitment has ALWAYS gone down during times of active hostility. To most who join the military (or reserves) it is a better job than they could get in the civilian sector, or a free ride to college. The odds of actually being shipped off to be shot at are generally pretty low. When we are actively engaged in a conflict, raising those odds, people are not so keen, and our quality of recruit drops through the floor (because folks going into college are usually not willing to be shot at just to get some financial aid.\n \n Blaming this on the left is rediculous and completely ignores historical precedent.", 
   {}, 
   194768, 
   null, 
   1138240740.0
  ], 
  [
   194783, 
   null, 
   "georged", 
   "If there was poor planning on his part, it was that he didn't take into account a concerted effort by the left to make the war a political attack issue. Who'd have thought they would even go so far as to weaken national security? The reason the military is in decline is because of the anti-war movement and the media which has dominated news services and television with propaganda, unbalanced reporting about the war, and distraction from U.S. goals. The anti-war movement has been successful in large part in reducing our troop numbers. Too bad they threw caution to the wind when it comes to the fact that the military helps ensure national security. Every propaganda commercial and/or unbalanced news story that comes out which discourages people from military service undermines the possibility of success in Iraq. Not to mention the effect on the morale of currently enlisted servicepeople. Bush probably never accounted for the reality that the U.S. would be facing TWO enemies--an insurgency AND an enemy at home.\n\n \n You're essentially agreeing with most polls and the media, that administration has made such a mess in Iraq that their stated goals and leadership are held in disfavor by the US public and potential cannon fodder all the way down to a congressional level. Looking at the results of our domestic and foreign policy, I don't see where this administration planned for anything other than attempting to financially drain our treasure. Incidently, 'accounted for' is an after the fact expression, about all we get from current administration.\n \n How your perception of a majority of the US being against this quagmire war can be blamed on 'the left' is beyond my comprehension. You'll need a '50s bomb shelter you can hide in if you're depending on current administration policies to 'protect' you.", 
   {}, 
   194768, 
   null, 
   1138242180.0
  ], 
  [
   194786, 
   null, 
   "Maineiac", 
   "By all accounts I looked at , the military decline started with Bush 1, then Clinton took it a bit further by deeper cuts in military spending to help with balancing the budget.\n \n The military force that was sent to Afganistan is the same military force left by Clinton. I don't recall any shortfalls in that war, other than they missed their objective, Bin Laden.\n \n The problem started with the Iraq war. The first I recognized there was a problem was when my son, who was deployed to Iraq, ended up doing a 16 month tour which was only supposed to be 12. That was about the same time we were hearing that troop levels weren't enough to deal with all the problems with the insurgents. It what was refered to as the \"backdoor draft\"\n \n Bush rushed to war in Iraq without being prepared . There were a lot of shortages early on in the conflict. My son,who went over a year after it started , didn't have body armor when he landed in Bagdad. He was there about 2 months before he recieved any. You might have heard about family members sending body armor over themselves.\n \n We sent a lot of care packages over ourselves that were just basic needs.\n Toilet paper, hand sanitizers ,soap, mostly personal items. In a desert environment, these items are very important.\n \n Our transport vehicles didn't have adaquate armor to protect the troops. Often times they were retrofitted in the field ,but supplys of the armor were sometimes unavailable. That was roughly 16 months into the war.", 
   {}, 
   194771, 
   null, 
   1138242420.0
  ], 
  [
   194797, 
   null, 
   "daewoo", 
   "By all accounts I looked at , the military decline started with Bush 1, then Clinton took it a bit further by deeper cuts in military spending to help with balancing the budget.\n \n The military force that was sent to Afganistan is the same military force left by Clinton. I don't recall any shortfalls in that war, other than they missed their objective, Bin Laden.\n\n \n \n The goal was to pare military spending back to a reasonable level. The projection of force equations, remnants of the cold war, were and are outdated. If a country is holing a large enough military that they can invade and occupy a third party nation without increasing troop strength, their military is too big. Invasion is easy, occupation is a bitch. The bush babies seem to have forgotten this.\n \n After desert storm and the assessment of our performance there, it became clear that the special forces troops were 9x more effective than regular troops AND they died less often (death rate was less than 1/3 that of regular troops). A new paradigm started to emerge regarding our troop strengths and the optimum usage of those men. Under Bush 1 they started paring back regular military units and replacing them with SF units. The new paradigm was essentially that the primary role of regular combat troops should be to resupply and support SF personnel. \n \n During the Clinton Administration SF troops proved themselves once again. In Bosnia, over 90% of dead bad guys and destroyed targets that were accountable to ground forces were dead and destroyed because of SF troops, despite the fact that regular ground combat troops outnumbered our SF troops nearly 5 to one in the region. \n \n Clinton, at the request of the military, increased funding for SF programs by 600%. He did cut regular military spending, and weapons design systems spending (the lions share of the Clinton era military cuts were to acquisition of new weapons systems and absolutely unrelated to troop size, strength, or safety).\n \n The arguments for doing so were plentiful and came from both sides of the aisle. When Bush 1 left office, it was estimated that our military was big enough and well armed enough to beat the next 10 largest militarize on the planet. It was also widely accepted that our military was no longer suited for occupation of other nations. Both sides of the isle agreed that this was acceptable because the world is essentially stable, and under international law and UN rules there was no way the US would ever be required to invade AND occupy a nation. What they failed to take into account was the idea of an ILLEGAL invasion by the US, in which case we would be required to provide the full occupational force as well. \n \n Today, the US military has the SAME combat effectiveness it had at the height of WWII. We utilize fewer men, but have improved equipment and tactics, which renders those men more effective than their historical counterparts. IMO (and many other peoples), it is absolutely RIDICULOUS to maintain a military with t he combat effectiveness to invade all of Europe. It is absolutely insane during peace time to keep a military that large. If we ever do feel compelled to invade Europe, a draft could be instituted, or a rapid build up in military force. It is like using an elephant to pull a hand cart.", 
   {}, 
   194786, 
   null, 
   1138246740.0
  ], 
  [
   194799, 
   null, 
   "Kronus", 
   "If there was poor planning on his part, it was that he didn't take into account a concerted effort by the left to make the war a political attack issue. Who'd have thought they would even go so far as to weaken national security? \n\n \n Sorry to be blunt, but that's well nigh insane. If you're going to fling around slander like that then be prepared to back it up with hard facts. Whatever the \"left\", whatever you mean by that, has done, it's had a negligable effect on Iraq. The major gap in Bush's planning is that he had no idea what to do after the invasion. He had some idea that the Iraqis would be flinging flowers, then everyone home for the victory parade. He didn't anticipate the chaos that would result when the Iraqi government was overthrown, he had no plan to rebuild the infrastructure, he had no plan period. The country was in chaos for months, and then lo and behold an anti-american movement started. Again, a little planning could have predicted and prevented that, but Bush was too busy declaring \"Mission Accopmplished\" to actually finish the job. And now our troops are over there getting battered because Bush couldn't get his act together. It's not the \"left\" that's forsaken our troops, it's their commander in chief. He's sold them out, spend their lives for political gain.", 
   {}, 
   194768, 
   null, 
   1138247400.0
  ], 
  [
   194850, 
   null, 
   "jyoshu", 
   "People are not enlisting because they do not want to be shipped off to the desert to be shot. It is as simple as that. Military recruitment has ALWAYS gone down during times of active hostility. To most who join the military (or reserves) it is a better job than they could get in the civilian sector, or a free ride to college. The odds of actually being shipped off to be shot at are generally pretty low. When we are actively engaged in a conflict, raising those odds, people are not so keen,.\n\n \n I believe that if the left hadn't pushed the anti-war movement (and yes, it's more center of left now) and it's propaganda to the point where it gives an unbalanced look at the situation AND demoralizes our troops, we'd be doing better now than we are. That's my opinion.\n \n I think you guys grossly and naively underestimate the damage done by the anti-war movement. If worked toward a balanced message, that would be different, but they don't.", 
   {}, 
   194781, 
   null, 
   1138292700.0
  ], 
  [
   194855, 
   null, 
   "Kronus", 
   "I believe that if the left hadn't pushed the anti-war movement (and yes, it's more center of left now) and it's propaganda to the point where it gives an unbalanced look at the situation AND demoralizes our troops, we'd be doing better now than we are. That's my opinion.\n \n\n \n Fantastic. Do you have any evidence to back up that opinion? Or should we just dump this into the \"What Jyoshu thinks\" bin?", 
   {}, 
   194850, 
   null, 
   1138293240.0
  ], 
  [
   194858, 
   null, 
   "jyoshu", 
   "Fantastic. Do you have any evidence to back up that opinion? Or should we just dump this into the \"What Jyoshu thinks\" bin?\n\n \n No, not any direct evidence of a causal effect. But it's no less evidence than people such as yourself have when blaming the failures squarely on Bush instead of other factors.", 
   {}, 
   194855, 
   null, 
   1138294140.0
  ], 
  [
   194861, 
   null, 
   "Kronus", 
   "No, not any direct evidence of a causal effect. \n\n If you even have circumstantial evidence, I'd like to see it. Show me anything you have to back up your claim.\n \n \n\n But it's no less evidence than people such as yourself have when blaming the failures squarely on Bush instead of other factors.\n\n Well, he is the commander in chief. The final approval of the strategy was his, the motivation for the invasion was his, the resposibility to make sure that plans were in place, carried out, and modified as necessary was his. Short of any bizzare, unpredictable occurance, if a plan doesn't work than it's the fault of the person who thought up and implemented the plan.", 
   {}, 
   194858, 
   null, 
   1138295460.0
  ], 
  [
   194863, 
   null, 
   "georged", 
   "I believe that if the left hadn't pushed the anti-war movement (and yes, it's more center of left now) and it's propaganda to the point where it gives an unbalanced look at the situation AND demoralizes our troops, we'd be doing better now than we are. That's my opinion.\n \n I think you guys grossly and naively underestimate the damage done by the anti-war movement. If worked toward a balanced message, that would be different, but they don't.\n\n \n Balanced message? We were condemned by every nation we couldn't buy as a member of 'the coalition of the willing' for attacking a sovereign nation based on suspicion, we completely destroyed Iraq's infrastructure, have killed over 30,000 Iraqi civilians we crassly define as collateral damage, created what amounts to a civil war within Iraq, severely depleted our resources using abnormal debt and watch the numbers of dead/wounded Iraqis and Americans rise at a steady rate. What sort of 'balanced message' are you seeking, world war?", 
   {}, 
   194850, 
   null, 
   1138296180.0
  ], 
  [
   194867, 
   null, 
   "georged", 
   "\n Well, he is the commander in chief. The final approval of the strategy was his, the motivation for the invasion was his, the resposibility to make sure that plans were in place, carried out, and modified as necessary was his. Short of any bizzare, unpredictable occurance, if a plan doesn't work than it's the fault of the person who thought up and implemented the plan.\n\n \n Who seemingly has a habit of shooting messengers who bear bad news.", 
   {}, 
   194861, 
   null, 
   1138297740.0
  ], 
  [
   194877, 
   null, 
   "Maineiac", 
   "jyoshu:\n \n I believe our troops realize that for the most part, they have the support of the american people. Yes, there are anti-war protests, but I don't think it is having the effect on their moral that you are suggesting.\n \n Unless we get someone on here to explain what it is like being there, we can only portray what some of the factors are that contribute to it.\n \n When our troops were sent to Iraq, they were ordered to be nice to people . They were on a PR mission to convince them that we were not a hostile enemy. They were ordered to shake hands with everyone, pass out candy to kids, pass out food, pass out money, buy weapons, etc.\n \n Shaking hands in Iraq is actually a bit strange. In the slums of Bagdad, where my son was, these people wipe their butts with their left hand,without toilet paper. They shake with their right hand, but it still must be gross.\n \n They passed out toys and candy to kids. These kids are as hostile.They throw things 24-7 at our troops. Anything they can pick up is a projectile, stones, bricks, bottles ,etc. My son was hit in the mouth, knocking out his front teeth, by a kid he had just passes out candy and food to.Yet they cant\n throw anything back or fire shots at them.\n \n Some soldiers got caught in a situation where their tour was over, but had to remain there to help the troops that were replacing them learn how to deal with the situation they were taking over. \n \n There is a lot of frustration for them, fighting an invisible enemy. The roadside bombs are killing their fellow soldiers ,sometimes right in front of them, but they cant just jump out and kill whoever is was that just killed their fellow soldier.\n \n Some of the troops are mad because we , the American public aren't being told the whole story of Iraq. We are actually doing some good things over there, but the media tends to report the bad things going on instead .\n \n There is more to it than I just mentioned. I was just trying to point out that there are a lot of things to consider when addressing troop moral.", 
   {}, 
   194858, 
   null, 
   1138300020.0
  ], 
  [
   194889, 
   null, 
   "Wez", 
   "The 'anti-war movement' doesn't really have to do much in the way of embellishing the truth to damage rate of recruitment.\n \n Sorry for you son though.:(\n \n -Wez", 
   {}, 
   194877, 
   null, 
   1138302480.0
  ], 
  [
   194954, 
   null, 
   "Truthsayer", 
   "Perhaps if Clinton knew the next president was going to be a war monger and squander our military resources he would have been a bit less anxious to cut the military budget. After all, we're NOT Canada. We need a strong defense since many countries would like to see us blown off the face of the planet. Especially now.emoticon_cry", 
   {}, 
   194889, 
   null, 
   1138316820.0
  ], 
  [
   194961, 
   null, 
   "sinjin", 
   " We are actually doing some good things over there, but the media tends to report the bad things going on instead .\n\n Not that I agree with your take on the media but doesn't the administration tend to paint a overly rosey picture? Maybe they cancel each other out. \n \n Btw sorry for your son's choppers. Tell him I appreciate his service even if I think the whole thing's a clusterunowat.", 
   {}, 
   194877, 
   null, 
   1138318380.0
  ], 
  [
   195024, 
   null, 
   "MTKnight", 
   "teacher's son is a Ranger in Iraq. He just returned home and talked about his experiences. He said that British news media came to his camp and left because no deaths had occured in about two months. emoticon_xangel\n \n He even spoke about an attempt at a suicide bombing. The guy who attempted it blew himself up before he got 3 feet into the camp. No one was hurt...stunned...but not hurt.\n \n He himself said that they're finding that Insurgents are attacking them less and less. Mostly cause if they attack us they have a higher chance of dying. They are targeting civillians more often than the soldiers. He even said that they shoot and than run into a mob of civillians in order to avoid getting shot back at.\n \n Also he had no trouble doing an extra tour due to not enough troops being there. He even, with the help of other rangers, converted a artillary unit into an infantry unit. He had to bring them back to basic training in Iraq. So yes we don't have enough troops, but the war has been going well.", 
   {
    "post_info": {
     "post_title": "My old high school..."
    }
   }, 
   194850, 
   null, 
   1138339320.0
  ], 
  [
   195044, 
   null, 
   "jyoshu", 
   "Not that I agree with your take on the media but doesn't the administration tend to paint a overly rosey picture? Maybe they cancel each other out.\n\n \n I don't think so. If it weren't for the administration, we wouldn't hear much of ANY of the good things happening over there, because for all practical purposes there has been a media blackout of anything but the bad news. It's also interesting that the media reports on war differently than they used to. Because they have a much bigger presence there, and because of satellite and instant feeds, they pretty much immediately report on every single casualty that takes place over there. Vietnam was never reported on so closely and comprehensively. So in that sense, this is probably the most well-reported war in history. So in all due respect, it's not all the media's fault--a lot of it has to do with technology and the ability to maintain a media presence in Iraq. But it results in news that's very one-sided, because the media wants to report on the sensational events, which tend to be the casualties rather than the victories and good things happening.", 
   {}, 
   194961, 
   null, 
   1138381260.0
  ], 
  [
   195046, 
   null, 
   "jyoshu", 
   "He himself said that they're finding that Insurgents are attacking them less and less. Mostly cause if they attack us they have a higher chance of dying. They are targeting civillians more often than the soldiers. He even said that they shoot and than run into a mob of civillians in order to avoid getting shot back at.\n \n Also he had no trouble doing an extra tour due to not enough troops being there. He even, with the help of other rangers, converted a artillary unit into an infantry unit. He had to bring them back to basic training in Iraq. So yes we don't have enough troops, but the war has been going well.\n\n \n See, this is what the public isn't getting. Why isn't the media out there interviewing these troops and getting their take? \n \n It's wagging the dog, and the media fuels the anti-war movement because they only care about the sensational stuff. Then people in the US only get a biased view of the situation. The anti-war movement loves it, no doubt, but some of us would prefer balance and accuracy.", 
   {}, 
   195024, 
   null, 
   1138381440.0
  ], 
  [
   195086, 
   null, 
   "Wez", 
   "We've all but stopped getting reports of casualties, unless they're just tagged onto the end of the news as a filler.:)\n \n -Wez", 
   {}, 
   195046, 
   null, 
   1138390140.0
  ], 
  [
   195089, 
   null, 
   "jyoshu", 
   "We've all but stopped getting reports of casualties, unless they're just tagged onto the end of the news as a filler.:)\n \n -Wez\n\n \n That's because there haven't been as many lately. Now they're just focusing a lot on people who hate Bush and putting out poll results about him that had leading and biased questions to begin with. Until somemore casualty news comes along.", 
   {}, 
   195086, 
   null, 
   1138390380.0
  ], 
  [
   195091, 
   null, 
   "Wez", 
   "That's because there haven't been as many lately. Now they're just focusing a lot on people who hate Bush and putting out poll results about him that had leading and biased questions to begin with. Until somemore casualty news comes along.\n\n http://icasualties.org/oif/\n \n Casualty numbers oscillate but it doesn't look like they're dropping significantly.\n \n -Wez", 
   {}, 
   195089, 
   null, 
   1138390860.0
  ], 
  [
   195099, 
   null, 
   "OccamsRazor", 
   "That's because there haven't been as many lately.\n\n \n You obviously pay zero attention to casualty figures them emoticon_rolleyes\n \n If you were to follow sites such as the one Wez linked you would appreciate two saddening points:\n \n 1. Coalition troops are killed and wounded every day.\n \n 2. The rate at which casualties are sustained continues to slowly increase. This is a long running trend that has persisted for the last two years.\n \n Off course two and a half thousand dead and twenty plus thousand wounded for the coalition are small fry set against what the civilian population of Iraq have sustained.", 
   {}, 
   195089, 
   null, 
   1138392120.0
  ], 
  [
   195108, 
   null, 
   "jyoshu", 
   "You obviously pay zero attention to casualty figures them emoticon_rolleyes\n \n If you were to follow sites such as the one Wez linked you would appreciate two saddening points:\n \n 1. Coalition troops are killed and wounded every day.\n \n 2. The rate at which casualties are sustained continues to slowly increase. This is a long running trend that has persisted for the last two years.\n \n Off course two and a half thousand dead and twenty plus thousand wounded for the coalition are small fry set against what the civilian population of Iraq have sustained.\n\n \n Sure, if you go by propaganda which is a lot of all that is, unless you have something more credible and official to offer", 
   {}, 
   195099, 
   null, 
   1138396140.0
  ], 
  [
   195112, 
   null, 
   "georged", 
   "Sure, if you go by propaganda which is a lot of all that is, unless you have something more credible and official to offer\n\n \n What's more credible than casualty figures? Some refocus nonsense that Iraq becoming a democracy involved in civil war with gross government corruption and a population that wants us out is a good thing?", 
   {}, 
   195108, 
   null, 
   1138396620.0
  ], 
  [
   195115, 
   null, 
   "Big_Bear_Scot", 
   "Sure, if you go by propaganda which is a lot of all that is, unless you have something more credible and official to offer\n\n \n Have a little look at this link on how they come up with the figures, it seems a reasonable way to collate the information.\n \n http://icasualties.org/oif/Methodology.aspx", 
   {}, 
   195108, 
   null, 
   1138397100.0
  ], 
  [
   195116, 
   null, 
   "Maineiac", 
   "Not that I agree with your take on the media but doesn't the administration tend to paint a overly rosey picture? Maybe they cancel each other out. \n \n Btw sorry for your son's choppers. Tell him I appreciate his service even if I think the whole thing's a clusterunowat.\n\n \n Hi sinjin.\n \n Thank you for your comment. Still a few familiar names here.emoticon_xgood \n \n We talked to him on the phone a few times, comparing his version of current events at the time, to what we were hearing at home. I'm amazed at the twist the government, and media can give of what is actuall happening .\n \n I'v seen the effect a war can have on a young man.\n We don't talk about it much.", 
   {}, 
   194961, 
   null, 
   1138397880.0
  ], 
  [
   195123, 
   null, 
   "sinjin", 
   "Hi sinjin.\n \n Thank you for your comment. Still a few familiar names here.emoticon_xgood \n \n We talked to him on the phone a few times, comparing his version of current events at the time, to what we were hearing at home. I'm amazed at the twist the government, and media can give of what is actuall happening .\n \n I'v seen the effect a war can have on a young man.\n We don't talk about it much.\n\n \n I have a 15 yr. old stepson. I used to tell him that a stint in the military does most young men I've known some good. I don't tell him that lately as I don't feel the trauma being handed out these days in Iraq does any young man any good at all.", 
   {}, 
   195116, 
   null, 
   1138402740.0
  ], 
  [
   195214, 
   null, 
   "MTKnight", 
   "I've always wondered why we never hear more on how many confirmed kills we've gotten of those who have attacked us. Anyone ever wonder that?\n \n Also I don't like that we lose soldiers, but looking at figures were losing very little. I'm sorry to say I don't remember exact figures, but somewhere below 3% I believe. In a democracy no one wants to lose anyone and that's that.\n \n People get mad also about hearing that those soldiers stationend somewhere else might have to do a tour of duty in Iraq. As a friend of mine said, \"Oh my God, we might actually have to use are army!\"\n \n Anyone remember the name of the city that was kinda the last holdout of insurgents. Faluja? I don't remember the name, but anyone remember seeing a video on the news of an insurgent with an RPG kneeling down and than they flip to next scene? The next scene was of bullets flying towards him from US soldiers killing him before he even fired the RPG.\n \n Also on the last post of my teacher's son. He told us also about how many Iraqi people see us. They get certain channels like Spice...and think that is how all Americans act. He even had one Iraqi man who interprets for him tell him he does not allow his wife to sleep with other men. The man was atonished to find out thats not how all Americans act. Also he trained some of the police force there and some of them began asking about certain bonuses or what we like to call bribes. Its hard to believe (well not that hard I guess) that their police would think like this. Just shows what kind of society they have been living in for the past 15-25 years.", 
   {
    "post_info": {
     "post_title": "Casualty Figures?"
    }
   }, 
   195123, 
   null, 
   1138443660.0
  ], 
  [
   195415, 
   null, 
   "OccamsRazor", 
   "Sure, if you go by propaganda which is a lot of all that is, unless you have something more credible and official to offer\n\n \n Propaganda? wow, you must have tried calling a Jellyfish a cow recently because thats about how accurate your comment was.\n \n Icasualties is based on Government press releases and can be directly correlated with periodic cumlative casualty statistics that are published by the same organisations. It started because the US Military was making no attempt to publicly acknowledge total casualties sustained in the 2003 Invasion and following operations.\n \n On Iraqi casualties its harder to ascertain because -wait for it!- the Coalition governments are, for some inexplicable reason, reluctant to make such information available in the public domain. The Iraq Body Count has attempted to track civilian deaths by cross-referencing news reports of civilian deaths. Official figures are hard to come by, but I would take IBC as a minimum of the actual figure as all deaths will not be reported. The UK Defence Secretary Jack Straw is on the record as quoting civilian death totals that correspond to the estimate range of IBC on more than one occasion.\n \n So, you going to retract your propaganda remark then?", 
   {}, 
   195108, 
   null, 
   1138557240.0
  ], 
  [
   195417, 
   null, 
   "OccamsRazor", 
   "I've always wondered why we never hear more on how many confirmed kills we've gotten of those who have attacked us. Anyone ever wonder that?\n\n \n Because of the Vietnam experience.......\n \n \nAlso I don't like that we lose soldiers, but looking at figures were losing very little. I'm sorry to say I don't remember exact figures, but somewhere below 3% I believe. In a democracy no one wants to lose anyone and that's that.\n\n \n Its not just about losing, its also about the cause in which they are lost.", 
   {}, 
   195214, 
   null, 
   1138557660.0
  ], 
  [
   195457, 
   null, 
   "jyoshu", 
   "Propaganda? wow, you must have tried calling a Jellyfish a cow recently because thats about how accurate your comment was.\n \n Icasualties is based on Government press releases and can be directly correlated with periodic cumlative casualty statistics that are published by the same organisations. It started because the US Military was making no attempt to publicly acknowledge total casualties sustained in the 2003 Invasion and following operations.\n \n On Iraqi casualties its harder to ascertain because -wait for it!- the Coalition governments are, for some inexplicable reason, reluctant to make such information available in the public domain. The Iraq Body Count has attempted to track civilian deaths by cross-referencing news reports of civilian deaths. Official figures are hard to come by, but I would take IBC as a minimum of the actual figure as all deaths will not be reported. The UK Defence Secretary Jack Straw is on the record as quoting civilian death totals that correspond to the estimate range of IBC on more than one occasion.\n \n So, you going to retract your propaganda remark then?\n\n \n Given that so much of what we are calling \"civilians\" are really supporting or participating in the insurgency (and are really therefore insurgents), then I agree with you that civilian body counts are going to be inaccurate. All those people shooting from every nook and cranny into the streets of Fallujah sure stretch that \"civilian\" moniker pretty far . . .", 
   {}, 
   195415, 
   null, 
   1138571700.0
  ], 
  [
   195458, 
   null, 
   "daewoo", 
   "Given that so much of what we are calling \"civilians\" are really supporting or participating in the insurgency (and are really therefore insurgents), then I agree with you that civilian body counts are going to be inaccurate. All those people shooting from every nook and cranny into the streets of Fallujah sure stretch that \"civilian\" moniker pretty far . . .\n\n \n Can you provide a link to back this up? Are you really foolish enough to believe that governmetn sources would be verifying numbers of civilain deaths that were really insurgent deaths?\n \n By your logic above, we have now WON the war on terror. Since the US, and the people of the US, are supporting the invasion force, we are ALL combatants, and therefore all military targets. So, there is no war on terror, just a war against a non national guerilla army.\n \n You cannot have it both ways. Either civilian targets are legitimate or they are not. Political affiliation makes not difference. If they are legitimate targets, then we have no right to complain about terrorist attacks. If not, then killing tens of thousands fo IRaqis is a morally bankrupt thing to do and those who support it or try to rationalize it are sick and need serious help.", 
   {}, 
   195457, 
   null, 
   1138572540.0
  ], 
  [
   195459, 
   null, 
   "jyoshu", 
   "Also I don't like that we lose soldiers, but looking at figures were losing very little. I'm sorry to say I don't remember exact figures, but somewhere below 3% I believe. In a democracy no one wants to lose anyone and that's that.\n\n \n What I find interesting is that the anti-war movement is even having to harp and play up on so-called \"civilian\" casualties so much--the reason is of course that they can't harp so much on US casualties--there just aren't that many when you compare it their favorite war: Vietnam. (Of course if our soldier body counts WERE anywhere approaching any war since before the 1860s, they'd waste nary a second playing it up.) In terms of numbers of U.S. soldiers killed, this has been one of the more successful wars we've had. Compare Vietnam's U.S. soldier casualties to US casualties in Iraq:Vietnam? 58,226\n Iraq? 2238\n And of course, analyzing the the numbers killed over a period of months gives every indication that the casualty counts will not get close to the Vietnam ones even if we stay another 2 year there.Also, war casualties in the Korean War: 33,686 (or 54,246 if you account the non-battle deaths and MIAs)\n \n Kind of puts it in persepective, huh? \n \n So many were lost in these wars , that to even put this Iraqi war in a catagory with Vietnam or Korea is an insult to every veteran or KIA of those wars, IMO.", 
   {}, 
   195214, 
   null, 
   1138572720.0
  ], 
  [
   195460, 
   null, 
   "daewoo", 
   "What I find interesting is that the anti-war movement is even having to harp and play up on so-called \"civilian\" casualties so much--the reason is of course that they can't harp so much on US casualties--there just aren't that many when you compare it their favorite war: Vietnam. (Of course if our soldier body counts WERE anywhere approaching any war since before the 1860s, they'd waste nary a second playing it up.) In terms of numbers of U.S. soldiers killed, this has been one of the more successful wars we've had. Compare Vietnam's U.S. soldier casualties to US casualties in Iraq:Vietnam? 58,226\n Iraq? 2238\n And of course, analyzing the the numbers killed over a period of months gives every indication that the casualty counts will not get close to the Vietnam ones even if we stay another 2 year there.Also, war casualties in the Korean War: 33,686 (or 54,246 if you account the non-battle deaths and MIAs)\n \n Kind of puts it in persepective, huh? \n \n So many were lost in these wars , that to even put this Iraqi war in a catagory with Vietnam or Korea is an insult to every veteran or KIA of those wars, IMO.\n\n \n That is because we are fighting a cowards war. We are using air strikes in populated areas instead of sending in ground troops. This keeps the number fo US casualties down, but contributes enormously to civlian death tolls.\n \n Theres something to be proud of! Fewer US troop deaths (soldiers) by murdering Iraqi civilians. Certain to increase our image as a society worth duplicating.", 
   {}, 
   195459, 
   null, 
   1138573140.0
  ], 
  [
   195463, 
   null, 
   "jyoshu", 
   "That is because we are fighting a cowards war. We are using air strikes in populated areas instead of sending in ground troops. This keeps the number fo US casualties down, but contributes enormously to civlian death tolls.\n \n Theres something to be proud of! Fewer US troop deaths (soldiers) by murdering Iraqi civilians. Certain to increase our image as a society worth duplicating.\n\n \n I find it interesting that you and others didn't have anywhere close to the same sort of indignation over the \"coward's war\" (airstrikes) that went on under Bush 1 in Iraq. \n \n And again, you aren't taking into account that much of the population in these strike areas WERE insurgency. If you really knew much of the situation you'd know that this idea of yours that most of the people in these areas were uninvolved civilians and not in fact part of the insurgency is just unrealistic. War is not fought like it used to be, with definitive armies in uniform facing off on a predetermined battlefield. I also think if we had sent in ground troops only, you'd have just used THAT as part of your anti-war message too. It's not like you'd think of it as NOT being cowardly anyway if it hadn't happened. This anti-war movement of yours is political, pure and simple. There are just too many inconsistencies and non-proven statements for it to be anything else.", 
   {}, 
   195460, 
   null, 
   1138574520.0
  ], 
  [
   195469, 
   null, 
   "Wez", 
   "This anti-war movement of yours is political, pure and simple. There are just too many inconsistencies and non-proven statements for it to be anything else.\n\n I don't like the Dems any more than the Republicans... I don't see why my objections are political. If the US cared about helping people, why not sort out most of Africa's problems? The money spent on the Iraq war could have saved millions of lives.\n \n \nGiven that so much of what we are calling \"civilians\" are really supporting or participating in the insurgency (and are really therefore insurgents), then I agree with you that civilian body counts are going to be inaccurate. All those people shooting from every nook and cranny into the streets of Fallujah sure stretch that \"civilian\" moniker pretty far . . .\n\n Evidence?\n \n Your first claim that there \"haven't been as many [US casulaties] lately\" was proven to be a lie/false. Do you have evidence for this claim?\n \n -Wez", 
   {
    "unicode_changes_made": true
   }, 
   195463, 
   null, 
   1138576320.0
  ], 
  [
   195490, 
   null, 
   "jyoshu", 
   "I don't like the Dems any more than the Republicans... I don't see why my objections are political.\n\n \n Do you consider yourself part of the current anti-war movement? I don't, even if you don't necessarily support this war. The outspoken anti-war movement that exists right now, e.g. Cindy Sheehan, are politically motivated. You may indeed have honest anti-war beliefs, but based on some of the posts here by several others, it's pretty obvious they're more along the lines of the anti-war movement that's all about politics. That's my opinion. When someone spends most of their time bashing the president and republicans, ignoring the problems and faults of the democrats (which would be the balanced thing to do), it's a sure sign.\n \n \nYour first claim that there \"haven't been as many [US casulaties] lately\" was proven to be a lie/false. Do you have evidence for this claim?\n\n \n No it wasn't proven wrong. November of 2004 and thereabouts was the timeframe for the highest casualties; it was more than double what it is has been the last 2 months. Those charts on iCasualties will tell you that! So, no, they haven't been as high.", 
   {
    "unicode_changes_made": true
   }, 
   195469, 
   null, 
   1138584000.0
  ], 
  [
   195494, 
   null, 
   "georged", 
   " When someone spends most of their time bashing the president and republicans, ignoring the problems and faults of the democrats (which would be the balanced thing to do), it's a sure sign.\n \n\n \n Blame for deficiency, real or perceived, is directed at the responsible party, the one in charge. How could anyone possibly blame the Iraq deception on anyone but the party controlling both administration and congress?", 
   {}, 
   195490, 
   null, 
   1138584840.0
  ], 
  [
   195501, 
   null, 
   "OccamsRazor", 
   "Given that so much of what we are calling \"civilians\" are really supporting or participating in the insurgency (and are really therefore insurgents), then I agree with you that civilian body counts are going to be inaccurate. All those people shooting from every nook and cranny into the streets of Fallujah sure stretch that \"civilian\" moniker pretty far . . .\n\n \n So you accept you were wrong on the military casualty figures, but now try worm your way out on the civilian issue. Sure some of those reported deaths are people who were fighting US troops, but even if we said they represented 50% of that total thats still 15,000 uninvolved civilians killed, and many, many more wounded.\n \n Anyway, Fallujah was unusual in that it was something approaching a conventional battle, and according to the distribution of casualties over at IBC about 6% of the total they have reported- ie. a minority of the total.", 
   {}, 
   195457, 
   null, 
   1138587360.0
  ], 
  [
   195502, 
   null, 
   "daewoo", 
   "I find it interesting that you and others didn't have anywhere close to the same sort of indignation over the \"coward's war\" (airstrikes) that went on under Bush 1 in Iraq. \n\n \n We did not see ill concieved \"decapitation\" strikes in civilian neiborhoods during desert storm. We did not lauch missiles or have our tanks fire into apartment complexes during desert storm. We did not intentionally bomb restaurants during the lunch rush during desert storm. \n \n \nAnd again, you aren't taking into account that much of the population in these strike areas WERE insurgency. If you really knew much of the situation you'd know that this idea of yours that most of the people in these areas were uninvolved civilians and not in fact part of the insurgency is just unrealistic.\n\n \n Again CAN YOU BACK THIS UP. Can you show that when we bombed the Al Saa restaurant in Masour, that the people killed, some of them upt o 300 meters away, were insurgents? Of course not. You have no proof of your claim, and frankly it is utterly foolish. \n \n \n War is not fought like it used to be, with definitive armies in uniform facing off on a predetermined battlefield. I also think if we had sent in ground troops only, you'd have just used THAT as part of your anti-war message too. It's not like you'd think of it as NOT being cowardly anyway if it hadn't happened. This anti-war movement of yours is political, pure and simple. There are just too many inconsistencies and non-proven statements for it to be anything else.\n\n \n \n the face fo war changed years ago. The war in Iraq is no different than the war in vietnam, or bosnia, or the sudan. If we had used ground troops to sudue insurgents instead of massive air strikes, I would not have complained, even thougjh US casualties probably would have quadrupled, because that is the way an honorable war should be fought. Soldiers fight and die. It is their function. Disregarding civilains lives to save soldiers lives is cowardly.\n \n Politically motivated? Inconsistent? Hardly, and frankly coming from you that is almost laughable. My position has been consistent form the start. Your has been all over the map becuas frankly your position on the war in Iran and the war on terror in general is WHOLLY political and cowardly. Unproven statements? Yes, YOU have made a lot of unproven statements. Almost every time you are asked to prove any part of your ignorant stance you try to divert the discussion in another direction because you know damn well that your position is illogical, racist, and fear based. I asked you above to show some credibility to your idea that most of the civlian casualties have been insurgents. Where is it? You have asked me before to show that we have intentionally bombed civilain areas, and I provided you with a dozen links. Now you have been asked THREE times for proof that your position on civilain Iraqi casualties has any credibility at all. Are you going to provide it? IF course no, becuase it is just more of your foolish, politically driven garbage.", 
   {}, 
   195463, 
   null, 
   1138587420.0
  ], 
  [
   195503, 
   null, 
   "OccamsRazor", 
   "\n So many were lost in these wars , that to even put this Iraqi war in a catagory with Vietnam or Korea is an insult to every veteran or KIA of those wars, IMO.\n\n \n Sorry, that statement is complete, utter rubbish. If we turn it on its head you have just infered the dead, maimed, injured, traumatised and their loved ones from the ongoing war in Iraq are worthy of less respect and compassion because the total losses are smaller than previous conflicts. Heck, you've just implied that for every USsoldier who was not involved in the most costly conflict in your nations history (which in case you were wondering was WW2).", 
   {}, 
   195459, 
   null, 
   1138587480.0
  ], 
  [
   195537, 
   null, 
   "beervolcano", 
   "Do you consider yourself part of the current anti-war movement? I don't, even if you don't necessarily support this war. The outspoken anti-war movement that exists right now, e.g. Cindy Sheehan, are politically motivated. You may indeed have honest anti-war beliefs, but based on some of the posts here by several others, it's pretty obvious they're more along the lines of the anti-war movement that's all about politics. That's my opinion. When someone spends most of their time bashing the president and republicans, ignoring the problems and faults of the democrats (which would be the balanced thing to do), it's a sure sign.\n\n \n Don't you think that people like Sheehan and anti-war protesters actually want the war to end? And to make sure that something like this doesn't happen again? To try to make sure that there is less and less public support for wars like the one we have now, the people responsible for the war must be accused and held accountable. \n \n The Iraq war is an economic one, not one of national security. The people who wanted the war did a pretty good job of lying to the people to CONvince them that it was about national security. Those people, or at least those on the fence, must be re-convinced that the only security this war was about was economic security. They must be convinced that they were lied to by their \"leaders.\" It's pretty much the only way for these anti-war activists can hope to prevent future wars of aggression based on greed.\n \n It's also political in that those who lied us into war are still in office and must be voted out, preferable replaced by those who are anti-war.\n \n So, there. The anti-war crowd is sincere in its attempts to stop the war AND in order to prevent furutre wars of this type, there must also be an accompanying political message to keep these \"types\" out of office. Ah, but in the end they forget about Diebold.", 
   {}, 
   195490, 
   null, 
   1138597440.0
  ], 
  [
   195614, 
   null, 
   "Wez", 
   "Do you consider yourself part of the current anti-war movement? I don't, even if you don't necessarily support this war. The outspoken anti-war movement that exists right now, e.g. Cindy Sheehan, are politically motivated. You may indeed have honest anti-war beliefs, but based on some of the posts here by several others, it's pretty obvious they're more along the lines of the anti-war movement that's all about politics. That's my opinion. When someone spends most of their time bashing the president and republicans, ignoring the problems and faults of the democrats (which would be the balanced thing to do), it's a sure sign.\n\n I would moan at the Dems just as much, were they in power. They're not though, so I don't comment on them much. That said, I'm not really part of the 'anti-war' movement as you define it, so my first sentence is irrelevant.:)\n \n \nNo it wasn't proven wrong. November of 2004 and thereabouts was the timeframe for the highest casualties; it was more than double what it is has been the last 2 months. Those charts on iCasualties will tell you that! So, no, they haven't been as high.\n\n Twisting it round, I can claim casualty rates have nearly doubled compared to September 03. But neither example is particularly useful. I don't think there are any clear trends in casualty rates. They seem fairly constant, judging from the gradient of the line.\n \n \nGiven that so much of what we are calling \"civilians\" are really supporting or participating in the insurgency (and are really therefore insurgents), then I agree with you that civilian body counts are going to be inaccurate. All those people shooting from every nook and cranny into the streets of Fallujah sure stretch that \"civilian\" moniker pretty far . . .\n\n Evidence?\n \n -Wez", 
   {}, 
   195490, 
   null, 
   1138646280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Army stretched to breaking point, report says", 
  "url": "http://www.4forums.com/political/politics-debates/7436-army-stretched-breaking-point-report-says.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 7436, 
  "discussion_files": [
   [
    "12667.html", 
    "http://www.4forums.com/political/politics-debates/7436-army-stretched-breaking-point-report-says-print.html"
   ], 
   [
    "12668.html", 
    "http://www.4forums.com/political/politics-debates/7436-army-stretched-breaking-point-report-says-4-print.html"
   ], 
   [
    "12669.html", 
    "http://www.4forums.com/political/politics-debates/7436-army-stretched-breaking-point-report-says-3-print.html"
   ], 
   [
    "12670.html", 
    "http://www.4forums.com/political/politics-debates/7436-army-stretched-breaking-point-report-says-2-print.html"
   ]
  ], 
  "identifier": 7436
 }
]