[
 [
  [
   194918, 
   null, 
   "Big_Bear_Scot", 
   "http://news.bbc.co.uk/1/hi/world/middle_east/4650788.stm\n \n Now this stirs up a whole Hornets Nest in the region, the Palestinian people have gave a ringing endorsement to Hamas. The West now has a dilemma can they give money to Palestinian Authority that is run by what most Countries consider a Terrorist Organisation ? \n \n I would say it is highly hypocritical of us to with hold this money and say we support democracy, after all Hamas was chosen by the people in a free and fair election and if we don't give the money to the Authority then it will be the Palestinian People will be the first to suffer.\n \n Any comments on the result and its impact for the peace process.", 
   {
    "post_info": {
     "post_title": "Power of Democracy - Hamas wins"
    }
   }, 
   null, 
   null, 
   1138308480.0
  ], 
  [
   194921, 
   null, 
   "Wez", 
   "This doesn't look good.\n \n Both sides appear too stubborn for any progress to be made.\n \n -Wez", 
   {}, 
   194918, 
   null, 
   1138308720.0
  ], 
  [
   194924, 
   null, 
   "Big_Bear_Scot", 
   "This doesn't look good.\n \n Both sides appear too stubborn for any progress to be made.\n \n -Wez\n\n \n I have to agree, the ball is Hamas's court. Will they do an IRA/Sin Fien and renounce violence ?", 
   {}, 
   194921, 
   null, 
   1138309380.0
  ], 
  [
   194948, 
   null, 
   "Maineiac", 
   "I'm not surprised Hamas won the election. By all accounts it was a fair election. They were chosen by the people, so they are the key to peace in that region .\n \n Bush was on tv today claiming he won't talk to terrorists. Well, it appears there is no choice. Bush has done little, if anything to promote peace in the Middle East since he came into office. Up to this point, he has taken the hands off approach which is why I don't think he will be much help in the future.\n \n As strange as it seems, Hamas actually does a lot for the Palistinians. They provide a lot of social services for the people. They don't see Hamas the same as the rest of the world.\n \n The people wanted a change. I wouldn't hold that against them . They had basically two choices, go with the way things were, at a standstill , same old violence, poor living conditions, family and friends dying daily, poverty.\n \n Or vote for a proven friend of the people, their protector and provider. Someone who represents change.\n \n Someone will talk to Hamas. Nobody wants to be first.", 
   {}, 
   194924, 
   null, 
   1138315320.0
  ], 
  [
   194978, 
   null, 
   "Diogenes99", 
   "It seems to me that the Palestinians were given a hard choice between bad alternatives (I've frequently had to choose the lesser of two evils at the ballot box), and I'm not sure if this is a ringing endorsement of Hamas violence or a stinging rejection of Fatah corruption. I hope it's the latter, but that may be just wishful thinking.\n \n If the new government persists in claiming the destruction of Israel as their primary goal, we should not recognize or meet with them, and all aid should stop cold. If they remove that plank from their platform, we can talk.", 
   {}, 
   194948, 
   null, 
   1138321080.0
  ], 
  [
   194982, 
   null, 
   "Wez", 
   "Hamas also help Palestinians with hospitals, child-care, security etc.\n \n -Wez", 
   {}, 
   194978, 
   null, 
   1138321560.0
  ], 
  [
   195006, 
   null, 
   "georged", 
   "\n If the new government persists in claiming the destruction of Israel as their primary goal, we should not recognize or meet with them, and all aid should stop cold. If they remove that plank from their platform, we can talk.\n\n \n Then you first need to remove the Sauds, our ally, who encourage and finance the bulk of ME charities. Hamas is a political organization with the typical distinctions of any form of government in any country. Insisting that the military arm of Hamas be silenced when their country is partially occupied by Israel is no different than telling them you agree with and encourage Israeli occupation. \n \n Putting yourself in the Hamas position, how would you react to being told no one will talk to you unless you agree to Mexico occupying a portion of the US, subjecting that geography to Mexican martial law and using Mexican military force to suppress any objection by the residents?", 
   {}, 
   194978, 
   null, 
   1138329780.0
  ], 
  [
   195034, 
   null, 
   "Alan Ryan", 
   "Democracy is more than just the freedom to vote in elections. It requires what might be called a 'cultural infrastructure' in order to take root and grow.\n \n The state of Palestine - using an elastic concept of 'state' - does not have the organic pre-conditions for establishing democratic institutions; at least not yet.\n \n For this reason, I'm pessimistic about the Hamas victory in these elections. I would have been equally downbeat had the Fatah party won.", 
   {}, 
   195006, 
   null, 
   1138372800.0
  ], 
  [
   195040, 
   null, 
   "georged", 
   "Democracy is more than just the freedom to vote in elections. It requires what might be called a 'cultural infrastructure' in order to take root and grow.\n \n The state of Palestine - using an elastic concept of 'state' - does not have the organic pre-conditions for establishing democratic institutions; at least not yet.\n \n For this reason, I'm pessimistic about the Hamas victory in these elections. I would have been equally downbeat had the Fatah party won.\n\n \n I'd have to compare Palestine's 'democracy' to Iraq's 'democracy'. Both have been dominated by superior military forces (actually the same money and materials, US), both have population segments resisting that domination, both are attempting governing products (democracy) imposed by nations without the slightest consideration to existing culture, history or desire.\n \n IMO it's 'one size fits all', wear it or go without. How both countries will fare while attempting to adopt what's basically Western ideology remains to be seen. If Iraq is any example, all I see is forging closer alliances between ME countries eager to throw off the yoke of Western dominance.", 
   {}, 
   195034, 
   null, 
   1138379460.0
  ], 
  [
   195053, 
   null, 
   "Alan Ryan", 
   "\n IMO it's 'one size fits all', wear it or go without. How both countries will fare while attempting to adopt what's basically Western ideology remains to be seen. If Iraq is any example, all I see is forging closer alliances between ME countries eager to throw off the yoke of Western dominance.\n\n \n \n What you seem to be implying, and if so I agree with you, is that the US government has a naive belief in its 'gardening' abilities; it thinks it can grow democracy in any soil it chooses. The fertility of that soil is not considered to be a material factor. \n \n Americans, or many of them anyhow, seem to believe that US deployment of power is raised above the temptations of vulgar conquest, and is actualized only by the love of order and justice.", 
   {}, 
   195040, 
   null, 
   1138382340.0
  ], 
  [
   195058, 
   null, 
   "georged", 
   "What you seem to be implying, and if so I agree with you, is that the US government has a naive belief in its 'gardening' abilities; it thinks it can grow democracy in any soil it chooses. The fertility of that soil is not considered to be a material factor. \n \n Americans, or many of them anyhow, seem to believe that US deployment of power is raised above the temptations of vulgar conquest, and is actualized only by the love of order and justice.\n\n \n We're in agreement on both points. Regarding Palestine, I see no hope for peace there until Israel is reined in to its original territory, compensation made for UN and Israeli territorial gains and elimination of US financial and military support of Israeli aggression. The latter will probably require additional deterioration of the US economy, as England experienced post-WW1 and 2, but by then it may be far too late.", 
   {}, 
   195053, 
   null, 
   1138383660.0
  ], 
  [
   195319, 
   null, 
   "friend1", 
   "Hamas was chosen for the Palestinian people by the Palestinian people. To reject their new government can be considered to be an insult to people and an insult to the style of democracy that the west has fought to promote. prior to the election the region in question had seen a reasonable period of peace. it should bot be risked because of the new government. you don't have to like them, you just have to support Hamas as a legitimate government. to not do so would send a message to the Palestinian people that their views mean nothing to you.", 
   {}, 
   195058, 
   null, 
   1138501620.0
  ], 
  [
   195324, 
   null, 
   "georged", 
   "Hamas was chosen for the Palestinian people by the Palestinian people. To reject their new government can be considered to be an insult to people and an insult to the style of democracy that the west has fought to promote. prior to the election the region in question had seen a reasonable period of peace. it should bot be risked because of the new government. you don't have to like them, you just have to support Hamas as a legitimate government. to not do so would send a message to the Palestinian people that their views mean nothing to you.\n\n \n Unfortunately, Western nations have their own definition of democracy and it generally includes subservience to their demands. They're (primarily the US) having problems adjusting to the reality of no longer having oppressive ME and S. American dictators doing their bidding. Israel's land grabs are still the problem for Palestine, no matter what government steers Palestine.", 
   {}, 
   195319, 
   null, 
   1138502700.0
  ], 
  [
   195388, 
   null, 
   "Adept", 
   "Once you batter your way thought the hubris, the options seem pretty clear to me.\n \n Either Hamas renounces violence and pledges to seek non-violent methods of resolution, or the 'coalition of the willing' put Palestine on their list, and pull an Afghanistan on them.", 
   {}, 
   195324, 
   null, 
   1138540140.0
  ], 
  [
   195401, 
   null, 
   "Bassman", 
   "Once you batter your way thought the hubris, the options seem pretty clear to me.\n \n Either Hamas renounces violence and pledges to seek non-violent methods of resolution, or the 'coalition of the willing' put Palestine on their list, and pull an Afghanistan on them.\n \n Unfortunately, Hamas has never wavered from their stance concerning Israel, nor have renounced terrorism, so I'm very concerned with the state of the region.", 
   {}, 
   195388, 
   null, 
   1138551960.0
  ], 
  [
   195408, 
   null, 
   "georged", 
   "Once you batter your way thought the hubris, the options seem pretty clear to me.\n \n Either Hamas renounces violence and pledges to seek non-violent methods of resolution, or the 'coalition of the willing' put Palestine on their list, and pull an Afghanistan on them.\n\n \n Tough for any government to preach non-violent resolution to the populace when part of your country is occupied by a neighbor using military force and that neighbor is fully financed and supplied by the world bully.", 
   {}, 
   195388, 
   null, 
   1138554120.0
  ], 
  [
   195464, 
   null, 
   "Wez", 
   "The Palestinians voted for Hamas so an invasion becomes all but impossible. An invading army will be getting constant attacks until most Palestinians are dead. The troop casualties/civilian would far outweigh any good that could come from it.\n \n -Wez", 
   {}, 
   195408, 
   null, 
   1138574820.0
  ], 
  [
   195468, 
   null, 
   "georged", 
   "The Palestinians voted for Hamas so an invasion becomes all but impossible. An invading army will be getting constant attacks until most Palestinians are dead. The troop casualties/civilian would far outweigh any good that could come from it.\n \n -Wez\n\n \n Ties in nicely with Iran making a nuke deal with Russia and preparing to discontinue USD as sole oil currency, as Russia has done. All that's left is China putting more float into the Yuan to drive USD down and US interest rates up. Bin Laden has to be laughing his turban off.", 
   {}, 
   195464, 
   null, 
   1138576260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Power of Democracy - Hamas wins", 
  "url": "http://www.4forums.com/political/peace-middle-east/7447-power-democracy-hamas-wins.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 7447, 
  "discussion_files": [
   [
    "17517.html", 
    "http://www.4forums.com/political/peace-middle-east/7447-power-democracy-hamas-wins-print.html"
   ], 
   [
    "17518.html", 
    "http://www.4forums.com/political/peace-middle-east/7447-power-democracy-hamas-wins-2-print.html"
   ]
  ], 
  "identifier": 7447
 }
]