[
 [
  [
   195025, 
   null, 
   "ThunderMelody", 
   "If a man sneaks into a house in the dead of night with a gun, the owner of the house has every right to protect himself, even if that means killing the trespasser if the owner feels his life is threatened. Why is it then that this right to kill our aggressors in self defense should end with our lives? To me, it only seems logical that if we have the right to defend ourselves and our families from a violent criminal before they kill us, then the government most certainly has a duty to defend our families and the people in a community by killing this man after my death. If anything, the man has not only committed a much more dire crime now, but has also become a much more dangerous villain by committing murder. The death penalty is the only just punishment for their actions. When a person commits a crime, the Judicial system is responsible for determining a proportional response or penalty for the crime. By not giving the death penalty to a slaughtering murderer, we are telling the world that the life of this murderer is worth more than that of his victim. No amount of jail time can ever make up for life lost when a nine year old girl such as Jessica Lunsford is raped and murdered by being buried alive. The only true justice in a case such as this is to have the criminal lay down what is left of his tainted life in hopes that he can begin to repay his crime against humanity. Some may say that we must find mercy in our hearts to forgive these transgressors of the law, but as Dr. Don Boys, a former editorialist for USA TODAY, said, \"\"Mercy you get from God; from the courts you expect justice.\"\n \n The arguments that those against the death penalty have derived are now on the verge of becoming absurd. In the most recent protest against the death penalty, Snoop Dog pledged that \"Tooky is our Martin Luther King.\" He was referencing a man who was put to death for slaughtering four innocent people, and when asked why he killed one white man, he responded \"Because he was white and I was killing all white people.\" Is that a man who reminds you of Martin Luther King? \n \n Some have claimed that the death penalty is culturally biased towards black people. However, anyone who takes the time to look over statistics publicly provided by the US Department of Justice will find that of 59 inmates executed last year, 36 were white and 19 were black, and of the total inmates on death row, 1,851 are white while only 1,390 were black. \n \n Others have said that the death penalty is biblically wrong. However I challenge you to read two passages from Exodus. One says \"You shall not murder. (Exodus 20:13)\" and the other says \"Anyone who strikes a man and kills him shall surely be put to death.\" (Exodus 21:12). You can quote the Bible back and forth all day, but there is no defining argument for or against the death penalty, so ultimately it should not be consulted. \n \n There are also people who will tell you that the death penalty actually kills innocent people. However, since the death penalty was reinstated in 1973 122 inmates have been exonerated from death row, but never has anyone come even close to proving that an innocent man was killed. Considering that the average inmate serves 11years and 2 months in jail before being executed, this tells me that the government is doing their job in researching each case before the person is executed and are actually catching their own mistakes. \n \n Another myth is that the death penalty is handed out like candy. In the middle of 2004, there were 713,990 inmates in prison. Of that number only 3,315 were on death row, and only 59 inmates were executed. That means only .4% of all inmates in the judicial system are given the death penalty. That means the amount actually put to death is less than .008%. The death penalty is ultimately a rare and carefully chosen sentence reserved for only the worst crimes. \n \n The final argument against the death penalty is that it is inhumane. Now think about the following: A women returning to her home is abducted by three men, beaten, gang-raped, shot in the head, and then forced under water repeatedly until she drowns. A woman in a prison ministry program helps get a man out on parole, and then he rapes her, sodomizes her, and strangles her with a cord. A baby is killed by severing her arms from her body. The inmate on the other hand merely dies in his sleep. Which one seems inhumane to you? As Alphonse Karr, a 19th century journalist for Le Figaro, once said, \"If we are to abolish the death penalty, I should like to see the first step taken by my friends the murderers.\"", 
   {
    "post_info": {
     "post_title": "Pro Death Penalty Commentary"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1138339560.0
  ], 
  [
   195028, 
   null, 
   "Dono", 
   "..... this tells me that the government is doing their job in researching each case before the person is executed and are actually catching their own mistakes. \n\n This subject has been debated over and over here without one mind being changed. I did find the above comment amusing.\n Dono", 
   {}, 
   195025, 
   null, 
   1138352820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Pro Death Penalty Commentary", 
  "url": "http://www.4forums.com/political/crime-debates/7451-pro-death-penalty-commentary.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 7451, 
  "discussion_files": [
   [
    "21167.html", 
    "http://www.4forums.com/political/crime-debates/7451-pro-death-penalty-commentary-print.html"
   ]
  ], 
  "identifier": 7451
 }
]