[
 [
  [
   195146, 
   null, 
   "MrWriteLA", 
   "Human rights organisations are protesting a decision by the Bush administration to back a measure introduced by Iran denying two gay rights groups a voice at the United Nations.\n \n In a vote Monday, the United States supported Iran's recommendation to deny consultative status at the United Nations' Economic and Social Council (ECOSOC) to the Danish National Association for Gays and Lesbians and the International Lesbian and Gay Association, based in Belgium.\n \n Among countries with which the United States sided were Cuba, Sudan and Zimbabwe, nations the State Department has cited in annual reports for their harsh treatment of homosexuals. \n http://www.gcn.ie/content/templates/newsupdate.aspx?articleid=519&zoneid=4\n \n Gee, don't it make you proud to know whose side you're on?", 
   {
    "post_info": {
     "post_title": "US sides with Iran, Zimbabwe, Cuba, and Sudan against gays"
    }
   }, 
   null, 
   null, 
   1138408740.0
  ], 
  [
   195153, 
   null, 
   "BobNelson2", 
   "http://www.gcn.ie/content/templates/newsupdate.aspx?articleid=519&zoneid=4\n \n Gee, don't it make you proud to know whose side you're on?\n\n \n Well, it certainly is where this administration belongs.", 
   {}, 
   195146, 
   null, 
   1138415220.0
  ], 
  [
   195156, 
   null, 
   "jyoshu", 
   "Hmm . . . Not that it's necessarily a good excuse, but I wonder if this has anything to do with diplomatic relations with Iran in the context of nuclear arms. Unfortunately, I can't find anything on this anywhere that's not from a gay rights or far left news source. Also, does anyone know what the real implications are, here? Is the loss of 2 European organizations' consultation status to the UN something that really matters that much, and if so, in what ways? Not saying it doesn't, just wondering about specifics.", 
   {}, 
   195153, 
   null, 
   1138415820.0
  ], 
  [
   195162, 
   null, 
   "BobNelson2", 
   "Hmm . . . Not that it necessarily a good excuse, but I wonder if this has anything to do with diplomatic relations with Iran in the context of nuclear arms. Unfortunately, I can't find anything on this anywhere that's not from a gay rights or far left news source. Also, does anyone know what the real implications are, here? Is the loss of 2 European organizations' consultation status to the UN something that really matters that much, and if so, in what ways? Not saying it doesn't, just wondering about specifics.\n\n \n If you can't find anything about IGLA and its fight to join the UN group of NGOs then your googling skills are lacking. There's some juicy stuff in there that I'm sure you'll enjoy exploiting...", 
   {}, 
   195156, 
   null, 
   1138416420.0
  ], 
  [
   195164, 
   null, 
   "jyoshu", 
   "If you can't find anything about IGLA and its fight to join the UN group of NGOs then your googling skills are lacking. There's some juicy stuff in there that I'm sure you'll enjoy exploiting...\n\n \n Why would I want to \"exploit\" anything? What's your problem, anyway?\n \n Anyhow, I did find a list of all the NGOs with consultative status to the UN, and I couldn't find any gay-rights interest groups on the list. With that in mind, and considering that there are places on earth where gays are truly persecuted for their actions, then consultative status to the UN would be a good idea. So, I agree with you.", 
   {}, 
   195162, 
   null, 
   1138417140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  US sides with Iran, Zimbabwe, Cuba, and Sudan against gays", 
  "url": "http://www.4forums.com/political/gay-rights-debates/7455-us-sides-iran-zimbabwe-cuba-sudan-against-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 7455, 
  "discussion_files": [
   [
    "3741.html", 
    "http://www.4forums.com/political/gay-rights-debates/7455-us-sides-iran-zimbabwe-cuba-sudan-against-gays-print.html"
   ]
  ], 
  "identifier": 7455
 }
]