[
 [
  [
   195189, 
   null, 
   "Bassman", 
   "German firm drops Falls as site for 1,000 new jobs \n \n By SHARON LINSTEDT\n News Staff Reporter\n 1/20/2006\n \n <http://www.buffalonews.com<\n \nA German chemical company, which was considering Western New York for a $620 million project that would have brought 1,000 new jobs to the region, is looking elsewhere after failing to obtain guarantees on cheap hydropower.\n \n Munich-based Wacker Chemie AG, which had put a 300-acre site in Niagara County on its short list for development of a new U.S. manufacturing facility, walked away from the negotiating table last week over the power issue, according to Thomas A. Kucharski, president of Buffalo Niagara Enterprise.\n \n \"They needed a guarantee that they would be able to get 70 megawatts of low-cost power by 2009, and we couldn't find anyone in New York State that could provide that commitment,\" Kucharski said. \"It's just mind-boggling and very frustrating.\"\n \n The BNE had hoped to offer Wacker a block of low-cost power at a rate just over 3 cents per kilowatt as part of an incentive package. That would be a dramatic savings over the typical cost range of 11 to 16 cents per kilowatt.\n \n Wacker was able to obtain written commitments for cheap power from the four other locales on its short list, a list believed to include one site in Canada and three in the southeastern United States.\n \n Buffalo Niagara Partnership President Andrew J. Rudnick echoed Kucharski's frustration when he went public on the Wacker situation Thursday as part of an update on the 5-year-old \"Buffalo Niagara Now!\" business development initiative.\n \n \"This was an extraordinary situation that required an extraordinary response, and we couldn't give it,\" Rudnick said of the behind-the-scenes effort to lure Wacker to Western New York.\n \n Rudnick said local economic development executives were in contact with the New York State Power Authority, Gov. George E. Pataki's office, the Empire State Development Corp., as well as state and federal lawmakers, but could not secure a formal guarantee on a power allocation for the project.\n \n \"We knew going in that this was a big ask, a huge amount of power, but the bottom line is we couldn't find someone to say \"yes' or \"no.' This was a major economic opportunity, and we were left hanging,\" Rudnick said.\n \n Brian Vittamo, the Power Authority's senior vice president for public and governmental affairs, disputes charges the Authority dropped the ball. \"We committed to 37 megawatts right now and made it clear the company could apply for more down the road. I'm sure this was put down in writing,\" Vittamo said.\n \n Vittamo also said Empire State Development was the lead agency on wooing Wacker, an effort that had been given the code name \"Project Bond.\" Representatives of the state development office declined to comment.\n \n A source familiar with efforts to attract Wacker to Niagara Falls said the state was prepared to offer the company an incentive package totaling more than $200 million, in addition to the power promise.\n \n Wacker is said to have shown strong interest in a 75-acre industrial site in the City of Niagara Falls, at the corner of 47th Street and Niagara Falls Boulevard. The parcel is adjacent to existing Praxair and Niacet operations, and is part of a 300-acre brownfields site.\n \n The family-owned German company has major facilities in Oregon and Michigan, as well as smaller manufacturing, sales and technical sites in California, Ohio, South Carolina, Kentucky and Iowa.\n \n Bill Toth, corporate spokesman for Wacker's U.S. division, declined to comment on the company's search for a new plant site. He said Wacker has not released any information regarding U.S. expansion plans.\n \n The 85-year-old company, which supplies silicon to the personal computer, telecommunications and electronics industry, has been rumored to be preparing for an initial public offering as early as this March in a bid to raise fresh capital. Wacker had earlier contemplated an IPO of its Siltronic unit, a maker of silicon wafers, to fund a major expansion of that business.\n \n Local development officials would not provide specific details on what type of plant Wacker plans to build, or how it would be financed. They expect Wacker to announce its expansion plans and the selected site late next month.\n\n Go figure? When a depressed region, such as Upstate New York are desperate for good jobs, the politicos in Albany and the Niagara Power Commission drop the ball, again, and again, and again.", 
   {
    "post_info": {
     "post_title": "New York State at its finest?  Yeah, Right :o)"
    }
   }, 
   null, 
   null, 
   1138427940.0
  ], 
  [
   195659, 
   null, 
   "jim's trucking", 
   "German firm drops Falls as site for 1,000 new jobs \n \n By SHARON LINSTEDT\n News Staff Reporter\n 1/20/2006\n \n <http://www.buffalonews.com<\n \n Go figure? When a depressed region, such as Upstate New York are desperate for good jobs, the politicos in Albany and the Niagara Power Commission drop the ball, again, and again, and again.\nWhy should the local utilities bolster German profits at their own cost? Tell the Germans to suck on their own utilities!\n \n It continually baffles me that people think new foreign companies should be given advantages over those who've been here paying taxes for decades.", 
   {}, 
   195189, 
   null, 
   1138659360.0
  ], 
  [
   195683, 
   null, 
   "Bassman", 
   "Wacker Chemical narrowed their selection to five sites, Niagara Falls being one. I have to disagree with you about where this company came from (Germany). Anytime you get a company willing to set up shop here, then it's a positive step. Especially when you consider that Upstate New York is seriously depressed.", 
   {}, 
   195659, 
   null, 
   1138667640.0
  ], 
  [
   195707, 
   null, 
   "georged", 
   "Isn't this a political subject?", 
   {}, 
   195683, 
   null, 
   1138677720.0
  ], 
  [
   195712, 
   null, 
   "JPSartre12", 
   "Wacker Chemical narrowed their selection to five sites, Niagara Falls being one. I have to disagree with you about where this company came from (Germany). Anytime you get a company willing to set up shop here, then it's a positive step. Especially when you consider that Upstate New York is seriously depressed.\n\n \n \n Let's see. 1000 new jobs at a cost of $200Million. That's $200,000,000/1000 =\n $200k/job. It sounds similar to the cost that WE ALL paid to keep steel mills in the US running. NO THANKS!!! :xbanghead :xcensored", 
   {}, 
   195683, 
   null, 
   1138678620.0
  ], 
  [
   195716, 
   null, 
   "georged", 
   "Let's see. 1000 new jobs at a cost of $200Million. That's $200,000,000/1000 =\n $200k/job. It sounds similar to the cost that WE ALL paid to keep steel mills in the US running. NO THANKS!!! :xbanghead :xcensored\n\n \n Ah, thread subject matter. I watched US cities and counties provide tax giveaways to US companies for relocation in the early-middle 1980s and pay the horrendous price of having their voters subsidize that cost. Now energy is the bargaining chip, as versus those days of free infrastructure and maintenance of same. Or now, maybe both?", 
   {}, 
   195712, 
   null, 
   1138679580.0
  ], 
  [
   195724, 
   null, 
   "Bassman", 
   "OK guys, what do you suggest we as a region do? Open up more tourist attractions? More artsy-type boutiques?", 
   {}, 
   195716, 
   null, 
   1138683780.0
  ], 
  [
   195730, 
   null, 
   "Maineiac", 
   "I believe the deal killer was a power grid problem. The New York Power Authority either couldn't pull power from another grid, or it wasn't cost effective to upgrade their capacity to sell cheap power to Wacker Chemical, when they could divert that same power elsewhere for a bigger profit.", 
   {}, 
   195724, 
   null, 
   1138686540.0
  ], 
  [
   195734, 
   null, 
   "JPSartre12", 
   "I believe the deal killer was a power grid problem. The New York Power Authority either couldn't pull power from another grid, or it wasn't cost effective to upgrade their capacity to sell cheap power to Wacker Chemical, when they could divert that same power elsewhere for a bigger profit.\n\n \n Wouldn't we all love it if Uncle Sam subsidized our houses with cheap electricity and property tax breaks? While we're at it, how about free gas, too? emoticon_xgood emoticon_xgood", 
   {}, 
   195730, 
   null, 
   1138687980.0
  ], 
  [
   195779, 
   null, 
   "georged", 
   "OK guys, what do you suggest we as a region do? Open up more tourist attractions? More artsy-type boutiques?\n\n \n Anything that's a specialty service industry, which puts you on your own. The only thing dependable about a regional or state effort for anything is their requirement for tax money. \n \n Incidentally, old school conservatives despise government government give-away programs like the one that disappointed you in not providing tax subsided jobs.", 
   {}, 
   195724, 
   null, 
   1138725240.0
  ], 
  [
   197723, 
   null, 
   "Caprii", 
   "New York State has an archaic way of thinking. NY in my opinion was a leading state, but the last 25 years while many other states are booming, New York is becoming more depressed in upstate region, and in the metro area, NYC population has remained the same for the last 2 decades, with an unprecedented illegal population, contributing to the decay and deterioration of a way of life. Where a brownstone used to house a single family, now houses 20 individuals. Where the term row houses was common is now called row rooms. For example, a house in Queens will be set up where you walk in the door and all you see is a re-designed narrow hallway, barely missing your shoulders as you walk down it, and down this hallway you see doors on your left and right as if it was a hotel, and behind these doors is somebody's \"apartment\" one small room, that houses a bed and not much room for anything else. A community bathroom is usually down the hall. These rooms each go for about 200.00 a week depending on the house and room size, multiply this by millions and this is what NYC has become. Where the mayors, now and past, turn a blind eye to many violations, illegal working and living violations, and the quality of life suffers.\n \n Upstate New York sometimes its hard to believe its the same State. A state rich in heritage, the birth of womens' rights began there, also NY had the first \"white house\" NY had so much, but now is losing so much by not changing with the times. The cost to do business in NY is not reasonable, even the NY Jets and Giant knew that, where else, can a NY team be housed in another state and still be called NY...only in NY. I don't care what anyone says they are NJ Jets and NJ Giants. Heck, let them go to Idaho, and we'll still let them call themselves NY Giants and Jets. \n \n So many opportunties NY can have but they waste many opportunities because of their stone-age mentality. I read an article where many northeastern residents are leaving in droves to the south like the carolinas, florida and arizona, and nevada, to escape the high housing market, low-paying jobs, and high property taxes, while those in the california area are also flocking to the mid-west for the same reasons.\n \n If NY wants to compete, they better become competitive.", 
   {}, 
   195779, 
   null, 
   1139632560.0
  ], 
  [
   197727, 
   null, 
   "JPSartre12", 
   "New York State has an archaic way of thinking. NY in my opinion was a leading state, but the last 25 years while many other states are booming, New York is becoming more depressed in upstate region, and in the metro area, NYC population has remained the same for the last 2 decades, with an unprecedented illegal population, contributing to the decay and deterioration of a way of life. Where a brownstone used to house a single family, now houses 20 individuals. Where the term row houses was common is now called row rooms. For example, a house in Queens will be set up where you walk in the door and all you see is a re-designed narrow hallway, barely missing your shoulders as you walk down it, and down this hallway you see doors on your left and right as if it was a hotel, and behind these doors is somebody's \"apartment\" one small room, that houses a bed and not much room for anything else. A community bathroom is usually down the hall. These rooms each go for about 200.00 a week depending on the house and room size, multiply this by millions and this is what NYC has become. Where the mayors, now and past, turn a blind eye to many violations, illegal working and living violations, and the quality of life suffers.\n \n Upstate New York sometimes its hard to believe its the same State. A state rich in heritage, the birth of womens' rights began there, also NY had the first \"white house\" NY had so much, but now is losing so much by not changing with the times. The cost to do business in NY is not reasonable, even the NY Jets and Giant knew that, where else, can a NY team be housed in another state and still be called NY...only in NY. I don't care what anyone says they are NJ Jets and NJ Giants. Heck, let them go to Idaho, and we'll still let them call themselves NY Giants and Jets. \n \n So many opportunties NY can have but they waste many opportunities because of their stone-age mentality. I read an article where many northeastern residents are leaving in droves to the south like the carolinas, florida and arizona, and nevada, to escape the high housing market, low-paying jobs, and high property taxes, while those in the california area are also flocking to the mid-west for the same reasons.\n \n If NY wants to compete, they better become competitive.\n\n \n How do you expect NYC to turn around when it's become a haven for liberals whose only solution is to increase taxation on the wealthy in order to subsidize the poor? Carperbaggers like Hillary Clinton don't give a damn about NY's economic health. They're only interested in having the title \"Senator-NY\" on their resume as they use it as a stepping stone for bigger ambitions.", 
   {}, 
   197723, 
   null, 
   1139634480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New York State at its finest?  Yeah, Right :o)", 
  "url": "http://www.4forums.com/political/economics-debates/7459-new-york-state-its-finest-yeah-right-o.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 7459, 
  "discussion_files": [
   [
    "32521.html", 
    "http://www.4forums.com/political/economics-debates/7459-new-york-state-its-finest-yeah-right-o-print.html"
   ]
  ], 
  "identifier": 7459
 }
]