[
 [
  [
   195700, 
   null, 
   "Liminus", 
   "http://news.independent.co.uk/world/politics/article341967.ece\n \n \nThe most potent threats to life on earth - global warming, health pandemics, poverty and armed conflict - could be ended by moves that would unlock $7 trillion - $7,000,000,000,000 (£3.9trn) - of previously untapped wealth, the United Nations claims today....\n \n At the heart of the proposal, unveiled at a gathering of world business leaders at the Swiss ski resort of Davos, is a push to get countries to account for the cost of failed policies, and use the money saved \"up front\" to avert crises before they hit. Top of the list is a challenge to the United States to join an international pollution permit trading system which, the UN claims, could deliver $3.64trn of global wealth....\n \n In an endorsement of the report, Mr Brown said: \"This shows how we can equip people and countries for a new global economy that combined greater prosperity and fairness both within and across nations.\"\n \n The UNDP says rich countries should build on this and go further. It proposes six schemes to harness the power of the markets:\n * Reducing greenhouse gas emissions through pollution permit trading; net gain $3.64trn.\n * Cutting poor countries' borrowing costs by securing the debts against the income from stable parts of their economies; net gain $2.90trn.\n * Reducing government debt costs by linking payments to the country's economic output; net gain $600bn.\n * An enlarged version of the vaccine scheme; net gain (including benefits of lower mortality) $47bn.\n * Using the vast flow of money from migrants back to their home country to guarantee; net gain $31bn.\n * Aid agencies underwriting loans to market investors to lower interest rates; net gain $22bn....\n \n But - and the UN admits it is a big \"but\" - the US would have to sign up to Kyoto and carbon trading to achieve the $3.64trn that it believes the system would deliver over time.....\n \n Andrew Simms, director of the New Economics Foundation, said it left unanswered questions over how these markets would be managed and how the benefits and costs would be distributed. \"We have nothing against markets so it would be missing the point to get into a pro- or anti-market stance. The point is how you distribute the benefits.\"......\n\n \n Any thoughts?", 
   {
    "post_info": {
     "post_title": "UN unveils $7 trillion plan to save the world?"
    }
   }, 
   null, 
   null, 
   1138675140.0
  ], 
  [
   195725, 
   null, 
   "Bassman", 
   "Once again, third world thugs trying to tell us what to do.", 
   {}, 
   195700, 
   null, 
   1138683960.0
  ], 
  [
   195752, 
   null, 
   "Iuris", 
   "That's right. We've already got our own first world thugs and they're doing the job just fine, right?\n \n The very idea of third world thugs coming from an American sounds rather ridiculous. What are they going to do?", 
   {}, 
   195725, 
   null, 
   1138698720.0
  ], 
  [
   195767, 
   null, 
   "Liminus", 
   "Once again, third world thugs trying to tell us what to do.\n\n \n From the article, which I assume you read:\n \n \nThe scheme, which is backed by the UK, France, Italy, Spain, Sweden and the Bill and Melinda Gates Foundation, was born out of a proposal by Gordon Brown for a larger scheme to double the total aid budget to $100bn a year.\n\n \n If you have some criticism of the sceme in terms of its implementation and effectiveness, I'm happy to hear it, but please check your facts before making unsupported assertions.", 
   {}, 
   195725, 
   null, 
   1138721400.0
  ], 
  [
   195771, 
   null, 
   "jyoshu", 
   "You'd think by now the UN would get the picture that the US is not going to sign the Kyoto treaty. They should be working on a plan under the assumption that we won't rather than depending on something that isn't going to happen. \n \n I like the fact the UN carries out humanitarian work, but when it comes to making decisions the UN is pretty much there to make little countries feel like they have some influence. It lost too much credibility in the way it handled Iraq for many people to take it seriously.", 
   {}, 
   195767, 
   null, 
   1138722720.0
  ], 
  [
   195813, 
   null, 
   "Wez", 
   "I like the fact the UN carries out humanitarian work, but when it comes to making decisions the UN is pretty much there to make little countries feel like they have some influence. It lost too much credibility in the way it handled Iraq for many people to take it seriously.\n\n If the UN lost credibility due to Iraq, what exactly did the Bush administration lose (with regards to WMDs...)?\n \n -Wez", 
   {}, 
   195771, 
   null, 
   1138735860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  UN unveils $7 trillion plan to save the world?", 
  "url": "http://www.4forums.com/political/current-events-debates/7482-un-unveils-7-trillion-plan-save-world.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7482, 
  "discussion_files": [
   [
    "27724.html", 
    "http://www.4forums.com/political/current-events-debates/7482-un-unveils-7-trillion-plan-save-world-print.html"
   ]
  ], 
  "identifier": 7482
 }
]