[
 [
  [
   196404, 
   null, 
   "Matthew S", 
   "My ideal society is one in which religion is left at the church and home doorstep. Where evryone is free to have their beliefs about whatever but where everyone is free to not have to listen to view religious propaganda if they don't want to. Where everyone is and would be free of laws the expounded religious values. One where everyone would just mind their own business.", 
   {
    "post_info": {
     "post_title": "My ideal society"
    }
   }, 
   null, 
   null, 
   1138977780.0
  ], 
  [
   196407, 
   null, 
   "Jo Bennett", 
   "Right, so only secularists and atheists should be allowed to prosyletise? Nice... how about everyone be allowed to say what they like, so long as it doesn't promote hatred or violence?", 
   {}, 
   196404, 
   null, 
   1138980240.0
  ], 
  [
   196410, 
   null, 
   "billsco", 
   "My ideal society is one in which religion is left at the church and home doorstep. Where evryone is free to have their beliefs about whatever but where everyone is free to not have to listen to view religious propaganda if they don't want to. Where everyone is and would be free of laws the expounded religious values. One where everyone would just mind their own business.\n\n \n I can only make sense of two of your four sentences. Let me ask for clarification sake, why are you a self-proclaimed gay crusader but wishing everyone else keep their opinions private?", 
   {}, 
   196404, 
   null, 
   1138981020.0
  ], 
  [
   196435, 
   null, 
   "georged", 
   " how about everyone be allowed to say what they like, so long as it doesn't promote hatred or violence?\n\n \n You're not giving US foreign policy much to say.", 
   {}, 
   196407, 
   null, 
   1138986600.0
  ], 
  [
   196438, 
   null, 
   "Obvious Child", 
   "My ideal society is one in which religion is left at the church and home doorstep. Where evryone is free to have their beliefs about whatever but where everyone is free to not have to listen to view religious propaganda if they don't want to. Where everyone is and would be free of laws the expounded religious values. One where everyone would just mind their own business.\nSo you support a situation where kids are entirely under the religious control of their parents and have no other influences?", 
   {}, 
   196404, 
   null, 
   1138986720.0
  ], 
  [
   196524, 
   null, 
   "Bassman", 
   "My ideal society is one in which religion is left at the church and home doorstep. Where evryone is free to have their beliefs about whatever but where everyone is free to not have to listen to view religious propaganda if they don't want to. Where everyone is and would be free of laws the expounded religious values. One where everyone would just mind their own business.\n\n Where this philosophy is greatly flawed is that religion influences every part of people's lives. Therefore, the natural consequence is that it permiates the marketplace of ideas.", 
   {}, 
   196404, 
   null, 
   1139002980.0
  ], 
  [
   196555, 
   null, 
   "jitobear", 
   "My ideal society is one in which religion is left at the church and home doorstep. Where evryone is free to have their beliefs about whatever but where everyone is free to not have to listen to view religious propaganda if they don't want to. Where everyone is and would be free of laws the expounded religious values. One where everyone would just mind their own business.\n\n \n Won't happen. In a free society you are gonna be stuck hearing other people's stupid ideas and they your's. However, it is not unreasonable to demand that your life not be molded by the regulations of faith you do not share.", 
   {}, 
   196404, 
   null, 
   1139008920.0
  ], 
  [
   196609, 
   null, 
   "Matthew S", 
   "Won't happen. In a free society you are gonna be stuck hearing other people's stupid ideas and they your's. However, it is not unreasonable to demand that your life not be molded by the regulations of faith you do not share.\n\n \n True you are right. I just wish people would mind their own business", 
   {}, 
   196555, 
   null, 
   1139025060.0
  ], 
  [
   196631, 
   null, 
   "Ooaman", 
   "True you are right. I just wish people would mind their own business\n\n So are you saying that this is the only thing you really want? The other stuff works but people minding their own business is really the only thing you want? I'm just curious about something, Matthew? Let say this was the society you wish it were. Let's say there was a conversation that went something like this...\n Matthew S:\n \nI'm gay.\n\n Someone else:\n \nSo what, I got a beer belly and I don't even drink (or something.)\n\n Okay, basically, I'm wondering if you would know what to do if people actually cared less.", 
   {}, 
   196609, 
   null, 
   1139035440.0
  ], 
  [
   196634, 
   null, 
   "Master_Shake", 
   "Okay, basically, I'm wondering if you would know what to do if people actually cared less.\n\n Good friggin point. I wonder the same thing.", 
   {}, 
   196631, 
   null, 
   1139037000.0
  ], 
  [
   196658, 
   null, 
   "Matthew S", 
   "\n \n Okay, basically, I'm wondering if you would know what to do if people actually cared less.\n\n \n \n Isn't the point, about the whole gay debate in the country, that people have gone out of their way to make laws that effect gays and lesbians. Whereas if they just minded their own business there would be no laws that effect us. It is not just the gay issues either the whole reality TV industry is built on people butting in on other peoples lives.\n \n Yes I want to live in a society where religion is a private family matter. Where when you leave the church you leave religious dogma behind. I am not saying I am for people being forced not to live their lives by their religious beliefs. I am saying that no one should be forced to live by someone elses religious beliefs. Why can't we just have a live and let live society when it comes to religion.", 
   {}, 
   196631, 
   null, 
   1139055540.0
  ], 
  [
   197718, 
   null, 
   "Ooaman", 
   "Isn't the point, about the whole gay debate in the country, that people have gone out of their way to make laws that effect gays and lesbians. Whereas if they just minded their own business there would be no laws that effect us. It is not just the gay issues either the whole reality TV industry is built on people butting in on other peoples lives.\n\n Frankly, I don't know about many other people, but I think sometimes, I would be happier not knowing some personal things about others. (Along with being happier if there were no reality TV shows either.) But if more people actually cared less, would it shock you? I'm not sure if it will ever happen, I was mainly wondering if more people having a lack in the personal lives of others would shock you?\n \nYes I want to live in a society where religion is a private family matter. Where when you leave the church you leave religious dogma behind. I am not saying I am for people being forced not to live their lives by their religious beliefs. I am saying that no one should be forced to live by someone elses religious beliefs. Why can't we just have a live and let live society when it comes to religion.\n\n Because we have a lot of different religions (or break-offs of the same religions; ie Baptist, Lutheren, Discipals Of Christ, Pentacostal, Catholic are all part of the Christian religion) believing their religion is the only right religion. Most of the time (okay, mostly between Catholics and Protestants and that's mostly over in Europe but I've heard so many damn times about it over here (of which I myself have become a victum)) there are arguments just with in the same core religion. There is no way we could have that kind of society when we do have that kind of relationship just among most of the same core religion.\n \n Did that make any sence or did I ramble?", 
   {}, 
   196658, 
   null, 
   1139631240.0
  ], 
  [
   197720, 
   null, 
   "Matthew S", 
   "\n \n Because we have a lot of different religions (or break-offs of the same religions; ie Baptist, Lutheren, Discipals Of Christ, Pentacostal, Catholic are all part of the Christian religion) believing their religion is the only right religion. Most of the time (okay, mostly between Catholics and Protestants and that's mostly over in Europe but I've heard so many damn times about it over here (of which I myself have become a victum)) there are arguments just with in the same core religion. There is no way we could have that kind of society when we do have that kind of relationship just among most of the same core religion.\n \n Did that make any sence or did I ramble?\n\n \n \n You made sence.\n I just think sometimes \"It isn't easy being green\"", 
   {}, 
   197718, 
   null, 
   1139631540.0
  ], 
  [
   197758, 
   null, 
   "Easyrider", 
   " I just wish people would mind their own business\n\n \n ...and keep their gay proclivities to themselves and not broadcast that they're gay or push it down the throats of everyone else.", 
   {}, 
   196609, 
   null, 
   1139667720.0
  ], 
  [
   197768, 
   null, 
   "Jo Bennett", 
   "...and keep their gay proclivities to themselves and not broadcast that they're gay or push it down the throats of everyone else.\n\n \n Well, when you stop broadcasting that you're not gay then you might have a point.", 
   {}, 
   197758, 
   null, 
   1139674920.0
  ], 
  [
   197801, 
   null, 
   "Easyrider", 
   "Well, when you stop broadcasting that you're not gay then you might have a point.\n\n \n We were talking about Matthew's ideal society, Bennett, not mine. He should follow his own advice. And being the left wing, anything goes supporter of that folly you should pony up and help him out on that.", 
   {}, 
   197768, 
   null, 
   1139688840.0
  ], 
  [
   197831, 
   null, 
   "Jo Bennett", 
   "We were talking about Matthew's ideal society, Bennett, not mine. He should follow his own advice. And being the left wing, anything goes supporter of that folly you should pony up and help him out on that.\n\n \n Perhaps you should take your own advice about making up lies about people's position. I believe that homosexuality is not forbidden by God, under the same restrictions that heterosexuality is permitted, ie in a lifelong, monogamous relationship built on love and trust. I believe that, as with heterosexuals, God forgives those who engage in relationships that do not fit this model but repent and stop taking part in them.", 
   {}, 
   197801, 
   null, 
   1139698800.0
  ], 
  [
   197899, 
   null, 
   "Easyrider", 
   " I believe that, as with heterosexuals, God forgives those who engage in relationships that do not fit this model but repent and stop taking part in them.\n\n \n Thank you. I agree.", 
   {}, 
   197831, 
   null, 
   1139763780.0
  ], 
  [
   197924, 
   null, 
   "DamEtel", 
   "...and keep their gay proclivities to themselves and not broadcast that they're gay or push it down the throats of everyone else.\n\n \n Easyrider, are you saying that you want gay men to stop shoving it down your throat?", 
   {}, 
   197758, 
   null, 
   1139777220.0
  ], 
  [
   197927, 
   null, 
   "JPSartre12", 
   "Perhaps you should take your own advice about making up lies about people's position. I believe that homosexuality is not forbidden by God, under the same restrictions that heterosexuality is permitted, ie in a lifelong, monogamous relationship built on love and trust. I believe that, as with heterosexuals, God forgives those who engage in relationships that do not fit this model but repent and stop taking part in them.\n\n \n So, in your opinion, if a gay person stops engaging in gay relationships and repents, he'll go to Heaven? I can agree with that interpretation.emoticon_xgood", 
   {}, 
   197831, 
   null, 
   1139778000.0
  ], 
  [
   197941, 
   null, 
   "Jo Bennett", 
   "So, in your opinion, if a gay person stops engaging in gay relationships and repents, he'll go to Heaven? I can agree with that interpretation.emoticon_xgood\n\n \n No, you didn't read what I said. I said that I believe that God requires relationships that are monogamous, lifelong and built on love and trust. I do not see how this excludes gay people, unless you're trying to suggest that gay people are incpable of such relationships?", 
   {}, 
   197927, 
   null, 
   1139784240.0
  ], 
  [
   197944, 
   null, 
   "hinata", 
   "No, you didn't read what I said. I said that I believe that God requires relationships that are monogamous, lifelong and built on love and trust. I do not see how this excludes gay people, unless you're trying to suggest that gay people are incpable of such relationships?\n\n \n I hate it when people speak for God when they obviously haven't read His Word. Here's what GOD says about homosexuality.\n \n Leviticus 18:22 \"'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n 1 Corinthians 6:9 \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders\"\n \n And there are more Scriptures that I just can't remember. Marriage is for a man and a woman in God's sight. Not a man and a man or a woman and a woman. If you read God's Word, then you can speak for God.", 
   {}, 
   197941, 
   null, 
   1139786220.0
  ], 
  [
   197952, 
   null, 
   "JPSartre12", 
   "No, you didn't read what I said. I said that I believe that God requires relationships that are monogamous, lifelong and built on love and trust. I do not see how this excludes gay people, unless you're trying to suggest that gay people are incpable of such relationships?\n\n \n Sorry, you lost me when you included gay relationships in your use of the term \"model\". Nowhere in the Bible is any form of homosexual relationship considered a \"model\" to emmulate, only monogamous heterosexual marriage.", 
   {}, 
   197941, 
   null, 
   1139789460.0
  ], 
  [
   197956, 
   null, 
   "Orion", 
   "Sorry, you lost me when you included gay relationships in your use of the term \"model\". Nowhere in the Bible is any form of homosexual relationship considered a \"model\" to emmulate, only monogamous heterosexual marriage.\n\n \n You will notice that Jo didn't make a reference to the Bible. Instead, he expressed the folowing...\n \n \nI said that I believe that God requires relationships that are monogamous, lifelong and built on love and trust. I do not see how this excludes gay people, unless you're trying to suggest that gay people are incpable of such relationships?\n", 
   {}, 
   197952, 
   null, 
   1139790660.0
  ], 
  [
   197959, 
   null, 
   "Jo Bennett", 
   "We have a guide in the Bible for how relationships should be. Despite the attempts of homophobes, there is no passage in the Bible that forbids those relationships being between two people of the same sex, even more definitely between two women. Couple this with the fact that there are many gay people who do not choose to be gay, and the view common the all Christians that God is responsible for how we enter the world, and the evidence provided by the Bible that the Christian God is love, and we have a mounting case to believe that Jesus will accept those who, in commitment, faith and love, enter into lifelong monogamous relationships with people of either gender. If you claim that God would make people who are solely attracted to people of the same gender, and yet call that attraction a sin (remember Jesus' words about looking on people in lust and committing adultery in ones heart), then you must consider that this does not seem to be the action of a God of love.", 
   {}, 
   197956, 
   null, 
   1139791320.0
  ], 
  [
   197966, 
   null, 
   "trebor", 
   "I hate it when people speak for God when they obviously haven't read His Word. Here's what GOD says about homosexuality.\n \n Leviticus 18:22 \"'Do not lie with a man as one lies with a woman; that is detestable.\"\n \n 1 Corinthians 6:9 \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders\"\n \n And there are more Scriptures that I just can't remember. Marriage is for a man and a woman in God's sight. Not a man and a man or a woman and a woman. If you read God's Word, then you can speak for God.\n\n \n \n Hum. How very odd. The word 'homosexual' did not exist until the 1850's.. so therefore, that term is reading into what the text said, rather than looking at the original text. \n \n HOw very deceitful of someone to claim it is there.", 
   {}, 
   197944, 
   null, 
   1139792820.0
  ], 
  [
   197968, 
   null, 
   "JPSartre12", 
   "We have a guide in the Bible for how relationships should be. Despite the attempts of homophobes, there is no passage in the Bible that forbids those relationships being between two people of the same sex, even more definitely between two women. \n\n This is simply not true. There are several Biblical condemnations of homosexuality. Read the story of Lott if you don't believe me. There are others as well.\n \n\n Couple this with the fact that there are many gay people who do not choose to be gay, and the view common the all Christians that God is responsible for how we enter the world, and the evidence provided by the Bible that the Christian God is love, and we have a mounting case to believe that Jesus will accept those who, in commitment, faith and love, enter into lifelong monogamous relationships with people of either gender. If you claim that God would make people who are solely attracted to people of the same gender, and yet call that attraction a sin (remember Jesus' words about looking on people in lust and committing adultery in ones heart), then you must consider that this does not seem to be the action of a God of love.\n\n \n God gave man free will and showed them the path. If they CHOOSE not to follow that path, they will suffer the consequences. God could have made man without a free will, but then how would he be able to discern the true believers from the non-believers?", 
   {}, 
   197959, 
   null, 
   1139793540.0
  ], 
  [
   197970, 
   null, 
   "jyoshu", 
   "We have a guide in the Bible for how relationships should be. Despite the attempts of homophobes, there is no passage in the Bible that forbids those relationships being between two people of the same sex\n\n \n I have to admit, I'm pretty flabergasted everytime I read someone make this claim. The Bible definitely forbids sex between people of the same sex--even many people who condone same-sex relationships admit the Bible says what it says. \n \n It would be better to simply admit disagreement with the Bible and live with that rather than trying to make it not say something that it clearly does.\n \n \nCouple this with the fact that there are many gay people who do not choose to be gay, and the view common the all Christians that God is responsible for how we enter the world, and the evidence provided by the Bible that the Christian God is love,\n \n . . . If you claim that God would make people who are solely attracted to people of the same gender, and yet call that attraction a sin (remember Jesus' words about looking on people in lust and committing adultery in ones heart), then you must consider that this does not seem to be the action of a God of love.\n\n \n That's not a recipe for God having mandated same-sex relationships. It's simply a realization that bad things exist in the world that God could keep from happening if He wanted . . . birth defects, genetic disposition toward alcohol, etc., etc., etc. If your logic held true and God would never allow anything unpleasant on people then many things in the world that happen to exist simply would not. There is no more reason to think that God could never allow people to be attracted to people of the same gender in a world that knows it's wrong than, say He would allow a person to grow up in an abusive home and turn to a life of crime. The point being of course, that no one ever said God was obligated to make us in a way that guarantees a trouble-free life.", 
   {}, 
   197959, 
   null, 
   1139794260.0
  ], 
  [
   197976, 
   null, 
   "Matthew S", 
   "I have to admit, I'm pretty flabergasted everytime I read someone make this claim. The Bible definitely forbids sex between people of the same sex--even many people who condone same-sex relationships admit the Bible says what it says. \n \n\n \n \n And here in lies the problem that many christians will not admit; no one in a secular society should be bound by laws based upon someonelses holy book. It doesn't and shouldn't matter what the bible says or doesn't say it should never be used as a guide book for the non christian to live his life by. Basicly who cares what the bible has to say.", 
   {}, 
   197970, 
   null, 
   1139796480.0
  ], 
  [
   197996, 
   null, 
   "trebor", 
   "This is simply not true. There are several Biblical condemnations of homosexuality. Read the story of Lott if you don't believe me. There are others as well.\n \n\n \n The story about Lott was not about homosexuality< it was about inhospitality to strangers. \n \n \n\n \n God gave man free will and showed them the path. If they CHOOSE not to follow that path, they will suffer the consequences. God could have made man without a free will, but then how would he be able to discern the true believers from the non-believers?\n\n \n Obviously, god is all knowing and all powerful. He would be able to do that because he knows everything... ergo facto, 'Free will' has another purpose.", 
   {}, 
   197968, 
   null, 
   1139800620.0
  ], 
  [
   198003, 
   null, 
   "DamEtel", 
   "I hate it when people speak for God when they obviously haven't read His Word. Here's what GOD says about homosexuality.\n \n Leviticus 18:22 \"'Do not lie with a man as one lies with a woman; that is detestable.\"\n\n \n I hate it when Christians say they believe the Bible, but clearly don't.\n \n Here is what God Himself has to say about it:\n \n \nIf a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death: their blood will be on their own heads.\n (Leviticus 20:13)\n \n\n \n So why aren't you out there killing gays? Their blood would not be on you, but on them ... Almighty God Himself says so!\n \n So? What's stopping you? God Himself has given you the Okay ... God Himself has given you the command.\n \n Are you a follower of God or not?\n \n \n \n PS: While you're at it, you might want to start up the witch hunts again, seeing as how God also said that you are not to suffer a witch to live.", 
   {}, 
   197944, 
   null, 
   1139801460.0
  ], 
  [
   198008, 
   null, 
   "jyoshu", 
   "It doesn't and shouldn't matter what the bible says or doesn't say it should never be used as a guide book for the non christian to live his life by. Basicly who cares what the bible has to say.\n\n \n Well, this IS the religion forum, which is where matters of religion (i.e. Bible) are discussed. This isn't an off-topic issue here at all.", 
   {}, 
   197976, 
   null, 
   1139802300.0
  ], 
  [
   198015, 
   null, 
   "Orion", 
   "My ideal society is one in which religion is left at the church and home doorstep. Where evryone is free to have their beliefs about whatever but where everyone is free to not have to listen to view religious propaganda if they don't want to. Where everyone is and would be free of laws the expounded religious values. One where everyone would just mind their own business.\n\n \n We're making progress, albeit at a snail's pace. But the progression is obvious and unmistakable. For example, we no longer burn witches at the stake or justify slavery using the Bible. We no longer view certain diseases as resulting from demonic possession nor do we consider homosexuality as a perversion deserving of medical treatment. We don't consider women to be subservient to men (a biblical concept) or that disobedient children should be stoned to death (another biblical concept). \n \n I believe with certainty that, within a few years, same-sex unions will become legitimized within American society. It's inevitable and it's already happening. And to whatever extent certain churches choose to adopt or not adopt such a policy is, to me, irrelevant. I suspect that, some day, our children will wonder why previous generations discriminated against gays to the same extent that today's children wonder why previous generations discriminated against blacks. This, too, is already happening. The key, I think, is education and awareness - 40 years ago, a sleepy and complacent America was forced to confront the reality of racial discrimination and then gender discrimination. In each such case, rear-guard, reactionary forces attempted to maintain the status quo. They failed. And with regard to gay civil rights, they will fail again.", 
   {}, 
   197768, 
   null, 
   1139805000.0
  ], 
  [
   198047, 
   null, 
   "hinata", 
   "So why aren't you out there killing gays? Their blood would not be on you, but on them ... Almighty God Himself says so!\n \n So? What's stopping you? God Himself has given you the Okay ... God Himself has given you the command.\n \n Are you a follower of God or not?\n \n\n \n That's the Old Testament. In the Old Testament, if you break one law you've broken them all. That's what the New Testament says. Plus, adulteresses were stoned. \n \n But in the new testament, in John 8:3-11, the Bible says, \"The teachers of the law and the Pharisees brought in a woman caught in adultery. They made her stand before the group and said to Jesus, \"Teacher, this woman was caught in the act of adultery. In the Law, Moses commanded us to stone such women. Now what do you say?\" They were using this question as a trap, in order to have a basis for accusing Him. \n \"But Jesus bent down and started to write on the ground with His finger. When they kept on questioning Him, He straightened up and said to them, \"If any one of you is without sin, let him be the first to throw a stone at her.\" Again he stooped down and wrote on the ground. At this, those who heard began to go away one at a time, the older ones first, until only Jesus was left, with the woman still standing there. Jesus straightened up and asked her, \"Woman, where are they? Has no one condemned you?\" \"No one, sir,\" she said. \"Then neither do I condemn you,\" Jesus declared. \"Go now and leave your life of sin.\"\n \n So we see that the punishments in the Law are no longer in effect now.:)", 
   {}, 
   198015, 
   null, 
   1139814720.0
  ], 
  [
   198053, 
   null, 
   "DamEtel", 
   "hinata: I hate it when people speak for God when they obviously haven't read His Word. Here's what GOD says about homosexuality.\n \n Leviticus 18:22 \"'Do not lie with a man as one lies with a woman; that is detestable.\"\n\n \n \nDamEtel: I hate it when Christians say they believe the Bible, but clearly don't.\n \n Here is what God Himself has to say about it:\n \n *****************************\n If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death: their blood will be on their own heads.\n (Leviticus 20:13)\n *****************************\n \n So why aren't you out there killing gays? Their blood would not be on you, but on them ... Almighty God Himself says so!\n \n So? What's stopping you? God Himself has given you the Okay ... God Himself has given you the command.\n \n Are you a follower of God or not?\n \n\n \n \nhinata: That's the Old Testament.\n\n \n Right, and you were the one who quoted the Old Testament first! If you hadn't relied on the Old Testament, I would not have responded! But YOU did, so I did.\n \n Now, since you opened this whole can of worms, tell us, don't you believe in what your God said in the Old Testament? Gee, I seem to remember being taught in church that God never changes. Oh wait, I just found YOU saying this too!\n \n \nProblem is: God doesn't change.\n\n \n From \n http://www.4forums.com/political/showthread.php?p=198056&posted=1#post198056\n \n \n Well, if God never changes, then He still wants you to kill gays, just as He commanded in the Old Testament!\n \n Or in our version of Christianity, is your God all wishy washy about His rules, changing from one day to the next what is and what is not punishable, and also contradict your statement that God doesn't change in the process?\n \n \nhinata: But in the new testament, in John 8:3-11, the Bible says, \"The teachers of the law and the Pharisees brought in a woman caught in adultery. They made her stand before the group and said to Jesus, \"Teacher, this woman was caught in the act of adultery. In the Law, Moses commanded us to stone such women. Now what do you say?\" They were using this question as a trap, in order to have a basis for accusing Him. \n \"But Jesus bent down and started to write on the ground with His finger. When they kept on questioning Him, He straightened up and said to them, \"If any one of you is without sin, let him be the first to throw a stone at her.\" Again he stooped down and wrote on the ground. At this, those who heard began to go away one at a time, the older ones first, until only Jesus was left, with the woman still standing there. Jesus straightened up and asked her, \"Woman, where are they? Has no one condemned you?\" \"No one, sir,\" she said. \"Then neither do I condemn you,\" Jesus declared. \"Go now and leave your life of sin.\"\n\n \n Uhm, you couldn't have picked too much WORSE of a proof text to try to make your point!\n \n You see, that cute little story is not in the oldest manuscripts: my NIV Bible says:\n \n\"The earliest manuscripts and many other ancient witnesses do not have John 7:53 - 8:11\"\n\n \n Do you think you can make your point using a \"valid\" quote from the New Testament! emoticon_xangel", 
   {
    "unicode_changes_made": true
   }, 
   198047, 
   null, 
   1139816460.0
  ], 
  [
   198065, 
   null, 
   "Jo Bennett", 
   "Time for some people to remember that they are dealing with translations of the Bible. There are plenty of different ways of understanding the Bible that don't include homophobia:\n http://www.whosoever.org/bible/", 
   {}, 
   198053, 
   null, 
   1139828640.0
  ], 
  [
   198068, 
   null, 
   "Obvious Child", 
   "Right, and you were the one who quoted the Old Testament first! If you hadn't relied on the Old Testament, I would not have responded! But YOU did, so I did.\n \n Now, since you opened this whole can of worms, tell us, don't you believe in what your God said in the Old Testament? Gee, I seem to remember being taught in church that God never changes. Oh wait, I just found YOU saying this too!\n \n Well, if God never changes, then He still wants you to kill gays, just as He commanded in the Old Testament!\n \n Or in our version of Christianity, is your God all wishy washy about His rules, changing from one day to the next what is and what is not punishable, and also contradict your statement that God doesn't change in the process?\nThe common Christian understanding, which it is incredible you have failed to grasp so far, is that actions remain wrong and remain punishable, but that the punishment has been laid on God himself as Christ when he died for our sins.\n \n \nUhm, you couldn't have picked too much WORSE of a proof text to try to make your point!\n \n You see, that cute little story is not in the oldest manuscripts: my NIV Bible says:\n \n Do you think you can make your point using a \"valid\" quote from the New Testament! emoticon_xangel\nYou seem to have switched from arguing based on the Bible to based on a more historical approach to reliable evidence about Jesus. But in any case, this episode also turns up in some manuscripts of other gospels. It seems to be part of a seperate oral tradition that eventually became part of John's gospel.\n \n @ Jo Bennet: I wasn't expecting that link to be all too convincing, but it seems to be. But doesn't Paul at least very much present marriage as man and woman?", 
   {
    "unicode_changes_made": true
   }, 
   198053, 
   null, 
   1139836920.0
  ], 
  [
   198070, 
   null, 
   "Jo Bennett", 
   "Paul and other biblical writers do tend to talk about marriage being between a man and a woman, but that's largely because the idea that gay couples could be stable in the same way as heterosexual ones was not one widely known, if at all, at the time. As a result a lot Christians who believe gay couples can have relationships believe that the relationship is not marriage as such, but a distinct relationship with similar characteristics. In many ways though, that is a technicality; what is important is a couple laying their relationship before God.", 
   {}, 
   198068, 
   null, 
   1139837820.0
  ], 
  [
   198120, 
   null, 
   "DamEtel", 
   "The common Christian understanding, which it is incredible you have failed to grasp so far, is that actions remain wrong and remain punishable, but that the punishment has been laid on God himself as Christ when he died for our sins.\n \n\n \n In 2006 BCE God wanted you to kill gays. \n \n But in 2006 CE God does not want you to kill gays?\n \n That's a change.", 
   {}, 
   198068, 
   null, 
   1139860980.0
  ], 
  [
   198280, 
   null, 
   "Obvious Child", 
   "In 2006 BCE God wanted you to kill gays. \n \n But in 2006 CE God does not want you to kill gays?\n \n That's a change.\nBut not a fundamental one. If we accept that the laws are against all homosexuality, which has been called into question by Jo, the position is:\n \n In 2006 BCE the wages of sin were death: homosexuals deserved to die\n \n In 2006 CE the wages of sin are death: homosexuals deserve to die\n \n Happily, that penalty has been taken on in the latter case by the death of Jesus Christ. Saying that this is a change is like saying someone no longer demanding money off you when it has been payed back on your account is changing their position. God sets the rules, which have stayed the same. How these rules effect us has been changed, but that follows from the nature of the rules.", 
   {}, 
   198120, 
   null, 
   1139924340.0
  ], 
  [
   198798, 
   null, 
   "hinata", 
   "Well, if God never changes, then He still wants you to kill gays, just as He commanded in the Old Testament!\n \n\n \n We're under a New Covenant. In other words, the New Testament. Just because God made a better promise to us now than before doesn't mean He changed. \n Actually, Paul scolds the Galatians for observing the Law. He says in Galatians 3:2, \"I would like to learn just one thing from you: Did you receive the Spirit by observing the Law, or by believing what you heard?\" \n \n Christ redeemed us from the Law. Galatians 3:13, \"Christ redeemed us from the curse of the Law by becoming a curse for us, for it is written, 'Cursed is everyone who is hung on a tree.' He redeemed us in order that the blessing given to Abraham might come to the Gentiles through Christ Jesus, so that by faith we might receive the promise of the Spirit.\"\n \n So what was the purpose of the Law in the first place? Galatians 3:19 says, \"What, then, was the purpose of the law? It was added because of transgressions until the Seed to whom the promise referred had come. The law was put into effect through angels by a mediator.\"\n \n In other words, because people in the early days of the Old Testament were sinning so much, God put the Law down so they wouldn't sin. This was temporary until Christ came.  Galatians 3:23 & 24 says, \"Before this faith came, we were held prisoners by the Law, locked up until faith should be revealed. So the Law was put in charge to lead us to Christ that we might be justified by faith.\"", 
   {}, 
   198280, 
   null, 
   1140139140.0
  ], 
  [
   198836, 
   null, 
   "Easyrider", 
   "Purposes of the Law\n \n From my review of scripture there are four major purposes of the law. The first is that the law was intended to show us the character and morality of the sovereign God. If we want to know what God's opinion is concerning adultery or murder, we can look at the sixth and seventh commandments to realize that God does not approve of them. If we want to know if we are involved in idol worship (such as money), we can look at God's second commandment, as well as Matthew 6:24, and Luke 16:13, to see what God's word says about that. But the most important realization that we can come to is that there is but one righteous and sovereign God who is clearly defined through His divine law, and that divine law is perfect.\n \n \"For the law of the Lord is perfect, reviving the soul.\" \n (Psalm 19:7)\n \n \n The second major purpose of the law is that it is a tutor, or a teacher, to lead us to Christ. \n \n \"So the law was put in charge to lead us to Christ, that we might\n be justified by faith.\" (Galatians 3:24)\n \n \"Indeed I would not have know what sin was except through the\n law.\"  (Romans 7:7)\n \n In Galatians 3:19 the apostle Paul wrote, \"What, then was the purpose of the law? It was added because of transgression until the Seed to whom the promise referred (Christ) had come.\" The main point here is that man needs to have some set of guidelines, or law, as a reference to know whether or not he is sinful. Without the law, man indeed did not know what sin was, but once the law was given, three things happened: (1) Man knew the moral character of the righteous God; (2) Man knew by his review of the law that he was sinful;\n \n \"For all have sinned and fall short of the glory of God.\"\n (Romans 3:23)\n \n (3) Man came to the realization that an unfathomable gulf exists between the righteous God and unrighteous, sinful man, and therefore a savior was needed to bridge the gap. \n \"What a wretched man I am! Who will rescue me from this\n body of death? Thanks be to God - through Jesus Christ our\n Lord.\" (Romans 7:24-25)\n \n \n \"But now a righteousness from God, apart from the law, has\n been made known....This righteousness from God comes \n through faith in Jesus Christ...\" (Romans 3:21, 22)\n \n The third purpose of the law is that it is a guide for Christians to live by. Whereas the law was initially provided as a tutor to lead us to Christ, the law also serves as a reminder to keep us \"in\" Christ. One of the interesting things that happens to a Christian in his \"walk\" is that the closer he gets to God, the more aware he is of his sinful nature. This realization serves the purpose of keeping us close to Christ, depending on and trusting in Him for our salvation. \n \n So the law is meant to guide us in our day-to-day walk of faith in Christ. Now there is one extremely important observation that needs to be addressed here. That has to do with the relationship of the law to salvation. Keeping the law does not result in eternal life or salvation. That was never the purpose of the law in regards to man. But it was the purpose of Christ to fulfill that law on our behalf, so that by faith in Him we could all become righteous in the eyes of God. \n \n \"Do not think that I have come to abolish the Law or the\n Prophets; I have not come to abolish them but to fulfill\n them.\" (Jesus, Matthew 5:17)\n \n \"(In Christ)....We have been released from the law so that\n we serve in the new way of the Spirit.\" (Romans 7:6)\n \n This is one of the biggest stumbling blocks that Christians and even non-Christians get caught up in - trying to \"keep\" the law, or trying to do something to help win their salvation.\n \n \"Know that a man is not justified (righteous) by observing\n the law, but by faith in Jesus Christ....(by) observing the \n law no one will be justified.\" (Galatians 2:16)\n \n It would do us well to forget about the law as far as our salvation goes, and try to remember it as a guide for daily Christian living. \n \n The last purpose of the law is to show us where there may be \"traps\" and pitfalls in our lives. For instance, by not committing adultery, we don't have to worry about getting shot at by a jealous husband, or a jealous wife. Our reputations and our consciences stay clear from disgrace. Our marriages remain stronger, and our families tend to stay together longer. Furthermore, we are free from any discipline from God that might take place should we commit such a sin, and we tend to stay out of the \"clutches\" of Satan at the same time.\n \n \"...Hand this man over to Satan, so that the sinful nature\n may be destroyed and his spirit saved on the day of the\n Lord.\" (1 Corinthians 5:5)\n \n Another example is if we keep God's law about not stealing, we don't have to worry about going to jail. And so it goes from law to law. The law is there for our protection, and grants us liberty from many adverse and unpleasant consequences. \n \n In summary, the law serves four major purposes:\n \n 1. It shows us the moral character of God.\n 2. It defines what sin is and serves as a tutor to lead us to Christ.\n 3. It is a guide for Christian living\n 4. It can keep us from suffering the adverse consequences of various sins.", 
   {}, 
   198798, 
   null, 
   1140150180.0
  ], 
  [
   198842, 
   null, 
   "Matthew S", 
   "Purposes of the Law\n \n In summary, the law serves four major purposes:\n \n 1. It shows us the moral character of God.\n 2. It defines what sin is and serves as a tutor to lead us to Christ.\n 3. It is a guide for Christian living\n 4. It can keep us from suffering the adverse consequences of various sins.\n\n \n \n In my ideal society, as the name of this thread states, this would be a private issue and would be kept out of sight in a church and home.", 
   {}, 
   198836, 
   null, 
   1140151200.0
  ], 
  [
   198852, 
   null, 
   "Easyrider", 
   "In my ideal society, as the name of this thread states, this would be a private issue and would be kept out of sight in a church and home.\n\n \n Some people deal with reality and some dwell in la la land.....", 
   {}, 
   198842, 
   null, 
   1140153240.0
  ], 
  [
   198886, 
   null, 
   "Matthew S", 
   "Some people deal with reality and some dwell in la la land.....\n\n \n \n NO some people want to force their religious views unto other people lives. Some people want to oppress others in the name of Jesus. Some people will not realize that there are people out there that do not want anything to do with religion. Some people can not seperate God from government church from state. Some people are too brainwashed.", 
   {}, 
   198852, 
   null, 
   1140185760.0
  ], 
  [
   198894, 
   null, 
   "trebor", 
   "Some people deal with reality and some dwell in la la land.....\n\n \n \n Indeed. You are the perfect example of THAT one.", 
   {}, 
   198852, 
   null, 
   1140187800.0
  ], 
  [
   199019, 
   null, 
   "Easyrider", 
   "Indeed. You are the perfect example of THAT one.\n\n \n According to Trebor, who doesn't really know what's going on.", 
   {}, 
   198894, 
   null, 
   1140220920.0
  ], 
  [
   199038, 
   null, 
   "trebor", 
   "According to Trebor, who doesn't really know what's going on.\n\n \n \n Again, you prove my point :\n :p", 
   {}, 
   199019, 
   null, 
   1140229980.0
  ], 
  [
   199167, 
   null, 
   "Ooaman", 
   "Some people deal with reality and some dwell in la la land.....\n\n I don't know, something might seem nice with living in la la land. I always wanted to live in a dreamworld...\n \n \n Hey, depending on the dreamer, it could be pretty interesting.\n \n Okay, maybe except for showing up to your first day of 2nd grade late in just your underpants may need reworking though.\n \n \n \n \n \n \n \n \n \n \n By the way, please note that I am joking with this post.", 
   {}, 
   198852, 
   null, 
   1140298380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  My ideal society", 
  "url": "http://www.4forums.com/political/religion-debates/7513-my-ideal-society.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7513, 
  "discussion_files": [
   [
    "33028.html", 
    "http://www.4forums.com/political/religion-debates/7513-my-ideal-society-print.html"
   ], 
   [
    "33029.html", 
    "http://www.4forums.com/political/religion-debates/7513-my-ideal-society-4-print.html"
   ], 
   [
    "33030.html", 
    "http://www.4forums.com/political/religion-debates/7513-my-ideal-society-3-print.html"
   ], 
   [
    "33031.html", 
    "http://www.4forums.com/political/religion-debates/7513-my-ideal-society-2-print.html"
   ]
  ], 
  "identifier": 7513
 }
]