[
 [
  [
   197379, 
   null, 
   "daewoo", 
   "My wife want her own digital camera. She wants something cheap and simple. The one she has picked out is the Konica-Minolta Dimage Z5. It is listed at http://www.wawadigital.com/shopping/ProductDetails.asp?Catid=15&Sku=mndz5 and is under $300, so it is ceratinly cheap enough.\n \n What do you guys think? I found some reviews and they look pretty good, but I have no experices with the low end digital cameras at all.", 
   {
    "post_info": {
     "post_title": "Cheap digital camera"
    }
   }, 
   null, 
   null, 
   1139450700.0
  ], 
  [
   197449, 
   null, 
   "georged", 
   "I suggest looking at some of the rectangular shaped models about the size of a cigarette package. Fits right in a pocket or purse, many are waterproof and all have built-in flash. Upgrade the card to at least 256MB.\n \n I purchased one of these for my wife:\n \n http://www.olympusamerica.com/cpg_section/product.asp?product=1190&fl=4", 
   {}, 
   197379, 
   null, 
   1139499360.0
  ], 
  [
   197484, 
   null, 
   "daewoo", 
   "Is she happy with it? Does it take pretty good pictures? Admittedly I have always been an SLR fan myself, and always kind of considered instant or point and shoot camers to be junk (snobbish, I know). As such, I have certain preconcieved notions as to what a camera should look like, and it isn't little and square. Irrational, I know.", 
   {}, 
   197449, 
   null, 
   1139505240.0
  ], 
  [
   197496, 
   null, 
   "georged", 
   "She likes the small size, points, shoots and gives it to me for uploading, storage and prints. Within normal parameters it takes excellent pictures, comparable to my digital SLR for 8.5x11 prints.", 
   {}, 
   197484, 
   null, 
   1139507340.0
  ], 
  [
   197520, 
   null, 
   "daewoo", 
   "I will take a harder look. I did not realize that the smaller cameras had reached such high resolutions. I was under the impression that they were still in the 1-2 megapixel range.", 
   {}, 
   197496, 
   null, 
   1139516520.0
  ], 
  [
   197524, 
   null, 
   "georged", 
   "I will take a harder look. I did not realize that the smaller cameras had reached such high resolutions. I was under the impression that they were still in the 1-2 megapixel range.\n\n \n Actually, unless you're going to print very large images or want to cut sections from images and expand them, 3-4 megapixels will do 98% of what the average snapshot taker requires. \n \n As a side note, Nikon recently announced they're discontinuing film camera production with the exception of one entry-level camera and their single top of the line SLR to concentrate resources on digital camera development. I have several Nikon film cameras packed away and doubt I'll ever use them again. I'll probably eventually sell my trusty F2 Photomic as there will always be a demand for non-electronic high quality film cameras for primitive field work.", 
   {}, 
   197520, 
   null, 
   1139517420.0
  ], 
  [
   197527, 
   null, 
   "daewoo", 
   "Actually, unless you're going to print very large images or want to cut sections from images and expand them, 3-4 megapixels will do 98% of what the average snapshot taker requires. \n \n As a side note, Nikon recently announced they're discontinuing film camera production with the exception of one entry-level camera and their single top of the line SLR to concentrate resources on digital camera development. I have several Nikon film cameras packed away and doubt I'll ever use them again. I'll probably eventually sell my trusty F2 Photomic as there will always be a demand for non-electronic high quality film cameras for primitive field work.\n\n \n I have an old FE that you could not get out of my hands with dynamite. I have found myself going with the digital camera more often anymore. It is just easier, and I don't drag out pictures to look at them very often, so for the most parts I don't need prints all that badly, and whn I do they are quick and painless anymore.\n \n On the other hand, I generally prefer secluded vaction spots. My Elk ccamp usually consists of a tent, a campfire, and a horse. In such instances, there is something to be said for a camera that can be repaired with a pocket knife and a tent stake, thus my reluctance to let that old FE go.", 
   {}, 
   197524, 
   null, 
   1139518380.0
  ], 
  [
   197531, 
   null, 
   "georged", 
   "I'm on my fourth digital camera and with a 2gig card and spare battery, I see no need to ever go back to film. For outdoors, I have a waterproof to 10' under that does 7 megapixels. To me, software manipulation of digital images is far more enjoyable and instant, as versus film, a darkroom and proofs. As a hobby, storage space is reduced to an existing HD and CDs. Paper as gotten so inexpensive with expanded digital use (just purchased a 100-pack of 10mil high gloss 8.5x11 paper for under $20) I print only 8.5x11. I look at film like photographers must have looked at plates when film come out.", 
   {}, 
   197527, 
   null, 
   1139519640.0
  ], 
  [
   197545, 
   null, 
   "Truthsayer", 
   "My wife bought me a cheap digital camera for Christmas at K-Mart. Paid 99.00 plus tax.\n \n What a P.O.S.emoticon_cry", 
   {}, 
   197531, 
   null, 
   1139522820.0
  ], 
  [
   214878, 
   null, 
   "snakespit", 
   "Just got a Kodak EasyShare Z650 today. Package deal, came with a printer for about $360, plus a 2gb card and extra battery. Already tried the photo printer, looks as good as they do coming from Eckerds. Cool camera, easy to use, and can even get a good bit of video with the 2gb card.", 
   {}, 
   197545, 
   null, 
   1149057840.0
  ], 
  [
   214884, 
   null, 
   "MTKnight", 
   "Just got a Kodak EasyShare Z650 today. Package deal, came with a printer for about $360, plus a 2gb card and extra battery. Already tried the photo printer, looks as good as they do coming from Eckerds. Cool camera, easy to use, and can even get a good bit of video with the 2gb card.\n\n \n Yea thats a good camera, although it took awhile for a few people in my house hold to figure out it needed lithium batteries in order to run properly. :(\n \n Best part though is we got it free. emoticon_xgood \n \n Had to buy an extra card though. :P", 
   {}, 
   214878, 
   null, 
   1149060600.0
  ], 
  [
   214895, 
   null, 
   "Dono", 
   "Prices are coming down too. I saw an 8mp Olympus advertised today for $299.\n D0n0", 
   {}, 
   214884, 
   null, 
   1149094260.0
  ], 
  [
   214975, 
   null, 
   "Heads_On_Pikes", 
   "Just got a Kodak EasyShare Z650 today. Package deal, came with a printer for about $360, plus a 2gb card and extra battery. Already tried the photo printer, looks as good as they do coming from Eckerds. Cool camera, easy to use, and can even get a good bit of video with the 2gb card.\n\n \n I bought a HP photosmart camera a year ago, mostly because I had the HP photosmart software already installed on the HP computer I had purchased a month before the camera. It\\'s only 4.1 mp, but it\\'s been plenty good enough for my needs and has been very reliable. I purchased the pic transfer/recharging dock and the memory card with the camera and it ran a little over $300.\n \n I will give you one word of warning from one digital camera newby to another; those tiny memory cards can and do fail. The 2 gig card I bought with the camera took a dump after six months and I lost some nice pics of our new puppy. My suggestion would be to transfer from the camera to the computer often.", 
   {}, 
   214878, 
   null, 
   1149132000.0
  ], 
  [
   214976, 
   null, 
   "georged", 
   "\n I will give you one word of warning from one digital camera newby to another; those tiny memory cards can and do fail. The 2 gig card I bought with the camera took a dump after six months and I lost some nice pics of our new puppy. My suggestion would be to transfer from the camera to the computer often.\n\n \n Good advice. 2g is a lot of memory for still images, about 320 big images. I\\'ve found that adjusting, assigning file names and deleting more than a few dozen images at one time tries my patience.", 
   {}, 
   214975, 
   null, 
   1149133500.0
  ], 
  [
   241016, 
   null, 
   "Sigma", 
   "Good advice. 2g is a lot of memory for still images, about 320 big images. I\\'ve found that adjusting, assigning file names and deleting more than a few dozen images at one time tries my patience.\n\n \n \n Yikes. Photography is just a hobby for me, so the numbers automatically assigned to the pictures work just fine. Only a few in each batch is worth anything, so my re-organizing to keep my good pictures around doesn\\'t take long :P", 
   {}, 
   214976, 
   null, 
   1164534660.0
  ], 
  [
   241032, 
   null, 
   "georged", 
   "Yikes. Photography is just a hobby for me, so the numbers automatically assigned to the pictures work just fine. Only a few in each batch is worth anything, so my re-organizing to keep my good pictures around doesn't take long :P\n\n \n I've found using descriptive file names to store images can eliminate long search processes, opening images, in finding a specific image after they've been stored for a long period of time. A majority of my digital images require software massaging and assigning a descriptive file name when saving the changes to image categories is, for me, the simplest way to stay organized.", 
   {}, 
   241016, 
   null, 
   1164563940.0
  ], 
  [
   241034, 
   null, 
   "Missouri Mule", 
   "I have a 3.1 mp digital camera that has worked well but I wonder if I need one with finer resolution. What would be the recommendation and which brand and model would that be?", 
   {}, 
   241032, 
   null, 
   1164565200.0
  ], 
  [
   241035, 
   null, 
   "georged", 
   "Digital camera brand is not unlike motor oil, many have preferences but they all perform the same function. For general photography I'd recommend any of the majors in a SLR with 6-8mp and Adobe or Corel photo editing software.", 
   {}, 
   241034, 
   null, 
   1164565860.0
  ], 
  [
   241037, 
   null, 
   "Missouri Mule", 
   "Digital camera brand is not unlike motor oil, many have preferences but they all perform the same function. For general photography I'd recommend any of the majors in a SLR with 6-8mp and Adobe or Corel photo editing software.\n\n \n Thanks. I'll keep my eye out for one in that range and with that software. This gives me a good starting point.", 
   {}, 
   241035, 
   null, 
   1164568800.0
  ], 
  [
   241038, 
   null, 
   "georged", 
   "Thanks. I'll keep my eye out for one in that range and with that software. This gives me a good starting point.\n\n \n Software will be a separate item. All come with proprietary photo editing software often necessary for structuring raw exposures, but it's generally more of a technical learning curve than using Adobe or Corel.", 
   {}, 
   241037, 
   null, 
   1164569400.0
  ], 
  [
   241140, 
   null, 
   "jim's trucking", 
   "Yikes. Photography is just a hobby for me, so the numbers automatically assigned to the pictures work just fine. Only a few in each batch is worth anything, so my re-organizing to keep my good pictures around doesn't take long :P\nQuite right! I take about a hundred pictures in an effort to get three or four really good ones...plug into the USB port, view thumbnails, drag and drop good pics, unplug USB, format card and start again. Almost all my cards are 1G each. (The smaller ones came with cameras.)\n \n I've had a Konica/Minolta Dimage Z2 for a good while...it performs fairly well...just bought a Panasonic DMC-FZ7 with 6-72 Leica lens...couldn't ask for a better \"cheap\" 6MP digital.", 
   {}, 
   241016, 
   null, 
   1164651060.0
  ], 
  [
   241141, 
   null, 
   "jim's trucking", 
   "Digital camera brand is not unlike motor oil, many have preferences but they all perform the same function. For general photography I'd recommend any of the majors in a SLR with 6-8mp and Adobe or Corel photo editing software.\nIt is wise to stick with the majors... more important to pay attention to the quality of the lenses. All that software, operating system and mega-pixel capacity does absolutely no good if the lenses are crapola. Stick with Leica, Carl Zeiss and a couple of others and you can hardly go wrong.\n \n ...and PhotoFiltre is about the simplest editor known to this man.", 
   {}, 
   241035, 
   null, 
   1164651660.0
  ], 
  [
   241149, 
   null, 
   "Missouri Mule", 
   "Quite right! I take about a hundred pictures in an effort to get three or four really good ones...plug into the USB port, view thumbnails, drag and drop good pics, unplug USB, format card and start again. Almost all my cards are 1G each. (The smaller ones came with cameras.)\n \n I've had a Konica/Minolta Dimage Z2 for a good while...it performs fairly well...just bought a Panasonic DMC-FZ7 with 6-72 Leica lens...couldn't ask for a better \"cheap\" 6MP digital.\n\n \n I prefer to just pop out the cards rather than fool with the cords. I keep a USB cord plugged in and handy right under my monitor. I'm thinking of getting one of those mini card readers and then I won't even have to hunt around for a USB port. \n \n I'll have to check the one you mention above. I don't need a professional quality one but one that is EASY to use and I can snap something that doesn't require me to get out the manual to figure out. Is it easy to use? About how much would that cost me? My 3.1 is OK but not as clear as I would like.", 
   {}, 
   241140, 
   null, 
   1164653820.0
  ], 
  [
   241156, 
   null, 
   "jim's trucking", 
   "I prefer to just pop out the cards rather than fool with the cords. I keep a USB cord plugged in and handy right under my monitor. I'm thinking of getting one of those mini card readers and then I won't even have to hunt around for a USB port. \n \n I'll have to check the one you mention above. I don't need a professional quality one but one that is EASY to use and I can snap something that doesn't require me to get out the manual to figure out. Is it easy to use? About how much would that cost me? My 3.1 is OK but not as clear as I would like.\nYou've hit paydirt here with this Lumix! It's capable of being taxed by a professional...with P, A, S, M, Macro, Movie, and SCN settings. [That's AE PROGRAM, APERTURE PRIORITY, SHUTTER PRIORITY, MANUAL, MACRO, VIDEO MOVIE, and SCENE (portrait, soft skin, scenery, sports, night portrait, night scenery, panning, food, party, candle light, fireworks, starry sky, baby 1, baby 2, snow, and high sensitivity)]\n \n ...has several flash modes\n \n ...and 12x optical zoom (6-72)\n \n ...and two modes of image stabilation\n \n ...and there's that setting you want. The icon is shaped like a heart and it's called SIMPLE MODE. It's available strictly for use by all blondes and slow men.\n \n You should find it for between $300 and $400 depending on where you shop. BrandSmart will be low...Wolf Camera will be high...they will all likely offer extended, full-replacement contracts for $50 to $100.\n \n The close-ups in MACRO are astounding. The exposures near sunset are unbelievably bright.", 
   {}, 
   241149, 
   null, 
   1164655980.0
  ], 
  [
   241187, 
   null, 
   "Missouri Mule", 
   "You've hit paydirt here with this Lumix! It's capable of being taxed by a professional...with P, A, S, M, Macro, Movie, and SCN settings. [That's AE PROGRAM, APERTURE PRIORITY, SHUTTER PRIORITY, MANUAL, MACRO, VIDEO MOVIE, and SCENE (portrait, soft skin, scenery, sports, night portrait, night scenery, panning, food, party, candle light, fireworks, starry sky, baby 1, baby 2, snow, and high sensitivity)]\n \n ...has several flash modes\n \n ...and 12x optical zoom (6-72)\n \n ...and two modes of image stabilation\n \n ...and there's that setting you want. The icon is shaped like a heart and it's called SIMPLE MODE. It's available strictly for use by all blondes and slow men.\n \n You should find it for between $300 and $400 depending on where you shop. BrandSmart will be low...Wolf Camera will be high...they will all likely offer extended, full-replacement contracts for $50 to $100.\n \n The close-ups in MACRO are astounding. The exposures near sunset are unbelievably bright.\n\n \n That sounds fantastic. Offhand, do you have an actual model #? I'll do some research on the internet to see what it can be purchased for. My birthday is coming up and I'll tell my wife about it.", 
   {}, 
   241156, 
   null, 
   1164673020.0
  ], 
  [
   241278, 
   null, 
   "jim's trucking", 
   "That sounds fantastic. Offhand, do you have an actual model #? I'll do some research on the internet to see what it can be purchased for. My birthday is coming up and I'll tell my wife about it.\nPanasonic DMC-FZ7\n \n Good luck with the wife!", 
   {}, 
   241187, 
   null, 
   1164735360.0
  ], 
  [
   241281, 
   null, 
   "daewoo", 
   "I guess I could update here since I started this thread.\n \n I bought the stylus 600 that George recommended for the wife. She loved it. I then bought 2 more...one to stick in the glove box of my truck and the other for my mother in law for her birthday. For the MIL I also bought a phot printer that she can just plug the camera into, select the picture she wants on the cameras display, hit the \"print\" button ont he camera, and it spits out a 3x5 or 5x7 paper print, depending on what size paper she has loaded.\n \n 1 GB cards in the camers net you well over 1000 pictures with the camera set at a reasonable resolution, and at 8.4x11 you are hard pressed to tell the difference between that and my Nikon that cost 10x as much. \n \n The only thing I DONT like about the olympus stylus is the XD card. I had to get new card readers because mine didn't have slots for XD. The included cable didi fine until the new card reader showed up. The other cool feature that I had never seen in the lower end cameras was a cable to connect it to the RCA video in jack on a television to display your photos that way. I have never used it, but the wife has, and it is a handy feature.", 
   {}, 
   241278, 
   null, 
   1164737580.0
  ], 
  [
   246123, 
   null, 
   "Sigma", 
   "Digital camera brand is not unlike motor oil, many have preferences but they all perform the same function. For general photography I'd recommend any of the majors in a SLR with 6-8mp and Adobe or Corel photo editing software.\n\n \n I went with a Canon digital SLR so I and my SO could swap lenses (she has the non-digital version).", 
   {}, 
   241035, 
   null, 
   1168046520.0
  ], 
  [
   246169, 
   null, 
   "Jo Bennett", 
   "My wife and I just bought Kodak Z650, which is a fine piece of kit picked up from amazon for GBP130, capable of taking extra lenses, 10x optical zoom, very quick shutter speed for action shots (it can catch my wife's ferrets in mid jump without blurring), plus it takes AA batteries which means high capacity rechargables are easy to come by. It also has more options than we'll ever use :p\n \n Additionally, for editing I'd recommend GIMP, because it's free and can do almost anything photoshop can do.", 
   {}, 
   246123, 
   null, 
   1168083900.0
  ], 
  [
   276146, 
   null, 
   "jim's trucking", 
   "I'm addicted to them...have a TZ30, a TZ7 and just bought a TZ1...debating whether to buy the really big one next.", 
   {
    "post_info": {
     "post_title": "Panasonic LUMIX cameras..."
    }
   }, 
   246169, 
   null, 
   1186089420.0
  ], 
  [
   291843, 
   null, 
   "ChristAscended", 
   "I'm addicted to them...have a TZ30, a TZ7 and just bought a TZ1...debating whether to buy the really big one next.\n\n \n MY friend had a TZ27. I heard it seems to be pretty good for the price.", 
   {}, 
   276146, 
   null, 
   1196313480.0
  ], 
  [
   298097, 
   null, 
   "ServantOfChrist", 
   "MY friend had a TZ27. I heard it seems to be pretty good for the price.\n\n \n Definitely agree with your friend.", 
   {}, 
   291843, 
   null, 
   1200872400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cheap digital camera", 
  "url": "http://www.4forums.com/political/cameras/7547-cheap-digital-camera.html", 
  "breadcrumbs": [
   "Cameras"
  ], 
  "id_number": 7547, 
  "discussion_files": [
   [
    "13564.html", 
    "http://www.4forums.com/political/cameras/7547-cheap-digital-camera-print.html"
   ], 
   [
    "13565.html", 
    "http://www.4forums.com/political/cameras/7547-cheap-digital-camera-3-print.html"
   ], 
   [
    "13566.html", 
    "http://www.4forums.com/political/cameras/7547-cheap-digital-camera-2-print.html"
   ]
  ], 
  "identifier": 7547
 }
]