[
 [
  [
   197431, 
   null, 
   "daewoo", 
   "I fully expect some to diregard this because it is from a Venezuelan paper, and what would those fools in Venezuela know about what is going on in Venezuela\n \n \nVHeadline.com News Editor Patrick J. O'Donoghue writes: Speaking at a mass rally in Caracas before a multitude of supporters from all over Venezuela to mark the February 4, 1992 (4F) coup anniversary and 7 years in office, Venezuelan President Chavez Frias has made ample reference to the current microphone war between his country and the USA. \n \n Venezuelan Embassy in Washington official, Jenny Figueredo Frias, expelled in reprisal for the Venezuelan government's expulsion of US Naval Military Attache John Correa, will receive a hero's welcome when she arrives here. \n \n The President says Figueredo is instrumental in helping Citgo bring cheap heating oil to poor communities in the USA. \n \n During the speech, Chavez Frias repeated his threat to close Venezuelans oil refineries in the USA ... \"it won't cost me anything to sell oil to other countries that have been asking for more oil ... real allies like China, India, European and Latin American countries.\" \n \n The US Embassy must stop spying, Chavez Frias warns, and if he catches US officials with their fingers in the pie, then they will go to prison before sending them back to the USA. \n \n \"Venezuela does not want to go to such extremes and wants to be left alone ... the imperialist government must accept the reality that Venezuela has been liberated and will never be a colony of the US again.\"\n \n Revealing aspects of alleged Embassy spying activities, Chavez Frias has told supporters that government surveillance forced the officers to change the place where they used to eat arepas ... \"there's one Lt. Colonel that we have staked out and he changed his arepa diner. \"\"\n \n We nearly got Correa and the latter justified his exit, alleging illness ... they sent him home because we nearly grabbed him.\" \n\n \n To put this into a little broader context, this is from USA today, Jan 11:\n \n http://www.usatoday.com/money/industries/energy/2006-01-11-citgo-cover-usat_x.htm\n \n \nAs Hurricanes Katrina and Rita demonstrated, any disruption to the nation's refining industry instantly increases gas prices. What if Chávez, who periodically threatens to curtail oil shipments to the USA, closed Citgo's refineries?\n \n \"He'd only have to do that for 90 days, and he'd destroy our economy,\" worries Matthew Simmons, a prominent energy investment banker. \"He actually has our livelihood in his hands.\"\n", 
   {
    "post_info": {
     "post_title": "Chavez to close oil refineries in the USA if spying continues"
    }
   }, 
   null, 
   null, 
   1139478000.0
  ], 
  [
   197472, 
   null, 
   "simone", 
   "Well, gosh.\n \n Should BushyBoy bomb Venezuela out of existence or make nice with the lad?\n \n One wonders if something like this mightn't be settled in a diplomatic manner but the perpetually insecure BushyBoy may feel the necessity of pulling of a macho bullyboy thingy. He was just enormously bruised at the King funeral so his mood may not be of the best. And he wants to retaliate. Somewhere.", 
   {}, 
   197431, 
   null, 
   1139504100.0
  ], 
  [
   197494, 
   null, 
   "daewoo", 
   "Well, gosh.\n \n Should BushyBoy bomb Venezuela out of existence or make nice with the lad?\n \n One wonders if something like this mightn't be settled in a diplomatic manner but the perpetually insecure BushyBoy may feel the necessity of pulling of a macho bullyboy thingy. He was just enormously bruised at the King funeral so his mood may not be of the best. And he wants to retaliate. Somewhere.\n\n \n The smart thing to do would be to kiss his butt and pray that Chavez plays nice with us. American pride won't allow for that, we like to live under the illusion that we are still the greatest country in the world.\n \n Besides, the fact that it is the smart thing to do disqualifies it from Bushs decision making process.", 
   {}, 
   197472, 
   null, 
   1139506320.0
  ], 
  [
   197500, 
   null, 
   "Maineiac", 
   "I don't look for Chavez to make the big leap of cutting us off just yet. He has oil contracts to fill. He hasn't missed any shipments yet.\n \n Oil coming from Venezuela is what they call heavy crude oil, which has a high sulfur content. The oil refineries in the US are designed to process this heavy crude , which can't be done just anywhere on a large scale.\n \n http://ca.us.biz.yahoo.com/ap/060206/venezuela_oil.html?.v=2", 
   {}, 
   197494, 
   null, 
   1139510880.0
  ], 
  [
   197505, 
   null, 
   "lord tammerlain", 
   "Closing the refineries is not really an option as Maineiac said. \n \n However the majority of Venezuelan contracts for oil in the US are to Venezuelan owned refineries, (Citgo) and breaking contracts with your own company is not going to land you in a court. Or he could require the refineries to undergo a retrofit at the same time to improve environmental controls ( for the benifit of Americans living near the refineries of course) The lack of gasoline would be quite dramatic.", 
   {}, 
   197500, 
   null, 
   1139513460.0
  ], 
  [
   197511, 
   null, 
   "georged", 
   "Closing the refineries is not really an option as Maineiac said. \n \n However the majority of Venezuelan contracts for oil in the US are to Venezuelan owned refineries, (Citgo) and breaking contracts with your own company is not going to land you in a court. Or he could require the refineries to undergo a retrofit at the same time to improve environmental controls ( for the benifit of Americans living near the refineries of course) The lack of gasoline would be quite dramatic.\n\n \n Is there any doubt that this fascist administration would not consider such an action an act of war and seize Citgo assets to be operated by an administration buddy? \n \n http://today.reuters.com/business/newsarticle.aspx?type=tnBusinessNews&storyID=nN09351343", 
   {}, 
   197505, 
   null, 
   1139514900.0
  ], 
  [
   197517, 
   null, 
   "daewoo", 
   "Closing the refineries is not really an option as Maineiac said. \n \n However the majority of Venezuelan contracts for oil in the US are to Venezuelan owned refineries, (Citgo) and breaking contracts with your own company is not going to land you in a court. Or he could require the refineries to undergo a retrofit at the same time to improve environmental controls ( for the benifit of Americans living near the refineries of course) The lack of gasoline would be quite dramatic.\n\n \n Closing them, no, limiting shipments and selling oil to Asia or Latin America is certainly a possibility. China has no environmental controls, so the high sulphur content of the oil is not as big an issue. China already intends to increase their imports of sour crude this year by 23%, and their new refinery in Quingdao is due to begin operation early next year and will process ONLY sour crude (high sulpuhur heavy).\n \n Citgo could drop production fairly significantly and their losses would largely be offset by the increased margin on refined products. I read an analysis the other day that estiemated that if Citgo cut production by 50%, it is likely that their profits would only diminish at maximum by only 12%. Venezuela could absorb a 12% decrease in profits from Citgo pretty easily.", 
   {}, 
   197505, 
   null, 
   1139516340.0
  ], 
  [
   197518, 
   null, 
   "JPSartre12", 
   "Is there any doubt that this fascist administration would not consider such an action an act of war and seize Citgo assets to be operated by an administration buddy? \n \n http://today.reuters.com/business/newsarticle.aspx?type=tnBusinessNews&storyID=nN09351343\n\n \n Hey, they nationalized US oil assets in their country, didn't they? :)", 
   {}, 
   197511, 
   null, 
   1139516340.0
  ], 
  [
   197530, 
   null, 
   "lord tammerlain", 
   "Hey, they nationalized US oil assets in their country, didn't they? :)\n\n \n Long before Chavez was elected. PvDSA was created I believe in the 70's. All Chavez has done is increase taxes and royalties on foreign oil companies.\n \n For example the extra heavy crude found in the Orinoco area, previously had a royalty rate of a puny 1 %. That is an insulting rate to the Venezuelan people. He increased it to 16.7% if I recall correctly.", 
   {}, 
   197518, 
   null, 
   1139519580.0
  ], 
  [
   197548, 
   null, 
   "JPSartre12", 
   "Long before Chavez was elected. PvDSA was created I believe in the 70's. All Chavez has done is increase taxes and royalties on foreign oil companies.\n \n For example the extra heavy crude found in the Orinoco area, previously had a royalty rate of a puny 1 %. That is an insulting rate to the Venezuelan people. He increased it to 16.7% if I recall correctly.\n\n \n I believe that the oil refineries were nationalized under Perez. We can both agree that it was the people of Venezuela that got screwed then AND now.", 
   {}, 
   197530, 
   null, 
   1139524980.0
  ], 
  [
   197556, 
   null, 
   "Jo Bennett", 
   "I believe that the oil refineries were nationalized under Perez. We can both agree that it was the people of Venezuela that got screwed then AND now.\n\n \n Why? The people of Venezuela are doing pretty damn well out of the government controlling oil supplies, in terms of actually getting essentials like healthcare and education.", 
   {}, 
   197548, 
   null, 
   1139527680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Chavez to close oil refineries in the USA if spying continues", 
  "url": "http://www.4forums.com/political/current-events-debates/7551-chavez-close-oil-refineries-usa-if-spying-continues.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7551, 
  "discussion_files": [
   [
    "21021.html", 
    "http://www.4forums.com/political/current-events-debates/7551-chavez-close-oil-refineries-usa-if-spying-continues-print.html"
   ]
  ], 
  "identifier": 7551
 }
]