[
 [
  [
   197634, 
   null, 
   "Cheesejoff", 
   "Hi, this will be my first debate here but I'll give it my best go.\n \n I would like to debate whether the Earth is flat or round (a sphere)\n \n If someone wants to argue flat the they can feel free, but I assume I will probably be arguing for flat.\n \n Please note I don't actually believe that it's flat, I merely thought it would make for a very interesting debate.\n \n So, any takers?", 
   {
    "post_info": {
     "post_title": "The Earth is flat!"
    }
   }, 
   null, 
   null, 
   1139576100.0
  ], 
  [
   197701, 
   null, 
   "zachvac", 
   "Is this a joke? Do you honestly you can give evidence as to the Earth being flat? I assume you would be the affirmative arguing that \"the Earth is not a sphere, but flat\". I don't know, my first thought was that it would simply be a waste of time. But I'm a little curious. I guess I'm willing to debate this as long as you are completely serious (you don't have to agree with the topic, just that you feel you have a valid case that has some chance of winning) and you promise not to leave in the middle of the debate as happened with Cerebro in the Intelligent Design debate. Under those conditions, I'll do the debate. I just want a real debate rather than a joke.", 
   {}, 
   197634, 
   null, 
   1139620860.0
  ], 
  [
   197756, 
   null, 
   "Cheesejoff", 
   "I'm serious. I knew this topic would get a bit of a reaction :)\n \n I cannot give 100% conclusive evidence (otherwise there'd be no debate) but I can certainly offer theories to have a debate.\n \n I will need some time to get my evidence together.\n \n In the meantime please look at a map of the Earth - http://www.un.int/\n \n *edit* Alright, I'm going on holiday this weekend, so the debate won't be able to start so soon.\n \n In addition, due to being busy on week days, I will probably only be able to post on weekends and possibly Friday evenings.", 
   {}, 
   197701, 
   null, 
   1139661420.0
  ], 
  [
   197879, 
   null, 
   "zachvac", 
   "I'm serious. I knew this topic would get a bit of a reaction :)\n \n I cannot give 100% conclusive evidence (otherwise there'd be no debate) but I can certainly offer theories to have a debate.\n \n I will need some time to get my evidence together.\n \n In the meantime please look at a map of the Earth - http://www.un.int/\n \n *edit* Alright, I'm going on holiday this weekend, so the debate won't be able to start so soon.\n \n In addition, due to being busy on week days, I will probably only be able to post on weekends and possibly Friday evenings.\n\n \n ok, well I've been thinking about this and it actually could get interesting. I'm thinking in this case it would be better if I took the affirmative and had to prove that the Earth was a sphere, rather than you having to prove that the Earth is flat. The burden of proof would rest with me.\n \n I am in a similar situation with time, and with the debate I just finished it was a 7-day time limit, so each person would have one weekend (and one of any day for that matter). I just want to make sure that you won't just get up and run away after a post or 2, my first debate ended up that way. Let me know when you're ready to actually do it and we can see if anyone wants to judge a debate on whether the Earth is flat :)", 
   {}, 
   197756, 
   null, 
   1139729220.0
  ], 
  [
   200554, 
   null, 
   "the plump dwarf", 
   "I think the earth is triangular LOL HAHAHHA", 
   {}, 
   197879, 
   null, 
   1141170300.0
  ], 
  [
   209784, 
   null, 
   "Cheesejoff", 
   "Unfortunately due to time constraints I probably can't actually go ahead with this right now.\n \n If you're still interested in about a month or so let me know, after all the Earth will still be the same shape then :)", 
   {}, 
   200554, 
   null, 
   1146078180.0
  ], 
  [
   228650, 
   null, 
   "coolcodemn3", 
   "the earth is flat, its made up of a bunch of flat spots that make up a round ball. Put a ruler on a ping pong ball and it is hitting flat on that point of where they meet. Did that make sense?", 
   {}, 
   209784, 
   null, 
   1156387560.0
  ], 
  [
   230849, 
   null, 
   "Steeeeve", 
   "I think a flat earth would be more interesting...You could stand at the edge and look out...that would be fun.", 
   {}, 
   228650, 
   null, 
   1158177840.0
  ], 
  [
   230940, 
   null, 
   "zachvac", 
   "but it is flat. After all a curve is just an infinite amount of straight lines, right? A circle is just a polygon with an infinite amount of edges. The problem is our eyes can't see that well (in fact no one can't, no one has infinitely good eyes, whatever those are). So we call them round. So Steeeve, you can just stand and look over the edge. After all, from your point of view, you are standing at the highest point in the world (well that's not quite true, but assume there are no mountains or hills or valleys or anything). Of course if you go over somewhere else to measure how high it is, it becomes the highest point too. Stupid gravity, always going towards the center of mass rather than just down towards a plane :)", 
   {}, 
   230849, 
   null, 
   1158277020.0
  ], 
  [
   230971, 
   null, 
   "Steeeeve", 
   "the tangent line is not the same as the point it touches. I don't think a \"point\" is counted as a line.", 
   {}, 
   230940, 
   null, 
   1158290220.0
  ], 
  [
   230992, 
   null, 
   "zachvac", 
   "the tangent line is not the same as the point it touches. I don't think a \"point\" is counted as a line.\n\n \n well technically what I'm saying if you take smaller and smaller increments of a curve, no matter your vision, it can look like a straight line. Case in point Earth. We're close enough to it in relation to the size that is looks flat. Let's just imagine the radius of the Earth was constant (perfect sphere). that would mean technically you're always on a hill. Although the way you look at it it seems flat. So depending on your point of view, you could say that the Earth is effectively flat at any given point.", 
   {}, 
   230971, 
   null, 
   1158299220.0
  ], 
  [
   230993, 
   null, 
   "electrolyte", 
   "After all a curve is just an infinite amount of straight lines, right? A circle is just a polygon with an infinite amount of edges.\n\n \n \nthe tangent line is not the same as the point it touches. I don't think a \"point\" is counted as a line.\n\n Well, I wasn't going to be so anal, so I aborted my previous post halfway through... But since Steeeeve responded, I'll un-censor my thoughts:\n \n A circle is the locus of coplanar points that lie some distance r from a location. As points have no dimension, and as no three points are colinear, a circle is not composed of straight lines and is therefore not a polygon. (If there were infinitely many lines, each \"line\" would have a length of 2&#960;r/&#8734; (i.e. 0) and therefore be a point instead of a line. Further, if there were many but not infinitely many lines, any point on the line that isn't an original point -- e.g. the midpoint of one such line -- would be a distance less than r from the center of the circle.)\n The same reasoning applies to a sphere in when adding a dimension.", 
   {}, 
   230971, 
   null, 
   1158299280.0
  ], 
  [
   230996, 
   null, 
   "zachvac", 
   "Well, I wasn't going to be so anal, so I aborted my previous post halfway through... But since Steeeeve responded, I'll un-censor my thoughts:\n \n A circle is the locus of coplanar points that lie some distance r from a location. As points have no dimension, and as no three points are colinear, a circle is not composed of straight lines and is therefore not a polygon. (If there were infinitely many lines, each \"line\" would have a length of 2&#960;r/&#8734; (i.e. 0) and therefore be a point instead of a line. Further, if there were many but not infinitely many lines, any point on the line that isn't an original point -- e.g. the midpoint of one such line -- would be a distance less than r from the center of the circle.)\n The same reasoning applies to a sphere in when adding a dimension.\n\n \n No I completely agree with you. But the way we perceive them and see them with our eyes isn't like that. If we see a picture close enough to a curve, it will look like a straight line. Like I said, if our eyes had infinite resolution, we'd be able to comprehend a circle. We can give the definition but our eye will always see circles as an infinite number of straight lines. Again, you're completely correct, and I do understand this. A circle ISN'T an infinite amount of straight line segments. But for the purposes of the way we see things it can be.", 
   {}, 
   230993, 
   null, 
   1158299520.0
  ], 
  [
   235334, 
   null, 
   "seabrig", 
   "I think a flat earth would be more interesting...You could stand at the edge and look out...that would be fun.\n\n \n I would like having a flat earth:) that would be fun...emoticon_xdonno [SIZE=\"7CHEESE!!!!!!!!!!", 
   {}, 
   230849, 
   null, 
   1161144600.0
  ], 
  [
   235335, 
   null, 
   "seabrig", 
   ":xbanghead \nI think a flat earth would be more interesting...You could stand at the edge and look out...that would be fun.\n\n \n I would like having a flat earth:) that would be fun...emoticon_xdonno [SIZE=\"7CHEESE!!!!!!!!!!:xbanghead :xbanghead", 
   {}, 
   230849, 
   null, 
   1161144660.0
  ], 
  [
   235336, 
   null, 
   "seabrig", 
   ":xbanghead \n \n I would like having a flat earth:) that would be fun...emoticon_xdonno CHEESE!!!!!!!!!!:xbanghead :xbanghead\nemoticon_xkill emoticon_xkill emoticon_love", 
   {}, 
   235335, 
   null, 
   1161144720.0
  ], 
  [
   262571, 
   null, 
   "nomane", 
   "i intersted in giving it a go it will be my fist debate on the net:)", 
   {}, 
   235335, 
   null, 
   1178855520.0
  ], 
  [
   264136, 
   null, 
   "Jckker", 
   "Unfortunately due to time constraints I probably can't actually go ahead with this right now.\n \n If you're still interested in about a month or so let me know, after all the Earth will still be the same shape then :)\n\n \n Incorrect. The polar points are constantly changing, which will shift the polar axis to another point on the earth, maybe around the year 2012 (Aztec or something calendar along with Chinese book of fortune all says earth ends in year 2012). Of course I do not know whether this is for real or not, but I have my reasons to believe that the world will end after I die.\n \n How does this relate to the world being flat: The earth is protected by an electromagnetic field, a field affected by the position of the polar axis. This field controls the entire planet, bringing plant life into existence, guiding birds, creating pathways for water, etc. this also controls the terrian of the earth, mountains, rivers, hills, valleys, etc. So, in theory, if this magnetic field changes in such a way, it can change the shape of the earth.\n \n If you are wondering why I am trying to prve you are inncorrect, read my first post on this website. -Jckker", 
   {}, 
   209784, 
   null, 
   1179788940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Earth is flat!", 
  "url": "http://www.4forums.com/political/debate-challenges/7557-earth-flat.html", 
  "breadcrumbs": [
   "Debate Challenges"
  ], 
  "id_number": 7557, 
  "discussion_files": [
   [
    "30763.html", 
    "http://www.4forums.com/political/debate-challenges/7557-earth-flat-print.html"
   ], 
   [
    "30764.html", 
    "http://www.4forums.com/political/debate-challenges/7557-earth-flat-2-print.html"
   ]
  ], 
  "identifier": 7557
 }
]