[
 [
  [
   197893, 
   null, 
   "Matthew S", 
   "I have read now in several posts where several of y'all seem to think that if the majority of people in society, 51% to be percise, believe in a law then it should take effect no matter what the substance. So I ask y'all what do you consider just law vs an unjust law? Is justice subjective? Is one persons just law another persons oppression?", 
   {
    "post_info": {
     "post_title": "What is unjust?"
    }
   }, 
   null, 
   null, 
   1139750580.0
  ], 
  [
   197907, 
   null, 
   "Caprii", 
   "I have read now in several posts where several of y'all seem to think that if the majority of people in society, 51% to be percise, believe in a law then it should take effect no matter what the substance. So I ask y'all what do you consider just law vs an unjust law? Is justice subjective? Is one persons just law another persons oppression?\n\n \n \n Finally, maybe there is a person out there that believe like me believe in JUSTICE and EQUALITY.\n \n We live in a democracy a very UNJUST society.\n \n Being in the \"minority\" SHOULD NOT mean you are valued less, but we are. \n \n Justice is treating all humans with the SAME, \"FREE\", RIGHTS/ ACCESS TO OPPORTUNITY ETC.. Its not a American issue its a global issue. \n \n Matt, go to your closet pick out any piece of clothing. Where is it made? China or India, or do tell which impoverished nation it is from.\n \n If you want JUSTICE we must not abuse the poor like \"wealthy\" countries do.\n \n Even in the US we abuse the poor, look at the many illegals working in factories, farms, restaurants. To the point, where hard labor keeps them impoverished. It doesn't matter if a person is legal or not that is NOT the point, the point is ANY human being who works, long, hard hours should not remain in poverty but they do.\n \n If you care about equality start at home and stop our government from out sourcing our American jobs. Make employers pay an affordable wage. Make sure our laws punish equally. Our victim MUST NOT have lesser rights to the criminal. \n \n There are so many UNJUST things, we can go on forever and that is America alone.", 
   {}, 
   197893, 
   null, 
   1139766120.0
  ], 
  [
   197942, 
   null, 
   "Charliegone", 
   "Finally, maybe there is a person out there that believe like me believe in JUSTICE and EQUALITY.\n \n We live in a democracy a very UNJUST society.\n \n Being in the \"minority\" SHOULD NOT mean you are valued less, but we are. \n \n Justice is treating all humans with the SAME, \"FREE\", RIGHTS/ ACCESS TO OPPORTUNITY ETC.. Its not a American issue its a global issue. \n \n Matt, go to your closet pick out any piece of clothing. Where is it made? China or India, or do tell which impoverished nation it is from.\n \n If you want JUSTICE we must not abuse the poor like \"wealthy\" countries do.\n \n Even in the US we abuse the poor, look at the many illegals working in factories, farms, restaurants. To the point, where hard labor keeps them impoverished. It doesn't matter if a person is legal or not that is NOT the point, the point is ANY human being who works, long, hard hours should not remain in poverty but they do.\n \n If you care about equality start at home and stop our government from out sourcing our American jobs. Make employers pay an affordable wage. Make sure our laws punish equally. Our victim MUST NOT have lesser rights to the criminal. \n \n There are so many UNJUST things, we can go on forever and that is America alone.\n\n \n Yup, like\n \n The government being able to take your house and property away just to build a f***** mall.\n \n The government telling you can't discipline your children thanks to a XXXXX named Spock.\n \n ..geez I can go on on. It is unjust. But its our fault, well I mean those who just don't give a damn about their government. I hear people bitch and complain \"we aren't being paid enough\" but when it comes time to vote they just sit at home and watch the television. Most Americans are so damn gulliblel to the XXXX they here in the news it becomes fact to them...its no wonder the rich and elite rule America.emoticon_mad :xbanghead", 
   {}, 
   197907, 
   null, 
   1139784960.0
  ], 
  [
   197961, 
   null, 
   "Caprii", 
   "Yup, like\n \n The government being able to take your house and property away just to build a f***** mall.\n \n The government telling you can't discipline your children thanks to a XXXXX named Spock.\n \n ..geez I can go on on. It is unjust. But its our fault, well I mean those who just don't give a damn about their government. I hear people bitch and complain \"we aren't being paid enough\" but when it comes time to vote they just sit at home and watch the television. Most Americans are so damn gulliblel to the XXXX they here in the news it becomes fact to them...its no wonder the rich and elite rule America.emoticon_mad :xbanghead\n\n \n \n I know the expanded eminent domain laws are POLITICAL not CONSTITUTIONAL, how is it equal for a rich citizen to take/steal from a poor citizen and the rich one makes a profit....that is equality for all????????\n \n What about Sup. Ct. decision saying its okay to discriminate on race ONLY if its in favor of the minority race. Remember the Michagan University suit where GRADES do NOT make the grade but race does!!!!!! Equality for all...right? I'm EMBARRASED of the supreme court.", 
   {}, 
   197942, 
   null, 
   1139791500.0
  ], 
  [
   198247, 
   null, 
   "Matthew S", 
   "What I mean is this; Were the segragation laws just? More then 51% of the population in the south supported and thought segragation was just.", 
   {}, 
   197961, 
   null, 
   1139888880.0
  ], 
  [
   198267, 
   null, 
   "Charliegone", 
   "No they are not just.", 
   {}, 
   198247, 
   null, 
   1139902380.0
  ], 
  [
   198389, 
   null, 
   "Caprii", 
   "What I mean is this; Were the segragation laws just? More then 51% of the population in the south supported and thought segragation was just.\n\n \n \n This is easy. No, segregation is never justified.\n \n Here is a harder question.\n \n read the following: (from wikipidia)\n \n \nWhen Mugabe became prime minister of Zimbabwa, approximately 70% of the country's arable land was owned by approximately 4,000 descendants of white settlers (1% of the population). However, he reassured white landowners that they had nothing to fear from black majority rule. Mugabe favoured a \"willing buyer, willing seller\" plan for gradual redistribution of land but little was done in his early years in power. However, in 1999 and 2000 Mugabe used force to transfer land ownership from whites to blacks. Since land redistribution, Zimbabwe has transformed from being an exporter of food to a nation with rampant food shortages. Mugabe's supporters, however, blame Western sanctions and political instability instigated by white landowners.\n\n \n \n \n Now I ask, Is it just or unjust for the Africans to take back their lands?\n \n I know some of my female forum members thinks we live in and always lived in a non-suppressive, equal, world, this is another prime example of wealth, race, and gender that dictates who is in control. White, wealthy (british) men 1% of that population in Zimbabwa, owns 70% of the usable arable land.\n \n Are we seeing ANGRY BLACK PEOPLE being angry because black people are simply angry people? ...OR...are we seeing GOOD people trying to fix an unjust act that happened to them for centuries. TAKING BACK THEIR LAND, using the same violence the white used when they STOLE it.\n \n Now you tell me what is just. And is it just for the wealthy white nations to put SANCTIONS on GOOD PEOPLE who want their land back!!!!!\n \n .", 
   {}, 
   198247, 
   null, 
   1139968800.0
  ], 
  [
   198395, 
   null, 
   "OccamsRazor", 
   "On the current situation in Zimbabwe its rather muddy to claim anyone is truely \"just\".\n \n The white settlers should have known better (ie. taking land because it is there and you have guns is unacceptable behaviour) and not taken land from the Zimbabwians and imposed an alien government on them.\n \n Conversley, a similar fate is being forced on the descendants of those white settlers who still remain (and many have not). To buy the land back would have been just to the current generation despite the mistakes of their ancestors.", 
   {}, 
   198389, 
   null, 
   1139972820.0
  ], 
  [
   198402, 
   null, 
   "daewoo", 
   "Now I ask, Is it just or unjust for the Africans to take back their lands?\n \n I know some of my female forum members thinks we live in and always lived in a non-suppressive, equal, world, this is another prime example of wealth, race, and gender that dictates who is in control. White, wealthy (british) men 1% of that population in Zimbabwa, owns 70% of the usable arable land.\n \n Are we seeing ANGRY BLACK PEOPLE being angry because black people are simply angry people? ...OR...are we seeing GOOD people trying to fix an unjust act that happened to them for centuries. TAKING BACK THEIR LAND, using the same violence the white used when they STOLE it.\n \n Now you tell me what is just. And is it just for the wealthy white nations to put SANCTIONS on GOOD PEOPLE who want their land back!!!!!\n\n \n Yes, it is justified, though the method in which it was done leaves a little to be desired. It would have been much better and more practical if they had made a slower transition in order to ensure that their food supply was secure.\n \n There is a similar situation in Venezuela, which is part of the reason that Chavez is so popular. In the case of Venezuela it is white spaniards and brown natives, but the concept is the same.", 
   {}, 
   198389, 
   null, 
   1139975160.0
  ], 
  [
   198453, 
   null, 
   "Jo Bennett", 
   "The difference between Venezuela and Zimbabwe is that Mugabe oppresses his opponents, whatever the colour of their skin, and Venezuela has a much more ethnically mixed population.", 
   {}, 
   198402, 
   null, 
   1140006540.0
  ], 
  [
   200423, 
   null, 
   "C. Langana", 
   "Hello all, I'd like to make a few interjections here if I may.\n \n MattewS: I would like first point you to a piece of British legislation the human rights act of 1998, which brings into force the European Constitution of Human Rights. I.e. it acts as a means to neuter any particularly 'insane' legislation. I would suggest a read of that. Legally an unjust law here in sunny Britain is one that contravenes that. To me an unjust law is one which discriminates in some way against another. I accept that such laws may and will be made, they might need to be but they remain unjust, thus without very good reason for them ought to be over-ruled.\n \n Caprii: Winston Churchill once stated 'It has been said that democracy is the worst form of government except all the others that have been tried.' This is worth considering. The only problem is many of us do not actually live in a democracy, for instance a citizen of the USA lives in a Federal Republic, an altogether different kettle of fish. \n However I concur for the greater part with all of your statements.\n \n Charliegone: voter apathy is a large issue, so you should consider marching those you know to the polling stations and generally encouraging people to go out and vote, even at a local government level a few votes can make a huge difference to your life. \n \n Caprii: your example of Zimbabwae is interesting, it is just that one can say it is not unjust for black Zimbabwaen's to take back their land, what is unjust is for a government to attempt to take them back by force after ignoring the issue for some time. The land was perhaps taken by unjust means a hundred years ago, those people who stole it are now dead, you cannot justify using the same violent means today, indeed by doing so you lower yourself to the same level as the original settler. \n \n Jo Bennett: you are quite correct. You may find contrasting Zimbabwae and South africa around the time of the transition of power (and Mandelas term in office 94-98) to be an interesting read.", 
   {}, 
   198453, 
   null, 
   1141101300.0
  ], 
  [
   200446, 
   null, 
   "Caprii", 
   ".\n \n \n Caprii: your example of Zimbabwae is interesting, it is just that one can say it is not unjust for black Zimbabwaen's to take back their land, what is unjust is for a government to attempt to take them back by force after ignoring the issue for some time. The land was perhaps taken by unjust means a hundred years ago, those people who stole it are now dead, you cannot justify using the same violent means today, indeed by doing so you lower yourself to the same level as the original settler. \n \n \n\n \n I feel bad for zimbabwae and all countries like it, they always have to play the white man's game. Well, I should write to those in power of Zimbabwae and let them know how to beat the white man at his own game. \n \n You see violence was the game a century ago, to do such a thing nowadays would look barberic and would not have the support of the world, so to fix that, they need to start taxing the heck out of people of Zimbabwae. Of Course, you don't want to look like you're targeting \"whites\" but they need to tax those who have income or estate assets. Isn't this what they do in \"civilized\" countries? \n \n So let's propose something that WE ALL DO AROUND THE WORLD, in a civilized world, we force people to pay taxes or else!!! Or else it's imprisonment or taking away of land or both. Sound familiar? that's what our \"civilizied\" countries do now. So Zimbabwae will look bad from taking lands in a violent manner, but they won't look bad taking land for overdue taxes or better yet...eminent domain. \n \n It's funny, in a civilized country like America its OKAY to take someones property so another citizens can make a profit from it. If the black folks in Zimbabwae had that law, eminent domain, we would say they were unjust, criminal, are grossly unfair, but when we do it here, we call it \"the will of the people\" or \"democracy\". Pffft!!\n \n In Zimbabwae, they need TAX REFORM, heard of it? That's what they call it in this country. Zimbabwae needs to HEAVILY tax everyone's annual ESTATE worth 35%. The poor who have nothing, 35% of nothing is NOTHING. For the rich, 35% of 1,000,000 is 350,000. Heck, we have a \"death\" tax, Zimbabwae needs to get creative like the US and start taxing like we do. They may not have many highways and bridges, but they do have streets and can start street tolls. The greedy white folks must have invented the \"toll\". EVERYONE PAYS, but those who are poor get \"cards\" and get to walk the street for FREE, kind of like welfare, those who have an income or estate value, must pay. Toll of 1.00 to walk down the street. Every day, every time. Military at various points, someone has to pay for the security this country needs, isn't that what we say? Someone has to pay for the services!\n \n For those few Native of Zimbabwae who have wealth, well, we have what you call a TAX CREDIT. A heritage tax credit, reimbursement of 35% of your annual estate.\n \n So you are RIGHT violence is not the way to go THESE DAYS, the new way to get the \"bad\" element out is TAX THE HECK OUT OF THEM. We do it, why can't they? Funny, the \"bad\" element over there are the \"white\" people. The \"bad\" element over here are the poor and the middle class people. The Government over there want's to give the land back to \"their\" people. The governments here, wants to take it away from the people who can't afford it and give it to those who can.\n \n So in Zimbabwae, violence is not just, but in America taxing people out of their homes is just. Evicting citizens from their homes because of eminent domian is just. So if those in Zimbabwae learned from us, how to evict land owners all they have to do is start taxing, put in place eminent domain and they are set! That is the just way...right?", 
   {}, 
   200423, 
   null, 
   1141108680.0
  ], 
  [
   200449, 
   null, 
   "daewoo", 
   "I like it. If anybody objects, the govenremtn of Zimbabwe can kill them and call it justice. Hell, it was not that long that we caught a bunch of folks in a building by Waco, pumped it full of noxious chemicals, lit it on fire, machine gunned anybody who tried to escape, and burned dozens of people to ashes. That was done on suspicion of a tax infraction. The government should be able to kill a LOT of people before anybody feels compelled to do anything about it.", 
   {}, 
   200446, 
   null, 
   1141109400.0
  ], 
  [
   200452, 
   null, 
   "C. Langana", 
   "Caprii: I have little knowledge of the tax system of the USA, being on the wrong side of the world pond for that, but no, one should not replace one unjust law with another and I am not advocating that, merely stating that your example's conduct is unjust. It sounds an awful lot like the USA is up to something that hasn't happened here since the highland clearances. I'd be interested to read the relevant legislation if you could point me to it. \n By the by, there is no need to capitalise to emphasise, please stop, your words will speak for themselves.\n \n Daewoo: Waco has also gone down in history as a... erm, rhymes with truck pup. So yes it makes for a good example of overzealous enforcement of the law which when made in a cosy conference room made very good sense. Likewise with ruby ridge or strangely enough an old English case of 'Entick V. Carrington.'", 
   {}, 
   200449, 
   null, 
   1141118760.0
  ], 
  [
   200477, 
   null, 
   "daewoo", 
   "Daewoo: Waco has also gone down in history as a... erm, rhymes with truck pup. So yes it makes for a good example of overzealous enforcement of the law which when made in a cosy conference room made very good sense. Likewise with ruby ridge or strangely enough an old English case of 'Entick V. Carrington.'\n\n \n What got me about both waco and Ruby ridge was the level of public apathy both during and following the events. During the events, the official stories in many cases did not even make sense. People just smiled and nodded, though, ate up whatever line of BS the government felt inclined to put out. After, when it became clear that our governmetn had used tanks against US citizens, and without any real proof that a crime had even been comitted (not that I feel tanks are reasonable law enforment tools anyway), and that dozens fo people had essentially been murdered, nobody was held accountable. The investigation was BS, and the American public just kind of went \"wow, that was bad\" and then went on.", 
   {}, 
   200452, 
   null, 
   1141142940.0
  ], 
  [
   200625, 
   null, 
   "C. Langana", 
   "Daewoo: I concur that the use of tanks and force in general seems altogether strange (what on earth were tanks doing near a police action anyway*).\n I also find it very odd why there was so little public and indeed legal censure for the events at waco. I wonder whether it might be the press presenting the story as 'lunatics all killed.' Any idea why?\n I think the investigation post mortem had a lot to do with the 'Rules of Engagement' in both cases did it not? \n \n *In saying that Tanks were deployed to protect heathrow airport from terrorists once which did make quite good sense at the time - you may get past a SWAT team but a tank platoon? Then again they were also used in Tianamen.", 
   {}, 
   200477, 
   null, 
   1141198440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is unjust?", 
  "url": "http://www.4forums.com/political/civil-rights-debates/7570-what-unjust.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 7570, 
  "discussion_files": [
   [
    "25427.html", 
    "http://www.4forums.com/political/civil-rights-debates/7570-what-unjust-print.html"
   ], 
   [
    "25428.html", 
    "http://www.4forums.com/political/civil-rights-debates/7570-what-unjust-2-print.html"
   ]
  ], 
  "identifier": 7570
 }
]