[
 [
  [
   197911, 
   null, 
   "NeoRly", 
   "Hello! I am a journalist and I am currently on an accreditation of Toronto Sun weekly in Kiev, Ukraine. I came here to see with my own eyes the signs of the upcoming democracy. But now I'm fully convinced Ukraine is positively moving away from democracy towards totalitarism!\n \n In witness of this, I got to know that during the recent Ukraine's National Security council session president Yushchenko would sign a document in secrecy from the Verkhovnaya Rada of Ukraine and the news media (!) that introduces gradual forcing out Russian Black Sea Fleet (BSF) from the Crimea, closing down Russian schools and institutions of higher education, pro-Russian NGOs, cultural centers, newspapers and publishing outfits. \n \n Moreover, Ukrainian mass media would launch a campaign aimed at bring into discredit Russian BSF and I even have information proving that acts of terrorism are being prepared against BSF onshore facilities to be brough to action by Chechen and Tartar hirelings. \n \n Hoo-boy! This is what Ukrainian President would call democracy and friendly relationship with Russia! What is most surprising me about this is that Ukraine has but no other means to protect its southern maritime boundary, therefore having no Russian ship to protect it, the whole Black Sea region including Ukraine and other neighboring states would become vulnerable to outside threats like terroristic threat, smuggling, natural and ecological disasters and so on and so forth.\n \n I suppose that's a real misdeed by Ukrainian president", 
   {
    "post_info": {
     "post_title": "Black Sea Region Becomes Guardless"
    }
   }, 
   null, 
   null, 
   1139769420.0
  ], 
  [
   198380, 
   null, 
   "Caprii", 
   "Well, don't tell us, tell PUTIN!!! \n \n If its good advice say you're American, if its not good advice, say you are British.", 
   {}, 
   197911, 
   null, 
   1139964540.0
  ], 
  [
   198388, 
   null, 
   "Mucusaur", 
   "Another rambling, over friendly one post wonder aimed at the balkans", 
   {}, 
   198380, 
   null, 
   1139967720.0
  ], 
  [
   198448, 
   null, 
   "Iuris", 
   "Balkans? What Balkans? There's no Ukraine in the Balkans, the former USSR never reached the Balkans.\n \n I just keep wondering whether this guy, or bot, is a pro russian writer with little talent, or an anti russian writer intentionally ####### people off against Russia to scorre points for the opposition...", 
   {}, 
   198388, 
   null, 
   1139996400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Black Sea Region Becomes Guardless", 
  "url": "http://www.4forums.com/political/european-politics-economics/7571-black-sea-region-becomes-guardless.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 7571, 
  "discussion_files": [
   [
    "10002.html", 
    "http://www.4forums.com/political/european-politics-economics/7571-black-sea-region-becomes-guardless-print.html"
   ]
  ], 
  "identifier": 7571
 }
]