[
 [
  [
   197949, 
   null, 
   "Steeeeve", 
   "Ok, you won't be next but this is kind of a funny story...the guy is ok\n \n http://www.foxnews.com/story/0,2933,184617,00.html", 
   {
    "post_info": {
     "post_title": "Cheney is shooting people!! You might be next"
    }
   }, 
   null, 
   null, 
   1139787300.0
  ], 
  [
   197979, 
   null, 
   "Matthew S", 
   "Ok, you won't be next but this is kind of a funny story...the guy is ok\n \n http://www.foxnews.com/story/0,2933,184617,00.html\n\n \n \n It wouldn't suprise me if your title ended up being true. Then again he doesn't need to hold the rifle to get someone shot. He just has to send them to Iraq to fight and get blown apart for the Shrubs vendetta war and help line his pockets.", 
   {}, 
   197949, 
   null, 
   1139797500.0
  ], 
  [
   197987, 
   null, 
   "Heads_On_Pikes", 
   "It wouldn't suprise me if your title ended up being true. Then again he doesn't need to hold the rifle to get someone shot. He just has to send them to Iraq to fight and get blown apart for the Shrubs vendetta war and help line his pockets.\n\n \n Bird hunting with a rifle...LOL!", 
   {}, 
   197979, 
   null, 
   1139798820.0
  ], 
  [
   197988, 
   null, 
   "Matthew S", 
   "Bird hunting with a rifle...LOL!\n\n \n \n And a shotgun is not a rifle?", 
   {}, 
   197987, 
   null, 
   1139799000.0
  ], 
  [
   197990, 
   null, 
   "daewoo", 
   "And a shotgun is not a rifle?\n\n \n No, a shotgun is not a rifle.\n \n \n \n \nRoll Call Executive Editor and FOX News contributor Mort Kondracke said since Whittington wasn't hurt badly, it's unlikely much damage would be done to Cheney's reputation as a politician or a hunter. He added that Americans are likely to be deluged with late-night jokes in the coming days.\n\n \n I disagree with this part. I think his reputation as a hunter will be hurt. I would not hunt with the guy. I have been hunting my entire life, usually go bird hunting dozens fo times per year, and have never shot anybody, nor have I ever has anybody in my party shot. It is just not something that happens very often among responsible hunters.", 
   {}, 
   197988, 
   null, 
   1139799780.0
  ], 
  [
   197992, 
   null, 
   "Quetzalcoatl", 
   "http://abcnews.go.com/images/Politics/13e316d1-2697-4192-a699-bf8b1bb19ab7_sp.jpeg\n \"That's right! I shot him, and I'd do it again!\"", 
   {}, 
   197988, 
   null, 
   1139799900.0
  ], 
  [
   198001, 
   null, 
   "Easyrider", 
   "It wouldn't suprise me if your title ended up being true. Then again he doesn't need to hold the rifle to get someone shot. He just has to send them to Iraq to fight and get blown apart for the Shrubs vendetta war and help line his pockets. \n\n \n In what way are his pockets being lined? Spell it out if you think you can.\n \n Heck, Michael Moore has a lot more shares of Haliburton than Cheney does.", 
   {}, 
   197979, 
   null, 
   1139801040.0
  ], 
  [
   198044, 
   null, 
   "Maineiac", 
   "That's kind of like shooting at Joseph Wilson but hittingemoticon_xkill his wife.emoticon_xhoho", 
   {}, 
   198001, 
   null, 
   1139813520.0
  ], 
  [
   198058, 
   null, 
   "Dono", 
   "Chaney can always claim that Whittington posessed WMD and he fired to protect us. Some will buy that.\n Dono", 
   {}, 
   198044, 
   null, 
   1139819520.0
  ], 
  [
   198090, 
   null, 
   "jyoshu", 
   "Unfortunately, gun control groups will probably have a field day with this incident.", 
   {}, 
   198058, 
   null, 
   1139846160.0
  ], 
  [
   198115, 
   null, 
   "billsco", 
   "When news reached France I heard they immediately surrendered.", 
   {}, 
   198090, 
   null, 
   1139858580.0
  ], 
  [
   198125, 
   null, 
   "jim's trucking", 
   "What I don't understand is how a man can be knocked down by a 28 gauge birdshot load from 30 yards away. I can understand the pellets hurting a bit, maybe barely breaking the skin, but at 30 yards (90 feet) the knockdown power is all but gone from such a small load. Maybe it just scared him to the ground.\n \n I understand how these things happen though...been there...done that...lost a hat!", 
   {}, 
   198115, 
   null, 
   1139861460.0
  ], 
  [
   198136, 
   null, 
   "Steeeeve", 
   "When news reached France I heard they immediately surrendered.\n\n \n HAHAHAHA, That made my day :)", 
   {}, 
   198115, 
   null, 
   1139864280.0
  ], 
  [
   198137, 
   null, 
   "jyoshu", 
   "What I don't understand is how a man can be knocked down by a 28 gauge birdshot load from 30 yards away. I can understand the pellets hurting a bit, maybe barely breaking the skin, but at 30 yards (90 feet) the knockdown power is all but gone from such a small load. Maybe it just scared him to the ground.\n \n I understand how these things happen though...been there...done that...lost a hat!\n\n \n It wouldn't surprise me if this whole thing has been embellished some by media reports.", 
   {}, 
   198125, 
   null, 
   1139864280.0
  ], 
  [
   198142, 
   null, 
   "Kronus", 
   "What I don't understand is how a man can be knocked down by a 28 gauge birdshot load from 30 yards away. \n\n \n The guy is 78 years old, he's probably not as spry as he used to be.", 
   {}, 
   198125, 
   null, 
   1139865960.0
  ], 
  [
   198143, 
   null, 
   "billsco", 
   "It wouldn't surprise me if this whole thing has been embellished some by media reports.\n\n \n Yeah, where was all the liberal outrage when Clinton shot somebody in the face? :)", 
   {}, 
   198137, 
   null, 
   1139866440.0
  ], 
  [
   198144, 
   null, 
   "daewoo", 
   "What I don't understand is how a man can be knocked down by a 28 gauge birdshot load from 30 yards away. I can understand the pellets hurting a bit, maybe barely breaking the skin, but at 30 yards (90 feet) the knockdown power is all but gone from such a small load. Maybe it just scared him to the ground.\n \n I understand how these things happen though...been there...done that...lost a hat!\n\n \n When I have hunted in texas we have always used full choke. A full choke 28 gauge will ruin your day at 30 yards. I can't imagine it doing any serious damage, unless maybe you caught a pellet in the eye, but it will wake you up.\n \n \n Course the guy WAS a lawyer. I have trouble getting too excited about a lawyer being shot.", 
   {}, 
   198125, 
   null, 
   1139866740.0
  ], 
  [
   198159, 
   null, 
   "Matthew S", 
   "No, a shotgun is not a rifle.\n \n\n \n \n Sorry but I disagree there are only two types of gun type weapons. Hand guns which are held in one hand and everything else is a rifle.", 
   {}, 
   197990, 
   null, 
   1139870580.0
  ], 
  [
   198160, 
   null, 
   "Bassman", 
   "Sorry but I disagree there are only two types of gun type weapons. Hand guns which are held in one hand and everything else is a rifle.\n\n The key differences, Matthew are the type of ammo used. Shotguns use cartridges containing buckshot or pellets (Jim, correct me if I'm wrong emoticon_xkill ), Whereas rifles use bullets. The classification used here are either sidearms or longarms.", 
   {}, 
   198159, 
   null, 
   1139871240.0
  ], 
  [
   198162, 
   null, 
   "jim's trucking", 
   "Sorry but I disagree there are only two types of gun type weapons. Hand guns which are held in one hand and everything else is a rifle.\nI can imagine the Marine DS having trouble teaching you the difference between your weapon and your gun.\n \n For your edification, a rifle has a long barrel that has been scored (machined, engraved, scratched, etched, whatever you want to call it) on the inside so that the lines spiral toward the end of the barrel. The spirals inside the barrel are called rifling. This causes the projectile (bullet) to spin one way or the other and adds stability to the projectile as it flies toward the target. It keeps the bullet from tumbling through the air.\n \n A shotgun is a smooth bore gun and has no rifling inside the barrel. A shotgun is NOT a rifle. (Because it is a smooth bore firearm.)\n \n Modern cannons usually have rifling. Modern pistols have rifling but are not considered rifles. I don't know how long the barrel (or stock) has to be before a pistol becomes a rifle, but I have seen pistols with extremely long barrels...one that had been fitted with a shoulder stock and forestock (still had the pistol grip and the revolving chamber) so I suppose there's a point at which the name would change.", 
   {}, 
   198159, 
   null, 
   1139871420.0
  ], 
  [
   198165, 
   null, 
   "jim's trucking", 
   "The key differences, Matthew are the type of ammo used. Shotguns use cartridges containing buckshot or pellets (Jim, correct me if I'm wrong emoticon_xkill ), Whereas rifles use bullets. The classification used here are either sidearms or longarms.\nYou're not really wrong, but you're far from right!emoticon_wow \n \n Shotguns can shoot slugs. In this case, the rifling is on the slug. Rifles are little bitty raised lines that spiral around the inside of a barrel (or in the case of shotguns, around the outside of the slug).\n \n Pistols (sidearms) generally have rifling in the barrel, but can be used to shoot shot. I know birdshot (ratshot) is available for .22 and .38 caliber pistols because that's what I used to keep in the first two chambers of all my revolvers. (If the ratshot doesn't get the perp's attention, the hollowpoint-crosscut tip jacketed bullet will cut him in half!--especially from the .357 Magnum Python.)", 
   {}, 
   198160, 
   null, 
   1139871960.0
  ], 
  [
   198172, 
   null, 
   "snakespit", 
   "The guy is 78 years old, he's probably not as spry as he used to be.\n\n Perhaps this is Cheney's problem as well. He is getting up there in the years. When I was growing up I went to the cabin every year for deer and bear. It seemed every year that another one of the old guys would no longer go on the hunt. I understood that it was because they perhaps did not have the stamina, health, coordination or judgement that they once had. We had a name for that: dangerous. (as a side note: I used to feel sorry for them, but as I have grown older, I realize that it can't be all that bad to sit in the cabin drinking beer and playing poker all day!) \n \n Hunting is not an especially dangerous activity, but it can be if the gun is in the wrong hands. As well, bird hunting across a field (what we call brush popping at home) can be more dangerous than sitting in a tree stand, as shots are often taken low to the ground and quickly. When I worked as medic in a rural area I saw people hit with shotgun blasts numerous times. Rarely is it ever life threatening.", 
   {}, 
   198142, 
   null, 
   1139873940.0
  ], 
  [
   198174, 
   null, 
   "snakespit", 
   "Yeah, where was all the liberal outrage when Clinton shot somebody in the face? :)\n\n Actually, I think it was in the dress. :)\n \n \n Aaaahh...nevermind, have a cigar!", 
   {}, 
   198143, 
   null, 
   1139874060.0
  ], 
  [
   198177, 
   null, 
   "jyoshu", 
   "Perhaps this is Cheney's problem as well. He is getting up there in the years. When I was growing up I went to the cabin every year for deer and bear. It seemed every year that another one of the old guys would no longer go on the hunt. I understood that it was because they perhaps did not have the stamina, health, coordination or judgement that they once had. We had a name for that: dangerous. \n\n \n On the other hand, there are many people 65+ years old that I'd rather have along with a shotgun than many 20 somethings I know. Cheney's not THAT old, and is an experienced shooter and hunter.", 
   {}, 
   198172, 
   null, 
   1139874840.0
  ], 
  [
   198180, 
   null, 
   "OccamsRazor", 
   "Sorry but I disagree there are only two types of gun type weapons. Hand guns which are held in one hand and everything else is a rifle.\n\n \n Here you go, Maxim Popenker's Modern Firearms site will teach you all!\n \n As for Cheney, at least he is getting with the people shooting program, even if he is hitting the wrong side.", 
   {}, 
   198159, 
   null, 
   1139877060.0
  ], 
  [
   198183, 
   null, 
   "Dono", 
   "On the other hand, there are many people 65+ years old that I'd rather have along with a shotgun than many 20 somethings I know. Cheney's not THAT old, and is an experienced shooter and hunter.\n\n Thank you. I am 71, I still hit what I aim at and I still know what I'm aiming at before I shoot. \n Has anyone noticed that reporters know nothing about guns or hunting? If a police officer draws his weapon, it is always reported as a revolver. My morning paper said that the wounded man was hit by buckshot pillets. Of course everything is bigger in Texas, but we still use birdshot for quail.\n Dono", 
   {}, 
   198177, 
   null, 
   1139877360.0
  ], 
  [
   198187, 
   null, 
   "beervolcano", 
   "Reminds me of that Aerosmith song...\n \n Cheney's got a gun....emoticon_xkill \n \n :)\n \n Lucky for Cheney his friend won't press charges.\n \n Cheney sucks...Big Time...emoticon_xhoho", 
   {
    "post_info": {
     "post_title": "The most dangerous game."
    }
   }, 
   198183, 
   null, 
   1139877660.0
  ], 
  [
   198193, 
   null, 
   "Waxy", 
   "Thank you. I am 71, I still hit what I aim at and I still know what I'm aiming at before I shoot.\n\n \n Precisely. This kinda thing should just never happen, unfortunately, it does. Usually due to inexperience (not in this case apparently), or carelessness.\n \n I for one wouldn't be going out hunting with Mr. Cheney any time soon, Mr. Whittington either, you have to be pretty \"dumb\" for lack of a better word to wander down range in front of other hunters.\n \n In his defense, I doubt many people here wouldn't hit the deck post haste if fired upon by a shotgun.\n \n \nHas anyone noticed that reporters know nothing about guns or hunting?\n \n \n My observation goes even further into generalizations - those that are most opposed to guns are those that know the least about them, despite their righteous claims to the contrary. I think this thread has been a prime example of that.\n \n Waxy", 
   {}, 
   198183, 
   null, 
   1139878020.0
  ], 
  [
   198199, 
   null, 
   "georged", 
   "Thank you. I am 71, I still hit what I aim at and I still know what I'm aiming at before I shoot. \n Has anyone noticed that reporters know nothing about guns or hunting? If a police officer draws his weapon, it is always reported as a revolver. My morning paper said that the wounded man was hit by buckshot pillets. Of course everything is bigger in Texas, but we still use birdshot for quail.\n Dono\n\n \n Cheney just may use buckshot for quail, that could be his style.", 
   {}, 
   198183, 
   null, 
   1139878500.0
  ], 
  [
   198221, 
   null, 
   "Matthew S", 
   "Here you go, Maxim Popenker's Modern Firearms site will teach you all!\n \n \n\n \n \n The site only confirms my statement if it takes one hand to fire it is a gun if it takes two hands it is a rifle.", 
   {}, 
   198180, 
   null, 
   1139881140.0
  ], 
  [
   198228, 
   null, 
   "OccamsRazor", 
   "The site only confirms my statement if it takes one hand to fire it is a gun if it takes two hands it is a rifle.\n\n \n So its because you dislike guns you take the philistine's position then?", 
   {}, 
   198221, 
   null, 
   1139882340.0
  ], 
  [
   198236, 
   null, 
   "snakespit", 
   "On the other hand, there are many people 65+ years old that I'd rather have along with a shotgun than many 20 somethings I know. Cheney's not THAT old, and is an experienced shooter and hunter.\n\n Agreed. Please understand that I did not mean that all older people are dangerous while hunting or shooting, but it often happens that a person reaches the age where they are no longer safe to hunt. It is the same as driving. There are many who continue to hunt well into their 80's, and I know quite a few of them. If someone is capable of safely doing so, great. But I also have seen many over the years \"retire\" to the cabin because they have the sense to know when it is no longer safe. I hope my previous post did not offend anyone.", 
   {}, 
   198177, 
   null, 
   1139884500.0
  ], 
  [
   198241, 
   null, 
   "daewoo", 
   "The site only confirms my statement if it takes one hand to fire it is a gun if it takes two hands it is a rifle.\n\n \n No, it doesn't, which is why there is a seperate category for \"shotgun\"\n \n What makes a \"rifle\" a \"rifle\" is the \"rifling\". From dictionary.com\n \n \nri·fle1 ( P ) Pronunciation Key (rfl)\n n. \n \n A firearm with a rifled bore, designed to be fired from the shoulder. \n An artillery piece or naval gun with such spiral grooves. \n rifles Troops armed with rifles. \n\n \n \nshot·gun ( P ) Pronunciation Key (shtgn)\n n. \n A smoothbore gun that fires shot over short ranges. Also called scattergun\n\n \n \n \n Rifles were so named because they were originally the only weapons with rifled barrels, and the term \"rifle\" distinguished them from a \"musket\", which had no \"rifling\".\n \n Pistols did not generally have rifled barrels until later for 2 reasons. The first is that they were not generally considered accurate enough to mess with rifling the barrel. This was due in large part to the amount of powder required for propulsion and the length of the pistols barrel. The powder and ball took up so much of the barrel that the remaining barrel length was not enough to stabilize the round.\n \n Once multiple fire guns became more popular (revolvers), they were generally built with longer barrels, which greatly aided accuracy. It was not until revolvers came on the scene though that you saw a lot of rifled pistol barrels. They certainly existed, but were not common and were a pretty expensive option.\n \n It could be argued that a shotgun with a rifled barrel is a rifle. There is a specific exemtion under current law for this requiring that for something to be considered a \"rifle\" it must utilize metallic cartriges.\n \n \nModern cannons usually have rifling. Modern pistols have rifling but are not considered rifles. I don't know how long the barrel (or stock) has to be before a pistol becomes a rifle, but I have seen pistols with extremely long barrels...one that had been fitted with a shoulder stock and forestock (still had the pistol grip and the revolving chamber) so I suppose there's a point at which the name would change.\n\n \n I would imagine barrel length, etc.. would be a matter of semantics. The buttstock is a matter of law, though. If it has a buttstock, it is legally a rifle and thus must have a 16\" or longer barrel. If the weapon in quesiton has EVER had a buttstock, it is a rifle regardless of whether the buttstock is still attached. If it has PROVISIONS to attach a buttstock, it is a rifle.\n \n There are a couple of companies out there building AK based pistols. In order to do this, they have to use a new reciever (because in teh eyes of the law the reciever is the firearm) and fill the rear trunnion so the provisions for a buttstock are gone.", 
   {}, 
   198221, 
   null, 
   1139887320.0
  ], 
  [
   198243, 
   null, 
   "Matthew S", 
   "No, it doesn't, which is why there is a seperate category for \"shotgun\"\n \n What makes a \"rifle\" a \"rifle\" is the \"rifling\". From dictionary.com\n \n \n \n \n \n \n \n Rifles were so named because they were originally the only weapons with rifled barrels, and the term \"rifle\" distinguished them from a \"musket\", which had no \"rifling\".\n \n Pistols did not generally have rifled barrels until later for 2 reasons. The first is that they were not generally considered accurate enough to mess with rifling the barrel. This was due in large part to the amount of powder required for propulsion and the length of the pistols barrel. The powder and ball took up so much of the barrel that the remaining barrel length was not enough to stabilize the round.\n \n Once multiple fire guns became more popular (revolvers), they were generally built with longer barrels, which greatly aided accuracy. It was not until revolvers came on the scene though that you saw a lot of rifled pistol barrels. They certainly existed, but were not common and were a pretty expensive option.\n \n It could be argued that a shotgun with a rifled barrel is a rifle. There is a specific exemtion under current law for this requiring that for something to be considered a \"rifle\" it must utilize metallic cartriges.\n \n \n \n I would imagine barrel length, etc.. would be a matter of semantics. The buttstock is a matter of law, though. If it has a buttstock, it is legally a rifle and thus must have a 16\" or longer barrel. If the weapon in quesiton has EVER had a buttstock, it is a rifle regardless of whether the buttstock is still attached. If it has PROVISIONS to attach a buttstock, it is a rifle.\n \n There are a couple of companies out there building AK based pistols. In order to do this, they have to use a new reciever (because in teh eyes of the law the reciever is the firearm) and fill the rear trunnion so the provisions for a buttstock are gone.\n\n \n \n \n Tomato Toahtoe", 
   {}, 
   198241, 
   null, 
   1139888040.0
  ], 
  [
   198245, 
   null, 
   "daewoo", 
   "Tomato Toahtoe\n\n \n more like \"ignorance of subject matter/knowledgable on subject matter\"", 
   {}, 
   198243, 
   null, 
   1139888220.0
  ], 
  [
   198246, 
   null, 
   "daewoo", 
   "Thank you. I am 71, I still hit what I aim at and I still know what I'm aiming at before I shoot. \n Has anyone noticed that reporters know nothing about guns or hunting? If a police officer draws his weapon, it is always reported as a revolver. My morning paper said that the wounded man was hit by buckshot pillets. Of course everything is bigger in Texas, but we still use birdshot for quail.\n Dono\n\n \n \n You are welcome to hunt my place any time, Dono emoticon_xgood \n \n And every rifle is either an \"assault rifle\", an \"AK-47\", or a \"sniper rifle\"\n \n As far as using buckshot for quail...I don't know. I had a buddy come up from TX last year to go deer hunting. He brought a custom made double barrel rifle....in .50 BMG. Texans do funny things like that sometimes.", 
   {}, 
   198183, 
   null, 
   1139888700.0
  ], 
  [
   198249, 
   null, 
   "Heads_On_Pikes", 
   "Thank you. I am 71, I still hit what I aim at and I still know what I'm aiming at before I shoot. \n Has anyone noticed that reporters know nothing about guns or hunting? If a police officer draws his weapon, it is always reported as a revolver. My morning paper said that the wounded man was hit by buckshot pillets. Of course everything is bigger in Texas, but we still use birdshot for quail.\n Dono\n\n \n I think I heard tonight the shotgun used was a 28 gauge and indeed the shells were loaded with tiny birdshot. I have never hunted a small bird like quail nor fired a shotgun smaller than a 20 gauge but it makes sense that one would use such a gun so as not to blow half the bird to smithereens.\n \n I gotta agree wholeheartedly at the hilarious news reporting when it comes to anything involving a firearm. A personal pet peeve is everything ends up being described as \"a high-powered weapon\". It's a toss up between that and headlines like \"SUV hits and kills a man\" for giggles.\n \n Well, it was bound to happen:\n \n http://dickcheneyquailhunt.cf.huffingtonpost.com/", 
   {}, 
   198183, 
   null, 
   1139889360.0
  ], 
  [
   198251, 
   null, 
   "Dono", 
   "You are welcome to hunt my place any time, Dono emoticon_xgood \n \n And every rifle is either an \"assault rifle\", an \"AK-47\", or a \"sniper rifle\"\n \n As far as using buckshot for quail...I don't know. I had a buddy come up from TX last year to go deer hunting. He brought a custom made double barrel rifle....in .50 BMG. Texans do funny things like that sometimes.\n\n You never know when you are going to run into a rouge elephant or a cape buffalo, it pays to be ready.", 
   {}, 
   198246, 
   null, 
   1139890140.0
  ], 
  [
   198261, 
   null, 
   "daewoo", 
   "You never know when you are going to run into a rouge elephant or a cape buffalo, it pays to be ready.\n\n \n He said \"you can never have too much gun\".\n \n I told him \"try for a gut shot, otherwise you are going to ruin a lot of meat\"\n \n He had loaded his own rounds, hollow points, and he hit a big buck (huge body, kind of sad little 6 point rack) in the left shoulder. It blew the right shoulder OFF. I have never seen a deer killed so completely that has not been run over by a semi. \n \n I guess on the up side, we didn't have to track it. Without the hollow point's, I think he could have turned a butt shot into a head shot.emoticon_xkill", 
   {}, 
   198251, 
   null, 
   1139894040.0
  ], 
  [
   198262, 
   null, 
   "daewoo", 
   "I think I heard tonight the shotgun used was a 28 gauge and indeed the shells were loaded with tiny birdshot. I have never hunted a small bird like quail nor fired a shotgun smaller than a 20 gauge but it makes sense that one would use such a gun so as not to blow half the bird to smithereens.\n \n \n\n \n IMO a 28 gauge is kind of a funny choice for a quail gun. Around here, most shoot 20 gauge or 12 guage. Whether you blow the bird to smithereens or not is a function of pellet size, choke, and range. A 12 guage firing 7 1/2 shot through a modified choke at 20 yards will kill your quail without severe damage. A .410 with a full choke and firing #6 shot will pulverize the bird at that range.", 
   {}, 
   198249, 
   null, 
   1139894280.0
  ], 
  [
   198263, 
   null, 
   "snakespit", 
   "Everything that I hunt with a shotgun is with my Ithaca Model 37 20ga. As several have pointed out, it is not so much the shotgun, but the shell fired from the shotgun that really matters. I found this 20ga. to be useful for everything from rabbit to grouse, pheasant, and have even taken a deer with a slug. This is a good all around shotgun, but the proper shells are the key.", 
   {}, 
   198262, 
   null, 
   1139897100.0
  ], 
  [
   198298, 
   null, 
   "jyoshu", 
   "What's interesting about this whole thing is that the natl. media is trying to play this up as some kind of scandal; they're mad because they think it took too long for them to be informed. Boo hoo!! emoticon_rolleyes", 
   {}, 
   198263, 
   null, 
   1139936100.0
  ], 
  [
   198299, 
   null, 
   "Iuris", 
   "I read a source that the hunting party were election campaign contributors. If that's true, maybe this would count as a plus emoticon_xkill", 
   {}, 
   198298, 
   null, 
   1139937300.0
  ], 
  [
   198301, 
   null, 
   "Waxy", 
   "The site only confirms my statement if it takes one hand to fire it is a gun if it takes two hands it is a rifle.\n\n \n \nTomato Toahtoe\n\n \n I don't understand your intentionally ignorant and flippant stance on this.\n \n People have gone out of their way to provide you with information and knowledge in the hopes of increasing your understanding of the subject.\n \n How can you expect anyone to take you and your posts in other areas seriously and make an effort to improve their understanding when you show a blatant disregard for the knowledge and posts of others on a topic that you clearly know little about?\n \n Understanding and compromise are two way streets Matthew S, think about that while you're off posting in your other favourite sections trying to educate others and increase their understanding. \n \n Waxy", 
   {}, 
   198243, 
   null, 
   1139940420.0
  ], 
  [
   198302, 
   null, 
   "Waxy", 
   "What's interesting about this whole thing is that the natl. media is trying to play this up as some kind of scandal; they're mad because they think it took too long for them to be informed. Boo hoo!! emoticon_rolleyes\n\n \n I actually agree with you on this one. emoticon_wow \n \n No question Cheney is a doofus, but it's not like it's a big scandal, he'll just have a harder time finding hunting partners from now on.\n \n Waxy", 
   {}, 
   198298, 
   null, 
   1139940660.0
  ], 
  [
   198308, 
   null, 
   "simone", 
   "Both shotguns and rifles require two hands to use, one to steady the barrel in the right direction, the other to hold the stock and to trigger the weapon. One is obliged to use one eye to sight the weapon, the new weaponry have little scopes to aid one in sighting and aiming, older weaponry had a little knob very close to one's eye that was lined up with a little slot further down the barrel.\n \n Automatic weaponry with huge armories of bullets and rapid-fire capacity--I don't know if those sorts of weapons are designed to be held with a single hand--I am sure that weapon-rabid individuals would truly like to have two weapons of this sort, one for each hand, inasmuch if you missed the first shot you would have so many bullets left to fire off rapidly that you would surely spatter your prey with at least some of those unless you were totally blind.\n \n Shotguns are designed for shortrange scattering of missiles, I guess primarily designed for wild fowl which are apt to move rapidly so that at least some of the scattered pellets would wing some of the creature.\n \n Rifles have one single lethal bullet per trigger pull and are used for larger game, I suppose that if one is attempting to gun down a buffalo or a rhino or possibly an elephant, one must have a larger calibre weapon with bullets designed to have a wider splattering effect.\n \n I understand that some bullets are designed to be quite nasty with they make contact with a soft body and the underlying bone--they flatten out and chop huge holes through the body of the prey, human or animal.", 
   {}, 
   198302, 
   null, 
   1139943720.0
  ], 
  [
   198323, 
   null, 
   "doG", 
   "I'd still go hunting with Cheney before I'd get in a car with Ted Kennedy behind the wheel.....", 
   {}, 
   198308, 
   null, 
   1139946060.0
  ], 
  [
   198347, 
   null, 
   "daewoo", 
   "Automatic weaponry with huge armories of bullets and rapid-fire capacity--I don't know if those sorts of weapons are designed to be held with a single hand--I am sure that weapon-rabid individuals would truly like to have two weapons of this sort, one for each hand, inasmuch if you missed the first shot you would have so many bullets left to fire off rapidly that you would surely spatter your prey with at least some of those unless you were totally blind.\n\n \n Automatic weaponry with huge armories of bullets are not intended to be held in the hand. They are intended to be mounted. The only way you get \"huge armories of bullets\" is if they are belt fed.\n \n \n \nI understand that some bullets are designed to be quite nasty with they make contact with a soft body and the underlying bone--they flatten out and chop huge holes through the body of the prey, human or animal.\n\n \n Shooting something is not synonomous with petting it. You shoot something because you want to make it dead. As such, huge holes through the body of the prey is a desirable result.", 
   {}, 
   198308, 
   null, 
   1139957160.0
  ], 
  [
   198552, 
   null, 
   "Dono", 
   "I got another chuckle from this mornings paper. It seems that local cops shot and killed a man during a domestic disturbance call. One cop was shot in the hand and the article read. \"since the perpetrator had no gun, it is suspected the officer was hit with friendly fire\".\n Dono", 
   {}, 
   198347, 
   null, 
   1140044460.0
  ], 
  [
   198566, 
   null, 
   "snakespit", 
   "I got another chuckle from this mornings paper. It seems that local cops shot and killed a man during a domestic disturbance call. One cop was shot in the hand and the article read. \"since the perpetrator had no gun, it is suspected the officer was hit with friendly fire\".\n Dono\n\n The term \"friendly fire\" always bothered me. I contend that no fire is friendly when it is whizzing by your head.", 
   {}, 
   198552, 
   null, 
   1140048480.0
  ], 
  [
   198580, 
   null, 
   "coolcodemn3", 
   "I'd still go hunting with Cheney before I'd get in a car with Ted Kennedy behind the wheel.....\n\n same here.", 
   {}, 
   198323, 
   null, 
   1140054240.0
  ], 
  [
   198590, 
   null, 
   "sglaine", 
   "I always thought that you had to make a positive ID before you shot your pray. Well I guess in Texas that does not matter. And for Cheney to take so long to come to the public was wrong also. He should have taken responsibility right away to the public.\n \n As far as I'm concern just another way to cover there tracks.", 
   {}, 
   198302, 
   null, 
   1140056400.0
  ], 
  [
   198604, 
   null, 
   "sglaine", 
   "I actually agree with you on this one. emoticon_wow \n \n No question Cheney is a doofus, but it's not like it's a big scandal, he'll just have a harder time finding hunting partners from now on.\n \n Waxy\n\n \n \n (LOL) No not really there be suckers that will join him.emoticon_xagree", 
   {}, 
   198302, 
   null, 
   1140058560.0
  ], 
  [
   198606, 
   null, 
   "sglaine", 
   "I'd still go hunting with Cheney before I'd get in a car with Ted Kennedy behind the wheel.....\n\n \n \n There is a new Bumper Sticker out on that.\n \n But tell you the truth I'll pass on both.emoticon_xgood", 
   {}, 
   198323, 
   null, 
   1140058740.0
  ], 
  [
   198618, 
   null, 
   "Maineiac", 
   "Are the quail in Texas flightless? Cheney was firing ground level when he shot the guy. I'v never hunted quail , but firing into the brush like that would be asking for trouble. If I wasn't sure where everybody was, I wouldn't even fire.\n \n Accidents happen, but they are usually caused by someone using poor judgement. The lack of notification shows bad judgement as well.", 
   {}, 
   198606, 
   null, 
   1140059940.0
  ], 
  [
   198619, 
   null, 
   "sglaine", 
   "Are the quail in Texas flightless? Cheney was firing ground level when he shot the guy. I'v never hunted quail , but firing into the brush like that would be asking for trouble. If I wasn't sure where everybody was, I wouldn't even fire.\n \n Accidents happen, but they are usually caused by someone using poor judgement. The lack of notification shows bad judgement as well.\n\n \n \n And that is why you should know what your shooting at first.", 
   {}, 
   198618, 
   null, 
   1140060240.0
  ], 
  [
   198622, 
   null, 
   "georged", 
   "Are the quail in Texas flightless? Cheney was firing ground level when he shot the guy. I'v never hunted quail , but firing into the brush like that would be asking for trouble. If I wasn't sure where everybody was, I wouldn't even fire.\n \n Accidents happen, but they are usually caused by someone using poor judgement. The lack of notification shows bad judgement as well.\n\n \n Growing up in Texas and learning to hunt there, quail included, I'd be ashamed to admit I had violated that all-important rule you mentioned,\n knowing exactly where everyone is before pulling a trigger. The injured party was fortunate it was a 28-gauge load of birdshot. If being shot by a careless hunter can be considered lucky. \n \n I guess one would have to be very powerful to avoid calling even local authorities for a gunshot wound. Everywhere I've ever lived in the US, gunshots resulting in injury are local police matters. Current administration seems above the law in many ways. \n \n As far as the brush goes, to get a double on quail one almost has to take the first bird at just above brush level to successfully get the second. Quail are small, fly fast, low, scattered and for very short distances. But I learned to bird hunt with a Winchester Model 12 12-gauge pump and even #7 shot could put somebody down for good at that distance.", 
   {}, 
   198618, 
   null, 
   1140061680.0
  ], 
  [
   198624, 
   null, 
   "Maineiac", 
   "I find it strange the Secret Service guys didn't know where everyone was.\n Maybe they were hunting too.emoticon_xhoho", 
   {}, 
   198622, 
   null, 
   1140062100.0
  ], 
  [
   198625, 
   null, 
   "georged", 
   "I find it strange the Secret Service guys didn't know where everyone was.\n Maybe they were hunting too.emoticon_xhoho\n\n \n Telling the boss he's being a real dummy is an undesirable career path for most civil service workers. Anyone there knows it's a yes sir detail when dealing at that power level with someone who has a loaded shotgun in his hands and ambulances standing by because his physical health is known as very fragile. I said physical.", 
   {}, 
   198624, 
   null, 
   1140063900.0
  ], 
  [
   198628, 
   null, 
   "Steeeeve", 
   "Telling the boss he's being a real dummy is an undesirable career path for most civil service workers. Anyone there knows it's a yes sir detail when dealing at that power level with someone who has a loaded shotgun in his hands and ambulances standing by because his physical health is known as very fragile. I said physical.\n\n \n haha, If you are gonna have to get shot you might as well do it around Cheney since he has doctors around him at all times.", 
   {}, 
   198625, 
   null, 
   1140064860.0
  ], 
  [
   198636, 
   null, 
   "snakespit", 
   "I always thought that you had to make a positive ID before you shot your pray. Well I guess in Texas that does not matter. And for Cheney to take so long to come to the public was wrong also. He should have taken responsibility right away to the public.\n \n As far as I'm concern just another way to cover there tracks.\n\n What is the big deal about this? Simply because he is the vice president he has to notify the American public as soon as something like this happens? In his place I would have left all decisions about releasing information to the family of Whittington, our of respect for the family. I personally could care less what the vice president did. It was an accident, albeit a careless accident.\n \n But yes, one of the cardinal rules of shooting any firearm is to know your target and what is beyond your target. No excuses.", 
   {}, 
   198590, 
   null, 
   1140068520.0
  ], 
  [
   198666, 
   null, 
   "sglaine", 
   "What is the big deal about this? Simply because he is the vice president he has to notify the American public as soon as something like this happens? In his place I would have left all decisions about releasing information to the family of Whittington, our of respect for the family. I personally could care less what the vice president did. It was an accident, albeit a careless accident.\n \n But yes, one of the cardinal rules of shooting any firearm is to know your target and what is beyond your target. No excuses.\n\n \n \n It is a big deal in deed. Using powers for not taking responsibility for his own actions. And to go one step further if it was a regular guy that was involved in a shooting like that. There would and might have been charges brought because of negligence.", 
   {}, 
   198636, 
   null, 
   1140107040.0
  ], 
  [
   198686, 
   null, 
   "jim's trucking", 
   "What is the big deal about this? Simply because he is the vice president he has to notify the American public as soon as something like this happens? In his place I would have left all decisions about releasing information to the family of Whittington, out of respect for the family. I personally could care less what the vice president did. It was an accident, albeit a careless accident.\n \n But yes, one of the cardinal rules of shooting any firearm is to know your target and what is beyond your target. No excuses.\nFor the most part, I agree.\n \n However, anyone who has done some serious quail hunting (or any fast-moving target hunting) knows that the background is least considered when tracking and leading the bird (or rabbit) with the gun barrel. Sometimes, the reaction time between when you decide to fire and when you actually fire allows your barrel to move into a background that you have not fully studied, especially with low flying birds.\n \n It's greatly different from scoping in on a stationary deer, wild turkey or mountain goat. The hunter has sufficient time to examine the area around the target and determine that no other hunters are in the line of fire. Not so with hunting small game birds. One hardly ever steadies the gun prior to triggering. It's a moving target.\n \n In group hunts, people need to be aware of where everyone else is. I fault the shooter and the shootee in this regard. The shootee has already admitted he should have announced his position. The shooter has already taken full responsibility. They both erred.\n \n On the other hand, those who have never been hunting, despise guns and know nothing of how things work in the field will likely conjure up a picture of Cheney taking dead aim on a man in orange hunting gear and grinning demonically as his deliberately blows his friend away. This is NOT what happened.", 
   {}, 
   198666, 
   null, 
   1140114300.0
  ], 
  [
   198713, 
   null, 
   "jyoshu", 
   "Personally, I think it's silly that Democrats and the media are trying to play this up as some secrecy scandal. It seems to me there are much more pertinent issues over which to bring the secrecy accusation. Furthermore, it's not like the media didn't find out or wasn't alerted. The media isn't obligated to receive the info any certain way--there's nothing wrong with the way the information was released.\n \n Democrats have really been increasing the smear campaign lately, and this is only a part of that.", 
   {}, 
   198686, 
   null, 
   1140120000.0
  ], 
  [
   198728, 
   null, 
   "Matthew S", 
   "Personally, I think it's silly that Democrats and the media are trying to play this up as some secrecy scandal. It seems to me there are much more pertinent issues over which to bring the secrecy accusation. Furthermore, it's not like the media didn't find out or wasn't alerted. The media isn't obligated to receive the info any certain way--there's nothing wrong with the way the information was released.\n \n Democrats have really been increasing the smear campaign lately, and this is only a part of that.\n\n \n \n Wow I don't really know how to respond to this statement. I guess what the republicans did to clintopn doesn't count?", 
   {}, 
   198713, 
   null, 
   1140124440.0
  ], 
  [
   198730, 
   null, 
   "sglaine", 
   "Personally, I think it's silly that Democrats and the media are trying to play this up as some secrecy scandal. It seems to me there are much more pertinent issues over which to bring the secrecy accusation. Furthermore, it's not like the media didn't find out or wasn't alerted. The media isn't obligated to receive the info any certain way--there's nothing wrong with the way the information was released.\n \n Democrats have really been increasing the smear campaign lately, and this is only a part of that.\n\n \n \n Wow what a post but did you have a problem with Clinton getting an innocent BJ?", 
   {}, 
   198713, 
   null, 
   1140124620.0
  ], 
  [
   198733, 
   null, 
   "georged", 
   "Wow what a post but did you have a problem with Clinton getting an innocent BJ?\n\n \n To many Christians extramarital sex is a far more serious offense than plugging an innocent party.", 
   {}, 
   198730, 
   null, 
   1140125460.0
  ], 
  [
   198734, 
   null, 
   "jim's trucking", 
   "Wow what a post but did you have a problem with Clinton getting an innocent BJ?\nI think the BJ topic has been discussed many times. I don't begrudge the man a BJ from a consenting adult intern. It's not the BJ that caused impeachment. It's how and when he lied about it. He lied under oath and obstructed justice. The BJ was only the sparking incident. If Cheney is found to have lied under oath about the hunting incident, I will call for his political demise also. There is no comparison between what Clinton did and what Cheney did.", 
   {}, 
   198730, 
   null, 
   1140125580.0
  ], 
  [
   198736, 
   null, 
   "sglaine", 
   "I think the BJ topic has been discussed many times. I don't begrudge the man a BJ from a consenting adult intern. It's not the BJ that caused impeachment. It's how and when he lied about it. He lied under oath and obstructed justice. The BJ was only the sparking incident. If Cheney is found to have lied under oath about the hunting incident, I will call for his political demise also. There is no comparison between what Clinton did and what Cheney did.\n\n \n \n (LOL) I'm sure that Cheney is not a saint for one. And for 2 I do not trust a word he says. What a joke.emoticon_xgood", 
   {}, 
   198734, 
   null, 
   1140125700.0
  ], 
  [
   198761, 
   null, 
   "snakespit", 
   "It is a big deal in deed. Using powers for not taking responsibility for his own actions. And to go one step further if it was a regular guy that was involved in a shooting like that. There would and might have been charges brought because of negligence.\n\n First off, it is pure speculation on your part to suggest that a \"regular guy\" would have been charged with a crime. I have known personally of several hunting accidents, and in none of the cases was anyone charged with a crime. \n \n And Cheney has taken responsibility for his actions. He accepts full responsibility for the shooting. I am not aware of any law or statute requiring that if the vice president shoots someone that he is required to personally notify the media within a certain amount of time...are you?", 
   {}, 
   198666, 
   null, 
   1140133980.0
  ], 
  [
   198765, 
   null, 
   "snakespit", 
   "For the most part, I agree.\n \n However, anyone who has done some serious quail hunting (or any fast-moving target hunting) knows that the background is least considered when tracking and leading the bird (or rabbit) with the gun barrel. Sometimes, the reaction time between when you decide to fire and when you actually fire allows your barrel to move into a background that you have not fully studied, especially with low flying birds.\n \n It's greatly different from scoping in on a stationary deer, wild turkey or mountain goat. The hunter has sufficient time to examine the area around the target and determine that no other hunters are in the line of fire. Not so with hunting small game birds. One hardly ever steadies the gun prior to triggering. It's a moving target.\n \n In group hunts, people need to be aware of where everyone else is. I fault the shooter and the shootee in this regard. The shootee has already admitted he should have announced his position. The shooter has already taken full responsibility. They both erred.\n \n On the other hand, those who have never been hunting, despise guns and know nothing of how things work in the field will likely conjure up a picture of Cheney taking dead aim on a man in orange hunting gear and grinning demonically as his deliberately blows his friend away. This is NOT what happened.\n\n I have done a good bit of bird hunting, mostly grouse, but quail and pheasant as well. It is true that when shooting you are often after a moving target, and not \"focused\" on the background as you would be when still hunting. However, it is the responsibility of the hunters to be aware of their surroundings, and their positions relative to the other hunters. It is what we call in the aviation business situational awareness. If I don't know where Bob is, I am going to find out where he is regardless of how many birds fly out in front of me...before I shoot my gun.", 
   {}, 
   198686, 
   null, 
   1140134640.0
  ], 
  [
   198788, 
   null, 
   "sglaine", 
   "First off, it is pure speculation on your part to suggest that a \"regular guy\" would have been charged with a crime. I have known personally of several hunting accidents, and in none of the cases was anyone charged with a crime. \n \n And Cheney has taken responsibility for his actions. He accepts full responsibility for the shooting. I am not aware of any law or statute requiring that if the vice president shoots someone that he is required to personally notify the media within a certain amount of time...are you?\n\n \n Yes has but he was late as hell in saying he was sorry. And as far as I'm concerned I will not give Cheney sympathy. If he can't tell what the hell he is shooting at he should not even have a gun. Or a water pistol as far as that goes.\n \n Now if a Democrat ever did what Cheney did the Republicans would want that Democrat shoot.", 
   {}, 
   198761, 
   null, 
   1140137760.0
  ], 
  [
   198850, 
   null, 
   "jyoshu", 
   "Yes has but he was late as hell in saying he was sorry.\n\n \n No he wasn't--from what has been reported he was apologetic with the shooting accident victim from the get-go.\n \n After all, that's the only person he ever owed any apology to for the accident.", 
   {}, 
   198788, 
   null, 
   1140152880.0
  ], 
  [
   198862, 
   null, 
   "snakespit", 
   "Yes has but he was late as hell in saying he was sorry. And as far as I'm concerned I will not give Cheney sympathy. If he can't tell what the hell he is shooting at he should not even have a gun. Or a water pistol as far as that goes.\n\n Yes, as Jyoshu so aptly pointed out, Cheney only owes an appology to Whittington. From what Cheney said in the interview with Fox, it even appears that he appologized to Whittington while he was still lying on the ground, before they put him into the ambulance. He followed up with the hospital the same day on Whittingtons condition, and appears to be in close contact with him since the incident. \n \n And sorry to burst your ego-bubble, but I don't think I heard Cheney ask for sympathy from the American public. He made a mistake, one that happens every now and then in hunting. Yes, it was a lack of caution and good judgement in this situation that led to the mistake, but that does not mean that Cheney is a reckless or dangerous person that should never be allowed to go hunting again. We all make mistakes and have accidents now and then.\n \n \nNow if a Democrat ever did what Cheney did the Republicans would want that Democrat shoot.\n\n You expect people to take you seriously when you post things like this?", 
   {}, 
   198788, 
   null, 
   1140159000.0
  ], 
  [
   198948, 
   null, 
   "sglaine", 
   "Yes, as Jyoshu so aptly pointed out, Cheney only owes an appology to Whittington. From what Cheney said in the interview with Fox, it even appears that he appologized to Whittington while he was still lying on the ground, before they put him into the ambulance. He followed up with the hospital the same day on Whittingtons condition, and appears to be in close contact with him since the incident. \n \n And sorry to burst your ego-bubble, but I don't think I heard Cheney ask for sympathy from the American public. He made a mistake, one that happens every now and then in hunting. Yes, it was a lack of caution and good judgement in this situation that led to the mistake, but that does not mean that Cheney is a reckless or dangerous person that should never be allowed to go hunting again. We all make mistakes and have accidents now and then.\n \n \n You expect people to take you seriously when you post things like this?\n\n \n \n Hate to burst you bubble but Cheney owes Whittington more then an apology . After all if Cheney shot you. You would want to be compensated for injurys and pain and suffering. And to down play this off like nothing is pretty stupid.", 
   {}, 
   198862, 
   null, 
   1140204900.0
  ], 
  [
   198963, 
   null, 
   "snakespit", 
   "Hate to burst you bubble but Cheney owes Whittington more then an apology . After all if Cheney shot you. You would want to be compensated for injurys and pain and suffering. And to down play this off like nothing is pretty stupid.\n\n So you are saying that Whittington needs to sue Cheney? Thankfully, not everyone is a litigious in thought as you seem to be. What Whittington does is his business, not yours. Perhaps you would sue your friend over an accident, but it does not appear that Whittington wants to. In fact, he just spoke to the media for the first time today, he seemed to speak favorably of Cheney. So as far as I can see, the exchange over the last few days sums up to this:\n Accident-apology-forgiveness. Wow, what a concept...forgiveness.", 
   {}, 
   198948, 
   null, 
   1140207840.0
  ], 
  [
   198972, 
   null, 
   "daewoo", 
   "Hate to burst you bubble but Cheney owes Whittington more then an apology . After all if Cheney shot you. You would want to be compensated for injurys and pain and suffering. And to down play this off like nothing is pretty stupid.\n\n \n I owuld imagine they view it as both parties fault (Cheny and Whittington anyway). Both violated important, well understood, safety rules for hunting. \n \n I have been thinkign about this a lot lately, mostly because I am an avid hunter and there are lessons to be learned here. I think that for the most part, the fault here lies with Whittington. While it is true that you theoretically should never fire unless you know for sure what is behind your target, As others have pointed out, in brush hunting this is not realistic. You know the lay of the land, and where your hunting buddies are. If domebody else wonders into the field, especially in somebodies field fo fire, they run the risk of being accidentally shot. \n \n Whittington should have approached the group from the rear, and announced his approach the minute he was in range to do so (and if you are in range of a 28 gauge, you are in range to announce your approach). He withdrew from the hunting party and returned to the vehicle to rest. There was no way that Cheney, or anybody else in the field, would have known that he decide to return to the group. \n \n We hunt birds here (kansas, it is kind of a big deal) and a lot of the best bird country is CRP, which often grows higher than your head. You always take shots where you cannot be 100% sure what is behind the target. I hunt fairly often with my wifes grandfather. His is 90, and not real spry. He routinely drops us at one end of the field then drives around to the other end to block. If he abandonded his post at the other end of the field and wandered in to find the rest of us, there is a good chance he might end up getting shot. Luckily he is smart enough (and considerate enough) not to do that kind of thing. If he did, I probably would not hunt with him anymore. The last thing I need on my conscience is the death of my wifes grandfather.\n \n This is a nothign deal. It was a mutual mistake made among friends.", 
   {}, 
   198948, 
   null, 
   1140208680.0
  ], 
  [
   199037, 
   null, 
   "sglaine", 
   "This is a nothign deal. It was a mutual mistake made among friends.\n\n \n \n And yes and those braindeads can rejoice..emoticon_xhoho Still in the real world you don't pull the trigger unless you know for sure what your shooting at. And that is common sence that was not used.\n \n And they teach that in Hunters safety class.", 
   {}, 
   198972, 
   null, 
   1140229080.0
  ], 
  [
   199049, 
   null, 
   "Mach", 
   "My first reaction, and most of my subsquent thought, is that yes, it's a mistake among friends, it's not really a big deal.\n \n Of course, I know some remarkable individuals that take everything they do very seriously, and to make such a potentially fatal blunder (on both parts...choosing to hunt in a low visibility error is still a choice), is not necessarily something we want to see our \"leaders\" doing. Are they this careless with our armed forces? (!)\n \n Another part of what I've heard, that sounds somewhat reasonable (although most conspiracy theories do), is that:\n \n 1. It was out of the norm not to announce this immediately.\n 2. The secret service turned away an officer investigating the incident and remarked they would discuss it the following day (time to let that blood alcohol level drop and get their stories synch'd up).\n 3. There was a lot of confusion among witnesses and Cheney's remarks with regards to whether there was alcohol at lunch, how much was consumed, by who, and when...all relevant to many injury accidents (car, boating, etc.).\n \n Putting all three facts together looks suspicious, and when it's an elected executive of such enormous power (Cheney is like president-lite), it's perhaps worth a look. All this air time? Most news media is about entertainment, not fair, balanced, or otherwise facts-only information to better society. If we cared about what the news media did with their air time, we'd complain 90% of the time, not just about this. (I complain 90% of the time, so I watch news hour and listen to NPR)\n \n -Mach", 
   {}, 
   198963, 
   null, 
   1140233220.0
  ], 
  [
   199104, 
   null, 
   "billsco", 
   "I dunno. Whittington does look an awful lot like a turkey. That wattle on his chin is unmistakable, especially in low light situations.\n \n I've just placed my order for the latest fashion craze in hunting apparel:\n \n \"I went hunting with Dick Cheney and all I got was this bloody T-shirt.\" ", 
   {}, 
   199049, 
   null, 
   1140272940.0
  ], 
  [
   199108, 
   null, 
   "georged", 
   "I liked the political cartoon where Cheney holding a shotgun invites a terrified Scooter to go hunting.", 
   {}, 
   199104, 
   null, 
   1140277260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cheney is shooting people!! You might be next", 
  "url": "http://www.4forums.com/political/current-events-debates/7574-cheney-shooting-people-you-might-next.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7574, 
  "discussion_files": [
   [
    "20407.html", 
    "http://www.4forums.com/political/current-events-debates/7574-cheney-shooting-people-you-might-next-print.html"
   ], 
   [
    "20408.html", 
    "http://www.4forums.com/political/current-events-debates/7574-cheney-shooting-people-you-might-next-6-print.html"
   ], 
   [
    "20409.html", 
    "http://www.4forums.com/political/current-events-debates/7574-cheney-shooting-people-you-might-next-4-print.html"
   ], 
   [
    "20410.html", 
    "http://www.4forums.com/political/current-events-debates/7574-cheney-shooting-people-you-might-next-5-print.html"
   ], 
   [
    "20411.html", 
    "http://www.4forums.com/political/current-events-debates/7574-cheney-shooting-people-you-might-next-3-print.html"
   ], 
   [
    "20412.html", 
    "http://www.4forums.com/political/current-events-debates/7574-cheney-shooting-people-you-might-next-2-print.html"
   ]
  ], 
  "identifier": 7574
 }
]