[
 [
  [
   198192, 
   null, 
   "Matthew S", 
   "In protest of unequal marriage laws we are being asked to go to our local courthouse and ask for a marriage license.\n http://www.freedomtomarry.org/node.asp?id=3610\n This part\n \nMICHIGAN\n \"This Year, Every Year, Until\"\n \n February 14, 2006\n Location: Oakland County Courthouse, Pontiac\n \n The leaders of two LGBT-headed churches will be at the Oakland County Courthouse to assist same-sex couples in applying for marriage licenses.\n \n The demonstration will begin at 9 a.m. with an attempt by the couples to receive licenses. Afterward, Pastors Deborah Dysert and Mark Bidwell will perform a blessing of relationships and lead demonstrators in a prayer vigil for marriage equality. \n \n In Michigan, one member of the couple can go to the courthouse as long as they bring a copy of their intended spouse's ID. When they apply, they will receive a copy of Michigan's discriminatory anti-marriage ordinance and will be denied a license.\n \n We instruct people to thank the clerks and say \"We'll see you next year.\"\n \n For more information on the Oakland County demonstration, call Divine Peace MCC at 248-618-1186 or MCC Detroit at 248-399-7741. For more information about right-to-marry events around the country, visit the Metropolitan Community Church's website at www.MCCchurch.org/marriage.\n\n \n \n I plan on doing this anyone else?", 
   {
    "post_info": {
     "post_title": "Remember to march on your local court house tomorrow 2-14-2006"
    }
   }, 
   null, 
   null, 
   1139877900.0
  ], 
  [
   198196, 
   null, 
   "jyoshu", 
   "In protest of unequal marriage laws we are being asked to go to our local courthouse and ask for a marriage license.\n\n \n You're certainly within your right to do so, although it comes off as a stunt more than anything else. Heck man, if you're going to protest, do something BIG that looks like a real protest. March in the streets! March on D.C. Remember MLK?\n \n \nThe demonstration will begin at 9 a.m. with an attempt by the couples to receive licenses. Afterward, Pastors Deborah Dysert and Mark Bidwell will perform a blessing of relationships and lead demonstrators in a prayer vigil for marriage equality. \n\n \n But why do the pastor/prayer thing? I thought it was civil marriage you are fighting for.", 
   {}, 
   198192, 
   null, 
   1139878320.0
  ], 
  [
   198202, 
   null, 
   "Matthew S", 
   "\n But why do the pastor/prayer thing? I thought it was civil marriage you are fighting for.\n\n \n \n It is but there are those christians out there that actually believe in justice and equality and that love is love no matter whom it is with.", 
   {}, 
   198196, 
   null, 
   1139878800.0
  ], 
  [
   198259, 
   null, 
   "joebrummer", 
   "[QUOTE=jyoshu]You're certainly within your right to do so, although it comes off as a stunt more than anything else. Heck man, if you're going to protest, do something BIG that looks like a real protest. March in the streets! March on D.C. Remember MLK?\n [quote]\n \n We have done this and there is talk of doing it again. I bet it will happen in the next year or two!\n \n \n\n But why do the pastor/prayer thing? I thought it was civil marriage you are fighting for.\n\n \n There are religious gay people. there are gay chrisitnas. Are you so blind as not to see we respect that? Can you not respect it?", 
   {}, 
   198196, 
   null, 
   1139893620.0
  ], 
  [
   198265, 
   null, 
   "Steeeeve", 
   "I plan on doing this anyone else?\n No. \n \n I do remember a few years ago (maybe even last year) the LGBTA at a college in Virginia had a \"wear blue jeans if you support equality of marriage day\". They claimed they wanted to do something easy...Needless to say, they were mocked and it made news, people put up signs like \"wear clothing if you don't support gay marriage\" and things like that.\n \n I just thought I would share that story. Anyway, no I won't be doing that but I am glad they stated that they wanted the people to be nice.", 
   {}, 
   198259, 
   null, 
   1139899860.0
  ], 
  [
   198294, 
   null, 
   "jyoshu", 
   "There are religious gay people. there are gay christians. Are you so blind as not to see we respect that? Can you not respect it?\n\n \n Please. Your movement doesn't respect Christian gays at all, any more than any other Christian. Do you not realize that everytime people in your movement belittle the Bible or Christian belief they disrespect gay people who are Christian?", 
   {}, 
   198259, 
   null, 
   1139932680.0
  ], 
  [
   198463, 
   null, 
   "Matthew S", 
   "Please. Your movement doesn't respect Christian gays at all, any more than any other Christian. Do you not realize that everytime people in your movement belittle the Bible or Christian belief they disrespect gay people who are Christian?\n\n \n \n Gay christians can see the hypocisy and the disrespect and hatred that the far right evangelical christians bring upon themselves. It comes down to this those christians who are gay or gay affirming believe that GOD is love and any form of love should be celebrated. All should be welcomed and celebrated as children of God. Gay christians do not consider gay sex or love a sin.", 
   {}, 
   198294, 
   null, 
   1140013560.0
  ], 
  [
   198472, 
   null, 
   "jyoshu", 
   "Gay christians can see the hypocisy and the disrespect and hatred that the far right evangelical christians bring upon themselves. It comes down to this those christians who are gay or gay affirming believe that GOD is love and any form of love should be celebrated. All should be welcomed and celebrated as children of God. Gay christians do not consider gay sex or love a sin.\n\n \n That's all a red herring. It still stands that your movement puts down gay Christians everytime they belittle the Bible or Christianity in general.", 
   {}, 
   198463, 
   null, 
   1140020760.0
  ], 
  [
   198486, 
   null, 
   "Matthew S", 
   "That's all a red herring. It still stands that your movement puts down gay Christians everytime they belittle the Bible or Christianity in general.\n\n \n \n Nonsence. I thought you berated me for generalizing\n \n \n BTW HELLO Gay christian here.", 
   {}, 
   198472, 
   null, 
   1140028380.0
  ], 
  [
   198489, 
   null, 
   "Steeeeve", 
   "Nonsence. I thought you berated me for generalizing\n \n \n BTW HELLO Gay christian here.\n\n I don't understand what that means. If you don't believe in the teachings of Jesus and God (same thing) then you are not a Christian...you don't get to make up what Christian means and you don't get to decide what areas of the Bible to follow. A Christian is not a nice person that follows the rules and wants everyone to be happy. A Christian has faith and love for the Father, Son, and Holy Ghost and follows His Word. A gay christian would be like a theif saying \"stealing is ok but I am still a Christian\". It just doesn't work that way...now if you realize that being homosexual or a theif...etc is against the teachings of the Bible then you probably a Christian as we all fall well short of what God wants from us.", 
   {}, 
   198486, 
   null, 
   1140028860.0
  ], 
  [
   198494, 
   null, 
   "jyoshu", 
   "I don't understand what that means. If you don't believe in the teachings of Jesus and God (same thing) then you are not a Christian...you don't get to make up what Christian means and you don't get to decide what areas of the Bible to follow. A Christian is not a nice person that follows the rules and wants everyone to be happy. A Christian has faith and love for the Father, Son, and Holy Ghost and follows His Word.\n\n \n Moreover, its odd that a christian (gay or not) would not be critical of mean-spirited people and situations where Christians are derided, generalized, their sacred Bible made fun of, etc. It's even more odd that such a christian would participate in that activity against other Christians. Even if his politics are more important than his faith and he is more a gay rights activist than anything, one would still think he would realise that it's disrepectful to partake or support such things against gay Christians. It's still their Bible too.", 
   {}, 
   198489, 
   null, 
   1140029520.0
  ], 
  [
   198504, 
   null, 
   "Matthew S", 
   "I don't understand what that means. If you don't believe in the teachings of Jesus and God (same thing) then you are not a Christian...you don't get to make up what Christian means and you don't get to decide what areas of the Bible to follow. A Christian is not a nice person that follows the rules and wants everyone to be happy. A Christian has faith and love for the Father, Son, and Holy Ghost and follows His Word. A gay christian would be like a theif saying \"stealing is ok but I am still a Christian\". It just doesn't work that way...now if you realize that being homosexual or a theif...etc is against the teachings of the Bible then you probably a Christian as we all fall well short of what God wants from us.\n\n \n \n Once again point missed completely. There is more then one way to be a christian, as I have been repeatedly told and scolded by others in this forum. The far right fire and brimstone hell is right around the corner type christian do not get to define what a christian is. The fact is that there are many types of christians and I have very little respect for anyone or any religion, or sect of religion that will use Jesus and his teachings to oppress people. The Bible is meaningless if used as a weapon to drive people away from Jesus. This is what is happening modern churches are favoring the teachings of Paul and Moses to those of Jesus.", 
   {}, 
   198489, 
   null, 
   1140032040.0
  ], 
  [
   198505, 
   null, 
   "Matthew S", 
   "Moreover, its odd that a christian (gay or not) would not be critical of mean-spirited people and situations where Christians are derided, generalized, their sacred Bible made fun of, etc. It's even more odd that such a christian would participate in that activity against other Christians. \n\n \n What do you call the catholic purges of QE1 and the whole battle of catholic vs protestants in Northern Ireland. Chistians have been disagreeing with each other, to the point of blood shed and there isn't much difference between the anglican church and the catholic church, since the founding of the church.\n \n \nEven if his politics are more important than his faith and he is more a gay rights activist than anything, one would still think he would realise that it's disrepectful to partake or support such things against gay Christians. It's still their Bible too.\n\n \n \n I have decided to look inwards and am changing my ways. If you look at what jeus taugh,t that people are to treat others as they would want to be treated. In the past, I have taken the line that if certain churches want to oppress and ridicule gay people and oppose same sex marriage, or gay rights in general then this is how they want to be treated and should have their marriages and religious rights and opposed and ridiculed.\n \n Joe has reminded me that this is not the right aproach to take.\n \n \n Wether it be persicution against us from evagelicals or the government. Raise your voices and sing as I do daily and loudly in public wherever I go.\n 1. We shall overcome \n We shall overcome \n We shall overcome some day \n CHORUS: Oh, deep in my heart \n I do believe \n We shall overcome some day \n 2. We'll walk hand in hand \n We'll walk hand in hand \n We'll walk hand in hand some day \n CHORUS \n \n 3. We shall all be free \n We shall all be free \n We shall all be free some day \n CHORUS \n \n 4. We are not afraid \n We are not afraid \n We are not afraid some day \n CHORUS \n \n 5. We are not alone \n We are not alone \n We are not alone some day \n CHORUS \n \n 6. The whole wide world around \n The whole wide world around \n The whole wide world around some day \n CHORUS \n \n 7. We shall overcome \n We shall overcome \n We shall overcome some day \n CHORUS", 
   {}, 
   198494, 
   null, 
   1140032340.0
  ], 
  [
   198524, 
   null, 
   "Steeeeve", 
   "Once again point missed completely. There is more then one way to be a christian, as I have been repeatedly told and scolded by others in this forum. The far right fire and brimstone hell is right around the corner type christian do not get to define what a christian is. The fact is that there are many types of christians and I have very little respect for anyone or any religion, or sect of religion that will use Jesus and his teachings to oppress people. The Bible is meaningless if used as a weapon to drive people away from Jesus. This is what is happening modern churches are favoring the teachings of Paul and Moses to those of Jesus.\n\n No there is actually only one way to be a Christian..in fact, the Bible says this. You can't hijack the word \"Christian\" to mean what you want it to mean..it has meaning and either you fit into that category of you don't. \n \n \nI am the way, the truth and the life\n", 
   {}, 
   198504, 
   null, 
   1140038820.0
  ], 
  [
   198535, 
   null, 
   "BobNelson2", 
   "No there is actually only one way to be a Christian..in fact, the Bible says this. You can't hijack the word \"Christian\" to mean what you want it to mean..it has meaning and either you fit into that category of you don't.\n\n \n I don't know about anyone else, but I'm sort of looking forward to the revival of official heresy trials.", 
   {}, 
   198524, 
   null, 
   1140040140.0
  ], 
  [
   198558, 
   null, 
   "jyoshu", 
   "Raise your voices and sing as I do daily and loudly in public wherever I go.\n We shall overcome \n We shall overcome \n\n \n I bet YOU get some stares from people . . .", 
   {}, 
   198505, 
   null, 
   1140045060.0
  ], 
  [
   198661, 
   null, 
   "Matthew S", 
   "No there is actually only one way to be a Christian..in fact, the Bible says this. You can't hijack the word \"Christian\" to mean what you want it to mean..it has meaning and either you fit into that category of you don't.\n\n \n \n That certainly hasn't stopped fanatics like phelps or bigots like robertson from defining what christians believe. BTW I can do whatever I want.", 
   {}, 
   198524, 
   null, 
   1140103680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Remember to march on your local court house tomorrow 2-14-2006", 
  "url": "http://www.4forums.com/political/gay-rights-debates/7581-remember-march-your-local-court-house-tomorrow-2-14-2006-a.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 7581, 
  "discussion_files": [
   [
    "682.html", 
    "http://www.4forums.com/political/gay-rights-debates/7581-remember-march-your-local-court-house-tomorrow-2-14-2006-a-print.html"
   ], 
   [
    "683.html", 
    "http://www.4forums.com/political/gay-rights-debates/7581-remember-march-your-local-court-house-tomorrow-2-14-2006-a-2-print.html"
   ]
  ], 
  "identifier": 7581
 }
]