[
 [
  [
   198444, 
   null, 
   "cassapolie", 
   "For everyone who thinks Bush cares about homeland security...enjoy\n \n \n So you think W really cares about homeland security? \n << on: February 14, 2006, 08:17:45 AM >> \n \n --------------------------------------------------------------------------WASHINGTON Feb 11, 2006 (AP)- A company in the United Arab Emirates is poised to take over significant operations at six American ports as part of a corporate sale, leaving a country with ties to the Sept. 11 hijackers with influence over a maritime industry considered vulnerable to terrorism. \n \n http://abcnews.go.com/Business/wireStory?id=1606661&ad=true&ad=true\n \n http://www.cbsnews.com/stories/2006/02/11/ap/business/mainD8FMVEFO0.shtml\n \n http://www.forbes.com/feeds/ap/2006/02/11/ap2518368.html", 
   {
    "post_info": {
     "post_title": "Why is nobody talking about this?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1139993040.0
  ], 
  [
   198446, 
   null, 
   "daewoo", 
   "This is how we recruit allies in our war on terror. We buy them.", 
   {}, 
   198444, 
   null, 
   1139993880.0
  ], 
  [
   198465, 
   null, 
   "Wez", 
   "You can't really discriminate against companies because they come from a country with \"ties\" to terrorism imo.\n \n If the companies involved have any sense, they won't help attack the US because they'll lose money. \n \n -Wez", 
   {}, 
   198446, 
   null, 
   1140013920.0
  ], 
  [
   198467, 
   null, 
   "Platypus", 
   "You can't really discriminate against companies because they come from a country with \"ties\" to terrorism imo.\n\n Nonsense. Embargo is an often-used weapon, from Cuba to Iraq to Iran to Libya. We discriminate against companies from various countries for far less compelling reasons than national security.\n \nIf the companies involved have any sense, they won't help attack the US because they'll lose money.\n\n It looks like your definition of \"having sense\" is being motivated only by profit, but that's just not very realistic with regard to terrorists. Whether you regard it as a different kind of sense or no sense at all, they have completely different motivations.", 
   {}, 
   198465, 
   null, 
   1140015060.0
  ], 
  [
   198468, 
   null, 
   "Wez", 
   "Nonsense. Embargo is an often-used weapon, from Cuba to Iraq to Iran to Libya. We discriminate against companies from various countries for far less compelling reasons than national security.\n\n I don't agree with these courses of action either.\n \n \nIt looks like your definition of \"having sense\" is being motivated only by profit, but that's just not very realistic with regard to terrorists. Whether you regard it as a different kind of sense or no sense at all, they have completely different motivations.\n\n You'd need to link the specific company to terrorists before you can discriminate against them because of what country they originate from. For example, the London bombers were British terrorists, but you can't really discriminate against everyone who at one time employed those bombers.\n \n -Wez", 
   {}, 
   198467, 
   null, 
   1140016560.0
  ], 
  [
   198470, 
   null, 
   "Platypus", 
   "You'd need to link the specific company to terrorists before you can discriminate against them because of what country they originate from.\n\n That might not be effective in either the near or long term. I say near term because investigating each and every company takes time and resources; besides reducing efficiency, it might mean that by the time you find the connections it will be too late. Sometimes you have to take a short cut. It's fine to say that short cuts should not be taken at the expense of rights, but what rights are we walking about? The rights of corporations? Foreign corporations, at that? The right to our business? US citizens have a right of free speech. Foreign companies do not have a right of access to US markets. That's an abuse of \"rights\" as a concept. I'm no xenophobe, I believe in open borders and I think it would be wrong to use national trade policy for purely venal reasons, but I see no reason not to use such policy to serve higher interests.\n \n The long-term issue is a bit more abstract. The purpose of embargo is to exert pressure on a government not for a specific action but for creating an environment (e.g. via lax enforcement of laws) which leads to actions that harm the embargo initiator. It's supposed to work indirectly, by creating pressure on foreign individuals and companies so that they in turn will create pressure on their government. If the scope of an embargo is limited to companies with already-proven ties to terrorism (or whatever other ill we seek to avoid) then the pressure on that government will be negligible. Embargo thus becomes useless as a tool of statecraft, and nations would therefore turn to even less palatable means of preserving their safety or interests. Witness the abandonment of embargo for war in Iraq as an example. Without the leverage that embargo provides, we all lose.\n \n Embargo might not be anyone's cup of tea (yes that's a Boston reference) but it does serve a purpose and has to be evaluated against other means that might be used to serve those same purposes. It's like the old saying that democracy is a terrible way to govern . . . except for all the others that have been tried.", 
   {}, 
   198468, 
   null, 
   1140018420.0
  ], 
  [
   199358, 
   null, 
   "trebor", 
   "You can't really discriminate against companies because they come from a country with \"ties\" to terrorism imo.\n \n If the companies involved have any sense, they won't help attack the US because they'll lose money. \n \n -Wez\n\n \n In my opinion, if you are worried about national security, you go with a home company, period. There are enough people on both sides of the Congress that agree with me. \n \n http://www.cnn.com/2006/POLITICS/02/19/port.security.ap/index.html\n \n I mean, one thing that is holding Europe from letting some big companies outsource their support of the computers to China is concerns about how\n secure it will be with the Chinese Government.\n \n Personally, I have concerns about the ability of the UAE to handle being able to maintain security. Their government has problems with trying to cover security for themselves.\n \n It creates too wide a security hole. And, then of course, it is shipping even MORE money over the the UAE.. we send enough money there with buy oil.", 
   {}, 
   198465, 
   null, 
   1140447780.0
  ], 
  [
   199414, 
   null, 
   "JPSartre12", 
   "This is one of the few areas of gov't that I don't think should be privatized. The idea of Ajax Security, with its minimum wage, unbonded, non-security vetted employees standing between me and and a suitcase nuke stowed away in a ship makes me glad that I moved 600 miles inland. emoticon_xgood", 
   {}, 
   198444, 
   null, 
   1140465900.0
  ], 
  [
   199545, 
   null, 
   "unkerpaulie", 
   "You can't really discriminate against companies because they come from a country with \"ties\" to terrorism imo.\n \n If the companies involved have any sense, they won't help attack the US because they'll lose money. \n \n -Wez\n\n this is a interesting twist. first of all, what makes you think we dont discriminate against people who we choose to suspect may have ties with terrorism, regardless of whether those suspicions are warranted or not? and second, what makes you think that all companies in the world depend on a good standing america to be financially successful?", 
   {}, 
   198465, 
   null, 
   1140539820.0
  ], 
  [
   199565, 
   null, 
   "Wez", 
   "That might not be effective in either the near or long term. I say near term because investigating each and every company takes time and resources; besides reducing efficiency, it might mean that by the time you find the connections it will be too late. Sometimes you have to take a short cut. It's fine to say that short cuts should not be taken at the expense of rights, but what rights are we walking about? The rights of corporations? Foreign corporations, at that? The right to our business? US citizens have a right of free speech. Foreign companies do not have a right of access to US markets. That's an abuse of \"rights\" as a concept. I'm no xenophobe, I believe in open borders and I think it would be wrong to use national trade policy for purely venal reasons, but I see no reason not to use such policy to serve higher interests.\n \n The long-term issue is a bit more abstract. The purpose of embargo is to exert pressure on a government not for a specific action but for creating an environment (e.g. via lax enforcement of laws) which leads to actions that harm the embargo initiator. It's supposed to work indirectly, by creating pressure on foreign individuals and companies so that they in turn will create pressure on their government. If the scope of an embargo is limited to companies with already-proven ties to terrorism (or whatever other ill we seek to avoid) then the pressure on that government will be negligible. Embargo thus becomes useless as a tool of statecraft, and nations would therefore turn to even less palatable means of preserving their safety or interests. Witness the abandonment of embargo for war in Iraq as an example. Without the leverage that embargo provides, we all lose.\n \n Embargo might not be anyone's cup of tea (yes that's a Boston reference) but it does serve a purpose and has to be evaluated against other means that might be used to serve those same purposes. It's like the old saying that democracy is a terrible way to govern . . . except for all the others that have been tried.\n\n Good points.:) [Devil's advocate] What happens if the security record of the company is better than any US companies' security records?\n \n \nPersonally, I have concerns about the ability of the UAE to handle being able to maintain security. Their government has problems with trying to cover security for themselves.\n \n It creates too wide a security hole. And, then of course, it is shipping even MORE money over the the UAE.. we send enough money there with buy oil.\n\n [Devil's advocate] What happens if the security record of the company is better than any US companies' security records?\n \n \nthis is a interesting twist. first of all, what makes you think we dont discriminate against people who we choose to suspect may have ties with terrorism, regardless of whether those suspicions are warranted or not? \n\n I don't think this, so see no reason to respond.\n \n \nand second, what makes you think that all companies in the world depend on a good standing america to be financially successful?\n\n I don't think this, so see no reason to respond.\n \n -Wez", 
   {}, 
   198470, 
   null, 
   1140551580.0
  ], 
  [
   199622, 
   null, 
   "JPSartre12", 
   "Most of my criticism of Bush has been related to his lack of fiscal restraint and not his foreign policy or security stances. But, IMO, he's backing the wrong horse on this one. The UAE doesn't deserve our trust nor business. They were one of three countries that recognized the Taliban, they were instrumental in funneling money to terrorists via UAE companies, they have been involved in illegal arms shipments and other questionable acts. Why on earth would we want to reward this type of behavior by giving them control of 6 of our ports? emoticon_confused", 
   {
    "post_info": {
     "post_title": "Bush is wrong on this one"
    }
   }, 
   199565, 
   null, 
   1140573240.0
  ], 
  [
   199671, 
   null, 
   "beervolcano", 
   "Bush is promising for the third time to veto a bill.\n He's never vetoed a bill in his life.\n The first veto he promised was to make sure that vets getting disability pay also didnt' get retirement pay on top.\n http://g0lem.net/PhpWiki/index.php/BushBadForVets\n \nOpposing Helping Disabled Vets. Secretary Donald Rumsfeld recommended that Bush veto the defense appropriations bill if it contained a fix to the concurrent receipt problem that penalizes veterans who also receive disability assistance. The concurrent receipt ban stops a veteran who receives disability compensation from also receiving military retirement pay, effectively punishing our disabled vets. Rumsfeld wrote that if the bill, \"authorizes concurrent receipt of military retirement pay and veterans' disability compensation benefits, or expands TRICARE, then I would join other senior advisors to the President in recommending that he veto the bill.\" (Rumsfeld Letter to Rep. Duncan Hunter, 7/8/03)\n \n \n The next time he promised to veto a bill it was for the McCain anti-torture amendment.\n \n http://www.veteransforcommonsense.org/?Page=Article&ID=5032\n \nThe measure ignited a fierce debate among many Senate Republicans and the White House, which threatened to veto a $440 billion military spending bill if the detention amendment was tacked on, saying it would bind the president's hands in wartime. Nonetheless, the measure passed, 90 to 9, with 46 Republicans, including Bill Frist of Tennessee, the majority leader, joining 43 Democrats and one independent in favor.\n\n \n And the third time he threatens to veto is to make sure that our ports are run by a country known to have ties to 9/11, known to have a hand in disseminating nuclear technology from Pakistan to Iran, Lybia, and North Korea.\n \n http://www.usatoday.com/news/world/2004-09-02-terror-dubai_x.htm\n \nWith open borders, multiethnic society and freewheeling business rules, the Emirates remains vital to al-Qaeda operations, said Evan F. Kohlmann, a Washington-based terrorism researcher.\n \n Dubai still \"plays a key role for al-Qaeda as a through-point and a money transfer location,\" Kohlmann said, although he also noted the country could be working to combat such activity with \"an aggressive but low-profile intelligence strategy.\" \n \n al-Qaeda isn't the only organization that has found Dubai useful. The father of Pakistan's nuclear program, Abdul Qadeer Khan, has acknowledged heading a clandestine group that, with the help of a Dubai company, supplied Pakistani nuclear technology to Iran, Libya and North Korea.\n\n \n \n Remember, Bush has never seen a spending bill he didn't like and has only threatened veto a few times:\n \n 1. To make sure that vets didn't get disability AND retirement pay.\n 2. To make sure that torture is sanctioned in military prisons.\n 3. To make sure that we sell our ports to an Arab country with ties to al Queda.\n \n Does anyone else smell the Carlyle Group all over this UAE deal?\n \n \n Thanks George W. Bush!", 
   {
    "post_info": {
     "post_title": "Bush promises to veto any bill that breaks the deal."
    }, 
    "unicode_changes_made": true
   }, 
   199622, 
   null, 
   1140585660.0
  ], 
  [
   199733, 
   null, 
   "georged", 
   "\n \n Does anyone else smell the Carlyle Group all over this UAE deal?\n \n Thanks George W. Bush!\n\n \n I'd doubt that 5% of posters on this forum have any idea of the Bush Family history.", 
   {}, 
   199671, 
   null, 
   1140635460.0
  ], 
  [
   199738, 
   null, 
   "JPSartre12", 
   "I'd doubt that 5% of posters on this forum have any idea of the Bush Family history.\n\n \n Capitalism at its finest. ;)", 
   {}, 
   199733, 
   null, 
   1140636120.0
  ], 
  [
   200440, 
   null, 
   "bonddm", 
   "I wouldn't doubt that Bush cares about anything but his own self-interests. This war on terror campaign is just a ploy to put fear in the heart of Americans and consequently win elections.", 
   {}, 
   199738, 
   null, 
   1141106220.0
  ], 
  [
   200464, 
   null, 
   "JPSartre12", 
   "I wouldn't doubt that Bush cares about anything but his own self-interests. This war on terror campaign is just a ploy to put fear in the heart of Americans and consequently win elections.\n\n \n But Bush is term-limited. emoticon_confused", 
   {}, 
   200440, 
   null, 
   1141138260.0
  ], 
  [
   200583, 
   null, 
   "bonddm", 
   "But Bush is term-limited. emoticon_confused\n\n \n Exactly, it's to keep the Republicans in office. They play the fear card.", 
   {}, 
   200464, 
   null, 
   1141178460.0
  ], 
  [
   200588, 
   null, 
   "JPSartre12", 
   "Exactly, it's to keep the Republicans in office. They play the fear card.\n\n \n A good name for it because voters are afraid to vote for a liberal......and with good reason. Imagine President Hillary. Brings shivvers to my spine just thinking about it. emoticon_wow", 
   {}, 
   200583, 
   null, 
   1141180080.0
  ], 
  [
   200595, 
   null, 
   "georged", 
   "Exactly, it's to keep the Republicans in office. They play the fear card.\n\n \n At this point, with spending, debt and foreign relations totally out of control, that's the only card left in their hand.", 
   {}, 
   200583, 
   null, 
   1141182780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why is nobody talking about this?", 
  "url": "http://www.4forums.com/political/news-forum/7588-why-nobody-talking-about.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 7588, 
  "discussion_files": [
   [
    "13065.html", 
    "http://www.4forums.com/political/news-forum/7588-why-nobody-talking-about-print.html"
   ], 
   [
    "13066.html", 
    "http://www.4forums.com/political/news-forum/7588-why-nobody-talking-about-2-print.html"
   ]
  ], 
  "identifier": 7588
 }
]