[
 [
  [
   198718, 
   null, 
   "nazsmith", 
   "I really wished I had the book to cite this; it must be in one of my boxes (recently moved). Anyway, I have a belief that because the Bible was written by man, there are inevitably errors transcribed over the course of millenia. If my first assertion is incorrect (Bible was written by man) please let me know.\n Moreover, when something is translated from one language to another, it can lose much of its meaning. Someone who is brought up to speak one language thinks in terms of that language, and their reality is usually framed within that language.\n For example (I'll find it somewhere) when translated to English, someone decided the words should read \"In the beginning\" and not \"In beginning\" as it was originally. Similar statements, but drastically different consequences of interpretation.\n I'd like to inquire about the King James version of the Bible. What was changed? If nothing, why is it a \"version\" at all?\n I'm not trying to cite any contradictions within the Bible, per se. But we know humans aren't perfect so my focus is on the misstatements caused by people.", 
   {
    "post_info": {
     "post_title": "Human error in the Bible"
    }
   }, 
   null, 
   null, 
   1140120900.0
  ], 
  [
   198884, 
   null, 
   "Jo Bennett", 
   "The reason it is a version is because when you translate from one language to another you necessarily make choices about how to translate words or phrases. For example, the KJV has \"faith, hope and charity\", while most modern translations have \"faith, hope and love\". There is also the issue of translators writing what they think was meant by a phrase rather than translating it. Sometimes this is necessary because a literal translation makes little sense, but at other times it can change the meaning or importance of a passage. Then we have the issue of words that are simply unknown, and scholars rely on guess work, and to some extent their own prejudices, in deciding what is meant by them.\n \n With the beginning of Genesis, my suspicion (I'm not a scholar of ancient hebrew so this is a guess) is that \"In the beginning\", while not a direct translation of the words, is a direct translation of the phrase in context. It's like the fact that \"le\" and \"la\" get added to french words when we would never bother adding \"the\" in english. It's important to remember that translatio is not simply a case of substituting one word for another, but dealing with a whole different grammar and sentence structure.", 
   {}, 
   198718, 
   null, 
   1140179400.0
  ], 
  [
   198904, 
   null, 
   "unkerpaulie", 
   "if the english translation of the bible cannot be regarded as a reliable rendering of what was originally said (in hebrew or greek or aramaic) then should we simply abandon the bible on the assumption that it may be misleading us? what we have today is a product of hundreds of years or studying from the original transcripts with huge teams of translators. words like \"in\" or \"like\" or \"his\" etc would obviously be inserted here and there where necessary, because even though equilvalents to those words werent in the originals, the propositions would have been implicit, and needed in proper english grammar. starting genesis with \"in beginning\" rather than \"in the beginning\" does not read as proper english, and the meaning is conveyed perfectly\n \n its obvious that a proper translation does not necessarily mean word for word verbatim substitution. in spanish, youd say \"los manos grandes\" which properly translated in emglish would read \"big hands\" and not \"the hands big\". see the difference?", 
   {}, 
   198884, 
   null, 
   1140192420.0
  ], 
  [
   198916, 
   null, 
   "Maineiac", 
   "I agree that there are proabably errors in translation from one language to another but the messages are still pretty much the same. It's when we try to pick every single word of any bible to fit our personal beliefs that we run into trouble.", 
   {}, 
   198904, 
   null, 
   1140195300.0
  ], 
  [
   199058, 
   null, 
   "trebor", 
   "I agree that there are proabably errors in translation from one language to another but the messages are still pretty much the same. It's when we try to pick every single word of any bible to fit our personal beliefs that we run into trouble.\n\n \n \n There are also the primary assumptions that are different. The different assumptions of the translators and those who are reading the different chapters give whole different meanings to the various stories in the Bible.", 
   {}, 
   198916, 
   null, 
   1140236220.0
  ], 
  [
   199068, 
   null, 
   "unkerpaulie", 
   "There are also the primary assumptions that are different. The different assumptions of the translators and those who are reading the different chapters give whole different meanings to the various stories in the Bible.\n\n like what? assuming that what was written wasnt what was meant? how could you come up with such an idea?\n \n what does a preconceived assumption have to do with translating a transcript? even if i dont believe what youre saying, if im translating your words then im translating your words. personal convictions doesnt really come into the picture", 
   {}, 
   199058, 
   null, 
   1140242760.0
  ], 
  [
   199069, 
   null, 
   "trebor", 
   "like what? assuming that what was written wasnt what was meant? how could you come up with such an idea?\n \n what does a preconceived assumption have to do with translating a transcript? even if i dont believe what youre saying, if im translating your words then im translating your words. personal convictions doesnt really come into the picture\n\n \n \n Translation is interpretation.\n \n Basic assumptions will make people who translate make different assumptions.\n \n So, words are changed, and meaning is changed, based on the basic assumptoins of the translators. Psalm 22, and Isaiah 7:14 are examples were Christian translators change the meanings of a word to attempt to show \n the Tanakah as a 'precursor' to Jesus... which it is not.", 
   {}, 
   199068, 
   null, 
   1140243060.0
  ], 
  [
   199201, 
   null, 
   "Easyrider", 
   "Translation is interpretation.\n \n Basic assumptions will make people who translate make different assumptions.\n \n So, words are changed, and meaning is changed, based on the basic assumptoins of the translators. Psalm 22, and Isaiah 7:14 are examples were Christian translators change the meanings of a word to attempt to show \n the Tanakah as a 'precursor' to Jesus... which it is not.\n\n \n Let's look at your first pathetic example:\n \n The translation of the Hebrew in Psalam 22:16 is \"pierced\" in the Greek Septuagint (translated by Jewish scholars, by the way), which was completed centuries before Jesus was crucified, and centuries before the advent of Christianity. Therefore your charge that Christian interpreters \"twist\" the meaning of the Hebrew Bible, only shows your bias and unscholarly opinion.", 
   {}, 
   199069, 
   null, 
   1140321480.0
  ], 
  [
   199204, 
   null, 
   "trebor", 
   "Let's look at your first pathetic example:\n \n The translation of the Hebrew in Psalam 22:16 is \"pierced\" in the Greek Septuagint (translated by Jewish scholars, by the way), which was completed centuries before Jesus was crucified, and centuries before the advent of Christianity. Therefore your charge that Christian interpreters \"twist\" the meaning of the Hebrew Bible, only shows your bias and unscholarly opinion.\n\n \n \n So, you know.. you really should stop making false claim.\n \n When the Septuagint was commissioned, only the first 5 books (the Torah) \n was translated. No one really knows who translated the later books\n \n From http://students.cua.edu/16kalvesmaki/lxx/\n \n \n\n The earliest, and best known, source for the story of the Septuagint is the Letter of Aristeas, a lengthy document that recalls how Ptolemy (Philadelphus II [285-247 BCE]), desiring to augment his library in Alexandria, Egypt, commissioned a translation of the Hebrew Scriptures into Greek. Ptolemy wrote to the chief priest, Eleazar, in Jerusalem, and arranged for six translators from each of the twelve tribes of Israel. The seventy-two (altered in a few later versions to seventy or seventy-five) translators arrived in Egypt to Ptolemy's gracious hospitality, and translated the Torah (or Pentateuch: the first five books of the Hebrew Scriptures) in seventy-two days. Although opinions as to when this occurred differ, scholars find 282 BCE an attractive date.\n \n Philo of Alexandria (fl. 1st c CE) confirms that only the Torah was commissioned to be translated, and some modern scholars have concurred, noting a kind of consistency in the style of the Greek Penteteuch. Over the course of the next three centuries, however, other books of the Hebrew Scriptures were translated into Greek in an order that is not altogether clear. By observing technical terms and translation styles, by comparing the Greek versions to the Dead Sea Scrolls, and by comparing them to Hellenistic literature, scholars are trying to stitch together a history of the translations that eventually found their way into collections. It seems that sometimes a Hebrew book was translated more than once, or that a particular Greek translation was revised. In other cases, a work was composed afresh in Greek, yet was included in the collection of scriptures.\n \n\n \n Since there are so many different translations that were in Greek, you don't know who translated any particular copy.\n \n For example, we don't know if you are using the 4th century version or not\n \n\n Further rescensions of the Greek text in the fourth century are attested. Hesychius (fl. 3/4th c.) is said to have created a rescension for the Church in Egypt; Lucian (d. 312 CE), in Antioch. Some scholars posit other rescensions from this period. Thus, we find some Greek Church Fathers varying widely amongst themselves in their Old Testament citations. There is no indication, however, that this was troubling to Church leadership. The insistence on letter-for-letter, word-for-word accuracy in the Scriptures was a feature that was not to emerge in Christian thought for many centuries, and then in imitation of Jewish and Islamic models. As far as early Christians were concerned, any Greek version of the Old Testament read in the Church merited the term Septuagint.\n \n\n \n This have been pointed out to you before. Your continued use of the argument must be from deception.\n \n \n As for your invalid claim that the Septuagint had pierced, why here is a translation from the Septuagint from the Christian Classics web site\n ( http://www.ccel.org/b/brenton/lxx/htm/9.xxi.htm#9.xxii )\n \n If you notice, no 'pierced' there. \n \n \n\n For the end, concerning the morning aid, a Psalm of David.\n \n 1 1O God, my God, attend to me: why hast thou forsaken me? the account of my transgressions is far from my salvation. 2 O my God, I will cry to thee by day, but thou wilt not hear: and by night, and it shall not be accounted for folly to me.\n \n 3 But thou, the praise of Israel, dwellest in a sanctuary. 4 Our fathers hoped in thee; they hoped, and thou didst deliver them. 5 They cried to thee, and were saved: they hoped in thee, and were not ashamed. 6 But I am a worm, and not a man; a reproach of men, and scorn of the people. 7 All that saw me mocked me: they spoke with their lips, they shook the head, saying, 8 He hoped in the Lord: let him deliver him, let him save him, because he takes pleasure in him. 9 For thou art he that drew me out of the womb; my hope from my mother's breasts. 10 I was cast on thee from the womb: thou art my God from my mother's belly.\n \n 710\n \n 11 Stand not aloof from me; for affliction is near; for there is no helper. 12 Many 2bullocks have compassed me: fat bulls have beset me round. 13 They have opened their mouth against me, as a ravening and roaring lion. 14 I am poured out like water, and all my bones are loosened: my heart in the midst of my belly is become like melting wax. 15 My strength is dried up, like a potsherd; and my tongue is glued to my throat; and thou hast brought me down to the dust of death. 16 For many dogs have compassed me: the assembly of the wicked doers has beset me round: they pierced my hands and my feet. 17 They counted all my bones; and they observed and looked upon me. 18 3They parted my garments among themselves, and cast lots upon my raiment.\n \n 19 But thou, O Lord, remove not my help afar off: be ready for mine aid. 20 Deliver my soul from the sword; my only-begotten one from the power of the dog. 21 Save me from the lion's mouth; and regard my 4lowliness from the horns of the unicorns.\n \n 22 I will declare thy name to my brethren: in the midst of the church will I sing praise to thee. 23 Ye that fear the Lord, praise him; all ye seed of Jacob, glorify him: let all the seed of Israel fear him. 24 For he has not despised nor been angry at the supplication of the poor; nor turned away his face from me; but when I cried to him, he heard me. 25 My praise is of thee in the great congregation: I will pay my vows before them that fear him.\n \n 26 The poor shall eat and be satisfied; and they shall praise the Lord that seek him: their heart shall live for ever. 27 All the ends of the earth shall remember and turn to the Lord: and all the kindreds of the nations shall worship before him. 28 For the kingdom is the Lord's; and he is the governor of the nations. 29 All the fat ones of the earth have eaten and worshipped: all that go down to the earth shall fall down before him: my soul also lives to him. 30 And my seed shall serve him: the generation that is coming shall be reported to the Lord. 31 And they shall report his righteousness to the people that shall be born, whom the Lord has made.\n \n", 
   {
    "unicode_changes_made": true
   }, 
   199201, 
   null, 
   1140323700.0
  ], 
  [
   199208, 
   null, 
   "Orion", 
   "Let's look at your first pathetic example:\n \n The translation of the Hebrew in Psalam 22:16 is \"pierced\" in the Greek Septuagint (translated by Jewish scholars, by the way), which was completed centuries before Jesus was crucified, and centuries before the advent of Christianity.\n\n \n (ahem)\n \n Psalms 22:17 - Dogs surround me; a pack of evil ones closes in on me, like lions they maul my hands and feet. - JPS Tanakh\n \n Psalms 22:22 - Deliver me from the lion's mouth... - JPS Tanakh", 
   {}, 
   199201, 
   null, 
   1140325920.0
  ], 
  [
   199229, 
   null, 
   "Obvious Child", 
   "Translation, like a mistress, cannot be both beautiful and faithful.\n \n Perhaps the solution to a lot of these problems is for people not to say they believe in scripture alone without an imposed interpretation unless they read Hebrew and New Testament Greek, and have a good historical and literary knowledge of the context. If you read someone else's Bible, you're receiving their theology.", 
   {}, 
   199208, 
   null, 
   1140356400.0
  ], 
  [
   199230, 
   null, 
   "Jo Bennett", 
   "Translation, like a mistress, cannot be both true and faithful.\n \n Perhaps the solution to a lot of these problems is for people not to say they believe in scripture alone without an imposed interpretation unless they read Hebrew and New Testament Greek, and have a good historical and literary knowledge of the context. If you read someone else's Bible, you're receiving their theology.\n\n \n Even that doesn't really help, because modern knowledge of Greek and Hebrew is not complete. Basically you can only have complete faith in the Bible if you were alive at the times and places each piece was written.", 
   {}, 
   199229, 
   null, 
   1140361080.0
  ], 
  [
   199231, 
   null, 
   "Jo Bennett", 
   "Translation, like a mistress, cannot be both true and faithful.\n \n Perhaps the solution to a lot of these problems is for people not to say they believe in scripture alone without an imposed interpretation unless they read Hebrew and New Testament Greek, and have a good historical and literary knowledge of the context. If you read someone else's Bible, you're receiving their theology.\n\n \n Even that doesn't really help, because modern knowledge of Greek and Hebrew is not complete. Basically you can only have complete faith in the Bible if you have were alive at the times and places each piece was written.", 
   {}, 
   199229, 
   null, 
   1140361080.0
  ], 
  [
   199233, 
   null, 
   "Obvious Child", 
   "Even that doesn't really help, because modern knowledge of Greek and Hebrew is not complete. Basically you can only have complete faith in the Bible if you were alive at the times and places each piece was written.\nthat's why you would need new testament greek and ancient hebrew, as well as the historical background. But you're right that that background can never be fully known.", 
   {}, 
   199231, 
   null, 
   1140363660.0
  ], 
  [
   199280, 
   null, 
   "Jo Bennett", 
   "that's why you would need new testament greek and ancient hebrew, as well as the historical background. But you're right that that background can never be fully known.\n\n \n Sorry, I wasn't clear, I meant modern knowledge of NT Greek and anicent Hebrew was not complete. There are words in the NT that we simply don't have a translation for, so it's simply guess work in places.", 
   {}, 
   199233, 
   null, 
   1140386340.0
  ], 
  [
   199292, 
   null, 
   "Easyrider", 
   "(ahem)\n \n Psalms 22:17 - Dogs surround me; a pack of evil ones closes in on me, like lions they maul my hands and feet. - JPS Tanakh\n\n \n Well they certainly must have seemed like lions when they pierced Jesus' hands and feet, Frank.\n \n p.s. Who is your \"divine\"? What's its name? Where does it live, in Cuppertino? Where's the beef / evidence for your divine (you know, the one you say is ok with gay sex, shacking up, abortion, etc.)? \n \n (watch Orion dodge this like he's done for 6 years now)", 
   {}, 
   199208, 
   null, 
   1140388800.0
  ], 
  [
   199326, 
   null, 
   "Orion", 
   "Translation, like a mistress, cannot be both true and faithful.\n\n \n When I was in college, back in the Bronze Age, I had a mistress. Was she true and faithful? I dunno. Didn't matter. We enjoyed each other's company, and that's what mattered. \n \n \nPerhaps the solution to a lot of these problems is for people not to say they believe in scripture alone without an imposed interpretation unless they read Hebrew and New Testament Greek, and have a good historical and literary knowledge of the context. If you read someone else's Bible, you're receiving their theology.\n\n \n Orion's $00.02...\n \n Trebor suggested that translation implies interpretation. I agree. But translation is only the tip of the iceberg. Retired Episcopal Bishop John Shelby Spong views the Judeo-Christian Bible as a clouded window which gives us an obstructed glimpse as to how a particular ancient society attempted to come to grips with the divine. That Bible makes for good reading, but it's dated, and presents us with aspects which many rational individuals cannot accept today. Add to this that several of the texts within the Bible appear to have been edited after the fact, and the problem compounds. \n \n The theologian Dietrich Bonhoffer, writing from his prison cell in the Buchenwald concentration camp, shortly before his execution by the Nazis, posed the question \"Who is Christ for us, Who is Christ in our time?\". What he suggested, I think, was that Christians must evaluate and redefine the Jesus message, stripped of supernaturalism, miracle stories, later doctrine, and other such embellishments. IMHO, Jesus the iconoclast was made by his later followers into Jesus the icon. By way of analogy, if I point to an object with my hand, my dog will follow the path of my arm and fetch the object. If I try that with a cat, the cat will simply stare at my finger.", 
   {}, 
   199229, 
   null, 
   1140408420.0
  ], 
  [
   199381, 
   null, 
   "Easyrider", 
   "Trebor suggested that translation implies interpretation. I agree. But translation is only the tip of the iceberg. Retired Episcopal Bishop John Shelby Spong views the Judeo-Christian Bible as a clouded window which gives us an obstructed glimpse as to how a particular ancient society attempted to come to grips with the divine.\n\n \n You mean THIS (discredited) Bishop Spong?\n \n http://www.christian-apologetics.org/html/Whats_wrong_Spong.htm\n \n From the website:\n \n Spong the Greek \"scholar\"\n \n Spong boasts that he spends hours studying the Bible and professes an acquaintance with Koine Greek, the language the NT was first written in. Therefore it is not surprising that in RMR, where he denies Jesus' bodily resurrection, that he turns to an analysis of the Greek text to see what the Bible really means.\n \n In RMR p. 53-55, Spong draws our attention to Gal. 1:15-16a which says:\n \n v15 But when He who had set me apart, even from my mother's womb, called me through His grace, was pleased v16 to reveal His son in me ...\n \n From v. 16, \"to reveal His son in me\", Spong claims:\n \n This was not a physical body recalled from the grave. The word for \"reveal\" in this text is ophthe, the same word used in the Greek Septuagint translation of the Hebrew Scriptures to describe the appearances of God (theophanies) or angels of God (angelophanies).... What was the nature of a theophany? Was it really \"physical\"? What was the means of hearing God's voice speak? Was it audible to any ear? Was it capable of being recorded or objectified?\n \n At first, we were impressed by this depth. But on checking a computerised concordance, we found that ophthe is sometimes used of ordinary physical \"seeing\" (Acts 7:26, 1 Tim. 3:16). A logician would also note that Spong commits the fallacy of false alternatives, because he overlooks the possibility that seeing could be both physical and supra-physical, rather that either/or. We thought that it was strange that Spong should ignore this point. However, we decided to check a Greek NT to see if Spong had at least analysed the word correctly in this passage. But we could not find ophthe in the passage. To give Spong a second shot, we checked a NT Greek Interlinear. The word was not there either. Instead, the Greek word for \"reveal\" in Gal. 1:16 is actually apokalupsai, not ophthe! Apokalupsai is often used in the NT in an objective sense.\n \n It is shocking to see that Spong was trying to attack traditional Christian belief by appealing to a mis-translation of a Greek word which is not even in the passage he is explaining. Prof. O'Collins is undoubtedly referring to this blunder when he wrote: \"What is said about a key verb St. Paul uses in Gal. 1:15f. shows that the bishop [Spong] has forgotten any Greek that he knew.\" Spong should heed O'Collins' kindly \"advice for his next book [which] is to let some real experts check it before publication.\"\n \n \nThe theologian Dietrich Bonhoffer, writing from his prison cell in the Buchenwald concentration camp, shortly before his execution by the Nazis, posed the question \"Who is Christ for us, Who is Christ in our time?\". \n\n \n Jesus is the one who, if Bonhoffer's people had received him back in 32 A.D., could have saved them from Jerusalem being destroyed (in 70 A.D. ). And where was their Old Testament God at that time (God in their time) for Bonhoffer's people?\n \n \n What he suggested, I think, was that Christians must evaluate and redefine the Jesus message, stripped of supernaturalism, miracle stories, later doctrine, (etc.). \n\n \n Yep, you libs would love that. Then you could party on end without having your carnal consciences tweaked, LOL! No sin then no need for a Savior.", 
   {}, 
   199326, 
   null, 
   1140453960.0
  ], 
  [
   199383, 
   null, 
   "Obvious Child", 
   "Jesus is the one who, if Bonhoffer's people had received him back in 32 A.D., could have saved them from Jerusalem being destroyed (in 70 A.D. ). And where was their Old Testament God at that time (God in their time) for Bonhoffer's people?\nSorry, but this isn't an opportunity for anti-Judaic ranting. Bonhoeffer wasn't Jewish, he was an Aryan German Christian pastor who was imprisoned and later killed for conspiracies against Hitler. He did help the Jews escape though, so maybe you can say that their blood guilt was on his head.", 
   {}, 
   199381, 
   null, 
   1140454980.0
  ], 
  [
   199391, 
   null, 
   "Easyrider", 
   "Sorry, but this isn't an opportunity for anti-Judaic ranting. Bonhoeffer wasn't Jewish, he was an Aryan German Christian pastor who was imprisoned and later killed for conspiracies against Hitler. He did help the Jews escape though, so maybe you can say that their blood guilt was on his head.\n\n \n The argument holds in light of those questioning where God / Jesus was, both in 70 A.D. and during the Holocaust. No rant intended. I hope Bonnheoffer was familiar with Deuteronomy chapter 28 also, which lays down the parameters of God's blessings and curses.", 
   {}, 
   199383, 
   null, 
   1140458700.0
  ], 
  [
   199482, 
   null, 
   "Orion", 
   "You mean THIS (discredited) Bishop Spong?\n \n http://www.christian-apologetics.org/html/Whats_wrong_Spong.htm\n\n \n I mean (retired) Episcopal Bishop John Shelby Spong, whom you frequently attempt to attack but whose books (by your own admission) you've never read. \n \n \nJesus is the one who, if Bonhoffer's people had received him back in 32 A.D., could have saved them from Jerusalem being destroyed (in 70 A.D. ). And where was their Old Testament God at that time (God in their time) for Bonhoffer's people?\n\n \n As has already been brought to your attention by Obvious Child, Dietrich Bonhoffer was not a Jew, but a Christian theologian. You could have learned that for yourself had you bothered to do a Google search. Would have taken you all of ten seconds. Here's a napkin, EZ, wipe that egg off your face :)", 
   {}, 
   199381, 
   null, 
   1140491880.0
  ], 
  [
   199497, 
   null, 
   "Easyrider", 
   "I mean (retired) Episcopal Bishop John Shelby Spong, whom you frequently attempt to attack but whose books (by your own admission) you've never read.\n\n \n You mean you've spent your good, hard-earned money on his revisionist follies? ROTFLOL!! You could have had a six pack to really make your day.", 
   {}, 
   199482, 
   null, 
   1140494400.0
  ], 
  [
   199711, 
   null, 
   "Obvious Child", 
   "The argument holds in light of those questioning where God / Jesus was, both in 70 A.D. and during the Holocaust. No rant intended. I hope Bonnheoffer was familiar with Deuteronomy chapter 28 also, which lays down the parameters of God's blessings and curses.\nI don't understand. Bonhoeffer didn't ask where God was in the Holocaust. And surely God's curses in Deuteronomy are fulfilled on the crucified Christ? Are you really saying the Holocaust was God's punishment on the Jews?\n \n BTW, didn't you come across Bonhoeffer during your theology degree/masters? What topics did you cover?", 
   {}, 
   199391, 
   null, 
   1140628860.0
  ], 
  [
   199804, 
   null, 
   "Easyrider", 
   " I don't understand. Bonhoeffer didn't ask where God was in the Holocaust. And surely God's curses in Deuteronomy are fulfilled on the crucified Christ?\n\n \n Many received Christ before and after his crucifixion, yet Jerusalem was still destroyed, as Christ foretold. How does that square with what you're presenting? \n \n \nAre you really saying the Holocaust was God's punishment on the Jews?\n\n \n I wouldn't know, but here's something to think about. Most of the Jews rejected Christ, and Jerusalem was sacked anyway. You had that same mentality of rejecting Christ during the time of the Holocaust by many Jews (and by many gentiles). What's your theory on why that occurred? \n \n \nBTW, didn't you come across Bonhoeffer during your theology degree/masters? What topics did you cover?\n\n \n I don't recall any lectures that included Bonhoeffer. Maybe he was cited. If he was I don't recall. There's probably ten thousand theologians, priests, etc., that could have been discussed besides him, and many were. We covered more than I have time to list here. \n \n How about you? What formal education do you have regarding the Bible?", 
   {}, 
   199711, 
   null, 
   1140661200.0
  ], 
  [
   199840, 
   null, 
   "Obvious Child", 
   "Many received Christ before and after his crucifixion, yet Jerusalem was still destroyed, as Christ foretold. How does that square with what you're presenting?\nThat this destruction is not God's punishment, but something else, perhaps the result of man's free will?\n \n \nI wouldn't know, but here's something to think about. Most of the Jews rejected Christ, and Jerusalem was sacked anyway. You had that same mentality of rejecting Christ during the time of the Holocaust by many Jews (and by many gentiles). What's your theory on why that occurred?\nApart from how morally disgusting the idea of God approving of and having responsibility for the camps is, Christians died too. Brave, loyal, pious Christians like Bonhoeffer.\n \n \nI don't recall any lectures that included Bonhoeffer. Maybe he was cited. If he was I don't recall. There's probably ten thousand theologians, priests, etc., that could have been discussed besides him, and many were. We covered more than I have time to list here.\nHe's pretty major. Disciple of Karl Barth, central to neo-orthodoxy. As parts of the movement away from liberal Christianity and the return to focus on the Word, I'm surprised you're unaware of them.\n \n \nHow about you? What formal education do you have regarding the Bible?\nWell, I'm on a theology course but it's not entirely Bible centred. I did a course on the Old Testament, particularly Hosea 1-3, Ruth, Deutero-Isaiah, Exodus 1-3, some of the Psalms and Proverbs. I'm towards the end of a course on New Testament Greek. \n \n Also, Modern Theology, Philosophy and World Religions courses that covered the likes of Bonhoeffer etc. Currently doing two philosophy papers, one on Hinduism/Buddhism, one on Psychology of Religion.\n \n Your turn: dig up your timetable :D", 
   {}, 
   199804, 
   null, 
   1140705300.0
  ], 
  [
   199977, 
   null, 
   "Easyrider", 
   "\n \n Well, I'm on a theology course but it's not entirely Bible centred. I did a course on the Old Testament, particularly Hosea 1-3, Ruth, Deutero-Isaiah, Exodus 1-3, some of the Psalms and Proverbs. I'm towards the end of a course on New Testament Greek. \n \n Also, Modern Theology, Philosophy and World Religions courses that covered the likes of Bonhoeffer etc. Currently doing two philosophy papers, one on Hinduism/Buddhism, one on Psychology of Religion.\n \n Your turn: dig up your timetable :D\n\n \n Good work! Keep up these fine studies. Let's see, we did the Old Testament Survey (going through the OT books one by one), the New Testament Survey, along with individual mini-courses on Biblical doctrines such as adoption, justification, baptism, a major course on the covenants of God, Christ, the Holy Spirit, election and predestination, general and effectual callings, regeneration, sanctification, church history from Acts to the present, prophecy, different styles of pulpit preaching, revival movements, Christianity in America and the Great Awakening, the sovereignty of God, sin, angels, the eternal states, Christian psychology, salvation, the Feasts of Israel, interpretations of Revelation, apologetics, Bible symbolism and poetic devices (the typology of the OT Temple was really good - I think I still have an article (brief recap) on that I might be able to post if I can find it). And some others as well. Cheers...", 
   {}, 
   199840, 
   null, 
   1140756660.0
  ], 
  [
   199978, 
   null, 
   "Easyrider", 
   "Obvious Child -\n \n THE HOLY TABERNACLE\n A Representation of Christ and the New Testament Believer\n \n The Tabernacle, or \"Sanctuary\" of God, as alluded to in Exodus 25:8, constitutes a vast representation of the coming Christ, and also serves as an inanimate prototype of the New Testament believer. The Hebrew word for Sanctuary is 'miqdash' meaning a consecrated place (Word Study, 71). Moving ahead to the New Testament, we see the significance of this: \"And the word became flesh and made His dwelling (\"tabernacled\") among us\" (John 1:14). I Corinthians 6:18 states, \"Do you not know that your body is a temple of the Holy Spirit, who is in you....\" \n \n The Tabernacle consisted of an outer court, an inner court, and the \"Most Holy Place,\" also known as the \"Holy of Holies.\" For the purposes of this paper, I will concentrate only on the alters and furnishings, along with their New Testament significance.\n \n The first object that is found in the outer court is the Brazen Alter (Exodus 30:1-3). This alter was the instrument upon which the blood sacrifices were carried out. As such it represents the sacrifice of Christ on the cross of Calvary. And on the alter were four 'horns' of brass, which in part speaks of the Lord Jesus Christ - \"He is my shield, and the horn of my salvation\" (Psalm 18:2). \n \n The next item found in the outer court was the Brazen Laver, a reservoir of water that the priests used to cleanse themselves. This represents the work of Christ and the Holy Spirit in spiritual regeneration - \"He saved us through the washing of rebirth and renewal by the Holy Spirit....\" (Titus 3:5). Other related verses include Ezekiel 36:25 and John 3:5. To the NT believer, we come first to the cross of Christ (Brazen Alter) for the blood sacrifice that covers our sins, followed by the indwelling presence and spiritual cleansing of the Holy Spirit at the Brazen Laver. \n \n Upon entering into the inner court (specifically referred to as the \"Holy Place\"), we first encounter the Table of Shewbread. John 6:35 shows us the significance of that bread - \"I am the bread of life.\" Jesus is also known as the \"Manna from Heaven\" in John 6:32. The feeding of the five thousand in Matthew 14:18-22 represents the twelve disciples giving the bread of Jesus to the multitude. \n \n The next item in the Holy Place was the Lampstand (Exodus 25:31). There are numerous references to light in the Bible, but for purposes of brevity the light represents Christ (\"The light of the world\" - John 8:12), as well as the NT believer (Matthew 5:14). The oil that fuels the lamp, and thus also the NT believer, is none other than the Holy Spirit (note the parable of the \"Ten Virgins\" in Matthew 25). \n \n Next we come to the Golden Alter (Exodus 30:1-10), upon which incense was burnt. The significance of this is found in Revelation 5:8 - \"Each one had a harp and they were holding golden bowls full of incense, which are the prayers of the saints.\" \n \n Continuing on, we come to the veil, or curtain, separating the Holy Place from the Holy of Holies. The curtain represents the Body of Christ - \"Therefore, brothers, since we have confidence to enter the Most Holy Place by the blood of Jesus, by a new and living way opened for us through the curtain, that is, His body....\" (Hebrews 10:20). The rent veil of Luke 23:45 signifies that NT believers can now enter the presence of God through faith in His Son, irrespective of further animal sacrifices. \n \n Finally, we come to the Ark of the Covenant (Exodus 25:10). The Ark consisted of two pieces - the rectangular \"box\" containing the Ten Commandments, a jar of manna, and Aaron's budding staff - and the second piece, the \"Mercy Seat,\" and /or, the \"Atonement Cover.\" The tablets of the Ten Commandments represent God's law to His people, and revealed to them the way they were to live their lives. The manna represents Jesus, the \"Bread of Life,\" who is the truth. The budding staff of Aaron represents the life that comes to us through Christ. Together, they are the OT representation of Christ, \"The way and the truth and the life\" (John 14:6). \n \n Above the law (the Ten Commandments) was the Atonement Cover (Exodus 25:17), which represents the atoning sacrifice of Christ at Calvary (note 1 John 2:2). Above this cover was the Mercy Seat, where God Himself would dwell. Which brings us to the following summary, showing the typology of Christ as His plan relates to the NT believer.\n \n 1. We first come to God through His Son at the Brazen Alter of Calvary.\n \n 2. We are cleansed and re-born in Christ by the Holy Spirit at the Brazen Laver. \n \n 3. We enter the Holy Place, where we:\n a. Partake of Christ, the \"manna from heaven,\" at the Table of Shewbread;\n b. Are illuminated by Christ, the Lampstand (the \"Light of the world\");\n c. And, we offer the incense of prayer at the Golden Alter.\n \n 4. We enter God's Holy of Holies through the veil (Christ's Body - Hebrews \n 10:20).\n \n \n 5. We are, like Christ, the New Testament Ark of the Covenant:\n a. God's laws (the Ten Commandments) are written on our hearts and minds\n (Hebrews 8:10);\n b. We have \"budded\" with eternal life (Aaron's staff);\n c. We have Christ (the jar of manna) in us (Colossians 1:27).\n \n 6. We are covered with the atoning sacrifice of Christ (the Atonement Cover).\n \n 7. And finally we are seated together in heavenly places with God (Ephesians \n 2:6) on His \"Mercy Seat.\"", 
   {}, 
   199977, 
   null, 
   1140757080.0
  ], 
  [
   201060, 
   null, 
   "johnson", 
   " The Tabernacle, or \"Sanctuary\" of God, as alluded to in Exodus 25:8, constitutes a vast representation of the coming Christ,\n\n \n \n Why.. because you say so ? Have you actually read the preceeding verses ??? \n Lets check this out closely, And lets do the thing you like so much, let's interpet it litarally.\n \n \n verse 1... god, or in this case the lord, speaks to Moses.\n \n verse 2... and it says .. every man is to bring god an offering willingly.. and in return recieve gods offering.\n \n verse 3... god clarifies what it wants .. it wants Gold, Silver, and Brass. \n ( perhaps it's saving for it's retirement )\n \n verse 4... It also wants blue, purple, & scarlet ... ( not shure how you give it that ?? ) perhaps it just wants the goats hair and fine linens that it also requests in this same verse to be these colors. But if this is the case why didn't it just say so clearly and literally ? ( goat hairs .. fine linens..? mabye god is cold. ) \n \n verse 5... Now god informs us it also needs .. dyed red rams skins, and badgers skins ( not shure if the badger skins need to be dyed red also, it doesn't really clearly say. ) And in this same verse god tells us it needs ( but doesn't specify how much ) \" s h i t-tim Wood \" ( I'm not going to touch this one ! ) \n \n verse 6... god reveales to us that it needs oil for light, and spices for it's anointing oil and sweet incense. ( from this we can clearly understand god has trouble seeing in the dark, .. and likes to smell good. )\n \n verse 7... god requests onyx and other stones set in it's \" e-phod, and in the breastplate. \" ( being a god of war I'm not supprised it needs these. )\n \n verse 8... \" And let them make me a sanctuary; that I may dwell among them. \"\n \n Then verse 9 thru 21...go on to give the deminsions and other finishing touches to the \" sanctuary \" or as you insist \" consecrated place \" that are to be provided for this thing god's going to dwell in, amongst the people reffered to in the preceeding verses. \n \n How in the world do you arrive at the conclusion that this in any way means the comming of a christ that most jews reject ??\n \n \n \n \n and also serves as an inanimate prototype of the New Testament believer\n\n \n I think your way of reading this is an animated, whishful, prototype of the way you want things to be !!!", 
   {}, 
   199978, 
   null, 
   1141469280.0
  ], 
  [
   201157, 
   null, 
   "DamEtel", 
   "Easyrider: Let's see, we did ... Christianity in America and the Great Awakening ...\n\n \n So you worship Tennent, who died but was later resurrected, like Jesus was?\n \n \nEasyrider: [Let's see, we did] ... interpretations of Revelation ...\n\n \n So you realize that Revelation is not about the future, but about the past, with the whore of Babylon being Rome and the anti-Christ being Caesare Nero.", 
   {}, 
   199977, 
   null, 
   1141524300.0
  ], 
  [
   201165, 
   null, 
   "johnson", 
   " So you realize that Revelation is not about the future, but about the past, with the whore of Babylon being Rome and the anti-Christ being Caesare Nero.\n\n \n It seems that the notion of god speaking to anyone except EZ's genaration is beyond his ability to grasp.\n \n You know I think you can see as much as you want to see in a writing such as this, perhaps that was the authors intent... perhaps not. And unless we can get the guy to come back from the dead .. we'll never know for shure !", 
   {}, 
   201157, 
   null, 
   1141532820.0
  ], 
  [
   201222, 
   null, 
   "Easyrider", 
   "It seems that the notion of god speaking to anyone except EZ's genaration is beyond his ability to grasp.\n \n\n \n First define \"g-e-n-a-r-a-t-i-o-n\". It's wasn't in the dictionary.", 
   {}, 
   201165, 
   null, 
   1141580160.0
  ], 
  [
   201250, 
   null, 
   "johnson", 
   "First define \"g-e-n-a-r-a-t-i-o-n\". It's wasn't in the dictionary.\n\n \n Behold .. we stand in the shadow of the great tergiverastor !!\n \n Our amazement grows daily of his ability to side step lodgic and the real issue.\n \n So EZ, what about the first part of post #28 ??", 
   {}, 
   201222, 
   null, 
   1141594200.0
  ], 
  [
   201340, 
   null, 
   "Obvious Child", 
   "So you realize that Revelation is not about the future, but about the past, with the whore of Babylon being Rome and the anti-Christ being Caesare Nero.\nI'm glad you can be totally certain about its meaning: have you had a chat with the author?", 
   {}, 
   201157, 
   null, 
   1141663200.0
  ], 
  [
   201393, 
   null, 
   "johnson", 
   "I'm glad you can be totally certain about its meaning: have you had a chat with the author?\n\n \n \n And here is where the problem lies .. we can't talk to these dead authors, .. we have absoutly no way of knowing for shure what they mean.\n \n However, placed in light of the historical context of the time we all agree they were written,.. this theroy seems the most likely.\n \n Those that claim a relationship to today's events have to jump thru a few moore hoops, to get their theroy to fit,.. than those making the above claim.\n \n Claims they all are and will remain.", 
   {}, 
   201340, 
   null, 
   1141678380.0
  ], 
  [
   201467, 
   null, 
   "DamEtel", 
   "I'm glad you can be totally certain about its meaning: have you had a chat with the author?\n\n \n Yes, John spoke to me in a vision, revealing to me what the Book of Revelation means.\n \n What, he hasn't spoken to you?", 
   {}, 
   201340, 
   null, 
   1141698660.0
  ], 
  [
   201804, 
   null, 
   "epaphras_faith", 
   "So you worship Tennent, who died but was later resurrected, like Jesus was?\n \n \n \n So you realize that Revelation is not about the future, but about the past, with the whore of Babylon being Rome and the anti-Christ being Caesare Nero.\n\n \n Actually, it is neither about the past or the future. It does contain both past and future events. However, The correct title of the book is \"The Revelation of Jesus Christ to the Apostle John\"\n \n EF", 
   {}, 
   201157, 
   null, 
   1141856160.0
  ], 
  [
   241362, 
   null, 
   "Gur", 
   "\n For example (I'll find it somewhere) when translated to English, someone decided the words should read \"In the beginning\" and not \"In beginning\" as it was originally. Similar statements, but drastically different consequences of interpretation.\n\n \n Niether of those are literal. The first word of the Torah is be'reshit not ba'reshit meaning that the \"The\" is even more inappropriate. The prefix, be means \"At\" not \"In The\". Also, the literal translation would be First, or At First, not In the beginning. The reason it is translated literally as First is because be'reshit comes from the word rishon, meaning first.\n \n If they wanted to say, In The Beginning, they would have used ba'hatkhaka.\n \n Two completely different words.", 
   {}, 
   198718, 
   null, 
   1164791580.0
  ], 
  [
   241363, 
   null, 
   "Gur", 
   "Let's look at your first pathetic example:\n \n The translation of the Hebrew in Psalam 22:16 is \"pierced\" in the Greek Septuagint (translated by Jewish scholars, by the way), which was completed centuries before Jesus was crucified, and centuries before the advent of Christianity. Therefore your charge that Christian interpreters \"twist\" the meaning of the Hebrew Bible, only shows your bias and unscholarly opinion.\n\n \n This article should take you about an hour and half to read and should dispel any notion you have about Psalm 22.\n \n geocities.com/paulntobin/pierce.html", 
   {}, 
   199201, 
   null, 
   1164792360.0
  ], 
  [
   241423, 
   null, 
   "epaphras_faith", 
   "Niether of those are literal. The first word of the Torah is be'reshit not ba'reshit meaning that the \"The\" is even more inappropriate. The prefix, be means \"At\" not \"In The\". Also, the literal translation would be First, or At First, not In the beginning. The reason it is translated literally as First is because be'reshit comes from the word rishon, meaning first.\n \n If they wanted to say, In The Beginning, they would have used ba'hatkhaka.\n \n Two completely different words.\n\n \n Hmmmmmmmmm\n \n Lets see....\n \n \"At First, God created the heavens and the earth...\"\n \n \"in the beginning God created the heavens and the earth....\"\n \n The sense is the same.", 
   {}, 
   241362, 
   null, 
   1164828600.0
  ], 
  [
   241452, 
   null, 
   "Gur", 
   "Hmmmmmmmmm\n \n Lets see....\n \n \"At First, God created the heavens and the earth...\"\n \n \"in the beginning God created the heavens and the earth....\"\n \n The sense is the same.\n\n \n Does G-d have a beginning?", 
   {}, 
   241423, 
   null, 
   1164837900.0
  ], 
  [
   241640, 
   null, 
   "epaphras_faith", 
   "Does G-d have a beginning?\n\n No. But that is irrelevant. Time had a beginning. God created that too. Therefore the first thing to occur and the beginning are the beginning. The sense is the same. You have to look waaaaaaaaaaaaaaaay out of context to interpret it differently.", 
   {}, 
   241452, 
   null, 
   1164932160.0
  ], 
  [
   241707, 
   null, 
   "Gur", 
   "No. But that is irrelevant. Time had a beginning. God created that too. Therefore the first thing to occur and the beginning are the beginning. The sense is the same. You have to look waaaaaaaaaaaaaaaay out of context to interpret it differently.\n\n \n I'm not looking at out of context, I'm giving you the literal meaning. If you want to take the interpretations of your bible translators, that's fine. It's your choice if you like their interpretation of what it says. Bottom line is that you can call your bible translators from your church and ask them what the root of the first word of the bible is. The root of the word, is Rishon which means first, not beginning.\n \n And if you want to get even more literal, it's gods (plural), not G-d.", 
   {}, 
   241640, 
   null, 
   1164958740.0
  ], 
  [
   242108, 
   null, 
   "epaphras_faith", 
   "I'm not looking at out of context, I'm giving you the literal meaning. If you want to take the interpretations of your bible translators, that's fine. It's your choice if you like their interpretation of what it says. Bottom line is that you can call your bible translators from your church and ask them what the root of the first word of the bible is. The root of the word, is Rishon which means first, not beginning.\n \n And if you want to get even more literal, it's gods (plural), not G-d.\n\n \n YOu are absolutely taking it out of context. My point is, in context, it does not really matter whether it is \"first\" or \"beginning\". They are the same thing. Ever heard of a synonym?\n \n Quite right that it is plural. Hence the first indication of the trinity. I know the root. I am not arguing that. I am arguing that it DOES NOT MATTER. Words out of context have no meaning. Put in context, the word has the same meaning.\n \n EF", 
   {}, 
   241707, 
   null, 
   1165254660.0
  ], 
  [
   242600, 
   null, 
   "Gur", 
   "YOu are absolutely taking it out of context. My point is, in context, it does not really matter whether it is \"first\" or \"beginning\". They are the same thing. Ever heard of a synonym?\n\n Yes I have heard of a synonym. So the root of the word rishon, which means first. So, I ask again, which is more literal? First or beginning? Looking purely from a linguistical point of view.\n \n \n I know the root. \n\n Doubtful. Where did you study hebrew?", 
   {}, 
   242108, 
   null, 
   1165558740.0
  ], 
  [
   242631, 
   null, 
   "epaphras_faith", 
   "Yes I have heard of a synonym. So the root of the word rishon, which means first. So, I ask again, which is more literal? First or beginning? Looking purely from a linguistical point of view.\n \n \n Doubtful. Where did you study hebrew?\n\n \n As to your last sentence: One does not have to \"study hebrew\" to be able to read a dictionary. However, a local seminary is where I learned.\n \n Again, if you take something out of context you are not getting the proper meaning. Literal is only literal if in context.\n \n You may have the last word, but you keep ignoring the argument. Linguistically, one must consider the context. First or beginning. Same thing.\n \n I shall not respond further since you are obviously just bent on being right instead of having a discussion. You refuse to answer a simple argument. I am not interested in that kind of debate.\n \n EF", 
   {}, 
   242600, 
   null, 
   1165610220.0
  ], 
  [
   242780, 
   null, 
   "pappillion001", 
   "How come old testament book translated into english don't match word for word thier hebrew conterparts?\n \n That seems to me to be a problem with who is translating what for whom for what purpose. Why do you suppose Christian translators came up with different meanings for words (some of which the whole religion is based on) than those of the jewish translators?\n \n Funny I would think they should match word for word, I mean they are the same books, why shouldn't they? I guess if one group was to get it wrong it could never be the group that came after the fact, the group that has a history of forging documents, suppressing the truth and of course destroying anything that did not agree with it or threatened to take away it's wealth and/or power. \n \n There are no errors in the Bible. Each and every one of those incorrectly translated verses was done on purpose. So can you really call it an error?emoticon_xangel emoticon_idea", 
   {}, 
   242631, 
   null, 
   1165786320.0
  ], 
  [
   242830, 
   null, 
   "Yossarian", 
   "Hmmm.... I can't say there are \"no errors in the Bible\", even in the original languages. How do I know John the Revelator didn't use the wrong Greek word for something or other when he transcribed his remembrance of his (maybe) drug-fueled (possible) hallucinations? Could be it's all his fault, or is going to be. :)\n \n But too, I'm sure King James, at least, had an agenda of his own when he commissioned his version. And surely the folks who \"translated\" it had some specific points they wanted to get across as well. For all I know, all those various sayings about how God will make you healthy, wealthy and wise were simply put there to justify a small \"nobility\" dominating a vast peasantry. \"See, we're obviously God's chosen rulers. We're the richest. Ipso facto.\"\n \n Without being able to read the original texts, I can't comment much on how well the various Bible versions are translated. Still, it doesn't follow that there could always be a \"word for word\" translation of something. Some words just don't exist in some languages, there's no concept of them and hence no need for them. Think South Africans ever had a word for \"snow\", or Eskimo's a word for \"heat wave\"?", 
   {}, 
   242780, 
   null, 
   1165809900.0
  ], 
  [
   242844, 
   null, 
   "Gur", 
   "How come old testament book translated into english don't match word for word thier hebrew conterparts?\n \n That seems to me to be a problem with who is translating what for whom for what purpose. Why do you suppose Christian translators came up with different meanings for words (some of which the whole religion is based on) than those of the jewish translators?\n \n Funny I would think they should match word for word, I mean they are the same books, why shouldn't they? I guess if one group was to get it wrong it could never be the group that came after the fact, the group that has a history of forging documents, suppressing the truth and of course destroying anything that did not agree with it or threatened to take away it's wealth and/or power. \n \n There are no errors in the Bible. Each and every one of those incorrectly translated verses was done on purpose. So can you really call it an error?emoticon_xangel emoticon_idea\n\n \n Not to defend them, but some of the possible and probably reasons is because of the way the Torah is written. \n \n 1) All vowels are places under the letters, but the Torah has no vowels which lead to the possibility of one word being translated numerous ways.\n 2) Some words just don't translate.\n 3) Tenses, Modern Hebrew only has 4 tenses, which biblical hebrew having only a couple. Modern English has dozens of tenses. So translating can be difficult.\n \n Now, these don't account for a lot of the translations that they come up with. For example, they translate certain words in one place one way and in another place as something radically different. Example, Isaiah 7:14. Always as virgin, but the same word when applied to Rebecca is suddenly woman. Or some of the time they make up words to further their translation.", 
   {}, 
   242780, 
   null, 
   1165818600.0
  ], 
  [
   243969, 
   null, 
   "cheererer08", 
   "Naturally, the bible being written by humans, there is always human error involved and certain things left out for the purpose of further advancing their own religion. The same is seen in history books from different countries following a war, regarding the cause and outcomes of wars, and the doings during the war. \n There's always the margin for human error involved in the translating and transcribing of the \"teachings\" of the bible. Being initially written by humans itself, there's also a question of the motives of the original authors and what they were receiving or achieving out of the original writing. Because when you look at humans as a whole, we usually won't do something unless we are receiving anything out of the deal. \n The translations also sometimes differ from strains of different languages to another, resulting in a \"false\" translation. Technically there isn't a \"wrong\" translation, just a case of mistaken identity for the words. Also words that exist in one language, may not exist in another because of the basic lack of a need for the word.", 
   {}, 
   242844, 
   null, 
   1166468460.0
  ], 
  [
   245394, 
   null, 
   "Easyrider", 
   "Naturally, the bible being written by humans, there is always human error involved and certain things left out for the purpose of further advancing their own religion. The same is seen in history books from different countries following a war, regarding the cause and outcomes of wars, and the doings during the war. \n There's always the margin for human error involved in the translating and transcribing of the \"teachings\" of the bible. Being initially written by humans itself, there's also a question of the motives of the original authors and what they were receiving or achieving out of the original writing. Because when you look at humans as a whole, we usually won't do something unless we are receiving anything out of the deal. \n The translations also sometimes differ from strains of different languages to another, resulting in a \"false\" translation. Technically there isn't a \"wrong\" translation, just a case of mistaken identity for the words. Also words that exist in one language, may not exist in another because of the basic lack of a need for the word.\n\n \n Is the New Testament Reliable?\n \n http://www.christiananswers.net/q-eden/edn-t007.html", 
   {}, 
   243969, 
   null, 
   1167614520.0
  ], 
  [
   245869, 
   null, 
   "ShadowPikachu", 
   "How the heck were there Nephilim (giants) before the flood (Genesis 6:4) and after the flood (Numbers 13:33) if the flood destroyed all living creatures on the earth apart from Noah, his family, and the animals on the ark?", 
   {}, 
   245394, 
   null, 
   1167935400.0
  ], 
  [
   245891, 
   null, 
   "ShadowPikachu", 
   "I think this is a pretty good site on error in the bible: http://www.infidels.org/library/modern/donald_morgan/inconsistencies.html\n Some of the examples are a little nitpicky, but there are some good ones as well.", 
   {}, 
   245869, 
   null, 
   1167939180.0
  ], 
  [
   246277, 
   null, 
   "Easyrider", 
   "I think this is a pretty good site on error in the bible: http://www.infidels.org/library/modern/donald_morgan/inconsistencies.html\n Some of the examples are a little nitpicky, but there are some good ones as well.\n\n \n And here's a better one that answers or refutes their contentions:\n \n http://www.answeringinfidels.com/", 
   {}, 
   245891, 
   null, 
   1168189920.0
  ], 
  [
   246363, 
   null, 
   "ShadowPikachu", 
   "And here's a better one that answers or refutes their contentions:\n \n http://www.answeringinfidels.com/\n\n \n Mind giving an actual link to the supposed rebuttals instead of expecting us to search through the site to find one or two that answer one or two of the many inconsistencies pointed out?", 
   {}, 
   246277, 
   null, 
   1168241040.0
  ], 
  [
   246416, 
   null, 
   "ShadowPikachu", 
   "How come old testament book translated into english don't match word for word thier hebrew conterparts?\n \n That seems to me to be a problem with who is translating what for whom for what purpose. Why do you suppose Christian translators came up with different meanings for words (some of which the whole religion is based on) than those of the jewish translators?\n \n Funny I would think they should match word for word, I mean they are the same books, why shouldn't they? I guess if one group was to get it wrong it could never be the group that came after the fact, the group that has a history of forging documents, suppressing the truth and of course destroying anything that did not agree with it or threatened to take away it's wealth and/or power. \n \n There are no errors in the Bible. Each and every one of those incorrectly translated verses was done on purpose. So can you really call it an error?emoticon_xangel emoticon_idea\n\n \n LOL! That's totally true! Politically charged translations are common, and very powerful.", 
   {}, 
   242780, 
   null, 
   1168293120.0
  ], 
  [
   246430, 
   null, 
   "Easyrider", 
   "Mind giving an actual link to the supposed rebuttals instead of expecting us to search through the site to find one or two that answer one or two of the many inconsistencies pointed out?\n\n \n The sub links, by topic, are on the immediate left when you enter the site. Not at all hard to find.", 
   {}, 
   246363, 
   null, 
   1168299300.0
  ], 
  [
   246432, 
   null, 
   "ShadowPikachu", 
   "The sub links, by topic, are on the immediate left when you enter the site. Not at all hard to find.\n\n Thank you mister obvious! Unfortunately, the side links link to various articles (by numerous people I have no idea of the credentials for), that really don't seem to answer any of it. For the most part it seems to be articles about whether or not the Gnostic gospels (Gospel of Thomas) should be included in the bible and whether or not Jesus is Moral. If you aren't willing to direct me to the part that refutes all of the claims of my link, we'll assume you were lying and nothing there refutes it and you just posted a link hoping no one would look at it.", 
   {}, 
   246430, 
   null, 
   1168300200.0
  ], 
  [
   246677, 
   null, 
   "Easyrider", 
   "Mind giving an actual link to the supposed rebuttals instead of expecting us to search through the site to find one or two that answer one or two of the many inconsistencies pointed out?\n\n \n I think you're looking for answers to infidels.org. Some of them are in the link, though they're generalized by topic.\n \n But if you'd like more specific rebuttals to specific arguments by skeptics, here's some additional ones for you:\n \n Alleged Contradictions Answered: \n \n http://contenderministries.org/discrepancies/contradictions.php\n \n Resources to Refute the Skeptics and Critics\n \n http://www.apocalipsis.org/difficulties.htm\n \n Answering a List of Biblical Contradictions \n \n http://www.tektonics.org/lp/merrit01.html\n \n 101 Contradictions Cleared\n \n http://debate.org.uk/topics/apolog/contrads.htm\n \n Like the infidels.org, some arguments are better than others.\n \n Cheers...", 
   {}, 
   246363, 
   null, 
   1168473720.0
  ], 
  [
   247949, 
   null, 
   "Abrisajac", 
   "Was it a human error for the Levite to cut his concubine up into 12 pieces, after he put her outside to be gang raped all night long by men of the town, who apparently killed her sometime during the hours-long rape fest?", 
   {}, 
   246677, 
   null, 
   1169354100.0
  ], 
  [
   248074, 
   null, 
   "peteratwar", 
   "Was it a human error for the Levite to cut his concubine up into 12 pieces, after he put her outside to be gang raped all night long by men of the town, who apparently killed her sometime during the hours-long rape fest?\n\n \n Indeed it was. Waste of a good asset.", 
   {}, 
   247949, 
   null, 
   1169481000.0
  ], 
  [
   250684, 
   null, 
   "Yossarian", 
   "It doesn't matter if the Bible contradicts itself. It doesn't matter how much, or little, \"formal education\" you have regarding it. It's words, printed on paper. It doesn't matter how old or young words are: if you find something true and useful in them, use it. If you don't, don't.", 
   {}, 
   248074, 
   null, 
   1171248300.0
  ], 
  [
   286781, 
   null, 
   "feindslayer", 
   "The Bible was written by many of the wisest men in history. Plus, it was inspired by God himself.", 
   {
    "post_info": {
     "post_title": "The Answer to Your Problem"
    }
   }, 
   198718, 
   null, 
   1191648240.0
  ], 
  [
   286793, 
   null, 
   "unkerpaulie", 
   "The Bible was written by many of the wisest men in history. Plus, it was inspired by God himself.\n\n thats true. i helped. my next bible will be 10 times better if i get around to finishing it", 
   {}, 
   286781, 
   null, 
   1191651420.0
  ], 
  [
   287051, 
   null, 
   "peteratwar", 
   "I doubt that it was written by the wisest men.\n \n It was written by men who were doing their best inspired by theri love of God to write down what was and is so that it could be understood by many.\n \n Being men, no doubt they weren't wholly accurate.\n \n No doubt again whilst doing their best the various translators failed in a number of areas to pass on a full understanding.\n \n We should congratulate them on their dedication", 
   {}, 
   286793, 
   null, 
   1191859440.0
  ], 
  [
   287072, 
   null, 
   "GodsCowboy", 
   "... I have a belief that because the Bible was written by man, there are inevitably errors transcribed over the course of millenia. \n ... \n For example (I'll find it somewhere) when translated to English, someone decided the words should read \"In the beginning\" and not \"In beginning\" as it was originally. Similar statements, but drastically different consequences of interpretation.\n ...\n \n\n \n You're soooo right. But GOD has ways to get us back on track. I hae NO DOUBT that in time GOD will get us back on the RIGHT PAGE. I'm doing ALL I can on my website.\n \n You documented several reasons for the bible to be incorrect but you left off a couple.\n \n 1st - The information was past on from person to person for an UNKNOWN number of years before a lot of it was put to paper. Only GOD knows how close it is to the EXACT truth by then. Try telling a story to a friend and let him tell a few people and see how close it is to the truth and how complete it is when it gets back to you.\n \n 2nd - People tend to change the truth when it DOESN'T agreed with what they want to believe. They also DON'T like to make themsleves look like bad guys but they DON'T mind making it look like someone they DON'T like look like a bad guy. \n \n 3rd- The people that put the bible together were working under the direction of the rich and famous. I believe it was a king that decided [B]GOD'S MESSAGES[/B should be put together in a book. I'm sure he had a hind in deciding which stories were allowed in the bible and which should be excluded. I would expect the rich played a lot bigger role in putting it together, so they would DOWN PLAY the fact that the rich would have a harder time getting into heaven. They might also have down played the requirement to help the poor. So I bet the bible was watered down for politicial reason and to get the funding needed to make it happen.", 
   {
    "post_info": {
     "post_title": "It Gets Worse"
    }
   }, 
   198718, 
   null, 
   1191871800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Human error in the Bible", 
  "url": "http://www.4forums.com/political/biblical-contradictions/7599-human-error-bible.html", 
  "breadcrumbs": [
   "Biblical Contradictions"
  ], 
  "id_number": 7599, 
  "discussion_files": [
   [
    "2377.html", 
    "http://www.4forums.com/political/biblical-contradictions/7599-human-error-bible-print.html"
   ], 
   [
    "2378.html", 
    "http://www.4forums.com/political/biblical-contradictions/7599-human-error-bible-5-print.html"
   ], 
   [
    "2379.html", 
    "http://www.4forums.com/political/biblical-contradictions/7599-human-error-bible-4-print.html"
   ], 
   [
    "2380.html", 
    "http://www.4forums.com/political/biblical-contradictions/7599-human-error-bible-3-print.html"
   ], 
   [
    "2381.html", 
    "http://www.4forums.com/political/biblical-contradictions/7599-human-error-bible-2-print.html"
   ]
  ], 
  "identifier": 7599
 }
]