[
 [
  [
   198946, 
   null, 
   "unkerpaulie", 
   "when recruits are sworn into the military, their foremost duty is to defend the constitution, protect the country from all enemies, and hold allegience to the country (be a representative of what america stands for). well at least thats what the old oath used to say \n\"I, ______, do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign or domestic; that I will bear true faith and allegiance to the same; that I take this obligation freely, without any mental reservation or purpose of evasion; and that I will well and faithfully discharge the duties of the office on which I am about to enter. So help me God.\"\n\n nowadays the enlistment oath has been changed\n\"I, _____, do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the orders of the officers appointed over me, according to regulations and the Uniform Code of Military Justice. So help me God.\"\n\n today's soldier is bound by his oath to both defend the constitution and obey the orders of the president. of course, the problem arises when the president's orders are unconstitutional. do we allow them to abandon the part of the oath and adhere to the other? which should overrule?", 
   {
    "post_info": {
     "post_title": "when is enough enough?"
    }
   }, 
   null, 
   null, 
   1140204780.0
  ], 
  [
   198953, 
   null, 
   "JPSartre12", 
   "when recruits are sworn into the military, their foremost duty is to defend the constitution, protect the country from all enemies, and hold allegience to the country (be a representative of what america stands for). well at least thats what the old oath used to say \n nowadays the enlistment oath has been changed\n today's soldier is bound by his oath to both defend the constitution and obey the orders of the president. of course, the problem arises when the president's orders are unconstitutional. do we allow them to abandon the part of the oath and adhere to the other? which should overrule?\n\n \n Maybe that's why we have a third branch of gov't, the Judiciary.", 
   {}, 
   198946, 
   null, 
   1140205620.0
  ], 
  [
   198975, 
   null, 
   "Master_Shake", 
   "Interesting...when was this changed?", 
   {}, 
   198953, 
   null, 
   1140208920.0
  ], 
  [
   198984, 
   null, 
   "unkerpaulie", 
   "i got the info about the oaths from http://www.army.mil/cmh/faq/oaths.htm", 
   {}, 
   198975, 
   null, 
   1140211080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  when is enough enough?", 
  "url": "http://www.4forums.com/political/peace-middle-east/7604-when-enough-enough.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 7604, 
  "discussion_files": [
   [
    "19579.html", 
    "http://www.4forums.com/political/peace-middle-east/7604-when-enough-enough-print.html"
   ]
  ], 
  "identifier": 7604
 }
]