[
 [
  [
   199051, 
   null, 
   "Caprii", 
   "New York State has a law where public employee cannot strike. The Taylor law.\n \n This is GROSS violation of their civil rights. Why? Because, everyone is considered EQUAL and you wouldn't expect \"civilians\" in the private sector with a comparable job not to be able to strike, that would be unconsitutional. \n \n A PUBLIC employee who works at a hospital CANNOT strike, but private-owned companies' employees CAN strike. Clerical workers for the state CANNOT strike but private citizens CAN. Public teachers CANNOT teach, but private school teachers CAN. Police Officers cannot strike, firefighters cannot strike, etc.\n \n The Taylor Law is a great example of David and Goliath, and David never wins here. A goverment forcing the employees to SHUT-UP, KEEP WORKING, and be fined OUTRAGEOUS FINES AND PENALTY, and most people want to strike because unfair labor practice, like working without a contract and the State or City refuses to bargain with the unions. State and City don't care if employees are working without a contract and its to the States benefit, because the State or City is not penalized or anything in fact they make out like a bandit, by giving \"zeros\" and/or getting million on interest they NEVER give to the employee once a contract is accepted.\n \n What do you guys think about this? I think if we live in a \"equal\" society, those in the public sector should have the same rights as those in the private sector are afforded. Yes, critical positions like Police are unique, and are critical to the citizens of that State, but by the same token, when states refuse to give adequate raises etc., they sit around for years until the unions finally cave in and take what the state/city offers. \n \n Where's the bargaining? What kind of voice do the public employees have? If the Taylor law is constitutional then the people in the private sector too must give up their right to express themselves through a strike. Most jobs with the exception of Police, are in the private and public sector, how can we tell a class of people they can't freely express themselves like the rest of us. And as for police, does the State and City have such a strong hold on them, that the State and City are justified to make Police work without a contract, and is it justified to give \"zeros\" and is it justified for the state and city to keep the millions of dollars they made in interest and not give it to the employee where it rightfully belongs.\n \n Instead of the Taylor law, maybe their should be a law where the State and City can't drag their feet, where new contracts must be in place before the old one expires. If a employee doens't have a contract, shouldn't he or she have the right to strike???? I think so.", 
   {
    "post_info": {
     "post_title": "NY Taylor Law NY State"
    }
   }, 
   null, 
   null, 
   1140233760.0
  ], 
  [
   199308, 
   null, 
   "Tastyfish", 
   "Makes sense to me, in most of those cases I would imagine there isn't an alternative, which is why the government runs that particular service as generally they just end as a monopoly in an area anyway not to mention unproffitable but essential services would risk being cut.\n \n There is a huge difference between a strike at a T-shirt factory and a Police station - the latter is just too big a risk as it says 'today, there will be no laws', its too powerful a bargaining chip. Striking isn't the only way to demonstrate and here it can cause more harm than good.", 
   {}, 
   199051, 
   null, 
   1140395760.0
  ], 
  [
   199406, 
   null, 
   "Caprii", 
   "There is no \"correct\" answer, how we perceive equality will translate into our laws. \n \n If a doctor cannot strike who works for a city hosptial, but a doctor can strike in a privately-operated company in the same city, BOTH positions of doctor of the same importance, when you distinguish there are different groups of people that should have less rights than another group, you're setting up an imbalance in our society.\n \n As for the police, which is unique in itself. Government should not have the greatest upperhand, and if society want's that where government has the last say, its neither right or wrong, its just another way we de-value the spirit of equality of human beings. \n \n In another thread, someone said is congress more powerful than the president and everyone has thier opinion, but you all forget something at the core of our constitution is that the PEOPLE are all equal. It's the PEOPLE who make up our society and people in the government are there not to impose their will but are there to relay the message of the people who sent them there.\n \n Governments are operated by PEOPLE, we don't give politicians POWER we give them RESPONSIBLITY. People we ELECT are messengers, people sent to send the word of \"their\" people, be that of the state or federal level. \n \n We the people must call back the \"messengers\" if they do not speak for their majority. \n \n Never forget Congress is a Place a BUILDING, The Presidency is a Office, yet another building and there are only PEOPLE who occupy these seats, just people no greater importance than any other person. Just because we place PEOPLE in a position that holds a tremendous amount of responsiblity, they don't hold greater power than you and me, they hold different responsiblities than you and I, just like a doctor, he has a duty to act responsibly and what is required of his/her position. The doctor is NOT more powerful than the patient, the doctor has been \"elected\" by the patient to perform a duty and if the doctor does not perform the duty he was elected to do then the doctor has breached the \"will of that person\".\n \n What I'm trying to say, positions and buildings are things and places, all with varying responsibilites. People fill these position, that's all. If we want to \"think\" people are more powerful than others you may \"think\" what you wan't but if you truly want to live and thrive in the democracy our forefathers tried to start then we must do our part and stop thinking of the \"myth\" that politicians are in power, they are not WE are.\n \n Now having said that I must say the people we have ELECTED, have acted irresponsibly and I say that for one reason, the national debt, People! By the end of the Bush era we will have a government nearing bankruptcy. IMO.\n \n A good example of the last paragraph. For those married couples out there that pay bills. Who writes the checks to pay the bills? The person who takes the \"responsiblity\" is that person more powerful? NO. but as couples we \"elect\" someone to be the bill payer. Now tell me is the \"bill payer\" more \"powerful\" than the other spouse? No. But they do have a RESPONSIBILITY to pay the bills in accordance with the \"people\" who \"elect\" them to pay the bills, in this case the spouse, and NOT SPEND on unauthorized items. Doing such a thing is not called POWER, but wreckless behavior, and this behavior impacts the \"the people\" in this case, the other spouse, financially and emotionally. \n \n Just because this spouse gave the duties to the other spouse to pay the bills and if that person abuses that responsiblity, that was not the will of the other spouse. Same as with our democracy and our government. These people we send to the BUILDINGS, of congress and the presidency, put on their pants one leg at a time just like you and I, they are no greater or no lesser a person, their positon may hold tremendous responsiblity but that in itself does not give a person POWER. We don't elect a Senator and once the Senator is elected the Senator says okay Its all about my views and my desires, thats not power that selfish stupidity and unfortunately in a LARGE democracy, that is the rationale of all people in OFFICE...me me me me, spend what I want, make laws that I would want, and you know why they get away with it, because the people who \"elected\" them, have no clue what is going on behind senate walls, have no idea how to understand the mumbo jumbo maze of congress, have know idea of the incoming monies and the outgoing monies. Our goverment should be more accessible to the public with finances but they are not, they make it very hard for citizens to understand very simple things like finance.\n \n I'm not stupid and in fact no one here is stupid, but let me pose a question to you all.\n \n Question #1: Does anyone know what the yearly incoming monies was for our federal goverment in 2005? \n \n Question #2: Does anyone know what the yearly expenditures were for 2005?\n \n Write to your senators and ask these two simple questions, I bet they don't respond. Because they don't know.\n \n It IS quite simple but we don't know it because they make it quiete complex.\n Its all in the organization. If you, an individual, was a corporation, you would know how much money came in and how much went out, the concept is the same with every organization that deals with finances. Our government is the biggest enron. How sad.", 
   {}, 
   199308, 
   null, 
   1140464820.0
  ], 
  [
   199410, 
   null, 
   "JPSartre12", 
   "New York State has a law where public employee cannot strike. The Taylor law.\n \n This is GROSS violation of their civil rights. Why? Because, everyone is considered EQUAL and you wouldn't expect \"civilians\" in the private sector with a comparable job not to be able to strike, that would be unconsitutional. \n \n A PUBLIC employee who works at a hospital CANNOT strike, but private-owned companies' employees CAN strike. Clerical workers for the state CANNOT strike but private citizens CAN. Public teachers CANNOT teach, but private school teachers CAN. Police Officers cannot strike, firefighters cannot strike, etc.\n \n The Taylor Law is a great example of David and Goliath, and David never wins here. A goverment forcing the employees to SHUT-UP, KEEP WORKING, and be fined OUTRAGEOUS FINES AND PENALTY, and most people want to strike because unfair labor practice, like working without a contract and the State or City refuses to bargain with the unions. State and City don't care if employees are working without a contract and its to the States benefit, because the State or City is not penalized or anything in fact they make out like a bandit, by giving \"zeros\" and/or getting million on interest they NEVER give to the employee once a contract is accepted.\n \n What do you guys think about this? I think if we live in a \"equal\" society, those in the public sector should have the same rights as those in the private sector are afforded. Yes, critical positions like Police are unique, and are critical to the citizens of that State, but by the same token, when states refuse to give adequate raises etc., they sit around for years until the unions finally cave in and take what the state/city offers. \n \n Where's the bargaining? What kind of voice do the public employees have? If the Taylor law is constitutional then the people in the private sector too must give up their right to express themselves through a strike. Most jobs with the exception of Police, are in the private and public sector, how can we tell a class of people they can't freely express themselves like the rest of us. And as for police, does the State and City have such a strong hold on them, that the State and City are justified to make Police work without a contract, and is it justified to give \"zeros\" and is it justified for the state and city to keep the millions of dollars they made in interest and not give it to the employee where it rightfully belongs.\n \n Instead of the Taylor law, maybe their should be a law where the State and City can't drag their feet, where new contracts must be in place before the old one expires. If a employee doens't have a contract, shouldn't he or she have the right to strike???? I think so.\n\n \n I don't think that governmental employees should be able to strike. That's part of the commitment you make when you take a job that pays too much, provides too many benefits and demands so little out of its workforce. What's to strike about? Too few parking spaces making it necessary to walk more than 20 feet per day? \n To me, the solution is an easy one. You want the ability to stroke, privatize all gov't jobs. That'd save us so much money when we fired 2/3rds of the protected gov't workforce that we could afford to pay higher wages to the survivors. emoticon_xgood", 
   {}, 
   199051, 
   null, 
   1140465300.0
  ], 
  [
   199415, 
   null, 
   "Caprii", 
   "I don't think that governmental employees should be able to strike. That's part of the commitment you make when you take a job that pays too much, provides too many benefits and demands so little out of its workforce. What's to strike about? Too few parking spaces making it necessary to walk more than 20 feet per day? \n To me, the solution is an easy one. You want the ability to stroke, privatize all gov't jobs. That'd save us so much money when we fired 2/3rds of the protected gov't workforce that we could afford to pay higher wages to the survivors. emoticon_xgood\n\n \n \n I guess being able to apply for food stamps is a BENEFIT.\n \n This is how the strongarm of the government CRUSHES the working class, you take away their voice and they become the working poor.\n \n http://www.msnbc.msn.com/id/11378406/\n \n A resident in NYC on a salary of 25,000.00 how sad. The employer should be ashamed. How ironically the employer is a government entity. The mayor can wiggle his way out and blame others, but he is the Mayor and he doesn't even care about those who keep the city safe. Sad Sad Sad.\n \n Give the people a say, give them some leverage, if we don't we're no better than S. Korea.", 
   {}, 
   199410, 
   null, 
   1140466740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  NY Taylor Law NY State", 
  "url": "http://www.4forums.com/political/civil-rights-debates/7608-ny-taylor-law-ny-state.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 7608, 
  "discussion_files": [
   [
    "22913.html", 
    "http://www.4forums.com/political/civil-rights-debates/7608-ny-taylor-law-ny-state-print.html"
   ]
  ], 
  "identifier": 7608
 }
]