[
 [
  [
   199053, 
   null, 
   "JOEBIALEK", 
   "Perhaps known as one of the greatest murder mysteries of all time, the assassination of President John F. Kennedy has for years intrigued scholars, authors and the average American citizen. The assassination can be classified into two distinct categories: method and significance. Few would argue that too much emphasis has been given to the method and very little to the significance. This is exactly how the perpetrators would like it to be. Photographic evidence along with eyewitness testimony has already conclusively proven that JFK was shot by more than one assassin. The Mary Mormon photo clearly shows the profile of a shooter behind the picket fence on the grassy knoll. It is obviously someone wearing a policeman's uniform {some speculate it was J.D. Tippit}. This was the fatal head shot. Two other bullets struck the President; the first one entered at the base of the throat and the second struck him in the back. While the positions of the assassins makes for a good game of clue, the more important issue is the significance of the assassination.\n \n Many have speculated that the former Soviet Union, Cuba, the KKK, the Mafia, LBJ, CIA and the FBI all had strong motives to attempt this. However, given the connection of Lee Harvey Oswald to the CIA and Jack Ruby to the Mafia along with the altered autopsy reports, the evidence points to a coup de' dat by the CIA. They did it because they believed JFK was taking the United States on the wrong path towards dealing with communism. That is the reason why the cover-up has been sustained for so long. The perpetrators honestly believed they were doing the right thing for the United States at the time. The will of the people was discarded in favor of preserving the nation as they saw fit. Unfortunately, they didn't realize the long term effects of the assassination. One result was the increased power of capitalism over democracy. Profit has become more important than freedom. Corporations are more concerned with increasing the wealth of a select few than with promoting the general welfare of the very nation that allows them to conduct business. A second result has been the subordination of this nation's civil liberties to the private agendas of the powers that be. The only opinions that are accepted today are those that further the bottom line. Contrary opinions are discouraged and distorted by spin doctors. The only explanation for the lack of attention given to the significance of the assassination is because the government, the military and the media all know what happened and to expose the event for what it really was goes to the central core of what constitutes the United States of America.", 
   {
    "post_info": {
     "post_title": "JFK Assassination"
    }
   }, 
   null, 
   null, 
   1140234000.0
  ], 
  [
   199065, 
   null, 
   "Liminus", 
   "Obviously, a vast amount has been written on this subject by both the misinformed and those who know far more of the topic than I, but the only fact that makes those unwanted \"conspiracy!\" warnings to sound in my head is the much-documented (in two government investigations) reduction of security around the President's motorcade on only that day.\n \n I just don't believe that this could possibly be a coincidence. Someone told the Secret Service to reduce its numbers in the crowds that day, and they must have had a reason for doing so. \n \n Unfortunately the trail ends there. There are so many conflicting theories, and so many refutations of the government version of events (and refutations of the refutations, and refutations of the refutaions of the refu...ad nauseam) that it is impossible to know where you stand. Such an important event, and such a lack of reliable analysis.\n \n The precise significance of Kennedy's death is hard to define, easy to argue about. However, without launching into a lengthy essay about my reasons, the best description of the JFK assassination I ever heard was that it was \"essentially a coup d'etat by the military establishment\".\n I will not be able to defend this position satisfactorily, I believe it from what I think I know about the way the world works, and from my knowledge of relevant historical events. It fits perfectly into the narrative of US history, and if true, explains alot about US foreign policy's increased slide into aggressive militarism in the second half of the 20th century.", 
   {}, 
   199053, 
   null, 
   1140239280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  JFK Assassination", 
  "url": "http://www.4forums.com/political/news-forum/7609-jfk-assassination.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 7609, 
  "discussion_files": [
   [
    "13117.html", 
    "http://www.4forums.com/political/news-forum/7609-jfk-assassination-print.html"
   ]
  ], 
  "identifier": 7609
 }
]