[
 [
  [
   11241, 
   null, 
   "Evolution", 
   "Extinction is easly visable easly tangeable and undenably evident. (where are the buffalo/dinosors/ect. 99% of all living creatures are extinct). In a static universe much like the one presented by creationsist, i ask you this. if you take away from the pie of life how can you account for the present diversity of life? i can: evolution the pie grows much like you and i grow from a single cell zygote to our presant body composed of many cells. if god created everything in about 4000 bc (which you have!!! to believe ; ) then i ask you how could orginsims be dying off. are we going to wind up with no pie? what will we eat? if you believe that god creates some sort of super organism which represents all other organisms. i ask you this. if the dinsours were around 4000-979 bc (around the time of the great flood thought to wipe them out, clearly egypt is an empire by this time). ago don't you think they (eygptians) would have said at least one thing about it? just one!! one picture or something from one of the many civlizations. ie babylon. i mean if t-rex is running around i would certinally be impressed. there would even be a t-rex religion i could imagine. \n \n -give it up you can't deny reality. just except who you are. it will only set you free.", 
   {
    "post_info": {
     "post_title": "Apple pie and the static universe."
    }
   }, 
   null, 
   null, 
   1056890460.0
  ], 
  [
   11244, 
   null, 
   "Porky Pine", 
   "Extinction is easly visable easly tangeable and undenably evident. (where are the buffalo/dinosors/ect.\n\n \n /nitpick mode on/ Buffalos are'nt extinct. They are even raised in farms for Buffalo burgers. /nitpick mode off/", 
   {}, 
   11241, 
   null, 
   1056897780.0
  ], 
  [
   11246, 
   null, 
   "Evolution", 
   "/nitpick mode on/ Buffalos are'nt extinct. They are even raised in farms for Buffalo burgers. /nitpick mode off/\n\n \n \n thanks for the correction. i meant to say willy mammoth (wink, wink). i was up late last night. anyway i can admit when i make a mistake, i'm not going to rationlize it.", 
   {}, 
   11244, 
   null, 
   1056898140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Apple pie and the static universe.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/761-apple-pie-static-universe.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 761, 
  "discussion_files": [
   [
    "26204.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/761-apple-pie-static-universe-print.html"
   ]
  ], 
  "identifier": 761
 }
]