[
 [
  [
   199163, 
   null, 
   "simone", 
   "http://www.tomdispatch.com/index.mhtml?emx=x&pid=60904\n \n The Wal-Mart Biennale\n By Rebecca Solnit \n \n It isn't that, when Wal-Mart heiress Alice Walton purchased Asher B. Durand's 1849 painting Kindred Spirits last year, she got the state of Arkansas to pass legislation specifically to save her taxes -- in this case, about $3 million on a purchase price of $35 million. It isn't that the world's second richest woman and ninth richest person (according to a Forbes magazine 2005 estimate) scooped the painting out from under the National Gallery and the Metropolitan Museum of Art, which had banded together to try to keep it in a public collection when the New York Public Library decided to sell it off. It isn't that Walton will eventually stick this talisman of New England cultural life and a lot of other old American paintings in the Crystal Bridges Museum of American Art, the Walton family museum she's building in Bentonville, Arkansas, the site of Wal-Mart's corporate headquarters -- after all people in the middle of the country should get to see some good art t! oo. It might not even be, as Wal-MartWatch.com points out, that the price of the painting equals what the state of Arkansas spends every two years providing for Wal-Mart's 3,971 employees on public assistance; or that the average Wal-Mart cashier makes $7.92 an hour and, since Wal Mart likes to keep people on less than full-time schedules, works only 29 hours a week for an annual income of $11,948--so a Wal-Mart cashier would have to work a little under 3,000 years to earn the price of the painting without taking any salary out for food, housing, or other expenses (and a few hundred more years to pay the taxes, if the state legislature didn't exempt our semi-immortal worker).\n \n The trouble lies in what the painting means and what Alice Walton and her $18 billion mean. Art patronage has always been a kind of money-laundering, a pretty public face for fortunes made in uglier ways. The superb Rockefeller folk art collections in several American museums don't include paintings of the 1914 Ludlow Massacre of miners in Colorado, carried out by Rockefeller goons, and the J. Paul Getty Museum in Los Angeles doesn't say a thing about oil. But something about Wal-Mart and Kindred Spirits is more peculiar than all the robber barons and their chapels, galleries, and collections ever were, perhaps because, more than most works of art, Durand's painting is a touchstone for a set of American ideals that Wal-Mart has been savaging. \n \n It may be true that, in an era when oil companies regularly take out advertisements proclaiming their commitment to environmentalism, halting global warming, promoting petroleum alternatives, and conservation measures, while many of them also fund arguments against climate change's very existence, nothing is too contrary to embrace. But Kindred Spirits is older, more idealistic, and more openly at odds with this age than most hostages to multinational image-making. . . .", 
   {
    "post_info": {
     "post_title": "Wal-mart Heiress Buys Art"
    }
   }, 
   null, 
   null, 
   1140297960.0
  ], 
  [
   199184, 
   null, 
   "Steeeeve", 
   "awww, She has too much money. Big deal.\n \n We aren't communist you know.", 
   {}, 
   199163, 
   null, 
   1140311400.0
  ], 
  [
   199239, 
   null, 
   "simone", 
   "But I thought this was a capitalistic democracy, not a plutocracy with King George as ruler. Guess I was wrong.", 
   {}, 
   199184, 
   null, 
   1140366600.0
  ], 
  [
   199248, 
   null, 
   "Steeeeve", 
   "But I thought this was a capitalistic democracy, not a plutocracy with King George as ruler. Guess I was wrong.\n\n It is a capitalistic democracy..which is why she can buy that art and doesn't have to spread her wealth if she doesn't want to.", 
   {}, 
   199239, 
   null, 
   1140373080.0
  ], 
  [
   199251, 
   null, 
   "simone", 
   "A plutocracy, like I said.\n \n Worshipping wealth and the wealthy. And fetuses, when it fits in with controlling people so they worship the wealthy.", 
   {}, 
   199248, 
   null, 
   1140373620.0
  ], 
  [
   199316, 
   null, 
   "Symbiote", 
   "I don't worship the wealthy, frankly I don't care how much money other people are making, it's none of my business.\n \n The only one who appears obsessed with the wealthy is you.", 
   {}, 
   199251, 
   null, 
   1140401580.0
  ], 
  [
   199328, 
   null, 
   "Steeeeve", 
   "I don't worship the wealthy, frankly I don't care how much money other people are making, it's none of my business.\n \n The only one who appears obsessed with the wealthy is you.\n\n \n I am a little worried...Symbiote and I beginning to agree on everything but abortion", 
   {}, 
   199316, 
   null, 
   1140409680.0
  ], 
  [
   199387, 
   null, 
   "simone", 
   "I don't care that she's wealthy. I'm just concerned about how that wealth was gained. With my bloody tax dollar!!!!!!! My tax dollars are going into that female dog's checkbook and I don't like it.", 
   {}, 
   199328, 
   null, 
   1140457680.0
  ], 
  [
   199402, 
   null, 
   "Steeeeve", 
   "I don't care that she's wealthy. I'm just concerned about how that wealth was gained. With my bloody tax dollar!!!!!!! My tax dollars are going into that female dog's checkbook and I don't like it.\n\n Wht tax dollars? Seriously, you haven't mentioned one program that gives money to Alice Walton. \n \n A tax-exemption is not using your tax dollars. Are you even a resident Arkansas?\n \n See http://www.nysscpa.org/cpajournal/2005/405/essentials/p54.htm for federal tax treatment", 
   {}, 
   199387, 
   null, 
   1140462660.0
  ], 
  [
   199404, 
   null, 
   "JPSartre12", 
   "I don't care that she's wealthy. I'm just concerned about how that wealth was gained. With my bloody tax dollar!!!!!!! My tax dollars are going into that female dog's checkbook and I don't like it.\n\n \n Envy of the wealthy is like penis envy, it's only practiced by those without it. \n In the case of the Waltons, consider the amount that they give to charity and tell me if the \"tax\" she didn't pay isn't offset by the good she's done. \n \n \n\n John Walton, one of founder Sam Walton's four children, says the family expects to donate as much as 20% of its $100 billion in Wal-Mart stock.\n http://www.usatoday.com/money/companies/2004-03-11-waltons_x.htm\n \n\n \n That's over $20Billion earmarked primarily towards improving public education in the US. The thoughtless bastards! emoticon_angry emoticon_rolleyes", 
   {}, 
   199387, 
   null, 
   1140463920.0
  ], 
  [
   199624, 
   null, 
   "Caprii", 
   "Simone, be aware of the following:\n \n Criminals, Politicians and Billionaires...all theives.emoticon_xkill emoticon_xkill emoticon_xkill", 
   {}, 
   199404, 
   null, 
   1140573660.0
  ], 
  [
   199688, 
   null, 
   "GreenMtnBoy", 
   "Wht tax dollars? Seriously, you haven't mentioned one program that gives money to Alice Walton. \n\n \n Medicare. Welfare. \n \n By paying their workers so little, Walmart costs the tax payers about $3000 a year in aid given to Wal-mart workers. That's $3000 Alice keeps. It isn't direct, but it's absolutely deliberate.\n \n If they were truely charitable they'd pay their workers decently and give them good benifits.", 
   {}, 
   199402, 
   null, 
   1140606840.0
  ], 
  [
   199704, 
   null, 
   "Steeeeve", 
   "Medicare. Welfare. \n \n By paying their workers so little, Walmart costs the tax payers about $3000 a year in aid given to Wal-mart workers. That's $3000 Alice keeps. It isn't direct, but it's absolutely deliberate.\n \n If they were truely charitable they'd pay their workers decently and give them good benifits.\n\n \n First off, Alice is not the sole shareholder of Wal-Mart. In fact, she doesn't even make decisions about pay. Finally, Wal-Mart can pay their employees whatever they want...if they pay them all more then they raise their prices and the company fails or they raise them and everyone else raises them so inflation happens.\n If you feel like you aren't getting paid enough, don't work there.", 
   {}, 
   199688, 
   null, 
   1140626340.0
  ], 
  [
   199723, 
   null, 
   "simone", 
   "Wht tax dollars? Seriously, you haven't mentioned one program that gives money to Alice Walton. \n \n A tax-exemption is not using your tax dollars. Are you even a resident Arkansas?\n \n See http://www.nysscpa.org/cpajournal/2005/405/essentials/p54.htm for federal tax treatment\nI live in Washington State. My tax dollar goes into the coffers of the Walton family because I am paying for the healthcare of their poorly-paid employees who do not have health insurance. So are taxpayers in a number of other states because Wal-mart refuses to pay its workers a living wage.\n \n I had no idea that Wal-mart was a Cadillac welfare mother.", 
   {}, 
   199402, 
   null, 
   1140633720.0
  ], 
  [
   199730, 
   null, 
   "Steeeeve", 
   "I live in Washington State. My tax dollar goes into the coffers of the Walton family because I am paying for the healthcare of their poorly-paid employees who do not have health insurance. So are taxpayers in a number of other states because Wal-mart refuses to pay its workers a living wage.\n \n I had no idea that Wal-mart was a Cadillac welfare mother.\n\n A very weak argument at best. No one is forcing any of these people to work at Wal-mart..in fact, them working there shows that they are willing to work at that wage. Do you think the people at McDonalds are getting paid 20 bucks an hour? No. What about Kmart? Target? The list goes on (although I hear Target pays ok). The average of $8.50 for stocking shelves doesn't seem that bad to me. If you think you can get paid more at a grocery store then work there. Either that or just don't buy from Wal-mart if you have a problem with them.\n \n Your tax dollars aren't being spent because of Wal-mart, they are being spent because they people that work at Wal-mart aren't willing to find a better job. Your claim would be like saying I am the reason you pay for tax dollars because I shop at Wal-mart and pay those low low prices which encourages Wal-mart to pay low amounts to their employees. Get real.", 
   {}, 
   199723, 
   null, 
   1140634560.0
  ], 
  [
   199748, 
   null, 
   "JPSartre12", 
   "I live in Washington State. My tax dollar goes into the coffers of the Walton family because I am paying for the healthcare of their poorly-paid employees who do not have health insurance. So are taxpayers in a number of other states because Wal-mart refuses to pay its workers a living wage.\n\n Those workers can buy healthcare for 35% of the actual cost WalMart incurs for it. By comparison, I pay ~50% for mine at a Fortune 500 company. \n And WalMart is a great place for entry level positions, just like McDonald's, Burger King, and other retail chains. They employ ~1Million people in the US. That's a Hell of a lot better than an extra million people on Welfare, sitting on their arses sucking money from our economy. Anybody who looks at entry level jobs in retail as a means of supporting a family is probably too dumb to do anything else...but that's not MY problem. :xcensored \n \n\n I had no idea that Wal-mart was a Cadillac welfare mother.\n\n If you don't like Washington State's tax code, change it! \n We know that Washington won't do that because liberals want Uncle Sam to support them. They can't survive on their own, using their own intelligence, resourcefulness and hard work like the rest of Americans. :xcensored", 
   {}, 
   199723, 
   null, 
   1140637320.0
  ], 
  [
   199872, 
   null, 
   "simone", 
   ". . . . Anybody who looks at entry level jobs in retail as a means of supporting a family is probably too dumb to do anything else...but that's not MY problem. :xcensored . . . .\nWhat if they were from a nice Catholic family that didn't believe in birth control and there were too many kids in the family for the family to support college education for the kids?\n \n What if the kids had to quit going to school in order to help support the large familly?\n \n What if the kid from this family did the Christian thing and married and did the Catholic thing and didn't use birth control and had a big family to support?", 
   {}, 
   199748, 
   null, 
   1140718860.0
  ], 
  [
   199925, 
   null, 
   "Waxy", 
   "What if they were from a nice Catholic family that didn't believe in birth control and there were too many kids in the family for the family to support college education for the kids?\n \n What if the kids had to quit going to school in order to help support the large familly?\n \n What if the kid from this family did the Christian thing and married and did the Catholic thing and didn't use birth control and had a big family to support?\n\n \n emoticon_rolleyes\n \n Waxy", 
   {}, 
   199872, 
   null, 
   1140743160.0
  ], 
  [
   199927, 
   null, 
   "JPSartre12", 
   "What if they were from a nice Catholic family that didn't believe in birth control and there were too many kids in the family for the family to support college education for the kids?\n \n What if the kids had to quit going to school in order to help support the large familly?\n \n What if the kid from this family did the Christian thing and married and did the Catholic thing and didn't use birth control and had a big family to support?\n\n \n That's an awful lot of ifs, but my answer remains the same. That isn't MY problem. If they are good Catholics and need help, I'm sure the local Catholic parish would help them out. You can't say the same about the local atheists, though. emoticon_xdonno", 
   {}, 
   199872, 
   null, 
   1140744060.0
  ], 
  [
   200006, 
   null, 
   "GreenMtnBoy", 
   "No one is forcing any of these people to work at Wal-mart..in fact, them working there shows that they are willing to work at that wage.\n\n \n I know a number of people working there because that's the only job they could find....and they aren't stupid, two have bachelor's degrees.\n \n What it comes down to is two things:\n 1. People don't care about others if they think they can save money.\n 2. They don't actually save money unless they buy the chinese goods. \n \n \nThose workers can buy healthcare for 35% of the actual cost WalMart incurs for it. By comparison, I pay ~50% for mine at a Fortune 500 company. \n\n \n And what pecent of your pay would go towards that insurance? \n \n I'm just guessing at what it costs walmart, but if we figure $1000 for a family (and that's kinda low), that 35% is $350, and at $8.50 an hour, 29 hours a week, that's ~35% of their pay. I would pay $200 for the same coverage, and it is less than 8% of my pay, vision and dental are 100% paid for, as is ADD.\n \n \nThey employ ~1Million people in the US. That's a Hell of a lot better than an extra million people on Welfare, sitting on their arses sucking money from our economy.\n\n \n They are already on Welfare...at avg $3000 per employee, they cost the government $3 Billion a year.\n \n \nWe know that Washington won't do that because liberals want Uncle Sam to support them. They can't survive on their own, using their own intelligence, resourcefulness and hard work like the rest of Americans.\n\n \n Is that why red states recieve more money from the feds than they give? Is that why blue states give more money than they get back?", 
   {}, 
   199730, 
   null, 
   1140791220.0
  ], 
  [
   200026, 
   null, 
   "Waxy", 
   " If they are good Catholics and need help, I'm sure the local Catholic parish would help them out. You can't say the same about the local atheists, though. emoticon_xdonno\n\n \n emoticon_rolleyes\n \n I don't know whose post was worse.\n \n Waxy", 
   {}, 
   199927, 
   null, 
   1140805200.0
  ], 
  [
   200050, 
   null, 
   "JPSartre12", 
   "\n And what pecent of your pay would go towards that insurance? I'm just guessing at what it costs walmart, but if we figure $1000 for a family (and that's kinda low), that 35% is $350, and at $8.50 an hour, 29 hours a week, that's ~35% of their pay. I would pay $200 for the same coverage, and it is less than 8% of my pay, vision and dental are 100% paid for, as is ADD.\n \n\n You don't even want to go there. My \"out of pocket\" costs in the last 4 months alone exceeded $40K. That's in addition to the $300/month that I pay for \"supposed\" healthcare insurance. :xcensored \n \n\n They are already on Welfare...at avg $3000 per employee, they cost the government $3 Billion a year.\n\n And without WalMart, what would that cost be? \n \n\n Is that why red states recieve more money from the feds than they give? Is that why blue states give more money than they get back?\n\n \n Washington, the state in question, voted for a Democrat for Governor by 129 votes in the last election. I'm not sure how blue that makes it. emoticon_confused \n As for the others, don't be fooled by the Red State/Blue State BS. Large metro areas skew any chance of making sweeping generalizations about any state as a whole. When you break down the demographics further into counties, the whole picture changes, for example. And the amount of Federal money that a state receives is more of an indication of their politicians' prowess in manipulating the system than on their electorate. :xcensored", 
   {}, 
   200006, 
   null, 
   1140810840.0
  ], 
  [
   200160, 
   null, 
   "simone", 
   "I can't understand why a Republican could possibly question the gubernatorial election results in Washington State in 2004, given what happened with GWB in 2000 and 2004.", 
   {}, 
   200050, 
   null, 
   1140886740.0
  ], 
  [
   200164, 
   null, 
   "JPSartre12", 
   "I can't understand why a Republican could possibly question the gubernatorial election results in Washington State in 2004, given what happened with GWB in 2000 and 2004.\n\n \n Huh? emoticon_confused I only mentioned the stat because it showed that Washington wasn't exactly a diehard, rubberstamping bastion of liberalism. Geez!\n \n Oh, and what happened in 2004. He won by millions of votes. :)", 
   {}, 
   200160, 
   null, 
   1140890580.0
  ], 
  [
   200168, 
   null, 
   "simone", 
   "By the smallest margin ever for an incumbent president.", 
   {}, 
   200164, 
   null, 
   1140893700.0
  ], 
  [
   200175, 
   null, 
   "JPSartre12", 
   "By the smallest margin ever for an incumbent president.\n\n \n Still crying after the election, I see? emoticon_cry \n Considering that Bush received more raw votes than any president in history and was the first president to receive a majority of votes in 16 years (Clinton never got a majority), it's hard for me to see why you're still crying about the election. emoticon_confused", 
   {}, 
   200168, 
   null, 
   1140903420.0
  ], 
  [
   200268, 
   null, 
   "Steeeeve", 
   "I know a number of people working there because that's the only job they could find....and they aren't stupid, two have bachelor's degrees.\n \n What it comes down to is two things:\n 1. People don't care about others if they think they can save money.\n 2. They don't actually save money unless they buy the chinese goods. \n\n \n Please inform me how that is Wal-Marts problem? What do they have degrees in? Philosophy?", 
   {}, 
   200175, 
   null, 
   1141010220.0
  ], 
  [
   200434, 
   null, 
   "Caprii", 
   "Please inform me how that is Wal-Marts problem? What do they have degrees in? Philosophy?\n\n \n You bashing philosophy? I love philosopy!!!! :)", 
   {}, 
   200268, 
   null, 
   1141103940.0
  ], 
  [
   200465, 
   null, 
   "JPSartre12", 
   "You bashing philosophy? I love philosopy!!!! :)\n\n \n It's great.............until you go looking for a job with a philosophy degree. emoticon_wow", 
   {}, 
   200434, 
   null, 
   1141138320.0
  ], 
  [
   201098, 
   null, 
   "simone", 
   "Decision by Wal-Mart to Stock Emergency Contraception \"Long Overdue\"\n Announcement is a \"step in the right direction,\" says NOW President Kim Gandy\n \n Spurred on by a lawsuit in Massachusetts, national retail chain Wal-Mart announced Friday that it has decided to stock emergency contraception (EC) in all of its pharmacies, acquiescing to pressure from the National Organization for Women and other women's rights groups.\n \n \"The decision to finally stock the morning-after pill is long overdue,\" said NOW President Kim Gandy. \"Wal-Mart stocked it in the Massachusetts stores only after being forced to do so by the state pharmacy board, and had reason to expect similar pressure in other states. This was not a completely benevolent decision, but it was the right one.\"\n \n On Feb. 1, three women filed a lawsuit against the national chain for not dispensing emergency contraception (also known as Plan B) in Massachusetts. Before the lawsuit even reached court, the state agency ruled that Wal-Mart was required by law to stock and sell emergency contraception in Massachusetts.\n \n NOW named Wal-Mart a \"Merchant of Shame\" nearly four years ago, pointing to the retail giant's long list of alleged workplace abuses, including sex and race discrimination in pay, promotion and compensation, and its refusal to stock emergency contraception. \n \n NOW chapters regularly picket the retail giant, demanding changes in its anti-women policies.\n \n \"It's a step in the right direction,\" Gandy said. \"But Wal-Mart has a long way to go before it has policies that value people over the bottom line, such as paying its employees a living wage and providing healthcare benefits.\"", 
   {
    "post_info": {
     "post_title": "Wal-mart Footnote"
    }
   }, 
   199748, 
   null, 
   1141494360.0
  ], 
  [
   201263, 
   null, 
   "Steeeeve", 
   "wow, NOW strikes again. What a worthless organization.", 
   {}, 
   201098, 
   null, 
   1141597080.0
  ], 
  [
   201322, 
   null, 
   "GreenMtnBoy", 
   "Please inform me how that is Wal-Marts problem? What do they have degrees in? Philosophy?\n\n \n Electrical Engineering and Electro-mechanical Engineering.\n \n \nYou don't even want to go there. My \"out of pocket\" costs in the last 4 months alone exceeded $40K. That's in addition to the $300/month that I pay for \"supposed\" healthcare insurance. :xcensored \n\n \n Sorry to hear about your health problems.\n \n \nAnd without WalMart, what would that cost be?\n\n \n On the government? Probably nothing. All the small businesses in my area have excellent benefits.\n \n \nAs for the others, don't be fooled by the Red State/Blue State BS.\n\n \n It holds true for counties as well.", 
   {}, 
   200050, 
   null, 
   1141641120.0
  ], 
  [
   201327, 
   null, 
   "Steeeeve", 
   "\n Electrical Engineering and Electro-mechanical Engineering.\n And they can't get a job? I guess this doesn't matter because STILL, no one is forcing them to work at Wal-Mart. And it is STILL not Wal-Marts problem if they can't find a job that pays better.", 
   {}, 
   201322, 
   null, 
   1141656360.0
  ], 
  [
   202704, 
   null, 
   "GreenMtnBoy", 
   "But walmart should still pay better, they obviously have the capability.", 
   {}, 
   201327, 
   null, 
   1142418420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Wal-mart Heiress Buys Art", 
  "url": "http://www.4forums.com/political/economics-debates/7615-wal-mart-heiress-buys-art.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 7615, 
  "discussion_files": [
   [
    "6914.html", 
    "http://www.4forums.com/political/economics-debates/7615-wal-mart-heiress-buys-art-print.html"
   ], 
   [
    "6915.html", 
    "http://www.4forums.com/political/economics-debates/7615-wal-mart-heiress-buys-art-3-print.html"
   ], 
   [
    "6916.html", 
    "http://www.4forums.com/political/economics-debates/7615-wal-mart-heiress-buys-art-2-print.html"
   ]
  ], 
  "identifier": 7615
 }
]