[
 [
  [
   199554, 
   null, 
   "JPSartre12", 
   "\n Supreme Court to weigh late-term abortions\n Newly constituted court plunges into contentious issue\n \n Updated: 10:30 a.m. ET Feb. 21, 2006\n WASHINGTON - The Supreme Court said Tuesday it will consider the constitutionality of banning a type of late-term abortion, teeing up a contentious issue for a newly-constituted court already in a state of flux over privacy rights.\n \n The Bush administration has pressed the high court to reinstate the federal law, passed in 2003 but never put in effect because it was struck down by judges in California, Nebraska and New York.\n \n\n \n Let's see if the currently constituted SCOTUS has the nads to uphold this ban. emoticon_xgood", 
   {
    "post_info": {
     "post_title": "Let the battle begin!"
    }
   }, 
   null, 
   null, 
   1140544920.0
  ], 
  [
   199571, 
   null, 
   "Steeeeve", 
   "doubtful...we are still one short of having a court that reads the constitution.", 
   {}, 
   199554, 
   null, 
   1140552660.0
  ], 
  [
   199576, 
   null, 
   "jitobear", 
   "Seems the pivot point really lies in the health exception. As pro-choice as I am, I would not bat much of an eye at this law if it is included. In places where it is in effect it includes things like major blood loss, infertility, and damage to vital organs.", 
   {}, 
   199571, 
   null, 
   1140556080.0
  ], 
  [
   199592, 
   null, 
   "Cone", 
   "In my opinion (and after having thought about this for only a couple of minutes), Justice Kennedy is the key vote in this case. Kennedy held the similar Nebraska law as constitutional even without the health exception. But precedent and prior voting activity have never been a good way of predicting Kennedy. What it really boils down to is whether Kennedy feels like upholding the law the day it is decided. Those who are pro-life should hope very much that Kennedy's wife cooks him a nice breakfast the day this case is decided so that he will be in a good enough mood to uphold the ban.", 
   {}, 
   199576, 
   null, 
   1140563940.0
  ], 
  [
   199596, 
   null, 
   "Caprii", 
   "Oklahoma courts have ruled that murder charges can be filed in the killing of a fetus if the fetus was viable -- that is, if it could survive outside the womb. Under the state's abortion law, a fetus is presumed viable after the 24th week. \n\n \n The link below is just one instance where people have been jailed for murder. Texas and Arkansas were two other I remember having similiar laws. I know many other states have similiar laws. We can't have it both ways people. We can't have it where the mother can choose to kill her late term fetus and its OKAY, but if another person kills the same fetus it is murder. Hello???? If you pro-choicers think a baby in the womb is not a human beings with rights then why are people going to prison for MURDER????? Are you pro-choicers protesting for the release of the people in prison? Because if you're not, you are the hypocrit...aren't you?\n \n http://www.cnn.com/2003/US/Southwest/12/29/woman.slain.ap/\n \n Also, this is what a human being looks like at 6 month in the womb. This baby can be brought out of the mother and can sustain life like any other premature baby. No premature human baby, an american citizen, should be of less value, just because one baby is LOVED and the other baby is NOT LOVED, does not give the mother the right to kill another human being. All premature babies should be equal under the law, with the same protections under the law and every doctor that has taken the oath, must not look the other way and let another human being, a premature baby die.\n \n http://www.w-cpc.org/trimester3.phtml\n \n In the case of MEDICAL EMERGENCY for the MOTHER, that is ALL BOGUS ########, the baby can be taken from the womb, if the fetus is causing a medical condition to the mother, in tact and healthy and alive!!!!! You don't need to take the baby out and stab it with a needle to crush the skull, you don't need to take the baby apart limb by limb!!! The baby can be removed alive and healthy!!!!!!!!!! And at 24 weeks it can sustain life like any other premature baby, another american citizen!!!!!!\n \n So, my final thoughts are. I don't know what the Court will do, but its all political nothing about fair and equal. But even so, we can't have it both ways, if a fetus does not have any human rights, and a mother can abort, then all these people who have been sent to prison for murder MUST be set free, or charged with a reduced charge of assault to the mother. The pro-choicers and the courts are really messed up on this issue, you can't have it both ways people!!!!!!", 
   {}, 
   199592, 
   null, 
   1140566400.0
  ], 
  [
   199597, 
   null, 
   "Bassman", 
   "When I heard about this vicious \"procedure\" I near lost my lunch! Let's hope that Kennedy doesn't sell out as he usually does.", 
   {}, 
   199596, 
   null, 
   1140566520.0
  ], 
  [
   199600, 
   null, 
   "Sigma", 
   "In all honesty, and regardless of how horrible you think the procedure is, should this be justified under \"interstate commerce\"? Correct me if I'm wrong, but isn't that how Congress justified their involvement in this medical procedure?", 
   {}, 
   199597, 
   null, 
   1140567240.0
  ], 
  [
   199609, 
   null, 
   "Cone", 
   "In all honesty, and regardless of how horrible you think the procedure is, should this be justified under \"interstate commerce\"? Correct me if I'm wrong, but isn't that how Congress justified their involvement in this medical procedure?\n\n Yes, this was the justification. However, the court has invited (and condoned) this type of activity by Congress by heavily expanding how the Commerce Clause is to be interpreted. This expansion, by the way, was done by judges who were not originalists. It's kind of come full circle now I guess.", 
   {}, 
   199600, 
   null, 
   1140568500.0
  ], 
  [
   199619, 
   null, 
   "JPSartre12", 
   "In my opinion (and after having thought about this for only a couple of minutes), Justice Kennedy is the key vote in this case. Kennedy held the similar Nebraska law as constitutional even without the health exception. But precedent and prior voting activity have never been a good way of predicting Kennedy. What it really boils down to is whether Kennedy feels like upholding the law the day it is decided. Those who are pro-life should hope very much that Kennedy's wife cooks him a nice breakfast the day this case is decided so that he will be in a good enough mood to uphold the ban.\n\n \n That's one of the best descriptions of the wishy-washy Kennedy that I've ever heard. emoticon_xgood", 
   {}, 
   199592, 
   null, 
   1140572340.0
  ], 
  [
   199621, 
   null, 
   "Sigma", 
   "This expansion, by the way, was done by judges who were not originalists. It's kind of come full circle now I guess.\n\n \n The expansion was done by the Legislature, was it not? The judges would just fail to curtail such.\n \n And yet many here subscribe to the Originalist view and are hoping the law is upheld. Would not an Originalist wish for this to be defeated? This seems an idiotic choice on the part of this President to attempt to uphold. It should obviously fail if what he said about his judicial appointees were true, yes? It seems to me that if this is upheld that his appointees are merely what many opponents said they were: pandering to the fundamentalists.", 
   {}, 
   199609, 
   null, 
   1140573120.0
  ], 
  [
   199650, 
   null, 
   "Steeeeve", 
   "The expansion was done by the Legislature, was it not? The judges would just fail to curtail such.\n \n And yet many here subscribe to the Originalist view and are hoping the law is upheld. Would not an Originalist wish for this to be defeated? This seems an idiotic choice on the part of this President to attempt to uphold. It should obviously fail if what he said about his judicial appointees were true, yes? It seems to me that if this is upheld that his appointees are merely what many opponents said they were: pandering to the fundamentalists.\n\n \n I am not all certain an orginalist would be willing to overlook the meaning of the commerce clause developed over the last 150 years or so. I think at some point you gotta cut your losses and follow precedent. Orginalists are not strict constructionists...remember that. I will admit that I am not in full understanding of the orginalist view of the commerce clause...probably because it has gotten way to complicated and I don't feel like looking into it :)", 
   {}, 
   199621, 
   null, 
   1140582300.0
  ], 
  [
   199712, 
   null, 
   "Cone", 
   "And yet many here subscribe to the Originalist view and are hoping the law is upheld. Would not an Originalist wish for this to be defeated? This seems an idiotic choice on the part of this President to attempt to uphold. It should obviously fail if what he said about his judicial appointees were true, yes? It seems to me that if this is upheld that his appointees are merely what many opponents said they were: pandering to the fundamentalists.\n\n Well, the law in question limits itself explicitly to \"Any physiciain who, in or affecting interstate or foreign commerce...\" Here's a link to the actual bill for easy access. So, it is not even necessarily the case that Congress has banned all partial birth abortions, just the ones performed by a physician affecting interstate or foreign commerce. By limiting the ban only to this, I believe Congress has exerted power granted to it explicitly by the Constitution. \n \n I am also still of the opinion that the states should be permitted to ban the procedure entirely without exception should they so choose.\n \n I think the clarification above also addresses your question about the originalists. Essentially, by explicitly limiting its scope to physicians affecting foreign or interstate commerce, Congress is exercising the power granted to it by Article I Section 8.", 
   {}, 
   199621, 
   null, 
   1140628860.0
  ], 
  [
   199747, 
   null, 
   "Sigma", 
   "Well, the law in question limits itself explicitly to \"Any physiciain who, in or affecting interstate or foreign commerce...\"\n\n \n Ok, so what affects interstate commerce? Exactly what circumstances will this bill affect, then? I don't see the point if it will affect nothing. It seems to me that the phrase was put in there in order for them to have something to point to, not that it actually limits its application. Otherwise there is no point in having such a bill. \n \n \nI am also still of the opinion that the states should be permitted to ban the procedure entirely without exception should they so choose.\n\n \n I don't know, having exceptions for the life of the woman or at the risk of serious impairment seems reasonable to require.\n \n \nI think the clarification above also addresses your question about the originalists. Essentially, by explicitly limiting its scope to physicians affecting foreign or interstate commerce, Congress is exercising the power granted to it by Article I Section 8.\n\n \n Well of course they have to reference something like that. The question is, in what world do medical procedures affect interstate commerce?", 
   {}, 
   199712, 
   null, 
   1140637260.0
  ], 
  [
   199757, 
   null, 
   "Cone", 
   "Ok, so what affects interstate commerce? Exactly what circumstances will this bill affect, then? I don't see the point if it will affect nothing. It seems to me that the phrase was put in there in order for them to have something to point to, not that it actually limits its application. Otherwise there is no point in having such a bill.\n\n I'll try to look into this more if I get a chance. I will point out, however, that a statute is not unconstitutional simply because it may serve no purpose (if indeed this law in fact serves no purpose).\n \n \nI don't know, having exceptions for the life of the woman or at the risk of serious impairment seems reasonable to require.\n\n I am not disputing that a health and/or life exception might be reasonable. What I am disputing is that the Constitution mandates that a State provide these exceptions, which it clearly does not.\n \n \nWell of course they have to reference something like that. The question is, in what world do medical procedures affect interstate commerce?\n\n As I said earlier, I will try to find more information on this if I get a chance.", 
   {}, 
   199747, 
   null, 
   1140640920.0
  ], 
  [
   199767, 
   null, 
   "Sigma", 
   "I'll try to look into this more if I get a chance. I will point out, however, that a statute is not unconstitutional simply because it may serve no purpose (if indeed this law in fact serves no purpose).\n\n \n Very true. What I'm afraid of is using this justification and going way outside of what a reasonable person would believe affects interstate commerce. I honestly can see no way of connecting the two, with the very slim exception of crossing state lines to acquire one.\n \n \nI am not disputing that a health and/or life exception might be reasonable. What I am disputing is that the Constitution mandates that a State provide these exceptions, which it clearly does not.\n\n \n This is not contradicted by Roe, either, since it would stop at viability. I'm not entirely sure about Casey. It could be argued that a life exception is required by the Constitution.", 
   {}, 
   199757, 
   null, 
   1140643740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Let the battle begin!", 
  "url": "http://www.4forums.com/political/abortion-debates/7628-let-battle-begin.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7628, 
  "discussion_files": [
   [
    "13616.html", 
    "http://www.4forums.com/political/abortion-debates/7628-let-battle-begin-print.html"
   ]
  ], 
  "identifier": 7628
 }
]