[
 [
  [
   200223, 
   null, 
   "simone", 
   "Is there truly such a thing as scientism?\n \n Leon Wieseltier, who reviews the book Breaking the Spell by Daniel C. Dennett, seems to think so (19 Feb NYTimes):\n \n \nTHE question of the place of science in human life is not a scientific question. It is a philosophical question. Scientism, the view that science can explain all human conditions and expressions, mental as well as physical, is a superstition, one of the dominant superstitions of our day; and it is not an insult to science to say so. For a sorry instance of present-day scientism, it would be hard to improve on Daniel C. Dennett's book. \"Breaking the Spell\" is a work of considerable historical interest, because it is a merry anthology of contemporary superstitions.\n\n \n Science merely another superstition? What?", 
   {
    "post_info": {
     "post_title": "Scientism?"
    }
   }, 
   null, 
   null, 
   1140972900.0
  ], 
  [
   200251, 
   null, 
   "Mach", 
   "\n Science merely another superstition? What?\n\n \n As to your question, no, science it not merely another superstition. \n \n M-Webster online:\n Supersition:\n 1 a : a belief or practice resulting from ignorance, fear of the unknown, trust in magic or chance, or a false conception of causation b : an irrational abject attitude of mind toward the supernatural, nature, or God resulting from superstition\n 2 : a notion maintained despite evidence to the contrary \n \n Science:\n 1 : the state of knowing : knowledge as distinguished from ignorance or misunderstanding\n ...\n 3 a : knowledge or a system of knowledge covering general truths or the operation of general laws especially as obtained and tested through scientific method b : such knowledge or such a system of knowledge concerned with the physical world and its phenomena : NATURAL SCIENCE\n \n As you can see, science and superstition are opposites.\n \n Knowledge, and \"not knowledge\". Supersition as a specific classification seems to REQUIRE ignorance and/or fear. That means someone who believes in Santa Claus or some \"god\" may indeed be \"ignorant\", or fear missing out on presents or an afterlife, but someone who predicts the weather based on science, but happens to be wrong (not knowledge), we wouldn't say they are superstitious, unless we wanted to be illogical.\n \n As always, some will rail against reality and the science that we choose to create that explains it, but until it's a crime to be dumb, they always will.\n \n The author seems to not have said \"science is superstition\", but instead, two distinct things:\n 1. The \"place of science in human life\" is a superstition.\n 2. Scientism, the notion that science can explain all physical realities\", is a superstition.\n \n 1. I have no idea what the author means with #1, it doesn't sound rational. I believe what he's referrring to is the philsophical CHOICE if either accepting science as reality, or rejecting it. Quite an easy logical choice. Let's let the author make that choice. I'd love to see is response, but alas.\n Does the author CHOOSE to accept science as reality, or not. Also, the author must choose, that is, by saying either, he is making the choice.\n \n 2. Scientism with this argument in mind: No one as demonstrated how rationally/logically science cannot accurately account for all of reality that can be known. If the author is suggesting he can, then perhaps we can open up discussion of it as a superstition. If the author cannot, then it's an unsupported claim and is rejected.\n \n -Mach", 
   {}, 
   200223, 
   null, 
   1140988380.0
  ], 
  [
   200285, 
   null, 
   "Kronus", 
   "Is there truly such a thing as scientism?\n \n Science merely another superstition? What?\n\n \n Your quote doesn't say that science is a superstition, it says that scientism is. I've never heard the term before, but based on the definition you cite it's clearly not the same thing as science. Certainly science does not say that \"science can explain all human conditions and expressions, mental as well as physical\".", 
   {}, 
   200223, 
   null, 
   1141021260.0
  ], 
  [
   200316, 
   null, 
   "unkerpaulie", 
   "Scientism, the view that science can explain all human conditions and expressions, mental as well as physical, is a superstition\n \n clearly, scientism is based on a flawed view. science does not attempt to explain motivations, emotions, beliefs and intangible human qualities and other matters of opinion. if someone says they like a painting because it gives them a warm feeling inside, for instance, this is all subjective and out of the scope of science.", 
   {}, 
   200285, 
   null, 
   1141057080.0
  ], 
  [
   200328, 
   null, 
   "Kronus", 
   "Scientism, the view that science can explain all human conditions and expressions, mental as well as physical, is a superstition\n \n clearly, scientism is based on a flawed view. science does not attempt to explain motivations, emotions, beliefs and intangible human qualities and other matters of opinion. if someone says they like a painting because it gives them a warm feeling inside, for instance, this is all subjective and out of the scope of science.\n\n \n I wouldn't say flawed, per se. It's true that science does not currently quantify emotions, motivations, etc. However, that doesn't mean that it absolutely never will. It's possible, and note that I'm only saying possible, that our brains are nothing more than machines. It's possible that for a given neural configuation and a given input, you will get a specific neural reconfiguration and a specific output. Further, it may be possible at some point to understand and predict these interactions. If scientism is the belief that these possibilities will come to pass then calling that belief flawed is premature. We don't know how the brain works, the scientismists (?) may be correct.", 
   {}, 
   200316, 
   null, 
   1141059180.0
  ], 
  [
   200335, 
   null, 
   "unkerpaulie", 
   "I wouldn't say flawed, per se. It's true that science does not currently quantify emotions, motivations, etc. However, that doesn't mean that it absolutely never will. It's possible, and note that I'm only saying possible, that our brains are nothing more than machines. It's possible that for a given neural configuation and a given input, you will get a specific neural reconfiguration and a specific output. Further, it may be possible at some point to understand and predict these interactions. If scientism is the belief that these possibilities will come to pass then calling that belief flawed is premature. We don't know how the brain works, the scientismists (?) may be correct.\n\n well i kinda disagree, but for personal bias reasons than rational ones. i'm convinced that the brain does not work in a linear fashion, but is capable of multiple possible results given the exact same input. this is where the mind differs greatly from a machine. of course i cant back this up, its really just my view. i'm biased to having this view because i prefer the idea of free will over destiny... but this is a bit off topic\n \n of course, if evidence did show that our decisions are based on measurable variables of input, then that would be science, and the scientism-ists would indeed be right about their view", 
   {}, 
   200328, 
   null, 
   1141060140.0
  ], 
  [
   200349, 
   null, 
   "simone", 
   "Remotely possible, Unkerpaulie, if we could possibly determine a finite number of variables in decision making.", 
   {}, 
   200335, 
   null, 
   1141070160.0
  ], 
  [
   200370, 
   null, 
   "unkerpaulie", 
   "Remotely possible, Unkerpaulie, if we could possibly determine a finite number of variables in decision making.\n\n are the variables really finite? everytime you eat, your body transports new nutrients to your brain cells as well as the rest of your body. the same with oxygen when you breathe and toxins when you excrete. even if the information input could be duplicated exactly, what about the ever-changing chemical composition?\n \n the images we conjure in our heads are the results of past images we have encountered plus a unique quality we have called imagination. we can conjure up images that are completely unique and original. look at the extent of art, for example, that humans have produced over the last, say 100 years. consider the musical compositions, poetic writings, literary works and graphic renderings. each work totally original and unique. now add that to the estimated number of unpublished art, or art that has been thought of and not expressed.\n \n as time progresses, and just looking at art, we find that more works are being mentally conjured, expressed and published, at an almost constant rate. and each is unique. it would certainly seem as though the possibilities of human decision making, just from this single area, are truly infinite.\n \n then again, maybe the variables are different?", 
   {}, 
   200349, 
   null, 
   1141079760.0
  ], 
  [
   200413, 
   null, 
   "Kronus", 
   "Remotely possible, Unkerpaulie, if we could possibly determine a finite number of variables in decision making.\n\n \n I suspect that even if the brain is deterministic, it suffers from the butterfly effect. Tiny changes in input can result in vastly different end conditions. If that's the case then predicting the behavior of the brain in any but the most general sense would be impossible. If, if, if.", 
   {}, 
   200349, 
   null, 
   1141096140.0
  ], 
  [
   200501, 
   null, 
   "simone", 
   "Thank you, UnkerPaulie, I forgot about the variable of time.", 
   {}, 
   200413, 
   null, 
   1141151940.0
  ], 
  [
   200525, 
   null, 
   "Obvious Child", 
   "\n The author seems to not have said \"science is superstition\", but instead, two distinct things:\n 1. The \"place of science in human life\" is a superstition.\n 2. Scientism, the notion that science can explain all physical realities\", is a superstition.\n \n 1. I have no idea what the author means with #1, it doesn't sound rational. I believe what he's referrring to is the philsophical CHOICE if either accepting science as reality, or rejecting it. Quite an easy logical choice. Let's let the author make that choice. I'd love to see is response, but alas.\n Does the author CHOOSE to accept science as reality, or not. Also, the author must choose, that is, by saying either, he is making the choice.\nI think he means its place in life, as in how we apply it and how it effects our decisions, is a personal or moral choice which cannot be solved by science. It provides tools, but not the ends towards which they work\n \n [QUOTE=Mach]2. Scientism with this argument in mind: No one as demonstrated how rationally/logically science cannot accurately account for all of reality that can be known. If the author is suggesting he can, then perhaps we can open up discussion of it as a superstition. If the author cannot, then it's an unsupported claim and is rejected.[QUOTE]Surely the point is that believing such a claim with no evidence is superstition? I might believe that ultimately all my needs could be provided by a piece of blue string, but unless I have reason for this it is superstition. Similarly with the eschatology of science: the unscientific (as it isn't based on verifiable, testable evidence) claim that science will work everything out eventually.", 
   {}, 
   200251, 
   null, 
   1141162800.0
  ], 
  [
   200594, 
   null, 
   "Mach", 
   "I think he means its place in life, as in how we apply it and how it effects our decisions, is a personal or moral choice which cannot be solved by science. It provides tools, but not the ends towards which they work\n\n I thought about that, but then I couldn't figure out how to make that reasonable so I tried some other approaches. I mean, to call ethics superstition, seems unfounded to me, does it not to you? I mean, just by the definition of both words. I can't believe someone would spend time writing obviously unreasonable things (like equivocation), I always give them the benefit of the doubt.\n \n \nSurely the point is that believing such a claim with no evidence is superstition? I might believe that ultimately all my needs could be provided by a piece of blue string, but unless I have reason for this it is superstition. \n Yes, but that's resolved easily with basic definitions, and it's rejected. Faith is belief without evidence in general. Some faith is superstition. Like fear of lighting and calling it a lighting god might be a faith/superstition, yet an attempt (albeit illogical) at ontological proof of god, and subsequent belief in that conclusion, may be well intentioned, entirely not supersitious, but faith just the same. It may also be an error.\n \n This is also different than axioms, or \"givens\", in some philosophy and all of mathematics (another formal logical system). We don't say we \"believe\" we exist per se, we accept that we do in order to talk about things. \n \n \nSimilarly with the eschatology of science: the unscientific (as it isn't based on verifiable, testable evidence) claim that science will work everything out eventually.\n\n That's just a train-wreck of a claim (I agree?), and the claim I made was distinctly different, and I believe, correct.\n \n -Mach", 
   {}, 
   200525, 
   null, 
   1141182660.0
  ], 
  [
   200672, 
   null, 
   "Symbiote", 
   "I haven't read the book, or about it much, but I agree, sort of, with the general idea presented.\n \n Science can't tell us what our \"purpose\" in life is, goals are things that people have.\n \n The methodologies of the hard sciences can't be used to derive the price of a stock tomorrow.\n \n At least for now. A lot of people act as if they can, as if by including the right variables in an equation, they will able to know what others will choose.", 
   {}, 
   200594, 
   null, 
   1141235100.0
  ], 
  [
   200674, 
   null, 
   "Alan Ryan", 
   "\n \n The methodologies of the hard sciences can't be used to derive the price of a stock tomorrow.\n \n At least for now. A lot of people act as if they can, as if by including the right variables in an equation, they will able to know what others will choose.\n\n You seem to be on the verge of debunking the 'dismal' science of economics??", 
   {}, 
   200672, 
   null, 
   1141235340.0
  ], 
  [
   200717, 
   null, 
   "Obvious Child", 
   "I thought about that, but then I couldn't figure out how to make that reasonable so I tried some other approaches. I mean, to call ethics superstition, seems unfounded to me, does it not to you? I mean, just by the definition of both words. I can't believe someone would spend time writing obviously unreasonable things (like equivocation), I always give them the benefit of the doubt.\nHe's saying believing science provides ethics is superstition. Not ethics per se.\n \n \nYes, but that's resolved easily with basic definitions, and it's rejected. Faith is belief without evidence in general. Some faith is superstition. Like fear of lighting and calling it a lighting god might be a faith/superstition, yet an attempt (albeit illogical) at ontological proof of god, and subsequent belief in that conclusion, may be well intentioned, entirely not supersitious, but faith just the same. It may also be an error.\n \n This is also different than axioms, or \"givens\", in some philosophy and all of mathematics (another formal logical system). We don't say we \"believe\" we exist per se, we accept that we do in order to talk about things. \n \n That's just a train-wreck of a claim (I agree?), and the claim I made was distinctly different, and I believe, correct.\n \n -Mach\nI don't know if we're on the same page: my two points were meant to be taken together. The idea I'm trying to communicate is that the eschatological belief you call a train-wreck is what is indicated in 'the notion that science can explain all physical realities'. It's an argument to the future based on a unproven concept of the knowability of all physical stuff and the inevitability of progress.", 
   {}, 
   200594, 
   null, 
   1141243800.0
  ], 
  [
   200812, 
   null, 
   "Symbiote", 
   " You seem to be on the verge of debunking the 'dismal' science of economics??\n\n \n Sort of. Taking the methodology of the \"hard\" sciences and applying it to psychology, economics and health has had mixed results. Sometimes they might stumble on the right answer, but even when they do they have no good reason for it, and answers, correct or incorrect, can always be later overturned by new statistical data. In this way no progress is really made, only more historical data accumulated and more variables added to formulas.\n \n Scientism might be better called Mathism, because it is pretty much the idea that questions of fact must be answered with mathematical/statistical rather than simply logical evidence.", 
   {}, 
   200717, 
   null, 
   1141325100.0
  ], 
  [
   200816, 
   null, 
   "Alan Ryan", 
   "Sort of. Taking the methodology of the \"hard\" sciences and applying it to psychology, economics and health has had mixed results. Sometimes they might stumble on the right answer, but even when they do they have no good reason for it, and answers, correct or incorrect, can always be later overturned by new statistical data. In this way no progress is really made, only more historical data accumulated and more variables added to formulas.\n \n Scientism might be better called Mathism, because it is pretty much the idea that questions of fact must be answered with mathematical/statistical rather than simply logical evidence.\n\n \n Perhaps even the 'hard sciences' of chemistry, biology, and geology - let alone the behavioural sciences you mention - are really parasitical on the only 'true' science which is physics? \n \n Scientism, as I understand the term, is the belief that the methods of natural science or the categories recognised as such, can define the only route to the 'truth' in any philosophical enquiry.", 
   {}, 
   200812, 
   null, 
   1141326840.0
  ], 
  [
   200853, 
   null, 
   "beervolcano", 
   "Here is a video of the first episode of Richard Dawkins' \"The Root of All Evil?\"\n \n Give it a watch (needs flash player)...\n \n Part 1-1:\n http://www.youtube.com/?v=CPaD6D54L4o\n \n Part 1-2:\n http://www.youtube.com/?v=TUy-Uq3WuhA\n \n Part 1-3:\n http://www.youtube.com/?v=8GgD3lgspQE\n \n \n A Muslim already pointed out that Dawkins begins by talking about evolution, but then somehow jumps into talking about 9/11 and religious strife in the Holy Land. He also pointed out that it was Dawkins' own Britain that \"caused the problems in Palestine in the first place.\" I have to agree somewhat with this. I believe that the cheif factor behind all the strife in the Middle East, as well as in Africa, are due to leftover effects of European colonialism/imperialism. Colonialism has everything to do with money and economics and not much to do with religion except as a great motivator of poeple to join your cause. That's religion's role in all of this (violence and such). The main impetus for the large-scale violence and warfare over the years is almost exclusively economic, but the main motivating force, the force that can rally support for the death and destruction that stems from coveting thy neighbor's resources, is religion (along with nationalism and ethnicity). I would also add that a motivating force for war that has replaced religion in the US and lately other places like Palestine is the abstract notion of \"freedom.\" Perhaps the mass media that shapes our reality has actually replaced religion for the most part in this country as a motivating force, even for those who consider themselves deeply religious and actually are. If reality is shaped in certain ways, then it is a far easier task to convince the masses that freedom is the reason for bombing and occupation, not the Dow Jones Index.", 
   {
    "post_info": {
     "post_title": "Interesting video"
    }
   }, 
   200816, 
   null, 
   1141342500.0
  ], 
  [
   201022, 
   null, 
   "Mach", 
   "He's saying believing science provides ethics is superstition. Not ethics per se.\n\n \n OK, then I disgree with that as well. Science by definition is knowledge, which is supported by a logical combination of premises and evidence. How this could \"provide\" ethics, and thus be called supertistion, when superstition is exactly NOT that?... sounds drunk to me. From what I can tell, there are usually three camps. Those who believe humans conceive of ethics. Those who believe supernatural [bunny rabbits] provide ethics, and those who think there is no such thing as ethics.\n \n Yes, a reasoned approach (in the mold of the first type I listed), would take knowledge, and form a set of rules, and label them \"ethics\". That doesn't mean they \"came from\" anything, it was a choice to use knowledge, to enhance the quality of life (ethics) in a society. As to what that quality is, it's again a choice. In fact, a well-informed choice to set certain rules...entirely NOT supersition. It seems the author was probably in error.\n \n \n -Mach", 
   {}, 
   200717, 
   null, 
   1141437960.0
  ], 
  [
   201213, 
   null, 
   "OccamsRazor", 
   "\n A Muslim already pointed out that Dawkins begins by talking about evolution, but then somehow jumps into talking about 9/11 and religious strife in the Holy Land. He also pointed out that it was Dawkins' own Britain that \"caused the problems in Palestine in the first place.\" I have to agree somewhat with this. I believe that the cheif factor behind all the strife in the Middle East, as well as in Africa, are due to leftover effects of European colonialism/imperialism. Colonialism has everything to do with money and economics and not much to do with religion except as a great motivator of poeple to join your cause. That's religion's role in all of this (violence and such). The main impetus for the large-scale violence and warfare over the years is almost exclusively economic, but the main motivating force, the force that can rally support for the death and destruction that stems from coveting thy neighbor's resources, is religion (along with nationalism and ethnicity). I would also add that a motivating force for war that has replaced religion in the US and lately other places like Palestine is the abstract notion of \"freedom.\" Perhaps the mass media that shapes our reality has actually replaced religion for the most part in this country as a motivating force, even for those who consider themselves deeply religious and actually are. If reality is shaped in certain ways, then it is a far easier task to convince the masses that freedom is the reason for bombing and occupation, not the Dow Jones Index.\n\n \n Dawkin's point was not to do with the causes of conflicts but how the mass belief that an object of faith held absolute truth acts to worsen the effect of war and strife.\n \n Take away the faith element and it would not be possible to use religion as fuel to feed the fires of war. Religious differences are an easy way to fan the flames of intolerance and hatred- it requires no critical thinking on the part of the believer to be enraged when their priest tells them \"they deny our God, they are our enemy, they are your enemy\".\n \n Also, I really liked his closing observation:\n \n \"We are all atheists about most of the gods that societies have ever believed in, some of us just go one god further\". emoticon_xangel", 
   {}, 
   200853, 
   null, 
   1141574100.0
  ], 
  [
   201230, 
   null, 
   "simone", 
   "Dawkins may be a Brit, but what the devil has he to do with Britain's colonial policies?\n \n I'd look more to Winston Churchill and folks of that era and before in regard to colonial policy.", 
   {}, 
   201213, 
   null, 
   1141584900.0
  ], 
  [
   201237, 
   null, 
   "Ripskar", 
   "The Ottoman Empire was a mess long before the remnants became colonies.\n The Ottoman decline was due largely to internal corruption on the part of the Sultan et al. and can be traced back to the voyage of Magellan which gave an alternative route for the spice trade other than through Arabia.\n And that's only from the European perspective, the History of ME and Europe doesn't really intertwine so isn't that well documented here.", 
   {}, 
   201230, 
   null, 
   1141590000.0
  ], 
  [
   201298, 
   null, 
   "beervolcano", 
   "Dawkin's point was not to do with the causes of conflicts but how the mass belief that an object of faith held absolute truth acts to worsen the effect of war and strife.\n \n Take away the faith element and it would not be possible to use religion as fuel to feed the fires of war. Religious differences are an easy way to fan the flames of intolerance and hatred- it requires no critical thinking on the part of the believer to be enraged when their priest tells them \"they deny our God, they are our enemy, they are your enemy\".\n \n Also, I really liked his closing observation:\n \n \"We are all atheists about most of the gods that societies have ever believed in, some of us just go one god further\". emoticon_xangel\n\n \n \n He did title the thing \"Root of all evil?\" maybe to imply that religion is the root of all evil. I was saying that money is still the root of all evil, but religion is its tool. Maybe Dawkins is saying that, but that's not what I got from it.\n \n \n\n Dawkins may be a Brit, but what the devil has he to do with Britain's colonial policies?\n \n I'd look more to Winston Churchill and folks of that era and before in regard to colonial policy.\n\n \n I don't think the person brining that up holds Dawkins personally responsible for British colonialism. I think he was trying to say that Dawkins was trying to make it seem so simple. \"Oh, it's just religion's fault for everything,\" when maybe there's more to it than that. Islam or no islam, I think that Arabs would consider Britain and the US enemies simply because of their occupation of Arab lands. \n \n \nThe Ottoman Empire was a mess long before the remnants became colonies.\n The Ottoman decline was due largely to internal corruption on the part of the Sultan et al. and can be traced back to the voyage of Magellan which gave an alternative route for the spice trade other than through Arabia.\n And that's only from the European perspective, the History of ME and Europe doesn't really intertwine so isn't that well documented here.\n\n \n Mess or no mess, colonialism and occupation breeds hatred for the rulers/occupiers. If my country were in the toilet, that would be bad, but if it were in the toilet and also occupied by a foreign power that kept meddling and controlling my countries affairs for decades, I would really hate them and would want bad things to happen to them. For me religion wouldn't have a thing to do with it.", 
   {}, 
   201213, 
   null, 
   1141615980.0
  ], 
  [
   201356, 
   null, 
   "Obvious Child", 
   "OK, then I disgree with that as well. Science by definition is knowledge, which is supported by a logical combination of premises and evidence. How this could \"provide\" ethics, and thus be called supertistion, when superstition is exactly NOT that?... sounds drunk to me. From what I can tell, there are usually three camps. Those who believe humans conceive of ethics. Those who believe supernatural [bunny rabbits] provide ethics, and those who think there is no such thing as ethics.\nFair analysis at the end. But you assume all the productions of humans are science. For it to be science, the premises have to be either logical, or the foundations of empiricism (cause and effect, reliability of observation). Ethics are human: but not scientific.\n \n \nYes, a reasoned approach (in the mold of the first type I listed), would take knowledge, and form a set of rules, and label them \"ethics\". That doesn't mean they \"came from\" anything, it was a choice to use knowledge, to enhance the quality of life (ethics) in a society. As to what that quality is, it's again a choice. In fact, a well-informed choice to set certain rules...entirely NOT supersition. It seems the author was probably in error.\nHow do you say quality of life = ethics? The forming of moral rules from knowledge requires an 'ought' statement which cannot be observed, only intuited.", 
   {}, 
   201022, 
   null, 
   1141664880.0
  ], 
  [
   201357, 
   null, 
   "Obvious Child", 
   "\"We are all atheists about most of the gods that societies have ever believed in, some of us just go one god further\". emoticon_xangel\nThat's like saying 'we are all anti-science about most of the theories, some of us just go one theory further'. \n \n It ignores the idea that all religions might be referring to similar sorts of experiences etc.", 
   {}, 
   201213, 
   null, 
   1141665000.0
  ], 
  [
   201446, 
   null, 
   "OccamsRazor", 
   "That's like saying 'we are all anti-science about most of the theories, some of us just go one theory further'.\n\n \n No its not as even the most fundementalist of YEC's accept most of the findings as science as fact, they generally only get uppity about anything that comments on origins.\n \n \nIt ignores the idea that all religions might be referring to similar sorts of experiences etc.\n\n \n Possibly, but what I think he was noting was how faith is accepted because, in the main, people are told to believe in it in the cultures they grow up in- they are unconcerned with other peoples belief be it separated by space, time or both.", 
   {}, 
   201357, 
   null, 
   1141689240.0
  ], 
  [
   201536, 
   null, 
   "Obvious Child", 
   "No its not as even the most fundementalist of YEC's accept most of the findings as science as fact, they generally only get uppity about anything that comments on origins.\nThat just shows how nutty it is. Using your argument, someone could reject all scientific theories because most of them are wrong: apparently even YEC are in this sense more rational than Dawkins.\n \n \nPossibly, but what I think he was noting was how faith is accepted because, in the main, people are told to believe in it in the cultures they grow up in- they are unconcerned with other peoples belief be it separated by space, time or both.\nThe claim that faith is accepted mainly because people are told to is very dodgy. Religion seems to naturally arise, although there are many theories as to how and why, religious and otherwise.\n \n Think of religion like morality: the idea varies, but seems to exist everywhere and often seems to appeal to the same things. It is often 'taught' but this does not mean it does not occur naturally: indeed, a system of explaining away what would otherwise be ethical/religious is needed, and this requires a more direct and deliberate move: thus the cack-handed attempts at replacing religion with deliberate human constructs.", 
   {}, 
   201446, 
   null, 
   1141736520.0
  ], 
  [
   201542, 
   null, 
   "Alan Ryan", 
   "\n The claim that faith is accepted mainly because people are told to is very dodgy. Religion seems to naturally arise, although there are many theories as to how and why, religious and otherwise.\n \n\n \n Daniel Dennett asks, How did just one species, Homo sapiens, acquire the numinous perspective that can have such a profound influence on people's lives?\n \n He seems to think that religions evolved and originally served a 'primitive' philosophical intention - such as explaining the hidden 'causes' of natural events in pre-scientific societies. To give just one example: The rise and fall of the tides were observed, but not understood. So the phenomena were attributed to the power of a god (or gods) etc. I think this is a pretty commonplace answer, but not necessarily wrong. \n \n Why has religion survived the scepticism of the intellectual Enlightenment and the rational attacks of science? The idea that some fundamental 'psychic need' in humanity is satisfied by having religious beliefs seems (to me) the most promising speculation.", 
   {}, 
   201536, 
   null, 
   1141742100.0
  ], 
  [
   201577, 
   null, 
   "simone", 
   "beervolcano, outstanding videos!! Muy gracias!", 
   {}, 
   201542, 
   null, 
   1141755720.0
  ], 
  [
   201584, 
   null, 
   "simone", 
   "Of course I loved the gradient metaphor for the Darwinian concept of evolution. A sweet understandable concept for numbskulls like me!!emoticon_xangel", 
   {}, 
   201577, 
   null, 
   1141756860.0
  ], 
  [
   201899, 
   null, 
   "Obvious Child", 
   "Daniel Dennett asks, How did just one species, Homo sapiens, acquire the numinous perspective that can have such a profound influence on people's lives?\nSurely we have to be careful: we can't be totally sure we are the only ones with such a perspective.\n \n I'm reading Dennet's book on evolution soon, and the others if I can get hold of them. Reason being, he's lecturing at my uni quite soon so it would be good to build background knowledge.\n \nHe seems to think that religions evolved and originally served a 'primitive' philosophical intention - such as explaining the hidden 'causes' of natural events in pre-scientific societies. To give just one example: The rise and fall of the tides were observed, but not understood. So the phenomena were attributed to the power of a god (or gods) etc. I think this is a pretty commonplace answer, but not necessarily wrong.\nIt's unclear what survival benefit this gives.... \n \n \nWhy has religion survived the scepticism of the intellectual Enlightenment and the rational attacks of science? The idea that some fundamental 'psychic need' in humanity is satisfied by having religious beliefs seems (to me) the most promising speculation.\nEither that, of course, or it's true. \n \n But yes, I find this very convincing: have you read Jung's ideas on this?", 
   {}, 
   201542, 
   null, 
   1141911180.0
  ], 
  [
   201903, 
   null, 
   "Alan Ryan", 
   "\n But yes, I find this very convincing: have you read Jung's ideas on this?\n\n My knowledge of Jung is pretty rudimentary and gained from secondary sources: I've never studied any of his stuff directly. I know a bit more about Freud, though his \"investigation\" of the nature of religion in both 'Future of an Illusion' and 'Totem and Taboo' seem wildly fanciful to me. \n \n That religious faith, or even just an inarticulate but pervasive sense of mystery at the heart of things, satisifies a \"psychic yearning\" in human beings is, I believe, a tentative conclusion reached by many thoughtful people.\n \n My woolly-minded views on the varieties of religious experience, reflect a retreat from phlegmatic atheism to mere agnosticism. I was never a militant atheist.\n \n Assume you are still studying Philosophy at undergraduate level, or perhaps doing an M.Phil. or Ph.D. ?", 
   {}, 
   201899, 
   null, 
   1141918440.0
  ], 
  [
   201935, 
   null, 
   "simone", 
   "Who is Willard Van Orman Quine? And, does he have anything at all to do with qualia?", 
   {}, 
   201903, 
   null, 
   1141927440.0
  ], 
  [
   202270, 
   null, 
   "Obvious Child", 
   "Who is Willard Van Orman Quine? And, does he have anything at all to do with qualia?\nA philosopher, I think of the American (perhaps British) positivist mold. And yes. The rest: look up wikipedia.", 
   {}, 
   201935, 
   null, 
   1142113680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Scientism?", 
  "url": "http://www.4forums.com/political/philosophy-debates/7660-scientism.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 7660, 
  "discussion_files": [
   [
    "4713.html", 
    "http://www.4forums.com/political/philosophy-debates/7660-scientism-print.html"
   ], 
   [
    "4714.html", 
    "http://www.4forums.com/political/philosophy-debates/7660-scientism-3-print.html"
   ], 
   [
    "4715.html", 
    "http://www.4forums.com/political/philosophy-debates/7660-scientism-2-print.html"
   ]
  ], 
  "identifier": 7660
 }
]