[
 [
  [
   200276, 
   null, 
   "marc9000", 
   "Is there a difference between secularism and atheism? Here are the dictionary.com definitions of the two words;\n \n \nsec\u0095u\u0095lar\u0095ism P Pronunciation Key (s k y -l -r z m)\n n. \n 1. Religious skepticism or indifference. \n 2. The view that religious considerations should be excluded from civil affairs or public education. \n \n \n a\u0095the\u0095ism P Pronunciation Key ( th - z m)\n n. \n 1. \n a. Disbelief in or denial of the existence of God or gods. \n b. The doctrine that there is no God or gods. \n 2. Godlessness; immorality. \n\n \n Here is part of the Humanist manifesto 2, concerning religion;\n \n \nFIRST: In the best sense, religion may inspire dedication to the highest ethical ideals. The cultivation of moral devotion and creative imagination is an expression of genuine \"spiritual\" experience and aspiration.\n We believe, however, that traditional dogmatic or authoritarian religions that place revelation, God, ritual, or creed above human needs and experience do a disservice to the human species. Any account of nature should pass the tests of scientific evidence; in our judgment, the dogmas and myths of traditional religions do not do so. Even at this late date in human history, certain elementary facts based upon the critical use of scientific reason have to be restated. We find insufficient evidence for belief in the existence of a supernatural; it is either meaningless or irrelevant to the question of survival and fulfillment of the human race. As nontheists, we begin with humans not God, nature not deity. Nature may indeed be broader and deeper than we now know; any new discoveries, however, will but enlarge our knowledge of the natural.\n \n Some humanists believe we should reinterpret traditional religions and reinvest them with meanings appropriate to the current situation. Such redefinitions, however, often perpetuate old dependencies and escapisms; they easily become obscurantist, impeding the free use of the intellect. We need, instead, radically new human purposes and goals.\n \n We appreciate the need to preserve the best ethical teachings in the religious traditions of humankind, many of which we share in common. But we reject those features of traditional religious morality that deny humans a full appreciation of their own potentialities and responsibilities. Traditional religions often offer solace to humans, but, as often, they inhibit humans from helping themselves or experiencing their full potentialities. Such institutions, creeds, and rituals often impede the will to serve others. Too often traditional faiths encourage dependence rather than independence, obedience rather than affirmation, fear rather than courage. More recently they have generated concerned social action, with many signs of relevance appearing in the wake of the \"God Is Dead\" theologies. But we can discover no divine purpose or providence for the human species. While there is much that we do not know, humans are responsible for what we are or will become. No deity will save us; we must save ourselves.\n \n SECOND: Promises of immortal salvation or fear of eternal damnation are both illusory and harmful. They distract humans from present concerns, from self-actualization, and from rectifying social injustices. Modern science discredits such historic concepts as the \"ghost in the machine\" and the \"separable soul.\" Rather, science affirms that the human species is an emergence from natural evolutionary forces. As far as we know, the total personality is a function of the biological organism transacting in a social and cultural context. There is no credible evidence that life survives the death of the body. We continue to exist in our progeny and in the way that our lives have influenced others in our culture.\n \n Traditional religions are surely not the only obstacles to human progress. Other ideologies also impede human advance. Some forms of political doctrine, for instance, function religiously, reflecting the worst features of orthodoxy and authoritarianism, especially when they sacrifice individuals on the altar of Utopian promises. Purely economic and political viewpoints, whether capitalist or communist, often function as religious and ideological dogma. Although humans undoubtedly need economic and political goals, they also need creative values by which to live. \n\n \n http://www.jcn.com/manifestos.html\n \n Are the sentences I highlighted above not basic, strong core beliefs of both secularists and atheists? I see nothing anywhere in the above paragraphs that would distinguish a secularist from an atheist. Is there anything in the above paragraphs that would constitute an unreconcilable difference between the two?\n \n \n Also from dictionary.com;\n \n \nworld·view ( P ) Pronunciation Key (wûrldvy)\n n.\n The overall perspective from which one sees and interprets the world. \n A collection of beliefs about life and the universe held by an individual or a group. \n\n \n What are the differences between the ways a secularist and an atheist would see and interpret the world?", 
   {
    "post_info": {
     "post_title": "secularism vs. atheism"
    }
   }, 
   null, 
   null, 
   1141013100.0
  ], 
  [
   200281, 
   null, 
   "trebor", 
   "\n What are the differences between the ways a secularist and an atheist would see and interpret the world?\n\n \n Secular is 'non-theistic'. In other words, it does not consider if there is a god or not. It just is not a matter for consideration.\n \n Atheist is the lack of belief in any deity.", 
   {}, 
   200276, 
   null, 
   1141017180.0
  ], 
  [
   200283, 
   null, 
   "Kronus", 
   "Based on the definitions you gave, they're quite different. Atheism is a matter of personal belief, secularism is a matter of public policy. There's no reason you can't be devoutly religious and a secularist. You would have your religious views, but believe that public policy should not be based on them.", 
   {}, 
   200281, 
   null, 
   1141021080.0
  ], 
  [
   200289, 
   null, 
   "electrolyte", 
   "Are the sentences I highlighted above not basic, strong core beliefs of both secularists and atheists? I see nothing anywhere in the above paragraphs that would distinguish a secularist from an atheist. Is there anything in the above paragraphs that would constitute an unreconcilable difference between the two?\n\n Mathematics is indifferent to theistic matters. Does that mean that mathematics is atheistic?\n Quite obviously, no. Just as one can believe that two plus two equals four and that a deity exists, one can believe that two plus two equals four and that no deity exists. Therefore, math is secular (and not atheistic).\n \n \nWe find insufficient evidence for belief in the existence of a supernatural;\n\n\n Keep in mind that there are a couple different \"flavors\" of atheism: strong and week. Strong atheism is the assertion that no god exists. (\"I believe there is no god.\") Weak atheism is the lack of belief in a god. (\"I do not believe in any god.\")\n Also keep in mind that some Deists consider themselves humanists, as in mentioned in the manifesto.\n \n \nWhat are the differences between the ways a secularist and an atheist would see and interpret the world?\n\n Instead of answering the question, I'll ask a \"counter-question\" to try to illustrate the irrelevance of your question:\n What are the differences between the ways that a secular mathematician, an atheistic mathematician, and a theistic mathematician would see and interpret numbers and math? If they all believe that 2+2=4, that the sum of the squares of the measures of the lengths of the two legs of any right triangle is equal to the square of the measure of the length of the hypotenuse, that the derivative of the natural log of x is the reciprocal of x, etc., does that mean that secularism, atheism, and theism are all the same?\n \n Kronus also makes a good point. Many \"things\" (like math and science, as opposed to people) are secular and not atheistic.", 
   {}, 
   200276, 
   null, 
   1141029780.0
  ], 
  [
   200290, 
   null, 
   "Iuris", 
   "They are different terms and apply to different things. Secularism is not a worldview in itself, it is a policy of how to apply religious and other worldview in real life.\n \n Secularism does not exclude people with a religious worldview. One may imagine a devout christian that firmly believes in his faith, but is also convinced that faith must come from within and that forcing someone to behave in accordance with a religion simply encourages false faith, and would logically conclude that his faith should not be forced upon people (usually with the subclause of \"Let them burn in hell afterwards\", or something else along those lines).", 
   {}, 
   200289, 
   null, 
   1141033200.0
  ], 
  [
   200298, 
   null, 
   "billsco", 
   " Godlessness; immorality \n\n \n I hope there's a way to leave feedback for the fine folks at Dictionary.com. Atheism has nothing to instruct us in immorality.", 
   {}, 
   200290, 
   null, 
   1141048020.0
  ], 
  [
   200299, 
   null, 
   "Iuris", 
   "I think it's more likely that dictionary.com just realised that the term can be used as a curse, too. Just like liberal.\n \n I mean, if Easyrider were to shout \"You atheist!!!!!\" at you, which meaning of the word do you think he would mean?", 
   {}, 
   200298, 
   null, 
   1141050000.0
  ], 
  [
   200304, 
   null, 
   "doG", 
   "I hope there's a way to leave feedback for the fine folks at Dictionary.com. Atheism has nothing to instruct us in immorality.\n\n And I have left them feedback to see what happens. I noticed this particular entry was sourced from The American Heritage® Dictionary of the English Language, Fourth Edition so it is not something Dictionary.com wrote. \n \n I can see Iuris' point but the entry is still laid out wrong if this is the case. As written, \"Godlessness; immorality\", implies that immorality is synonymous with godlessness but the thesaurus entry for godlessness does not list immorality as a synonym. I think this is because some use the term \"godless\", an adjective, to mean immoral but \"godlessness\", a noun, to mean atheistic.", 
   {}, 
   200298, 
   null, 
   1141053240.0
  ], 
  [
   200305, 
   null, 
   "billsco", 
   "Thanks for contacting them, doG. The various definitions of atheism we encounter in our society need to be watched carefully, IMO. Too often, those writing the definitions are hostile to the idea of a person being godless. It's so easy to sully or demonize the term.", 
   {}, 
   200304, 
   null, 
   1141054080.0
  ], 
  [
   200326, 
   null, 
   "simone", 
   "Shoot! Billscoe!\n \n And here I was hoping you would instruct us in Atheistic immorality.\n \n Disappointed again! However shall I learn to be an immoral person?", 
   {}, 
   200305, 
   null, 
   1141058760.0
  ], 
  [
   200360, 
   null, 
   "Obvious Child", 
   "It's a dictionary, meant to report meaning not make it. The use of the word 'atheist' to denote godlessness and immorality is very old: in fact, in the middle ages 'practical atheists' were considered more common and more of a problem than 'theoretical atheists', as pretty much everyone theoretically believed in God but some still acted godlessly.", 
   {}, 
   200326, 
   null, 
   1141075320.0
  ], 
  [
   200410, 
   null, 
   "marc9000", 
   "I hope there's a way to leave feedback for the fine folks at Dictionary.com. Atheism has nothing to instruct us in immorality.\n\n \n I agree, I thought about putting a disclaimer about my thoughts on that in my first post, but I figured it would come up soon enough. I have had atheist aquaintances / coworkers throughout my life that were no different in some basic morals ect. from myself. I suppose they would claim that their morals come from worldly experiences, not the Bible. I can't argue with that. \n \n With the word \"immorality\" left out of the one definition, it makes the definitions of the two terms more similar, which concerns my point.", 
   {}, 
   200298, 
   null, 
   1141094280.0
  ], 
  [
   200427, 
   null, 
   "marc9000", 
   "\n Instead of answering the question, I'll ask a \"counter-question\" to try to illustrate the irrelevance of your question:\n What are the differences between the ways that a secular mathematician, an atheistic mathematician, and a theistic mathematician would see and interpret numbers and math? If they all believe that 2+2=4, that the sum of the squares of the measures of the lengths of the two legs of any right triangle is equal to the square of the measure of the length of the hypotenuse, that the derivative of the natural log of x is the reciprocal of x, etc., does that mean that secularism, atheism, and theism are all the same? \n\n \n It does mean they are all the same, concerning mathematics. But black & white subjects like mathematics make up a very small percentage of subjects that people deal with and make decisions on every day. Seeing and interpreting the world. The Humanist Manifesto outlines it in a broad sense. It's main point seems to be that humans are the highest form of intelligence, concerning earth and all life on it. If atheists declare there is no god, and secularists don't give any thought to a god, what differences would there be on how knowledge is filtered, decisions are made, values are established, and priorities are set? \n \n \n \nKronus also makes a good point. Many \"things\" (like math and science, as opposed to people) are secular and not atheistic.\n\n \n Math is much more black & white than science is. In some science, the same evidence can lead to different conclusions. The worldview, the beginning presuppositions of the person studying the evidence, is often what determines the conclusion. \n \n \nBased on the definitions you gave, they're quite different. Atheism is a matter of personal belief, secularism is a matter of public policy. There's no reason you can't be devoutly religious and a secularist. You would have your religious views, but believe that public policy should not be based on them. \n\n \n A devoutly religious person would disagree with all the statements in the Humanist Manifesto that I highlighted. Would they believe that public policy should be based on things that they don't believe? \n \n A hypothetical - If a public policy was a vote on abortion, and the \"devoutly religious\" person voted no, and the atheist voted yes, would the secularist, or humanist, be a non vote, a neutral position? There is no neutral position, because the issue would be decided one way or the other, and would effect the society of the secularist the same as it would the other two. It's clear who the secularist would side with.", 
   {}, 
   200289, 
   null, 
   1141102200.0
  ], 
  [
   200429, 
   null, 
   "marc9000", 
   "They are different terms and apply to different things. Secularism is not a worldview in itself, it is a policy of how to apply religious and other worldview in real life.\n \n Secularism does not exclude people with a religious worldview. One may imagine a devout christian that firmly believes in his faith, but is also convinced that faith must come from within and that forcing someone to behave in accordance with a religion simply encourages false faith, and would logically conclude that his faith should not be forced upon people (usually with the subclause of \"Let them burn in hell afterwards\", or something else along those lines).\n\n \n So if an atheist believes that humans are the highest form of intelligence, and a devout Christian believes God is the highest form of intelligence, the Christian should allow the atheist to force him to behave as if humans are the highest form of intelligence?", 
   {}, 
   200290, 
   null, 
   1141102560.0
  ], 
  [
   200436, 
   null, 
   "Symbiote", 
   "No, secularism is not about forcing behaviour. Under a secular the government neither forces people to believe, nor does it force them not to believe. It does not establish rules of worship, base itself on atheism or any religion.", 
   {}, 
   200429, 
   null, 
   1141104360.0
  ], 
  [
   200441, 
   null, 
   "electrolyte", 
   "It does mean they are all the same, concerning mathematics.\n\n So when you're doing math, you're an atheist? Of course not. Just because there is overlap doesn't mean that the two views are identical.\n \n \nIf atheists declare there is no god, and secularists don't give any thought to a god, what differences would there be on how knowledge is filtered, decisions are made, values are established, and priorities are set?\n\n Let's say an event occurs that defies immediate explanation.\n An atheist would say, \"I don't know right now how it happened, but it sure wasn't God!\"\n A secularist would say, \"I don't know right now how it happened.\"\n \n An atheist might publicly declare that no god(s) exist(s), be it via books, debates, lectures, seminars, etc.\n A secularist would make no claims about the existence or nonexistence of any god(s).\n \n An (abnormally radical) atheist might push for schoolchildren to acknowledge their lack of belief in any gods on a daily basis (say, looking at the American flag and holding their right hands over their hearts)...\n A secularist would demand that religion be left out of the classroom.\n \n \nThe worldview, the beginning presuppositions of the person studying the evidence, is often what determines the conclusion.\n\n This is where Occam's razor comes in. Perhaps you've heard of it?", 
   {}, 
   200436, 
   null, 
   1141106580.0
  ], 
  [
   200467, 
   null, 
   "doG", 
   "A coin that says, \"In God we trust\" is theist.\n A coin that says nothing about God is secular.\n A coin that says, \"There is no God\" is atheist.", 
   {}, 
   200441, 
   null, 
   1141138860.0
  ], 
  [
   200470, 
   null, 
   "Mach", 
   "So if an atheist believes that humans are the highest form of intelligence, and a devout Christian believes God is the highest form of intelligence, the Christian should allow the atheist to force him to behave as if humans are the highest form of intelligence?\n\n \n Symbiote already pointed out the important fact that atheism is the lack of a belief in mythology dieties like the christian \"God\". It has nothing to do with \"forcing\".\n \n However, aside from that, your reasoning is still suspect.\n \n Marc, first, you are \"forced\" every day to do things that coincide with reality, and it's only ethical that you SHOULD be. You are forced to pay enormous penalities if you violate certain laws, up to even being killed as a result. You are forced to go on green, and stop on red. Forced to drive the right way on the street. Forced to pay debt, etc. Laws and the associated penalities are generally formed by, and enforced by, secular government, employing non-theistic reasoning. Nonsense like religion simply has no place in a reasonable government (let freee people worship whatever they like, but it's NOT ethical to put it into government).\n \n For instance, regarding your claim that atheism claims man is the highest form of intelligence. That's incorrect, again, atheism is \"without belief in mythological, nonsencial dieties and the like\".\n \n HOWEVER, any sane person acknowledges the simple fact that there is NO EVIDENCE of ANY life in the universe that is more intelligent than human beings. If you have some, please share (with CNN and the scientific community). If not, then your claims are simply of no consequence...just like saying a red headed demon just told me to type this. There's no evidence for it, it's either : A lie. A delusion. A joke. Take your pick. If some bobble-headed alien shows up one day and runs circles around our intellect, great, we have a new winner, and we proceed with the new alien as the most intelligent...that is if we are reasonable. The unreasonable might still suggest that their fantasy diety is still #1. Fat lotta good that does anyone (it's meaningless).\n \n -Mach", 
   {}, 
   200429, 
   null, 
   1141141800.0
  ], 
  [
   200472, 
   null, 
   "Mach", 
   "A coin that says, \"In God we trust\" is theist.\n A coin that says nothing about God is secular.\n A coin that says, \"There is no God\" is atheist.\n\n \n Atheism is \"without belief in god\", by it's root words. NOT-theistic, simply the opposite of religious...NOT religious. Religious <-< not-Religious.\n \n Saying \"there is no god\" simply isn't something a reasonable person, with a little time to think it through, would claim.\n \n Secular seems to apply towards language, a body of rules, etc., and means, without religion. Every single person in a secular government may be theistic personally. Since rules or a government isn't a thinking person, it wouldn't make sense to call them atheistic or agnostic, which deals with belief or lack of.\n \n Agnostics are necessarily atheists ,that is, if they do NOT belief in [any diety], then they are atheists by definition. If there reason is that we cannot know, or that they don't know, then they can grab another coin..with agnostic on it.\n \n -Mach", 
   {}, 
   200467, 
   null, 
   1141142160.0
  ], 
  [
   200473, 
   null, 
   "Kronus", 
   "\n A devoutly religious person would disagree with all the statements in the Humanist Manifesto that I highlighted. Would they believe that public policy should be based on things that they don't believe? \n\n Yes. I know of no one who agrees with all government policies, or all of the premesis that they're based on. But we do all agree (or at least almost all) that we need some method for forming those policies. Compromises must be made. A religious secularist could believe, for example, that if we allow religious beliefs to dictate policy than it's just a matter of time before general religious freedom is compromised for all but those who follow the religion of the ruling party. Rather than risk that they would think it an acceptable compromise to have some policies that they don't agree with, as long as they don't actively compromise their faith. \n \n \n\n A hypothetical - If a public policy was a vote on abortion, and the \"devoutly religious\" person voted no, and the atheist voted yes, would the secularist, or humanist, be a non vote, a neutral position? There is no neutral position, because the issue would be decided one way or the other, and would effect the society of the secularist the same as it would the other two. It's clear who the secularist would side with.\n\n It's not clear to me at all. They might think that the heart of the issue is whether a fetus is a person, and so be fine with 1st trimester abortions, but not 2nd or 3rd. Or they may decide that viability is the issue, and so be fine with abortions late into the 2nd trimester. Or they may think that the potential for life is enough to warrant protection, and so oppose all abortions. It's a complex enough issue that even if you remove \"God says\" from the debate, the answer isn't obvious.\n \n The point here is that while a secularist believes that \"God says\" is inadeuqate justification for forming policy, it doesn't mean that those who say \"God says\" are necessarily wrong. The religious person says \"God commands that you do not steal.\" The atheist and the secularist agree with the not stealing, just for different reasons.", 
   {}, 
   200427, 
   null, 
   1141142220.0
  ], 
  [
   200476, 
   null, 
   "trebor", 
   "Atheism is \"without belief in god\", by it's root words. NOT-theistic, simply the opposite of religious...NOT religious. Religious <-< not-Religious.\n \n Saying \"there is no god\" simply isn't something a reasonable person, with a little time to think it through, would claim.\n .\n \n -Mach\n\n \n \n Why not? Based on the evidence there is no evidence there is any supernatural deity that created the universe. Such evidence is unlikely to occur, ever. Based on that, I conclude there is no god.", 
   {}, 
   200472, 
   null, 
   1141142880.0
  ], 
  [
   200481, 
   null, 
   "doG", 
   "Saying \"there is no god\" simply isn't something a reasonable person, with a little time to think it through, would claim.\n\n Are you saying that I'm unreasonable? There is no God and you can provide no conclusive evidence that there is. Your ball....", 
   {}, 
   200472, 
   null, 
   1141144080.0
  ], 
  [
   200483, 
   null, 
   "Obvious Child", 
   "Are you saying that I'm unreasonable? There is no God and you can provide no conclusive evidence that there is. Your ball....\nSo am I reasonable to say 'there is no material world' because you can provide no conclusive evidence? Or 'there is no cause and effect' or 'there are no conscious beings except me?'", 
   {}, 
   200481, 
   null, 
   1141145160.0
  ], 
  [
   200488, 
   null, 
   "trebor", 
   "So am I reasonable to say 'there is no material world' because you can provide no conclusive evidence? Or 'there is no cause and effect' or 'there are no conscious beings except me?'\n\n \n On the contrary.. you can say 'there is no material world' because there is absolutely NO evidence. However, there is evidence of cause an effect, and there is evidence of 'consciouse beings'", 
   {}, 
   200483, 
   null, 
   1141149720.0
  ], 
  [
   200511, 
   null, 
   "doG", 
   "So am I reasonable to say 'there is no material world' because you can provide no conclusive evidence? Or 'there is no cause and effect' or 'there are no conscious beings except me?'\n\n There is much more evidence for any of those than there is for any God. We can easily prove cause and effect and the existance of concious beings with the scientific method. There is zero proof for a God except conjecture.", 
   {}, 
   200483, 
   null, 
   1141155780.0
  ], 
  [
   200516, 
   null, 
   "Alan Ryan", 
   "There is much more evidence for any of those than there is for any God. We can easily prove cause and effect and the existance of concious beings with the scientific method. There is zero proof for a God except conjecture.\n\n I'll wait for Obvious Child's response - but I anticipate that you're going to get an argument that proof of cause and effect is neither easy nor possible.\n \n And the same applies to the existence of conscious beings.", 
   {}, 
   200511, 
   null, 
   1141157340.0
  ], 
  [
   200518, 
   null, 
   "doG", 
   "I'll wait for Obvious Child's response - but I anticipate that you're going to get an argument that proof of cause and effect is neither easy nor possible.\n \n And the same applies to the existence of conscious beings.\n\n You're probably right but proving either would still be easier than coming up with proof of a God or any other supernatural entity. At least our own existance suggests the it is plausible that conscious beings exist.", 
   {}, 
   200516, 
   null, 
   1141158420.0
  ], 
  [
   200521, 
   null, 
   "trebor", 
   "I'll wait for Obvious Child's response - but I anticipate that you're going to get an argument that proof of cause and effect is neither easy nor possible.\n \n And the same applies to the existence of conscious beings.\n\n \n \n There is never 'proof'. But we can demonstrate cause/effect. As for 'concious' beings.. we have parameters that can indicate it.. and we can set up tests to see if those parameters are met.\n \n \n We can not come up with a way to test for 'the non-material' world'. We can not agree on what the 'non-material world' is.", 
   {}, 
   200516, 
   null, 
   1141160220.0
  ], 
  [
   200522, 
   null, 
   "Obvious Child", 
   "There is much more evidence for any of those than there is for any God. We can easily prove cause and effect and the existance of concious beings with the scientific method. There is zero proof for a God except conjecture.\nAlan Ryan is right: as for the scientific method, it assumes cause and effect, the material world, the reliability of future resembling past and suchlike before it starts. And how can it prove subjective mental states?\n \n As for 'our own existence suggests that it is plausible that conscious beings exist' (I assume you mean other conscious beings), many have found their inner experience makes the idea of God seem plausible.\n \n The material world is much like God for me. Belief in both is not proved by sense-data but is a way of making sense of it and imposing some level of order.\n \n \nThere is never 'proof'. But we can demonstrate cause/effect.\nWhatever you mean by 'demonstrate', is this relevant to dOg's statement that there is no 'conclusive evidence' of God\n \n \nAs for 'concious' beings.. we have parameters that can indicate it.. and we can set up tests to see if those parameters are met.\nWhat parameters? How can we test them? Ultimately, I suspect that such measures must be based on assumption: I am conscious, I act in this way, these beings seem similar, they must be conscious, these things act in a similar way, they must be conscious too.... I have studied various materialist models of mind and found none of them convincing.", 
   {}, 
   200511, 
   null, 
   1141161540.0
  ], 
  [
   200528, 
   null, 
   "trebor", 
   "Alan Ryan is right: as for the scientific method, it assumes cause and effect, the material world, the reliability of future resembling past and suchlike before it starts. And how can it prove subjective mental states?\n \n As for 'our own existence suggests that it is plausible that conscious beings exist' (I assume you mean other conscious beings), many have found their inner experience makes the idea of God seem plausible.\n \n The material world is much like God for me. Belief in both is not proved by sense-data but is a way of making sense of it and imposing some level of order.\n \n Whatever you mean by 'demonstrate', is this relevant to dOg's statement that there is no 'conclusive evidence' of God\n \n What parameters? How can we test them? Ultimately, I suspect that such measures must be based on assumption: I am conscious, I act in this way, these beings seem similar, they must be conscious, these things act in a similar way, they must be conscious too.... I have studied various materialist models of mind and found none of them convincing.\n\n \n \n I would word 'conclusive' evidence to be any 'objective' evidence. \n \n As for you not finding any 'materialistic models of the mind' convincing.. well, lets see you come up with a better one.\n \n The materialistic ones CAN be tested. What is your model, and how do you test for it.", 
   {}, 
   200522, 
   null, 
   1141164120.0
  ], 
  [
   200530, 
   null, 
   "doG", 
   "OC,\n \n Why are their quotes in your post that quote things I didn't say? Not that I disagree with them but it looks like you forgot to edit the user part of the quote a couple of times :)", 
   {}, 
   200528, 
   null, 
   1141164660.0
  ], 
  [
   200555, 
   null, 
   "Mach", 
   "Why not? Based on the evidence there is no evidence there is any supernatural deity that created the universe. Such evidence is unlikely to occur, ever. Based on that, I conclude there is no god.\n\n \n It's only because the rabble rousers love to argue. Perhaps my language was strong, while it's common usage to say \"god does or does not exist\", I think push come to shove, the debate always ends up doing something similar to this:\n \n 1. Scientific investigation beings with observation of reality.\n 2. One cannot form a meaningful statement of existence without referring to some observation..i.e evidence.\n \n So, in the god case, what was your definition of god? A supernatural being? Yes, by definition, supernatural beings cannot exist, saying there is no evidence for one, is like saying there is no evidence for something that cannot have evidence to support it is just talking in circles.\n \n Accepting logical definitions of dieties with regards to reality, opens up discussion of proof, evidence, and all sorts of other things that simply are not reasonable, since before any of that can happen, we have to arrive at a definition that is consistent with reality. Such as, how can you prove there is no xyz? You can't, but you don't need to, we don't know what xyz is in this case.\n \n Theists have a belief in one or more deites. We need the opposite, that's a-theist.\n Have no belief in one or more dieties. And that makes sense, atheists may differ in why they don't have such a belief, but the root definitoin and important language is \"no belief\". You may be agnostic on the why, or scientific, or illogical, any of which could still qualify as an atheist outlook. Saying more than that just weakens the argument unecessarily.\n \n -Mach", 
   {}, 
   200476, 
   null, 
   1141170660.0
  ], 
  [
   200589, 
   null, 
   "Mach", 
   "Are you saying that I'm unreasonable?\n\n No, just the claim, and it's not that significant to label it unreasonable, I withdraw the word.\n \n \n There is no God and you can provide no conclusive evidence that there is. Your ball....\n\n \n The claim is either circular, or illogical, I'll illustrate as best I can.\n \n The simple answer is:\n doG, I do not understand your claim, you use a word I don't know the definition of... \"God\".\n \n The most likely conclusions after that is addressed will be:\n 1. God is defined as something for which by definition, there can be no evidence, and does not \"exist\". That makes it circular (there is no evidence for this thing which cannot have evidence).\n \n 2. The definition of god includes some illogical qualities that make the claim \"god does not exist\", unreasonable (illogical, insert any descriptive here).\n \n You know how much energy is spent in debates about \"can god exist, does god exist, where is the evidence, even that there is evidence in the bible and gulp, eye-witnesses, I feel him every day, he is love\", etc, etc.\n \n Each of these is unecessary when we don't use the word god without first defining it. For example, if someone were to define the qualities of god such that they were identicial to what we describe as \"nature\", then that person would just be using the term god as a synonym for nature..uncessary, we have a good word for that...nature. Or they say he's love...OK, we have a word for that too. OK, he's completely undectable and outside the universe...OK, we have a word for that, it's nothing, or silence (that is, no claim at all).\n \n It's also why some get so bent with proving there is no god. How can one go prove that something doesn't exist? They don't need to, it's unreasonable.\n \n What is reasonable are the basic tenants of science:\n \n Knowledge is derived from observation of reality.\n \n That's really all there is to it. If there is no observation of [god] (insert anything for god), then discussion of it's existence or not is circular or meaningless.\n \n It's the same reason we cannot reasonably say things like this:\n It's possible that there may be a god.\n \n How on earth(doh) can someone claim to know if something is or is not possible in reality? We derive our knowledge FROM reality, not the other way around.\n \n Pick it apart, I'd like to be corrected if it's entirely off-track.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "doG"
    }
   }, 
   200555, 
   null, 
   1141180740.0
  ], 
  [
   200596, 
   null, 
   "marc9000", 
   "No, secularism is not about forcing behaviour. Under a secular the government neither forces people to believe, nor does it force them not to believe. It does not establish rules of worship, base itself on atheism or any religion.\n\n \n In today's world, many morally relevent decisions must be made by governments, usually concerning science. They have to be about forcing behavior when there are only two choices. Embryonic stem cell research, animal and human cloning, marriage laws - the list is long - I suppose it could all be summed up in two words, ETHICAL STANDARDS. When does a secularist(who doesn't consider a God) and an atheist (who rejects a God) disagree on ethical standards?", 
   {}, 
   200436, 
   null, 
   1141183020.0
  ], 
  [
   200600, 
   null, 
   "marc9000", 
   "So when you're doing math, you're an atheist? Of course not. Just because there is overlap doesn't mean that the two views are identical. \n\n \n Can you name a difference between an atheist and a secularist concerning how they would filter knowledge, make decisions, establish values, and set priorities?\n \n \n \nLet's say an event occurs that defies immediate explanation.\n An atheist would say, \"I don't know right now how it happened, but it sure wasn't God!\"\n A secularist would say, \"I don't know right now how it happened.\"\n \n An atheist might publicly declare that no god(s) exist(s), be it via books, debates, lectures, seminars, etc.\n A secularist would make no claims about the existence or nonexistence of any god(s). \n\n \n But if a government action needed to be taken on this event, would there be a difference in what the atheist and secularist would expect of the government? If it was something scary to them (some natural event like global warming for example) would they expect something more from the government than a religious person, who believes God is in control?\n \n \nAn (abnormally radical) atheist might push for schoolchildren to acknowledge their lack of belief in any gods on a daily basis (say, looking at the American flag and holding their right hands over their hearts)...\n A secularist would demand that religion be left out of the classroom. \n\n \n So they would both require that ethical standards questions that arise in science be left out of the classroom? Very similar.\n \n \n \nThis is where Occam's razor comes in. Perhaps you've heard of it?\n\n \n Perhaps you're trying to change the subject? Occam's razor is about simplicity - the simplest theory fits the facts. The more complicated basic life forms have been discovered to be since Darwin, the less simple evolution becomes. It may become more simple to believe that there's something more to life, something beyond our natural realm.", 
   {}, 
   200441, 
   null, 
   1141183980.0
  ], 
  [
   200602, 
   null, 
   "marc9000", 
   "Symbiote already pointed out the important fact that atheism is the lack of a belief in mythology dieties like the christian \"God\". It has nothing to do with \"forcing\".\n \n However, aside from that, your reasoning is still suspect.\n \n Marc, first, you are \"forced\" every day to do things that coincide with reality, and it's only ethical that you SHOULD be. You are forced to pay enormous penalities if you violate certain laws, up to even being killed as a result. You are forced to go on green, and stop on red. Forced to drive the right way on the street. Forced to pay debt, etc. Laws and the associated penalities are generally formed by, and enforced by, secular government, employing non-theistic reasoning. Nonsense like religion simply has no place in a reasonable government (let freee people worship whatever they like, but it's NOT ethical to put it into government). \n\n \n Maybe we disagree on the percentages of decisions government makes concerning secularism, and things like morality and ethical standards. Or that you aren't as concerned about government decisions as I am as a Christian, because my belief is that humans aren't as perfect as a non Christian might think them to be.\n \n \nFor instance, regarding your claim that atheism claims man is the highest form of intelligence. That's incorrect, again, atheism is \"without belief in mythological, nonsencial dieties and the like\". \n\n \n How can it be incorrect, if atheism can't point to a higher intelligence?\n \n \nHOWEVER, any sane person acknowledges the simple fact that there is NO EVIDENCE of ANY life in the universe that is more intelligent than human beings. If you have some, please share (with CNN and the scientific community). If not, then your claims are simply of no consequence...just like saying a red headed demon just told me to type this. There's no evidence for it, it's either : A lie. A delusion. A joke. Take your pick. If some bobble-headed alien shows up one day and runs circles around our intellect, great, we have a new winner, and we proceed with the new alien as the most intelligent...that is if we are reasonable. The unreasonable might still suggest that their fantasy diety is still #1. Fat lotta good that does anyone (it's meaningless).\n \n -Mach\n\n \n I don't have scientific evidence, but scientific evidence isn't the only source of knowledge.", 
   {}, 
   200470, 
   null, 
   1141184520.0
  ], 
  [
   200630, 
   null, 
   "electrolyte", 
   "Can you name a difference between an atheist and a secularist concerning how they would filter knowledge, make decisions, establish values, and set priorities?\n\n I did. In fact, you quoted it. Others on this thread have named differences as well.\n \n \nBut if a government action needed to be taken on this event, would there be a difference in what the atheist and secularist would expect of the government?\n\n I don't see how this is relevant. The government is supposed to be secular.\n \n \nIf it was something scary to them (some natural event like global warming for example) would they expect something more from the government than a religious person, who believes God is in control?\n\n Again, I fail to see the relevance. How does a person's expectations of government action have anything to do with comparing or contrasting atheism and secularism?\n \n \nSo they would both require that ethical standards questions that arise in science be left out of the classroom?\n\n Where the hell did this come from? Oh, wait, I know: you don't think ethics can exist without God. Coincidentally, just last week I went to a debate where Dan Barker from the Freedom from Religion Foundation wiped the floor with some liberal Christian on that very topic. If you'd like to try your hand, start a new thread; this one is for explaining the differences between atheism and secularism.\n \n \nPerhaps you're trying to change the subject?\n\n No, you brought up multiple interpretations, and I mentioned the guideline for dealing with multiple interpretations. The remainder of your response simply shows a significant misunderstanding of how Occam's razor works.", 
   {}, 
   200602, 
   null, 
   1141202340.0
  ], 
  [
   200655, 
   null, 
   "Mach", 
   "Maybe we disagree on the percentages of decisions government makes concerning secularism, and things like morality and ethical standards. Or that you aren't as concerned about government decisions as I am as a Christian, because my belief is that humans aren't as perfect as a non Christian might think them to be.\n\n THere is a reason that the definition of atheism, secular, science, etc., have nothing to do with the things you mention like perfection, sin, good, etc.\n That's because they have nothing to do with them.\n \n I certainly don't, and I doubt any reasonable person, christian, atheist, or otherwise, things people are anything close to \"perfect\", either in abiding by all laws and moral codes, or in their physiology. Please don't think not religious = something other than simply, not religious. That's all it means, no belief in mythical stuff, that's all. \n \n \n \n \nHow can it be incorrect, if atheism can't point to a higher intelligence?\n Marc, atheism has nothing to do with that. Atheism is \"Without belief in dieties\". That is all. End of incrimination :)\n \n In reality, no one, including christians, can \"point to a higher intelligence\". But this is just common knowledge, it has nothing to do with secularism, atheism, or christianity, it's just reality.\n \n \nI don't have scientific evidence, but scientific evidence isn't the only source of knowledge.\n\n \n I know you don't, and cannot, but that's not your fault, it's how reality works.\n \n From where I come from the definition of science is this:\n The body of knoweldge that pertains to reality.\n The primary method for obtaining this knowledge is through the scientific method (observation, test hypothesis, debate, etc.)\n \n When you suggest evidence isn't required, you are suggesting that we believe things on FAITH, which is religion, which is make-beleive, that's why it requires no evidence.\n \n For example, if you agree that some knowledge can be obtained without evidence, I'll tell you a purple monkey named bingo is sitting on my shoulder talking to me. I have no evidence for it, it contradicts what is known in science, yet by your (bad) standard we could call that \"knowledge\"? I'd call it lying, or delusion, since that's what it is. Whatever it is, it's not part of reality, it's just a concept.\n \n \n -Mach", 
   {}, 
   200602, 
   null, 
   1141231920.0
  ], 
  [
   200758, 
   null, 
   "marc9000", 
   "I did. In fact, you quoted it. Others on this thread have named differences as well. \n\n \n Yes you did, but just barely. You equated a worldview with one unexplainable event. If a secularist didn't \"know right now how it happened\", it doesn't mean his mind was blank about trying to figure it out. A worldview is about much more than one reaction.\n \n \"Others on this thread\"? You won't specify? How about this one;\n \n \nA coin that says, \"In God we trust\" is theist.\n A coin that says nothing about God is secular.\n A coin that says, \"There is no God\" is atheist. \n\n \n There is no atheist movement to have our coins say \"there is no God\". But there are attempts being made to have our coins say nothing about God, by atheists. Secularists may not be as militant about it as atheists, but they would agree.\n \n \n \n \nI don't see how this is relevant. The government is supposed to be secular. \n\n \n The Declaration of Independence says that men (humans) are endowed by their Creator with certain unalienable rights. With no Creator, with accidental, random beginnings of life, man has no more unalienable rights than any plant or animal, unless he's granted those rights by other, more powerful men. (government) If the government grants them, the government can take them away. Our country's foundation is built upon unalienable rights. Interpretations of that foundation quickly separate depending on worldviews. There are no unalienable rights in atheism, and there are no unalienable rights in secularism. \n \n \n \nWhere the hell did this come from? Oh, wait, I know: you don't think ethics can exist without God. \n\n \n Some can, but many cannot. Similar to that unalienable rights thing.\n \n \n \nCoincidentally, just last week I went to a debate where Dan Barker from the Freedom from Religion Foundation wiped the floor with some liberal Christian on that very topic. \n\n \n Yes, I just checked their site. Here are some of their \"accomplishments\".\n \n \nWinning a lawsuit barring direct taxpayer subsidy of religious schools \n Removing Ten Commandments monuments and crosses from public land \n Halting the Post Office from issuing religious cancellations \n Ending 51 years years of illegal bible instruction in public schools \n \n \n Foundation complaints have:\n \n Halted prayer at public institutions, and public financing of nativity pageants and Easter service \n Stopped direct subsidy to religious schools \n Stopped Job Corps trainees from being assigned to work on a Catholic shrine \n Ended a 122-year abuse of commencement prayers at a Top Ten University \n Declared unconstitutional the creation of a state post to \"assist \n\n \n When looking over their site, it's obvious they appeal to both atheists and secularists. Amazing huh?\n \n \n \nIf you'd like to try your hand, start a new thread; this one is for explaining the differences between atheism and secularism. \n\n \n Ethical standards apply to this thread. I'm the one who started it, so I'm the best judge about what applys to it.\n \n \n \nNo, you brought up multiple interpretations, and I mentioned the guideline for dealing with multiple interpretations. The remainder of your response simply shows a significant misunderstanding of how Occam's razor works.\n\n \n Occam's razor is nothing more than a concept like so much of what passes as \"science\" these days. Since it's secular, atheists worship it.", 
   {}, 
   200630, 
   null, 
   1141266180.0
  ], 
  [
   200759, 
   null, 
   "marc9000", 
   "THere is a reason that the definition of atheism, secular, science, etc., have nothing to do with the things you mention like perfection, sin, good, etc.\n That's because they have nothing to do with them. \n\n \n Today's science has plenty to do with ethics and morals, concerning things like stem cell researh, cloning, suicide \"rights\" - many medical proceedures. \n \n \nI certainly don't, and I doubt any reasonable person, christian, atheist, or otherwise, things people are anything close to \"perfect\", either in abiding by all laws and moral codes, or in their physiology. Please don't think not religious = something other than simply, not religious. That's all it means, no belief in mythical stuff, that's all. \n\n \n Then why has atheism recently become very organized? To \"protect\" themselves from over 200 years of U.S. tradition?\n \n http://www.atheists.org/\n \n Click that link, and page down through all the politics. \n \n \n \n Marc, atheism has nothing to do with that. Atheism is \"Without belief in dieties\". That is all. End of incrimination :)\n \n In reality, no one, including christians, can \"point to a higher intelligence\". But this is just common knowledge, it has nothing to do with secularism, atheism, or christianity, it's just reality. \n\n \n \"Atheism has nothing to do with that\" emoticon_xdonno did the AA link just convince you otherwise? How about this one, another mainstream one;\n \n http://www.religioustolerance.org/atheist.htm\n \n See the eight quotations there. Numbers 1, 2, 4, 5, 6, 7, and 8 are all from atheists. What about number 3? It's from a Christian! You'd think it would be from someone like Billy Graham, Jerry Fallwell, or Pat Robertson, wouldn't you? Why it's from George H.W. Bush, the father of our current REPUBLICAN president!!!! It says; \"as presidental nominee of the Republican party\". \n \n How can you say that atheism and it's twin brother secularism, aren't political? Check out the \"about atheism\" link towards the bottom of the page. Page down there, and you'll see an invitation to \"visit one of their sponsors\". Who is it???? THE NEW YORK TIMES. \n \n Not political?\n \n \n \n \n \nI know you don't, and cannot, but that's not your fault, it's how reality works.\n \n From where I come from the definition of science is this:\n The body of knoweldge that pertains to reality.\n The primary method for obtaining this knowledge is through the scientific method (observation, test hypothesis, debate, etc.)\n \n When you suggest evidence isn't required, you are suggesting that we believe things on FAITH, which is religion, which is make-beleive, that's why it requires no evidence. \n\n \n Like so many of the gaps that are faith filled for Darwinian evolution to work?\n \n \nFor example, if you agree that some knowledge can be obtained without evidence, I'll tell you a purple monkey named bingo is sitting on my shoulder talking to me. \n\n \n No, you and him shared a common ancestor!! Take away the color, and take away the name, and you have scientific Darwinian evolution, don't you?\n \n \n I have no evidence for it, it contradicts what is known in science, yet by your (bad) standard we could call that \"knowledge\"? I'd call it lying, or delusion, since that's what it is. Whatever it is, it's not part of reality, it's just a concept.\n \n \n -Mach\n\n \n Our everyday lives are filled with concepts.", 
   {}, 
   200655, 
   null, 
   1141267680.0
  ], 
  [
   200764, 
   null, 
   "electrolyte", 
   "You equated a worldview with one unexplainable event.\n\n No, I gave a perfectly valid example that shows why atheism is not the same as secularism.\n \n \nBut there are attempts being made to have our coins say nothing about God, by atheists.\n\n Some theists might agree with the reasoning behind those attempts. Does that mean that theism and atheism are the same? Of course not. (This goes back to the overlap issue, which you apparently cannot grasp.) doG's statements, however valid, do not make your analogy hold.\n \n \nThe Declaration of Independence says that men (humans) are endowed by their Creator with certain unalienable rights.\n\n The Declaration of Independence has absolutely no legal authority whatsoever.\n \n \nWith no Creator, with accidental, random beginnings of life, man has no more unalienable rights than any plant or animal, unless he's granted those rights by other, more powerful men.\n\n I think this might be for another thread. However, it would be good if you could support the bare assertion a bit before it gets approached here or in another thread.\n You also should stop presenting evolutionary theory inaccurately, but I suppose there's no hope of that.\n \n \nThere are no unalienable rights in atheism, and there are no unalienable rights in secularism.\n\n Is it your position that an atheistic society would grant no rights to anybody?\n See also above.\n \n \nyou don't think ethics can exist without God.\n\n Some can, but many cannot.\n\n Start here, first on the morality list. I'll save the trump for later.\n \n \nWhen looking over their site, it's obvious they appeal to both atheists and secularists. Amazing huh?\n\n Is there some point in this comment, or . . . ?\n It's evident that you didn't look over their site very well, otherwise you would have seen the link I provided above and not made the comment you did.\n \n \nEthical standards apply to this thread.\n\n Ethics is a recognized subcategory of philosophy, so one could argue that discussion of ethics belongs in the philosophy forum. Nevertheless, we'll at least start the ethics conversation here.\n \n \nSince it's secular, atheists worship it.\n\n The same way atheists worship their televisions, ovens, kitchen sinks, vehicles, etc., because all those things are secular?\n (The rolleyes smiley doesn't accurately portray the degree to which I find my eyes rolling...)", 
   {}, 
   200758, 
   null, 
   1141270740.0
  ], 
  [
   200765, 
   null, 
   "trebor", 
   "Today's science has plenty to do with ethics and morals, concerning things like stem cell researh, cloning, suicide \"rights\" - many medical proceedures. \n \n\n \n No, it is the scientists that are concerned with the ethics. Science itself is neutral to the subject. You are mixing up the tool with the people that use the tool.\n \n \n\n Then why has atheism recently become very organized? To \"protect\" themselves from over 200 years of U.S. tradition?\n \n http://www.atheists.org/\n \n Click that link, and page down through all the politics. \n \n \n\n \n Partly. There are more atheists now, and they have to protect themselves against the prejudice of the religious reight. So, some atheists have decieded to organise and give themselves poltical clout. Mostly to protect themselves against Christians who want to force their religion down their throats via the use of government (which is against the constitution)\n \n \n \n \n \n \n \n \"Atheism has nothing to do with that\" emoticon_xdonno did the AA link just convince you otherwise? How about this one, another mainstream one;\n \n http://www.religioustolerance.org/atheist.htm\n \n See the eight quotations there. Numbers 1, 2, 4, 5, 6, 7, and 8 are all from atheists. What about number 3? It's from a Christian! You'd think it would be from someone like Billy Graham, Jerry Fallwell, or Pat Robertson, wouldn't you? Why it's from George H.W. Bush, the father of our current REPUBLICAN president!!!! It says; \"as presidental nominee of the Republican party\". \n \n How can you say that atheism and it's twin brother secularism, aren't political? Check out the \"about atheism\" link towards the bottom of the page. Page down there, and you'll see an invitation to \"visit one of their sponsors\". Who is it???? THE NEW YORK TIMES. \n \n Not political?\n \n \n \n \n \n \n Like so many of the gaps that are faith filled for Darwinian evolution to work?\n \n \n \n No, you and him shared a common ancestor!! Take away the color, and take away the name, and you have scientific Darwinian evolution, don't you?\n \n \n \n Our everyday lives are filled with concepts.[/QUOTE]", 
   {}, 
   200759, 
   null, 
   1141271820.0
  ], 
  [
   200766, 
   null, 
   "trebor", 
   "Today's science has plenty to do with ethics and morals, concerning things like stem cell researh, cloning, suicide \"rights\" - many medical proceedures. \n \n\n \n No, it is the scientists that are concerned with the ethics. Science itself is neutral to the subject. You are mixing up the tool with the people that use the tool.\n \n \n\n Then why has atheism recently become very organized? To \"protect\" themselves from over 200 years of U.S. tradition?\n \n http://www.atheists.org/\n \n Click that link, and page down through all the politics. \n \n \n\n \n Partly. There are more atheists now, and they have to protect themselves against the prejudice of the religious reight. So, some atheists have decieded to organise and give themselves poltical clout. Mostly to protect themselves against Christians who want to force their religion down their throats via the use of government (which is against the constitution).", 
   {}, 
   200759, 
   null, 
   1141271940.0
  ], 
  [
   200769, 
   null, 
   "Easyrider", 
   " No, it is the scientists that are concerned with the ethics. Science itself is neutral to the subject.\n\n \n Secular / atheist scientists have no objective basis for discerning right and wrong, so their so-called \"ethics\" are suspect right up front. They need to be scrutinized closely. \n \n \nThere are more atheists now, and they have to protect themselves against the prejudice of the religious reight. So, some atheists have decieded to organise and give themselves poltical clout. Mostly to protect themselves against Christians who want to force their religion down their throats via the use of government (which is against the constitution).\n\n \n Oh you poor dears. I've seen just as many of your atheists, Christ-bashers, etc., who try to ram their anti-God agendas down people's throats as anyone else. They try to kick people of faith out of their science departments; belittle them, keep them from presenting information in science journals, etc. All people of faith want is equal access to present their scientific theories and evidences.", 
   {}, 
   200766, 
   null, 
   1141274520.0
  ], 
  [
   200777, 
   null, 
   "Matthew S", 
   "\n Oh you poor dears. I've seen just as many of your atheists, Christ-bashers, etc., who try to ram their anti-God agendas down people's throats as anyone else. They try to kick people of faith out of their science departments; belittle them, keep them from presenting information in science journals, etc. All people of faith want is equal access to present their scientific theories and evidences.\n\n \n The problem is many times these brainwashed people of faith do not have credible therories and evidences. If you base your scientific theory on the works of God you pretty much have to prove that God exists in order for Him to be a factor in your theory.", 
   {}, 
   200769, 
   null, 
   1141301520.0
  ], 
  [
   200779, 
   null, 
   "Iuris", 
   "Secular / atheist scientists have no objective basis for discerning right and wrong, so their so-called \"ethics\" are suspect right up front. They need to be scrutinized closely. \n\n \n Everyone who has ever claimed an \"objective basis\" for ethics is exactly as suspect. The proposed \"objective bases\" tend to lack scientific substantiation. \n \n Also, one might point out that secular ethics have to establish rational arguments for their ethics. The others don't bother with that at all and are convinced that their \"objective base\" are all that is needed.", 
   {}, 
   200777, 
   null, 
   1141307880.0
  ], 
  [
   200782, 
   null, 
   "doG", 
   "All people of faith want is equal access to present their scientific theories and evidences.\n\n Such as?........", 
   {}, 
   200769, 
   null, 
   1141311300.0
  ], 
  [
   200784, 
   null, 
   "trebor", 
   "Secular / atheist scientists have no objective basis for discerning right and wrong, so their so-called \"ethics\" are suspect right up front. They need to be scrutinized closely. \n \n \n \n Oh you poor dears. I've seen just as many of your atheists, Christ-bashers, etc., who try to ram their anti-God agendas down people's throats as anyone else. They try to kick people of faith out of their science departments; belittle them, keep them from presenting information in science journals, etc. All people of faith want is equal access to present their scientific theories and evidences.\n\n \n \n It is not 'christ' that is being bashed. It is the 'religious reigh\" psuedo-christ that is being bashed. It is a person (such as someone who belongs to an innerent bible believing church), that thinks that their bigotry is ethics.", 
   {}, 
   200769, 
   null, 
   1141312200.0
  ], 
  [
   200788, 
   null, 
   "jyoshu", 
   "It is not 'christ' that is being bashed. It is the 'religious reigh\" psuedo-christ that is being bashed.\n\n \n Here's a thought . . .\n \n Don't bash anyone at all. Just debate rather than constantly using this as a \"I-hate-certain-Christians\" forum.", 
   {}, 
   200784, 
   null, 
   1141313220.0
  ], 
  [
   200814, 
   null, 
   "trebor", 
   "Here's a thought . . .\n \n Don't bash anyone at all. Just debate rather than constantly using this as a \"I-hate-certain-Christians\" forum.\n\n \n \n When that certain christians act in a responsible manner, and don't lie, and promote their bigotry, and try to convert people by their proclamations to anybody that disagrees with the with \"JESUS IS LORD', then I will consider it.\n \n Until then, it is shere self defense.", 
   {}, 
   200788, 
   null, 
   1141325760.0
  ], 
  [
   200869, 
   null, 
   "Easyrider", 
   "When that certain christians act in a responsible manner, and don't lie, and promote their bigotry, and try to convert people by their proclamations to anybody that disagrees with the with \"JESUS IS LORD', then I will consider it.\n \n Until then, it is shere self defense.\n\n \n Reaching the unbelievers with the Gospel is responsible, according to God's command in Matthew 28:18-19. And there's nothing bigoted about it.", 
   {}, 
   200814, 
   null, 
   1141344600.0
  ], 
  [
   200882, 
   null, 
   "trebor", 
   "Reaching the unbelievers with the Gospel is responsible, according to God's command in Matthew 28:18-19. And there's nothing bigoted about it.\n\n \n Yes, it is.\n \n As is using a site for information that deny's the holocaust too.", 
   {}, 
   200869, 
   null, 
   1141351020.0
  ], 
  [
   200883, 
   null, 
   "jyoshu", 
   "When that certain christians act in a responsible manner, and don't lie, and promote their bigotry, and try to convert people by their proclamations to anybody that disagrees with the with \"JESUS IS LORD', then I will consider it.\n \n Until then, it is shere self defense.\n\n \n Oh please . . . emoticon_rolleyes \n \n It's funny reading the extent some of you will go to in order to justify your bigotry.", 
   {}, 
   200814, 
   null, 
   1141351860.0
  ], 
  [
   200889, 
   null, 
   "trebor", 
   "Oh please . . . emoticon_rolleyes \n \n It's funny reading the extent some of you will go to in order to justify your bigotry.\n\n \n You mean.. when someone reacts badly to some XXXXXX claiming they don't know their own scripture, else they would be christian, and then get threats they are going to end up in the bbq pits, the person who reacts badly is bigoted.\n \n What ever floats your boat.", 
   {}, 
   200883, 
   null, 
   1141355220.0
  ], 
  [
   200896, 
   null, 
   "Orion", 
   "Reaching the unbelievers with the Gospel is responsible, according to God's command in Matthew 28:18-19. And there's nothing bigoted about it.\n\n \n For your consideration, EZ...\n \n Many Paths\n \n As men approach me, so I receive them. All paths, Arjuna, lead to me. -- Hinduism, Bhagavad Gita 4.11\n \n My Lord, you are one although variously appearing. -- Jainism, Hemachandra \n \n We believe in God, and what has been revealed to us, and what was revealed to Abraham, Ishmael, Isaac, Jacob, and the Tribes, and in what was given to Moses, Jesus, and the Prophets from their land. We make no distinction between any of them, and to God do we submit. -- Islam, Qur'an 3.84\n \n There are righteous men among the nations who have a share in the world to come. -- Judaism, Tosefta Sanhedrin\n \n And Peter opened his mouth and said, \"Truly I believe that God shows no partiality, but in every nation any one who fears him and does what is right is acceptable to him. -- Christianity, Acts 10:34-35\n \n Just as the sin-offering atones for Israel, so righteousness atones for the peoples of the world. -- Judaism, Talmud\n \n Tolerance\n \n To be attached to a certain view and to look down upon other views as inferior - this the wise men call a fetter. -- Buddhism, Sutta Nipata\n \n Like the bee, gathering honey from different flowers, the wise man accepts the essence of different scriptures and sees only the good in all religions. -- Hinduism, Srimad Bhagavatam\n \n A man has a faith. If he says \"This is my faith\", so far he maintains truth. But by that he cannot proceed to the absolute conclusion: \"This alone is truth and everything else is false\". -- Buddhism, Majjhima Nikaya", 
   {}, 
   200869, 
   null, 
   1141358580.0
  ], 
  [
   200903, 
   null, 
   "Easyrider", 
   "For your consideration, EZ...\n \n Many Paths\n \n As men approach me, so I receive them. All paths, Arjuna, lead to me. -- Hinduism, Bhagavad Gita 4.11\n \n My Lord, you are one although variously appearing. -- Jainism, Hemachandra \n \n We believe in God, and what has been revealed to us, and what was revealed to Abraham, Ishmael, Isaac, Jacob, and the Tribes, and in what was given to Moses, Jesus, and the Prophets from their land. We make no distinction between any of them, and to God do we submit. -- Islam, Qur'an 3.84\n \n There are righteous men among the nations who have a share in the world to come. -- Judaism, Tosefta Sanhedrin\n \n And Peter opened his mouth and said, \"Truly I believe that God shows no partiality, but in every nation any one who fears him and does what is right is acceptable to him. -- Christianity, Acts 10:34-35\n \n Just as the sin-offering atones for Israel, so righteousness atones for the peoples of the world. -- Judaism, Talmud\n \n Tolerance\n \n To be attached to a certain view and to look down upon other views as inferior - this the wise men call a fetter. -- Buddhism, Sutta Nipata\n \n Like the bee, gathering honey from different flowers, the wise man accepts the essence of different scriptures and sees only the good in all religions. -- Hinduism, Srimad Bhagavatam\n \n A man has a faith. If he says \"This is my faith\", so far he maintains truth. But by that he cannot proceed to the absolute conclusion: \"This alone is truth and everything else is false\". -- Buddhism, Majjhima Nikaya\n\n \n ONE PATH, JESUS (JOHN 14:6, ACTS 4:12, ETC. DO IT BEFORE YOU LEAVE EARTH!", 
   {}, 
   200896, 
   null, 
   1141366860.0
  ], 
  [
   201019, 
   null, 
   "Mach", 
   "Today's science has plenty to do with ethics and morals, concerning things like stem cell researh, cloning, suicide \"rights\" - many medical proceedures. \n\n \n You keep missing the boat. Neither religion nor science are good sources of ethics. Ethics should be freely discussed and considered in a society, that is, people discuss ethics with people. Labeling the source of the ethics is irrelevant. That's like saying if bob made a flag and jim made a flag, and the flags were identical, that bob's was better because bob made it...\n \n \n \n \nSee the eight quotations there. Numbers 1, 2, 4, 5, 6, 7, and 8 are all from atheists. What about number 3? It's from a Christian! You'd think it would be from someone like Billy Graham, Jerry Fallwell, or Pat Robertson, wouldn't you? Why it's from George H.W. Bush, the father of our current REPUBLICAN president!!!! It says; \"as presidental nominee of the Republican party\". \n\n You don't get it. Tradition, irrelevant. Bush being an as*clown, irrelevant. Bush lying to you and the american people, irrelvant. Atheism is a term that means \"non-theist\", or plainly \"without belief in any diety\". Your love of unethical, evil people, is irrelevant to this.\n \n \nHow can you say that atheism and it's twin brother secularism, aren't political? Check out the \"about atheism\" link towards the bottom of the page. Page down there, and you'll see an invitation to \"visit one of their sponsors\". Who is it???? THE NEW YORK TIMES. \n Not political?\n \n\n \n This still looks as if you aren't comprehending the simple fact that \"atheism\" is a label for certain people who lack certain beliefs. Whether some or all of them participate in the political system in a free democratic society, is still, you guessed it, irrelevant.\n \n \nLike so many of the gaps that are faith filled for Darwinian evolution to work?\n\n The fact that the earth revolves around the sun doesn't require you or anyone else to know about it. In fact, it was decarled as heresay to state that, contrary to the theological position of the time that the earth was the center of the universe.\n \n \n So, by your theory, there can be no gaps in knowledge? Sounds like you know everything there is to know?\n \n \nOur everyday lives are filled with concepts.\n\n \n Our every day lives are filled with XXXX too. But we choose to flush it (most of us anyway).\n \n -Mach", 
   {}, 
   200759, 
   null, 
   1141437000.0
  ], 
  [
   201032, 
   null, 
   "marc9000", 
   "No, I gave a perfectly valid example that shows why atheism is not the same as secularism. \n\n \n One event doesn't establish the complexity of worldviews.\n \n \n \nSome theists might agree with the reasoning behind those attempts. Does that mean that theism and atheism are the same? Of course not. (This goes back to the overlap issue, which you apparently cannot grasp.) doG's statements, however valid, do not make your analogy hold. \n\n \n Very few, most of them 'pretend' theists. I've heard that there are a few atheists who financially support Christian music radio. But those are both examples that are so minuscule that they have no bearing on societal trends.\n \n \n \nThe Declaration of Independence has absolutely no legal authority whatsoever. \n\n \n It came first - it was the inspiration for documents that do. If atheists and secularists claim that some rights are unalienable, they can't be AS unalienable as rights that came from a higher source. It shows how atheists and secularists would interpret the constitution in a similar way, differing from Deism and Judeo Christianity.\n \n \n \nI think this might be for another thread. However, it would be good if you could support the bare assertion a bit before it gets approached here or in another thread. \n\n \n You only wish it belonged in another thread, because it so clearly shows how atheists and secularists wouldviews would harmonize, yet differ so starkly from the religion that is prominent in the U.S. \n \n I don't think that assertion needs support - it's obvious to just about anyone who doesn't have a tightly closed mind.\n \n \n \nYou also should stop presenting evolutionary theory inaccurately, but I suppose there's no hope of that. \n\n \n No there's not - atheists and secularists aren't the only ones permitted to present evolutionary theory.\n \n \n \nIs it your position that an atheistic society would grant no rights to anybody?\n See also above. \n\n \n \"ANYBODY\" is an emotional, strong word. It's my position that it would grant fewer rights than the U.S. constitution intends to grant. World history and current events pretty well prove it.\n \n \n \nStart here, first on the morality list. I'll save the trump for later.\n \n \n Is there some point in this comment, or . . . ? \n\n \n Yes there is. Atheists and secularists both seem to embrace FREETHOUGHT. How would one think more freely than the other? Would an atheist think less freely than a secularist? If so why? Would a \"strong\" atheist think less freely than a \"weak\" atheist? Wouldn't there be a bigger difference in the worldview of a strong atheist vs a weak atheist, as opposed to the difference between an average, middle of the road atheist and a secularist? (I guess there couldn't be a \"strong\" or \"weak\" secularist - there couldn't be variations in intensity for drawing a blank) \n \n \n \nIt's evident that you didn't look over their site very well, otherwise you would have seen the link I provided above and not made the comment you did. \n\n \n I did see your link, I'm glad you posted it. I made the comment because of the word freethought. Atheists and secularists are in lockstep on it. \n \n \nEthics is a recognized subcategory of philosophy, so one could argue that discussion of ethics belongs in the philosophy forum. Nevertheless, we'll at least start the ethics conversation here. \n\n \n And philosophy is related to worldviews, like the humanist worldview from the first post. The philosophy of atheists and secularists seems to be very similar, according to American Atheists, religioustolerance, and Freedom from religion foundation, and last but not least, the Humanist Manifesto.\n \n \n \nThe same way atheists worship their televisions, ovens, kitchen sinks, vehicles, etc., because all those things are secular? \n\n \n No - Occam's razor is a philosophy, a concept, a way to think. Televisions, ovens, etc. are not.", 
   {}, 
   200764, 
   null, 
   1141442160.0
  ], 
  [
   201033, 
   null, 
   "marc9000", 
   "You keep missing the boat. Neither religion nor science are good sources of ethics. Ethics should be freely discussed and considered in a society, that is, people discuss ethics with people. Labeling the source of the ethics is irrelevant. That's like saying if bob made a flag and jim made a flag, and the flags were identical, that bob's was better because bob made it...\n\n \n It's relevent to this thread. Ethics, philosophy, worldviews - how they are so similar between atheists and secularists.\n \n \n \n \n \nYou don't get it. Tradition, irrelevant. Bush being an as*clown, irrelevant. Bush lying to you and the american people, irrelvant. Atheism is a term that means \"non-theist\", or plainly \"without belief in any diety\". Your love of unethical, evil people, is irrelevant to this.\n \n \n \n This still looks as if you aren't comprehending the simple fact that \"atheism\" is a label for certain people who lack certain beliefs. Whether some or all of them participate in the political system in a free democratic society, is still, you guessed it, irrelevant. \n\n \n Atheists lack certain beliefs - secularists lack certain beliefs in a very similar way. The point of this thread. Your hatred of Bush - your anger at me - your embarrassment, irrelevent.", 
   {}, 
   201019, 
   null, 
   1141442820.0
  ], 
  [
   201041, 
   null, 
   "trebor", 
   "It's relevent to this thread. Ethics, philosophy, worldviews - how they are so similar between atheists and secularists.\n \n \n \n \n \n \n Atheists lack certain beliefs - secularists lack certain beliefs in a very similar way. The point of this thread. Your hatred of Bush - your anger at me - your embarrassment, irrelevent.\n\n \n \n Well, I can see why you don't like 'freethought', since that involves thinking.\n \n And no.... when something is secular , then for that particular thing, religion is not in the picture , one way or another. There are no 'secularists' as you are saying. There might be people who want to keep religoin out of government, just so the goernment will keep out of religion. Many of those are theists.", 
   {}, 
   201033, 
   null, 
   1141450020.0
  ], 
  [
   201043, 
   null, 
   "DamEtel", 
   "Is there a difference between secularism and atheism? \n\n \n Yes. The US Constitution is secularist, but it's not atheistic.", 
   {}, 
   200276, 
   null, 
   1141450380.0
  ], 
  [
   201056, 
   null, 
   "electrolyte", 
   "I'll skip the rest of your XXXX, even though I'd love to roast it. We'll keep this thread on this topic, and you can get roasted on the topic of your choice in a different thread. This is just getting old.\n \n \nYes there is. Atheists and secularists both seem to embrace FREETHOUGHT.\nAtheists and secularists are in lockstep on [freethought].\n\n Many Deists are freethinkers too.\n \n P1: Some atheists are freethinkers.\n P2: Some secularists are freethinkers.\n P3: Freethinking binds atheists and secularists.\n P4: Some Deists are freethinkers.\n C1: Freethinking binds atheists, secularists, and Deists. (P3, P4)\n \n C2: Some Deists are secularists. (C1)\n P5: All Deists are theists.\n C3: Some secularists are theists. (C2, P5)\n P6: Secularists are atheists. (marc's assertion)\n C4: Some atheists are theists. (C3, P6)\n \n In your zeal to clump atheism and secularism, you've unwittingly included Deism. Then again, in your fantasy world, maybe some atheists can be theists...", 
   {}, 
   201043, 
   null, 
   1141454220.0
  ], 
  [
   201083, 
   null, 
   "Mach", 
   "It's relevent to this thread. Ethics, philosophy, worldviews - how they are so similar between atheists and secularists.\n \n\n \n Yes, they are similar, in that (hopefully) attribute ethics and worldviews, to individual choice, which could be identical to yours, or exactly opposite, it's a CHOICE. You see what I (and others posting) are getting at?\n \n \n \nAtheists lack certain beliefs - secularists lack certain beliefs in a very similar way. The point of this thread. Your hatred of Bush - your anger at me - your embarrassment, irrelevent.\n\n \n Closer. Atheists by definition lack belief in gods and godesses. That is all.\n Secularist is wanting religion to be seperate from government. (you know, like part of the foundation of America)\n \n Bush supports religion IN government, he is anti-secularist, and anti-atheist.\n Bush senior was even quoted as saying :\n \n \"No, I don't know that atheists should be considered as citizens, nor should they be considered patriots. This is one nation under God.\"\n \n --George Herbert Walker Bush, Former U. S. President, 1988.\n \n I see comments like that as entirely evil, and unethical. It's both contrary to the principles of a free democracy, our free democracy, and is founded on ignorance (there is no gods and godesses and santa claus, or easter bunny).\n You are right, if you suggest that persecution, theocracy, and anti-freedom are acceptable, I'll be ticked...and I'd pity those that aren't.\n \n -Mach", 
   {}, 
   201033, 
   null, 
   1141492080.0
  ], 
  [
   201246, 
   null, 
   "marc9000", 
   "Yes. The US Constitution is secularist, but it's not atheistic.\n\n \n That is largely my point. The US Constitution was written before Darwinism, the ACLU, politized science, American Atheists, religioustolerance, and Humanist Manifestos. It was possible for one of the framers of the Constitution to proclaim a national Thanksgiving day with no violation (at that time) of what the Constitution said. The above mentioned groups have succeeding in blending atheism and secularism so that would be no longer possible today.", 
   {}, 
   201043, 
   null, 
   1141593420.0
  ], 
  [
   201251, 
   null, 
   "marc9000", 
   "I'll skip the rest of your XXXX, even though I'd love to roast it. We'll keep this thread on this topic, and you can get roasted on the topic of your choice in a different thread. This is just getting old. \n\n \n You'll \"skip\" it, it's just \"getting old\" now? Only a few posts ago you said you had another \"trump\" for me. emoticon_confused \n \n \n \nMany Deists are freethinkers too.\n \n P1: Some atheists are freethinkers.\n P2: Some secularists are freethinkers.\n P3: Freethinking binds atheists and secularists.\n P4: Some Deists are freethinkers.\n C1: Freethinking binds atheists, secularists, and Deists. (P3, P4)\n \n C2: Some Deists are secularists. (C1)\n P5: All Deists are theists.\n C3: Some secularists are theists. (C2, P5)\n P6: Secularists are atheists. (marc's assertion)\n C4: Some atheists are theists. (C3, P6) \n\n \n Is this your trump? Looks like gibberish to me.\n \n \n \nIn your zeal to clump atheism and secularism, you've unwittingly included Deism. Then again, in your fantasy world, maybe some atheists can be theists...\n\n \n There was nothing unwitting about it. Deism doesn't belive God is in control -secularists aren't convinced that he exists, so their worldviews could be similar. If a Deist of today went to today's science classes, read what the American Atheists, religioustolerance, and Humanist Manifesto's had to say, he could probably be politically swayed much the same way that today's secularist would.", 
   {}, 
   201056, 
   null, 
   1141594200.0
  ], 
  [
   201254, 
   null, 
   "marc9000", 
   "Yes, they are similar, in that (hopefully) attribute ethics and worldviews, to individual choice, which could be identical to yours, or exactly opposite, it's a CHOICE. You see what I (and others posting) are getting at? \n\n \n A choice that's blended together with the contents of things like the Humanist Manifesto. \n \n \n \n \nCloser. Atheists by definition lack belief in gods and godesses. That is all.\n Secularist is wanting religion to be seperate from government. (you know, like part of the foundation of America) \n\n \n \"Secularist wanting religion to be separate from government\" - that's even what the dictionary says about it. It didn't mean that 200 years ago, if it did, there would be no Thanksgiving day. The meaning of the word has changed in 200 years. It is not unusual for a word to change meanings over that period of time. Who inspired the change for this one? Darwinism? Politized science? The ACLU? Organized atheism? If you said a subtle conbination of them all over a long period of time, go to the head of the class.\n \n \nBush supports religion IN government, he is anti-secularist, and anti-atheist.\n Bush senior was even quoted as saying :\n \n \"No, I don't know that atheists should be considered as citizens, nor should they be considered patriots. This is one nation under God.\"\n \n --George Herbert Walker Bush, Former U. S. President, 1988.\n \n I don't agree with it, and I think it's been exagerated / taken out of context.\n \n I see comments like that as entirely evil, and unethical. It's both contrary to the principles of a free democracy, our free democracy, and is founded on ignorance (there is no gods and godesses and santa claus, or easter bunny).\n You are right, if you suggest that persecution, theocracy, and anti-freedom are acceptable, I'll be ticked...and I'd pity those that aren't.\n \n -Mach\n\n \n It's not honest for that website to imply that that phrase represents all of the religion of U.S. tradition.", 
   {}, 
   201083, 
   null, 
   1141594980.0
  ], 
  [
   201274, 
   null, 
   "doG", 
   "\"Secularist wanting religion to be separate from government\" - that's even what the dictionary says about it. It didn't mean that 200 years ago, if it did, there would be no Thanksgiving day.\n\n Yes there would. Thanksgiving was declared a holiday before the Bill Of Rights was added to the Constitution and the Bill Of Rights was not retroactive.", 
   {}, 
   201254, 
   null, 
   1141603320.0
  ], 
  [
   201280, 
   null, 
   "marc9000", 
   "Yes there would. Thanksgiving was declared a holiday before the Bill Of Rights was added to the Constitution and the Bill Of Rights was not retroactive.\n\n \n Sorry.\n \n William Rehnquist\n \nOn the day after the House of Representatives voted to adopt the form of the First Amendment Religion Clauses which was ultimately proposed and ratified, Representative Elias Boudinot proposed a resolution asking President George Washington to issue a Thanksgiving Day Proclamation. Boudinot said he \"could not think of letting the session pass over without offering an opportunity to all the citizens of the United States of joining with one voice, in returning to Almighty God their sincere thanks for the many blessings he had poured down upon them. \n\n \n http://www.belcherfoundation.org/wallace_v_jaffree_dissent.htm", 
   {}, 
   201274, 
   null, 
   1141604460.0
  ], 
  [
   201295, 
   null, 
   "doG", 
   "Sorry.\n William Rehnquist\n http://www.belcherfoundation.org/wallace_v_jaffree_dissent.htm\n\n And as a result of reading your link I see, Washington declared Thanksgiving a holiday on November 26, 1789; a full 2 years before the Bill Of Rights was ratified on December 15, 1791. \n \n Just because the House agreed on the form of the Bill Of Rights did not mean they became law.", 
   {}, 
   201280, 
   null, 
   1141614240.0
  ], 
  [
   201315, 
   null, 
   "electrolyte", 
   "No, the trump had to do with ethics.\n \n Still, the logical argument shows that your reasoning makes atheists and some theists have identical worldviews. This is just plain ridiculous.\n Just because you're incapable of understanding logic doesn't make it gibberish.", 
   {}, 
   201251, 
   null, 
   1141623900.0
  ], 
  [
   201318, 
   null, 
   "DamEtel", 
   "Marc9000, is there a difference between a Christian and a child molesting predator?", 
   {}, 
   201315, 
   null, 
   1141626540.0
  ], 
  [
   201347, 
   null, 
   "simone", 
   "Deists are theists but theist aren't necessarily deists?\n \n Hmmm, and, where do they stand on the issue of treeism?\n \n Any treeists here about?", 
   {}, 
   201318, 
   null, 
   1141663860.0
  ], 
  [
   201381, 
   null, 
   "doG", 
   "Let's not forget noodlists....", 
   {}, 
   201347, 
   null, 
   1141674660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  secularism vs. atheism", 
  "url": "http://www.4forums.com/political/religion-debates/7663-secularism-vs-atheism.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7663, 
  "discussion_files": [
   [
    "14936.html", 
    "http://www.4forums.com/political/religion-debates/7663-secularism-vs-atheism-print.html"
   ], 
   [
    "14937.html", 
    "http://www.4forums.com/political/religion-debates/7663-secularism-vs-atheism-5-print.html"
   ], 
   [
    "14938.html", 
    "http://www.4forums.com/political/religion-debates/7663-secularism-vs-atheism-4-print.html"
   ], 
   [
    "14939.html", 
    "http://www.4forums.com/political/religion-debates/7663-secularism-vs-atheism-3-print.html"
   ], 
   [
    "14940.html", 
    "http://www.4forums.com/political/religion-debates/7663-secularism-vs-atheism-2-print.html"
   ]
  ], 
  "identifier": 7663
 }
]