[
 [
  [
   200590, 
   null, 
   "simone", 
   "Your daughter gets raped and is pregnant. What do you do?\n \n A. Deny it ever happened and join a monastery or convent somewhere in a rabidly Roman Catholic state.\n \n B. Join the campaign against \"Liberal Judges\" who let rapists out of jail too soon-to the distraction of all else.\n \n C. Force daughter to raise child alone. Continually refer to disadvantaged and potentially maladjusted child as \"that bastard.\"\n \n D. Cover self in ashes and scream, \"Why have you forsaken me?\" over and over again.\n \n E. Strongly and repeatedly encourage her current boyfriend to \"do the right thing\" as soon as he's of legal age.\n \n F. Convince daughter she's the new Mother of God and establish a secret conservative sect somewhere in the mountains of Idaho.\n \n G. Smuggle daughter out of South Dakota (or other states when they enact restrictive anti-choice acts now that Alito sits on the Supreme Court) for abortion if she wants that.", 
   {
    "post_info": {
     "post_title": "Multiple Choice"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1141180920.0
  ], 
  [
   200598, 
   null, 
   "Master_Shake", 
   "Because, ya know, those are the only options emoticon_rolleyes", 
   {}, 
   200590, 
   null, 
   1141183500.0
  ], 
  [
   200601, 
   null, 
   "Ooaman", 
   "Your daughter gets raped and is pregnant. What do you do...\n E. Strongly and repeatedly encourage her current boyfriend to \"do the right thing\" as soon as he's of legal age...\n\n I'm confused by this one. You didn't say in the original statement that the boyfriend had anything to do with it. So how would doing \"the right thing\" involve him.", 
   {
    "unicode_changes_made": true
   }, 
   200590, 
   null, 
   1141184220.0
  ], 
  [
   200609, 
   null, 
   "Steeeeve", 
   "Because, ya know, those are the only options emoticon_rolleyes\n\n What are you implying here Shake!!!! How dare you assume that Simone would make a question that is biased in nature...speaking of which, have you stopped beating your wife yet?", 
   {}, 
   200598, 
   null, 
   1141190280.0
  ], 
  [
   200617, 
   null, 
   "daewoo", 
   "Is there a \"Let her have the baby and place it with one of the thousands of waiting adoptive couples so she does not have to raise it, nor does she have to live with the potential guilt issues involved in having an abortion\" option?\n \n Is there an option where I get to hunt the SOB down and beat him to death with a claw hammer?", 
   {}, 
   200609, 
   null, 
   1141194300.0
  ], 
  [
   200621, 
   null, 
   "C. Langana", 
   "Simone: interesting poll, but you do need a few more options. \n I agree with Daewoo though my first reaction as a father would be a little constructive claw-hammer cranial interaction. After that, probably a talk with the daughter to find out what she wants.", 
   {}, 
   200617, 
   null, 
   1141197120.0
  ], 
  [
   200632, 
   null, 
   "Adept", 
   "Simone: interesting poll, but you do need a few more options. \n I agree with Daewoo though my first reaction as a father would be a little constructive claw-hammer cranial interaction. After that, probably a talk with the daughter to find out what she wants.\n\n \n Seconded.\n \n I wouldn't want to make my daughter do anything in this scenario. I'd be careful to explain all her options as free from bias as possible, and then let her choose.", 
   {}, 
   200621, 
   null, 
   1141209360.0
  ], 
  [
   200636, 
   null, 
   "Matthew S", 
   "emoticon_xgood simone \n \n I know that all these options, with exception of the last one, are the one the fundies would trully consider. :) I love the smell of sarcasm in trhe morning :)", 
   {}, 
   200632, 
   null, 
   1141219860.0
  ], 
  [
   200662, 
   null, 
   "simone", 
   "I'm confused by this one. You didn't say in the original statement that the boyfriend had anything to do with it. So how would doing \"the right thing\" involve him.\nI'm not saying it's the \"right thing\" to do, it's just the sort of thing that a desperate father might do to save the reputation of his daughter.\n \n I mean, we live in a Christian nation and we still kind of think, in our heart of hearts, that if a woman or girl is raped IT'S HER FAULT.", 
   {}, 
   200601, 
   null, 
   1141233780.0
  ], 
  [
   200693, 
   null, 
   "Steeeeve", 
   "I'm not saying it's the \"right thing\" to do, it's just the sort of thing that a desperate father might do to save the reputation of his daughter.\n \n I mean, we live in a Christian nation and we still kind of think, in our heart of hearts, that if a woman or girl is raped IT'S HER FAULT.\n\n \n maybe that is just you", 
   {}, 
   200662, 
   null, 
   1141238940.0
  ], 
  [
   200694, 
   null, 
   "Ooaman", 
   "...I mean, we live in a Christian nation and we still kind of think, in our heart of hearts, that if a woman or girl is raped IT'S HER FAULT.\n\n Why is that the belief. If a guy rapes a woman, there is some sort of power thing involved. He isn't interested in her as anything else other than a thing to controll.\n \n Only an idiot would assume that it's automatically her fault.", 
   {}, 
   200662, 
   null, 
   1141239000.0
  ], 
  [
   200706, 
   null, 
   "daewoo", 
   "I mean, we live in a Christian nation and we still kind of think, in our heart of hearts, that if a woman or girl is raped IT'S HER FAULT.\n\n \n You might want to get some help with that. The only people I have ever heard imply such things is feminists. That is really not right. It is time for you folks to understand that if a woman is raped, it is NOT her fault, it is the rapists fault. I don't undestand how you folks can claim to be pro woman, then spread this draconian mindset.", 
   {}, 
   200662, 
   null, 
   1141241100.0
  ], 
  [
   200711, 
   null, 
   "Master_Shake", 
   "What are you implying here Shake!!!! How dare you assume that Simone would make a question that is biased in nature...speaking of which, have you stopped beating your wife yet?\n\n First, I know, I'm deeply sorry for making such an assumption. Second, of course I haven't!", 
   {}, 
   200609, 
   null, 
   1141241640.0
  ], 
  [
   200725, 
   null, 
   "Steeeeve", 
   "First, I know, I'm deeply sorry for making such an assumption. Second, of course I haven't!\n\n \n haha, glad you got the joke....i was a little worried you might now know what the \"beaitng your wife\" thing was.", 
   {}, 
   200711, 
   null, 
   1141246620.0
  ], 
  [
   200745, 
   null, 
   "Bell", 
   "I was kind of wondering recently why many rape victims don't show their faces to the media. Why is it their shame?\n \n \nI wouldn't want to make my daughter do anything in this scenario. I'd be careful to explain all her options as free from bias as possible, and then let her choose.\n\n \n Me, too. I'd probably throw in some counseling as well, just for starters.", 
   {}, 
   200725, 
   null, 
   1141253760.0
  ], 
  [
   200757, 
   null, 
   "JPSartre12", 
   "Is there a \"Let her have the baby and place it with one of the thousands of waiting adoptive couples so she does not have to raise it, nor does she have to live with the potential guilt issues involved in having an abortion\" option?\n \n Is there an option where I get to hunt the SOB down and beat him to death with a claw hammer?\n\n \n Now you're talking. emoticon_xgood emoticon_xkill", 
   {}, 
   200617, 
   null, 
   1141265820.0
  ], 
  [
   200772, 
   null, 
   "hucklebuck", 
   "This question has far too many variables which are not taken into consideration (i.e. the religion of the victim and/or her family, relation to the rapist [stranger, classmate, relative, etc.] as well as his genetic makeup [hereditary diseases, birth defects, etc.], victim's age and mental condition, and on and on).\n \n These must be taken on a case-by-case basis. Though I get the point your trying to make by the answers that were provided.\n \n \nWhy is that the belief. If a guy rapes a woman, there is some sort of power thing involved. He isn't interested in her as anything else other than a thing to controll.\n\n \n Recent studies have shown that this is not always the case: \n \n \"However, in our experience of working with victims and perpetrators of rape we are increasingly observing that large numbers of rapes appear to involve an additional dimension, namely that of feeling entitled to instant gratification and release of sexual energies. To this end, the bodies of women and children are frequently used in a callous and careless way.\"\n http://www.csvr.org.za/articles/artrape2.htm\n \n \nYou might want to get some help with that. The only people I have ever heard imply such things is feminists.\n\n \n Just curious which feminist stated that rape victims are at fault? Googling those key words (rape own fault) I only come across articles disputing this and articles where rapists used this excuse.\n \n \nI was kind of wondering recently why many rape victims don't show their faces to the media. Why is it their shame?\n\n \n Your right, it shouldn't be (their shame). However, there is a such a negative stigma attached to rape victims (they asked for it, I know that guy and there's no way he did that, she's been sexually permiscuous in the past, etc.) that I don't blame a single one of them for not wanting to go public. Not to mention that it is just an incredibly intimate invasion of privacy.", 
   {}, 
   200745, 
   null, 
   1141278300.0
  ], 
  [
   200789, 
   null, 
   "JPSartre12", 
   "....\n \n Just curious which feminist stated that rape victims are at fault? Googling those key words (rape own fault) I only come across articles disputing this and articles where rapists used this excuse. \n\n \n Since you asked, do you remember the support that Clinton received from NOW and other feminist groups after SEVERAL women stepped up and claimed that Clinton sexually assaulted or raped them? Just in case you forgot, here's an excerpt from an article in Feminista entitled \"Why do Feminists Support Clinton?\" \n http://www.feminista.com/archives/v2n11/clinton.html\n \n \n\n And it appears that liberal feminists such as NOW, AAUW, 9-to-5, and The National Women's Political Caucus are more interested in maintaining the power they've managed to shore up over the years than in standing up for women where it counts most. They're afraid of alienating potential members, or losing money, or worst of all, frightening away men. While practical issues are important, at this stage these groups retain so little credibility that it's hard to say what they stand for, or to what purpose one would be donating money if one donated money to them. \n \n There are a few feminists who have prominently spoken out against Clinton and in support of these women. In January 1998, an Andrea Dworkin article against Clinton was printed in the London Guardian. In February 1999, the Dulles VA chapter of the National Organization for Women announced that it was disassociating from the national NOW as a result of NOW's stance on these issues. Gloria Allred, Susan Brownmiller, and Barbara Ehrenreich have spoken out against Clinton. Kim McCarten, the editor of Merge Magazine, has spoken publicly against Clinton, as has Merle Hoffman, editor of the feminist magazine On The Issues. All these women have experienced backlash from liberal feminists as well as liberals in general for doing so. Gloria Allred claimed in a February 1999 program of the Michael Reagan Show that since she spoke out against Clinton, the many requests she was accustomed to receiving from CNN to appear on political talk shows suddenly disappeared altogether. The reason given to her by a booker was that she was anti-Clinton. \n \n Liberal feminism has been disappointing for years in its lack of concentration on the real issues, i.e., patriarchy. NOW and other such organizations appear to have forgotten their raison d'etre. Perhaps it's that power corrupts. Few people can experience it and remember what it's like not to have it, or risk giving it up or having it taken away. That's what perhaps happened with NOW, and all these former feminists who are now selling their souls for Clinton. The future of feminism lies with radical feminists, those who are strong enough and brave enough to name the problem and try to change it rather than work within it.\n\n \n Any other questions?", 
   {}, 
   200772, 
   null, 
   1141313220.0
  ], 
  [
   200807, 
   null, 
   "Bell", 
   "\n Your right, it shouldn't be (their shame). However, there is a such a negative stigma attached to rape victims (they asked for it, I know that guy and there's no way he did that, she's been sexually permiscuous in the past, etc.) that I don't blame a single one of them for not wanting to go public. Not to mention that it is just an incredibly intimate invasion of privacy.\n\n \n I note that these examples, except for the invasion of privacy, imply that the woman is at fault in some way. It's not just simone that thinks this way; it's a subtle slant in societal thinking that people would prefer to pretend isn't there. If you deny it, you're either living in a box or, uh, in denial.", 
   {}, 
   200772, 
   null, 
   1141323540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Multiple Choice", 
  "url": "http://www.4forums.com/political/abortion-debates/7673-multiple-choice.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7673, 
  "discussion_files": [
   [
    "26401.html", 
    "http://www.4forums.com/political/abortion-debates/7673-multiple-choice-print.html"
   ], 
   [
    "26402.html", 
    "http://www.4forums.com/political/abortion-debates/7673-multiple-choice-2-print.html"
   ]
  ], 
  "identifier": 7673
 }
]