[
 [
  [
   200865, 
   null, 
   "jitobear", 
   "Anyone hear about this? I can't decide whether to laugh or be appalled. I particularly find the bolded ludicrous.\n \n http://www.cnn.com/2006/US/03/02/catholic.town.ap/index.html\n \n \nNAPLES, Florida (AP) -- If Domino's Pizza founder Thomas S. Monaghan has his way, a new town being built in Florida will be governed according to strict Roman Catholic principles, with no place to get an abortion, pornography or birth control.\n \n The pizza magnate is bankrolling the project with at least $250 million and calls it \"God's will.\"\n \n Civil libertarians say the plan is unconstitutional and are threatening to sue.\n \n The town of Ave Maria is being constructed around Ave Maria University, the first Catholic university to be built in the United States in about 40 years. Both are set to open next year about 25 miles east of Naples in southwestern Florida.\n \n The town and the university, developed in partnership with the Barron Collier Co., an agricultural and real estate business, will be set on 5,000 acres with a European-inspired town center, a massive church and what planners call the largest crucifix in the nation, at nearly 65 feet tall. Monaghan envisions 11,000 homes and 20,000 residents.\n \n During a speech last year at a Catholic men's gathering in Boston, Monaghan said that in his community, stores will not sell pornographic magazines, pharmacies will not carry condoms or birth control pills, and cable television will have no X-rated channels.\n \n Homebuyers in Ave Maria will own their property outright. But Monaghan and Barron Collier will control all commercial real estate in the town, meaning they could insert provisions in leases to restrict the sale of certain items.\n \n \"I believe all of history is just one big battle between good and evil. I don't want to be on the sidelines,\" Monaghan, who sold Domino's Pizza in 1998 to devote himself to doing good works, said in a recent Newsweek interview.\n \n Robert Falls, a spokesman for the project, said Tuesday that attorneys are still reviewing the legal issues and that Monaghan had no comment in the meantime.\n \n \"If they attempt to do what he apparently wants to do, the people of Naples and Collier County, Florida, are in for a whole series of legal and constitutional problems and a lot of litigation indefinitely into the future,\" warned Howard Simon, executive director of the American Civil Liberties Union of Florida.\n \n Florida Attorney General Charlie Crist said it will be up to the courts to decide the legalities of the plan. \"The community has the right to provide a wholesome environment,\" he said. \"If someone disagrees, they have the right to go to court and present facts before a judge.\"\n \n Gov. Jeb Bush, at the site's groundbreaking earlier this month, lauded the development as a new kind of town where faith and freedom will merge to create a community of like-minded citizens. Bush, a convert to Catholicism, did not speak specifically to the proposed restrictions.\n \n \"While the governor does not personally believe in abortion or pornography, the town, and any restrictions they may place on businesses choosing to locate there, must comply with the laws and constitution of the state and federal governments,\" Russell Schweiss, a spokesman for the governor, said Tuesday.\n \n Frances Kissling, president of the liberal Washington-based Catholics for a Free Choice, likened Monaghan's concept to Islamic fundamentalism.\n \n \"This is un-American,\" Kissling said. \"I don't think in a democratic society you can have a legally organized township that will seek to have any kind of public service whatsoever and try to restrict the constitutional rights of citizens.\"\n", 
   {
    "post_info": {
     "post_title": "Holy holy Florida"
    }
   }, 
   null, 
   null, 
   1141343700.0
  ], 
  [
   200866, 
   null, 
   "Bassman", 
   "So??? If a PRIVATE (re. not government funded) enterprise wishes to incorperate as a town, then so be it!!", 
   {}, 
   200865, 
   null, 
   1141343880.0
  ], 
  [
   200867, 
   null, 
   "jitobear", 
   "So??? If a PRIVATE (re. not government funded) enterprise wishes to incorperate as a town, then so be it!!\n\n \n That is pretty much how I feel about it - it's wahisface's money and as long as I don't gotta live there. I do think its funny tho.....\n \n REALLY FUNNY!", 
   {}, 
   200866, 
   null, 
   1141344060.0
  ], 
  [
   200881, 
   null, 
   "trebor", 
   "So??? If a PRIVATE (re. not government funded) enterprise wishes to incorperate as a town, then so be it!!\n\n \n \n Of course, once it incorporates as a town, it no longer is a 'Private' enterprise.", 
   {}, 
   200866, 
   null, 
   1141350900.0
  ], 
  [
   200916, 
   null, 
   "billsco", 
   "\n \"I believe all of history is just one big battle between good and evil. I don't want to be on the sidelines,\" Monaghan, who sold Domino's Pizza in 1998 to devote himself to doing good works, said in a recent Newsweek interview.\n\n \n He could have made a better pizza. Those things are evil.\n \n That kind of simplistic thinking--either good or evil--is what drives me crazy when trying to discuss anything with Christians.", 
   {}, 
   200881, 
   null, 
   1141395180.0
  ], 
  [
   200917, 
   null, 
   "Matthew S", 
   "Maybe this will open the doors to other types of towns also. If one can create a town that outlaws secularism then one could create a town that outlaws religion too. I would love to see an all Glbt town. How about a town that makes it illegal to be a conservative or a rebublican.\n \n What if a drug store in this town wants to sell condoms? Do some of you, who think this town is a good idea, still hold the belief that they should be able to even though the town makes it illegal? Should they have the right to sell the product they want to?\n \n There is this thread were some of you passionately extolled the notion of governmentless control on business. So I ask if it is a religious reason does that make it suddenly o.k. \n http://www.4forums.com/political/showthread.php?t=7590", 
   {}, 
   200916, 
   null, 
   1141397280.0
  ], 
  [
   200925, 
   null, 
   "simone", 
   "Why I never, never eat Domino's Pizza, besides the fact that the guy doesn't know how to make pizza.\n \n Only in America can a guy get rich putting out a lousy product.", 
   {}, 
   200917, 
   null, 
   1141402020.0
  ], 
  [
   200926, 
   null, 
   "jyoshu", 
   "The thing is, there is nothing they are doing there that any town could not do anyway in the form of laws and city ordinances. There are lots of towns where pornography is not allowed to be sold in the city limits. Cities and towns have quite a bit of latitude regarding what their ordinanances allow and disallow. I wouldn't want to live there either, but I see it no differently than laws and ordinances of other towns. Heck, New Yorkers aren't allowed to use a cell phone while driving and it's illegal to light up a smoke inside ANY building in many cities.", 
   {}, 
   200917, 
   null, 
   1141402080.0
  ], 
  [
   200930, 
   null, 
   "trebor", 
   "Why I never, never eat Domino's Pizza, besides the fact that the guy doesn't know how to make pizza.\n \n Only in America can a guy get rich putting out a lousy product.\n\n \n \n He doesn't own it anymore.. he made his buck and left.\n \n If he wants to waste money on this.. well, I bet the legalities will only go so far before he abandons the effort.", 
   {}, 
   200925, 
   null, 
   1141403880.0
  ], 
  [
   200932, 
   null, 
   "billsco", 
   "Ya know, let them experiment. I predict a colossal train wreck for this latest utopian pipedream. I can't wait to read about the town police breaking down the door of an unsuspecting resident because their monitors registered a visit to an \"inappropriate\" web site.", 
   {}, 
   200926, 
   null, 
   1141404360.0
  ], 
  [
   200938, 
   null, 
   "emoreno2292", 
   "I think it's great.\n Let the Catholics go to their own towns. If it's what they want to do with their money and energies, so be it. That's the beauty of living in this country, is that you can do stuff like this.\n Of course, whether or not this comes to fruition is up for grabs, but still, it's the thought that counts, I guess.", 
   {}, 
   200932, 
   null, 
   1141407600.0
  ], 
  [
   200957, 
   null, 
   "trebor", 
   "I think it's great.\n Let the Catholics go to their own towns. If it's what they want to do with their money and energies, so be it. That's the beauty of living in this country, is that you can do stuff like this.\n Of course, whether or not this comes to fruition is up for grabs, but still, it's the thought that counts, I guess.\n\n \n \n As long as they don't get state aid, or federal aid, I am ok with it.", 
   {}, 
   200938, 
   null, 
   1141414800.0
  ], 
  [
   200991, 
   null, 
   "jim's trucking", 
   "Pizza magnate modifies plans for Fla. town\n Copyright © 2006 AP Online \n Last updated Friday, March 3rd, 2006\n By BRIAN SKOLOFF, Associated Press Writer\n \n WEST PALM BEACH, Fla. (AP) - Domino's Pizza founder Thomas S. Monaghan, who is helping to bankroll the birth of a Florida town and university, backtracked Friday from comments that he'd like the community to be governed by strict Roman Catholic principles.\n \n His ideas about barring pornography and birth control, he said, apply only to the Catholic university.\n \n \"There are a lot of misconceptions,\" Monaghan said Friday. \n Both the town of Ave Maria and its Ave Maria University, the first Catholic university to be built in the United States in four decades, are set to open next year about 25 miles east of Naples in southwest Florida.\n \n Monaghan's comments Friday contrasted with statements he made last year to a Catholic men's group in Boston that pornographic magazines won't be sold in town, pharmacies won't carry condoms or birth control pills, and cable television will carry no X-rated channels.\n \n \"I would say I just misspoke,\" Monaghan said Friday in an interview with The Associated Press. \"The town will be open to anybody.\"\n \n Monaghan had declined to comment earlier in the week, while his attorneys were reviewing legal issues surrounding his original ideas. \n \n The American Civil Liberties Union of Florida had said it would sue if the proposals were instituted. Florida Attorney General Charlie Crist said he saw nothing in Monaghan's proposals that violated state law. \n \n The town is being developed through a 50-50 partnership with the Barron Collier Co., an agricultural and real estate firm. Barron Collier and Monaghan will control all commercial real estate. \n \n The town will not allow adult bookstores or topless clubs. However, it will merely suggest, not prohibit, businesses from selling adult magazines or contraceptives.\n \n \"We are not going to censor any of that information, but in deference to Ave Maria University, we are going to request that they not sell that merchandise but we are not restricting,\" said Barron Collier chief executive Paul Marinelli. \n \"The misconception we're trying to clarify is that this is not going to be a strictly Catholic town. ... I think it would be boring if in fact it was all Catholic,\" Marinelli said. \n \n He said the town would welcome \"synagogues as well as Baptist churches.\" \n Barron Collier executive Blake Gable said homosexuals will be welcome despite the church's belief that homosexuality is a sin.\n \n Also contrary to Monaghan's earlier statements, the town will not restrict cable television programming.\n \n Marinelli said the town, expected to attract 25,000 residents, will offer affordable and extravagant housing, including seven different communities for groups from seniors to young families.\n \n \"We're just trying to create an environment where children will be safe on the streets, where they can ride their bikes and play ball in the park,\" he said. \"We're truly just trying to create a town with traditional values.\"\n \n \n http://www.tri-cityherald.com/24hour/nation/v-special/story/3216356p-11932679c.html", 
   {
    "post_info": {
     "post_title": "How quickly things change!"
    }
   }, 
   200957, 
   null, 
   1141427460.0
  ], 
  [
   201012, 
   null, 
   "johnson", 
   "\"We're just trying to create an environment where children will be safe on the streets, where they can ride their bikes and play ball in the park,\" he said. \"We're truly just trying to create a town with traditional values.\"\n \n \n I wonder if this is the same environment to be created that surrounded thousands of American families whose children were sexually abused by those befor who just wanted to create \" a safe enviornment \" \" with traditional values \" ? We can all hope for change ! However if we can't recognize what needs changed ... We'll continue to create the same sorts of \" traditional values \"", 
   {}, 
   200991, 
   null, 
   1141435200.0
  ], 
  [
   201016, 
   null, 
   "Mach", 
   "Anyone hear about this? I can't decide whether to laugh or be appalled. I particularly find the bolded ludicrous.\n \n http://www.cnn.com/2006/US/03/02/catholic.town.ap/index.html\n\n \n Aye. Let's applaud a mini-theocracy...hooray for the opposite of free democracy.\n \n -Mach", 
   {}, 
   200865, 
   null, 
   1141436400.0
  ], 
  [
   201088, 
   null, 
   "simone", 
   "\"We're just trying to create an environment where children will be safe on the streets, where they can ride their bikes and play ball in the park,\" he said. \"We're truly just trying to create a town with traditional values.\"\n \n \n I wonder if this is the same environment to be created that surrounded thousands of American families whose children were sexually abused by those befor who just wanted to create \" a safe enviornment \" \" with traditional values \" ? We can all hope for change ! However if we can't recognize what needs changed ... We'll continue to create the same sorts of \" traditional values \"\nGood point, Johnson.\n \n I grew up in a rural state with \"traditional values.\" Only my father's eagle-eyed watch over me kept me from being molested by these wonderful \"traditional values\" people--and that was almost 50 years ago.\n \n Ptah! upon your \"traditional values!\" It's a big fat lie!", 
   {}, 
   201012, 
   null, 
   1141492980.0
  ], 
  [
   201138, 
   null, 
   "johnson", 
   "Good point, Johnson.\n \n I grew up in a rural state with \"traditional values.\" Only my father's eagle-eyed watch over me kept me from being molested by these wonderful \"traditional values\" people--and that was almost 50 years ago.\n \n Ptah! upon your \"traditional values!\" It's a big fat lie!\n\n \n \n And the lie will continue as long as people continue to lie to them selves.\n \n At some point someone needs to stand and simply say ... \n \n THE EMPEROR HAS NO CLOTHES !!!", 
   {}, 
   201088, 
   null, 
   1141512780.0
  ], 
  [
   201141, 
   null, 
   "Tastyfish", 
   "That's what happens when you take God out of peoples lives; drug dealers, pregnant teens and naked monarchs...", 
   {}, 
   201138, 
   null, 
   1141514880.0
  ], 
  [
   201144, 
   null, 
   "DamEtel", 
   "That's what happens when you take God out of peoples lives; drug dealers, pregnant teens and naked monarchs...\n\n \n After having rejected God, I started having sex with sheep. Oh, began having sex with my mother and brother too, as well as having started to kill pregnant women and eat their unborn babies for breakfast. I also kick little puppies in the stomach til they die, hack the legs off of kitty cats, and con the elderly out of their life savings.", 
   {}, 
   201141, 
   null, 
   1141516260.0
  ], 
  [
   201166, 
   null, 
   "johnson", 
   "After having rejected God, I started having sex with sheep. Oh, began having sex with my mother and brother too, as well as having started to kill pregnant women and eat their unborn babies for breakfast. I also kick little puppies in the stomach til they die, hack the legs off of kitty cats, and con the elderly out of their life savings.\n\n \n You seem a little tense,.. perhaps you should lay off the sex with farm animals and family members !!", 
   {}, 
   201144, 
   null, 
   1141533240.0
  ], 
  [
   201233, 
   null, 
   "simone", 
   "ROFL!!!! Ok, dang it!!! Johnson and DamEtal, stop the comedy routine!\n \n DamEtal, don't feed any more straight lines to Johnson!\n \n THE MAN CANNOT BE TRUSTED!!!!", 
   {}, 
   201166, 
   null, 
   1141585500.0
  ], 
  [
   201234, 
   null, 
   "simone", 
   "That's what happens when you take God out of peoples lives; drug dealers, pregnant teens and naked monarchs...\nMy eagle-eyed father had, early in his life, taken God out of his life because he was soooo aware of the evil of those who were religious and, in good ol' religious traditionalist South Dakota, he was well aware that he had to be constantly vigilant on behalf of the safety of his daughter.", 
   {}, 
   201141, 
   null, 
   1141585620.0
  ], 
  [
   201242, 
   null, 
   "Easyrider", 
   "My eagle-eyed father had, early in his life, taken God out of his life because he was soooo aware of the evil of those who were religious and, in good ol' religious traditionalist South Dakota, he was well aware that he had to be constantly vigilant on behalf of the safety of his daughter.\n\n \n Really? What teaching of Christ did he find offensive and threatening? Maybe he should have found a decent church and discovered God was a protector instead (Psalm 91).", 
   {}, 
   201234, 
   null, 
   1141593180.0
  ], 
  [
   201253, 
   null, 
   "johnson", 
   "Really? What teaching of Christ did he find offensive and threatening? Maybe he should have found a decent church and discovered God was a protector instead (Psalm 91).\n\n \n I don't think it was the teachings, ... It was the teachers !", 
   {}, 
   201242, 
   null, 
   1141594860.0
  ], 
  [
   201270, 
   null, 
   "DamEtel", 
   "I don't think it was the teachings, ... It was the teachers !\n\n \n \"By their fruits ye shall know them\"\n \n [Aleshire, Lonny \"Joe\", Rev.]\n SENTENCED\n 7 years: Rev. Lonny \"Joe\" Aleshire, Jr., 35, Hebron, OH, pleaded guilty to rape, 6 counts of unlawful sexual conduct with a minor, & 3 counts of sexual imposition. The associate pastor at Licking Baptist Church in Hebron admitted to sexually abusing 2 sisters, now 16 & 17, who were his parishioners. He was charged with having sexual relations with the younger sister, and with raping the older sister in 2004. His father is head pastor of the church.\n Source: Newark Advocate 11/29/2005\n (Freethought Today, Vol. 23, No. 2, March 2006)\n \n \n [Arflack, Gregory A., Chaplain (Capt.)]\n SENTENCED\n 5 years: Chaplain (Capt.) Gregory A. Arflack, 44, Owensboro, KY, pleaded guilty to forcible sodomy, indecent acts, fraternization, and conduct unbecoming an officer. The Roman Catholic priest, who works under the jurisdiction of the Owensboro Diocese, also received a dishonorable discharge and forfeiture of all pay and allowances. He was charged with sodomizing and physically assaulting 3 soldiers at the US army base in Bamsberg, Germany, in July 2005, and making sexual comments to 3 other soldiers in Doha, Qatar, in June 2004. The Archdiocese for the Military Services said it would remove its endorsement for Arflack, which the army requires for all Roman Catholic chaplains. The Owensboro Diocese said it would continue his suspension but would not make further decisions on his status until after his sentence is completed. \n The soldiers in Bamberg, ages 18, 19, and 20, testified that they now suffer psychologically as a result of the incidents: one solider cannot sleep or concentrate, the 2nd drinks heavily and bangs his head against walls, and the 3rd buns parts of his arm with a lighter.\n Sources: Stars & Stripes 11/03/2005, Lexington Herald-Leader 11/02/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Bass, Curtis, Rev.]\n SENTENCED\n 10 years: Rev. Curtis Bass, 53, Houston, TX, for 2 counts of indecency with a child. The pastor of the International Pentecostal Church in Aldine was convicted of sexually abusing a girl, then 16, in 1994.\n Source: Forth Worth Star-Telegram 07/30/2005\n (Freethought Today, Vol. 22, No. 7 September 2005)\n \n \n [Behan, James J., Rev.]\n SENTENCED\n 12 years probation: Rev. James J. Behan, 61, Philadelphia, PA, pleaded guilty to involuntary deviate sexual intercourse & corruption of minors. The priest is a member of the Oblates of St. Francis de Sales religious order, and is the only priest in Philadelphia charged since the church abuse scandal broke out in 2002. He was charged with sexually abusing a male student, 15, in 1978-1980 when he taught religion at Northeast Catholic High School for boys. Behan has been barred from public ministry & now works at a Maryland home for elderly priests.\n Source: Times Leader 12/09/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Buzanowski, Donald]\n CONVICTED\n 2 felony counts of child sex assault: Donald J. Buzanowski, 62, Green Bay, WI, for molesting a boy, 10, at Ss. Peter & Paul Catholic School in 1988. The ex-priest, who was defrocked in March, wrote in a 2003 letter to a pastor admitting to abusing 14 boys. He is named in a suit that accuses the Diocese of Green Bay of concealing abuse allegations against him. The suit was previously dismissed but the state court of appeals reversed the decision.\n Source: Milwaukee Journal Sentinel 07/28/2005\n (Freethought Today, Vol. 22, No. 7 September 2005)\n \n [Buzanowski, Donald]\n SENTENCED\n 32 years: Donald Buzanowski, 62, Green Bay, WI, for 2 counts of 1st-degree sexual assault of a child. Buzanowski, a former Catholic priest who was laicized this year, was convicted of sexually assaulting a boy, 10, in 1988. The boy was a student at Ss. Peter & Paul Catholic School in Green Bay. Buzanowski has admitted to molesting 14 other boys between 1969-1988. Said the victim: \"Not only is Donald Buzanowski guilty of sexually assaulting me, he's guilty of murdering my spirit, murdering my soul.\"\n Source: Green Bay Press-Gazette 09/17/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Dollar, John & Linda]\n SENTENCED\n 15 years: John & Linda Dollar, Citrus County, FL, pleaded no contest to 5 counts of aggravated child abuse involving their 5 children, ages 13-17. The Baptist couple admitted to abusing their children: \"We are firm believers in the God almighty ... because of those principles, we were led to do certain things.\" The abuse included pulling out the children's toenails with pliers, starving them, & shocking them with a cattle prod. They previously operated a private Christian school in Tennessee. \n Source: St. Petersburg Times 9/15/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Domelle, Donald, Rev.]\n SENTENCED\n 15 years to life: Rev. Donald Domelle, 65, Salinas, CA, pleaded guilty to forcible oral copulation & lewd and lascivious acts upon a child. The pastor of the Baptist Temple of Salinas was convicted of sexually abusing 2 girls. The 1st girl, a relative, was abused at age 13 in 1993. When she told her family about the abuse, they sent here away to a school in Texas. The 2nd girl, then 15, was a mentally disabled parishioner.\n Source: Salinas Californian 01/20/2006 \n (Freethought Today, Vol. 23, No. 2, March 2006)\n \n \n [Enersen, Robert, Rev.]\n SENTENCED\n 18 years prison & 10 years probation: Rev. Robert Enersen, 54, Douglas, AZ, pleaded guilty to 3 counts of lewd molestation. He admitted sexually abusing a boy, 6, in 1996 while conducting youth services at New Life Assembly of God in Wahneta, FL. He was pastor of the First Assembly of God Church in Douglas at the time of his arrest.\n Source: Daytona Beach News-Journal 08/14/2005\n (Freethought Today, Vol. 22, No. 8, October 2005)\n \n \n [Fernandes, Stephen, Rev.]\n SENTENCED\n 8 months: Rev. Stephen Fernandes, 55, New Bedford, MA, pleaded guilty to possessing hundreds of computer images of child pornography, & to coercing a boy, 16, into filming himself performing a sex act. The priest was suspended from Our Lady of Fatima Church. \n Source: USA Today 11/29/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Fushek, Dale, Msgr.]\n Msgr. Dale Fushek, 53, Phoenix, AZ: 3 counts of assault, 5 of contributing to the delinquency of a minor, & 2 of indecent exposure. The vicar general of the Diocese of Phoenix, which is the highest-ranking poisition next to the bishop, was charged with molesting 7 young men and boys from 1984-1994 at St. Timothy's Catholic Church in Mesa. He was placed under house arrest and must wear an electronic monitoring ankle bracelet. He was ordered to surrender his passport and not have contact with anyone under 18. He resigned as pastor of St. Timothy's in April following allegations of sexual impropieties in 1985. \n Source: Waukegan News Sun 11/22/2005\n (Freethought Today, Vol. 22 No. 10, December 2005)\n \n \n [Graham, Thomas, Rev.]\n CONVICTED\n Sodomy: Rev. Thomas Graham, 71, St. Louis, MO, for sexually abusing a teen boy in the rectory of St. Louis' Old Cathedral in the 1970s. \n Source: Wisconsin State Journal 09/02/2005\n (Freethought Today, Vol. 22, No. 8, October 2005)\n \n [Graham, Thomas, Rev.]\n SENTENCED\n 20 years: Rev. Thomas Graham, 72, St. Louis, MO, for sodomizing a boy in a church rectory in the 1970s. He was a Roman Catholic Priest,\n Source: Rocky Mountain News 11/18/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Hammons, Duane]\n SENTENCED\n 180 days jail & 10 years community supervision: Duane Hammons, 47, San Antonio, TX, for 4 counts of sexual assault of a child & 2 counts of indecency with a child by contact. The preacher of Alta Joy Temple was charged with sexually assaulting a girl, 15, beginning in 1992. He is expected to be reindicted on charges of sexually assaulting his goddaughter when she was age 12.\n Sources: San Antonio Express-News 07/28/2005, KSAT 07/27/2005\n (Freethought Today, Vol. 22, No. 7 September 2005)\n \n \n [Hardesty, Jeffrey]\n SENTENCED\n 10 years jail & 10 years extended supervision: Jeffrey Hardesty, 26, Arpin, WI, for 3 counts of 2nd-degree sexual assault of a child. The youth group leader at First Presbyterian Church in Arpin must attend sex offender treatment, cannot have contact with anyone younger than 18, and must pay a $574 fine. He was convicted of sexually assaulting a girl from the church youth group. \n Source: Wisconsin Rapids Daily Tribune, 01/17/2006\n (Freethought Today, Vol. 23, No. 2, March 2006)\n \n \n [Harris, Michael Anthony, Rev.]\n SENTENCED\n 2 years & 10 1/2 months: Rev. Michael Anthony Harris, 43, Pensacola, FL, pleaded no contest to a 3rd-degree felony of attempted lewd or lascivious battery & using a computer to solicit the sexual conduct of a crime. The Lutheran minister was arrested after he attempted to solicit sex from a \"boy\", 14, over the Internet. The boy was actually an undercover officer.\n Source: South Florida Sun-Sentinel 12/29/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Hill, Danny O., Rev.]\n SENTENCED\n 4 years jail & 2 years probation: Rev. Danny O. Hill, 54, Gibson City, IL, for 2 counts of criminal sexual assault involving a girl whom he sexually abused for 6 years, beginning when she was age 14 until last year. One of the assaults occurred when she was sedated, recovering from injuries received in a traffic accident. Hill, a Baptist minister at local churches, must pay $2,640 for the victim's counseling, along with court costs, a Crime Stoppers fee, & probation fees. \n Sources: Pantagraph 11/01/2005 & 11/02/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Holthus, James Michael, Rev.]\n Rev. James Michael Holthus, 51, Lake Crystal, MN: 1st-degree criminal sexual conduct & 3rd-degree criminal sexual conduct. The pastor at Trinity Lutheran Church was charged with sexual misconduct with a boy from age 13-16, ending in 2002. The boy & his family had attended the church, whose congregants are starting a legal defense fund for Holthus. \n Source: Duluth News Tribune 11/15/2005\n \n \n [Icenogle, Victor A., Rev.]\n SENTENCED\n 3 life terms: Rev. Victor A. Icenogle, 49, San Antonio, TX, for 3 counts of aggravated sexual abuse. Two of the charges involved a girl, 8, and the 3rd involved a girl, 3. The pastor of the now-defunct Promised Land Church will serve the sentences concurrently and must register as a sex offender for the rest of his life. In 1991, he was convicted of aggravated sexual assault of 2 girls in Florida.\n Source: San Antonio Express-News 11/05/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Johnson, Danny \"Warren\", Rev.]\n SENTENCED\n 2 years supervised probation: Rev. Danny \"Warren\" Johnson, 37, Baton Rouge, LA, pleased guilty to misdemeanor stalking. The pastor of Gospel Light Baptist Church, who has since left, was originally accused of having sex with a girl age 14-16 in 1997-98, but due to a plea bargain did not face trial on those charges. He was ordered to have no contact with the girl or her family, must get psychiatric treatment, & must pay up to $100 a week for the girl's counseling. \n Source: Advocate 11/11/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Klep, Frank, Rev.]\n SENTENCED\n 1 year: Rev. Frank Klep, 62, Melbourne, Australia, pleaded guilty to 14 counts of indecently assaulting boys under age 16. He was sentenced to 3 years but 2 years were suspended. The priest sexually abused boys as young as 12 at Salesian Orders School at Sunbury from 1973-1979. The victims were mostly sick boys who were in the school's infirmary, of which he had been in charge.\n Source: The Australian 12/16/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [LeBrun, Paul, Rev.]\n CONVICTED\n 3 counts of sexual conduct with a minor and 4 counts of child molestation: Rev. Paul LeBrun, 49, West Valley, AZ, for sexually abusing 6 boys, age 11-13, from 1986-1991. The abuse occurred at St. Vianney Chruch in Avondale & Blessed Sacrament Church in Tolleson. The Catholic priest & youth minister was charged in 2003 & barred from handling priestly duties in 1999. During the trial, 4 victims from Indiana testified that they were abused by LeBrun from 1979-1986 before the Holy Cross order transferred LeBrun to Arizona.\n Source: AZ Republic, 11/18/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n [LeBrun, Paul, Rev.]\n SENTENCED\n 111 years: Rev. Paul LeBrun, 49, Phoenix, AZ, for child molestation. The Roman Catholic priest was convicted of sexually abusing boys from 1986-1991. He was removed from public ministry in 1999.\n Source: LA Times 01/14/2006\n (Freethought Today, Vol. 23, No. 2, March 2006)\n \n \n [Liberatore, Albert, Jr., Rev.]\n SENTENCED\n 10 years probation: Rev. Albert Liberatore Jr., 41, Scranton, PA, pleaded guilty to attempted sexual abuse. He admitted to molesting an altar boy in 2002 during an overnight trip to New York City. He had earlier pleaded guilty in Pennsylvania to sexually assaulting the boy and was sentenced to 5 years probation. He was removed from the Sacred Heart of Jesus Church in Duryea.\n Source: NY Times 08/10/2005\n (Freethought Today, Vol. 22, No. 7 September 2005)\n \n \n [Nash, Michael Patrick]\n REMOVED/RESIGNED\n Michael Patrick Nash, Juneau, Alaska, was dismissed from the Catholic priesthood. In 2002, a man filed a formal abuse complaint with the Diocese of Juneau, saying he was abused by Nash from 1979-82 from age 11-15. The diocese acknowledged the man had \"suffered grave harm at the hands of Mr. Nash\", & will pay a $175,740 settlement. After the allegations became public, more men came forward saying they were abused by Nash. As part of the dismissal agreement, Nash will receive retirement benefits. The diocese agreed to help the man fight what it called an \"unjust lawsuit\" brought by Nash, who claimed defamation.\n Source: AP 01/02/2006\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Oatis, John, Rev.]\n SENTENCED\n 4 years: Rev. John Oatis, Racine, WI, for raping a girl, 15, at Holy Jerusalem Church of God 11 years ago.\n Source: Wisconsin State Journal 10/08/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Paterson, Mark, Rev.]\n CONVICTED\n Indecent assault: Rev. Mark Paterson, 47, Aberdeen, UK, for assaulting a woman at Aberdeen University over a period of 2 years. The Catholic monk had worked at the university's Chaplaincy Center.\n Source: BBC News 01/17/2006\n (Freethought Today, Vol. 23, No. 2, March 2006)\n \n \n [Perdue, Daniel Eric, Rev.]\n SENTENCED\n 5 consecutive 1-5 years jail & 5 years probation: Rev. Daniel Eric Perdue, 36, Madison, WV, pleaded guilty to 5 counts of felony 3rd-degree sexual assault, involving 2 boys between 2003-2004. The minister must register as a sex offender.\n Source: AP 09/16/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Prall, Henry, Rev.]\n CONVICTED\n Soliciting a minor to commit indecent acts, 4th-degree criminal sexual conduct, & furnishing alcohol to a minor: Rev. Henry Prall, 40, Ocqueoc Township, MI, for indecent acts involving a minor, 14. \n Source: Alpena News 09/03/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Rader, Dennis L.]\n SENTENCED\n 10 consecutive life terms: Dennis L. Rader, 60, Wichita, KS, pleaded guilty to murdering 10 people as the BTK serial killer. The Cub Scout leader and council president of the Christ Lutheran Church quote Scripture during his sentencing. Rader had hidden some of his torture tools in a church shed, and stole money from the church. In one murder, he took photos of his victim in bondage positions inside the church.\n Source: NY Times 08/19/2005\n (Freethought Today, Vol. 22, No. 8, October 2005)\n \n \n [Roelke, Russell F.]\n CONVICTED\n Using a computer to facilitate a sex crime & possessing child pornography: Russell F. Roelke, 45, West Bend, WI, pleaded guilty to soliciting sex from a \"boy\", 14, who was actually an undercover officer. He [Roelke] was director of youth & children's ministries at Fifth Avenue United Methodist Church. Before that, he was an assistant scoutmaster in Milwaukee.\n Source: Milwaukee Journal Sentinel 12/22/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Schara, Jerald W., Rev.]\n CHARGED [AND CONFESSED]\n Rev. Jerald W. Schara, 64, Mazomanie, WI: possessing child pornography. The pastor of St. John Lutheran Church was charged after a computer technician found sexually explicit images of children on his computer. He admitted getting the pictures online and said that he copied some onto CDs and DVDs. He was ordered to have no unsupervised contact with girls and not to use a computer. He has been suspended. Source: Wisconsin State Journal 11/16/2005\n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Smith, Steven G., Rev.]\n CONVICTED\n Sexual assault: Rev. Steven G. Smith, Irving, TX, for using his position as pastor to sexually exploit at least 3 female congregants. The unnamed nondenominational church is run out of his home. The women said he used the bible to excuse his actions, sometimes threatening them by saying he would commit suicide, & telling them he needed the sexual relationships because his own marriage was lacking. \n Source: Dallas News 09/30/2005 \n (Freethought Today, Vol. 22, No. 10, December 2005)\n \n \n [Toohey, Jerome F., Jr., Rev.]\n CONVICTED\n Sexual abuse: Rev. Jerome F. Toohey Jr., 59, Baltimore, MD, pleaded guilty to sexually abusing a student for 6 months in 1987. Toohey was then priest & chaplain as Calvert Hall College, a boys' school The Catholic Priest was stripped of this duties in 1993 after he was accused of abusing another boy, a student at John Carroll School in Bel Air, in the 1980s. Last year, Calvert Hall staff acknowledged in a letter to parents & alumni that 2 former students said they were abused by another staff member, Brother Geffrey Xavier, who died in 1984.\n Source: Baltimore Sun 11/09/2005\n (Freethought Today, Vol. 23, No. 1 January/February 2006)\n \n \n [Wells, Eddie, Rev.]\n SENTENCED\n 4 concurrent 50-year terms: Rev. Eddie Wells, 48, Matthews, MO, for aggravated sexual assault of a child. The pastor of the nondenominational Matthews Christian Church admitted to sexually abusing his stepdaughter from 1989-1992 when she was age 9-12. The abuse took place in Midland, TX, after which Wells took his family and fled to escape an investigation by the state Child Protective Services agency.\n Sources: mywesttexas.com 07/21/2005, San Antonio Express-News 07/18/2005\n (Freethought Today, Vol. 22, No. 7 September 2005)\n \n \n [Wright, Nelson Lynn, Rev.]\n CONVICTED\n Importuning: Rev. Nelson Lynn Wright, 42, Ravenna, OH, pleaded guilty to attempting to solicit 2 'girls' over the internet for sex. The girls were actually undercover officers. Wright was senior pastor of Lighthouse Community Church, and had also been a youth pastor. Similar charges have been filed against him in another country.\n Source: Kent Record-Courier 12/21/2005\n (Freethought Today, Vol. 23, No. 2, March 2006)", 
   {
    "unicode_changes_made": true
   }, 
   201253, 
   null, 
   1141601460.0
  ], 
  [
   201288, 
   null, 
   "johnson", 
   "Prov. 26:11\n \" as a dog returneth to his vomit, so a fool returneth to his folly, \" \n \n Jeremiah 23:16\n \" Thus saith the Lord of hosts, hearken not unto the words of the prophets that prophesy unto you; they make you vain: they speak a vision of their own hearts. <\n \n Hosea 4:7\n \" The more of you priests there are, the more you sin aginst me. \"", 
   {}, 
   201270, 
   null, 
   1141608600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Holy holy Florida", 
  "url": "http://www.4forums.com/political/religion-debates/7682-holy-holy-florida.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7682, 
  "discussion_files": [
   [
    "16446.html", 
    "http://www.4forums.com/political/religion-debates/7682-holy-holy-florida-print.html"
   ], 
   [
    "16447.html", 
    "http://www.4forums.com/political/religion-debates/7682-holy-holy-florida-2-print.html"
   ]
  ], 
  "identifier": 7682
 }
]