[
 [
  [
   201424, 
   null, 
   "Steeeeve", 
   "http://www.townhall.com/opinion/columns/jonahgoldberg/2006/02/22/187398.html\n \n This article implies that the democrats are switching their views on the idea of the living constitution when it suits itself. This should be to no surprise because if the constitution were a living document then it could \"fake its own death\" as the article says. Interesting read if you get a chance", 
   {
    "post_info": {
     "post_title": "Constitution: Living or Not?"
    }
   }, 
   null, 
   null, 
   1141683000.0
  ], 
  [
   201479, 
   null, 
   "beervolcano", 
   "The constitution is \"living\" in that it can be amended.\n It was also written in vague enough terms in places to be interpreted to suit the times. \n Breathing, not so much....\n \n But there are many instances that people have recorded of the \"Originalists\" using what they think the Framers intended, but only when it suits them.\n http://federalism.typepad.com/crime_federalism/2005/06/scalias_origina.html\n \n Yikes, and the article is by Jonah Goldberg....yeesh. never mind.", 
   {}, 
   201424, 
   null, 
   1141700760.0
  ], 
  [
   201480, 
   null, 
   "Ooaman", 
   "Living...Maybe, possibly yes.\n \n Able to be understood by the common person...In your dreams.", 
   {}, 
   201479, 
   null, 
   1141701000.0
  ], 
  [
   201494, 
   null, 
   "Kronus", 
   "http://www.townhall.com/opinion/columns/jonahgoldberg/2006/02/22/187398.html\n \n This article implies that the democrats are switching their views on the idea of the living constitution when it suits itself. This should be to no surprise because if the constitution were a living document then it could \"fake its own death\" as the article says. Interesting read if you get a chance\n\n \n Just a minor point. That's not an article, it's an editorial. The difference is that articles are, in theory, supposed to present facts. Editorials exist simply to express opinions, and are under no obligation to be truthful. For example, your editorial says \"If you recall, the \"living Constitution\" is the notion that the meaning of the Constitution changes over time.\" That definition is certainly convienient for the author, but it's not a good, which is to say accurate, definition. A more accurate take would be to say that the interpretation of the Constitution must take modern reality into account. \n \n A simple example of this is \"the right to bear arms\". 200 years ago arms were cumbersome things, not very accurate, and very, very slow. Today you could kill 100 people in a minute if they were packed in closely enough. The fact that the definition of \"arms\" has changed since the Constitution was written justifies reinterpreting the phrase \"right to bear arms\". Similarly, other defintions, concepts and assumptions have changed in the last 200 years. To pretend this isn't so when reading the Constitution is to deny reality.", 
   {}, 
   201424, 
   null, 
   1141704600.0
  ], 
  [
   201505, 
   null, 
   "Steeeeve", 
   "But there are many instances that people have recorded of the \"Originalists\" using what they think the Framers intended, but only when it suits them.\n http://federalism.typepad.com/crime_...s_origina.html\n While I disagree with their assessment of the ruling, I find this to be irrelevant to the thread. Living and breathing would refer to the idea that Breyer, Kennedy, Ginsburg, etc hold. The idea that the constitution morphes over time to meet the needs of a \"maturing society\"....of course the judges decide that.\n \n A dead constitution is changed by amending and means what it meant at the time of adoption.", 
   {}, 
   201494, 
   null, 
   1141708380.0
  ], 
  [
   201506, 
   null, 
   "Steeeeve", 
   "Just a minor point. That's not an article, it's an editorial. The difference is that articles are, in theory, supposed to present facts. Editorials exist simply to express opinions, and are under no obligation to be truthful. For example, your editorial says \"If you recall, the \"living Constitution\" is the notion that the meaning of the Constitution changes over time.\" That definition is certainly convienient for the author, but it's not a good, which is to say accurate, definition. A more accurate take would be to say that the interpretation of the Constitution must take modern reality into account. \n ok its an editorial...that is very obvious if you read it. \n \n The living constitution is exactly what the author stated. It changes over time. For example, the death penalty for minors was fine 20 years ago...not so today. There is no \"modern reality\" to that.\n \n \n\n A simple example of this is \"the right to bear arms\". 200 years ago arms were cumbersome things, not very accurate, and very, very slow. Today you could kill 100 people in a minute if they were packed in closely enough. The fact that the definition of \"arms\" has changed since the Constitution was written justifies reinterpreting the phrase \"right to bear arms\". Similarly, other defintions, concepts and assumptions have changed in the last 200 years. To pretend this isn't so when reading the Constitution is to deny reality.\n how as the term \"arms\" changed? You couldn't own a cannon then you can't own one now. The people that believe in a dead constitution also believe that you apply new things to the constitution such as the development of an assault rifle. This is not the issue with the living constitution which might say an assault rifle is ok but the next day say it is not.", 
   {}, 
   201494, 
   null, 
   1141708680.0
  ], 
  [
   201530, 
   null, 
   "Matthew S", 
   " Living and breathing would refer to the idea that Breyer, Kennedy, Ginsburg, etc hold. The idea that the constitution morphes over time to meet the needs of a \"maturing society\"....of course the judges decide that.\n \n\n \n \n I think this is exactly the correct view to take while looking at the constitution. Of course the president and his cronies don't believe in the constitution and no republinazi in the congress will not hold him accountable. So what does it matter anyway?", 
   {}, 
   201505, 
   null, 
   1141734000.0
  ], 
  [
   201549, 
   null, 
   "Kronus", 
   "\n how as the term \"arms\" changed? You couldn't own a cannon then you can't own one now. The people that believe in a dead constitution also believe that you apply new things to the constitution such as the development of an assault rifle. This is not the issue with the living constitution which might say an assault rifle is ok but the next day say it is not.\n\n The term \"arms\" has changed because things that qualify as arms are orders of magnitude more deadly than they were 200 years ago.\n \n Can you cite any examples of a judge changing their opinion on a day to day basis based on a \"living constitution\" argument? And please, not an editorial; something at least nominally based on facts. Both you and the editorial make it sound like decisions are changing based on the whim of the moment, but the only cases I've heard of have been reinterpretations of decades or centuries old cases. I'll agree that the constitution shouldn't be reinterpreted based on current fashion, but I'm not convinced that anyone is actually doing that.", 
   {}, 
   201506, 
   null, 
   1141749120.0
  ], 
  [
   201560, 
   null, 
   "Steeeeve", 
   "I think this is exactly the correct view to take while looking at the constitution. Of course the president and his cronies don't believe in the constitution and no republinazi in the congress will not hold him accountable. So what does it matter anyway?\n\n \n Which is why we get cases like New London. \n \n I am not sure why you support a constitution that is so ridged and ruled by a nonacracy. But it seems you never were for a government by the people. \n \n As for \"correct\" view...it seems my view was standard for 150 years...Your view was created by a govenor.\n \n \nThe term \"arms\" has changed because things that qualify as arms are orders of magnitude more deadly than they were 200 years ago.\n Types of arms have changed surely...but the definition still remains the same.\n \n \n\n Can you cite any examples of a judge changing their opinion on a day to day basis based on a \"living constitution\" argument\n Sure. The use of foreign law in deciding cases. They felt it was needed to determine if the dealth penalty for minors is bad (Roper case)...however, when it came to abortion foreign law didn't matter (see Casey v. Planned Parenthood). Another example be the actual dealth penalty for minors case. The court admitted that the constitution changed over 15yrs instead of actually the case heard 15yrs earlier being wrong. \n \n \nWe held that standards of decency have evolved since Penry and now demonstrate that the execution of the mentally retarded is cruel and unusual punishment.\n\n http://www.law.cornell.edu/supct/html/03-633.ZO.html\n \n Just read the case...it is crazy. Stevens position evolved the most since he was on the court during the first case...", 
   {}, 
   201530, 
   null, 
   1141752600.0
  ], 
  [
   201571, 
   null, 
   "Kronus", 
   "\n Sure. The use of foreign law in deciding cases. They felt it was needed to determine if the dealth penalty for minors is bad (Roper case)...however, when it came to abortion foreign law didn't matter (see Casey v. Planned Parenthood). \n\n Sorry, I can't find what you're reffering to here.\n \n \n Another example be the actual dealth penalty for minors case. The court admitted that the constitution changed over 15yrs instead of actually the case heard 15yrs earlier being wrong.\n \n http://www.law.cornell.edu/supct/html/03-633.ZO.html\n \n Just read the case...it is crazy. Stevens position evolved the most since he was on the court during the first case...\n\n Actually, this case doesn't really support your claim that well. In the case it refers to, http://www.law.cornell.edu/supct/html/historics/USSC_CR_0492_0361_ZS.html,\n Scalia himself confirms that \"cruel and unusual\" is a term that is based on current social standards.\n \n \"In determining whether a punishment violates evolving standards of decency, this Court looks not to its own subjective conceptions, but, rather, to the conceptions of modern American society as reflected by objective evidence.\"\n \n The standard for \"cruel and unusual\" changes, grows if you will, over time, and so decisions that are related to that standard will also change. That's Scalia's opinion, anyway. The Constitution didn't change, society did. Over the course of 15 years the national consensus on whether executing a minor is cruel and unusual changed.", 
   {}, 
   201560, 
   null, 
   1141754280.0
  ], 
  [
   201578, 
   null, 
   "Steeeeve", 
   "Actually, this case doesn't really support your claim that well. In the case it refers to, http://www.law.cornell.edu/supct/htm...2_0361_ZS.html,\n Scalia himself confirms that \"cruel and unusual\" is a term that is based on current social standards.\n What? It refers to a few cases actually..Atkins and Thompson come to mind. \n \n This supports my claim well because they didn't claim the decision was incorrectly decided but rather the society \"evolved\"..thus Kennedy and Stevens changed there views.\n \n \nScalia himself confirms that \"cruel and unusual\" is a term that is based on current social standards.\n No he doesn't...where on earth did you get that from? You obviously didnt' read his dissent.\n \n \nThe standard for \"cruel and unusual\" changes, grows if you will, over time, and so decisions that are related to that standard will also change. That's Scalia's opinion, anyway. The Constitution didn't change, society did. Over the course of 15 years the national consensus on whether executing a minor is cruel and unusual changed.\n Society may have changed...but thats why we have a democracy to change the laws...not 9 judges. And Scalia doesn't believe in what you say he does...how on earth did you get to that conclusion? The constitution did change though..it evolved...cruel and unusually means something different now. Can you imagine if the tax code were like this? Just changing at the whims of the court. How do you think you get cases like Kelo v. New London?", 
   {}, 
   201571, 
   null, 
   1141755780.0
  ], 
  [
   201581, 
   null, 
   "Steeeeve", 
   "Sorry, I can't find what you're reffering to here.\n The Roper case cited a lot of foreign law as showing how their decision is correct. This idea was not used in the Casey case which would show that the world thinks our abortion laws are not strict enough. It just shows an inconsistent use of foreign law which shows that judges use \"evolving standards of decency\" when it suits them well. \n \n See:\n \n http://www.c-span.org/homepage.asp?Cat=Series&Code=AC&ShowVidNum=7&Rot_Cat_CD=AC&Rot_HT=206&Rot_WD=&ShowVidDays=100&ShowVidDesc=&ArchiveDays=100\n \n One of Scalia and foreign law and one of the \"living constitution\"\n \n http://www.c-span.org/search/basic.asp?ResultStart=1&ResultCount=10&BasicQueryText=scalia&image1.x=0&image1.y=0&image1=Submit\n (look here)", 
   {}, 
   201578, 
   null, 
   1141756500.0
  ], 
  [
   201589, 
   null, 
   "jyoshu", 
   "The constitution is definitely open to some degree of interpretation--if it had been written to be an all-encompassing document to address every possible scenario it would have been a great deal more lengthy. But I feel interpetation only comes into play with things that are written vaguely.\n \n The question really isn't whether the constitution should be interpretive, but rather how much so and in what way. If the way we interpret it needs to change, that needs to be dealt with via constitutional process rather than ignoring what it says. Re. the 2nd Amendment issue, IMO that amendment in the Bill of Rights makes people free to own and bear arms, period--the wording is clear. If that needs to change because of the effectiveness of modern technology, or because we don't need the concept of a \"militia\", then due process should be followed and the amendment needs to be replaced or somehow reworded rather than just essentially ignored. IOW, I feel that going so far as to ignore an amendment takes interpretation too far. \n \n When it was found that prohibition was a bad idea, we didn't leave the 18th amendment there and simply interpret it differently; we declared it null through due process. This was the correct way of handling the matter. If the 2nd Amendment (or ANY amendment) is outdated, it should be dealt with (either replacing it or changing it) through constitutional due process rather than interpretively ignoring it. Now, that's no easy task, and probably wouldn't go over. But it's the process.", 
   {}, 
   201578, 
   null, 
   1141758180.0
  ], 
  [
   201596, 
   null, 
   "Kronus", 
   "\n This supports my claim well because they didn't claim the decision was incorrectly decided but rather the society \"evolved\"..thus Kennedy and Stevens changed there views.\n\n Those statements don't jibe. If society evolved than it isn't the case that Kennedy and Stevens simply changed their views. Their views were consistant, namely that cruel and unusual punishment, as defined by the standards of the nation, should not be used.\n \n \n\n No he doesn't...where on earth did you get that from? You obviously didnt' read his dissent.\n\n He does, 15 years ago, in the case I linked to. The one where he was in the majority opinion. The quote I gave was from him. Here's the link again\n http://www.law.cornell.edu/supct/html/historics/USSC_CR_0492_0361_ZS.html\n It's in pararaph b), just a little ways down.\n \n Frankly, it's Scalia who has changed his views here. In 15 years he went from this:\n \"In determining whether a punishment violates evolving standards of decency, this Court looks not to its own subjective conceptions, but, rather, to the conceptions of modern American society as reflected by objective evidence.\"\n to this\n \"The Court reaches this implausible result by purporting to advert, not to the original meaning of the Eighth Amendment, but to \"the evolving standards of decency,\" ante, at 6 (internal quotation marks omitted), of our national society\"\n \n He's done a complete flip-flop on this issue.\n \n \n\n Society may have changed...but thats why we have a democracy to change the laws...not 9 judges. And Scalia doesn't believe in what you say he does...how on earth did you get to that conclusion? The constitution did change though..it evolved...cruel and unusually means something different now. \n\n IANAL, but based on what you've shown me it seems that it was the case that the Constitution was interpreted based on the standards of the time. The idea that this shouldn't happen is a new one. Scalia's current position that interpretations should never change is a complete 180 from his stated stance of 15 years ago. Again, based on the cases you've cited.", 
   {
    "unicode_changes_made": true
   }, 
   201578, 
   null, 
   1141761900.0
  ], 
  [
   201602, 
   null, 
   "Steeeeve", 
   "Those statements don't jibe. If society evolved than it isn't the case that Kennedy and Stevens simply changed their views. Their views were consistant, namely that cruel and unusual punishment, as defined by the standards of the nation, should not be used.\n Aside from the fact that they used foreign society... it isn't the job of the judge to decide what society wants. That is the job of the legislature. The constitution is a legal document...the meanings of the words don't change. If you want to change them...pass a law! You are deciding if something is constitutional or not...I guess with your standard we have no idea what is or isn't constitutional, it depends on the day (which was my claim)!\n \n \nHe does, 15 years ago, in the case I linked to. The one where he was in the majority opinion. The quote I gave was from him. Here's the link again\n http://www.law.cornell.edu/supct/htm...2_0361_ZS.html\n It's in pararaph b), just a little ways down.\n \n Frankly, it's Scalia who has changed his views here. In 15 years he went from this:\n \"In determining whether a punishment violates evolving standards of decency, this Court looks not to its own subjective conceptions, but, rather, to the conceptions of modern American society as reflected by objective evidence.\"\n to this\n \"The Court reaches this implausible result by purporting to advert, not to the original meaning of the Eighth Amendment, but to \"the evolving standards of decency,\" ante, at 6 (internal quotation marks omitted), of our national society\"\n \n He's done a complete flip-flop on this issue.\n hehe, you realize that was the syallbus right? It states the arguments not what the opinion is. If you read the opinion you will see Scalia \"rejects\" the idea of evolving standards of decency.\n \n I am just gonna start over here:\n \n Read part V of the opinion. It talks about rejecting the evolving standards. Then look at the sylabus and realize that it is just that...no more, the opinion is the actual thoughts.", 
   {
    "unicode_changes_made": true
   }, 
   201596, 
   null, 
   1141764420.0
  ], 
  [
   201609, 
   null, 
   "Steeeeve", 
   "All of this Scalia talk seems irrelevant anyway. The point still remains that the living constitution causes changes of opinion on what is or isn't in the constitution. The living constitution leads one to believe that we never know what the constitution says until the Supreme Court decides. We never knew the takings clause was meant to give private companies land but it does now...living and breathing :)", 
   {}, 
   201602, 
   null, 
   1141765740.0
  ], 
  [
   201610, 
   null, 
   "Kronus", 
   "Aside from the fact that they used foreign society... it isn't the job of the judge to decide what society wants. That is the job of the legislature. The constitution is a legal document...the meanings of the words don't change. If you want to change them...pass a law! \n\n Are you seriously suggesting that we amend the constitution every time we need to decide if a given punishment is \"cruel and unusual\"?\n \n \n\n hehe, you realize that was the syallbus right? It states the arguments not what the opinion is. If you read the opinion you will see Scalia \"rejects\" the idea of evolving standards of decency.\n \n It talks about it more in Part V of the opinion. Come on now..you gotta read first!\n\n \n Right back at you. First off, the syllabus summarizes the conclusion, not the arguments. If b) was the argument, it wouldn't have this line, would it? \"This does not establish the degree of national agreement this Court has previously thought sufficient to label a punishment cruel and unusual.\" That's a conclusion.\n \n Secondly, read the opinion more closely. He doesn't reject the idea of evolving standards of decency, he just rejected the methods presented to determine them in this case. He was fully behind the idea of evolving standards. He felt that the best way to determine if standards had changed was by looking at laws, and not opinion polls, but he knew that they did change and that the interpretation of the Constitution should reflect that.", 
   {}, 
   201602, 
   null, 
   1141765800.0
  ], 
  [
   201620, 
   null, 
   "Steeeeve", 
   "Are you seriously suggesting that we amend the constitution every time we need to decide if a given punishment is \"cruel and unusual\"?\n Of course not, just pass a state law saying you want to ban _____________.\n \n \nRight back at you. First off, the syllabus summarizes the conclusion, not the arguments. If b) was the argument, it wouldn't have this line, would it? \"This does not establish the degree of national agreement this Court has previously thought sufficient to label a punishment cruel and unusual.\" That's a conclusion.\n \n Secondly, read the opinion more closely. He doesn't reject the idea of evolving standards of decency, he just rejected the methods presented to determine them in this case. He was fully behind the idea of evolving standards. He felt that the best way to determine if standards had changed was by looking at laws, and not opinion polls, but he knew that they did change and that the interpretation of the Constitution should reflect that.\n I revized what I wrote while you were writting...and it still isn't coming across correctly...non-the-less, You are not understanding the case and it is irrelevant to try and explain how it works. However, Part V of the opinion addresses the evolving standards of decency claim...never did Scalia accept this idea though. In fact, he uses the living constitutions own ideas against them (common in his dissents actually). \n \n \nWhen this Court [p379] cast loose from the historical moorings consisting of the original application of the Eighth Amendment, it did not embark rudderless upon a wide-open sea.\n Scalia takes each argument used and says why it doesn't work. He says that the dissent tries to use the standards of the court, Scalia rejected this idea like you suggested. However, no where does he claim to accept this standard. In fact, in Roper he aruges in the same way. You are trying to prove something that not even Scalia himself believes. Scalia has written many things and has reject the evolving standards in all that he writes (outside of court) including speeches. \n \nThe cruel and unusual punishment clause would mean precisely the same thing today that it meant in 1789\n\n \n As I said though, this is irrelevant to our discussion on the living constitution.", 
   {}, 
   201610, 
   null, 
   1141767360.0
  ], 
  [
   201629, 
   null, 
   "Kronus", 
   "All of this Scalia talk seems irrelevant anyway. \n\n I guess we'll just have to agree to disagree on what Scalia thought 15 years ago.\n \n \n\n The point still remains that the living constitution causes changes of opinion on what is or isn't in the constitution.\n\n No, it really doesn't. The way you phrase it makes it sound like whole sections just appear or disappear. All that changes is exact interpretations of certain small bits. Cruel and unusual punishment will always be banned, and we all know mostly what that means. The only thing that changes is whether a particular edge case falls on this side of the line or that. And the reason for the change is that the line moves. The ban on cruel and unusual punishment is and always has been in the constitution. All that's changed is what, exactly, we mean by the phrase. The Constitution hasn't changed, \"cruel\" has.\n \n \n\n The living constitution leads one to believe that we never know what the constitution says until the Supreme Court decides.\n\n Um, isn't that in fact exactly their job description? Isn't their reason for being to interpret the Constitution, to rule whether such-and-such a law is Constitutional?", 
   {}, 
   201609, 
   null, 
   1141770180.0
  ], 
  [
   201633, 
   null, 
   "Steeeeve", 
   "No, it really doesn't. The way you phrase it makes it sound like whole sections just appear or disappear. All that changes is exact interpretations of certain small bits. Cruel and unusual punishment will always be banned, and we all know mostly what that means. The only thing that changes is whether a particular edge case falls on this side of the line or that. And the reason for the change is that the line moves. The ban on cruel and unusual punishment is and always has been in the constitution. All that's changed is what, exactly, we mean by the phrase. The Constitution hasn't changed, \"cruel\" has.\n No, it means what it meant when the people adopted it. Nine judges don't have the judge of legislating what is or isn't cruel now. If the people don't want it then vote on it. With your theory, the judges could say jailtime is cruel and unusual. What about the tax code? Maybe terms in the tax code change over time too. You would have to be crazy to think that nine people know what is right and just now. So if the word \"cruel\" has changed then who adopted the new meaning? I didn't see any law changing the meaning. The people only adopted it to mean one thing. \n \n \nUm, isn't that in fact exactly their job description? Isn't their reason for being to interpret the Constitution, to rule whether such-and-such a law is Constitutional?\n there job is to interpret the constitution as you say but not to rewrite the terms of it. If it keeps on changing then how is one supposed to know? How do the judges know besides using their own personal bias? If you apply a consistent meaning (which was done for 150yrs) then you know what cruel and unusual means. You make it seem like law school is worthless because only 9 people know what a legal document says. This would be like having a contract to sell a car and no one knowing what it means until a judge reads it...that crazy.", 
   {}, 
   201629, 
   null, 
   1141773180.0
  ], 
  [
   201637, 
   null, 
   "Kronus", 
   "No, it means what it meant when the people adopted it. Nine judges don't have the judge of legislating what is or isn't cruel now. If the people don't want it then vote on it. With your theory, the judges could say jailtime is cruel and unusual. What about the tax code? Maybe terms in the tax code change over time too. You would have to be crazy to think that nine people know what is right and just now. So if the word \"cruel\" has changed then who adopted the new meaning? I didn't see any law changing the meaning. The people only adopted it to mean one thing. \n\n \n Again, you seem to be implying that changes can happen willy-nilly. That's not the case. These nine people know what is right and just now because they're some of the greatest legal minds in the country, and have studied these matters all their careers. That's why we do, in fact, entrust them with the responsiblity of being the arbiters of what cruel means, in the context of the constitution. These aren't nine shmoes off the street, they're the Supreme Court Justices! If you can't trust their ability to make reasonable legal decisions then you might as well not trust any professional's opinion.\n \n \n \n\n there job is to interpret the constitution as you say but not to rewrite the terms of it. If it keeps on changing then how is one supposed to know?\n\n It's not like these changes are coming so fast and furious that you can't keep up. They're rare, and only happen when society has changed significantly. People can see these changes coming, and look at upcoming cases and know that a ruling could change things one way or the other.\n \n \n\n How do the judges know besides using their own personal bias? \n\n Again, greatest legal minds in the country.\n \n \n \n\n If you apply a consistent meaning (which was done for 150yrs) then you know what cruel and unusual means. \n\n I'm pretty sure this is a myth. The 150 years part. The \"dead constitution\" crowd would like us to think that judges interpreting the constitution is a new trend, but it's not. I'll do some digging, but I'm pretty sure I can show you that the term \"cruel and unusual\" has been interpreted differently throughout US history. I'll let you know what I come up with.", 
   {}, 
   201633, 
   null, 
   1141774860.0
  ], 
  [
   201643, 
   null, 
   "Steeeeve", 
   "Again, you seem to be implying that changes can happen willy-nilly. That's not the case. These nine people know what is right and just now because they're some of the greatest legal minds in the country, and have studied these matters all their careers.\n Nine unelected people making decisions about what they want cruel to mean...seems like they can put what they want. And of course the nine legal minds are above the people in knowing what is just and right. You put a high value on these people...making the a dicator or something. Tell me, did they get it right in Plessy? What about in Bowers? If they know all the answers to what is right then why do we even have a legislature? We might as well ask Judge Breyer...he will know. The only way they could know what \"cruel\" means is by their own thoughts which is their own personal bias...as opposed to a dead constitution which uses a people adopted meaning. Your idea was actually brought up as a thread in the anti-federalist papers and then shot down as \"wont happen\" in the federalist papers...too bad the anti-federalist were right. \n \n You then have to answer why in last 50 yrs the judges became knowledgable with what words mean...some kind of elightenment I suppose. What about the previous 150yrs? Were the judges doing it wrong? Time to overturn Marbury vs. Madison I suppose. I am afraid to ask you what my legal documents might mean to a judge. I guess I can get out of my apartment contract if the meaning of \"rent\" changes in the mind of a judge in the next week.\n \nIt's not like these changes are coming so fast and furious that you can't keep up. They're rare, and only happen when society has changed significantly.\n This isn't true, look at Roe v. Wade for Brown v. Board or Texas v. Lawerence....all of those were a against the majority belief. In effect, what you are saying is majority rules...the belief of the majority should be the \"evolving standards\" right? Either that or it has to be the minds of the judges. SO either you support judges legislating or having the judges impose the majority on your will. It is obviously not the latter because of the three cases I showed you..you must support the \"evolving standards\" of nine people..not society.\n \n \nAgain, greatest legal minds in the country.\n...do not have an understanding of what is right or wrong anymore than I do.\n \n \nI'm pretty sure this is a myth. The 150 years part. The \"dead constitution\" crowd would like us to think that judges interpreting the constitution is a new trend, but it's not. I'll do some digging, but I'm pretty sure I can show you that the term \"cruel and unusual\" has been interpreted differently throughout US history. I'll let you know what I come up with.\n You will certainly come up with some cases they applied the law incorrectly. As scalia said in a recent speech \"you had willful judges then and you will have wilfull judges until the end of time...but before they went about it by lying\". \n \n Maybe you should hear Scalias speech on constitutional interuptation available at www.cspan.org before you comment. Breyer has one as well I beleive that i heard. I have heard both sides from the leaders themselves. Maybe you should do the same.", 
   {}, 
   201637, 
   null, 
   1141776180.0
  ], 
  [
   201653, 
   null, 
   "Kronus", 
   "Nine unelected people making decisions about what they want cruel to mean...\n\n Yes. That is in fact the way this country is run. I'm sorry if it upsets you, but it seems to work.\n \n \n \n\n I guess I can get out of my apartment contract if the meaning of \"rent\" changes in the mind of a judge in the next week.\n\n I'm trying to keep this debate on a high level. Please, do the same?\n \n \n \n\n This isn't true, look at Roe v. Wade for Brown v. Board or Texas v. Lawerence....all of those were a against the majority belief. In effect, what you are saying is majority rules...the belief of the majority should be the \"evolving standards\" right?\n\n No, you've got it wrong. Take Texas v Lawrence for example. The issue there isn't \"do you approve of gay sex\". You may be right that a majority would say no. The question is, what does society say government's role should be in the sex lives of two consenting adults. There may well have been a time when people would have been in favor of the government regulating their sex lives; now is not that time. Society currently believes that what two consenting adults do behind closed doors in nobody else's business, and the Justices upheld that.\n \n \n \n\n ...do not have an understanding of what is right or wrong anymore than I do.\n \n\n And maybe that's the core difference between us. I do believe that people can develop a better sense of right and wrong than others, and that's a quality of a good judge. I think that a SC justice can tell right from wrong more clearly than you or I can, because that's what they've been trained to do. If you don't believe that than I can understand why you are so leery of them using their judgement.\n \n \n\n You will certainly come up with some cases they applied the law incorrectly. As scalia said in a recent speech \"you had willful judges then and you will have wilfull judges until the end of time...but before they went about it by lying\". \n\n Are you saying I shouldn't bother then. Any evidence I come up with will simply be judges making mistakes to you? If that's the case then please let me know so I don't waste my time.\n \n \n\n Maybe you should hear Scalias speech on constitutional interuptation available at www.cspan.org before you comment. Breyer has one as well I beleive that i heard. I have heard both sides from the leaders themselves. Maybe you should do the same.\n\n I'll give them a listen.", 
   {}, 
   201643, 
   null, 
   1141780620.0
  ], 
  [
   201676, 
   null, 
   "Steeeeve", 
   "Yes. That is in fact the way this country is run. I'm sorry if it upsets you, but it seems to work.\n Unless you were the family in the Kelo case emoticon_rolleyes \n \n \nI'm trying to keep this debate on a high level. Please, do the same?\n with all due respect, I'm not the one that thinks legal documents change meaning over time.\n \n \nThe question is, what does society say government's role should be in the sex lives of two consenting adults. There may well have been a time when people would have been in favor of the government regulating their sex lives; now is not that time. Society currently believes that what two consenting adults do behind closed doors in nobody else's business, and the Justices upheld that.\n Not at the time of Lawerence...Many states had laws banning sodemy. Either way, it shows that the evolving court doesn't even use their own standard...they say \"evolving standards of decency that mark the progree of a maturing society\"...yet they don't follow society and they beg the question that we are maturing. This leaves only one possibility of who they are following...their own personal beliefs. THis is also known as legislating from the bench.\n \n \ndo believe that people can develop a better sense of right and wrong than others, and that's a quality of a good judge. I think that a SC justice can tell right from wrong more clearly than you or I can, because that's what they've been trained to do. If you don't believe that than I can understand why you are so leery of them using their judgement.\n Well, if these people are so bright and are all knowing then why was lawerence, casey, kelo, etc all 5-4 decisions? Seems like the \"bright\" aren't thinking the same...\n Either 4 judges are bad half the time or something more is in play. In fact, what good is having a constitution if the judges are so bright? We can just defer to them for questions regarding government.\n \n \nAre you saying I shouldn't bother then. Any evidence I come up with will simply be judges making mistakes to you? If that's the case then please let me know so I don't waste my time.\n No, go ahead and look. You won't find the phrase \"evolving standards of decency\" though. Take Wilkerson v. Utah for example...purely based on law and not opinion of the judges. \n \n \n The point is, the standard of the living constitution is what the judges think and thats it. It isn't always what the majority wants anymore(although that is the only logical way to look at evolving standards of decency) , it is what the judge wants. Nine unelected people making decisisions for the US. Doesn't seem like the system of government we set up. Sometimes the \"living constitutional\" judges defer to foreign law...yet on an inconsistent basis. All of this shows that the judges are just using their own personal wants instead of the laws that govern our country. \n \n I am not even sure why you want 9 people making decisions for you. It isn't like more freedoms always come out of it. Kelo v. New London is the best example of that. Changing words now may cost you your home because Wal-Mart (or some company) will generate more tax revenue. But a very wise decision nonetheless right :xbanghead \n \n \nll give them a listen.\n I honestly hope you do. I did before I even knew much about the different constitutional \"theories\"...only one seemed correct...hopefully you can go in with an open mind as well. Scalia has a few \"head to head\" with Breyer as well...all on www.cspan.com or org...whatever it is.", 
   {}, 
   201653, 
   null, 
   1141787880.0
  ], 
  [
   201700, 
   null, 
   "zachvac", 
   "http://www.townhall.com/opinion/columns/jonahgoldberg/2006/02/22/187398.html\n \n This article implies that the democrats are switching their views on the idea of the living constitution when it suits itself. This should be to no surprise because if the constitution were a living document then it could \"fake its own death\" as the article says. Interesting read if you get a chance\n\n \n I haven't read the article (I will, just not tonight), but if it is really a living document, who decides when it decides to change? The SC? The point of the Constitution and the SC, is that besides a 2/3 Congress and 3/4 of the states vote, it can't change. There are things that change. People didn't like slavery, so they passed an amendment. It's not a very good when you can ignore parts of the Constitution because either \"they didn't MEAN that\" or \"it's a living Constitution\". I'm sorry, but whatever they meant, we should follow the law, not what they meant when they wrote it. \"shall not infringe\" means shall not infringe, NO exceptions.\n \n Now I think there are many changes needed. Currently under the Constitution, any federal gun/bomb/any arm ban is illegal. Same with speech including treason, libel, etc. Until we can put these exceptions in the Constitution, it will be a slipery slope from that to other changes.\n \n The whole reason the founders wrote the Constitution was because they were afraid of the federal government getting too big, now people want a branch of the federal government (the SC) that they wanted smaller to interpret this document? No wonder the federal government is getting bigger, and bigger, and bigger. The President is doing warrantless wiretaps, but it doesn't matter because getting warrants is easy enough anyway. Apparently the FISA courts give away warrants like pocket change. We are banning profanity, talking about banning flag burning (at least that's an amendment, a perfectally acceptable form of making it a living document), banning guns, and trampling on states' rights. They went from the Articles of Confederation to the Constitution because there was too much state power and too little federal power in the Articles of Confederation, and if we actually followed the Constitution, it would be pretty effective.\n \n I think the ruling about eminent domain had something about \"in today's capitalist society\". The job of the SC is to interpret the Constitution, not decide anything about today. Why do we have laws if we can just change them with a SC ruling? The legislative branch is supposed to write the laws, now we have the judiciary not only interpreting laws but also changing them? How is banning abortion within the power of the federal government (same with forcing them to allow it)? We've already violated the Constitution so much, why do we even pretend we're following it? Maybe it looks good.", 
   {}, 
   201424, 
   null, 
   1141798380.0
  ], 
  [
   201726, 
   null, 
   "Kronus", 
   "\n with all due respect, I'm not the one that thinks legal documents change meaning over time.\n \n\n \n So the mere fact that you disagree with me gives you permission to stoop to sarcasm and derisive flights of fancy? If that's the sort of debate you want than give Matthew a ping, I'm sure he'll oblige you.", 
   {}, 
   201676, 
   null, 
   1141831920.0
  ], 
  [
   201727, 
   null, 
   "Steeeeve", 
   "So the mere fact that you disagree with me gives you permission to stoop to sarcasm and derisive flights of fancy? If that's the sort of debate you want than give Matthew a ping, I'm sure he'll oblige you.\n\n \n WEll I gave an example about rent and you found it to be insulting...but I was serious. the constitution is no more a legal document than a contract is. Legal documents just don't change over time unless the parties that are involved agree to do so. In a contract it is normally the 2 parites (lessor and lessee in my example) and in a the constitution it is the people via amendment process.", 
   {}, 
   201726, 
   null, 
   1141832460.0
  ], 
  [
   201728, 
   null, 
   "Steeeeve", 
   "I haven't read the article (I will, just not tonight), but if it is really a living document, who decides when it decides to change? The SC? The point of the Constitution and the SC, is that besides a 2/3 Congress and 3/4 of the states vote, it can't change. There are things that change. People didn't like slavery, so they passed an amendment. It's not a very good when you can ignore parts of the Constitution because either \"they didn't MEAN that\" or \"it's a living Constitution\". I'm sorry, but whatever they meant, we should follow the law, not what they meant when they wrote it. \"shall not infringe\" means shall not infringe, NO exceptions.\n \n Now I think there are many changes needed. Currently under the Constitution, any federal gun/bomb/any arm ban is illegal. Same with speech including treason, libel, etc. Until we can put these exceptions in the Constitution, it will be a slipery slope from that to other changes.\n \n The whole reason the founders wrote the Constitution was because they were afraid of the federal government getting too big, now people want a branch of the federal government (the SC) that they wanted smaller to interpret this document? No wonder the federal government is getting bigger, and bigger, and bigger. The President is doing warrantless wiretaps, but it doesn't matter because getting warrants is easy enough anyway. Apparently the FISA courts give away warrants like pocket change. We are banning profanity, talking about banning flag burning (at least that's an amendment, a perfectally acceptable form of making it a living document), banning guns, and trampling on states' rights. They went from the Articles of Confederation to the Constitution because there was too much state power and too little federal power in the Articles of Confederation, and if we actually followed the Constitution, it would be pretty effective.\n \n I think the ruling about eminent domain had something about \"in today's capitalist society\". The job of the SC is to interpret the Constitution, not decide anything about today. Why do we have laws if we can just change them with a SC ruling? The legislative branch is supposed to write the laws, now we have the judiciary not only interpreting laws but also changing them? How is banning abortion within the power of the federal government (same with forcing them to allow it)? We've already violated the Constitution so much, why do we even pretend we're following it? Maybe it looks good.\n\n \n I mostly agree...I don't agrue that the federal government can restrict abortions though. i argue it is a state thing.", 
   {}, 
   201700, 
   null, 
   1141832640.0
  ], 
  [
   201729, 
   null, 
   "doG", 
   "The Constitution and all other laws should say what they mean and mean what they say. If the times change and the law becomes obsolete then the lawsshould be changed, not the interpretation of it. The law should mean the same thing to everyone as written, not whatever they read it to mean.", 
   {}, 
   201424, 
   null, 
   1141832700.0
  ], 
  [
   201732, 
   null, 
   "Steeeeve", 
   "The Constitution and all other laws should say what they mean and mean what they say. If the times change and the law becomes obsolete then the lawsshould be changed, not the interpretation of it. The law should mean the same thing to everyone as written, not whatever they read it to mean.\n\n And you don't even agree with me on most things :p\n \n This doesn't have to a conservative v. liberal thing. Conservatives could benefit from the living constitution too....however, I don't follow this meaningless standard.", 
   {}, 
   201729, 
   null, 
   1141834380.0
  ], 
  [
   201733, 
   null, 
   "Kronus", 
   "The Constitution and all other laws should say what they mean and mean what they say. If the times change and the law becomes obsolete then the lawsshould be changed, not the interpretation of it. The law should mean the same thing to everyone as written, not whatever they read it to mean.\n\n \n But the Constitution isn't law, it's a framework for forming laws. Parts of it were deliberatley left vague and subjective so that we wouldn't have to amend it every time society changed. For example, cruel and unusual punishment is definitively banned, changing that would require an amendment. But the founders used the subjective phrase \"cruel and unusual\" rather than something legally rigorous because they didn't want to impose their 18th century values on America for the rest of time. They knew that what people thought was cruel would change, so they left it subjective and gave the Supreme Court the responsibity to interpret, and reinterpret, as times changed. So yes, laws should be explicit and rigid. The framework for forming those laws must be flexible if the country is going to grow.", 
   {}, 
   201729, 
   null, 
   1141834740.0
  ], 
  [
   201737, 
   null, 
   "Steeeeve", 
   "But the Constitution isn't law, it's a framework for forming laws. Parts of it were deliberatley left vague and subjective so that we wouldn't have to amend it every time society changed. For example, cruel and unusual punishment is definitively banned, changing that would require an amendment. But the founders used the subjective phrase \"cruel and unusual\" rather than something legally rigorous because they didn't want to impose their 18th century values on America for the rest of time. They knew that what people thought was cruel would change, so they left it subjective and gave the Supreme Court the responsibity to interpret, and reinterpret, as times changed. So yes, laws should be explicit and rigid. The framework for forming those laws must be flexible if the country is going to grow.\n No, it is law. If it weren't law then it has no meaning. You are right in saying this law created the structure for government but it is still treated as any legal document would be. In this sense it is not a bill passed by congress but more like a contract. It is also not vague if you apply the same standard across the board. It means what it meant to the people that adopted it. However, you concentrate on the amendments while the structure is provided in the original document. The first 10 amendments were add-ons that don't provide any structure but rather set definite limits on the government. There is nothing that leads us to believe the first 10 amendments (or all of them) were meant to have the meaning decided by the courts. 150-200 years of judgement affirmed this....it is only the last 50 that thinks the words have no real meaning. However, if you find one document of the time stateing that the 8th amendment is to be decided by the courts then I might listen.", 
   {}, 
   201733, 
   null, 
   1141835400.0
  ], 
  [
   201742, 
   null, 
   "Kronus", 
   "However, if you find one document of the time stateing that the 8th amendment is to be decided by the courts then I might listen.\n\n \n You've already dismissed any evidence against your position as judges making mistakes. And frankly, unless you're willing to commit to keeping the debate on a high level, I see little point in wasting my time trying to convince you of anything.", 
   {}, 
   201737, 
   null, 
   1141836060.0
  ], 
  [
   201746, 
   null, 
   "Steeeeve", 
   "You've already dismissed any evidence against your position as judges making mistakes. And frankly, unless you're willing to commit to keeping the debate on a high level, I see little point in wasting my time trying to convince you of anything.\n\n \n I haven't dismissed any evidence. I just said there were willful judges prior to the \"living constitution\". I guess a better way to say it is before 1940-1950 (or so) it was the exception not the rule like it is today.", 
   {}, 
   201742, 
   null, 
   1141837140.0
  ], 
  [
   201747, 
   null, 
   "daewoo", 
   "And you don't even agree with me on most things :p\n \n This doesn't have to a conservative v. liberal thing. Conservatives could benefit from the living constitution too....however, I don't follow this meaningless standard.\n\n \n Wow...even I agree with you on this one, steve. I don't think that painting this as a liberal vs conservative isue is a winning argument because frankly both sides are guilty as sin of twisting the constitution to mean what they want.\n \n IMO, a hard line on either side of this issue is inappropriate. In interpeting the constitution, we need to look at the original intent of those who wrote it and those who ratified it. In some areas, it seems plain that evolving standards of society were included in that original intent. For example, Thomas Jafferson wrote about what constitutes \"cruel and unusual\" and said that it was his hope that eventually mankind would evolve to such a level that even prisons were considered cruel and unusual. What constitutes \"cruel and ununusual\" will always have to be decided using contemporary definitions.\n \n Otehr parts of the constitution, though, are not as flexible. For example, the first ammendment provides for the freedom of speach and the freedom of press (among other things). While those who wrote the constitution and those whoe ratified it certainly had a different idea of what constitutes press, and probably even \"speech\" than we have today, But that does not meant that the underlying right laid forth in the ammendment has changed. Despite the fact that if any of those who had penned that ammendment saw a television they would likely have fallen down in fear, MSNBC is still protected by the freedom of press. Despite the fact that those who ratified the constituion had no idea what a PA system was, or what talk radio was, the concept of freedom of speech has not changed.\n \n Likewise with the second ammendment. While the founding fathers and the people at the time were certainly not dealing with AR-15s or M-60 machine guns, it was made abundantly clear that the \"arms\" referred to in the second ammednemnt were those of the type \"commonly in miliary use\". The people are, according to our constitution, to be as well armed as the government, at least on the defensive side of things. Even in this, small changes have been made that are, IMO appropriate. For years, right up into the 20th century, there were large portions of the country that actually required every able bodied man to own a gun. While this requirement was not in my knowledge tied to the secodn ammendment, but rather to the militia powers of the states and the president. \n \n We have completley disregarded the 10th ammendment, and turned the power fo congress to regualte interstate commerce into an all encompasing super power.", 
   {}, 
   201732, 
   null, 
   1141837620.0
  ], 
  [
   201753, 
   null, 
   "Steeeeve", 
   "For example, Thomas Jafferson wrote about what constitutes \"cruel and unusual\" and said that it was his hope that eventually mankind would evolve to such a level that even prisons were considered cruel and unusual. What constitutes \"cruel and ununusual\" will always have to be decided using contemporary definitions\n Thomas Jefferson didn't write any of the constitution so what he says seems irrelevant to me.\n \n The point that I make (and scalia actually) is that the constitution is interepted reasonably. Obviously the constitution adapts to new technologies (like the internet) and things of that nature not around when the constitution was adopted. However, abortion, death penalty, homosexual conduct were all around then. An M-60 or whatever new gun you wish to say, was not around during that time. In fact most modern guns weren't. However, a reasonable look at the term \"arms\" generally meant handguns and things of that nature. Cruel and unusual generally meant the dealth penalty for any was ok...I don't know of many new techniques to kill someone since the constitution was enacted but it seems that what was permissable then would be ok within the meaning of the 8th amendment. The argument that some punishments such as the dealth penalty for stealing a horse are irrelevant. It was a stupid law so the government of the people got rid of it when the felt it was wrong. Could you still pass that same law today? Sure, but no one is going to do it unless the felt is was a good idea. The 8th amendment did ban certain things at the time and thus seems to be the same today. The only other way to look at this would be to decide what the people think of it to mean today...well, the courts don't do that either (see Atkins v. Virginia) so I find it hard to believe that \"evolving standards of decency\" is a good way to do it...it just makes judges do their own will.", 
   {}, 
   201746, 
   null, 
   1141839300.0
  ], 
  [
   201762, 
   null, 
   "daewoo", 
   "Thomas Jefferson didn't write any of the constitution so what he says seems irrelevant to me.\n\n \n Who wrote the constitution is irrelevant. They had no power or authority. It was with the ratification of the constitution that the document gained power, and it was the understnding of those who ratified that matters. The issue is the constituion as it was understood at the time. It was guys like Jefferson who were out arguing for the adoption and explaining what it meant to people. \n \n If your standard is that only the person who wrote the constitutions interpetation matters, you hve lost your argument fro the start. The consititution was essentially written by commitee. There is not one, single portion of the constitution that survived in its original drafted form. It was written, presented, re-written, re-presented. No one person wrote the constitution.\n \n \nThe point that I make (and scalia actually) is that the constitution is interepted reasonably. Obviously the constitution adapts to new technologies (like the internet) and things of that nature not around when the constitution was adopted. However, abortion, death penalty, homosexual conduct were all around then. An M-60 or whatever new gun you wish to say, was not around during that time. In fact most modern guns weren't. However, a reasonable look at the term \"arms\" generally meant handguns and things of that nature. Cruel and unusual generally meant the dealth penalty for any was ok...I don't know of many new techniques to kill someone since the constitution was enacted but it seems that what was permissable then would be ok within the meaning of the 8th amendment. The argument that some punishments such as the dealth penalty for stealing a horse are irrelevant. It was a stupid law so the government of the people got rid of it when the felt it was wrong. Could you still pass that same law today? Sure, but no one is going to do it unless the felt is was a good idea. The 8th amendment did ban certain things at the time and thus seems to be the same today. The only other way to look at this would be to decide what the people think of it to mean today...well, the courts don't do that either (see Atkins v. Virginia) so I find it hard to believe that \"evolving standards of decency\" is a good way to do it...it just makes judges do their own will.\n\n \n Yes, but in the real world, that is the way it is. \"Cruel and unusual\" is subjective terminology. There is really no way around that. Whereas \"arms\" has, and had, a specific meaning (though you are entirely incorrect that \"arms\" primarily referred to pistols....The \"arms\" that the british tried to sieze at lexington and concord consisted of nearly 70 cannons and hundreds of pounds of powder), \"cruel and unusual\" is a wholly subjective term.", 
   {}, 
   201753, 
   null, 
   1141841940.0
  ], 
  [
   201763, 
   null, 
   "Matthew S", 
   "Thomas Jefferson didn't write any of the constitution so what he says seems irrelevant to me.\n \n The point that I make (and scalia actually) is that the constitution is interepted reasonably. Obviously the constitution adapts to new technologies (like the internet) and things of that nature not around when the constitution was adopted. However, abortion, death penalty, homosexual conduct were all around then. An M-60 or whatever new gun you wish to say, was not around during that time. In fact most modern guns weren't. However, a reasonable look at the term \"arms\" generally meant handguns and things of that nature. Cruel and unusual generally meant the dealth penalty for any was ok...I don't know of many new techniques to kill someone since the constitution was enacted but it seems that what was permissable then would be ok within the meaning of the 8th amendment. The argument that some punishments such as the dealth penalty for stealing a horse are irrelevant. It was a stupid law so the government of the people got rid of it when the felt it was wrong. Could you still pass that same law today? Sure, but no one is going to do it unless the felt is was a good idea. The 8th amendment did ban certain things at the time and thus seems to be the same today. The only other way to look at this would be to decide what the people think of it to mean today...well, the courts don't do that either (see Atkins v. Virginia) so I find it hard to believe that \"evolving standards of decency\" is a good way to do it...it just makes judges do their own will.\n\n \n Spying on americans without a warrent by the Brittish was also well known to the writters of the constitution. As well as holding americans without trial or charge. This is why they put such prohibitions in the constitution. Are you saying that it is allright for the president to do these things in direct violation of the constitution? Who will hold him accountable? Certainly not congress or if you had your way the courts. Oh wait conservative did have their way that is why Samuel, yes Bush anything you say, Alito is on the court now.", 
   {}, 
   201753, 
   null, 
   1141842180.0
  ], 
  [
   201774, 
   null, 
   "doG", 
   "But the Constitution isn't law, it's a framework for forming laws. \n\n The Constitution is the law of laws. It is the foundation for law and as such it must be solid or everything built on top of it would crumble. \n \n \nThey knew that what people thought was cruel would change, so they left it subjective and gave the Supreme Court the responsibity to interpret, and reinterpret, as times changed. So yes, laws should be explicit and rigid. The framework for forming those laws must be flexible if the country is going to grow.\n\n What you advocate is that the framers intended for the court to legislate via judicial fiat. That being the case there is no need for Congress.", 
   {}, 
   201733, 
   null, 
   1141846380.0
  ], 
  [
   201777, 
   null, 
   "Kronus", 
   "The Constitution is the law of laws. It is the foundation for law and as such it must be solid or everything built on top of it would crumble. \n \n\n I think a better analogy is that it must be flexible or it will snap in the wind of change. And it really isn't the law of laws. As you said, laws need precision, and the Constitution is decidedly subjective in many places.\n \n \n\n What you advocate is that the framers intended for the court to legislate via judicial fiat. That being the case there is no need for Congress.\n\n I advocate no such thing. The Supreme Court has always had the job of interpreting the law in the light of the Constitution. The only question here is what guidelines they should use. In niether case do you have \"legislate via judicial fiat\", that's just a buzz phrase being thrown around by those who don't like recent decisions. If you don't think that's so, then cite me a law that the Supreme Court has written.", 
   {}, 
   201774, 
   null, 
   1141847640.0
  ], 
  [
   201778, 
   null, 
   "doG", 
   "then cite me a law that the Supreme Court has written.\n\n It is now SCOTUS sanctioned \"public use\" to seize private property and transfer it to another private owner for generating higher tax revenues...Kelo vs New London", 
   {}, 
   201777, 
   null, 
   1141847940.0
  ], 
  [
   201780, 
   null, 
   "Kronus", 
   "It is now SCOTUS sanctioned \"public use\" to seize private property and transfer it to another private owner for generating higher tax revenues...Kelo vs New London\n\n \n The SCOTUS didn't write any law. They simply held that the actions taken by the legislature of the city of New London didn't violate the constitution. You may disagree with the ruling, I know I'm not crazy about it, but I don't see how you can call it \"legislating via judicial fiat\". New London came up with the idea, all the SCOTUS did was green light it.", 
   {}, 
   201778, 
   null, 
   1141848840.0
  ], 
  [
   201782, 
   null, 
   "doG", 
   "The SCOTUS didn't write any law. They simply held that the actions taken by the legislature of the city of New London didn't violate the constitution. You may disagree with the ruling, I know I'm not crazy about it, but I don't see how you can call it \"legislating via judicial fiat\". New London came up with the idea, all the SCOTUS did was green light it.\n\n It's the result of a new interpretation of an old law that New London would never have gotten away with using a static Constitution. It's the whole living, breathing mentality that green lighted this atrocious ruling and it did effectively change the eminent domain laws through judicial fiat even if you don't think so.", 
   {}, 
   201780, 
   null, 
   1141849380.0
  ], 
  [
   201785, 
   null, 
   "Kronus", 
   "It's the result of a new interpretation of an old law that New London would never have gotten away with using a static Constitution. It's the whole living, breathing mentality that green lighted this atrocious ruling and it did effectively change the eminent domain laws through judicial fiat even if you don't think so.\n\n \n The definition of \"public use\" has changed frequently since the 1800's, and often in the direction of giving the government greater leeway. To say that this ruling is the result of some recent trend in \"judicial fiat\" isn't accurate, it ignores history. And I will again point out that it wasn't the SCOTUS who changed the law, it was the legislature of Connecticut and New London that did that. Your original complaint which I was addressing was that you thought the courts were legislating. They weren't, it was a legislature that was doing that. The legislature changed the law, they changed the definition. All the SCOTUS did was uphold it. A mistake, in my opinion, but not an example of judicial fiat or a new trend.", 
   {}, 
   201782, 
   null, 
   1141850160.0
  ], 
  [
   201830, 
   null, 
   "Steeeeve", 
   "Daewoo,\n \n you talked about jefferson. It is interesting to point out this quote from Jefferson:\n \n \nOn every question of construction, carry [y]ourselves back to the time when the Constitution was adopted, recollect the spirit manifested in the debates, and instead of trying what meaning may be squeezed out of the text, or invented against it, conform to the probable one in which it was passed.\n\n \n While I don't believe in using Jefferson to decide how to look at the constitution, since you quoted him I thought this quote takes out any thought on the \"living\" constitution.", 
   {}, 
   201785, 
   null, 
   1141865280.0
  ], 
  [
   201878, 
   null, 
   "daewoo", 
   "Daewoo,\n \n you talked about jefferson. It is interesting to point out this quote from Jefferson:\n \n Why I don't believe in using Jefferson to decide how to look at the constitution, since you quoted him I thought this quote takes out any thought on the \"living\" constitution.\n\n \n that is essentially the point I have been arguing. Changing the interpetation of a subjective phrase in the constitution does not make it a \"living document\". The phrase \"cruel and unusual\" by its very nature is going to change over time becuase even if the question of whether a punishment is \"cruel\" or not, what is \"unusual\" will certainly change. At one time, they put people in stocks. Even if we decided that putting people in stocks was not cruel, it would certianly be unusual in this day and age.", 
   {}, 
   201830, 
   null, 
   1141886220.0
  ], 
  [
   201911, 
   null, 
   "Steeeeve", 
   "that is essentially the point I have been arguing. Changing the interpetation of a subjective phrase in the constitution does not make it a \"living document\". The phrase \"cruel and unusual\" by its very nature is going to change over time becuase even if the question of whether a punishment is \"cruel\" or not, what is \"unusual\" will certainly change. At one time, they put people in stocks. Even if we decided that putting people in stocks was not cruel, it would certianly be unusual in this day and age.\n\n \n That is not what I believe Jefferson was saying...but it doesn't matter since I don't believe in following Jefferson.\n \n I have been ignoring this thread as another \"living\" one has come up somewhere else...\n \n \nIf your standard is that only the person who wrote the constitutions interpetation matters, you hve lost your argument fro the start. The consititution was essentially written by commitee. There is not one, single portion of the constitution that survived in its original drafted form. It was written, presented, re-written, re-presented. No one person wrote the constitution.\n My standard is actually more along the lines of orginial meaning..it means what it is meant at the time of adoption.\n \n \nYes, but in the real world, that is the way it is. \"Cruel and unusual\" is subjective terminology.\n In the \"living\" constitution world is seems to be a subjective term. I think like many terms in the constitution, it was \"obvious\" what it meant at the time. The term \"excessive bail\" is subjective today but during the debates people thought this one guy was crazy when he asked what \"excessive bail was\". At that point the passed another act which pretty much defined the term. In a way they had the congress define the terms of the constitution. Not really the way it works in our \"real world\" now, as you say. Maybe it should.\n \n \nI think a better analogy is that it must be flexible or it will snap in the wind of change. And it really isn't the law of laws. As you said, laws need precision, and the Constitution is decidedly subjective in many places.\n The commonly used one is that it will become brittle. The living constituiton doesn't provide flexibility...and I quote scalia now...it provides rigidity. As Scalia pointed out in the speech you haven't watched yet, the living constitution makes things set in stone. Abortion could be changed prior to a living constitution...now it is set in stone until we either get 1) new judges or 2) a constitutional amendment. Those two are much harder than just creating a law in a state. There is no flexibility at all with a living constitution.\n \n \nThe SCOTUS didn't write any law. They simply held that the actions taken by the legislature of the city of New London didn't violate the constitution.\n..because \"public use\" obviously means \"public good\". This is what happens when you don't have solid meanings for something. You could probably call it \"public want\" too. If the public doesn't like a certain business...say Hustler Magazine then public want kicks in and you tear down the building and kick them out. Talk about construeing the constitution...the 9th amendment may have meaning after all\n \nThe enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\n Kelo got his rights construed and thus denied. emoticon_xgood", 
   {}, 
   201878, 
   null, 
   1141920600.0
  ], 
  [
   201918, 
   null, 
   "daewoo", 
   "In the \"living\" constitution world is seems to be a subjective term. I think like many terms in the constitution, it was \"obvious\" what it meant at the time. The term \"excessive bail\" is subjective today but during the debates people thought this one guy was crazy when he asked what \"excessive bail was\". At that point the passed another act which pretty much defined the term. In a way they had the congress define the terms of the constitution. Not really the way it works in our \"real world\" now, as you say. Maybe it should.\n\n \n And if they had decided that a billion dollars was not excessive, hopefully the courts would have struck it down.\n \n Portions of the constitution are subjective. We cannot complain when the court interpets those portions. That is their job.", 
   {}, 
   201911, 
   null, 
   1141921560.0
  ], 
  [
   201924, 
   null, 
   "Steeeeve", 
   "And if they had decided that a billion dollars was not excessive, hopefully the courts would have struck it down.\n \n Portions of the constitution are subjective. We cannot complain when the court interpets those portions. That is their job.\n\n \n I think the point was, they thought the legislatures can decide what the bail limits are...it checks the power of the judges.\n \n Afterall, the legislature is not the one that decides bail, they also don't decide punishment although they do create a relm in which to decide it.", 
   {}, 
   201918, 
   null, 
   1141924920.0
  ], 
  [
   201939, 
   null, 
   "Steeeeve", 
   "Daewoo,\n \n Here is an article you might have already read; however, it is very interesting and gives a good idea of what Jefferson thought and maybe what the proper role of a judge should be.\n \n http://www.constitutionalfreedomfoundation.org/Articles/proper_role_judiciary.htm", 
   {}, 
   201924, 
   null, 
   1141928160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Constitution: Living or Not?", 
  "url": "http://www.4forums.com/political/politics-debates/7707-constitution-living-not.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 7707, 
  "discussion_files": [
   [
    "10943.html", 
    "http://www.4forums.com/political/politics-debates/7707-constitution-living-not-print.html"
   ], 
   [
    "10944.html", 
    "http://www.4forums.com/political/politics-debates/7707-constitution-living-not-4-print.html"
   ], 
   [
    "10945.html", 
    "http://www.4forums.com/political/politics-debates/7707-constitution-living-not-3-print.html"
   ], 
   [
    "10946.html", 
    "http://www.4forums.com/political/politics-debates/7707-constitution-living-not-2-print.html"
   ]
  ], 
  "identifier": 7707
 }
]