[
 [
  [
   201936, 
   null, 
   "chenaimoyo", 
   "i just need views on the following question. Should Political Scientists try to change the world and why??", 
   {
    "post_info": {
     "post_title": "should political scientists try to change the world?"
    }
   }, 
   null, 
   null, 
   1141927440.0
  ], 
  [
   201941, 
   null, 
   "simone", 
   "Um, when you say, \"Change the world,\" do you have a time frame in which this change is to occur?", 
   {}, 
   201936, 
   null, 
   1141928220.0
  ], 
  [
   201943, 
   null, 
   "Kronus", 
   "i just need views on the following question. Should Political Scientists try to change the world and why??\n\n \n In general I would say that if anyone thinks they can improve the world they should try. I don't see why political scientists would be exempt from that.", 
   {}, 
   201936, 
   null, 
   1141928400.0
  ], 
  [
   201964, 
   null, 
   "Alan Ryan", 
   "Isn't 'changing the world' part of the job description of liberal intellectuals (or is it intellectual liberals) ?", 
   {}, 
   201943, 
   null, 
   1141933680.0
  ], 
  [
   202014, 
   null, 
   "Dono", 
   "i just need views on the following question. Should Political Scientists try to change the world and why??\n\n Yes. Because it needs changing.\n Dono", 
   {}, 
   201936, 
   null, 
   1141953180.0
  ], 
  [
   202023, 
   null, 
   "Liminus", 
   "Throughout history, self-conscious, centrally imposed attempts to \"change the world\" have ended in disaster and failure. These attempts have always been based on blinkered political ideologies which are top-down theories; they start with the proposed utopia and then come up with ways to reach it.\n \n Examples would be Facist Germany, Communist Russia, Neoconservative US. You cannot implement change by forcing upon people a hypothesis formulated by a bunch of divorced-from-reality intellectuals sitting around and idealising.\n \n Real change has only, historically, come from revolutionary movements which come from within, and from below, and are essentially unpredictable and uncontrollable in nature, or from the collapse of a previously stable and dominating system.\n \n \"Political scientists\" should definitely be listened to in terms of small-scale 'social engineering', but any attempt at this on the large scale is impossible simply because large-scale change requires large-scale movements, which are created by large-scale problems. Most ideologies are unworkable, which is why our flawed Western democracy is the best we, as the most stable countries in the world, can come up with.", 
   {}, 
   202014, 
   null, 
   1141957320.0
  ], 
  [
   202055, 
   null, 
   "Jo Bennett", 
   "Counterexamples would be Gorbachev's Glasnost and Perestroika (sic), presumably.", 
   {}, 
   202023, 
   null, 
   1141990800.0
  ], 
  [
   202221, 
   null, 
   "Liminus", 
   "Counterexamples would be Gorbachev's Glasnost and Perestroika (sic), presumably.\n\n \n Fair enough, but those are examples of a political pragmatism which is unfortunately rare.", 
   {}, 
   202055, 
   null, 
   1142090160.0
  ], 
  [
   202222, 
   null, 
   "Jo Bennett", 
   "Also, communist Russia was the result of a twisting of political theory. Oorthodox Marxism makes it clear that positive change will be the result of a mass movement, not of Leninist small group revolution. Fascist Germany was largely based on Hitler's paranoid delusions, you can call Hitlers many things, but political theorist and intellectual are not among them.", 
   {}, 
   202221, 
   null, 
   1142091000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  should political scientists try to change the world?", 
  "url": "http://www.4forums.com/political/politics-debates/7725-should-political-scientists-try-change-world.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 7725, 
  "discussion_files": [
   [
    "12528.html", 
    "http://www.4forums.com/political/politics-debates/7725-should-political-scientists-try-change-world-print.html"
   ]
  ], 
  "identifier": 7725
 }
]