[
 [
  [
   202345, 
   null, 
   "Obvious Child", 
   "A lot of argument on moral issues now is based on inalienable 'rights'. This may be because they fit within a legal framework well. However, it seems to me that they can be problematic: a 'rights' system tends to make arbitary breaks: abortion on demand in any circumstance or no abortion in any circumstance etc.\n \n This is also a problem with Euthanasia: if it is someone's 'right to choose' then how can we discuss severity of illness etc? What if someone just gets dumped and wants to die, but thinks they might not carry suicide through properly? On the other hand, the 'rights' based opposition to Euthanasia sees people starved to death rather than killed swiftly and humanely.\n \n Are rights a useful framework at all?", 
   {
    "post_info": {
     "post_title": "Rights, Euthanasia and Abortion"
    }
   }, 
   null, 
   null, 
   1142190660.0
  ], 
  [
   202348, 
   null, 
   "Bassman", 
   "I don't think rights are a useful framework at all because rights tend to be extremely subjective. What is necessary to establish a moral framework is something objective, such as the Bible.", 
   {}, 
   202345, 
   null, 
   1142195820.0
  ], 
  [
   202441, 
   null, 
   "Obvious Child", 
   "I don't think rights are a useful framework at all because rights tend to be extremely subjective. What is necessary to establish a moral framework is something objective, such as the Bible.\nHow is the Bible objective and rights subjective? Both command the moral assent of certain people but fail to be universally recognised or capable of being proved, and both have stringent rules but large variation in interpretation.", 
   {}, 
   202348, 
   null, 
   1142263500.0
  ], 
  [
   202457, 
   null, 
   "Symbiote", 
   "a 'rights' system tends to make arbitary breaks: abortion on demand in any circumstance or no abortion in any circumstance etc.\n\n \n In the tradition of natural law, which the American government was originally based on, all rights stem from fairly simple first principles, a person owns their own body and property and can legitimately dispose of them in the manner they see fit, whether they be a phamacist and their property be abortion pills, or a woman and their property be their womb.\n \n With regards to euthanasia, the basic principle is the same. A person owns their body, they can dispose of it as they wish, but they cannot morally force others to assist them, because those others also own their own bodies and property.\n \n These rights aren't designed to fit within a legal framework, they are what the legal framework of the most prosperous societies that ever existed was based on. What they mean is that a government which violates the self-ownership of individuals is no longer a protector of the people but a violent aggressor against them.\n \n \n\n Are rights a useful framework at all?\n\n \n Yes. A proper understanding of rights is neccessary to know when you are aggressing against another person. Most children learn about rights intuitively through social interaction, a child take's another child's toy \"That's mine\", they say, they may fight over it, but they learn that when people lay contrary claims to things, violent conflict is the result.\n \n It is useful to refine this intuitive belief system into something consistent, both individually, and in shaping the law of a society. A society in which people work together through trade and friendship will always be more prosperous and safe than one in which rights are systematically ignored and violent conflict is the norm.\n \n It is not useful to talk about rights with people who treat them as subjective, based on value judgements, ie \"People have a right to life, because life is more valuable than being able to have an abortion\", or \"People have a right to have an abortion, because being able to have an abortion is more important than a fetus\". There is nothing to debate, we may as well go over whether strawberry or chocolate is a better flavour for a milkshake. In a free society we can disagree over what is \"more important\" and make our own choices, but if value judgements are used to determine law, the only possible outcome is the oppression of those with minority values.\n \n No argument can be made about value judgements, they do not convince anyone, they do not provide just solutions. Politically, to demand your values be enforced (by virtue of your political power) is to demand the rule of force rather than justice.\n \n There are only two choices: The rule of law, justice, a free society, built on the moral foundation of individual rights - or the rule of the majority, built on the arbitrary value judgements and preferences of those weilding power.", 
   {}, 
   202441, 
   null, 
   1142271720.0
  ], 
  [
   202612, 
   null, 
   "Obvious Child", 
   "Two things, Symbiote\n \n 1) what is the objective basis of rights that makes it different from other value judgements of the majority?\n 2) when two rights come into conflict, is the result always simple inaction?\n 3) is the importance of rights greater than democracy? Or is democracy a right? If the latter, how does this work with (2)?\n 4) how do you react to the fact that in the sorts of cases I mention the results of a rights system is clearly bad for individual people?", 
   {}, 
   202457, 
   null, 
   1142353560.0
  ], 
  [
   202614, 
   null, 
   "Symbiote", 
   "1) what is the objective basis of rights that makes it different from other value judgements of the majority?\n\n \n It isn't in itself a value judgement at all, it is descriptive rather than proscriptive. It isn't derived from the idea that certain things are desirable, but follows logically from the nature of reality.\n \n \n when two rights come into conflict, is the result always simple inaction?\n\n \n A system of rights derived from first principles cannot come into conflict with itself by its nature, just as the system of maths we use contains no contradictions by its nature. In contrast a system of \"rights\" built on peoples desires results in continual conflicts and debates over which \"right\" is \"more important\", for example does the \"right to keep and bear arms\", override the \"right to live in a safe neighbourhood\", etc. \n \n \n3) is the importance of rights greater than democracy? Or is democracy a right? If the latter, how does this work with (2)?\n\n \n I believe that a system of rights is superior to a system of democracy. The US by the way, was never intended to be a democracy, but a republic - the difference being that in a republic an individual has his rights respected, while in a democracy the will of majority is the law.\n \n The \"right to vote\" or \"right to democracy\" is perhaps the greatest offender in the drama of conflicting rights such made up rights create, because where the will of the majority is law, no other rights can possibly exist.\n \n \n) how do you react to the fact that in the sorts of cases I mention the results of a rights system is clearly bad for individual people?\n\n \n Something being bad for someone is a subjective judgment, and people will disagree about what is bad and what is good. We can respect the rights of people and allow them to promote what they believe is good within their own legitimate domains, or we can all go to war, literally, or at the ballot box, and try to impose our own view of what is good on everyone.\n \n We cannot have a situation which satisfies everyone, and which everyone agrees is good, it's just the nature of humanity that we have different preferences, and we must resolve these differences, peacefully or forcefully.", 
   {}, 
   202612, 
   null, 
   1142354460.0
  ], 
  [
   202637, 
   null, 
   "Obvious Child", 
   "It isn't in itself a value judgement at all, it is descriptive rather than proscriptive. It isn't derived from the idea that certain things are desirable, but follows logically from the nature of reality.\nOK, where's the proof that it is the nature of reality that people have rights?\n \n And if it's descriptive, we don't need to enforce it by law, anymore than we do gravity etc. If these rights don't prescribe things on us (like not breaking them) then no-one can complain about them being breached\n \n \nA system of rights derived from first principles cannot come into conflict with itself by its nature, just as the system of maths we use contains no contradictions by its nature. In contrast a system of \"rights\" built on peoples desires results in continual conflicts and debates over which \"right\" is \"more important\", for example does the \"right to keep and bear arms\", override the \"right to live in a safe neighbourhood\", etc.\nOK, so what human 'rights' are there? And are they at all useful for practical lawmaking on issues such as abortion and euthanasia (the topic of this thread)? \n \n \nI believe that a system of rights is superior to a system of democracy. The US by the way, was never intended to be a democracy, but a republic - the difference being that in a republic an individual has his rights respected, while in a democracy the will of majority is the law.\nActually, that depends. A republic just means somewhere without a king in general parlance, and a more general political item in its original Greek, e.g Plato.\n \n \nThe \"right to vote\" or \"right to democracy\" is perhaps the greatest offender in the drama of conflicting rights such made up rights create, because where the will of the majority is law, no other rights can possibly exist.\nWell, I thought that would be a problem... except if these rights are descriptive, why do we care if they don't exist?\n \n \nSomething being bad for someone is a subjective judgment, and people will disagree about what is bad and what is good. We can respect the rights of people and allow them to promote what they believe is good within their own legitimate domains, or we can all go to war, literally, or at the ballot box, and try to impose our own view of what is good on everyone.\nBut which we choose is itself a subjective judgement, and so rights have no superiority. Am I correct?\n \n In any case, I don't see how anyone could think it is better for a person if they are starved than killed outright.\n \n \nWe cannot have a situation which satisfies everyone, and which everyone agrees is good, it's just the nature of humanity that we have different preferences, and we must resolve these differences, peacefully or forcefully.\nIndeed. But why should we support rights?", 
   {}, 
   202614, 
   null, 
   1142362980.0
  ], 
  [
   207621, 
   null, 
   "Obvious Child", 
   "Symbiote???", 
   {}, 
   202637, 
   null, 
   1145194440.0
  ], 
  [
   231262, 
   null, 
   "Mrs Ketcham", 
   "A lot of argument on moral issues now is based on inalienable 'rights'. This may be because they fit within a legal framework well. However, it seems to me that they can be problematic: a 'rights' system tends to make arbitary breaks: abortion on demand in any circumstance or no abortion in any circumstance etc.\n \n This is also a problem with Euthanasia: if it is someone's 'right to choose' then how can we discuss severity of illness etc? What if someone just gets dumped and wants to die, but thinks they might not carry suicide through properly? On the other hand, the 'rights' based opposition to Euthanasia sees people starved to death rather than killed swiftly and humanely.\n \n Are rights a useful framework at all?\n\n \n Interesting points. Hhhhmmmmmm, I guess the \"right\" depends upon the position you take, really. Whose \"right\" is it to interfere with decisions made by a woman on her life when those who want this \"right\" will not be there during the duration of this decision?\n \n Whose \"right\" is it to tell someone suffering from a painful terminal illness they don't have the \"right\" to die?\n \n Individual versus society \"rights\". Me, I'd error on the individual's rights with laws in place to protect society....abortion on demand is the woman's right....killing yourself because some schmuck dumped you is not....that's societies' right to let the person know there is life after being dumped by someone. I oughta know....", 
   {}, 
   202345, 
   null, 
   1158519180.0
  ], 
  [
   231293, 
   null, 
   "Symbiote", 
   "OK, where's the proof that it is the nature of reality that people have rights?\n\n \n Well I like Hoppe's argumentation ethics approach.\n \n \nAnd if it's descriptive, we don't need to enforce it by law, anymore than we do gravity etc. If these rights don't prescribe things on us (like not breaking them) then no-one can complain about them being breached\n\n \n That doesn't really follow, it's like saying \"If gravity is just a statement about how the world is, we can live perfectly happily by ignoring it, now let me just step off this cliff\".\n \n A consistent system of rights is valuable because it allows for the settlement of diverse claims firstly without creating conflicts, and secondly without prioritising one person's set of rights over anothers.\n \n If you believe it is preferential to fight over everything than live in a peaceful society than no ethical system can stop you.", 
   {}, 
   231262, 
   null, 
   1158543480.0
  ], 
  [
   231296, 
   null, 
   "zachvac", 
   "Two things, Symbiote\n \n 1) what is the objective basis of rights that makes it different from other value judgements of the majority?\n 2) when two rights come into conflict, is the result always simple inaction?\n 3) is the importance of rights greater than democracy? Or is democracy a right? If the latter, how does this work with (2)?\n 4) how do you react to the fact that in the sorts of cases I mention the results of a rights system is clearly bad for individual people?\n\n \n \n hmm, that looks like more than two to me :)", 
   {}, 
   202612, 
   null, 
   1158545460.0
  ], 
  [
   231903, 
   null, 
   "GodIsDead", 
   "hey bassman\n \n this is a great question:\n \n \nHow is the Bible objective and rights subjective? Both command the moral assent of certain people but fail to be universally recognised or capable of being proved, and both have stringent rules but large variation in interpretation.\n\n \n you dont have any responce for this?", 
   {}, 
   202441, 
   null, 
   1158975960.0
  ], 
  [
   428769, 
   null, 
   "highya", 
   "If this topic sparks your interest maybe this website will too ...\n \n sowhoshoulddecide.weebly.com \n \n 'Death at the Hands of Humans' is a controversial site where you can voice your opinions and make your vote count. We are interested in what American's think of controversial issues that are important to our society.", 
   {
    "post_info": {
     "post_title": "Who SHould Decide?"
    }
   }, 
   231903, 
   null, 
   1304310600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rights, Euthanasia and Abortion", 
  "url": "http://www.4forums.com/political/worldviews/7738-rights-euthanasia-abortion.html", 
  "breadcrumbs": [
   "Worldviews"
  ], 
  "id_number": 7738, 
  "discussion_files": [
   [
    "11568.html", 
    "http://www.4forums.com/political/worldviews/7738-rights-euthanasia-abortion-print.html"
   ]
  ], 
  "identifier": 7738
 }
]