[
 [
  [
   202384, 
   null, 
   "C. Langana", 
   "Belief is a funny thing, on the one hand belief has led to some acts of charity, it's also led to a great many wars and other unpleasantness. That I think is the accepted (if notional on 4F) 'middle ground.' \n Now what's between a man's ears is generally considered his own property, his thoughts are his own if you will, if some other people happen to share them that's all very good. Assuming we accept this, then I wish to make a case for a theory of mine. \n \n 'Religion ought not to be such contentious issue, if indeed at all' or the 'The right to lunacy' theory. \n I put it to you that if a person so wishes, they may live their life in accordance to whatever set of principles they desire. Where two people of conflicting principles come into contact they ought not to resort to the traditional 'kill it with fire' approach but to simply understand that the other party is just plain mad and leave them to it, assuming this is mirrored on the behalf of the other party, then you can worship (or not) whatever you so wish to. \n That is a very general version of the theory but if one applies that to many so called questions of faith they suddenly seem rather less problematic. \n \n I would appreciate a less than rabid discussion and your thoughts please. \n \n Dislcaimer: This is not an attack on anyone or thing, nor should it be considered as such, indeed it is a plea for us to put aside what if looked at objectively is a rather pointless discussion, even if it is rather good fun.", 
   {
    "post_info": {
     "post_title": "Just a thought..."
    }
   }, 
   null, 
   null, 
   1142220780.0
  ], 
  [
   202429, 
   null, 
   "Matthew S", 
   "I generally agree with you people should be free to believe and live as they see fit. It is when one group decides they are better then everyone else and tries to impose their set of religious beliefs on others though the law that is the problem.", 
   {}, 
   202384, 
   null, 
   1142244480.0
  ], 
  [
   202438, 
   null, 
   "Adept", 
   "Where two people of conflicting principles come into contact they ought not to resort to the traditional 'kill it with fire' approach but to simply understand that the other party is just plain mad and leave them to it\n\n \n Unfortunately, many peoples principles conflict in such a way that their behaviour is affected by it. For example, an evangelistic christian community will outlaw gay marriage, because their principles don't include a 'live and let live' policy. Just a 'do as the bible says or else' policy.", 
   {}, 
   202384, 
   null, 
   1142259000.0
  ], 
  [
   202440, 
   null, 
   "Alan Ryan", 
   "On the 'right to lunacy' : Well, it wouldn't bother me if a neighbour erected an Aztec temple in his backyard and worshipped there at all hours. I suppose if he included human sacrifice among his rituals, I might report him to the police.\n \n But apart from lone eccentrics, people don't generally behave in atomistic ways. They perceive themselves as part of some sort of collectivity. That collectivity (or society) has a huge array of cultural bonds - among which are sets of common attitudes, values, and beliefs. Religious belief is one of those sets, or sub-sets.\n \n The assumptions about human rationality that are implicit in the opinion that \"Religion ought not to be such a contentious issue\", require examination.", 
   {}, 
   202438, 
   null, 
   1142263500.0
  ], 
  [
   202475, 
   null, 
   "Cheesejoff", 
   "Religions which only affect the people who believe in it should be left alone, yes.\n \n Religions which attempt to claim that they are 'right' or try to force something on someone else should not be.", 
   {}, 
   202440, 
   null, 
   1142277180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Just a thought...", 
  "url": "http://www.4forums.com/political/religion-debates/7739-just-thought.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7739, 
  "discussion_files": [
   [
    "14704.html", 
    "http://www.4forums.com/political/religion-debates/7739-just-thought-print.html"
   ]
  ], 
  "identifier": 7739
 }
]