[
 [
  [
   11358, 
   null, 
   "STAMFIELD", 
   "Did Adam and Eve have belly buttons? :xbanghead", 
   {
    "post_info": {
     "post_title": "Adam and Eve"
    }
   }, 
   null, 
   null, 
   1057147980.0
  ], 
  [
   11375, 
   null, 
   "grayhawk", 
   "LOL! Ok, I'll bite.\n Since a belly button is created by the umbilicus being removed and the creation of Adam and Eve was not a birth by the traditional sense, and there was no umbilicus I would say no they did not have navels. :)", 
   {}, 
   11358, 
   null, 
   1057222320.0
  ], 
  [
   11381, 
   null, 
   "STAMFIELD", 
   "OK..THATS LOGICAL...AND I AGREE but...HOW DID EVE PRODUCE OFFSPRING?.. WITHOUT A NAVEL FOR THE FOETUS' UMBILICUS TO GROW FROM??? :xbanghead", 
   {}, 
   11375, 
   null, 
   1057244520.0
  ], 
  [
   11411, 
   null, 
   "grayhawk", 
   "emoticon_confused emoticon_confused A fetus' umbilical cord is attached to a placenta that develops in the womb, not from the mother's existing navel. Once the egg is fertilized a child and a placenta grows. With identical twins each has an umbilicus to the same placenta, with fraternal twins each has a seperate placenta and umbilicus.\n A placenta once birth occurs is expelled from the mother's womb. The placenta must be expelled or it can kill the mother. This was often the cause of death for the mother in history after a traumatic birth. (infection caused by the decay of the placenta if not expelled)", 
   {}, 
   11381, 
   null, 
   1057304460.0
  ], 
  [
   11423, 
   null, 
   "Crim", 
   "Easy answer: There was no Adam or Eve.", 
   {}, 
   11411, 
   null, 
   1057350780.0
  ], 
  [
   11644, 
   null, 
   "LovetheSouth", 
   "That's fine if u think that, crim, just don't bother replying to this post. emoticon_frazzled", 
   {}, 
   11423, 
   null, 
   1057701840.0
  ], 
  [
   11914, 
   null, 
   "STAMFIELD", 
   "Grayhawk...thank you for your educated answer...just curious but now I understand...Wouldnt they look strange without belly buttons! LOL emoticon_xbye", 
   {}, 
   11411, 
   null, 
   1058046000.0
  ], 
  [
   12025, 
   null, 
   "grayhawk", 
   ":lol: I imagine we would have found it very odd. I knew a kid in high school who had surgery due to an injury and no longer had a belly button. It looked pretty funky. So yeah I'd say it'd look a little odd. ;)", 
   {}, 
   11914, 
   null, 
   1058334600.0
  ], 
  [
   12365, 
   null, 
   "katie5890", 
   "No they didnt since they didnt have umbilical cords", 
   {}, 
   12025, 
   null, 
   1059586740.0
  ], 
  [
   14918, 
   null, 
   "about0everythin", 
   "I heard this one from my great uncle.\n \n \n You know why there was Adam and Eve?\n \n \n 'Cause back then there was no Steve!\n \n \n \n \n HAHAHAHAHAHAHAHA!!!!!\n \n \n \n \n \n \n At least I thought it was funny\n \n If you didn't get this joke...it means that back then no one was gay.", 
   {}, 
   12365, 
   null, 
   1063329360.0
  ], 
  [
   15046, 
   null, 
   "katie5890", 
   "not really they could have been gay but didnt come out about it........ u never know", 
   {}, 
   14918, 
   null, 
   1063431360.0
  ], 
  [
   21171, 
   null, 
   "prolife", 
   "Actually {some} people in the bible were gay. In the Old Testement in the book of judges or Ruth im not certain, their was a guy that had traveled to a village with his concubine and back then it was custom well actually they didn't have hotels so you had to wait for somebody to invite you in. Then this guy got asked to come in, the people heard about it. I know this sounds absured. but they wanted to have sex with him {they were men} The guy was like no, but take his concubine and my virgin daughter and do what you please with them. Then only the concubine went out and she was abused and raped. Then when the guy woke up the next morning she was half dead so he cut her up into 12 pieces and sent them to the twelve tribes. \n This was meant to symbolize how badly Israel had gotten and how much they needed a theocratic king. Im taking bible class so i know this is what happened. Check it for yourself", 
   {}, 
   15046, 
   null, 
   1067825820.0
  ], 
  [
   21181, 
   null, 
   "gilligan8503", 
   "This was meant to symbolize how badly Israel had gotten and how much they needed a theocratic king. Im taking bible class so i know this is what happened. Check it for yourself\n\n no, you know what your teacher thinks about it.", 
   {}, 
   21171, 
   null, 
   1067831820.0
  ], 
  [
   21253, 
   null, 
   "Robbie", 
   "Might I put forth, Gilligan, you know what your teacher told you about Adam and Eve", 
   {}, 
   21181, 
   null, 
   1067885940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Adam and Eve", 
  "url": "http://www.4forums.com/political/fun-debates/774-adam-eve.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 774, 
  "discussion_files": [
   [
    "7601.html", 
    "http://www.4forums.com/political/fun-debates/774-adam-eve-print.html"
   ]
  ], 
  "identifier": 774
 }
]