[
 [
  [
   202627, 
   null, 
   "jim's trucking", 
   "http://www.cbsnews.com/stories/2006/03/09/60minutes/main1385230.shtml\n \n The Science Of Sexual Orientation\n March 12, 2006 \n \n (CBS) There are few issues as hotly contested - and as poorly understood - as the question of what makes a person gay or straight. It's not only a political, social, and religious question but also a scientific question, one that might someday have an actual, provable answer. \n \n The handful of scientists who work in this under-funded and politically charged field will tell you: That answer is a long way off. But as Lesley Stahl reports, their efforts are already yielding tantalizing clues. One focus of their research is twins.", 
   {
    "post_info": {
     "post_title": "This should make Matthew's day."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1142358480.0
  ], 
  [
   202636, 
   null, 
   "Master_Shake", 
   "I heard the other day someone is claiming that a man is 1/3 more likely to be gay for every older brother he has. Goodness, people are just looking everywhere aren't they. I suppose there's a correlation between the number of pet turtles you had that died before you were 11 and if you will be gay or not too.", 
   {}, 
   202627, 
   null, 
   1142362800.0
  ], 
  [
   202643, 
   null, 
   "jim's trucking", 
   "I heard the other day someone is claiming that a man is 1/3 more likely to be gay for every older brother he has. Goodness, people are just looking everywhere aren't they. I suppose there's a correlation between the number of pet turtles you had that died before you were 11 and if you will be gay or not too.\nThere's likely a study on that somewhere...conclusive of course.\n \n My question is if homosexuality is genetically determined, why is only one of the twins gay? Same mom...same womb...same time...same exposure to EVERYTHING!", 
   {}, 
   202636, 
   null, 
   1142364120.0
  ], 
  [
   202644, 
   null, 
   "georged", 
   "\n \n My question is if homosexuality is genetically determined, why is only one of the twins gay? Same mom...same womb...same time...same exposure to EVERYTHING!\n\n \n Add in generations of genes from both parents for that solution. Not unlike a redhead, baldness, etc. not appearing in every decendent right down the line.", 
   {}, 
   202643, 
   null, 
   1142366580.0
  ], 
  [
   202683, 
   null, 
   "Matthew S", 
   "What you don't get is that both boys are probably gay as this quote indicates \nWhen Stahl came for a visit, Jared was eager to show her his G.I. Joe collection. \"I have ones that say like Marine and SWAT. And then that's where I keep all the guns for 'em,\" he explained.\n what many heteros tend not to realize is tha there are masculine and fem gay men. masculine gay men tend to like manly things and fem gay men ten to like girly things. Did you notice that the fist things each boy showed was a doll?", 
   {}, 
   202627, 
   null, 
   1142389680.0
  ], 
  [
   202684, 
   null, 
   "Master_Shake", 
   "Did you notice that the fist things each boy showed was a doll?\n\n Not a doll, an ACTION FIGURE! emoticon_xangel", 
   {}, 
   202683, 
   null, 
   1142389920.0
  ], 
  [
   202686, 
   null, 
   "Matthew S", 
   "Not a doll, an ACTION FIGURE! emoticon_xangel\n\n \n \n Yeah right a doll is a doll", 
   {}, 
   202684, 
   null, 
   1142393100.0
  ], 
  [
   202697, 
   null, 
   "Master_Shake", 
   "Yeah right a doll is a doll\n\n :xbanghead Oh goodness gracious. It was a joke.", 
   {}, 
   202686, 
   null, 
   1142403060.0
  ], 
  [
   202702, 
   null, 
   "Iuris", 
   "Genetically predetermined or consciously chosen, I don't really care much. Either way, if it doesn't harm others (or prevent them from advancing of their own accord), I don't see any reason to prohibit it.\n \n While my position on homosexuality is somewhat complex, I don't see it as something harmful (at least not beyond very low levels), and if left alone, has negligible impact on universal progress of humanity.", 
   {}, 
   202697, 
   null, 
   1142412720.0
  ], 
  [
   202713, 
   null, 
   "Matthew S", 
   ":xbanghead Oh goodness gracious. It was a joke.\n\n \n I know you were. My sarcasm dosen't translate very well in writing.", 
   {}, 
   202697, 
   null, 
   1142428020.0
  ], 
  [
   202737, 
   null, 
   "Master_Shake", 
   "I know you were. My sarcasm dosen't translate very well in writing.\n\n Okeydoke. Sarcasm in general doesn't translate well in writing. I've learned that the hard way.", 
   {}, 
   202713, 
   null, 
   1142448840.0
  ], 
  [
   203268, 
   null, 
   "Scactha", 
   "It's as relevant to have issues with homosexuals as colourblind or left handed people and all about the viewer imposing idéas on the world.", 
   {
    "unicode_changes_made": true
   }, 
   202737, 
   null, 
   1142861400.0
  ], 
  [
   203621, 
   null, 
   "Master_Shake", 
   "It's as relevant to have issues with homosexuals as colourblind or left handed people and all about the viewer imposing idéas on the world.\n\n What? I have a guess as to what you meanby this, but its worded very oddly.", 
   {
    "unicode_changes_made": true
   }, 
   203268, 
   null, 
   1143059400.0
  ], 
  [
   203724, 
   null, 
   "Scactha", 
   "Like this; ever heard about anyone saying that colour blind people made a conscious choice? Or someone who doesn't like coffe? Yet no one seems to have much issue with that. Sexual preferences though; suddenly alot of people are willing to impose their views and offer opinions.", 
   {
    "unicode_changes_made": true
   }, 
   203621, 
   null, 
   1143121500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  This should make Matthew's day.", 
  "url": "http://www.4forums.com/political/current-events-debates/7749-should-make-matthews-day.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7749, 
  "discussion_files": [
   [
    "18261.html", 
    "http://www.4forums.com/political/current-events-debates/7749-should-make-matthews-day-print.html"
   ]
  ], 
  "identifier": 7749
 }
]