[
 [
  [
   202786, 
   null, 
   "Bassman", 
   "Fla. Girl's Killer Gets Death Sentence \n \n By MITCH STACY \n Associated Press Writer\n \n \n \n \nSARASOTA, Fla. (AP) -- A former mechanic convicted of raping and murdering 11-year-old Carlie Brucia, whose abduction was caught on a car wash security camera, was sentenced to death Wednesday for her murder.\n \n The jury that convicted Joseph P. Smith in November had recommended by a vote of 10-2 that he be executed.\n \n Smith, 39, showed no emotion Wednesday as state Circuit Judge Andrew Owens read the official sentences - death for the murder count and life in prison for kidnapping and sexual battery.\n \n Last month, Smith had tearfully apologized during a hearing, saying: \"I take responsibility of my crimes. I don't understand how this could have happened. ... Every day I think about what I did and beg God for forgiveness.\"\n \n He said he had taken heroin and cocaine in an attempt to kill himself before he abducted Carlie on Feb. 1, 2004. Smith said he didn't remember much about that day and asked Owens to spare him for the sake of his family. His attorney, Adam Tebrugge, argued that Smith could lead a productive life in prison and be a positive influence on his three daughters if he was spared.\n \n Owens discounted those arguments Wednesday. He said Carlie suffered \"unspeakable terror and physical suffering\" at Smith's hands.\n \n Carlie's body was found four days after her disappearance on the grounds of a Sarasota church. News of the crime shook the community, and hundreds turned out for memorial services.\n \n Absent from the courtroom was Carlie's mother, Susan Schorpen, who is in jail in Pinellas County on drug and prostitution charges. She has said the pain of losing her daughter led her to institutionalize herself three times and take drugs to numb the pain.\n \n \n emoticon_xkill emoticon_xkill emoticon_xkill", 
   {
    "post_info": {
     "post_title": "Justice was served."
    }
   }, 
   null, 
   null, 
   1142469540.0
  ], 
  [
   203331, 
   null, 
   "Ooaman", 
   "Well, except for the guy's family...\n \nHe said he had taken heroin and cocaine in an attempt to kill himself before he abducted Carlie on Feb. 1, 2004. Smith said he didn't remember much about that day and asked Owens to spare him for the sake of his family. His attorney, Adam Tebrugge, argued that Smith could lead a productive life in prison and be a positive influence on his three daughters if he was spared.\n", 
   {}, 
   202786, 
   null, 
   1142898060.0
  ], 
  [
   203342, 
   null, 
   "Bassman", 
   "Well, except for the guy's family...\n\n Yes, unfortunately, but since Joseph Smith was found guilty of murder 1 with aggravating circumstances, the law must be applied.", 
   {}, 
   203331, 
   null, 
   1142899260.0
  ], 
  [
   203367, 
   null, 
   "zachvac", 
   "Yes, unfortunately, but since Joseph Smith was found guilty of murder 1 with aggravating circumstances, the law must be applied.\n\n \n Sure. Doesn't mean it's right though.", 
   {}, 
   203342, 
   null, 
   1142908020.0
  ], 
  [
   203384, 
   null, 
   "Bassman", 
   "Sure. Doesn't mean it's right though.\n\n I don't know if I've stated my position on the Death Penalty here, before, but here it is. I generally do support the idea of having the Death Penalty for certain crimes. And the kidnapping, rape and murder of an 11-year-old girl certainly meet the criteria. I also examine the issue on a case-by-case basis. For example, if I feel that a person convicted of murder should be spared, then yes (s)he should be spared. Another example is this. In 1997, Buffalo, NY Police Officer Charles \"Skip\" McDougald was gunned down by Jonathan Parker. Parker has a rap sheet as long as my left arm and killed a police officer while in the act of another crime (I believe it was drug related). He was the first Death Penalty case in Erie County in a long time. The jury came back with a recommendation of life imprisonment. Although I disagreed with the jury, I accepted the verdict and the fact that the system was flawless in that case.", 
   {}, 
   203367, 
   null, 
   1142913240.0
  ], 
  [
   203394, 
   null, 
   "zachvac", 
   "I don't know if I've stated my position on the Death Penalty here, before, but here it is. I generally do support the idea of having the Death Penalty for certain crimes. And the kidnapping, rape and murder of an 11-year-old girl certainly meet the criteria. I also examine the issue on a case-by-case basis. For example, if I feel that a person convicted of murder should be spared, then yes (s)he should be spared. Another example is this. In 1997, Buffalo, NY Police Officer Charles \"Skip\" McDougald was gunned down by Jonathan Parker. Parker has a rap sheet as long as my left arm and killed a police officer while in the act of another crime (I believe it was drug related). He was the first Death Penalty case in Erie County in a long time. The jury came back with a recommendation of life imprisonment. Although I disagreed with the jury, I accepted the verdict and the fact that the system was flawless in that case.\n\n \n Here's my view of the death penalty.\n \n In all cases, the first punishment shouldn't be the death penalty. I would reccomend solitary confinement for life in cases such as this. This is cheaper than the death penalty, and the criminal actually has to live like that the rest of their life.\n \n BUT...\n \n should the criminal make any attempt at breaking out, harming another prisoner or guard, then the death penalty becomes possible in my scenario. If they are still a threat while alive, then kill them, but in most cases they will be fine in prison especially if in solitary confinement.", 
   {}, 
   203384, 
   null, 
   1142916180.0
  ], 
  [
   203399, 
   null, 
   "Bassman", 
   "I like that. However, one advantage with the Death Penalty is you can use it as leverage in plea bargains.", 
   {}, 
   203394, 
   null, 
   1142919060.0
  ], 
  [
   203401, 
   null, 
   "zachvac", 
   "I like that. However, one advantage with the Death Penalty is you can use it as leverage in plea bargains.\n\n \n I don't like that idea. We leave open something that would cost more, serve no purpose (other than revenge, not a legitimate reason in my book), and that may possibly kill an innocent person? Just because if we didn't we wouldn't have something to plea bargain with? What if they are innocent, but out of fear of death they agree to the plea bargain?", 
   {}, 
   203399, 
   null, 
   1142921040.0
  ], 
  [
   203404, 
   null, 
   "Ooaman", 
   "I don't like that idea. We leave open something that would cost more, serve no purpose (other than revenge, not a legitimate reason in my book), and that may possibly kill an innocent person? Just because if we didn't we wouldn't have something to plea bargain with? What if they are innocent, but out of fear of death they agree to the plea bargain?\n\n Oh, everyone knows they're guilty if the jury finds them guilty.emoticon_rolleyes I'm sorry. I agree here but I was going for sarcastic which doesn't work as well on a typed message. So I went with the eye rolls. First off, the jury is comprised of 12 people. People are human and are subject to make mistakes. Whether or not it's on purpose or accident, they are proned to make mistakes. That's part of being human.", 
   {}, 
   203401, 
   null, 
   1142923860.0
  ], 
  [
   203407, 
   null, 
   "Bassman", 
   "Point taken. However, try to see this from the victim's (or in these cases, their families.", 
   {}, 
   203404, 
   null, 
   1142924820.0
  ], 
  [
   203785, 
   null, 
   "Ooaman", 
   "Point taken. However, try to see this from the victim's (or in these cases, their families.\n\n Well, almost everyone one invovled was a victum. Granted, I know you're talking about the girl, and then the girls mother. But then again, the guy himself was a victum, giving into drugs and also trying to hurry his life to an end. His family will no longer have him in the family (of course if he commited suicide, he wouldn't be anyway.)", 
   {}, 
   203407, 
   null, 
   1143158640.0
  ], 
  [
   204104, 
   null, 
   "GreenMtnBoy", 
   "emoticon_xkill emoticon_xkill emoticon_xkill\n\n \n \n Revenge is something you think will taste sweet, but only leaves a bitter taste in your mouth.", 
   {}, 
   202786, 
   null, 
   1143351600.0
  ], 
  [
   204143, 
   null, 
   "jitobear", 
   "I just do not like the death penalty. People tend assume that is because I feel squishy about killers. I don't.\n \n I don't like it because of:\n \n 1 - Human error potential\n 2 - Costs too much\n 3 - Inequities in representation (meaning if you have the money you can afford a team of good lawyers so it's generally only the poor who see the chair)\n 5 - It requires good people to do bad things. I think the job \"executioner\" would be one that few people of good conscious could hold without signifigant levels of stress.\n 4 - Any power granted is a potential power abused and I don't want the government (or the people) to have this kind of power.", 
   {}, 
   204104, 
   null, 
   1143385620.0
  ], 
  [
   204174, 
   null, 
   "daewoo", 
   "Suprisingly, I find myself in complete agreement with Jitobear on this. \n \n Either it is wrong to kill people or it is not. If it is worng, then we should not do it. If it is not, then we should not be putting people on trial for murder. 2 wrongs do not make a right.\n \n I also agree that the power to end its own citizens lives is not one I want the government to have. A Jito points out, the potential for abuse is very real, and really...how many powers does our government have that it has NOT abused at some point?", 
   {}, 
   204143, 
   null, 
   1143401100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Justice was served.", 
  "url": "http://www.4forums.com/political/current-events-debates/7754-justice-served.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7754, 
  "discussion_files": [
   [
    "23651.html", 
    "http://www.4forums.com/political/current-events-debates/7754-justice-served-print.html"
   ]
  ], 
  "identifier": 7754
 }
]