[
 [
  [
   202948, 
   null, 
   "jim's trucking", 
   "While you will likely not see much coverage from the MSM in regard to the continuing flow of documents from Iraq confirming WMD and plans for more, the truth will gradually seep out. It has a way of doing just that...much to the chagrin of the opponents of its exposure.\n \n http://www.investors.com/editorial/IBDArticles.asp?artsec=20&issue=20060316\n \n Issues & Insights\n Declassified Truth\n Posted 3/16/2006\n The War On Terror: The government is finally getting around to unloading some of Saddam Hussein's secret documents. A look at just a few pages already leads to some blockbuster revelations.\n \n In the early stages of the war that began three years ago, the U.S. captured thousands of documents from Saddam and his spy agency, the Mukhabarat. It's been widely thought the documents could shed light on why Saddam behaved as he did and how much of a threat his evil regime represented.\n \n Yet, until this week, the documents lay molding in boxes in a government warehouse. Now the first batch is out, and though few in number, they're loaded with information.\n \n Among the enduring myths of those who oppose the war is that Saddam, though murderous when it came to his own people, had no weapons of mass destruction and no terrorist designs outside his own country. Both claims now lie in tatters.\n \n As we've reported several times, a number of former top military officials in Saddam's regime have come forward to admit that, yes, Saddam had WMD, hid them and shipped them out of the country so they couldn't be detected. And he had plans to make more.\n \n Now come more revelations that leave little doubt about Saddam's terrorist intentions. Most intriguing from a document dump Wednesday night is a manual for Saddam's spy service, innocuously listed as CMPC-2003-006430. It makes for interesting reading.\n \n Here, for instance, are the marching orders for Directorate 8, the Mukhabarat's \"Technical Affairs\" department: \"The Eight Directorate is responsible for development of materials needed for covert offensive operations. It contains advanced laboratories for testing and production of weapons, poisons and explosives.\"\n \n It goes on. Directorate 9, we discover, \"is one of the most important directorates in the Mukhabarat. Most of its work is outside Iraq in coordination with other directorates, focusing on operations of sabotage and assassination.\"\n \n The document also discusses the Mukhabarat's Office 16, set up to train \"agents for clandestine operations abroad.\" The document helpfully adds that \"special six-week courses in the use of of terror techniques are provided at a camp in Radwaniyhah.\"\n \n Got that? Terror techniques.\n \n Even as the media studiously avoid these new documents - just as they avoided 500 hours of Saddam's personal tapes showing his scheming on WMD - it's clear the U.S. did the right thing in invading Iraq and taking out a formative terrorist threat.\n \n Saddam had close ties to al-Qaida. That's not just our opinion, but also that of the 9-11 Commission Report that so many in the media have selectively cited to bolster the case against the war.\n \n As Chairman Thomas Kean said the day the report was released: \"There was no question in our minds that there was a relationship between Iraq and al-Qaida.\"\n \n As such, we were heartened to see that President Bush on Thursday reaffirmed the U.S. will continue to fight a pre-emptive war on terror - accompanied by news that the U.S. had launched Operation Swarmer, its largest anti-insurgent offensive since 2003.\n \n Polls be damned - that's how a war is fought.", 
   {
    "post_info": {
     "post_title": "Attention...all you hardheaded Bush bashers!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1142620620.0
  ], 
  [
   202951, 
   null, 
   "daewoo", 
   "ROTFLMAO\n \n Let it go, Jim. You just keep making yourself look dumber. \n \n THERE COULD NOT POSSIBLY HAVE BEEN WMDS WITHOUT PRODUCTION AND STORAGE FACILITES. PRODUCTION AND STORAGE FACILITES CANNOT BE MOVED OUT OF THE COUNTRY.\n \n This cracks me up almost as much as the article you posted the other day as \"proof\" with the Iraqi saying that \"The factories exist in our minds\". What could possibly be better proof than the fact that you an one of Saddams aids share the same delusion. He believed in imaginary WMDs as well. The difference is that he understood, and admitted, that they were imaginary. You keep trying to pretend that they are real. :xbanghead \n \n LMAO LMAO", 
   {}, 
   202948, 
   null, 
   1142621280.0
  ], 
  [
   202952, 
   null, 
   "jim's trucking", 
   "ROTFLMAO\n \n Let it go, Jim. You just keep making yourself look dumber. \n \n THERE COULD NOT POSSIBLY HAVE BEEN WMDS WITHOUT PRODUCTION AND STORAGE FACILITES. PRODUCTION AND STORAGE FACILITES CANNOT BE MOVED OUT OF THE COUNTRY.\n \n This cracks me up almost as much as the article you posted the other day as \"proof\" with the Iraqi saying that \"The factories exist in our minds\". What could possibly be better proof than the fact that you an one of Saddams aids share the same delusion. He believed in imaginary WMDs as well. The difference is that he understood, and admitted, that they were imaginary. You keep trying to pretend that they are real. :xbanghead \n \n LMAO LMAO\nPerhaps if you keep laughing your XXX off, soon you'll be completely gone.\n \n I tend to believe more of what comes from captured documents and statements of former Iraqi military than ridiculous 'logic' from the left. Frankly, I've tired of butting heads. You either have a weak understanding of construction possibilities or you simply deny the possibilities for sake of argument.\n \n On edit: Your cap statement is not logical. One doesn't have to own a Ford plant to have a Ford. One doesn't have to own WMD production facilities to own WMDs. Since Saddam has used WMDs in the past, there should be no denial that he was capable of obtaining them from somewhere.", 
   {}, 
   202951, 
   null, 
   1142622060.0
  ], 
  [
   202953, 
   null, 
   "Kronus", 
   "\n \n In the early stages of the war that began three years ago, the U.S. captured thousands of documents from Saddam and his spy agency, the Mukhabarat. It's been widely thought the documents could shed light on why Saddam behaved as he did and how much of a threat his evil regime represented.\n \n Yet, until this week, the documents lay molding in boxes in a government warehouse. Now the first batch is out, and though few in number, they're loaded with information.\n \n\n \n You really need to stop taking editorials and thinking they present facts. Think about this for a minute. Are we really supposed to believe that the army siezed importants documents from Saddam, and we just now got around to looking at them? Three years later? The lack of MWD's has been a huge embarrasment for Bush, do you really believe that he would just let potentially useful documents sit there for years before thinking to take a peek at them? This is obviously just another smokescreen being thrown up to give the party diehard faithful something to grasp at. Don't let yourself be suckered in.", 
   {}, 
   202948, 
   null, 
   1142622360.0
  ], 
  [
   202960, 
   null, 
   "jim's trucking", 
   "You really need to stop taking editorials and thinking they present facts. Think about this for a minute. Are we really supposed to believe that the army siezed importants documents from Saddam, and we just now got around to looking at them? Three years later? The lack of MWD's has been a huge embarrasment for Bush, do you really believe that he would just let potentially useful documents sit there for years before thinking to take a peek at them? This is obviously just another smokescreen being thrown up to give the party diehard faithful something to grasp at. Don't let yourself be suckered in.\nThe documents were captured after the invasion and while the major fighting was going on. I doubt anybody would stop to read them in the middle of battle.\n \n All I'm saying is that more and more truth is oozing out of Iraq. I'm sure rumors will fly from now on and we don't really know what to believe until some proof is presented.", 
   {}, 
   202953, 
   null, 
   1142624460.0
  ], 
  [
   202961, 
   null, 
   "daewoo", 
   "You really need to stop taking editorials and thinking they present facts. Think about this for a minute. Are we really supposed to believe that the army siezed importants documents from Saddam, and we just now got around to looking at them? Three years later? The lack of MWD's has been a huge embarrasment for Bush, do you really believe that he would just let potentially useful documents sit there for years before thinking to take a peek at them? This is obviously just another smokescreen being thrown up to give the party diehard faithful something to grasp at. Don't let yourself be suckered in.\n\n \n If you search around for articles regarding these new papers, you quickly find that they are being misrepresented in this article. They are not just now being read, they are just now being declassified, and apparently selectively. This means that the Bush administration had access to them when they admitted they had made a mistake and there were no WMDs, and also that congress had access to them when they admitted that the bush adminsitration was mistaken and there were no WMDs.\n \n You are absolutly correct that this is another smokescreen, and not a very convincing one. It is almost funny (buy mostly just pathetic) to watch the truly delusional try to hold up this garbage in a sad attempt to reiterate their completely discredited theory. \n \n From a realisitc standpoint, in order for these insane claims to be true, we would need to find massive production and storage facilites that not only did the UN teams miss in their years of investigation, but that our own guys missed post invasion, despite having unfettered access to the entire country.", 
   {}, 
   202953, 
   null, 
   1142625420.0
  ], 
  [
   202964, 
   null, 
   "Kronus", 
   "The documents were captured after the invasion and while the major fighting was going on. I doubt anybody would stop to read them in the middle of battle.\n \n\n \n Jim, listen to yourself. We're not talking about last week or last month. It's been 3 years! Bush has been desperate for anything that supports his WMD claims. Do you really think he just forgot that he had a bunch of Saddam's secret documents lying around? For 3 years? Open your eyes, and use your critical judgement. There's simply no way that can possibly be true. The editorial lied to you, and you bought it.", 
   {}, 
   202960, 
   null, 
   1142627760.0
  ], 
  [
   202967, 
   null, 
   "jim's trucking", 
   "Jim, listen to yourself. We're not talking about last week or last month. It's been 3 years! Bush has been desperate for anything that supports his WMD claims. Do you really think he just forgot that he had a bunch of Saddam's secret documents lying around? For 3 years? Open your eyes, and use your critical judgement. There's simply no way that can possibly be true. The editorial lied to you, and you bought it.\nI don't know that the editor lied or not...and neither do you....and don't try to tell me that Bush is aware of every single thing that happens in the field.", 
   {}, 
   202964, 
   null, 
   1142628420.0
  ], 
  [
   202975, 
   null, 
   "Steeeeve", 
   "Think about this for a minute. Are we really supposed to believe that the army siezed importants documents from Saddam, and we just now got around to looking at them? Three years later? \n Would this honestly surprise you?", 
   {}, 
   202953, 
   null, 
   1142631000.0
  ], 
  [
   202976, 
   null, 
   "Steeeeve", 
   "Anyway,\n \n It seems the WMD matter is irrelevant at this stage in the game. Not like we can go \"oh...no WMD...well....ahhhh...sorry....bye\".\n \n So if there were or were not is not really important to me at least.", 
   {}, 
   202975, 
   null, 
   1142631180.0
  ], 
  [
   202980, 
   null, 
   "Dono", 
   "I don't know that the editor lied or not...and neither do you....and don't try to tell me that Bush is aware of every single thing that happens in the field.\n\n I would NEVER say that. I believe that the things Bush is not aware of might fill a wing of his new library.\n Dono", 
   {}, 
   202967, 
   null, 
   1142632860.0
  ], 
  [
   202988, 
   null, 
   "Kronus", 
   "I don't know that the editor lied or not...and neither do you....and don't try to tell me that Bush is aware of every single thing that happens in the field.\n\n \n Actually, I do know he lied. Or misled, prevaricated, pick the synonym of your choice. He deliberately tried to mislead his readers into believing something that wasn't true. And you seem to be a willing victim. Rather than face the truth you're trying to turn finding a cache of Saddam's secret documents which would prove Bush's WMD claims into a \"little thing\" that Bush, not to mention everyone in the Bush administration, army intelligence, cia, homeland security, etc etc, could easily overlook for 3 years. As little as I think of Bush's administration not even I can except that level of incompetance from so many people. Whoever found proof of the existence of WMD would be a hero to Bush; you really think no one figured that checking out Saddam's papers might turn up something that could make them look good? For three years? No way.", 
   {}, 
   202967, 
   null, 
   1142636820.0
  ], 
  [
   203029, 
   null, 
   "Matthew S", 
   "Anyway,\n \n It seems the WMD matter is irrelevant at this stage in the game. Not like we can go \"oh...no WMD...well....ahhhh...sorry....bye\".\n \n So if there were or were not is not really important to me at least.\n\n \n \n I think it is important to the 2000 or more american troops and the over 100000 thousand Iraqis that would still be alive if the US hadn't invaded because of a lie.", 
   {}, 
   202976, 
   null, 
   1142684940.0
  ], 
  [
   203044, 
   null, 
   "Bassman", 
   "Or how about the tens of thousands of Kurds and Iraquis that were raped, tortured, and murdered under the regime of Saddam?", 
   {}, 
   203029, 
   null, 
   1142698140.0
  ], 
  [
   203046, 
   null, 
   "daewoo", 
   "Or how about the tens of thousands of Kurds and Iraquis that were raped, tortured, and murdered under the regime of Saddam?\n\n \n Now thye are being raped, tortured, and myrdered under another US backed regime, plus we killed over 100,000 on the way in, and it looks increasingly like they will get to enjoy a civil war to boot. It does not seem like we have improved things much. In fact, it almost seems like we have made things worse.", 
   {}, 
   203044, 
   null, 
   1142698860.0
  ], 
  [
   203047, 
   null, 
   "Bassman", 
   "So you think running away will solve this?", 
   {}, 
   203046, 
   null, 
   1142699340.0
  ], 
  [
   203048, 
   null, 
   "georged", 
   "So you think running away will solve this?\n\n \n Running away from a country where the residents of that country want us gone? That's a very strange definition, almost sounding like a conquerer statement. \n \n January 2005: 82 percent of Sunni Arabs and 69 percent of Shiites favor US withdrawal ãeither immediately or after an elected government is in place.ä (Zogby)", 
   {}, 
   203047, 
   null, 
   1142701440.0
  ], 
  [
   203049, 
   null, 
   "daewoo", 
   "So you think running away will solve this?\n\n \n As George points out, it is not so much running away as being kicked out. \n \n Last I heard, 80% of Iraqis think that we are the problem. We seem to think we are the solution. I know it is difficult, especially if you are one of the truly sick and twisted who believe that America knows what is best for everybody, but maybe it is time to accept that the Iraqis probably know more about what is the problem and what is likely to be the solution than we do, and let them put their own house in order.", 
   {}, 
   203047, 
   null, 
   1142702700.0
  ], 
  [
   203054, 
   null, 
   "Steeeeve", 
   "I think it is important to the 2000 or more american troops and the over 100000 thousand Iraqis that would still be alive if the US hadn't invaded because of a lie.\n\n \n 1) how do you know it was a lie? \n \n 2) no it wouldn't be important to them...they are already dead. \n \n 3) It doesn't matter to the current troops because we are already there and it doesn't look like that will change regardless of WMDs", 
   {}, 
   203029, 
   null, 
   1142704020.0
  ], 
  [
   203055, 
   null, 
   "Steeeeve", 
   "As George points out, it is not so much running away as being kicked out. \n \n Last I heard, 80% of Iraqis think that we are the problem. We seem to think we are the solution. I know it is difficult, especially if you are one of the truly sick and twisted who believe that America knows what is best for everybody, but maybe it is time to accept that the Iraqis probably know more about what is the problem and what is likely to be the solution than we do, and let them put their own house in order.\n\n \n no, I have no reason to believe they understand what the problem is (which is their whacked out beliefs)...but I also have no reason to believe we know how to deal with that. So yeah, we may know the problem but if they don't it doesn't do us much good :)\n \n I think with Iraq, we should have gone with a more inhumane strategy. I think someone said it in another thread, if you want to gain their respect you gotta show them who is boss and then start changing from there (I think it was Daewoo actually). We seem to be acting more like a big bully then a true leader...something we can't exactly fix now.", 
   {}, 
   203049, 
   null, 
   1142704440.0
  ], 
  [
   203059, 
   null, 
   "daewoo", 
   "no, I have no reason to believe they understand what the problem is (which is their whacked out beliefs)...but I also have no reason to believe we know how to deal with that. So yeah, we may know the problem but if they don't it doesn't do us much good :)\n\n \n that is the kin dof ignorant arrogance that got us into this mess in the first place. What is a \"good\" idea for America (or in america) is generally not going to be as good an idea for a traditionally tribal system based on several millinia of tradition. \n \n Americas lack of history has really worked against us in this. I was watching a deal about the Iraq war a while back adn they were showing a guy arguing with US troops. They had bulldozed his olive grove because insurgents had been hiding in it and attacking the road. They didn't suspect the guy of aiding, harborinbg, or being one of the insurgents, they were jusy eliminating cover. That olive grove had been in the guys family for 1500 years...ONE THOUSAND, FIVE HUNDRED years. The US commander on the scene was baffled about why the guy was so upset. After all, we paid him for the destroyed grove (almost $10,000). \n \n Our entire view of the middle east has been badly warped by the fact that America is little more than a baby throwing a temper tantrum when you put us up against the culture of the ME. We have no concept of the importance of a tribal law that goes back 10,000 years. We expect the arabs to simply abandon their customs that were in place a thousand years before Rome was even a village. And maybe the worst thing is that we expect them to do this with absolutly no understanding of life in the midle east or waht is required to survive in such a harsh climate and in a land with few natural resources. \n \n \nI think with Iraq, we should have gone with a more inhumane strategy. I think someone said it in another thread, if you want to gain their respect you gotta show them who is boss and then start changing from there (I think it was Daewoo actually). We seem to be acting more like a big bully then a true leader...something we can't exactly fix now.\n\n \n I serously doubt I said this, and if I did, you are taking it completely out of context here. How much more inhumane could we have really been? We killed 100,000 + on the way in by bombing civilian areas and showing complete disregard for Iraqi civilians lives. We have leveld cities that have stood for thousands of years. As soon as we had a firm enough foothold to allow it, we started mass arrests (without charges) and torturing and murdering people. \n \n Brutality breeds dissent. More brutality=more insurgents= more dead americans.\n \n It is our inhumanity that got us into this mess. If we had not supprted Saddam, a tyrant, he would have been deposed years ago. If we had not supproted tyrants in Saudi Arabia, israel, and elsewhere in the ME, there would have been no 9/11 attacks, and we would not be waging war anywhere right now. We ###### in our own cheerios.", 
   {}, 
   203055, 
   null, 
   1142707080.0
  ], 
  [
   203063, 
   null, 
   "Steeeeve", 
   "that is the kin dof ignorant arrogance that got us into this mess in the first place. What is a \"good\" idea for America (or in america) is generally not going to be as good an idea for a traditionally tribal system based on several millinia of tradition.\n Who said it was a good idea for Americans? I think even the middle east will admit they got a problem. And there problem butts heads with us. A culture that believes killing anyone that doesn't believe what you believe is not going to fly and to think we should all just get along is really the ignorant thing.\n \n \nAmericas lack of history has really worked against us in this. I was watching a deal about the Iraq war a while back adn they were showing a guy arguing with US troops. They had bulldozed his olive grove because insurgents had been hiding in it and attacking the road. They didn't suspect the guy of aiding, harborinbg, or being one of the insurgents, they were jusy eliminating cover. That olive grove had been in the guys family for 1500 years...ONE THOUSAND, FIVE HUNDRED years. The US commander on the scene was baffled about why the guy was so upset. After all, we paid him for the destroyed grove (almost $10,000).\n ok? I'd had to think how many 1500 yr old things we destroyed in WWII. Although I'd be rather ticked off too. Once again, I never said we were going about it the right way.\n \n \nOur entire view of the middle east has been badly warped by the fact that America is little more than a baby throwing a temper tantrum when you put us up against the culture of the ME. We have no concept of the importance of a tribal law that goes back 10,000 years. We expect the arabs to simply abandon their customs that were in place a thousand years before Rome was even a village. And maybe the worst thing is that we expect them to do this with absolutly no understanding of life in the midle east or waht is required to survive in such a harsh climate and in a land with few natural resources.\n No doubt we don't understand their culture (or some of us)...but it still conflicts with our culture...and there culture has no compromise. To think otherwise is just idiotic.\n \n \nI serously doubt I said this, and if I did, you are taking it completely out of context here. How much more inhumane could we have really been? We killed 100,000 + on the way in by bombing civilian areas and showing complete disregard for Iraqi civilians lives. We have leveld cities that have stood for thousands of years. As soon as we had a firm enough foothold to allow it, we started mass arrests (without charges) and torturing and murdering people.\n If I find it, I'll post it. Maybe I am not stating it correctly but I agreed with the position I believe you posted. I have been searching but you post a lot..I think it was along the lines of a \"sh*t or get off the pot\" strategy.", 
   {}, 
   203059, 
   null, 
   1142708100.0
  ], 
  [
   203093, 
   null, 
   "Matthew S", 
   "1) how do you know it was a lie? \n \n 2) no it wouldn't be important to them...they are already dead. \n \n 3) It doesn't matter to the current troops because we are already there and it doesn't look like that will change regardless of WMDs\n\n \n \n So the loss of so many lives for no reason makes no difference to you? How heartless can one be? These people would still be alive if there were no invasion. What part of that do you not understand? Defend the Shrub he has the blood of of many on his hands. Which reminds me you argue so passionately against abortion. Yet when actual born living innocent people get killed in a war, that should never have taken place, you have no compassion.", 
   {}, 
   203054, 
   null, 
   1142726820.0
  ], 
  [
   203105, 
   null, 
   "Maineiac", 
   "If anything of great importance was found it would already be front page news.\n \n A new tell-all book is out now about how Bush and company screwed up in Iraq.\n \n http://www.pbs.org/newshour/bb/white_house/jan-june06/intel_3-17.html\n \n Cobra II puts a different light on events of the Iraq war. The interview they gave was interesting.", 
   {}, 
   203093, 
   null, 
   1142731380.0
  ], 
  [
   203111, 
   null, 
   "Steeeeve", 
   "So the loss of so many lives for no reason makes no difference to you? How heartless can one be? These people would still be alive if there were no invasion. What part of that do you not understand? Defend the Shrub he has the blood of of many on his hands. Which reminds me you argue so passionately against abortion. Yet when actual born living innocent people get killed in a war, that should never have taken place, you have no compassion.\n\n \n This is why no one listens to you Matthew...I could have said \"I like Cheese\" and you would twist it to mean I support eating people.\n \n I have more compassion for the people that died then you will ever have for any one person. This I am sure of.\n \n What I said was that WMDs don't matter to the troops that are dead...and it doesn't. They are dead whether or not WMDs exist.", 
   {}, 
   203093, 
   null, 
   1142733000.0
  ], 
  [
   203123, 
   null, 
   "Matthew S", 
   "This is why no one listens to you Matthew...I could have said \"I like Cheese\" and you would twist it to mean I support eating people.\n \n I have more compassion for the people that died then you will ever have for any one person. This I am sure of.\n \n What I said was that WMDs don't matter to the troops that are dead...and it doesn't. They are dead whether or not WMDs exist.\n\n \n \n Again point missed. They wouldn't be dead if bush hadn't lied about WMD and started a war.", 
   {}, 
   203111, 
   null, 
   1142739720.0
  ], 
  [
   203135, 
   null, 
   "zachvac", 
   "Again point missed. They wouldn't be dead if bush hadn't lied about WMD and started a war.\n\n \n Whether he lied or not, other people thought he had them as well. I know I saw quotes by Clinton and Gore saying that they were 100% sure that Saddam had WMD's, I forget the exact quote. The difference is would they have attacked Iraq or not?", 
   {}, 
   203123, 
   null, 
   1142742900.0
  ], 
  [
   203141, 
   null, 
   "Steeeeve", 
   "Again point missed. They wouldn't be dead if bush hadn't lied about WMD and started a war.\n\n \n That wasn't your point earlier..but ok..and you still haven't showed how he lied. So you are wrong either way.", 
   {}, 
   203123, 
   null, 
   1142746320.0
  ], 
  [
   203144, 
   null, 
   "daewoo", 
   "Whether he lied or not, other people thought he had them as well. I know I saw quotes by Clinton and Gore saying that they were 100% sure that Saddam had WMD's, I forget the exact quote. The difference is would they have attacked Iraq or not?\n\n \n They did not have the same intel that Bush did. Bush had the intel and chose to lie about it. Thanks to the leaky nature of the british government, we have confirmation for this now.", 
   {}, 
   203135, 
   null, 
   1142751240.0
  ], 
  [
   203153, 
   null, 
   "OccamsRazor", 
   "\n What I said was that WMDs don't matter to the troops that are dead...and it doesn't. They are dead whether or not WMDs exist.\n\n \n But it matters everything to their family and friends, don't you think?", 
   {}, 
   203111, 
   null, 
   1142774940.0
  ], 
  [
   203162, 
   null, 
   "Matthew S", 
   "But it matters everything to their family and friends, don't you think?\n\n \n \n emoticon_xgood exactly\n \n Steeeeve will do or say anything to defend the Shrub.", 
   {}, 
   203153, 
   null, 
   1142782740.0
  ], 
  [
   203175, 
   null, 
   "Steeeeve", 
   "But it matters everything to their family and friends, don't you think?\n\n \n maybe. I am sure it makes some mad..to others not. Either way, finding out will not bring back their son. It might educate us for next time...but that is a lesson everyone should learn.\n \n \n exactly\n \n Steeeeve will do or say anything to defend the Shrub.\n And you will do anything to twist my words around...making you a jacka...oh we can't cuss on these forums.", 
   {}, 
   203153, 
   null, 
   1142789520.0
  ], 
  [
   203184, 
   null, 
   "zachvac", 
   "maybe. I am sure it makes some mad..to others not. Either way, finding out will not bring back their son. It might educate us for next time...but that is a lesson everyone should learn.\n\n \n You are right in that it won't bring anyone back, but it may make us think twice the next time Bush tells us that intelligence shows this or that, that maybe it isn't entirely correct (or maybe even an outright lie).", 
   {}, 
   203175, 
   null, 
   1142792580.0
  ], 
  [
   203200, 
   null, 
   "OccamsRazor", 
   "maybe. I am sure it makes some mad..to others not. Either way, finding out will not bring back their son. It might educate us for next time...but that is a lesson everyone should learn.\n\n \n Well thats my point- it matters why we go to war because we (and here I mean our politicans who like to repeat this verbatim) have this notion that wars of aggression/conquest are not good. As a matter of fact they are unacceptable and we should only engage in military action to defend ourselves or others.\n \n Now, the case for Iraq was made on (i) a clear and present danger posed by their WMD's and (ii) Iraq's involvement in the support of international terrorism. Neither have been shown to be correct and in the case of WMD's the assertion was tenuous at best, from 45 minute claims and dodgy dossiers. However, I remember watching Tony Blair sell the need for going to war in Iraq to Parliment on these grounds and win the following vote (Colin Powell did the same at the UN.) Without winning this vote Britain would not have joined in the war- and subsequent revelations can only leave the observer thinking the given justification for going to war was false and that we were all lied to.\n \n These half truths and hidden agendas leave an unpleasant taste in our mouth when we look at what Iraq has become- and those who are the broken tools of the invasion have to swallow the the bitterest pill of all.", 
   {}, 
   203175, 
   null, 
   1142799120.0
  ], 
  [
   203202, 
   null, 
   "Matthew S", 
   "maybe. I am sure it makes some mad..to others not. Either way, finding out will not bring back their son. It might educate us for next time...but that is a lesson everyone should learn.\n\n \n \n Yes don't elect war mongering rebuplinazis\n \n\n And you will do anything to twist my words around...making you a jacka...oh we can't cuss on these forums.\n\n \n \n Hummmmm pot and kettleism", 
   {}, 
   203175, 
   null, 
   1142799660.0
  ], 
  [
   203221, 
   null, 
   "Steeeeve", 
   "Hummmmm pot and kettleism\n This is your claim to fame..not mine.", 
   {}, 
   203202, 
   null, 
   1142815020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Attention...all you hardheaded Bush bashers!", 
  "url": "http://www.4forums.com/political/current-events-debates/7765-attention-all-you-hardheaded-bush-bashers.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7765, 
  "discussion_files": [
   [
    "31211.html", 
    "http://www.4forums.com/political/current-events-debates/7765-attention-all-you-hardheaded-bush-bashers-print.html"
   ], 
   [
    "31212.html", 
    "http://www.4forums.com/political/current-events-debates/7765-attention-all-you-hardheaded-bush-bashers-3-print.html"
   ], 
   [
    "31213.html", 
    "http://www.4forums.com/political/current-events-debates/7765-attention-all-you-hardheaded-bush-bashers-2-print.html"
   ]
  ], 
  "identifier": 7765
 }
]