[
 [
  [
   202992, 
   null, 
   "simone", 
   "With apologies to Iuris, I'm going to post an entire article from the Wall Street Journal because not everyone can access their site:\n \n Religious Minority\n By DAVID GIBSON\n March 17, 2006; Page W17\n As the debate continues over what to rebuild in New Orleans, the fate of the city's black Catholic community may be one of the more poignant tales of loss and uncertainty in the wake of Hurricane Katrina. It is also one that points to a challenge for the wider Catholic Church in America. New Orleans, along with Baltimore and New York, is one of the precious few strongholds of black Catholics in the United States, a venerable old community facing challenges beyond the storm's toll.\n \n Katrina dispersed much of New Orleans's Catholic population, including many African-Americans. Even now, seven months later, only half of the 350 families from the Church of St. Augustine, a parish near the French Quarter founded in 1841 by slaves and freedmen, have returned. The local archbishop wants the congregants to merge with another church.\n \n Indeed, people outside major cities are often surprised to discover that there are black Catholics at all; for them, the church's vaunted universality is limited to a light-toned blend of European and Latino nationalities. And indeed, African-Americans make up just 3% of the nation's more than 65 million Catholics. Why should this be so?\n \n When it comes to racial integration, the Catholic Church in America carries much of the same historical baggage as many other institutions. True, there have been remarkable black American Catholics, notably Venerable Pierre Toussaint, the Haitian immigrant and slave who bought his own freedom in the early 19th century, and then used his wealth to fund all manner of charitable efforts and help to underwrite the building of Old St. Patrick's Cathedral on Mulberry Street in New York.\n \n But such individuals had little support from on high. The Vatican condemned the slave trade only in 1839. During the Civil War, Pope Pius IX made no secret of his affinity for the Confederacy, and the American hierarchy was so fearful of local schisms that the bishops were reluctant to speak out on behalf of abolition. Some Catholic orders owned slaves, and it was not until 1888 that Rome officially condemned slavery.\n \n The Catholic immigrants pouring into America from Europe in the late 19th and early 20th centuries did little to improve matters: Irish, Italian and Eastern European Catholics and their clergy often excluded blacks from local parishes with the same intolerance that they themselves were enduring. Many blacks simply felt more at home in their birthright Protestant churches, where adaptable liturgies and ministerial opportunities meant that black Christians could worship their own way more readily than in staid, Latinate Catholicism.\n \n The black Catholics who did remain in the church adopted an enclave mentality, congregating in places like New Orleans. They also founded religious orders for black nuns and priests since diocesan seminaries would not accept them.\n \n After World War II, though, everything changed. Bishops led the way by integrating parish schools, and blacks who migrated to northern cities found in Catholic charities and schools welcome entry points to their new world. \"For blacks, it was looked on as a step up if you became Catholic,\" says Bishop William N. Perry, an auxiliary in Chicago who heads the U.S. hierarchy's secretariat for African American Catholics.\n \n But the black consciousness movement of the 1960s, with its emphasis on African roots and traditions, helped to pull blacks away from the Catholic Church. By the time the Catholic hierarchy responded, a lot of religious alienation had set in. There are probably fewer black Catholics today than there were 50 years ago.\n \n The church's efforts to play catch up now are being hampered by other developments. Evangelical and Pentecostal churches, for instance, are reaching out to black Americans as part of their proselytizing mission. And the vast network of inner-city parochial schools -- once the principal gateway to the church for black Americans -- is shrinking. Black students remain overrepresented in Catholic schools relative to the black Catholic population. But the schools themselves are shutting down as Catholics migrate to the suburbs. Meanwhile, in the church's leadership, just 1% of priests are black, and only 300 of the 70,000 women religious are.\n \n (More)", 
   {
    "post_info": {
     "post_title": "Roman Catholicism, Slavery, African Americans"
    }
   }, 
   null, 
   null, 
   1142637720.0
  ], 
  [
   202994, 
   null, 
   "simone", 
   "But there are reasons for hope. There has been a rise in the number of black seminarians, to about 5% of all priests-in-training. And after years of dashed hopes, several African-American bishops are emerging as national leaders, even though there are still only 13 black bishops among some 400 active and retired American prelates. Most prominent among them is Atlanta Archbishop Wilton Gregory, whose election in 2001 as the first African-American president of the U.S. Conference of Catholic Bishops was heralded as a breakthrough.\n \n Also encouraging is the fact that lay African-Americans are taking the lead in ministerial and other church roles, replicating the experience of black Catholics in centuries past. \"We never had the luxury of our own priests, like other Catholic communities did,\" says Beverly Carroll, executive director of the secretariat for African American Catholics.\n \n Perhaps, the biggest boost to black Catholics in America recalls the traditional immigrant path of other Catholics groups. The recent influx of African and Afro-Caribbeans -- from places like Nigeria and Haiti -- means an increase in black Catholics overall, but these are black Catholics who bring their faith with them, along with their devotions, customs and clergy. \"They are missionaries to us,\" says Ms. Carroll. \"If it weren't for them, there wouldn't be anybody black up on the altar.\"\n \n Mr. Gibson's biography of Pope Benedict XVI, \"The Rule of Benedict,\" will be out in September.", 
   {}, 
   202992, 
   null, 
   1142637780.0
  ], 
  [
   203016, 
   null, 
   "maximus", 
   "Simone,\n You may be interested in this man's biography concerning this matter:\n \n http://www.catholic-forum.com/saints/saintp10.htm\n \n Here is additional information on Church teaching on slavery not included in your article. Note the section titled, \"THE CATHOLIC CHURCH AND SLAVERY.\" The statement on the 1888 condemnation of slavery is not quite right.\n \n http://www.catholic.com/thisrock/1999/9907fea2.asp", 
   {}, 
   202994, 
   null, 
   1142653140.0
  ], 
  [
   203074, 
   null, 
   "simone", 
   "Hmm, interesting aspect of American history that appears not to have been explored before.", 
   {}, 
   203016, 
   null, 
   1142709420.0
  ], 
  [
   203136, 
   null, 
   "maximus", 
   "Hmm, interesting aspect of American history that appears not to have been explored before.\n\n Yes, St. Peter Claver has an interesting story. Here is another interesting story-- Father Augustus Tolton--the first black American priest. He was ordained way back in 1886. The article is right in mentioning the prejudice and segregation of the Catholic Church of the U.S. The culture overpowered the teaching of the Church in that time in America. There were separate churches in some areas and Father Tolton's experience tells us of prejudice also. But his faith persevered.\n \n http://websites.quincy.edu/tolton/bio.html\n \n It is also interesting to note that there are about 200 million black Catholics currently out of around a billion total. That's no small number. I would guess it is largely due to the growing Church in Africa. There have also been 3 black popes in the Church's history:\n \n http://www.nbccongress.org/black-catholics/african-popes.asp", 
   {}, 
   203074, 
   null, 
   1142743620.0
  ], 
  [
   203188, 
   null, 
   "simone", 
   "Maximus, I shall have to point out to you, at some point time, Roman Catholic Portugal's unconscionable participation in the capturing and and enslavement of Africans in the 15th century, well, here's a beginning:\n \n http://www.antislavery.org/breakingthesilence/slave_routes/slave_routes_portugal.shtml\n \n \nPrince Henry the Navigator, the third son of the King of Portugal, was pivotal to early Portuguese exploration, navigation and science, inspiring an \"Age of Discovery\". He helped finance and organise many expeditions across the Atlantic, such as the one in 1415 to the North and West coasts of Africa, from which he learnt about trade in spices, gold and silver. The first slaves were brought to Portugal in 1441 for Prince Henry. Initially slaves were captured through outrageous means, including kidnapping and banditry. However Prince Henry ordered a change of practice, and so trading for slaves between Africans and Europeans became the norm. . . . Prince Henry established a slave market & fort in Arguin Bay in 1445 and they were brought back to Portugal. When a large slave auction was held in Lagos in that same year it was described by one witness as a \"terrible scene of misery and disorder\". By 1455 800 Africans were transported to Portugal annually. . . .\n", 
   {}, 
   203136, 
   null, 
   1142794440.0
  ], 
  [
   203217, 
   null, 
   "maximus", 
   "Maximus, I shall have to point out to you, at some point time, Roman Catholic Portugal's unconscionable participation in the capturing and and enslavement of Africans in the 15th century, well, here's a beginning:\n \n http://www.antislavery.org/breakingthesilence/slave_routes/slave_routes_portugal.shtml\n\n Simone,\n I must refer you back to the \"CATHOLIC CHURCH AND SLAVERY\" section in the article of the link in post #3. Perhaps another instance of the culture and society ignoring the teaching of the Church.", 
   {}, 
   203188, 
   null, 
   1142807700.0
  ], 
  [
   204810, 
   null, 
   "simone", 
   "The Church and Slavery: Some Unfortunate Details\n In his March 27 Letter on my commentary \"Religious Minority\" (Houses of Worship, March 17), the Rev. Michael P. Orsi writes that my summation of the Catholic Church's record on slavery was misleading. I noted that \"the Vatican condemned the slave trade only in 1839 . . . and it was not until 1888 that Rome officially condemned slavery.\" Father Orsi cites papal sanctions against slavery from the 16th and 17th centuries to support his assertion that, to the contrary, \"the church did teach very early and clearly that slavery was inherently evil.\" In fact, the \"condemnations\" that Father Orsi cites -- as well as several others he could have mentioned -- were unfortunately all too characteristic of church pronouncements, in that they applied only to certain colonies and peoples.\n \n Those same popes, and many other pontiffs, allowed for slavery in the Papal States, and by churchmen themselves, and for the enslavement of non-Christians, usually Muslims, who were often black. Indeed, when Pope Gregory XVI finally condemned the slave trade in 1839, he did not push for the emancipation of those slaves already held in bondage. Later, in 1866, a Vatican statement reiterated that \"Slavery itself, considered as such in its essential nature, is not at all contrary to the natural and divine law.\" Only in 1888, and with greater force in 1890, did Pope Leo XIII condemn slavery per se as always and everywhere evil, and it was the Second Vatican Council (1962-65) that declared slavery a grave offense against human dignity, akin to abortion.\n \n The church's history regarding slavery is certainly complex, with many saints who opposed the pronouncements from Rome. But today many seem to fear that Rome's evolution on the topic of slavery undermines the authority of the Magisterium on everything else. For an excellent recent treatment of this and related issues, I would recommend Judge John T. Noonan Jr.'s book, \"A Church That Can and Cannot Change: The Development of Catholic Moral Teaching.\"\n \n David Gibson -- Brooklyn, N.Y.", 
   {
    "post_info": {
     "post_title": "A WSJ reader resonds"
    }
   }, 
   202992, 
   null, 
   1143825840.0
  ], 
  [
   204901, 
   null, 
   "Easyrider", 
   "Food for thought: Aren't the majority of blacks in America Christians now?", 
   {}, 
   204810, 
   null, 
   1143848280.0
  ], 
  [
   205733, 
   null, 
   "maximus", 
   "The Church and Slavery: Some Unfortunate Details\n In his March 27 Letter on my commentary \"Religious Minority\" (Houses of Worship, March 17), the Rev. Michael P. Orsi writes that my summation of the Catholic Church's record on slavery was misleading. I noted that \"the Vatican condemned the slave trade only in 1839 . . . and it was not until 1888 that Rome officially condemned slavery.\" Father Orsi cites papal sanctions against slavery from the 16th and 17th centuries to support his assertion that, to the contrary, \"the church did teach very early and clearly that slavery was inherently evil.\" In fact, the \"condemnations\" that Father Orsi cites -- as well as several others he could have mentioned -- were unfortunately all too characteristic of church pronouncements, in that they applied only to certain colonies and peoples.\n \n Those same popes, and many other pontiffs, allowed for slavery in the Papal States, and by churchmen themselves, and for the enslavement of non-Christians, usually Muslims, who were often black. Indeed, when Pope Gregory XVI finally condemned the slave trade in 1839, he did not push for the emancipation of those slaves already held in bondage. Later, in 1866, a Vatican statement reiterated that \"Slavery itself, considered as such in its essential nature, is not at all contrary to the natural and divine law.\" Only in 1888, and with greater force in 1890, did Pope Leo XIII condemn slavery per se as always and everywhere evil, and it was the Second Vatican Council (1962-65) that declared slavery a grave offense against human dignity, akin to abortion.\n \n The church's history regarding slavery is certainly complex, with many saints who opposed the pronouncements from Rome. But today many seem to fear that Rome's evolution on the topic of slavery undermines the authority of the Magisterium on everything else. For an excellent recent treatment of this and related issues, I would recommend Judge John T. Noonan Jr.'s book, \"A Church That Can and Cannot Change: The Development of Catholic Moral Teaching.\"\n \n David Gibson -- Brooklyn, N.Y.\n\n This entire post is from noted Catholic Apologist Tim Staples:\n Some will say as does John T. Noonan, Jr. in \"Development in Moral Doctrine\" (p. 675):\n \n \"Only in 1890 did Pope Leo XIII attack the institution [of slavery] itself.\" \n \n This is nuts. Or, Theologian Laennoc Hurbon, in \"The Church and Afro-American Slavery.\" He said, \"One can search in vain through the interventions of the Holy See... for any condemnation of the institution of slavery.\" (Until 1890) Or, how about John F. Maxwell, in \"Slavery and the Catholic Church\" (1975 on page 11): He says, \"As is well known the Church's teaching on slavery was corrected by the Second Vatican Council in 1965 [in Gaudium et Spes nos. 27,29].\" Gaudium et Spes?\n \n The truth of the matter is: \n \n The meaning of the term \"servitus\" is crucial. The term is translated as \"slavery\" and that is fine. But Popes were often referring to something that would be akin to some being sentenced to prison for something they have done wrong today, when they speak of \"servitus.\" \n Check out Exodus 21:1-6 and Deut. 15:12-18. There you have a type of \"servitus\" that was sanctioned by God. Further, St. Paul is well-known for his message in Philemon concerning Onesimus, the slave, and Eph. 6:5: \"Slaves obey your masters according to the flesh...\" \n There is nothing contrary to the moral law concerning servitude in cases where someone 1. owes a debt 2. Is a criminal or 3. Freely chooses to serve another person. Of course, the Church has always taught that the servant should be paid and afforded the essential dignities of a human being! \n \n The key is to put this thing in perspective historically: \n \n In 1404, the Spanish conquered the Canary Islands (off the coast of NW Africa) and began to enslave the \"Indians\" in an \"unheard of sense\" as Pope Paul III would later call it. Soon after the conquering of the Canary Islands and the subsequent beginnings of the slave trade, in 1435, Pope Eugene IV condemned this in the strongest terms, in \"Sicut Dudum.\"\n \n Here is a quote:\n \n They have deprived the natives of their property or turned it to their own use, and have subjected some of the inhabitants of said island to perpetual slavery, sold them to other persons and committed other various illicit and evil deeds against them... Therefore We...exhort, through the sprinkling of the Blood of Jesus Christ shed for their sins, one and all, temporal princes, lords, captains, armed men, barons, soldiers, nobles, communities and all others of every kind among the Christian faithful of whatever state, grade or condition, that they themselves desist from the aforementioned deeds, cause those subject to them to desist from them, and restrain them rigorously. And no less do We order and command all and each of the faithful of each sex that, within the space of fifteen days of the publication of these letters in the place where they live, that they restore to their earlier liberty all and each person of either sex who were once residents of said Canary Islands... who have been made subject to slavery. These people are to be totally and perpetually free and are to be let go without the exaction or reception of any money.\n \n We will that like sentence of excommunication be incurred by one and all who attempt to capture or sell or subject to slavery baptized residents of the Canary Islands or those who are freely seeking Baptism...\n \n Notice, it was excommunication for subjecting to slavery the baptized, but it was declared an \"illicit and evil deed\" to subject anyone to slavery.\n \n Then you had the discovery of the New World in 1492 and the Spanish conquering the Aztecs and more of the same. Pope Paul III made it excommunication \"latae sententiae\" for a Catholic to be involved in slavery or the slave trade. In the Papal Bull \"Sublimus Deus\" of June 2, 1537, he taught the universal Church that forced and unjust slavery is objectively evil and from the Devil and he had already reiterated that it was an excommunicable offense in his \"Pastorale Officium\" of May 29th of the same year of 1537. Here is a quote from \"Sublimus Deus:\"\n \n Therefore, We,...noting that the Indians themselves indeed are true men and are not only capable of the Christian faith, but, as has been made known to us, promptly hasten to the faith, and wishing to provide suitable remedies for them, by our Apostolic Authority decree and declare by these present letters that the same Indians and all other peoples-even though they are outside the faith-who shall hereafter come to the knowledge of Christians have not been deprived or should not be deprived of their liberty or of their possessions. Rather they are to be able to use and enjoy this liberty of property freely and licitly, and are not to be reduced to slavery, and that whatever happens to the contrary is to be considered null and void. These same Indians and other peoples are to be invited to the said faith in Christ by preaching and the example of the good life.\n \n Notice, Pope Paul III extended the explicit condemnation of slavery to all, even those who are not baptized. With the conquest of the Phillipines in 1521 and continued problems in the Canary Islands and in the New World, it was obvious that some Catholics were not listening to the Holy Father and slavery continued. Pope Gregory XIV again condemned slavery and repeats what Pope Paul III had said in \"Cum Sicuti\" (with similarity...) of 1591.\n \n What followed was a serious of condemnations from Pope after Pope:\n \n 1639 Pope Urban VIII wrote \"Commissum Nobis\" (Our undertaking)\n \n 1741, Pope Benedict XIV wrote \"Immensa Pastorum\" (Immeasurable or greatest of Pastors)\n \n 1839 Pope Gregory XVI wrote \"In Supremo.\"\n \n Holy Office Instruction of 1866 concerning Galla tribe in Africa.\n \n 1888 Pope Leo XIII wrote \"In Plurimus.\"\n \n 1890 Pope Leo XIII wrote \"Catholicae Ecclesiae.\" Isn't it odd that this Encyclical was the first one the above authors new about? Excepting Maxwell, of course, who thought Gaudium et Spes was the first document to condemn slavery! \n \n If you want a great and readable book on the topic, I suggest \"The Popes and Slavery\" by Fr. Joel Panzer.", 
   {
    "unicode_changes_made": true
   }, 
   204810, 
   null, 
   1144302240.0
  ], 
  [
   205757, 
   null, 
   "simone", 
   "What are Father Panzer's academic credentials?\n \n I can, of course, do independent research on his credentials, but if you are instantly aware of them perhaps you might state them.", 
   {}, 
   205733, 
   null, 
   1144333200.0
  ], 
  [
   205914, 
   null, 
   "maximus", 
   "What are Father Panzer's academic credentials?\n \n I can, of course, do independent research on his credentials, but if you are instantly aware of them perhaps you might state them.\n\n I'm not sure what his credentials are. You will have to do some research. That is a book recommended by Tim Staples--remember the whole post is his, not mine. I have never read the book.", 
   {}, 
   205757, 
   null, 
   1144392900.0
  ], 
  [
   215112, 
   null, 
   "simone", 
   "The Wall Street Journal again offers up anotber provocative essay on slavery and Christianity:\n \n Equal Before God\n By NAOMI SCHAEFER RILEY\n June 2, 2006; Page W13\n Charleston, S.C.\n Perched on the side of a lush green hill, 100 yards from the banks of the Ashley River, is a small white chapel. Built in 1850 as the second floor of a \"spring house\" (which used cool streams to keep food chilled), the one-room sanctuary was the center of religious life at the Middleton Place plantation, for both masters and slaves.\n \n The religious life of slaves? The concept seems peculiar, to say the least. Why would plantation owners deem people whom they treated as subhuman from Monday through Saturday sufficiently worthy of co-worship on Sundays? And why would slaves embrace the faith of a people who were so cruel to them?\n \n In 1978, scholar Albert Raboteau published \"Slave Religion,\" a groundbreaking book that set out to explain \"the invisible institution in the Antebellum South.\"\n \n \"From the very beginning of the Atlantic slave trade,\" Mr. Raboteau writes, \"conversion of the slaves to Christianity was viewed by the emerging nations of Western Christendom as a justification for the enslavement of Africans.\" But there was also a recognition of the danger that could accompany such transformations. \"Masters understood,\" Mr. Raboteau told me in a recent interview, \"that there was something subversive about the whole notion of fellowship, brotherhood and sisterhood [in Christianity] that would lead slaves to think more highly of themselves.\"\n \n In some instances, the slaves who attended the same churches as their owners would complain to the religious authorities about the treatment to which they were subjected during the week. In one instance, in the Forks of Elkhorn Baptist Church in Kentucky, a Brother Palmer accused the Stephens family of improperly treating their slave Nancy, by putting her in irons and forbidding her to see her child. \"Apparently she had reason to hope,\" Mr. Raboteau writes, \"that the church would intervene on her behalf or at least serve as a forum for her complaint.\"\n \n Slaves also gained power through religion in more spiritual ways. One slave, Andrew Bryan, actually preached in the streets of Savannah to both whites and blacks. In the early 1780s, he was punished because it was thought that his words had provoked the escape of some local slaves. Bryan reportedly \"told his prosecutors that he rejoiced not only to be whipped, but would freely suffer death for the cause of Jesus Christ.\" As historian Eugene Genovese explains in his work on slave life, \"Roll, Jordan, Roll\" (1972): \"The black preachers...had to speak a language defiant enough to hold the high-spirited among their flock but neither so inflammatory as to rouse them to battles they could not win nor so ominous as to rouse the ire of the ruling powers.\"\n \n It is easy to see why the plantation owners would not want sentiments like Bryan's to spread. Not only does punishment become less effective when martyrdom is a possibility but the notion that Christianity would \"relativize the master's will in terms of God's will,\" as Mr. Raboteau puts it, was a dangerous one.\n \n Throughout the 18th and 19th centuries, missionaries tried to convince masters that they should allow their slaves to practice Christianity, often arguing that Christian slaves would be better slaves. There were some churches, like the Quakers', that refused to condone slavery or to preach to slaves (such preaching, they felt, would confer a legitimacy on the institution). But many preachers chose, as Mr. Genovese writes, \"to place the souls of the slaves above all material considerations.\"\n \n For their sermons to slaves, preachers chose their Bible passages carefully. Ephesians 6:5 was a favorite, according to the tour guide at the Middleton Place plantation: \"Servants, be obedient to them that are your masters according to the flesh, with fear and trembling, in singleness of your heart, as unto Christ.\" But, as Mr. Raboteau observes, there was \"no way of controlling the way that slaves would interpret biblical stories....The masters might interpret the story of Exodus as being freed from sin, but the slaves would interpret it as being freed from physical bondage.\"\n \n In 1822, Denmark Vesey, a slave who had purchased his own freedom, plotted the rebellion of a few thousand slaves here. According to the contemporary accounts, Vesey invoked the Bible to justify his belief that slavery should be eradicated. And most of the slaves executed for participating in the plot were members of the African Methodist Church.\n \n After such incidents, masters would often prevent their slaves from practicing Christianity, at least for a while. But slave religion eventually returned, partly to assuage the masters' guilt. \"Not only was Christianization of slaves a rationale for slavery,\" Mr. Raboteau writes, \"but it was...a balm for the occasional eruptions of Christian conscience disturbed by the notion that maybe slavery was wrong.\"\n \n White slaveholders even worried, from time to time, whether they were preventing their slaves from carrying out their Christian duties. At the urging of their churches, masters sometimes kept married slaves on the same plantation instead of allowing them to be separated. In cases where a spouse was sold to another plantation far away, the church would declare the marriage void so that each slave could find another partner without committing adultery.\n \n Whatever the logic of the masters who encouraged slave religion, it is clear that many slaves were sincere Christians. It could be argued that the legacy of such belief is one reason that blacks are among the most fervently religious groups in America today. But Mr. Raboteau sees the narrative of slave religion as a more universal story. Like the martyrs in the early church or the Christians who were persecuted under communism, slaves \"are the primary example in American history of Christians who suffered for their faith.\"\n \n Ms. Riley is the Journal's deputy Taste editor.", 
   {
    "post_info": {
     "post_title": "Slavery and Conversion to Christianity"
    }
   }, 
   205914, 
   null, 
   1149269400.0
  ], 
  [
   215115, 
   null, 
   "jyoshu", 
   "The thing about mostly white denominations and blacks is that denominations can't so easily do anything about it. There just aren't many black catholics--if they aren't many black Catholics then there aren't going to be as many black leaders. These groups have opened the doors to blacks long ago; getting blacks to come and join them is a different matter. \n \n We must also remember that pretty much the whole world endorsed slavery at one time as a normal part of life. Religious people were also a part of that world and culture, so to single out religious groups for historical support of slavery is somewhat disingenuous. A better judgement would be to see how they view slavery today.", 
   {}, 
   215112, 
   null, 
   1149270900.0
  ], 
  [
   216107, 
   null, 
   "maximus", 
   "The Wall Street Journal should publish some essays about Christianity and Abolitionism. And don't forget Saint Peter Claver, we've spoken of him before:\n \n http://www.catholic-forum.com/saints/saintp10.htm", 
   {}, 
   215115, 
   null, 
   1149922860.0
  ], 
  [
   216129, 
   null, 
   "simone", 
   "Fear not, Maximus, the Wall Street Journal is fearfully Christian.", 
   {}, 
   216107, 
   null, 
   1149955140.0
  ], 
  [
   216135, 
   null, 
   "simone", 
   "In regard to the credentials of Father Joel S. Panzer:\n \n http://www.stpauls.com.au/publications/catalog/authors.php?task=view&letter=P&authors_id=Panzer%2C+Joel\n \n \nFather Joel S. Panzer was ordained a priest for the Diocese of Lincoln, Nebraska in 1994. He studied philosophy at St. Philip's Seminary, Toronto, and theology at St. Joseph's Seminary in Yonkers, New York, where he received a master of arts degree in dogma. He was assigned as the assistant chaplain of the Newman Center of the University of Nebraska where he was engaged in campus ministry, teaching high school religion and serving as the assistant vocations director. Fr. Panzer is presently the parochial vicar at North American Martyrs Parish in Lincoln. \nWell versed in dogma and theology it would seem.", 
   {
    "unicode_changes_made": true
   }, 
   216107, 
   null, 
   1149956220.0
  ], 
  [
   216604, 
   null, 
   "maximus", 
   "In regard to the credentials of Father Joel S. Panzer:\n \n http://www.stpauls.com.au/publications/catalog/authors.php?task=view&letter=P&authors_id=Panzer%2C+Joel\n \n Well versed in dogma and theology it would seem.\n\n Aren't they all!!", 
   {}, 
   216135, 
   null, 
   1150175640.0
  ], 
  [
   216663, 
   null, 
   "simone", 
   "Um, Maximus, I was trying not to say that the good father might be a tad weak in the areas of history and political criticism.", 
   {}, 
   216604, 
   null, 
   1150217340.0
  ], 
  [
   217018, 
   null, 
   "maximus", 
   "Um, Maximus, I was trying not to say that the good father might be a tad weak in the areas of history and political criticism.\n\n And I thought you were simply stating that he was strong in dogma and theology :) Rightfully so!", 
   {}, 
   216663, 
   null, 
   1150348620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Roman Catholicism, Slavery, African Americans", 
  "url": "http://www.4forums.com/political/religion-debates/7766-roman-catholicism-slavery-african-americans.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7766, 
  "discussion_files": [
   [
    "1764.html", 
    "http://www.4forums.com/political/religion-debates/7766-roman-catholicism-slavery-african-americans-print.html"
   ], 
   [
    "1765.html", 
    "http://www.4forums.com/political/religion-debates/7766-roman-catholicism-slavery-african-americans-2-print.html"
   ]
  ], 
  "identifier": 7766
 }
]