[
 [
  [
   203651, 
   null, 
   "DebateNoob", 
   ":xbanghead Some people are just plain cruel. My mother works for Global Insights, a foreign exchange student program, and a certain family was hosting a Columbian exchange student, but she ended up changing host families because there was another teenage girl in the house that wouldn't stop complaining! She whined about everything she did, even that she wouldn't do the pledge of allegiance because she isn't an American citezen and doesn't feel comfortable with it!! I just feel angry with certain people's disrespect!! I just want to... :xbanghead emoticon_mad :xcensored", 
   {
    "post_info": {
     "post_title": "Foreign Exchange Students"
    }
   }, 
   null, 
   null, 
   1143073560.0
  ], 
  [
   203670, 
   null, 
   "zachvac", 
   "That's pretty bad. I personally have had no experience with foreign exchange students.", 
   {}, 
   203651, 
   null, 
   1143083580.0
  ], 
  [
   203827, 
   null, 
   "Tastyfish", 
   "I live with about 60+ this year (not sure where that goes in the poll) and while most are alright some are not, same as everyone else. Imagine if the positions were reversed and the family requested to change students because the foreign student was so whiny.\n \n Its just people sadly", 
   {}, 
   203670, 
   null, 
   1143175680.0
  ], 
  [
   204116, 
   null, 
   "zachvac", 
   "I live with about 60+ this year (not sure where that goes in the poll) and while most are alright some are not, same as everyone else. Imagine if the positions were reversed and the family requested to change students because the foreign student was so whiny.\n \n Its just people sadly\n\n \n wow, 60+??? Where do you live?", 
   {}, 
   203827, 
   null, 
   1143355380.0
  ], 
  [
   204169, 
   null, 
   "Iuris", 
   "she wouldn't do the pledge of allegiance\n\n \n Let me get this straight: a forign exchange student was expected to participate in the pledge of allegiance? I mean, making rooms, doing dishes and so on I can understand, you live together, the work gets shared. But this?", 
   {}, 
   204116, 
   null, 
   1143398820.0
  ], 
  [
   204170, 
   null, 
   "Tastyfish", 
   "wow, 60+??? Where do you live?\n\n We have post-graduate and internation student halls, but most of the other post-grads are students anyway (or it might be because Scotland secretly considers me as a international student being from england)", 
   {}, 
   204116, 
   null, 
   1143399300.0
  ], 
  [
   204578, 
   null, 
   "zachvac", 
   "We have post-graduate and internation student halls, but most of the other post-grads are students anyway (or it might be because Scotland secretly considers me as a international student being from england)\n\n \n oh ok, so I assume you don't live in your own house? I was trying to picture over 61 people fitting into one house. :)", 
   {}, 
   204170, 
   null, 
   1143684600.0
  ], 
  [
   204581, 
   null, 
   "Tastyfish", 
   "oh ok, so I assume you don't live in your own house? I was trying to picture over 61 people fitting into one house. :)\n\n We do have a lot of cupboards...but only the small chinese girls can fit them them, the rest of us make do with flats ;)", 
   {}, 
   204578, 
   null, 
   1143685080.0
  ], 
  [
   205476, 
   null, 
   "Rovdak", 
   "I share a living unit of 10 with 3 international students, one Chinese, one Pole and one Brazillian. Previously there have been French, Czech, German, Mexican and Moldavian students living here too (most international students stay for only a few months). Overall there are probably about 100 international students in the complex I live in, and there are 4 more complexes with similar set-ups in town.", 
   {}, 
   204581, 
   null, 
   1144170780.0
  ], 
  [
   205511, 
   null, 
   "Ripskar", 
   "This year, about 15 so far, (Have to pay the bills somehow) 1 Japanese, 2 Chinese, 8 or 9 French and 3 Spanish.\n I used to share with foreign students back when I was in Uni. There was one bad experience with a Bavarian but apart from that nothing.\n \n Would students going to the US for a year really be expected to swear alleigiance to the flag???", 
   {}, 
   205476, 
   null, 
   1144190820.0
  ], 
  [
   205519, 
   null, 
   "Rovdak", 
   "Would students going to the US for a year really be expected to swear alleigiance to the flag???\n\n \n Speaking for myself, I'd say I would rather look for for a non-American university than swear allegiance to the American flag unless applying for citizenship. Since I'm take my loyalty to my country quite serious and swearing allegiance to a foreign flag without giving up my current citizenship amounts to treason in my opinion.", 
   {}, 
   205511, 
   null, 
   1144191600.0
  ], 
  [
   205597, 
   null, 
   "Ooaman", 
   ":xbanghead Some people are just plain cruel. My mother works for Global Insights, a foreign exchange student program, and a certain family was hosting a Columbian exchange student, but she ended up changing host families because there was another teenage girl in the house that wouldn't stop complaining! She whined about everything she did, even that she wouldn't do the pledge of allegiance because she isn't an American citezen and doesn't feel comfortable with it!! I just feel angry with certain people's disrespect!! I just want to... :xbanghead emoticon_mad :xcensored\n\n What would happen if that girl went to another country in a study abroad program. Could she refuse to sing there national anthem without her host family complaining? The national anthem for _________ (fill in name of another country here) probibly has no meaning to her just like the Pledge of Allegiance doesn't mean anything to this foriegn exchange student.", 
   {}, 
   203651, 
   null, 
   1144213740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Foreign Exchange Students", 
  "url": "http://www.4forums.com/political/education-debates/7787-foreign-exchange-students.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 7787, 
  "discussion_files": [
   [
    "17601.html", 
    "http://www.4forums.com/political/education-debates/7787-foreign-exchange-students-print.html"
   ]
  ], 
  "identifier": 7787
 }
]