[
 [
  [
   203859, 
   null, 
   "Bombing", 
   "Did you hear the like! According to recent statement of British Defense Secretary, John Reid, there is no civil war in Iraq and even \"we are unable to assert that it can begin one day\". Not bad if we remember that every day representatives of one Iraqi religious group blows up halidoms of the other religious community. I would be a stark fool if I believed that British Defense Secretary simply views present situation in Iraq through rose-coloured spectacles. Not at all! He knows exactly what is happening there now. But he can't call spade a spade. The matter is that Mr. Reid presents the country, supported US policy in Iraq. That is why he is unable to tell the bare truth about Iraqi events now. \n The realness lies in US ambitions for instigating civil war there. That is the real essence of US foreign policy with its main divide and conquers principle.", 
   {
    "post_info": {
     "post_title": "There is no civil war in Iraq"
    }
   }, 
   null, 
   null, 
   1143217200.0
  ], 
  [
   203866, 
   null, 
   "georged", 
   "Former Iraqi prime minister Iyad Allawi, who told the BBC on Sunday that with an average of 50 to 60 Iraqis being killed each day, \"if this is not civil war, then God knows what civil war is.\"", 
   {}, 
   203859, 
   null, 
   1143226500.0
  ], 
  [
   203915, 
   null, 
   "Tastyfish", 
   "Its not a civil war, because there aren't really official sides involved like a conventional civil war. You need a government of some kinds of both sides for it to count really, otherwise its just the same as the situation with Protestants and Catholics in Ireland some time back.\n \n Its just a lot of people blowing each other up, a civil war would be far easier to deal with, though to be honest I expect the result we ultimately end up the same, with Iraq being divided up between the various groups. Its far from a perfect solution, but what I think might eventually happen (if only because a real civil war starts).", 
   {}, 
   203866, 
   null, 
   1143247980.0
  ], 
  [
   203916, 
   null, 
   "UnAmericanYOU", 
   "Former Iraqi prime minister Iyad Allawi, who told the BBC on Sunday that with an average of 50 to 60 Iraqis being killed each day, \"if this is not civil war, then God knows what civil war is.\"\n\n \n Yes. Allawi did say that, and he's just about the only one that thinks Iraq's in a civil war.\n \n He was an interim PM, and he and his party are out of power, his statement is viewed by others as self-serving.\n \n Fifty to sixty Iraqi's may be being killed each day, but it was far more under Husseein, and that pales in comparison to casulties in other civil wars.\n \n There's a vacuum of power in Iraq, this is just secterian unrest.", 
   {}, 
   203866, 
   null, 
   1143250860.0
  ], 
  [
   203919, 
   null, 
   "georged", 
   "Its not a civil war, because there aren't really official sides involved like a conventional civil war. You need a government of some kinds of both sides for it to count really, otherwise its just the same as the situation with Protestants and Catholics in Ireland some time back.\n \n Its just a lot of people blowing each other up, a civil war would be far easier to deal with, though to be honest I expect the result we ultimately end up the same, with Iraq being divided up between the various groups. Its far from a perfect solution, but what I think might eventually happen (if only because a real civil war starts).\n\n \n I'd have to dispute that definition. These are different tribes struggling for dominate (government) power using forms of central planning and logistics. Both tribes have been around for centuries with well defined hierarchies, were in fact originally regional governments until consolidation of tribes under various ruling empires. \n \n The idealistic US intent of Western style democracy in the ME ignores those tribal differences, kept in check by Saddam's iron fist, and supported the Shia, that being the majority tribe and opposed the Sunni, Saddam's tribe. If you want to take it back to basics, each tribe is fighting for control of Iraq's wealth, in this case oil, no different than when control of historical trade routes was the criterion for wealth. \n \n While the US prefers to publicly state it supports democracy in Iraq, it does in fact support the majority Shia via military/financial aid and US military engaging those who oppose the Shia. Anyone not on the US bus is a de facto insurgent. This circumstance is common in most former colonies and empires, Africa and S. America being classic examples.", 
   {}, 
   203915, 
   null, 
   1143251460.0
  ], 
  [
   203929, 
   null, 
   "daewoo", 
   "The insurgents are pulling off COMPANY LEVEL ASSAULTS. Do you really need any more proof that there is a civil war?", 
   {}, 
   203919, 
   null, 
   1143254880.0
  ], 
  [
   203930, 
   null, 
   "Tastyfish", 
   "Well, these things don't really fit into nice neat little boundaries. There is on going conflict in Iraq but I'm not sure if it generally is at quite the same level as we'd expect from a civil war (at least compared to our own historical ones which had engagements significantly above the US's company level).\n \n Oil is mainly in Kurdish territory isn't it, rather than being distributed more openly around? I suppose you could set up some system where despite the fields being on Kurdish soil the oil is owned jointly by the states that originally made up Iraq. You'd have to keep some troops to enforce this, but then didn't Turkey say it would invade if the Kurds where given their own lands or something like that a while back?", 
   {}, 
   203919, 
   null, 
   1143255000.0
  ], 
  [
   203932, 
   null, 
   "daewoo", 
   "Well, these things don't really fit into nice neat little boundaries. There is on going conflict in Iraq but I'm not sure if it generally is at quite the same level as we'd expect from a civil war (at least compared to our own historical ones which had engagements significantly above the US's company level).\n\n \n Most modern civil wars, such as Sierra Leone, Rwanda, etc... nevr have orchestrated assaults even that large. It is incredibly difficult to put together a cohesive unit and supply it under the nose of your government. Most places are not liek the US, where we have vast amounts of habital land, and even in the US, such an endeavor would probably fail after the first attack because you cannot make 60-200 people simply melt back into the population when they are finished with their strike without significant support from that population. \n \n Until a force actually manages to control territory, company sized assaults are VERY rare.", 
   {}, 
   203930, 
   null, 
   1143255600.0
  ], 
  [
   203935, 
   null, 
   "Tastyfish", 
   "Hence why I said its complicated, there is no real firm definition for when terrorist groups fighting each other escalates into an official civil war. Or infact there probably is, much like how killing a large number of people may not actually be genocide. It might be about holding territory then as you say, I don't really know.\n \n But true, even if it may not be a genuine civil war, its more or less as 'good' as.", 
   {}, 
   203932, 
   null, 
   1143256560.0
  ], 
  [
   203936, 
   null, 
   "georged", 
   "\n Oil is mainly in Kurdish territory isn't it, rather than being distributed more openly around? I suppose you could set up some system where despite the fields being on Kurdish soil the oil is owned jointly by the states that originally made up Iraq. You'd have to keep some troops to enforce this, but then didn't Turkey say it would invade if the Kurds where given their own lands or something like that a while back?\n\n \n Kurd and Shia territory. Which is what this is all about. That was part of the strategy Saddam used to empower the Sunni to oppress Kurds and Shia. Tribal differences run deep, the result of centuries of ideological separation. Which is the reason Bush, attempting to reunite the US Republican Party, recently stated US troops will be in Iraq for many years. Iraq is not a nation of individuals prepared to forgive and forget and Shia and Kurds were severely oppressed by Saddam and the Sunni. \n \n The Sunni are well aware that if Iraq's 'democratic' government is allowed to form without specific, enforceable language and guarantees of Sunni equal participation in oil revenue, their social and economic status will quickly resemble Black Americans in Mobile, Alabama, USA, circa 1900. Or worse. This is a time of revenge for Shia and Kurds.", 
   {}, 
   203930, 
   null, 
   1143256800.0
  ], 
  [
   203938, 
   null, 
   "Tastyfish", 
   "Do you think anything can be done, or if it even should be? Nothing will or could happen over night admitedly, but over a generation or so?", 
   {}, 
   203936, 
   null, 
   1143257220.0
  ], 
  [
   203939, 
   null, 
   "georged", 
   "Do you think anything can be done, or if it even should be? Nothing will or could happen over night admitedly, but over a generation or so?\n\n \n Get out and let them settle their differences, now or a decade from now. How long was the US in Vietnam before we discovered we couldn't mold a country into what we thought was genuine without complete control over the population? It took Saddam 400,000 active troops and a large internal, brutal secret police force to maintain order. Are we just switching leaders, same deal?\n \n We went nation building, again, and, in spite of contrary US political claims, it just isn't working out.", 
   {}, 
   203938, 
   null, 
   1143257940.0
  ], 
  [
   203940, 
   null, 
   "Tastyfish", 
   "However as you say, this has been going on for centuries so it will probably take much longer than a decade. \n Seeing as we removed the one thing that was holding it together and at a bad time globally as well, should we not bare some responsibility in trying to repair things, if only a certain amount of (non military) resources being dedicated to repairing and improving infrastructure, hospitals, etc or is this destined to be a case of throwing good money after bad? Don't think it would be responable for the nations involved to be fined to fix the damage they caused, if only to counter the precedent for random invasion the Iraq war set?", 
   {}, 
   203939, 
   null, 
   1143258540.0
  ], 
  [
   203941, 
   null, 
   "georged", 
   "As a conquering nation we're supposedly responsible for repairing the infrastructure we destroyed. $100-billion is the latest number I read for that cost, we've advanced $20-billion, of which 40% has gone for security purposes, and would not include modernizing oil production, which Iraq requires to survive. I'd write the check and let them sort it out. The quicker the better, as badly needed foreign investment will not become available until a Saddam like leader can maintain civil order in Iraq (the US would obviously prefer its own Saddam like leader, we've always favored dictators, but that doesn't seem to be in the cards) or it splits apart.\n \n On edit: You do understand that current US administration has made staying in Iraq a major Republican campaign plank for US 2006 and 2008 national elections and beyond?", 
   {}, 
   203940, 
   null, 
   1143259440.0
  ], 
  [
   204284, 
   null, 
   "georged", 
   "http://abcnews.go.com/International/wireStory?id=1772000\n \n The news media is now openly referring to the revenge issue:\n \n ~Much of the recent killing is seen as the work of Shiite militias or death squads that have infiltrated or are tolerated by police under the control of the Shiite-dominated Interior Ministry.~", 
   {}, 
   203941, 
   null, 
   1143481320.0
  ], 
  [
   204422, 
   null, 
   "Scactha", 
   "Civil wars are by their nature chaotic and the naming of sides is more of an after hostilities construction, more than anything the current fighters label themselves. It's the historians who ends up sorting out the sides to make any sense more than anyone else.", 
   {
    "unicode_changes_made": true
   }, 
   204284, 
   null, 
   1143551700.0
  ], 
  [
   204446, 
   null, 
   "Another opinion", 
   "Just as a reference, the population of the United States during the time of our civil war was about 31 million (Iraq has ~26 million). Approximately 620,000 people were killed during the four years of the Civil War. That means that the daily death rate was:\n \n 620,000 / 365 / 4 = 424 deaths per day\n \n This is almost 10 times higher than the current death rate in Iraq.\n \n I don't know of a clear definition that differentiates between mere skirmishes and an actual war, but I suspect that a true Iraqi civil war would be far bloodier than it currently is (50-60 per day).", 
   {}, 
   204422, 
   null, 
   1143577560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  There is no civil war in Iraq", 
  "url": "http://www.4forums.com/political/peace-middle-east/7802-there-no-civil-war-iraq.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 7802, 
  "discussion_files": [
   [
    "26489.html", 
    "http://www.4forums.com/political/peace-middle-east/7802-there-no-civil-war-iraq-print.html"
   ], 
   [
    "26490.html", 
    "http://www.4forums.com/political/peace-middle-east/7802-there-no-civil-war-iraq-2-print.html"
   ]
  ], 
  "identifier": 7802
 }
]