[
 [
  [
   204092, 
   null, 
   "Master_Shake", 
   "I found this while doing research for something else. I posted the abstract only because posting the entire article would be excessively long and I couldn't post a link to it, because you would need an ID and password to access this article where I found it. For those of you that would like more in-depth information, I put the reference info of the article here. If, for some reason, anyone wants me to put the entire article up here I will. I posted this article simply because I found it interesting and thought others might find it interesting as well.\n \n \n Substance use associated with unintended pregnancy outcomes in the National Longitudinal Survey of Youth. David C. Reardon, Priscilla K. Coleman and Jesse R. Cougle. American Journal of Drug and Alcohol Abuse 30.2 (May 2004): p369(15). \n \n Abstract: \n \n Abortion is known to be associated with higher rates of substance abuse, but no studies have compared substance use rates associated with abortion compared to delivery of an unintended pregnancy. This study examines data for women in the National Longitudinal Survey of Youth whose first pregnancy was unintended. Women with no pregnancies were also used as a control group. Use of alcohol, marijuana, cocaine, and behaviors suggestive of alcohol abuse were examined an average of four years after the target pregnancy among women with prior histories of delivering an unintended pregnancy (n = 535), abortion (n = 213), or those who reported no pregnancies (n = 1144). Controls were instituted for age, race, marital status, income, education, and prepregnancy self-esteem and locus of control. Compared to women who carried an unintended first pregnancy to term, those who aborted were significantly more likely to report use of marijuana (odds ratio: 2.0), with the difference in these two groups approaching significance relative to the use of cocaine (odds ratio: 2.49). Women with a history of abortion also reported more frequent drinking than those with a history of unintended birth. With the exception of less frequent drinking, the unintended birth group was not significantly different from the no pregnancy group. Resolution of an unintended pregnancy by abortion was associated with significantly higher rates of subsequent substance use compared to delivering an unintended pregnancy. A history of abortion may be a useful marker for identifying women in need of counseling for substance use.", 
   {
    "post_info": {
     "post_title": "Substance use and unintended pregnancy outcomes"
    }
   }, 
   null, 
   null, 
   1143347520.0
  ], 
  [
   204096, 
   null, 
   "Steeeeve", 
   "interesting find....I am looking up the article now :)\n \n \nThe findings of this study revealed that unintended pregnancies resolved through abortion are associated with an increased risk for various forms of substance use\n\n \n Granted this doesn't say why this is the case (maybe the people that would get an abortion are just more likely to do these things)...but still interesting :)", 
   {}, 
   204092, 
   null, 
   1143348900.0
  ], 
  [
   204141, 
   null, 
   "jitobear", 
   "Interesting. Not too surprising either. There are likely plenty of unwanted pregnancies that stem (in part) from substance abuse. Drunk + Horny = doing stupid stuff.", 
   {}, 
   204096, 
   null, 
   1143384600.0
  ], 
  [
   204220, 
   null, 
   "Master_Shake", 
   "Interesting. Not too surprising either. There are likely plenty of unwanted pregnancies that stem (in part) from substance abuse. Drunk + Horny = doing stupid stuff.\n\n Yes, I'm sure that's true as well. Makes complete sense. But the article is saying that among those with unintended pregnancies, those who are using, are more likely to have an abortion than those who are not using. To me that makes sense as well, but I just wanted to clear up what it was saying.", 
   {}, 
   204141, 
   null, 
   1143414300.0
  ], 
  [
   204404, 
   null, 
   "Master_Shake", 
   "I'm quite surprised this hasn't got more attention. Usually all you have to do is whisper the word abortion around here and there's a firestorm. Not that that was what I was going for, I'm just surprised. Maybe this article is just too straightforward for people emoticon_xangel", 
   {}, 
   204220, 
   null, 
   1143523620.0
  ], 
  [
   204417, 
   null, 
   "Steeeeve", 
   "I'm quite surprised this hasn't got more attention. Usually all you have to do is whisper the word abortion around here and there's a firestorm. Not that that was what I was going for, I'm just surprised. Maybe this article is just too straightforward for people emoticon_xangel\n\n \n If I brought it up people would be all over this. This happened when I put a thing about abortion and the increase in mental illness.", 
   {}, 
   204404, 
   null, 
   1143531660.0
  ], 
  [
   204897, 
   null, 
   "Mickey Shane", 
   "People get intoxicated and their level of inhibition drops exponentially. Gee, Master Shake, you've really uncovered something big here.emoticon_rolleyes", 
   {}, 
   204417, 
   null, 
   1143847380.0
  ], 
  [
   204902, 
   null, 
   "thelmoose", 
   "I think that assuming a cause (alcohol) and effect (abortion) relationship from the results of this study is unwarranted. I don't know the specific test statistic that was used, but usually differences between case and control mean that a difference was found between the two groups that (statistically speaking), it could not be explained by a given degree of chance alone. I am not saying such a direct relationship does not exist, however, that conclusion cannot be made from this information.\n \n Not sure it matters, but I think it is important to make accurate conclusions from scientific studies and not to infer more or less than the results state. Correlation and causality are two very different things.", 
   {}, 
   204897, 
   null, 
   1143848700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Substance use and unintended pregnancy outcomes", 
  "url": "http://www.4forums.com/political/abortion-debates/7813-substance-use-unintended-pregnancy-outcomes.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7813, 
  "discussion_files": [
   [
    "10328.html", 
    "http://www.4forums.com/political/abortion-debates/7813-substance-use-unintended-pregnancy-outcomes-print.html"
   ]
  ], 
  "identifier": 7813
 }
]