[
 [
  [
   204263, 
   null, 
   "BobNelson2", 
   "Ohio Anti-Gay Amendment Ties Prosecutor's Hands In Domestic Violence Cases\n \n http://www.365gay.com/Newscon06/03/032606ohio.htm\n (Dayton, Ohio) In case that has been closely watched by lawyers across the country an Ohio appeals court has ruled that domestic violence charges cannot be laid in cases where the couple is unmarried because of the state's ban on same-sex marriage.\n \n Opponents of the ban, passed in 2004, warned that it was so poorly worded it could be used to deny rights to unmarried opposite sex couples.\n \n Since then prosecutors in several Ohio counties have refused to lay charges in cases of domestic violence involving non married opposite-sex couples. \n Now, the forces who passed this amendment -- introduced by and passed with the support of 100% of the GOP delegation -- said this couldn't happen.\n \n Anti-gay fighters are not only mean, nasty, and dishonest... they're incompetent. Quelle surprise!", 
   {
    "post_info": {
     "post_title": "Anti-gay legislation preventing prosecution of HETEROSEXUAL domestic violence cases"
    }
   }, 
   null, 
   null, 
   1143449220.0
  ], 
  [
   204265, 
   null, 
   "Matthew S", 
   "The christonazis who pushed for this amendment don't care. They believe straight couples who live together in sin deserve what they get. Also I believe every single ohio republican also supported the amendment. Which only goes to prove my point that consevatives are heartless.", 
   {}, 
   204263, 
   null, 
   1143454680.0
  ], 
  [
   204272, 
   null, 
   "Steeeeve", 
   "It would be nice if you included this\n \n \nThe Fifth, Seventh, Ninth and 12th District appellate courts have ruled that the amendment does not render the domestic violence law unconstitutional for unmarried people.\n\n \n For now, it was 1 district court out of 5 that heard a case like this.\n \n I wonder what the difference in charges is for Domestic Violence and misdemeanor assault.", 
   {
    "post_info": {
     "post_title": "Atleast mention this part:"
    }
   }, 
   204265, 
   null, 
   1143474000.0
  ], 
  [
   204344, 
   null, 
   "BobNelson2", 
   "It would be nice if you included this\n\n \n How can I include something that isn't there?\n \n It would be nice if you gave a link for the story YOU found.\n \n \n I also have to say that sowing confusion in the courts (as the flawed amendment has done) is hardly the best defense of the intent and abilities of the law's sponsors...", 
   {}, 
   204272, 
   null, 
   1143502920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Anti-gay legislation preventing prosecution of HETEROSEXUAL domestic violence cases", 
  "url": "http://www.4forums.com/political/gay-rights-debates/7819-anti-gay-legislation-preventing-prosecution-heterosexual-domestic-violence-cases.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 7819, 
  "discussion_files": [
   [
    "11038.html", 
    "http://www.4forums.com/political/gay-rights-debates/7819-anti-gay-legislation-preventing-prosecution-heterosexual-domestic-violence-cases-print.html"
   ]
  ], 
  "identifier": 7819
 }
]