[
 [
  [
   204292, 
   null, 
   "BirchTree", 
   "Anyone seen V for Vendetta yet? What's your opinion of the Orwellian-esque references?", 
   {
    "post_info": {
     "post_title": "V for Vendetta"
    }
   }, 
   null, 
   null, 
   1143484440.0
  ], 
  [
   204299, 
   null, 
   "Master_Shake", 
   "I haven't, but it looked interesting but also potentially pretensious. Is it any good? Is it worth seeing?", 
   {}, 
   204292, 
   null, 
   1143489660.0
  ], 
  [
   204309, 
   null, 
   "daewoo", 
   "I watched it yesterday. It is not showing in our area, so I downloaded it via bit torrent.\n \n I thought it was an Ok movie. There are some interesting references in there. \n \n I don't know if it is really worth all the media hype. I think the big deal is not so much the movie itself, which is OK, but a little childish, but rather the fact that the main charachter is a TERRORIST and he is being portrayed in a positive light. \n \n This is similar to Syriana in that regard. Current CW states that we are not supposed to cosider a terrorists motives, grievances, or the facts of the situation before we condemn them. We are being programed to automatically acceot the authority of our government, and V for Vendetta is contrary to that programming.", 
   {}, 
   204299, 
   null, 
   1143493200.0
  ], 
  [
   204310, 
   null, 
   "Master_Shake", 
   "I watched it yesterday. It is not showing in our area, so I downloaded it via bit torrent.\n \n I thought it was an Ok movie. There are some interesting references in there. \n \n I don't know if it is really worth all the media hype. I think the big deal is not so much the movie itself, which is OK, but a little childish, but rather the fact that the main charachter is a TERRORIST and he is being portrayed in a positive light. \n \n This is similar to Syriana in that regard.\n\n What a coincidence! Syriana kinda sucked too! :p \n \nCurrent CW states that we are not supposed to cosider a terrorists motives, grievances, or the facts of the situation before we condemn them. We are being programed to automatically acceot the authority of our government, and V for Vendetta is contrary to that programming.\n\n Maybe I'm just out of the loop, but what is CW?", 
   {}, 
   204309, 
   null, 
   1143493860.0
  ], 
  [
   204311, 
   null, 
   "daewoo", 
   "What a coincidence! Syriana kinda sucked too! :p \n \n Maybe I'm just out of the loop, but what is CW?\n\n \n Conventional Wisdom", 
   {}, 
   204310, 
   null, 
   1143493980.0
  ], 
  [
   204386, 
   null, 
   "Master_Shake", 
   "Conventional Wisdom\n\n Gotcha. Thanks for clearing that up.", 
   {}, 
   204311, 
   null, 
   1143515940.0
  ], 
  [
   204874, 
   null, 
   "sanguinekane", 
   "Definitely worth seeing IMHO. Especially if you ever read the comic books.", 
   {}, 
   204386, 
   null, 
   1143840960.0
  ], 
  [
   204893, 
   null, 
   "Master_Shake", 
   "SPOILER ALERT\n It's probably not that big a deal, but I don't want anyone getting mad about me for revealing something they didn't want to know.\n \n I didn't know it was the Wachowski brothers before I went in and when I saw their names in the credits I thought \"ahh, that explains the pretentiousness.\"\n \n This movie was a bit disappointing. I liked it up until the torture/false imprisonment sequence. That's when it just started falling apart. The problem with this sequence is they sacrificed telling the story for making a point, (Something the W brothers have become experts at emoticon_rolleyes ) and one that wasn't even all that believable and quite lame to be honest. Then, after that, the Wachowski brothers thought \"Oh XXXX, we need some romantic interest, let's have them dance.\" That and the kiss were just plain, good ole fashioned stupid. Then, that whole bit when Evey said V was her \"father, mother,friend. He's you, he's me, he's all of us.\" Gag me, please! My best guess (as it was such bad writing in that moment) was that they were trying to make a point about the nature of V somehow being in the nature of us all. Just another load of Wachowski pretension.\n \n And do we really need to see V coming out of the fire 19 times?\n \n And this:\n Evey Hammond: I don't want you to die.\n V: That is the mostbeautiful thing you could have ever given me.\n was the lamest death scene I think I might have ever seen. This scene was also quite emotionally ineffective because long before this, I not only didn't care if V died, I wanted him to. I was kind of hoping Evey would do it actually.\n \n In the end, it was disappointing, because I really did like most of the first 2/3 or so of the film and thought it had a lot of potential.", 
   {
    "post_info": {
     "post_title": "P for Pretentious"
    }
   }, 
   204874, 
   null, 
   1143845940.0
  ], 
  [
   205070, 
   null, 
   "emoreno2292", 
   "I agree, the ending lines weren't exactly award winning material, but the movie is flat out terrifying. It wasn't scary in the BOO, killer jumps out of the shadows scary, but its depiction of the society based on unity through faith was enough to make my skin crawl.", 
   {}, 
   204893, 
   null, 
   1143943380.0
  ], 
  [
   211085, 
   null, 
   "Inyx", 
   "I though it was quite interesting. Been a while since I sae something comparable to The Cube.", 
   {}, 
   205070, 
   null, 
   1146665160.0
  ], 
  [
   217437, 
   null, 
   "wallninja", 
   "I think it is worth renting maybe, but not seeing in theaters. The long boring filler about the two women almost put me to sleep. I wanted a lot more action than it delivered. Not on my top list, that's for sure.", 
   {}, 
   211085, 
   null, 
   1150493580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  V for Vendetta", 
  "url": "http://www.4forums.com/political/entertainment-debates/7821-v-vendetta.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 7821, 
  "discussion_files": [
   [
    "11186.html", 
    "http://www.4forums.com/political/entertainment-debates/7821-v-vendetta-print.html"
   ]
  ], 
  "identifier": 7821
 }
]