[
 [
  [
   204473, 
   null, 
   "AlchemistJade", 
   "This came about spontaneously during a History class I had one day. We suddenly broke into debate, as we usual do, and this time about the whole deal of Creationism vs Evolution. I see a simple solution to this that seems plausible. But maybe because of my youth, I'm not grasping everything. \n \n I propose this. God, (or a superior being beyond our strength), created some things...in order to start evolution. Then he slapped the ball and thus started it rolling in the direction of human evolution and the evolution of many other things. This is a simple solution I think. It talks about God, making Creationism supporters happy that he's in it, but yet talks about him scientifically speaking as not to mess with the seperation of church and state and the controlling of religion in schools. Also, God should be mentioned also as an upper being or a different superior being, so atheist and non-Godly supporters can relate. Then there is, the evolution. This gives it...belief more it less. Because it's impossible God made everything at once, or so I think. Skulls and remains of before beings, and checked carbon levels prove this.\n \n Now you can debate for your own pleasure. I just wanted my voice to be heard. \n \n ^_^ ~Jade~\n \n NOTE: << Sorry. I know this is in a wrong place. I didn't see the whole topic dedicated to this debate. << If I could be moved, I would greatly apperciate it. :3 Thanks again. <_<;", 
   {
    "post_info": {
     "post_title": "A fix to the Evolution Problem"
    }
   }, 
   null, 
   null, 
   1143595800.0
  ], 
  [
   204523, 
   null, 
   "Kronus", 
   "\n I propose this. God, (or a superior being beyond our strength), created some things...in order to start evolution. Then he slapped the ball and thus started it rolling in the direction of human evolution and the evolution of many other things. This is a simple solution I think. It talks about God, making Creationism supporters happy that he's in it, but yet talks about him scientifically speaking as not to mess with the seperation of church and state and the controlling of religion in schools. \n \n\n \n One problem. The point isn't to make everyone happy, or give everyone a say. The point is truth. The truth is that creationism isn't science, and so shouldn't be presented in a science class. If you wanted to present your idea in a philosophy class than it would be appropriate.", 
   {}, 
   204473, 
   null, 
   1143656100.0
  ], 
  [
   204528, 
   null, 
   "Steeeeve", 
   "One problem. The point isn't to make everyone happy, or give everyone a say. The point is truth. The truth is that creationism isn't science, and so shouldn't be presented in a science class. If you wanted to present your idea in a philosophy class than it would be appropriate.\n\n It should also be noted that science is not always truth.", 
   {}, 
   204523, 
   null, 
   1143660180.0
  ], 
  [
   204533, 
   null, 
   "Alan Ryan", 
   "Science is about the pursuit of truth.", 
   {}, 
   204528, 
   null, 
   1143663780.0
  ], 
  [
   204536, 
   null, 
   "Kronus", 
   "It should also be noted that science is not always truth.\n\n Your observation, while close to accurate, is irrelavant. The question isn't whether science is right or not; it's whether creationism is science. If it's not science, and it isn't, than it has no part in a science class, it belongs somewhere else. My point, which you seem to have missed, is that we shouldn't be shooting for making people happy, we should be trying to do things correctly. Teach science in science class, discuss creationism in comparative religion or philosophy or wherever else it's appropriate.", 
   {}, 
   204528, 
   null, 
   1143664920.0
  ], 
  [
   204577, 
   null, 
   "zachvac", 
   "This came about spontaneously during a History class I had one day. We suddenly broke into debate, as we usual do, and this time about the whole deal of Creationism vs Evolution. I see a simple solution to this that seems plausible. But maybe because of my youth, I'm not grasping everything. \n \n I propose this. God, (or a superior being beyond our strength), created some things...in order to start evolution. Then he slapped the ball and thus started it rolling in the direction of human evolution and the evolution of many other things. This is a simple solution I think. It talks about God, making Creationism supporters happy that he's in it, but yet talks about him scientifically speaking as not to mess with the seperation of church and state and the controlling of religion in schools. Also, God should be mentioned also as an upper being or a different superior being, so atheist and non-Godly supporters can relate. Then there is, the evolution. This gives it...belief more it less. Because it's impossible God made everything at once, or so I think. Skulls and remains of before beings, and checked carbon levels prove this.\n \n Now you can debate for your own pleasure. I just wanted my voice to be heard. \n \n ^_^ ~Jade~\n \n NOTE: << Sorry. I know this is in a wrong place. I didn't see the whole topic dedicated to this debate. << If I could be moved, I would greatly apperciate it. :3 Thanks again. <_<;\n\n \n This would be Intelligent Design, which as pointed out by Kronus, isn't science.", 
   {}, 
   204473, 
   null, 
   1143684540.0
  ], 
  [
   205432, 
   null, 
   "PoohBear", 
   "now what im thinking is that what Steeve said in the first place was Theistic Evolution.. but thats also combining God with Evolution which many people do not want to do for many reason.. but its still not a very simple solution.. too many twists and turns.", 
   {}, 
   204577, 
   null, 
   1144131960.0
  ], 
  [
   205436, 
   null, 
   "AlchemistJade", 
   "I sorta want to revise what I said. The Bible isn't techniqueally a theroy. It's what was recorded. So does it even have a right to be placed next to a theroy such as evolution? Evolution can be roughly proven, but not down to the bone.", 
   {}, 
   205432, 
   null, 
   1144138260.0
  ], 
  [
   205456, 
   null, 
   "Ripskar", 
   "What you're dealing with isn't that which is presented on the surface.\n If you were to look outside the US you would find that this is a non-debate.\n In Europe Christianity is dominated by the established churches, none of which go in for the \"debate\". The Creationists are all the smaller churches that get influence in the US because the US isn't a Christian Country and isn't dominated by an official established church.\n What you have are numerous groups with false beliefs such as the notion that Darwinian evolution is a cause of atheism.\n Darwin does not drive people from the churches, that is to do with a lack of connection with what they present. At the end of the day Christianity isn't for everyone, One size does not fit all- as proven by Catholicism and development of Protestantism, though they won't recognise that.\n \n Not everyone likes Rock music or classical music, though country music should erased from the face of the Earth for being an abomination!!!;)\n We are all individuals (And no I'm not Brian, and neither is my wife!!!) and we all have our own views but no deity plays a role in science, nor should it.", 
   {}, 
   205436, 
   null, 
   1144163040.0
  ], 
  [
   205461, 
   null, 
   "Kronus", 
   "I sorta want to revise what I said. The Bible isn't techniqueally a theroy. It's what was recorded. So does it even have a right to be placed next to a theroy such as evolution? Evolution can be roughly proven, but not down to the bone.\n\n \n The Bible certainly doesn't belong next to evolution in a science class. If someone wanted to run a college seminar \"Ideas about Creation\" than it would be appropriate to have them together.", 
   {}, 
   205436, 
   null, 
   1144165680.0
  ], 
  [
   205463, 
   null, 
   "Prototype", 
   "Science is about the pursuit of truth.\n\n \n This sounds right. Science is also this.: The observation, identification, description, experimental investigation, and theoretical explanation of phenomena. \n \n Evolution is a theory (and an acceptable one) to many people. Creationism is also a theory. Creationism can't be falsified, but beither can evolution. The thing is, all six concepts of it are taught as facts instead of theories. The problem with this sort of thing is the people who hold evolution as true won't give any ground to people who believe in intelligent design. Evolution can't be falsified, strictly speaking, but neither can creationism. The only difference is evolution is taught in science classrooms and creationism is not.\n \n Creationism has been used as the pursuit of Science, in fact, many older scientists have used God and their belief in his orderly design to pursue their studies and succeeded. So, why isn't this being taught as well?", 
   {}, 
   204533, 
   null, 
   1144166100.0
  ], 
  [
   205467, 
   null, 
   "Rovdak", 
   "In Europe Christianity is dominated by the established churches, none of which go in for the \"debate\". The Creationists are all the smaller churches that get influence in the US because the US isn't a Christian Country and isn't dominated by an official established church.\n\n \n Europeans' views on church, state and the separation thereof is a bit more complicated than that, and can differ quite a bit from country to country. Here in NL it's a rather simple matter: as the theory of evolution is accepted by the overwhelming majority of the biological community, it's considered a mandatory part of the biology curriculum, noone gives a wooden nickle whether the student believes in it or not, but one is required to understand how mainstream biology explains how the critters we know came to be. Just as in religion class one is expected to explain the mainstream theories of the major Christian sects, Judaism, Islam, Hinduism, and Buddhism.\n \n It is imho more likely that due to the multitude of religious wars fought in Europe in previous centuries, people in Europe are more wary to let churches dictate public life than people in the US are", 
   {}, 
   205456, 
   null, 
   1144166880.0
  ], 
  [
   205469, 
   null, 
   "Kronus", 
   "\n Evolution is a theory (and an acceptable one) to many people. Creationism is also a theory. Creationism can't be falsified, but beither can evolution. \n\n Creationism is not a scientific theory, in any sense of the word. It can't be tested, it's not based on observation, it can't be disproven. Evolution is science. It has been tested, it's based on observation, and it could in fact be falsified. Experiments have been run that demonstrate the validity of evolution; if the experiments had come up with different results it would have been evidence against evolutionary theory.\n \n \n\n The thing is, all six concepts of it are taught as facts instead of theories. The problem with this sort of thing is the people who hold evolution as true won't give any ground to people who believe in intelligent design. Evolution can't be falsified, strictly speaking, but neither can creationism. The only difference is evolution is taught in science classrooms and creationism is not.\n\n No, the difference is that evolution is real science and creationism is strictly religious.\n \n \n \n\n Creationism has been used as the pursuit of Science, in fact, many older scientists have used God and their belief in his orderly design to pursue their studies and succeeded. So, why isn't this being taught as well?\n\n Creationism has not been used in the pursuit of science; it's the antithesis of science. All it's been used for is the pursuit of answers; answers based on faith and not on observations of reality. Science looks for repeatable, verifiable results. Creationism just wants results. That's why it doesn't get taught.", 
   {}, 
   205463, 
   null, 
   1144168080.0
  ], 
  [
   205525, 
   null, 
   "Prototype", 
   "Creationism has not been used in the pursuit of science; it's the antithesis of science. All it's been used for is the pursuit of answers; answers based on faith and not on observations of reality. Science looks for repeatable, verifiable results. Creationism just wants results. That's why it doesn't get taught.\n\n \n Many scientists have- based on their faith, used it as a way to pursue scientific studies. Let me explain. They did it because they believed the universe was created, and they believed it was created by an intelligent designer. They expected to find an orderly creation before them in what they studied of chemicals, gravity and atoms.(Actually, maybe I should just put chemistry and atoms together since they involve each other so often.)\n \n That is what they found. It is not a scientific reason to pursue science, but none of it can be taught. I'm not asking why Christianity isn't taught, I'd like to know why Intelligent design isn't taught. I wouldn't ask it ro replace evolution, but I'd like to know why it isn't included in science classrooms. After all, intelligent design predicts an orderly creation. That is what is here. Evolution doesn't, and I've had more questions come into my mind doubting its theory than intelligent design.", 
   {}, 
   205469, 
   null, 
   1144192140.0
  ], 
  [
   205531, 
   null, 
   "Ripskar", 
   "Intelligent Design is not Science, it failed at the point of review by peer reviewed journals. As such there is nothing to teach, just like they don't teach about Area 51, or Alien abductees.", 
   {}, 
   205525, 
   null, 
   1144193940.0
  ], 
  [
   205537, 
   null, 
   "Rovdak", 
   "Many scientists have- based on their faith, used it as a way to pursue scientific studies. Let me explain. They did it because they believed the universe was created, and they believed it was created by an intelligent designer. They expected to find an orderly creation before them in what they studied of chemicals, gravity and atoms.(Actually, maybe I should just put chemistry and atoms together since they involve each other so often.)\n \n That is what they found. It is not a scientific reason to pursue science, but none of it can be taught. I'm not asking why Christianity isn't taught, I'd like to know why Intelligent design isn't taught. I wouldn't ask it ro replace evolution, but I'd like to know why it isn't included in science classrooms. After all, intelligent design predicts an orderly creation. That is what is here. Evolution doesn't, and I've had more questions come into my mind doubting its theory than intelligent design.\n\n \n ID is not considered a science because aspects of the hypothesis of Intelligent design cannot be reproduced in a controlled enviroment. I don't mind ID to be taught, but it would be put in religious class, not science class.\n \n As for evolution, to name a current example, MRSA supports the theory of evolution, since it is a common bacterium (Staphylococcus aureus) that spontaneously developed a series of resistances it previously did not have. Intelligent design fails to explain why MRSA developed", 
   {}, 
   205525, 
   null, 
   1144194480.0
  ], 
  [
   205558, 
   null, 
   "Prototype", 
   "As for evolution, to name a current example, MRSA supports the theory of evolution, since it is a common bacterium (Staphylococcus aureus) that spontaneously developed a series of resistances it previously did not have. Intelligent design fails to explain why MRSA developed\n\n \n This, I know, can be done naturally. That is the one aspect of biological evolution that I know does happen. Variations, I mean. But things like a dinosaur evolving into a bird seems like nonsense to me, Creationism doesn't teach that. It teaches that everything was created to (from a christian perspective) bring forth after their kind. Evolution teaches that every kind is linked together, while creationism teaches that all the different \"kinds\" (Not species) are seperate in themselves. That is a scientific theory that Creationism teaches, but that isn't taught in a science classroom.", 
   {}, 
   205537, 
   null, 
   1144200480.0
  ], 
  [
   205561, 
   null, 
   "Big_Bear_Scot", 
   "Why is that Creationist believe God(as in Judeo-Christian) created all living beings ?\n \n Why is their creation myth more Scientific than the Hindu, Native American or Australian Aboriginal ?\n \n If we go down the route of teaching Intelligent Design we might as well give equal footing to all those other creation stories in the Science class room", 
   {}, 
   205558, 
   null, 
   1144201320.0
  ], 
  [
   205584, 
   null, 
   "zachvac", 
   "Why is that Creationist believe God(as in Judeo-Christian) created all living beings ?\n \n Why is their creation myth more Scientific than the Hindu, Native American or Australian Aboriginal ?\n \n If we go down the route of teaching Intelligent Design we might as well give equal footing to all those other creation stories in the Science class room\n\n \n To be fair, the ID \"theory\" doesn't say anything about Christianity, it just suggests that the origin of life could be an intelligent designer. This could be any religion. It's still not science, and almost all people supporting ID assume that the ID is the Christian God, but if they actually teach it, it's taught as just any initelligent designer.", 
   {}, 
   205561, 
   null, 
   1144210860.0
  ], 
  [
   205605, 
   null, 
   "Prototype", 
   "To be fair, the ID \"theory\" doesn't say anything about Christianity, it just suggests that the origin of life could be an intelligent designer. This could be any religion. It's still not science, and almost all people supporting ID assume that the ID is the Christian God, but if they actually teach it, it's taught as just any initelligent designer.\n\n \n Correct. Perhaps it's a prejudice or automatic assumption since Christianity seems like the most widely spread religion in this country. I'm not entirely sure why though...", 
   {}, 
   205584, 
   null, 
   1144219140.0
  ], 
  [
   205610, 
   null, 
   "Jo Bennett", 
   "Given that the people pushing for ID in schools are almost universally fundie Christians whose actual beliefs are creationist, it's hardly surprising that the two are taken together. In any case, ID is a hypothesis, a speculation. It is religious dogma with the explicit religion removed, it is not science. I does not say \"this is the evidence we have, what's the best explanation for this?\", it say \"this is our explanation, can we find evidence that will fit?\".", 
   {}, 
   205605, 
   null, 
   1144234980.0
  ], 
  [
   205737, 
   null, 
   "Prototype", 
   "Given that the people pushing for ID in schools are almost universally fundie Christians whose actual beliefs are creationist, it's hardly surprising that the two are taken together. In any case, ID is a hypothesis, a speculation. It is religious dogma with the explicit religion removed, it is not science. I does not say \"this is the evidence we have, what's the best explanation for this?\", it say \"this is our explanation, can we find evidence that will fit?\".\n\n \n I'm not sure that's true, that bit about I.D.ers being Christians. Have you ever considered that a good number of them may be parents or teachers who see it as a better alternative to Evolution in their search for scientific truth? The random oddities required for evolutionary advancement seems quite illogical next to the theory of intelligent design. They may not even be converted yet, I don't think that statement is valid.\n \n I.D. is a hypothesis based on religion. That is true, but I.D.ers are labelled automatically as religious people by biased individuals who can't stand to see something like religion in a classroom. That is alright, but I hardly see any motive in there for the science, I see it more as a way to keep a religious view (like Christianity) out because it teaches there are rules to life. And they don't like that.", 
   {}, 
   205610, 
   null, 
   1144306680.0
  ], 
  [
   205742, 
   null, 
   "Jo Bennett", 
   "Problem with your view is that in neglects the fact that a lot of scientists, and proponents of science, including myself, are Christians and have personal views that broadly match ID. The difference is that I recognise that my views are personal and religious, they are based on faith not evidence. If I want my kids to be taught that, I will send them to Sunday School, it has no place in a science classroom. I challenge you to find one advocate of ID in the US who isn't a Christian.", 
   {}, 
   205737, 
   null, 
   1144317240.0
  ], 
  [
   205796, 
   null, 
   "Ripskar", 
   "Intelligent Design and Creationism are tied to monotheism (Of which Christianity represents the largest group) because if taken literally it cannot exist without being the the primary cause of everything. Of course that causes more problems than it solves, just look at the mess religion has got mired in.\n Buddism and Taoism don't rely on this sort of Orign myth and Polytheism doesn't get caught because its sensitive areas lie elsewhere.\n \n I know Jo B. doesn't belive in Genesis which proves that Christainity doesn't explicitly rely on the Bible being true. However Intelligent Design doesn't make sence independently of a monotheistic viewpoint.\n There is no hard data, all examples of irreducible complexity have been proven false. Thus ID has no current scientific validity.\n \n By \"Random oddities\" do you mean mutants? If so then there are plenty of those walking around.", 
   {}, 
   205742, 
   null, 
   1144348980.0
  ], 
  [
   206048, 
   null, 
   "DamEtel", 
   "I'm not asking why Christianity isn't taught, I'd like to know why Intelligent design isn't taught. I wouldn't ask it ro replace evolution, but I'd like to know why it isn't included in science classrooms. \n\n \n Here's a little bit of material for you. Read it and your question will be answered in that it will show that Intelligent Design is a religious \"theory\". \n \n There's another similar-sized chunk of material from the same source that explains why ID is not science, but I won't post all of it too (afterall, you can simply click on the link to read it).\n \n The following is an excerpt from the case Tammy Kitzmiller vs. Dover Area School District - case :04-cv-02688-JEJ Document 342, Filed 12/20/2005 - heard in front Judge Jones of the US District Court for the Middle District of Pennsylvania (http://www.pamd.uscourts.gov/kitzmiller/kitzmiller_342.pdf). \n \n \n PS: Italics in the original were lost during the copy and paste process. \n \n \n\n A significant aspect of the IDM is that despite Defendants' protestations to the contrary, it describes ID as a religious argument. In that vein, the writings of leading ID proponents reveal that the designer postulated by their argument is the God of Christianity. Dr. Barbara Forrest, one of Plaintiffs' expert witnesses, is the author of the book Creationism's Trojan Horse. She has thoroughly and exhaustively chronicled the history of ID in her book and other writings for her testimony in this case. Her testimony, and the exhibits which were admitted with it, provide a wealth of statements by ID leaders that reveal ID's religious, philosophical, and cultural content. The following is a representative grouping of such statements made by prominent ID proponents.\n \n Phillip Johnson, considered to be the father of the IDM, developer of ID's \"Wedge Strategy,\" which will be discussed below, and author of the 1991 book entitled Darwin on Trial, has written that \"theistic realism\" or \"mere creation\" are defining concepts of the IDM. This means \"that God is objectively real as Creator and recorded in the biological evidence . . .\" (Trial Tr. vol. 10, Forrest Test., 80-81, Oct. 5, 2005; P-328). In addition, Phillip Johnson states that the \"Darwinian theory of evolution contradicts not just the Book of Genesis, but every word in the Bible from beginning to end. It contradicts the idea that we are here because a creator brought about our existence for a purpose.\" (11:16-17 (Forrest); P-524 at 1). ID proponents Johnson, William Dembski, and Charles Thaxton, one of the editors of Pandas, situate ID in the Book of John in the New Testament of the Bible, which begins, \"In the Beginning was the Word, and the Word was God.\" (11:18-20, 54-55 (Forrest); P-524; P-355; P-357). Dembski has written that ID is a \"ground clearing operation\" to allow Christianity to receive serious consideration, and \"Christ is never an addendum to a scientific theory but always a completion.\" (11:50-53 (Forrest); P-386; P-390). Moreover, in turning to Defendants' lead expert, Professor Behe, his testimony at trial indicated that ID is only a scientific, as opposed to a religious, project for him; however, considerable evidence was introduced to refute this claim. Consider, to illustrate, that Professor Behe remarkably and unmistakably claims that the plausibility of the argument for ID depends upon the extent to which one believes in the existence of God. (P-718 at 705) (emphasis added). As no evidence in the record indicates that any other scientific proposition's validity rests on belief in God, nor is the Court aware of any such scientific propositions, Professor Behe's assertion constitutes substantial evidence that in his view, as is commensurate with other prominent ID leaders, ID is a religious and not a scientific proposition.\n \n Dramatic evidence of ID's religious nature and aspirations is found in what is referred to as the \"Wedge Document.\" The Wedge Document, developed by the Discovery Institute's Center for Renewal of Science and Culture (hereinafter \"CRSC\"), represents from an institutional standpoint, the IDM's goals and objectives, much as writings from the Institute for Creation Research did for the earlier creation-science movement, as discussed in McLean. (11:26-28 (Forrest)); McLean, 529 F. Supp. at 1255. The Wedge Document states in its \"Five Year Strategic Plan Summary\" that the IDM's goal is to replace science as currently practiced with \"theistic and Christian science.\" (P-140 at 6). As posited in the Wedge Document, the IDM's \"Governing Goals\" are to \"defeat scientific materialism and its destructive moral, cultural, and political legacies\" and \"to replace materialistic explanations with the theistic understanding that nature and human beings are created by God.\" Id. at 4. The CSRC expressly announces, in the Wedge Document, a program of Christian apologetics to promote ID. A careful review of the Wedge Document's goals and language throughout the document reveals cultural and religious goals, as opposed to scientific ones.\n (11:26-48 (Forrest); P-140). ID aspires to change the ground rules of science to make room for religion, specifically, beliefs consonant with a particular version of Christianity.\n \n In addition to the IDM itself describing ID as a religious argument, ID's religious nature is evident because it involves a supernatural designer. The courts in Edwards and McLean expressly found that this characteristic removed creationism from the realm of science and made it a religious proposition. Edwards, 482 U.S. at 591-92; McLean, 529 F. Supp. at 1265-66. Prominent ID proponents have made abundantly clear that the designer is supernatural. \n \n Defendants' expert witness ID proponents confirmed that the existence of a supernatural designer is a hallmark of ID. First, Professor Behe has written that by ID he means \"not designed by the laws of nature,\" and that it is \"implausible that the designer is a natural entity.\" (P-647 at 193; P-718 at 696, 700). Second, Professor Minnich testified that for ID to be considered science, the ground rules of science have to be broadened so that supernatural forces can be considered. (38:97 (Minnich)). Third, Professor Steven William Fuller testified that it is ID's project to change the ground rules of science to include the supernatural. (Trial Tr. vol. 28, Fuller Test., 20-24, Oct. 24, 2005). Turning from defense expert witnesses to leading ID proponents, Johnson has concluded that science must be redefined to include the supernatural if religious challenges to evolution are to get a hearing. (11:8-15 (Forrest); P-429). Additionally, Dembski agrees that science is ruled by methodological naturalism and argues that this rule must be overturned if ID is to prosper. (Trial Tr. vol. 5, Pennock Test., 32-34, Sept. 28, 2005).\n \n Further support for the proposition that ID requires supernatural creation is found in the book Pandas, to which students in Dover's ninth grade biology class are directed. Pandas indicates that there are two kinds of causes, natural and intelligent, which demonstrate that intelligent causes are beyond nature. (P-11 at 6). Professor Haught, who as noted was the only theologian to testify in this case, explained that in Western intellectual tradition, non-natural causes occupy a space reserved for ultimate religious explanations. (9:13-14 (Haught)). Robert Pennock, Plaintiffs' expert in the philosophy of science, concurred with Professor Haught and concluded that because its basic proposition is that the features of the natural world are produced by a transcendent, immaterial, non-natural being, ID is a religious proposition regardless of whether that religious proposition is given a recognized religious label. (5:55-56 (Pennock)). It is notable that not one defense expert was able to explain how the supernatural action suggested by ID could be\n anything other than an inherently religious proposition. Accordingly, we find that ID's religious nature would be further evident to our objective observer because it directly involves a supernatural designer.\n \n A \"hypothetical reasonable observer,\" adult or child, who is \"aware of the history and context of the community and forum\" is also presumed to know that ID is a form of creationism. Child Evangelism, 386 F.3d at 531 (citations omitted); Allegheny, 492 U.S. at 624-25. The evidence at trial demonstrates that ID is nothing less than the progeny of creationism. What is likely the strongest evidence supporting the finding of ID's creationist nature is the history and historical pedigree of the book to which students in Dover's ninth grade biology class are referred, Pandas. Pandas is published by an organization called FTE, as noted, whose articles of incorporation and filings with the Internal Revenue Service describe it as a religious, Christian organization. (P-461; P-28; P-566; P-633; Buell Dep. 1:13, July 8, 2005). Pandas was written by Dean Kenyon and PercivalDavis, both acknowledged creationists, and Nancy Pearcey, a Young Earth Creationist, contributed to the work. (10:102-08 (Forrest)).\n \n As Plaintiffs meticulously and effectively presented to the Court, Pandas went through many drafts, several of which were completed prior to and some after the Supreme Court's decision in Edwards, which held that the Constitution forbids teaching creationism as science. By comparing the pre and post Edwards drafts of Pandas, three astonishing points emerge: (1) the definition for creation science in early drafts is identical to the definition of ID; (2) cognates of the word creation (creationism and creationist), which appeared approximately 150 times were deliberately and systematically replaced with the phrase ID; and (3) the changes occurred shortly after the Supreme Court held that creation science is religious and cannot be taught in public school science classes in Edwards. This word substitution is telling, significant, and reveals that a purposeful change of words was effected without any corresponding change in content, which directly refutes FTE's argument that by merely disregarding the words \"creation\" and \"creationism,\" FTE expressly rejected creationism in Pandas. In early pre-Edwards drafts of Pandas, the term \"creation\" was defined as \"various forms of life that began abruptly through an intelligent agency with their distinctive features intact - fish with fins and scales, birds with feathers, beaks, and wings, etc,\" the very same way in which ID is defined in the subsequent published versions. (P-560 at 210; P-1 at 2-13; P-562 at 2-14, P-652 at 2-15; P-6 at 99-100; P-11 at 99-100; P-856.2.). This definition was described by many witnesses for both parties, notably including defense experts Minnich and Fuller, as \"special creation\" of kinds of animals, an inherently religious and creationist concept. (28:85-86(Fuller); Minnich Dep. at 34, May 26, 2005; Trial Tr. vol. 1, Miller Test., 141-42, Sept. 26, 2005; 9:10 (Haught); Trial Tr. vol. 33, Bonsell Test., 54-56, Oct. 31, 2005). Professor Behe's assertion that this passage was merely a description of appearances in the fossil record is illogical and defies the weight of the evidence that the passage is a conclusion about how life began based upon an interpretation of the fossil record, which is reinforced by the content of drafts of Pandas.\n \n The weight of the evidence clearly demonstrates, as noted, that the systemic change from \"creation\" to \"intelligent design\" occurred sometime in 1987, after the Supreme Court's important Edwards decision. This compelling evidence strongly supports Plaintiffs' assertion that ID is creationism re-labeled. Importantly, the objective observer, whether adult or child, would conclude from the fact that Pandas posits a master intellect that the intelligent designer is God. \n \n Further evidence in support of the conclusion that a reasonable observer, adult or child, who is \"aware of the history and context of the community and forum\" is presumed to know that ID is a form of creationism concerns the fact that ID uses the same, or exceedingly similar arguments as were posited in support of creationism. One significant difference is that the words \"God,\" \"creationism,\" and \"Genesis\" have been systematically purged from ID explanations, and replaced by an unnamed \"designer.\" Dr. Forrest testified and sponsored exhibits showing six arguments common to creationists. (10:140-48 (Forrest); P-856.5-856.10). Demonstrative charts introduced through Dr. Forrest show parallel arguments relating to the rejection of naturalism, evolution's threat to culture and society, \"abrupt appearance\" implying divine creation, the exploitation of the same alleged gaps in the fossil record, the alleged inability of science to explain complex biological information like DNA, as well as the theme that proponents of each version of creationism merely aim to teach a scientific alternative to evolution to show its \"strengths and weaknesses,\" and to alert students to a supposed \"controversy\" in the scientific community. (10:140-48 (Forrest)). In addition, creationists made the same argument that the complexity of the bacterial flagellum supported creationism as Professors Behe and Minnich now make for ID. (P-853;P-845; 37:155-56 (Minnich)). The IDM openly welcomes adherents to creationism into its \"Big Tent,\" urging them to postpone biblical disputes like the age of the earth. (11:3-15 (Forrest); P-429). Moreover and as previously stated, there is hardly better evidence of ID's relationship with creationism than an explicit statement by defense expert Fuller that ID is a form of creationism. (Fuller Dep. at 67, June 21, 2005) (indicated that ID is a modern view of creationism).\n \n", 
   {
    "unicode_changes_made": true
   }, 
   205525, 
   null, 
   1144485660.0
  ], 
  [
   206160, 
   null, 
   "DamEtel", 
   "Here's a little bit of material for you. Read it and your question will be answered in that it will show that Intelligent Design is a religious \"theory\". \n \n There's another similar-sized chunk of material from the same source that explains why ID is not science, but I won't post all of it too (afterall, you can simply click on the link to read it).\n\n \n Oh well, I'll go ahead and post that too.\n \n \n \n4. Whether ID is Science\n After a searching review of the record and applicable caselaw, we find that while ID arguments may be true, a proposition on which the Court takes no position, ID is not science. We find that ID fails on three different levels, any one of which is sufficient to preclude a determination that ID is science. They are: (1) ID violates the centuries-old ground rules of science by invoking and permitting supernatural causation; (2) the argument of irreducible complexity, central to ID, employs the same flawed and illogical contrived dualism that doomed creation science in the 1980's; and (3) ID's negative attacks on evolution have been refuted by the scientific community. As we will discuss in more detail below, it is additionally important to note that ID has failed to gain acceptance in the scientific community, it has not generated peer-reviewed publications, nor has it been the subject of testing and research.\n \n Expert testimony reveals that since the scientific revolution of the 16th and 17th centuries, science has been limited to the search for natural causes to explain natural phenomena. (9:19-22 (Haught); 5:25-29 (Pennock); 1:62 (Miller)). This revolution entailed the rejection of the appeal to authority, and by extension, revelation, in favor of empirical evidence. (5:28 (Pennock)). Since that time period, science has been a discipline in which testability, rather than any ecclesiastical authority or philosophical coherence, has been the measure of a scientific idea's worth. (9:21-22 (Haught); 1:63 (Miller)). In deliberately omitting theological or \"ultimate\" explanations for the existence or characteristics of the natural world, science does not consider issues of \"meaning\" and \"purpose\" in the world. (9:21 (Haught); 1:64, 87 (Miller)). While supernatural explanations may be important and have merit, they are not part of science. (3:103 (Miller); 9:19-20 (Haught)). This self-imposed convention of science, which limits inquiry to testable, natural explanations about the natural world, is referred to by philosophers as \"methodological naturalism\" and is sometimes known as the scientific method. (5:23, 29-30 (Pennock)). Methodological naturalism is a \"ground rule\" of science today which requires scientists to seek explanations in the world around us based upon what we can observe, test, replicate, and verify. (1:59-64, 2:41-43 (Miller); 5:8, 23-30 (Pennock)). \n \n As the National Academy of Sciences (hereinafter \"NAS\") was recognized by experts for both parties as the \"most prestigious\" scientific association in this country, we will accordingly cite to its opinion where appropriate. (1:94, 160-61 (Miller); 14:72 (Alters); 37:31 (Minnich)). NAS is in agreement that science is limited to empirical, observable and ultimately testable data: \"Science is a particular way of knowing about the world. In science, explanations are restricted to those that can be inferred from the confirmable data - the results obtained through observations and experiments that can be substantiated by other scientists. Anything that can be observed or measured is amenable to scientific investigation. Explanations that cannot be based upon empirical evidence are not part of science.\" (P-649 at 27).\n \n This rigorous attachment to \"natural\" explanations is an essential attribute to science by definition and by convention. (1:63 (Miller); 5:29-31 (Pennock)). We are in agreement with Plaintiffs' lead expert Dr. Miller, that from a practical perspective, attributing unsolved problems about nature to causes and forces that lie outside the natural world is a \"science stopper.\" (3:14-15 (Miller)). As Dr. Miller explained, once you attribute a cause to an untestable supernatural force, a proposition that cannot be disproven, there is no reason to continue seeking natural explanations as we have our answer. Id. \n \n ID is predicated on supernatural causation, as we previously explained and as various expert testimony revealed. (17:96 (Padian); 2:35-36 (Miller); 14:62 (Alters)). ID takes a natural phenomenon and, instead of accepting or seeking a natural explanation, argues that the explanation is supernatural. (5:107 (Pennock)).\n \n Further support for the conclusion that ID is predicated on supernatural causation is found in the ID reference book to which ninth grade biology students are directed, Pandas. Pandas states, in pertinent part, as follows:\n \n Darwinists object to the view of intelligent design because it does not give a natural cause explanation of how the various forms of life started in the first place. Intelligent design means that various forms of life began abruptly, through an intelligent agency, with their distinctive features already intact - fish with fins and scales, birds with feathers, beaks, and wings, etc.\n \n P-11 at 99-100 (emphasis added). Stated another way, ID posits that animals did not evolve naturally through evolutionary means but were created abruptly by a non-natural, or supernatural, designer. Defendants' own expert witnesses acknowledged this point. (21:96-100 (Behe); P-718 at 696, 700 (\"implausible that the designer is a natural entity\"); 28:21-22 (Fuller) (\". . . ID's rejection of naturalism and commitment to supernaturalism . . .\"); 38:95-96 (Minnich) (ID does not exclude the possibility of a supernatural designer, including deities).\n \n It is notable that defense experts' own mission, which mirrors that of the IDM itself, is to change the ground rules of science to allow supernatural causation of the natural world, which the Supreme Court in Edwards and the court in McLean correctly recognized as an inherently religious concept. Edwards, 482 U.S. at 591-92; McLean, 529 F. Supp. at 1267. First, defense expert Professor Fuller agreed that ID aspires to \"change the ground rules\" of science and lead defense expert Professor Behe admitted that his broadened definition of science, which encompasses ID, would also embrace astrology. (28:26 (Fuller); 21:37-42 (Behe)). Moreover, defense expert Professor Minnich acknowledged that for ID to be considered science, the ground rules of science have to be broadened to allow consideration of supernatural forces. (38:97 (Minnich)).\n \n Prominent IDM leaders are in agreement with the opinions expressed by defense expert witnesses that the ground rules of science must be changed for ID to take hold and prosper. William Dembski, for instance, an IDM leader, proclaims that science is ruled by methodological naturalism and argues that this rule must be overturned if ID is to prosper. (5:32-37 (Pennock)); P-341 at 224 (\"Indeed, entire fields of inquiry, including especially in the human sciences, will need to be rethought from the ground up in terms of intelligent design.\").\n \n The Discovery Institute, the think tank promoting ID whose CRSC developed the Wedge Document, acknowledges as \"Governing Goals\" to \"defeat scientific materialism and its destructive moral, cultural and political legacies\" and \"replace materialistic explanations with the theistic understanding that nature and human beings are created by God.\" (P-140 at 4). In addition, and as previously noted, the Wedge Document states in its \"Five Year Strategic Plan Summary\" that the IDM's goal is to replace science as currently practiced with \"theistic and Christian science.\" Id. at 6. The IDM accordingly seeks nothing less than a complete scientific revolution in which ID will supplant evolutionary theory.\n \n Notably, every major scientific association that has taken a position on the issue of whether ID is science has concluded that ID is not, and cannot be considered as such. (1:98-99 (Miller); 14:75-78 (Alters); 37:25 (Minnich)). Initially, we note that NAS, the \"most prestigious\" scientific association in this country, views ID as follows:\n \n Creationism, intelligent design, and other claims of supernatural intervention in the origin of life or of species are not science because they are not testable by the methods of science. These claims subordinate observed data to statements based on authority, revelation, or religious belief. Documentation offered in support of these claims is typically limited to the special publications of their advocates. These publications do not offer hypotheses subject to change in light of new data, new interpretations, or demonstration of error. This contrasts with science, where any hypothesis or theory always remains subject to the possibility of rejection or modification in the light of new knowledge.\n \n P-192 at 25. Additionally, the American Association for the Advancement of Science (hereinafter \"AAAS\"), the largest organization of scientists in this country, has taken a similar position on ID, namely, that it \"has not proposed a scientific means of testing its claims\" and that \"the lack of scientific warrant for so-called 'intelligent design theory' makes it improper to include as part of science education . . .\" (P-198). Not a single expert witness over the course of the six week trial identified one major scientific association, society or organization that endorsed ID as science. What is more, defense experts concede that ID is not a theory as that term is defined by the NAS and admit that ID is at best \"fringe science\" which has achieved no acceptance in the scientific community. (21:37-38 (Behe); Fuller Dep. at 98-101, June 21, 2005; 28:47 (Fuller); Minnich Dep. at 89, May 26, 2005). \n \n It is therefore readily apparent to the Court that ID fails to meet the essential ground rules that limit science to testable, natural explanations. (3:101-03 (Miller); 14:62 (Alters)). Science cannot be defined differently for Dover students than it is defined in the scientific community as an affirmative action program, as advocated by Professor Fuller, for a view that has been unable to gain a foothold within the scientific establishment. Although ID's failure to meet the ground rules of science is sufficient for the Court to conclude that it is not science, out of an abundance of caution and in the exercise of completeness, we will analyze additional arguments advanced regarding the concepts of ID and science.\n \n ID is at bottom premised upon a false dichotomy, namely, that to the extent evolutionary theory is discredited, ID is confirmed. (5:41 (Pennock)). This argument is not brought to this Court anew, and in fact, the same argument, termed \"contrived dualism\" in McLean, was employed by creationists in the 1980's to support \"creation science.\" The court in McLean noted the \"fallacious pedagogy of the two model approach\" and that \"[i]n efforts to establish 'evidence' in support of creation science, the defendants relied upon the same false premise as the two model approach . . . all evidence which criticized evolutionary theory was proof in support of creation science.\" McLean, 529 F. Supp. at 1267, 1269. We do not find this false dichotomy any more availing to justify ID today than it was to justify creation science two decades ago.\n \n ID proponents primarily argue for design through negative arguments against evolution, as illustrated by Professor Behe's argument that \"irreducibly complex\" systems cannot be produced through Darwinian, or any natural, mechanisms. (5:38-41 (Pennock); 1:39, 2:15, 2:35-37, 3:96 (Miller); 16:72-73 (Padian); 10:148 (Forrest)). However, we believe that arguments against evolution are not arguments for design. Expert testimony revealed that just because scientists cannot explain today how biological systems evolved does not mean that they cannot, and will not, be able to explain them tomorrow. (2:36-37 (Miller)). As Dr. Padian aptly noted, \"absence of evidence is not evidence of absence.\" (17:45 (Padian)). To that end, expert testimony from Drs. Miller and Padian provided multiple examples where Pandas asserted that no natural explanations exist, and in some cases that none could exist, and yet natural explanations have been identified in the intervening years. It also bears mentioning that as Dr. Miller stated, just because scientists cannot explain every evolutionary detail does not undermine its validity as a scientific theory as no theory in science is fully understood. (3:102 (Miller)).\n \n As referenced, the concept of irreducible complexity is ID's alleged scientific centerpiece. Irreducible complexity is a negative argument against evolution, not proof of design, a point conceded by defense expert Professor Minnich. (2:15 (Miller); 38:82 (Minnich) (irreducible complexity \"is not a test of\n intelligent design; it's a test of evolution\"). Irreducible complexity additionally fails to make a positive scientific case for ID, as will be elaborated upon below. \n \n We initially note that irreducible complexity as defined by Professor Behe in his book Darwin's Black Box and subsequently modified in his 2001 article entitled \"Reply to My Critics,\" appears as follows:\n \n By irreducibly complex I mean a single system which is composed of several well-matched, interacting parts that contribute to the basic function, wherein the removal of any one of the parts causes the system to effectively cease functioning. An irreducibly complex system cannot be produced directly by slight, successive modifications of a precursor system, because any precursor to an irreducibly complex system that is missing a part is by definition nonfunctional . . . Since natural selection can only choose systems that are already working, then if a biological system cannot be produced gradually it would have to arise as an integrated unit, in one fell swoop, for natural selection to have anything to act on.\n \n P-647 at 39; P-718 at 694. Professor Behe admitted in \"Reply to My Critics\" that there was a defect in his view of irreducible complexity because, while it purports to be a challenge to natural selection, it does not actually address \"the task facing natural selection.\" (P-718 at 695). Professor Behe specifically explained that \"[t]he current definition puts the focus on removing a part from an already functioning system,\" but \"[t]he difficult task facing Darwinian evolution, however, would not be to remove parts from sophisticated pre-existing systems; it would be to bring together components to make a new system in the first place.\" Id. In that article, Professor Behe wrote that he hoped to \"repair this defect in future work;\" however, he has failed to do so even four years after elucidating his defect. Id.; 22:61-65 (Behe).\n \n In addition to Professor Behe's admitted failure to properly address the very phenomenon that irreducible complexity purports to place at issue, natural selection, Drs. Miller and Padian testified that Professor Behe's concept of irreducible complexity depends on ignoring ways in which evolution is known to occur. Although Professor Behe is adamant in his definition of irreducible complexity when he says a precursor \"missing a part is by definition nonfunctional,\" what he obviously means is that it will not function in the same way the system functions when all the parts are present. For example in the case of the bacterial flagellum, removal of a part may prevent it from acting as a rotary motor. However, Professor Behe excludes, by definition, the possibility that a precursor to the bacterial flagellum functioned not as a rotary motor, but in some other way, for example as a secretory system. (19:88-95 (Behe)).\n \n As expert testimony revealed, the qualification on what is meant by \"irreducible complexity\" renders it meaningless as a criticism of evolution. (3:40 (Miller)). In fact, the theory of evolution proffers exaptation as a well-recognized, well-documented explanation for how systems with multiple parts could have evolved through natural means. Exaptation means that some precursor of the subject system had a different, selectable function before experiencing the change or addition that resulted in the subject system with its present function (16:146-48 (Padian)). For instance, Dr. Padian identified the evolution of the mammalian middle ear bones from what had been jawbones as an example of this process. (17:6-17 (Padian)). By defining irreducible complexity in the way that he has, Professor Behe attempts to exclude the phenomenon of exaptation by definitional fiat, ignoring as he does so abundant evidence which refutes his argument.\n \n Notably, the NAS has rejected Professor Behe's claim for irreducible complexity by using the following cogent reasoning:\n \n [S]tructures and processes that are claimed to be 'irreducibly' complex typically are not on closer inspection. For example, it is incorrect to assume that a complex structure or biochemical process can function only if all its components are present and functioning as we see them today. Complex biochemical systems can be built up from simpler systems through natural selection. Thus, the 'history' of a protein can be traced through simpler organisms . . . The evolution of complex molecular systems can occur in several ways. Natural selection can bring together parts of a system for one function at one time and then, at a later time, recombine those parts with other systems of components to produce a system that has a different function. Genes can be duplicated, altered, and then amplified through natural selection. The complex biochemical cascade resulting in blood clotting has been explained in this fashion. \n \n P-192 at 22.\n \n As irreducible complexity is only a negative argument against evolution, it is refutable and accordingly testable, unlike ID, by showing that there are intermediate structures with selectable functions that could have evolved into the allegedly irreducibly complex systems. (2:15-16 (Miller)). Importantly, however, the fact that the negative argument of irreducible complexity is testable does not make testable the argument for ID. (2:15 (Miller); 5:39 (Pennock)). Professor Behe has applied the concept of irreducible complexity to only a few select systems: (1) the bacterial flagellum; (2) the blood-clotting cascade; and (3) the immune system. Contrary to Professor Behe's assertions with respect to these few biochemical systems among the myriad existing in nature, however, Dr. Miller presented evidence, based upon peer-reviewed studies, that they are not in fact irreducibly complex.\n \n First, with regard to the bacterial flagellum, Dr. Miller pointed to peer reviewed studies that identified a possible precursor to the bacterial flagellum, a subsystem that was fully functional, namely the Type-III Secretory System. (2:8- 20 (Miller); P-854.23-854.32). Moreover, defense expert Professor Minnich admited that there is serious scientific research on the question of whether the bacterial flagellum evolved into the Type-III Secretary System, the Type-III Secretory System into the bacterial flagellum, or whether they both evolved from a common ancestor. (38:12-16 (Minnich)). None of this research or thinking involves ID. (38:12-16 (Minnich)). In fact, Professor Minnich testified about his research as follows: \"we're looking at the function of these systems and how they could have been derived one from the other. And it's a legitimate scientific inquiry.\" (38:16 (Minnich)).\n \n Second, with regard to the blood-clotting cascade, Dr. Miller demonstrated that the alleged irreducible complexity of the blood-clotting cascade has been disproven by peer-reviewed studies dating back to 1969, which show that dolphins' and whales' blood clots despite missing a part of the cascade, a study that was confirmed by molecular testing in 1998. (1:122-29 (Miller); P-854.17-854.22). Additionally and more recently, scientists published studies showing that in puffer fish, blood clots despite the cascade missing not only one, but three parts. (1:128-29 (Miller)). Accordingly, scientists in peer-reviewed publications have refuted Professor Behe's predication about the alleged irreducible complexity of the blood-clotting cascade. Moreover, cross-examination revealed that Professor Behe's redefinition of the blood-clotting system was likely designed to avoid peerreviewed scientific evidence that falsifies his argument, as it was not a scientifically warranted redefinition. (20:26-28, 22:112-25 (Behe)). \n \n The immune system is the third system to which Professor Behe has applied the definition of irreducible complexity. Although in Darwin's Black Box, Professor Behe wrote that not only were there no natural explanations for the immune system at the time, but that natural explanations were impossible regarding its origin. (P-647 at 139; 2:26-27 (Miller)). However, Dr. Miller presented peer-reviewed studies refuting Professor Behe's claim that the immune system was irreducibly complex. Between 1996 and 2002, various studies confirmed each element of the evolutionary hypothesis explaining the origin of the immune system. (2:31 (Miller)). In fact, on cross-examination, Professor Behe was questioned concerning his 1996 claim that science would never find an evolutionary explanation for the immune system. He was presented with fiftyeight peer-reviewed publications, nine books, and several immunology textbook chapters about the evolution of the immune system; however, he simply insisted that this was still not sufficient evidence of evolution, and that it was not \"good enough.\" (23:19 (Behe)).\n \n We find that such evidence demonstrates that the ID argument is dependent upon setting a scientifically unreasonable burden of proof for the theory of evolution. As a further example, the test for ID proposed by both Professors Behe and Minnich is to grow the bacterial flagellum in the laboratory; however, no-one inside or outside of the IDM, including those who propose the test, has conducted it. (P-718; 18:125-27 (Behe); 22:102-06 (Behe)). Professor Behe conceded that the proposed test could not approximate real world conditions and even if it could, Professor Minnich admitted that it would merely be a test of evolution, not design. (22:107-10 (Behe); 2:15 (Miller); 38:82 (Minnich)).\n \n We therefore find that Professor Behe's claim for irreducible complexity has been refuted in peer-reviewed research papers and has been rejected by the scientific community at large. (17:45-46 (Padian); 3:99 (Miller)). Additionally, even if irreducible complexity had not been rejected, it still does not support ID as it is merely a test for evolution, not design. (2:15, 2:35-40 (Miller); 28:63-66 (Fuller)).\n \n We will now consider the purportedly \"positive argument\" for design encompassed in the phrase used numerous times by Professors Behe and Minnich throughout their expert testimony, which is the \"purposeful arrangement of parts.\" Professor Behe summarized the argument as follows: We infer design when we see parts that appear to be arranged for a purpose. The strength of the inference is quantitative; the more parts that are arranged, the more intricately they interact, the stronger is our confidence in design. The appearance of design in aspects of biology is overwhelming. Since nothing other than an intelligent cause has been demonstrated to be able to yield such a strong appearance of design, Darwinian claims notwithstanding, the conclusion that the design seen in life is real design is rationally justified. (18:90-91, 18:109-10 (Behe); 37:50 (Minnich)). As previously indicated, this argument is merely a restatement of the Reverend William Paley's argument applied at the cell level. Minnich, Behe, and Paley reach the same conclusion, that complex organisms must have been designed using the same reasoning, except that Professors Behe and Minnich refuse to identify the designer, whereas Paley inferred from the presence of design that it was God. (1:6-7 (Miller); 38:44, 57 (Minnich)). Expert testimony revealed that this inductive argument is not scientific and as admitted by Professor Behe, can never be ruled out. (2:40 (Miller); 22:101 (Behe); 3:99 (Miller)).\n \n Indeed, the assertion that design of biological systems can be inferred from the \"purposeful arrangement of parts\" is based upon an analogy to human design. Because we are able to recognize design of artifacts and objects, according to Professor Behe, that same reasoning can be employed to determine biological design. (18:116-17, 23:50 (Behe)). Professor Behe testified that the strength of the analogy depends upon the degree of similarity entailed in the two propositions; however, if this is the test, ID completely fails.\n \n Unlike biological systems, human artifacts do not live and reproduce over time. They are non-replicable, they do not undergo genetic recombination, and they are not driven by natural selection. (1:131-33 (Miller); 23:57-59 (Behe)). For human artifacts, we know the designer's identity, human, and the mechanism of design, as we have experience based upon empirical evidence that humans can make such things, as well as many other attributes including the designer's abilities, needs, and desires. (D-251 at 176; 1:131-33 (Miller); 23:63 (Behe); 5:55-58 (Pennock)). With ID, proponents assert that they refuse to propose hypotheses on the designer's identity, do not propose a mechanism, and the designer, he/she/it/they, has never been seen. In that vein, defense expert Professor Minnich agreed that in the case of human artifacts and objects, we know the identity and capacities of the human designer, but we do not know any of those attributes for the designer of biological life. (38:44-47 (Minnich)). In addition, Professor Behe agreed that for the design of human artifacts, we know the designer and its attributes and we have a baseline for human design that does not exist for design of biological systems. (23:61-73 (Behe)). Professor Behe's only response to these seemingly insurmountable points of disanalogy was that the inference still works in science fiction movies. (23:73 (Behe)).\n \n It is readily apparent to the Court that the only attribute of design that biological systems appear to share with human artifacts is their complex appearance, i.e. if it looks complex or designed, it must have been designed. (23:73 (Behe)). This inference to design based upon the appearance of a \"purposeful arrangement of parts\" is a completely subjective proposition, determined in the eye of each beholder and his/her viewpoint concerning the complexity of a system. Although both Professors Behe and Minnich assert that there is a quantitative aspect to the inference, on cross-examination they admitted that there is no quantitative criteria for determining the degree of complexity or number of parts that bespeak design, rather than a natural process. (23:50 (Behe); 38:59 (Minnich)). As Plaintiffs aptly submit to the Court, throughout the entire trial only one piece of evidence generated by Defendants addressed the strength of the ID inference: the argument is less plausible to those for whom God's existence is in question, and is much less plausible for those who deny God's existence. (P-718 at 705).\n \n Accordingly, the purported positive argument for ID does not satisfy the ground rules of science which require testable hypotheses based upon natural explanations. (3:101-03 (Miller)). ID is reliant upon forces acting outside of the natural world, forces that we cannot see, replicate, control or test, which have produced changes in this world. While we take no position on whether such forces exist, they are simply not testable by scientific means and therefore cannot qualify as part of the scientific process or as a scientific theory. (3:101-02 (Miller)).\n \n It is appropriate at this juncture to address ID's claims against evolution. ID proponents support their assertion that evolutionary theory cannot account for life's complexity by pointing to real gaps in scientific knowledge, which indisputably exist in all scientific theories, but also by misrepresenting wellestablished scientific propositions. (1:112, 1:122, 1:136-37 (Miller); 16:74-79, 17:45-46 (Padian)).\n \n Before discussing Defendants' claims about evolution, we initially note that an overwhelming number of scientists, as reflected by every scientific association that has spoken on the matter, have rejected the ID proponents' challenge to evolution. Moreover, Plaintiffs' expert in biology, Dr. Miller, a widely-recognized biology professor at Brown University who has written university-level and high school biology textbooks used prominently throughout the nation, provided unrebutted testimony that evolution, including common descent and natural selection, is \"overwhelmingly accepted\" by the scientific community and that every major scientific association agrees. (1:94-100 (Miller)). As the court in Selman explained, \"evolution is more than a theory of origin in the context of science. To the contrary, evolution is the dominant scientific theory of origin accepted by the majority of scientists.\" Selman, 390 F. Supp. 2d at 1309 (emphasis in original). Despite the scientific community's overwhelming support for evolution, Defendants and ID proponents insist that evolution is unsupported by empirical evidence. Plaintiffs' science experts, Drs. Miller and Padian, clearly explained how ID proponents generally and Pandas specifically, distort and misrepresent scientific knowledge in making their anti-evolution argument. \n \n In analyzing such distortion, we turn again to Pandas, the book to which students are expressly referred in the disclaimer. Defendants hold out Pandas as representative of ID and Plaintiffs' experts agree in that regard. (16:83 (Padian); 1:107-08 (Miller)). A series of arguments against evolutionary theory found in Pandas involve paleontology, which studies the life of the past and the fossil record. Plaintiffs' expert Professor Padian was the only testifying expert witness with any expertise in paleontology. His testimony therefore remains unrebutted. Dr. Padian's demonstrative slides, prepared on the basis of peer-reviewing scientific literature, illustrate how Pandas systematically distorts and misrepresents established, important evolutionary principles.\n \n We will provide several representative examples of this distortion. First, Pandas misrepresents the \"dominant form of understanding relationships\" between organisms, namely, the tree of life, represented by classification determined via the method of cladistics. (16:87-97 (Padian); P-855.6-855.19). Second, Pandas misrepresents \"homology,\" the \"central concept of comparative biology,\" that allowed scientists to evaluate comparable parts among organisms for classification purposes for hundreds of years. (17:27-40 (Padian); P-855.83-855.102). Third, Pandas fails to address the well-established biological concept of exaptation, which involves a structure changing function, such as fish fins evolving fingers and bones\n to become legs for weight-bearing land animals. (16:146-48 (Padian)). Dr. Padian testified that ID proponents fail to address exaptation because they deny that organisms change function, which is a view necessary to support abruptappearance. Id. Finally, Dr. Padian's unrebutted testimony demonstrates that Pandas distorts and misrepresents evidence in the fossil record about pre-Cambrian-era fossils, the evolution of fish to amphibians, the evolution of small carnivorous dinosaurs into birds, the evolution of the mammalian middle ear, and the evolution of whales from land animals. (16:107-17, 16:117-31, 16:131-45, 17:6-9, 17:17-27 (Padian); P-855.25-855.33, P-855.34-855.45, P-855.46-855.55, P-855.56-866.63, P-855.64-855.82).\n \n In addition to Dr. Padian, Dr. Miller also testified that Pandas presents discredited science. Dr. Miller testified that Pandas' treatment of biochemical Additionally, testimony provided by Professor Behe revealed an increasing gap between his portrayal of ID theory and how it is presented in Pandas. Although he is a \"critical reviewer\" of the work, he disagrees with language provided in the text, including but not limited to the text's very definition of ID. (P-11 at 99-100). similarities between organisms is \"inaccurate and downright false\" and explained how Pandas misrepresents basic molecular biology concepts to advance design theory through a series of demonstrative slides. (1:112 (Miller)). Consider, for example, that he testified as to how Pandas misinforms readers on the standard evolutionary relationships between different types of animals, a distortion which Professor Behe, a \"critical reviewer\" of Pandas who wrote a section within the book, affirmed. (1:113-17 (Miller); P-854.9-854.16; 23:35-36 (Behe)). In addition, Dr. Miller refuted Pandas' claim that evolution cannot account for new genetic information and pointed to more than three dozen peer-reviewed scientific publications showing the origin of new genetic information by evolutionary processes. (1:133-36 (Miller); P-245). In summary, Dr. Miller testified that Pandas misrepresents molecular biology and genetic principles, as well as the current state of scientific knowledge in those areas in order to teach readers that common descent and natural selection are not scientifically sound. (1:139-42 (Miller)).\n \n Accordingly, the one textbook to which the Dover ID Policy directs students contains outdated concepts and badly flawed science, as recognized by even the defense experts in this case. \n \n A final indicator of how ID has failed to demonstrate scientific warrant is the complete absence of peer-reviewed publications supporting the theory. Expert testimony revealed that the peer review process is \"exquisitely important\" in the scientific process. It is a way for scientists to write up their empirical research and to share the work with fellow experts in the field, opening up the hypotheses to study, testing, and criticism. (1:66-69 (Miller)). In fact, defense expert Professor Behe recognizes the importance of the peer review process and has written that science must \"publish or perish.\" (22:19-25 (Behe)). Peer review helps to ensure that research papers are scientifically accurately, meet the standards of the scientific method, and are relevant to other scientists in the field. (1:39-40 (Miller)). Moreover, peer review involves scientists submitting a manuscript to a scientific journal in the field, journal editors soliciting critical reviews from other experts in the field and deciding whether the scientist has followed proper research\n procedures, employed up-to-date methods, considered and cited relevant literature and generally, whether the researcher has employed sound science.\n \n The evidence presented in this case demonstrates that ID is not supported by any peer-reviewed research, data or publications. Both Drs. Padian and Forrest testified that recent literature reviews of scientific and medical-electronic databases disclosed no studies supporting a biological concept of ID. (17:42-43 (Padian);11:32-33 (Forrest)). On cross-examination, Professor Behe admitted that: \"There are no peer reviewed articles by anyone advocating for intelligent design supported by pertinent experiments or calculations which provide detailed rigorous accounts of how intelligent design of any biological system occurred.\" (22:22-23 (Behe)). Additionally, Professor Behe conceded that there are no peer-reviewed papers supporting his claims that complex molecular systems, like the bacterial flagellum, the blood-clotting cascade, and the immune system, were intelligently designed. (21:61-62 (complex molecular systems), 23:4-5 (immune system), and 22:124-25 (blood-clotting cascade) (Behe)). In that regard, there are no peer-reviewed articles supporting Professor Behe's argument that certain complex molecular structures are \"irreducibly complex.\"17 (21:62, 22:124-25 (Behe)). In addition to failing to produce papers in peer-reviewed journals, ID also features no scientific research or testing. (28:114-15 (Fuller); 18:22-23, 105-06 (Behe)).\n \n After this searching and careful review of ID as espoused by its proponents, as elaborated upon in submissions to the Court, and as scrutinized over a six week trial, we find that ID is not science and cannot be adjudged a valid, accepted scientific theory as it has failed to publish in peer-reviewed journals, engage in research and testing, and gain acceptance in the scientific community. ID, as noted, is grounded in theology, not science. Accepting for the sake of argument its proponents', as well as Defendants' argument that to introduce ID to students will encourage critical thinking, it still has utterly no place in a science curriculum. Moreover, ID's backers have sought to avoid the scientific scrutiny which we have now determined that it cannot withstand by advocating that the controversy, but not ID itself, should be taught in science class. This tactic is at best disingenuous, and at worst a canard. The goal of the IDM is not to encourage critical thought, but to foment a revolution which would supplant evolutionary theory with ID.\n \n To conclude and reiterate, we express no opinion on the ultimate veracity of ID as a supernatural explanation. However, we commend to the attention of those who are inclined to superficially consider ID to be a true \"scientific\" alternative to evolution without a true understanding of the concept the foregoing detailed analysis. It is our view that a reasonable, objective observer would, after reviewing both the voluminous record in this case, and our narrative, reach the inescapable conclusion that ID is an interesting theological argument, but that it is not science.\n \n\n \n So is your question answered now?", 
   {
    "unicode_changes_made": true
   }, 
   206048, 
   null, 
   1144539540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A fix to the Evolution Problem", 
  "url": "http://www.4forums.com/political/education-debates/7832-fix-evolution-problem.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 7832, 
  "discussion_files": [
   [
    "29247.html", 
    "http://www.4forums.com/political/education-debates/7832-fix-evolution-problem-print.html"
   ], 
   [
    "29248.html", 
    "http://www.4forums.com/political/education-debates/7832-fix-evolution-problem-2-print.html"
   ]
  ], 
  "identifier": 7832
 }
]