[
 [
  [
   204631, 
   null, 
   "Inyx", 
   "Why is the speed of light the highest speed possible?", 
   {
    "post_info": {
     "post_title": "Speed of light"
    }
   }, 
   null, 
   null, 
   1143718920.0
  ], 
  [
   204636, 
   null, 
   "Liminus", 
   "We don't really know why, that's like asking why does gravity exist, or why does time only go forward?\n \n But there are two things we know about that limit us to the speed of light:\n \n 1) Time slows down the faster you travel, and if it were possible to reach the speed of light you wouldn't experience any time at all, and you can't experience negative time, so you can't go any faster.\n \n 2) As you approach the speed of light, the amount of energy required to accelerate mass becomes exponentially larger, and to actually hit lightspeed would require infinite energy, so it can't be done. Photons can travel at lightspeed because they have no mass.", 
   {}, 
   204631, 
   null, 
   1143728460.0
  ], 
  [
   204643, 
   null, 
   "Alan Ryan", 
   "\n As you approach the speed of light, the amount of energy required to accelerate mass becomes exponentially larger, and to actually hit lightspeed would require infinite energy, so it can't be done. Photons can travel at lightspeed because they have no mass.\n\n \n I said as much (in another thread) but was contradicted on the grounds that as photons have energy, they will have a mass equivalent. Isn't this apparent from the photo-electric effect?\n \n What is the consensus about this among the theoretical physicists?", 
   {}, 
   204636, 
   null, 
   1143736500.0
  ], 
  [
   204663, 
   null, 
   "Liminus", 
   "OK, yes mass is equivalent to energy and vice versa, but this does not mean that mass is energy in a literal, physical sense. Mathematically they are the same thing and physical equations make no distinction between them, but in the real world there is a difference.\n \n Current physical theory explains the phenomena of mass and inertia by attributing them to something called the Higgs field. \n \n All particles can be thought of as also existing as waves or fields according to quantum mechanics; the particle constituents of gravity, electromagnetism, strong and weak nuclear forces - gravitons (unproven), photons, gluons, W & Z particles - make up 'force fields', and physics has no problem thinking of the particle constituents of matter - quarks and electrons - making a 'matter field'.\n \n The Higgs field - named after the Scottish physicist Peter Higgs is believed by many physicists to be a third kind of field that permeates the entire universe. The way in which different particles interact with the Higgs field gives them their various properties, and the Higgs field resists their acceleration through space to greater or lesser degrees. A photon encounters no resistance from the Higgs field and so travels as fast as it can.\n \n There is no current theoretical framework for why the different particles are resisted more or less strongly by the Higgs field, but physicists believe that if there were no Higgs field all particles would behave like photons and have no mass whatsoever. \n \n This is what physicists believe the universe was like prior to 10^-11 seconds after the Big Bang when the universe's temperature dropped to a million billion degrees Kelvin, the temperature at which the Higgs field stopps oscillating wildly and 'condenses' to a stable value. (While it was oscillating it would have had an average value of zero hence having no effect on particles).\n \n The theory has yet to be tested because of the enormously energetic conditions under which it is believed Higgs particles can be 'knocked' out of the Higgs field, but the Large Hadron Collider in Switzerland which is set to begin operating in 2007 should be able to create the conditions which will provide experimental data.", 
   {}, 
   204643, 
   null, 
   1143743040.0
  ], 
  [
   204682, 
   null, 
   "Jo Bennett", 
   "photons are most certainly massless, mass energy equivalence refers to the ability of one to change into the other, the two together are converged. When something has mass, however, it has ceased to be a photon and is matter instead.", 
   {}, 
   204663, 
   null, 
   1143751320.0
  ], 
  [
   204689, 
   null, 
   "Another opinion", 
   "Do any of you know why the path of photons can be distorted by the large graviational fields of large stars despite the zero mass of those photons? My guess would be that this is because of the relativistic distortion of space-time around large gravitational objects, but I have never explored the details.", 
   {}, 
   204682, 
   null, 
   1143752700.0
  ], 
  [
   204691, 
   null, 
   "Master_Shake", 
   "We don't really know why, that's like asking why does gravity exist, or why does time only go forward?\n\n We don't know it's the fastest thing in the universe, but it is the fastest known thing in the universe. There is a difference\n \nBut there are two things we know about that limit us to the speed of light:\n \n 1) Time slows down the faster you travel, and if it were possible to reach the speed of light you wouldn't experience any time at all, and you can't experience negative time, so you can't go any faster.\n\n This is circular. The statement that you wouldn't experience time at all if you could reach the speed of light is based on the assumption that light is the fastest thing in the universe which you then use to prove that light is the fastest thing in the universe.", 
   {}, 
   204636, 
   null, 
   1143753180.0
  ], 
  [
   204701, 
   null, 
   "Kronus", 
   "We don't know it's the fastest thing in the universe, but it is the fastest known thing in the universe. There is a difference\n\n A huge body of experimental evidence backs up the idea that nothing goes faster than light. And that's not saying that we haven't found anything that goes faster, it's saying that experiments based on that assumption have the results one would expect if it were true. We know that nothing can go faster than light in much the same way that we know that two masses exert an attractive force on each other. If it isn't so, than something very fundamental is wrong in our understanding of the universe. Possible, but really unlikely.\n \n \n\n This is circular. The statement that you wouldn't experience time at all if you could reach the speed of light is based on the assumption that light is the fastest thing in the universe which you then use to prove that light is the fastest thing in the universe.\n\n No. Time dilation at light speeds is a consequence of light being the fastest thing, but was not used to prove that light is the fastest thing. There was no circular reasoning involved.", 
   {}, 
   204691, 
   null, 
   1143754620.0
  ], 
  [
   204707, 
   null, 
   "Master_Shake", 
   "No. Time dilation at light speeds is a consequence of light being the fastest thing, but was not used to prove that light is the fastest thing. There was no circular reasoning involved.\n\n I wasn't saying that scientists reasoning of this was circular, only Liminus' in that particular instance.", 
   {}, 
   204701, 
   null, 
   1143755460.0
  ], 
  [
   204714, 
   null, 
   "Kronus", 
   "I wasn't saying that scientists reasoning of this was circular, only Liminus' in that particular instance.\n\n \n Ah, gotcha.", 
   {}, 
   204707, 
   null, 
   1143758820.0
  ], 
  [
   204750, 
   null, 
   "Liminus", 
   "Time slows down the faster you travel, and if it were possible to reach the speed of light you wouldn't experience any time at all, and you can't experience negative time, so you can't go any faster.\n\n \n \nThis is circular. The statement that you wouldn't experience time at all if you could reach the speed of light is based on the assumption that light is the fastest thing in the universe which you then use to prove that light is the fastest thing in the universe.\n\n \n Yeah sorry I didn't explain it very well; basically special relativity says:\n \"the combined speed of any object's motion through space and its motion through time is always precisely equal to the speed of light.\" - the central concept underlying the notion of spacetime as opposed to space and time.\n \n When you accelerate you change some of your movement through time into movement through space. When you reach the speed of light you have changed all available motion through time into motion through space; you can't go any faster.", 
   {}, 
   204691, 
   null, 
   1143774000.0
  ], 
  [
   204753, 
   null, 
   "Liminus", 
   "We don't know it's the fastest thing in the universe, but it is the fastest known thing in the universe. There is a difference\n\n \n For the reasons above, special relativity says that it is the fastest thing possible. Of course, there might be a whole other world of faster-than-light weirdness, but it would be a whole new branch of physics if we knew anything even theoretical about it. \n Quantum 'tunneling' might seem like faster-than-light travel as might entanglement, as a superluminal 'information exchange', but neither of these constitutes motion through space; they are very different phenomena.\n \n ON EDIT: By the way while I didn't just cut n paste it, all this is from Brian Greene's The Fabric of the Cosmos it will answer pretty much any question you have and is very readable even for a layman's physics book.\n \n PS I'm not getting paid to say this.", 
   {}, 
   204691, 
   null, 
   1143774300.0
  ], 
  [
   204849, 
   null, 
   "Alan Ryan", 
   "Once I get involved in a thread like this, I realise my ambition to be well informed about 'everything' should have been abandoned years ago.", 
   {}, 
   204753, 
   null, 
   1143835920.0
  ], 
  [
   204907, 
   null, 
   "supergrunt", 
   "Light is the fastest thing in the universe because that is how we have decided to conceptualize our world. In very real terms everything in the universe is travelling at the speed of light, most things have split this motion between time and space.\n \n Light is an extreme... it has all of it's motion in space... therefore it travels through space as fast as it is possible to travel.\n \n We on the other had have almost all of our motion in time. Very little in space. We are still traveling at the speed of light, it is just that our motion is almost entirely through time. There are few things in the universe that get \"older\" faster than us.\n \n Likewise, there is nothing in the universe that can cover space faster than a light beam. \n \n The reason light is affected by gravity is not because it has mass... but because things with mass warp the space around them, and light beams follow the curves and contours of this warped space.\n \n The whole mass - gravity thing is an approximation we call \"Newtonian Mechanics\" A very powerful concept for describing gravity on everyday terms, but not very exact when describing objects that travel at extremes. You would use General Relativity in the latter case.\n \n When you look at a light beam and marvel at the space it seems to quickly move through, think about that light beam and how it marvels at how fast we travel through time.... we are an impossible fleeting streak to them, blasting through time almost as fast as the universe will allow.", 
   {}, 
   204849, 
   null, 
   1143850800.0
  ], 
  [
   204935, 
   null, 
   "zachvac", 
   "Light is the fastest thing in the universe because that is how we have decided to conceptualize our world. In very real terms everything in the universe is travelling at the speed of light, most things have split this motion between time and space.\n \n Light is an extreme... it has all of it's motion in space... therefore it travels through space as fast as it is possible to travel.\n \n We on the other had have almost all of our motion in time. Very little in space. We are still traveling at the speed of light, it is just that our motion is almost entirely through time. There are few things in the universe that get \"older\" faster than us.\n \n Likewise, there is nothing in the universe that can cover space faster than a light beam. \n \n The reason light is affected by gravity is not because it has mass... but because things with mass warp the space around them, and light beams follow the curves and contours of this warped space.\n \n The whole mass - gravity thing is an approximation we call \"Newtonian Mechanics\" A very powerful concept for describing gravity on everyday terms, but not very exact when describing objects that travel at extremes. You would use General Relativity in the latter case.\n \n When you look at a light beam and marvel at the space it seems to quickly move through, think about that light beam and how it marvels at how fast we travel through time.... we are an impossible fleeting streak to them, blasting through time almost as fast as the universe will allow.\n\n \n This is an interesting perspective, I've never thought about it like that before. This also makes more sense as to why people think of time as the 4th dimension. But is it really true that if you could possibly travel close to the speed of light your entire life you would live almost an infinite amount of time? I've heard of time slowing down (which is hard to imagine, since slowing down involves time, so we're equating time with respect to itself), but can people really live for hundreds of years at near light speed? It happens in science fiction, but can it really happen in real life?", 
   {}, 
   204907, 
   null, 
   1143868140.0
  ], 
  [
   204956, 
   null, 
   "Alan Ryan", 
   "Physicists now say that neutrinos have mass. Formerly thought to be 'ghostly particles' with no mass, neutrinos can travel, apparently, right through the Earth without interacting with any matter. \n \n A BBC report describes how to examine their properties, scientists created muon neutrinos in a particle accelerator at the Fermi National Accelerator Laboratory (Fermilab) in Illinois, US.\n \n A high intensity beam of these particles was fired through a particle detector at Fermilab, and then to another particle detector 450 miles away in a disused mine in Soudan, US. \n \n A number of neutrinos \"disappeared\" en route - converting, it is thought, into another type of neutrino. Physicists call the process of transforming from one type of neutrino into another flavour oscillation. And to be able to perform this transformation, particle physics theory states that the particles need mass.\n \n I mention all this in the context of photon mass and the speed of light. Don't neutrinos also travel at the speed of light?", 
   {
    "post_info": {
     "post_title": "Neutrinos"
    }
   }, 
   204935, 
   null, 
   1143885900.0
  ], 
  [
   204973, 
   null, 
   "Jo Bennett", 
   "not quite, just very close to it. Neutrinos have very small mass, and hence very high speed.\n \n The time slowing down thing is relative. if you travel close to the speed of light, you will experience time exactly the same, a \"sationary\" observer will experience much more time than you do, however. In that sense travelling close to the speed of light allows you to travel forward in time, not allow you to live longer.", 
   {}, 
   204956, 
   null, 
   1143899580.0
  ], 
  [
   204982, 
   null, 
   "Kronus", 
   "This is an interesting perspective, I've never thought about it like that before. This also makes more sense as to why people think of time as the 4th dimension. But is it really true that if you could possibly travel close to the speed of light your entire life you would live almost an infinite amount of time? I've heard of time slowing down (which is hard to imagine, since slowing down involves time, so we're equating time with respect to itself), but can people really live for hundreds of years at near light speed? It happens in science fiction, but can it really happen in real life?\n\n \n The thing to remember is that for the person inside the spaceship time seems to be moving normally. He looks at us outside the ship and thinks that time is move quickly for us. Also, looking ahead of his ship he sees that space has contracted. Let's put some numbers on this. Let's say he want's to go 100 light years, at really really close to the speed of light. From out point of view, stationary, he travels 100 light years and takes just over 100 years to do it. From his point of view, once he gets up to speed, the distance he needs to travel might only be 1 million miles, if he's really close to the speed of light. And of course he goes that 1 million miles in a few seconds, from his perspective. But looking out the window, he'd see us aging at an incredible rate. So the person in the ship doesn't live for 100's of years from their point of view, they live a normal life span. But from our point of view, they've barely aged when we're all 100 years older.", 
   {}, 
   204935, 
   null, 
   1143906300.0
  ], 
  [
   205096, 
   null, 
   "zachvac", 
   "The thing to remember is that for the person inside the spaceship time seems to be moving normally. He looks at us outside the ship and thinks that time is move quickly for us. Also, looking ahead of his ship he sees that space has contracted. Let's put some numbers on this. Let's say he want's to go 100 light years, at really really close to the speed of light. From out point of view, stationary, he travels 100 light years and takes just over 100 years to do it. From his point of view, once he gets up to speed, the distance he needs to travel might only be 1 million miles, if he's really close to the speed of light. And of course he goes that 1 million miles in a few seconds, from his perspective. But looking out the window, he'd see us aging at an incredible rate. So the person in the ship doesn't live for 100's of years from their point of view, they live a normal life span. But from our point of view, they've barely aged when we're all 100 years older.\n\n \n I realized that would be the case, but I didn't realize it was actually plausible in real life. Figured it was just science fiction. The question is what frame of reference do we use for speed? Speed is distance over time, so if the \"faster\" you go, time \"slows\" down, that means you are going even faster, which would mean time slows down more, which means you're going faster, etc. Can you see what I'm saying? If I'm going 10 lightyears per 20 years (half the speed of light) time probably slows down quite a bit. Let's say it really is like the scenario and the speed is equal through the time dimension and the space dimension. The problem is we would need a 5th dimension now for an objective time to keep track of speed. If time is just another dimension, we have no way to measure the rate at which we are going through that dimension, unless we relate it to the distance travelled in the other 3.", 
   {}, 
   204982, 
   null, 
   1143953940.0
  ], 
  [
   205097, 
   null, 
   "zachvac", 
   "Also, how do we measure time in near light speeds? Watches or clocks wouldn't work because they are based on the speed of an object (like a pendulum in old clocks). Basically we call the ammount of time that passes as the pendulum makes one swing a certain unit of time (I think that's a second, but don't hold me to it). When we go up to close to light speeds, how do we know that whatever is keeping time isn't affected by the speed? What if it takes more time to happen when it gets really fast just because of the pressure or something? I guess a major thing we could test it on is humans, because we could time outside the ship and see how the person doesn't age as much in several decades. But how do we truly measure time on something going near light speed?", 
   {}, 
   205096, 
   null, 
   1143954120.0
  ], 
  [
   205098, 
   null, 
   "zachvac", 
   "argh, well now my whole brain is turning in circles, I start a little confused and end up more confused. Oh well, I'm going to sleep anyway now, I'll probably have really strange dreams. Thanks a lot :)", 
   {}, 
   205097, 
   null, 
   1143954180.0
  ], 
  [
   205144, 
   null, 
   "Kronus", 
   "I realized that would be the case, but I didn't realize it was actually plausible in real life. Figured it was just science fiction. The question is what frame of reference do we use for speed? Speed is distance over time, so if the \"faster\" you go, time \"slows\" down, that means you are going even faster, which would mean time slows down more, which means you're going faster, etc. Can you see what I'm saying? If I'm going 10 lightyears per 20 years (half the speed of light) time probably slows down quite a bit. Let's say it really is like the scenario and the speed is equal through the time dimension and the space dimension. The problem is we would need a 5th dimension now for an objective time to keep track of speed. If time is just another dimension, we have no way to measure the rate at which we are going through that dimension, unless we relate it to the distance travelled in the other 3.\n\n \n I see your problem. There is no \"objective\" time. The major breakthrough that Einstien made was to realize that time is relative. The rate at which time moves depends on the motion of the observer relative to that which is being observed. Using your example, from the point of view of someone outside the ship, the trip took 20 years, the distance was 10 light years, so the speed was half the speed of light. From the point of view of the guy in the ship, the trip will take 17.3 years, and the distance would be 8.66 light years, so his speed is still half the speed of light, from his point of view. Both time and space are relative, and they change in the same ratio.\n \n You also asked about how to measure time when traveling near the speed of light. You would do it in the regular way, your watch would work just fine. After all, you're traveling at almost the speed of light right now, relative to something in the universe. As long as your watch isn't moving relative to you, it will always operate as you would expect, no matter how fast you're moving relative to something else. Time always seems to more normally for you; it's other people that will seem to be moving too fast or too slow.", 
   {}, 
   205096, 
   null, 
   1143993600.0
  ], 
  [
   205145, 
   null, 
   "zachvac", 
   "I see your problem. There is no \"objective\" time. The major breakthrough that Einstien made was to realize that time is relative. The rate at which time moves depends on the motion of the observer relative to that which is being observed. Using your example, from the point of view of someone outside the ship, the trip took 20 years, the distance was 10 light years, so the speed was half the speed of light. From the point of view of the guy in the ship, the trip will take 17.3 years, and the distance would be 8.66 light years, so his speed is still half the speed of light, from his point of view. Both time and space are relative, and they change in the same ratio.\n \n You also asked about how to measure time when traveling near the speed of light. You would do it in the regular way, your watch would work just fine. After all, you're traveling at almost the speed of light right now, relative to something in the universe. As long as your watch isn't moving relative to you, it will always operate as you would expect, no matter how fast you're moving relative to something else. Time always seems to more normally for you; it's other people that will seem to be moving too fast or too slow.\n\n \n ok that kind of makes sense. But I didn't realize that space is also relative. You're telling me that the closer you are to light speed the closer an object seems to the ship? So as you approach infinity, the universe seems to get infinitely small, so if it was really possible to go fast enough, and you went towards the sun and turned around going really close to the speed of light, it would seem like you could almost touch Pluto out the window even though you're between the sun and the Earth? This applies for objects further away? I'd never even heard of that. I just assumed it would seem to a person in the ship that they were going faster than they really were, since time seems to be going slow. I didn't realize that the perception of distance would also change.", 
   {}, 
   205144, 
   null, 
   1143995940.0
  ], 
  [
   205156, 
   null, 
   "Kronus", 
   "ok that kind of makes sense. But I didn't realize that space is also relative. You're telling me that the closer you are to light speed the closer an object seems to the ship? So as you approach infinity, the universe seems to get infinitely small, so if it was really possible to go fast enough, and you went towards the sun and turned around going really close to the speed of light, it would seem like you could almost touch Pluto out the window even though you're between the sun and the Earth? This applies for objects further away? I'd never even heard of that. I just assumed it would seem to a person in the ship that they were going faster than they really were, since time seems to be going slow. I didn't realize that the perception of distance would also change.\n\n \n Yup, both time and space are relative. But it's not the perception of distance that changes, it's actual distanace. You keep saying \"seems closer\" or \"perception of distance\". It's not that space looks different, it is different. If you head towards something at close to the speed of light it is actually a shorter distance to get there. Also, it's only in the line of travel that this happens. Things in front of you are closer/shorter. Things to the side are the same size they were when you were holding still.", 
   {}, 
   205145, 
   null, 
   1144000860.0
  ], 
  [
   205265, 
   null, 
   "zachvac", 
   "Yup, both time and space are relative. But it's not the perception of distance that changes, it's actual distanace. You keep saying \"seems closer\" or \"perception of distance\". It's not that space looks different, it is different. If you head towards something at close to the speed of light it is actually a shorter distance to get there. Also, it's only in the line of travel that this happens. Things in front of you are closer/shorter. Things to the side are the same size they were when you were holding still.\n\n \n How is that possible? Space is condensed? Things that used to be further away are closer only to that one person going near light speed? This is getting more confusing by the second. Distance is distance right? Why don't we give distances in a unit including speed since technically if you are going faster you don't have as far to go? :)\n \n Next time I lose a race I'll argue that they had less distance to go, since they were going faster, right? Not enough to make a difference, but a tiny difference.", 
   {}, 
   205156, 
   null, 
   1144041780.0
  ], 
  [
   205275, 
   null, 
   "Jo Bennett", 
   "we don't bother with space or time dilation normally because the effects are usually far smaller than the margin of error in our measurements. Basically you'd cause yourself a whole pile of mathematical pain for no purpose. Yes, physicists are lazy b@stards if they can get away with it.", 
   {}, 
   205265, 
   null, 
   1144059900.0
  ], 
  [
   205278, 
   null, 
   "Kronus", 
   "How is that possible? \n\n Don't blame me! I didn't set it up that way. :) \n \n \n \n\n Space is condensed? Things that used to be further away are closer only to that one person going near light speed? This is getting more confusing by the second.\n\n Actually, it sounds like you're understanding it better now. Relativity is wierd, and it does violate commone sense. It has also been proven to be correct with a host of experimental data. I'd suggest that you become more comfortable with what relativity says before you worry too much about the whys and hows. It's the only way to learn this stuff and stay sane.", 
   {}, 
   205265, 
   null, 
   1144077300.0
  ], 
  [
   205280, 
   null, 
   "pandion", 
   "An amusing, though probably apocryphal,...story concerns a question put to [Arthur] Eddington, that he was one of only three people who understood relativity. Eddington is alleged to have paused for some time and when his questioner put the question again, replied \"I am trying to think who the third might be\".\nAnd then, of course, the situation doesn't get better with quantum mechanics. Niels Bohr said \"Anyone who is not shocked by quantum theory has not understood it.\"", 
   {}, 
   205278, 
   null, 
   1144077960.0
  ], 
  [
   205290, 
   null, 
   "Alan Ryan", 
   "Richard Feynman always seems to have entertaining 'takes' on just about any aspect of physics. \n \n He gave some lectures on the character of physical law at Cornell about 40 years ago. Here's an extract from one:\n \n I think we can safely say that nobody understands quantum physics. So do not take this lecture too seriously in terms of some model I'm going to describe, but just relax and enjoy it. I'm going to tell you what nature behaves like. Do not keep saying to yourself if you can possibly avoid it, \"But how can it be like that?\". If you do, you will go down the drain into a blind alley from which nobody has yet escaped. Nobody knows how it can be like that.", 
   {
    "post_info": {
     "post_title": "Richard Feynman"
    }
   }, 
   205280, 
   null, 
   1144080720.0
  ], 
  [
   239703, 
   null, 
   "Eleph~ant~", 
   "no limits for speed of light", 
   {}, 
   205290, 
   null, 
   1163526300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Speed of light", 
  "url": "http://www.4forums.com/political/science-math-debates/7840-speed-light.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 7840, 
  "discussion_files": [
   [
    "548.html", 
    "http://www.4forums.com/political/science-math-debates/7840-speed-light-print.html"
   ], 
   [
    "549.html", 
    "http://www.4forums.com/political/science-math-debates/7840-speed-light-2-print.html"
   ]
  ], 
  "identifier": 7840
 }
]