[
 [
  [
   205609, 
   null, 
   "Inyx", 
   "This is a passage from a book called Radical Honesty by Brad Blanton:\n \n \"We all lie like hell. It wears us out. It is the major source of all human stress. Lying kills people. The kind of lying that is most deadly is withholding, or keeping back information from someone we think would be affected by it. Psychological illness of the severest kind is the result of this kind of lying. Psychological healing is possible only with the freedom that comes from not hiding anymore....\n ....Withholding from other people, not telling them about what we feel or think, keeps us locked in the jail. The longer we remain in that jail, the quicker we decline. We either escape, or we go dead. The way out is to get good at telling the truth.\"\n \n So in your opinion does not telling the truth (please lets not go into the debate what is truth, there is another thread already on this topic) or witholding information really have such dire consequences for an individual? And why we do it, even if we know what the consequences of lying may be?\n And in the final analysis are we even capable of telling only the truth and nothing but the truth?", 
   {
    "post_info": {
     "post_title": "The nature of a lie"
    }
   }, 
   null, 
   null, 
   1144233840.0
  ], 
  [
   205613, 
   null, 
   "Alan Ryan", 
   "This is a passage from a book called Radical Honesty by Brad Blanton:\n \n \"We all lie like hell. It wears us out. It is the major source of all human stress. Lying kills people. The kind of lying that is most deadly is withholding, or keeping back information from someone we think would be affected by it. Psychological illness of the severest kind is the result of this kind of lying. Psychological healing is possible only with the freedom that comes from not hiding anymore....\n ....Withholding from other people, not telling them about what we feel or think, keeps us locked in the jail. The longer we remain in that jail, the quicker we decline. We either escape, or we go dead. The way out is to get good at telling the truth.\"\n \n So in your opinion does not telling the truth (please lets not go into the debate what is truth, there is another thread already on this topic) or witholding information really have such dire consequences for an individual? And why we do it, even if we know what the consequences of lying may be?\n And in the final analysis are we even capable of telling only the truth and nothing but the truth?\n\n If lying is prohibited in any circumstances, unfortunate consequences are easy to envisage. \n \n The 'classic' case is, do you tell the truth when the mad axeman asks where your children are hiding?", 
   {}, 
   205609, 
   null, 
   1144243380.0
  ], 
  [
   205619, 
   null, 
   "Inyx", 
   "If lying is prohibited in any circumstances, unfortunate consequences are easy to envisage. \n \n The 'classic' case is, do you tell the truth when the mad axeman asks where your children are hiding?\n\n \n Who said you have to answer. If a mad axeman threathens to kill you if you don't say where your children are, he will kill you if you do not answer, but won't he do it anyway? \n \n I was not implying or postulating that lying is prohibited, but that decision to go beyond your own conditioning and the habit of pretense is free. Are we as indivuduals capable of achieving that? And if we are, will other follow our example? Why do we insist with the deception, if we know in our hearts, we only do damage to ourselfs, to others and our interpersonal relationships, as a consequence?", 
   {}, 
   205613, 
   null, 
   1144247340.0
  ], 
  [
   205622, 
   null, 
   "Alan Ryan", 
   "Who said you have to answer. If a mad axeman threathens to kill you if you don't say where your children are, he will kill you if you do not answer, but won't he do it anyway? \n \n I was not implying or postulating that lying is prohibited, but that decision to go beyond your own conditioning and the habit of pretense is free. Are we as indivuduals capable of achieving that? And if we are, will other follow our example? Why do we insist with the deception, if we know in our hearts, we only do damage to ourselfs, to others and our interpersonal relationships, as a consequence?\n\n The hypothesis assumes that I'm 'obliged' to tell the truth - which in this instance means I must reveal (to the axeman) where the children are hiding. \n \n I'm not sure I understand what you're driving at in the other questions you ask. Perhaps you could rephrase them?", 
   {}, 
   205619, 
   null, 
   1144248780.0
  ], 
  [
   205745, 
   null, 
   "Inyx", 
   "The hypothesis assumes that I'm 'obliged' to tell the truth - which in this instance means I must reveal (to the axeman) where the children are hiding. \n\n \n You are obliged but you can also choose not to answer if you find yourself in the situation that prudence for the lack of better word demands it. In a situation where you know its not only your life on the line it is irresponsible of you to 'feel obliged' to answer. There is a difference. :) \n \n \nI'm not sure I understand what you're driving at in the other questions you ask. Perhaps you could rephrase them?\n\n \n The author of the book mentioned postulates that lying and pretending is cause of all human relationship related stress. That it is so, because we neglect the reality and insist on our interpretations of it, relating also to our past bad/hurtful experiances and out of that originating assumptions about the world (which are according to him, and I incline to agree here with him, nothing more than the decisions we have made what the world should be true). He suggest that if we go beyond out stoned-in-cement beliefs and allow the opportunity that the world is not what it seems to us, we get a unique perspective that allows us not only be more free in our decisions regarding others but also improve out relationships with them.\n The answer I've be driving at is this: why do some think that lying and pretending will improve the relationships although time and time again it turns out to be the exact opposite? And why they still insist on continuing to lie, to others and sometimes also to themselfs? Are we so blind as not to see this?\n I for one, hate to lie. Even the little white lies, and I told some big ones in my time too, but sometimes I do it anyway because if I didn't play the game I would end up nobody liking me, because some get really offended if would tell them something straight up. (I'm exaggerating this one to make a point). Perhaps because they can't handel the truth? Or think that I can't? I honestly dislike being lied to. Sure you'll see that offended look on my face for a milisecond, but that doesn't meant I don't appreciate honesty more. I know that sometimes telling the truth is really really hard, but in the end doesn't it pay more to tell it anyway?", 
   {}, 
   205622, 
   null, 
   1144319100.0
  ], 
  [
   205746, 
   null, 
   "Alan Ryan", 
   "\n \n The author of the book mentioned postulates that lying and pretending is cause of all human relationship related stress. That it is so, because we neglect the reality and insist on our interpretations of it, relating also to our past bad/hurtful experiances and out of that originating assumptions about the world (which are according to him, and I incline to agree here with him, nothing more than the decisions we have made what the world should be true). He suggest that if we go beyond out stoned-in-cement beliefs and allow the opportunity that the world is not what it seems to us, we get a unique perspective that allows us not only be more free in our decisions regarding others but also improve out relationships with them.\n The answer I've be driving at is this: why do some think that lying and pretending will improve the relationships although time and time again it turns out to be the exact opposite? And why they still insist on continuing to lie, to others and sometimes also to themselfs? Are we so blind as not to see this?\n \n\n There might be occasions when, after weighing all the options, telling a lie is the least 'evil' option. Sometimes it doesn't pay to be too scrupulous.\n \n Common sense suggests that lying is not likely to be the cause of all stressful feedback in human relations. \n \n It is possible that lying could improve a personal relationship. There is no necessary cause and effect association between lying and the breakdown of relationships. It's the sort of question that should be answered on a case by case basis after all the relevant circumstances have been considered.\n \n Generally speaking, we are all in favour of honesty: but telling the truth regardless, can lead to the sort of moral dilemma I hinted at in the tale of the axeman.", 
   {}, 
   205745, 
   null, 
   1144321860.0
  ], 
  [
   205756, 
   null, 
   "simone", 
   "Everything that a human says is a lie, at least in part, because it is utterly impossible for a human to state the total truth. Our perception of what is real and true is too limited for us to be able to state the total truth.\n \n Therefore, there is no such thing as utter truth, it is only our limited perception of what is true and real.\n \n So, what percentage of reality is acceptable as being true?\n \n Anything over 50%?", 
   {}, 
   205746, 
   null, 
   1144332900.0
  ], 
  [
   205765, 
   null, 
   "Kronus", 
   "Everything that a human says is a lie, at least in part, because it is utterly impossible for a human to state the total truth. Our perception of what is real and true is too limited for us to be able to state the total truth.\n \n Therefore, there is no such thing as utter truth, it is only our limited perception of what is true and real.\n \n So, what percentage of reality is acceptable as being true?\n \n Anything over 50%?\n\n \n Lying doesn't mean saying something that isn't True (note the cap). It's saying something that you think isn't true. If I believe with all my heart that I'm Napolean, and I say \"I'm not Napolean\", then I'm lying, even though my statement is true, not to mention True.\n \n As for the original quote, it seems like a gross overstatement to me. That said, telling the truth is almost always the correct choice. We lie, generally, because the truth can be hard. And when it comes to moral dilemas, the hard choice is generally the correct one. If doing the correct thing was easy, it wouldn't be a dilema, would it? And taking the easy way out can become a habit. Once you start rationalizing your lying, it just becomes easier and easier.", 
   {}, 
   205756, 
   null, 
   1144337580.0
  ], 
  [
   205768, 
   null, 
   "Adept", 
   "So in your opinion does not telling the truth or witholding information really have such dire consequences for an individual?\n\n \n Without some convincing clinical data to indicate otherwise, I'm going to have to go with a \"NO\" for this one.\n \n Lying causes mental illness? What a joke.", 
   {}, 
   205609, 
   null, 
   1144338540.0
  ], 
  [
   205770, 
   null, 
   "Alan Ryan", 
   "Polite fictions abound in social relationships. If we always told the pure and unvarnished truth (as we see it) to our family and friends, a great deal of unhappiness would probably result.\n \n Everyone, apart from Machiavelli, seems to agree that honesty is the best policy. But a great deal depends on the options available and the likely outcome of telling the truth without mercy.", 
   {}, 
   205768, 
   null, 
   1144340220.0
  ], 
  [
   205781, 
   null, 
   "Kronus", 
   "Polite fictions abound in social relationships. If we always told the pure and unvarnished truth (as we see it) to our family and friends, a great deal of unhappiness would probably result.\n \n Everyone, apart from Machiavelli, seems to agree that honesty is the best policy. But a great deal depends on the options available and the likely outcome of telling the truth without mercy.\n\n \n You can be truthful and tactful at the same time. In response to \"Do these pants make my butt look big\" one needn't respond \"Yes, really huge.\". \"Sorta. I think your blue skirt is more flattering\" is truthful without being hurtful, and actually gives the asker useful information, rather than decieving them into thinking they look good when they don't. I always try to be honest when my opinion is asked, so that if I do say something complimentary people know it's sincere. I think being able to trust someone generates enough happiness to overcome the unhappiness of an occasional unpleasant truth.", 
   {}, 
   205770, 
   null, 
   1144344660.0
  ], 
  [
   205788, 
   null, 
   "Adept", 
   "Everyone, apart from Machiavelli, seems to agree that honesty is the best policy.\n\n \n Only because it gets hard to keep all the lies straight.", 
   {}, 
   205770, 
   null, 
   1144347060.0
  ], 
  [
   205940, 
   null, 
   "simone", 
   "Lying doesn't mean saying something that isn't True (note the cap). It's saying something that you think isn't true. If I believe with all my heart that I'm Napolean, and I say \"I'm not Napolean\", then I'm lying, even though my statement is true, not to mention True.\n \n As for the original quote, it seems like a gross overstatement to me. That said, telling the truth is almost always the correct choice. We lie, generally, because the truth can be hard. And when it comes to moral dilemas, the hard choice is generally the correct one. If doing the correct thing was easy, it wouldn't be a dilema, would it? And taking the easy way out can become a habit. Once you start rationalizing your lying, it just becomes easier and easier.\nSo, lying is a deliberate action, taking what you know to be true and falsifying it.\n \n I've pretty much found lying to be an onerous construct. If one lies, one must keep track of all one's bloody lies and be consistent about them. Whereas, if one is faithful about observing the truth, there is, hopefully, a historic record or someone's somewhat reliable recollection to confirm one's truth. Somewhere there might be evidence left of what the truth is.\n \n One does wonder, though, when one considers the novel 1984 and the current enormous deviations from reality of the Bush administration, after all, one of their stated goals was to give short shrift to the reality-based community.\n \n Propagandist videos released nationwide as news, the purchasing of journalists such as Armstrong Williams and others, it seems to go on and on.", 
   {}, 
   205765, 
   null, 
   1144422180.0
  ], 
  [
   206005, 
   null, 
   "BirchTree", 
   "Perhaps the original author of this novel intended that lying inwardly causes this extreme harm? Not facing your own reality, living a life based on illusion could cause harm. \n \n However, if you really believe your own lies, like Kronus brought up...then are you really lying? \n \n No. Just deranged...in which case, the lying has indeed caused psychological harm.", 
   {}, 
   205940, 
   null, 
   1144454100.0
  ], 
  [
   206020, 
   null, 
   "Inyx", 
   "Perhaps the original author of this novel intended that lying inwardly causes this extreme harm? Not facing your own reality, living a life based on illusion could cause harm. \n \n\n \n Actually the book is not a novel, the book mentioned was written by man with a Ph.D. in psychotherapy and had over 25 years of practice in the field when he wrote it. \n And no, his main thesis is not lying to yourself (although when you do lie to yourself you are not really in touch with the reality :) ) but lying to others, which causes stress and unhappines in one's life.", 
   {}, 
   206005, 
   null, 
   1144460160.0
  ], 
  [
   206057, 
   null, 
   "Kronus", 
   "\n And no, his main thesis is not lying to yourself (although when you do lie to yourself you are not really in touch with the reality :) ) but lying to others, which causes stress and unhappines in one's life.\n\n While I do think that lying can cause more stress and unhappines than it prevents, the author's \"doom and gloom\" predictions are just wrong. But I guess you sell more books if you say \"X is the worst thing ever\" than if you say \"X is bad\". At the risk, of course, of having people read your book and say, \"That's just silly.\"", 
   {}, 
   206020, 
   null, 
   1144505220.0
  ], 
  [
   206062, 
   null, 
   "simone", 
   "Perhaps the original author of this novel intended that lying inwardly causes this extreme harm? Not facing your own reality, living a life based on illusion could cause harm. \n \n However, if you really believe your own lies, like Kronus brought up...then are you really lying? \n \n No. Just deranged...in which case, the lying has indeed caused psychological harm.\nBut, what is the origin of the lying?\n \n In some families, lying and pretending that Daddy is not an alcoholic and abusive is necessary, or it is believed that the lying is necessary, to preserve the infrastructure of the family.\n \n Again, the Bush family, and the problem of George Herbert Walker Bush's father.", 
   {}, 
   206005, 
   null, 
   1144507140.0
  ], 
  [
   206558, 
   null, 
   "Inyx", 
   "But, what is the origin of the lying?\n \n\n \n The origin of lying is our upbringing. We learn to lie and pretend in the early childhood, because we learn that when we do something 'wrong' (= not consistent with what others expect us from to do or it is not within the social norms) we we'll avoid punishment, if we don't admit to what we supposedly have done 'wrong', or some other unpleasant consequance or to accuire some form of reward. It is our natural tendency to feel as good as we can as much as we can. And in order to get it we develop strategies to accuire it. Lying is just one among of them.\n \n We preted to please others, to be accepted, because we fear others - whos approval we wish for - will not accept us for what we are. It is a fact that we all wear social masks, in order to succesfully function in society as individuals and society as a whole.\n \n \nIn some families, lying and pretending that Daddy is not an alcoholic and abusive is necessary, or it is believed that the lying is necessary, to preserve the infrastructure of the family.\n\n \n Yeah, but at what cost?", 
   {}, 
   206062, 
   null, 
   1144756740.0
  ], 
  [
   206562, 
   null, 
   "Cheesejoff", 
   "Everything that a human says is a lie, at least in part, because it is utterly impossible for a human to state the total truth. \n\n \n Then that statement is a lie.", 
   {}, 
   205756, 
   null, 
   1144764720.0
  ], 
  [
   206579, 
   null, 
   "simone", 
   "Touche, Cheese, but how much of a lie is it?", 
   {}, 
   206562, 
   null, 
   1144774380.0
  ], 
  [
   206585, 
   null, 
   "Cheesejoff", 
   "Touche, Cheese, but how much of a lie is it?\n\n \n A lie that is completely true...hm...I need a lie down now :)", 
   {}, 
   206579, 
   null, 
   1144776540.0
  ], 
  [
   206592, 
   null, 
   "simone", 
   "Coward! Afraid to face the truth of a lie! Taking it lying down!", 
   {}, 
   206585, 
   null, 
   1144779060.0
  ], 
  [
   206728, 
   null, 
   "Inyx", 
   "How about if you say something you belive it to be true. Then such a statment can not be a lie. Since a lie is an intentional bending of the truth.", 
   {}, 
   206592, 
   null, 
   1144850640.0
  ], 
  [
   206749, 
   null, 
   "Alan Ryan", 
   "Beliefs are supposed to be true. I believe in x and I believe x is true, amount to the same thing.\n \n You cannot say, \"I believe fairies exist, but I don't think it's true that fairies exist\".", 
   {}, 
   206728, 
   null, 
   1144857540.0
  ], 
  [
   206758, 
   null, 
   "Kronus", 
   "Beliefs are supposed to be true. I believe in x and I believe x is true, amount to the same thing.\n \n\n \n Yes, but \"I believe X is true\" and \"X is true\" are not the same thing, at least not logically. Your belief may be incorrect. So while linguisticly \"I believe X is true\" and \"X is true\" are very close in meaning, logically the first may be true and the second false. Thus while it could be that neither one is a lie, they have different truth values.", 
   {}, 
   206749, 
   null, 
   1144861320.0
  ], 
  [
   206764, 
   null, 
   "Alan Ryan", 
   "Yes, but \"I believe X is true\" and \"X is true\" are not the same thing, at least not logically. Your belief may be incorrect. So while linguisticly \"I believe X is true\" and \"X is true\" are very close in meaning, logically the first may be true and the second false. Thus while it could be that neither one is a lie, they have different truth values.\n\n You've omitted the weight that should be given to the word \"supposed\" in my first sentence. I know that a belief might (objectively) be false.\n \n Beliefs are subjective claims: If I say I believe that x is the case, it would be absurd to add, but I know it's not true.", 
   {}, 
   206758, 
   null, 
   1144862100.0
  ], 
  [
   206771, 
   null, 
   "Kronus", 
   "\n Beliefs are subjective claims: If I say I believe that x is the case, it would be absurd to add, but I know it's not true.\n\n \n Yes, I believe that is true. :)", 
   {}, 
   206764, 
   null, 
   1144863360.0
  ], 
  [
   213388, 
   null, 
   "superhippo", 
   "Lets put this into a christian kind a view. GOd made everything. Everything he made wasnt God. God is perfect. So everything that isnt God wont be perfect.", 
   {}, 
   206020, 
   null, 
   1147891740.0
  ], 
  [
   213426, 
   null, 
   "Inyx", 
   "Lying or telling the truth has nothing to do with being perfect (or God for that matter). It is only an individual's choice, what he'll do: tell a lie or tell the truth.", 
   {}, 
   213388, 
   null, 
   1147906680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The nature of a lie", 
  "url": "http://www.4forums.com/political/philosophy-debates/7888-nature-lie.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 7888, 
  "discussion_files": [
   [
    "3921.html", 
    "http://www.4forums.com/political/philosophy-debates/7888-nature-lie-print.html"
   ], 
   [
    "3922.html", 
    "http://www.4forums.com/political/philosophy-debates/7888-nature-lie-2-print.html"
   ]
  ], 
  "identifier": 7888
 }
]