[
 [
  [
   205658, 
   null, 
   "RedMoon", 
   "Anyone been following the S.1955 bill that's going through Congress right now? It seems to be a bill aiming to provide more affordable health insurance opportunities to small business owners, which is a laudable goal, to be sure. Unfortunately, it seems to want to do this by giving the insurance companies a freebie ot bypass state regulations on insurance coverages. What are your thoughts on this?\n \n Personally, I think that the entire thing needs to be scrapped and they need to go back to the drawing board on it. As it stands, this bill is a giveaway to the insurance industry at the expense of employees of small businesses, who will wind up with inferior insurance coverage that doesn't cover basic things like diabetes remedies. \n \n http://www.latimes.com/news/politics/la-na-health16mar16,1,113954.story?ctrack=1&cset=true\n \n \nSenate Bill Would Override State Health Coverage Rules\n \n \n GOP backers see the legislation as a way for insurers to offer more affordable plans. Critics say it would undermine treatment protections.\n \n The battle over healthcare moved to a new front Wednesday as Senate Republicans advanced a bill that would change the way health insurance was sold nationwide.\n \n On a party-line vote, a Senate committee approved a bill that would preempt state laws that require insurance policies to cover specific services, such as maternity care and supplies for diabetics.\n \n California, which mandates that insurers cover 23 specific treatments and procedures - including mammograms and second opinions - would be one of the states most affected by the legislation.\n \n Sponsors of the bill said overriding state coverage rules, as well as state laws regulating insurance pricing, would allow insurers to offer less-expensive plans. They say it would prompt more small businesses to purchase insurance for workers.\n \n \"Today's vote is the first major step in 15 years to get affordable health insurance for small businesses and working families,\" said the bill's sponsor, Sen. Michael B. Enzi (R-Wyo.).\n \n Enzi heads the Health, Education, Labor and Pensions Committee, which approved the bill, 11 to 9.\n \n Critics, including the panel's Democratic members, charged that the legislation would undermine state protections meant to guarantee that insurance policies provide adequate health coverage at affordable prices.\n \n California Insurance Commissioner John Garamendi warned that the bill would lead to \"an ever-increasing number of people who are uninsured ... and for those with insurance, the benefit package is certain to be dramatically reduced.\"\n \n The dispute mirrors the partisan divide on an array of healthcare issues, including restructuring Medicaid and the health savings accounts proposed by President Bush.\n \n In each case, Republicans and their allies promote ideas they say would save money and increase efficiency by offering consumers more choice. Democrats and other critics say the GOP plans would shift risk and cost toward patients, especially those who are older and sicker.\n \n Wednesday's committee vote marked the first time the Senate had taken a step to preempt state requirements for health coverage. The measure will probably face significant opposition in the full Senate, but supporters say the committee vote may pave the way for its passage.\n \n The bill represents one response to an erosion in the number of Americans receiving healthcare coverage at work. Although most large employers provide coverage, the share of small businesses offering it has dropped from 68% in 2000 to 59% today, according to annual surveys by the Kaiser Family Foundation.\n \n Small-business groups blame the decline on rising insurance premiums. Those costs, they say, are increasing because of state requirements for so many specific benefits.\n \n Martyn B. Hopper, the California director for the National Federation of Independent Business, said, \"Every time the Legislature adds a mandate, it adds tremendously to the cost of insurance, and that means small-business owners can't afford to pay for it.\"\n \n For years, the federation and similar groups have pushed for legislation that would allow small businesses to band together to buy health insurance across state lines in what are known as association health plans. The House has passed bills creating such plans eight times, most recently in July. The plans would be exempt from requirements for specific services.\n \n The idea consistently has stalled in the Senate. Democrats, consumer groups and some state regulators have opposed the preemption of state laws. Traditional health insurance companies have complained that the association health plans would have unfair advantages in selling to small businesses.\n \n Enzi's bill would allow all insurers to sell policies that would be exempt from state coverage requirements. It would also let insurers sell those policies to large businesses and individuals.\n \n In return, insurers would have to sell a more comprehensive policy in each state that provided benefits equivalent to those offered to state employees in the five largest states. Employers would not be required to offer the more comprehensive plan to their workers.\n \n The bill's backers contend that the availability of lower-cost, less-comprehensive policies would encourage small employers to purchase insurance.\n \n Critics say that allowing insurers to sell the limited plans would disrupt insurance markets. One concern is that to save money, employers now offering more comprehensive coverage will switch to bare-bones packages with minimal benefits.\n \n The broader fear is that younger and healthier workers will gravitate to the lower-cost plans. If that happens, plans offering more comprehensive benefits would be left caring for a disproportionate share of older and sicker Americans. That could unravel the concept of collective risk-sharing between the healthy and the sick, and raise premiums for more comprehensive plans to unaffordable levels.\n \n Opponents contend that another provision of the legislation could compound that risk. The section would override laws in California and other states limiting how much insurers could vary the premiums charged to small businesses based on the health of workers.\n \n Under the California law, for instance, the most expensive policies for small businesses can cost only about 22% more than the least expensive, according to figures from Garamendi's office. But his office has calculated that under Enzi's bill, insurers would be permitted to vary their prices by five times as much as that.\n \n Supporters say insurers need flexibility to create lower-cost plans that would attract employers who don't offer coverage.\n \n Critics say ending the state rate-setting authority would penalize firms whose workers have higher medical costs - and change hiring practices.\n \n \"This will create a very powerful pressure not to hire people who could be expensive\" because of their healthcare needs, Garamendi said.\n", 
   {
    "post_info": {
     "post_title": "Bill to allow medical insurance bypass state law?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1144260840.0
  ], 
  [
   205820, 
   null, 
   "RedMoon", 
   "All these lurkers! So many views and no replies.\n \n Here's something to spice up the discussion. In These Times ran a piece on the impact this bill could have on reproductive rights.\n \n http://www.inthesetimes.com/site/main/article/2558/", 
   {}, 
   205658, 
   null, 
   1144362720.0
  ], 
  [
   208133, 
   null, 
   "Matthew S", 
   "This is standard fare for the republican party and its looking out for the business lobby. Why does this suprise anyone? Sorry redmoon in my other battles I sometimes forget about the republican oppression of the poor.", 
   {}, 
   205820, 
   null, 
   1145409600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bill to allow medical insurance bypass state law?", 
  "url": "http://www.4forums.com/political/health-debates/7892-bill-allow-medical-insurance-bypass-state-law.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 7892, 
  "discussion_files": [
   [
    "31107.html", 
    "http://www.4forums.com/political/health-debates/7892-bill-allow-medical-insurance-bypass-state-law-print.html"
   ]
  ], 
  "identifier": 7892
 }
]