[
 [
  [
   205661, 
   null, 
   "Tastyfish", 
   "Was looking up the answers to another question in a text book, and found a link to extended material that seems quite relevant. Hopefully it should provide a fairly neutral view on the subject.\n Link the whole article, its quite long as it covers the history of where life was viewed to begin before moving into science's views.\n \n \nCurrent Scientific Views of When Human Life Begins\n Current perspectives on when human life begins range from fertilization to gastrulation to birth and even after. Here is a brief examination of each of the major perspectives with arguments for and against each of the positions. Contemporary scientific literature proposes a variety of answers to the question of when human life begins.\n \n Metabolic View: \n The metabolic view takes the stance that a single developmental moment marking the beginning of human life does not exist. Both the sperm and egg cells should individually be considered to be units of life in the same respect as any other single or multicellular organism. Thus, neither the union of two gametes nor any developmental point thereafter should be designated as the beginning of new life.\n \n Another slightly different though similar position maintains that the argument over when a new human life begins is irrelevant because the development of a child is a smoothly continuous process. Discrete marking points such as the fourteen day dividing line between a zygote and an embryo are entirely artificial constructions of biologists and doctors in order to better categorize development for academic purposes. This position is supported by recent research that has revealed that fertilization itself is not even an instantaneous event, but rather a process that takes 20-22 hours between the time the sperm penetrates the outermost layers of the egg and the formation of a diploid cell (Kuhse 1988). \n \n Genetic View: \n The genetic view takes the position that the creation of a genetically unique individual is the moment at which life begins. This event is often described as taking place at fertilization, thus fertilization marks the beginning of human life. During this developmental event, the genes originating from two sources combine to form a single individual with a different and unique set of genes. One of the most popular arguments for fertilization as the beginning of human life is that at fertilization a new combination of genetic material is created for the first time; thus, the zygote is an individual, unique from all others. \n \n Although the opinion that life begins at fertilization is the most popular view among the public, many scientists no longer support this position, as an increasing number of scientific discoveries seem to contradict it. One such discovery in the last twenty years is that research has shown that there is no \"moment of fertilization\" at all. Scientists now choose to view fertilization as a process that occurs over a period of 12-24 hours. After sperm are released they must remain in the female reproductive tract for seven hours before they are capable of fertilizing the egg. Approximately ten hours are required for the sperm to travel up to the fallopian tube where they find the egg. The meeting of the egg and the sperm itself is not even an instantaneous process, but rather a complex biochemical interaction through which the sperm ultimately reaches the inner portion of the egg. Following fertilization, the chromosomes contained within the sperm and the chromosomes of the egg meet to form a diploid organism, now called a zygote, over a period of 24 hours. (Shannon and Wolter 1990). Thus, even if one were to argue that life begins at fertilization, fertilization is not a moment, but rather a continuous process lasting 12-24 hours, with an additional 24 hours required to complete the formation of a diploid individual. \n \n The most popular argument against the idea that life begins at the moment of fertilization has been dubbed the \"twinning argument.\" The main point of this argument is that although a zygote is genetically unique from its parents from the moment a diploid organism is formed; it is possible for that zygote to split into two or more zygotes up until 14 or 15 days after fertilization. Even though the chances of twinning are not very great, as long as there is the potential for it to occur the zygote has not completed the process of individuation and is not an ontological individual. \n \n Proponents of this view often propose the following hypothetical situation: Suppose that an egg is fertilized. At that moment a new life begins; the zygote gains a \"soul,\" in the Catholic line of thought, or \"personhood\" in a secular line of thought. Then suppose that the zygote splits to form twins. Does the soul of the zygote split as well? No, this is impossible. Yet no one would argue that twins share the same \"soul\" or the same \"personhood.\" Thus, supporters of this view maintain that the quality of \"soul\" or \"personhood\" must be conferred after there is no longer any potential for twinning. (Shannon and Wolter 1990) \n \n The argument that human life begins at the moment that chromosomes of the sperm meet the chromosomes of the egg to form a genetically unique individual is also endangered by the twinning argument because genetic uniqueness is not a requirement for an individual human life. \"Genetic uniqueness\" can be shared by multiple individuals, particularly indentical twins. Thus, this argument continues, the moment at which a unique individual human forms is the not the moment when its genetic code is determined, but rather the moment when the zygote can no longer split into multiple individuals.\n \n In addition to twinning, there are other complexities that further confound the idea of the moment of conception. Just as it possible for a zygote to form two or more individuals before it is implanted in the uterus, it is also possible for it to not continue to develop at all, but rather just become a part of the placenta. (Shannon and Wolter 1990). It is estimated that more the 50% of the fertilized eggs abort spontaneously and never become children (see Gilbert 2003). Or, if the zygote splits into multiple zygotes, it is also possible for these to recombine before implantation. All of these possibilities are examples of the ways in which the individuation of the zygote is incomplete until it has been implanted in the uterus.\n \n Embryological View: \n In contrast to the genetic view, the embryological view states that human life originates not at fertilization but rather at gastrulation. Human embryos are capable of splitting into identical twins as late as 12 days after fertilization resulting in the development of separate individuals with unique personalities and different souls, according to the religious view. Therefore, properties governing individuality are not set until after gastrulation. This view is endorsed by a host of contemporary scientists such as Renfree (1982), C. Grobstein (1988) and McLaren. This view of when life begins has also been adopted as the official position of the British government. The implications of a belief in this view include giving support to controversial forms of contraception including the \"morning after\" pill and contragestational agents as long as they are administered during the first two weeks of pregnancy. \n \n One of the most popular positions among philosophers is the perspective that life begins at the point of gastrulation, that point at which the zygote is an ontological individual and can no longer become two individuals. Gastrulation commences at the beginning of the third week of pregnancy, when the zygote, now known as an embryo is implanted into the uterus of the mother. The cells are now differentiated into three categories that will give rise to the different types of body tissue. (Shannon and Wolter 1990). After gastrulation the zygote is destined to form no more than one human being. \n \n The philosophers who support this position argue that there exists a difference between a human individual and a human person. A zygote is both human and numerically single and thus a human individual. However, because individuality is not certain until implantation is complete, and because individuality is a necessary condition of personhood, the zygote is not yet a human person. (Ford 1988; Shannon and Wolter 1990; McCormick 1991). Catholic scholars Shannon and Wolter (1990) describe this eloquently saying, \"An individual is not an individual, and therefore not a person, until the process of restriction is complete and determination of particular cells has occurred. Then, and only then, it is clear that another individual cannot come from the cells of this embryo.\" \n \n Some supporters of the fertilization position find fault in this argument by claiming that the potential of twinning is a technicality and not strong enough to support the claim that human life does not begin until gastrulation. Alan Holland puts forth the view that just because a zygote has the possibility to divide into multiple individuals does not mean that it is not an individual before it divides. As an analogy, he presents the case of the worm that is clearly a single individual worm until it is cut into two when it becomes two individual worms. (Holland 1990).\n \n Some would also argue that in the discussion of when human life begins the question of whether a zygote will eventually become one individual or multiple individuals is irrelevant. The key point is that at least one human life may begin as the result of the zygote, and thus human life began at the creation of the zygote, fourteen days before gastrulation. \n \n Neurological view:\n Although most cultures identify the qualities of humanity as different from other living organisms, there is also a universal view that all forms of life on earth are finite. Implicit in the later view is the reality that all life has both a beginning and an end, usually identified as some form of death. The debate surrounding the exact moment marking the beginning of a human life contrasts the certainty and consistency with which the instant of death is described. Contemporary American (and Japanese) society defines death as the loss of the pattern produced by a cerebral electroencephalogram (EEG). If life and death are based upon the same standard of measurement, then the beginning of human life should be recognized as the time when a fetus acquires a recognizable EEG pattern. This acquisition occurs approximately 24- 27 weeks after the conception of the fetus and is the basis for the neurological view of the beginning of human life. \n \n These principles of the neurological view of the beginning of human life are presented in The Facts of Life, a book written by Harold Morowitz and James Trefil in 1992 concerning the abortion controversy. An electroencephalogram (EEG) is a simple medical procedure in which electrodes are attached to different locations on a patient's head and the voltage difference over time is measured between the two points. The voltage data is plotted against time to produce \"brain waves\" with up and down voltage oscillations that are representative of the organized electrical activity of the brain (Morowitz and Trefil 1992). Medical professionals use a patient's EEG pattern to identify a broad spectrum of mental states. Although EEGs are often used as a diagnostic tool, the exact mechanism behind how an EEG pattern is linked to an individual's cerebral neuron activity remains a mystery (Morowitz and Trefil 1992).\n \n Despite lacking a precise explanation for the connection between the EEG and neural activity, there is a strong argument that the unique and highly recognizable EEG pattern produced by a mature brain is a defining characteristic of humanity (Morowitz and Trefil 1992). Therefore, the moment that a developing fetus first exhibits an EEG pattern consistent with that of a mature brain is indicative of the beginning of human life. It is from this point and onward during development that the fetus is capable of the type of mental activity associated with humanity (Morowitz and Trefil 1992). \n \n Because the state of modern technology still prohibits EEGs in utero, brain activity data for humans at various stages of development has been gathered using premature infants. Observations to date have led to the conclusion that 25 weeks of gestation is required for the formation of synapses needed for recognizable neural activity. At this point in development, the recognizable signals exist only as intermittent bursts that interrupt periods of random activity (Morowitz and Trefil 1992). This conclusion is summarized by Donald Scott who in his book Understanding the EEG wrote, \"Attempts have been made to record cerebral activity of premature infants and they have succeeded (only) if the gestational age was 25 weeks or more (Morowitz and Trefil 1992).\" Such claims, as well as arguments that endorse an opposite argument, are for many the foundation for any dispute over defining the inception of human life. Consequently, the principles of the neurological view are tenets in the debate over another controversial subject: abortion.\n \n Champions for a fetus's right to life often claim that the brain of a human fetus begins to show electrical activity at a remarkably early age. A key moment in the history of the abortion debate is the production and release of \"The Silent Scream,\" an influential abortion film that graphically depicts the fetal response to its termination. The video accompanies the abortion of a 12-week-old fetus with the words \"Now this little person at twelve weeks is a fully formed absolutely identifiable human being. He has had brain waves for at least six weeks...\" (Morowitz and Trefil 1992). Although such arguments appeal to both the emotion by depicting an infant, though still developing, in a moment of pain and crisis and the intellect by presenting a scientific line of reasoning, the position presented by the film conflicts widely accepted developmental theory. For instance, the film contends that a fetus has brain waves after 12 weeks and suggest, even in the title \"The Silent Scream,\" that it reacts to its termination with fear and pain. These contentions contradict scientific evidence that indicates neural connections in the cerebral cortex have yet to develop in a 12-week-old fetus. Lacking these basic neural networks, the developing fetus is incapable of feeling the emotions recognized as fear or pain (Morowitz and Trefil 1992). The film's position is further contrasted by evidence that suggests a 12-week-old fetus is not yet capable to take direct actions in response to a thought. The developing fetus is therefore incapable of recognizing potential danger and unable to either be fearful of it or actively evade it through movement or any other willful activity (Morowitz and Trefil 1992). \n \n (For information concerning how photographs of the embryo are often misrepresented on anti-abortion literature and websites, see Images of Embryos Used by Anti-Abortion Activists.)\n \n In addition to presenting 25 weeks as a critical developmental landmark, other proponents of the neurological view believe that events of the eighth week of human gestation represent the key moments marking the beginning of human life. Contemporary philosophical arguments for designating week 8 as the beginning of human life proceed in accordance with the following format: humanness requires rational thought and rational thought requires a brain and a nervous system. Philosophers who present such arguments contest that an embryo is not a human being until it has a rudimentary nervous system. At week 8, the embryo has completed organogenesis, meaning it has simple, undeveloped versions of all the basic organ systems, including the nervous system (Shannon and Wolter 1990) Philosophers who subscribe to this perspective pay close attention to the progressively increasing complexity of the nervous system or the first weeks and months of pregnancy. At week 5 the first neurons begin to appear, at week 6 \"the first synapses ... can be recognized,\" and at 7.5 weeks the embryo displays its first reflexes in response to stimulus. (Shannon and Wolter 1990). Thus around week 8 the embryo has a basic three-neuron circuit, the foundation of a nervous system necessary for rational thought. (Shannon and Wolter 1990).\n \n It should come as no surprise that this contemporary philosophical debate also consists of a second argument, which is in direct opposition to the aforementioned position. There are philosophers who believe that the capacity for rational thought is indeed a prerequisite of humanness, but that an 8-week-old embryo does not have the capacity for rational thought. At 8 weeks an embryo displays reflexes that are the result of its budding nervous system, but it does not yet have the structures necessary to engage in true rational activity in contrast to mere reflex motivated movement. (Shannon and Wolter, 1990)\n \n A third developmental landmark presented by proponents of the neurological view occurs at 20 weeks. Some advocates of the philosophy that a prerequisite for humanness is the capacity for rational thought believe that the existence of a primitive nervous system after 8 weeks, with the ability to respond by reflex to stimulation, does not amount to rational thought. The embryological landmark of 20 weeks marks the completion of the development of the thalamus, a region of the brain, which enables the integration of the nervous system. Philosophers who support this view therefore believe that only after 20 weeks of gestation can the embryo be said to have the capacity for rational thought. \n \n The precept at the heart of the neurological view of the beginning of human life is the significant development of neural pathways that are critical for characteristic human brain activity. The formation of these neural connections is often viewed to culminate in the acquisition of humanness, a stage during the third trimester of human gestation when the overwhelming majority of neural pathways in the cerebral cortex are established (Morowitz and Trefil 1992). The contemporary concept of the acquisition of humanness was developed and elaborated during the later half of the twentieth century by theological and biological leaders who emphasized the importance of the cerebral cortex in characterizing humanness. The Jesuit scholar and anthropologist scientist Pierre Teilhard de Chardin presented his belief that the transcendence of humanity was dependant upon the successful maturation of the cerebral cortex. Bernard Haring, a permanent Catholic theologian of the 1970s argued that individuality and the uniqueness of personal characteristics and activities originated from the cerebral cortex. A decade later, the anatomist Paul Glees argued \"the (cerebral cortex) represents the signature of a genetically unique person\" (Morowitz and Trefil 1992)\n \n The contemporary idea of the acquisition of humanness is based on the contemporary theories of developmental embryology. Cerebral nerve cells accumulate in number and continually differentiate through the end of the second trimester of human pregnancy (Morowitz and Trefil 1992). However, it is not until the seventh month of gestation that a significant number of connections between the newly amassed neurons begin to take form. It is only after the neurons are linked via synapse connections that the fetus is thought to acquire humanness. Just as a pile of unconnected microchips is incapable of functioning and is therefore not called a computer, the unconnected neurons of the pre 24-week fetal brain lack the capacity to function, thus the developing fetus has yet to acquire humanness (Morowitz and Trefil 1992). \n \n Ecological / Technological view:\n Advocates of the neurological view contend that human life begins when a developing fetus acquires humanness, a point designated by brain activity that can be described as characteristically human. But if this developing fetus is separated from its mother at an early stage, regardless of the state of neural development, the fetus will be unable to sustain life on its own. The total dependence of the developing fetus for the majority of gestation catalyzed the formation of another view of when human life begins. The ecological/technological view of when human life begins designates this point when an individual can exist separately from the environment in which it was dependent for development (i.e., its mother's womb). \n \n Under most circumstances, the limiting factor for human viability is not the development of neural connections but the maturation of the lungs. However, advances in medical science permit a premature fetus to breathe after only 25 weeks of gestation, a stage in its development prior to the complete formation of functioning lungs (Gilbert 2002). Legislation using the ecological/technological view of when human life begins includes decrees of when a fetus can legally be aborted, mandating that after a fetus is determined to be independent its life can no longer be terminated (Gilbert 2002).\n \n", 
   {
    "post_info": {
     "post_title": "Science and where Life begins"
    }
   }, 
   null, 
   null, 
   1144261560.0
  ], 
  [
   205670, 
   null, 
   "Steeeeve", 
   "I've posted this before...doesn't really help actually", 
   {}, 
   205661, 
   null, 
   1144267020.0
  ], 
  [
   205673, 
   null, 
   "Tastyfish", 
   "Really? There did seem something vaguely familiar with it but I assumed it was just that I'd looked at it when doing coursework on something else.\n \n There are a couple of interesting things that might be relevant though, the various stages at which certain areas of the brain develop, the issues with the idea of life beginning at conception and twins for example. I do not see how you could read that and still claim that a human life begins at conception.\n \n It doesn't just come out and provide the absolute point when life begins, but it is a fairly neutral source for the various claims people make (for example you stop being 'brain dead' at 24 weeks, the brain first develops at 8 weeks etc).", 
   {}, 
   205670, 
   null, 
   1144268040.0
  ], 
  [
   205963, 
   null, 
   "Steeeeve", 
   "you can easily say it begins at conception....err, new human life that is.", 
   {}, 
   205673, 
   null, 
   1144430640.0
  ], 
  [
   205966, 
   null, 
   "Tastyfish", 
   "You could easily say that...but it seems a bit silly to say that the sperm and eggs arn't human life but a zygote that might end up splitting into two different people is a person.", 
   {}, 
   205963, 
   null, 
   1144431060.0
  ], 
  [
   205967, 
   null, 
   "thelmoose", 
   "I am not trying to be nihilistic here, but if anything, Tastyfish's initial post at least documents how complex this question is, if it is unanswerable at all. Actually defining life is debatable, and can vary whether you're taking a scientific view (and then is it metabolic, genetic, neurological?) or a religious, philosophical or legal one. Trying to state with certainty when (human) life begins is probably not possible. In any event, I don't feel that a simplistic answer is acceptable in this debate.", 
   {}, 
   205966, 
   null, 
   1144432620.0
  ], 
  [
   205973, 
   null, 
   "Another opinion", 
   "Science can tell us a lot about the development of the human zygote, embryo, and fetus and about important significant milestones in its development but it cannot tell us how morally significant a particular milestone is. That is up to an our own sense of morality and the reasons behind our morality and that is part of what we are all debating here. \n \n The terms \"human\", \"human being\", and \"person\" still seem to be open to personal interpretation and it often seems to be a waste of time to debate whose definition of the term is more valid. I would think that a more critical question for debating abortion is what it is in that zygote, embryo, fetus, or even baby that we find so precious that we would want to protect it by law. \n \n What makes a newly fertilized egg precious?\n What makes a few month old fetus precious?\n What makes a third trimester fetus precious?\n What makes a one-day-from-birth fetus precious?\n What makes a baby precious?\n \n Science can help tell us about all of the characteristics of a fetus at a particular point of development, but only we can decide whether we find a particular characteristic precious enough to introduce a law banning abortion. I would personally like to see more discussion on the reasons we find certain developments important or not important.", 
   {}, 
   205967, 
   null, 
   1144435680.0
  ], 
  [
   206673, 
   null, 
   "Pejotif", 
   "Ah! At last a well argumented and well reasoned pro-choice post! I must say, Tasty, that this is a very interesting article, despite it being perhaps a little biased (particluarly when explaining the neurological view) and also seeming to take a few things out of context (like the poorly explained quotes of the Catholic thinkers).\n \n None the less, and despite the fact that this seems to be a primarily scientific arena (not my particular area of expertise), the defence of pro-life must say something here.\n \n I'll check back soon once I've done a bit of research.\n \n Again, excellent challenge, Tasty. emoticon_xhoho", 
   {}, 
   205661, 
   null, 
   1144808760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Science and where Life begins", 
  "url": "http://www.4forums.com/political/abortion-debates/7893-science-where-life-begins.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 7893, 
  "discussion_files": [
   [
    "19276.html", 
    "http://www.4forums.com/political/abortion-debates/7893-science-where-life-begins-print.html"
   ]
  ], 
  "identifier": 7893
 }
]