[
 [
  [
   205723, 
   null, 
   "guilty_assassin", 
   "This just happens to be my first\n post, thats right, im a n00b. But to the point; What do you belive is the\n definite moment when a person crosses the line and blurs the definiton\n of being human or machine? Such as a baby that developed in an artifical\n womb or even a man w/ a pacemaker. includes cybernetics and genetic enginering possiable bioincs i suppose.", 
   {
    "post_info": {
     "post_title": "Transhumanism views"
    }
   }, 
   null, 
   null, 
   1144294200.0
  ], 
  [
   205730, 
   null, 
   "JPSartre12", 
   "This just happens to be my first\n post, thats right, im a n00b. But to the point; What do you belive is the\n definite moment when a person crosses the line and blurs the definiton\n of being human or machine? Such as a baby that developed in an artifical\n womb or even a man w/ a pacemaker. includes cybernetics and genetic enginering possiable bioincs i suppose.\n\n \n Welcome nOOb. \n I believe that a person loses his humanity when he loses his soul.", 
   {}, 
   205723, 
   null, 
   1144301400.0
  ], 
  [
   205799, 
   null, 
   "Iuris", 
   "Biologically, when he loses genetic compatibility with the rest of humanity.\n \n But in this case? Never. If the pattern continuity is maintained, whatever the end result, the identity of the original remains. Were chips added to my brain, replacing functions of my brain, but never interrupting the central process, I would consider myself still myself even when no biological neuron remained. If my hands would be removed and replaced my nachine claws, and the process were continued until nothing but flesh remains, I would still consider myself as myself, provided the continuity is maintained. It might take some time, though.\n \n And yet, I would know that I am not the same as before. But why would that really matter? I know I am not the same as when I was a child of 7...", 
   {}, 
   205730, 
   null, 
   1144351320.0
  ], 
  [
   205847, 
   null, 
   "guilty_assassin", 
   "What do you think the effects of developing inside a artifical womb would\n do to the child; if there might me some sort of psychological effect on the\n baby, as the bond between a mother and child is one of the strongest, if\n lost emotions (the baby's) would happen as a result of growing inside the machine.\n I also think 2 seperate socitys would amerge, the cyborgs or the genetic\n perfects and the normals, the old race (this is US!)", 
   {}, 
   205799, 
   null, 
   1144368780.0
  ], 
  [
   205879, 
   null, 
   "Tastyfish", 
   "If its capable of passing a turing test, I'd say its a person. How squishy it is doesn't seem like its the sort of trait we should be using to me.\n The relationship between mother and baby isn't something magical, give a few hormones to both (and possibly a recording of the mothers voice for the baby) and there is unlikely to be any obvious differences, the relationship between adopted children and their parents isn't obvious in most cases, especially if they were adopted as a baby.\n \n As for two societies, you should really read a book called Acelerando by Charles Stross. Its just the thing you are thinking of really (but the problem isn't with cyborgs or trans-humans, its post humans who are the dangerous ones).", 
   {}, 
   205847, 
   null, 
   1144377180.0
  ], 
  [
   206146, 
   null, 
   "Ripskar", 
   "Find someone who was adopted and ask them what it's like having no link to their biological parents.\n Attempting to form a relationship with a piece of machinery might be a bit surreal but there are people who give their cars names etc.\n \n Genetically Modified Humans or enhanced people would be a worry, Next stop the Horus Heresy... \n However humans are evolving, albeit in an unnatural manner. It is rather difficult for mutant bloodlines to overcome humanity given that our environment is built by humans for humans.", 
   {}, 
   205879, 
   null, 
   1144536900.0
  ], 
  [
   206249, 
   null, 
   "Iuris", 
   "I take it then you'd rather face Genestealers and Bloodletters with nothing but the Imperial guard?", 
   {}, 
   206146, 
   null, 
   1144605660.0
  ], 
  [
   206251, 
   null, 
   "Ripskar", 
   "Sticks and stones may break my bones but lasguns will never hurt me!\n \n Humans are ambitious, producing a superior form *could* lead to them viewing themselves as a master race. Alternatively there's the GATTACA scenario, in either case we lose.\n \n Homo neanderthalensis disappeared shortly after Cro-Magnon arrived.\n Mind you, who needs non-humans to threaten us with extinction these days?", 
   {}, 
   206249, 
   null, 
   1144606620.0
  ], 
  [
   206300, 
   null, 
   "Iuris", 
   "See, there's the interesting bit: if we become different through a process that maintains a continuity, I see that as the ultimate victory and not loss.", 
   {}, 
   206251, 
   null, 
   1144618740.0
  ], 
  [
   206304, 
   null, 
   "Ripskar", 
   "It's a victory to become part of an underclass?", 
   {}, 
   206300, 
   null, 
   1144619280.0
  ], 
  [
   206311, 
   null, 
   "guilty_assassin", 
   "\n Even though it might be a victory, the laws of probilty have a turn in this\n and play a part. So, even though it is a machine/computer, there will always \n be mistakes withen inthe system. Some sort of flaw will occer and go unnoticed, resulting in an imperfect socity. Plus you can't manufacer \n emotions, so no conscience or moral as well perhaps?\n \n Just to put it simpley, regarding the machines, s*** happens, including\n machines.", 
   {}, 
   206304, 
   null, 
   1144620060.0
  ], 
  [
   206586, 
   null, 
   "Cheesejoff", 
   "Plus you can't manufacer \n emotions, so no conscience or moral as well perhaps?\n \n\n \n Emotions are not connected to consciousness, but that doesn't matter because machines aren't conscious anyway.\n \n Morals, well yes they could have morals although it's not connected to emotions. Of course the morals would simply be what were programmed into the machines, they would not decide on their own morals.", 
   {}, 
   206311, 
   null, 
   1144776960.0
  ], 
  [
   207446, 
   null, 
   "omega", 
   "The original question is an interesting one. I don't know but i believe there is no crossing over point from being human or not, except the moment of conception when the sperm meets the egg, and when a person dies. \n Though this is an interesting topic i fear it could lead to an isolation of one group that is as completely human as you or I, so i think it best that we should not dwell on these things.", 
   {}, 
   206586, 
   null, 
   1145137860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Transhumanism views", 
  "url": "http://www.4forums.com/political/science-math-debates/7898-transhumanism-views.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 7898, 
  "discussion_files": [
   [
    "18454.html", 
    "http://www.4forums.com/political/science-math-debates/7898-transhumanism-views-print.html"
   ]
  ], 
  "identifier": 7898
 }
]