[
 [
  [
   205772, 
   null, 
   "simone", 
   "http://peacetakescourage.cf.huffingtonpost.com/animations/wwjd.html", 
   {
    "post_info": {
     "post_title": "Jesus Loves Me"
    }
   }, 
   null, 
   null, 
   1144341900.0
  ], 
  [
   205773, 
   null, 
   "jyoshu", 
   "Well, you've truly sunk to new lows. As soon as I saw it was a shameless propaganda video I closed it. Better things to do.", 
   {}, 
   205772, 
   null, 
   1144342080.0
  ], 
  [
   205775, 
   null, 
   "simone", 
   "You know, Jyoshu, if I were the sort who prayed, I would feel that I would have to pray for the welfare of your soul.\n \n I am very concerned about your state of being as a human. You endorse the brutality of warfare, I take it. You love the idea of children being blown to bits.\n \n God help you. If there is truly a God, a caring God, your soul . . . . if you have one.", 
   {}, 
   205773, 
   null, 
   1144342620.0
  ], 
  [
   205776, 
   null, 
   "trebor", 
   "Well, you've truly sunk to new lows. As soon as I saw it was a shameless propaganda video I closed it. Better things to do.\n\n \n Well, the statement from G. W Bush is accurate. The pictures from Iraq is accurate. \n \n \n and I will point out Mathew 25:40\n \n \n \n\n 25:40 And the King shall answer and say unto them, Verily I say unto you, Inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me.\n \n\n \n \n Now, if you want to just call it propganda.. well, yes it is. However, it is false?\n \n Do you think that Jesus would approve of lies , and his name to justify the slaughter of innocents??", 
   {}, 
   205773, 
   null, 
   1144342800.0
  ], 
  [
   205822, 
   null, 
   "Easyrider", 
   "Well, the statement from G. W Bush is accurate. The pictures from Iraq is accurate. \n \n \n and I will point out Mathew 25:40\n \n \n \n Now, if you want to just call it propganda.. well, yes it is. However, it is false?\n \n Do you think that Jesus would approve of lies , and his name to justify the slaughter of innocents??\n\n \n What a select memory you have, Trebor. It wasn't too long ago that your buddy Saddam was lobbing missiles into Israel and killing innocent civilians.", 
   {}, 
   205776, 
   null, 
   1144363200.0
  ], 
  [
   205825, 
   null, 
   "trebor", 
   "What a select memory you have, Trebor. It wasn't too long ago that your buddy Saddam was lobbing missiles into Israel and killing innocent civilians.\n\n \n Hum.. lets see.\n \n How many civilians have been killed in Iraq?? 80,000, even more??\n \n Right. uh huh.\n \n All based the lies.. oh wait 'Misinformation' of bush.", 
   {}, 
   205822, 
   null, 
   1144363380.0
  ], 
  [
   205832, 
   null, 
   "Easyrider", 
   "Hum.. lets see.\n \n How many civilians have been killed in Iraq?? 80,000, even more??\n \n Right. uh huh.\n \n All based the lies.. oh wait 'Misinformation' of bush.\n\n \n All the terrorists and radical Islamists who blow up innocent civilians and murder our soldiers are now just \"innocent civilians\"? This is pathetic.", 
   {}, 
   205825, 
   null, 
   1144365000.0
  ], 
  [
   205835, 
   null, 
   "trebor", 
   "All the terrorists and radical Islamists who blow up innocent civilians and murder our soldiers are now just \"innocent civilians\"? This is pathetic.\n\n \n \n Yes, you are.\n \n Where are the weapons of mass destruction that Bush promised was there to promote the invasion of Iraq?", 
   {}, 
   205832, 
   null, 
   1144365300.0
  ], 
  [
   205839, 
   null, 
   "Easyrider", 
   "Yes, you are.\n \n Where are the weapons of mass destruction that Bush promised was there to promote the invasion of Iraq?\n\n \n Ask Slick Willie and your own party members.\n \n \"One way or the other, we are determined to deny Iraq the capacity to \n develop weapons of mass destruction and the missiles to deliver them. That \n is our bottom line.\" President Clinton, Feb. 4, 1998\n \n \"If Saddam rejects peace and we have to use force, our purpose is clear. We \n want to seriously diminish the threat posed by Iraq's weapons of mass \n destruction program.\" President Clinton, Feb. 17, 1998\n \n \"Iraq is a long way from USA, but what happens there matters a great deal \n here. For the risks that the leaders of a rogue state will use nuclear, \n chemical or biological weapons against us or our allies is the greatest \n security threat we face.\" Madeline Albright, Feb 18, 1998\n \n \"He will use those weapons of mass destruction again, as he has ten times \n since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998\n \n \"We urge you, after consulting with Congress, and consistent with the \n U.S.Constitution and Laws, to take necessary actions (including, if \n appropriate, air and missile strikes on suspect Iraqi sites), to respond \n effectively to the threat posed by Iraq's refusal to end its weapons of mass \n destruction programs.\" Letter to President Clinton, signed by senators Carl \n Levin, Tom Daschle, John Kerry, and others, Oct. 9, 1998\n \n \"Saddam Hussein has been engaged in the development of weapons of mass \n destruction technology which is a threat to countries in the region, and he \n has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, \n CA), Dec. 16, 1998\n \n \"Hussein has ... chosen to spend his money on building weapons of mass \n destruction and palaces for his cronies.\" Madeline Albright, Clinton \n Secretary of State, Nov. 10, 1999\n \n \"There is no doubt that ... Saddam Hussein has invigorated his weapons \n programs. Reports indicate that biological, chemical and nuclear programs \n continue apace and may be back to pre-Gulf War status. In addition, Saddam \n continues to redefine delivery systems, and is doubtless using the cover of \n an illicit missile program to develop longer-range missiles that will \n threaten the United States and our allies.\" Letter to President Bush, Signed \n by Sen. Bob Graham (D, FL,) and others, December 5, 2001\n \n \"We begin with the common belief that Saddam Hussein is a tyrant and a \n threat to the peace and stability of the region. He has ignored the mandate \n of the United Nations and is building weapons of mass destruction and the \n means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002\n \n \"We know that he has stored secret supplies of biological and chemical \n weapons throughout his country.\" Al Gore, Sept. 23, 2002\n \n \"Iraq's search for weapons of mass destruction has proven impossible to \n deter and we should assume that it will continue for as long as Saddam is in \n power.\" Al Gore, Sept. 23, 2002\n \n \"We have known for many years that Saddam Hussein is seeking and developing \n weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002 \"The \n last UN weapons inspectors left Iraq in October of 1998. We are confident \n that Saddam Hussein retains some stockpiles of chemical and biological \n weapons, and that he has since embarked on a crash course to build up his \n chemical and biological warfare capabilities. Intelligence reports indicate \n that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, \n 2002\n \n \"I will be voting to give the President of the United States the authority \n to use force -- if necessary -- to disarm Saddam Hussein because I believe \n that a deadly arsenal of weapons of mass destruction in his hands, is a real \n and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002\n \n \"There is unmistakable evidence that Saddam Hussein is working aggressively \n to develop nuclear weapons and will likely have nuclear weapons within the \n next five years ..... We also should remember we have always underestimated \n the progress Saddam has made in development of weapons of mass destruction.\" \n Sen. Jay Rockefeller (D, WV), Oct. 10, 2002\n \n \"He has systematically violated, over the course of the past 11 years, every \n significant UN resolution that has demanded that he disarm and destroy his \n chemical and biological weapons, and any nuclear capacity. This he has \n refused to do.\" Rep. Henry Waxman (D, CA), Oct. 10, 2002\n \n \"In the four years since the inspectors left, intelligence reports show that \n Saddam Hussein has worked to rebuild his chemical and biological weapons \n stock, his missile delivery capability and his nuclear program. He has also \n given aid, comfort, and sanctuary to terrorists, including al Qaeda members. \n It is clear, however, that if left unchecked, Saddam Hussein will continue \n to increase his capacity to wage biological and chemical warfare, and will \n keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct. \n 10, 2002\n \n \"We are in possession of what I think to be compelling evidence that Saddam \n Hussein has, and has had for a number of years, a developing capacity for \n the production and storage of weapons of mass destruction.\" Sen. Bob Graham \n (D, FL), Dec. 8, 2002\n \n \"Without question, we need to disarm Saddam Hussein. He is a brutal, \n murderous dictator, leading an oppressive regime. He presents a particularly \n grievous threat because he is so consistently prone to miscalculation ... \n And now he is miscalculating America's response to his continued deceit and \n his consistent grasp for weapons of mass destruction. So the threat of \n Saddam Hussein with weapons of mass destruction is real .....\" Sen. John F. \n Kerry (D, MA), Jan.23.2003", 
   {}, 
   205835, 
   null, 
   1144365600.0
  ], 
  [
   205844, 
   null, 
   "trebor", 
   "Ask Slick Willie and your own party members.\n \n <sniped out of context quotes\n \n \n\n \n \n The context of all those quotes can be found here, showing the lies and desperation of the Neocons\n \n http://www.snopes.com/politics/war/wmdquotes.asp", 
   {}, 
   205839, 
   null, 
   1144366200.0
  ], 
  [
   205845, 
   null, 
   "Easyrider", 
   "The context of all those quotes can be found here, showing the lies and desperation of the Neocons\n \n http://www.snopes.com/politics/war/wmdquotes.asp\n\n \n Most real Israelites don't think like you do, Trebor. They know Saddam is a murdering thug, as are his radical Islamic buddies. Fact is, Israel bombed Iraq's nuclear reactor before he could build the bomb. Fact is Saddam gave terrorist bombers who blew up innocent Israeli's $25,000 rewards. \n \n Why do you place your own Jewish people in harm's way by siding with Saddam and his murdering, terrorist radicals?", 
   {}, 
   205844, 
   null, 
   1144366800.0
  ], 
  [
   205851, 
   null, 
   "Inyx", 
   "And Americans aren't radical? Oh yeah, I forgot, the claim is that they are only waging a war against terrorism.", 
   {}, 
   205845, 
   null, 
   1144370520.0
  ], 
  [
   205926, 
   null, 
   "Jo Bennett", 
   "Israel is a xenophobic, right wing, militarist state. It's hardly surprising that their solution to everything involves bombing, just like the US.", 
   {}, 
   205851, 
   null, 
   1144414080.0
  ], 
  [
   205943, 
   null, 
   "simone", 
   "What a select memory you have, Trebor. It wasn't too long ago that your buddy Saddam was lobbing missiles into Israel and killing innocent civilians.\nEZ, my memory needs a jumpstart. \n \n Have you got some documentation on this Iraqi missiles into Israel, when this occurred, how many missiles made it over there, the number of casualties?\n \n Thanks.", 
   {}, 
   205822, 
   null, 
   1144422720.0
  ], 
  [
   205950, 
   null, 
   "trebor", 
   "EZ, my memory needs a jumpstart. \n \n Have you got some documentation on this Iraqi missiles into Israel, when this occurred, how many missiles made it over there, the number of casualties?\n \n Thanks.\n\n \n \n 1991.. there were 88 scud missile attacks, that killed a total of 31 people. Of those 88 scud missile attacks, 38 were directed at Israel. There were 2 causalties by scud missile attacks in Israel.", 
   {}, 
   205943, 
   null, 
   1144425900.0
  ], 
  [
   206042, 
   null, 
   "DamEtel", 
   "All based the lies.. oh wait 'Misinformation' of bush.\n\n \n Speaking of old Bushie poo...\n \n I watch the Daily Show with John Stewart, and in one clip I saw Bush put on the spot but never saw how it turned out. Bush was at one of his normal staged appearances where he answers \"grueling\" questions from the audience. One troublesome question was actually able to be asked: something along the lines of, \"Do you see the events in the Middle East as signs of the Biblical Apocalypse?\" Bush was speachless for several seconds and the look on his face was one of confusion (as John Stewart said, Bush looked like he was trying to figure out if he should answer \"Yes\" in order to not offend his Christian base, or answer \"No\" in order to seem sane). I wanted to hear his answer, but they left it off with the jokes. Anyone know how he actually answered?", 
   {}, 
   205825, 
   null, 
   1144479000.0
  ], 
  [
   206059, 
   null, 
   "Easyrider", 
   "Speaking of old Bushie poo...\n \n I watch the Daily Show with John Stewart, and in one clip I saw Bush put on the spot but never saw how it turned out. Bush was at one of his normal staged appearances where he answers \"grueling\" questions from the audience. One troublesome question was actually able to be asked: something along the lines of, \"Do you see the events in the Middle East as signs of the Biblical Apocalypse?\" Bush was speachless for several seconds and the look on his face was one of confusion (as John Stewart said, Bush looked like he was trying to figure out if he should answer \"Yes\" in order to not offend his Christian base, or answer \"No\" in order to seem sane). I wanted to hear his answer, but they left it off with the jokes. Anyone know how he actually answered?\n\n \n No, but I recall when that charlatan Howard Dean was trying to play the spiritual type to get votes and he was asked what his favorite New Testament book was, and he replied the Book of Job (Old Testament). \n \n Or how about Hillary saying Jesus wouldn't approve of the Republican version of the Immigration Bill, but never speaks of Jesus when it comes to her approval of partial-birth abortion, gay sex, etc. LOL!", 
   {}, 
   206042, 
   null, 
   1144506960.0
  ], 
  [
   206072, 
   null, 
   "simone", 
   "1991.. there were 88 scud missile attacks, that killed a total of 31 people. Of those 88 scud missile attacks, 38 were directed at Israel. There were 2 causalties by scud missile attacks in Israel.\nThank you, trebor. Was this after the start of the first Gulf War?", 
   {}, 
   205950, 
   null, 
   1144510020.0
  ], 
  [
   206074, 
   null, 
   "Easyrider", 
   "Was this after the start of the first Gulf War?\n\n \n Yes, after Saddam invaded Kuwait.", 
   {}, 
   206072, 
   null, 
   1144510560.0
  ], 
  [
   206078, 
   null, 
   "Matthew S", 
   "Well, you've truly sunk to new lows. As soon as I saw it was a shameless propaganda video I closed it. Better things to do.\n\n \n The truth hurts doesn't it?", 
   {}, 
   205773, 
   null, 
   1144511160.0
  ], 
  [
   206444, 
   null, 
   "ArchaicGuy", 
   "Well, you've truly sunk to new lows. As soon as I saw it was a shameless propaganda video I closed it. Better things to do.\n\n I agree with you Jyoshu. It is the most disgusting propaganda from a Saddam apologist I have seen! Where is the proof in the photos of the injured children that US Troops and their allies caused their injuries? Muslim insurgents fighting against US,Allied and Iraqi troops most likely caused the injuries to those children! Showing photos of injured children along with quotes by President Bush and blaming US armed forces for the childrens injuries is not showing conclusive proof!", 
   {}, 
   205773, 
   null, 
   1144699020.0
  ], 
  [
   206487, 
   null, 
   "Easyrider", 
   "I agree with you Jyoshu. It is the most disgusting propaganda from a Saddam apologist I have seen! Where is the proof in the photos of the injured children that US Troops and their allies caused their injuries? Muslim insurgents fighting against US,Allied and Iraqi troops most likely caused the injuries to those children! Showing photos of injured children along with quotes by President Bush and blaming US armed forces for the childrens injuries is not showing conclusive proof!\n\n \n Indeed! That disgusting propaganda from a Saddam apologist is typical of the Michael Moore Kook Aid drinkers. And while there have been collateral deaths and injuries from all Allied wars, the truth is the terrorists specifically target innocent men, women and children (i.e. 9/11, etc.).", 
   {}, 
   206444, 
   null, 
   1144714620.0
  ], 
  [
   206493, 
   null, 
   "Matthew S", 
   "Indeed! That disgusting propaganda from a Saddam apologist is typical of the Michael Moore Kook Aid drinkers. And while there have been collateral deaths and injuries from all Allied wars, the truth is the terrorists specifically target innocent men, women and children (i.e. 9/11, etc.).\n\n \n \n So what you are saying is those poor Iraqi children have to suffer because some terrorist from Saudi Arabia, that they didn't know, flew a plane into a building. Are you saying that Jesus would approve of dropping bombs on innocent children? Did you watch the end? We are not talking about terrorists tageting the innocent.This specific thread and website linked deals with innocent children killed and hurt from bombs and military action taken in the name of the people of the United States. Bombs payed for by taxes payed by United States citizens. So if someone supports Bush and this travisty of a war they are complicit in the hurting of those children. Where is your christian compassion? After all a true christian would be against the bombing of innocent children. Are you the true christian you claim to be?", 
   {}, 
   206487, 
   null, 
   1144716420.0
  ], 
  [
   206495, 
   null, 
   "Easyrider", 
   " This specific thread and website linked deals with innocent children killed and hurt from bombs and military action taken in the name of the people of the United States. Bombs payed for by taxes payed by United States citizens.\n\n \n That's not proven by what you've presented. But you must be a real novice to warfare not to understand that collateral civilian deaths have occurred in virtually all wars. But to argue that THAT'S THE POLICY OF THIS GOVERNMENT is what places you in Michael Moore Kool Aid country. \n \n \n So if someone supports Bush and this travisty of a war they are complicit in the hurting of those children. Where is your christian compassion? After all a true christian would be against the bombing of innocent children. Are you the true christian you claim to be?\n\n \n My Christian compassion is in liberating 55 million people who were under Saddam's and the Taliban's murderous regimes. Where were you when Saddam was gassing his own people; when he lobbed missiles laden with explosives into Israel killing innocent civilians; and when the Taliban executed it's own people for all kinds of minor offenses? You have zero objective sensibilities when it comes to dealing with the real murderers and oppressors.", 
   {}, 
   206493, 
   null, 
   1144717020.0
  ], 
  [
   206499, 
   null, 
   "Matthew S", 
   "\n My Christian compassion is in liberating 55 million people who were under Saddam's and the Taliban's murderous regimes. Where were you when Saddam was gassing his own people; when he lobbed missiles laden with explosives into Israel killing innocent civilians; and when the Taliban executed it's own people for all kinds of minor offenses? You have zero objective sensibilities when it comes to dealing with the real murderers and oppressors.\n\n Once again point missed this thread or the link listed has nothing to do with anything that you stated it has everything to do with the actions carried out in the name of the people of the United States. Of course the things you listed are bad but also none of my business. My busisness is solely with the actions of the United States government and military carried out in my name as one of the people of the United States.", 
   {}, 
   206495, 
   null, 
   1144717320.0
  ], 
  [
   206580, 
   null, 
   "simone", 
   "Furthermore, it was the United States who installed murderous thug Saddam Hussein in the first place, while fully aware that he was a murderous thug.", 
   {}, 
   206499, 
   null, 
   1144774500.0
  ], 
  [
   206596, 
   null, 
   "ArchaicGuy", 
   "So what you are saying is those poor Iraqi children have to suffer because some terrorist from Saudi Arabia, that they didn't know, flew a plane into a building. Are you saying that Jesus would approve of dropping bombs on innocent children? Did you watch the end? We are not talking about terrorists tageting the innocent.This specific thread and website linked deals with innocent children killed and hurt from bombs and military action taken in the name of the people of the United States. Bombs payed for by taxes payed by United States citizens. So if someone supports Bush and this travisty of a war they are complicit in the hurting of those children. Where is your christian compassion? After all a true christian would be against the bombing of innocent children. Are you the true christian you claim to be?\n Yeshua (Jesus) would not approve of bombs being dropped on innocent children. However, he would ask to see conclusive proof that US and Allied troops or militant insurgent's weapons were the cause of the children's wounds. The website claims the US was responsible yet failed to show conclusive evidence for their claim!", 
   {}, 
   206493, 
   null, 
   1144781700.0
  ], 
  [
   206624, 
   null, 
   "Easyrider", 
   "Furthermore, it was the United States who installed murderous thug Saddam Hussein in the first place, while fully aware that he was a murderous thug.\n\n \n I don't recall that we \"installed\" him. Got an article on that specifically? You need to remember he was fighting against Iran who had kidnapped our hostages, and if he wasn't armed properly Iran and it's radicals might well have taken over Iraq. \n \n We also were allies with Joseph Stalin in WWII, but that doesn't mean we approved of a lot of his crimes against his own people. The idea was to try to get rid of, or limit the influence of, regimes that were more threatening to us AT THE TIME. \n \n Iran is now claiming to have enriched uranium, and has promised to wipe Israel off the face of the earth. What do you and Matthew suggest we do with that situation?", 
   {}, 
   206580, 
   null, 
   1144795140.0
  ], 
  [
   206653, 
   null, 
   "Master_Shake", 
   "ez and jyoshu as usual are either missing or, more likely, completely ignoring the point. The point is innocent children are dying for our lies and would Jesus be okay with this. I think the answer is obvious.", 
   {}, 
   206624, 
   null, 
   1144804560.0
  ], 
  [
   206658, 
   null, 
   "jyoshu", 
   "ez and jyoshu as usual are either missing or, more likely, completely ignoring the point. The point is innocent children are dying for our lies and would Jesus be okay with this. I think the answer is obvious.\n\n \n No, I don't think that's the point at all. I think the point is that this was another case of a shameless propaganda piece, and a very manipulative one at that. Yes, war always has the unfortunate problem of innocent people sometimes being hurt and killed. That fact alone doesn't determine whether the war is right or not. I'm not going to let emotion-inducing propaganda determine my views--I'll take evidence and facts, thank you. (neither of which the video had much of.)", 
   {}, 
   206653, 
   null, 
   1144805100.0
  ], 
  [
   206664, 
   null, 
   "Master_Shake", 
   "Yes, war always has the unfortunate problem of innocent people sometimes being hurt and killed.\n\n Sometimes? How about 35,000? And that is a very conservative estimate.", 
   {}, 
   206658, 
   null, 
   1144805760.0
  ], 
  [
   206665, 
   null, 
   "Easyrider", 
   "Sometimes? How about 35,000? And that is a very conservative estimate.\n\n \n Is that how many babies starved under Saddam's bogus \"oil for food\" program when we tried to help? When he was using the money to build elaborate palaces for himself? Or is that the number of innocent civilians the radical terrorists have maimed and killed so far?", 
   {}, 
   206664, 
   null, 
   1144805880.0
  ], 
  [
   206675, 
   null, 
   "Master_Shake", 
   "Is that how many babies starved under Saddam's bogus \"oil for food\" program when we tried to help? When he was using the money to build elaborate palaces for himself? Or is that the number of innocent civilians the radical terrorists have maimed and killed so far?\n\n There you go avoiding the point again. Did I ever say I approved of Saddam? Make an intelligent response to something and you'll start geting them back from people.", 
   {}, 
   206665, 
   null, 
   1144809540.0
  ], 
  [
   206680, 
   null, 
   "Easyrider", 
   "There you go avoiding the point again. Did I ever say I approved of Saddam? Make an intelligent response to something and you'll start geting them back from people.\n\n \n The point you miss is that someone has to take a stand against evil, as opposed to the left's often windjamming appeasement of it.", 
   {}, 
   206675, 
   null, 
   1144810560.0
  ], 
  [
   206691, 
   null, 
   "Matthew S", 
   "The point you miss is that someone has to take a stand against evil, as opposed to the left's often windjamming appeasement of it.\n\n \n \n Evil is a subjective subject. For instance I view the religious persecution of gay people as evil. I consider the muder of the innocents in Iraq evil. I consider George W Bush as evil for his muder of american troops and the innocents in Iraq.", 
   {}, 
   206680, 
   null, 
   1144812120.0
  ], 
  [
   206692, 
   null, 
   "Master_Shake", 
   "The point you miss is that someone has to take a stand against evil, as opposed to the left's often windjamming appeasement of it.\n\n I understood your misdirected point.\n That still doesn't make killing children acceptable.", 
   {}, 
   206680, 
   null, 
   1144812660.0
  ], 
  [
   206698, 
   null, 
   "Easyrider", 
   "I understood your misdirected point.\n That still doesn't make killing children acceptable.\n\n \n We don't target women and children like the terrorists do. Biet?", 
   {}, 
   206692, 
   null, 
   1144815180.0
  ], 
  [
   206702, 
   null, 
   "Master_Shake", 
   "We don't target women and children like the terrorists do.\n\n Maybe not, but a dead child is a dead child. Period.\n \nBiet?\n\n ??", 
   {}, 
   206698, 
   null, 
   1144815780.0
  ], 
  [
   206704, 
   null, 
   "Easyrider", 
   "Maybe not, \n \n ??\n\n \n What do you mean MAYBE NOT? Are you unsure of that after 9/11 and all the terrorist bombings??", 
   {}, 
   206702, 
   null, 
   1144816080.0
  ], 
  [
   206706, 
   null, 
   "Master_Shake", 
   "What do you mean MAYBE NOT? Are you unsure of that after 9/11 and all the terrorist bombings??\n\n You misunderstood. I meant, maybe we don't, I know they do.", 
   {}, 
   206704, 
   null, 
   1144816620.0
  ], 
  [
   206712, 
   null, 
   "MTKnight", 
   "Well, I don't think Jesus would condone a war. In fact when christianity first started we were all pacifists. However, as time goes on war is sometimes neccessary. I don't think everyone would have liked it if we never went into World War II. emoticon_xkill \n \n However, as to the question of Iraq, I do believe we were in the right to head in and take control. Everyone says civillians and other innocents have died. Well, it is war isn't it? \n \n I'm just recently going to college but in my last year of High School a ranger came to our classroom to discuss the war. He said that a new tactic terriost are using is shooting at US troops and running into large crowds and than shooting some more. So some of those innocent deaths were the result of these strategies being used against us.\n \n War is ugly, people but sometimes it is neccessary. :(", 
   {}, 
   206706, 
   null, 
   1144819200.0
  ], 
  [
   206722, 
   null, 
   "Jo Bennett", 
   "Ends justify the means, eh? What happened to \"love your enemies, do good to those who hate you\". How is it that self-proclaimed Christians can expend seemingly endless energies attacking gay people, and yet support something like this which is so obviously in conflict with Christ's teaching?", 
   {}, 
   206712, 
   null, 
   1144837320.0
  ], 
  [
   206730, 
   null, 
   "jyoshu", 
   "Well, I don't think Jesus would condone a war. In fact when christianity first started we were all pacifists. However, as time goes on war is sometimes neccessary. I don't think everyone would have liked it if we never went into World War II. emoticon_xkill\n \n However, as to the question of Iraq, I do believe we were in the right to head in and take control. Everyone says civillians and other innocents have died. Well, it is war isn't it? \n\n \n It's also important to note two things about this thing the anti-war people always bring up about civilian casualties in Iraq . . .\n \n - They don't really how many or how few. Have you noticed that every time a figure gets thrown out there it's a different one? (Sometimes more, sometimes less.) A lot of them are using figures floated by anti-Bush orgs like moveon.org and so forth. In reality it may be a lot less.\n \n - A lot of those civilians (the adults) are really insurgents. When a whole town (like Fallujah) is basically an insurgency, they aren't innocent civilians anymore. Now, the children are, but when parents who are firing at US soldiers in the streets have their kids in the room with them, what do you think is going to happen? A lot of these kids might as well have been being used as human shields. The important point to remember is that US soldiers aren't out to kill ANY civilians--esp. children. They aren't shooting at little kids. People who make propaganda videos like this one intentionally take the absolute WORST unfortunate images of accidents and try to make it look like its far more widespread than it is. \n \n This all-or-nothing approach that war is always bad and can never be the right thing if a child happens to get hit is ultimately bowing to emotionalism. NO one likes to see kids get hurt or killed, but that doesn't mean war isn't sometimes necessary. Thinking so means that the propaganda here has worked.", 
   {}, 
   206712, 
   null, 
   1144851000.0
  ], 
  [
   206737, 
   null, 
   "Matthew S", 
   ".\n \n - They don't really how many or how few. Have you noticed that every time a figure gets thrown out there it's a different one? (Sometimes more, sometimes less.) A lot of them are using figures floated by anti-Bush orgs like moveon.org and so forth. In reality it may be a lot less.\n\n \n 1 innocent victim is 1 too many. Where is this great anti abortion sentament when it comes to Iraq. It makes no sense to strongly appose abortion while fulling supporting the killing of the children of Iraq. Before you start in on me let me repost my belief. I am anti-abortion but that does not give me the right to stop a women from making a choice about her body. In Iraq it is a different story they are, or were, bombing innocent children killing or maming them. This action was carried out in my name as one of the american people. I have every right to protest people who reperesent me. People who represent me are my busisness.\n \n \n \n\n This all-or-nothing approach that war is always bad and can never be the right thing if a child happens to get hit is ultimately bowing to emotionalism. NO one likes to see kids get hurt or killed, but that doesn't mean war isn't sometimes necessary. Thinking so means that the propaganda here has worked.\n\n \n \n I think you would feel different if it was the Iraqi air force dropping bombs on your hometown and killing your children", 
   {}, 
   206730, 
   null, 
   1144853520.0
  ], 
  [
   206766, 
   null, 
   "simone", 
   "I happen not to be anti-war. I happen not to be a pacifist.\n \n I am opposed to stupid wars brought about by stupid people who do not understand the nature of international diplomacy, who do not understand how to conduct warfare, who stomp on the Geneva Conventions--who even have the effrontery to spit upon the Constitution of the United States, who gleefully flush that Constitution down the toilet by overriding the Congress of the United States of America and unilaterally declaring war as if one were the king and the sole agent of government.\n \n I am opposed to a monarchy in the United States of America.", 
   {}, 
   206737, 
   null, 
   1144862580.0
  ], 
  [
   206778, 
   null, 
   "trebor", 
   "Thank you, trebor. Was this after the start of the first Gulf War?\n\n \n Yes, it was. It was a desperate (and unsuccessful) attempt on Iraq to break up the group of countries going against him.\n \n Alll in all, it was highly unsuccessful. The Scuds had to be modified to get the proper distance, and that made them very inaccurate.", 
   {}, 
   206072, 
   null, 
   1144864920.0
  ], 
  [
   206839, 
   null, 
   "Easyrider", 
   "1 innocent victim is 1 too many. \n\n \n I guess according to that we should have left Hitler alone too?", 
   {}, 
   206737, 
   null, 
   1144882800.0
  ], 
  [
   206841, 
   null, 
   "Matthew S", 
   "I guess according to that we should have left Hitler alone too?\n\n From a gay perspective why did we bother with Hitler? The Allies locked up in prison all the Gay pinktriangle wearing consentration camp victims. So if you were a gay german in prison would you see a difference? True the allies were not killing and doing medical experiments on the gays but prison is still prison.", 
   {}, 
   206839, 
   null, 
   1144883760.0
  ], 
  [
   206842, 
   null, 
   "Jo Bennett", 
   "I guess according to that we should have left Hitler alone too?\n\n \n What would Jesus have done? I'm pretty sure it wouldn't have involved raising an army and marching on Berlin.", 
   {}, 
   206839, 
   null, 
   1144884120.0
  ], 
  [
   206849, 
   null, 
   "Easyrider", 
   "What would Jesus have done? I'm pretty sure it wouldn't have involved raising an army and marching on Berlin.\n\n \n Oh come on, Jo.\n \n In the Old Testament God (who is Christ) tells Israel to go to war against Amalek; tells Saul to go in there and destroy the Amalekites because they were a blight on humanity. God told the children of Israel to go into the land and destroy the Canaanites. The Canaanites used to bury a living baby in a jar in a wall when they built a house or a building as a offering to the gods. Their sins rose to a level that intervention by man (directed by God) was inevitable (note Genesis 15:16 - when the sins of the Amorites reaches its full measure).\n \n C.S. Lewis said that to love your enemy doesn't mean that you never hold him accountable for his deeds. The risk of strict pacifism is that evil goes unpunished and the innocent are left vulnerable for further attacks. Love does not allow one's family to be slaughtered, and true peace will not arrive until Jesus does again.\n \n In the gospel of Luke, Chapter 14 and Verse 31, Jesus said, When a king goes to war, he is careful to count the cost knowing he has 10,000 soldiers and he's going to go against 20,000 so that he doesn't get in a battle he might lose. He also said, \"He who has no sword let him sell his garment and buy one,\" He knew there would be hostility after his ascension. He knew there would be persecution and he knew that could go to a level of some one endeavoring to take their lives. And so he told them, get a sword because you may have to protect yourself. \n \n Furthermore, since Jesus is God, and God / Christ inspires all Scripture (2 Timothy 3:16), then Jesus also inspired Romans 13, which basically says the government exists primarily to punish evildoers (and protect innocent people). The Bible says it does not bear the sword of punishment in vain. So then the sword has a legitimate purpose in the New Testament.\n \n And, in the Book of Revelation, Christ annihilates the wicked with his Judgments, so that others can live in peace. Based upon this and other arguments. I think your interpretation that Jesus is a strict pacifist does not hold true when the totality of Scripture is examined.", 
   {
    "unicode_changes_made": true
   }, 
   206842, 
   null, 
   1144887480.0
  ], 
  [
   206850, 
   null, 
   "MTKnight", 
   "Boy this is a messed up post. I've already stated what Jesus would have done. However, there has been war in the Bible. There's even a certain guidlines to follow when declaring war. I also recall the Pope asking President Bush not to go to war. However, we did go to war and now were in Iraq. Pratically every soldier who has done a tour in Iraq says that they believe that we were right to go into the country. Many of the people in Iraq are happy that Sadamn is gone. I'm sorry that sometimes innocent people have to die, but that is life. I even remember a report about a car that was loaded with an Iraqi family came barrelling down the road. They told them to stop in their language and than fired a warning shot at the car. Finally they had no choice but to fire directly at the vehicle. Now the soldier who pulled the trigger is helping what remains of the family pull themselves out of these difficult times. However, this is what happens in war and as far as I'm concerned I would have pulled the trigger too. If they hadn't and that car had been filled with explosives many soldiers would have died.\n \n I know that those of you who are against the war are saying there are too many innoncents dying, but as far as what I'm thinking its kinda foolish that you only speak of Iraqi innocents instead of some of the American innocents dying.", 
   {}, 
   206842, 
   null, 
   1144887540.0
  ], 
  [
   206851, 
   null, 
   "Easyrider", 
   "From a gay perspective why did we bother with Hitler? The Allies locked up in prison all the Gay pinktriangle wearing consentration camp victims. So if you were a gay german in prison would you see a difference? True the allies were not killing and doing medical experiments on the gays but prison is still prison.\n\n \n So we leave Hitler alone so he can persecute and kill more gays and others?\n \n There are some compelling arguments that Hitler himself dabbled in homosexual sin, so maybe he was okay in your eyes anyway?", 
   {}, 
   206841, 
   null, 
   1144887600.0
  ], 
  [
   206852, 
   null, 
   "MTKnight", 
   "What would Jesus have done? I'm pretty sure it wouldn't have involved raising an army and marching on Berlin.\n\n \n No Jesus would have used his abilities being the Son of God to stop the war. We aren't as lucky, we went in. Thats that. emoticon_xgood", 
   {}, 
   206842, 
   null, 
   1144887780.0
  ], 
  [
   206853, 
   null, 
   "Easyrider", 
   "Boy this is a messed up post. I've already stated what Jesus would have done. However, there has been war in the Bible. There's even a certain guidlines to follow when declaring war. I also recall the Pope asking President Bush not to go to war. However, we did go to war and now were in Iraq. Pratically every soldier who has done a tour in Iraq says that they believe that we were right to go into the country. Many of the people in Iraq are happy that Sadamn is gone. I'm sorry that sometimes innocent people have to die, but that is life. I even remember a report about a car that was loaded with an Iraqi family came barrelling down the road. They told them to stop in their language and than fired a warning shot at the car. Finally they had no choice but to fire directly at the vehicle. Now the soldier who pulled the trigger is helping what remains of the family pull themselves out of these difficult times. However, this is what happens in war and as far as I'm concerned I would have pulled the trigger too. If they hadn't and that car had been filled with explosives many soldiers would have died.\n \n I know that those of you who are against the war are saying there are too many innoncents dying, but as far as what I'm thinking its kinda foolish that you only speak of Iraqi innocents instead of some of the American innocents dying.\n\n \n Amen to that. A common theme amongst many in the radical left is that America is always the bad guy, and the evil empire. I've said it a hundred times - that element has no idea how to deal with evil and evil regimes.\n \n Now, Iran, who has threatened to destroy Israel and who most nations feel is developing nuclear weapons. What do Jo Bennett and Matthew S propose we do about them? Remember Hitler and the Jews, so Israel has to take these turkeys seriously.", 
   {}, 
   206850, 
   null, 
   1144887900.0
  ], 
  [
   206855, 
   null, 
   "MTKnight", 
   "From a gay perspective why did we bother with Hitler? The Allies locked up in prison all the Gay pinktriangle wearing consentration camp victims. So if you were a gay german in prison would you see a difference? True the allies were not killing and doing medical experiments on the gays but prison is still prison.\n\n \n That makes no sense...so from a gay perspective we should have just went after Japan? Left Hitler alone and allowed more dictatorships to rise? From what I remember of history we declared war on Japan for the bombing of Pearl Harbor, Hitler declared war on us a few days afterwards and we agreed to take care of him first cause he was a bigger threat.", 
   {}, 
   206841, 
   null, 
   1144888080.0
  ], 
  [
   206858, 
   null, 
   "Jo Bennett", 
   "Jesus didn't use his power to end the Roman occupation of Israel, as many at the time expected the Messiah to do. If Christ had come to earth in (say) France and began his ministry in 1941, do you think he would have been marching with the resistance, rallying troops to smash the Nazi war machine? That doesn't match the Jesus we see in the Gospels. He would undoubtedly have preached against the Vichy government, condemned the deportation of Jews, and he would have gone to his death at the hands of the Nazis with the collusion of the Vichy government. The way of Christ is the way of Gandhi, of Martin Luther King Jr. Not for nothing is Christ also called the \"prince of peace\".\n \n Too many Christians submit to the wisdom of the world, the logic of self-defence and retaliation, when Christ's actions and words do not match this.", 
   {}, 
   206852, 
   null, 
   1144888440.0
  ], 
  [
   206859, 
   null, 
   "Easyrider", 
   "Jesus didn't use his power to end the Roman occupation of Israel, as many at the time expected the Messiah to do. If Christ had come to earth in (say) France and began his ministry in 1941, do you think he would have been marching with the resistance, rallying troops to smash the Nazi war machine? That doesn't match the Jesus we see in the Gospels. He would undoubtedly have preached against the Vichy government, condemned the deportation of Jews, and he would have gone to his death at the hands of the Nazis with the collusion of the Vichy government. The way of Christ is the way of Gandhi, of Martin Luther King Jr. Not for nothing is Christ also called the \"prince of peace\".\n \n Too many Christians submit to the wisdom of the world, the logic of self-defence and retaliation, when Christ's actions and words do not match this.\n\n \n I refer you back to what I previously posted. \n \n A serious question for you, though: Is Jesus God or not, as the Gospels and Epistles say?", 
   {}, 
   206858, 
   null, 
   1144888740.0
  ], 
  [
   206863, 
   null, 
   "MTKnight", 
   "Jesus didn't use his power to end the Roman occupation of Israel, as many at the time expected the Messiah to do. If Christ had come to earth in (say) France and began his ministry in 1941, do you think he would have been marching with the resistance, rallying troops to smash the Nazi war machine? That doesn't match the Jesus we see in the Gospels. He would undoubtedly have preached against the Vichy government, condemned the deportation of Jews, and he would have gone to his death at the hands of the Nazis with the collusion of the Vichy government. The way of Christ is the way of Gandhi, of Martin Luther King Jr. Not for nothing is Christ also called the \"prince of peace\".\n \n Too many Christians submit to the wisdom of the world, the logic of self-defence and retaliation, when Christ's actions and words do not match this.\n\n \n As I've said before Jesus would not condone war. :P Look at past posts a bit more. emoticon_xgood", 
   {}, 
   206858, 
   null, 
   1144891980.0
  ], 
  [
   206864, 
   null, 
   "Matthew S", 
   "That makes no sense...so from a gay perspective we should have just went after Japan? Left Hitler alone and allowed more dictatorships to rise? From what I remember of history we declared war on Japan for the bombing of Pearl Harbor, Hitler declared war on us a few days afterwards and we agreed to take care of him first cause he was a bigger threat.\n\n \n \n That wasn't EZ's point he always has a conservative religious agenda. You are correct about history. We left Hitler alone until he butted into our business. If declared war upon there we do have the right to fight back. To all you religious conservtives, this is not diected at you MTKnight, You have declared war against gay people we intend to fight back.", 
   {}, 
   206855, 
   null, 
   1144892400.0
  ], 
  [
   206865, 
   null, 
   "Easyrider", 
   "To all you religious conservtives, this is not diected at you MTKnight, You have declared war against gay people we intend to fight back.\n\n \n Well, go get your squirt guns ready then, Matthew, if that's what you think. LOL!", 
   {}, 
   206864, 
   null, 
   1144892700.0
  ], 
  [
   206901, 
   null, 
   "Jo Bennett", 
   "I refer you back to what I previously posted. \n \n A serious question for you, though: Is Jesus God or not, as the Gospels and Epistles say?\n\n \n Yes, he is. However, there is a difference in the recorded actions of God in the Old Testament and Christ in the New Testament that can only lead to the conclusion that at several times in the Old Testament, the Israelites used God as an excuse for wars with their neighbours, and even if they did not, there is a massive difference between undertaking war on a clear command from God, and inferring the righteousness of a war pursued on your own account without such a command. For every possible reason for going to war, there are statements from the Bible that contradict it, be it vengeance \"vengeance is mine says the LORD\" and \"render to no-one evil for evil\", or self-defence: \"if a man strikes you on the right cheek, offer him the left\", or acquisition of resources: \"do not covet thy neighbours...\" or \"do not store up treasures for yourself on earth\".\n \n As you well know, the passage in timothy regarding scripture was written before the new testament was considered scripture, so to use it to support the use of Romans is dubious in the extreme. I should also point out that the Nazis were a government, just as much as the UK and US governments were. If one was a German at that time, does one have a duty to obey that government? That's what Romans 13 would suggest.", 
   {}, 
   206859, 
   null, 
   1144923780.0
  ], 
  [
   206915, 
   null, 
   "trebor", 
   "Yes, he is. However, there is a difference in the recorded actions of God in the Old Testament and Christ in the New Testament that can only lead to the conclusion that at several times in the Old Testament, the Israelites used God as an excuse for wars with their neighbours, and even if they did not, there is a massive difference between undertaking war on a clear command from God, and inferring the righteousness of a war pursued on your own account without such a command. For every possible reason for going to war, there are statements from the Bible that contradict it, be it vengeance \"vengeance is mine says the LORD\" and \"render to no-one evil for evil\", or self-defence: \"if a man strikes you on the right cheek, offer him the left\", or acquisition of resources: \"do not covet thy neighbours...\" or \"do not store up treasures for yourself on earth\".\n \n As you well know, the passage in timothy regarding scripture was written before the new testament was considered scripture, so to use it to support the use of Romans is dubious in the extreme. I should also point out that the Nazis were a government, just as much as the UK and US governments were. If one was a German at that time, does one have a duty to obey that government? That's what Romans 13 would suggest.\n\n \n \n The big differnece between that ancient israeli's using the scripture for war, and the modern christians doing the same is that the ancient hebrew scriptures were written over the course of several centuries, and that excuse was included in the writings. The Christian scriptures were written over maybe 100 to 150 years, when they were an oppressed minority. The timeframe where the Jews were writing, they were a small minority is a warlike area, where exageration of warlike prowess was helpful to survive.", 
   {}, 
   206901, 
   null, 
   1144938300.0
  ], 
  [
   207047, 
   null, 
   "Easyrider", 
   " Yes, he is. However, there is a difference in the recorded actions of God in the Old Testament and Christ in the New Testament that can only lead to the conclusion that at several times in the Old Testament, the Israelites used God as an excuse for wars with their neighbours, and even if they did not, there is a massive difference between undertaking war on a clear command from God, and inferring the righteousness of a war pursued on your own account without such a command. For every possible reason for going to war, there are statements from the Bible that contradict it, be it vengeance \"vengeance is mine says the LORD\" and \"render to no-one evil for evil\", or self-defence: \"if a man strikes you on the right cheek, offer him the left\", or acquisition of resources: \"do not covet thy neighbours...\" or \"do not store up treasures for yourself on earth\".\n\n \n In Jeremiah it is written that God will raise up the Babylonians against Israel. Neither you nor I can really know if God didn't likewise raise us up against the murderous Saddam regime. Certainly Saddam was just as murderous and corrupt as the state of Israel was in those days, so you really can't say for sure that it is out of character for Jesus / God to do the same thing in our time. \n \n \n As you well know, the passage in timothy regarding scripture was written before the new testament was considered scripture, so to use it to support the use of Romans is dubious in the extreme.\n\n \n If it's the Word of God now, then it was the Word of God then also.\n \n \n I should also point out that the Nazis were a government, just as much as the UK and US governments were. If one was a German at that time, does one have a duty to obey that government? That's what Romans 13 would suggest.\n\n \n Romans 13 talks about punishment against \"evildoers,\" so you have to place that in its overall Biblical context of what real evil is. It's evil according to God's framework and not the German framework.\n \n p.s. I'm glad you recognize Jesus is God! :)", 
   {}, 
   206901, 
   null, 
   1144968720.0
  ], 
  [
   207049, 
   null, 
   "Jo Bennett", 
   "A lot of what the US administration does is considered evil by most Christians' understanding of what God wants. Can we then claim God's backnig for a war against the US? No.", 
   {}, 
   207047, 
   null, 
   1144969200.0
  ], 
  [
   207052, 
   null, 
   "Easyrider", 
   "A lot of what the US administration does is considered evil by most Christians' understanding of what God wants. Can we then claim God's backnig for a war against the US? No.\n\n \n Well, America certainly has a lot of warts, and they're on both sides of the aisle. But overthrowing a serial murderer like Saddam is in keeping with accepted Biblical examples, even if the nation that overthrows such a nation is corrupt itself (that is the teaching of the Book of Habakkuk, by the way).", 
   {}, 
   207049, 
   null, 
   1144969620.0
  ], 
  [
   207060, 
   null, 
   "Jo Bennett", 
   "So in other words you use human wisdom to decide that you have the right to kill thousands to achieve your political ends. You have no clear mandate from scripture, and no mandate from God.", 
   {}, 
   207052, 
   null, 
   1144972380.0
  ], 
  [
   207066, 
   null, 
   "Easyrider", 
   "So in other words you use human wisdom to decide that you have the right to kill thousands to achieve your political ends. You have no clear mandate from scripture, and no mandate from God.\n\n \n Nope, that's your spin.", 
   {}, 
   207060, 
   null, 
   1144973520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Jesus Loves Me", 
  "url": "http://www.4forums.com/political/religion-debates/7900-jesus-loves-me.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7900, 
  "discussion_files": [
   [
    "2668.html", 
    "http://www.4forums.com/political/religion-debates/7900-jesus-loves-me-print.html"
   ], 
   [
    "2669.html", 
    "http://www.4forums.com/political/religion-debates/7900-jesus-loves-me-5-print.html"
   ], 
   [
    "2670.html", 
    "http://www.4forums.com/political/religion-debates/7900-jesus-loves-me-4-print.html"
   ], 
   [
    "2671.html", 
    "http://www.4forums.com/political/religion-debates/7900-jesus-loves-me-3-print.html"
   ], 
   [
    "2672.html", 
    "http://www.4forums.com/political/religion-debates/7900-jesus-loves-me-2-print.html"
   ]
  ], 
  "identifier": 7900
 }
]