[
 [
  [
   205983, 
   null, 
   "nazsmith", 
   "The title is too confusing, even for me. What I wanted to discuss is if there are ways to make science/logic sound silly without distorting it. I know people can always make up fake-science and argue against that. Suppose I say: I believe a spaceship will come and save those who share my beliefs. Silly, right? But imagine if I say: A talking snake convinced a woman who didn't know right from wrong to eat a special fruit. This fruit made her aware of right and wrong.\n \n Now, that sounds kind of silly to me. Hopefully, I haven't distorted it. If so, please give me the correct version, as that shouldn't sound as silly. I can't think of a way to make the laws of physics sound silly. I'm sure someone can, please post your funniest suggestions:)\n \n Other ones: The Earth was created in 6 days, with life on it within these 6 days. Talking donkey. Humans being turned into salt.\n \n Without the proper brainwashing, education, indoctrination, whatever, a person's abilities to rationalize would dismiss the thought of 2 people producing billions (more than likely through incest). But after several years of learning not to question, not to think, and to only believe what you're told from this source, one can believe anything. This is the major component of brainwashing. This works especially when the consequences of questioning result in eternal punishment in the afterlife.", 
   {
    "post_info": {
     "post_title": "Making Silly statements from Religion/Faith &amp; Science/Logic"
    }
   }, 
   null, 
   null, 
   1144438980.0
  ], 
  [
   205987, 
   null, 
   "Jo Bennett", 
   "You're a lunatic if you don't think quantum mechanics and particles sound silly. :p Current hypotheses in particle physics include the idea of super symmetry, which posits a number of particles, including the wino.", 
   {}, 
   205983, 
   null, 
   1144441860.0
  ], 
  [
   206003, 
   null, 
   "Ripskar", 
   "Science includes any number of in-jokes, in biology Linaeus named several insects with puns such as Annachismae and Polychismae (Anna and Polly were his secretaries) this tradition has carried straight through to the present.\n eg. There is a Brazilian beetle whose name if translated to English reads;\n Little big chief nipple twister.\n The effects of a sense of humour and time to think are clear.\n \n There is also the incidence during the Red deer rut of a subordinate male mating hinds whilst the dominant males are fighting. The published term for this is \"The sneaky rutter\" because the original title certainly couldn't be published...\n \n And I haven't even mentioned the story about Halluceginea.", 
   {}, 
   205987, 
   null, 
   1144453920.0
  ], 
  [
   206424, 
   null, 
   "nazsmith", 
   "You're a lunatic if you don't think quantum mechanics and particles sound silly. :p Current hypotheses in particle physics include the idea of super symmetry, which posits a number of particles, including the wino.\n\n \n \n Quantum theory may be hard to comprehend, but I'd like to see an example of something \"silly.\" \n \n Something can be in all states at once and only after observance was it in a state retrospectively. It does sound more complex than it has to be, but it doesn't give me the satisfaction of talking donkeys, magical fruit and worldwide floods.", 
   {}, 
   205987, 
   null, 
   1144695060.0
  ], 
  [
   206425, 
   null, 
   "nazsmith", 
   "\n eg. There is a Brazilian beetle whose name if translated to English reads;\n Little big chief nipple twister.\n\n LMAO.\n \n \nAnd I haven't even mentioned the story about Halluceginea.\n\n \n Do tell.", 
   {}, 
   206003, 
   null, 
   1144695180.0
  ], 
  [
   206427, 
   null, 
   "Kronus", 
   "Quantum theory may be hard to comprehend, but I'd like to see an example of something \"silly.\" \n \n\n \n Something can go from here to there without passing through any points in between. Something can be 1 meter long and 2 meters long at the same time. A particle can pass through two different openings at the same time.\n \n These may not be ha-ha silly, but they're very wierd, and totally violate common sense.", 
   {}, 
   206424, 
   null, 
   1144695540.0
  ], 
  [
   207628, 
   null, 
   "Bradamante", 
   "I read somewhere about how scientists would split some particle and send it in two different directions (I think in a particle accelerator) and if they deflected one part (using magnetic force or some such) the other particle was also affected to, even though they weren't connected.\n \n Has anyone heard of this?", 
   {}, 
   206427, 
   null, 
   1145195100.0
  ], 
  [
   207633, 
   null, 
   "Matthew S", 
   "I read somewhere about how scientists would split some particle and send it in two different directions (I think in a particle accelerator) and if they deflected one part (using magnetic force or some such) the other particle was also affected to, even though they weren't connected.\n \n Has anyone heard of this?\n\n \n \n Yes it is hoped that someday they could use this effect for faster then light travel or communications.", 
   {}, 
   207628, 
   null, 
   1145195520.0
  ], 
  [
   207634, 
   null, 
   "Bradamante", 
   "Yes it is hoped that someday they could use this effect for faster then light travel or communications.\n\n I told this physics mate of mine and he didn't believe me, and I couldn't remember what the 'effect' (or is it 'affect') is called.\n \n I thought it had something to do with Chaos Theory, though.", 
   {}, 
   207633, 
   null, 
   1145195640.0
  ], 
  [
   207643, 
   null, 
   "trebor", 
   "I read somewhere about how scientists would split some particle and send it in two different directions (I think in a particle accelerator) and if they deflected one part (using magnetic force or some such) the other particle was also affected to, even though they weren't connected.\n \n Has anyone heard of this?\n\n \n Look up 'entangled photons.' and 'ENTANglement'. This is one of the wierd things that can be demonstrated about quantum mechanics on a repeated bases that baffels and confuses a lot of people. I certainly don't understand it.\n \n THe phenomina is quite well known, and you have to take some heavy duty physics classes to have a glimmer of what is happening.", 
   {}, 
   207628, 
   null, 
   1145199120.0
  ], 
  [
   207649, 
   null, 
   "Bradamante", 
   "Look up 'entangled photons.' and 'ENTANglement'. This is one of the wierd things that can be demonstrated about quantum mechanics on a repeated bases that baffels and confuses a lot of people. I certainly don't understand it.\n \n THe phenomina is quite well known, and you have to take some heavy duty physics classes to have a glimmer of what is happening.\n\n Many thanks. My friend claimed never to have heard of it!", 
   {}, 
   207643, 
   null, 
   1145200140.0
  ], 
  [
   207655, 
   null, 
   "trebor", 
   "Many thanks. My friend claimed never to have heard of it!\n\n \n I am sure that if you mentioned 'entanglement', he will know it if he is actually a phsycis major.\n \n The theory behind why it happens totally and utterly makes no sense to me what so ever. .. of course, QM makes no sense to me what so ever. However, some of the effects that are used to demonstrate qm is testable, repeatable, and totally freaky.\n \n for example. a watched quantum pot will not boil. IF you have a cloud of barium particules, and add energy to them, they will take x microseconds to flip to the next energy state. If you take a measurement between 1 and 2/x, have the particles will be flipped to the next energy state.. if you keep on decreasing the time interval, eventual the probablity wave for it 'collapse' (what ever that means), and the energy states of the particles do not change. As soon as the monitoring is removed, the particles change state.\n \n This is known as the \"XENO Effect'.", 
   {}, 
   207649, 
   null, 
   1145201160.0
  ], 
  [
   207708, 
   null, 
   "DamEtel", 
   "trebor: Look up 'entangled photons.' and 'ENTANglement'. This is one of the wierd things that can be demonstrated about quantum mechanics on a repeated bases that baffels and confuses a lot of people. I certainly don't understand it.\n \n THe phenomina is quite well known, and you have to take some heavy duty physics classes to have a glimmer of what is happening. \n \n\n \n \nMany thanks. My friend claimed never to have heard of it!\n\n \n This idea arose from Einstein trying to challenge quantum mechanics. He and two other scientists - Podolsky and Rosen (IIRC) - did not accept that nature was ultimately probabilistic as QM indicates, but rather deterministic. So they devised a theoretical proof, which came to be known as the EPR thought experiment (EPR being the first letters of their last names). The debate was when a property was determined: whether something could actually be in a probabilistic superposition states or not. \n \n In an dumbed down version of the EPR experiment ...\n \n Some properties in nature are conserved. For example, a positive charge cannot be created unless an equal amount of negative charge is created. And this is exactly what happens during pair production: an electron and a positron are formed at the same time (they then usually quickly mutually annihilate, creating a burst of gamma radiation). Another quantity that is conserved is spin. What is spin? That's actually complicated, but in simple terms you can think about it as being like the Earth spinning on its axis. Just as Venus and Earth spin in opposite directions on their axes, so too can particles. And, if two particles with spin are created, then their spins must be opposite in order to cancel out so that total spin to be conserved.\n \n EPR considered a pair of spin-possessing particles created by pair creation, but made to fly apart in opposite directions, later to have their spin detected as either spin up or spin down. According to EPR, the spin of the two particles was determined from the instant of their creation. According to quantum mechanics, the two particles' spins were indeterminate: the particles were in a superposition state of BOTH up AND down, until a measurement was made. EPR said that QM position was ridiculous and proved it with their experiment, because, if the particles were sent in opposite directions at the speed of light and then one of the particle's spin was detected, then INSTANTANEOUSLY the other particle's spin would be determined. In other words, a measurement way over there would INSTANTANEOUSLY cause an effect way over somewhere else: at a speed greater than the speed of light. Since no information or effect can travel faster than the speed of light, it was IMPOSSIBLE - according to EPR - for the quantum mechanics' view to be correct. The particles' spins must be determined at the moment of their creation, not at the moment of one of them being measured. In fact, Einstein was so against the QM view here that he mockingly called it \"spooky action at a distance\".\n \n EPR's thought experiment was fine as far as a thought experiment went, but the QM gang did not accept it, since QM had been so successful. What was needed was a way to test it. Later, someone named Bell came up with a set of inequalities that could prove which was case if the experiment could actually be performed. In other words, the deterministic and the probabilistic (QM) views predict different results, and applying statistics to them could settle the matter: if only the experiment could actually be performed.\n \n Well, later (beginning in the 1980s?), the technology to perform the experiments finally was available. When the experiments were performed, Bell's inequalities applied to the results showed that the quantum mechanics view was the correct one. As counterintuitive as it may be, for entangled particles, a measurement of particle X can have an INSTANTENOUS effect on particle Y, no matter how far apart the two particles are.", 
   {
    "unicode_changes_made": true
   }, 
   207649, 
   null, 
   1145212200.0
  ], 
  [
   207722, 
   null, 
   "college_girl", 
   "I have an excellent book called \"Entanglement: The Greatest Mystery in Physics\" by Amir D. Aczel. It is very entertaining and written so the layperson can understand it. I highly recommend it if you are interested in quantum mechanics.", 
   {}, 
   207708, 
   null, 
   1145215380.0
  ], 
  [
   207728, 
   null, 
   "DamEtel", 
   "I have an excellent book called \"Entanglement: The Greatest Mystery in Physics\" by Amir D. Aczel. It is very entertaining and written so the layperson can understand it. I highly recommend it if you are interested in quantum mechanics.\n\n \n I have a book on entanglement by Amir D. Aczel, but it's called, when including its subtitle, \"Entanglement: The Unlikely Story of How Scientists, Mathematicians, and Philosophers Proved Einstein's Spookiest Theory\". Same book?", 
   {}, 
   207722, 
   null, 
   1145216640.0
  ], 
  [
   207730, 
   null, 
   "Obvious Child", 
   "Schrodinger's Cat is fairly silly, and quantum can often appear to be so. \n \n As for your more general point, it requires active education for Genesis to be dismissed, not merely the lack of indoctrination. That sort of population growth is by no means inherently impossible.\n \n Also, I would argue that literal belief in a talking snake and a special fruit is itself a distortion of religion, and a largely modern one at that.", 
   {}, 
   207728, 
   null, 
   1145216940.0
  ], 
  [
   207734, 
   null, 
   "DamEtel", 
   "...eventual the probablity wave for it 'collapse' (what ever that means)...\n\n \n \"Collpase of the wave function\" deals with the ending of superposition.\n \n Superposition is when a particle is in more than one state simultaneously (such as being BOTH spin up AND spin down). A wave function is a mathematical description of a system in superposition, and has multiple solutions, each representing one of the possible states of the system. The probability of finding a particle in any one of those solutions' state is proportional to the square of the absolute value of that particular solution. So one can say what the state will PROBABLY be when the wave function collapses to only one solution, but one cannot say what it WILL be. The wave function is collapsed from many values (superposition) to just one (determined) by a measurement or observation of the system. \n \n Not all QM interpretations involve the collapse of a wave function: some avoid it. For example, the MWI (Many World Interpretation) holds that the superposition does not ACTUALLY collapse into only one determined state, but that rather every possible state is actualized. How? By the creation of another universe! So if a particle is in a superposition state of both spin up and spin down, and a measurement is made to fix its state, then the universe bifurcates and in one universe the particle of found to be spin up and in the other universe it is found to be spin down.\n \n \n \n \n PS: I am not a physicst. I don't claim to have 100% knowledge of quantum mechanics, it's just something I've read about on my own.", 
   {}, 
   207655, 
   null, 
   1145217840.0
  ], 
  [
   207751, 
   null, 
   "Ripskar", 
   "The curent (read: publishable) story regarding Hallucigenia is:\n \n \nHallucigenia is an extinct genus of animal found as fossils in the Middle Cambrian-aged Burgess Shale formation of British Columbia, Canada. It was named by Simon Conway Morris when he re-examined Charles Walcott's Burgess Shale genus Canadia in 1979. Morris found that what Walcott had called one genus in fact included several quite different animals. One of them was so unusual that nothing about it made much sense. Since the species clearly was not a polychaete worm, Morris had to provide a new generic name to replace Canadia. Morris named the species Hallucigenia sparsa because of its \"bizarre and dream-like quality\" (like a hallucination).\n\n \n Though if you ask any biologist who was around in the late '70s Morris spent weeks unsuccessfully trying to produce his reconstruction untill one night when he was under the effects of Hallucinogenic substances. \n The fact that he reproduced it upsidedown and that noone has yet figured out which end was its mouth and which was its arse merely adds to the 'psychodelic' qualities of the animal.", 
   {}, 
   207728, 
   null, 
   1145223600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Making Silly statements from Religion/Faith & Science/Logic", 
  "url": "http://www.4forums.com/political/religion-debates/7904-making-silly-statements-religion-faith-science-logic.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7904, 
  "discussion_files": [
   [
    "20042.html", 
    "http://www.4forums.com/political/religion-debates/7904-making-silly-statements-religion-faith-science-logic-print.html"
   ], 
   [
    "20043.html", 
    "http://www.4forums.com/political/religion-debates/7904-making-silly-statements-religion-faith-science-logic-2-print.html"
   ]
  ], 
  "identifier": 7904
 }
]