[
 [
  [
   206037, 
   null, 
   "chaoticgnome", 
   "http://www.sas.org/tcs/weeklyIssues_2006/2006-04-07/feature1p/index.html\n \n I go to UT, the college Pianka is from. While I'm definitely not for the painful death of 90% of the human population, this certainly does raise an interesting issue. What exactly is the carrying capacity of the planet. Are we destined to exceed it?\n \n I personally think we are already too human heavy unless we manage to develop some scientific breakthroughs like economic nuclear fusion. Instead of killing people off, though, I think we should migrate elsewhere.", 
   {
    "post_info": {
     "post_title": "Dr. Eric Pianka will kill us all!"
    }
   }, 
   null, 
   null, 
   1144476060.0
  ], 
  [
   206043, 
   null, 
   "daewoo", 
   "If you are talking sustainable population....without us burnign massive amounts of limited hydrocarbons, producing no more pollution than the earth can handle, etc... Estimates seem to run from a morbidly depressing 600 million to an almost chearful 2 billion. \n \n From a practical standpoint, huge reserves of cheap energy have allowed us to massively overpopulate the planet. This is a self correcting problem. Either we will run out of cheap energy and people will starve to death OR we will run out of cheap energy and peopel will adjust thier lifestyles accordingly (fewer children, etc...) OR, we will not run out of energy but will instead discover a pollution free, or nearly pollution free, form of cheap energy whihc we do not currently posses, in shich case we don't have to worry about overpopulation because our population projections are wrong.", 
   {}, 
   206037, 
   null, 
   1144480020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dr. Eric Pianka will kill us all!", 
  "url": "http://www.4forums.com/political/current-events-debates/7908-dr-eric-pianka-will-kill-us-all.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7908, 
  "discussion_files": [
   [
    "32751.html", 
    "http://www.4forums.com/political/current-events-debates/7908-dr-eric-pianka-will-kill-us-all-print.html"
   ]
  ], 
  "identifier": 7908
 }
]