[
 [
  [
   206447, 
   null, 
   "Black Phoenix", 
   "I know this sounds a little off the wall and conspiratorial but I just have a deep gut feeling there are going to be some big events happening within the next year. What led me to believe this? Well besides it being instinctual, I was surfing the googles top news stories through each category and it seems just a little weird how everything in the world is going right now. \n \n For instance, we have some of the most brilliant people on the planet in the U.S. and we can't figure out a better solution than fossil fuels? Come on. Also the deadly bird flu virus that has rapidly spread throughout the world. The tensions between Iran and the US, the rise of China, and all the things in the middle just are giving me the vibes that something big is going to happen....I'm not trying to create some big conspiracy theory....it just seems like the world we are living in today with all the events going on [I]seems[I] like cospiracy theory movie. \n \n What are your thoughts???", 
   {
    "post_info": {
     "post_title": "Something Big is going to happen....but what?"
    }
   }, 
   null, 
   null, 
   1144702140.0
  ], 
  [
   206449, 
   null, 
   "Jo Bennett", 
   "In answer to the fossil fuel question, follow the money.", 
   {}, 
   206447, 
   null, 
   1144703760.0
  ], 
  [
   206501, 
   null, 
   "daewoo", 
   "Saying that smart people should be able to find a replacement for fossil fuels is right on par with saying that we should be bright enough to replace water. \n \n Oil in particular is difficult to replace as a fuel, especially a transport fuel. Nothing packs quite the punch, is as portable, and is as cheap as oil as a transport fuel.\n \n Fossile fuels are generally cheap (or at least cheaper than the aternatives), high energy, and portable. Nothing else compares. It may be that we NEVER find a direct replacement for fossil fuels. \n \n It is the \"direct\" portion that gives us problems. Every bit of infrastructure, every gadget, gizmo and doo dad we have, everythgn form transportation to food production to general life, is based on fossil fuels. An energy sourse that is incompatible with our existing infrastructure while not useless, is going to take at LEAST 20 years to come on line due to our rate of infrastructure replacement. Figure 10-15 years for research and to develop to a commercially viable energy source (and that is if we rush things) and another 20 years from commercial viability to widespread usage. This is not promising for alternative energy, especially since for the last hundred years, fossil fuels have been cheaper than dirt.\n \n AS far as the rest, there are a lot of major, some potentially cataclymic events going on in the world right now. Maybe the biggest of these is related to the energy question....peak oil. IF peak oil is truly a problem, and is as close at hand as many seem to believe, it will reshape the world. \n \n Beyond that there are economic considerations that must be factored in. The united states, the worlds largest consumer, is essentially bankrupt and operating wholly on credit. The problem with operating wholly in credit is that the time may well come that your creditors no longer wish to extend credit to an unproductive borrower. \n \n There are some serious and disturbing imbalances under the surface of the American economy that seem to be indirectly driving a lot of world events. IF you take the time to edcuate yourself regarding the American economy and how it generally works, and keep the idea of peak oil in mind, a lot of news events loose their mystery.", 
   {}, 
   206449, 
   null, 
   1144718040.0
  ], 
  [
   206513, 
   null, 
   "georged", 
   " \n \n There are some serious and disturbing imbalances under the surface of the American economy that seem to be indirectly driving a lot of world events. IF you take the time to edcuate yourself regarding the American economy and how it generally works, and keep the idea of peak oil in mind, a lot of news events loose their mystery.\n\n \n Petrodollars.", 
   {}, 
   206501, 
   null, 
   1144720980.0
  ], 
  [
   206563, 
   null, 
   "Scactha", 
   "Look up Iranian Oil Bourse at Wiki for starters. Quite illuminating.", 
   {}, 
   206513, 
   null, 
   1144765200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Something Big is going to happen....but what?", 
  "url": "http://www.4forums.com/political/current-events-debates/7928-something-big-going-happen-but-what.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 7928, 
  "discussion_files": [
   [
    "28795.html", 
    "http://www.4forums.com/political/current-events-debates/7928-something-big-going-happen-but-what-print.html"
   ]
  ], 
  "identifier": 7928
 }
]