[
 [
  [
   11695, 
   null, 
   "Jim1930", 
   "Hi, Tennessee is now going to sell license plates with the Confedeate Battle Flag on them and I just want to see what you people think about this?\n \n The news link is here http://www.wkrn.com/Global/story.asp?S=1347390\n \n And also a link to a board in Nashville Tennessee talking about this subject. http://www.tntalk.com", 
   {
    "post_info": {
     "post_title": "Confedeate Battle Flag."
    }
   }, 
   null, 
   null, 
   1057749360.0
  ], 
  [
   11706, 
   null, 
   "wjim1269", 
   "If people want to put that license plates on their cars, then they have the 1st Amendment right to do so.", 
   {}, 
   11695, 
   null, 
   1057768500.0
  ], 
  [
   11724, 
   null, 
   "enfant terrible", 
   "If people want to put that license plates on their cars, then they have the 1st Amendment right to do so.\n\n \n It is beyond any doubt that an individual has the right to use such a license plate if the state issues it. \n \n A very different issue is whether the state may issue such a plate.\n \n It can be a rich issue for a debate. I would say that the state may not issue such plates.", 
   {}, 
   11706, 
   null, 
   1057797060.0
  ], 
  [
   11725, 
   null, 
   "enfant terrible", 
   "I just read the article. The \"choose life\" plate is another interesting issue. I think it is a terrible policy to issue such plates (as it would be to issue license plates with pro-choice messages), but I cannot think of any reason why a state would not have the power to do so.", 
   {}, 
   11724, 
   null, 
   1057797480.0
  ], 
  [
   11757, 
   null, 
   "wjim1269", 
   "I would say that the state may not issue such plates.\n\n \n Why do you say that? If the people have the right to put a plate like that on their car, and there is a good enough demand for a plate like that, then the state should have the right to make the plate.", 
   {}, 
   11725, 
   null, 
   1057816920.0
  ], 
  [
   11769, 
   null, 
   "enfant terrible", 
   "Why do you say that? If the people have the right to put a plate like that on their car, and there is a good enough demand for a plate like that, then the state should have the right to make the plate.\n\n \n That is a non sequitur.\n \n Instead of the CBF, try a cross, or that fish representing Jesus, or a picture of a naked woman. Your statement, which I quoted above, would not change the least bit, but you would hardly stand by the conclusion.\n \n In the first two cases, the state would clearly be violating the 1st Amendment (just as clear as the individuals who would use such plates, were they available, would clearly have the 1st Am. right to do so). The third case is a close analogy with the CBF - the problem is that more-or-less identifialble classes of individuals would be offended and/or feel discriminated against. Again, as individual, you have the 1st Am. right to offensive and even to discriminatory speech, but the state does not have such rights, and the offended individuals have the 14th Amendment equal protection rights. Women in my hypothetical example and blacks in the actual CBF example could raise the equal protection issue. Women would be successful in every court in this country, and I don't see any reason (other than personal political preferences of judges) why blacks should not be.\n \n This is also why I think the pro-life message is constitutional. Many people would be offended, but being pro-choice, or having had an abortion, does not classify you in a way relevant for equal protection purposes - it is not like race, sex, or religious persuasion. And while the state may not prohibit abortion, it may (as far as I know) declaratively encourage certain choices.\n \n In this sense, \"choose life\" plate is legally probably on the same footing with \"protect endangered species\" plates: both endorse one side in a political debate. However, while environmentalist plates might irk George Bush or Milton Friedman, they are unlikely to throw anyone into a road rage. With emotionally charged issues like abortion, that is not the case. That is why I think it is a terrible policy for a state to issue plates with such messages.", 
   {}, 
   11757, 
   null, 
   1057819920.0
  ], 
  [
   11971, 
   null, 
   "wjim1269", 
   "The three cases you mentioned would all be illegal. The naked woman would be illegal under the laws regarding the viewing of pornography by minors (since there would obviously be children on the road who could see that plate). The cross and fish would be illegal under 1A.", 
   {}, 
   11769, 
   null, 
   1058159280.0
  ], 
  [
   11975, 
   null, 
   "enfant terrible", 
   "The naked woman would be illegal under the laws regarding the viewing of pornography by minors (since there would obviously be children on the road who could see that plate). \n\n \n I did not say it would be a pornographic or obscene picture. Yet, you are right: it would almost surely be illegal. But the reasons for making it illegal are similar to, and in no way stronger than, the reasons for making the plate with the Confederate flag illegal.", 
   {}, 
   11971, 
   null, 
   1058208600.0
  ], 
  [
   23342, 
   null, 
   "bud095", 
   "i have a rebel flag in my living room it isnt coming down!", 
   {
    "post_info": {
     "post_title": "flag"
    }
   }, 
   11975, 
   null, 
   1069374300.0
  ], 
  [
   36677, 
   null, 
   "jitobear", 
   "Mostly I think it's stupid. I know the flag has changed and is more a symbol of southern pride than admitting you agreed for what the confederate government stood for, but still, it has some awful associations - it would depend on whether or not you what those things associated with you.\n \n No flags in my house. To quote George Carlin - \"they are symbols and I leave them to the symbol-minded.\"\n \n \n emoticon_xclown", 
   {}, 
   23342, 
   null, 
   1077926580.0
  ], 
  [
   36752, 
   null, 
   "Patrick Henry", 
   "Hi, Tennessee is now going to sell license plates with the Confedeate Battle Flag on them and I just want to see what you people think about this?\n \n The news link is here http://www.wkrn.com/Global/story.asp?S=1347390\n \n And also a link to a board in Nashville Tennessee talking about this subject. http://www.tntalk.com\n\n \n If that's what the people Tennessee want, then it's their choice to do so. Frankly, I would rather see them use the 1st National Confederate flag or the Bonnie Blue. ( http://www.anyflag.com/history/confeder.htm )\n \n Considering the abject ignorance of people today (especially those in public schools) concerning history, there wouldn't be the hysterical reaction with these flags that you have with the 'battle flag' because they would, more than likely, not know what the heck it is.", 
   {}, 
   11695, 
   null, 
   1077991680.0
  ], 
  [
   37777, 
   null, 
   "Tastyfish", 
   "I just read the article. The \"choose life\" plate is another interesting issue. I think it is a terrible policy to issue such plates (as it would be to issue license plates with pro-choice messages), but I cannot think of any reason why a state would not have the power to do so.\n\n What's wrong with people publically displaying their love for the film 'Trainspotting';)\n \n Seeing as several states already have it, seems resonable to allow them to have. As long as there is a alternative let the public choose themselves.", 
   {}, 
   11725, 
   null, 
   1078356660.0
  ], 
  [
   42984, 
   null, 
   "pandagirl", 
   "for pete's sake, who gives a flying wahlinda? if they have the flag plate because they're for what the thing stands for, 9 thines out of 10, then let'em show that they're ignorant.\n \n \n \n emoticon_xchicken", 
   {
    "post_info": {
     "post_title": "uhhh...."
    }
   }, 
   37777, 
   null, 
   1081407180.0
  ], 
  [
   43953, 
   null, 
   "Big Orn", 
   "for pete's sake, who gives a flying wahlinda? if they have the flag plate because they're for what the thing stands for, 9 thines out of 10, then let'em show that they're ignorant.\n \n \n \n emoticon_xchicken\n\n What \"it\" stands for is the most misunderstood feature of it. Those who are against it stand on misinformation and religious lip service, those for it stand on emotions mixed with contemporary propaganda. Those of us that deem it nothing more than a symbol of bygone days could care less. Ignorance? No. It&#8217;s blatant, mutual hate &#8211; both ways. I have never witnessed such a symbol &#8211; even the swastika &#8211; that draws more blood&#8230;and I&#8217;m from the Deep South.\n My grandpa always said, &#8220;Let sleeping dogs lie,&#8221; and I couldn&#8217;t agree more. Would I throw a rock thru Bubba&#8217;s sliding back glass or show disrespect because it offends Leroy? No. But, I would feel the same about the Battle Flag or the Naval Jack as I would the Christian Flag&#8230;it serves no real purpose.", 
   {}, 
   42984, 
   null, 
   1081982700.0
  ], 
  [
   43969, 
   null, 
   "Eddie", 
   "I think its strange how a symbol could be commonly misunderstood... I mean, the meaning of a symbol is not something objective, it is something highly subjective (otherwise it wouldn`t be a symbol). Now, the message by the wearer of the symbol might be missunderstood, but not the \"meaning\"...", 
   {}, 
   43953, 
   null, 
   1081986540.0
  ], 
  [
   43977, 
   null, 
   "Big Orn", 
   "Touché! In that lies the critical stretch, the waning/waxing swoon. If the meaning of the Confederate Battle Flag is to reflect one&#8217;s views that the South Will Rise Again; what significance is it&#8230;either way? If it denotes that, &#8220;&#8230;when ya&#8217;ll see this here flag it&#8217;s us, not them&#8230;&#8221;, then let it stand as a symbol of the past.", 
   {}, 
   43969, 
   null, 
   1081988460.0
  ], 
  [
   44020, 
   null, 
   "Phunting", 
   "It is beyond me why anyone would wish to identify with such a symbol. It just seems, well daft I'm afraid. A bit like me flying a Cavalier flag!", 
   {}, 
   43977, 
   null, 
   1082040840.0
  ], 
  [
   44035, 
   null, 
   "Big Orn", 
   "It comes from the doubt in one's own identity. Both of my son&#8217;s have the CFB on their trucks, the oldest is now coming to realize that it&#8217;s meaning is fruitless, but my younger has yet to &#8220;get it&#8221;.\n Of course there are those &#8220;old&#8221; guys (ages 45 to 55) that love to rebel against authority and wave it in protest to what their now-ex-wives exacted on them. :xbanghead :p", 
   {}, 
   44020, 
   null, 
   1082049720.0
  ], 
  [
   44038, 
   null, 
   "Phunting", 
   "I see. It just seems strange, I don't know that much about the US civil war, but am pretty sure the confederates were pro-slavery.\n \n So quite why anyone would want to identify with a loosing side from a civil war a century and a half ago that supported racism and oppression is just bizzare. \n \n If people want to rebel against authority, go right ahead. It just doesn't appear the most sensible image to use to do it.", 
   {}, 
   44035, 
   null, 
   1082051220.0
  ], 
  [
   44042, 
   null, 
   "Big Orn", 
   "...identify with a loosing side...that supported racism and oppression is just bizzare.\n\n \n In reference to your above words &#8211; the reason for the War has been so contaminated over the years that the &#8220;loser&#8221; now bears all responsibility and causes. The &#8220;reason&#8221; could cause a thread to go several hundred pages without ever reaching a satisfied conclusion.\n I don&#8217;t think those that wave the Confederate Battle Flag really wave it in allusion to that War &#8211; good or bad&#8230;JMHO.", 
   {}, 
   44038, 
   null, 
   1082052660.0
  ], 
  [
   44044, 
   null, 
   "Phunting", 
   "The \"reason\" could cause a thread to go several hundred pages without ever reaching a satisfied conclusion.\nAppreciated, but I was under the impression that the confederates were generally pro-slavery and the others (unionists wasn't it?) were anti.\n \n \n \nI don't think those that wave the Confederate Battle Flag really wave it in allusion to that War - good or bad...JMHO.\n No I hope they don't. Yet as it is the symbol of the confederates in that war it must retain very strong association to them, and hence seems a both a bad and bizzare symbol to use.", 
   {
    "unicode_changes_made": true
   }, 
   44042, 
   null, 
   1082053560.0
  ], 
  [
   44046, 
   null, 
   "Big Orn", 
   "Appreciated, but I was under the impression that the confederates were generally pro-slavery and the others (unionists wasn't it?) were anti.\n\n Generally, yes. But, there were slaveowners in the northern states also.\n \nNo I hope they don't. Yet as it is the symbol of the confederates in that war it must retain very strong association to them, and hence seems a both a bad and bizzare symbol to use.\n\n I couldn't agree more. That, at least, is what I am trying to tell my children. The CBF seems to be the \"thing\" to do here (Northeast Texas) once you get a driver's license and a truck.", 
   {}, 
   44044, 
   null, 
   1082054100.0
  ], 
  [
   44818, 
   null, 
   "sinjin", 
   "I'd be more likely to believe it's none of the ugly things if someone posts a pic of a \"minority\" flying it. The anti-minority sympathies common to so many young men flying the CBF can hardly be overlooked.", 
   {}, 
   44046, 
   null, 
   1082492220.0
  ], 
  [
   44824, 
   null, 
   "Big Orn", 
   "I'd be more likely to believe it's none of the ugly things if someone posts a pic of a \"minority\" flying it. The anti-minority sympathies common to so many young men flying the CBF can hardly be overlooked.\n\n Wouldn't it look odd, sinjin, at our age, if we took the CBF, stuck it on a pole, and crammed it down into the bed of our trucks, then drove around town with it waving?\n The younger generation (16 to 26) seems to think that it&#8217;s cool, despite what effect it has on society, not to mention the harm it could do to their character. When confronted about the reason they fly it, and in doing so, cite what others might think, they reply with a smirk, that they (the Black people) wear gowns from Africa or some other irrelevant issue, so why not. Of course, &#8220;&#8230;this is a free nation&#8230;&#8221; always seems to work its way in, too, but that is beside the point. In the Pig Pen we had a heated debate over this and it turned out that the reason for flying (or display it in any other manner) never really came out. I know why; I have 2 boys (as stated above) that gave me the real reason: To show rebellion against the Black population for getting away with so much and receiving so many benefits from being from Africa. This did not come from me, it came from TV, a book, or some magazine. Hatred loves to reside in the weak; and the weak allow it to show &#8211; be it from violence or the display of the CBF.\n Although I can see why some CSA reenactment specialists would love for it to mean otherwise by displaying the CBF, then underneath or with it, attach the phrase, &#8220;Heritage Not Hate,&#8221; it still strikes fear in some citizens, no matter what skin color.", 
   {}, 
   44818, 
   null, 
   1082495940.0
  ], 
  [
   44830, 
   null, 
   "Waxy", 
   "I assume you're referencing rebel_fordF1504X4 and the ensuing thread.\n \n I always got a kick outta that kid from Indiana. \"I'm a southerner\" \"The south will rise again\" and all his posts about hating \"posers\" and \"ricers\". I always wanted to really challenge him on his blatant hypocrisy and try to make it clear to him just how silly he appeared (to me anyway). \n \n He was just a kid looking for some kind of an identity or sense of belonging. However misguided, he seemed like a good kid overall, so I never pushed the issue with him. I'd like to catch up with him again in 10 or 20 years with a transcript of that thread and get his reaction.\n \n I suspect he was a pretty good representation of most of young boys/men that are flying the flag. It's a phase that's connected to a symbol they don't really understand.\n \n Waxy", 
   {}, 
   44824, 
   null, 
   1082497080.0
  ], 
  [
   44841, 
   null, 
   "Valthonis", 
   "I think it (the flag) is supposed to stand for rights I beleive. I go to high school and you are not allowed to have anything dealing with that flag. I beleive that is wrong. We have the right to have a shirt with that. As long as there are no racist remarks. And speaking of rights, this whole little \"Cracker\" thing is making me mad :xbanghead emoticon_angry", 
   {}, 
   44830, 
   null, 
   1082498460.0
  ], 
  [
   44863, 
   null, 
   "Big Orn", 
   "I assume you're referencing rebel_fordF1504X4 and the ensuing thread.\n \n I always got a kick outta that kid from Indiana. \"I'm a southerner\" \"The south will rise again\" and all his posts about hating \"posers\" and \"ricers\". I always wanted to really challenge him on his blatant hypocrisy and try to make it clear to him just how silly he appeared (to me anyway). \n \n He was just a kid looking for some kind of an identity or sense of belonging. However misguided, he seemed like a good kid overall, so I never pushed the issue with him. I'd like to catch up with him again in 10 or 20 years with a transcript of that thread and get his reaction.\n \n I suspect he was a pretty good representation of most of young boys/men that are flying the flag. It's a phase that's connected to a symbol they don't really understand.\n \n Waxy\n\n Yes, he was one of them and he was keyed up about it. I hope that 10 or 20 years down the road he realizes what one person can do to infect a whole crowd &#8211; good or evil. If his life doesn&#8217;t fold in on itself, he will.\n \n And speaking of rights, this whole little \"Cracker\" thing is making me mad :xbanghead emoticon_angry\n\n I don&#8217;t follow, Valthonis. Are you attempting to hijack the thread or does this have something to do with this one?", 
   {}, 
   44841, 
   null, 
   1082504400.0
  ], 
  [
   44894, 
   null, 
   "Tastyfish", 
   "It is beyond me why anyone would wish to identify with such a symbol. It just seems, well daft I'm afraid. A bit like me flying a Cavalier flag!\n\n Ha! The fools, wanting a King of England. Actaully did they even have a proper flag? \n But the fact that our civil war was over something far less 'political' (at least now, was the fundamentals of politics at the time) seems odd when compared to the American one with the popularity of the old confederate flag when there is far more dubiosity about the values it represents (i.e rather than just straight monarchy or parliament).", 
   {}, 
   44020, 
   null, 
   1082513400.0
  ], 
  [
   44957, 
   null, 
   "Big Orn", 
   "Ha! The fools, wanting a King of England. Actaully did they even have a proper flag? \n But the fact that our civil war was over something far less 'political' (at least now, was the fundamentals of politics at the time) seems odd when compared to the American one with the popularity of the old confederate flag when there is far more dubiosity about the values it represents (i.e rather than just straight monarchy or parliament).\n\n Tastyfish - there is a difference in what is going on now and what went on back then. A \"proper flag\" to begin with was the \"Stars and Bars\" and has been corrupted these days. The \"Stars and Bars\" is explained as per the following:\n The flag of the Confederate States of America shall consist of a red field with a white space extending horizontally through the center, and equal in width to one-third the width of the flag. The red space above and below to be the same width as the white. The union blue extending down through the white space and stopping at the lower red space. In the center of the union a circle of white stars corresponding in number with the States in the Confederacy.\n Kids these days call the CBF \"Stars and Bars\", which it is not.", 
   {}, 
   44894, 
   null, 
   1082554080.0
  ], 
  [
   44961, 
   null, 
   "billsco", 
   "...He was just a kid looking for some kind of an identity or sense of belonging. \n\n \n It's like people who wish for a tattoo to express their individuality, believing it will make them stand out, then go to a tattoo shop and pick out the pattern from the same thin book everyone else used.", 
   {}, 
   44830, 
   null, 
   1082556180.0
  ], 
  [
   44978, 
   null, 
   "Big Orn", 
   "It's like people who wish for a tattoo to express their individuality, believing it will make them stand out, then go to a tattoo shop and pick out the pattern from the same thin book everyone else used.\n\n Good example, billsco. I wonder if they realize just what the symbol they attach to themselves really stands for?\n \n BTW - that's why I am so glad I never got that tattoo of a naked woman scratched into my arm! emoticon_ic", 
   {}, 
   44961, 
   null, 
   1082562060.0
  ], 
  [
   44985, 
   null, 
   "sinjin", 
   "Good example, billsco. I wonder if they realize just what the symbol they attach to themselves really stands for?\n \n BTW - that's why I am so glad I never got that tattoo of a naked woman scratched into my arm! emoticon_ic\n\n \n This sort of approach to tattooing has become more the exception than the rule. When Tinker/\"Anastasia\" opened her own shop there never was the \"flash\" on the walls as in shops of olde and the reference material was primarily \"art\" books as well as anthropological studies. Many people today have only unique pieces while vintage imagery is still repeated as tribute to some extent. Only the impulse customer really points and says \"that one\" anymore.", 
   {}, 
   44978, 
   null, 
   1082563140.0
  ], 
  [
   45005, 
   null, 
   "Valthonis", 
   "I don&#8217;t follow, Valthonis. Are you attempting to hijack the thread or does this have something to do with this one?\n\n \n Actually, just a side comment. I was not trying to hijack the thread.", 
   {}, 
   44863, 
   null, 
   1082568180.0
  ], 
  [
   45027, 
   null, 
   "Phunting", 
   "Ha! The fools, wanting a King of England. Actaully did they even have a proper flag?\nI visited a friend in Nottingham last week, and we went on a tour of Nottingham castle on which we were repeatedly told was where Charles 'raised his standard'. So I guess there is one, no idea what it is though. Might find out and start driving round town with it!\n \n \n \nKids these days call the CBF \"Stars and Bars\", which it is not.\nSo what do the two different flags represent? If the 'stars and bars' represents the Confederacy what was the CBF exactly?\n \n Sorry, but my knowledge of the US civil war is pretty much limited to South Park!\n \n Cartman- \"Long live the Confedarasiiiah\"", 
   {}, 
   44894, 
   null, 
   1082571060.0
  ], 
  [
   45031, 
   null, 
   "Waxy", 
   "Sorry, but my knowledge of the US civil war is pretty much limited to South Park!\n \n Cartman- \"Long live the Confedarasiiiah\"\n\n \n I wouldn't worry, so is that of most of the young kids that are flying the flag.\n \n Waxy", 
   {}, 
   45027, 
   null, 
   1082571660.0
  ], 
  [
   45046, 
   null, 
   "Big Orn", 
   "Actually, just a side comment. I was not trying to hijack the thread.\n\n I know, I was fishing. I would just like to hear your opinion of the slur.\n \nSo what do the two different flags represent? If the 'stars and bars' represents the Confederacy what was the CBF exactly? Sorry, but my knowledge of the US civil war is pretty much limited to South Park!\n\n One was the &#8220;official&#8221; Flag of the Confederacy, the other was the standard Battle Flag.\n \nI wouldn't worry, so is that of most of the young kids that are flying the flag.\n \n Waxy\n\n :p emoticon_rolleyes So true!", 
   {}, 
   45031, 
   null, 
   1082573340.0
  ], 
  [
   45305, 
   null, 
   "Valthonis", 
   "I know, I was fishing. I would just like to hear your opinion of the slur.\n\n \n I don't like it at all. It is one of those things that you hear but can't do anything about. The people that use that slur, usually also use words that would get a white person an ... whooping. It annoys the heck out of me. I'm sorry but I think people should get in as much trouble as white people who use other terms.", 
   {}, 
   45046, 
   null, 
   1082654400.0
  ], 
  [
   45319, 
   null, 
   "Big Orn", 
   "I don't like it at all. It is one of those things that you hear but can't do anything about. The people that use that slur, usually also use words that would get a white person an ... whooping. It annoys the heck out of me. I'm sorry but I think people should get in as much trouble as white people who use other terms.\n\n They do here. But, that's a whole different can of worms. Those that use racial slurs can taunt, but only to a certain point, depending on the one being insulted. Using the law, and having a level head, one can stop it from that individual, but there&#8217;s always another waiting in the wings.\n I am at the point now that when someone racially insults me, I embarrass them by asking them what it means (which I know for the most part &#8211; hate and disgust). \n &#8220;Is that directed towards me or my kind?&#8221;\n &#8220;Yea, (insert slur here).&#8221;\n &#8220;Which one? Because I don&#8217;t know you, do I?&#8221;\n &#8220;(insert vulgar language and slurs)!&#8221;\n &#8220;If you don&#8217;t know me then you have no reason to speak to me. If you have anything other than words, then do it.&#8221;\n If he or she puts a hand on me, I then proceed to do all I have been taught to do to defend myself. That is all within the law.\n It will stop that altercation, but like I said, there&#8217;s another waiting to happen.\n \n So, unless you&#8217;re willing to do that, then I would suggest to take the insult and walk away.\n \n Years ago I was told to &#8220;let it go.&#8221; But, that just fuels the flame&#8230;and I learned that the hard way. These racists are like hyenas, they love to pick out and attack the weak.\n \n I won&#8217;t tolerate it.", 
   {}, 
   45305, 
   null, 
   1082656620.0
  ], 
  [
   47166, 
   null, 
   "Ogeechee", 
   "First of all let me say that no one is more upset by the fact that organization such as the Klu Klux Klan uses the confederate battle flag as a representation of their beliefs. Personally, I have lived next door to two black families most of my life and grew up with their children. When I was young, there was not hardly a weekend that I was either over at their house or they were at mine. Almost all of my families get to gathers involved them and vice versa. And yet my father alway had a confederate battle flag flying on a pole out side of our house. Neither of these black familes cared or they would not have sent their children over. So to me the battle flag doesn't stand for anything racial. From what I have read, most of you don't see the point of displaying the confederate battle flag. I have not read all of the posts but I am sure that \"pride\" has been brought up along with several other words that have just been repeated until they sound like a broken record. For me, I was raised with the confederate flag. It has always been in my life. I can't explain it but I feel good inside when ever I see it, it is kind of like going back home after years being away. But now days it means even more. Now days I am being told by people that the Confederate battle flag is wrong. I have actually had some people who ,when they saw me with a dixie outfitters shirt on, acted as though I just opened up my trenchcoat and flashed them. I am a big family historian and I am not ashamed to admite that every branch of my family fought for or supported the Confederacy during the war. I am no more proud of my confederate ancestors than I am of my World War II, WWI, Rev. War, ect. But when I display an American flag on my grandfathers grave for his service in World War II, people don't care as with that of my WWI ancestor. Infact I have had people who were so delighted that I did this that they had to come up and shake my and and talke to me about my grandfather. But I am not supposed to display a Confederate Battle at all even on graves. Beleave it or not, I can understand and support not haveing the battle flag flying at State Capital Buildings but the whole ridiculous political correctness as gotten out of hand. Yes, beleave it or not, I have a sever problem with someone telling me that I can not honer an ancestor because it makes them feel bad. I live in Georgia, and several years ago, our then governor removed Georgias state flage with the Confederate Battle flag on it and replaced it with a Blue Flag that looked more like a table cloth than a flag. He just got rid of it and us Georgians never got to vote on the issue. Before this time, I had never seen a Georgia State flag flying anywhere except on Government buildings and schools but after The old Georgia Flag was taken down suddenly they were everywhere. I can't speak for everybody, just myself but I show a confederate battle flag every single time I can just in spite to show hey you may not like it but I am still going to fly it. See what people who don't live in the South Don't understand is that a lot of the flag issue is taught to us unknowingly from our parents as we watch and learn from their every move growing up. I don't know if I can explain to you the reason why I feel so much pride when I see the confederate battle flag. Bottom line, no body worries if I get upset, if I am offinded by something that happens or a symble and so I am going to give the same consideration. But you know, even if someone out there did care if I was offended I would still keep it to my self. The Confederate battle flag is a symbol and as such I suppose its meaning is left to the eye of the beholder. But these flags were not created as hate symbols, they were created as symbols of a nation. True the phisical fabric of this nation has long been distroyed but I think that its spirit lives on, not so say the south will rise again, that is not what I mean. I think the best thing this country can do is to just let everybody alone. Everybody in the country today is complaining. Religous people compaining because someone wants a monument moved and the non religous complaining because it is not being moved and then we have all of this political correctness. Look people this is the price of living in a free nation. Everybody is free to their own opinons but your own personal opinions are not always correct. Everytime you see someone displaying a confederate battle flag, you have the right to say something to them, (short of starting a fight) and you have the right to think what ever about them you choose whether you think they are racist or just ignorant. But just the same, they have the right to display the CBF. I am sure nobody loses sleep at night because someone displays a confederate battle flag. I keep hearing from people, why don't you just move on, forget the past. My reply is simple. Why don't you move on? Let us southern people live our back woods, redneck, ignorant, racist lives and worry about living your own. The more people try to get rid of the confederate flag, the more it is going to appear. Georgia has proved that over the past four years. :)", 
   {
    "post_info": {
     "post_title": "One Southern view"
    }
   }, 
   45319, 
   null, 
   1083488460.0
  ], 
  [
   47181, 
   null, 
   "Maineiac", 
   "Hi, Tennessee is now going to sell license plates with the Confedeate Battle Flag on them and I just want to see what you people think about this?\n \n The news link is here http://www.wkrn.com/Global/story.asp?S=1347390\n \n And also a link to a board in Nashville Tennessee talking about this subject. http://www.tntalk.com\n Hello Jim 1930. Welcome aboard. emoticon_xhoho I find the Confederate Flag issue an interesting topic.\n \n Being from the North,I'm not really affected by anything it represents. I guess I'm more in favor of it than against it,from the standpoint of i feel it is an individuals right to display it.\n \n My problem with it is when it is used by radical groups such as the KKK, or anti-abortion groups for example.\n \n As far as the licence plates go,I see no difference in the plates vs.the flag.\n \n I understand a lot of people associate the symbol with fallen ancestors who died fighting under the flag,and use it as a way to pay tribute to them.\n I find in that sort of scenario, it is totally acceptable,and quite understandable.", 
   {}, 
   11695, 
   null, 
   1083510600.0
  ], 
  [
   47234, 
   null, 
   "jim's trucking", 
   "First of all let me say that no one is more upset by the fact that organization such as the Klu Klux Klan uses the confederate battle flag as a representation of their beliefs...\n\n \n You make a good point about the KKK. It would not have become a fearful symbol had it not been for that.\n \n I have the same revolting feelings when I see a swastika as some people get from the CBF.", 
   {}, 
   47166, 
   null, 
   1083528720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Confedeate Battle Flag.", 
  "url": "http://www.4forums.com/political/civil-rights-debates/796-confedeate-battle-flag.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 796, 
  "discussion_files": [
   [
    "27256.html", 
    "http://www.4forums.com/political/civil-rights-debates/796-confedeate-battle-flag-print.html"
   ], 
   [
    "27257.html", 
    "http://www.4forums.com/political/civil-rights-debates/796-confedeate-battle-flag-3-print.html"
   ], 
   [
    "27258.html", 
    "http://www.4forums.com/political/civil-rights-debates/796-confedeate-battle-flag-2-print.html"
   ]
  ], 
  "identifier": 796
 }
]