[
 [
  [
   207899, 
   null, 
   "Ripskar", 
   "Pacific cult hails second coming of its wealthy US messiah\n By Nick Squires in Sydney\n (Filed: 17/04/2006)\n \n Followers of a South Pacific cult, who worship a mythical Second World War American serviceman they hope will one day return bearing riches, believe that their prayers have been answered.\n \n \n \n For 60 years, the bizarre John Frum movement on Tanna, in the Vanuatu archipelago, has believed that the great wealth or \"cargo\" that the United States military brought to their island home in wartime will one day miraculously return.\n \n They worship a messiah-like figure, John (or Jon) Frum, thought to be a combination of an ancient spirit and wartime GIs based on Tanna who introduced themselves to locals as \"John from America\".\n \n Carrying wooden \"rifles\", and with the letters USA daubed in red paint on their bare chests, they have paraded for decades in home-made GI uniforms beneath a tattered Stars and Stripes in the hope of somehow persuading the US government to bring back the wealth.\n \n Now, as part of its Millennium Challenge fund - which rewards developing nations that have adopted political and economic reforms - the US is to give Vanuatu £37 million in aid, prompting cult followers to believe that their decades of prayer have not been in vain. This has caused a problem for the government of Vanuatu, which must now explain to the cult that the aid is intended for the entire nation, and not just Tanna.\n \n Officials in the capital, Port Vila, are preparing to travel to Tanna to explain to the cult, based in a village at Sulphur Bay at the foot of an active volcano, that the money will be spent on infrastructure projects throughout Vanuatu's 80 islands.\n \n \"We're just about to embark on explaining to the John Frum leaders that the money from the Americans is a gift for the whole nation, not just for them,\" said John Shem, an official at the finance ministry. \"It's one of their beliefs that some day John Frum will revisit them and bring a lot of money. It's absurd - a load of rubbish - but they're convinced of it.\"\n \n Cargo cults emerged during the war in remote islands inundated with military supplies as US forces prepared to drive the Japanese out of the South Pacific. Islanders were mesmerised by the vehicles, weapons, medicines, tinned food and cans of Coca-Cola.\n \n They were baffled when the \"cargo\" left with the Americans at the end of the war, and they developed cults devoted to enticing back the goods they had briefly enjoyed.\n \n Over the decades most cargo cults have died out, but on Tanna, the John Frum movement lives on. Each year, villagers commemorate John Frum Day on Feb 15, raising the US flag and marching on a parade ground.\n\n \n Is John Frum out there?\n Just when you thought religion couldn't get weirder...", 
   {
    "post_info": {
     "post_title": "John Frum"
    }
   }, 
   null, 
   null, 
   1145291100.0
  ], 
  [
   208023, 
   null, 
   "Ripskar", 
   "Don't the Americans have a perspecive on this? I was looking forward to reading about how they felt being worshiped like this...\n \n On the other hand a quick search turned up a violent clash between the John Frum Movement and a Presbyterian mission in 2004. The Christians are led by 'Prophet Fred' (brilliant name!) and refer to the cult as heathens.\n \n It's certainly more entertaining than the Christian vs. Athiest ranting we're subjected to here.", 
   {}, 
   207899, 
   null, 
   1145358060.0
  ], 
  [
   208040, 
   null, 
   "Bradamante", 
   "I'm always interested in these sorts of 'fringe' ideas. One of my favourites is Hong Xiuquan who claimed to be Jesus Christ's younger brother. His rebellion in China (the T'ai-ping) is the bloodiest civil war in world history", 
   {}, 
   208023, 
   null, 
   1145365260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  John Frum", 
  "url": "http://www.4forums.com/political/religion-debates/7961-john-frum.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 7961, 
  "discussion_files": [
   [
    "9082.html", 
    "http://www.4forums.com/political/religion-debates/7961-john-frum-print.html"
   ]
  ], 
  "identifier": 7961
 }
]