[
 [
  [
   208228, 
   null, 
   "jim's trucking", 
   "Who among you can say these radicals are not totally SICK!!!\n \n ...and yes, I do expect some in particular to blame the United States for this.\n \n \n \n \n http://www.msnbc.msn.com/id/12342623/\n \n Baghdad teachers beheaded in front of students\n Gunmen brutally kill teachers at 2 primary schools; 8 slain in other attacks\n \n BAGHDAD, Iraq - Separate groups of gunmen entered two primary schools in Baghdad on Wednesday and beheaded two teachers in front of their students, the Ministry of State for National Security said.\n \n \"Two terrorist groups beheaded two teachers in front of their students in the Amna and Shaheed Hamdi primary schools in Shaab district in Baghdad,\" a ministry statement said.\n \n A ministry official said he believed the attacks were aimed at \"intimidating pupils and disrupting learning.\"", 
   {
    "post_info": {
     "post_title": "Such a peaceful cause!"
    }
   }, 
   null, 
   null, 
   1145460660.0
  ], 
  [
   208242, 
   null, 
   "Kronus", 
   "Who among you can say these radicals are not totally SICK!!!\n \n ...and yes, I do expect some in particular to blame the United States for this.\n \n\n \n You're kinda all over the place here. What cause are you talking about? Who says they're peacful? \"These\" radicals? Which ones? Obviously the ones doing the beheading, but the article doesn't say what group, if any, they belong to. You're holding up this event as an prime example of something, but it seems like even you aren't quite sure what that something is.", 
   {}, 
   208228, 
   null, 
   1145463840.0
  ], 
  [
   208243, 
   null, 
   "Alan Ryan", 
   "Who among you can say these radicals are not totally SICK!!!\n \n ...and yes, I do expect some in particular to blame the United States for this.\n \n \n \n \n http://www.msnbc.msn.com/id/12342623/\n \n Baghdad teachers beheaded in front of students\n Gunmen brutally kill teachers at 2 primary schools; 8 slain in other attacks\n \n BAGHDAD, Iraq - Separate groups of gunmen entered two primary schools in Baghdad on Wednesday and beheaded two teachers in front of their students, the Ministry of State for National Security said.\n \n \"Two terrorist groups beheaded two teachers in front of their students in the Amna and Shaheed Hamdi primary schools in Shaab district in Baghdad,\" a ministry statement said.\n \n A ministry official said he believed the attacks were aimed at \"intimidating pupils and disrupting learning.\"\n\n This is only \"intimidation and disruption\" ? \n \n Which begs the question, what would the gunmen do if they wished to terrify pupils and totally extinguish learning?", 
   {}, 
   208228, 
   null, 
   1145464080.0
  ], 
  [
   208244, 
   null, 
   "jim's trucking", 
   "You're kinda all over the place here. What cause are you talking about? Who says they're peacful? \"These\" radicals? Which ones? Obviously the ones doing the beheading, but the article doesn't say what group, if any, they belong to. You're holding up this event as an prime example of something, but it seems like even you aren't quite sure what that something is.\nI'm sorry...I thought it would be obvious. The radical Muslims who do not want democracy, freedom or education to flourish in Iraq.\n \n I suppose the MSM will eventually call them 'insurgients' rather than the sick terrorists that they are. I'm not sure which named group they belong to, if any, but they do fit my description of worthless, inhuman bastards who should die a painful death.", 
   {}, 
   208242, 
   null, 
   1145464200.0
  ], 
  [
   208251, 
   null, 
   "daewoo", 
   "Just out of curiosity, how can you look at this and NOT see it as our fault? Iraq has succombed to anarchy and civil war because we destroyed their government, disbanded their military, and failed to secure the nation. Armed gunmen did not storm schools and carry out public executions during Saddams reign. They do not do so in other parts of the world where governments are intact. They are doign so in Iraq because there essentailly is no government there, and there is no government there becuase of us.", 
   {}, 
   208228, 
   null, 
   1145466300.0
  ], 
  [
   208254, 
   null, 
   "Kronus", 
   "I'm sorry...I thought it would be obvious. The radical Muslims who do not want democracy, freedom or education to flourish in Iraq.\n \n\n \n Yeah, but that doesn't really narrow it down much, does it? Pretty much nobody in Iraq wants Democracy or freedom, at least not as Americans would define it. That's not their tradition, it's not how they run things. The idea of putting aside their personal religious or tribal preferences for the sake of an abstract Iraqi nation is not one that comes easily to them. The US pretty much had to force the Iraqis to include what we would consider basic freedoms in their constitution, and even then it still recognizes Muslim law as being supreme.\n \n My point here is that saying that these radicals oppose democracy is just spin. It makes it sound like there's an American style democracy growing in Iraq, which simply isn't true. The people in charge are just as opposed to American Democracy as the insurgents. At this rate, when all the dust has settled, the government in Iraq is going to look alot more like Iran's than America's. What we're seeing in Iraq is a power struggle between groups that simply don't have end goals that coincide with America's. The insurgents are beheading people, the new government is brutal, an Islamic theocracy is being formed. It's all bad. Barring a miracle I don't see any way that something will form in Iraq that will benefit America.", 
   {}, 
   208244, 
   null, 
   1145467260.0
  ], 
  [
   208256, 
   null, 
   "daewoo", 
   "Yeah, but that doesn't really narrow it down much, does it? Pretty much nobody in Iraq wants Democracy or freedom, at least not as Americans would define it. That's not their tradition, it's not how they run things. The idea of putting aside their personal religious or tribal preferences for the sake of an abstract Iraqi nation is not one that comes easily to them. The US pretty much had to force the Iraqis to include what we would consider basic freedoms in their constitution, and even then it still recognizes Muslim law as being supreme.\n\n \n Kronus, you are just being silly here. Their tribal based system only goes back a few thousand years. Seven thousand at the most. With roots going back closer to ten thousand. Obvisouly the logical thing for them to do would be for them to abandon that system and immediatly and without reservation pick up our 200 yr old system. \n \n I know that some peopel argue that we should not try to make such decisions for the Iraqis beucase they have a heritage and lifestyle that is vastly different form our own. I say nonsense. Who could possibly be a better choice for dictating the lifestyles and form of government for a bunch of middle easterners than a bunch of rich white guys from the US?\n \n \nMy point here is that saying that these radicals oppose democracy is just spin. It makes it sound like there's an American style democracy growing in Iraq, which simply isn't true. The people in charge are just as opposed to American Democracy as the insurgents. At this rate, when all the dust has settled, the government in Iraq is going to look alot more like Iran's than America's. What we're seeing in Iraq is a power struggle between groups that simply don't have end goals that coincide with America's. The insurgents are beheading people, the new government is brutal, an Islamic theocracy is being formed. It's all bad. Barring a miracle I don't see any way that something will form in Iraq that will benefit America.\n\n \n And all this is costing us $2 trillion. What a bargain.", 
   {}, 
   208254, 
   null, 
   1145468400.0
  ], 
  [
   208285, 
   null, 
   "jim's trucking", 
   "It appears I may have posted a CBS document. Dan Rather would be proud.\n \n http://www.msnbc.msn.com/id/12342623/", 
   {
    "post_info": {
     "post_title": "Beheadings denied...."
    }
   }, 
   208256, 
   null, 
   1145474700.0
  ], 
  [
   208294, 
   null, 
   "Kronus", 
   "It appears I may have posted a CBS document. Dan Rather would be proud.\n \n\n \n ?\n Ah yes. The one time that the news ran an unsubstanciated story that made Bush look bad, as opposed to all those unsubstnciated reports that supported Bush leading up to the war. Yeah, I see why that one would stick out in your mind.", 
   {}, 
   208285, 
   null, 
   1145477520.0
  ], 
  [
   208409, 
   null, 
   "Jo Bennett", 
   "So we have a case of the US media demonising the Iraqi resistance, which coincidentally will help boost US support for the occupation. Hmm...", 
   {}, 
   208294, 
   null, 
   1145529660.0
  ], 
  [
   208441, 
   null, 
   "georged", 
   "So we have a case of the US media demonising the Iraqi resistance, which coincidentally will help boost US support for the occupation. Hmm...\n\n \n Before political correctness, propaganda was a commonly used word.", 
   {}, 
   208409, 
   null, 
   1145548860.0
  ], 
  [
   208454, 
   null, 
   "Alan Ryan", 
   "Google currently lists 218 hits related to this tale. I haven't pursued it with any determination, but none of the accounts I've read suggest who might have fabricated the story and why.", 
   {}, 
   208441, 
   null, 
   1145552280.0
  ], 
  [
   208460, 
   null, 
   "daewoo", 
   "Before political correctness, propaganda was a commonly used word.\n\n \n Now, when the other guy does it it is \"propoganda\" and is evil. When we do it, it is \"public relations\" and an invaluable asset.", 
   {}, 
   208441, 
   null, 
   1145553180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Such a peaceful cause!", 
  "url": "http://www.4forums.com/political/news-forum/7970-such-peaceful-cause.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 7970, 
  "discussion_files": [
   [
    "26199.html", 
    "http://www.4forums.com/political/news-forum/7970-such-peaceful-cause-print.html"
   ]
  ], 
  "identifier": 7970
 }
]