[
 [
  [
   209152, 
   null, 
   "Alan Ryan", 
   "I read in the weekend papers that the average American has earnings close to $40,000 a year, and personal savings at zero per cent of income. The average Chinese worker earns only about $1500 a year but saves 23% of his income - a slice of which he lends to the much better off average American at reasonable rates of interest. \n \n This is because roughly 25% of the US trade deficit is financed by China in the form of purchases of American government bonds.\n \n But why do the Chinese want to amass a huge pile of dollar-denominated securities? Why are they so willing to finance America's borrowing spree? What's in it for them?", 
   {
    "post_info": {
     "post_title": "A Chinese Puzzle ?"
    }
   }, 
   null, 
   null, 
   1145798220.0
  ], 
  [
   209171, 
   null, 
   "daewoo", 
   "I read in the weekend papers that the average American has earnings close to $40,000 a year, and personal savings at zero per cent of income. The average Chinese worker earns only about $1500 a year but saves 23% of his income - a slice of which he lends to the much better off average American at reasonable rates of interest. \n \n This is because roughly 25% of the US trade deficit is financed by China in the form of purchases of American government bonds.\n \n But why do the Chinese want to amass a huge pile of dollar-denominated securities? Why are they so willing to finance America's borrowing spree? What's in it for them?\n\n \n China and Japan have both been propping up the US economy for years in order to maintain access to our consumer market. They have reached the point that they essentailly just add it to overhead costs. \n \n The day will come, and is quickly approaching, that the cost of propping up our economy and our dollar will no longer be economical. Then we will be in real trouble.\n \n Some would argue that day is essentially here. Currently our bonds are paying more than CANADAS. 10 yrs ago people would have scoffed at the very idea. We are having to pay higher rates due to a higher percieved risk in investing in our bonds.", 
   {}, 
   209152, 
   null, 
   1145808420.0
  ], 
  [
   209177, 
   null, 
   "georged", 
   "I read in the weekend papers that the average American has earnings close to $40,000 a year, and personal savings at zero per cent of income. The average Chinese worker earns only about $1500 a year but saves 23% of his income - a slice of which he lends to the much better off average American at reasonable rates of interest. \n \n This is because roughly 25% of the US trade deficit is financed by China in the form of purchases of American government bonds.\n \n But why do the Chinese want to amass a huge pile of dollar-denominated securities? Why are they so willing to finance America's borrowing spree? What's in it for them?\n\n \n I can direct you to numerous technical articles on why China (and Japan) indulges US fiscal irresponsibility, but, IMO, the bottom line is still China's plan to raise their domestic per-capita income to a level where internal consumption will consume a balanced share of their rapidly expanding industrial capability. While $1500 is the per-capita income, that number is already well over $3500 in professional/industrial sectors. As the US and others gobble up Chinese exports, we're basically financing their infrastructure and manufacturing development to achieve that goal, which will provide China with the world's largest GDP in the next decade. \n \n While China experiences a book loss on accumulation of USD reserves as the USD fades, I'd think they view it simply as a cost of doing business to achieve their goals. Their assumption of our debt is minuscule when compared to our total outstanding debt and the capital investment they gain from feeding our growing irresponsibility.\n \n One of the statements made by China before Hu's recent US visit was the intent to reduce assumption of US debt by importing more US products using those US dollars. From a financial viewpoint the purchase of a fleet of modern Boeing airliners using net present value USD supports that intent. There was actually more US publicity of Hu's time with Bill Gates, Boeing and other luminaries than his 'official' meetings with Bush. During the official meetings nothing was accomplished other than a typical creditor (China) politely listening to a typical debtor (US) whine. \n \n When ever I now consider China's economic motives, I'm reminded of a US political cartoon published during Hu's visit:\n \n The scene is a vast US crowd holding signs protesting China's policies at one of Hu's public US appearances. The caption is Hu saying 'Not to worry, the signs were all made in China'.", 
   {}, 
   209152, 
   null, 
   1145811600.0
  ], 
  [
   209188, 
   null, 
   "Alan Ryan", 
   "@ daewoo & georged\n \n Thanks for patiently answering my inquiry: now I'll ask for your speculations about the future:\n \n In your opinion, is China playing an unbeatable hand? For the time being it has a vast and docile pool of very cheap labour, manufacturing things craved by Western consumers. And it doesn't have the social costs that shackle Western capitalism. \n \n It also has an authoritarian government in a cynical partnership with entrepreneurs who would probably be castigated as 'exploitative robber barons' in our society.\n \n These economic cards add up to something like a Royal Flush.\n \n But these advantages presumably have a shelf life. Eventually, if China acquires the world's largest GDP, won't a popular clamour for 'caring and sharing' then become irresistible? In other words, will China, when it gets rich enough, follow the same path of credit-driven consumerism and political goody-goodyism that threatens to put the US out of business? \n \n Maybe a belief in the 'right' to be affluent will contribute to their undoing as it has to ours.", 
   {}, 
   209177, 
   null, 
   1145815920.0
  ], 
  [
   209291, 
   null, 
   "georged", 
   "@ daewoo & georged\n \n Thanks for patiently answering my inquiry: now I'll ask for your speculations about the future:\n \n In your opinion, is China playing an unbeatable hand? For the time being it has a vast and docile pool of very cheap labour, manufacturing things craved by Western consumers. And it doesn't have the social costs that shackle Western capitalism. \n \n It also has an authoritarian government in a cynical partnership with entrepreneurs who would probably be castigated as 'exploitative robber barons' in our society.\n \n These economic cards add up to something like a Royal Flush.\n \n But these advantages presumably have a shelf life. Eventually, if China acquires the world's largest GDP, won't a popular clamour for 'caring and sharing' then become irresistible? In other words, will China, when it gets rich enough, follow the same path of credit-driven consumerism and political goody-goodyism that threatens to put the US out of business? \n \n Maybe a belief in the 'right' to be affluent will contribute to their undoing as it has to ours.\n\n \n All empires have had shelf lifes. As I've aged the timespan of my economic thoughts and concerns have focused on about 10-years beyond my statistical lifespan, only because I find it simple to see that far out with current trends and information. The last economic Royal Flush drawn by an empire was the US after WW2, and we've certainly left our descendants with a super-sized mess (fast food pun intended). Most of the US general public, including the strength of any nation, its youth, are unaware of their economic future. I'll leave it to them to determine what they and others are capable of achieving. Our leadership certainly has no qualms about screwing them into oblivion.", 
   {}, 
   209188, 
   null, 
   1145845680.0
  ], 
  [
   209357, 
   null, 
   "Alan Ryan", 
   "All empires have had shelf lifes. As I've aged the timespan of my economic thoughts and concerns have focused on about 10-years beyond my statistical lifespan, only because I find it simple to see that far out with current trends and information.\n\n The economic master plan that the Japanese attempted to follow in World War II involved the creation of a Greater East Asia Co-Prosperity Sphere. At least that's what they said was the aim of their military conquests. All the 'prosperity' was, of course, intended to end up in Japan.\n \n Perhaps the Chinese are now laying the foundations of an empire. But they will acquire by economic means what Japan failed to win by military victories. \n \n America had to struggle for nearly 4 years to defeat the Empire of Japan. Already, a confrontation with China is being anticipated - as the US sends reinforcements to Guam etc. In ten years from now, who knows........It might be déjà vu all over again.\n \n I can't see the Americans staying passive enough for the Chinese to dance a mandarin rumba on their comforts and security.", 
   {}, 
   209291, 
   null, 
   1145872140.0
  ], 
  [
   209360, 
   null, 
   "Scactha", 
   "There's a different mindset to take heed of when considering China too. We westerners are in a mindset where a hegemony is the end goal as a result of our Roman and Christian heritage. China has in 5000 years of ups and downs never shown much imperial ambition. For what reason? The shortest explanation is in the 'nickname' of their land, \"The Middle Kingdom\". Translated it's closest to the ancient greeks, their Thallasocracy(sp?) and the origin of the word barbarian which means people speaking an unintelligble langauge at the outside of the periphery with themselves as the center of the world. Sure they have a cultural inferiority complex but in the end they have a little interest the outside world because they know they are the best and oldest society around and just aren't much interested in mixing with the outside plebs. There is also a hint to the unreasoning anger they display at the Taiwanese, the disregard for democratic values when doing business with the third world, and the willingness to balance everyone against each other.\n \n In summary: as patriotic as any american but disinterested in reaching outside their borders. Only securing them.", 
   {
    "unicode_changes_made": true
   }, 
   209357, 
   null, 
   1145881500.0
  ], 
  [
   209373, 
   null, 
   "georged", 
   "The economic master plan that the Japanese attempted to follow in World War II involved the creation of a Greater East Asia Co-Prosperity Sphere. At least that's what they said was the aim of their military conquests. All the 'prosperity' was, of course, intended to end up in Japan.\n \n Perhaps the Chinese are now laying the foundations of an empire. But they will acquire by economic means what Japan failed to win by military victories. \n \n America had to struggle for nearly 4 years to defeat the Empire of Japan. Already, a confrontation with China is being anticipated - as the US sends reinforcements to Guam etc. In ten years from now, who knows........It might be déjà vu all over again.\n \n I can't see the Americans staying passive enough for the Chinese to dance a mandarin rumba on their comforts and security.\n\n \n Combining Chinese and Muslim populations is about 45% of the planet's population, an ambitious endeavor considering the state of US allies. Assuming nuclear war and US inability to seal its borders, US living conditions after anything on that scale would revert to middle ages siege mentality. \n \n I was under the impression US military relocation from Okinawa to Guam was to quell the rising Okinawan resentment of US military occupation.", 
   {}, 
   209357, 
   null, 
   1145891520.0
  ], 
  [
   209376, 
   null, 
   "georged", 
   "There's a different mindset to take heed of when considering China too. We westerners are in a mindset where a hegemony is the end goal as a result of our Roman and Christian heritage. China has in 5000 years of ups and downs never shown much imperial ambition. For what reason? The shortest explanation is in the 'nickname' of their land, \"The Middle Kingdom\". Translated it's closest to the ancient greeks, their Thallasocracy(sp?) and the origin of the word barbarian which means people speaking an unintelligble langauge at the outside of the periphery with themselves as the center of the world. Sure they have a cultural inferiority complex but in the end they have a little interest the outside world because they know they are the best and oldest society around and just aren't much interested in mixing with the outside plebs. There is also a hint to the unreasoning anger they display at the Taiwanese, the disregard for democratic values when doing business with the third world, and the willingness to balance everyone against each other.\n \n In summary: as patriotic as any american but disinterested in reaching outside their borders. Only securing them.\n\n \n Add imperialistic desire and your description also fits the 200-year old US.", 
   {
    "unicode_changes_made": true
   }, 
   209360, 
   null, 
   1145892360.0
  ], 
  [
   209391, 
   null, 
   "Rovdak", 
   "That's his point, the Imperialistic desire is something China hasn't really displayed, it's claims on Taiwan are mostly based on a percieved historic right, not a desire to control for the sake of imperialism. The best comparison is perhaps the way the US acted during the interbellum\n \n Having said that, it's anyone's guess what will happen to China, bear in mind that there could very well be social consequences to for example the one child policy and the resulting gender disparity", 
   {}, 
   209376, 
   null, 
   1145897400.0
  ], 
  [
   209485, 
   null, 
   "georged", 
   "That's his point, the Imperialistic desire is something China hasn't really displayed, it's claims on Taiwan are mostly based on a percieved historic right, not a desire to control for the sake of imperialism. \n\n \n I was in agreement with his statement, pointing out that the general US public feels the same way after only 200-years of nationality. To change a couple of words from his comment:\n \n ~Sure we have a cultural inferiority complex but in the end we have little interest in the outside world because we think we're the best society around and just aren't much interested in mixing with foreigners.~ \n \n To the general American public anything 'foreign' is ruthlessly condemned or ignored, especially non-English speakers, primarily out of ignorance. Quite an attitude from the melting pot of the West.", 
   {
    "unicode_changes_made": true
   }, 
   209391, 
   null, 
   1145929620.0
  ], 
  [
   209486, 
   null, 
   "Rovdak", 
   "Ah, I missed YOUR point then ;)\n \n Well, the same can be said about most Western-European countries, and every European nation can tell you why their national policy should be Europe's way forward", 
   {}, 
   209485, 
   null, 
   1145931360.0
  ], 
  [
   209546, 
   null, 
   "Scactha", 
   "The current US administration fooled itself into beliving Iraq would fall into line behind it as the originator of the greatest society known as soon as the dicator was ousted. Thus I belive they have a hard time buying the concept that the chinese basically just want to secure their borders. But this isn't an american thing but a cultural heritage imo.", 
   {
    "unicode_changes_made": true
   }, 
   209376, 
   null, 
   1145977080.0
  ], 
  [
   209652, 
   null, 
   "georged", 
   "The current US administration fooled itself into beliving Iraq would fall into line behind it as the originator of the greatest society known as soon as the dicator was ousted. Thus I belive they have a hard time buying the concept that the chinese basically just want to secure their borders. But this isn't an american thing but a cultural heritage imo.\n\n \n China is using mutually agreeable trade arrangements to secure resources from other nations required for their economic expansion, something WW2 Germany and Japan ignored and current US administration, now that the USD is our primary product, is beyond. Any country not bowing to the USD is a bogeyman, China included.", 
   {
    "unicode_changes_made": true
   }, 
   209546, 
   null, 
   1146019080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Chinese Puzzle ?", 
  "url": "http://www.4forums.com/political/economics-debates/8001-chinese-puzzle.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 8001, 
  "discussion_files": [
   [
    "24061.html", 
    "http://www.4forums.com/political/economics-debates/8001-chinese-puzzle-print.html"
   ]
  ], 
  "identifier": 8001
 }
]