[
 [
  [
   11862, 
   null, 
   "AMD4EVER", 
   "The following is info I pulled from a website a long time ago when I was debating whether God existed. This has quite possibly been the greatest influence in me deciding that the God depicted in the Bible does not exist or at the very least we have to assume the Bible doesn't give the correct information about God. Tell me what you all think about this if it hasn't already been covered before.\n \n \n http://members.tripod.com/ColoradoWeb/failed_prophecies.htm\n \n \n Some Bible prophecies that failed to occur\n \n ---\n \n Ezekiel predicted Babylon would conquer Egypt and was wrong.\n \n Ezekiel predicts that Nebuchadrezzar of Babylon will conquer Egypt utterly destroying it, slaying and scattering it's people, and that it will stay uninhabited for 40 years.\n \n In 568 BCE Nebuchadrezzar tried to conquer Egypt and Egypt survived with no apparent damage.\n \n Aahmes ruled for another generation over a prosperous Egypt and lived to see Nebuchadrezzar die. No Egyptians were scattered or dispersed.\n \n (Ezek 29:10 NRSV) therefore, I am against you, and against your channels, and I will make the land of Egypt an utter waste and desolation, from Migdol to Syene, as far as the border of Ethiopia.\n \n (Ezek 29:11 NRSV) No human foot shall pass through it, and no animal foot shall pass through it; it shall be uninhabited forty years.\n \n (Ezek 29:12 NRSV) I will make the land of Egypt a desolation among desolated countries; and her cities shall be a desolation forty years among cities that are laid waste. I will scatter the Egyptians among the nations, and disperse them among the countries.\n \n (Ezek 30:10 NRSV) Thus says the Lord GOD: I will put an end to the hordes of Egypt, by the hand of King Nebuchadrezzar of Babylon.\n \n (Ezek 30:11 NRSV) He and his people with him, the most terrible of the nations, shall be brought in to destroy the land; and they shall draw their swords against Egypt, and fill the land with the slain.\n \n \n \n ---\n \n Ezekiel predicts the destruction of Tyre (Tyrus) by Nebuchadrezzar and is wrong again.\n \n Ezekiel incorrectly predicts that the island of Tyre (Tyrus) will be utterly destroyed and \"made a bare rock\" which will \"never be rebuilt\".\n \n At the time of the prediction, it seemed like to be a sure thing, but 13 years of seige later Nebuchadrezzar gives up. The Island of Tyre is not destroyed or even conquered. It is not made \"a bare rock\" that will \"never be rebuilt\".\n \n Ezekiel admits his error in Ezek 29:17\n \n (Here the conquest of Trye looks like a sure thing so Ezekiel makes his prediction)\n \n (Ezek 26:1 NRSV) In the eleventh year, on the first day of the month, the word of the LORD came to me:\n \n (Ezek 26:7 NRSV) For thus says the Lord GOD: I will bring against Tyre from the north King Nebuchadrezzar of Babylon, king of kings, together with horses, chariots, cavalry, and a great and powerful army.\n \n (Ezek 26:14 NRSV) I will make you a bare rock; you shall be a place for spreading nets. You shall never again be rebuilt, for I the LORD have spoken, says the Lord GOD.\n \n (Ezek 27:32 NRSV) In their wailing they raise a lamentation for you, and lament over you: \"Who was ever destroyed like Tyre in the midst of the sea?\n \n (13 years of futile effort by Nebuchadrezzar later...)\n \n (Ezek 29:17 NRSV) In the twenty-seventh year, in the first month, on the first day of the month, the word of the LORD came to me:\n \n (Here Ezekiel admits he was wrong)\n \n (Ezek 29:18 NRSV) Mortal, King Nebuchadrezzar of Babylon made his army labor hard against Tyre; every head was made bald and every shoulder was rubbed bare; yet neither he nor his army got anything from Tyre to pay for the labor that he had expended against it.\n \n (So he then predicts that God decides to give Egypt to him instead, another Ezekiel prophecy that completely failed)\n \n \n \n ---\n \n Micah predicts the destruction of Jerusalem (which at the time was about to be invaded by Sennacherib and seemed inevitable) blaming the destruction on the corruption of the priesthood of Judah.\n \n Jerusalem was sieged, but the destruction didn't happen.\n \n A century later Jeremiah quotes Micah and tries to excuse the failed prophecy by saying that \"the Lord changed his mind\" about that destruction.\n \n (Micah 3:12 NRSV) Therefore because of you Zion shall be plowed as a field; Jerusalem shall become a heap of ruins, and the mountain of the house a wooded height.\n \n (~100 years and no destruction later...)\n \n (Jer 26:18 NRSV) \"Micah of Moresheth, who prophesied during the days of King Hezekiah of Judah, said to all the people of Judah: 'Thus says the LORD of hosts, Zion shall be plowed as a field; Jerusalem shall become a heap of ruins, and the mountain of the house a wooded height.'\n \n (Jer 26:19 NRSV) Did King Hezekiah of Judah and all Judah actually put him to death? Did he not fear the LORD and entreat the favor of the LORD, and did not the LORD change his mind about the disaster that he had pronounced against them? ...\n \n \n \n ---\n \n The prophet Daniel incorrectly states that in the third year of the reign of King Jehoiakim, Nebuchadnezzar is king and that he conquers Judah.\n \n The third year of Jehoiakim's reign was 606 BCE, at which time Nebuchadnezzar was not yet king of Babylon. It was in 597 BCE that Nebuchadnezzar takes Jerusalem, by then Jehoiakim had died.\n \n (Dan 1:1 NRSV) In the third year of the reign of King Jehoiakim of Judah, King Nebuchadnezzar of Babylon came to Jerusalem and besieged it.\n \n (Dan 1:2 NRSV) The Lord let King Jehoiakim of Judah fall into his power, as well as some of the vessels of the house of God. These he brought to the land of Shinar, and placed the vessels in the treasury of his gods.\n \n \n ---\n \n Jeremiah incorrectly predicts 70 years for the Babylonian exiles but they only lasted 59 years.\n \n The 1rst exile started in 597 BCE when Nebuchadnezzar first takes Jerusalem and appoints Zedekiah king (Judah's last king). Nebuchadnezzar has temple equipment taken away.\n \n The start of the 2nd exile was in 586 BCE when Nebuchadnezzar takes Jerusalem a second time putting down a rebellion and destroys the temple.\n \n The end comes in 538 BCE when Cyrus takes Babylon and ends the Babylonian kingdom. Jews are then allowed to return to Judah.\n \n (Jer 29:10 NRSV) For thus says the LORD: Only when Babylon's seventy years are completed will I visit you, and I will fulfill to you my promise and bring you back to this place\n \n \n \n \n Just for fun I went back to that site I mentioned above for the first time in probably a year.\n \n I followed a link to another site that pointed out a lot of biblical contradictions. Of course everyone knows the Bible contradicts itself repeatedly and seemingly without care. But this site puts it in a very comical format as well as educational \n \n http://www.infidels.org/library/modern/donald_morgan/inconsistencies.shtml\n \n Examples:\n \n GE 6:4 There were Nephilim (giants) before the Flood.\n GE 7:21 All creatures other than Noah and his clan were annihilated by the Flood.\n NU 13:33 There were Nephilim after the Flood.\n \n GE 6:6. EX 32:14, NU 14:20, 1SA 15:35, 2SA 24:16 God does change his mind.\n NU 23:19-20, IS 15:29, JA 1:17 God does not change his mind.\n \n GE 11:26 Terah was 70 years old when his son Abram was born.\n GE 11:32 Terah was 205 years old when he died (making Abram 135 at the time).\n GE 12:4, AC 7:4 Abram was 75 when he left Haran. This was after Terah died. Thus, Terah could have been no more than 145 when he died; or Abram was only 75 years old after he had lived 135 years.\n \n GE 10:5, 20, 31 There were many languages before the Tower of Babel.\n GE 11:1 There was only one language before the Tower of Babel.\n \n EX 9:3-6 God destroys all the cattle (including horses) belonging to the Egyptians.\n EX 9:9-11 The people and the cattle are afflicted with boils.\n EX 12:12, 29 All the first-born of the cattle of the Egyptians are destroyed.\n EX 14:9 After having all their cattle destroyed, then afflicted with boils, and then their first-born cattle destroyed, the Egyptians pursue Moses on horseback.\n \n \n \n \n Out of further curiosity I went on to look at more interesting writting. Biblical absurdities...\n \n http://www.infidels.org/library/modern/donald_morgan/absurd.shtml\n \n 1KI 6:2, 2CH 3:3 Solomon's temple was only about ninety feet long by thirty feet wide, yet: \n 1KI 5:15-16 153,300 persons were employed to build it. \n 1KI 6:38 It took seven years to build. \n 1CH 22:14 13,100,000 lbs. of gold and 116,400,000 lbs. of silver were used. \n 1CH 23:4 24,000 supervisors and 6,000 officials and judges were employed to manage it.\n \n 1SA 2:8, JB 38:4, PS 104:5 The earth has a foundation and cannot be moved.\n JB 9:6 (KJV) God shakes the earth out of its place and makes its pillars tremble.\n \n 2CH 13:17 500,000 Israelites are slain in a single battle. (Note: This is more than were lost in any single battle of World War II, and even exceeds the number of deaths that resulted from the dropping of the atomic bombs on Nagasaki and Hiroshima. At Gettysburg, the greatest battle of the Civil War, the defeated army lost 5,000 men.)\n \n PS 58:8 Slugs and/or snails melt as they move.\n \n PS 121:6 It is apparently possible to suffer moonstroke as well as sunstroke.\n \n IS 11:12, RE 7:1 The earth has four corners.\n \n IS 24:1 (KJV) The earth can be turned upside down so as to scatter its inhabitants.\n \n IS 30:26 The moon will someday be as bright as the sun now is. (Note: Until relatively recent times, the moon and the planets were thought to give off their own light.)\n \n MT 7:7-8, LK 11:9-10 Ask and it will be given. Seek and you will find. Everyone who asks, receives.\n MT 18:19 If two [believers] agree about anything they ask, God will do it for them.\n \n RE 14:1-4 Heaven is to be inhabited in part by 144,000 virgin men who have not been \"defiled\" by women.\n (Guess that means that not many children make it to heaven)", 
   {
    "post_info": {
     "post_title": "Biblicial Failures"
    }
   }, 
   null, 
   null, 
   1057949760.0
  ], 
  [
   12136, 
   null, 
   "AMD4EVER", 
   "For all the views this posts gets, it sure doesn't seem to attract many opinions. Does anyone have any thoughts on any of this? Any?", 
   {}, 
   11862, 
   null, 
   1058938980.0
  ], 
  [
   12326, 
   null, 
   "Pikeman85", 
   "What I've seen is that when someone makes a religion killing post, which cannot be countered, no one posts, or else there are plenty of insults from certain people who will remain unmentioned.", 
   {}, 
   12136, 
   null, 
   1059521340.0
  ], 
  [
   12342, 
   null, 
   "AMD4EVER", 
   "Wow, a sign of life! emoticon_xbye", 
   {}, 
   12326, 
   null, 
   1059534840.0
  ], 
  [
   12360, 
   null, 
   "SilentPoet", 
   "Interesting.\n I support your post.\n Thanks for submitting it.\n \n \"GE 10:5, 20, 31 There were many languages before the Tower of Babel.\n GE 11:1 There was only one language before the Tower of Babel.\"\n \n - Thats funny\n \n \n Always Stay Open Minded", 
   {}, 
   12342, 
   null, 
   1059585000.0
  ], 
  [
   12408, 
   null, 
   "AMD4EVER", 
   "My favorite one is Moses being pursued on horseback after all the horses were killed. :)", 
   {}, 
   12360, 
   null, 
   1059664140.0
  ], 
  [
   12411, 
   null, 
   "papabryant", 
   "What I've seen is that when someone makes a religion killing post, which cannot be countered, no one posts, or else there are plenty of insults from certain people who will remain unmentioned.\n\n \n For one, the is NOT a religion killing post. Each and every one of these alledged \"contradictions\" has an answer. \n \n The reason you are not getting replies from believers (or angry replies when you do posts like this) is this post looks like what we believers refer to as a \"got-ya\" post. \n \n It is easy to post from a website someone elses \"list of contradictions\", but to rebut them requires time and research. I don't know about you, but I have to work for a living and I only write on my breaks. That is not enough time, even for me - a Ancient Near Eastern History major and youth pastor - to give it proper attention. And that is where the problem lies.\n \n O.K. - I have time to answer one of them. Great. And I tear it to shreds, yada yada yada... IF you are an unscrupulous skeptic, you are going to scream \"Yea, you answered that one, but what about the other 14 on my list? You didn't answer them! You have no answer for them, admit it!! GOT YA!!! BWAAAAHHHHH!!!\" \n \n The author of this post, or even the person who originally wrote the lists quoted may be a genuine skeptic, with genuine questions. But from the way this post is written it smacks of \"GOT YA!!\" Beyond this little note, I won't waste my time getting into that kind of discussion. I suspect others won't either, or if they do they will respond in anger at the deception.\n \n Try ONE \"contradiction\" at a time, don't dismiss an anwer because it \"came from a Christian source\" (which makes NO sense at all - do you take advice on heart surgery options from your auto mechanic?), and you just might have a vigorous and interesting debate. \n \n Now, If you will excuse me, the boss is cracking the whip again. \n \n Peace, Tom", 
   {}, 
   12326, 
   null, 
   1059665460.0
  ], 
  [
   12417, 
   null, 
   "AMD4EVER", 
   "papabryant, here is the most important of all the parts of the original post here. I have looked to many people to explain this and none have been able to. The Bible goes into such detail into this situation that their are not many places where you can say 'oh but what if this'. It obviously is not something meant to happen in the future. It obviously didn't happen in the past. The people and places were obviously right where they seem to be. There is nothing symbolic about this. I don't see how it can be disputed without some very far out lost hope of an explaination.\n \n Ezekiel predicted Babylon would conquer Egypt and was wrong.\n \n Ezekiel predicts that Nebuchadrezzar of Babylon will conquer Egypt utterly destroying it, slaying and scattering it's people, and that it will stay uninhabited for 40 years.\n \n In 568 BCE Nebuchadrezzar tried to conquer Egypt and Egypt survived with no apparent damage.\n \n Aahmes ruled for another generation over a prosperous Egypt and lived to see Nebuchadrezzar die. No Egyptians were scattered or dispersed.\n \n (Ezek 29:10 NRSV) therefore, I am against you, and against your channels, and I will make the land of Egypt an utter waste and desolation, from Migdol to Syene, as far as the border of Ethiopia.\n \n (Ezek 29:11 NRSV) No human foot shall pass through it, and no animal foot shall pass through it; it shall be uninhabited forty years.\n \n (Ezek 29:12 NRSV) I will make the land of Egypt a desolation among desolated countries; and her cities shall be a desolation forty years among cities that are laid waste. I will scatter the Egyptians among the nations, and disperse them among the countries.\n \n (Ezek 30:10 NRSV) Thus says the Lord GOD: I will put an end to the hordes of Egypt, by the hand of King Nebuchadrezzar of Babylon.\n \n (Ezek 30:11 NRSV) He and his people with him, the most terrible of the nations, shall be brought in to destroy the land; and they shall draw their swords against Egypt, and fill the land with the slain.", 
   {}, 
   12411, 
   null, 
   1059667740.0
  ], 
  [
   12485, 
   null, 
   "Pikeman85", 
   "Yes, the other ones were simply funny... I too want the Egyptian-Babylon one answered.\n \n I've asked a baptist minister and a Hovindite both about it, and neither have given me an answer. The Hovindite tried to tell me part of it was a prophecy about the future (which is obviously not true) and the baptist minister keeps telling me he will mail me with an answer when he gets time, but he hasn't yet.\n \n This is the most direct Biblical error there is. It is virtually impossible to explain, if possible at all. But I await your answer.", 
   {}, 
   12417, 
   null, 
   1059733620.0
  ], 
  [
   12499, 
   null, 
   "AMD4EVER", 
   "Even as the passage stands I don't believe it can be made to be anything but a false prophecy. The only explanations I've heard yet in my history of debating this topic are that it will happen in the future or that it did happen only on a much smaller scale.\n \n The future explanation fails because it requires King Nebuchadrezzar and Babylon. One could debate that Babylon is Iraq but that still wouldn't explain the King and nor would it explain the reasoning for the following passage which I listed below.\n \n EZEK 29:18 Son of man, Nebuchadrezzar king of Babylon caused his army to serve a great service against Tyrus: every head made bald, and every shoulder peeled: yet had he no wages, nor his army, for Tyrus, for the service that he had served against it: \n EZEK 29:19 Therefore thus saith the Lord GOD; Behold, I will give the land of Egypt unto Nebuchadrezzar king of Babylon; and he shall take her multitude, and take her spoil, and take her prey; and it shall be the wages for his army. \n EZEK 29:20 I have given him the land of Egypt his labour wherewith he served against it, because they wrought for me, saith the Lord GOD.\n \n So God is really allowing Nebuchadrezzar and Babylon [Present day Iraq] to take Egypt as a way of paying them back for their efforts against Tyrus [Present day Lebanon]. For the future prophecy, that would mean Tyrus is also necessary. So Tyrus, Nebuchadrezzar, and Babylon would all have to be in existence and in this highly detailed situation described in these passages for it to correctly fit in with this. Seriously, Iraq under the rule of Nebuchadrezzar, supported by God, has to go to war with Lebanon, using horses, chariots, cavalry, and a great and powerful army, lose that war while leaving all his armies heads bald and shoulders peeled, and then 13 years later go to war with nearly the entire Middle East (you will see what I mean at end of post) and leave Egypt completely desolate while receiving her spoils. As stated in Ezek 26:7 it would need to be a sword fight or something conventional and absolutely not a nuclear battle since Egypt is supposed to be worth something to Babylon once it is captured. How it is worth anything if nothing can enter it for 40 years is beyond me. Also you would have to ignore that this exact scenario has already been attempted and therefore is in all likelihood the Bible is speaking of the ancient war between the actual Babylonians, Tyre, and Egypt.\n \n The small-scale theory was proposed to me a long time ago but I still vaguely remember the explanation. There is a web page somewhere on the web that tries to explain all strange conflicts of information in the Bible and it said that indeed Babylon did attack Egypt and destroyed a lot of civilization in the Syene. However it wasn't long after the war ended that people quickly returned to this land, Egypt was still intact and powerful, and Babylon had received no reward for its efforts. The land described in Ezek 29:10 includes the Syene, Egyptian land extending South to Ethiopia, and from the North of Egypt to along the Red Sea. At least that much should have been destroyed for this to be accurate. That is a lot of land to cover compared to what was actually destroyed. The way this small war actually went doesn't exactly match up with the phrase \"make the land of Egypt a desolation among desolated countries\" or \"I [God] will also make the multitude of Egypt to cease by the hand of Nebuchadrezzar king of Babylon\".\n \n To expand on this small-scale idea, I encourage all those who wish to learn more about this topic to read the other passages on both sides of the selected writings posted in my original post. They emphasize even more as to how Egypt was supposed to fall and how even the nations around that area and I quote \"Ethiopia, Libya, Lydia [NW Turkey], all the mingled people [Arabians], Chub [Libyans], and the men of the land that is in league [all allies], shall fall with them [Egypt] by the sword.\" This was to be a spectacular battle victory if the Babylonians had succeeded and honestly, I didn't find the actual final result to be all that spectacular.\n \n I don't know why there is no place in the Bible that goes back and simply says 'oops, made a mistake'. They did go back and say oops after the Tyrus vs Nebuchadrezzar war didn't work out and that shifted over into the Egypt vs Nebuchadrezzar war. Perhaps there is something to this.\n \n http://www.infoplease.com/ helped me define a lot of the locations listed in this post.\n \n There you go papabryant. Now I didn't just copy stuff from a website and ask for a response. I have done my own research now and believe to an even further extent that this is a major flaw in the Bible which cannot be explained.", 
   {}, 
   12485, 
   null, 
   1059767340.0
  ], 
  [
   12559, 
   null, 
   "papabryant", 
   "I appreciate the pm inviting me back; it was very nice. Thank you.\n \n Well, to start, in my initial web research this morning (Sat) I came across the site run by an aquantance of mine that dealt specifically with this issue - http://www.tektonics.org/ajinod_11.html#zeke29 - but he is in the middle of a site renovation and the link is down right now. I've included it anyways for your future reference. (I've read it before and it is a good article.)\n \n Suffice to say, the Bible is not one book, but a collection of books, and each book can be placed into a specific genre. In addition, although the general message of each book and the collection as a whole can be understood by anyone, there are places where understanding the culture of the Jews and the region as a whole help to prevent misunderstanding. This is a GREAT example of this. \n \n You would be correct that this is a failed prophesy, IF it were a prophesy in the first place. It isn't. Its a typology written on the eve of a war.\n \n For a detailed study of typology I refer you here - http://www.christian-thinktank.com/typol.html - It does mention this problem here, although not in depth. \n \n The Reader's Digest version is on the eve of the fall of the remaining Jewish people to ol' Nebby, the Jews were expecting help from Eqypt. While Pharaoh-hophra, or Apries, (who, Herodotus informs us, agreeably to the character given him by the prophet, \"proudly and wickedly boasted of having established his kingdom so securely, that it was not in the power of any God to dispossess him of it.\"), HAD feigned that he would send assistance, but he recanted.\n \n Zeke, seeing the fall of his people imminent, is trash talking Pharoah. \"See what happened to us? You're next.\" (To understand this, and the use of hyperbole in the ANE, see here - http://www.tektonics.org/hyperbole.html - this link works.) \n \n However, some elements WITHIN the whole CAN be said to be prophetic. Egypt was never a world power after this event. For most of the past 2500 years, Egypt has been controlled by foreign powers, including the Romans, Ottomans and Europeans. The prophet foretells that Egypt, which was about to be... cough, cough... \"devastated\" - by the Babylonians, and many of the people carried into captivity (we learn from Berosus that Nebuchadnezzar sent several captive Egyptians to Babylon; and from Megasthenes, that he transplanted others to Pontus; and it is probable, that at the dissolution of the Babylonian empire, about forty years after, Cyrus permitted them to return to their native country, thus explaning the \"uninhabitable land\"), should again become a kingdom. In 1948, 1967 and 1973, an independent Egypt tried to dominate Israel but was unsuccessful each time, despite the fact that Egypt is 10 times larger than Israel. \n \n But in the meantime, it became the BASEST of the kingdoms: 1. Egypt became tributary to the Babylonians under Amasis. 2. After the ruin of the Babyionish empire, it became subject to the Persians. 3. After the Persians, it came into the hands of the Macedonians. 4. After the Macedonians it fell into the hands of the Romans. 5. After the division of the Roman empire it was subdued by the Saracens. 6. About A.D. 1250, it came into the hands of the Mameluke slaves. 7. Selim, the ninth emperor of the Turks, conquered the Mamelukes, A.D. 1517, and annexed Egypt to the Ottoman empire. So true is it that Egypt, once so glorious, is the basest of kingdoms. Since the time of Ezekiel, Egypt no longer rules over other nations, except for a brief period they conquered Sudan - and then they were made to release it. \n \n I look forward to your reply, my friend. Hope you have a good weekend.\n \n Peace, Tom", 
   {
    "post_info": {
     "post_title": "A real and polite skeptic!!!"
    }
   }, 
   12417, 
   null, 
   1059847080.0
  ], 
  [
   12569, 
   null, 
   "AMD4EVER", 
   "Let me start off by saying this is the best response I've ever received for this question. It has advanced and intelligent thoughts. Thanks for this reply. I must say some terms you used I don't fully grasp so I'll do my best to interpret them and understand all the writing in the links you provided.\n \n \nWell, to start, in my initial web research this morning (Sat) I came across the site run by an acquaintance of mine that dealt specifically with this issue - http://www.tektonics.org/ajinod_11.html#zeke29 - but he is in the middle of a site renovation and the link is down right now. I've included it anyways for your future reference. (I've read it before and it is a good article.)\n\n \n I'll be sure to take a look at this when it is back online.\n \n \n \nYou would be correct that this is a failed prophecy, IF it were a prophecy in the first place. It isn't. It's a typology written on the eve of a war.\n\n \n The thing that struck me right away after reading this is that the war against Tyrus was a prophecy. If it were a typology type passage, then why would there be a need to come back and correct the mistake that was made after it turned out that the predicted war was a failure? This is linked to the Egypt war since it preceded it.\n \n Lets just take this part of the passage: \"I [God] will make you [Tyrus] a bare rock; you shall be a place for spreading nets. You shall never again be rebuilt, for I the LORD have spoken, says the Lord GOD.\" This never occurred so we will assume it is symbolism. What was the hidden meaning behind this passage? Well, basically there would be a war against Tyrus, defeat them, and some magic would occur that would show that God meant for this to happen. It would be hard to debate that the constant references to Tyrus becoming part of the ocean in the passages around this don't mean anything so obviously something strange is supposed to happen here. Anyways, after the war, Babylon didn't achieve their victory, their armies were weak and their nations money spent, and Tyrus still stood. God then says Babylon would get repayment for their efforts against Tyrus. This sort of repayment idea follows up with their failed war and is a means of being given a gift from God for their efforts. This all adds up nicely to show that the war did occur, that it did fail, and that there would be another war, which would be real, that would repay Babylon for their losses. With this in mind, I believe the war against Tyrus was meant to be a prophecy and not symbolic. Let me know what you think about this idea.\n \n Assuming the above, the repayment for the Tyrus war alone means Zeke, as you like to call him, believed his first prophecy was supposed to occur but God changed his mind later (which is why it failed presumably) and therefore the prophecy didn't come to pass. The war against Egypt came next and it was worded much like the war against Tyrus and this one had more meaning behind it in that there were going to be things that occurred specifically to Babylon after their victory.\n \n When I put this all together, the fact that the Tyrus war was real, that the Egypt war was real, that the payment they were supposed to get was real else it would cause ruin to their nation, the extreme details of this proposed war was very extensive, and the wording between the Tyrus and Egypt wars were so closely matched, I have to believe that both of these are prophecies. Also I'm sure you will understand the quote \"just as I did to X, so will I do to Y\". I believe this is to be held true in the Bible and with this being said, since the two wars are so intertwined, if one was a prophecy then both were prophecies. Sure some symbolism occurred in both but for the most part what was stated was supposed to occur, baring the exaggerations in both.\n \n On another topic, one thing that doesn't surprise me is how willing some interpreters are to accept that such blatant and detailed information in the Bible is simply exaggerations. I can understand that the \"No human foot shall pass through it, and no animal foot shall pass through it\" etc would be an exaggeration. But to specifically say 40 years is or give exact locations of where events will occur or say specific things will happen as a result of something that has already occurred, that is hard to believe it is a casual exaggeration. I find blowing this off as a simple as calling it typology a stretch.\n \n \n \nFor a detailed study of typology I refer you here - http://www.christian-thinktank.com/typol.html - It does mention this problem here, although not in depth.\n\n \n Thanks for the link. It does give some idea of what to take literally and what not to take literally in the Bible. However, I think if you believe what is written on that page, you will agree that not everything in the Zeke passages can simply be explained as typology/symbolism/exaggerations. They are in far too much detail and being too specific. If for some reason this is totally symbolic, then you have to assume what is written throughout the entire Bible is probably symbolic unless it can be proven.\n \n I couldn't find where it talked about this issue. Could you tell me where to look.\n \n \n \nThe Reader's Digest version is on the eve of the fall of the remaining Jewish people to ol' Nebby, the Jews were expecting help from Egypt. While Pharaoh-hophra, or Apries, (who, Herodotus informs us, agreeably to the character given him by the prophet, \"proudly and wickedly boasted of having established his kingdom so securely, that it was not in the power of any God to dispossess him of it.\"), HAD feigned that he would send assistance, but he recanted.\n \n Zeke, seeing the fall of his people imminent, is trash talking Pharoah. \"See what happened to us? You're next.\" (To understand this, and the use of hyperbole in the ANE, see here - http://www.tektonics.org/hyperbole.html - this link works.)\n\n \n I think this is dangerous territory to be stepping into saying Zeke is trash talking in the Bible. Zeke trash talking implies that it is not the word or will of God that was put into these passages and therefore it implies that it cannot be considered in the same league as many other parts of the Bible because Zeke, unlike God, is not perfect and can make mistakes. I hope your not implying that this passage may not be perfect because if you are then this debate is essentially over. I don't believe this is what your saying but I could use some clarification on this.\n \n Now remember as well, 'Nebby' was at war with Tyrus trying to fulfill a prophecy of God at that time. You make it sound like Egypt is a very unholy nation, which I believe was the case at the time knowing what I do about the Bible and especially Moses. It does seem strange that an unholy nation overcame a prophecy of God but who am I to question the will of God? Anyways, why would God or Zeke trash talk in the Bible about something that wasn't to occur? Doesn't this inherently make the Bible seem less trustworthy right off the bat especially when done in such detail as this passage is? Doesn't it make you question whether God could be trash talking all through revelations?", 
   {
    "unicode_changes_made": true
   }, 
   12559, 
   null, 
   1059862680.0
  ], 
  [
   12570, 
   null, 
   "AMD4EVER", 
   "Part 2:\n \n \nHowever, some elements WITHIN the whole CAN be said to be prophetic. Egypt was never a world power after this event. For most of the past 2500 years, Egypt has been controlled by foreign powers, including the Romans, Ottomans and Europeans. The prophet foretells that Egypt, which was about to be... cough, cough... \"devastated\" - by the Babylonians, and many of the people carried into captivity (we learn from Berosus that Nebuchadnezzar sent several captive Egyptians to Babylon; and from Megasthenes, that he transplanted others to Pontus; and it is probable, that at the dissolution of the Babylonian empire, about forty years after, Cyrus permitted them to return to their native country, thus explaining the \"uninhabitable land\"), should again become a kingdom. In 1948, 1967 and 1973, an independent Egypt tried to dominate Israel but was unsuccessful each time, despite the fact that Egypt is 10 times larger than Israel.\n\n \n One upsetting thing about this is your assuming all things that can true were not symbolic while all the rest of it was. Using this logic, I can say everything I've ever wrote is correct and if you find something wrong then it is simply symbolic for something that is correct or that has no way of being shown to be correct or incorrect.\n \n Your correct that Egypt never has been a world power since this time. I agree that their power has fallen off just as the power in most of that region has fallen off. Their system of government simply hasn't been able to succeed nor has their economy. I can't debate whether God has been causing this or simply human error. Also you mention the Romans, Ottomans, and Europeans as reasons for your belief that Egypt is weak. A lot of other nations in that area, including Jewish settlements, have been controlled by the same powers during those time periods. I would tend to be in agreement with the God theory a whole lot more if they had a history any different than any other nation in that region or were not as powerful as any other nation in that region or excluding the US backed Israel. Also note that in the wars Israel has fought, they have always had the better technology and stronger allies. They could defeat Egypt even today and could probably take command of the entire Middle East if they wished. That is a technological advantage more than anything else. However, it is still pretty impressive that Israel has managed to survive this long.\n \n The Babylonians also never did devastate the Egyptians. But I'm sure you see this as symbolism that following the war Egypt never became a world superpower. The trash talking of God really built this up to be caused by the Babylonians and not simply random chance following a failed attack on them.\n \n Your explanation of why the land was considered uninhabited is also too unbelievable. People who try to make Nostradamus sound credible use reasoning similar to this and I'm guessing your not the type of person who believes in that XXXX. Egypt was not uninhabited and your explanation also doesn't cover why animals were mentioned unless of course you believe God sees people in cages and calls them animals. I doubt you would agree with this.\n \n \n \nBut in the meantime, it became the BASEST of the kingdoms: 1. Egypt became tributary to the Babylonians under Amasis. 2. After the ruin of the Babyionish empire, it became subject to the Persians. 3. After the Persians, it came into the hands of the Macedonians. 4. After the Macedonians it fell into the hands of the Romans. 5. After the division of the Roman empire it was subdued by the Saracens. 6. About A.D. 1250, it came into the hands of the Mameluke slaves. 7. Selim, the ninth emperor of the Turks, conquered the Mamelukes, A.D. 1517, and annexed Egypt to the Ottoman empire. So true is it that Egypt, once so glorious, is the basest of kingdoms. Since the time of Ezekiel, Egypt no longer rules over other nations, except for a brief period they conquered Sudan - and then they were made to release it.\n\n \n Babylon also hasn't had a great past since their war with Egypt. They were supposed to get all these spoils of war and defeat all their enemies. Had this occurred, I would have to believe Babylon would have done a whole lot better than they did. I hope you don't try to say this was symbolic or exaggerated while the fall of Egypt wasn't just because one did occur and the other didn't.\n \n \nI look forward to your reply, my friend. Hope you have a good weekend.\n \n Peace, Tom\n\n \n I hope I'm not coming off as too confrontational here. I do these debates not to try and make people think like I do, but rather to see how my beliefs hold up against others so I can determine whether my ideas are correct or not. It is important to me to decide whether the Bible is real or not so I am paying strong attention to anyone who has logical explanations to rebuke my beliefs. I think you made a lot of good points in your response to me on how some of what is said in those passages I listed are simply exaggerations or symbolic talk. However, I think you are being too generous and accepting too much of the inaccurate quotes as not needing to be correct while giving credit to the Bible for getting some stuff right. I hope in your next post you give specific reasons why you, for instance, believe that when the Bible said Egypt would never again be a powerful nation that it was accurate and not symbolic while you believe when the Bible said Babylon would defeat Egypt that it was symbolic and didn't necessarily need to be accurate.\n \n This is a good point of view to focus and analyze though. Perhaps through this debate we will both gain a better understanding of this most serious of Biblical issues.\n \n Hope to hear back from you soon. Enjoy your weekend as well :)", 
   {
    "unicode_changes_made": true
   }, 
   12569, 
   null, 
   1059862680.0
  ], 
  [
   13263, 
   null, 
   "AMD4EVER", 
   "Well I guess there are officially 3 different explanations now for this biblical failure.\n \n #1 - It will happen in the future. This is wrong because there is very little that would support this idea in the Bible and there is a lot that would be stacked up against it.\n \n #2 - It has already happened on a small scale. In this case there are verses stating incorrect locations and events all over the place. So this would only prove my theory on it being inaccurate.\n \n #3 - It is all symbolic and exaggerated. This would probably be supported by some other believers on this forum since I see many different references on how the Bible cannot be taken literally. In this case, I think my point is supported as well. If I ever found a history book that detailed how the Chinese invaded America in WWI and the Canadians pushed them back as far as Mexico City following their invasion, I would declare that this is a flaw in the history book even if everyone else accepted that it was not to be taken literally.\n \n Could Enron use the defense that what it stated in detailed facts pertaining to their accounting shouldn't have been taken literally? No, because it was stated as fact.\n \n The Bible must therefore not be meant to be a book of facts.\n \n Assume statement 1, 2, and 3 are all written as facts, sound exaggerated, and are covered in great detail. Statement 1 is proven to be false and widely accepted as being an exaggeration. Statement 2 is proven to be true and widely accepted as fact. Statement 3 cannot be proven either way and although written as fact, it also sounds like exaggeration. Could Statement 3 be widely accepted? Lets say Statement 1 is my Babylon article, Statement 2 is the historical fact that Jesus did live on Earth and was accepted as a miracle worker, and Statement 3 covers the Rapture. Can we assume the Rapture is fact when it cannot be proven and Statement 1 is not literal and Statement 2 is literal?\n \n My simple response is no, it cannot be accepted. So can the idea of heaven be accepted? Can the idea of God be accepted? Can anyone actually say that they can accept any of the statements in the Bible as fact without having proof and without basing it on faith or belief? The Bible does itself in and it is proven by how many people accept that there are statements in the Bible that even they cannot take literally.\n \n I'm sure I'll get responses to this contradicting my ideas and I look forward to them. If I've made a false assumption, please point it out. But bring facts and make examples to show specifically what you believe or how I'm wrong.", 
   {}, 
   12570, 
   null, 
   1060801440.0
  ], 
  [
   13529, 
   null, 
   "AMD4EVER", 
   "So.... I guess there is no more debate? Its just accepted that the Bible is words to live by but not the word of God? I figured at least a few people would debate this but I think this is a changing trend as more and more is learned about the Bible.", 
   {}, 
   13263, 
   null, 
   1061664780.0
  ], 
  [
   44620, 
   null, 
   "Trancelation", 
   "If the Bible is absolutely correct, and God is all-knowing and His words reflect throughout all time, then there would be no need for upgrades. When I try and debate the issue of false prophecies with my girlfriend, her only response is \"They haven't happened yet,\" even when the Bible gives a time and place for when these so-called prophecies will occur. Jesus even told his followers that the coming of the kingdom of God would occur in his lifetime, or the lifetimes of those around him. This is clearly stated. It didn't happen. And yet, it still could? Right. The only response I ever get to THAT inquiry is \"Huh? Where does it say that?\" \n \n The Bible is a good set of rules to live by only in certain ways, and even then, it's up to us, each as an individual, to become a better moral person. If we need a cosmic being to tell us how to live, a cosmic being that IS NOT HUMAN, and not one of us, then what are we? Mice in a lab experiment, that's what. Some morals are obviously true, and we don't do them because we intrinsically know they're wrong, unless there's something mentally wrong with us.\n \n Once again, we don't need God to come up with a set of rules to live by: we know what's right and what's wrong, and we know that if we follow all of His ideals, then we will all go crazy and loot everything anyway.", 
   {}, 
   13529, 
   null, 
   1082398260.0
  ], 
  [
   44635, 
   null, 
   "Big Orn", 
   "If that&#8217;s all someone can find wrong in the Bible, then they haven&#8217;t searched all the way through it.\n \n If God is perfect, then how did he create a planet that was void and without form?\n Why did he allow Cain to marry his own sister?\n How does blood cry out from the ground? This is getting way too far into Dean Koontz&#8217;s world! \n A flood &#8211; worldwide!? Where did the water come from, really?\n There were firmaments? Two of them?\n A talking *** (donkey, maybe)?\n Walking on water?\n Water into wine?\n \n We could go on and on. But&#8230;the Bible is not a book you pick up and read like you would a novel. It is a door, which, if read with the help of the Holy Spirit, will lead you to the mysteries of life. There&#8217;s no doubt that it LOOKS like errors in there, but, without the eyes of God, you may never know.\n \n It never ceases to amaze me how people love to discredit the Bible, but never really want to find the answers. If they did they would first open that Door, not just look at it and complain about the flaws in the finish.", 
   {}, 
   44620, 
   null, 
   1082400960.0
  ], 
  [
   44639, 
   null, 
   "Waxy", 
   "That's one of the two catch 22s that believers always fall back on though Big Orn. (The other is literal vs symbolic.)\n \n You can't understand the Bible unless you are a true believer, and yet, how do you become a true believer if you can't understand the Bible?\n \n I don't get it.\n \n Waxy", 
   {}, 
   44635, 
   null, 
   1082401920.0
  ], 
  [
   44648, 
   null, 
   "Big Orn", 
   "That's one of the two catch 22s that believers always fall back on though Big Orn. (The other is literal vs symbolic.)\n \n You can't understand the Bible unless you are a true believer, and yet, how do you become a true believer if you can't understand the Bible?\n \n I don't get it.\n \n Waxy\n\n Neither do I. I welcome a good debate, but to point at something just to show the faults (or what is perceived to be faults) is pointless. Let's take one step at a time and get it hashed out in a civil, educational manner.", 
   {}, 
   44639, 
   null, 
   1082403840.0
  ], 
  [
   44738, 
   null, 
   "AMD4EVER", 
   "It never ceases to amaze me how people love to discredit the Bible, but never really want to find the answers. If they did they would first open that Door, not just look at it and complain about the flaws in the finish.\n\n \n Let me just state that I did want to find the answers I was searching for and was able to because of what I discovered about the Bible. Man has misinterpreted the Bible and therefore doesn't truly understand what God is. God is not perfect, he cannot see the future, and he is probably a lot more like us than most would believe. Just look at the one failed prophecy. It shows us so much about what God actually is. Yet I find that no so-called believer wants to admit that anything can be learned by it. So believe me, it is not only on the non-believer side that people don't want to find the answers. The happy to be ignorant people exist on both sides.", 
   {}, 
   44635, 
   null, 
   1082438880.0
  ], 
  [
   44740, 
   null, 
   "maximus", 
   " When I try and debate the issue of false prophecies with my girlfriend, her only response is \"They haven't happened yet,\" even when the Bible gives a time and place for when these so-called prophecies will occur. Jesus even told his followers that the coming of the kingdom of God would occur in his lifetime, or the lifetimes of those around him. This is clearly stated. It didn't happen. And yet, it still could? Right. The only response I ever get to THAT inquiry is \"Huh? Where does it say that?\" \n\n Perhaps the coming of the Kingdom of God did occur in the lifetime of Jesus and the apostles. The Kingdom of God coming into power could have been the completion of the manifestation of God in man through Jesus. It could have been the initiation of God's kingdom on earth--look how the kingdom of God has grown and spread since that time--look at Christianity now. It could have come at the Resurrection or even earlier. Read Luke 10:9-12  where it is written that the \"kingdom of God is near you\" or in another translation \"the kingdom of God has come near to you\" (is and has not will). Jesus did not always speak plainly and sometimes it took the apostles and others a while to catch on.\n \n This is not an official theological idea of the Catholic Church or even of Christianity that I know of (although it could be a sound proposal, I guess). It is just an idea that occurred to me when reading the Bible. Something to think about.", 
   {}, 
   44620, 
   null, 
   1082439300.0
  ], 
  [
   44756, 
   null, 
   "Big Orn", 
   "Man has misinterpreted the Bible and therefore doesn't truly understand what God is.\n\n First, let me say that I did not direct my response to you personally, AMD4EVER.\n \n Your above statement is true. Man can never fully take the written Word of God and make sense of it. If so we would not have separation of Christian beliefs. The Bible's words are true, but can only be understood when they \"come alive\" in the heart of man.\n \n When God said that He would completely destroy Sodom and Gomorrah and everyone in it, Abraham pleaded for God to change His mind and He did&#8230;but, only the part of &#8220;everyone in it&#8221;. I believe if Abraham would have asked to spare the whole of both cities, maybe that catastrophe would have never happened. So, God can change his mind.\n \n Remember, we read the parts that our human minds can understand, but ultimately we must begin reading with our spirits to fully understand. For example: In the beginning God created the heavens and the earth. God is perfect and created a perfect heaven and earth. But, then something happened to make the earth become void and without form. That missing information between Genesis 1:1 and 1:2 is what has thrown some creationists and some scientists off course for years.", 
   {}, 
   44738, 
   null, 
   1082468580.0
  ], 
  [
   44760, 
   null, 
   "Phunting", 
   "It never ceases to amaze me how people love to discredit the Bible, but never really want to find the answers. If they did they would first open that Door, not just look at it and complain about the flaws in the finish.\nThe problem is that so many Christians insist that the Bible is 100% absolutley true, logical and divine. It makes you wonder if they have actually read it. \n \n If it was more accepted that the Bible is a guide to the truth, but not the divine truth itself, then I think then need for discrediting would lessen. But as it still is not, discreditors attempt to show it's flaws.", 
   {}, 
   44635, 
   null, 
   1082470260.0
  ], 
  [
   44767, 
   null, 
   "Big Orn", 
   "If it was more accepted that the Bible is a guide to the truth, but not the divine truth itself, then I think then need for discrediting would lessen. But as it still is not, discreditors attempt to show it's flaws.\n\n John 14:6, Jesus says, \"I am the way the truth and the life...\"\n \n That is crucial. Maybe all Bibles need to say that on the cover. But, then again, those who search for the Truth will find it anyway. emoticon_idea", 
   {}, 
   44760, 
   null, 
   1082472780.0
  ], 
  [
   44990, 
   null, 
   "billsco", 
   " \n \n When God said that He would completely destroy Sodom and Gomorrah and everyone in it, Abraham pleaded for God to change His mind and He did...\n\n \n Hi Big Orn,\n \n It's instructive that Abraham had to teach God humanity and compassion.\n \n regards", 
   {
    "unicode_changes_made": true
   }, 
   44756, 
   null, 
   1082564220.0
  ], 
  [
   44999, 
   null, 
   "Big Orn", 
   "Hi Big Orn,\n \n It's instructive that Abraham had to teach God humanity and compassion.\n \n regards\n\n I see you're back to your old self, billsco. emoticon_xgood \n \n But, that's just what God wanted in the first place: To see mankind's compassion on a lost and dying world. It is sad to know that He had to get our attention by allowing the blood of animals to cover our sins; all because of our hard hearts. This is a reflection of what is happening today, like it or not.\n But, that all goes back to that parent/child relationship, that quality that is instilled in us from birth. We must allow our children to experience things in order to understand them.\n Humanity &#8211; what a hard row to hoe.", 
   {}, 
   44990, 
   null, 
   1082566860.0
  ], 
  [
   45009, 
   null, 
   "AMD4EVER", 
   "God is perfect and created a perfect heaven and earth. But, then something happened to make the earth become void and without form. That missing information between Genesis 1:1 and 1:2 is what has thrown some creationists and some scientists off course for years.\n\n \n The very fact that you have suggested that something happened and caused God's plan to go wrong indicates that God is not perfect. I honestly do not believe he is perfect because to be perfect he would never have to change his mind. He would always have the perfect idea of what to do. To be perfect his plans would have to pan out perfectly. To be perfect he would have to never be wrong and as you can see in my post quote and in this thread he has been wrong.\n \n I believer God cannot see the future, God is not perfect, and God is also much more similar to us than we know. So much so that honestly I wouldn't be surprised if God wished to be human and that is why he created us in the first place. This would give actual meaning to God's initial creation of man and earth.", 
   {}, 
   44756, 
   null, 
   1082568420.0
  ], 
  [
   45024, 
   null, 
   "billsco", 
   " So much so that honestly I wouldn't be surprised if God wished to be human and that is why he created us in the first place.\n\n \n That may explain why Abraham had to stay the hand of God, Big O.", 
   {}, 
   45009, 
   null, 
   1082570040.0
  ], 
  [
   45041, 
   null, 
   "Big Orn", 
   "And how do you and I know that \"what happened\" was not part of the plan? \n \n This could go on forever...\n \n As for God being human - He now knows all the qualities of humankind. He experienced it firsthand, not just from the time He died for us, but from the days of Melchizedek.", 
   {}, 
   45024, 
   null, 
   1082572740.0
  ], 
  [
   45047, 
   null, 
   "AMD4EVER", 
   "And how do you and I know that \"what happened\" was not part of the plan? \n \n This could go on forever...\n\n \n I doubt it could go on very long. You have already suggested that \"something happened\" indicating that God failed to take into affect a certain detail meaning he isn't perfect. So technically the debate would already be completed as far as you and I are concerned.\n \n Anyways, the Bible would seem to suggest that God does not know the future before it occurs hence the reason why he prophecised that Egypt would fall and it did not. This means God cannot be perfect as he cannot take into consideration what the future may hold. Perfection is very specific and requires a great deal of things in order for it to occur and I don't believe that the Bible suggests that God has all the required abilities to be perfect.\n \n \nAs for God being human - He now knows all the qualities of humankind. He experienced it firsthand, not just from the time He died for us, but from the days of Melchizedek.\n\n \n So do you believe God may wish to be human hence the reason he created us in the first place? This is not something that can be shown to be true or false, only something that would be the opinion of someone who feels they have some understanding of God through the teachings of the Bible.", 
   {}, 
   45041, 
   null, 
   1082573400.0
  ], 
  [
   45067, 
   null, 
   "Big Orn", 
   "I doubt it could go on very long. You have already suggested that \"something happened\" indicating that God failed to take into affect a certain detail meaning he isn't perfect. So technically the debate would already be completed as far as you and I are concerned.\n\n Unfortunately, yes, it can. But, seeing that you have already judged my answer as a suggestion, and closing the door on it, I guess so. \n \nAnyways, the Bible would seem to suggest that God does not know the future before it occurs hence the reason why he prophecised that Egypt would fall and it did not. This means God cannot be perfect as he cannot take into consideration what the future may hold. Perfection is very specific and requires a great deal of things in order for it to occur and I don't believe that the Bible suggests that God has all the required abilities to be perfect.\n\n Keeping up with the human errors in translation of the Bible is exhausting. But, a healthy debate needs to feed on input/output of beliefs or ideas. Since you have come to the conclusion that the errors have meaning and are tangible, it would require me to go into depth proving the errors were indeed clerical and not divine. That would, again, be extensive. Your next sentence, however, has some room for doubt, since it deals with your belief system. On the merits of that phrase I will say that your belief that God is imperfect is simply an opinion. I, on the other hand, can ask for proof of that &#8211; other than what you have read in the Bible.\n \nSo do you believe God may wish to be human hence the reason he created us in the first place? This is not something that can be shown to be true or false, only something that would be the opinion of someone who feels they have some understanding of God through the teachings of the Bible.\n\n Thank you for stating that, AMD4EVER. It cannot be proven right or wrong. But you now have my attention.\n \n God can become human at anytime, i.e., take human form. We already know that certain traits of humans can be mimicked by apes, monkeys, etc., but we cannot see humanity in them. Same with God, but reverse. God can become human (and already has in one widely accepted manner in Jesus), but cannot perform the entire function(s) of a human; that being, He cannot sin. Not will not, but cannot. Evil is not in Him. Furthermore, He has no need to become human again. He has done His work and we are reaping the benefits of that work, whether we believe in Him or not.", 
   {}, 
   45047, 
   null, 
   1082578860.0
  ], 
  [
   45085, 
   null, 
   "AMD4EVER", 
   "Unfortunately, yes, it can. But, seeing that you have already judged my answer as a suggestion, and closing the door on it, I guess so. \n\n \n If you have something to say then by all means feel free to say it.\n \n \nI, on the other hand, can ask for proof of that - other than what you have read in the Bible.\n\n \n Proof? Someone who believes in God asks for proof of something about God? Prove to me that he even exists. You probably do now realize that you have no proof of anything either so to ask for it is an unnecessary and pointless act. If you want reasonable logic I can give you that but proof, you can forget about it. The reasonable logic that I have to show that God is not perfect is mostly stated in the Bible and supported by what is in existance today. God's master plan was put into play by the creation of Adam and Eve. Since then things have gone wrong. He tried to correct it by flooding the world and ridding it of evil. That again failed. His ultimate solution is a second coming but that requires the destruction of his original plan. That is hardly what I call perfection.\n \n \nGod can become human at anytime, i.e., take human form. We already know that certain traits of humans can be mimicked by apes, monkeys, etc., but we cannot see humanity in them. Same with God, but reverse. God can become human (and already has in one widely accepted manner in Jesus), but cannot perform the entire function(s) of a human; that being, He cannot sin.\n\n \n Again I would say that my debate that God wishes to become man is supported by the coming of Jesus in human form. As far as him being constrained by some sort of Godly law that he cannot sin, the fact is that he cannot sin regardless of what actions he takes because he is the one who defines what sin is.\n \n \nNot will not, but cannot. Evil is not in Him. Furthermore, He has no need to become human again. He has done His work and we are reaping the benefits of that work, whether we believe in Him or not.\n\n \n Perhaps in Heaven he is a human. Perhaps Heaven is just a second Earth. This may even be supported by the fact that a war took place there.", 
   {
    "unicode_changes_made": true
   }, 
   45067, 
   null, 
   1082581620.0
  ], 
  [
   45105, 
   null, 
   "Big Orn", 
   "If you have something to say then by all means feel free to say it.\n\n I have been in this battle before. It was distasteful and argumentative at times and would not care to join in on a spitting contest with you or anyone else when views/beliefs/opinions are &#8220;locked in&#8221;. \n However, I will go as far to say that my belief carries me from Luke 10:18 where Jesus said he saw Satan (Lucifer, the Devil, etc.) fall from Heaven. Evil was cast out, along with him were 1/3 of the angels. This is that something that happened between Gen1:1 and 1:2.\n Isaiah 45 : 17 says that God created the earth to be inhabited. So Genesis 1 : 2 says that something happened; for it became void and without form and darkness was upon the face of the deep AFTER God created earth &#8220;to be inhabited&#8221;. In order to understand what could have happened one must understand who/what Lucifer was before he became Satan (the devil). Lucifer was the greatest of all angels that God created, he was top-notch. He was beautiful and was given much power. But, along with this power came greed and ego &#8211; so much that God could not tolerate it. And so God cast Lucifer (now Satan) to the earth where He said He saw him fall and it looked like a lightning bolt (a great streak of fire).\n \nProof? Someone who believes in God asks for proof of something about God? Prove to me that he even exists. You probably do now realize that you have no proof of anything either so to ask for it is an unnecessary and pointless act. If you want reasonable logic I can give you that but proof, you can forget about it. The reasonable logic that I have to show that God is not perfect is mostly stated in the Bible and supported by what is in existance today. God's master plan was put into play by the creation of Adam and Eve. Since then things have gone wrong. He tried to correct it by flooding the world and ridding it of evil. That again failed. His ultimate solution is a second coming but that requires the destruction of his original plan. That is hardly what I call perfection.\n\n My proof is not evident to anyone but me. But, just because God is not as hard-headed as we are, we just can&#8217;t assume that that makes Him imperfect. As far as Him or His plan failed or is failing, I can&#8217;t see that. To go further here would just prove one of us narrow-minded, and I can see that you are not&#8230;yet.\n \nAgain I would say that my debate that God wishes to become man is supported by the coming of Jesus in human form. As far as him being constrained by some sort of Godly law that he cannot sin, the fact is that he cannot sin regardless of what actions he takes because he is the one who defines what sin is.\n\n I could not have said it better. Still, just because He defines it doesn&#8217;t mean He will/will not commit a sin; again, He cannot, period.\n \nPerhaps in Heaven he is a human. Perhaps Heaven is just a second Earth. This may even be supported by the fact that a war took place there.\n\n He is there, now, in his glorified body. That was not taken away when he ascended. He was touched and heard here on earth in human form. Second Earth? No, I don&#8217;t believe so. It is still Heaven, a much, much better place.\n War in the Heavenlies? Yes, everyday.", 
   {}, 
   45085, 
   null, 
   1082584560.0
  ], 
  [
   45126, 
   null, 
   "AMD4EVER", 
   "I have been in this battle before. It was distasteful and argumentative at times and would not care to join in on a spitting contest with you or anyone else when views/beliefs/opinions are \"locked in\".\n\n \n I can assure you that my beliefs are not locked in. I have shifted a long ways since the actual beginning of this thread almost a year ago. Initially I was of the belief the Bible was flawed indicating God didn't exist. Today I understand that the Bible is probably not flawed but it is our understanding of God that is flawed. But one thing has remained, I don't believe the perfect God theory and the literal Bible can co-exist. But that is just my opinion for now as well.\n \n \nMy proof is not evident to anyone but me.\n\n \n There again, don't ask for proof in a debate such as this.\n \n \nBut, just because God is not as hard-headed as we are, we just can't assume that that makes Him imperfect.\n\n \n What does his not being hard headed have to do with his apparently flawed plan? He has shown over time that he is unable to successfully map out his ultimate design. Doesn't it seem a little odd to you that his plan is so off the map right now that he is planning on destroying it with his second coming and has already tried to destroy it once in the past with the great flood? He also had to put down a rebellion in his own domain in Heaven. If this doesn't seem odd to you I would like to know why you believe the way you do. I can't see any good explaination as to how his plan can be perfect if he is going to have to end the world just to set it straight.\n \n \nAs far as Him or His plan failed or is failing, I can't see that. To go further here would just prove one of us narrow-minded, and I can see that you are not...yet.\n\n \n To go further would not prove us narrow-minded. To be unwilling to go further would go to prove someone as close-minded. We are debating this issue for a reason here and that is to get a better understanding of our own theories as well as others that are out there. I'm not worried about exploring other possible explainations because I am not \"in love with\" my current beliefs. If you say something that breaks everything I used to think I believed about God then I am happy for it as it means I've made a step in the right direction. I would hope that you believe the same.\n \n \nI could not have said it better. Still, just because He defines it doesn't mean He will/will not commit a sin; again, He cannot, period.\n\n \n Consider that we lived in a perfect world where everyone lived free and happy and there were no worries. Lets pretend the people who lived in that world looked at what God had done in our less than perfect world. He has commanded people to go to war. He has cast down plagues and caused much misery to a few. He has also allowed souls that he created to be condemned to eternal suffering. Now do you think that in a perfect world that these would be considered sins? I sure do and I believe that the only reason we don't see them as sins is because we live in a very sin filled existance where it is all common place to us. So it depends on the perspective you have as to whether God is capable of sinning or not. Had his ultimate plan worked to a T, I don't believe people would have accepted the idea that God could be capable of causing death or misery in any way, shape, or form.\n \n \nHe is there, now, in his glorified body. That was not taken away when he ascended. He was touched and heard here on earth in human form. Second Earth? No, I don't believe so. It is still Heaven, a much, much better place.\n\n \n I would agree that it is a much better place. Ask yourself, what makes you happy? For me some of what makes me happy are girls, music, movies, friends, conversation, sports, computers, the outdoors, feeling the sun on my face, racing cars, and of course building a relationship with God. Now what would Heaven be without these things? If there isn't a campground where I can stretch out and relax the day away in Heaven then it isn't perfect. If there are not dogs and cats and lions in Heaven then it isn't perfect. If I can't ramp my seadoo over the waves of an ocean in Heaven then it is not perfect. I believe God made Heaven and Earth in a similar way because it was the best possible design he could create. Now Heaven is probably void of most evil, there is not as much pain but there is probably some because what is eternity without getting a few bumps and bruises along the way, and you can probably have anything you want. So Heaven will be much better than Earth but I think it will also share a great deal of similarities.\n \n \nWar in the Heavenlies? Yes, everyday.\n\n \n Yep I agree. Even the angels apparently have free will and as long as God lets that exist there will be conflicts. I hope it stays that way forever.", 
   {
    "unicode_changes_made": true
   }, 
   45105, 
   null, 
   1082587920.0
  ], 
  [
   45182, 
   null, 
   "Big Orn", 
   "AMD4EVER, you milked an answer from me, one that I felt would bruise my credibility in this thread, and you have not given it the least bit of attention? That was the spark to the gist, if you will.", 
   {}, 
   45126, 
   null, 
   1082593380.0
  ], 
  [
   45203, 
   null, 
   "AMD4EVER", 
   "AMD4EVER, you milked an answer from me, one that I felt would bruise my credibility in this thread, and you have not given it the least bit of attention? That was the spark to the gist, if you will.\n\n \n I did give it attention but it seems to me that not only doesn't even pertain to the core of this debate but also you didn't want to have to expand upon it any further. You again indicate in this post that you don't even like that you wrote it so I judged correctly and yet I am scolded for doing so? I have no idea what you want from me exactly in this debate. If you want to take this in the direction that you were in your last post then why not act like you do?", 
   {}, 
   45182, 
   null, 
   1082598480.0
  ], 
  [
   45218, 
   null, 
   "Alone", 
   "This is interesting, a thread that begins with comments on contradictions and misinformation presented in the bible.\n \n We can be certain the bible was written by mortals, mortals with their greatest intentions can and will misrepresent ideas and events. So what is this discussion really about, whether the author(s) words should be considered set in stone, or the message? Because I get the vibe its the author(s) representation not the message. Later", 
   {}, 
   13529, 
   null, 
   1082602560.0
  ], 
  [
   45234, 
   null, 
   "AMD4EVER", 
   "This is interesting, a thread that begins with comments on contradictions and misinformation presented in the bible.\n \n We can be certain the bible was written by mortals, mortals with their greatest intentions can and will misrepresent ideas and events. So what is this discussion really about, whether the author(s) words should be considered set in stone, or the message? Because I get the vibe its the author(s) representation not the message. Later\n\n \n So basically God in his great power and perfection cannot even find an accurate way of getting his message across? He leaves the important job of presenting Jesus to the world to mortal authors who get the story wrong? Ouch.", 
   {}, 
   45218, 
   null, 
   1082610720.0
  ], 
  [
   45273, 
   null, 
   "Big Orn", 
   "I did give it attention but it seems to me that not only doesn't even pertain to the core of this debate but also you didn't want to have to expand upon it any further. You again indicate in this post that you don't even like that you wrote it so I judged correctly and yet I am scolded for doing so? I have no idea what you want from me exactly in this debate. If you want to take this in the direction that you were in your last post then why not act like you do?\n\n You did? Where? And I didn't indicate anything of the kind. Quit skirting the issue.\n Like I said, I have been here before and it is inevitable that things I refer to, that is not written, will be purposely dismissed. If you insist that the Bible is wrong and that God is imperfect, then it is my duty to point out things that you may have overlooked, or, at least, have not connected to another scripture - \"rightly dividing the scriptures...\".\n If you feel it unnecessary to comment on it; fine, let me know and we will carry on, but please don&#8217;t ask for something and then shrug it off.\n \nI can assure you that my beliefs are not locked in. I have shifted a long ways since the actual beginning of this thread almost a year ago. Initially I was of the belief the Bible was flawed indicating God didn't exist. Today I understand that the Bible is probably not flawed but it is our understanding of God that is flawed. But one thing has remained, I don't believe the perfect God theory and the literal Bible can co-exist. But that is just my opinion for now as well.\n\n Good. That is why I am involved, also. Maybe not for the same reason, but due to the basis for that reason. Old ideas die hard and I am certainly open for new ones. Just as man has developed over the years industrially, so I believe can the spirit of man and his perception of the Truth.\n \nThere again, don't ask for proof in a debate such as this.\n\n Fair enough.\n \nWhat does his not being hard headed have to do with his apparently flawed plan? He has shown over time that he is unable to successfully map out his ultimate design. Doesn't it seem a little odd to you that his plan is so off the map right now that he is planning on destroying it with his second coming and has already tried to destroy it once in the past with the great flood? He also had to put down a rebellion in his own domain in Heaven. If this doesn't seem odd to you I would like to know why you believe the way you do. I can't see any good explaination as to how his plan can be perfect if he is going to have to end the world just to set it straight.\n\n His understanding of things in general, His foreseen outcome of circumstances does not mean that those conditions/situations cannot be changed through prayer. Just because He says He will do a thing, doesn&#8217;t necessarily mean He will carry through with it. In Malachi chapter 3 He almost begs us to try Him and see if He will not do a certain thing that will bring about blessings to us, so much so, that we will not be able to hold them all. He wants us to ask of Him so that He can change things.\n \nTo go further would not prove us narrow-minded. To be unwilling to go further would go to prove someone as close-minded. We are debating this issue for a reason here and that is to get a better understanding of our own theories as well as others that are out there. I'm not worried about exploring other possible explainations because I am not \"in love with\" my current beliefs. If you say something that breaks everything I used to think I believed about God then I am happy for it as it means I've made a step in the right direction. I would hope that you believe the same.\n\n I was referring to Him failing or His plan failing &#8211; not the thread. I should have said so. But, to continually whack away at Him instead of that idea would be fruitless. Again, I should have said that. My bad.\n \nConsider that we lived in a perfect world where everyone lived free and happy and there were no worries. Lets pretend the people who lived in that world looked at what God had done in our less than perfect world. He has commanded people to go to war. He has cast down plagues and caused much misery to a few. He has also allowed souls that he created to be condemned to eternal suffering. Now do you think that in a perfect world that these would be considered sins? I sure do and I believe that the only reason we don't see them as sins is because we live in a very sin filled existance where it is all common place to us. So it depends on the perspective you have as to whether God is capable of sinning or not. Had his ultimate plan worked to a T, I don't believe people would have accepted the idea that God could be capable of causing death or misery in any way, shape, or form.\n\n I would like to think that Compassion has arrived in the New Testament and that what once was has been fulfilled and discharged. Lessons have been learned and changes have been made. Let&#8217;s get through those times when man was so full of himself and see the new things. Let&#8217;s drink that New Wine that was and still is offered to us. God can hurt, has been hurt, and to create us in His image and give us the freedom to choose good or evil is His sign of unconditional love. So, this life, this time on earth is a test &#8211; let&#8217;s take it.\n \nI would agree that it is a much better place. Ask yourself, what makes you happy? For me some of what makes me happy are girls, music, movies, friends, conversation, sports, computers, the outdoors, feeling the sun on my face, racing cars, and of course building a relationship with God. Now what would Heaven be without these things? If there isn't a campground where I can stretch out and relax the day away in Heaven then it isn't perfect. If there are not dogs and cats and lions in Heaven then it isn't perfect. If I can't ramp my seadoo over the waves of an ocean in Heaven then it is not perfect. I believe God made Heaven and Earth in a similar way because it was the best possible design he could create. Now Heaven is probably void of most evil, there is not as much pain but there is probably some because what is eternity without getting a few bumps and bruises along the way, and you can probably have anything you want. So Heaven will be much better than Earth but I think it will also share a great deal of similarities.\n\n My view of Heaven is different in style, but of the same contents. I will hunt and fish, ride my horse over endless trails, see new and beautiful things &#8211; everyday. But, mostly, no more pain and suffering. I guess I&#8217;ll find out when I get there.", 
   {}, 
   45234, 
   null, 
   1082642880.0
  ], 
  [
   45422, 
   null, 
   "Alone", 
   "Originally posted by AMD4EVER So basically God in his great power and perfection cannot even find an accurate way of getting his message across? He leaves the important job of presenting Jesus to the world to mortal authors who get the story wrong? Ouch. \n \n \n \n They got the message wrong? Could you expand on that one? \n \n In order for you to declare a prophecy false, one would have to know the beginning and ending of time. Do you?\n \n Its not the message non believers focus on, its the use of doubt to affirm the non believer idea. \n \n On a side note:\n \n Anyone have any idea why the quote function isn't an option for me?", 
   {}, 
   45273, 
   null, 
   1082683320.0
  ], 
  [
   45427, 
   null, 
   "Alone", 
   "AMD4EVER originally posted by:\n \n What does his not being hard headed have to do with his apparently flawed plan? He has shown over time that he is unable to successfully map out his ultimate design.\n \n Flawed plan, that is an interesting statement. The plan is to get as many into heaven as possible. Simple plan to me, what do you think? \n \n \n AMD4EVER originally posted by:\n \n Doesn't it seem a little odd to you that his plan is so off the map right now that he is planning on destroying it with his second coming and has already tried to destroy it once in the past with the great flood? He also had to put down a rebellion in his own domain in Heaven. If this doesn't seem odd to you I would like to know why you believe the way you do. I can't see any good explaination as to how his plan can be perfect if he is going to have to end the world just to set it straight. \n \n \n I could just as easily call the end of life as we know it, a new beginning of something better, or as most call it \"born again\", I don't think that is such a bad thing.\n \n While I can't answer as to why the devil or rebellion as you call it existed, how can we be sure it wasn't either planned by God, or to another extent, the author(s) being colorful in their explanation of the devils origins?\n \n 4AMD4EVER originally posted by:\n Consider that we lived in a perfect world where everyone lived free and happy and there were no worries. Lets pretend the people who lived in that world looked at what God had done in our less than perfect world. He has commanded people to go to war. He has cast down plagues and caused much misery to a few. He has also allowed souls that he created to be condemned to eternal suffering. Now do you think that in a perfect world that these would be considered sins? \n \n \n Actually in a perfect world such things wouldn't happen to begin with, with that said we cannot take away what is and has been in our current state. I never thought of it before but I feel you have answered a question of mine. Its my understanding that in heaven we will not know anyone from our current lives, or at least history of our past, maybe we will remember just not the details, who knows? I do know now, thanks to you, that not remembering our past might be a must in a society of eternal happiness.\n \n \n \n AMD4EVER originally posted by:\n \n So it depends on the perspective you have as to whether God is capable of sinning or not. Had his ultimate plan worked to a T, I don't believe people would have accepted the idea that God could be capable of causing death or misery in any way, shape, or form.\n \n Again not sure of your reference to the perfect plan. Who else is capable of taking lives if not the creator, with which he may have a purpose, who knows? Then again its a hypothetical question that could not exist, a perfect people could not know sin or wrong doing, then they would no longer be perfect. Actually maybe they could if they accepted it and didn't cast judgement towards it, then would it really be a sin. Later", 
   {}, 
   45422, 
   null, 
   1082684460.0
  ], 
  [
   45457, 
   null, 
   "Rogue790", 
   "Hi AMD4EVER,\n \n \nSome Bible prophecies that failed to occur\n \n \n What you have to remember is the context in which the prophecy or verse was made in. Was it a threat? Did the verse involve poetic language (such as Psalms)? To whom was the verse intended to be for and what was the intended purpose? There are considerations that must be taken into account before declaring that the Bible is filled with inaccuracies. We might interpret the verses or prophecies differently to what they would have been many years ago. \n \n Let me expand on this. You quote many times that Psalms is filled with holes. This is not mean't to be \"accurate\" as such, i.e. not meant to be taken literally. The author of Psalms was a poet, and as a result he used poetic language. So what the Bible bashers do, they take it literally and say, \"Well here you go, the Bible cannot be trusted\". But they are missing a very vital truth, Psalms is meant to be taken as a poetic book. The author uses a lot of figurative language to express himself.", 
   {
    "post_info": {
     "post_title": "Biblical Inaccuracy"
    }
   }, 
   11862, 
   null, 
   1082715240.0
  ], 
  [
   45462, 
   null, 
   "billsco", 
   "[b]\n Flawed plan, that is an interesting statement. The plan is to get as many into heaven as possible. Simple plan to me, what do you think? \n \n [\n\n \n Hi Alone (jw),\n \n If the plan is to get as many into heaven as possible, one would need to start with heaven, not end with it, IMO.\n \n As far as the quote function, I notice there are two options to respond: click the reply button inside the post on the bottom right or click the reply button on the lower left. Using the inside right button will allow you to use quotes. \n \n regards", 
   {}, 
   45427, 
   null, 
   1082727300.0
  ], 
  [
   45572, 
   null, 
   "AMD4EVER", 
   "You did? Where? And I didn't indicate anything of the kind. Quit skirting the issue.\n\n \n Where do you think? Didn't I alread cover this?\n \n \nLike I said, I have been here before and it is inevitable that things I refer to, that is not written, will be purposely dismissed. If you insist that the Bible is wrong and that God is imperfect, then it is my duty to point out things that you may have overlooked, or, at least, have not connected to another scripture - \"rightly dividing the scriptures...\".\n If you feel it unnecessary to comment on it; fine, let me know and we will carry on, but please don't ask for something and then shrug it off.\n\n \n Well then lets go on with this. OK so Satan falls from Heaven. Now he has his own realm of power to interfere with God's intentions. Uh one moment. Didn't God win in this war? If so, how did Satan actually become more powerful and God less powerful in controlling his own creation of Earth and man? This is evidence that Satan actually won in his war against God. Would a perfect God actually take the consequences of defeat in victory over pure evil?\n \n \nHis understanding of things in general, His foreseen outcome of circumstances does not mean that those conditions/situations cannot be changed through prayer.\n\n \n We are not talking about some little change that can be done through prayer. We are talking about his entire plan falling apart just as it was getting started with Adam and Eve. If he had a plan then how did it go so wrong right off the bat?\n \n \nJust because He says He will do a thing, doesn't necessarily mean He will carry through with it. In Malachi chapter 3 He almost begs us to try Him and see if He will not do a certain thing that will bring about blessings to us, so much so, that we will not be able to hold them all. He wants us to ask of Him so that He can change things.\n\n \n OK so things can change through prayer. This doesn't really explain a whole lot though. God gave his word to the people of Babylon twice and both times he let them down without any fair warning. People died horrible deaths in the name of God and both times God went back on his word. Plus lets not forget that the second battle was supposed to result in repayment for the first battle to the Babylonians. It actually ended up being the undoing of all of Babylon while Egypt is still here today.\n \n \nI would like to think that Compassion has arrived in the New Testament and that what once was has been fulfilled and discharged. Lessons have been learned and changes have been made. Let's get through those times when man was so full of himself and see the new things. Let's drink that New Wine that was and still is offered to us. God can hurt, has been hurt, and to create us in His image and give us the freedom to choose good or evil is His sign of unconditional love. So, this life, this time on earth is a test - let's take it.\n\n \n What does this have to do with anything? Why not try and defend the fact that God killing or ordering the killing of anyone would have been considered a sin had his plan ultimately gone as planned. If this is true then it is not hard to believe that under different and worse circumstances that God may have found it suitable to turn further to the darker side than he is today.\n \n \nMy view of Heaven is different in style, but of the same contents. I will hunt and fish, ride my horse over endless trails, see new and beautiful things - everyday. But, mostly, no more pain and suffering. I guess I'll find out when I get there.\n\n \n Well, as long as the Bible is accurate we may just get there yet. However I wouldn't just assume that I will get into Heaven as it is not up to me. I'll do my best with the time I have.", 
   {
    "unicode_changes_made": true
   }, 
   45273, 
   null, 
   1082777760.0
  ], 
  [
   45574, 
   null, 
   "AMD4EVER", 
   "They got the message wrong? Could you expand on that one?\n\n \n If you read this thread you will find what I'm talking about.\n \n \nIn order for you to declare a prophecy false, one would have to know the beginning and ending of time. Do you?\n\n \n Uhhh, why would I have to know the beginning and end of time? Wouldn't it be conveninent though to use this excuse as a reason to dismiss my debate as if you can do this then no prophecy can ever be proven false. Blind faith indeed.\n \n Anyways, you can historically pin point when this prophecy should have taken place. It was right after one war which we can pin point, in a location which we can pin point, and under a certain leader who we can pin point. The event however didn't occur as it was fore told.\n \n \nIts not the message non believers focus on, its the use of doubt to affirm the non believer idea. \n\n \n Have I mentioned that I am a believer? My reason for focusing on doubt is because I believe in the God that is described in the Bible. He is not what people here interpret him to be. He is not perfect and he is not all knowing. Why is that so hard to believe if you have read the Bible?", 
   {}, 
   45422, 
   null, 
   1082778060.0
  ], 
  [
   45576, 
   null, 
   "AMD4EVER", 
   "Flawed plan, that is an interesting statement. The plan is to get as many into heaven as possible. Simple plan to me, what do you think? \n \n \n If it was so simple then how did a perfect God fail to attain the maximum number of people getting into heaven possible?\n \n \nI could just as easily call the end of life as we know it, a new beginning of something better, or as most call it \"born again\", I don't think that is such a bad thing.\n\n \n But that ensures the end of his original plan. The very fact that it doesn't sound bad to do this indicates that his original plan was bad.\n \n \nWhile I can't answer as to why the devil or rebellion as you call it existed, how can we be sure it wasn't either planned by God, or to another extent, the author(s) being colorful in their explanation of the devils origins?\n\n \n If God planned for the Devil to exist then he is not sane. He looks to accomplish all that is good right? At the same time he looks to bring evil to the world? Now let me quote you: \"The plan is to get as many into heaven as possible.\" Mission: Failed.\n \n \nActually in a perfect world such things wouldn't happen to begin with, with that said we cannot take away what is and has been in our current state.\n\n \n That isn't my point. My point is that the people in the perfect world would see God ordering killing as a sin that couldn't happen. Therefore is this is a possibility and God has ordered killings without it being a sin then it is also possible that in an ever worse world God could rain down fire across the world killing whoever he felt like killing without it being considered a sin. Basically what we are seeing here is that God defines what sin is so he can do whatever he wants without sinning.\n \n \nI never thought of it before but I feel you have answered a question of mine. Its my understanding that in heaven we will not know anyone from our current lives, or at least history of our past, maybe we will remember just not the details, who knows? I do know now, thanks to you, that not remembering our past might be a must in a society of eternal happiness.\n\n \n Well all you have to do is ask yourself if you wish to remember your past. If the answer is yet then it is inevitable that the perfect society will encompass this. If not then it is not perfect. That is how you can define right here and now what Heaven will be.", 
   {}, 
   45427, 
   null, 
   1082778540.0
  ], 
  [
   45577, 
   null, 
   "AMD4EVER", 
   "Let me expand on this. You quote many times that Psalms is filled with holes. This is not mean't to be \"accurate\" as such, i.e. not meant to be taken literally. The author of Psalms was a poet, and as a result he used poetic language. So what the Bible bashers do, they take it literally and say, \"Well here you go, the Bible cannot be trusted\". But they are missing a very vital truth, Psalms is meant to be taken as a poetic book. The author uses a lot of figurative language to express himself.\n\n \n I've posted and focused on some key failed prophecies so you can judge them for yourself. For my money I would have to believe that they are genuine failed prophecies and that this can not be denied.", 
   {}, 
   45457, 
   null, 
   1082778660.0
  ], 
  [
   45598, 
   null, 
   "Rogue790", 
   "I've posted and focused on some key failed prophecies so you can judge them for yourself. For my money I would have to believe that they are genuine failed prophecies and that this can not be denied.\n\n To AMD4EVER:\n I agree, some of them may not have happened by a straight forward reading of the BIble, but if it is supposed to be interpreted by the people of the day a different way, then it would not be a \"failed prophecy\". This is the problem when trying to dismiss books of really old age - you don't know in which context it was written in, it's meaning and whether or not it was interpreted differently by the people of the day. \n \n Let us just say that I give you the benefit of the doubt, there are still many prophecies that have come true too. I thankyou for your original thread starting post, it was ideed quite interesting. Most of them I could dismiss, but others are a little bit harder. God Bless.", 
   {}, 
   45577, 
   null, 
   1082802360.0
  ], 
  [
   45603, 
   null, 
   "AMD4EVER", 
   "To AMD4EVER:\n I agree, some of them may not have happened by a straight forward reading of the BIble, but if it is supposed to be interpreted by the people of the day a different way, then it would not be a \"failed prophecy\". This is the problem when trying to dismiss books of really old age - you don't know in which context it was written in, it's meaning and whether or not it was interpreted differently by the people of the day.\n\n \n Just remember that people of the day went to war against Tyre and Egypt for these prophecies and were defeated. They clearly believed in them.", 
   {}, 
   45598, 
   null, 
   1082814180.0
  ], 
  [
   45606, 
   null, 
   "Rogue790", 
   "Just remember that people of the day went to war against Tyre and Egypt for these prophecies and were defeated. They clearly believed in them.\n\n To AMD4EVER:\n I find this part of the prophecy against Egypt interesting though. In Ezekiel 29:15-16 we are told \"the weakest kingdom of all [Egypt], and they will never again rule other nations. I will make them so unimportant that they will not be able to bend any other nation to their will. Israel will never again depend on them for help.\" How true is this? Has Israel ever depended on Egypt since their slaverly in the time of Moses? Could Egypt bend other \"nations\" to do their will (either back then or now)? I think not. $$ Possibly prophecy correct?\n \n I have a question for you, how do you know that the war on Tyre and Egypt failed? I mean, the Bible doesn't say what the outcome of such battles was - at least not that I have read yet - which is needless to say, kind of weird. Possibly it is implying that there is a different interpretation rather than the ones that we are talking about? But Ezekiel 32:17 titled \"The World of the Dead\" seems to be pretty clear that the Egyptians were all going to get mowed down. I do not have a real great knowledge of ancient history and hence am unsure about this issue. I haven't yet read all of the Bible, and unfortuantely have not yet read Ezekiel. When in chapter 33: 21 titled \"The News of Jerusalem's Fall\", who defeated it? emoticon_emb \n \n Thanking you ahead of your response. emoticon_zzzz \n Rogue", 
   {
    "post_info": {
     "post_title": "Ezekiel 29 prophecy correct?"
    }
   }, 
   45603, 
   null, 
   1082817480.0
  ], 
  [
   45682, 
   null, 
   "AMD4EVER", 
   "To AMD4EVER:\n I find this part of the prophecy against Egypt interesting though. In Ezekiel 29:15-16 we are told \"the weakest kingdom of all [Egypt], and they will never again rule other nations. I will make them so unimportant that they will not be able to bend any other nation to their will. Israel will never again depend on them for help.\" How true is this? Has Israel ever depended on Egypt since their slaverly in the time of Moses? Could Egypt bend other \"nations\" to do their will (either back then or now)? I think not. $$ Possibly prophecy correct?\n\n \n OK lets say that I grant you that this part came true. However if I were to list off the actual events that were to take place according to the prophecy you would quickly realize that this part is insignificant. They biggest purpose to the prophecy was to have Babylon get repaid for their war against Tyre. Babylon got defeated and was soon after gone from this earth. They trusted the word of God and in the end it was their downfall. That is not how a prophecy is supposed to work. If God was standing behind you and said fall back into my arms and you trusted him to catch you, how would you feel if he just let you just drop? That is what happens in this prophecy to Babylon.\n \n \nI have a question for you, how do you know that the war on Tyre and Egypt failed?\n\n \n Tyre is an easy one. Just read the Bible and you will see that it spells out that Tyre was a failed prophecy. That is the only reason that I am able to let the one slide. Because God actually went back and said \"Oops, my bad. This prophecy will not be fulfilled.\" That didn't happen with the Egyptian prophecy and had it occurred then I would have nothing to debate here.\n \n The war with Egypt failed because Babylon was supposed to destroy all of Egypt and Egypt's allies. This would have left Babylon to become the power in the region. Today Egypt would not exist while Babylon probably still would.\n \n \nI mean, the Bible doesn't say what the outcome of such battles was - at least not that I have read yet - which is needless to say, kind of weird.\n\n \n But it does state what is supposed to take place in these battles. Babylon is repaid and Egypt falls. Babylon's armies were to march to the very southern edges of Egypt and into Libia to the East. The fact is that they only got to the Siani before they were pushed back.\n \n \nPossibly it is implying that there is a different interpretation rather than the ones that we are talking about? But Ezekiel 32:17 titled \"The World of the Dead\" seems to be pretty clear that the Egyptians were all going to get mowed down. I do not have a real great knowledge of ancient history and hence am unsure about this issue. I haven't yet read all of the Bible, and unfortuantely have not yet read Ezekiel. When in chapter 33: 21 titled \"The News of Jerusalem's Fall\", who defeated it? emoticon_emb \n \n Thanking you ahead of your response. emoticon_zzzz \n Rogue\n\n \n I'm not sure about the Jerusalem quote and haven't even studied it. Do you believe it is of some significance? If so paste a few verses of it here along with some of your own info on the subject. I'd be interested to read about it.", 
   {}, 
   45606, 
   null, 
   1082861160.0
  ], 
  [
   45725, 
   null, 
   "Alone", 
   "Quote:\n Originally Posted by Alone\n They got the message wrong? Could you expand on that one? \n \n \n If you read this thread you will find what I'm talking about.\n \n Actually I read this thread and it contains information that has been compiled by yourself, or others, to support an idea, as to whether they are proven or factual for that matter, in what they show, I can't be sure of that, not sure you can either.\n \n Quote:\n In order for you to declare a prophecy false, one would have to know the beginning and ending of time. Do you? \n \n \n Uhhh, why would I have to know the beginning and end of time? Wouldn't it be conveninent though to use this excuse as a reason to dismiss my debate as if you can do this then no prophecy can ever be proven false. Blind faith indeed.\n \n Blind faith is what its all about, right? Convenient maybe? But you would in fact have to know the beginning and end to determine if a phrophecy were false or not, unless you can with 100% certainty say, it should have happened at a certain point in time. How can you be so sure?\n \n Anyways, you can historically pin point when this prophecy should have taken place. It was right after one war which we can pin point, in a location which we can pin point, and under a certain leader who we can pin point. The event however didn't occur as it was fore told.\n \n \n You said it yourself, should, which demonstrates doubt, meaning your not sure yourself. You wanna be 100% sure don't you, we are talking about a huge decision here, heaven or hell.\n \n Quote:\n Its not the message non believers focus on, its the use of doubt to affirm the non believer idea. \n \n \n Have I mentioned that I am a believer? My reason for focusing on doubt is because I believe in the God that is described in the Bible. He is not what people here interpret him to be. He is not perfect and he is not all knowing. Why is that so hard to believe if you have read the Bible?\n \n No, actually I am not sure where you stand, you believe there is a God but the God of the bible isn't possible. How do you know that they aren't one and the same? I have read the bible and there were a lot of things that I quite frankly don't understand, but I did not get the impression that the God of the bible couldn't exist, its all about perspective I suppose.", 
   {}, 
   45574, 
   null, 
   1082913840.0
  ], 
  [
   45729, 
   null, 
   "Alone", 
   "Quote:\n Originally Posted by Alone\n Flawed plan, that is an interesting statement. The plan is to get as many into heaven as possible. Simple plan to me, what do you think? \n \n \n If it was so simple then how did a perfect God fail to attain the maximum number of people getting into heaven possible?\n \n How do you know He didn't/won't?\n \n Quote:\n I could just as easily call the end of life as we know it, a new beginning of something better, or as most call it \"born again\", I don't think that is such a bad thing. \n \n \n But that ensures the end of his original plan. The very fact that it doesn't sound bad to do this indicates that his original plan was bad.\n \n I disagree totally here, you have determine God has two plans? I see it as a continuation of the original one, and I am unsure how you believe there were two plans.\n \n Quote:\n While I can't answer as to why the devil or rebellion as you call it existed, how can we be sure it wasn't either planned by God, or to another extent, the author(s) being colorful in their explanation of the devils origins? \n \n \n If God planned for the Devil to exist then he is not sane. He looks to accomplish all that is good right? At the same time he looks to bring evil to the world? Now let me quote you: \"The plan is to get as many into heaven as possible.\" Mission: Failed.\n \n To say that okay God decided that he must send the devil down, was a mistake, the goal is as many saved lives. Could it be that being God has an ability to see past now, in such a way we cannot imagine, and forsaw what might happen if that had not happened? I know its a stretch, but with that said, how can you be so sure that wasn't the case? You would have to assume that everything beginned and ended in that moment, of which God send the devil out of heaven. Maybe God forsaw something you couldn't have. Who knows?\n \n Quote:\n Actually in a perfect world such things wouldn't happen to begin with, with that said we cannot take away what is and has been in our current state. \n \n \n That isn't my point. My point is that the people in the perfect world would see God ordering killing as a sin that couldn't happen. Therefore is this is a possibility and God has ordered killings without it being a sin then it is also possible that in an ever worse world God could rain down fire across the world killing whoever he felt like killing without it being considered a sin. Basically what we are seeing here is that God defines what sin is so he can do whatever he wants without sinning.\n \n I know what your saying, but in a perfect world God wouldn't have to issue the destruction of his creation, now would he? He issued destruction of his creation in an imperfect world. How do you know it wasn't the right choice?\n \n Quote:\n I never thought of it before but I feel you have answered a question of mine. Its my understanding that in heaven we will not know anyone from our current lives, or at least history of our past, maybe we will remember just not the details, who knows? I do know now, thanks to you, that not remembering our past might be a must in a society of eternal happiness. \n \n \n Well all you have to do is ask yourself if you wish to remember your past. If the answer is yet then it is inevitable that the perfect society will encompass this. If not then it is not perfect. That is how you can define right here and now what Heaven will be.\n \n Sorry but this didn't make any sense to me what so ever. I nor you live in a perfect society in heaven, so for you to say,\" Well all you have to do is ask yourself if you wish to remember your past.\" I must ask you how you know this? Later", 
   {}, 
   45725, 
   null, 
   1082914740.0
  ], 
  [
   45731, 
   null, 
   "Alone", 
   "Hi Alone (jw),\n \n If the plan is to get as many into heaven as possible, one would need to start with heaven, not end with it, IMO.\n \n As far as the quote function, I notice there are two options to respond: click the reply button inside the post on the bottom right or click the reply button on the lower left. Using the inside right button will allow you to use quotes. \n \n regards\n\n \n \n Appreciate it, I see how the quote function works, its automatic.\n \n \n I suppose you might be right to a point, however, it did start with heaven or at least what we know from the bible. I like yourself, am not aware of the events that occured before the devil was outcast or the events leading up to that, so who knows? I would assume there was some form of existance of some kind, being there were angels and God. So maybe there was a reason for some of the events/choices we don't understand. Who knows? Later", 
   {}, 
   45462, 
   null, 
   1082915160.0
  ], 
  [
   45737, 
   null, 
   "AMD4EVER", 
   "Actually I read this thread and it contains information that has been compiled by yourself, or others, to support an idea, as to whether they are proven or factual for that matter, in what they show, I can't be sure of that, not sure you can either.\n\n \n If you read this thread you will see that basing this section of verses on what was said earlier in Zek it can be shown that it is supposed to be mostly literal. If it is taken mostly literally then you can see that it didn't actually occur. Therefore either it is a failed prophecy or someone didn't pass the message on correctly. That is what you would have learned had you read this thread.\n \n \nBlind faith is what its all about, right? Convenient maybe? But you would in fact have to know the beginning and end to determine if a phrophecy were false or not, unless you can with 100% certainty say, it should have happened at a certain point in time. How can you be so sure?\n\n \n Blind faith is not what it is all about. You should know a little something about what you are putting your faith into or you could be scammed by the likes of Satan.\n \n How can I be sure? The Bible stays so. Babylon was to be repaid for their losses in Tyre with their war with Egypt. They then had a war with Egypt and were not repaid. Now Babylon is gone and so is their king. There will be no repayment in the future. That time has already come and gone.\n \n \nYou said it yourself, should, which demonstrates doubt, meaning your not sure yourself. You wanna be 100% sure don't you, we are talking about a huge decision here, heaven or hell.\n\n \n \"Should\" demonstrates that it was supposed to take place however it did not. I should have washed the car doesn't mean that I doubt I should have washed the car. I means I was supposed to but I didn't.\n \n \nNo, actually I am not sure where you stand, you believe there is a God but the God of the bible isn't possible. How do you know that they aren't one and the same? I have read the bible and there were a lot of things that I quite frankly don't understand, but I did not get the impression that the God of the bible couldn't exist, its all about perspective I suppose.\n\n \n First off I'm positive of the fact that the belief in a perfect and all-knowing God cannot coincide with the Bible being accurate. That I have no doubts about at this point for reasons I've already given you. That is how I'm sure they are not one in the same. Secondly I believe that people are flawed and interpret the Bible in an inaccurate way. They disregarded some obvious facts about the Bible and make God into something he is not. Just by taking the facts about the Bible and the theoretical into account such as what would be sin in a perfect society, you would see that God is not perfect nor is he all knowing.", 
   {}, 
   45725, 
   null, 
   1082917860.0
  ], 
  [
   45741, 
   null, 
   "AMD4EVER", 
   "How do you know He didn't/won't?\n\n \n Maximum possible is 100%. Currently we already know there is at least Satan who is not in heaven. Therefore he failed.\n \n \nI disagree totally here, you have determine God has two plans? I see it as a continuation of the original one, and I am unsure how you believe there were two plans.\n\n \n I believe God had an original plan but it failed almost right away. Once Adam and Eve brought sin into the world it had already failed. His was a plan of perfection, not one mixed with sin and evil. He tried to correct the plan a second time with the flooding of the world but it also failed. Now he will just bring an end to his original plan with his second coming. So I do only believe he has one plan but I do believe he has been working to try and get it back on track for some time with no success.\n \n \nTo say that okay God decided that he must send the devil down, was a mistake, the goal is as many saved lives. Could it be that being God has an ability to see past now, in such a way we cannot imagine, and forsaw what might happen if that had not happened?\n\n \n Could you imagine him being able to see the rise of Satan coming long before he even created Satan yet he creates him anyways? I sure can't see him doing this.\n \n \nI know its a stretch, but with that said, how can you be so sure that wasn't the case? You would have to assume that everything beginned and ended in that moment, of which God send the devil out of heaven. Maybe God forsaw something you couldn't have. Who knows?\n\n \n It is only a stretch because you fail to take into consideration that this means God knew what he was creating when he first created Satan and also knew what he was doing when he put Satan in a position of power.\n \n \nI know what your saying, but in a perfect world God wouldn't have to issue the destruction of his creation, now would he? He issued destruction of his creation in an imperfect world. How do you know it wasn't the right choice?\n\n \n This really isn't about figuring out whether it was the right choice or not. It is about deciding exactly whether there is a limit on what God would do if things got bad enough. Assuming in a perfect world God would do only what is perfect and in an imperfect world God would do thing imperfectly then can we also say it is possible that in a world of pure evil God would do things that are evil by what our standards are right now? I don't think you can deny that God acts in a way similar to those who he creates. This shows God not to be perfect because ultimately if he created creatures who were evil enough he himself would probably go along those lines.\n \n \nSorry but this didn't make any sense to me what so ever. I nor you live in a perfect society in heaven, so for you to say,\" Well all you have to do is ask yourself if you wish to remember your past.\" I must ask you how you know this? Later\n\n \n Because Heaven is perfect. If you want to remember your past in heaven and you are not allowed to then how can it be perfect? Perfection requires a great deal of things to be met and this would be one of them. Therefore all you have to do is ask yourself what do you consider perfect and that is what Heaven will have to be in order for it to be perfect.", 
   {}, 
   45729, 
   null, 
   1082918640.0
  ], 
  [
   45857, 
   null, 
   "Big Orn", 
   "Where do you think? Didn't I alread cover this?\n\n Perhaps this is better left alone for now.\n \nWell then lets go on with this. OK so Satan falls from Heaven. Now he has his own realm of power to interfere with God's intentions. Uh one moment. Didn't God win in this war? If so, how did Satan actually become more powerful and God less powerful in controlling his own creation of Earth and man? This is evidence that Satan actually won in his war against God. Would a perfect God actually take the consequences of defeat in victory over pure evil?\n\n The objective of trials and tribulations is to prove the merits of the heart. God is not a puppet master. He will not force his will on anyone &#8211; even Satan. God shows us the path, tells us how we should travel it, gives us substance and asks us to take that first step. If we feel He is wrong, then we have the freedom to reject His will. However, there are many other paths that we can take; some paths lead away from Heaven (if you accept that Heaven is a place and not a direction), some longer, more arduous trails that eventually could lead to Heaven. But, His will is just that: His desire. Good and evil must be present, evidently, in order to make life&#8217;s circuit. Evil is required to test the good when it comes to humankind and vice versa. So, in essence, God wants us to make a choice. That is why when Satan drooled on himself in Heaven and stated that he was just as &#8220;good&#8221; as God, that God launched him to earth. When he and his bunch crashed, they were the &#8220;Lords of the Air&#8221;. Now, that goes back to the age-old question: Why create man and put him in such a hostile environment? Answer &#8211; to test him and see what he chooses; Good or evil.\n If you choose to believe that winning that battle is proof that God&#8217;s plan failed, just look at what Satan gained and how God is using that &#8220;win&#8221; to make a more perfect and valuable tenant (you and I) of His Kingdom.\n My opinion: There will be a day (time) when those that have chosen Good over evil will fight in a war so great that all of God&#8217;s creation(s) will be in peril. It is in that battle that those earth-tested souls will be worth more than any other being ever created.\n \nWe are not talking about some little change that can be done through prayer. We are talking about his entire plan falling apart just as it was getting started with Adam and Eve. If he had a plan then how did it go so wrong right off the bat?\n\n As stated above, the plan did not go wrong&#8230;it just seems that way. Adam and Eve made a bad choice. The Lord of the Air was in control, even in the Garden of Eden. Not in control as we might think it, but in control of his duties, playing into the hand of God to promote our strength. Sounds crazy, right? No, more than that, downright vicious and cruel on the part of God. But, evil had to perform its duty in order for the test to be complete and substantiated and, ultimately, initiated. To be frank, Satan (Lucifer) helped God create the test paper by proxy, and, like the bad little boy in class, God allowed him to hand it out.\n \nOK so things can change through prayer. This doesn't really explain a whole lot though. God gave his word to the people of Babylon twice and both times he let them down without any fair warning. People died horrible deaths in the name of God and both times God went back on his word. Plus lets not forget that the second battle was supposed to result in repayment for the first battle to the Babylonians. It actually ended up being the undoing of all of Babylon while Egypt is still here today.\n\n I am still trying to find a problem here. I have noticed that you have referred to this before and I will try to answer you when I get enough information. I need to ascertain whether it is the physical or spiritual Babylon/Egypt subject to begin with, however. Even if you tell me you are referring to the physical, I cannot answer at this time.\n \nWhat does this have to do with anything? Why not try and defend the fact that God killing or ordering the killing of anyone would have been considered a sin had his plan ultimately gone as planned. If this is true then it is not hard to believe that under different and worse circumstances that God may have found it suitable to turn further to the darker side than he is today.\n\n &#8220;To turn further to the darker side than He is today&#8221;, would suggest that you feel He is movable, in respect to disposition, which I do not believe. But, let us examine that. In the translation of the Word of God to English, the implication of the phrases, &#8220;God killing&#8221;, or &#8220;His orders to kill&#8221;, could have been corrupted as meaning an evil function. But, in my view, it is not the doing away with evil (or evil kingdoms/principalities), but the saving of the good/righteous entities of earth.\n \n BTW &#8211; This being a new dispensation has everything to do with it.\n \nHowever I wouldn't just assume that I will get into Heaven as it is not up to me. I'll do my best with the time I have.\n\n I would like to know, since it is a choice, just who/whom is it up to? If you follow the guidelines, do the right things, why would it be up to anyone else, including God, but you?", 
   {}, 
   45741, 
   null, 
   1082998320.0
  ], 
  [
   45968, 
   null, 
   "AMD4EVER", 
   "The objective of trials and tribulations is to prove the merits of the heart. God is not a puppet master. He will not force his will on anyone - even Satan. God shows us the path, tells us how we should travel it, gives us substance and asks us to take that first step. If we feel He is wrong, then we have the freedom to reject His will. However, there are many other paths that we can take; some paths lead away from Heaven (if you accept that Heaven is a place and not a direction), some longer, more arduous trails that eventually could lead to Heaven. But, His will is just that: His desire. Good and evil must be present, evidently, in order to make life's circuit. Evil is required to test the good when it comes to humankind and vice versa. So, in essence, God wants us to make a choice. That is why when Satan drooled on himself in Heaven and stated that he was just as \"good\" as God, that God launched him to earth. When he and his bunch crashed, they were the \"Lords of the Air\". Now, that goes back to the age-old question: Why create man and put him in such a hostile environment? Answer - to test him and see what he chooses; Good or evil.\n If you choose to believe that winning that battle is proof that God's plan failed, just look at what Satan gained and how God is using that \"win\" to make a more perfect and valuable tenant (you and I) of His Kingdom.\n My opinion: There will be a day (time) when those that have chosen Good over evil will fight in a war so great that all of God's creation(s) will be in peril. It is in that battle that those earth-tested souls will be worth more than any other being ever created.\n\n \n First off how is it that God would be forcing his will upon Satan by keeping him from power anymore than he is forcing his will upon sinners who he sends to hell?\n \n Also, why create man in a hostile environment just to see if he chooses good or evil. If God is all-knowing then he can know this answer without having to test it. It would be like me getting out a calculator to verify that 2+2=4. There has to be another reason as to why he created a hostile environment.\n \n I guess your opinion could be correct assuming that God intended evil to exist in the first place as what other reason could there be for it ultimately? However if God is supposed to be good in everyway then he should find no need for evil to exist. So I don't buy into that theory. It makes God out to be a brute which I guess I accept as a possibility considering how he acts in the Bible but that I'm sure is not how you are trying to say we should view him.\n \n \nAs stated above, the plan did not go wrong...it just seems that way. Adam and Eve made a bad choice. The Lord of the Air was in control, even in the Garden of Eden. Not in control as we might think it, but in control of his duties, playing into the hand of God to promote our strength. Sounds crazy, right? No, more than that, downright vicious and cruel on the part of God. But, evil had to perform its duty in order for the test to be complete and substantiated and, ultimately, initiated. To be frank, Satan (Lucifer) helped God create the test paper by proxy, and, like the bad little boy in class, God allowed him to hand it out.\n\n \n Lets put it this way. If I were God maybe my primitive mind would make me want to see evil and pain to exist even for my most beloved creatures. However we have to look beyond that idea since we are talking about God here. He is far more sophisticated than you are giving him credit for. He would not need to test anything in order to find the outcome. There would be no reason to do so. He knows all and is perfect meaning if he tried to predict something he would always be correct. Therefore he had to know everything that would occur before he tested it.\n \n Now lets assume God is not all-knowing and is not perfect. Suddenly what you are saying makes sense. This is the type of logic that shows that God is not all-knowing and perfect. He is far more similar to our way of thinking than most people would tend to believe and logic such as yours supports this.\n \n \nI am still trying to find a problem here. I have noticed that you have referred to this before and I will try to answer you when I get enough information. I need to ascertain whether it is the physical or spiritual Babylon/Egypt subject to begin with, however. Even if you tell me you are referring to the physical, I cannot answer at this time.\n\n \n Thats fine, take your time. Clearly I'm in no rush as it has almost been one year now since I started this topic.\n \n \n\"To turn further to the darker side than He is today\", would suggest that you feel He is movable, in respect to disposition, which I do not believe.\n\n \n Isn't this fact the crux of our debate? You believe his is one way and I believe he is another? However I have shown why it makes sense that he is moveable. In a perfect world he wouldn't be ordering the killing of anyone. In our world he does order the killing of people. Therefore in a worse world it is possible that he would move even further to the darkside. I don't see how you can debate this. He responds to our world based on how good or bad our world is. He would have to unless you want to debate that he would ask people to go to war in a perfect world where there is no reason for war. So basically what I am saying is that just like the people in the perfect world wouldn't know it was possible for God to ask for killing since it is not required in their world, we may not know the full extent of how far to the darkside God can go since we don't require him to go any further at this time.\n \n \nBut, let us examine that. In the translation of the Word of God to English, the implication of the phrases, \"God killing\", or \"His orders to kill\", could have been corrupted as meaning an evil function. But, in my view, it is not the doing away with evil (or evil kingdoms/principalities), but the saving of the good/righteous entities of earth.\n\n \n You can word it any way you want. Still people in the perfect world would deny that it is possible for him to do either because they would never have seen it happen. How can you be sure there are worse things that God would do but we just haven't seen him do it?\n \n \nI would like to know, since it is a choice, just who/whom is it up to? If you follow the guidelines, do the right things, why would it be up to anyone else, including God, but you?\n\n \n Your suggesting it is not up to God who gets into heaven? You believe that you can just will your way there? I'm not so sure of that but I'm also not going to get into this type of debate here. We will just go one thing at a time.", 
   {
    "unicode_changes_made": true
   }, 
   45857, 
   null, 
   1083025200.0
  ], 
  [
   46072, 
   null, 
   "Big Orn", 
   "First off how is it that God would be forcing his will upon Satan by keeping him from power anymore than he is forcing his will upon sinners who he sends to hell?\n\n God does not force anyone to &#8220;go to hell&#8221;. It is a choice. Deuteronomy 30:19 says, &#8220;Today I have given you the choice between life and death, between blessings and curses. I call on heaven and earth to witness the choice you make. Oh, that you would choose life, that you and your descendants might live.&#8221; If we choose life, then we must also choose how to live it. Also, good and evil cannot occupy the same space. I am not saying that it cannot coexist, but that it cannot, by God&#8217;s law of things, come from the same vessel. James 3:11-12 says, &#8220;Does a fountain, at the same spout, supply both sweet water and bitter? Does a fig tree bear olive berries? No, and neither can a fountain yield salt water and fresh.&#8221;\n So, by Satan&#8217;s choice, he and God could not occupy Heaven. Satan chose that position and in doing so chose to be cast out.\n \nAlso, why create man in a hostile environment just to see if he chooses good or evil. If God is all-knowing then he can know this answer without having to test it. It would be like me getting out a calculator to verify that 2+2=4. There has to be another reason as to why he created a hostile environment.\n\n If there is another reason, it has eluded me. I believe that your calculator example would be better compared to a drug that could be tested to prey on cancerous cells.\n \nI guess your opinion could be correct assuming that God intended evil to exist in the first place as what other reason could there be for it ultimately? However if God is supposed to be good in everyway then he should find no need for evil to exist. So I don't buy into that theory. It makes God out to be a brute which I guess I accept as a possibility considering how he acts in the Bible but that I'm sure is not how you are trying to say we should view him.\n\n The &#8220;brute&#8221; sometimes seems, to me, to be life itself, but never God. He has clearly established the boundaries &#8211; not because he loves to see us corralled like animals, but to keep us within His shadow, under His wing, so to speak, like a hen with chicks. It is when we leave that protection that we place ourselves in position to be vulnerable to evil.\n \nLets put it this way. If I were God maybe my primitive mind would make me want to see evil and pain to exist even for my most beloved creatures. However we have to look beyond that idea since we are talking about God here. He is far more sophisticated than you are giving him credit for. He would not need to test anything in order to find the outcome. There would be no reason to do so. He knows all and is perfect meaning if he tried to predict something he would always be correct. Therefore he had to know everything that would occur before he tested it. \n\n That is my point&#8230;He is more like us than we know. I believe He grieves, cries, laughs. He is the source of our emotions. When he formed us, He gave us His being. That is what is so hard for the church-world and the non-believers to grasp. When we hurt so does He; when we find joy and peace, He feels it also. I believe this passionately. When I said earlier that God cannot be moved, I meant it as changed, which was my meaning of &#8220;His disposition&#8221;. He is one thing, in this life and forever, that is stable and can be counted on.\n \nNow lets assume God is not all-knowing and is not perfect. Suddenly what you are saying makes sense. This is the type of logic that shows that God is not all-knowing and perfect. He is far more similar to our way of thinking than most people would tend to believe and logic such as yours supports this. \n\n I agree only with the last statement. This, however, does not imply that He is imperfect. All-knowing? My concept of His power cannot allow me to believe otherwise. He must know or He would not have put His Word in the hearts of men as such. He wouldn&#8217;t lie, can&#8217;t lie. That is my belief. \n \nIsn't this fact the crux of our debate? You believe his is one way and I believe he is another? However I have shown why it makes sense that he is moveable. In a perfect world he wouldn't be ordering the killing of anyone. In our world he does order the killing of people. Therefore in a worse world it is possible that he would move even further to the darkside. I don't see how you can debate this. He responds to our world based on how good or bad our world is. He would have to unless you want to debate that he would ask people to go to war in a perfect world where there is no reason for war. So basically what I am saying is that just like the people in the perfect world wouldn't know it was possible for God to ask for killing since it is not required in their world, we may not know the full extent of how far to the darkside God can go since we don't require him to go any further at this time. \n\n You are right in that I cannot dispute your belief in this. Not only that, but I feel that I don&#8217;t have the right to do so.\n But, let me say that I believe otherwise and to debate this would be fruitless. Let&#8217;s just let that belief rest in ourselves, since neither you nor I have the evidence to support our beliefs.\n \nYou can word it any way you want. Still people in the perfect world would deny that it is possible for him to do either because they would never have seen it happen. How can you be sure there are worse things that God would do but we just haven't seen him do it? \n\n I can&#8217;t be sure. I am fairly certain that He can do terrible and wonderful things beyond our human imaginations.\n \n[I]Your suggesting it is not up to God who gets into heaven? You believe that you can just will your way there? I'm not so sure of that but I'm also not going to get into this type of debate here. We will just go one thing at a time.\n\n I&#8217;m with you, brother. So, with the voice of Carl of Sling Blade, &#8220;Awight, ten!&#8221;", 
   {}, 
   45968, 
   null, 
   1083078840.0
  ], 
  [
   46305, 
   null, 
   "AMD4EVER", 
   "God does not force anyone to \"go to hell\". It is a choice.\n\n \n If it is a choice then after we make the choice is it ourselves who lead us to hell or does God have something to do with it? I think you are getting a little rediculous in saying God doesn't force his will on anyone as that would mean that I can do whatever I want in this life and then still go to heaven just because I want to.\n \n \nIf there is another reason, it has eluded me. I believe that your calculator example would be better compared to a drug that could be tested to prey on cancerous cells.\n\n \n My calculator example shows the futility of doing a test at all when the answer is apparent. God would already know the answer so there would be no reason for a test. The fact that you cannot think of another reason doesn't mean there isn't another reason. My reasoning would be that God just wanted to create humans. What could be more simple? He just wanted humans to exist. He wanted to create a world for us. He wanted us to be good on in this life so that after we died he could accept us into heaven. Why couldn't this possibly be a reason?\n \n \nThe \"brute\" sometimes seems, to me, to be life itself, but never God.\n\n \n Didn't God create life?\n \n \nHe has clearly established the boundaries - not because he loves to see us corralled like animals, but to keep us within His shadow, under His wing, so to speak, like a hen with chicks. It is when we leave that protection that we place ourselves in position to be vulnerable to evil.\n\n \n Do you think a hen with chicks wishes for her young to ever stray? If the hen could make it possible for them to be protected no matter what don't you think the hen would do this? The simple and obvious answer is that yes it would make no sense for a hen to create an evil enemy that could hurt the chicks if there was no need to create one. It wouldn't make sense.\n \n \nThat is my point...He is more like us than we know.\n\n \n So now you believe that God has no reason to \"test\" us. Why exactly did you just say a few paragraphs ago that the only explaination for this hostile environment is for us to be tested?\n \n \nI believe He grieves, cries, laughs. He is the source of our emotions. When he formed us, He gave us His being. That is what is so hard for the church-world and the non-believers to grasp. When we hurt so does He; when we find joy and peace, He feels it also. I believe this passionately. When I said earlier that God cannot be moved, I meant it as changed, which was my meaning of \"His disposition\". He is one thing, in this life and forever, that is stable and can be counted on.\n\n \n I agree that the church-world has no idea what God is like and they portray him in the wrong way.\n \n \nI agree only with the last statement. This, however, does not imply that He is imperfect. All-knowing? My concept of His power cannot allow me to believe otherwise. He must know or He would not have put His Word in the hearts of men as such. He wouldn't lie, can't lie. That is my belief. \n\n \n If he is all-knowing then he wouldn't need to test us. If he was perfect and knew what the results of a test were before it was necessary to perform a test then he wouldn't perform the test at all. That would be perfection. Therefore since we know he performed the test we can say he is imperfect as it was a redundant act. Ignoring all the rest of the flaws in his \"test\" it is still apparent that he has something wrong with him indicating he is not perfect.\n \n \nYou are right in that I cannot dispute your belief in this. Not only that, but I feel that I don't have the right to do so.\n But, let me say that I believe otherwise and to debate this would be fruitless. Let's just let that belief rest in ourselves, since neither you nor I have the evidence to support our beliefs.\n\n \n This debate requires no evidence at all. It also isn't a belief. It is hard fact. It is possible based on the logic I laid out that God may act worse if the world is a worse place. There is no proof that he would but I wasn't trying to prove that. The fact is that since this is true then God creating sin actually made him worse. Evil has actually impacted God. Now you can debate this if you like but I don't think it is possible to deny at this point. Wouldn't this change your perspective on God?", 
   {
    "unicode_changes_made": true
   }, 
   46072, 
   null, 
   1083113460.0
  ], 
  [
   46402, 
   null, 
   "Big Orn", 
   "If it is a choice then after we make the choice is it ourselves who lead us to hell or does God have something to do with it? I think you are getting a little rediculous in saying God doesn't force his will on anyone as that would mean that I can do whatever I want in this life and then still go to heaven just because I want to.\n\n Ridiculous? If I portray that it is because you have no room for anything else but your own belief(s). Am I so unreasonable that I say I know for a fact that these things occur? No, you&#8217;re the one that clings to that principle. I, on the other hand, claim that it is my belief. Plan A you go here, Plan B; there. That is the way it is in God&#8217;s scheme of things.\n \nMy calculator example shows the futility of doing a test at all when the answer is apparent. God would already know the answer so there would be no reason for a test. The fact that you cannot think of another reason doesn't mean there isn't another reason. My reasoning would be that God just wanted to create humans. What could be more simple? He just wanted humans to exist. He wanted to create a world for us. He wanted us to be good on in this life so that after we died he could accept us into heaven. Why couldn't this possibly be a reason?\n\n You hit the nail on the head. That is exactly why He created us &#8211; the same thing I have been saying all along. I am glad that we have established another parcel of common ground.\n \n We can now tear that page from the book.\n \nDidn't God create life? \n\n As far as I know, this is the only &#8220;way of life&#8221; in this realm of reality. It is harsh, unfair, and unforgiving. For some it is too much to bear, but it is the only chance we have to prove which &#8220;side of the river&#8221; we stand on. Suffering and pain reside here; but so does love and comfort. Enduring this life per His policy is, to me, the ticket.\n \nDo you think a hen with chicks wishes for her young to ever stray? If the hen could make it possible for them to be protected no matter what don't you think the hen would do this? The simple and obvious answer is that yes it would make no sense for a hen to create an evil enemy that could hurt the chicks if there was no need to create one. It wouldn't make sense.\n\n When did you feel that you had to stray from the shadow of God? For me it was quite early, around the time I discovered girls and trucks, which is not a bad thing, but it did tend to make me doubt why I needed Him. Without His corporeal squawk to hail me I closed off the spiritual and allowed the flesh to thrive. Through all this (years) His spiritual pull tugged at me, but I ignored it. He knew what was out there, lying in wait, but, like the hen, all his cries fell on deaf ears. I claim the responsibility of my failures. He was and still is my refuge, but back then I could care less.\n I will certainly not blame Him for not returning to the safety of His wings when He called.\n And, it only makes sense if you believe that God created evil in order to test us &#8211; and it seems imprudent to proclaim it a test, but I have no better explanation &#8211; so that we can realize His desire.\n \nSo now you believe that God has no reason to \"test\" us. Why exactly did you just say a few paragraphs ago that the only explaination for this hostile environment is for us to be tested?\n\n Where did this come from? How could you ask that, given my reply? If I believe He is the author and finisher of our faith, how can I not believe He knows and fully understands human nature? How can He guide a spirit and soul unless He understands and has felt human emotions? Not only that He experienced it 2000 years ago&#8230;and He has the scars to prove it.\n \n I am sticking with the &#8220;test&#8221; belief. Trials and tribulations. 1Peter 4:12-13 states, &#8220;Don&#8217;t think it&#8217;s strange concerning the fiery trials, which is to try (test) you, as though some strange thing has happened to you; but rejoice to the extent that you partake (participate) of Christ&#8217;s sufferings, that when His glory is revealed, you may also be glad with exceeding joy.&#8221; \n This passage has kept me safe and has been the &#8220;hen&#8217;s wings&#8221; so many times these past few years. I can believe no other way, despite how religion wants to corrupt the scriptures, especially this one.\n Diamonds are almost pure carbon, the same element that makes up graphite, but so very different. How can two materials with basically the same chemical composition be so different? Carbon atoms deep in the earth are exposed to enormous heat and pressure over millions of years then make their journey from miles below the earth to the surface via volcanic activity. I see this as a process corresponding to our development here on earth. Without that heat and pressure, that carbon is just &#8220;an old chunk of coal&#8221;.\n \nI agree that the church-world has no idea what God is like and they portray him in the wrong way.\n\n Yet another piece of common ground.\n \nIf he is all-knowing then he wouldn't need to test us. If he was perfect and knew what the results of a test were before it was necessary to perform a test then he wouldn't perform the test at all. That would be perfection. Therefore since we know he performed the test we can say he is imperfect as it was a redundant act. Ignoring all the rest of the flaws in his \"test\" it is still apparent that he has something wrong with him indicating he is not perfect.\n\n Again, I cannot debate this since you&#8217;re &#8220;locked in&#8221; to this belief&#8230;or fact as you say below:\n \nThis debate requires no evidence at all. It also isn't a belief. It is hard fact. It is possible based on the logic I laid out that God may act worse if the world is a worse place. There is no proof that he would but I wasn't trying to prove that. The fact is that since this is true then God creating sin actually made him worse. Evil has actually impacted God. Now you can debate this if you like but I don't think it is possible to deny at this point. Wouldn't this change your perspective on God?\n\n If this debate requires no evidence, how is your &#8220;fact&#8221; substantiated?\n Yes, we are here, on earth, because Evil has impacted God. Changed Him? No. Made an impression on God? Yes. That impression was that God knew that Evil could be chosen over good and that it could happen for apparently no reason, simply because evil existed. In evil lies an imperfect reasoning. Through that imperfection of mind, pain and suffering were fashioned. That is the reason he tells us, My son, do not make light of the Lord's discipline, and do not lose heart when he rebukes you, because the Lord disciplines those he loves, and he punishes everyone he accepts as a son.&#8221; Endure hardship as discipline; God is treating us as sons. For what son is not disciplined by his father? If you are not disciplined (and everyone undergoes discipline), then we are illegitimate children and not true sons. Moreover, we have all had human fathers who disciplined us and we respected them for it. How much more should we submit to the Father of our spirits and live? Our fathers disciplined us for a little while as they thought best; but God disciplines us for our good, that we may share in his holiness. (Hebrews 12:5-10)", 
   {}, 
   46305, 
   null, 
   1083169020.0
  ], 
  [
   46435, 
   null, 
   "AMD4EVER", 
   "Ridiculous? If I portray that it is because you have no room for anything else but your own belief(s). Am I so unreasonable that I say I know for a fact that these things occur? No, you're the one that clings to that principle. I, on the other hand, claim that it is my belief. Plan A you go here, Plan B; there. That is the way it is in God's scheme of things.\n\n \n OK, I'll take your word for it.\n \n \nYou hit the nail on the head. That is exactly why He created us - the same thing I have been saying all along. I am glad that we have established another parcel of common ground.\n \n We can now tear that page from the book.\n\n \n Excellent. I'm glad we are off the testing debate.\n \n \nAs far as I know, this is the only \"way of life\" in this realm of reality. It is harsh, unfair, and unforgiving. For some it is too much to bear, but it is the only chance we have to prove which \"side of the river\" we stand on. Suffering and pain reside here; but so does love and comfort. Enduring this life per His policy is, to me, the ticket.\n\n \n So was life intended to be this way upon our creation or did it just occur this way due to random events like Satan's rebellion and Eve eating the apple? I can buy into the idea that is was intended to be this way but I cannot buy into the fact that Satan's rebellion and Eve eating the apple unexpectedly made this world from a place intended to be perfect into a place that involved evil. I had to be in God's original plan for it to involved evil if God is perfect and all-knowing. This in turn will bring back the question why did God create evil in this world if not to test us? If to test us then why does he need to test us when he already knows the answer?\n \n \nAnd, it only makes sense if you believe that God created evil in order to test us - and it seems imprudent to proclaim it a test, but I have no better explanation - so that we can realize His desire.\n\n \n Do are you concluding that God has created evil intentionally? Also if he had not created evil wouldn't we more easily realize his desires?\n \n \nWhere did this come from? How could you ask that, given my reply? If I believe He is the author and finisher of our faith, how can I not believe He knows and fully understands human nature? How can He guide a spirit and soul unless He understands and has felt human emotions? Not only that He experienced it 2000 years ago...and He has the scars to prove it.\n\n \n To find where this came from you have to go back to the quote you were responding to when you wrote it. I should have been more specific in the question. Also he would clearly know just because he is all-knowing and able to anticipate what will happen if he does X or Y.\n \n \nI am sticking with the \"test\" belief. Trials and tribulations. 1Peter 4:12-13 states, \"Don't think it's strange concerning the fiery trials, which is to try (test) you, as though some strange thing has happened to you; but rejoice to the extent that you partake (participate) of Christ's sufferings, that when His glory is revealed, you may also be glad with exceeding joy.\" \n This passage has kept me safe and has been the \"hen's wings\" so many times these past few years. I can believe no other way, despite how religion wants to corrupt the scriptures, especially this one.\n Diamonds are almost pure carbon, the same element that makes up graphite, but so very different. How can two materials with basically the same chemical composition be so different? Carbon atoms deep in the earth are exposed to enormous heat and pressure over millions of years then make their journey from miles below the earth to the surface via volcanic activity. I see this as a process corresponding to our development here on earth. Without that heat and pressure, that carbon is just \"an old chunk of coal\".\n\n \n OK, I think I'm understanding that you have evolved your \"testing\" theory from God needing to test us to us needing to be tested, is this correct? If this is correct then I have to debate that the human spirit by default is already a diamond at birth. Evil corrupts it and causes it to require reforming into a diamond again just as your spirit has done. But this simply doesn't make sense. If there was no evil then we would all be diamonds for our entire lives. What is the point of evil breaking us down just so we have to rebuild ourselves when it would work much better to just not have evil and have us live a life that is purely good and one that is devoted to God?\n \n \nAgain, I cannot debate this since you're \"locked in\" to this belief...or fact as you say below:\n\n \n What is \"locked in\" is the definition of perfection. I'm sure you have your own \"locked in\" view of what perfection means. Now use your own analysis of a situation and determine whether it meets the requirements of something that is perfect. If I knew 2+2=4 wouldn't it be perfect for me to not have to verify that 2+2=4 by using a calculator? It would be a waste of time, energy, and a worthless use of the battery resources of the calculator. Unless you disagree with me here how can you defend that a perfect God would perform a test when he already knows the outcome?\n \n \nIf this debate requires no evidence, how is your \"fact\" substantiated?\n\n \n Because it is a theory. The theory doesn't say what is but it says what is possible. I made this very clear. It is possible that in a better world God would act with less vengence and anything else that can be similar to evil. It is possible that in a worse world that God would act with more vengence ect. This has to be factual because if the world is perfect then God cannot order the killing of people otherwise the world wouldn't be perfect. In our world God does order the killing of people. This in itself proves the theory correct because it means God has to be better in a perfect world than he is here. It is not about me being hard headed about anything. If you can show me where I am going wrong I'll gladly discuss it with an open mind. However I ask that you open your mind to this as well and think about what I am saying.\n \n \nYes, we are here, on earth, because Evil has impacted God. Changed Him? No. Made an impression on God? Yes.\n\n \n Actually the earth is the way it is because of evil, not that we are on earth because of evil. We were on earth before evil. I'm glad to see you are saying it has made an impression on him because that is exactly what I've been saying yet you told me I was \"locked in\" with some view because I said it. Also the fact that evil impacted God and earth also shows us that initially there was no test that would be provided for us. That means the idea of testing developed after evil was incorporated meaning it wasn't part of the plan.\n \n \nThat impression was that God knew that Evil could be chosen over good and that it could happen for apparently no reason, simply because evil existed. In evil lies an imperfect reasoning. Through that imperfection of mind, pain and suffering were fashioned. That is the reason he tells us, My son, do not make light of the Lord's discipline, and do not lose heart when he rebukes you, because the Lord disciplines those he loves, and he punishes everyone he accepts as a son.\" Endure hardship as discipline; God is treating us as sons. For what son is not disciplined by his father? If you are not disciplined (and everyone undergoes discipline), then we are illegitimate children and not true sons. Moreover, we have all had human fathers who disciplined us and we respected them for it. How much more should we submit to the Father of our spirits and live? Our fathers disciplined us for a little while as they thought best; but God disciplines us for our good, that we may share in his holiness. (Hebrews 12:5-10)\n\n \n From my perspective I see that evil has created this situation. Without it there would be no need for it. No tests, no suffering, no pressure. There would be happiness and close ties with God. A perfect situation. Either God wanted evil to exist and ruin a perfect situation or something happened that he didn't expect causing evil to exist. Either way I don't think this coincides with a Christian God but that is just my opinion.", 
   {
    "unicode_changes_made": true
   }, 
   46402, 
   null, 
   1083176460.0
  ], 
  [
   46496, 
   null, 
   "Alone", 
   "AMD4EVER\n \n So far we both offered up possibilities and shoulda coulda woulda's but nothing in the way of fact, and neither is buying it. \n \n We can agree that the bible has been translated over and over across different languages, not to mention there has been or from what I have been told, there have been parts edited by one person or another. So who is to say the parts you have pointed out where merely overlooked in the editing process, who knows? Why would someone intentionally print something that contradicts itself in some cases? \n \n What do you suggest? Focus on things that may or may not be inaccuracies in the bible and potentially take away hope and feed an atheist mind, or take it all as a whole and focus on the message. \n \n And contrary to one of your earlier replies, it is all about blind faith, it even states that in the bible. To reply to another reply, something to the effect how do you know the devil isn't behind the bible, why would he? Doing evil and wrong has an attraction like no other, or at least from what I can tell of the world I live in.\n \n Another comment you made 100% is the best that God could get into heaven, actually no, there was already 1 that was evil from the get go, so 100% was an impossibility. Again why things happened form that point, who knows, I don't, should he have destroyed the devil, sure, why didn't he? Can't say, I don't know. I do believe there would have to be a bigger picture, you say if God knows all and sees all then why not change us? Could it be its because he is larger than us that he knows all and sees all? Example, you take a simple animal and watch it, you know how it will react in certain situation, but if you let it be without directing it, it makes certain decision on its own, yet even then you have an idea of how the outcome will be. What if God is on such a level that we are like the simple animal, wouldn't he know all?\n \n This statement you made contradicts itself:\n \n I believe God had an original plan but it failed almost right away. Once Adam and Eve brought sin into the world it had already failed. His was a plan of perfection, not one mixed with sin and evil. He tried to correct the plan a second time with the flooding of the world but it also failed. Now he will just bring an end to his original plan with his second coming. So I do only believe he has one plan but I do believe he has been working to try and get it back on track for some time with no success.\n \n First you say two plans, now one? This goes back to a statement I made previously, unless you know the beginning and end of time, there is no way you know if this plan is gonna work or not. You know the old saying, \" Don't count your chickens before they hatch.\" This is also an example of how the bible may have been worded wrong but due to interpretation. You find things in the bible that contradict, could it have happened similarly to your reply? What if it was merely one or two people writing a text trying to get a certain point across and they clashed and went overlooked. If you can update or reinvent your ideas, I am sure the author(s) of the bible could very well have done the same to get a certain idea or thought across, they were mortal as yourself.\n \n You reworded and original reply for me:\n \n Because Heaven is perfect. If you want to remember your past in heaven and you are not allowed to then how can it be perfect? Perfection requires a great deal of things to be met and this would be one of them. Therefore all you have to do is ask yourself what do you consider perfect and that is what Heaven will have to be in order for it to be perfect.\n \n \n I would also have to consider myself right 100% of the time, oddly enough, I do not, so my idea of a perfect heaven may not be whats best for me or anyone else, I visualize this place being for many not just myself.\n \n When you made this comment:\n \n If you read this thread you will see that basing this section of verses on what was said earlier in Zek it can be shown that it is supposed to be mostly literal. If it is taken mostly literally then you can see that it didn't actually occur. Therefore either it is a failed prophecy or someone didn't pass the message on correctly. That is what you would have learned had you read this thread.\n \n Again we disagree, the message has been passed on successfully, its the details your hung up on, of which, could have been misinterpreted by a mortal author(s).\n \n Another comment:\n \n \"Should\" demonstrates that it was supposed to take place however it did not. I should have washed the car doesn't mean that I doubt I should have washed the car. I means I was supposed to but I didn't.\n \n Then you would need basis of why the car needed to be washed that point in time. In the case of the bible discrepencies, no one has a basis of why an event should or shouldn't have happened with 100% certainty therefore, you don't know.\n \n \n Last one:\n \n \n First off I'm positive of the fact that the belief in a perfect and all-knowing God cannot coincide with the Bible being accurate. That I have no doubts about at this point for reasons I've already given you. That is how I'm sure they are not one in the same. Secondly I believe that people are flawed and interpret the Bible in an inaccurate way. They disregarded some obvious facts about the Bible and make God into something he is not. Just by taking the facts about the Bible and the theoretical into account such as what would be sin in a perfect society, you would see that God is not perfect nor is he all knowing.\n \n Your reasons are your beliefs, just because the bible may have aspects that could be or may be contradictions, doesn't mean that the God of the bible couldn't exist. I do however agree that people are flawed and interpret the Bible in an inaccurate way. There would be no sin in a perfect world, the bible state heaven will be perfect not your life on earth. So I don't get that aspect of your comment. I can state with confidence that you, nor myself, can grasp what a perfect heaven (world) would, or should, consist of. Later", 
   {}, 
   46305, 
   null, 
   1083185700.0
  ], 
  [
   46513, 
   null, 
   "Big Orn", 
   "So was life intended to be this way upon our creation or did it just occur this way due to random events like Satan's rebellion and Eve eating the apple? I can buy into the idea that is was intended to be this way but I cannot buy into the fact that Satan's rebellion and Eve eating the apple unexpectedly made this world from a place intended to be perfect into a place that involved evil. I had to be in God's original plan for it to involved evil if God is perfect and all-knowing. This in turn will bring back the question why did God create evil in this world if not to test us? If to test us then why does he need to test us when he already knows the answer?\n\n You want me to answer that one question: Does God know what I will do this evening? That is what you have asked all along. In the 39th reply, where I answered about choices, that should have given you some clue. If He knows whether or not I will choose Life or Death, He would not have (almost) begged me to choose life. If He knew I was going to Heaven He would have never made (and still making) me take this test. Again, this does not make Him imperfect. If I knew that that Tree of Knowledge was going to kill my son or daughter I would tell them, just like He did. If I knew that my children would partake of that tree I would not have planted it. I have never disagreed with you or anyone else in that respect. My problem with you (besides your hard-headedness &#8211; geez, you and Alone are alike in that respect, but I do admire it) is that you try your best to show that God is imperfect because His plan is not going in a certain direction. I can&#8217;t see that part and can&#8217;t see how you do.\n God put us here to test us, to see which route we want to take. Even if we take the &#8220;right road&#8221;, we still have to make other choices along the way. The old adage, &#8220;&#8230;all things work for the good&#8230;&#8221; is hogwash without the last part, which is, &#8220;&#8230;to them that love God, to them that are called according to His purpose.&#8221;\n \n&#8230;are you concluding that God has created evil intentionally? Also if he had not created evil wouldn't we more easily realize his desires?\n\n Yes\n Absolutely not. We would have no desire to do so. We would have no need in it. We would not be human beings to begin with, we would be in Heaven, riding horses, skiing, fishing, whatever our hearts desired.\n That wouldn&#8217;t be a bad thing at all&#8230;that&#8217;s why I&#8217;m focusing on getting there. But, that&#8217;s not how it is. God formed us with his hands from the dust. We are more special to Him than any other creature. Being that that&#8217;s the way things are and we are human and are put here to pick and choose, let&#8217;s face it: We have a job to do.\n Take and pass that test.\n [QUOTE]To find where this came from you have to go back to the quote you were responding to when you wrote it. I should have been more specific in the question. Also he would clearly know just because he is all-knowing and able to anticipate what will happen if he does X or Y.[QUOTE]\n Okay, let&#8217;s tear out another page.\n \nOK, I think I'm understanding that you have evolved your \"testing\" theory from God needing to test us to us needing to be tested, is this correct? If this is correct then I have to debate that the human spirit by default is already a diamond at birth. Evil corrupts it and causes it to require reforming into a diamond again just as your spirit has done. But this simply doesn't make sense. If there was no evil then we would all be diamonds for our entire lives. What is the point of evil breaking us down just so we have to rebuild ourselves when it would work much better to just not have evil and have us live a life that is purely good and one that is devoted to God?\n\n You got that part backwards &#8211; we are born a chunk of coal. Trials and tests bring out the diamond in us.\n I'm gonna kneel and pray every day\n Lest I should become vain along the way\n I'm just an old chunk of coal now, Lord\n But I'm gonna be a diamond someday!\n \nWhat is \"locked in\" is the definition of perfection. I'm sure you have your own \"locked in\" view of what perfection means. Now use your own analysis of a situation and determine whether it meets the requirements of something that is perfect. If I knew 2+2=4 wouldn't it be perfect for me to not have to verify that 2+2=4 by using a calculator? It would be a waste of time, energy, and a worthless use of the battery resources of the calculator. Unless you disagree with me here how can you defend that a perfect God would perform a test when he already knows the outcome?\n\n Yes, I am &#8220;locked in&#8221; on God&#8217;s perfection, but I don&#8217;t believe He is stupid enough to create a race of people, know who is going to fail, then fling them to the wolves anyway. Again, I have never argued with you on that part.\n \nBecause it is a theory. The theory doesn't say what is but it says what is possible. I made this very clear. It is possible that in a better world God would act with less vengence and anything else that can be similar to evil. It is possible that in a worse world that God would act with more vengence ect. This has to be factual because if the world is perfect then God cannot order the killing of people otherwise the world wouldn't be perfect. In our world God does order the killing of people. This in itself proves the theory correct because it means God has to be better in a perfect world than he is here. It is not about me being hard headed about anything. If you can show me where I am going wrong I'll gladly discuss it with an open mind. However I ask that you open your mind to this as well and think about what I am saying.\n\n Fact does not equal theory. Fact has evidence, theory is based on the analysis of a fact or a set of facts. Is it possible? Yes.\n The world is definitely not perfect, but it is no reflection on God. A person being killed is not an act of God. Are you talking about the Old Testament? Before we were delivered from that chaotic time? I am talking now, in this dispensation. All of that was fulfilled and discharged &#8211; it had its heyday. Let sleeping dogs lie.\n \nActually the earth is the way it is because of evil, not that we are on earth because of evil. We were on earth before evil. I'm glad to see you are saying it has made an impression on him because that is exactly what I've been saying yet you told me I was \"locked in\" with some view because I said it. Also the fact that evil impacted God and earth also shows us that initially there was no test that would be provided for us. That means the idea of testing developed after evil was incorporated meaning it wasn't part of the plan.\n\n Evil (Lucifer, Satan, the devil) was here long before we were. This does not rule out the need for the trying of our faith.\n \nFrom my perspective I see that evil has created this situation. Without it there would be no need for it. No tests, no suffering, no pressure. There would be happiness and close ties with God. A perfect situation. Either God wanted evil to exist and ruin a perfect situation or something happened that he didn't expect causing evil to exist. Either way I don't think this coincides with a Christian God but that is just my opinion.\n\n Yes, evil has created it, by proxy. It made God stand up and put His foot down. It gave Him the guts to put His children on the line, even Himself, to prove that good can overcome evil. That is just the way I want my God to be.\n I also love competitive sports. But, this is not a game; this is for keeps. If I may say so, you have a good idea, just keep God up there where He belongs&#8230;He earned His place; now we have to earn ours.", 
   {}, 
   46496, 
   null, 
   1083188460.0
  ], 
  [
   46524, 
   null, 
   "AMD4EVER", 
   "Another comment you made 100% is the best that God could get into heaven, actually no, there was already 1 that was evil from the get go, so 100% was an impossibility.\n\n \n So this just means God failed in heaven before he failed on earth.\n \n \nFirst you say two plans, now one?\n\n \n I don't recall stating that there were ever two plans and if I did then I wasn't thinking. I have been trying to debate that there was only one plan with several attempts to correct it.\n \n \nI would also have to consider myself right 100% of the time, oddly enough, I do not, so my idea of a perfect heaven may not be whats best for me or anyone else, I visualize this place being for many not just myself.\n\n \n I'm not saying that your view is perfect or that your view will take precidence over everyone elses in heaven. However for heaven to be perfect it is going to have to encompass all that you believe is perfect right now otherwise it will be missing something. Fishing may not be perfect but if you believe it is then heaven will have to incorporate it.\n \n \nAgain we disagree, the message has been passed on successfully, its the details your hung up on, of which, could have been misinterpreted by a mortal author(s).\n\n \n What details are you talking about? You mean about it being factual?\n \n \nYour reasons are your beliefs, just because the bible may have aspects that could be or may be contradictions, doesn't mean that the God of the bible couldn't exist.\n\n \n Since God is all powerful that means anything is possible. However using logic I've concluded that while it is possible it is also unlikely.\n \n Sorry for the short post but it looks like our debate here is winding down. You have your ground and I have mine. Guess we will just have to leave it at that.", 
   {}, 
   46496, 
   null, 
   1083191520.0
  ], 
  [
   46535, 
   null, 
   "AMD4EVER", 
   "You want me to answer that one question: Does God know what I will do this evening? That is what you have asked all along. In the 39th reply, where I answered about choices, that should have given you some clue. If He knows whether or not I will choose Life or Death, He would not have (almost) begged me to choose life. If He knew I was going to Heaven He would have never made (and still making) me take this test. Again, this does not make Him imperfect.\n\n \n That is not about him being perfect or imperfect. It is about him being all knowing or not being all knowing.\n \n \nIf I knew that that Tree of Knowledge was going to kill my son or daughter I would tell them, just like He did. If I knew that my children would partake of that tree I would not have planted it. I have never disagreed with you or anyone else in that respect. My problem with you (besides your hard-headedness - geez, you and Alone are alike in that respect, but I do admire it) is that you try your best to show that God is imperfect because His plan is not going in a certain direction. I can't see that part and can't see how you do.\n\n \n It isn't his plan alone that makes him seem imperfect. Simply put before he create mankind he must have had a reason for doing it. If that reason was to test us then he had to create evil to do so. But why would he test us at all if he is all-knowing and knows the end result? Also why make evil if he can just create a perfect plan that would result in happiness and 100% \"diamonds\"? I can't see how this is all supposed to mesh together. You can perhaps defend the all-knowing side of it but how can you defend why evil exists in the first place? If evil wasn't intended to exist in the first place then obviously the point of this who existance has nothing to do with a test as there was no intention of there being a test when time began.\n \n \nYes\n\n \n So now we are to the point where God creates evil intentionally in order to test us.\n \n \nAbsolutely not. We would have no desire to do so. We would have no need in it. We would not be human beings to begin with, we would be in Heaven, riding horses, skiing, fishing, whatever our hearts desired.\n That wouldn't be a bad thing at all...that's why I'm focusing on getting there. But, that's not how it is. God formed us with his hands from the dust. We are more special to Him than any other creature. Being that that's the way things are and we are human and are put here to pick and choose, let's face it: We have a job to do.\n Take and pass that test.\n\n \n How can you say there would be no desire to \"pass the test\" if there was no evil? Consider that heaven is essentially what we are talking about here only having it on earth. If it works in heaven then why wouldn't it work on earth?\n \n \nYou got that part backwards - we are born a chunk of coal. Trials and tests bring out the diamond in us.\n I'm gonna kneel and pray every day\n Lest I should become vain along the way\n I'm just an old chunk of coal now, Lord\n But I'm gonna be a diamond someday!\n\n \n What makes you think that we are not born diamonds? We are innocent with no sins on our record. Basically we are all that is good until we eventually learn to be bad. What changes have to be made from that point until you become a diamond?\n \n \nFact does not equal theory. Fact has evidence, theory is based on the analysis of a fact or a set of facts. Is it possible? Yes.\n\n \n Well lets call it a theorem then. A theory that is proven to be true. I don't know why this is a point of debate since my theory does have evidence as well as facts. But anyways lets just move on.\n \n \nEvil (Lucifer, Satan, the devil) was here long before we were. This does not rule out the need for the trying of our faith.\n\n \n Does the Bible state this to be true? I don't recall it being this way.\n \n \nYes, evil has created it, by proxy. It made God stand up and put His foot down. It gave Him the guts to put His children on the line, even Himself, to prove that good can overcome evil. That is just the way I want my God to be.\n\n \n While I find it hard to believe that God would intentionally create evil and use it to test us I can see where you are coming from. Personally it doesn't sit well with me but as long as evil existed before earth, all-knowing has limitations, and Gods plan always encompassed evil being a means of testing us, then I guess it could all work out.", 
   {
    "unicode_changes_made": true
   }, 
   46513, 
   null, 
   1083193140.0
  ], 
  [
   46569, 
   null, 
   "Big Orn", 
   "We can agree that the bible has been translated over and over across different languages, not to mention there has been or from what I have been told, there have been parts edited by one person or another. So who is to say the parts you have pointed out where merely overlooked in the editing process, who knows? Why would someone intentionally print something that contradicts itself in some cases?\n\n Good point, Alone. I have always maintained that to read the words is simply not enough. There are many mysteries in the Bible. It&#8217;s up to those that approach it with a desire to listen to discover them.\n \nDoing evil and wrong has an attraction like no other, or at least from what I can tell of the world I live in.\n\n Like a drug! And that&#8217;s what is so hard for young people to understand. Satan can and does transform himself into an &#8220;angel of light&#8221;.", 
   {}, 
   46496, 
   null, 
   1083197280.0
  ], 
  [
   46661, 
   null, 
   "Big Orn", 
   "That is not about him being perfect or imperfect. It is about him being all knowing or not being all knowing.\n\n Okay. That's fine. Let's not go there again, then. Let&#8217;s agree that God is more like us in that respect and let someone else throw in an idea.\n \nIt isn't his plan alone that makes him seem imperfect. Simply put before he create mankind he must have had a reason for doing it. If that reason was to test us then he had to create evil to do so.\n\n Reason for creating mankind: To form a creature that had freedom to choose either good or evil when and how they decided to choose; on their own terms.\n There was only God from everlasting to everlasting. Since that is my belief (and no one has been able to change my belief on that), I must believe that He created Evil = His opposite. How He did this is a mystery to me. (Maybe in my studies and meditation with Him he will reveal that reason)\n \n But why would he test us at all if he is all-knowing and knows the end result?\n\n I&#8217;ve answered that when I said that I do not believe He is all knowing. How can you anger or appease God at all if He is all knowing? The Bible clearly states that God gets angry and happy. If you knew ten years ago that you were going to win the lottery tomorrow would you be surprised? If you knew that your engine was going to blow next weekend would you be angry when it happened? Any other takers?\n \nAlso why make evil if he can just create a perfect plan that would result in happiness and 100% \"diamonds\"? I can't see how this is all supposed to mesh together.\n\n He created Lucifer. Lucifer had the evil in him. He started this whole mess and talked 1/3 of the angels into agreeing with him. He was cast out of God&#8217;s presence. Lucifer wants us to agree with him now. God wants the opposite. We are in the middle, in this place (earth) to let them both see which way we choose. BTW &#8211; Was King Midas thrilled that everything he touched turned to gold? Think about it. Life would be a bore&#8230;totally&#8230;and maybe even precarious.\n \nYou can perhaps defend the all-knowing side of it but how can you defend why evil exists in the first place?\n\n I have answered that.\n \nIf evil wasn't intended to exist in the first place then obviously the point of this who existance has nothing to do with a test as there was no intention of there being a test when time began.\n\n Not when time began, maybe. (I guess that would require a definition of &#8220;time&#8221;) But soon afterwards.\n \nSo now we are to the point where God creates evil intentionally in order to test us.\n\n I suppose so. Why not see it that way?\n \nHow can you say there would be no desire to \"pass the test\" if there was no evil? Consider that heaven is essentially what we are talking about here only having it on earth. If it works in heaven then why wouldn't it work on earth?\n\n Like I said, there would be no need in it. Lucifer would have never been created and we would not have this problem, hence why bother?\n \nWhat makes you think that we are not born diamonds? We are innocent with no sins on our record. Basically we are all that is good until we eventually learn to be bad. What changes have to be made from that point until you become a diamond?\n\n We are still humankind. That makes us have a sinful nature. We need to go through trials and tribulations in order to &#8220;see&#8221;; in order to allow our spirit-man to take over, conquering the flesh. If there is no &#8220;other place&#8221;, then we just return to dust, period. With His promise our bodies return to dust but our spirits go home to God. That&#8217;s why we must take and pass the &#8220;test&#8221;. Of course we can opt to deny there is a God and therefore deny there is a test. Life would be simply &#8220;cradle to grave&#8221;.\n \nWell lets call it a theorem then. A theory that is proven to be true. I don't know why this is a point of debate since my theory does have evidence as well as facts. But anyways lets just move on.\n\n Like Alone stated, your &#8220;facts&#8221; are based on written words, translated by humans, not spiritual words given by God. There is a difference.\n \nDoes the Bible state this to be true? I don't recall it being this way.\n\n Yes, evil was here long before mankind. He was the one that made the earth &#8220;&#8230;without form and void; and darkness (evil) was on the face of the deep&#8230;&#8221; as stated in Genesis 1:2.\n \nWhile I find it hard to believe that God would intentionally create evil and use it to test us I can see where you are coming from. Personally it doesn't sit well with me but as long as evil existed before earth, all-knowing has limitations, and Gods plan always encompassed evil being a means of testing us, then I guess it could all work out.\n\n Another agreement. If you can grasp that, then your idea(s) have a basis that can spark debate with the best of theologians.", 
   {}, 
   46569, 
   null, 
   1083246180.0
  ], 
  [
   46925, 
   null, 
   "Alone", 
   "Quote:\n Originally Posted by Alone\n Another comment you made 100% is the best that God could get into heaven, actually no, there was already 1 that was evil from the get go, so 100% was an impossibility. \n \n AMD4EVER\n \n So this just means God failed in heaven before he failed on earth.\n \n I dunno if I would call it failed. Like I mentioned before we know nothing about the existance of God before the bible, so unless you do, how can you say it was a failure on God's part? Or should I ask, how could you lay blame to God without knowing the details? If I were to believe that God controlled the angels and their choices/ thought process, then yeah, that would be perceived as a failure, but to my knowledge he wouldn't and didn't, God being compassionate could feel bad that the angel decided to go against him, but I don't feel that saying he failed is right by any stretch. Again there is NO proof whatsoever that God has failed on earth short of your opinion. Unless again, you know the end.\n \n \n Quote:\n I would also have to consider myself right 100% of the time, oddly enough, I do not, so my idea of a perfect heaven may not be whats best for me or anyone else, I visualize this place being for many not just myself. \n \n AMD4EVER\n \n I'm not saying that your view is perfect or that your view will take precidence over everyone elses in heaven. However for heaven to be perfect it is going to have to encompass all that you believe is perfect right now otherwise it will be missing something. Fishing may not be perfect but if you believe it is then heaven will have to incorporate it.\n \n I get what your saying, but you have to admit once you achieve the level of being in heaven amongst perfection, I am sure your priorities will change, so what you choose as your heaven may coincide with others and form a union of some sort, and be beyond simple things like \"I must fish non stop and catch 100lb fish to be in heaven\".\n \n Quote:\n Again we disagree, the message has been passed on successfully, its the details your hung up on, of which, could have been misinterpreted by a mortal author(s). \n \n AMD4EVER\n \n What details are you talking about? You mean about it being factual?\n \n The \"details\" I refer to are the things you pointed out as failures, or more importantly possible failures. If you focus less on the things that are obvious contradictions you should be able to see the message. Again, I hold to the belief that an obvious contradiction must just be an oversight, right or wrong thats how I feel. So instead of getting hung up on it and claiming there is no God, I am able to take in the message/ideas.\n \n \n Quote:\n Your reasons are your beliefs, just because the bible may have aspects that could be or may be contradictions, doesn't mean that the God of the bible couldn't exist. \n \n AMD4EVER\n \n Since God is all powerful that means anything is possible. However using logic I've concluded that while it is possible it is also unlikely.\n \n I agree with your first sentence. You pointed out contradictions in the bible, you would make a good editor, however, I don't feel you have proven much in the way of, the God of the bible could not be. I can open up an automotive repair manual for a 1940's automobile, find many mistakes and typos, but that doesn't mean the actual vehicle never existed just because I have never seen it.\n \n \n \n \n My point is simple, okay you have found possible contradictions in the bible that make some of the details kinda iffy but don't necessarily change the story or the meaning, what does that prove? At some point the translator made a mistake, at some point the editors made a mistake, or there can be no God of the bible. From my perspective, your assumption there is no God of the bible seems the most unrealistic of the options, and easiest of paths to take.", 
   {}, 
   46661, 
   null, 
   1083356160.0
  ], 
  [
   47007, 
   null, 
   "AMD4EVER", 
   "I agree with your first sentence. You pointed out contradictions in the bible, you would make a good editor, however, I don't feel you have proven much in the way of, the God of the bible could not be. I can open up an automotive repair manual for a 1940's automobile, find many mistakes and typos, but that doesn't mean the actual vehicle never existed just because I have never seen it.\n\n \n While I'd like to be done with this debate as I feel everyone has come as far as they can already I also feel I have to interject here. Comparing the Bible to an automotive repair manual isn't accurate. If the guy who wrote the book was said to be the greatest auto guru of all time who was never wrong and I could point out the mistakes in his book then that wouldn't disprove that the automobile existed but it would disprove that he was the greatest auto guru. It would make me think he was something different.\n \n That is the same with the Bible being inaccurate. It makes me believe God is something different. You so easily shrug off the fact that mistakes in the Bible were caused not by God but rather bad translation. If there are man-made mistakes in the Bible then how can you be sure the entire Bible isn't littered with these mistakes? Based on mistakes by Zek shouldn't we throw out all of what Zek said as he has been shown to be untrustworthy?\n \n Our key difference is that you give the Bible the benefit of the doubt while I do not. You say it is just a small mistake and I say it may just be one of many. But this is why we cannot debate any further. There is nothing else to debate. I have my reasons for believing what I do and you have yours. It will just have to remain that way.", 
   {}, 
   46925, 
   null, 
   1083380940.0
  ], 
  [
   47116, 
   null, 
   "Alone", 
   "Well if I were to believe that God wrote the bible himself then yeah, I could agree with you, but he didn't, its a book that was written or perceived to be written by those who witnessed events or actions done in his name and found them so great, they had to record them to the best of their ability. So if you wanna believe there is no God based solely on possible oversights or mistakes made by ones interpretation, then thats your business, but I would rather base the belief he does exist on the overall ideals and accounts, as believing and being right has more promise than not believing and being wrong.\n \n I gotchya, we have pretty much said whats on our minds on the topic, I am sure we will either disagree or agree once again on this board, later", 
   {}, 
   47007, 
   null, 
   1083458520.0
  ], 
  [
   47119, 
   null, 
   "AMD4EVER", 
   "Well if I were to believe that God wrote the bible himself then yeah, I could agree with you, but he didn't, its a book that was written or perceived to be written by those who witnessed events or actions done in his name and found them so great, they had to record them to the best of their ability. So if you wanna believe there is no God based solely on possible oversights or mistakes made by ones interpretation, then thats your business, but I would rather base the belief he does exist on the overall ideals and accounts, as believing and being right has more promise than not believing and being wrong.\n \n I gotchya, we have pretty much said whats on our minds on the topic, I am sure we will either disagree or agree once again on this board, later\n\n \n One thing I have to correct here again, I am not atheist. I believe there is a God but I don't believe in the common Christian perception of him. Based on my interpretation of the Bible I believe God is not all-knowing, not perfect, and created man because he didn't want to be alone in the universe. Viewing him this way is far different than beliving he doesn't exist at all.", 
   {}, 
   47116, 
   null, 
   1083459420.0
  ], 
  [
   137422, 
   null, 
   "KingdomWay", 
   "I have reviewed most of this thread to my great joy and enhancment. A very good debate. :) Thank you.\n \n I have a question AMD4EVER: What do YOU base YOUR faith on? I agree that the Bible alone is not an easy guide to the faith and sometimes a very poor one. Do you know that MOST of the knowledge of God comes through His people in the midst of a body of belivers? The Bible is only a part of the knowledge, only a part of the faith.\n \n Have you ever experienced the Spirit of the Lord directly? It seems to me that if your questions are honest and you are truly seeking God that you should be an active part of a church where you can experience God in your body and with your senses... not only with your brain. \n \n So... are you a member of a church? Are you seeking with all your body, soul and energy?\n \n Blessings to you,\n Bob", 
   {
    "post_info": {
     "post_title": "What do you base your belief on?"
    }
   }, 
   47119, 
   null, 
   1118849640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Biblicial Failures", 
  "url": "http://www.4forums.com/political/religion-debates/801-biblicial-failures.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 801, 
  "discussion_files": [
   [
    "21530.html", 
    "http://www.4forums.com/political/religion-debates/801-biblicial-failures-print.html"
   ], 
   [
    "21531.html", 
    "http://www.4forums.com/political/religion-debates/801-biblicial-failures-5-print.html"
   ], 
   [
    "21532.html", 
    "http://www.4forums.com/political/religion-debates/801-biblicial-failures-4-print.html"
   ], 
   [
    "21533.html", 
    "http://www.4forums.com/political/religion-debates/801-biblicial-failures-3-print.html"
   ], 
   [
    "21534.html", 
    "http://www.4forums.com/political/religion-debates/801-biblicial-failures-2-print.html"
   ]
  ], 
  "identifier": 801
 }
]