[
 [
  [
   209556, 
   null, 
   "Gogi", 
   "International community should keep an eye on president of Georgia Saakashvili violating civil and human rights of Georgians. Mind Georgia is part of Europe and it has got is the very fiend ruling in its suburbs! \n It's well known fact people are abducted in Georgia. They may be regime's political opponents or just people taken in the street. As a rule they never come back to their families. Some people are taken to secret facilities where they are subjected to inhuman tortures and some top secret biological experiments (!!). I spoke to a fugitive from such a prison-lab in Georgia's Shida-Kartli province. The man in his early thirties now looking as an aged man was sterilized and vaccinated there. He told us about \"American doctors\" (?) examining him.\n It's miracle he's managed to escape and stay alive but his health is absolutely ruined. And he is scary to visit a doctor to avoid any publicity which may mean death for him he thinks. \n We know that president Saakashvili reported to the Council of Europe that there are no secret CIA prisons in Georgia. We want you know there are secret prisons in Georgia for inhuman tests, though we are not sure they are owned by CIA. International experts must come here and sort it out on the spot!!", 
   {
    "post_info": {
     "post_title": "International community should keep an eye on president of Georgia Saakashvili"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1145980860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  International community should keep an eye on president of Georgia Saakashvili", 
  "url": "http://www.4forums.com/political/european-politics-economics/8014-international-community-should-keep-eye-president-georgia-saakashvili.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 8014, 
  "discussion_files": [
   [
    "27370.html", 
    "http://www.4forums.com/political/european-politics-economics/8014-international-community-should-keep-eye-president-georgia-saakashvili-print.html"
   ]
  ], 
  "identifier": 8014
 }
]