[
 [
  [
   210526, 
   null, 
   "Close_slave_can", 
   "Some countries have more creationists than others so I was wondering if there is some sort of measurable link of the consequences such poor results in biological research or not preparing against bird flu.", 
   {
    "post_info": {
     "post_title": "What is the evidence creationism causes harm?"
    }
   }, 
   null, 
   null, 
   1146358140.0
  ], 
  [
   210529, 
   null, 
   "birdan", 
   "Rather than looking at the percentage of creationists in the general population, you would need to look at those percentages within relevant fields such as medical research, epidemiology, bio-genetic research, etc. \n \n To my knowledge, the percentages of creationists in such relevant fields is negligible, and there is certainly sufficient numbers of non-creationists to further research and continue to garner sufficient funding for research, planning, etc.\n \n A more pertinent question would be to ask how a creationist worldview (i.e., non-evolutionary, non-naturalistic, young earth, etc.) would impact research and methodology. Understanding this point naturally leads to the reason why there are so few creationists in medical / biological research fields.", 
   {}, 
   210526, 
   null, 
   1146361800.0
  ], 
  [
   210877, 
   null, 
   "electrolyte", 
   "Some countries have more creationists than others so I was wondering if there is some sort of measurable link of the consequences such poor results in biological research or not preparing against bird flu.\n\n Responding to the question in the topic, I tend to use the case of Baby Fae.\n \n Freethoughtradio also has short blurbs called \"What's the Harm?\" that gives some examples of \"the natural harm caused by supernatural belief.\"", 
   {}, 
   210526, 
   null, 
   1146559740.0
  ], 
  [
   210924, 
   null, 
   "Cheesejoff", 
   "Not so much creationism as such, but general religion:\n \n \"THE AWESOME POWER OF PRAYER\n \n A note on a news service on April 24 told us that 17 years ago that day, in 1989, the president of Bangladesh pleaded with his citizens to pray for the end to a two-month drought. The prayers were perhaps answered forty minutes later, when huge rainstorms and two tornadoes swept through rural Bangladesh. Over 500 people died and thousands were left homeless.\n \n Remember the old saying: Be careful what you pray for; you may get it. \"\n \n \n From the JREF commentary.", 
   {}, 
   210877, 
   null, 
   1146592440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is the evidence creationism causes harm?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8037-what-evidence-creationism-causes-harm.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 8037, 
  "discussion_files": [
   [
    "6675.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8037-what-evidence-creationism-causes-harm-print.html"
   ]
  ], 
  "identifier": 8037
 }
]