[
 [
  [
   11960, 
   null, 
   "Madison05", 
   "anyone really like a book they want to to share emoticon_xgood hehehe i sound like a teacher.", 
   {
    "post_info": {
     "post_title": "best book ever written"
    }
   }, 
   null, 
   null, 
   1058131260.0
  ], 
  [
   12152, 
   null, 
   "debategirl88", 
   "I love the book To Kill A Mockingbird. I also love to read Shakespeare!", 
   {}, 
   11960, 
   null, 
   1059005460.0
  ], 
  [
   12198, 
   null, 
   "maximus", 
   "The Education of Little Tree by Forrest Carter", 
   {}, 
   11960, 
   null, 
   1059107520.0
  ], 
  [
   12211, 
   null, 
   "Maynard", 
   "it's between Grapes of Wrath, For Whom the Bell Tolls, and Timeline.", 
   {}, 
   12198, 
   null, 
   1059151920.0
  ], 
  [
   12269, 
   null, 
   "Madison05", 
   "i really liked the scarlett pimpernel(sp), little women, black bueaty, black horses for the king, the queen's own fool, a walk to remember, the black caldron, the high king etc., and so the list goes on but i don't really have the time to write them all down. :p", 
   {}, 
   12211, 
   null, 
   1059271920.0
  ], 
  [
   12274, 
   null, 
   "maximus", 
   "i really liked the scarlett pimpernel(sp), little women, black bueaty, black horses for the king, the queen's own fool, a walk to remember, the black caldron, the high king etc., and so the list goes on but i don't really have the time to write them all down. :p\n\n \n The Prydain Chronicles by Lloyd Alexander are some of my all-time favorites. All 5 books in the series are good, including the black cauldron and the high king. Alexander also has a 3 book series: Westmark is the first one and The Kestrel is another one I think. I can't remember the third one and I do not have them here. I'm sure you could find them searching Barnes and Nobles or Amazon.com. They are as good as the Prydain chronicles. They are a bit young in terms of reader age for me now but I started reading them in junior high maybe and I continue to re-read them to this day. You never outgrow fantasy.", 
   {}, 
   12269, 
   null, 
   1059286020.0
  ], 
  [
   12364, 
   null, 
   "katie5890", 
   "The outsiders is a must read great book.........and On Fortunes Wheel is good", 
   {}, 
   12274, 
   null, 
   1059586560.0
  ], 
  [
   12372, 
   null, 
   "ApathySam", 
   "it's between Grapes of Wrath, For Whom the Bell Tolls, and Timeline.\n\n \n \n *Shudder* For Whom the Bell Tolls might be the most horrid book ever devised. Junior year English took a lot out of me.\n \n An excerpt from the book, paraphrased to the best of my memory:\n \n \n \"Darling.\"\n \"Yes.\"\n \"I love you.\"\n \"Oh.\"\n \"Do you?\"\n Yes.\"\n \"You love me.\"\n \"I love you.\"\n \"Let's hide. In this cave. While the war goes on. And die. Alone. In the rain.\"\n \"Wait.\"\n \"What?\"\n \"How do we die alone? We're together.\"\n \"Oh yeah.\"\n \"I love you.\"\n \"I love you too.\"\n \n \n My God, I wanted to tear my eyes out. So instead, I just stopped reading it. ;) \n \n Who wrote Timeline?\n \n I just finished The Pelican Brief, by John Grisham. What an amazing book.", 
   {}, 
   12211, 
   null, 
   1059597720.0
  ], 
  [
   12385, 
   null, 
   "debategirl88", 
   "I cant believe i forgot the Bible. that is my most favorite book of all time.", 
   {}, 
   12372, 
   null, 
   1059622680.0
  ], 
  [
   12526, 
   null, 
   "Mysterium16", 
   "My fav books of the bible are Proverbs and Song of Solomon.  \n I LOOOOOOVE Mysteries. I change my favorite mystery every week: last week it was Hound of The Baskervilles  and this week it's anything Sue Grafton. \n I'm currently reading Watership Down, I'm re-reading Grafton's K is for Killer also I'm reading Babbit by Sinclair Lewis.\n Shakespeares comedies are the best. A Midsummer Nights Dream  is a masterpiece. \n Also, I love short stories. Fierce Pajamas  was good and Russell Baker's Book of American Humor was funny ,too.\n I'm writing a mystery short story myself. I'm going to a book publishing meeting tomorrow. Though it'll be awhile before I think of getting my book published.", 
   {}, 
   12385, 
   null, 
   1059797160.0
  ], 
  [
   12937, 
   null, 
   "Carman", 
   "Anything by John Grisham and The Catcher in the Rye", 
   {}, 
   12526, 
   null, 
   1060410600.0
  ], 
  [
   13131, 
   null, 
   "gilligan8503", 
   "the catcher in the rye is a great book. i base my writing off of j d salinger.\n \n my favorite book would have to be crime and punishment though. dostoevsky is a brilliant man. i live by the superman theory; so far it has worked.\n \n *edit* i forgot to mention that the complexity of his work in the psychology of others is so in-depth, not one author has achieved his length. the feelings and personality of his character literally leap out at you. me, being a movie lover/critic, i actually enjoy reading his books more than watching a kubrick movie (and that was a sacrelige i commited). *edit*", 
   {}, 
   12937, 
   null, 
   1060655460.0
  ], 
  [
   13134, 
   null, 
   "SilentPoet", 
   "I throw in another vote for John Grisham. He is truly a great author.\n \n Always Stay Open Minded", 
   {}, 
   13131, 
   null, 
   1060658940.0
  ], 
  [
   13148, 
   null, 
   "Carman", 
   "I throw in another vote for John Grisham. \n \n Always Stay Open Minded\n\n \n Have you read the King of Torts? I didn't think it was as good as his other books... there is a new one coming out called Bleachers...\n James Patterson's books are pretty good too...", 
   {}, 
   13134, 
   null, 
   1060673700.0
  ], 
  [
   14113, 
   null, 
   "So Heaven Dies?", 
   "anyone really like a book they want to to share emoticon_xgood hehehe i sound like a teacher.\n\n \n Uncle Tom's Cabin by Harriet Beecher Stowe.\n \n Cider with Rosie by Laurie Lee.\n \n The Catcher in the Rye by J D Salinger. ", 
   {}, 
   11960, 
   null, 
   1062528300.0
  ], 
  [
   14172, 
   null, 
   "debategirl88", 
   "[QUOTE=Mysterium16]My fav books of the bible are Proverbs and Song of Solomon.  \n \n \n hahaha....i bet u do.... ;) `", 
   {}, 
   12526, 
   null, 
   1062557820.0
  ], 
  [
   14173, 
   null, 
   "debategirl88", 
   "Does anyone like To Kill A Mockingbird? Or have at least read it or seen the movie?", 
   {}, 
   14172, 
   null, 
   1062557880.0
  ], 
  [
   14308, 
   null, 
   "Carman", 
   "Does anyone like To Kill A Mockingbird? Or have at least read it or seen the movie?\n\n I've read it... it was good... I've never seen the movie though.", 
   {}, 
   14173, 
   null, 
   1062662460.0
  ], 
  [
   14371, 
   null, 
   "debategirl88", 
   "Really? I like both but the book is alot better...", 
   {}, 
   14308, 
   null, 
   1062730980.0
  ], 
  [
   14373, 
   null, 
   "SilentPoet", 
   "Carman,\n \n \nHave you read the King of Torts? I didn't think it was as good as his other books... there is a new one coming out called Bleachers...\n \n \n No, actaully I use to read alot avidely because I enojyed it but after an incident which occured last December which let to serious consequences I simply stopped reading.\n \n Runaway Jury (1st one I read) was pretty good.\n \n Always Stay Open Minded", 
   {}, 
   14113, 
   null, 
   1062731580.0
  ], 
  [
   14417, 
   null, 
   "AMD4EVER", 
   "Enders Game was a VERY good book. The ending was very impressive and I would love to see a movie made out of that book, assuming they could make it as good as the book emoticon_rolleyes \n \n Jurrassic Park was a pretty good book and so was The Stand.\n \n 1984 was stupid! Whew, glad I got that off my chest.", 
   {}, 
   11960, 
   null, 
   1062778620.0
  ], 
  [
   14479, 
   null, 
   "gilligan8503", 
   "i just got finished reading cat's cradle by kurt vonnegut... a must read. if not this, go with the classic slaughterhouse-five (by kurt vonnegut). i have yet to read breakfast for champions... i will soon though.\n \n (edit)\n you thought 1984 was stupid? you write something as groundbreaking as that and i'll let you have that statement.\n (edit)", 
   {}, 
   14417, 
   null, 
   1062825000.0
  ], 
  [
   18058, 
   null, 
   "afrsmile", 
   "i've read and seen The Outsiders. i read it whilst in germany i cried, like the whole of my class when jonny died. emoticon_cry \n of mice and men is a good one, this is another one my school made us read, i've started to notice the way all school books are depressing (macbeth, good night mister tom). my fav colection of all time has to be Philp Pullman's 'Dark Materials' and 'the wing singer' i also like Eion Colins books expectioally 'the wish list'", 
   {}, 
   14479, 
   null, 
   1065195480.0
  ], 
  [
   18715, 
   null, 
   "sundowner", 
   "My favorite was The Sun Also Rises by E. Hemingway. Actually all of his books captivate me, he is the only author I can read cover to cover in one day, I pick one up and can't put it back down.", 
   {}, 
   18058, 
   null, 
   1065663780.0
  ], 
  [
   18775, 
   null, 
   "afrsmile", 
   "i did that with the wish list, but it was 10 at night and i finnished reading it at 3 in the morning luckly i din't have school that day so i just sleeped emoticon_zzzz", 
   {}, 
   18715, 
   null, 
   1065725580.0
  ], 
  [
   18830, 
   null, 
   "epaphras_faith", 
   "I would go with\n \n 1) The book of Romans\n 2) The Book of Philippians\n 3) The Hobbit\n 4) The Lion The Witch and The Wardrobe\n \n In no particular order", 
   {}, 
   18775, 
   null, 
   1065749700.0
  ], 
  [
   18841, 
   null, 
   "SilentPoet", 
   "Recommended Books and my reading list:\n \n A) Any John Grisham Novels (Exempt Rainmaker)\n B) The Case Against God - Unknown Author\n C) Longitudes and Attitudes - Thomas Friedman\n D) The case for Israel - Alan Dershowitz", 
   {}, 
   18830, 
   null, 
   1065758880.0
  ], 
  [
   18895, 
   null, 
   "Madhat", 
   "My favourite book is the Lord of the Rings. Yeah, yeah, so what... I just loved that book.\n \n Right now I'm reading Longitudes and Attitudes as well...\n \n A good book about Israel (which I haven't read, but heard great things about it) is \"From Time Immemorial\" by Joan Peters (for those interested in the Mideast).", 
   {}, 
   18841, 
   null, 
   1065799020.0
  ], 
  [
   18896, 
   null, 
   "montalban", 
   "My reading favourites\n \n 1. Bliss by Peter Carey\n 2. Red Dwarf series by Grant Naylor\n 3. The Hitchhiker's Guide to the Galaxy series - Douglas Adams.\n 4. Bulfinch's Mythology (ed: Thomas Bulfinch)\n 5. any encyclopaedia.", 
   {}, 
   18841, 
   null, 
   1065799200.0
  ], 
  [
   18936, 
   null, 
   "Chobo Char", 
   "Some of my favorites:\n \n The Universe in a Nutshell by Stephen Hawking\n The Lord of the Rings Series\n Dante's Divine Comedy", 
   {}, 
   18896, 
   null, 
   1065822240.0
  ], 
  [
   18939, 
   null, 
   "SilentPoet", 
   "Right now I'm reading Longitudes and Attitudes as well...\n \n \n How is it?", 
   {}, 
   18936, 
   null, 
   1065827100.0
  ], 
  [
   19000, 
   null, 
   "mrmufin", 
   "So many great books... thus far my personal favorites include:\n \n Surely You're Joking, Mr. Feynman! - Richard P. Feynman\n Innumeracy: Mathematical Illiteracy And Its Consequences - John Allen Paulos\n Great Ideas In Physics - Alan Lightman\n We The Living - Ayn Rand\n The Demon-Haunted World - Carl Sagan\n A History Of The American People - Paul Johnson\n \n I'm not too big on novels and fictional works, though I'll maintain a bit of a soft spot for the Ayn Rand novels. As well, my bookshelf does include many of the classics mentioned in previous replies: Catcher In The Rye, Crime And Punishment, The Pearl, etc.\n \n Regards,\n mrmufin", 
   {}, 
   18939, 
   null, 
   1065885660.0
  ], 
  [
   19008, 
   null, 
   "Madhat", 
   "How is it?\n\n I haven't reached even half of it yet, but so far so good. I really like his writing. He can explain complicated things in a very simple way. He's got it all in focus from what I can tell so far...", 
   {}, 
   18939, 
   null, 
   1065898320.0
  ], 
  [
   21293, 
   null, 
   "Mysterium16", 
   "Some of my favorites:\n The Universe in a Nutshell by Stephen Hawking\n \n\n \n I love this book so much! I have read it over and over so many times! \n Physics is so fascinating.", 
   {}, 
   18936, 
   null, 
   1067902860.0
  ], 
  [
   21299, 
   null, 
   "Robbie", 
   "So many books that I love are in this thread! I'd almost forgotten Watership Down. I'm reading Uncle Tom's Cabin right now, it's really astonishing. One of my unmentioned favorites is Maniac Magee (Jerry Spinelli)", 
   {}, 
   21293, 
   null, 
   1067904600.0
  ], 
  [
   23238, 
   null, 
   "bud095", 
   "the outsider by s.e.hinton. i was forced to read it in high school but liked anyway", 
   {
    "post_info": {
     "post_title": "favorite book"
    }
   }, 
   21299, 
   null, 
   1069299660.0
  ], 
  [
   23590, 
   null, 
   "katie5890", 
   "i read that in 7th grade and i liked it i like Lord Of the Flies too just cuz its got a bunch of sympols that i can figure out... were reading it now in class", 
   {}, 
   23238, 
   null, 
   1069523280.0
  ], 
  [
   23654, 
   null, 
   "Liesbeth", 
   "I'm reading Uncle Tom's Cabin right now, it's really astonishing.\n\n \n Isn't it? That book is amazing. I am not even sure what my favorite books are. I've read so many, but I haven't read alot of the popular or well-known ones.", 
   {}, 
   21299, 
   null, 
   1069555980.0
  ], 
  [
   23755, 
   null, 
   "Robbie", 
   "It always suprises me when I read books from other centuries, like Jane Austen's or Louisa May Alcott's (sp?) I guess it's because I think people from those times were completly different from 'modern' people.\n \n I like s.e.hinton a lot. Haven't read one of her books for a long time, though.", 
   {}, 
   23654, 
   null, 
   1069622820.0
  ], 
  [
   24214, 
   null, 
   "witzelcheck", 
   "ENDER'S GAME - along with the many books that follow\n CATCHER IN THE RYE\n 1984 - (George Orwell)\n ANYTHING BY DAVID EDDINGS\n BELL JAR\n FAHRENHEIT 451\n SONGMASTER\n \n (I believe all of these are a MUST)", 
   {}, 
   14113, 
   null, 
   1069914660.0
  ], 
  [
   24215, 
   null, 
   "witzelcheck", 
   "OH! and Stranger in a Strange Land", 
   {}, 
   24214, 
   null, 
   1069914720.0
  ], 
  [
   25289, 
   null, 
   "AnnaPerenna", 
   "It's so hard to choose, but in the end I have decided to go with 'To Kill a Mockingbird' by Harper Lee. If you haven't read this book, please do. If you have, and you liked it, you will understand why I picked it.   ", 
   {}, 
   24215, 
   null, 
   1070439180.0
  ], 
  [
   25309, 
   null, 
   "Robbie", 
   "That is one of my favorite books. I feel like reading it again!", 
   {}, 
   25289, 
   null, 
   1070471040.0
  ], 
  [
   25327, 
   null, 
   "smokefree", 
   "my favorite books are mostly books written Orson Card Scott.\n for example All of the Homecoming Volumes, Enders Game and then some ofcourse from the philosophy section. so to wrap it up i like science fictions and philosophy books.", 
   {}, 
   25309, 
   null, 
   1070476620.0
  ], 
  [
   25578, 
   null, 
   "witzelcheck", 
   "Yes. forgot about that. Universe in a Nutshell. Good for all physics/astronomy/calc people. Makes you stretch your mind.\n And yes, smokefree, Orson Scott Card. That's the way to go!\n (If all you other guys haven't gotten the hint, read them, read them all - You will NOT regret it) They have everything you could look for in a sci-fi book.", 
   {}, 
   21293, 
   null, 
   1070603940.0
  ], 
  [
   25748, 
   null, 
   "Debate_Queen615", 
   "ENDER'S GAME - along with the many books that follow\n CATCHER IN THE RYE\n 1984 - (George Orwell)\n ANYTHING BY DAVID EDDINGS\n BELL JAR\n FAHRENHEIT 451\n SONGMASTER\n \n (I believe all of these are a MUST)\n\n \n \n Fahrenheit 451's author, Ray Bradbury, is distant relative of mine\n \n its not a classic like most of you guys have mentioned but I love the series about Georgia Nicholson", 
   {}, 
   24214, 
   null, 
   1070688660.0
  ], 
  [
   25758, 
   null, 
   "katie5890", 
   "I made my teacher reallly mad today...and i asked her what her favorite book was...its for a journal entry thing...and yea im not just a suck up er anything....but anywho... she said Grapes of Wrath...and after reading someone post on here i said really i heard that s boring and she threw her pen across the room! and said...GREAT IM SO HAPPY THAT IM BORING TO U ...over reacting I THINK SO! then she got all pissy and didnt wanna speak to me anymore.... shes such a drama queen.", 
   {}, 
   25748, 
   null, 
   1070690460.0
  ], 
  [
   25989, 
   null, 
   "Robbie", 
   "Whenever I get mad like that I've had a really stressful day... \n \n Has anyone here read George MacDonald?", 
   {}, 
   25758, 
   null, 
   1070786760.0
  ], 
  [
   32924, 
   null, 
   "ElusiveShadow", 
   "Right now I'm reading On the Road by Jack Kerouac and I'm enjoying it very much. He might come to be one of my favorite authors. I haven't read any of his other work but I'll get around to it. Let's see... I loved Catcher in the Rye but a lot of people have already posted that. I'm also reading Leave it to Psmith right now and it reminds me of Catcher in the Rye... the writing style. I love to read 'classics' but the one book that I HATED was Across Five Aprils. That book was just pointless. I read A Seperate Peace a few weeks ago and I thought that was a good book but it's not a favorite. Any suggestions for some good classic reads? :)", 
   {}, 
   25989, 
   null, 
   1075343160.0
  ], 
  [
   33120, 
   null, 
   "Robbie", 
   "Catcher in the Rye? Sounds interesting.\n \n Recommendations for classic authors from me would be Jane Austen, Lousia May Alcott, and George MacDonald. My top book outside of those authors is Uncle Tom's Cabin. (I can't imagine how I could have lived without it!) \n \n Well, you have my suggestions, do you have any yourself?", 
   {}, 
   32924, 
   null, 
   1075500960.0
  ], 
  [
   33176, 
   null, 
   "ElusiveShadow", 
   "Catcher in the Rye? Sounds interesting.\n \n Recommendations for classic authors from me would be Jane Austen, Lousia May Alcott, and George MacDonald. My top book outside of those authors is Uncle Tom's Cabin. (I can't imagine how I could have lived without it!) \n \n Well, you have my suggestions, do you have any yourself?\n\n \n I would recommend Fahrenheit 451 by Ray Bradbury. I read it a few years ago... I think it's one of those books that makes you think, it brought up good points. I would like to read it over again since I was pressed for time to read it and couldn't 'savor' the moment. I would have liked time to think about the things it brought up. I'd also recommend On the Road... although I'm not done with it yet, what I have read I like. You should definitly read Catcher in the Rye... no plot but I found it very amusing. emoticon_rolleyes", 
   {}, 
   33120, 
   null, 
   1075518900.0
  ], 
  [
   38773, 
   null, 
   "Jathro", 
   "Personally, and you really don't have to be a Star Wars fan, but I thought Heir to the Emperor was a great book, because it expanded the Star Wars Universe, and brought new characters.", 
   {}, 
   33176, 
   null, 
   1078811400.0
  ], 
  [
   40272, 
   null, 
   "Ender Wiggin", 
   "I think Orson Scot Card who wrote:\n Enders Game,\n Speaker For The Dead,\n Children Of The Mind,\n Xinocide,\n Enders Shadow,\n Shadow Of The Hegemon and,\n Shadow Pupets\n is by far the best author that ever lived or ever will live!!!!\n I also liked Water Ship Down and Arthur C. Clarke's 2001 space odyssey", 
   {}, 
   38773, 
   null, 
   1079823120.0
  ], 
  [
   40278, 
   null, 
   "nick", 
   "Apparently in a list of favourite books Americans rate Ayn Rand second only to the Bible. The Fountainhead and Atlas Shrugged. She has been mentioned here already. In the UK she is unheard and unknown which just goes to show how smarter Americans are than Brits I guess.\n \n Les Miserables by Victor Hugo, for masterly storytelling, mixed with history, philosophy, religion and just about everything else under the sun. Proust Remembrance of things past if you want three thousand pages of amazing cerebral prose, introspection and social observation. Of course concur about Salinger, Hemingway,Lewis,Steinbeck but perhaps Kerouac is best for those in their teens. Ditto Henry Miller.", 
   {}, 
   40272, 
   null, 
   1079826360.0
  ], 
  [
   40404, 
   null, 
   "witzelcheck", 
   "I think Orson Scot Card who wrote:\n Enders Game,\n Speaker For The Dead,\n Children Of The Mind,\n Xinocide,\n Enders Shadow,\n Shadow Of The Hegemon and,\n Shadow Pupets\n is by far the best author that ever lived or ever will live!!!!\n\n AGREED!!!!\n That has to be BY FAR the best series I've ever read!\n Also, Asimov's Foundation triligoy is good. \n And again, the classics:\n Fahrenheit 451\n 1984\n Catcher in the Rye\n ...and all those other depressing books...", 
   {}, 
   40272, 
   null, 
   1079941500.0
  ], 
  [
   47156, 
   null, 
   "Ender Wiggin", 
   "Thank you so much!!!!\n (I thought I was allone.)", 
   {}, 
   40404, 
   null, 
   1083477960.0
  ], 
  [
   47158, 
   null, 
   "Alucard", 
   "i just got finished reading cat's cradle by kurt vonnegut... a must read. if not this, go with the classic slaughterhouse-five (by kurt vonnegut). i have yet to read breakfast for champions... i will soon though.\n \n\n \n God yes, Breakfast of Champions is one of the greatest pieces of fiction ever written. Vonnegut is a genius. If you have time trying reading his collection of short stories in Welcome to the Monkey House or Slapstick . And whoever doesn't understand 1984 's message is doomed. Although, 1984's future predictions are less likely than Brave New World's.", 
   {}, 
   14479, 
   null, 
   1083478560.0
  ], 
  [
   47596, 
   null, 
   "Relient Halo", 
   "Some of my personal favorites:\n Fahrenheit 451; the way it was written was genius and showed Bradbury in his element. Plus, if you don't see the connections with that world and what we're becoming, then the world is turning to hell\n \n Ender's Game; Not just Ender's game but the sequels as well (it's Xenocide). True to form of human nature in combat. Card is the man of science fiction. Have yet to read Shadow Puppets yet. Looking forward to that.\n \n Animal Farm; Orson Wells made me a fan with this book\n \n Carrie (yes, Stephen King); the man is a writer and I wish that I had the story telling ability that man has.\n \n One of my favorites has to be Catcher in the Rye. Amazing book. It was, in all honesty, about nothing but it told so much. Very few authors can accomplish such a task, let alone in that kind of form. For anyone who hasn't read this, or even heard of it, it is at the top of my list of must reads. Beautiful book, and proof that writing is an art form.", 
   {}, 
   47158, 
   null, 
   1083654660.0
  ], 
  [
   47654, 
   null, 
   "galton", 
   "My favorite is Pride and Prejudice. You'd think I was an Victorian teenage schoolgirl or something.", 
   {}, 
   47596, 
   null, 
   1083697260.0
  ], 
  [
   47887, 
   null, 
   "Anastasia", 
   "I have so many favs\n but\n Confederacy of the Dunces was great!", 
   {}, 
   47654, 
   null, 
   1083785160.0
  ], 
  [
   48017, 
   null, 
   "college_girl", 
   "what books have made people think/question/grow as a person?", 
   {}, 
   47887, 
   null, 
   1083816900.0
  ], 
  [
   48022, 
   null, 
   "galton", 
   "what books have made people think/question/grow as a person?\n\n If you want something that truly challenges they way you probably think about things, read something by Ayn Rand. Some of her books are very long, so if you just want a taste, you could read Anthem. Either her fiction or non-fiction is provocative since it directly contradicts to the thinking of most authors.", 
   {}, 
   48017, 
   null, 
   1083820320.0
  ], 
  [
   48040, 
   null, 
   "Relient Halo", 
   "what books have made people think/question/grow as a person?\n\n \n Honestly, I read The Chocolate War, and I will admit it changed my views as an aspiring. Also, Catcher in the Rye and just the character development of Holden Caufield. Brilliant story telling mixed into the plot to really make you look our society. Then there's Animal Farm, and then...\n well, actually, there are very few books I've read that I don't put down and I am the same. Even with Stephen King that is the case most of the time, and I find something in almost everything. But that's just me.", 
   {}, 
   48017, 
   null, 
   1083828300.0
  ], 
  [
   48090, 
   null, 
   "Ender Wiggin", 
   "Originally Posted by college_girl\n what books have made people think/question/grow as a person?\n\n \n I think that Water Ship Down by Richard Adams and, 2001 Space Odyssey, by Arthur C. Clarke, & Stanley Kubrick were 2 of the best in that way. Also The House Of Stairs by Barbara Vine (I still get chils when I read that one). And anything by Philip K. Dick including Do Androids Dream Of Electric Sheep, A Scaner Darkly, & Dr. Blood Money.", 
   {}, 
   48040, 
   null, 
   1083868740.0
  ], 
  [
   62252, 
   null, 
   "duck", 
   "The Lord of The Rings.", 
   {}, 
   48090, 
   null, 
   1092529440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  best book ever written", 
  "url": "http://www.4forums.com/political/fun-debates/804-best-book-ever-written.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 804, 
  "discussion_files": [
   [
    "6865.html", 
    "http://www.4forums.com/political/fun-debates/804-best-book-ever-written-print.html"
   ], 
   [
    "6866.html", 
    "http://www.4forums.com/political/fun-debates/804-best-book-ever-written-5-print.html"
   ], 
   [
    "6867.html", 
    "http://www.4forums.com/political/fun-debates/804-best-book-ever-written-4-print.html"
   ], 
   [
    "6868.html", 
    "http://www.4forums.com/political/fun-debates/804-best-book-ever-written-3-print.html"
   ], 
   [
    "6869.html", 
    "http://www.4forums.com/political/fun-debates/804-best-book-ever-written-2-print.html"
   ]
  ], 
  "identifier": 804
 }
]