[
 [
  [
   211147, 
   null, 
   "simone", 
   "http://www.country-data.com/cgi-bin/query/r-8728.html\n \n The Roman Catholic Church's role in Mexican history goes back to 1519. When Hernán Cortés, the Spanish conqueror of New Spain, landed on the coast of Mexico, he was accompanied by Roman Catholic clergy. All new Spanish territories were to be conquered in the name of the cross as well as the crown. Since those early days, the Roman Catholic Church has always been present, playing different roles, some of which have led to violent confrontations.\n \n The history of the relationship between church and state following independence involves a series of efforts on the part of the government to curtail the church's influence. Nineteenth-century liberals, trained in the law and influenced by the French Revolution, were anticlerical. Liberals, who also were federalist and favored free competition, were highly concerned that the Roman Catholic Church, by owning between one-quarter and one-half of the land and by controlling most schools, hospitals, and charitable institutions, was practically a state within the Mexican state.\n \n Between 1833 and the early 1840s, the Mexican government produced various pieces of legislation to limit the power of the church. In 1833 the government adopted several anticlerical measures, including one providing for the secularization of education and another declaring that the payment of the ecclesiastical tithe was not a civil obligation.\n \n The first major confrontation between the church and the state occurred during the presidency of Benito Juárez (1855-72). The 1855 Juárez Law drastically reduced traditional ecclesiastical privileges. On March 11, 1857, a new constitution was adopted that denied all ecclesiastical entities the right to own real estate and abolished most remaining ecclesiastical privileges. On July 12, 1857, Juárez confiscated all church properties, suppressed all religious orders, and empowered the state governors to designate what buildings could be used for religious services. Mexico's first religious civil war was fought between 1857 and 1860 in reaction to the legislation (see Civil War and the French Intervention, ch. 1).\n \n The constitution of 1917 highlighted and institutionalized many of the nineteenth-century secular reforms. The new constitution included at least five articles that affected all religious groups, regardless of denomination. These articles, which remained in effect until 1992, appeared to preclude any national role for the Roman Catholic Church. Article 3 forbade churches from participating in primary and secondary education. Article 5 prohibited the establishment of religious orders. Article 24 mandated that all religious ceremonies occur within church buildings. Article 27 gave the state ownership of all church buildings. . . . Beginning in 1926 and continuing until the late 1930s, various federal and state administrations strenuously enforced these constitutional edicts and related laws. Their actions paved the way for the second Mexican religious war, the bloody Cristero Rebellion of 1926-29 in western Mexico (see The Calles Presidency, 1924-28, ch. 1). During this period, the governor of Sonora ordered all churches closed, officials in the state of Tabasco required priests to marry if they were to officiate at mass, and the Chihuahua government allowed only one priest to minister to the entire statewide Roman Catholic population.\n \n Church-state conflict officially ended with the administration of Manuel Ávila Camacho (1940-46). With the notable exception of Article 130, Section 9, the government tacitly offered nonenforcement of key constitutional provisions in exchange for the Roman Catholic Church's cooperation in achieving social peace. Over the next four decades, enforcement of Article 130, Section 9, served the interests of both the government and the Roman Catholic Church. The constitutional restriction on ecclesiastical political participation enabled the state to limit the activities of a powerful competitor. It also permitted the Roman Catholic Church to sidestep controversial political issues and to concentrate on rebuilding its ecclesiastical structure and presence throughout the country.\n \n By the early 1980s, however, this unspoken consensus supporting the legal status quo had eroded. The Roman Catholic Church regarded the constitution's anticlerical provisions, especially those governing ecclesiastical political activity, as anachronistic. It demanded the right to play a much more visible role in national affairs. At the same time, the church became increasingly outspoken in its criticism of government corruption. The Mexican bishops' Global Pastoral Plan for 1980-1982, for example, contained a highly critical assessment of the Mexican political system. According to the Roman Catholic hierarchy, democracy existed only in theory in Mexico. The ruling PRI monopolized power, producing apathy and frustration among citizens and judicial corruption. The principal worker and peasant unions were subject to political control. Peasants and Indians constituted an exploited, marginalized mass barely living at a subsistence level and subject to continual repression. During the mid-1980s, the bishops of Chihuahua and Ciudad Juárez assumed prominent roles in denouncing electoral fraud in northern Mexico. In the south, the bishops of San Cristóbal de las Casas and Tehuantepec frequently accused the government of human rights violations. . . . The Salinas administration's 1991 proposal to remove all constitutional restrictions on the Roman Catholic Church, recommendations approved by the legislature the following year, allowed for a more realistic church-state relationship. At the same time, however, tensions remained in the relationship, particularly in southern Mexico in general and in Chiapas in particular. Local government and PRI officials and ranchers accused the Bishop of San Cristóbal de las Casas of having supported the rebellion that began in Chiapas in 1994, a charge that the bishop denied. Federal soldiers repeatedly searched diocesan churches in their pursuit of the rebels. The government also expelled foreign clergy who were accused of inciting violence and land seizures. In addition, the Vatican accused the San Cristóbal prelate of theological and pastoral distortions and named a coadjutor (successor) bishop for the diocese in the mid-1990s. For their part, the rebels insisted that the bishop continue to serve as mediator in their negotiations with the federal government. . . .", 
   {
    "post_info": {
     "post_title": "Mexico's Government and the Roman Catholic Church"
    }
   }, 
   null, 
   null, 
   1146686940.0
  ], 
  [
   211148, 
   null, 
   "simone", 
   "http://www.abc.net.au/rn/talks/8.30/relrpt/stories/s691169.htm\n \n The Religion Report: 2 October 2002 - Church encroaches on state in Mexico \n Stephen Crittenden: Now to Mexico, and the government of President Vicente Fox.\n \n Although Mexico is an overwhelmingly Catholic country, a rigid separation of Church and State has been maintained ever since the Mexican Revolution right through the whole of the 20th century.\n \n But now it seems that Vicente Fox's increasing displays of ardent Catholicism are causing anger and alarm amongst Mexico's small but growing evangelical Protestant community.\n \n James Blears reports from Mexico.\n \n James Blears: Some indications of a growing tolerance for a certain blend of Church and State are becoming more evident. On the day of his inauguration, Vicente Fox became the first Mexican President to celebrate mass, and on a recent Papal visit he publicly kissed the Pope's ring, while during Independence Day celebrations, Archbishop Norberto Rivera also became the first senior priest in more than 150 years to salute the national flag in the country's principal cathedral. . . .\n \n Vicente Fox: We welcome Church in this phase of its endeavour, and we welcome Church on its promotion of those human values and those spiritual values. I think that's where we both, government and Church, meet for the same job.\n \n James Blears: Professor Gama concedes that President Fox's actions are not calculated, and indeed are often even spontaneous. He also argues that the same cannot be said for the Catholic church, which he says wants to consolidate its position in Mexico.\n \n Carlos Gama: Yes, the church is quite clearly regaining influence, and they are trying to manoeuvre in order to see how fast they can gain elements within this situation. And there, it's quite clearly it's a strategy that they are following.\n \n James Blears: Sergio Carranza, the Anglican Bishop of Mexico, argues that President Fox's actions are not coincidences, but agrees with Professor Gama concerning the Catholic church's possible interpretive response.\n \n Sergio Carranza: I'm certainly concerned that in using religion for his political purposes, he might give the political hierarchy of the Roman church an opportunity to try to consolidate a position of power in the country. . . .", 
   {
    "unicode_changes_made": true
   }, 
   211147, 
   null, 
   1146687600.0
  ], 
  [
   211233, 
   null, 
   "Bradamante", 
   "simone, before you go onto another rant against Christians (or Catholics in particular), why not answer the questions I raised with you on your last outing into this arena?\n http://4forums.com/political/showthread.php?t=7949&page=2", 
   {}, 
   211148, 
   null, 
   1146738180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mexico's Government and the Roman Catholic Church", 
  "url": "http://www.4forums.com/political/religion-debates/8062-mexicos-government-roman-catholic-church.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8062, 
  "discussion_files": [
   [
    "25115.html", 
    "http://www.4forums.com/political/religion-debates/8062-mexicos-government-roman-catholic-church-print.html"
   ]
  ], 
  "identifier": 8062
 }
]