[
 [
  [
   211303, 
   null, 
   "BobNelson2", 
   "CALIFORNIA Committee OKs bill to add gays, lesbians to textbooks\n \n Hotly debated measure heads to state Senate\n \n http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/05/04/BAG5HIKCCI1.DTL\n \n \"Hotly debated\" is a bit misleading. There is \"hot\" debate, but the heat comes from a quite small minority who prefer nothing be said about us... EVER!", 
   {
    "post_info": {
     "post_title": "Ending the silence."
    }
   }, 
   null, 
   null, 
   1146772320.0
  ], 
  [
   211304, 
   null, 
   "foundit66", 
   "CALIFORNIA Committee OKs bill to add gays, lesbians to textbooks\n \n Hotly debated measure heads to state Senate\n \n http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/05/04/BAG5HIKCCI1.DTL\n \n \"Hotly debated\" is a bit misleading. There is \"hot\" debate, but the heat comes from a quite small minority who prefer nothing be said about us... EVER!\n\n Nothing be said...\n \n With the exception of unproven claims regarding \"reparative therapy\" or claims that homosexuality is a mental illness or statements that it's \"immoral\" or scientifically refuted claims that homosexuals make inferior parents or ...", 
   {}, 
   211303, 
   null, 
   1146772980.0
  ], 
  [
   211309, 
   null, 
   "jyoshu", 
   "This bill is wrong in so many ways, I don't even know where to begin. Geeez.\n \n And public education advocates actually wonder about reasons why private schools and homeschooling are on the increase these days . . .", 
   {}, 
   211303, 
   null, 
   1146774300.0
  ], 
  [
   211314, 
   null, 
   "BobNelson2", 
   "This bill is wrong in so many ways, I don't even know where to begin. Geeez.\n\n \n Oh, go on. Give it a try!", 
   {}, 
   211309, 
   null, 
   1146774840.0
  ], 
  [
   211317, 
   null, 
   "foundit66", 
   "And public education advocates actually wonder about reasons why private schools and homeschooling are on the increase these days . . .\n\n Yeah.\n It's got everything to do with people wanting to teach their children \"objectively\" about homosexuality, giving them all the facts and perspectives, in a 'pro-gay' light...\n \n And THAT is why people object to this...\n \n It has nothing to do with violence in the schools, metal detectors, teachers who are apathetic, ...\n \n <end sarcasm<\n emoticon_xdonno", 
   {}, 
   211309, 
   null, 
   1146775140.0
  ], 
  [
   211318, 
   null, 
   "jyoshu", 
   "I don't know much about California politics, but I wonder if the senate is likely to pass it. It still has to get through that AND the governor.", 
   {}, 
   211317, 
   null, 
   1146775260.0
  ], 
  [
   211320, 
   null, 
   "foundit66", 
   "What REALLY concerns parents...\n \n --------------------------------------------------\n Parents think the nation's public schools have more serious problems than schools in their local community. The majority of parents named six concerns as major problems facing schools in the nation. But none of these was identified by a majority of parents as major problems in their own community's schools: \n Undisciplined and disruptive students (71% say it's major problem in schools nationwide; 40% say it's a major problem in their community's schools) \n Lack of parental involvement (68% nationwide; 43% community) \n Overcrowded classrooms (64% nationwide; 44% community) \n Violence and school safety (63% nationwide; 31% community) \n Students' use of alcohol and drugs (62% nationwide; 44% community) \n Inequality in funding among school districts (54% nationwide; 36% community)\n http://www.npr.org/programs/specials/poll/education/education.front.html", 
   {}, 
   211318, 
   null, 
   1146775740.0
  ], 
  [
   211326, 
   null, 
   "BobNelson2", 
   "I don't know much about California politics, but I wonder if the senate is likely to pass it. It still has to get through that AND the governor.\n\n \n I assume you mean something with that \"AND\" in all caps. Haven't you heard? Ahnuld's back to being a \"moderate Republican\".", 
   {}, 
   211318, 
   null, 
   1146777360.0
  ], 
  [
   211329, 
   null, 
   "jitobear", 
   "You mean - kids might learn that gay people exist and contribute to society. HEAVEN FORBID!!! More dumb parents to mock. YAH!", 
   {}, 
   211326, 
   null, 
   1146779040.0
  ], 
  [
   211331, 
   null, 
   "Kronus", 
   "I wish they'd given some examples of what they meant. I'm an engineer, so when they said \"add gays, lesbians to textbooks\", my first thought was that X% of all word problems in math books would have to include gays. Reading further, I decided that's probably not what they meant. :) But what, exactly, do they mean? When they say \"students should be made aware of the role that gay, lesbian, bisexual and transgender people have made\" are they just talking about history books? If an economist happened to be gay, do econ textbooks need to mention that if they reference him? Will they be adding new stuff, or just making a point of mentioning if some historical figure that's already famous is gay?", 
   {}, 
   211326, 
   null, 
   1146779640.0
  ], 
  [
   211334, 
   null, 
   "unkerpaulie", 
   "I wish they'd given some examples of what they meant. I'm an engineer, so when they said \"add gays, lesbians to textbooks\", my first thought was that X% of all word problems in math books would have to include gays. Reading further, I decided that's probably not what they meant. :) But what, exactly, do they mean? When they say \"students should be made aware of the role that gay, lesbian, bisexual and transgender people have made\" are they just talking about history books? If an economist happened to be gay, do econ textbooks need to mention that if they reference him? Will they be adding new stuff, or just making a point of mentioning if some historical figure that's already famous is gay?\n\n i'm wondering the exact same thing\n \n interestingly enough, there are little history snippets in schools and such about historical figures who were black, i suppose in an effort to raise pride and awareness of acheivements by black people among black communities. i suppose this might be something like that... however, i'm pretty sure they are not information put into text books, but other non-academic books and articles, some of which might be posted on school bulletin boards and what not.", 
   {}, 
   211331, 
   null, 
   1146780720.0
  ], 
  [
   211336, 
   null, 
   "BobNelson2", 
   "If an economist happened to be gay, do econ textbooks need to mention that if they reference him? Will they be adding new stuff, or just making a point of mentioning if some historical figure that's already famous is gay?\n\n \n I would expect to see the most impact in those fields that already mention the personal lives of historically important individuals or groups, so history, literature, art history... etc. There are few cases where personal details slip into teaching in the sciences, but there are some.", 
   {}, 
   211331, 
   null, 
   1146781620.0
  ], 
  [
   211339, 
   null, 
   "robbie0517", 
   "Socrates, Plato, Alexander the Great, Michelangelo, just to name a few were all gay. Public schools have been making a point to point out a person in history as black, female, hispanic etc.. for quite a while now.\n What valid argument can be made to not point out homosexual persons in history the same way? If you are against this, would you also be for removing any reference to race, gender or ethnicity of all historical figures. \n Can anyone argue that a young person having a role model in history is somehow wrong?", 
   {}, 
   211303, 
   null, 
   1146784440.0
  ], 
  [
   211374, 
   null, 
   "Steeeeve", 
   "Exactly what books is this supposed to go into? Obviously not math books...english books shouldn't be big either...science books wouldn't make sense. History books is the only one I can think of but what would you put in there? It seems like if you wanted the \"gays and lesbians\" that made a contribution to gay rights movements..etc, then why not people who had cancer that advanced cancer research or maybe people with disabilities that advanced disability rights. This isn't a \"i got ya\" question...it is an honest question about what books this would go into.\n \n EDIT: If I had read the thread I would see this is currently being discussed....\n \n I still don't think we should describe every person that did something....\"John Doe who was male, 5'7\", blue eyes, gay, blonde hair, medium build, and white created the internet\"", 
   {}, 
   211339, 
   null, 
   1146807360.0
  ], 
  [
   211391, 
   null, 
   "robbie0517", 
   "Exactly what books is this supposed to go into? Obviously not math books...english books shouldn't be big either...science books wouldn't make sense. History books is the only one I can think of but what would you put in there? It seems like if you wanted the \"gays and lesbians\" that made a contribution to gay rights movements..etc, then why not people who had cancer that advanced cancer research or maybe people with disabilities that advanced disability rights. This isn't a \"i got ya\" question...it is an honest question about what books this would go into.\n \n EDIT: If I had read the thread I would see this is currently being discussed....\n \n I still don't think we should describe every person that did something....\"John Doe who was male, 5'7\", blue eyes, gay, blonde hair, medium build, and white created the internet\"\n\n \n They want to add to any subject that a gay person contributed to. This is not about the gay rights movement. This could be almost any subject including science and history. They will point it out the same way they point out the the individual was aftrican american, hispanic etc.. For example: \"Alexander the Great, a homosexual male, .........", 
   {}, 
   211374, 
   null, 
   1146837480.0
  ], 
  [
   211407, 
   null, 
   "jyoshu", 
   "Here are some problems I see with this . . . .\n \n 1.) No one is going to be able to be certain about anyone being gay unless that historical person self-identified as gay. It's not like when someone is black, where all one needs to do is see a picture or a painting of that person. The fact is, we don't really know if a lot of historical people that we assume might have been gay really were. For instance, we think Walt Whitman might have been gay, but we'll never know for sure. And it gets even less clear the farther we go back in history. Yes, we know that the ancient greeks had sex between men and boys as a normal part of their culture, but that doesn't mean Socrates and Plato were truly gay. And since presenting something as fact when there's not good evidence behind is bad science, I don't see how this is a good thing.\n \n 2.) This is an example of a state regulating classrooms. Sometimes that's ok, but there better be a darn good reason for governments to force schools to buy textbooks with certain things in them, or to force teachers to teach about a give subject. Sure, schools should be expected to teach about how to read and how to do math, among other essentials. But something like this, a sociological issue, should not be forced. I'd love to know whether government, either state or federal, has forced schools to adopt other matters pertaining to sociological issues, and what those issues are. Is there a precedent for this sort of thing? \n \n 3.) Do we really want sexual orientation to be something along the lines of an ethnic identity? See, this is why I find it odd when gay people assert that pride is not a bid deal in their movement. If it weren't, we probably wouldn't be having this discussion. I, for one, don't feel that studying about the sexual orientation of historical people does anything other than taking time away from studying about their actual discoveries, achievements, and contributions. I'd much rather see students reading and studying the works of Plato than the teacher taking up class time talking about the possibilities of his sexual orientation, which will never be anything other than hypothetical.", 
   {}, 
   211391, 
   null, 
   1146846960.0
  ], 
  [
   211414, 
   null, 
   "robbie0517", 
   "Here are some problems I see with this . . . .\n \n 1.) No one is going to be able to be certain about anyone being gay unless that historical person self-identified as gay. It's not like when someone is black, where all one needs to do is see a picture or a painting of that person. The fact is, we don't really know if a lot of historical people that we assume might have been gay really were. For instance, we think Walt Whitman might have been gay, but we'll never know for sure. And it gets even less clear the farther we go back in history. Yes, we know that the ancient greeks had sex between men and boys as a normal part of their culture, but that doesn't mean Socrates and Plato were truly gay. And since presenting something as fact when there's not good evidence behind is bad science, I don't see how this is a good thing.\n \n 2.) This is an example of a state regulating classrooms. Sometimes that's ok, but there better be a darn good reason for governments to force schools to buy textbooks with certain things in them, or to force teachers to teach about a give subject. Sure, schools should be expected to teach about how to read and how to do math, among other essentials. But something like this, a sociological issue, should not be forced. I'd love to know whether government, either state or federal, has forced schools to adopt other matters pertaining to sociological issues, and what those issues are. Is there a precedent for this sort of thing? \n \n 3.) Do we really want sexual orientation to be something along the lines of an ethnic identity? See, this is why I find it odd when gay people assert that pride is not a bid deal in their movement. If it weren't, we probably wouldn't be having this discussion. I, for one, don't feel that studying about the sexual orientation of historical people does anything other than taking time away from studying about their actual discoveries, achievements, and contributions. I'd much rather see students reading and studying the works of Plato than the teacher taking up class time talking about the possibilities of his sexual orientation, which will never be anything other than hypothetical.\n\n \n I don't believe that wether are not they were gay is questionable, it is well known. This quote from this website, http://www.lambda.org/famous.htm sums up the reason we need this pretty well I think:\n \n \"Within the typical secondary school curriculum, homosexuals do not exist. They are 'nonpersons' in the finest Stalinist sense. They have fought no battles, held no offices, explored nowhere, written no literature, built nothing, invented nothing and solved no equations. The lesson to the heterosexual student is abundantly clear: homosexuals do nothing of consequence. To the homosexual student, the message has even greater power: no one who has ever felt as you do has done anything worth mentioning.\" -Gerald Unks", 
   {}, 
   211407, 
   null, 
   1146851220.0
  ], 
  [
   211415, 
   null, 
   "jyoshu", 
   "I don't believe that wether are not they were gay is questionable, it is well known. This quote from this website, http://www.lambda.org/famous.htm sums up the reason we need this pretty well I think:\n \n \"Within the typical secondary school curriculum, homosexuals do not exist. They are 'nonpersons' in the finest Stalinist sense. They have fought no battles, held no offices, explored nowhere, written no literature, built nothing, invented nothing and solved no equations. The lesson to the heterosexual student is abundantly clear: homosexuals do nothing of consequence. To the homosexual student, the message has even greater power: no one who has ever felt as you do has done anything worth mentioning.\" -Gerald Unks\n\n \n So you propose to use hypotheticals (\"so-and-so in history may have been gay\") to do this? It seems to me that if schools simply teach that homosexuality exists in humanity, people are going to know that some of them may have been gay OR straight, and unless the historical person self-claimed to be gay, that's most we'll ever know anyway. I just don't get why someone's sexual orientation needs to be of historical consequence. They don't mention that people were straight, either. It's not like it needs to be an issue, either way.", 
   {}, 
   211414, 
   null, 
   1146851460.0
  ], 
  [
   211438, 
   null, 
   "BobNelson2", 
   "Here are some problems I see with this . . . .\n\n \n Wow, I haven't had a good laugh like that in months!\n \n Thanks, jyoshu.", 
   {}, 
   211407, 
   null, 
   1146864720.0
  ], 
  [
   211443, 
   null, 
   "jyoshu", 
   "Wow, I haven't had a good laugh like that in months!\n \n Thanks, jyoshu.\n\n \n Thanks, Bob! I'm glad you thought so positively of it, and I certainly appreciate your comprehensive and point-by-point well-thought-out engagement of the points I brought up. Nothing like robust discussion. emoticon_xgood", 
   {}, 
   211438, 
   null, 
   1146867480.0
  ], 
  [
   211453, 
   null, 
   "BobNelson2", 
   "Thanks, Bob! I'm glad you thought so positively of it, and I certainly appreciate your comprehensive and point-by-point well-thought-out engagement of the points I brought up. Nothing like robust discussion. emoticon_xgood\n\n \n Well, I'm kinda busy today. Besides, I figured you could offer your own \"robust discussion\" since you've taken diametrically opposed positions on school curricula in this and the thread on the Kings book.\n \n What a hoot!!", 
   {}, 
   211443, 
   null, 
   1146870720.0
  ], 
  [
   211454, 
   null, 
   "Kronus", 
   "So you propose to use hypotheticals (\"so-and-so in history may have been gay\") to do this? \n\n \n That is, in fact, the exact opposite of what he said. Perhaps if you engaged in real debate, including but not limited to reading and responding to what people actually said, you would find that other people would do the same.", 
   {}, 
   211415, 
   null, 
   1146873060.0
  ], 
  [
   211466, 
   null, 
   "robbie0517", 
   "So you propose to use hypotheticals (\"so-and-so in history may have been gay\") to do this? It seems to me that if schools simply teach that homosexuality exists in humanity, people are going to know that some of them may have been gay OR straight, and unless the historical person self-claimed to be gay, that's most we'll ever know anyway. I just don't get why someone's sexual orientation needs to be of historical consequence. They don't mention that people were straight, either. It's not like it needs to be an issue, either way.\n\n \n Is this really your concern? That no one can prove that they were gay? Many today don't feel comfortable self-proclaiming they are gay much less throughout history. If they did self-proclaim to be gay you would still probably ask \"but were they really\". Don't you support the notion that homosexuality is a myth anyhow? I guess you have to look at the evidence and make a decision this way. The evidence that I have found overwhelmingly supports the notion that they are gay. Anyhow, the importance that I mentioned before outweighs the need for proof. There has been a real lack of showing that gay people actually do contribute to societies. African americans benefit from role models, woman benefit from role models, athletes benefit from role models why can't gay people benefit from role models? What is truth behind your protest? Should we remove any reference to gender or ethnicity from all text books as well?", 
   {}, 
   211415, 
   null, 
   1146883740.0
  ], 
  [
   211483, 
   null, 
   "jyoshu", 
   "Is this really your concern? That no one can prove that they were gay? \n\n \n It's my opinion, in this discussion. What is the problem with that?\n \n \nDon't you support the notion that homosexuality is a myth anyhow?\n\n \n No, not at all. I've said no such thing. I've argued before that I even see no reason there's not a genetic component.\n \n \n \nI guess you have to look at the evidence and make a decision this way. The evidence that I have found overwhelmingly supports the notion that they are gay.\n\n \n Do you really think there is that much evidence available about the sexual orientation of Socrates and Plato and others living that far back in history? Maybe more recent historical figures, I could agree with. Have you really seen evidence, or are you just saying that because the site that you linked told you so? You just said yourself that people today aren't confortable self-proclaiming they are gay, much less people thruout history. That fact alone speaks volumes about the reliability of assuming the sexual orientation of historical figures.\n \n \nAnyhow, the importance that I mentioned before outweighs the need for proof.\n\n \n Whoa! Are you saying to disregard the need for proof and draw conclusions regardless of it? Whatever happened to simply basing assertions on truth? If a person self-identified as a homosexual, I have no problem teaching that he or she was homosexual. But going out on a limb and trying to read homosexuality into history anywhere we can is not a good way to do it. There's just no way to know a person's sexual orientation for sure unless they were clear about it themselves.", 
   {}, 
   211466, 
   null, 
   1146896400.0
  ], 
  [
   211484, 
   null, 
   "jyoshu", 
   "That is, in fact, the exact opposite of what he said. Perhaps if you engaged in real debate, including but not limited to reading and responding to what people actually said, you would find that other people would do the same.\n\n \n Unless an historical person self-identified as gay, it's always going to be a hypothetical to assume he or she was. Unless we happen to know that, say, they only had same-sex sexual partners and never an opposite-sex one, for instance.", 
   {}, 
   211454, 
   null, 
   1146896640.0
  ], 
  [
   211493, 
   null, 
   "robbie0517", 
   "Unless an historical person self-identified as gay, it's always going to be a hypothetical to assume he or she was. Unless we happen to know that, say, they only had same-sex sexual partners and never an opposite-sex one, for instance.\n\n \n IMO many historical figures leave no doubt of their homosexuality such as the impression left after reading Platos Symposium. \n If I understand you, you would have no problem incorporating the sexual orientation into the teachings as long as the homosexuality of the person is self proclaimed, is that right? This is not what I got from your earlier posting. \n Can you see why some think this would be beneficial to helping to decrease the sterotypes of gays? \n \n I honestly think that protesting against this because they did not \"self proclaim\" is a smoke screen to cover the true feelings you have towards anything that shows gays in a positive light. Your reaction to the \"King and King\" book is along the same lines. You want to shield children from anything positive about gays to ensure their views towards gays doesn't change to a more accepting view due to your religious views. You have a right to your views but you should just come right out and say that this is your reason. You may not do this because you know that this argument doesn't hold much weight in many areas but at least your honest. \n \n Here are some links I read through that helped influence me as far as determining if their perceived homosexuality is more likely than not. \n \n http://qrd.org/qrd/www/world/europe/greece/roz_mov/biografi.html\n \n http://www.gayheroes.com", 
   {}, 
   211484, 
   null, 
   1146900840.0
  ], 
  [
   211495, 
   null, 
   "MrWriteLA", 
   "I doubt very much that a textbook is going to say a famous person is or was homosexual unless there is considerable evidence to support the assertion.\n \n No one today seriously contends that Oscar Wilde, James Baldwin, Socrates, Tchaikovsky, Bayard Rustin, Truman Capote, Marcel Proust, Gertrude Stein, Cole Porter, Tennessee Williams, Michelangelo, Walt Whitman, Langston Hughes, E.M. Forster, Aaron Copland, W. Somerset Maugham, or Alan Turing--among many, many more--were homosexual, and in most if not all of these cases, it can be said that their careers were significantly informed or impacted, whether positively or negatively, by their orientation. Not to mention that orientation when teaching about them in a high school level class would be to give an impression as incomplete and misleading as that given in the \"history\" classes of totalitarian countries, where facts embarrassing to the current regime have been carefully expunged.", 
   {}, 
   211493, 
   null, 
   1146903120.0
  ], 
  [
   211511, 
   null, 
   "Matthew S", 
   "Here are some problems I see with this . . . .\n \n 1.) No one is going to be able to be certain about anyone being gay unless that historical person self-identified as gay. It's not like when someone is black, where all one needs to do is see a picture or a painting of that person.\n\n \n \n\n 3.) Do we really want sexual orientation to be something along the lines of an ethnic identity? \n\n \n The same could be said for religious identity but religion is legally protected. Ofcorse if I had my way every gay person would wake up tomorrow with either a pink triagle in the middle of their forhead or turn the color pink, or blue, or kermit the frog green. That way there would be no question of our identity as a race of people. Once we can no longer hide we will gain momentum.", 
   {}, 
   211407, 
   null, 
   1146919260.0
  ], 
  [
   211520, 
   null, 
   "Kronus", 
   "Unless an historical person self-identified as gay, it's always going to be a hypothetical to assume he or she was. Unless we happen to know that, say, they only had same-sex sexual partners and never an opposite-sex one, for instance.\n\n \n First off, I wasn't addressing that point, I was addressing the fact the you utterly twisted what Robbie said, and pointing out that it's that sort of behavior that causes people to not bother engaging you in serious debate. But let's give it a shot. Please feel free to shock me by responding to what I'm actually about to write.\n \n You're appproach to history is simply not the way it's done. Very little about what we think we know about historical figures comes strictly from their \"self-identification\". Any historian knows that auto-biographies can be self serving, and so will use many sources to determine what a person was like and what they did. If someone self identified as a virtuous person, but we have testimony from scores of people stating that he was a lech who fathered dozens of out of wedlock children, than only a very poor historian would say \"He didn't self identify as a letch, so we can't call him one\". If you want to learn something about a historical figure you have to look at everything you can find about them, and make a judement based on all the data, not just what they said about themselves.", 
   {}, 
   211484, 
   null, 
   1146927180.0
  ], 
  [
   211525, 
   null, 
   "MrWriteLA", 
   "If you want to learn something about a historical figure you have to look at everything you can find about them, and make a judement based on all the data, not just what they said about themselves.\n Not to mention the fact that prior to the late 1800's, the word \"homosexual\" didn't exist, let alone \"gay\" in the current sense--nor did the concept of sexual orientation. There was no way anyone who lived before that time would have \"self-identified\" as such. Yet it would be grossly misrepresentative to create the impression to history students that there were simply no gay people prior to the late nineteenth century.\n \n There was even what we would now call a \"closeted gay\" reverend and poet in colonial times: http://www.pbs.org/outofthepast/past.html\n \n In addition, what about situations like Roy Cohn--publically homophobic, privately homosexual, who NEVER would have \"self-identified\" as gay but who indisputably was. Is not his sexual hypocrisy during the McCarthy era significant and important enough to be taught... arguably even THE most significant aspect of his notorious legacy? Should teachers just ignore it because he didn't \"self-identify\"?", 
   {}, 
   211520, 
   null, 
   1146931860.0
  ], 
  [
   211530, 
   null, 
   "robbie0517", 
   "Gay History = Human History \n \n http://www.androphile.org/\n \n Gay history no doubt has its place in our education system. I hope this is adopted by California and to every state in the nation. \n Before this thread started, I admit I never gave this topic much thought, but the more I read the more I understand how important it is. This article points out that the \"big lie\" is that same-sex love is against nature which flies in the face of both biology and history. This is a point that needs to be made and understood.", 
   {}, 
   211525, 
   null, 
   1146933300.0
  ], 
  [
   211545, 
   null, 
   "jyoshu", 
   "IMO many historical figures leave no doubt of their homosexuality such as the impression left after reading Platos Symposium. \n If I understand you, you would have no problem incorporating the sexual orientation into the teachings as long as the homosexuality of the person is self proclaimed, is that right?\n\n \n Right. My view is that if it's historical fact, it's historical fact, and there's no reason to pretend it isn't there. But at the same time, I don't think more should be made of it than is necessary, either. I find it pretty hard to believe that in most cases, an historical person's sexual orientation is really all that pertinent in terms of what the person accomplished. Is it really anything more than an historical curiousity that Alexander the Great may have been gay? I don't think so. It might make a good Trivial Pursuit question.\n \n \nI honestly think that protesting against this because they did not \"self proclaim\" is a smoke screen to cover the true feelings you have towards anything that shows gays in a positive light. Your reaction to the \"King and King\" book is along the same lines. \n\n \n Well, it's certainly your prerogative to be wrong if you want. I think the real issue is that gay pride groups want sexual orientation to be made more of an issue than it needs to be, in both these cases. That's why I've taken issue with this. So if by 'true feelings' you mean my true feelings that this push to emphasize sexual orientation in history and kid's books is over-the-top, then yes I guess your're right.\n \n \nBut let's give it a shot. Please feel free to shock me by responding to what I'm actually about to write.\n\n \n If you're really intending to discuss this rather than attacking-the-messenger or the WAYS I discuss this (which is what you've done much of as of late) as opposed to the topic, then I'm more than willing to do so. \n \n \nYou're appproach to history is simply not the way it's done. Very little about what we think we know about historical figures comes strictly from their \"self-identification\". \n\n \n Of course not, but THIS needs to, because there is so much less to go on when it comes to sexual orientation that the most we're going to do is speculate in many cases (particularly since homosexuality was often hidden at times throughout history). Looking back in history and seeing a man who, for example, didn't marry and shared a house with another man doesn't mean he was gay--and it would be nothing more than speculative to assume he was. If they self-identified as gay, that's a different matter. \n \n \nIf someone self identified as a virtuous person, but we have testimony from scores of people stating that he was a lech who fathered dozens of out of wedlock children, than only a very poor historian would say \"He didn't self identify as a letch, so we can't call him one\".\n\n \n Tell you what, if you can find cases where scores of people at the time stated that so-and-so historical figure hundreds or thousands of years ago was homosexual, then go right ahead. Or made any statement at all concerning whether they were gay or straight. You may have something. The point is, that doesn't usually happen with cases like this and that's WHY it's normally speculation UNLESS the person has self-identified as being gay.\n \n \nNo one today seriously contends that Oscar Wilde, James Baldwin, Socrates, Tchaikovsky, Bayard Rustin, Truman Capote, Marcel Proust, Gertrude Stein, Cole Porter, Tennessee Williams, Michelangelo, Walt Whitman, Langston Hughes, E.M. Forster, Aaron Copland, W. Somerset Maugham, or Alan Turing--among many, many more--were homosexual\n\n \n If they made it clear themselves they were gay, I have no problem with that. Like I said, if they self-identified as gay, then I see nothing wrong with bringing that out especially if it's pertinent to that person's accomplishments.\n \n \nIn addition, what about situations like Roy Cohn--publically homophobic, privately homosexual, who NEVER would have \"self-identified\" as gay but who indisputably was. Is not his sexual hypocrisy during the McCarthy era significant and important enough to be taught... arguably even THE most significant aspect of his notorious legacy? Should teachers just ignore it because he didn't \"self-identify\"?\n\n \n I would say 2 things to this:\n \n First, (in this case of Roy Cohn and other more contemporary figures) I think there is a difference in determining sexual orientation in someone who lived only a few decades ago, from someone who lived centuries ago, or even thousands of years. For someone who lived as pretty much a contemporary in our time we have the benefit of eyewitnesses to that person's life, interviewing people that knew that person, and even interacting with that person's family members and children in many cases. We can be more confident in coming to an accurate picture of that person's life. So in such a case as this, it may not be as necessary for a person to have self-identified as being gay to know that they were. For someone who lived centuries or thousands of years ago, it's often going to be speculation. I don't see how you could not agree with that.\n \n Second, is it REALLY pertinent to teach about Roy Cohn's own sexual orientation just because he engaged in publically homophobic actions? Does it really matter whether he was gay or straight given that abuse of gay people is wrong, either way??? In a case of a black person who had helped round up slaves and have them captured by southern slaveowners in the 19th century, would you make an issue out of the fact that he was black? Or how about the many anti-feminist people that have lived who also happened to be women? I don't think the sexual orientation of Roy Cohn really matters so much as teaching about what he did.\n \n \nGay history no doubt has its place in our education system. I hope this is adopted by California and to every state in the nation. This article points out that the \"big lie\" is that same-sex love is against nature which flies in the face of both biology and history. This is a point that needs to be made and understood.\n\n \n Then why not teach that in biology rather than using history teaching as a means to an end to get that across? Whatever happened to teaching history for the sake of teaching history?\n ", 
   {}, 
   211493, 
   null, 
   1146940500.0
  ], 
  [
   211554, 
   null, 
   "robbie0517", 
   " I don't think more should be made of it than is necessary, either. I find it pretty hard to believe that in most cases, an historical person's sexual orientation is really all that pertinent in terms of what the person accomplished. Is it really anything more than an historical curiousity that Alexander the Great may have been gay? I don't think so. It might make a good Trivial Pursuit question.\n \n \n \n Well, it's certainly your prerogative to be wrong if you want. I think the real issue is that gay pride groups want sexual orientation to be made more of an issue than it needs to be, in both these cases. That's why I've taken issue with this. So if by 'true feelings' you mean my true feelings that this push to emphasize sexual orientation in history and kid's books is over-the-top, then yes I guess your're right.\n\n \n Here is the sample letter from Equality California's website that one can send to show support for the bill. The letter explains why they are making a bigger deal out of this than you think is necessary. \"Schools that perpetuate silence around LGBT issues can be breeding grounds for the fear and ignorance that fuel teasing during the early grades and violent hate acts by the time students reach high school. By middle school, studies show that many LGBT teens are inclined to truancy and get lower grades than their peers.\"\n \n Can you put your \"proof they were gay\" argument aside for a moment and tell me what you think of the points made here. Do you agree with all, part or none of it? What negatives can you point out? \n \n From website: http://www.eqca.org/site/apps/nl/content2.asp?c=9oINKWMCF&b=1352277&ct=2120323\n \n Dear Senator Kuehl,\n \n On behalf of [Insert Organization Name], I am writing to express our strong support for your SB 1437. The bill would prohibit biased curriculum and require that the contributions of lesbian, gay, bisexual and transgender (LGBT) people, like other underrepresented groups, be included in social science curriculum.\n \n Current law requires inclusion in the curriculum of the historical role of traditionally underrepresented groups, including women, African-Americans, Native Americans, Mexican Americans and Asian Pacific Islanders. However, the contributions of the LGBT community are omitted entirely from most textbooks and other instructional materials. \n The LGBT community represents a significant and indelible part of the history and social fabric of California. An analysis of the 2000 U.S. Census conducted by the Williams Institute, a policy think tank based at the University of California, Los Angeles School of Law, revealed that there are more than 92,000 LGBT households in California, not including single LGBT people or LGBT couples who do not cohabitate. While LGBT people represent a sizable and important part of the state, the LGBT community's role in California history and contemporary society is conspicuously absent in most curricula. In a 2003 National School Climate Survey by the Gay, Lesbian, Straight Education Network (GLSEN), 76.2% of youth reported that LGBT issues were never addressed or discussed in their classes.\n In schools where LGBT issues are reflected in the curriculum, results have been overwhelmingly positive. The 2003 Preventing Harassment Survey, carried out by the California Safe Schools Coalition in partnership with the Gay-Straight Alliance Network, found that 67% of students who have learned about LGBT issues at school said their school is safe for LGBT students, compared to 40% of students who have not learned about LGBT issues at school.\n As a society, we have learned from other traditionally underrepresented groups that invisibility is a dangerous and painful condition. Schools that perpetuate silence around LGBT issues can be breeding grounds for the fear and ignorance that fuel teasing during the early grades and violent hate acts by the time students reach high school. By middle school, studies show that many LGBT teens are inclined to truancy and get lower grades than their peers. Positive and accurate depictions of their community in the materials they study at school can spark valuable discussions and interventions, and improve these students' opportunity to learn, stay in school and eventually graduate. Moreover, the high rates of suicide among LGBT youth and hate crimes against LGBT people indicate that we must not wait until high school to begin to talk about the LGBT community and families in healthy and age-appropriate ways.\n The goal of SB 1437 to enrich the learning experiences of all students and promote an atmosphere of safety and respect in California schools is one my organization strongly supports. Thank you for carrying this very important measure.\n \n Sincerely,", 
   {
    "unicode_changes_made": true
   }, 
   211545, 
   null, 
   1146945180.0
  ], 
  [
   211558, 
   null, 
   "BobNelson2", 
   "Right. My view is that if it's historical fact, it's historical fact, and there's no reason to pretend it isn't there. \n\n \n Apparently there is, as we've been wiped out of history over the last few centuries.\n \n \nBut at the same time, I don't think more should be made of it than is necessary, either. I find it pretty hard to believe that in most cases, an historical person's sexual orientation is really all that pertinent in terms of what the person accomplished. Is it really anything more than an historical curiousity that Alexander the Great may have been gay? I don't think so. It might make a good Trivial Pursuit question.\n\n \n Trivializing our history, figuratively and literally. Good job.\n \n \nWhatever happened to teaching history for the sake of teaching history?\n \n\n \n I'm not surprised that you see history as nothing more than a collection of dates and places.", 
   {}, 
   211545, 
   null, 
   1146948240.0
  ], 
  [
   211559, 
   null, 
   "BobNelson2", 
   "Here is the sample letter from Equality California's website that one can send to show support for the bill. The letter explains why they are making a bigger deal out of this than you think is necessary. \n\n \n While I can see and largely support their efforts, I think it's more important to include the truth about history because it's the truth. Leaving out homosexuality and bisexuality -- or worse, covering it up with silly excuses -- is intellectually dishonest. How can one understand Alexander's last years without understanding his relationship with Hephaestion? Indeed how can one begin to understand Greek culture at all -- and most cultures -- without talking about institutional homosexuality and bisexuality? How to grasp Roy Cohn's personality without addressing self-loathing and hypocrisy?\n \n I remember a particularly ludicrous explanation of Michelangelo's sculpture by Sister Wendy on PBS. She noted the power and vitality of his male figures, the animal presence, the raw masculinity, and contrasted that with the stiltedness of his female figures, their coldness, their emptiness. Her explanation? Something about Michelangelo so loving his mother that he couldn't or wouldn't depict female sexuality realistically.\n \n Hah!", 
   {}, 
   211554, 
   null, 
   1146949020.0
  ], 
  [
   211573, 
   null, 
   "Kronus", 
   "\n If you're really intending to discuss this rather than attacking-the-messenger or the WAYS I discuss this (which is what you've done much of as of late) as opposed to the topic, then I'm more than willing to do so. \n\n If the way you choose to debate it is by being duplicitious, than that's what I'll comment on. Keep it honest. So far you're doing alright.\n \n \n Looking back in history and seeing a man who, for example, didn't marry and shared a house with another man doesn't mean he was gay--and it would be nothing more than speculative to assume he was. If they self-identified as gay, that's a different matter. \n\n Why would you assume that historians would base their judgements on no evidence what-so-ever? These aren't rumor mongers were discussing here, they're professionals. They're not going to say that someone is gay just because someone kinda maybe acted a little that way. They'll base that pronouncement on actual evidence. And if there is no evidence, than they wouldn't take a stand on the issue. And surely you understand that there can be evidence other than the person in question saying \"I'm gay\"? For example, if historians can find diaries from several different people all saying that they had gay sex with this person, that would be evidence.\n \n \n\n Tell you what, if you can find cases where scores of people at the time stated that so-and-so historical figure hundreds or thousands of years ago was homosexual, then go right ahead. Or made any statement at all concerning whether they were gay or straight. You may have something. The point is, that doesn't usually happen with cases like this and that's WHY it's normally speculation UNLESS the person has self-identified as being gay.\n \n\n Of course it happens. How do you think we know that some historical figues were gay? Seriously, how do you think historians have come to that conclusion? Do you think they just made it up? Tell you what. Take any historical figure you like, one that's commonly known to be gay, and tell me why you think historians were wrong to reach that conclusion. Any one you like, go ahead.", 
   {}, 
   211545, 
   null, 
   1146960180.0
  ], 
  [
   211591, 
   null, 
   "jyoshu", 
   "Here is the sample letter from Equality California's website that one can send to show support for the bill. The letter explains why they are making a bigger deal out of this than you think is necessary. \"Schools that perpetuate silence around LGBT issues can be breeding grounds for the fear and ignorance that fuel teasing during the early grades and violent hate acts by the time students reach high school. By middle school, studies show that many LGBT teens are inclined to truancy and get lower grades than their peers.\"\n\n \n Do they (and you) really think these schools are perpetuating silence??? Where's the evidence of that? I get the idea that you think these school administrators are sitting in meetings trying to think of ways to make sure homosexuality isn't mentioned. I'm in my 40s, and it was not something teachers avoided teaching about when I was in high school! I think gay people have plenty of exposure, including in schools. There's probably not a student in most high schools that don't know about homosexuality and some people are gay. Trying force teachers to teach about homosexuality isn't the way to do it. What's next? A minimal amount of gay-issues teaching a day? A bill to ensure at least an 180 hours a year of it? On top of that, a lot of teachers may not have moral and religious beliefs condusive to teaching only your viewpoint on this. Not to mention parents that feel that way as well. But I guess their beliefs don't really matter anyway, huh?\n \n \nCan you put your \"proof they were gay\" argument aside for a moment and tell me what you think of the points made here. Do you agree with all, part or none of it? What negatives can you point out? \n\n \n I think it's a pretty typical liberal solution to solve social issues completely by unnecessary over-regulation, over something that would rarely be historically pertinent (the sexual orientation of historical figures). That's what I think. \n \n \nTrivializing our history, figuratively and literally. Good job.\n\n \n Well, gee Bob, I had no idea I was supposed to take the sexual orientation of historical figures as so significant. Give me a break! Heck, why don't you lobby the government to force schools to teach about the handedness of every historical figure as well? We wouldn't want to actually trivialize it, after all. Good grief. emoticon_rolleyes \n \n \nI remember a particularly ludicrous explanation of Michelangelo's sculpture by Sister Wendy on PBS. She noted the power and vitality of his male figures, the animal presence, the raw masculinity, and contrasted that with the stiltedness of his female figures, their coldness, their emptiness. Her explanation? Something about Michelangelo so loving his mother that he couldn't or wouldn't depict female sexuality realistically.\n\n \n Ooh, now THERE'S some convincing evidence of a gay sexual orientation--emphasizing male masculinity over the female's. (Today, he'd probably just be called a male cheuvanist pig. emoticon_wow )\n \n \nWhy would you assume that historians would base their judgements on no evidence what-so-ever? These aren't rumor mongers were discussing here, they're professionals. They're not going to say that someone is gay just because someone kinda maybe acted a little that way. They'll base that pronouncement on actual evidence. \n\n \n Yeah sure, like the usual speculative \"evidence\" that so-and-so never married, or male so-and-so shared a house with another man for years, or rumors at the time (as in the case of president Garfield). Exactly what non-self-identified evidence do you think historians go on when they make these judgements, Kronos? I have news for you: it's ain't marriage certificates and DNA testing. Do you really think it's any coincidence that almost every time a historian (and often one going out on a limb) decides to make a name for himself by throwing out a \"he-was-gay\" theory that many other historians often don't agree or at least point out that it's only an historical theory? Historians themselves (good ones anyway) are usually the first to say that making statements about the sexual orientation of someone who lived hundreds or thousands of years ago is often speculative, so why can't YOU?\n \n Again, no one is arguing here that if there is conclusive evidence of someone being gay (meaning, they self-identified as such) that it shouldn't be taught.", 
   {}, 
   211554, 
   null, 
   1146972180.0
  ], 
  [
   211608, 
   null, 
   "BobNelson2", 
   "I'm in my 40s, and it was not something teachers avoided teaching about when I was in high school!\n\n \n What DID they teach you? Who did your teachers identify as gay?\n \n \nOn top of that, a lot of teachers may not have moral and religious beliefs condusive to teaching only your viewpoint on this. Not to mention parents that feel that way as well. But I guess their beliefs don't really matter anyway, huh?\n\n \n What ARE the moral objections to teaching that gay people existed?\n \n I can just imagine.... \"Alexander the Great conquered the known world, but he was a pervert\".\n \n y a w n", 
   {}, 
   211591, 
   null, 
   1146980700.0
  ], 
  [
   211617, 
   null, 
   "robbie0517", 
   "Do they (and you) really think these schools are perpetuating silence??? Where's the evidence of that? I get the idea that you think these school administrators are sitting in meetings trying to think of ways to make sure homosexuality isn't mentioned. I'm in my 40s, and it was not something teachers avoided teaching about when I was in high school! I think gay people have plenty of exposure, including in schools. There's probably not a student in most high schools that don't know about homosexuality and some people are gay. Trying force teachers to teach about homosexuality isn't the way to do it. What's next? A minimal amount of gay-issues teaching a day? A bill to ensure at least an 180 hours a year of it? On top of that, a lot of teachers may not have moral and religious beliefs condusive to teaching only your viewpoint on this. Not to mention parents that feel that way as well. But I guess their beliefs don't really matter anyway, huh?\n\n \n Well I am in my 30's, am gay, and this is the first that I have heard of any gay historical figures or even historical figures that were thought to have been gay. Are you really trying to say that you were taught about historical figures with any significance that were gay? I seriously doubt it. If I wasn't taught it in the 80's you certainly weren't taught this in the 70's. If this was already included in text books then this wouldn't be an issue now would it? Why are you trying to put this as \"There's probably not a student in most high schools that don't know about homosexuality and some people are gay.\"? No one hear is suggesting that any high school students don't know homosexuality exists or doesn't know someone who is gay. I find it impossible to believe that this is how you've perceived the issue. Now I totally understand what has been said about you dodging or twisting the issue, not sure exactly how it was put. You were given statistics that show there are 92,000 LGBT households in California. That 76.2% of youth reported that LGBT issues were never addressed or discussed in their classes. That 67% of students who have learned about LGBT issues at school said their school is safe for LGBT students, compared to 40% of students who have not learned about LGBT issues at school. That Schools that perpetuate silence around LGBT issues can be breeding grounds for the fear and ignorance that fuel teasing during the early grades and violent hate acts by the time students reach high school. By middle school, studies show that many LGBT teens are inclined to truancy and get lower grades than their peers. I have seen this first hand and I can tell you that if students were to see themselves reflected in a positive light in this way it would make a difference. \n From all this your argument is that there is no silence? Give me a break! You and others like you had objections when \"king and king\" was read. Your having more irrational objections to this bill which would do nothing but good for gay students and heterosexual students as well. You are trying to perpetuate the silence that you deny even exists. Wow. \n Also theres the argument that if they \"self proclaimed\" then its ok. This is nothing more than a cop out since you know there are none or next to none that have actually done so. You don't have to actually engage the argument by sticking to this. Maybe you think that gay youth doesn't deserve to be comfortable in their learning enviroment, feel safe at school and develop a positive self image. I think its that last one where you draw the line. It's about a gay person having a positive self image or others viewing gays in the slightest positive light. This shows through the use of \"gay pride movement\". I've heard your reasoning behind this but every single gay person knows exactly whats behind your use of it. It's not the words, it's how their used. We've dealt with this stuff all of our lives it's intuition if you will. You get pretty good at deciphering words, body language etc.. it's kind of a developed skill if you will. \n There are gay students out there that need this for reasons that have been explained very well that you haven't even acknowleged or even tried to tell me why these reasons good enough. Am I really to believe that the risk is just to high to look at the evidence and say someone was gay? You're really missing the point or just don't care about these thousands of students this could make a difference for. History makes alot of assumptions based on evidence this is nothing new, have you been actively objecting all along?\n And nobody is suggesting that parents or teachers agree to teach only my viewpoint. They are already required to teach the history of african americans, native americans, mexican americans, etc.. \n As far as there personal beliefs, that can not be put before the best interest of the children. If they had it their way we would only be teaching intelligent design, abstience only etc.. schools are for education not beliefs, that's what church is for.", 
   {}, 
   211591, 
   null, 
   1146984000.0
  ], 
  [
   211643, 
   null, 
   "Kronus", 
   "\n Yeah sure, like the usual speculative \"evidence\" that so-and-so never married, or male so-and-so shared a house with another man for years, or rumors at the time (as in the case of president Garfield). Exactly what non-self-identified evidence do you think historians go on when they make these judgements, Kronos? I have news for you: it's ain't marriage certificates and DNA testing. Do you really think it's any coincidence that almost every time a historian (and often one going out on a limb) decides to make a name for himself by throwing out a \"he-was-gay\" theory that many other historians often don't agree or at least point out that it's only an historical theory? Historians themselves (good ones anyway) are usually the first to say that making statements about the sexual orientation of someone who lived hundreds or thousands of years ago is often speculative, so why can't YOU?\n\n Show me. Give me a citation from a reputable historian saying that, showing his arguments, than maybe your arguments will be a little more believable.\n \n \n\n Again, no one is arguing here that if there is conclusive evidence of someone being gay (meaning, they self-identified as such) that it shouldn't be taught.\n\n \n In fact, you are arguing that conclusive evidence should be ignored, unless it's one specific type which doesn't come up all that often. Yes, obviously in any field, including history, there will be those who will cast aside professionalism just to get in the spotlight for a moment. These people are the exception, they are recognized as such, and their \"contributions\" are generally forgotten over time.\n \n As for what sort of evidence gets used: letteres, diaries, newspaper articles, court proceedings. All the stuff of history. Are you really claiming that all of these put together can never be conclusive?", 
   {}, 
   211591, 
   null, 
   1147013940.0
  ], 
  [
   211660, 
   null, 
   "Steeeeve", 
   "They want to add to any subject that a gay person contributed to. This is not about the gay rights movement. This could be almost any subject including science and history. They will point it out the same way they point out the the individual was aftrican american, hispanic etc.. For example: \"Alexander the Great, a homosexual male, .........\n\n What does homosexual have to do with Alexander the Great and what he did? This goes with all of the figures. Martin Luther King can be called a \"african american\" (although that term is stupid as well) while talking about equal rights for blacks and whites because it is related! It would be like referring to Martin Luther King's hair color when talking about civil rights....\"Martin Luther King, who had black hair with a hint of gray, was a key player in the Civil Rights movement\". Well thanks for that emoticon_rolleyes", 
   {}, 
   211391, 
   null, 
   1147025400.0
  ], 
  [
   211664, 
   null, 
   "robbie0517", 
   "Well, thats just stupid. What does homosexual have to do with Alexander the Great and what he did? This goes with all of the figures. Martin Luther King can be called a \"african american\" (although that term is stupid as well) while talking about equal rights for blacks and whites because it is related! It would be like referring to Martin Luther King's hair color when talking about civil rights....\"Martin Luther King, who had black hair with a hint of gray, was a key player in the Civil Rights movement\". Well thanks for that emoticon_rolleyes\n\n \n It's hardly stupid. It is about having role models. It is about gay students feeling positive about themselves by knowing that important persons in history were also like them. It is also about non-gays seeing thats homosexuals actually have contributed in history, it's helps to dispell stereotypes and makes them more accepting of homosexuality which in turn leads to less ridiculing and bashing of gays. You can't see this?", 
   {}, 
   211660, 
   null, 
   1147026900.0
  ], 
  [
   211665, 
   null, 
   "thelmoose", 
   "Well, thats just stupid. What does homosexual have to do with Alexander the Great and what he did? This goes with all of the figures. Martin Luther King can be called a \"african american\" (although that term is stupid as well) while talking about equal rights for blacks and whites because it is related! It would be like referring to Martin Luther King's hair color when talking about civil rights....\"Martin Luther King, who had black hair with a hint of gray, was a key player in the Civil Rights movement\". Well thanks for that emoticon_rolleyes\n\n \n Mentioning that an historical figure was gay (when it is relevant to history) has two effects - it helps us better understand who who the person was and was their personal experiece was like, thus making the history more understandable. Also, it is the truth and hiding it harms gay citizens - much like the contributions of blacks, native Americans, women and many more need to be discussed to understand our history and to recognize that we existed in history.\n \n Other comments on your quotes:\n \n 1. \"Well, thats just stupid\" - nice, respectful discussion\n 2. \"What does homosexual have to do with Alexander the Great and what he did?\" That is a good question and an interesting thing to learn about.\n 3. \"...called a \"african american\" (although that term is stupid as well)\". That is what certain American citizens, choose to call themselves. What right do you have to call the term stupid?\n 4. \"...while talking about equal rights for blacks and whites\". What equal rights do white people in the US need to strive for?\n \n Gay people exist. It is empowering to us and enlightening to everyone else to acknowledge our past existence and contributions to history. \n \n Did you know that it is possible that Tchaikovsky wrote the haunting and heartbreaking strains of his 6th Symphony as a result of severe depression over his being gay, and the possibility of his being outed in the Russian court? He committed suicide weeks after he completed it. Do you think that his being gay is relevant to that?", 
   {}, 
   211660, 
   null, 
   1147028340.0
  ], 
  [
   211716, 
   null, 
   "MTKnight", 
   "Oh...this is just not even related to gay marriage...I've seen both sides of these arguments and I've grown sick of em. If you want to bring someone's sexual preference into everything in schools than maybe we should also bring religion? So in other words you'd want people to have a questions that states...\n \n Alexander the Great was also known to sleep with _________.\n A. Women\n B. Men\n C. Martians\n D. Indian Jones\n \n This is hardly as important as Alexander taking over the entirety of the Greek City States. If this class wished to discuss the gay pride movement than sure why not.\n \n Now when it comes to literature than maybe. Because there has been authors who have gone both ways. I remember a girl presented a report about a female author who deeply loved her husband but at the same time had affairs with both men and women. If her having these affairs had something to do with her books yes than. If it didn't why go into it? To answer this question sure it would go into the gay movement and produce more coverage about homosexuals. However, this is foolish entirely as it is an agenda. Its comparable to offering creationism in schools. You wish to promote a sexual preference and creationism wishes to promote religion. Than you'd have to ask what about trans gender people? How about drag queens? Did you know there were rumors that Patton might have dressed up like a woman? What did that have to do with him in World War II and the Korean War? Should we also mention this? As far as this goes its just another way for people to collect more votes to themselves. :xbanghead (Hmm...was it Mcarthur or Patton who dressed up like a woman? Oh well I have a 50/50 chance to get these 3 points on the test now!)\n \n If you want this in public schools than you will just open the door for everyone else who wants their own versions of their lives in school. emoticon_xgood", 
   {}, 
   211665, 
   null, 
   1147074120.0
  ], 
  [
   211736, 
   null, 
   "robbie0517", 
   "If you want this in public schools than you will just open the door for everyone else who wants their own versions of their lives in school. emoticon_xgood\n\n \n Separation of church and state would not allow you to bring religion into school. As far as other groups wanting to also be represented in school there are already laws that force schools to discuss the contributions of most other underpresented groups. The innateness of homosexuality makes the accomplishments of homosexuals the same as discussing accomplishments of blacks, woman, asian, native american etc.. \n It would be incorporated into studies where appropriate and in an appropriate manner. Your examples were inappropriate. This would be like a qeustion that asks: \n \n Martin Luther King was: \n \n A. black \n b. white\n c. asian\n \n There is much more depth to history than what your presenting here.", 
   {}, 
   211716, 
   null, 
   1147101180.0
  ], 
  [
   211748, 
   null, 
   "jyoshu", 
   "Give me a citation from a reputable historian saying that, showing his arguments, than maybe your arguments will be a little more believable.\n\n \n Nice addition of the word \"credible\" to give yourself an out no matter what source is brough up--\"he's not credible\". Sorry Kronos, I've seen you play those little games to many times now. You know good and well that people like James A. Garfield are thought by SOME historians to be gay, based mainly on rumors at the time. If you don't, then you haven't read much.\n \n \nWhat does homosexual have to do with Alexander the Great and what he did? This goes with all of the figures. Martin Luther King can be called a \"african american\" (although that term is stupid as well) while talking about equal rights for blacks and whites because it is related! It would be like referring to Martin Luther King's hair color when talking about civil rights....\"Martin Luther King, who had black hair with a hint of gray, was a key player in the Civil Rights movement\". Well thanks for that emoticon_rolleyes\n\n \n I think you've hit the nail on the head here, and it's really the whole point. The issue is really whether the sexual orientation of historical figures is really pertinent or not--in some cases it MAY be, IF it has to bear on their accomplishments. But just pointing out sexual orientation for the heck of it is silly, if you ask me--should we also go pointing out that most historical figures were straight? Or that so-and-so were left-handed?\n \n \n(1) it helps us better understand who who the person was and was their personal experiece was like, thus making the history more understandable. (2) Also, it is the truth and hiding it harms gay citizens - much like the contributions of blacks, native Americans, women and many more need to be discussed to understand our history and to recognize that we existed in history.\n\n \n Regarding (1), would you want things like handedness and hair color an issue as well? Would you equally want their sexual orientation made an issue if they were straight? There are countless things about historical people that we could speculate down to every little detail of their lives, but to what end? Why should we not focus on the accomplishments these people made, and IF their sexual orientation bears on those accomplishments, then so be it? \n \n I also find it fascinating that you are basically arguing for the opposite of equality here, when in fact your movement always claims to be fighting for equality. If you wanted equality, you'd want gay sexual orientation to be not be made any more of an issue than when people are straight. Textbooks and teachers don't (that I've ever heard of) make an issue of so-and-so was straight, so why should they make an issue of them being gay? If you want equality you'll want either BOTH to be made an issue, or neither. But not JUST their sexual orientation if they're gay.\n \n Regarding (2), what evidence do you have that it's being \"hidden\" from citizens in our educational system? Do you really think kids don't know about sexual orientation these days or that there is a possibility that any given historical figure could have been gay? \n \n And do we really want to use history class as a means to an end (to increase social awareness) anyway? Whatever happened to teaching history for the sake of teaching history??? I would have a lot more respect for this argument of yours if it were simply based on teaching about homosexuality in history because its there and a part of history, rather than some ulterior motive. If we KNOW someone was gay, I have no problem with it being taught about.", 
   {}, 
   211660, 
   null, 
   1147104660.0
  ], 
  [
   211770, 
   null, 
   "Steeeeve", 
   "Mentioning that an historical figure was gay (when it is relevant to history) has two effects - it helps us better understand who who the person was and was their personal experiece was like, thus making the history more understandable. Also, it is the truth and hiding it harms gay citizens - much like the contributions of blacks, native Americans, women and many more need to be discussed to understand our history and to recognize that we existed in history.\n \n Why don't we mention the hair color then? It was obviously them being gay that led to their achievements emoticon_rolleyes\n \n \n\n Other comments on your quotes:\n \n 1. \"Well, thats just stupid\" - nice, respectful discussion\n \n It is stupid though. Would you prefer half-witted or nonsensical?\n \n \n\n 2. \"What does homosexual have to do with Alexander the Great and what he did?\" That is a good question and an interesting thing to learn about.\n \n Yeah, him being gay (assuming he was...which he probably wasn't) would have nothing to do with his conquests. Surely you aren't trying to tell me that if her were straight than none of this would have been possible?\n \n \n\n 3. \"...called a \"african american\" (although that term is stupid as well)\". That is what certain American citizens, choose to call themselves. What right do you have to call the term stupid?\n \n The term is rather narrow-minded. The only \"african americans\" in the United States are folks that were born in Africa and moved over....people like Dave Matthews (white skin) for example. They can be called african americans. A black person from Jamica...not so much. \n \n [quote]\n \n \n\n 4. \"...while talking about equal rights for blacks and whites\". What equal rights do white people in the US need to strive for? \n try not taking my quotes out of context and maybe it will make more sense to you.\n \n \n\n Gay people exist. It is empowering to us and enlightening to everyone else to acknowledge our past existence and contributions to history. \n \n Did you know that it is possible that Tchaikovsky wrote the haunting and heartbreaking strains of his 6th Symphony as a result of severe depression over his being gay, and the possibility of his being outed in the Russian court? He committed suicide weeks after he completed it. Do you think that his being gay is relevant to that?\n Big deal? Tchailkovsky is not in that many history books in High School. He shouldn't be put in there just because he was gay either. \n \n It is empowering? What makes you so special that you need to be \"empowered\"...maybe we should say all the good things straight people have done like Abraham Lincoln...oh wait, you think he is gay now too. \n \n It makes me sick that you want to just include \"being gay\" in history just because you want to feel \"empowered\". Get over yourself.", 
   {}, 
   211665, 
   null, 
   1147110060.0
  ], 
  [
   211773, 
   null, 
   "Steeeeve", 
   "It's hardly stupid. It is about having role models. It is about gay students feeling positive about themselves by knowing that important persons in history were also like them. It is also about non-gays seeing thats homosexuals actually have contributed in history, it's helps to dispell stereotypes and makes them more accepting of homosexuality which in turn leads to less ridiculing and bashing of gays. You can't see this?\n\n \n Role models? We should write about the achievments of Jerry Falwell and how him being a straight white christian has led to his success....he will act as a role model to all the young boys and girls who seek history and diversity of opinion emoticon_rolleyes. \n \n I don't doubt that there have been gay people that contributed to history, I do doubt that being gay makes you above everyone else in history and that your accomplishments were the sole reason of being gay. Just like hair color is of little matter, so is being gay.", 
   {}, 
   211664, 
   null, 
   1147110360.0
  ], 
  [
   211775, 
   null, 
   "jyoshu", 
   " Yeah, him being gay (assuming he was...which he probably wasn't) would have nothing to do with his conquests. Surely you aren't trying to tell me that if her were straight than none of this would have been possible?\n\n \n But don't you know, Steeeeve, \"it can be said that their careers were significantly informed or impacted, whether positively or negatively, by their orientation\"? Yeah right. emoticon_rolleyes \n \n I guess Alexander the Great was out to make the whole world gay, or something. Whatever.", 
   {}, 
   211770, 
   null, 
   1147110360.0
  ], 
  [
   211776, 
   null, 
   "Kronus", 
   "Nice addition of the word \"credible\" to give yourself an out no matter what source is brough up--\"he's not credible\". Sorry Kronos, I've seen you play those little games to many times now. \n \n\n \n Ah well. You managed to debate at a reasonable level for a few posts anyway. And you're simply bailing, as opposed to resorting to more disengenuous tactics. I guess that's progress of a sort.", 
   {}, 
   211748, 
   null, 
   1147110540.0
  ], 
  [
   211780, 
   null, 
   "Steeeeve", 
   "But don't you know, Steeeeve, \"it can be said that their careers were significantly informed or impacted, whether positively or negatively, by their orientation\"? Yeah right. emoticon_rolleyes \n \n I guess Alexander the Great was out to make the whole world gay, or something. Whatever.\n\n \n Not only that, what a bad example to use. \"Alexander the Great slaughtered lots of people because he was gay\"...a real winner.", 
   {}, 
   211775, 
   null, 
   1147111080.0
  ], 
  [
   211782, 
   null, 
   "jyoshu", 
   "Not only that, what a bad example to use. \"Alexander the Great slaughtered lots of people because he was gay\"...a real winner.\n\n \n Good point. I wonder if they'll be so eager to say that sexual orientation informed their career in the cases of bad people in history, e.g. Jeffrey Dahmer. Hey, if we're going to make sexual orientation an issue in history . . .", 
   {}, 
   211780, 
   null, 
   1147111260.0
  ], 
  [
   211785, 
   null, 
   "foundit66", 
   "Good point. I wonder if they'll be so eager to say that sexual orientation informed their career in the cases of bad people in history, e.g. Jeffrey Dahmer. Hey, if we're going to make sexual orientation an issue in history . . .\n\n MAN you guys miss the forest for the trees so much it isn't even funny...\n \n Part of the point of such legislation is that typically when a person is \"bad\" and gay, the homosexuality IS EXPLICITLY NOTED. Everybody knows about the sexual proclivities of Dahmer...\n \n But the British inventor of computing? Do people know his sexual orientation?\n \n Hitler for another example. There are plenty of unfounded rumors that he was gay...\n But how many people know that he derived his mandate for his corrupt actions from 'Christianity'?", 
   {}, 
   211782, 
   null, 
   1147111560.0
  ], 
  [
   211786, 
   null, 
   "thelmoose", 
   "Why don't we mention the hair color then? It was obviously them being gay that led to their achievements emoticon_rolleyes \n\n \n While it may not have \"led to their achievements,\" being gay is much more relevant to one's actions and life than hair color. Not an apt comparison.\n \n \nIt is stupid though. Would you prefer half-witted or nonsensical?\n I would prefer intelligence and respect.\n \n \nYeah, him being gay (assuming he was...which he probably wasn't) would have nothing to do with his conquests. Surely you aren't trying to tell me that if her were straight than none of this would have been possible?\n \n \n I am telling you that his being gay may have played an important part in making him who he was. Or may not. I am just saying that excluding gayness from all discussion makes no sense, if it is historically relevant. You seem to think that one's being gay could never be possibly historically relevant. I say let the historians decide. \n \n \n \nThe term is rather narrow-minded. The only \"african americans\" in the United States are folks that were born in Africa and moved over....people like Dave Matthews (white skin) for example. They can be called african americans. A black person from Jamica...not so much. \n\n \n I prefer to respect others enough to concede to call them what they call themselves. I would not be so arrogant to presume to decide what I think is the appropriate term for some one else. I don't know who Dave Matthews is. The point of the term, has nothing to do with skin color per se, but the history that African slaves have had in the US. A black person from Jamaica, by the way, would be a Jamaican. As Jamaica is neither in the US or Africa, I fail to see what you are talking about.\n \n \n \n \n It is empowering? What makes you so special that you need to be \"empowered\"...maybe we should say all the good things straight people have done like Abraham Lincoln...oh wait, you think he is gay now too. \n\n \n We all need to feel empowered. Even you. I think that straight people have not been ignored in history. For you to comment on that suggests you are missing the entire point of this thread: some people in history were gay, and if it adds to the historical view, it should be OK to mention it. The reason the legislature even raised the issue is that some people have a conniption if you mention the word gay in public schools. Imagine!\n \n \n It makes me sick that you want to just include \"being gay\" in history just because you want to feel \"empowered\". Get over yourself.\n\n \n You seem to have an issue. This has nothing to do with me. Your behavior is less than conducive to productive discourse, and I find your words offensive.", 
   {}, 
   211770, 
   null, 
   1147111680.0
  ], 
  [
   211789, 
   null, 
   "jyoshu", 
   "But the British inventor of computing? Do people know his sexual orientation?\n\n \n Like I said, if we know for sure he was gay, go for it. I have no problem with it as long as we stick to history for history's sake and not speculation.", 
   {}, 
   211785, 
   null, 
   1147111740.0
  ], 
  [
   211791, 
   null, 
   "foundit66", 
   "Like I said, if we know for sure he was gay, go for it. I have no problem with it as long as we stick to history for history's sake and not speculation.\n\n 1) The fact that you have no clue as to who I am talking about demonstrates quite succinctly my main point, which you refused to address or quote...\n \n 2) It's interesting to note how you repeat the same patterns, over and over again without fail.\n It's obvious you have no clue who this guy I referenced is and his history, yet you feel that you need to point out \"not speculation\"...\n Yet no similar comment is seen when I pointed out other people speculating that Hitler was gay...", 
   {}, 
   211789, 
   null, 
   1147112160.0
  ], 
  [
   211793, 
   null, 
   "Steeeeve", 
   "While it may not have \"led to their achievements,\" being gay is much more relevant to one's actions and life than hair color. Not an apt comparison.\n \n This seems rather narrow-minded but even-so, should we put that the person was straight if they were not gay? White if they were not black? \n \n I would prefer intelligence and respect. [\\quote] This idea is neither, so stupid will have to do.\n \n\n I am telling you that his being gay may have played an important part in making him who he was. Or may not. I am just saying that excluding gayness from all discussion makes no sense, if it is historically relevant. You seem to think that one's being gay could never be possibly historically relevant. I say let the historians decide. \n \n I think I made it clear when it is relevant. It is not relevant to Alexander the Great and what he did. It is only relevant when the accomplishment has to do with the attribute you wish to claim to that person. So if Alexander the Great was going around teaching people about why the shouldn't kill gay people then maybe it would be relevant then. \n \n\n I prefer to respect others enough to concede to call them what they call themselves. I would not be so arrogant to presume to decide what I think is the appropriate term for some one else. I don't know who Dave Matthews is. The point of the term, has nothing to do with skin color per se, but the history that African slaves have had in the US. A black person from Jamaica, by the way, would be a Jamaican. As Jamaica is neither in the US or Africa, I fail to see what you are talking about.\n It would seem that I am talking about calling all black people \"african american\". I was just making a side point that not all blacks are african...in fact many aren't. Dave Matthews is one of the most successful singers in a band \"Dave Mattews Band\" where Dave was born in Africa. Oddly enough, 2 other members are black yet were not born in Africa, so how are they african american? Can I call myself an African American? Sure woulda saved me trouble getting into college.\n \n\n We all need to feel empowered. Even you. I think that straight people have not been ignored in history. For you to comment on that suggests you are missing the entire point of this thread: some people in history were gay, and if it adds to the historical view, it should be OK to mention it. The reason the legislature even raised the issue is that some people have a conniption if you mention the word gay in public schools. Imagine!\n \nI'm feeling fine, thank you. Straight people are not ignored!?!?! I have never see a text book mention someone was straight (although might be implied by them getting married). Seems like straights are the ones that are getting oppressed emoticon_rolleyes I don't know of anyone that is straight and their accomplishments were because they were \"straight\"(straight is another term I don't like...which begs the question why am I using it...anyway).\n \n\n You seem to have an issue. This has nothing to do with me. Your behavior is less than conducive to productive discourse, and I find your words offensive.\n Not much I can do about you taking offensive to my words. I already stated that I am rather offended by the idea that being gay should be mentioned because it obviously contributed to the persons success or failure yet being straight has nothing to do with anything.", 
   {}, 
   211786, 
   null, 
   1147112460.0
  ], 
  [
   211794, 
   null, 
   "thelmoose", 
   "Foundit, \n Who are you talking about, Turing? Tell me more.", 
   {}, 
   211791, 
   null, 
   1147112520.0
  ], 
  [
   211795, 
   null, 
   "Steeeeve", 
   "MAN you guys miss the forest for the trees so much it isn't even funny...\n \n Part of the point of such legislation is that typically when a person is \"bad\" and gay, the homosexuality IS EXPLICITLY NOTED. Everybody knows about the sexual proclivities of Dahmer...\n \n But the British inventor of computing? Do people know his sexual orientation?\n \n Hitler for another example. There are plenty of unfounded rumors that he was gay...\n But how many people know that he derived his mandate for his corrupt actions from 'Christianity'?\n\n \n I didn't know Dahmer was gay...in fact, I don't even care what is sexual oreintation was...the only thing I care about is the fact that he killed. Sexual oreintation has nothing to do with anything in this case", 
   {}, 
   211785, 
   null, 
   1147112640.0
  ], 
  [
   211796, 
   null, 
   "MrWriteLA", 
   "http://en.wikipedia.org/wiki/Alan_turing \nAlan Mathison Turing (June 23, 1912 - June 7, 1954) was a British mathematician, logician, and cryptographer. Turing is often considered to be the father of modern computer science.\n \n With the Turing Test, Turing made a significant and characteristically provocative contribution to the debate regarding artificial intelligence: whether it will ever be possible to say that a machine is conscious and can think. He provided an influential formalisation of the concept of algorithm and computation with the Turing machine, formulating the now widely accepted \"Turing\" version of the Church-Turing thesis, namely that any practical computing model has either the equivalent or a subset of the capabilities of a Turing machine. During World War II, Turing worked at Bletchley Park, Britain's codebreaking centre and was for a time head of Hut 8, the section responsible for German Naval cryptanalysis. He devised a number of techniques for breaking German ciphers, including the method of the bombe, an electromechanical machine which could find settings for the Enigma machine.\n \n After the war, he worked at the National Physical Laboratory, creating one of the first designs for a stored-program computer, although it was never actually built. In 1947 he moved to the University of Manchester to work, largely on software, on the Manchester Mark I then emerging as one of the world's earliest true computers.\n \n In 1952, Turing was convicted of acts of gross indecency after admitting to a sexual relationship with a man in Manchester. He was placed on probation and required to undergo hormone therapy. When Alan Turing died in 1954, an inquest found that he had committed suicide by eating an apple laced with cyanide.\n", 
   {
    "unicode_changes_made": true
   }, 
   211791, 
   null, 
   1147112700.0
  ], 
  [
   211797, 
   null, 
   "thelmoose", 
   "This seems rather narrow-minded but even-so, should we put that the person was straight if they were not gay? White if they were not black? \n \n I would prefer intelligence and respect. [\\quote] This idea is neither, so stupid will have to do.\n I think I made it clear when it is relevant. It is not relevant to Alexander the Great and what he did. It is only relevant when the accomplishment has to do with the attribute you wish to claim to that person. So if Alexander the Great was going around teaching people about why the shouldn't kill gay people then maybe it would be relevant then. \n It would seem that I am talking about calling all black people \"african american\". I was just making a side point that not all blacks are african...in fact many aren't. Dave Matthews is one of the most successful singers in a band \"Dave Mattews Band\" where Dave was born in Africa. Oddly enough, 2 other members are black yet were not born in Africa, so how are they african american? Can I call myself an African American? Sure woulda saved me trouble getting into college.\n I'm feeling fine, thank you. Straight people are not ignored!?!?! I have never see a text book mention someone was straight (although might be implied by them getting married). Seems like straights are the ones that are getting oppressed emoticon_rolleyes I don't know of anyone that is straight and their accomplishments were because they were \"straight\"(straight is another term I don't like...which begs the question why am I using it...anyway).\n Not much I can do about you taking offensive to my words. I already stated that I am rather offended by the idea that being gay should be mentioned because it obviously contributed to the persons success or failure yet being straight has nothing to do with anything.\n\n \n \n Heterosexuality is assumed.\n If you think that straight people are being oppressed, I guess we are talking completely different realities and I will respectfully bow out from an obviously futile discussion.", 
   {}, 
   211793, 
   null, 
   1147112760.0
  ], 
  [
   211799, 
   null, 
   "Steeeeve", 
   "Heterosexuality is assumed.\n If you think that straight people are being oppressed, I guess we are talking completely different realities and I will respectfully bow out from an obviously futile discussion.\n\n \n We should assume homosexuality and put heterosexual if the person were not.\n \n And no, I don't think straight people are being oppressed for being straight. I am sure their are straight people that are being oppressed just like everyone is oppressed on some level.", 
   {}, 
   211797, 
   null, 
   1147113360.0
  ], 
  [
   211800, 
   null, 
   "Steeeeve", 
   "http://en.wikipedia.org/wiki/Alan_turing\n\n \n This was talking about the Turing guy who slept with men. \n \n I am sure glad he did!! If he had not, we would still be living in the stone ages. emoticon_confused", 
   {}, 
   211796, 
   null, 
   1147113480.0
  ], 
  [
   211802, 
   null, 
   "foundit66", 
   "Foundit, \n Who are you talking about, Turing? Tell me more.\n\n 0) Sorry. Just now found your post.\n 1) Yes. Turing.\n 2) MrWriteLA gave a good link to his story, with the part bold-faced which was the main part that I was alluding to. (page 4 of this thread)\n The man did an incredible service to his country. His country's treatment of him was criminal.", 
   {}, 
   211794, 
   null, 
   1147114140.0
  ], 
  [
   211803, 
   null, 
   "foundit66", 
   "I didn't know Dahmer was gay...in fact, I don't even care what is sexual oreintation was...the only thing I care about is the fact that he killed.\n\n Seriously???\n I don't know how anybody could have heard his story and not know...\n \n \n \nSexual oreintation has nothing to do with anything in this case\n\n 1) If you're talking about Dahmer, I would agree to a point.\n 2) If you're talking about Turing, you're going to have to elaborate. If you're not talking about Turing, disregard...\n (I'm pretty sure you're not talking about Turing...)", 
   {}, 
   211795, 
   null, 
   1147114260.0
  ], 
  [
   211806, 
   null, 
   "Steeeeve", 
   "Seriously???\n I don't know how anybody could have heard his story and not know...\n \n As I said, irrelevant to me\n \n \n\n 1) If you're talking about Dahmer, I would agree to a point.\n 2) If you're talking about Turing, you're going to have to elaborate. If you're not talking about Turing, disregard...\n (I'm pretty sure you're not talking about Turing...)\n Even with Turing...if you are doing a documentary on the guy...yeah sure, go into his life, but in a textbook he should be talked about for atmost 2 sentences. \"Turing helped developed the computer we know of today\"...or something like that. There is no reason to add \"and he was gay\" to the end of it.", 
   {}, 
   211803, 
   null, 
   1147115700.0
  ], 
  [
   211809, 
   null, 
   "foundit66", 
   "As I said, irrelevant to me\n\n Back up a minute.\n Are you saying you DID hear that Dahmer was gay, but that you found it irrelevant?\n Or are you saying that you did NOT hear that Dahmer was gay until it was mentioned in this thread?\n \n Which one is it?\n \n \n \nEven with Turing...if you are doing a documentary on the guy...yeah sure, go into his life, but in a textbook he should be talked about for atmost 2 sentences. \"Turing helped developed the computer we know of today\"...or something like that. There is no reason to add \"and he was gay\" to the end of it.\n\n \"helped develop\"?\n \"Turing is often considered to be the father of modern computer science.\"\n http://en.wikipedia.org/wiki/Alan_turing\n \n I mean, Al Gore had to live down the \"invented the internet\" b.s., but the people who FATHERED the technology which made it possible, are barely even known...\n \n And the fact that he made such a HUGE contribution, yet his government treated him so shabbily, should also be mentioned.\n \n Your commentary on the situation is like saying \"Martin Luther King Jr did some stuff for civil rights\", and then completely failing to mention that he was assassinated...", 
   {}, 
   211806, 
   null, 
   1147117080.0
  ], 
  [
   211810, 
   null, 
   "jyoshu", 
   "I didn't know Dahmer was gay...in fact, I don't even care what is sexual oreintation was...the only thing I care about is the fact that he killed. Sexual oreintation has nothing to do with anything in this case\n\n \n I don't care either, and agree that's sorta the whole point. It shouldn't have anymore to do with anything in most cases than the fact many historical people were straight. If there ARE cases where their accomplishments were because they were gay, then fine.", 
   {}, 
   211795, 
   null, 
   1147117920.0
  ], 
  [
   211812, 
   null, 
   "foundit66", 
   "I don't care either, and agree that's sorta the whole point. It shouldn't have anymore to do with anything in most cases than the fact many historical people were straight. If there ARE cases where their accomplishments were because they were gay, then fine.\n\n Do you think that Martin Luther King Jr's accomplishments occurred because of his black genes?", 
   {}, 
   211810, 
   null, 
   1147118160.0
  ], 
  [
   211819, 
   null, 
   "MTKnight", 
   "Separation of church and state would not allow you to bring religion into school. As far as other groups wanting to also be represented in school there are already laws that force schools to discuss the contributions of most other underpresented groups. The innateness of homosexuality makes the accomplishments of homosexuals the same as discussing accomplishments of blacks, woman, asian, native american etc.. \n It would be incorporated into studies where appropriate and in an appropriate manner. Your examples were inappropriate. This would be like a qeustion that asks: \n \n Martin Luther King was: \n \n A. black \n b. white\n c. asian\n \n There is much more depth to history than what your presenting here.\n\n \n I believe I did present depth in history with speaking about Patton and Mcarthur. How about Elizabeth? Some people believe she could have been a man? However, speaking about homosexuals and what they accomplished would be perfectly alright IF it is important to the material. If a teacher wants to bring up an interesting thought about it in lectures than sure that too. Also the question was to poke fun at this. Marting Luther King is also an example in how his campaign was for civil rights so the Gay Pride Movement should be discussed about in history. However, going all the way back to the Revolutionary War and saying Joe Somebody didn't have a wife and might have been homosexual and also was a great soldier in the war is just adding too much more information without hard evidence. I'm not going to bother going into religion and the separation of state. As I said before should we also discuss drag queens? Trans gender people? This is too much and as far as I see it public schools are just becoming worse anyway. emoticon_cry \n \n But baiscally it should be incorporated in matter where appropriate just as you said and with proof not assumptions. emoticon_xangel", 
   {}, 
   211736, 
   null, 
   1147120200.0
  ], 
  [
   211821, 
   null, 
   "thelmoose", 
   "\"helped develop\"?\n \"Turing is often considered to be the father of modern computer science.\"\n http://en.wikipedia.org/wiki/Alan_turing\n And the fact that he made such a HUGE contribution, yet his government treated him so shabbily, should also be mentioned.\n \n \n\n \n His imprisonment and death seem like an extremely important thing to mention. If Edison, for example, were prosecuted and sentenced in the some similar (but \"non-gay\") way, resulting in his suicide, I think it would get at least a blurb in the history books.", 
   {}, 
   211809, 
   null, 
   1147121220.0
  ], 
  [
   211823, 
   null, 
   "thelmoose", 
   " However, speaking about homosexuals and what they accomplished would be perfectly alright IF it is important to the material. \n\n \n Of course. Why would you assume it would get mentioned if it was not relevant to the historical background? Trivial details are, well, trivial. Some details, however, are very important and make history fascinating. Unless, you are of the mind that the mention of one's homosexuality would never be interesting to anyone or that it is too horrible to mention to school children.", 
   {}, 
   211819, 
   null, 
   1147121460.0
  ], 
  [
   211829, 
   null, 
   "BobNelson2", 
   "Jyoshu and steeeeeve... you guys are so transparent it's laughable.", 
   {}, 
   211782, 
   null, 
   1147123560.0
  ], 
  [
   211830, 
   null, 
   "BobNelson2", 
   "But don't you know, Steeeeve, \"it can be said that their careers were significantly informed or impacted, whether positively or negatively, by their orientation\"? Yeah right. emoticon_rolleyes \n\n \n Do you hold exhibit as much disdain when people talk about, say, Romeo and Juliet? Or perhaps John and Abigail Adams? \n \n \nI guess Alexander the Great was out to make the whole world gay, or something. Whatever.\n\n \n In his time, there was no need to make the world \"gay\". It was already bisexual.", 
   {}, 
   211775, 
   null, 
   1147123800.0
  ], 
  [
   211831, 
   null, 
   "foundit66", 
   "Of course. Why would you assume it would get mentioned if it was not relevant to the historical background? Trivial details are, well, trivial. Some details, however, are very important and make history fascinating. Unless, you are of the mind that the mention of one's homosexuality would never be interesting to anyone or that it is too horrible to mention to school children.\n\n \n As far as \"relevance\", I think there is a big portion of \"relevance\" to the historical aspect that some (cough, cough, Jyoshu, cough, cough) would gladly overlook.\n \n Take Vivien Thomas for example. He was a pioneer of the heart surgery branch of medicine in the 1930's / 1940's. He helped create the techniques to eliminate \"blue baby syndrome\", and he combatted other heart conditions utilizing arterial surgery. Extremely cutting edge for his time...\n \n Is it relevant that he was black?\n \n Maybe it's relevant to realize that he first got employed as a JANITOR (at 2/3 the previous janitor's salary) when he started assisting Dr. Alfred Blalock in a variety of ways, earning credibility and respect with Dr. Blalock who saw partially beyond his race and realized his medicinal/surgery potential. Only through Blalock, were Dr. Thomas's ideas ever allowed to see the light of day in medical community practice.\n Dr. Thomas experienced a variety of medical community set-backs due to prejudice and stereo-types based on his race. In fact, he achieved all these accomplishments WITHOUT A MEDICAL DEGREE.\n \"In 1976, Johns Hopkins University presented Thomas with an honorary doctorate.\"\n http://en.wikipedia.org/wiki/Vivien_Thomas\n \n Relevance?\n Maybe we should stop and think about where we would be today if Turing had been busted for being gay BEFORE he had made his contribution to the war effort with his computing techniques...\n Maybe we should stop and think that some of these gay men/women achieved their accomplishments IN ADDITION TO overcoming adversity over their sexual orientation...\n \n Is that relevant?\n Maybe not to some (cough, cough, Jyoshu, cough, cough), but it should be enough to make some of us think...", 
   {}, 
   211823, 
   null, 
   1147126500.0
  ], 
  [
   211832, 
   null, 
   "foundit66", 
   "We should assume homosexuality and put heterosexual if the person were not.\n\n Why?\n \n Or was that just your attempt at witty retort that failed miserably?\n \n \n \nAnd no, I don't think straight people are being oppressed for being straight. I am sure their are straight people that are being oppressed just like everyone is oppressed on some level.\n\n That would have been a great come-back to Martin Luther King. I bet he would have just shut up, sat down, and never said anything again if somebody had said that to him...\n \n \"Hey Mr. King. White people are being oppressed just like everyone is oppressed on some level.\"\n <end sarcasm<\n \n I swear. It's like you guys don't even stop to think about how inane, irrelevant, and pointless some of the things you post are going to sound...", 
   {}, 
   211799, 
   null, 
   1147127040.0
  ], 
  [
   211834, 
   null, 
   "BobNelson2", 
   "Like I said, if we know for sure he was gay, go for it. I have no problem with it as long as we stick to history for history's sake and not speculation.\n\n \n Speculation and interpretation are very important parts of history.", 
   {}, 
   211789, 
   null, 
   1147129500.0
  ], 
  [
   211836, 
   null, 
   "BobNelson2", 
   "This was talking about the Turing guy who slept with men. \n \n I am sure glad he did!! If he had not, we would still be living in the stone ages. emoticon_confused\n\n \n Yet another of your posts that wouldn't pass the Turing Test...", 
   {}, 
   211800, 
   null, 
   1147129680.0
  ], 
  [
   211837, 
   null, 
   "jyoshu", 
   "Do you think that Martin Luther King Jr's accomplishments occurred because of his black genes?\n\n \n No I don't. And ironically, that's much the point here. An irony and point that you've missed here . . . . spectacularly missed.", 
   {}, 
   211812, 
   null, 
   1147130460.0
  ], 
  [
   211838, 
   null, 
   "BobNelson2", 
   "I didn't know Dahmer was gay...in fact, I don't even care what is sexual oreintation was...the only thing I care about is the fact that he killed. Sexual oreintation has nothing to do with anything in this case\n\n \n You seem to know so little about so much. \n \n Sexual orientation has a lot to do with the case. ALL of Dahmer's victims were men. Some were known to be gay. Most of them were young men. They disappeared. Society's attitudes about gays enabled him to prey on these guys.", 
   {}, 
   211795, 
   null, 
   1147130580.0
  ], 
  [
   211839, 
   null, 
   "BobNelson2", 
   "As I said, irrelevant to me\n \n Even with Turing...if you are doing a documentary on the guy...yeah sure, go into his life, but in a textbook he should be talked about for atmost 2 sentences. \"Turing helped developed the computer we know of today\"...or something like that. There is no reason to add \"and he was gay\" to the end of it.\n\n \n \"His brilliant work and, indeed, his life were cut short by homophobia.\" Would that work for you?", 
   {}, 
   211806, 
   null, 
   1147130640.0
  ], 
  [
   211840, 
   null, 
   "jyoshu", 
   "In his time, there was no need to make the world \"gay\". It was already bisexual.\n\n \n Uh huh. Sure, everybody's sexual orientation in the whole world was bi-sexual. emoticon_rolleyes Riiiiight. Oh, I get it; you were now talking about the CULTURE.\n \n Do you really think it's not obvious when you purposely and disingenuously change your argument to that of the state of the culture instead of sexual orientation? Seriously? Do you?", 
   {}, 
   211830, 
   null, 
   1147130640.0
  ], 
  [
   211841, 
   null, 
   "BobNelson2", 
   "Uh huh. Sure, everybody in the whole world's sexual orientation was bi-sexual. emoticon_rolleyes \n\n \n Default heterosexuality is OK with you. Default bisexuality bugs the heck out of you. Why is that?\n \n Besides, I don't think the construction \"the world was...\" requires EVERYONE to meet the criteria. I'm sure there were a few Kinsey-zeroes around.\n \n \nDo you really think it's not obvious when you purposely and disingenuously change your argument to that of the state of the culture instead of sexual orientation? Seriously? Do you?\n\n \n What are you talking about? Who said this conversation was ONLY about the sexual orientation of individuals? That's not at the origin of the thread and I certainly didn't endorse the idea.", 
   {}, 
   211840, 
   null, 
   1147131060.0
  ], 
  [
   211847, 
   null, 
   "foundit66", 
   "Do you think that Martin Luther King Jr's accomplishments occurred because of his black genes?\n\n \nNo I don't. And ironically, that's much the point here. An irony and point that you've missed here . . . . spectacularly missed.\n\n Would you mind elaborating on the point I have supposedly missed?\n \n Because I think there was instead a level of sarcasm in my question, along with a point to my question, which YOU have missed...\n \n Riddle me this...\n If Martin Luther King Jr's accomplishments did not occur because of his black genes, should we strike down any mention of his race from the history books?", 
   {}, 
   211837, 
   null, 
   1147134720.0
  ], 
  [
   211851, 
   null, 
   "Steeeeve", 
   "Why?\n \n Or was that just your attempt at witty retort that failed miserably?\n \n why your way is the question. I can live without the smart -a** remarks too.\n \n \n\n That would have been a great come-back to Martin Luther King. I bet he would have just shut up, sat down, and never said anything again if somebody had said that to him...\n \n \"Hey Mr. King. White people are being oppressed just like everyone is oppressed on some level.\"\n <end sarcasm<\n \n I swear. It's like you guys don't even stop to think about how inane, irrelevant, and pointless some of the things you post are going to sound...\n Oddly enough Dr. King was a straight man who was oppressed. Thanks for the good example.\n \n \nYou seem to know so little about so much.\n \n Sexual orientation has a lot to do with the case. ALL of Dahmer's victims were men. Some were known to be gay. Most of them were young men. They disappeared. Society's attitudes about gays enabled him to prey on these guys.\n Yeah, he killed people...still don't care about his sexual orientation. If I were doing a documentary or was part of the investigation, maybe I would care.\n \n \n\"His brilliant work and, indeed, his life were cut short by homophobia.\" Would that work for you?\n Sure, if you can 1) prove it and 2) were doing a special on him. Otherwise, 1-2 sentences in a history book. There is no reason to go out of the way to mention a person is gay just like you wouldn't mention they were straight.", 
   {}, 
   211832, 
   null, 
   1147136760.0
  ], 
  [
   211852, 
   null, 
   "foundit66", 
   "why your way is the question.\n\n 0) Society already works that way.\n 1) Most people are straight, and thus assuming them straight is more accurate. Actually, more rational.\n 2) See #1.\n 3) See #1 17 more times.\n ...\n 20) This person is gay, although experience has taught that most people are straight and presumed straight. This one in twenty person will correct those who assume, as necessary, as opposed to 19 in twenty people correcting those who assume them gay...\n \n Which do you think involves more work?\n \n Now. Getting back to my question.\n Why should we assume everybody gay, and then just explicitly correct the situation 95% of the time for those that are straight???\n As opposed to how society currently works in assuming people straight, and then just explicitly correcting the situation only 5% of the time???\n \n \n \nI can live without the smart -a** remarks too.\n\n I can live without the stupid questions as well...\n If you avoid the latter, I'll avoid the former...\n \n \n \nOddly enough Dr. King was a straight man who was oppressed. Thanks for the good example.\n\n And you just completely ignored my point.\n My point being how your reply was missing a HUGE elephant in the room...\n Typical...\n \n \n \nSure, if you can 1) prove it and 2) were doing a special on him. Otherwise, 1-2 sentences in a history book.\n\n 1) It should be painfully obvious to anybody who has actually READ info on his life.\n 2) Why don't we just make it 3-4, and give a more complete and thorough picture?\n 3) How many history books do you know that don't include info about a famous person's untimely death?\n JFK? Should we just include nothing about his death? Lincoln? etc...\n \n You're asking for a terse description without any real rationale...\n \n \n \nThere is no reason to go out of the way to mention a person is gay just like you wouldn't mention they were straight.\n\n This claim has been put to rest in so many posts which have given NUMEROUS EXPLICIT REASONS as to why some people's sexual orientation should be given.\n But ignore them if you will and claim \"no reason\" all you like.\n I'm sure you'll think somebody is fooled into believing that.", 
   {}, 
   211851, 
   null, 
   1147137540.0
  ], 
  [
   211854, 
   null, 
   "BobNelson2", 
   "Yeah, he killed people...still don't care about his sexual orientation. If I were doing a documentary or was part of the investigation, maybe I would care.\n\n \n Oh, I doubt it.\n \n \nSure, if you can 1) prove it and 2) were doing a special on him. Otherwise, 1-2 sentences in a history book. There is no reason to go out of the way to mention a person is gay just like you wouldn't mention they were straight.\n\n \n What's this one or two lines stuff all about? We're talking about history books here, not history pamplets. Even in grade school, most individuals covered warrant more than a line or two. Not in your experience, apparently....", 
   {}, 
   211851, 
   null, 
   1147138440.0
  ], 
  [
   211856, 
   null, 
   "Steeeeve", 
   "Oh, I doubt it.\n Ok? Come on Bob...I know you aren't trying to go down the insult road..you are normally better than that.\n \n \n\n What's this one or two lines stuff all about? We're talking about history books here, not history pamplets. Even in grade school, most individuals covered warrant more than a line or two. Not in your experience, apparently....\n We covered major players for more than 1-2 sentences. Someone like Turing doesn't deserve more than that...and even that is a lot. \n \n And can we deal without the pop-shots?", 
   {}, 
   211854, 
   null, 
   1147138800.0
  ], 
  [
   211860, 
   null, 
   "BobNelson2", 
   "Ok? Come on Bob...I know you aren't trying to go down the insult road..you are normally better than that.\n\n \n Come on, yourself. How seriously can anyone take your argument that history books cover people in one or two lines? Forgive my exasperation, but what sort of history is that?\n \n Sure, there are plenty of history books which do that. They're only a small, small part of the history literature. If that's all you were exposed to in school - even in grade school - that's a shame.\n \n \nAnd can we deal without the pop-shots?\n\n \n Your whole argument is a pop-shot. Don't you mean pot-shot?", 
   {}, 
   211856, 
   null, 
   1147140180.0
  ], 
  [
   211863, 
   null, 
   "Steeeeve", 
   "\n Come on, yourself. How seriously can anyone take your argument that history books cover people in one or two lines? Forgive my exasperation, but what sort of history is that?\n \n Sure, there are plenty of history books which do that. They're only a small, small part of the history literature. If that's all you were exposed to in school - even in grade school - that's a shame.\n My point was that Turing is not a huge part of history. He doesn't deserve a section about him. Grade school history books cover a lot and thus touch on the biggest points. The detailed stuff can be learned somewhere else down the line. The history books I had in grade school didn't cover Henry Ford's life...they only mentioned his dealings with larger parts of history.\n \n \nYour whole argument is a pop-shot. Don't you mean pot-shot?\n no, I mean what I said. There is no need for cheap insults...I thought I went over this earlier...I already blocked foundit today for doing this.", 
   {}, 
   211860, 
   null, 
   1147141560.0
  ], 
  [
   211878, 
   null, 
   "thelmoose", 
   " no, I mean what I said. There is no need for cheap insults...I thought I went over this earlier...I already blocked foundit today for doing this.\n\n \n What, prithee, is a pop-shot?", 
   {}, 
   211863, 
   null, 
   1147143720.0
  ], 
  [
   211882, 
   null, 
   "Steeeeve", 
   "What, prithee, is a pop-shot?\n\n ok maybe I made it up :p ....I mean it like insulting someone to bring them down as opposed to trying to fight fair...\"potshot\" is a term that means hitting someone without them really knowing...so it kinda means the same thing", 
   {}, 
   211878, 
   null, 
   1147145520.0
  ], 
  [
   211887, 
   null, 
   "jyoshu", 
   "What are you talking about? Who said this conversation was ONLY about the sexual orientation of individuals? That's not at the origin of the thread and I certainly didn't endorse the idea.\n\n \n Really?? The article in question in this thread is titled: \"CALIFORNIA Committee OKs bill to add gays, lesbians to textbooks\"\n It goes on to say . . .Supporters argued that all students should be made aware of the role that gay, lesbian, bisexual and transgender people have made\n Tell me, exactly what DOES the fact that ancient greek culture tended to be behaviorally bisexual have to do with historically teaching about gay, lesbian, bisexual and transgender people?\n \n Do you not understand there's a big difference between those two concepts?\n \n \nOk? Come on Bob...I know you aren't trying to go down the insult road..you are normally better than that.\n\n \n Since when??? Apparently you have a lot more patience than I do, Steeeeve.", 
   {}, 
   211841, 
   null, 
   1147147380.0
  ], 
  [
   211888, 
   null, 
   "jyoshu", 
   "Would you mind elaborating on the point I have supposedly missed?\n \n Because I think there was instead a level of sarcasm in my question, along with a point to my question, which YOU have missed...\n\n \n You???? sarcastic?? How could it be? emoticon_xangel \n \n You asked if I thought King'sn accomplishements occured because of his \"black genes\". The irony here is that I'm taking the stance because I don't believe they don't. \n \n \nRiddle me this...\n If Martin Luther King Jr's accomplishments did not occur because of his black genes, should we strike down any mention of his race from the history books?\n\n \n In his case, his race IS pertinent. Because it has to do with his accomplishments. The real question is do you think every person that ever did anything historically that was black, should the fact they are black be made an issue? I would say no.", 
   {}, 
   211847, 
   null, 
   1147147680.0
  ], 
  [
   211897, 
   null, 
   "MTKnight", 
   "Of course. Why would you assume it would get mentioned if it was not relevant to the historical background? Trivial details are, well, trivial. Some details, however, are very important and make history fascinating. Unless, you are of the mind that the mention of one's homosexuality would never be interesting to anyone or that it is too horrible to mention to school children.\n\n \n I would like to know some of those details please. I do not know many. I have heard of a few of them and have mentioned them in previous posts I believe. I've heard about how that young Spartans had same sex relations with each other and that later on it was gernerally frowned upon because by a certain age they were all married to women. This little tidbit was not brought up in my history class and as far as I'm concerned was ok with that not being brought up, I learned about it from other history books. I by far do not think anyone would not be interested in this information because everyone is different and about mentioning it to children I would have to say it shouldn't be mentioned to children not in high school. (8th or 9th grade would be a good time)", 
   {}, 
   211831, 
   null, 
   1147151820.0
  ], 
  [
   211909, 
   null, 
   "thelmoose", 
   "I would like to know some of those details please. I do not know many. I have heard of a few of them and have mentioned them in previous posts I believe. I've heard about how that young Spartans had same sex relations with each other and that later on it was gernerally frowned upon because by a certain age they were all married to women. This little tidbit was not brought up in my history class and as far as I'm concerned was ok with that not being brought up, I learned about it from other history books. I by far do not think anyone would not be interested in this information because everyone is different and about mentioning it to children I would have to say it shouldn't be mentioned to children not in high school. (8th or 9th grade would be a good time)\n\n \n You expressed an opinion about a topic and I took issue with that opinion. Now you want details of the topic that you already had the opinion on. Why would you hold an opinion about a topic with which you were ill-informed? Perhaps you should inform yourself before expressing an opinion. \n \n You mention Sparta here and in the religion forum. What? Another poster in Religion gave some good preliminary info about Greeks and homosexuality. Look  there . As we are talking about sexual behavior, it should always be discussed in the school setting in a manner appropriate to whatever age.", 
   {}, 
   211897, 
   null, 
   1147159080.0
  ], 
  [
   211910, 
   null, 
   "BobNelson2", 
   "I learned about it from other history books\n\n \n Well, being off-base, it's a good argument for better education about topics like that.\n \n Thanks", 
   {}, 
   211897, 
   null, 
   1147160040.0
  ], 
  [
   211912, 
   null, 
   "BobNelson2", 
   "Really?? The article in question in this thread is titled: \"CALIFORNIA Committee OKs bill to add gays, lesbians to textbooks\"\n It goes on to say . . .Supporters argued that all students should be made aware of the role that gay, lesbian, bisexual and transgender people have made\n Tell me, exactly what DOES the fact that ancient greek culture tended to be behaviorally bisexual have to do with historically teaching about gay, lesbian, bisexual and transgender people?\n \n Do you not understand there's a big difference between those two concepts?\n\n \n To answer your specific question, it shows that gay and bisexual people were an integral part of the culture which is the foundation of OUR culture, yours and mine, and that living openly did not destroy that culture. It also presents a pretty clear example of a society that did not see it as sinful, unnatural, immoral, etc. I see that as an important couple of points to learn.\n \n More in general, your argument that individuals must be mentioned by name is just fancy chain-yanking and doesn't stand even the slightest scrutiny. You are aware, I hope, that the word \"people\" applies to groups of individuals, not just to individual humans. As a result, one can speak of the contribution of groups. Nifty, huh?", 
   {}, 
   211887, 
   null, 
   1147160640.0
  ], 
  [
   211926, 
   null, 
   "MTKnight", 
   "You expressed an opinion about a topic and I took issue with that opinion. Now you want details of the topic that you already had the opinion on. Why would you hold an opinion about a topic with which you were ill-informed? Perhaps you should inform yourself before expressing an opinion. \n \n You mention Sparta here and in the religion forum. What? Another poster in Religion gave some good preliminary info about Greeks and homosexuality. Look  there . As we are talking about sexual behavior, it should always be discussed in the school setting in a manner appropriate to whatever age.\n\n \n I only wanted more details about what kind of facts would be presented to students. All I've heard here so far is that it might have had an affect about the person and their emotions. Or that it could be interesting to read about. However, it seems like everyone is discussing this already. Unfotunately for me I didn't catch this thread when it started out or I would have gotten much more information on it. So I am skimming through these pages in an effort of a basic understanding of everyone's stances here and their views. Saying I'm ill informed about the topic because I asked you a question about details I will take that you didn't understand what I was asking. If this to you is ill informed than so be it. As to the question of having an opinion about something without all the information it seems everyone here is having that right now as in the official law that enacts this has not stated what will be mentioned about homosexuality. All it says is it will be mentioned. However, also saying that someone must be entirely informed about something before expressing an opinion is not my way. However, not getting informed would be a problem which is why I express interest. Also though it seems we both agree that the schools shouldn't throw out trivial homosexual/bisexual history at students. All I was trying to find out from my question is what you would find appropriate and important to present to students.\n \n Also I don't think the link is right. Brought up a microsoft page and I currently have no time to find it and will have to find it later. I also agree with discussing homosexuality in schools however only to certain age groups/grades.", 
   {}, 
   211909, 
   null, 
   1147173600.0
  ], 
  [
   211927, 
   null, 
   "MTKnight", 
   "Well, being off-base, it's a good argument for better education about topics like that.\n \n Thanks\n\n \n My point in reading the history book was just for a research paper. So it was brought up in class but not gone over in the official text book. Most likely because it was not as important as what else happened in Sparta and the rest of Greece.", 
   {}, 
   211910, 
   null, 
   1147173780.0
  ], 
  [
   211928, 
   null, 
   "MTKnight", 
   "Also everyone should keep in mind that someone who might have been homosexual could have been easily bisexual. emoticon_xgood", 
   {}, 
   211927, 
   null, 
   1147174080.0
  ], 
  [
   211960, 
   null, 
   "foundit66", 
   "You???? sarcastic?? How could it be? emoticon_xangel \n \n You asked if I thought King'sn accomplishements occured because of his \"black genes\". The irony here is that I'm taking the stance because I don't believe they don't. \n\n I'm still waiting for the punch-line...\n Because I KNEW that was your stance to begin with.\n \n \n \nIn his case, his race IS pertinent. Because it has to do with his accomplishments. The real question is do you think every person that ever did anything historically that was black, should the fact they are black be made an issue? I would say no.\n\n Depends upon the issue, and the circumstances beyond that issue.\n I brought up Dr. V Thomas because he made significant advancements in his field, despite the fact that he was held back by his race.\n \n His advancements did not occur BECAUSE OF his race, but IN SPITE OF his race.\n Likewise, I feel similar situations should be noted. If a gay man/woman serves his country despite the fact that the military wants to oust him for being gay, that should be noted.\n If a gay man fathers modern computing, despite the fact that the laws against him are so oppressive, that should also be noted.\n \n Overcoming adversity is another point of history, and to blindly disregard it has no point.", 
   {}, 
   211888, 
   null, 
   1147195380.0
  ], 
  [
   212076, 
   null, 
   "jyoshu", 
   "His advancements did not occur BECAUSE OF his race, but IN SPITE OF his race.\n\n \n No, not in spite of his race; rather it was in spite of racism. His race wasn't what made it possibly harder. His race had nothing to do with it either way. That's why it's not pertinent.\n \n \nLikewise, I feel similar situations should be noted. If a gay man/woman serves his country despite the fact that the military wants to oust him for being gay, that should be noted.\n\n \n Agreed, but here the issue is not so much being made that so-and-so was gay, but rather that he faced discrimination.\n \n \nIf a gay man fathers modern computing, despite the fact that the laws against him are so oppressive, that should also be noted.\n\n \n I disagree unless the laws oppress him in the area of his accomplishments. It's not like there were laws on the books saying it's illegal for gays to develop computer science. Those laws had nothing to do with Turing's work; rather they were misplaced laws based on what people understood about sexual orientation at the time.", 
   {}, 
   211960, 
   null, 
   1147230660.0
  ], 
  [
   212088, 
   null, 
   "foundit66", 
   "No, not in spite of his race; rather it was in spite of racism. His race wasn't what made it possibly harder. His race had nothing to do with it either way. That's why it's not pertinent.\n\n Explain to me how you would discuss his problems with \"racism\" without discussing his race...\n \n And more to the point, WHY such a thing should be restricted as such in the first place...\n \n \n \nAgreed, but here the issue is not so much being made that so-and-so was gay, but rather that he faced discrimination.\n\n I see.\n So maybe it would be more pertinent to discuss why the person in question had to hide his sexual orientation due to the bigotry...\n \n \n \nI disagree unless the laws oppress him in the area of his accomplishments. It's not like there were laws on the books saying it's illegal for gays to develop computer science. Those laws had nothing to do with Turing's work; rather they were misplaced laws based on what people understood about sexual orientation at the time.\n\n You know what?\n I just realized that this discussion is becoming eerily like the \"egg roll\" discussion... You just keep making up new standards as you go along, with each subsequent one more irrelevant as the one before...\n \n Your requirements are ridiculous and unnecessary. As much so as you think discussing the sexual orientation of these historical people is ridiculous and unnecessary.\n \n And in the end, this piece of legislation will probably pass despite your inane quibbling.\n There is a point to this legislation. I've already explained it, but instead of addressing the reasons why such things are necessary, you're just making up new arbitrary standards as you go along.\n \n So be it. You ignoring the purpose of this legislation as you make up arbitrary standards will not matter in the end.\n \n If you want to discuss the reasons why this legislation should exist, I'm game.\n I have no more interest in watching you make up new rules as you go along while you ignore bigger issues...", 
   {}, 
   212076, 
   null, 
   1147234260.0
  ], 
  [
   212094, 
   null, 
   "jyoshu", 
   "Explain to me how you would discuss his problems with \"racism\" without discussing his race...\n\n \n His blackness doesn't have to be made an issue. In fact, I would think you'd rather focus on the discrimination than trumpeting being gay.\n \n \nYou know what?\n I just realized that this discussion is becoming eerily like the \"egg roll\" discussion... You just keep making up new standards as you go along, with each subsequent one more irrelevant as the one before... Your requirements are ridiculous and unnecessary. As much so as you think discussing the sexual orientation of these historical people is ridiculous and unnecessary. And in the end, this piece of legislation will probably pass despite your inane quibbling. There is a point to this legislation. I've already explained it, but instead of addressing the reasons why such things are necessary, you're just making up new arbitrary standards as you go along. So be it. You ignoring the purpose of this legislation as you make up arbitrary standards will not matter in the end. If you want to discuss the reasons why this legislation should exist, I'm game. I have no more interest in watching you make up new rules as you go along while you ignore bigger issues...\n\n \n LOL, Wow, what a sad cop out on your part. emoticon_cry Just sad. If you didn't want an answer you shouldn't have made the comment--a pattern which you do over and over where someone makes an argument, and you ask side questions or make side comments and then accuse them of \"making up new standards\" when they answer YOUR questions/comments. YOU deviated when you made the comment about the laws against Turing's sexuality to begin with. The discussion from me has been my reasons why I think the legislation is a bad idea.", 
   {}, 
   212088, 
   null, 
   1147234980.0
  ], 
  [
   212100, 
   null, 
   "foundit66", 
   "His blackness doesn't have to be made an issue. In fact, I would think you'd rather focus on the discrimination than trumpeting being gay.\n\n Do ya possibly think that the BASIS of the discrimination could possibly be discussed when talking about the DISCRIMINATION itself???\n \n Possibly? Just MAYBE???\n \n \n \nLOL, Wow, what a sad cop out on your part. emoticon_cry Just sad. If you didn't want an answer you shouldn't have made the comment--a pattern which you do over and over where someone makes an argument, and you ask side questions or make side comments and then accuse them of \"making up new standards\" when they answer YOUR questions/comments.\n\n Jyoshu?\n Here's another question for you.\n Who have I said that about BESIDES YOU?\n \n And do you want a list of questions which you have avoided addressing?\n \n This isn't a cop-out...\n This has nothing to do with you \"answering\" a question and everything to do with me recognizing a PATTERN in the WAY you are answering the question...\n \n This is me recognizing a pattern in you which you will continue on probably forever...\n And I really don't see a need in continuing in that dialogue pattern with you when you're avoiding bigger points...\n \n \n \n YOU deviated when you made the comment about the laws against Turing's sexuality to begin with. The discussion from me has been my reasons why I think the legislation is a bad idea.\n\n That WAS part of the discussion...\n Turing being one example of WHY including sexual orientation would be relevant.\n \n It was entirely topical.", 
   {}, 
   212094, 
   null, 
   1147236480.0
  ], 
  [
   212110, 
   null, 
   "BobNelson2", 
   "I disagree unless the laws oppress him in the area of his accomplishments. It's not like there were laws on the books saying it's illegal for gays to develop computer science. Those laws had nothing to do with Turing's work; rather they were misplaced laws based on what people understood about sexual orientation at the time.\n\n \n Go on, admit it, you know virtually nothing about Turing's legal problems.", 
   {}, 
   212076, 
   null, 
   1147240260.0
  ], 
  [
   212136, 
   null, 
   "Steeeeve", 
   "LOL, Wow, what a sad cop out on your part. emoticon_cry Just sad. If you didn't want an answer you shouldn't have made the comment--a pattern which you do over and over where someone makes an argument, and you ask side questions or make side comments and then accuse them of \"making up new standards\" when they answer YOUR questions/comments. YOU deviated when you made the comment about the laws against Turing's sexuality to begin with. The discussion from me has been my reasons why I think the legislation is a bad idea.\n\n Seems odd that he fuses at you for not having a consistent standard yet he prefers a Supreme Court that makes laws based off of no standard....just thought I would point that out.\n \n \nGo on, admit it, you know virtually nothing about Turing's legal problems.\n I'll admit it. I know nothing of Turing's legal problems and to be honest, I don't care. It isn't like this guy was the most important figure in the history of man. In fact, his research is the only thing that is important to history...his legal problems or being gay, not so much.", 
   {}, 
   212094, 
   null, 
   1147276620.0
  ], 
  [
   212157, 
   null, 
   "foundit66", 
   "Seems odd that he fuses at you for not having a consistent standard yet he prefers a Supreme Court that makes laws based off of no standard....just thought I would point that out.\n\n The Supreme Court has a standard.\n Protection of rights. Equality. Freedom. The constitution.\n Just because you don't respect that standard doesn't mean they don't have a standard.\n \n \n \nI'll admit it. I know nothing of Turing's legal problems and to be honest, I don't care. It isn't like this guy was the most important figure in the history of man. In fact, his research is the only thing that is important to history...his legal problems or being gay, not so much.\n\n I think the struggles of people against bigotry and discrimination IS a very important history lesson.\n If you had ever experienced REAL discrimination and bigotry, you might feel the same...", 
   {}, 
   212136, 
   null, 
   1147281840.0
  ], 
  [
   212161, 
   null, 
   "thelmoose", 
   " I'll admit it. I know nothing of Turing's legal problems and to be honest, I don't care. It isn't like this guy was the most important figure in the history of man. In fact, his research is the only thing that is important to history...his legal problems or being gay, not so much.\n\n \n I didn't either. Like you, I was ignorant about this, so I read up on it before spouting off. Turing played a huge part in the Allies' cryptanalysis that may have led to the ending of WWII. I think that is worth caring about. He was knighted for his work. His prosecution and death are shocking, make for extremely interesting history. Don't you think the way his government treated him in light of his contribution to his country and the free world is at least ironic?\n \n I know your answer. It appears you simply don't like talking about, hearing about, or thinking about things gay. You seem to see no worth in this topic at all, so it is a wonder why you bother to post about it.", 
   {}, 
   212136, 
   null, 
   1147283220.0
  ], 
  [
   212167, 
   null, 
   "MrWriteLA", 
   "Maybe children should be taught that Oscar Wilde spent his last years in Reading Gaol because of an overdue parking ticket, that James Baldwin's \"Giovanni's Room\" was about this great apartment in Italy, or that Gertrude Stein and Alice B. Toklas were just \"good friends.\" I mean, obviously homosexuality is completely irrelevant to their careers, right?", 
   {}, 
   212161, 
   null, 
   1147284180.0
  ], 
  [
   212174, 
   null, 
   "foundit66", 
   "I didn't either. Like you, I was ignorant about this, so I read up on it before spouting off. Turing played a huge part in the Allies' cryptanalysis that may have led to the ending of WWII. I think that is worth caring about. He was knighted for his work. His prosecution and death are shocking, make for extremely interesting history. Don't you think the way his government treated him in light of his contribution to his country and the free world is at least ironic?\n \n I know your answer. It appears you simply don't like talking about, hearing about, or thinking about things gay. You seem to see no worth in this topic at all, so it is a wonder why you bother to post about it.\n\n \n WoW!\n That last paragraph was a thermonuclear warhead hitting a nail on the head...", 
   {}, 
   212161, 
   null, 
   1147287060.0
  ], 
  [
   212187, 
   null, 
   "Steeeeve", 
   "I didn't either. Like you, I was ignorant about this, so I read up on it before spouting off. Turing played a huge part in the Allies' cryptanalysis that may have led to the ending of WWII. I think that is worth caring about. He was knighted for his work. His prosecution and death are shocking, make for extremely interesting history. Don't you think the way his government treated him in light of his contribution to his country and the free world is at least ironic?\n \n I know your answer. It appears you simply don't like talking about, hearing about, or thinking about things gay. You seem to see no worth in this topic at all, so it is a wonder why you bother to post about it.\n\n Perhaps you don't understand the big picture here. In High school children learn history...they don't learn every detail because that would take up 80yrs of the persons life. To solve this problem we stick with major, world changing, events and go from there. Turing was not a massive figure in WWII history and it is not worth wasting 1 or 2 lines just proclaim the man to be gay. If you want to do a documentary on the man, sure, go into his life story...but history books can't afford to do this. The fact that Turing \"might\" have helped with the war is a rather small point when D-Day was the clear turning point of the war against Germany and Midway was the turning point in the Pacific. Tell me, do you know the name of the pilot that found the locations of the Japanese ships allowing the Americans to win the battle of Midway? Was he straight or gay? Should we dedicate 2 pages of history to talk about his life story?", 
   {}, 
   212161, 
   null, 
   1147292580.0
  ], 
  [
   212192, 
   null, 
   "foundit66", 
   "Perhaps you don't understand the big picture here. In High school children learn history...they don't learn every detail because that would take up 80yrs of the persons life. To solve this problem we stick with major, world changing, events and go from there. Turing was not a massive figure in WWII history and it is not worth wasting 1 or 2 lines just proclaim the man to be gay.\n\n Each time you try to claim Turing was not a major figure in WWII history is just another example of how you're spouting off things you have NO CLUE on.\n \n This guy was a MAJOR reason for how \"the good guys\" finally broke the Germans enigma machine.\n \n Do you even know what the \"enigma machine\" was in WWII, or what it meant???\n \n \n \nIf you want to do a documentary on the man, sure, go into his life story...but history books can't afford to do this. The fact that Turing \"might\" have helped with the war is a rather small point when D-Day was the clear turning point of the war against Germany and Midway was the turning point in the Pacific.\n\n OMG you are so fricken clueless it isn't even funny.\n His work which broke the Enigma machine was part of the reason D-Day WENT FORWARD. \"The good guys\" wouldn't have been able to monitor the enemies communications to see if they knew what we were up to otherwise.\n \n Without him, we would have been clueless as to whether or not we were walking into a trap, and the whole plan could have been scrapped because of that.\n \n \n \nTell me, do you know the name of the pilot that found the locations of the Japanese ships allowing the Americans to win the battle of Midway? Was he straight or gay? Should we dedicate 2 pages of history to talk about his life story?\n\n You still have NO CLUE as to what Turing did, or how significant his accomplishments were.\n \n Thoroughly. Absolutely NONE.\n If you were honest, you would tell us whether or not you had even bothered to figure out who Turing was in the first place. I'm betting no. I'm betting you still have no clue as to what his work was, or what it lead to.", 
   {}, 
   212187, 
   null, 
   1147293840.0
  ], 
  [
   212206, 
   null, 
   "jyoshu", 
   "I didn't either. Like you, I was ignorant about this, so I read up on it before spouting off. Turing played a huge part in the Allies' cryptanalysis that may have led to the ending of WWII. I think that is worth caring about. \n\n \n Then by all means, teach that he played a huge part in the Allies' cryptanalysis that may have led to the ending of WWII. Give him the historical credit he deserves. No one here is saying you shouldn't teach that.\n \n Heck, I'd even be willing to concede that his sexuality could be taught about him if it was pertinent to his accomplishments. Yet somehow, I don't see much of a connection between sexual orientation and cryptanlysis and computer science logic. Do you?", 
   {}, 
   212161, 
   null, 
   1147298940.0
  ], 
  [
   212207, 
   null, 
   "jyoshu", 
   "Perhaps you don't understand the big picture here. In High school children learn history...they don't learn every detail because that would take up 80yrs of the persons life. To solve this problem we stick with major, world changing, events and go from there. Turing was not a massive figure in WWII history and it is not worth wasting 1 or 2 lines just proclaim the man to be gay. If you want to do a documentary on the man, sure, go into his life story...but history books can't afford to do this. The fact that Turing \"might\" have helped with the war is a rather small point when D-Day was the clear turning point of the war against Germany and Midway was the turning point in the Pacific. Tell me, do you know the name of the pilot that found the locations of the Japanese ships allowing the Americans to win the battle of Midway? Was he straight or gay? Should we dedicate 2 pages of history to talk about his life story?\n\n \n I wonder if they'd be so eager to point out the sexual orientation of every person that was straight?? After all, it just HAS to be connected to each person's historical accomplishments! emoticon_rolleyes", 
   {}, 
   212187, 
   null, 
   1147299120.0
  ], 
  [
   212208, 
   null, 
   "foundit66", 
   "I wonder if they'd be so eager to point out the sexual orientation of every person that was straight??\n\n How about we treat it just like society does?\n Assume they are straight, until told otherwise...\n \n \n \nAfter all, it just HAS to be connected to each person's historical accomplishments! emoticon_rolleyes\n\n Another boring straw-man argument... emoticon_rolleyes", 
   {}, 
   212207, 
   null, 
   1147299540.0
  ], 
  [
   212209, 
   null, 
   "thelmoose", 
   "Then by all means, teach that he played a huge part in the Allies' cryptanalysis that may have led to the ending of WWII. Give him the historical credit he deserves. No one here is saying you shouldn't teach that.\n \n Heck, I'd even be willing to concede that his sexuality could be taught about him if it was pertinent to his accomplishments. Yet somehow, I don't see much of a connection between sexual orientation and cryptanlysis and computer science logic. Do you?\n\n \n Of course there isn't a direct connection. Don't be sarcastic. The events of his imprisonment and death are significant in and of themselves.\n \n Let me put it this way. Do you think that there would ever be a reason to mention that an historical figure was homosexual?\n \n What about the reasons already suggested:\n \n Maybe children should be taught that Oscar Wilde spent his last years in Reading Gaol because of an overdue parking ticket, that James Baldwin's \"Giovanni's Room\" was about this great apartment in Italy, or that Gertrude Stein and Alice B. Toklas were just \"good friends.\" I mean, obviously homosexuality is completely irrelevant to their careers, right?\n\n \n That is the gist of this whole thread. Because there is an attempt to remove all mention of homosexuality in the school, this may prevent legimate discussions of homosexuality from occuring. I am not even sure a bill such as proposed is constitutional, enforceable, or should be left to individual to the school systems. I am just talking about the larger issue.", 
   {}, 
   212206, 
   null, 
   1147299960.0
  ], 
  [
   212215, 
   null, 
   "jyoshu", 
   "How about we treat it just like society does?\n Assume they are straight, until told otherwise...\n\n \n Is that what you did every time you learned about a historical figure in school-- thoughts about every single one of \"oh he/she's sexual orientation is straight\"? Lincoln, when he signed the Emancipation Proclamation? Washington when he led troops? Susan B. Anthony's accomplishments? Scores of others for their various accomplishments?\n \n Good grief, maybe I'm just the odd man out for not thinking about sexual orientation over everything . . .\n \n \nOf course there isn't a direct connection. Don't be sarcastic. The events of his imprisonment and death are significant in and of themselves.\n\n \n I wasn't be sarcastic; I was being serious. If you're going to argue that his contributions to WWII are significant for the classroom, then the reality you're going to have to face is that his sexual orientation was a different matter.\n \n \nLet me put it this way. Do you think that there would ever be a reason to mention that an historical figure was homosexual?\n\n \n I've already made that clear. If it pertains to the person's accomplishments, I could see bringing it up. But to make an issue out of every person who ever did anything in history that we think that person might have been gay (OR straight, for that matter) is silly, if you ask me.", 
   {}, 
   212208, 
   null, 
   1147301520.0
  ], 
  [
   212219, 
   null, 
   "foundit66", 
   "Is that what you did every time you learned about a historical figure in school-- thoughts about every single one of \"oh he/she's sexual orientation is straight\"? Lincoln, when he signed the Emancipation Proclamation? Washington when he led troops?\n\n What I WAS taught was who these two were married to...\n Should that be stricken from the record as well?\n \n Or maybe we should get equal time. If Lincoln's wife is mentioned, then the identity of any gay person's lover should also be mentioned...\n What do you think?\n \n \n \nI wasn't be sarcastic; I was being serious. If you're going to argue that his contributions to WWII are significant for the classroom, then the reality you're going to have to face is that his sexual orientation was a different matter.\n\n \"different matter\"? Sure.\n Matter worth mentioning just the same? Yes.\n \n \n \nI've already made that clear. If it pertains to the person's accomplishments, I could see bringing it up. But to make an issue out of every person who ever did anything in history that we think that person might have been gay (OR straight, for that matter) is silly, if you ask me.\n\n You think it's silly.\n We've stated purposes and reasons for it, which you continue to ignore.\n \n Next?", 
   {}, 
   212215, 
   null, 
   1147302300.0
  ], 
  [
   212222, 
   null, 
   "jyoshu", 
   "What I WAS taught was who these two were married to...\n Should that be stricken from the record as well?\n\n \n So in high school or under you were taught the name of Lincoln's wife? Or the name of George Washington's wife? Can you ever remember being able to NAME Susan B. Anthony's husband or even if she had one?\n \n (I love, by the way, your over-the-top phrasing: \"stricken from the record\" as if this isn't simply a case of not adding something that hasn't been added before. You guys crack me up sometimes. You really are a conspiracy theorist, Foundit! Interesting.)", 
   {}, 
   212219, 
   null, 
   1147302900.0
  ], 
  [
   212224, 
   null, 
   "thelmoose", 
   "\n But to make an issue out of every person who ever did anything in history that we think that person might have been gay (OR straight, for that matter) is silly, if you ask me.\n\n \n Who was advocating that?", 
   {}, 
   212215, 
   null, 
   1147303200.0
  ], 
  [
   212228, 
   null, 
   "foundit66", 
   "So in high school or under you were taught the name of Lincoln's wife? Or the name of George Washington's wife? Can you ever remember being able to NAME Susan B. Anthony's husband or even if she had one?\n\n Yes, and yes to the first two. Even before high school.\n No. I don't know that info for Susan B. Anthony.\n \n And predictably, you're COMPLETELY avoiding the point of my statements...\n \n \n \n(I love, by the way, your over-the-top phrasing: \"stricken from the record\" as if this isn't simply a case of not adding something that hasn't been added before. You guys crack me up sometimes. You really are a conspiracy theorist, Foundit! Interesting.)\n\n Are you a high school drop-out?\n Are you telling us that you had no idea as to whether or not George Washington or Abraham Lincoln were married?\n Are you trying to tell us that the marital status of George Washington / Abraham Lincoln was NEVER TAUGHT to you in school?\n \n I'ld be curious if you could actually find a history book which doesn't make note of the fact that they were married...\n \n Going one step further, I was taught in school that there was ONLY ONE president who wasn't married while in office. I wouldn't be surprised if most honest posters here heard that little tidbit in school as well...", 
   {}, 
   212222, 
   null, 
   1147303980.0
  ], 
  [
   212243, 
   null, 
   "BobNelson2", 
   "I'ld be curious if you could actually find a history book which doesn't make note of the fact that they were married...\n\n \n George and Martha Washington's sacrifices in their personal lives for the sake of the nation (and his career) are part of every American history book covering that period that I've ever seen.\n \n How could anyone describe Lincoln's assassination without mentioning his wife's presence? \n \n Perhaps in Jyoshu's and Steeeeeve's history classes, these two MOST important presidents in American history deserve only a paragraph each. That sort of coverage could conceivably leave out anything about their wives, I suppose.", 
   {}, 
   212228, 
   null, 
   1147307520.0
  ], 
  [
   212244, 
   null, 
   "BobNelson2", 
   "I'll admit it. I know nothing of Turing's legal problems and to be honest, I don't care. It isn't like this guy was the most important figure in the history of man. \n \n \n In fact, his research is the only thing that is important to history...his legal problems or being gay, not so much.\n\n \n Turing is one of the leading figures in the rise of the Information Age. Whether you noticed it or not, the world is in the midst of a revolution fully as important as the agricultural revolution.\n \n As to your point that it's his RESEARCH that is important. Of course it is and the persecution he suffered from his own government cut that research short, way, way short at the age of 42.", 
   {}, 
   212136, 
   null, 
   1147307700.0
  ], 
  [
   212245, 
   null, 
   "BobNelson2", 
   "Then by all means, teach that he played a huge part in the Allies' cryptanalysis that may have led to the ending of WWII. Give him the historical credit he deserves. No one here is saying you shouldn't teach that.\n \n Heck, I'd even be willing to concede that his sexuality could be taught about him if it was pertinent to his accomplishments. Yet somehow, I don't see much of a connection between sexual orientation and cryptanlysis and computer science logic. Do you?\n\n \n Prejudice against his sexual orientation truncated his accomplishments.", 
   {}, 
   212206, 
   null, 
   1147307760.0
  ], 
  [
   212246, 
   null, 
   "BobNelson2", 
   "(I love, by the way, your over-the-top phrasing: \"stricken from the record\" as if this isn't simply a case of not adding something that hasn't been added before. You guys crack me up sometimes. You really are a conspiracy theorist, Foundit! Interesting.)\n\n \n Too bad your love of our phrasing isn't the love that dare not reveal it's stupidity...", 
   {}, 
   212222, 
   null, 
   1147307880.0
  ], 
  [
   212249, 
   null, 
   "robbie0517", 
   "I wonder if they'd be so eager to point out the sexual orientation of every person that was straight?? After all, it just HAS to be connected to each person's historical accomplishments! emoticon_rolleyes\n\n \n Everyone is assumed to be straight unless otherwise noted. Do you not concede this? \n The point of stating that someone was gay is to help represent an underrepresented group. \n We already do this for, women, African-Americans, Native Americans, Mexican Americans and Asian Pacific Islanders. \n If you can't see the benefit of doing this, then you would also have to disagree with representing these other groups. Your argument of relevance is really irrelevant.", 
   {}, 
   212207, 
   null, 
   1147311000.0
  ], 
  [
   212290, 
   null, 
   "Steeeeve", 
   "Turing is one of the leading figures in the rise of the Information Age. Whether you noticed it or not, the world is in the midst of a revolution fully as important as the agricultural revolution.\n \n As to your point that it's his RESEARCH that is important. Of course it is and the persecution he suffered from his own government cut that research short, way, way short at the age of 42.\n\n \n All of which would be nice for a documentary....not a history book. I'd rather people learn of the real causes of the Civil War as opposed to Turing's life.", 
   {}, 
   212244, 
   null, 
   1147323240.0
  ], 
  [
   212293, 
   null, 
   "BobNelson2", 
   " I'd rather people learn of the real cases of the Civil War as opposed to Turing's life.\n\n \n Without mentioning Mrs. Lincoln, though, right?\n \n emoticon_xangel", 
   {}, 
   212290, 
   null, 
   1147326000.0
  ], 
  [
   212294, 
   null, 
   "BobNelson2", 
   "I don't know. Maybe other people's schooling was quite different than mine. I was quite the nerd and took extra classes. In any case, we had history and some other social science class every year, from third grade forward (public, then Catholic school). We managed to get beyond cursory, review courses.\n \n Other people's mileage clearly varied.", 
   {}, 
   212293, 
   null, 
   1147326180.0
  ], 
  [
   212326, 
   null, 
   "jyoshu", 
   "\"But Mr. Principal, I DO think I should teach about the sexual orientation of Mr. Lincoln and his wife to my class. The Emancipation Proclamation and the Civil War can wait! What? You don't think their sexual orientation is that pertinent? Why, you're just out to make gay people invisible!!!\"", 
   {}, 
   212249, 
   null, 
   1147360800.0
  ], 
  [
   212327, 
   null, 
   "jyoshu", 
   "Everyone is assumed to be straight unless otherwise noted. Do you not concede this? \n\n \n I really don't think most people think anything of it either way. I don't think most people even bother to make the assumptions at all. It's just hard for me to believe that most people sit around and think about what the sexual orientation of people are (or were). There's not an historical figure I know of that I've ever even bothered wondering about their sexual orientation. Like I said, maybe I'm just the odd-man-out on this one.\n \n \nThe point of stating that someone was gay is to help represent an underrepresented group.\n\n \n I don't think being straight is particularly \"represented\" either because most people don't think about the issue of sexual orientation of everyone in history.", 
   {}, 
   212326, 
   null, 
   1147360920.0
  ], 
  [
   212362, 
   null, 
   "thelmoose", 
   "I really don't think most people think anything of it either way. I don't think most people even bother to make the assumptions at all. It's just hard for me to believe that most people sit around and think about what the sexual orientation of people are (or were). There's not an historical figure I know of that I've ever even bothered wondering about their sexual orientation. Like I said, maybe I'm just the odd-man-out on this one.\n \n \n \n I don't think being straight is particularly \"represented\" either because most people don't think about the issue of sexual orientation of everyone in history.\n\n \n Try being gay for one day and see if you would maintain that stance. I can tell you that people \"bother to make the assumptions\" all the time. Straight people don't think about it, heterosexuality is assumed. A little exercise: go 24 hours trying to pay attention to how many implicit references to heterosexuality there are - at work, in the media, with friends. \n \n It is the \"not bothering to wonder\" part that is the crux of this whole discussion.", 
   {}, 
   212327, 
   null, 
   1147368540.0
  ], 
  [
   212373, 
   null, 
   "foundit66", 
   "\"But Mr. Principal, I DO think I should teach about the sexual orientation of Mr. Lincoln and his wife to my class. The Emancipation Proclamation and the Civil War can wait! What? You don't think their sexual orientation is that pertinent? Why, you're just out to make gay people invisible!!!\"\n\n This response by Jyoshu is just plain stupid.\n Strawman and hyperboles all around, with nothing meaningful.\n \n 1) The \"sexual orientation\" of Lincoln IS taught in schools. He had a wife. He had four sons.\n \n 2) \"Emancipation Proclamation and the Civil War can wait\"\n Utter stupidity! Nobody is saying that we have to teach \"sexual orientation\" BEFORE we teach things like the Emancipation Proclamation and the Civil War.\n It can obviously be done in CONJUNCTION WITH, just like it is today.\n \n 3) Gay people ARE CURRENTLY invisible when it comes to history.", 
   {}, 
   212326, 
   null, 
   1147369320.0
  ], 
  [
   212374, 
   null, 
   "foundit66", 
   "I don't think being straight is particularly \"represented\" either because most people don't think about the issue of sexual orientation of everyone in history.\n\n When students are taught about these characters BEING MARRIED and HAVING KIDS, then it's obvious that the sexual orientation IS CURRENTLY taught.\n \n Do you want that information, which is CURRENTLY TAUGHT, to be stopped to coincide with your ideals?\n \n A serious answer, please.\n Last time, you predictably dodged the question...", 
   {}, 
   212327, 
   null, 
   1147369440.0
  ], 
  [
   212376, 
   null, 
   "jyoshu", 
   "When students are taught about these characters BEING MARRIED and HAVING KIDS, then it's obvious that the sexual orientation IS CURRENTLY taught.\n\n \n You MAY have a point on the marriage thing, but having kids? How else is someone supposed to have had kids but in an opposite-sex relationship? It's not like two men can conceive a kid together. \n \n This isn't a case \"teaching sexual orientation\"; it's a case of teaching that someone had kids. Nothing more. It's not like these students hear about someone having kids and then slap their forehead saying \"Doh!! He's a straight dude!\" They just know they had kids. \n \n \nDo you want that information, which is CURRENTLY TAUGHT, to be stopped to coincide with your ideals?\n\n \n False delimma. As I said, teaching about someone having kids isn't \"teaching sexual orientation.\"", 
   {}, 
   212374, 
   null, 
   1147369740.0
  ], 
  [
   212386, 
   null, 
   "Steeeeve", 
   "Without mentioning Mrs. Lincoln, though, right?\n \n emoticon_xangel\n\n \n hopefully you meant that in a kidding way, but just to make sure...Lincoln wasn't gay", 
   {}, 
   212293, 
   null, 
   1147371720.0
  ], 
  [
   212402, 
   null, 
   "foundit66", 
   "You MAY have a point on the marriage thing, but having kids? How else is someone supposed to have had kids but in an opposite-sex relationship? It's not like two men can conceive a kid together. \n\n Instead of dodging, you're distracting from the point.\n Is a president having four sons relevant to his accomplishments with regards to the Civil War?\n If not, why do we include commentary about how many kids a president had?\n And doesn't it also point to the heterosexual nature of the president, in a manner which some have been arguing as irrelevant?\n \n \n \nThis isn't a case \"teaching sexual orientation\"; it's a case of teaching that someone had kids. Nothing more. It's not like these students hear about someone having kids and then slap their forehead saying \"Doh!! He's a straight dude!\" They just know they had kids. \n\n You keep trying to paint these situations in ways that are egregiously inaccurate.\n In Lincoln's time, can you name me ANYBODY who \"had kids\" but wasn't straight?\n ANYBODY at all?\n \n \n \nFalse delimma. As I said, teaching about someone having kids isn't \"teaching sexual orientation.\"\n\n False reply.\n As I was pointing out, the info of BOTH having the wife and the kids is taught.\n And I just addressed the \"kids\" part, but...\n But if you want to focus on one part (the kids) while you avoid the other part (the wives), let's remove the former from distraction...\n \n Do you want the information on the president's wives, which is CURRENTLY TAUGHT, to be stopped to coincide with your ideals?\n \n Don't dodge the question a third time...", 
   {}, 
   212376, 
   null, 
   1147373220.0
  ], 
  [
   212465, 
   null, 
   "BobNelson2", 
   "hopefully you meant that in a kidding way, but just to make sure...\n\n \n I was poking fun. I would hope that any serious coverage of Lincoln would mention his wife. His personal life was pretty interesting.\n \n \n \nLincoln wasn't gay\n\n \n Not by jyoshu's \"standard of certainty\".", 
   {}, 
   212386, 
   null, 
   1147395120.0
  ], 
  [
   212472, 
   null, 
   "jyoshu", 
   "Instead of dodging, you're distracting from the point.\n Is a president having four sons relevant to his accomplishments with regards to the Civil War?\n If not, why do we include commentary about how many kids a president had?\n And doesn't it also point to the heterosexual nature of the president, in a manner which some have been arguing as irrelevant?\n\n \n I have no problem with not making an issue of how many kids Lincoln had to school kids. In fact, I'd soon see them teach about the his pertinent accomplishments.\n \n \nYou keep trying to paint these situations in ways that are egregiously inaccurate.\n In Lincoln's time, can you name me ANYBODY who \"had kids\" but wasn't straight?\n ANYBODY at all?\n\n \n Who cares? to humor your question, I'll answer with this: it's very likely that there were people who married and had kids who were gay in Lincoln's time. Surely you don't disagree with THAT. I don't need to give you names for you to know that's true. But you are REALLY making a mountain our of a molehill on this one. emoticon_rolleyes \n \n \nAs I was pointing out, the info of BOTH having the wife and the kids is taught.\n And I just addressed the \"kids\" part, but...\n But if you want to focus on one part (the kids) while you avoid the other part (the wives), let's remove the former from distraction...\n\n \n And I'm telling you that kids don't worry about whether someone was \"straight\" or \"gay.\" The only one trying to make THAT an issue is you. You're determined not to see that, but that's your prerogative I guess. (shrug) I'm growing weary of your beating a dead horse here to ad nauseum--what a bunch hullaballo over nothing! That's all I'm going to say about this.", 
   {}, 
   212402, 
   null, 
   1147397400.0
  ], 
  [
   212490, 
   null, 
   "foundit66", 
   "Who cares?\n\n \"Who cares?\"\n I just proved a glaring fallacy in your argument, and your response is \"Who cares?\"\n Classic Jyoshu...\n \n \n \nto humor your question, I'll answer with this: it's very likely that there were people who married and had kids who were gay in Lincoln's time. Surely you don't disagree with THAT. I don't need to give you names for you to know that's true. But you are REALLY making a mountain our of a molehill on this one. emoticon_rolleyes \n\n Married, had kids, but they were gay?\n Sounds more like a straight person to me, doesn't it?\n \n And of course, you'll do ABSOLUTELY NOTHING to substantiate your point once again...\n \n And it's neither a \"mountain\" nor a \"molehill\", but pointing out that the heterosexuality of our history figures IS CURRENTLY noted...\n ... while their homosexuality is ignored...\n \n \n \nAnd I'm telling you that kids don't worry about whether someone was \"straight\" or \"gay.\" The only one trying to make THAT an issue is you. You're determined not to see that, but that's your prerogative I guess.\n\n Predictably, Jyoshu ignored my question ALL OVER AGAIN!!!\n \n Do you want the information on the president's wives, which is CURRENTLY TAUGHT, to be stopped to coincide with your ideals?\n \n If anybody ever should wonder why people see you as a dodger, you'll prove why in just a few posts...\n \n The fact that we CURRENTLY NOTE historical figures who were married with wives demonstrates that people CURRENTLY DO NOTE the heterosexuality of current historical figures.\n The reality is that YOU are the one who doesn't care about the HOMOSEXUALITY of our historical figures.\n \n \n \n(shrug) I'm growing weary of your beating a dead horse here to ad nauseum--what a bunch hullaballo over nothing! That's all I'm going to say about this.\n\n Gee. Should I requote the misrepresentation you laid out when I said something similar?\n Or should I avoid sinking to your level of dishonesty?", 
   {}, 
   212472, 
   null, 
   1147399560.0
  ], 
  [
   212534, 
   null, 
   "Steeeeve", 
   "I was poking fun. I would hope that any serious coverage of Lincoln would mention his wife. His personal life was pretty interesting.\n Not by jyoshu's \"standard of certainty\".\n Serious coverage of Lincoln should mention his wife and other personal life stuff if it were a book about him. Your standard history book probably shouldn't get into that too much....although he was extremely important in American history, much more so than Turing ever was or will be. Lincoln clearly changed this country...probably not to the liking if you are for gay-rights though.", 
   {}, 
   212465, 
   null, 
   1147426020.0
  ], 
  [
   212597, 
   null, 
   "foundit66", 
   "Serious coverage of Lincoln should mention his wife and other personal life stuff if it were a book about him.\n\n What about just a history class?\n Existing classes mention the fact that he was married. Ergo, heterosexual.\n Should they all stop teaching this to comply with your standards?\n \n \n \nYour standard history book probably shouldn't get into that too much....although he was extremely important in American history, much more so than Turing ever was or will be.\n\n You still don't know who \"Turing\" was, or what his accomplishment meant for the war, do you...\n \n \n \nLincoln clearly changed this country...probably not to the liking if you are for gay-rights though.\n\n WoW!\n Would you elaborate on that claim?\n \n Personally, I see it as part of a stepping stone towards the evolution of human rights. An incredibly important lesson, that I'm glad our nation learned.\n How do you think it would be \"not to the liking\" for those who are for gay rights?", 
   {}, 
   212534, 
   null, 
   1147454160.0
  ], 
  [
   212627, 
   null, 
   "BobNelson2", 
   "Serious coverage of Lincoln should mention his wife and other personal life stuff if it were a book about him. Your standard history book probably shouldn't get into that too much....\n\n \n I figured it out! You're thinking of a history coloring book! (all in shades of grey, mind you)\n \n \nLincoln clearly changed this country...probably not to the liking if you are for gay-rights though.\n\n \n The Civil War is the most dramatic, most violent, most important step in this nation's evolution as a free society of free and equal individuals. I happen to like that just fine.\n \n Don't you?", 
   {}, 
   212534, 
   null, 
   1147458300.0
  ], 
  [
   212667, 
   null, 
   "MrWriteLA", 
   "http://sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/05/12/BAGSOIQN391.DTL \nSacramento -- After a sometimes emotional debate, the state Senate approved a bill Thursday requiring public school instructional materials to contain \"age appropriate\" discussions of the contributions of gay, lesbian, bisexual and transgender people. \n \n The measure also prohibits teaching or textbooks that reflect adversely on people because of their sexual orientation. \n \n Opponents argued that the bill goes too far and is unnecessary, because schools can voluntarily offer instruction about gays. \n \n Supporters said textbooks are silent about the contributions of gays and lesbians just as they were once silent about those of African Americans and other minority groups. \n \n \"All we're saying is let us also be reflected in history,\" said the bill's author, Sen. Sheila Kuehl, D-Santa Monica. \n \n National attention \n \n Kuehl, who was the first openly lesbian lawmaker in the state Legislature, said that when she went to school in the 1940s, \"there was only white men in history. But I knew who Betsy Ross, Betty Crocker and Betty Boop were.\" \n \n The hot-button issue has garnered national attention because California represents a major chunk of the nation's textbook market. \n \n Kuehl's bill was sent to the Assembly by the 40-member Senate on a 22-15 vote. Sen. Dean Florez of Shafter (Kern County) was the only Democrat who voted no. Sen. Mike Machado, D-Linden (San Joaquin County), was present but did not vote. \n \n Given the heavy Democratic majority in the Assembly, the bill has a good chance of being sent to Gov. Arnold Schwarzenegger, who has yet to take a position on the measure. \n", 
   {
    "post_info": {
     "post_title": "It passed the Senate"
    }
   }, 
   212627, 
   null, 
   1147473360.0
  ], 
  [
   212682, 
   null, 
   "robbie0517", 
   "I am happy they are seeing the importance of this bill. This really is no different than how blacks were silent in history books. There really is hope for change in my life time :) (although discrimination and intolerance is alive and well here in Ohio)", 
   {}, 
   212667, 
   null, 
   1147487760.0
  ], 
  [
   212687, 
   null, 
   "jyoshu", 
   "I just wish they'd have defined the standards better, since they are basically forcing schools to teach a certain way. Exactly what constitutes \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\"? What does that mean, specifically? Punishing schools over how they carry out a vague directive is sort of scary.", 
   {}, 
   212682, 
   null, 
   1147489440.0
  ], 
  [
   212691, 
   null, 
   "robbie0517", 
   "I just wish they'd have defined the standards better, since they are basically forcing schools to teach a certain way. Exactly what constitutes \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\"? What does that mean, specifically? Punishing schools over how they carry out a vague directive is sort of scary.\n\n \n I'm sure if it passes, all that will get worked out. From what I understand it will be a directive to the companies that publish the text books, the teachers will just be teaching from the content. I'm kinda doubting Arnold will ever sign it though. Not trying to jinx it.", 
   {}, 
   212687, 
   null, 
   1147490220.0
  ], 
  [
   212699, 
   null, 
   "Steeeeve", 
   "I figured it out! You're thinking of a history coloring book! (all in shades of grey, mind you)\n \n\n Yeah that it emoticon_confused \n \n \n\n The Civil War is the most dramatic, most violent, most important step in this nation's evolution as a free society of free and equal individuals. I happen to like that just fine.\n \n Don't you?\n\n Sure, but it was very clear he felt God ruled this country\n \n \nI am happy they are seeing the importance of this bill. This really is no different than how blacks were silent in history books. There really is hope for change in my life time (although discrimination and intolerance is alive and well here in Ohio)\n ...Other than the huge difference of a whole civil rights movement and many well known figures that came from that time. If a \"gay rights\" movement creates a few people that changed America then they should be in a history book. Otherwise, who is so important in history that you feel is missing from your everyday 8th grade history book?", 
   {}, 
   212627, 
   null, 
   1147491660.0
  ], 
  [
   212702, 
   null, 
   "robbie0517", 
   " ...Other than the huge difference of a whole civil rights movement and many well known figures that came from that time. If a \"gay rights\" movement creates a few people that changed America then they should be in a history book. Otherwise, who is so important in history that you feel is missing from your everyday 8th grade history book?\n\n \n I wouldn't know, homosexuals weren't part of any history book I studied from. We might just find out :)", 
   {}, 
   212699, 
   null, 
   1147492980.0
  ], 
  [
   212724, 
   null, 
   "BobNelson2", 
   "Sure, but it was very clear he felt God ruled this country\n\n \n Sigh. You might consider reading one of those books that you think should go into further detail about Lincoln.", 
   {}, 
   212699, 
   null, 
   1147510860.0
  ], 
  [
   212725, 
   null, 
   "BobNelson2", 
   "I just wish they'd have defined the standards better, since they are basically forcing schools to teach a certain way. Exactly what constitutes \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\"? What does that mean, specifically? Punishing schools over how they carry out a vague directive is sort of scary.\n\n \n It's posts like these that make me think you're employed to be here and argue.\n \n Every regular poster and reader of these gay-related threads knows that you understand what a curriculum is. They know that your grasp of the administrative side of teaching isn't so tenuous as to allow you to fail to grasp how it all works.\n \n You just end up looking silly... or worse.", 
   {}, 
   212687, 
   null, 
   1147511040.0
  ], 
  [
   212777, 
   null, 
   "foundit66", 
   "I just wish they'd have defined the standards better, since they are basically forcing schools to teach a certain way.\n\n ALL of the schools' standards \"force the schools to teach a certain way\", don't they?\n Should we abolish all school standards?\n \n Or are you just propagandizing THIS issue with a skewed perspective?\n \n \n \nExactly what constitutes \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\"? What does that mean, specifically?\n\n <rollseyes<\n Are you dissatisfied that you don't have MORE that you can endlessly nitpick at to try and turn a mountain into a mole-hill?\n \n First of all, is the concept of \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\" bad? I would suspect you would answer no.\n \n So now it just comes down to quibbling over the boundaries. Should this be taught at the 9-year old level as opposed to 11 years old? Boundaries which I'm sure you want to complain and turn into something larger than they are, but you can't.\n \n I find your complaint hilarious. \n \n These standards are left in the hands of the SCHOOLS themselves, as opposed to decided at the legislature level. Which is more appropriate...\n Sorry you don't have more to whine about...\n \n \n \nPunishing schools over how they carry out a vague directive is sort of scary.\n\n HOW is this supposedly a \"punishment\"???\n Let me guess. Yet another propagandized statement, which you'll ignore questions on?", 
   {}, 
   212687, 
   null, 
   1147546560.0
  ], 
  [
   212780, 
   null, 
   "jyoshu", 
   "It's posts like these that make me think you're employed to be here and argue.\n \n Every regular poster and reader of these gay-related threads knows that you understand what a curriculum is. They know that your grasp of the administrative side of teaching isn't so tenuous as to allow you to fail to grasp how it all works.\n \n You just end up looking silly... or worse.\n\n \n And you didn't answer what I said.", 
   {}, 
   212725, 
   null, 
   1147552440.0
  ], 
  [
   212790, 
   null, 
   "Steeeeve", 
   "Sigh. You might consider reading one of those books that you think should go into further detail about Lincoln.\n\n \n Are you denying that Lincoln was a very religious person? Just read his Thanksgiving Day Proclaimation", 
   {}, 
   212724, 
   null, 
   1147561800.0
  ], 
  [
   212884, 
   null, 
   "foundit66", 
   "And you didn't answer what I said.\n\n Wow.\n If that isn't the pot complaining that the kettle is black...", 
   {}, 
   212780, 
   null, 
   1147630800.0
  ], 
  [
   212890, 
   null, 
   "BobNelson2", 
   "And you didn't answer what I said.\n\n \n Why should anyone answer such an obviously pointless question? Schools have curricula. States shape the curriculum for children in public schools. Been going on for decades.\n \n News to you?", 
   {}, 
   212780, 
   null, 
   1147634400.0
  ], 
  [
   212893, 
   null, 
   "jyoshu", 
   "Wow.\n If that isn't the pot complaining that the kettle is black...\n\n \n Still following me around in the threads unable to contain yourself I see. \n \n \nWhy should anyone answer such an obviously pointless question? Schools have curricula. States shape the curriculum for children in public schools. Been going on for decades.\n\n \n Nothing pointless about it. The question is, again, \"what constitutes \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\"? Considering that's what the state of CA is demanding, I think it's a very fair question.", 
   {}, 
   212884, 
   null, 
   1147636740.0
  ], 
  [
   212895, 
   null, 
   "foundit66", 
   "Still following me around in the threads unable to contain yourself I see. \n\n Your ego is unbelievable.\n I'm reviewing what EVERY poster is saying, and responding where I see a response is warranted.\n \n It's not about you...\n \n \n \nNothing pointless about it. The question is, again, \"what constitutes \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\"? Considering that's what the state of CA is demanding, I think it's a very fair question.\n\n It's a decision that should be made at the school district level.\n The comment is demonstrating that such decisions should be made, but not at the state legislator level.\n \n Are you uncomfortable with the school district making those decisions?\n \n And it looks like you'll have to wait until you see the policy in action before you can complain more...", 
   {}, 
   212893, 
   null, 
   1147637520.0
  ], 
  [
   212899, 
   null, 
   "jyoshu", 
   "It's a decision that should be made at the school district level. The comment is demonstrating that such decisions should be made, but not at the state legislator level.\n \n Are you uncomfortable with the school district making those decisions?\n\n \n So the state told them to do something and left it up to the school to determine what it is they meant by what they told them to do??? \n \n The question is, are YOU comfortable with the school districts deciding what is meant by the statement by the state.", 
   {}, 
   212895, 
   null, 
   1147638540.0
  ], 
  [
   212901, 
   null, 
   "BobNelson2", 
   "Nothing pointless about it. The question is, again, \"what constitutes \"age appropriate discussions of the contributions of gay, lesbian, bisexual and transgender people\"? Considering that's what the state of CA is demanding, I think it's a very fair question.\n\n \n I guess I'm wrong and you don't know how a state curriculum is developed. Odd.\n \n In any case, the Legislature gives the department of education a general instruction. The department will write up rules and regs, etc. in compliance with the instruction. (I'm sure the radical right will fight tooth and nail over every sentence.) Need more info???\n \n I guess you're just a'scaird that talking about gay people has to mean talking about sex. y a w n\n \n Here's an idea!! What is age-inappropriate coverage? Why not start a list of no-no's that you can forward to the appropriate bureaucrats?", 
   {}, 
   212893, 
   null, 
   1147639980.0
  ], 
  [
   212906, 
   null, 
   "foundit66", 
   "So the state told them to do something and left it up to the school to determine what it is they meant by what they told them to do??? \n\n It's funny how you try to distort the situation by eliminating the details of the situation, and making it vague so that it sounds negative.\n \n The state told them to include discussions on gay characters in their history classes.\n The state is ALSO telling them that HOW they implement this, with regards to age and material for that age, is up to them.\n \n \n \nThe question is, are YOU comfortable with the school districts deciding what is meant by the statement by the state.\n\n I am more comfortable with the schools making that decision than I am with the legislature making that decision.\n \n Whether or not I like the school district's decisions will have to wait until they actually put the policy into action. And I am comfortable waiting for that.", 
   {}, 
   212899, 
   null, 
   1147642680.0
  ], 
  [
   212912, 
   null, 
   "robbie0517", 
   "Whether or not I like the school district's decisions will have to wait until they actually put the policy into action. And I am comfortable waiting for that.\n\n \n From what I read, the new revised text books wouldn't be out until 2012.", 
   {}, 
   212906, 
   null, 
   1147645200.0
  ], 
  [
   212933, 
   null, 
   "jyoshu", 
   "I guess I'm wrong and you don't know how a state curriculum is developed. Odd. In any case, the Legislature gives the department of education a general instruction. The department will write up rules and regs, etc. in compliance with the instruction. (I'm sure the radical right will fight tooth and nail over every sentence.) Need more info???\n\n \n Actually, no I didn't know that process exactly. (And there's no need to be snooty about it, on your part.)\n \n But I still don't see why that question can't be asked. Even if it's the dept. of education instead of the legislature that needs to give their standards for what constitutes it.\n \n \nIt's funny how you try to distort the situation by eliminating the details of the situation, and making it vague so that it sounds negative.\n\n \n Reading waaay too much into things again, I see.", 
   {}, 
   212901, 
   null, 
   1147654500.0
  ], 
  [
   212939, 
   null, 
   "foundit66", 
   "Actually, no I didn't know that process exactly. (And there's no need to be snooty about it, on your part.)\n\n It's amazing how many subjects you criticize upon without \"knowing that process exactly\", as you put it...\n \n \n \nBut I still don't see why that question can't be asked. Even if it's the dept. of education instead of the legislature that needs to give their standards for what constitutes it.\n\n Once again, you pose a strawman problem.\n Who here is saying that the question can't be asked?\n \n In fact, it's easily observable that most of us are acknowledging that the school districts, and all the politics that come with it, WILL have to ask and answer that question.\n \n \n \nReading waaay too much into things again, I see.\n\n Nope. Just noticing a trend...\n \n And once again, you avoided addressing anything I said on the topic...\n Another trend...", 
   {}, 
   212933, 
   null, 
   1147655520.0
  ], 
  [
   212942, 
   null, 
   "jyoshu", 
   "It's amazing how many subjects you criticize upon without \"knowing that process exactly\", as you put it...\n\n \n See, there you go. There was no good reason to make that statement. It was just meanness on your part. If you think there's many subjects I do that with, then put your money where your mouth is and give me the examples of all these supposed times when I've \"not known the process exactly.\" \n \n \nOnce again, you pose a strawman problem.\n Who here is saying that the question can't be asked?\n\n \n Then what's the answer, in your view? I'll even ask it again, for your convenience: what constitutes 'age appropriate' discussions of the contributions of gay, lesbian, bisexual and transgender people?", 
   {}, 
   212939, 
   null, 
   1147656300.0
  ], 
  [
   212950, 
   null, 
   "BobNelson2", 
   "Actually, no I didn't know that process exactly. (And there's no need to be snooty about it, on your part.)\n\n \n Your comments on the Kings And Kings thread seemed to indicate that you were familiar with the approval process for school curriculum. You certainly kept talking about how the district had to enforce its rules. If I misunderstood at the time, I'm sorry.\n \n \nBut I still don't see why that question can't be asked. Even if it's the dept. of education instead of the legislature that needs to give their standards for what constitutes it.\n\n \n The question certainly can be asked. And one can ask what you would consider inappropriate, as I have.\n \n Any mention of gay people that doesn't involve talking about sex acts seems to me to be \"age-appropriate\" to any age. Surely you don't expect descriptions of sex acts to get into history, literature, and social science classes, do you?????", 
   {}, 
   212933, 
   null, 
   1147657200.0
  ], 
  [
   212954, 
   null, 
   "jyoshu", 
   "Your comments on the Kings And Kings thread seemed to indicate that you were familiar with the approval process for school curriculum. You certainly kept taking about how the district had to enforce its rules. If I misunderstood at the time, I'm sorry.\n\n \n Well, I did think I understood it; it was my understanding that school districts had great latitude in choosing their curriculum, but you're basically telling me differently from what I gather.\n \n \nAny mention of gay people that doesn't involve talking about sex acts seems to me to be \"age-appropriate\" to any age. Surely you don't expect descriptions of sex acts to get into history, literature, and social science classes, do you?????\n\n \n Well, I hope not. I'm not so optimistic about that.", 
   {}, 
   212950, 
   null, 
   1147657500.0
  ], 
  [
   212962, 
   null, 
   "BobNelson2", 
   "Well, I hope not. I'm not so optimistic about that.\n\n \n If any post ever deserved an emoticon_rolleyes, this one does.", 
   {}, 
   212954, 
   null, 
   1147658220.0
  ], 
  [
   212963, 
   null, 
   "foundit66", 
   "See, there you go. There was no good reason to make that statement.\n\n \"no good reason\"?\n I would disagree with you.\n I think it's reasonable that somebody should have some KNOWLEDGE on a subject before they start spouting out on that subject.\n \n \n \nIt was just meanness on your part.\n\n How precisely is that mean?\n I used YOUR WORDS on your knowledge basis, and then I made an observation about how other situations had similar situations.\n \n Was I inaccurate in my assessment?\n \n \n \nIf you think there's many subjects I do that with, then put your money where your mouth is and give me the examples of all these supposed times when I've \"not known the process exactly.\" \n\n For all the times that I have asked you to substantiate YOUR statements, but you refused to reply, I'm tempted to ignore your request.\n But I'll try to set an example...\n \n Let's see...\n 1) Your statements on the \"Cheney's daughter\" thread made it plain that you didn't know what ghost-writing was and what the situation was with Cheney's book before you first responded to statements about that situation.\n 2) Gay and Lesbian web access in school. You were saying it was too tough to distinguish between the porn and non-porn gay web-sites, and eventually you admitted that you didn't know how the software distinguishes between porn and non-porn web-sites in the first place.\n 3) You were making comments about people's sexual orientation being noted in history classes in school, but then you didn't realize that the HETEROSEXUAL UNIONS of people in history were often noted.\n (Same thread, different example)\n \n I think three is a nice round number to start off with. And more than enough to justify my original statement....\n \n \n \nThen what's the answer, in your view? I'll even ask it again, for your convenience: what constitutes 'age appropriate' discussions of the contributions of gay, lesbian, bisexual and transgender people?\n\n Two questions in one post from you?\n While you ignore mounds and mounds of my requests for substantiations and elaborations on your position?\n \n Tell me. For children, what is the \"age appropriate\" to go see Cinderella?\n How about if we substituted \"Carl\" for \"Cindy\"?\n \n If we make that substitution, do we suddenly have to describe what Carl and Prince Charming would do on their wedding night?\n We didn't have to do that for the previously straight story, so why should we be concerned about it for the now gay story? Just leave Carl and Prince Charming \"happily ever after\", and let it be that?\n \n The point of all this?\n Use the same type of standards that exist for HETEROSEXUAL discussions in history for HOMOSEXUAL discussions in history. People CREATE controversy with homosexual issues, then they don't even care about or concern themselves with for heterosexual counter-parts.\n \n And quite frankly, people can \"create\" controversy on anything they please.\n I see no need to restrict OTHER PEOPLE's kids just because a SMALL NUMBER of parents seek to create a \"controversy\"...", 
   {}, 
   212942, 
   null, 
   1147658700.0
  ], 
  [
   212968, 
   null, 
   "jyoshu", 
   "Let's see...\n 1) Your statements on the \"Cheney's daughter\" thread made it plain that you didn't know what ghost-writing was and what the situation was with Cheney's book before you first responded to statements about that situation.\n\n \n Foundit, I initiated that discussion. The whole \"ghost writing\" thing was a tangent. The issue of it being ghost written or not had nothing to do with the point of that thread. And for that matter, BobNelson2 never even came back and followed up with his 'investigation' or whatever.\n \n \n2) Gay and Lesbian web access in school. You were saying it was too tough to distinguish between the porn and non-porn gay web-sites, and eventually you admitted that you didn't know how the software distinguishes between porn and non-porn web-sites in the first place.\n\n \n You never proved how it works either. In fact, as I recall you pretty much substantiated my claims that the school officials had to go in and make changes based on what you said you thought they would have to do. \n \n \n3) You were making comments about people's sexual orientation being noted in history classes in school, but then you didn't realize that the HETEROSEXUAL UNIONS of people in history were often noted.\n (Same thread, different example)\n\n \n They aren't that often noted, unless it's pertinent, and I made it clear that if it's pertinent to their accomplishments then the mentioning of homoseuxality was fine by me.\n \n In essense, you are quibbling with all these huge number of cases . . all whopping 3 of them. (ahem) and you're making them out to be something more than the cases really were. None of them had anything to do with the heart of the discussions anyway. Besides, part of discussing these issues is learning more about them, and if that's something you're going to criticize me over, then you'll just have to get over it. If I learn something new about side matters regarding any of these issues, I'm glad to do so. Pity you don't seem interested in doing the same.\n \n \nI think three is a nice round number to start off with. And more than enough to justify my original statement....\n\n \n More likely it's because it's all you could come up with, and even then none of them were about the heart of what was being discussed.\n \n \nTell me. For children, what is the \"age appropriate\" to go see Cinderella? How about if we substituted \"Carl\" for \"Cindy\"?\n\n \n We're not talking about fairy tales here, but history. I'm asking what constitutes appropriate discussion. Is that so hard? Would it be, say, simply that \"so-and-so was gay\"? If so I'd have no problem with that, probably. Would it be, say, so and so was noted for having lots of male sexual partners and would meet them for sexual rendezvous in bath houses?\" I would have a problem with that. Or if it ceased to be straightforward history teaching and was used for a platform for activism and gay rights.", 
   {}, 
   212963, 
   null, 
   1147660380.0
  ], 
  [
   212973, 
   null, 
   "foundit66", 
   "Foundit, I initiated that discussion. The whole \"ghost writing\" thing was a tangent.\n\n Somebody else mentioned \"ghost writing\", and you jumped on the claim without even really knowing what the term meant.\n My point is substantiated. Your reply is an attempt to distract from that...\n \n \n \nYou never proved how it works either. In fact, as I recall you pretty much substantiated my claims that the school officials had to go in and make changes based on what you said you thought they would have to do. \n\n More deceitful misrepresentation.\n You were complaining about how difficult it would be to differentiate between the two.\n Any \"changes\" that need to be made are merely superficial. I can \"add\" something to a safe list in less than a minute. It's not hard at all.\n \n THAT was the point substantiating my claim. Again, your reply is an attempt to distract from that.\n \n \n \nThey aren't that often noted, unless it's pertinent...\n\n PURELY Wrong.\n You made it clear that you didn't even know when they were mentioned.\n THAT is the point.\n \n \n \nIn essense, you are quibbling with all these huge number of cases . . all whopping 3 of them. (ahem)\n\n I'm not \"quibbling\" over anything.\n I made a statement.\n I gave you the basis for my statement.\n You are whining over inconsequential and irrelevant aspects of those discussions, without even broaching the fact that they DO IN FACT support my original statement.\n \n And I could give a LOT more than three if I really cared.\n But in proving it to you? Nope. I just don't care. You haven't even addressed the examples I gave in the first place.\n I've proven a basis for my statement, and that's all that matters.\n \n \n \nNone of them had anything to do with the heart of the discussions anyway.\n\n Did I say they had to be the \"heart of the discussions\"?\n Once again, you're making up new standards which are convenient for you, without any real basis.\n \n \n \nBesides, part of discussing these issues is learning more about them, and if that's something you're going to criticize me over, then you'll just have to get over it.\n\n Dude. I have NO problem with somebody ACKNOWLEDGING that they are learning something about a subject.\n But when you FORM AN OPINION on aspects of the discussions you are clearly clueless on, like the difficulty of adding a non-porn gay web-site to a non-filtered list.\n \n \n \nIf I learn something new about side matters regarding any of these issues, I'm glad to do so. Pity you don't seem interested in doing the same.\n\n And AGAIN he twists things into dishonest representations.\n I learn things as well. I relish the learning that takes place.\n \n Can you explain why you don't think I'm \"interested in doing the same\"?\n Or was that just another lie on your part? One of many?\n \n And you have the gall to complain about \"meanness\" when you make such obviously deceitful misrepresentations?\n \n \n \nMore likely it's because it's all you could come up with, and even then none of them were about the heart of what was being discussed.\n\n Wrong.\n I could list more, but those were the most recent examples that came to mind. And they substantiated my point quite admirably.\n Why list 20 examples of something when 3 will prove your point?\n \n \n \nWe're not talking about fairy tales here, but history.\n\n It was an analogy to demonstrate a point.\n And predictably, instead of going on to the REST of the discussion where I made that point, you instead focus on this one analogy.\n \n \n \nI'm asking what constitutes appropriate discussion. Is that so hard?\n\n I answered your question. Quit being dishonest in pretending I didn't.\n Go back and respond to the part you DIDN'T reply to.\n \n \n \nWould it be, say, simply that \"so-and-so was gay\"? If so I'd have no problem with that, probably. Would it be, say, so and so was noted for having lots of male sexual partners and would meet them for sexual rendezvous in bath houses?\" I would have a problem with that. Or if it ceased to be straightforward history teaching and was used for a platform for activism and gay rights.\n\n I answered your questions. (Regardless of whether or not you want to admit it...)\n \n Now explain to me what you mean by \"ceased to be straightforward history teaching and was used for a platform for activism and gay rights\"...", 
   {}, 
   212968, 
   null, 
   1147662360.0
  ], 
  [
   212982, 
   null, 
   "Steeeeve", 
   "jyoshu, \n \n you are arguing with someone that will say you used \"to\" instead of \"too\" and thus declare your whole arguement wrong. In fact, he will probably read this and say \"i never got after someone for using to instead of too\" without understanding the message being given. So I would advise just blocking him :)", 
   {}, 
   212968, 
   null, 
   1147667400.0
  ], 
  [
   212989, 
   null, 
   "jyoshu", 
   "jyoshu, \n \n you are arguing with someone that will say you used \"to\" instead of \"too\" and thus declare your whole arguement wrong. In fact, he will probably read this and say \"i never got after someone for using to instead of to\" without understanding the message being given. So I would advise just blocking him :)\n\n \n Yeah, maybe you're right. I'm getting pretty tired of having to argue over the definition of \"is\" every single post.", 
   {}, 
   212982, 
   null, 
   1147668660.0
  ], 
  [
   213001, 
   null, 
   "foundit66", 
   "jyoshu, \n you are arguing with someone that will say you used \"to\" instead of \"too\" and thus declare your whole arguement wrong. In fact, he will probably read this and say \"i never got after someone for using to instead of to\" without understanding the message being given. So I would advise just blocking him :)\n\n So basically you made up a claim?\n If you have a REAL claim, I suggest you spell it out precisely and show where I did it.\n \n Because unless you do, you're just obviously making stuff up...\n Although I'm sure Jyoshu can relate...\n \n \n \nYeah, maybe you're right. I'm getting pretty tired of having to argue over the definition of \"is\" every single post.\n\n Same goes to you Jyoshu.\n Show me specifically what you're complaining about...", 
   {}, 
   212982, 
   null, 
   1147674180.0
  ], 
  [
   213017, 
   null, 
   "Steeeeve", 
   "Yeah, maybe you're right. I'm getting pretty tired of having to argue over the definition of \"is\" every single post.\n\n Kind of a good defense tactic though...instead of arguing the substance of a post you argue an irrelevant point and then claim victory when the other person gets confused about why you would even question something so irrelevant.", 
   {}, 
   212989, 
   null, 
   1147706040.0
  ], 
  [
   213019, 
   null, 
   "jyoshu", 
   "Kind of a good defense tactic though...\n\n \n Yeah, though still very transparent. Either he's doing it on purpose, or he has a rather serious case of ADHD.", 
   {}, 
   213017, 
   null, 
   1147706820.0
  ], 
  [
   213020, 
   null, 
   "foundit66", 
   "Kind of a good defense tactic though...instead of arguing the substance of a post you argue an irrelevant point and then claim victory when the other person gets confused about why you would even question something so irrelevant.\n\n \"the substance of a post\"?\n Show me anywhere where I avoided the substance of a post.\n \n You're creating so many strawman claims it isn't even funny.\n Your VERY POST is an example of how you aren't arguing substance. Of anything...\n You aren't even talking about the topic of this thread!", 
   {}, 
   213017, 
   null, 
   1147706940.0
  ], 
  [
   213095, 
   null, 
   "robbie0517", 
   "Well, I hope not. I'm not so optimistic about that.\n\n \n Why does it seem like discussing anything about gays with children is like bringing up monsters under their beds. Like it is something soooo scary?", 
   {}, 
   212954, 
   null, 
   1147743660.0
  ], 
  [
   213119, 
   null, 
   "jyoshu", 
   "Why does it seem like discussing anything about gays with children is like bringing up monsters under their beds. Like it is something soooo scary?\n\n \n Like I said, it depends on exactly what's taught.", 
   {}, 
   213095, 
   null, 
   1147753680.0
  ], 
  [
   213155, 
   null, 
   "Kronus", 
   "Kind of a good defense tactic though...instead of arguing the substance of a post you argue an irrelevant point and then claim victory when the other person gets confused about why you would even question something so irrelevant.\n\n \n Not exactly a defense tactic. If someone says \"Let's talk baseball! Wasn't the fieldgoal after the faceoff in last night's game awesome!\" there's not much point in going after the substance.", 
   {}, 
   213017, 
   null, 
   1147792380.0
  ], 
  [
   213158, 
   null, 
   "Steeeeve", 
   "Not exactly a defense tactic. If someone says \"Let's talk baseball! Wasn't the fieldgoal after the faceoff in last night's game awesome!\" there's not much point in going after the substance.\n\n \n way to prove my point...", 
   {}, 
   213155, 
   null, 
   1147793280.0
  ], 
  [
   226851, 
   null, 
   "foundit66", 
   "SACRAMENTO - Facing a certain veto, state lawmakers have abandoned their effort to require that textbooks in California schools detail the history and achievements of gays and lesbians in America.\n \n Supporters removed that provision of the gay rights bill, which passed the California Senate in May, so that the measure only bars teaching anything that \"reflects adversely\" on people because of their sexual orientation. Schools would also be prohibited from sponsoring any activities that sanction such a bias.\n \n The revised law is certain to win full approval by the Democratic-led Legislature. If the bill is signed by Gov. Arnold Schwarzenegger, it would add that protection to California's existing anti-discrimination law, which prohibits instructional materials and teachers from pedagogy that is negative about race, ethnicity, disability, nationality or religion.\n \n State Sen. Sheila Kuehl (D-Santa Monica), the author of SB 1437, said she made the change even though it removed 90% of the import of the measure, which would have been the first in the country to mandate the teaching of homosexuals' contributions. The bill had drawn strong support from gay activists but ridicule from social conservatives and others who objected to the notion of debating historical figures' sexual orientations in textbooks.\n \n \"I did this because I'm hoping this is small enough and important enough at the same time that the governor can sign it even in an election year,\" Kuehl said Monday.\n \n But Schwarzenegger's office, which had taken the rare step of announcing his intention to veto the bill, provided no encouraging signal that he would change his mind.\n \n \"The governor will not sign a bill that micromanages curriculum that is better left to the state Board of Education,\" Schwarzenegger press secretary Margita Thompson said.\n \n The Campaign for Children and Families, a conservative group, condemned the altered measure, saying that it would still prohibit teachers from telling students that there is such thing as \"the natural family\" and that bisexual parents are abnormal.\n \n \"Gov. Schwarzenegger said he would veto SB 1437,\" said Randy Thomasson, the Sacramento-based group's president. \"Fathers and mothers expect Arnold not to let them down.\" \n \n In a preliminary vote Monday in the Assembly, 20 Republicans supported the changes, which passed 65 to 2, with 13 legislators abstaining. A spokesman for the GOP caucus said the members would not support the bill when it comes up for a final vote, but it still has more than enough Democratic votes to pass.\n \n Geoffrey Kors, executive director of Equality California, a gay rights group, said he was disappointed with the changes, but the revised bill would make it possible to catalog and investigate complaints about teachers' derogatory statements.\n \n \"We'll move forward one piece at a time,\" he said.\n \n He said his group had decided to endorse Schwarzenegger's Democratic challenger, state Treasurer Phil Angelides, because Schwarzenegger, though \"the best Republican governor\" on gay rights issues, \"puts politics above principle\" and has vetoed a number of priorities, including legalized gay marriage. \n \n The group had endorsed state Controller Steve Westly over Angelides in the Democratic primary. \n http://www.latimes.com/news/printedition/california/la-me-books8aug08,1,6748288.story?coll=la-headlines-pe-california&ctrack=1&cset=true", 
   {
    "post_info": {
     "post_title": "Update..."
    }, 
    "unicode_changes_made": true
   }, 
   213158, 
   null, 
   1155070260.0
  ], 
  [
   226857, 
   null, 
   "jyoshu", 
   "SACRAMENTO - Facing a certain veto, state lawmakers have abandoned their effort to require that textbooks in California schools detail the history and achievements of gays and lesbians in America.\n\n \n Supporters removed that provision of the gay rights bill, which passed the California Senate in May, so that the measure only bars teaching anything that \"reflects adversely\" on people because of their sexual orientation. Schools would also be prohibited from sponsoring any activities that sanction such a bias.[/quote]\n \n I think they did the right thing--if people who happen to be gay make achievements, they're gong to be noted for those achievements. If it pertains to them being gay, then so be it; it will be mentioned. More regulation isn't always the best answer.", 
   {
    "unicode_changes_made": true
   }, 
   226851, 
   null, 
   1155071340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ending the silence.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8066, 
  "discussion_files": [
   [
    "8044.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-print.html"
   ], 
   [
    "8045.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-13-print.html"
   ], 
   [
    "8046.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-12-print.html"
   ], 
   [
    "8047.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-10-print.html"
   ], 
   [
    "8048.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-8-print.html"
   ], 
   [
    "8049.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-6-print.html"
   ], 
   [
    "8050.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-4-print.html"
   ], 
   [
    "8051.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-5-print.html"
   ], 
   [
    "8052.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-7-print.html"
   ], 
   [
    "8053.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-9-print.html"
   ], 
   [
    "8054.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-11-print.html"
   ], 
   [
    "8055.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-3-print.html"
   ], 
   [
    "8056.html", 
    "http://www.4forums.com/political/gay-rights-debates/8066-ending-silence-2-print.html"
   ]
  ], 
  "identifier": 8066
 }
]