[
 [
  [
   211357, 
   null, 
   "Phunting", 
   "Well, looking bad for Labour, but not as bad as it could have been.\n \n Myself, voted Tory from Labour for the first time in six years.\n \n Any other thoughts/opinions?", 
   {
    "post_info": {
     "post_title": "UK Local Elections"
    }
   }, 
   null, 
   null, 
   1146794820.0
  ], 
  [
   211389, 
   null, 
   "Jo Bennett", 
   "First is, what possible reason could you have for voting for that bunch of closet racists and lying toerags? emoticon_confused If you're going to engage in a protest vote, at least give it to someone who can't make much out of it. Sorry if that sounds a bit harsh, but I despise the tories with a passion, they care nothing for anyone earning less than about 50k/year, they have no understanding of poverty or unemployment or the benefits system. They don't understand state education or healthcare because they don't use it.\n \n What I've noticed is how much emphasis the media of putting on the BNP, yes they're fascists but they won 13 seats, the Greens gained more than that and hardly get a mention. The media concentrating on the fascists just gives them more publicity and pushes their vote up.", 
   {}, 
   211357, 
   null, 
   1146824520.0
  ], 
  [
   211398, 
   null, 
   "peteratwar", 
   "Surprised to see you still using those bigoted outdated stereotypes Jo. Thought better of you.\n \n Considering the abject failure in almost every respect of Blair's Government (about the only good thing has been the giving of control of the Bank Rate to the Bank of England) and a Government as covered in sleaze as John Major's was, if not more so then voting for the Conservatives is a reasonable option. Certainly if your serious about having good Government.\n \n A very healthy number of people seem to think so and the vast majority will be normal hard working individuals the vast majority of whom would be on perfectly normal salaries.", 
   {}, 
   211389, 
   null, 
   1146844260.0
  ], 
  [
   211426, 
   null, 
   "Jo Bennett", 
   "Given that the tories were overtly racist, in their policies and rhetoric, in the general election last year, and for the previous 2 centuries, I'm not overly inclined to think that they've changed. The tory party may have working class supporters, some bought in the Thatcher era by right to buy, which screwed and is continuing to screw those currently in need of local authority housing, but its interests, like new labour's (only more so) are those of big business. I'm not too young to remember tory cuts to healthcare and education, or the poll tax, or the cuts in income tax paid for by increases in regressive taxation. Nothing I've seen suggests that the tories have changed or are likely to change. Their recent green gloss has been nothing more than a publicity stunt, they've shown no commitment to getting cars and trucks off the road, to improving public transport, to making the tough choices that need to be made to implement renewable energy. I don't trust Blair as far as I can throw him, I don't trust Cameron enough to even pick him up. While we're on the subject lib dem insiders suggest Ming Cambell's a nasty piece of work as well, and the lib dems have been swinging too much to the right recently anyway. I've voted Green at every opportunity since I turned 18.", 
   {}, 
   211398, 
   null, 
   1146858300.0
  ], 
  [
   211741, 
   null, 
   "peteratwar", 
   "No I wouldn't say they were overtly rascist in the last election although it is unfortunate that ANY attempt to discuss the issues is met with a blanket insult regardless. Please be aware by the way that I have long worked in a multi-cultural environment both here and abroad and that relatives of mine are from ethnic backgrounds.\n \n I cannot believe that a 2 centuries old mindset and environment has any relevance today. What happened then happened them when ethics and beliefs were what they were then. Still I suppose it all still rumbles on see Northern Ireland.\n \n I cannot but agree with you on the state of the other parties & personally feel that the state of the parties is the worst I have seen in many a long year.\n \n My own vote goes to the party I think can do the least harm; I have no trust in any of them doing the most good.", 
   {}, 
   211426, 
   null, 
   1147103640.0
  ], 
  [
   212676, 
   null, 
   "Phunting", 
   "First is, what possible reason could you have for voting for that bunch of closet racists and lying toerags? emoticon_confused If you're going to engage in a protest vote, at least give it to someone who can't make much out of it. Sorry if that sounds a bit harsh, but I despise the tories with a passion, they care nothing for anyone earning less than about 50k/year, they have no understanding of poverty or unemployment or the benefits system. They don't understand state education or healthcare because they don't use it.\n \n What I've noticed is how much emphasis the media of putting on the BNP, yes they're fascists but they won 13 seats, the Greens gained more than that and hardly get a mention. The media concentrating on the fascists just gives them more publicity and pushes their vote up.\nApologies for delay, been away a few days. \n \n What reason? Well firstly, I voted according to local council issues and not just as a popularity contest for whichever joker in Westminster. The local Labour party here has been increasingly ineffectual IMHO, with nothing but a vague smugness to them. The local Tories have been heavily involved in campaigning on various issue throughout the community, hence they got my vote.\n \n That said I'm very close to voting Tory next general election. I'm centre right, hence have voted Labour previously. I certainly wouldn't say the Tories were any more 'lying toe rags' than Labour, or any other politician.\n \n The racism issue has been the biggest off put to me in the past, I had huge issues over Tory policy on immigration and asylum. However I'm reasonably hopeful that under Cameron such things will not become policy.", 
   {}, 
   211389, 
   null, 
   1147482840.0
  ], 
  [
   212695, 
   null, 
   "Steeeeve", 
   "I always like listening to other countries talk about \"center right\" which means to the left of Howard Dean over here. I can't imagine what would happen if you got one of our \"center right\" people in office over there.", 
   {}, 
   212676, 
   null, 
   1147490940.0
  ], 
  [
   212730, 
   null, 
   "Jo Bennett", 
   "I know what you mean Steeve, I think the same way about what you guys call the far left. In all honesty I think the right wing in the US would get laughed out of the polling station, especially the fundies.\n \n @ Phunting, if it's right wing economic policies, surely the lib dems are more your kettle of fish, given the orange book etc. As far as Cameron goes I don't expect the rest of the party to change with him anymore than the labour party changed with Blair.", 
   {}, 
   212695, 
   null, 
   1147520880.0
  ], 
  [
   212734, 
   null, 
   "Phunting", 
   "@ Phunting, if it's right wing economic policies, surely the lib dems are more your kettle of fish, given the orange book etc. As far as Cameron goes I don't expect the rest of the party to change with him anymore than the labour party changed with Blair.\nBut the Labour party did change totally with Blair. Or at least 'New Labour'. Possibly you're right, we'll see how it goes and if it looks like the Tories have actually changed.\n \n Actually no, I hate right wing economics. In that respect I am totally socialist.", 
   {}, 
   212730, 
   null, 
   1147524600.0
  ], 
  [
   212735, 
   null, 
   "Phunting", 
   "I know what you mean Steeve, I think the same way about what you guys call the far left. In all honesty I think the right wing in the US would get laughed out of the polling station, especially the fundies.\n \nUnless they stood in Barking...", 
   {}, 
   212730, 
   null, 
   1147524720.0
  ], 
  [
   212779, 
   null, 
   "Jo Bennett", 
   "But the Labour party did change totally with Blair. Or at least 'New Labour'. Possibly you're right, we'll see how it goes and if it looks like the Tories have actually changed.\n \n Actually no, I hate right wing economics. In that respect I am totally socialist.\n\n \n So in what sense are you centre-right then? If it's the racism that puts you off the tories, then what do you have left? With ASBOs and the criminalisation of protest I can't imagine you want something more right wing on the law and order front (if you do then I'm gonig to suggest your not so much centre right as far right ;) ).\n \n The labour party hasn't changed. Talk to grassroots labour supporters and you'll find most of them want better trade union rights, higher income taxes on high earners, and a hell of a lot of them are anti-nuclear. What's changed is that they're disillusioned with this labour government, which rather than being red, has been a sort of tepid purple. The same thing will happen to the tories under Cameron, they'll be happy for a while if it brings them victory, but when they've just got more Blair out of it, they'll start to get angry. The party leaderships, almost by necessity, represent one extreme of their party.\n \n On Barking, you have to recall the the US fascists are usually economically right wing, low tax et al, whereas the BNP are more traditional nazis, mainly authoritarian with fairly left wing economic positions. Plus their claims to Christianity are far less fervent than those in the US.", 
   {}, 
   212734, 
   null, 
   1147550220.0
  ], 
  [
   212791, 
   null, 
   "Steeeeve", 
   "I know what you mean Steeve, I think the same way about what you guys call the far left. In all honesty I think the right wing in the US would get laughed out of the polling station, especially the fundies.\n \n @ Phunting, if it's right wing economic policies, surely the lib dems are more your kettle of fish, given the orange book etc. As far as Cameron goes I don't expect the rest of the party to change with him anymore than the labour party changed with Blair.\n\n \n Yet we are scrapping by just as well as other countries...so can't be but so bad :)", 
   {}, 
   212730, 
   null, 
   1147561920.0
  ], 
  [
   212797, 
   null, 
   "Jo Bennett", 
   "Yeah, you must be really proud of having an infant mortality and literacy rate worse than Cuba :p", 
   {}, 
   212791, 
   null, 
   1147563180.0
  ], 
  [
   212870, 
   null, 
   "Steeeeve", 
   "Yeah, you must be really proud of having an infant mortality and literacy rate worse than Cuba :p\n\n \n You aren' that much farther down so I wouldn't be bragging. I'd hate to pull out stats where the UK fails.", 
   {}, 
   212797, 
   null, 
   1147623840.0
  ], 
  [
   212915, 
   null, 
   "Phunting", 
   "Yeah, you must be really proud of having an infant mortality and literacy rate worse than Cuba :p\nErr actually the US has the same literacy rate as us: 99.9%. Cuba has 96.9%.", 
   {}, 
   212797, 
   null, 
   1147645620.0
  ], 
  [
   212922, 
   null, 
   "Phunting", 
   "So in what sense are you centre-right then? If it's the racism that puts you off the tories, then what do you have left? With ASBOs and the criminalisation of protest I can't imagine you want something more right wing on the law and order front (if you do then I'm gonig to suggest your not so much centre right as far right ;) ).\nI do, in a way. Obviously I don't approve of the anti-free speach element to the new terror laws, but I certainly believe in harsher sentencing. I also agree with the Tories on education, I believe in higher budget for the armed forces, and yes, I'm pro-monarchy.\n \n Does this make me far right? I don't think so. Especially as I also believe in legalization of drugs, high taxation, more open immigration, Europe, National Health. In the end I think I have strong left and right views, so average out in the centre!\n \n \n \nThe labour party hasn't changed. Talk to grassroots labour supporters and you'll find most of them want better trade union rights, higher income taxes on high earners, and a hell of a lot of them are anti-nuclear. What's changed is that they're disillusioned with this labour government, which rather than being red, has been a sort of tepid purple. The same thing will happen to the tories under Cameron, they'll be happy for a while if it brings them victory, but when they've just got more Blair out of it, they'll start to get angry. The party leaderships, almost by necessity, represent one extreme of their party.\nMaybe. But I can't see Labour ever going back as far left, even post-Tony. In the same way I think the Tories will be pulled towards the centre too.\n \n \n \nOn Barking, you have to recall the the US fascists are usually economically right wing, low tax et al, whereas the BNP are more traditional nazis, mainly authoritarian with fairly left wing economic positions. Plus their claims to Christianity are far less fervent than those in the US.\nOf course, I do understand they are two very different forms of right-wing. I was just being flippant.", 
   {}, 
   212779, 
   null, 
   1147646640.0
  ], 
  [
   212924, 
   null, 
   "Jo Bennett", 
   "I do, in a way. Obviously I don't approve of the anti-free speach element to the new terror laws, but I certainly believe in harsher sentencing. I also agree with the Tories on education, I believe in higher budget for the armed forces, and yes, I'm pro-monarchy.\n \n Does this make me far right? I don't think so. Especially as I also believe in legalization of drugs, high taxation, more open immigration, Europe, National Health. In the end I think I have strong left and right views, so average out in the centre!\n \n\n \n Labour has never been particularly republican, so the monarchy thing is hardly relevant. High sentences for what it the question? If you mean higher sentences for eg rapists then I wouldn't say that's a right wing position. If for burglars then I'd say it was. Basically I'd suggest that protection of people is a leftie thing, protection of property a rightie thing. Also depends on what you mean by harsher. Do you really think that locknig people up is effective at reducing crime? (except in the most obvious sense) Surely community sentences make more sense for offenders who aren't dangerous to people? We already have one of the highest military spends in Europe, what on earth do you want to spend more money on?\n \n It's interesting to talk to someone who has an unusual mix of views. :)", 
   {}, 
   212922, 
   null, 
   1147648500.0
  ], 
  [
   213268, 
   null, 
   "Phunting", 
   "Labour has never been particularly republican, so the monarchy thing is hardly relevant.\nTrue. I was just listing general right-wing is values. Though that said Lords reform could be said to be closely linked to the subject.\n \n \n \nHigh sentences for what it the question? If you mean higher sentences for eg rapists then I wouldn't say that's a right wing position. If for burglars then I'd say it was. Basically I'd suggest that protection of people is a leftie thing, protection of property a rightie thing. Also depends on what you mean by harsher. Do you really think that locknig people up is effective at reducing crime? (except in the most obvious sense) Surely community sentences make more sense for offenders who aren't dangerous to people?\nAgreed. I'm not of the 'bang 'em up' camp at all. I agree with community orders and custodial orders where appropriate. I just feel that terms should be increased. That in general a sentence, especially when you take into consideration reductions for good behavior, is not enough of a deterrent. The current scrabble for headlines by Labour seems to vindicate this view somewhat.\n \n \n \nWe already have one of the highest military spends in Europe, what on earth do you want to spend more money on?\n Guns that can shoot properly. Adequate protection for troops and aircraft in the field. An end to the list of MoD equipment that has been brought into service on a tight budget and then shown to be majorly flawed...\n \n \nIt's interesting to talk to someone who has an unusual mix of views. :)\nIndeed. It's a bit annoying having such a mix of views as I generally disagree with every party about some major policy point. Makes voting tricky. Then again not trusting all the parties is probably a sensible thing anyway... :p", 
   {}, 
   212924, 
   null, 
   1147818840.0
  ], 
  [
   213281, 
   null, 
   "Jo Bennett", 
   "Guns that can shoot properly. Adequate protection for troops and aircraft in the field. An end to the list of MoD equipment that has been brought into service on a tight budget and then shown to be majorly flawed...\n \n\n \n Except MOD equipment usually runs heavily over budget and is STILL faulty (Chinook helicopters anyone?). The cost of small arms is tiny compared to the cost of renewing or replacing Trident, the obvious solution is to scrap the submarine based penis extension for the prime minister and spend money on low tech stuff like language training, and various other skills and equipment required for peace keeping, which is our army's main role. These sorts of things cost a lot less than the headline grabbing weapons systems and big shiny tanks.\n \n On crime, I think the reason sentences are not a deterrent is not because they are not long enough (I doubt the average rapist weighs up 8 years in jail as being worth what he wants to do) but that criminals don't expect to be caught. The answer then has to be to deal with the social issues that make criminal behaviour more likely, and work on improving conviction rates. We have the highest prison population in Europe and it hasn't had much impact on crime.", 
   {}, 
   213268, 
   null, 
   1147824660.0
  ], 
  [
   213298, 
   null, 
   "Phunting", 
   "Except MOD equipment usually runs heavily over budget and is STILL faulty (Chinook helicopters anyone?). The cost of small arms is tiny compared to the cost of renewing or replacing Trident, the obvious solution is to scrap the submarine based penis extension for the prime minister and spend money on low tech stuff like language training, and various other skills and equipment required for peace keeping, which is our army's main role. These sorts of things cost a lot less than the headline grabbing weapons systems and big shiny tanks.\nMostly because the budget isn't sufficient in the first place, so the job is bodged and we end up with the worst of both worlds: expensive and sh*te.\n \n Again, agreed. One of the truest quotes I've ever heard is from Yes, Minister:\n \n \nSir Humphrey: Bernard, what is the purpose of our defence policy? \n Bernard: To defend Britain. \n Sir Humphrey: No, Bernard. It is to make people believe Britain is defended. \n Bernard: The Russians? \n Sir Humphrey: Not the Russians, the British! The Russians know it is not. \nAnd I agree with Humpy that this is an important factor. Which is why we need a defence budget that can cover the headline grabbing placebos and actually do the job. Not just the former as we have now...\n \n \n \nOn crime, I think the reason sentences are not a deterrent is not because they are not long enough (I doubt the average rapist weighs up 8 years in jail as being worth what he wants to do) but that criminals don't expect to be caught. The answer then has to be to deal with the social issues that make criminal behaviour more likely, and work on improving conviction rates. We have the highest prison population in Europe and it hasn't had much impact on crime.\nI think it is both. Obviously it would be wonderful to have the conviction rate go up. However custody is still a deterrent, to an extent. Yes there will be a point when the crime will be committed no matter the sentence, and yes no criminal ever thinks they will be caught. But I still believe in order for it to be a more effective deterrent the initial sentencing needs to be harsher.", 
   {}, 
   213281, 
   null, 
   1147827300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  UK Local Elections", 
  "url": "http://www.4forums.com/political/government-debates/8068-uk-local-elections.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 8068, 
  "discussion_files": [
   [
    "1306.html", 
    "http://www.4forums.com/political/government-debates/8068-uk-local-elections-print.html"
   ], 
   [
    "1307.html", 
    "http://www.4forums.com/political/government-debates/8068-uk-local-elections-2-print.html"
   ]
  ], 
  "identifier": 8068
 }
]