[
 [
  [
   89, 
   null, 
   "admin", 
   "Do you support the Privatization of Social Security? \n \n http://www.youdebate.com/DEBATES/social_security_privatization.HTM", 
   {
    "post_info": {
     "post_title": "Privatization of Social Security"
    }
   }, 
   null, 
   null, 
   1043628420.0
  ], 
  [
   6106, 
   null, 
   "wjim1269", 
   "If we privatize Social Security, then how will we pay for the benefits that are to be distributed now?", 
   {}, 
   89, 
   null, 
   1049422620.0
  ], 
  [
   12783, 
   null, 
   "bernak", 
   "Fact, participation in Social Security is VOLUNTARY in he 50 states!\n Fact, FICA taxes are imposed on the income of every individual. They are NOT IMPOSED on the WAGES of every individual (see 26USC 3101 (a) & (b)). [For all income tax acts of Congress, the US Supreme court defined income to be corporate profit] \n Fact, those who work for themselves are not made LIABLE or REQUIRED to pay by law, the \"self employment tax\".\n \n \n As far plans on how to privatize, see CATO.org or LP.org for a plans.\n \n Finance knowledgeable retirees love the idea of privatizing Social Security. In 2000 I attended one of my CONgressman's town hall meetings held in Sun City Center, Florida (a retirement community) and asked him to support Social Security privatization and outlined CATO's plan. THE RETIREES applauded and supported the idea. I expected to be chased out instead of applauded.", 
   {}, 
   6106, 
   null, 
   1060183500.0
  ], 
  [
   37829, 
   null, 
   "Tastyfish", 
   "How do you mean, essentially have medical insurance for loss of job? It would have to depend on the unemployment level, as those unemployed would be unable to afford the insurance that they need to get them money while they search for a job. \n Or something more like the government making people work for the employment benefits they would normally recieve (or in addition to a lower level), building roads and the like- not sure I think this would work without some serious modification as it is going to make it harder for them to find a job (unless unemployment is high and they are unlikely to find one at all) and would be uncompetive toward construction companies that would lead to more unemployment and handing a cheap labour force over to businesses would be a very bad move and a political impossiblity ('the return of slavery' or the treating of US citizens like third world ones).\n \n Best scheme I would think would be to have social security payments dependant on the attendance or completion (if studying from home because of children or disability) of special courses. Increasing their education will make it easier to get a job and the benefits of an educated population are numerous.", 
   {}, 
   12783, 
   null, 
   1078372320.0
  ], 
  [
   37862, 
   null, 
   "daewoo", 
   "How do you mean, essentially have medical insurance for loss of job? It would have to depend on the unemployment level, as those unemployed would be unable to afford the insurance that they need to get them money while they search for a job. \n Or something more like the government making people work for the employment benefits they would normally recieve (or in addition to a lower level), building roads and the like- not sure I think this would work without some serious modification as it is going to make it harder for them to find a job (unless unemployment is high and they are unlikely to find one at all) and would be uncompetive toward construction companies that would lead to more unemployment and handing a cheap labour force over to businesses would be a very bad move and a political impossiblity ('the return of slavery' or the treating of US citizens like third world ones).\n \n Best scheme I would think would be to have social security payments dependant on the attendance or completion (if studying from home because of children or disability) of special courses. Increasing their education will make it easier to get a job and the benefits of an educated population are numerous.\n\n \n I think you are \"on the wrong page.\"\n \n Social security in America is a retirement fund that is (very badly) administered by the government. For years people have said \"I could manage the money better myself\" . Now, some folks are suggesting we get the chance to try. \n \n You might have a little trouble following this one being from England, Tastyfish. I have found that often times people from other countries have a difficult time understanding what a huge, inefficient thing the US government is. WE have law enforcement agencies that can't enforce the law, we spend billions on social programs, but half that money goes just to administer them. We spend billions on education so our high school gradutes can be as smart as a French 8th graders. The goverment screwing things up is almost a cliche in america (along with a politician being honest).\n \n Personally, I am all for it. IF they don;t privatise social security, I would suggest that people take it upon themselves to set their own saving plan up. I can see the downside to te privitizsation debate, like a market crash wiping out a bunch of peoples retirement. whne we all know that is the job of the CEO's of huge corporations (had to throw in the enron reference).\n \n Seriously, even if it means having to live on 5-10% less, at least there is some security for when you retire. NASA arguably has the best and brightest folks that the American governmet has to offer. They spent billions of dollars putting the hubble in orbit and didn't think to test it before they shipped it to space. IF these are the brightest in the US Government, do you really want them to have total control over your retirement? I think not. 5% of every paycheck properly invested = big bucks when you retire. Even if you don't know a yen from a shilling, there are financial advisors that can help you out.", 
   {}, 
   37829, 
   null, 
   1078388700.0
  ], 
  [
   37870, 
   null, 
   "Eddie", 
   "Hmmm.. I was playing around with this idea about the private pension funds and I realised that privatising social security could be turned into almost a revolution of sort. What if the labour movement offered an alternative to profit maximizing funds and instead administered funds where the actual economic influence was the key? A highly contested and controversial issue in my country has been \"löntagarfonder\" (wage earners fund) where it was proposed that the government would purchase shares in all larger corporations, and give the influence to the unions representing the employed. And with time, the ownership and control of the means of production would be put in the hands of \"the people\". \n \n If each and every union would organise such a fund for its members with the intention to take control over the different sectors, and members could invest any share of their pension into these funds, the idea of wage earners funds could actually be achieved. However, it would never reach the scope of the proposed governmental wage earners funds as the fund would be \"raided\" everytime someone retired. But it could still be a large source of influence, shifted from the elite into the hands of the people.\n \n I`m starting to like privatised social security more and more ;) Of course, this is still merely a socialist wet dream, but if the larger unions could be persuaded, the smaller ones would probably do the same.", 
   {}, 
   37862, 
   null, 
   1078399200.0
  ], 
  [
   37885, 
   null, 
   "Tastyfish", 
   "Seems odd that they would use the same word for two different things in two different countries but yeah looking back over the page I see your right, though it was referring to pensions and 'social security'\n \n \"You might have a little trouble following this one being from England, Tastyfish. I have found that often times people from other countries have a difficult time understanding what a huge, inefficient thing the US government is. WE have law enforcement agencies that can't enforce the law, we spend billions on social programs, but half that money goes just to administer them. We spend billions on education so our high school gradutes can be as smart as a French 8th graders. The goverment screwing things up is almost a cliche in america (along with a politician being honest).\"\n hehe, no problem believing this, seems almost universal except with us we still keep voting them back in due to no serious opposition at the moment.\n \n Our government is thinking of something like this as well, the increase in the average lifespan is being treated very seriously and teh age of retirment and the pension scheme are being looked at (governemnt pensions being phased out).The predicted workers/nonworkers ration for europe is starting to look quite bleak over the next few decades. Will see if I can find any of the european ideas on this matter (where social security is generally a lot higher, France and Germany spend way more than we even do).", 
   {}, 
   37870, 
   null, 
   1078411380.0
  ], 
  [
   37931, 
   null, 
   "bernak", 
   "Social Security is not a pension fund as there is NO FUND. The monies collected go into the general fund and monies paid out come of the general fund. This fits the classic Ponzi scheme (a.k.a. pyramid scheme) definition.\n \n In the United States it is best to work for yourself. That way you have no need to play the withholding games nor the filing of the annual confessions-- more commonly referred to as \"tax returns\".", 
   {
    "post_info": {
     "post_title": "social security is not a pension fund"
    }
   }, 
   37885, 
   null, 
   1078420680.0
  ], 
  [
   38013, 
   null, 
   "daewoo", 
   "Seems odd that they would use the same word for two different things in two different countries but yeah looking back over the page I see your right, though it was referring to pensions and 'social security'\n \n \"You might have a little trouble following this one being from England, Tastyfish. I have found that often times people from other countries have a difficult time understanding what a huge, inefficient thing the US government is. WE have law enforcement agencies that can't enforce the law, we spend billions on social programs, but half that money goes just to administer them. We spend billions on education so our high school gradutes can be as smart as a French 8th graders. The goverment screwing things up is almost a cliche in america (along with a politician being honest).\"\n hehe, no problem believing this, seems almost universal except with us we still keep voting them back in due to no serious opposition at the moment.\n \n Our government is thinking of something like this as well, the increase in the average lifespan is being treated very seriously and teh age of retirment and the pension scheme are being looked at (governemnt pensions being phased out).The predicted workers/nonworkers ration for europe is starting to look quite bleak over the next few decades. Will see if I can find any of the european ideas on this matter (where social security is generally a lot higher, France and Germany spend way more than we even do).\n\n \n I am certainly glad to hear that America does not have the monopoly on XXXXXX in government. Sometimes, when I see or hear about the newest bit of idiocy our government has instituted, I wonder if maybe a dictatorship wouldn't be better. We wouldn't need anybody special, just any guy named bob would do. At least then you know who the idiot is. As things are right now, the idiocy is spread through so many levels and so many people that it is difficult to pinpoint who is coming up with the really stupifd ideas, and who is just carrying out orders.\n \n \n We have the same problem in the US, we keep having to elect the same folks. We have two choices, rich white republicans who are going to sell out the second they hit office, or rich white democrats that are going to sell out the second they hit office. There is no \"average guy\" option, and there is certainly NOT a \"not going to sell out\" option.", 
   {}, 
   37885, 
   null, 
   1078428720.0
  ], 
  [
   44201, 
   null, 
   "georged", 
   " In the United States it is best to work for yourself. That way you have no need to play the withholding games nor the filing of the annual confessions-- more commonly referred to as \"tax returns\".\n\n \n There are two major problems facing personal investment replacement of government social security retirement:\n \n The US has the lowest per-capita savings and highest per-capita personal debt of any nation reporting to the IMF. How is this countered when the current administration drives consumer spending to achieve polished GDP numbers for political purposes. Like our corporations and government, we have a current mentality of instant gratification, so what's left to invest?\n \n Current SS payments will continue, no politician would dream of committing political suicide with the baby boomers, so any worker/employer would be burdened with current and future withholdings, leaving their remaining net income subject to cost of living and saving for retirement. Any amounts directed to retirement funds will lower tax revenues, lower consumer purchases and could eventually crash our fragile service economy.\n \n A vicious circle few politicians are willing to face.", 
   {}, 
   37931, 
   null, 
   1082129400.0
  ], 
  [
   44208, 
   null, 
   "Haulingboat", 
   "There are two major problems facing personal investment replacement of government social security retirement:\n \n The US has the lowest per-capita savings and highest per-capita personal debt of any nation reporting to the IMF. How is this countered when the current administration drives consumer spending to achieve polished GDP numbers for political purposes. Like our corporations and government, we have a current mentality of instant gratification, so what's left to invest?\n \n Current SS payments will continue, no politician would dream of committing political suicide with the baby boomers, so any worker/employer would be burdened with current and future withholdings, leaving their remaining net income subject to cost of living and saving for retirement. Any amounts directed to retirement funds will lower tax revenues, lower consumer purchases and could eventually crash our fragile service economy.\n \n A vicious circle few politicians are willing to face.\n\n \n Our only hope for change is a president in his second term willing enough to do the right thing and correct the inevitable finacial disaster that lies ahead.", 
   {}, 
   44201, 
   null, 
   1082134560.0
  ], 
  [
   44215, 
   null, 
   "Waxy", 
   "Our only hope for change is a president in his second term willing enough to do the right thing and correct the inevitable finacial disaster that lies ahead.\n\n \n I agree that something needs to be done, up here too. I also agree that no one is going to do it.\n \n Problem is, the president still has a responsibility to his party. No president is going to make a move that will prevent his party from holding office for the next 20 years just because he's on the way out.\n \n Waxy", 
   {}, 
   44208, 
   null, 
   1082137620.0
  ], 
  [
   44217, 
   null, 
   "Haulingboat", 
   "I agree that something needs to be done, up here too. I also agree that no one is going to do it.\n \n Problem is, the president still has a responsibility to his party. No president is going to make a move that will prevent his party from holding office for the next 20 years just because he's on the way out.\n \n Waxy\n\n In a matter of very few years, politicians will have no choice but to address the problem. It will glaring them in the face when hundreds of thousands of retirees what their checks and there is no till from which to pay them.", 
   {}, 
   44215, 
   null, 
   1082138340.0
  ], 
  [
   44482, 
   null, 
   "georged", 
   "In a matter of very few years, politicians will have no choice but to address the problem. It will glaring them in the face when hundreds of thousands of retirees what their checks and there is no till from which to pay them.\n\n \n With our decrease in tax revenues, yet unfunded Medicare prescription program and continued economic decline, that gap is rapidly closing in on us. \n \n I think whatever administration is in power at the time that crisis becomes inevitable will do a buyout on SS contributions made to that date by those not collecting SS benefits. The buyout will be funded with treasury issues not redeemable until say age 72, effectively prolonging that part of the crisis. Employee and employer SS and Medicare contributions will continue until an 'unspecified date' 'due to the changeover' and the fact that they're now going into the general fund for government operating expenses. Good luck future retirees on mostly fixed income jobs! You're going to need it as we're spending your future now. You'll also be saddled with the interest on that.", 
   {}, 
   44217, 
   null, 
   1082307180.0
  ], 
  [
   45255, 
   null, 
   "bernak", 
   "I suspect that you and I are using different definitions for some terms you used. You also make an assumption of liability/requirement for which I cannot find the apropriate statute. These differences need to be reconciled in order to conduct a meaningful discussion.\n \n 1. What law(s) [statute(s)] REQUIRE or make liable private companies or proprietors for federal withholding or SS payments?\n \n 2. Please, define the term \"income\" as it applies to all income tax acts of the U.S. Congress.\n \n 3. Please, define \"employer\" (see 26 USC 3401) as is used for withholding.\n \n \n \n Current SS payments will continue, no politician would dream of committing political suicide with the baby boomers, so any worker/employer would be burdened with current and future withholdings, leaving their remaining net income subject to cost of living and saving for retirement. Any amounts directed to retirement funds will lower tax revenues, lower consumer purchases and could eventually crash our fragile service economy.\n \n A vicious circle few politicians are willing to face.[/QUOTE]", 
   {}, 
   44201, 
   null, 
   1082617200.0
  ], 
  [
   45380, 
   null, 
   "Haulingboat", 
   "I have resigned from expecting the government to fund my retirement. I do not expect anyone else to fund my retirement but me. I have taken the appropriate steps to ensure a comfortable retirement for my wife and I. That being said, I wish a politician would belly up to the table and address the impending crunch.", 
   {}, 
   45255, 
   null, 
   1082673720.0
  ], 
  [
   45396, 
   null, 
   "bernak", 
   "I have resigned from expecting the government to fund my retirement. I do not expect anyone else to fund my retirement but me. I have taken the appropriate steps to ensure a comfortable retirement for my wife and I. That being said, I wish a politician would belly up to the table and address the impending crunch.\n\n \n My previous CONgressman esentially stated at a town hall meeting that he intends to keep it for power purposes.", 
   {}, 
   45380, 
   null, 
   1082678340.0
  ], 
  [
   100534, 
   null, 
   "kettlecooked", 
   "A great (pro-Bush) website that helps explain his plans (in case anybody wants to look at the Bush side more deeply) is www.progressforamerica.org", 
   {
    "post_info": {
     "post_title": "A usefull website"
    }
   }, 
   45255, 
   null, 
   1111529700.0
  ], 
  [
   100757, 
   null, 
   "Steeeeve", 
   "I really hate the democrats view on SS....\"do it our way or don't do anything\"", 
   {}, 
   100534, 
   null, 
   1111599240.0
  ], 
  [
   100840, 
   null, 
   "kettlecooked", 
   "The worst part is that I've had so many Democrats tell me that Bush is all about \"my way or the highway,\" and yet he is the one proposing bi-partisan reform. Why can't they bargain a little too?", 
   {
    "post_info": {
     "post_title": "The worst part about democrats"
    }
   }, 
   100757, 
   null, 
   1111611660.0
  ], 
  [
   100897, 
   null, 
   "Michele", 
   "The worst part is that I've had so many Democrats tell me that Bush is all about \"my way or the highway,\" and yet he is the one proposing bi-partisan reform. Why can't they bargain a little too?\n\n \n Bargin a little? Bargin with what? He has suggested nothing at all except private accounts with no way to pay for them, and no details on what else to do since private accounts do nothing to solve the problem.\n \n There are only to ways to solve the problem, cut benefits or raise taxes.\n \n I think it could be fixed pretty well by doing a means test on after retirement income. Bill Gates doesn't need Social Security. Also, drop the cap on income or raise it. Ninety Thousand is too low.", 
   {
    "post_info": {
     "post_title": "Are you kidding?"
    }
   }, 
   100840, 
   null, 
   1111622100.0
  ], 
  [
   100905, 
   null, 
   "georged", 
   "Bargin a little? Bargin with what? He has suggested nothing at all except private accounts with no way to pay for them, and no details on what else to do since private accounts do nothing to solve the problem.\n \n There are only to ways to solve the problem, cut benefits or raise taxes.\n \n I think it could be fixed pretty well by doing a means test on after retirement income. Bill Gates doesn't need Social Security. Also, drop the cap on income or raise it. Ninety Thousand is too low.\n\n \n Don't forget stopping diversion of 'surplus' SS funds to general funds so deficits appear smaller.", 
   {}, 
   100897, 
   null, 
   1111623900.0
  ], 
  [
   100986, 
   null, 
   "Steeeeve", 
   "Bargin a little? Bargin with what? He has suggested nothing at all except private accounts with no way to pay for them, and no details on what else to do since private accounts do nothing to solve the problem.\n \n There are only to ways to solve the problem, cut benefits or raise taxes.\n \n I think it could be fixed pretty well by doing a means test on after retirement income. Bill Gates doesn't need Social Security. Also, drop the cap on income or raise it. Ninety Thousand is too low.\n\n \n \n Who are you to say what Bill Gates does or does not need? Get rid of SS all together :) thats a good solution.", 
   {}, 
   100897, 
   null, 
   1111652940.0
  ], 
  [
   101451, 
   null, 
   "Cone", 
   "I've come up with a permanent solution to the social security problem...\n \n Seeing as how the average life expectancy when social security originated was 69, we ought to consider ways in which we can return to that life expectancy average.\n \n Ways in which we could do this are numberless. \n \n 1) We could start by euthenizing all mentally ill patients over the age of 69. \n \n 2) We could then move to those who need any assistance whatsoever to live past the age of 69.\n \n you get the idea. Basically if you're over 69, you are a liability and are bankrupting our social security system.\n \n You'll have to forgive me, but I'm a bit upset today over the fact that Terri Schiavo, simply because she is \"abnormal\" is considered less of a human being than a dog or cat would be considererd. I'm sure I've ticked some people off now, at least I hope so.", 
   {
    "post_info": {
     "post_title": "A Guaranteed Fix"
    }
   }, 
   100986, 
   null, 
   1111796040.0
  ], 
  [
   101471, 
   null, 
   "Eddie", 
   "Who are you to say what Bill Gates does or does not need? Get rid of SS all together :) thats a good solution.\n\n \n If we do assume that marginal utility of consumtion is falling (which is a commonly accepted assumption), one could easlily say that the utility created by Bill Gates SS dollars would be higher if you used them for wallpaper in a public restroom then gave them to Mr Gates himself :p", 
   {}, 
   100986, 
   null, 
   1111800360.0
  ], 
  [
   101484, 
   null, 
   "georged", 
   "If we do assume that marginal utility of consumtion is falling (which is a commonly accepted assumption), one could easlily say that the utility created by Bill Gates SS dollars would be higher if you used them for wallpaper in a public restroom then gave them to Mr Gates himself :p\n\n \n Ah, you've been folowing the dollar, US tax revenue base and deficit spending?", 
   {}, 
   101471, 
   null, 
   1111804380.0
  ], 
  [
   101582, 
   null, 
   "Alan Ryan", 
   "I've come up with a permanent solution to the social security problem...\n \n Seeing as how the average life expectancy when social security originated was 69, we ought to consider ways in which we can return to that life expectancy average.\n \n Ways in which we could do this are numberless. \n \n 1) We could start by euthenizing all mentally ill patients over the age of 69. \n \n 2) We could then move to those who need any assistance whatsoever to live past the age of 69.\n \n you get the idea. Basically if you're over 69, you are a liability and are bankrupting our social security system.\n \n \n \n I appreciate your irony here: something very like the spirit of your \"solution\" has been offered before - see \"A Modest Proposal\" by Jonathan Swift. :(", 
   {}, 
   101451, 
   null, 
   1111852380.0
  ], 
  [
   101588, 
   null, 
   "greg 79 f150", 
   "I've come up with a permanent solution to the social security problem...\n \n Seeing as how the average life expectancy when social security originated was 69, we ought to consider ways in which we can return to that life expectancy average.\n \n Ways in which we could do this are numberless. \n \n 1) We could start by euthenizing all mentally ill patients over the age of 69. \n \n 2) We could then move to those who need any assistance whatsoever to live past the age of 69.\n \n you get the idea. Basically if you're over 69, you are a liability and are bankrupting our social security system.\n \n You'll have to forgive me, but I'm a bit upset today over the fact that Terri Schiavo, simply because she is \"abnormal\" is considered less of a human being than a dog or cat would be considererd. I'm sure I've ticked some people off now, at least I hope so.\n\n \n \n It is perfectly normal for one to be upset over Terri's life or lack of, that is expected. Now ....\n \n On a side note, with your solution above to the SS system problems, do you think you will REALLY enjoy your 68 th birthay party that year ?", 
   {}, 
   101451, 
   null, 
   1111854120.0
  ], 
  [
   101641, 
   null, 
   "Steeeeve", 
   "the 68th birthday party would have to be pretty darn good. I would suggest hang gliding, jumping out of an airplane, robbing a bank....things like that.", 
   {}, 
   101588, 
   null, 
   1111864500.0
  ], 
  [
   101645, 
   null, 
   "georged", 
   "the 68th birthday party would have to be pretty darn good. I would suggest hang gliding, jumping out of an airplane, robbing a bank....things like that.\n\n \n Relocation.", 
   {}, 
   101641, 
   null, 
   1111864560.0
  ], 
  [
   101657, 
   null, 
   "Steeeeve", 
   "HAHA..not with this plan!!! you see...at birth we will plant a tracking device on you..so if you leave the country past your 68th birthday a tracking devicew will go off and you will be shot on site.", 
   {}, 
   101645, 
   null, 
   1111865280.0
  ], 
  [
   101700, 
   null, 
   "lord tammerlain", 
   "Why not just reallocate the natural resources of the surplus population, ie the retired, disabled, and chronically unemployed. Instead of spending societies resources one these leeches of society, using them as fertilizer to finally produce some good for society.\n \n In this way none of your tax dollars will be used to help the needy and you will no longer have to step over them on the way to work as they beg for food.", 
   {}, 
   101657, 
   null, 
   1111873620.0
  ], 
  [
   101721, 
   null, 
   "Steeeeve", 
   "WHy don't we just do without the whole \"no murder\" thing...we can just kill anyone that 5 or more people feel is unfit.", 
   {}, 
   101700, 
   null, 
   1111879440.0
  ], 
  [
   102522, 
   null, 
   "Duo_Maxwell", 
   "In a matter of very few years, politicians will have no choice but to address the problem. It will glaring them in the face when hundreds of thousands of retirees what their checks and there is no till from which to pay them.\n\n \n That's not entirely true. SS is fine for at least a few more decades, and the Bush adminstration has already admmited that private accounts won't solve the problem. Not to mention several extra trillion tacked on to the deficit over a decade is NOT going to help this country. \n \n In a few years, politicans will have to deal with Medicare, that is the big problem no one is talking about. \n \n The swifiets solution is to levy one huge tax, and then kill the entire program for everyone under 65 and replace it with tax credit 401ks.", 
   {}, 
   44217, 
   null, 
   1112123580.0
  ], 
  [
   104296, 
   null, 
   "zelma", 
   "I asked this is another topic, but I would like to know what this Medicare problem is?", 
   {}, 
   102522, 
   null, 
   1112681640.0
  ], 
  [
   104326, 
   null, 
   "Eddie", 
   "I asked this is another topic, but I would like to know what this Medicare problem is?\n\n \n An aging population will consume more and more medicare. Elderly have a tendancy to require quite much medical care, compared to other age-groups. And while an aging population tends to be followed by a healthier population, the iimprovements in general health do not outweigh the increased burden of an aging population. Trust me. We`re allready there...", 
   {}, 
   104296, 
   null, 
   1112705880.0
  ], 
  [
   104341, 
   null, 
   "georged", 
   "There are literally hundreds of websites defining US problems with Medicare funding.", 
   {}, 
   104326, 
   null, 
   1112710440.0
  ], 
  [
   104622, 
   null, 
   "zelma", 
   "Thank you Eddie for your answer. \n \n I worked with Medicare for 20 years georged, and I wanted to know someones thoughts on the problems of Medicare. I am well aware of the plethora of websites on most any topic. I can even make the printer print in blue or green.\n \n Believe it or not, I even get your drift, but far be it from me to be the brain\n surgeon that you surely are each and every day of your psychotic delusion of grandeur existence. If I was as smart as you, I would hardly waste my time on an internet forum--I would be in charge of everything in the world.", 
   {}, 
   104341, 
   null, 
   1112753940.0
  ], 
  [
   104623, 
   null, 
   "Duo_Maxwell", 
   "I asked this is another topic, but I would like to know what this Medicare problem is?\n\n \n No. You don't need to make this situation any worse then it already is in the minds of many of us. Daewoo already has a inhernet ability to make life suck. We don't need you spoling whatever joy we have left. \n \n :p Don't take it too hard, that was a semijoke.\n \n Yes I know medicare is going to screw us harder then SS and much sooner.", 
   {}, 
   104296, 
   null, 
   1112754180.0
  ], 
  [
   104629, 
   null, 
   "georged", 
   "\n \n Believe it or not, I even get your drift, but far be it from me to be the brain\n surgeon that you surely are each and every day of your psychotic delusion of grandeur existence. If I was as smart as you, I would hardly waste my time on an internet forum--I would be in charge of everything in the world.\n\n \n To an agnostic, being in charge of even the US would require an egotistical commitment to mythology I don't care to make. With regard to social programs, my interest lies in how the general public reacts to politicians spending money they (the public) can't afford. If you worked in Medicare for 20-years you're well aware of Medicare's inefficiency as a social service used for political gain. Surgeon? In a manner of speaking I guess that would be applicable as we used to make the halls run with blood while getting companies out of trouble. Primarily to assist in avoiding D&O insurance lawsuits. Are derogatory personal comments now considered acceptable manners in your part of the world?", 
   {}, 
   104622, 
   null, 
   1112756400.0
  ], 
  [
   104638, 
   null, 
   "zelma", 
   "Are derogatory personal comments now considered acceptable manners in your part of the world?\n \n No more than your snide, \"there are many websites to inform you\" or \"read the posts\" remarks that you make to me. \n \n Medicare as an inefficient social service? I guess that depends on what one thinks is an efficient social service. \n \n I worked in a hospital for 20 years in Risk Management, Physician Credentialling and Medical Records (that is who decides how the hospital gets paid by WHO codes). It is hardly aging people who are robbing Medicare blind, it was robbed by cost payment reimbursement basis by hospitals until the 1980's, when lo and behold the Yale groupies developed DRG's for reimbursement. Medicare payments are right at cost now--and all public hospitals take consignment.\n \n I just can't put the blame on people who are aged and aging as the culprit for Medicare problems.", 
   {}, 
   104629, 
   null, 
   1112758980.0
  ], 
  [
   104707, 
   null, 
   "georged", 
   "Are derogatory personal comments now considered acceptable manners in your part of the world?\n \n No more than your snide, \"there are many websites to inform you\" or \"read the posts\" remarks that you make to me. \n \n Medicare as an inefficient social service? I guess that depends on what one thinks is an efficient social service. \n \n I worked in a hospital for 20 years in Risk Management, Physician Credentialling and Medical Records (that is who decides how the hospital gets paid by WHO codes). It is hardly aging people who are robbing Medicare blind, it was robbed by cost payment reimbursement basis by hospitals until the 1980's, when lo and behold the Yale groupies developed DRG's for reimbursement. Medicare payments are right at cost now--and all public hospitals take consignment.\n \n I just can't put the blame on people who are aged and aging as the culprit for Medicare problems.\n\n \n No snideness intended, your interpretation, I merely referenced sources for your questions, and without personal comments.\n \n I'm not a fan of socialized medicine with few restraints unless it falls within allocated tax revenue. Medicare, in particular the new prescription segment, is vastly underfunded and that fact ignored because its a valuable political tool in buying senior votes, the single largest voting block. I have no problems with operational aspects, those eventually fall into line with any endeavor, but the debt burden clocked by Medicare is and will be will be just another crushing, undeclared tax.", 
   {}, 
   104638, 
   null, 
   1112803080.0
  ], 
  [
   104843, 
   null, 
   "Dono", 
   "I asked this is another topic, but I would like to know what this Medicare problem is?\n\n That is an easy question to answer - money. While Social Security is getting all the ink, the Medicare trust is expected to become insolvent 21 years earlier than Social Security. The combination of baby boomers coming on line, rapidly increasing costs and an inefficient medical system presents a huge problem. From the Center for Economic & Policy Research, \"The United States has the most inefficient medical system in the world. It pays more than twice as much per person as other wealthy countries, but has little if anything to show in terms of outcomes\".\n I used to work for a computer company that supplied software to medical groups. We made a great deal of money just by selling the constant updates to Medicare software.\n Dono", 
   {}, 
   104296, 
   null, 
   1112823120.0
  ], 
  [
   104854, 
   null, 
   "Dono", 
   "I've come up with a permanent solution to the social security problem...\n \n You get the idea. Basically if you're over 69, you are a liability and are bankrupting our social security system.\n \n I'm sure I've ticked some people off now, at least I hope so.\n\n It is interesting that I read Cone's post while gathering data for my tax return. It appears by the preliminary numbers that I am not yet the liability he speaks of (I am 70).\n I will ,however, agree to Cone's solution on one condition ..... that when it comes time to put me down, Cone will come to make the attempt.\n Dono", 
   {}, 
   101451, 
   null, 
   1112824740.0
  ], 
  [
   313266, 
   null, 
   "LloydRacer", 
   "Or... let people invest it in Wall Street and lose 1/2!", 
   {}, 
   89, 
   null, 
   1213485420.0
  ], 
  [
   426898, 
   null, 
   "PottersvilleUSA", 
   "Do you support the Privatization of Social Security? \n \n Social Security Privatization Debate and Poll\n\n \n NO. I don't support the scam to loot one of the few public resources that isn't already looted.", 
   {}, 
   89, 
   null, 
   1301958840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Privatization of Social Security", 
  "url": "http://www.4forums.com/political/social-security-debates/81-privatization-social-security.html", 
  "breadcrumbs": [
   "Social Security"
  ], 
  "id_number": 81, 
  "discussion_files": [
   [
    "14592.html", 
    "http://www.4forums.com/political/social-security-debates/81-privatization-social-security-print.html"
   ], 
   [
    "14593.html", 
    "http://www.4forums.com/political/social-security-debates/81-privatization-social-security-4-print.html"
   ], 
   [
    "14594.html", 
    "http://www.4forums.com/political/social-security-debates/81-privatization-social-security-3-print.html"
   ], 
   [
    "14595.html", 
    "http://www.4forums.com/political/social-security-debates/81-privatization-social-security-2-print.html"
   ]
  ], 
  "identifier": 81
 }
]