[
 [
  [
   12105, 
   null, 
   "wackiejackie383", 
   "I Really Wish That The People Who Claim To Be Against This War With Iraq Knew What Saddam Has Done To His Own People And To Other Ethnic Groups. I Do Not Think We Had As Strong Enough Evidence As We Should Have To Go After Saddam On The Premis Of Weapons Of Mass Distruction. At The Same Time As Soon As We Attacked Iraq He Was Firing 400 Meter Range Scuds At The Kurds......and The Resolution By The Un Said He Was Only Allowed To Have Something Like 40 Meter Range Scuds. He's A Disgusting And Dangerous Man And With This War On Terror And The Humanitarian Situation Over There Taken Into Account I Am Glad Saddam Is Out Of Power. I Am Sick Of The Way We Are Cleaning Up Now Though. Yes I Did Have A Problem With Civilians And Soldiers Dieing During The Actual War But Now I'm Appalled At The Fact That We Have Lost More Soldiers Since The War Ended Then We Did During The Actual Combat. We Need To Get Rid Of The Food And Water And Power Lines And Get Someone Stronger In There To Police Iraq. I Read The Ny Times Every Day And All I Read Is About More Looting Or More Shooting. I Think The Us Needs To Stick It's Tail Down And Go Bakc And Accept Atleast Some Military Support In The Form Of Troops From The Un To Help In The Actual Policing Of Iraq. I Am Glad We Said No Way When The Un Wanted To Aid In Rebuilding Iraq.....get A Hand In On The Money There....but All American Companies Got Those Contracts And We Are Obviously Having A Problem So I Really Feel It's Time To Suck It Up. We Need A Better Image Over There And If We Can't Clean Our Act Up Soon We Are Going To Litterlly Breed More Terrorists. I Read A Little While Ago That The Iraqis Detonated A Bomb That Killed American Soldiers And Iraqis Who Were Graduating From A Police Training Program....in Other Words They Are Willing To Kill Their Own People. That's Not A Good Sigh. Forget The Fact That We Are Still In Afghanistan...i Pray We Don't Leave Them Out In The Cold Like We Didyears Ago. Anyone Know Where Bin Laden Is.....i Know I Am Not Perfect And I Don't Know Everything But I Am Saying From A Concerned And Interested Citizen's Point Of View We Need To Sweek Out The Dust And Start Moving Forward And Showing Positive Signs Of Progress Soon. Let Me Know What You Think, Thank You For Reading.", 
   {
    "post_info": {
     "post_title": "War"
    }
   }, 
   null, 
   null, 
   1058762640.0
  ], 
  [
   12106, 
   null, 
   "Broker", 
   "It's very imortant to stay where we go... when the CIA pulled out of Afghanistan the Taliban took over and let bin Laden in.", 
   {}, 
   12105, 
   null, 
   1058762880.0
  ], 
  [
   12107, 
   null, 
   "wjim1269", 
   "The Same Time As Soon As We Attacked Iraq He Was Firing 400 Meter Range Scuds At The Kurds......and The Resolution By The Un Said He Was Only Allowed To Have Something Like 40 Meter Range Scuds.\n\n \n Actually, it is 93 miles. However, he still used al Hussein and Chinese Sunburn anti-ship missiles against Americans, both of which can go farther than the 93 mile limit.\n \n \nWe Need To Get Rid Of The Food And Water And Power Lines...\n\n \n Did you really mean to say this? \n \n \n...Go Bakc And Accept Atleast Some Military Support In The Form Of Troops From The Un To Help In The Actual Policing Of Iraq.\n\n \n And what would be the point of that. The US and Britan are the major military powers in the UN, and we're already there anyway.", 
   {}, 
   12106, 
   null, 
   1058765820.0
  ], 
  [
   12113, 
   null, 
   "wackiejackie383", 
   "I Meant We Need To Feed And Give The Citizens Water In Order To Get Rid Of Food Lines. We Need A Better System Because People Are Saying They Had More Food And Atleast They Had Water And Electricity When Saddam Was There. And I Know We Are The Major Powers But Other Countries Have Plenty Of Troops They Could Ad So That We Are Not Just Sending Our Own Soldiers Over There. At The Same Time We Were The Ones That Shut The Door On The Un So Why Would They Help.", 
   {}, 
   12107, 
   null, 
   1058804340.0
  ], 
  [
   12114, 
   null, 
   "wjim1269", 
   "I Meant We Need To Feed And Give The Citizens Water In Order To Get Rid Of Food Lines. We Need A Better System Because People Are Saying They Had More Food And Atleast They Had Water And Electricity When Saddam Was There.\n\n \n Yes, but unfortunately, that's what war is. We had to take out electricity to Baghdad so that we could have an advantage. Now, we are working on restoring it, but it is difficult when we are still constantly under attack. Sorry, I misunderstood you.\n \n \nAnd I Know We Are The Major Powers But Other Countries Have Plenty Of Troops They Could Ad So That We Are Not Just Sending Our Own Soldiers Over There. At The Same Time We Were The Ones That Shut The Door On The Un So Why Would They Help.\n\n \n That's exactly what I was trying to say. Of the five permanent UN Security Council members, it is highly doubtful that China will send troops, France and Russia aren't going to send any (they'll say that we started the problem, so we should fix it), and the US and Britain are already there. So even if a resolution was to go through, it would still probably be at least 90% US and British troops in Iraq.", 
   {}, 
   12113, 
   null, 
   1058820180.0
  ], 
  [
   12116, 
   null, 
   "Broker", 
   "The State Department claims to have committments of 30,000 troops so far. Other countries say they will send troops if there is a UN mandate... including Russia.", 
   {}, 
   12114, 
   null, 
   1058828880.0
  ], 
  [
   12132, 
   null, 
   "wjim1269", 
   "Yeah, and Russia said that about the war too, but they promised to veto any attempt we made to pass one.", 
   {}, 
   12116, 
   null, 
   1058936580.0
  ], 
  [
   12135, 
   null, 
   "AMD4EVER", 
   "Ding, dong with witches are dead!!!! So long Uday, Qusay!!! Now where is Papa Bear?", 
   {}, 
   12132, 
   null, 
   1058938860.0
  ], 
  [
   12520, 
   null, 
   "Mysterium16", 
   "I really don't care what happens to Sadaam Hussein. He's a murderer & whatever-the heck-happens to him is his own stupid fault. \n But I don't like what this war has done to America. \n We are fighting for freedom- so why is it that people against the war are so badly treated? :( \n It's like they don't have the right to disagree. Isn't that what Hussein did to his people- took away thier freedom of speech and expression?", 
   {}, 
   12135, 
   null, 
   1059795300.0
  ], 
  [
   12530, 
   null, 
   "wjim1269", 
   "We are fighting for freedom- so why is it that people against the war are so badly treated?\n\n \n Who's being treated badly just for being against the war?", 
   {}, 
   12520, 
   null, 
   1059797880.0
  ], 
  [
   12533, 
   null, 
   "Mysterium16", 
   "Haven't you noticed?\n People hate the dixie chicks, cussin' 'em out and sendin' hate mail, there was controversy when Amanda Bynes flashed a peace sign, and here in atlanta, protestors have been spat upon, people who put up peace signs in thier yards had thier property vandalized. \n I guess badly treated isn't the word. Let's jus' say folks is been hatin' :( :(", 
   {}, 
   12530, 
   null, 
   1059798480.0
  ], 
  [
   12539, 
   null, 
   "wjim1269", 
   "The Dixie Chicks aren't hated just for being against the war though. It was for going to another country and putting down our leader. I know some people who were against the war but still think that was wrong.\n \n I haven't heard about the Amanda Byrnes situation.\n \n Regarding the situations in Atlanta, it's disgusting, but yet there will always be a few crazy people who will do stuff like that.", 
   {}, 
   12533, 
   null, 
   1059799980.0
  ], 
  [
   13617, 
   null, 
   "mizmaxx", 
   "I Really Wish That The People Who Claim To Be Against This War With Iraq Knew What Saddam Has Done To His Own People And To Other Ethnic Groups. \n \n \n Hey there wackiejackie. First off, The Whole Caps Thing is Kind of Annoying. Unless you're A.A. Milne, that is. \n \n Secondly, people against the war are not against getting rid of Saddam Hussein. That's totally specious reasoning. \n \n Very few people think Hussein should be in power. Certainly all of the anti-war activists I've heard of believe his removal is past due. \n \n However, many horrible and violent dictatorships exist and have existed all around the world. The US either supports or opposes these dictatorships, but never consistently or based on any kind of arguably moral or \"human-rights\" grounds.\n \n \n Broker said-\nwhen the CIA pulled out of Afghanistan the Taliban took over and let bin Laden in.\n \n \n Er... actually, the CIA readily admit that they put the Taliban in power. Doesn't make for a great argument on the \"oh no, it's not about oil, it's about freedom!\" side of things....", 
   {}, 
   12539, 
   null, 
   1061802840.0
  ], 
  [
   13618, 
   null, 
   "Broker", 
   "The CIA assisted the Afghanis in fighting the Russians. When they pulled out in 1993 the Taliban came to power in 1995.", 
   {}, 
   13617, 
   null, 
   1061811960.0
  ], 
  [
   13772, 
   null, 
   "mizmaxx", 
   "The CIA assisted the Afghanis in fighting the Russians. When they pulled out in 1993 the Taliban came to power in 1995.\n\n \n The Taliban were created by the US, and could not have come to power without it.\n \n Excerpted from an article by Phil Gasper\n http://www.service.ohio-state.edu/students/sif/Gasper.pdf\n \n In a candid 1998 interview, Zbigniew Brezinski, Carter's national\n security adviser, confirmed that U.S. aid to the rebels began\n before the invasion:\n \n According to the official version of history, CIA aid to the mujahideen began during 1980, that is to say, after the Soviet\n army invaded Afghanistan [in] December 1979. But the reality,\n secretly guarded until now, is completely otherwise: indeed,\n it was July 3, 1979, that President Carter signed the first\n directive for secret aid to the opponents of the pro-Soviet\n regime in Kabul. And that very day, I wrote a note to the president\n in which I explained to him that in my opinion this aid\n was going to induce a Soviet military intervention.... We\n didn't push the Russians to intervene, but we knowingly increased\n the probability that they would....\n That secret operation was an excellent idea. It had the effect\n of drawing the Russians into the Afghan trap.... The day\n that the Soviets officially crossed the border, I wrote to President\n Carter: We now have the opportunity of giving to the\n USSR its Vietnam War.13 \n \n The Carter administration was well aware that in backing\n the mujahideen it was supporting forces with reactionary social\n goals, but this was outweighed by its own geopolitical interests.\n In August 1979, a classified State Department report bluntly\n asserted that \"the United States' larger interest...would be\n served by the demise of the Taraki-Amin regime, despite whatever\n setbacks this might mean for future social and economic\n reforms in Afghanistan.\"14 That same month, in a stunning\n display of hypocrisy, State Department spokesperson Hodding\n Carter piously announced that the U.S. \"expect[s] the principle\n of nonintervention to be respected by all parties in the area,\n including the Soviet Union.\"15\n \n The Russian invasion in December was the signal for U.S.\n support to the Afghan rebels to increase dramatically.\n (...)\n \n Romancing the Taliban\n As the Russians withdrew from Afghanistan in early 1989,\n American policymakers celebrated with champagne, while the\n country itself collapsed into virtual anarchy. Almost a quarter\n of the population was living in refugee camps and most of the\n country was in ruins. Different factions of the mujahideen\n struggled for power in the countryside, while the government\n of Muhammed Najibullah, the last Soviet-installed president,\n controlled Kabul. Eventually, in April 1992, Kabul fell to some\n of the mujahideen factions and Burhannudin Rabbani was declared\n president, but civil war continued unabated.40 Hekmatyar\n in particular was dissatisfied with the new distribution of\n power. With his huge stock of U.S.-supplied weapons, he\n began an artillery and rocket assault on Kabul that lasted for\n almost three years, even after he was appointed prime minister\n in 1993. \"The barrage...killed more than 10,000 Afghans,[drove] hundreds of thousands into squalid refugee camps, created\n political chaos, and blocked millions of exiles from returning.\"\n 41 The rest of the country disintegrated into isolated\n fiefdoms dominated by local warlords.\n \n In 1994, a new group, the Taliban (Pashtun for \"students\"),\n emerged on the scene. Its members came from\n madrassas set up by the Pakistani government along the border\n and funded by the U.S., Britain, and the Saudis, where they\n had received theological indoctrination and military training.(...)\n \n The U.S. government was well aware of the Taliban's reactionary program, yet it chose to back their rise to power in the mid-1990s. The creation of the Taliban was \"actively encouraged by the ISI and the CIA,\" according to Selig Harrison, an expert on U.S. relations with Asia. \"The United States encouraged Saudi Arabia and Pakistan to support the Taliban, certainly right up to their advance on Kabul,\" adds respected journalist Ahmed Rashid. When the Taliban took power, State Department spokesperson Glyn Davies said that he saw \"nothing objectionable\" in the Taliban's plans to impose strict Islamic law, and Senator Hank Brown, chair of the Senate Foreign Relations Subcommittee on the Near East and South Asia, welcomed the new regime: \"The good part of what has happened is that one of the factions at last seems capable of developing a new government in Afghanistan.\" \"The Taliban will probably develop like the Saudis. There will be Aramco [the consortium of oil companies that controlled Saudi oil], pipelines, an emir, no parliament and lots of Sharia law. We can live with that,\" said another U.S. diplomat in 1997.", 
   {
    "post_info": {
     "post_title": "correction..."
    }, 
    "unicode_changes_made": true
   }, 
   13618, 
   null, 
   1062061740.0
  ], 
  [
   13780, 
   null, 
   "Broker", 
   "Oh, thanks, an opinion article... that certainly shows a lot of... uh... yeah.", 
   {}, 
   13772, 
   null, 
   1062073020.0
  ], 
  [
   13806, 
   null, 
   "mizmaxx", 
   "There is no other type of article than an \"opinion\" article. Humans are never \"objective\", they are by definition subjective.\n \n You can haggle all you like, but the article uses direct quotes from State Department documents, Senators and other \"reputable\" sources. I see you can't find anything to say about that.", 
   {}, 
   13780, 
   null, 
   1062109380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  War", 
  "url": "http://www.4forums.com/political/current-events-debates/810-war.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 810, 
  "discussion_files": [
   [
    "949.html", 
    "http://www.4forums.com/political/current-events-debates/810-war-print.html"
   ], 
   [
    "950.html", 
    "http://www.4forums.com/political/current-events-debates/810-war-2-print.html"
   ]
  ], 
  "identifier": 810
 }
]