[
 [
  [
   212336, 
   null, 
   "simone", 
   "Stolen from Salon:\n \n The children they gave away\n In the decades between World War II and Roe v. Wade, 1.5 million young women were secretly sent to homes for unwed mothers and coerced into giving their babies up for adoption. Now their stories are finally being told.\n By Sarah Karnasiewicz\n May 11, 2006 | \"Nobody ever asked me if I wanted to keep [my] baby, or explained the options. I went to a maternity home, I was going to have the baby, they were going to take it, and I was going to go home. I was not allowed to keep the baby. I would have been disowned.\"  -- Joyce\n \n It was the 1960s and Joyce was going to beauty school in Florida when she realized she was pregnant. When her mother found out, Joyce says, she was \"dumped\" at a Salvation Army Home for Unwed Mothers in Alabama. \"It was an old, old, old house with big rooms,\" she remembers now. \"[And] I had no control ... It was like being in a car wreck or something. Once you start skidding, that's it. [So] I kind of skidded through it.\" \n \n Joyce is just one of more than a million and a half women who were sent to maternity homes to surrender their children for adoption in the decades between World War II and the passage of Roe v. Wade in 1973. They were college freshman working their way through school with two jobs. They were tomboys, sorority girls and valedictorians. They were mothers and they were invisible. \n \n But now, artist and writer Ann Fessler has uncovered their hidden stories. The result of years of research and more than one hundred interviews, Fessler's new book, \"The Girls Who Went Away: The Hidden History of Women Who Surrendered Children for Adoption in the Decades Before Roe v. Wade,\" is an astonishing oral history that brings to light the dark undercurrent of life in America's postwar middle class. Denied adequate sex education, shamed by socially conformist parents and peers, and without legal access to abortion, Fessler's subjects emerge as the victims of a double standard that labeled them promiscuous while condoning the sexual adventures of their male counterparts. \n \n Spirited away under the pretense of an illness or a family vacation, the women -- many of them teenagers -- spent their pregnancies away from home and gave birth among strangers. While the maternity homes were billed as a quiet place for women to reflect on their futures, when it came time to sign adoption papers, most of the women Fessler interviewed said they felt intense pressure to relinquish their children. Persuaded by social workers who said they would never be able to provide as well for their babies as a stable couple would, ostracized by families who were shocked by their behavior, and insecure about their own strength and intelligence, most women did as they were told and tried to forget. \n \n Decades later, though, the mothers say the repercussions of those decisions are still being felt, as they struggle with depression, fight to find their lost children, and make peace with their past. \"The Girls Who Went Away\" is both politically and emotionally charged. Intertwining her spare prose with the mothers' own words, Fessler raises difficult questions about reproductive freedom, women's rights and sex education that seem particularly relevant today as Roe v. Wade is threatened, pharmacists refuse to fill contraception prescriptions, and a conservative administration promotes an abstinence only agenda in America's schools. \n \n Salon spoke with Fessler from her home in Rhode Island about the meaning of choice, the long-term effects of living a lie, and myths about unwed mothers. \n \n You've been working on the subject of adoption for years, first as a visual artist and now as a writer. Was it your own experience as an adoptee that inspired you to reach out to birth mothers? \n \n It really all began in 1989, when a woman approached me at a gallery opening and said that she thought I was the daughter she had given up for adoption decades before. I wasn't, but it was an amazing experience because at that point, I really hadn't thought too much about trying to find my own mother. \n \n The woman told me a little about her story as a surrendering mother. She was sent to a maternity home and said she never felt like she made the decision to surrender her child, but that it was made for her. She asked if I had tried to contact my mother and when I told her that I hadn't, because I didn't want to bother her after all those years, the woman said, \"She probably worries every single day about what's happened to you and whether you've had a good life.\" And that thought had just never occurred to me. \n \n That was the moment I decided that I wanted to start reflecting on my experiences as an adoptee. Through the years, in each of my projects -- whether films or art installations -- I tried to set up areas where other people could contribute their stories. I was trying to be inclusive and to raise awareness of what adoption is like from all different viewpoints. And each time, I was really impressed by the stories I heard -- they started to give me an idea of the complexity of the situation. But what floored me were the stories from the surrendering moms, mostly because I kept hearing the same things again and again -- that the mothers didn't feel like they had a choice. And I just kept thinking, why have I not heard these stories before? \n \n You obviously tried to collect interviews from a range of women, but it does seem like because they were not cheap, the maternity homes serviced a particularly white, middle-class clientele. Did you discover different kinds of stories when speaking with women of different races and classes? \n \n The African-American women I interviewed, of course, were women who had surrendered their children; I didn't interview people who kept them. So they actually had the same kind of experience as most of the white women I spoke with, in that their families had high hopes and aspirations for them and felt that given the time period, if they had a child it would be the end of their education and everything else. Their parents were well-intentioned, but they didn't anticipate the long-term effects -- though it's hard to imagine how anyone who's had a child could not anticipate that surrendering a child would have a lifelong impact. \n \n You say again and again that these stories need to be understood within the context of their time. What was it about the postwar years that made it such a difficult time for young women? \n \n There was a lot of social pressure in the 1950s and 1960s -- the time period I focus on -- and that pressure was partly due to the tremendous rise in economic and social stability in many families after the war. The U.S had a booming economy, so families that had previously been thought of as working-class poor had moved up into the middle class and they didn't want to go back. Having a daughter who was pregnant and not married was -- and sometimes still is -- seen as a reflection of parenting skills, and someone who had a daughter who was pregnant was considered low-class. It was just thought that didn't happen in \"good\" families, though of course that was because the \"good\" families were the ones who could afford to cover it up by sending their daughters out of town. \n \n Many of the women I spoke with talked about feeling betrayed because their mothers seemed more concerned about what the neighbors thought than about how they were coping, or what was going to happen to their grandchild. \n \n I was surprised, reading the women's stories, how often it was the mothers who were hardest on the daughters, and it was the fathers who visited them and cared for them when they were sent away. \n \n Isn't that interesting? I think that partly that was because at the time, raising children was really seen as the mother's role, and the father's influence was not considered as central. The idea was that if you were a solid middle-class family, the mom stayed home and spent her whole life with the kids, raising them and shaping them -- so if something went wrong, it was her failure. \n \n (More)", 
   {
    "post_info": {
     "post_title": "Mother's Day"
    }
   }, 
   null, 
   null, 
   1147364280.0
  ], 
  [
   212337, 
   null, 
   "simone", 
   "they were naive\n \n You write that the historical silence about maternity homes has helped perpetrate myths about what the mothers were like and what they wanted. What are those myths? \n \n The biggest one is that any baby surrendered for adoption was willingly and perhaps even eagerly given up by the mother. And so the implication is that the women considered all their options -- that they had options -- and made a decision. When, in fact, most of the women I interviewed felt they didn't really make the decision at all. If they were high school age, their parents made the arrangements and said this is what is going to happen, we'll help you through this, but this is the only way. \n \n A few of the older, college-age women did choose to go to the maternity homes, because they were supposed to be places that would shelter you and give you time to think about your decision. But the statistics reveal the truth: If women went into a home, 80 percent would surrender their baby, because once they were there, the pressure to do so was tremendous. The women were told, \"This is absolutely the best option. If you love your baby, you will give it up for adoption, so it can have two parents.\" \n \n There was just no room for imagining other solutions at the time, at least in the middle class. I'm the same age as many of the women in the book -- I came of age in the late '50s and early '60s -- and I can tell you that growing up, I didn't even know anyone who was divorced. It was just such a homogeneous world if you were white and middle-class that you didn't have any other examples to follow as a parent. So the first myth would be that the women made a choice, which implies having options -- when, in fact, the women I interviewed saw no alternatives at all. If their parents weren't going to help them -- which was really the only way that any girls made it -- then they didn't have a choice. \n \n The second myth was that during the time period the book covers, anyone who got pregnant and sent away was considered a slut. It was an extremely hypocritical time sexually, because by the end of the 1960s something like 68 percent of women were having sex before age 20, but everybody lied about it. So all the girls who were having sex but didn't get caught could claim they were virgins, but the ones who got pregnant couldn't deny what they had done. So it was assumed they were either promiscuous or more sexually advanced than their peers, when most weren't. It turns out, actually, that among the women I interviewed, most became pregnant with their first sexual partner, some with their very first sexual experience, and many within only five sexual experiences. So most likely they got pregnant not because they were promiscuous, but because they were naive. They didn't know anything about sex; some didn't even know how babies were born. People just didn't talk about sex during the era; there was no sexual education, and in some families it simply never came up. \n \n The third myth is that a woman who surrenders her child doesn't suffer a loss. The families and the people who ran the maternity homes told the women that they'd go to the hospital and have the baby and the baby would be taken away and life would go back to normal -- as though they just had their appendix removed. The idea was that they could make up a lie about where they'd been for the past four months and no one in the community would be the wiser -- it would be like it never happened. \n \n But you do write that maternity homes weren't always so adamant about making mothers surrender, and that their ideology shifted dramatically after the war. How did they go from being places that may not have been ideal, but were at least supportive, to ones that were focused entirely on adoption? \n \n The difference was that after the war thousands of adoptive families were clamoring for children. The numbers were staggering; at the time, for every child that was placed, there were 10 families still waiting for a baby. So all these lovely, established young couples were coming to maternity-home social workers hoping to adopt and that put the workers in a complicated position. On the one hand, they had a 17-year-old in front of them, who was sort of in a daze, and her baby's not even real to her yet. She's pregnant, but to her, pregnancy is a problem. Everyone is telling her she's bad and that she's shamed her family. \n \n And so you find that more often than not, the social worker ends up agreeing with the girl's family that the best-case scenario would be to get her baby placed with one of the many fine families waiting to adopt. And I don't want to make it sound like I'm down on adoptive families, because, in fact, they were told they were adopting children who were unwanted. The problem was that all the parties were kept apart from one another, and it was a paternalistic system that told these women, \"We know what's best for you.\" \n \n Was there an element of social engineering at work? Were the women seen as less capable of parenting because they had already disgraced their families? \n \n Definitely. The message from social workers was that the baby would be so much better off with an adoptive family than with the surrendering mother because she was already a screw-up -- she'd gotten pregnant, she wasn't married, so how good a mother could she be? \n \n She was seen as unfit because she was unmarried, though, of course, at the time, loads and loads of women got pregnant and then got married so they could give birth six or seven months after the wedding. In those cases, all was forgiven. \n \n Did you talk to any women who, upon giving birth, wanted to change their minds and keep their baby? \n \n I heard again and again from women that once their baby was born, everything changed. They finally realized that what they were dealing with wasn't an amorphous problem, it was their child. Once that happened, quite a few women told me they tried to change their minds, to convince their parents to give them more time to find another solution. The terrible thing was that in some cases they were simply told it was too late. But legally that wasn't true; there was a window of time in which mothers were allowed to change their minds. \n \n So they were lied to? \n \n Yes. Social workers were just so convinced that they were doing the right thing. \n \n (More)", 
   {
    "post_info": {
     "post_title": "These Women Got Pregnant not because they were promiscuous but because"
    }
   }, 
   212336, 
   null, 
   1147364520.0
  ], 
  [
   212339, 
   null, 
   "simone", 
   "paternalistic, competitive society\n \n Did any of the women you spoke with try to get abortions? \n \n Remember, this was before abortion was legalized, which doesn't mean that there weren't abortions happening, but there were lots and lots of botched ones. And most girls didn't even know who to ask about it, or where to find one. So certainly, some women might haven chosen to terminate their pregnancies, but many of the women I interviewed were actually not pro-choice. \n \n For example, one woman told me about growing up in a very strict Catholic family and, like many of the mothers, she had been in denial for several months, just thinking the problem would go away. Her waistline was expanding, but she just thought, This is not real, it can't be real. For many women, by the time their parents found out it was too late to take them to a secret doctor for an abortion. In this particular case, though, the woman's father, who was extremely religious, to the point that he didn't use birth control, came to her room and actually said to her, \"Is it too late for us to do anything about this?\" And it was the daughter who said no, that she wasn't willing to go through with an abortion. \n \n You write that the National Mental Health Association recommends that people dealing with grief seek out people who understand their loss. But most of the women you spoke with did exactly the opposite -- in fact, the insistence on secrecy seems like it made that kind of healing impossible. \n \n Yes, secrecy was imperative. There was no reason to send a woman away and give up a child if you weren't going to keep it quiet; the idea was that no one would ever know. That was what the families wanted and in some cases the women too -- they knew what the social stigma was like, and they just felt like they could not deal with it. They knew what the image of an unwed mother was, and it wasn't them. \n \n One of your recurring themes is how damaging the burden of maintaining a lie can be on a life. \n \n Absolutely. First of all, the women suffer tremendously from an ongoing sense of worry about their children -- a feeling that some studies have equated with having a loved one who is missing in action. It's this idea that your child is alive, is out there in the world, so are you going to run into her on the street one day? \n \n The women were told by every authority figure in their lives don't ever tell anyone because people will think less of you, no man will ever want to marry you if he knows you were such a bad, slutty girl -- they heard that over and over. And that perpetuated the secrecy. \n \n Also, many, many women realized only later, when the world started changing around them, that they had been duped. They were told that they had no choice, that the world wouldn't accept them, but then within a few years the world and the culture had changed, and they saw that maybe other options might have been possible. One woman told me that when she was pregnant as a teen she had to drop out of school, but then in the 1970s Title IV made it a law that you could not discriminate against a woman and make her drop out of school just because she was pregnant. \n \n There were also some organizations that started up in the 1970s of women who began coming out of the closet to talk about their experiences as unwed mothers who had been forced to give up their children in maternity homes. But, in general, most of the women still didn't talk about it \n \n So not only were they not talking to their husbands and friends, they weren't talking to each other? \n \n Exactly. Remember, the mothers were all told that they would just move on, so many felt that something was wrong with them when they couldn't forget their children. And not having anyone to talk to, they couldn't compare notes. \n \n They told me how the shame and secrecy affected their self-esteem, how they couldn't relax and were always afraid of being found out -- and I actually began to think it had some parallels to the gay community, to the idea of being closeted. The mothers found themselves driven to incredibly destructive behavior. And like in the homosexual community, things didn't really begin to change until people came out and started speaking up, saying, \"I'm XXXXX and I'm proud,\" the same was true for surrendering mothers. More and more women started speaking up, saying, \"I'm a birth mother and this is nothing to be ashamed of.\" And so gradually women became more aware that they weren't alone. But there are still many, many women who are very distraught and lonely. \n \n In my book, I reproduce a note that was left for me in one of the comments boxes at an exhibition. It was from a woman who had snuck away for the day to come to the show, and she said, \"This is the way I live my life, I couldn't tell anyone I came here because my sons don't know they have a half brother.\" And I think she ended it by simply saying, \"I live in hiding.\" \n \n You say that a lot of pain could have been prevented if parents in the '50s and '60s had been more realistic about the likelihood of young people having sex and had provided them with adequate sex education and contraception. Given the focus on abstinence only sex-ed in the U.S. today, are you worried for the future? \n \n It's scary to see such regression. A lot of things will never change for the women in my book; their lives are set. But one thing their stories can offer is a window onto a time period. And what they show us are the consequences of a sexually repressive, paternalistic, conservative society. And there are many people in the country right now who would like to go back there. \n \n Abstinence-only sex education doesn't allow for even a mention of birth control -- the line is that the only way not to get pregnant is not to have sex. And certainly, that's true and abstinence should be taught. But to focus solely on that is to also be willfully blind to the realities of human behavior. Sex education is incredibly important -- especially realistic, age-appropriate sex education that starts early on -- and it should be coupled with frank talk about relationships and respecting others. Because what scares social conservatives are stories about teen boys keeping lists of all the virgins they have scored. But while that shouldn't be excused, that's really not about sex, it's about conquest. It's a lack of respect for other people. \n \n You say that the voices of the women in your book need to be heard as part of the current national debate over reproductive freedom because the \"double standard\" is still very much a part of our cultural psyche. Can you explain what you mean by that? \n \n Women and men are both sexual beings, and the onus should not always be on the women to stop the sexual advances of the man. It's a couple having sexual relations. But I think we still have this caveman notion that a man can go around spreading his seed, making conquests, and the woman is supposed to be the one with restraint who holds him back. And if you look at the world in general, outside the U.S., it's quite clear that both sexually and politically women still do not have equal say or power. Look at the Supreme Court right now. We don't know yet what effect their decisions will have on the country, but just the imbalance of representation indicates that on some level we still value men's opinions more, or believe that men can make more rational decisions. So if nothing else, I hope that by uncovering this hidden little part of women's history, I can help build a bridge between two generations, and to show young people today the importance of having a voice, of being participants in their own lives.", 
   {
    "post_info": {
     "post_title": "Their stories show us the consequences of a sexually repressive,"
    }
   }, 
   212337, 
   null, 
   1147364760.0
  ], 
  [
   212340, 
   null, 
   "simone", 
   "From a letter in a Tacoma, Washington newspaper:\n \n \nThe idea of using natural birth control is wonderful in theory. However, my lovely mother practiced natural birth control methods, and she is the proud parent of 13 children. While we think we know more now about taking temperatures, etc., to determine times of fertility, my mom did know to take her temperature and followed her fertility cycle diligently.\n \n The truth is that some women don't fit the textbook norm for ovulation. Because the Catholic Church to which my mother belonged didn't allow for other forms of birth control, she spent 13 of her 20 child-bearing years pregnant. She was exhausted, her own body depleted, with little time for herself, her husband and the children she already had.\n \n My mother was an intelligent, responsible, married woman. If she couldn't avoid pregnancy by carefully following natural childbirth, how can we expect teenagers or more impulsive, irresponsible adults to prevent pregnancy in this way? It is just not a viable option for most people in this already overpopulated world. Women need options.\n", 
   {
    "unicode_changes_made": true
   }, 
   212339, 
   null, 
   1147365000.0
  ], 
  [
   212395, 
   null, 
   "Steeeeve", 
   "I hate when you post a whole d*mn article on these boards...just give us a link.\n \n Not that i care anyway because you only read one sided stories of the subject.", 
   {}, 
   212340, 
   null, 
   1147372380.0
  ], 
  [
   212427, 
   null, 
   "simone", 
   "I am fully cognizant of how difficult it is for you to accept a woman's point of view, Steeeeve.", 
   {}, 
   212395, 
   null, 
   1147379340.0
  ], 
  [
   212430, 
   null, 
   "Steeeeve", 
   "I am fully cognizant of how difficult it is for you to accept a woman's point of view, Steeeeve.\n\n \n If by woman's you mean you than yeah, I find it rather difficult. If by woman you mean any woman than no, I obviously share the same feelings as many woman...even on these forums.", 
   {}, 
   212427, 
   null, 
   1147379760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mother's Day", 
  "url": "http://www.4forums.com/political/abortion-debates/8101-mothers-day.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 8101, 
  "discussion_files": [
   [
    "25879.html", 
    "http://www.4forums.com/political/abortion-debates/8101-mothers-day-print.html"
   ]
  ], 
  "identifier": 8101
 }
]