[
 [
  [
   213347, 
   null, 
   "Movin2theGroove", 
   "I am wondering what everyone's opinion was about the morning after pill. I know that there are many who are opposed to abortion but what about the morning after pill. Just in case you are unsure about how it works:\n \n The emergency contraceptive/morning-after pill has three possible ways in which it can work (as does the regular birth control pill):\n \n 1. Ovulation is inhibited, meaning the egg will not be released;\n 2. The normal menstrual cycle is altered, delaying ovulation; or\n 3. It can irritate the lining of the uterus so that if the first and second actions fail, and the woman does become pregnant, the human being created will die before he or she can actually attach to the lining of the uterus. \n \n http://www.morningafterpill.org/mapinfo1.htm", 
   {
    "post_info": {
     "post_title": "Opinions on the morning after pill"
    }
   }, 
   null, 
   null, 
   1147857360.0
  ], 
  [
   213414, 
   null, 
   "Spit Bubble", 
   "Admittedly, I haven't looked up many facts on the morning after pill...But wouldn't it also expell an unfertilized egg BEFORE the egg can be fertilized? Is a woman committing murder by getting rid of a fertilized egg that might not even result in actual pregnancy? And really, does a few cells really count as a human being? My finger has more human cells than an egg that was fertilized 72 hours ago. :P\n \n It's all semantics, but no one can actually look at a hanful of cells and think, \"Look, a human being! If it dies, we should have a funeral for it!\" emoticon_xdonno Can they?", 
   {}, 
   213347, 
   null, 
   1147902600.0
  ], 
  [
   213415, 
   null, 
   "Steeeeve", 
   "hard to say because fertilized eggs don't attach all the time and just fall out and die...so I could see why some would feel this is not a true abortion.", 
   {}, 
   213414, 
   null, 
   1147903080.0
  ], 
  [
   213534, 
   null, 
   "Tastyfish", 
   "I'd say its certainly a grey area, it has the potential to be an abortion and that is really the only reason people take it - if the zygote wasn't going to implant then there was no need for the drug, however we can't tell that beforehand. To use a drastically over-emotional arguement, it is sort of like how hiring someone to kill someone is still attempted murder even if the victim died in a car crash before you assasin got there.\n \n Actually I'll change my mind, it is certainly a form of abortion, what is more subjective is whether it is killing a person, or whether it is wrong.", 
   {}, 
   213415, 
   null, 
   1147978440.0
  ], 
  [
   214055, 
   null, 
   "Mickey Shane", 
   "It's a form of abortion much like scrapping a new project at work.", 
   {}, 
   213534, 
   null, 
   1148422560.0
  ], 
  [
   214112, 
   null, 
   "Movin2theGroove", 
   "Should it consistently be called abortion if it is not always removing a fertilized egg from the womb? What if it is the case where it is delaying the release of an egg?", 
   {}, 
   214055, 
   null, 
   1148463360.0
  ], 
  [
   214205, 
   null, 
   "jim's trucking", 
   "Technically, yes. To stop in the early stages is abortion of an otherwise happening procedure...hence the yes vote. However, prevention of fertilization or attachment does not alter a started life. For statistical purposes, abortions counts should be limited to those situations wherein life has begun and is ended purposely by interference with natural procedures that would occur after fertilization and attachment.", 
   {}, 
   214112, 
   null, 
   1148502060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Opinions on the morning after pill", 
  "url": "http://www.4forums.com/political/abortion-debates/8130-opinions-morning-after-pill.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 8130, 
  "discussion_files": [
   [
    "10881.html", 
    "http://www.4forums.com/political/abortion-debates/8130-opinions-morning-after-pill-print.html"
   ]
  ], 
  "identifier": 8130
 }
]