[
 [
  [
   213362, 
   null, 
   "Wesbo", 
   "Georgian president Saakashvili ignores all democratic norms backing on US support. He is following Washington's tastes in any questions. On the threshold of war against Iran Georgia has turned into a vast building site.\n Americans understand that in case of war with Iran they will have big losses and as a result of it USA begun building a huge morgue in Georgia, in Gory district where Georgian Central military hospital was remitted not long ago. And in Rustavi district they are erecting a five-storey prison with three underground floors. It's clear that Americans are going to use it for keeping of prisoners of war from Iran and bordering states (Iraq and Afghanistan). It's well-known about secret CIA prisons in East Europe.\n Moreover I think that Saakashvili will use the constructed sites to his benefit in the case of war against autonomies (hospitals and morgues by destination, prisons for dissatisfied). Well, Saakashvili did damage European image by CIA prisons building in Georgia and now Europe has to cooperate with an authoritarian country and tolerate it in its own democratic institutions.", 
   {
    "post_info": {
     "post_title": "Georgian president Saakashvili ignores all democratic norms backing on US support"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1147881060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Georgian president Saakashvili ignores all democratic norms backing on US support", 
  "url": "http://www.4forums.com/political/current-events-debates/8133-georgian-president-saakashvili-ignores-all-democratic-norms-backing-us-support.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8133, 
  "discussion_files": [
   [
    "17858.html", 
    "http://www.4forums.com/political/current-events-debates/8133-georgian-president-saakashvili-ignores-all-democratic-norms-backing-us-support-print.html"
   ]
  ], 
  "identifier": 8133
 }
]