[
 [
  [
   213701, 
   null, 
   "oliphant", 
   "We all know we are burning too much oil. It is destroying the planet. If you do not believe in global warming then you are simply willfully ignorant. However, I have the answer to this problem. It is very simple. It will sound crazy at first, but try it out. It would work.\n \n Nuclear power. There is enough fuel on the planet to supply the world with power for hundreds of thousands of years. American reactors are safe, reliable, and virtually immune to price fluctuation.\n \n \"But what about gasoline? How will we power our cars?\" Hydrogen fuel cells. Currently the only problem with hydrogen fuel is that it is expensive to create because it requires a great deal of electricity. In order to get hydrogen, you need electricity, which currently requires, in large part, oil. If we utilized nuclear power, we would have as much electricity as is necessary to create hydrogen fuel cells. Building power plants near water would make it easy to utilize the thermal nature of nuclear power, which makes the hydrolysis process even more efficient.\n \n This would require a bit of an overhaul of some of our infrastructure. And you wrongly think this is bad. Presently, China is kicking our butts in tech land. China is also obtaining huge oil contracts with Russia and Iran, and has created the SCO, which is basically a communist America-haters club. The SCO has a great deal of power and controls a great deal of oil, is nuclear, and is helping China become an Eastern hegemony. Soon, if all goes as it is, America will be at its knees economically. But, if we develop a nuclear/hydrogen infrastructure sooner rather than later, then when the time comes when oil prices skyrocket and China's economy begins to fail, they will be buying the hydrogen-compatible infrastructural components from us, the opposite of today's gross trading deficit with China. The rest of the world will turn to us as well. It is, therefore, a double-win, and is one of America's last hopes of beating the East in the long-term economic war.", 
   {
    "post_info": {
     "post_title": "The answer to the power problem."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1148097540.0
  ], 
  [
   213726, 
   null, 
   "Jo Bennett", 
   "The problem with nuclear is that it is (a) not carbon neutral, there are major problems associated with the mining and transportation of nuclear fuel (b) uranium is finite, nuclear on the sort of scale you're suggesting will require many times more uranium than is currently produced (c) when you have that amount of nuclear fuel and waste kicking around, the scope for terrorists getting hold of it is increased, as is the risk of accidents (d) nuclear is very expensive, as is the infrastructure to build it (e) getting hydrogen from nuclear energy will make your current petrol prices look like sale of the century, the US economy relies on cheap fuel, not just fuel.\n \n As for the contention that the world will turn to the US for hydrogen and nuclear components, that seems unlikely. China will either invent its own, or buy the tech and make its own, or buy it from Japan, who also has extensive nuclear tech experience. Even then, the US won't be keen to see certain countries have nuclear power, and so they'll still be burning away fossil fuels like there's no tomorrow.", 
   {}, 
   213701, 
   null, 
   1148122380.0
  ], 
  [
   213788, 
   null, 
   "snakespit", 
   "I kinda like the idea of E85. It is an easily renewable energy which is readily available in the US. E85 is cleaner burning than gasoline, which would be more \"environmentaly friendly\". Also, it would provide much needed income for American farmers, and keep more american dollars out of the hands of greedy oil corporations and greedy ME nations. I'm sure that E85 is not without problems, but it seems better than the economic uncertainty surrounding oil.", 
   {}, 
   213726, 
   null, 
   1148189940.0
  ], 
  [
   213840, 
   null, 
   "Jo Bennett", 
   "Doesn't E85 require more energy to produce in terms of transportation, farm vehicles and fertiliser production than you get out of it though?", 
   {}, 
   213788, 
   null, 
   1148251380.0
  ], 
  [
   213882, 
   null, 
   "snakespit", 
   "Doesn't E85 require more energy to produce in terms of transportation, farm vehicles and fertiliser production than you get out of it though?\n\n Current research prepared by Argonne National Laboratory (a U.S. Department of Energy Laboratory), indicates a 38% gain in the overall energy input/output equation for the corn-to-ethanol process. That is, if 100 BTUs of energy is used to plant corn, harvest the crop, transport it, etc., 138 BTUs of energy is available in the fuel ethanol. Corn yields and processing technologies have improved significantly over the past 20 years and they continue to do so, making ethanol production less and less energy intensive.\n \n http://www.e85fuel.com/e85101/faqs/energy.php", 
   {}, 
   213840, 
   null, 
   1148281620.0
  ], 
  [
   213886, 
   null, 
   "Jo Bennett", 
   "That looks to be the latest research, I had a look at the description of the flaws with the previous studies but they were a bit beyond me.", 
   {}, 
   213882, 
   null, 
   1148301120.0
  ], 
  [
   214303, 
   null, 
   "Ripskar", 
   "Britain's Nuke reactors are going off line over the next decade or so, so it's hardly a long term solution.\n Sellafield goes in 2010 and with it all the reprocessing facility so all the Magnox reactors go at the same time.\n Plus we have a treaty with Ireland that says we won't put any more nuke waste in the sea so that rules out anything on the west coast.\n Can't see one going anywhere near London either.", 
   {}, 
   213886, 
   null, 
   1148576400.0
  ], 
  [
   214335, 
   null, 
   "daewoo", 
   "Current research prepared by Argonne National Laboratory (a U.S. Department of Energy Laboratory), indicates a 38% gain in the overall energy input/output equation for the corn-to-ethanol process. That is, if 100 BTUs of energy is used to plant corn, harvest the crop, transport it, etc., 138 BTUs of energy is available in the fuel ethanol. Corn yields and processing technologies have improved significantly over the past 20 years and they continue to do so, making ethanol production less and less energy intensive.\n \n http://www.e85fuel.com/e85101/faqs/energy.php\n\n \n 2 problems with this. First, we are only talking a 38% increase. The EROI on oil is over 1000%. This is one of the primary reasons that ethanol will never really do much to replace oil. It woudl simply be too expensive. Right now it is realtively cheap, but only because we have cheap oil to cover the energy needs upstream. \n \n The other problem with the Argonne study is that it is based on a field edge approach. There is no allowance made in the study for transportation of the bulk feestock. Since we are talking a low density feedstock, those costs are significant. The department of energy \"feedstock transportation report\", done as a supplement to the Argonne reaport (once people pointed out that there was a pretty big problem with leaving that out) shows that even if you limit your feedstock transportation to a 25 mile radius, the energy cost of transporting the feedstock is roughly 50% of the production energy, essentially meaning that the 38% energy gain becomes a 12% loss. \n \n This is a problem pretty much all biomass proposals. Current farm machinery is constructed to essentially hold onto the grain and expell the chaff. This can make goign back and picking up the chaff fairly difficult (and expensive). There has been talk of redesigning more farm equipment to seperate the grain from the chaff and retain both. Even with the proper equipment, you still have to load trucks and haul it to the processing plant.,", 
   {}, 
   213882, 
   null, 
   1148589720.0
  ], 
  [
   214370, 
   null, 
   "Liminus", 
   "The problem with converting to an energy economy that is not based on fossil fuels is that to do it properly involves a vast amount of investment with no immediate returns; for example nuclear fusion (while a fairly speculative solution at the moment) would be the ideal, in that it would generate a vast amount of power from easy-to-obtain fuel with minimal byproducts. However it is not an attractive investment prospect. The only current fusion project is this one:\n \n France gets nuclear fusion plant\n but will cost around 10bn Euros and the experimental phase is scheduled to run for 35 years!\n \n For the moment, fission seems to me the best solution, but only if properly invested in. It has aleady been pointed out that it is very expensive and potentially dangerous, but if our governments really commit to it, surely we can build safe reactors that will pay back over the long term (an idea alien to our current leaders) many times the initial investment of capital, resources and manpower combined. \n \n Unlike other solutions, it is a technology we have already fully developed which only needs refining in terms of efficiency and safety.\n \n The other major alternative is \"eco-power\" i.e. wind and wave power, the latter being the far more attractive prospect, given the colossal energy stored in the world's oceans, but again this would require massive investment with large-scale government/business co-operation, with the benefits (although huge) far in the future. This does not seem to be a concept that sits well with current \"fundamentalist\" capitalist values.", 
   {}, 
   214335, 
   null, 
   1148609940.0
  ], 
  [
   215156, 
   null, 
   "Kronus", 
   "\n Nuclear power. There is enough fuel on the planet to supply the world with power for hundreds of thousands of years. American reactors are safe, reliable, and virtually immune to price fluctuation.\n \n\n \n So what do we do with all the radioactive waste? That's my biggest concern.", 
   {}, 
   213701, 
   null, 
   1149300900.0
  ], 
  [
   215193, 
   null, 
   "sinjin", 
   "Bury it deep is all we've come up with.emoticon_wow", 
   {}, 
   215156, 
   null, 
   1149353160.0
  ], 
  [
   215318, 
   null, 
   "Kronus", 
   "Bury it deep is all we've come up with.emoticon_wow\n\n \n And of course the problem with that solution is that things that can disqualify a site are, in order of importance:\n \n Too close to rich people.\n Near a fault zone.\n Near the water table.\n \n Politics inevitably trumps science, and so dump sites will end up being places that won't cause trouble until elections are over, as opposed to places that will be secure for hundreds or thousands of years.", 
   {}, 
   215193, 
   null, 
   1149469020.0
  ], 
  [
   216009, 
   null, 
   "donniedarko", 
   "The problem with nuclear is that it is (a) not carbon neutral, there are major problems associated with the mining and transportation of nuclear fuel\n \n \n Neither are current methods of obtaining any other materials for power sources. \n \n \n(b) uranium is finite, nuclear on the sort of scale you're suggesting will require many times more uranium than is currently produce\n\n \n Even if the energy demand of the world would increase by 10-fold, there is enough uranium to power present-day reactor designs for over 5 billion years.\n \n \n(c) when you have that amount of nuclear fuel and waste kicking around, the scope for terrorists getting hold of it is increased, as is the risk of accidents\n\n \n Nuclear waste can be reprocessed into MOX which can then be reused. The waste from MOX reactions cannot be used for the production of atomic weapons.\n \n \n(d) nuclear is very expensive, as is the infrastructure to build it \n\n \n The same can be said for nearly every other energy alternative.\n \n \n(e) getting hydrogen from nuclear energy will make your current petrol prices look like sale of the century, the US economy relies on cheap fuel, not just fuel.\n\n \n How so? As far as I know, it is a simple matter of hydrolysis. However, this is beside the point. If a major switch to nuclear power would occur, the use of conventional fuels would drop outside the transportation sector. Nuclear power does not have to replace oil, it just needs to supplant it as the primary source of energy.\n \n \nAs for the contention that the world will turn to the US for hydrogen and nuclear components, that seems unlikely.\n\n \n Dang straight. The best reactors in the world are built right here in Canada by AECL. Booyah!\n \n \nChina will either invent its own, or buy the tech and make its own, or buy it from Japan, who also has extensive nuclear tech experience.\n\n \n They are taking quotes from AECL as we speak. Apparently they have large-scale nuclear plans for their civilian power grid.\n \n \nEven then, the US won't be keen to see certain countries have nuclear power, and so they'll still be burning away fossil fuels like there's no tomorrow.\n\n \n This is unfortunate. The only problem the US should have is enrichment programs. AECL reactors can run on natural uranium at high-efficiency. So can fast-breeders.\n \n \nBritain's Nuke reactors are going off line over the next decade or so, so it's hardly a long term solution.\n\n \n AECL reactors can be re-furbished in 18 months, extending their lifespan by almost 30 years.\n \n \nSo what do we do with all the radioactive waste? That's my biggest concern.\n\n \n Launch it at deep-space or the sun. We have already put nuclear material in space on a number of occasions. Public misconceptions on the safety of nuclear power stand in the way of advancement. This is largely due to propaganda by large oil conglomerates.", 
   {}, 
   215318, 
   null, 
   1149881760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The answer to the power problem.", 
  "url": "http://www.4forums.com/political/environmental-debates/8140-answer-power-problem.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 8140, 
  "discussion_files": [
   [
    "1161.html", 
    "http://www.4forums.com/political/environmental-debates/8140-answer-power-problem-print.html"
   ]
  ], 
  "identifier": 8140
 }
]