[
 [
  [
   213736, 
   null, 
   "Matthew S", 
   "I found this site http://www.androphile.org/preview/Culture/NativeAmerica/amerindian.htm I like this quote form the site. \nClaire R. Farrer, an anthropologist who has &#8220;gone native&#8221; in the best sense of the term, reports on the present situation among the Mescalero Apache: &#8220;Multigendered adult people at Mescalero are usually presumed to be people of power. Because they have both maleness and femaleness totally entwined in one body, they are known to be able to &#8216;see&#8217; with the eyes of both proper men and proper women. They are often called upon to be healers, or mediators, or interpreters of dreams, or expected to become singers or others whose lives are devoted to the welfare of the group. If they do extraordinary things in any aspect of life, it is assumed that they have the license and power to do so and, therefore, they are not questioned.&#8221; [7]\n\n \n And this one\n \n \nThough, due to the nature of this site, the discussion so far has been limited to the male experience in Native American societies, this should not be construed to mean that the two-spirit path was, or is, closed to women. If any conclusion can be drawn from what we know about gender variation in traditional Native society it is that gender flexibility in any individual is welcomed as a rare and precious aspect of human experience, a special talent to live life in a fresh, spontaneously authentic way that enriches and empowers the lives of all in the community. It is a lasting testament to the psychological sophistication of Native tribes that they recognized two-spirit people as being engines of creativity, change and innovation (much as they have been in other cultures and continue to be in ours) and co-operated in creating the sacred space in which such people could manifest. As Joe Medicine Crow, a Crow traditionalist, told Walter Williams, &#8220;We don&#8217;t waste people the way white society does. Every person has their gift.&#8221; [12]\n \n\n \n The only problem I would have is dressing like a women.", 
   {
    "post_info": {
     "post_title": "Two Spirits"
    }
   }, 
   null, 
   null, 
   1148135040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Two Spirits", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8141-two-spirits.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8141, 
  "discussion_files": [
   [
    "10971.html", 
    "http://www.4forums.com/political/gay-rights-debates/8141-two-spirits-print.html"
   ]
  ], 
  "identifier": 8141
 }
]