[
 [
  [
   214028, 
   null, 
   "daewoo", 
   "http://www.upi.com/SecurityTerrorism/view.php?StoryID=20060523-111358-4196r\n \n \nFBI raid on lawmaker angers colleagues\n WASHINGTON, May 23 (UPI) -- U.S. Congressmen reacted with alarm to an unprecedented FBI raid on a colleague's office at the weekend. \n \n The raid on the Rayburn House Office Building office of Rep. William Jefferson, D-La., has stoked tempers on Capitol Hill -- and led to some lawmakers and legal experts criticizing the Justice Department's actions, CongressDaily reported. \n \n \"There is no excuse for the FBI -- for the first time in history -- searching a congressional office and apparently doing so in total (dis)regard of due process as it relates to the legislative branch,\" former Speaker Newt Gingrich, R-Ga., wrote Sunday night in an e-mail to several members and aides, obtained by CongressDaily. Gingrich was particularly critical of what he described as the executive branch trampling constitutional lines of authority. \n \n \"The president should respond accordingly and should discipline (probably fire) whoever exhibited this extraordinary violation,\" he wrote. \"The protection of the legislative branch from the executive branch's policing powers is a fundamental principle which goes all the way back to the English Civil War,\" Gingrich said. He described the incident as \"the most blatant violation of the constitutional separation of powers in my lifetime.\" \n \n Charles Tiefer, a law professor at the University of Baltimore who served as solicitor and deputy general counsel of the House for 11 years, told CongressDaily that the incident \"raises some serious separation of powers questions when extraordinarily harsh and extreme tactics are used on the legislative branch.\" \n \n During his tenure, Tiefer said the FBI conducted \"many successful investigations\" of members of Congress without having to resort to raids. \n \n He said the raid could set a chilling precedent. \"Congress is frequently at odds with the FBI and the Department of Justice and other investigative or security agents working with them,\" he said.\n\n \n I do not recall any contitutional immunity for congress from criminal investigation. Where in the world woudl anybody get the idea that there is somethign wrong with the FBI executing a search warrant, regardless of the target?", 
   {
    "post_info": {
     "post_title": "Now EVERYBODY wants to be above the law."
    }
   }, 
   null, 
   null, 
   1148411880.0
  ], 
  [
   214032, 
   null, 
   "sanguinekane", 
   "There are plenty of instances I can think of where the FBI would be overstepping it's power, or at least acting in such a way as to appear corrupt/totalitarian in executing a search warrant. \n \n This however, is not one of those cases. The legislative branch is just as much to blame for the current state of the nation as the executive and judicial branches are.", 
   {}, 
   214028, 
   null, 
   1148416980.0
  ], 
  [
   214034, 
   null, 
   "Dono", 
   "I lived for a time in Louisiana where the suspect comes from, and corruption in politics is considered the norm there. It seems the FBI has this guy cold (pun intended, they found the bribe money in his freezer). Sad thing is, if this guy does not go to jail, he will probably get reelected.", 
   {}, 
   214028, 
   null, 
   1148417340.0
  ], 
  [
   214035, 
   null, 
   "jim's trucking", 
   "The account I saw of it alluded to a prolonged investigation of Jefferson wherein he received several hundred thousand dollars from an FBI undercover agent in a clandestine meeting of the two. The raid of his office was likely necessary when it came time to search for the money in Jefferson's home and was likely initiated after a proper warrant was issued (I haven't heard otherwise). The story goes that the money was found (at least some of it) in the home freezer wrapped up with various frozen foods.\n \n I think there may have been considerable planning prior to the raid and it was not a case of \"let's go see what we can find at Jefferson's house and office\". It was more like a surprise visit to attempt to find the marked money already known to have been taken by the perp.\n \n I have little sympathy for crooked politicians. Certainly, they should not have any kind of pass for living unbound by the Constitution. Likewise, we should not allow other agencies to bypass the Constitution in their efforts to catch crooked politicians.", 
   {}, 
   214028, 
   null, 
   1148417520.0
  ], 
  [
   214038, 
   null, 
   "Steeeeve", 
   "http://www.upi.com/SecurityTerrorism/view.php?StoryID=20060523-111358-4196r\n \n \n \n I do not recall any contitutional immunity for congress from criminal investigation. Where in the world woudl anybody get the idea that there is somethign wrong with the FBI executing a search warrant, regardless of the target?\n\n \n Its there...right next to the right to privacy and abortion.", 
   {}, 
   214028, 
   null, 
   1148418540.0
  ], 
  [
   214066, 
   null, 
   "Kronus", 
   "\n I do not recall any contitutional immunity for congress from criminal investigation. Where in the world woudl anybody get the idea that there is somethign wrong with the FBI executing a search warrant, regardless of the target?\n\n \n I may have missed it, but I didn't see anywhere in the article where it said that the FBI had a warrant. Are you basing that on extra information, or are you assuming that they wouldn't have done the raid without the right paperwork?", 
   {}, 
   214028, 
   null, 
   1148428380.0
  ], 
  [
   214078, 
   null, 
   "georged", 
   "There was a search warrant:\n \n http://www.voanews.com/english/2006-05-23-voa89.cfm\n \n Excerpt:\n \n ~They were executing a search warrant coinciding with the unsealing of court documents alleging Jefferson accepted bribes in the process of brokering business deals for companies and governments in West Africa.~ \n \n Gingrich is sounding like Bush.", 
   {}, 
   214066, 
   null, 
   1148433900.0
  ], 
  [
   214086, 
   null, 
   "snakespit", 
   "The politicians are all up in arms simply because they realize that it could have just as easily been them. Most of our elected politicians are crooks, that is simply a byproduct of the system that we have. Politicians should get no specials treatment or protection from investigation. They are elected representatives, not gods (in spite of what they might want people to believe).", 
   {}, 
   214078, 
   null, 
   1148437140.0
  ], 
  [
   214090, 
   null, 
   "georged", 
   "The politicians are all up in arms simply because they realize that it could have just as easily been them. Most of our elected politicians are crooks, that is simply a byproduct of the system that we have. Politicians should get no specials treatment or protection from investigation. They are elected representatives, not gods (in spite of what they might want people to believe).\n\n \n If only the blind patriots would realize that fact of life they might have a chance at salvaging some of their standard of living. But that's not going to happen. Executive and congressional immunity will be demanded to protect the public.", 
   {}, 
   214086, 
   null, 
   1148440620.0
  ], 
  [
   214278, 
   null, 
   "snakespit", 
   "If only the blind patriots would realize that fact of life they might have a chance at salvaging some of their standard of living. But that's not going to happen. Executive and congressional immunity will be demanded to protect the public.\n\n Agreed, but with the sheeple perpetuating the 2 party system, we have no way to change it. Garbage in, garbage out. Our elected representatives are simply a reflection of the XXXXXX that elect them in the first place. Perhaps we should have some basic cognitive testing required before people are allowed to vote.", 
   {}, 
   214090, 
   null, 
   1148537460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Now EVERYBODY wants to be above the law.", 
  "url": "http://www.4forums.com/political/current-events-debates/8156-now-everybody-wants-above-law.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8156, 
  "discussion_files": [
   [
    "19411.html", 
    "http://www.4forums.com/political/current-events-debates/8156-now-everybody-wants-above-law-print.html"
   ]
  ], 
  "identifier": 8156
 }
]