[
 [
  [
   214064, 
   null, 
   "angryattheworld", 
   "I copied and pasted the following article from the Church of Euthanasia website. I am not providing a link because the website itself is full of ironic, funny stuff that a lot of people will (and do!) take seriously and fail to understand. I call it a s.d2 site. That means if you're not 2 (or more) standard deivations above the norm you're unlikely to get the meaning of the site and instead will simply become confused, annoyed or angry. Hence, no url. \n \n \n \n The Case Against Babies \n by Joy Williams\n Babies, babies, babies. There's a plague of babies. Too many rabbits or elephants or mustangs or swans brings out the myxomatosis, the culling guns, the sterility drugs, the scientific brigade of egg smashers. Other species can 'strain their environments' or 'overrun their range' or clash with their human 'neighbours', but human babies are always welcome at life's banquet. Welcome, Welcome, Welcome--Live Long and Consume! You can't draw the line when it comes to babies because . . . where are you going to draw the line? Consider having none or one and be sure to stop after two the organization Zero Population Growth suggests politely. Can barely hear them what with all the babies squalling. Hundreds of them popping out every minute. Ninety-seven million of them each year. While legions of other biological life forms go extinct (or, in the creepy phrase of ecologists, 'wink out'), human life bustles self-importantly on. Those babies just keep coming! They've gone way beyond being 'God's gift'; they've become entitlements. Everyone's having babies, even women who can't have babies, particularly women who can't have babies--they're the ones who sweep fashionably along the corridors of consumerism with their double-wide strollers, stuffed with twins and triplets. (Women push those things with the effrontery of someone piloting a bulldozer, which strollers uncannily bring to mind.) When you see twins or triplets do you think awahhh or owhoo or that's sort of cool, that's unusual, or do you think that woman dropped a wad on in vitro fertilization, twenty-five, thirty thousand dollars at least . . . ? \n \n The human race hardly needs to be more fertile, but fertility clinics are booming. The new millionaires are the hot-shot fertility doctors who serve anxious gottahavababy women, techno-shamans who have become the most important aspect of the baby process, giving women what they want: BABIES. (It used to be a mystery what women wanted, but no more . . . Nietzsche was right . . . ) Ironically--though it is far from being the only irony in this baby craze--women think of themselves as being successful, personally fulfilled when they have a baby, even if it takes a battery of men in white smocks and lots of hormones and drugs and needles and dishes and mixing and inserting and implanting to make it so. Having a baby means individual completion for a woman. What do boys have to do to be men? Sleep with a woman. Kill something. Yes, killing something, some luckless deer, duck, bear, pretty much anything large-ish in the animal kingdom, or even another man, appropriate in times of war, has ushered many a lad into manhood. But what's a woman to do? She gets to want to have a baby. \n \n While much effort has been expended in Third World countries educating women into a range of options which does not limit their role merely to bearing children, well-off, educated and indulged American women are clamouring for babies, babies, BABIES to complete their status. They've had it all and now they want a baby. And women over thirty-five want them NOW. They're the ones who opt for the aggressive fertility route, they're impatient, they're sick of being laissez-faire about this. Sex seems such a laborious way to go about it. At this point they don't want to endure all that intercourse over and over and maybe get no baby. What a waste of time! And time's awasting. A life with no child would be a life perfecting hedonism a forty-something infertile woman said, now the proud owner of pricey twins. Even women who have the grace to submit to fate can sound wistful. It's not so much that I wish that I had children now, a travel writer said, but that I wish I had had them. I hate to fail at anything. Women are supposed to wish and want and not fail. (Lesbians want to have babies too and when lesbians have babies watch out! They lay names on them like Wolf.) \n \n The eighties were a decade when it was kind of unusual to have a baby. Oh, the lower classes still had them with more or less gusto, but professionals did not. Having a baby was indeed so quaintly rebellious and remarkable that a publishing niche was developed for men writing about babies, their baby, their baby's first year in which every single day was recorded (he slept through the night . . . he didn't sleep through the night . . . ). The writers would marvel over the size of their infant's scrotum; give advice on how to tip the obstetrician (not a case of booze, a clock from Tiffany's is nicer); and bemusedly admit that their baby exhibited intelligent behaviour like rolling over, laughing and showing fascination with the TV screen far earlier than normal children. Aside from the talk about the poopie and the rashes and the cat's psychological decline, these books frequently contained a passage, an overheard bit of Mommy-to-Baby monologue along these lines: I love you so much I don't ever want you to have teeth or stand up or walk or go on dates or get married. I want you to stay right here with me and be my baby . . . Babies are one thing. Human beings are another. We have way too many human beings. Almost everyone knows this. \n \n Adoption was an eighties thing. People flying to Chile, all over the globe, God knows where, returning triumphantly with their BABY. It was difficult, adventurous, expensive and generous. It was trendy then. People were into adopting bunches of babies in all different flavours and colours (Korean, Chinese, part-Indian--part-Indian was very popular; Guatemalan--Guatemalan babies are way cute). Adoption was a fad, just like the Cabbage Patch dolls which fed the fad to tens of thousands of pre-pubescent girl consumers. \n \n Now it is absolutely necessary to digress for a moment and provide an account of this marketing phenomenon. These fatuous-faced soft-sculpture dolls were immensely popular in the eighties. The gimmick was that these dolls were 'born'; you couldn't just buy the damn things--if you wanted one you had to 'adopt' it. Today they are still being born and adopted, although at a slower rate, in Babyland General Hospital, a former medical clinic right on the fast-food and car-dealership strip in the otherwise unexceptional north Georgia town of Cleveland. There are several rooms at Babyland General. One of them is devoted to the premies (all snug in their little gowns, each in its own spiffy incubator) and another is devoted to the cabbage patch itself, a suggestive mound with a fake tree on it from which several times a day comes the announcement CABBAGE IN LABOUR! A few demented moments later, a woman in full nurse regalia appears from a door in the tree holding a brand-new Cabbage Patch Kid by the feet and giving it a little whack on the bottom. All around her in the fertile patch are happy little soft heads among the cabbages. Each one of these things costs $175, and you have to sign papers promising to care for it and treasure it forever. There are some cheesy dolls in boxes that you wouldn't have to adopt, but children don't want those--they want to sign on the line, want the documentation, the papers. The dolls are all supposed to be different but they certainly look identical. They've got tiny ears, big eyes, a pinched rictus of a mouth and lumpy little arms and legs. The colours of the cloth vary for racial verisimilitude, but their expressions are the same. They're glad to be here and they expect everything. \n \n But these are just dolls, of course. The real adopted babies who rode the wave of fashion into many hiply caring homes are children now, an entirely different kettle of fish, and though they may be providing (just as they were supposed to) great joy, they are not darling babies anymore. A baby is not really a child; a baby is a BABY, a cuddleball, representative of virility, wombrismo and humankind's unquenchable wish to outfox Death. \n \n Adoptive parents must feel a little out of it these days, so dreadfully dated in the nineties. Adoption--how foolishly sweet. It's so Benetton, so kind of naive. With adopted babies, you just don't know, it's too much of a XXXX shoot. Oh, they told you that the father was an English major at Yale and that the mother was a brilliant mathematician and harpsichordist who was just not quite ready to juggle career and child, but what are you going to think when the baby turns into a kid who rather than showing any talent whatsoever is trying to drown the dog and set national parks on fire? Adoptive parents do their best, of course, at least as far as their liberal genes allow; they look into the baby's background, they don't want just any old baby (even going to the dog and cat pound you'd want to pick and choose, right?); they want a pleasant, healthy one, someone who will appreciate the benefits of a nice environment and respond to a nurturing and attentive home. They steer away (I mean, one has to be realistic, one can't save the world) from the crack and smack babies, the physically and mentally handicapped babies, the HIV and foetal-alcoholic syndrome babies. \n \n Genes matter, more and more, and adoption is just too . . . where's the connection? Not a single DNA strand to call your own. Adoption signifies you didn't do everything you could; you were too cheap or shy or lacked the imagination to go the energetic fertility route which, when successful, would come with the assurance that some part of the Baby or Babies would be a continuation of you, or at the very least your companion, loved one, partner, whatever. \n \n I once prevented a waitress from taking away my martini glass which had a tiny bit of martini remaining in it, and she snarled, Oh, the precious liquid, before slamming it back down on the table. It's true that I probably imagined that there was more martini in the glass than there actually was (what on earth could have happened to it all?) but the precious liquid remark brings unpleasantly to mind the reverent regard in which so many people hold themselves. Those eggs, that sperm, oh precious, precious stuff! There was a terrible fright among humankind recently when some scientists suggested that an abundance of synthetic chemicals was causing lower sperm counts in human males--awful, awful, awful--but this proves not to be the case; sperm counts are holding steady and are even on the rise in New York. Los Angeles males don't fare as well (do they drink more water than beer?), nor do the Chinese who, to add insult to insult, are further found to have smaller testicles, a finding which will undoubtedly result in even more wildlife mutilation in the quest for aphrodisiacs. Synthetic chemicals do 'adversely affect' the reproductive capabilities of non-human animals (fish, birds), but this is considered relatively unimportant. It's human sperm that's held in high regard and in this overpopulated age it's become more valuable--good sperm that is, from intelligent, athletic men who don't smoke, drink, do drugs, have Aids or a history of homicide--because this overpopulated age is also the donor age. Donor sperm, donor womb, donor eggs. Think of all the eggs that are lost to menstruation every month. The mind boggles. Those precious, precious eggs, lost. (Many egg donors say they got into the business because they didn't like the idea of their eggs 'going to waste'.) They can be harvested instead and frozen for a rainy day or sold nice and fresh. One woman interviewed in the New York Times early this year has made it something of a career. I'm not going to just sit home and bake cookies for my kids, I can accomplish things, she says. No dreary nine-to-five desk job for her. She was a surrogate mother for one couple, dishing up a single baby; then she donated some eggs to another couple who had a baby; now she's pregnant with twins for yet another couple. I feel like a good soldier, as if God said to me, 'Hey girl, I've done a lot for you and now I want you to do something for Me,' this entrepreneurial breeder says. (It's sort of cute to hear God invoked, sort of for luck, or out of a lingering folksy superstition.) Egg donors are regular Jenny Appleseeds, spreading joy, doing the Lord's work and earning a few bucks all at once as well as attaining an odd sense of empowerment (I've got a bunch of kids out there, damned if I know who they all are . . . ). \n \n One of the most successful calendars of 1996 was Anne Geddes's BABIES. Each month shows the darling little things on cabbage leaves, cupped in a tulip, as little bees in a honeycomb and so on--solemn, bright-eyed babies. They look a little bewildered though, and why shouldn't they? How did they get here? They were probably mixed up in a dish. Donor eggs (vacuumed up carefully through long needles); Daddy's sperm (maybe . . . or maybe just some high-powered NY dude's); gestational carrier; the 'real' mommy waiting anxiously, restlessly on the sidelines (want to get those babies home, start buying them stuff!). Baby's lineage can be a little complicated in this one big worldwebby family. With the help of drugs like Clomid and Perganol there are an awful lot of eggs out there these days-all being harvested by those rich and clever, clever doctors in a 'simple procedure' and nailed with bull's-eye accuracy by a spermatozoon. One then gets to 'choose' among the resulting cell clumps (or the doctor gets to choose, he's the one who knows about these things), and a number of them (for optimum success) are inserted into the womb, sometimes the mother's womb and sometimes not. These fertilized eggs, unsurprisingly, often result in multiple possibilities, which can be decreased by 'selective reduction'. They're not calendar babies yet, they're embryos, and it is at this point, the multiple possibility point, that the mother-to-be often gets a little overly ecstatic, even greedy, thinking ahead perhaps to the day when they're not babies any longer, the day when they'll be able to amuse themselves by themselves like a litter of kittens or something--if there's a bunch of them all at once there'll be no need to go through that harrowing process of finding appropriate playmates for them. She starts to think Nannies probably don't charge that much more for three than for two or heaven knows we've got enough money or we wouldn't have gotten into all this in the first place. And many women at the multiple-possibility point, after having gone through pretty much all the meddling and hubris that biomedical technology has come up with, say demurely, I don't want to play God (I DON'T WANT TO PLAY GOD?) or It would be grotesque to snuff one out to improve the odds for the others or Whatever will be will be. \n \n So triplets happen, and even quads and quints (network television is still interested in quints). And as soon as the multiples, or even the less prestigious single baby, are old enough to toddle into daycare, they're responsibly taught the importance of their one and only Earth, taught the 3Rs--Reduce, Reuse, Recycle. Too many people (which is frequently considered undesirable--gimme my space!) is caused by too many people (it's only logical) but it's mean to blame the babies, you can't blame the babies, they're innocent. Those poor bean counters at the United Nations Population Fund say that at current growth rates, the world will double its population in forty years. Overpopulation poses the greatest threat to all life on earth, but most organizations concerned with this problem don't like to limit their suggestions to the most obvious one--DON'T HAVE A BABY!--because it sounds so negative. Instead, they provide additional, more positive tips for easing the pressures on our reeling environment such as car pooling or tree planting. (A portion of the proceeds from that adorable bestselling BABIES calendar goes to the Arbor Day Foundation for the planting of trees.) \n \n Some would have it that not having a baby is disallowing a human life, horribly inappropriate in this world of rights. Everyone has rights; the unborn have rights; it follows that the unconceived have rights. (Think of all those babies ###### off at the fact that they haven't even been thought of yet.) Women have the right to have babies (we've fought so hard for this), and women who can't have babies have an even bigger right to have them. These rights should be independent of marital or economic status, or age. (Fifty- and sixty-something moms tend to name their babies after the gynaecologist.) The reproduction industry wants fertility treatments to be available to anyone and says that it wouldn't all be so expensive if those recalcitrant insurance companies and government agencies like Medicare and Medicaid weren't so cost-conscious and discriminatory and would just cough up the money. It's not as though you have to take out a permit to have a baby, be licensed or anything. What about the rights of a poor, elderly, feminist cancer patient who is handicapped in some way (her car has one of those stickers . . . ) who wants to assert her right to independent motherhood and feels entitled to both artificial insemination into a gestational 'hostess' and the right to sex selection as a basis for abortion should the foetus turn out to be male when she wants a female? Huh? What about her? Or what about the fifteen-year-old of the near future who kind of wants to have her baby even though it means she'll be stuck with a kid all through high school and won't be able to go out with her friends any more who discovers through the wonders of amniocentesis and DNA analysis that the baby is going to turn out fat, and the fifteen-year-old just can't deal with fat and shouldn't have to . . . ? Out goes the baby with the bathwater. \n \n But these scenarios are involved merely with messy political or ethical issues, the problematical, somewhat gross by-products of technological and marketing advances. Let the philosophers and professional ethicists drone on and let the baby business boom. Let the courts figure it out. Each day brings another more pressing problem. Implanted with their weak-cervixed daughter's eggs and their son-in-law's sperm, women become pregnant with their own grandchildren; frozen embryos are inadvertently thawed; eggs are pirated; eggs are harvested from aborted foetuses; divorced couples battle over the fate of cryopreserved material. 'We have to have better regulation of the genetic product--eggs, sperm and embryos--so we can legally determine who owns what,' a professor of law and medicine at a California university says plaintively. (Physicians tend to oppose more regulation however, claiming that it would 'impede research'.) \n \n While high-tech nations are refining their options eugenically and quibbling litigiously, the inhabitants of low-tech countries are just having babies. The fastest growth in human numbers in all history is going to take place in a single generation, an increase of almost five billion people (all of whom started out as babies). Ninety-seven per cent of the surge is going to take place in developing countries, with Africa alone accounting for thirty-five per cent of it (the poorer the country, the higher the birth rate, that's just the way it is). These babies are begotten in more 'traditional', doubtless less desperate ways, and although they are not considered as fashion statements, they're probably loved just as much as upper-class western babies (or that singular one-per-family Chinese boy baby) and are even considered productive assets when they get a little older and can labour for the common good of their large families by exploiting more and more, scarcer and scarcer resources. \n \n The argument that western countries with their wealth and relatively low birth rate do not fuel the population crisis is, of course, fallacious. France, as national policy, urges its citizens to procreate, giving lots of subsidies and perks to those French who make more French. The US population is growing faster than that of eighteen other industrialized nations and, in terms of energy consumption, when an American couple stops spawning at two babies, it's the same as an average East Indian couple stopping at sixty-six, or an Ethiopian couple drawing the line at one thousand. \n \n Yet we burble along, procreating, and in the process suffocating thousands of other species with our selfishness. We're in a baby glut, yet it's as if we've just discovered babies, or invented them. Reproduction is sexy. Assisted reproduction is cool. The announcement that a movie star is going to have a baby is met with breathless wonder. A BABY! Old men on their third marriage regard their new babies with 'awe' and crow about the 'ultimate experience' of parenting. Bruce Springsteen found 'salvation' with the birth of his son. When in doubt, have a baby. When you've tried it all, champagne, cocaine, try a baby. Pop icons who trudged through a decade of adulation and high living confess upon motherhood, This Baby Saved My Life. Bill Gates, zillionaire founder of Microsoft, is going to have (this is so wonderful) a BABY. News commentators are already speculating: will fatherhood take away his edge, his drive; will it diminish his will to succeed, to succeed, to succeed? National Public Radio recently interviewed other high-powered CEO dads as to that ghastly possibility. \n \n It's as though, all together, in the waning years of this dying century, we collectively opened the Door of our Home and instead of seeing a friend standing there in some sweet spring twilight, someone we had invited over for drinks and dinner and a lovely civilized chat, there was Death, with those creepy little black seeds of his for planting in the garden. And along with Death we got a glimpse of ecological collapse and the coming anarchy of an over-peopled planet. And we all, in denial of this unwelcome vision, decided to slam the door and retreat to our toys and make babies--those heirs, those hopes, those products of our species' selfishness, sentimentality and global death wish.", 
   {
    "post_info": {
     "post_title": "The case against babies"
    }
   }, 
   null, 
   null, 
   1148426580.0
  ], 
  [
   214119, 
   null, 
   "Mickey Shane", 
   "snippo:\n \nEveryone has rights; the unborn have rights; it follows that the unconceived have rights. (Think of all those babies ###### off at the fact that they haven't even been thought of yet.) \n\n Pure genius!", 
   {}, 
   214064, 
   null, 
   1148481300.0
  ], 
  [
   214129, 
   null, 
   "simone", 
   "Thanks, Angry.", 
   {}, 
   214119, 
   null, 
   1148484060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The case against babies", 
  "url": "http://www.4forums.com/political/abortion-debates/8158-case-against-babies.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 8158, 
  "discussion_files": [
   [
    "3166.html", 
    "http://www.4forums.com/political/abortion-debates/8158-case-against-babies-print.html"
   ]
  ], 
  "identifier": 8158
 }
]