[
 [
  [
   214097, 
   null, 
   "megz88", 
   "Who determines what is good and what is evil? is it our society, our own self or something else? \n Again, just interested in different responses. Thnx", 
   {
    "post_info": {
     "post_title": "What is good/What is evil?"
    }
   }, 
   null, 
   null, 
   1148442420.0
  ], 
  [
   214148, 
   null, 
   "simone", 
   "Societal agreement.", 
   {}, 
   214097, 
   null, 
   1148487180.0
  ], 
  [
   214304, 
   null, 
   "Quardon7", 
   "Personal decision and societal agreement can only be the source if there is in reality no evil. Personal decision, we see from the vast amount of crime proceeding in our society, holds no action as out-of-bounds. Society is a collective of persons, and so it comes as no surprise that societies' rulings on good and evil have been as diverse as the personal scope of decisions. For both personal and societal categories good and evil are empty terms, as variable as human whims.\n \n If, therefore, it is in fact wrong to oppress women and minorities and to murder and steal, it can only be so because there is a Creator who is the standard and these things are contrary to His nature. One can only credit personal decision or societal agreement as the source of determining good and evil if one first determines that there is no good and evil in reality. To do that, you must imagine that someone should commit the most terrible crime you can imagine against the person you love the most and be prepared to say that they have done nothing wrong.", 
   {}, 
   214148, 
   null, 
   1148577720.0
  ], 
  [
   214308, 
   null, 
   "Wez", 
   "If, therefore, it is in fact wrong to oppress women and minorities and to murder and steal, it can only be so because there is a Creator who is the standard and these things are contrary to His nature.\n\n Or because our instincts, developed through evolution, tell us some actions are good/evil?\n \n Also, it could be because there was a Creator.\n \nOne can only credit personal decision or societal agreement as the source of determining good and evil if one first determines that there is no good and evil in reality. To do that, you must imagine that someone should commit the most terrible crime you can imagine against the person you love the most and be prepared to say that they have done nothing wrong.\n\n It all depends on what you mean by \"reality\", \"good\" and \"evil\" imo. To me, it's more of a linguistic question than a moral one.\n \n -Wez", 
   {}, 
   214304, 
   null, 
   1148579940.0
  ], 
  [
   214326, 
   null, 
   "simone", 
   "It benefits society to have both women and minorities as full participants in order to reap the benefits of their labors, input to the general welfare of society. Note that in societies where women are oppressed, the economies of those societies do not flourish.\n \n At the moment my only argument for letting minorities flourish is that I love foreign food and the restaurants these guys establish. I'm sorry, persons of various minorities, that I can't think of anything better at this moment.", 
   {}, 
   214308, 
   null, 
   1148586960.0
  ], 
  [
   214328, 
   null, 
   "Wez", 
   "It benefits society to have both women and minorities as full participants in order to reap the benefits of their labors, input to the general welfare of society. Note that in societies where women are oppressed, the economies of those societies do not flourish.\n\n From an economic point of view, surely it's quite useful to oppress certain minorities? For example, killing disabled people to reduce care costs is economically viable (I think?) but morally wrong imo.\n \n -Wez", 
   {}, 
   214326, 
   null, 
   1148588220.0
  ], 
  [
   216315, 
   null, 
   "Monster", 
   "The concept of good and evil is evil.\n \n This encourages polarization, dehumanization and persecution of the marginalized, among other things.", 
   {}, 
   214328, 
   null, 
   1150073520.0
  ], 
  [
   216399, 
   null, 
   "Ripskar", 
   "This \"there must be a creator\" stuff assumes that the Jews are A) telling the truth in the first place... B) They are effectively the only group on the entire planet who were told what good and evil are.\n \n If you look elsewhere there are general trends but lots of variation.\n \n Those with power make the rules, usually to their own benefit.", 
   {}, 
   216315, 
   null, 
   1150109220.0
  ], 
  [
   216435, 
   null, 
   "simone", 
   "From an economic point of view, surely it's quite useful to oppress certain minorities? For example, killing disabled people to reduce care costs is economically viable (I think?) but morally wrong imo.\n \n -Wez\nWez, do you think that offing Stephen Hawking is an economically wise thing?", 
   {}, 
   214328, 
   null, 
   1150131480.0
  ], 
  [
   216950, 
   null, 
   "Another opinion", 
   "Personal decision and societal agreement can only be the source if there is in reality no evil. Personal decision, we see from the vast amount of crime proceeding in our society, holds no action as out-of-bounds. Society is a collective of persons, and so it comes as no surprise that societies' rulings on good and evil have been as diverse as the personal scope of decisions. For both personal and societal categories good and evil are empty terms, as variable as human whims.\n \n If, therefore, it is in fact wrong to oppress women and minorities and to murder and steal, it can only be so because there is a Creator who is the standard and these things are contrary to His nature. One can only credit personal decision or societal agreement as the source of determining good and evil if one first determines that there is no good and evil in reality. To do that, you must imagine that someone should commit the most terrible crime you can imagine against the person you love the most and be prepared to say that they have done nothing wrong.\n\n There are two aspects of our human psychology that you are ignoring. The first is that there are clear trends in what humans consider bad behavior that span a wide range of religions, cultures, and philosophies - including the killing of innocents where that killing could be avoided, indiscriminant theft, etc. At last part of our sense of compassion is rooted in our very biology. I remember reading about an interesting experiment in which apes starved themselves to prevent the suffering of their fellow apes since, when they would pull a rope to get food, their fellow apes would get an electric shock. This simply shows that there are biological / instinctive trends toward compassion in our species (and in other highly developed species) that can either be nurtured or suppressed by our societies.\n \n The second point is that our sense of morality itself has a certain logic. For example, in the past (and still in some people's minds), it was assumed that women and minorities were automatically inferior in their natures - irrespective of their upbringing. They were not even given a chance to prove themselves because of these assumptions. A combination of compassion and objective reasoning helped overcome those biases. There is also the logic of the moral imperative of treating others as you would have everyone be treated (including yourself). \n \n All this says that our sense of ethics being relative does not mean that they are arbitrary. There are clear trends in our sense of good and evil that are independent of any religious considerations.", 
   {}, 
   214304, 
   null, 
   1150325460.0
  ], 
  [
   216968, 
   null, 
   "epaphras_faith", 
   "The concept of good and evil is evil.\n \n This encourages polarization, dehumanization and persecution of the marginalized, among other things.\n\n \n This doesn't make much sense. If Good and evil are truly as you describe then nothing would be either. In that case, I could smash you in the head with a miner's pick and you and your family should be quite happy because I was, after all, only doing what I wanted to do.\n \n If there is no such thing, or should be no such thing, then you eliminate any sense of responsibility. Society ceases to exist.\n \n Good and evil are real and do exist and should exist. An earlier question was how do we define good, evil, and reality. Those are the correct questions and they need to be answered in order for the discussion on this thread to be meaningful.\n \n I propose that reality is that which is actual. It can be identified either by direct observation or tested and its effects can be directly observed.\n \n Further, I propose that a standard of Good or Evil cannot be defined by humans or human constructs as then it is strictly determined by those in power and we come to the problem as before. There must be an outside of human existence third party that defines good and evil. My preference would be God would be the definer of good and evil, but that would spark a debate that does not belong in this thread. So, I would simply say Good and evil are defined by: Good, that which has the most positive impact on man as a whole to extend his existence and broaden the depth of love in the world.\n \n Evil I would say is the polar opposite.\n \n EF", 
   {}, 
   216315, 
   null, 
   1150330740.0
  ], 
  [
   217028, 
   null, 
   "snakespit", 
   "To me, good and evil are subjective values held up to our understanding and acceptance of cultural norms. \n \n I might feel for instance that human sacrifice is a barbaric evil that should never be practiced. There are some however from other cultures that might feel as if human sacrifice is a good and sacred ritual neccessary for their survival. Who is right? Both are. It depends on where you are coming from.", 
   {}, 
   216968, 
   null, 
   1150365060.0
  ], 
  [
   217043, 
   null, 
   "Steeeeve", 
   "I'll take the absolute view. Good and Evil are a set standard....I'm not saying we can always know what is good or evil but this doesn't mean there is not an absolute. With the realitive approach you can never really say something is alway \"wrong\" or \"evil\"...all you can say it something is against the values of the majority, against the law, or against your own personal thoughts.", 
   {}, 
   217028, 
   null, 
   1150381920.0
  ], 
  [
   217054, 
   null, 
   "Another opinion", 
   "I'll take the absolute view. Good and Evil are a set standard....I'm not saying we can always know what is good or evil but this doesn't mean there is not an absolute. With the realitive approach you can never really say something is alway \"wrong\" or \"evil\"...all you can say it something is against the values of the majority, against the law, or against your own personal thoughts.\n\n Since no one has been able to show any evidence or logical proof of a detailed description of good or evil, it is by default a matter of personal and public opinion. Just because one group of people say \"This is evil\" or \"This is good\" doesn't mean that it is. People ultimately judge for themselves and for them to be in agreement with you, they have to either hold those same opinions to begin with or they need to be convinced. Therefore, I believe that we always have to have good and logical reasons behind our views of good and evil. \n \n Saying \"This is evil because it is\" or \"This is evil because my religion tells me so\" is not good enough. That will not be convincing. There are many actions that the great majority of people in the world would agree with (such as the purposeful killing of innocents when that killing can be avoided). However, there are other aspects that are dependent on one's belief system. For example, many on the religious right view homosexuality as an abomination that should be stopped. The moral picture can also become very muddled in times of war or conflict. Therefore, morality cannot simply be presented as a list of statements but needs to be a discussion with arguements going back and forth. If there is enough discussion, then people might converge somewhat on their views of morality but I highly doubt that there would exist only one moral stance that would sattisfy everyone.", 
   {}, 
   217043, 
   null, 
   1150387140.0
  ], 
  [
   217069, 
   null, 
   "Adept", 
   "Good and evil are adjectives. Just like Beautiful and Ugly, or Yummy and... er... Not-yummy.\n \n Long rants detailing what is good, and what is bad, are essentially meaningless. Good and evil are just words we use to describe the world around us.", 
   {}, 
   217054, 
   null, 
   1150392720.0
  ], 
  [
   217082, 
   null, 
   "Dr_Sprocket", 
   "This doesn't make much sense. If Good and evil are truly as you describe then nothing would be either. In that case, I could smash you in the head with a miner's pick and you and your family should be quite happy because I was, after all, only doing what I wanted to do.\n \n If there is no such thing, or should be no such thing, then you eliminate any sense of responsibility. Society ceases to exist.\n \n Good and evil are real and do exist and should exist. An earlier question was how do we define good, evil, and reality. Those are the correct questions and they need to be answered in order for the discussion on this thread to be meaningful.\n \n I propose that reality is that which is actual. It can be identified either by direct observation or tested and its effects can be directly observed.\n \n Further, I propose that a standard of Good or Evil cannot be defined by humans or human constructs as then it is strictly determined by those in power and we come to the problem as before. There must be an outside of human existence third party that defines good and evil. My preference would be God would be the definer of good and evil, but that would spark a debate that does not belong in this thread. So, I would simply say Good and evil are defined by: Good, that which has the most positive impact on man as a whole to extend his existence and broaden the depth of love in the world.\n \n Evil I would say is the polar opposite.\n \n EF\nI did not say good and evil do not exist or should not exist I said they are both evil.\n \n When people begin to radically polarize they become equally extremist.\n \n Encouraging people to use a weapon like evil and an excuse to use it is a step in the wrong direction.\n \n Aside from that good and evil are human concepts only exist in the mind and in reality are meaningless.", 
   {}, 
   216968, 
   null, 
   1150394880.0
  ], 
  [
   217093, 
   null, 
   "Another opinion", 
   "Good and evil are adjectives. Just like Beautiful and Ugly, or Yummy and... er... Not-yummy.\n \n Long rants detailing what is good, and what is bad, are essentially meaningless. Good and evil are just words we use to describe the world around us.\n\n Good and Evil are adjectives that describe the extremes of the moral spectrum. I would be quite dubious about there being any human activity that falls purely into those extremes. Most people who commit horrendous acts that most would classify as \"evil\" often have reasons which they give to justify their actions. Those reasons are often based on distorted logic or false assumptions, but these people often see themselves as being \"good\" - just think of all those suicide bombers as an example.\n \n I think that the labelling of things as Good and Evil is therefore too simplistic. However, a general discussion about morality (with all of its shades of gray) can be a useful endeavor. Too often, the term \"morality\" is assumed to mean the strict moral rules of the religious right. However, we all have our sense of morality - we just may not call it that. Overall, I think a moral discussion based on reasons and logic (as opposed to simple statements) could be useful.", 
   {}, 
   217069, 
   null, 
   1150396920.0
  ], 
  [
   217128, 
   null, 
   "Dr_Sprocket", 
   "How about this:\n \n There is no such thing as good just varying degrees of evil.\n \n Hail Satan!", 
   {
    "post_info": {
     "post_title": "If you read this you will become evil."
    }
   }, 
   217093, 
   null, 
   1150401600.0
  ], 
  [
   217154, 
   null, 
   "Another opinion", 
   "How about this:\n \n There is no such thing as good just varying degrees of evil.\n \n\n I once had a discussion with someone that claimed that there are no truly altruistic acts. Actions that someone takes which, on the surface, may look like they are only meant to benefit others still give benefits to that person through the pleasure they get from giving. He claimed there are no altruistic actions that give absolutely no benefit to the giver. This point of view doesn't go anywhere near as far as your flippant comment but, still, it's an interesting thought.", 
   {}, 
   217128, 
   null, 
   1150404600.0
  ], 
  [
   217159, 
   null, 
   "Dr_Sprocket", 
   "I once had a discussion with someone that claimed that there are no truly altruistic acts. Actions that someone takes which, on the surface, may look like they are only meant to benefit others still give benefits to that person through the pleasure they get from giving. He claimed there are no altruistic actions that give absolutely no benefit to the giver. This point of view doesn't go anywhere near as far as your flippant comment but, still, it's an interesting thought.\n\n \n The limit of the capacity to perform altruistic acts is when they produce a declining population trend, something like that.", 
   {}, 
   217154, 
   null, 
   1150406580.0
  ], 
  [
   217226, 
   null, 
   "epaphras_faith", 
   "I did not say good and evil do not exist or should not exist I said they are both evil.\n \n When people begin to radically polarize they become equally extremist.\n \n Encouraging people to use a weapon like evil and an excuse to use it is a step in the wrong direction.\n \n Aside from that good and evil are human concepts only exist in the mind and in reality are meaningless.\n\n \n This is a logical non-sequitor. GOod and evil cannot both be evil. That is the same as saying they do not exist. They must be polar opposites. If they are the same thing or are varying degrees of one thing then they cannot exist. Why? Because they exist only because one relates to the other. If there is evil, then by definition there MUST be good. You cannot say all is evil. In that case there is neither good nor evil only neutral.\n \n Good and evil are real. There is that which is good and that which is evil. It is not and cannot be in the eye of the beholder. Here is why. If it is in the eye of the beholder (good and evil that is) then good can be called evil and evil good and again the distinction, which occurs because they exist in relation to each other only, ceases to exist and they cease to exist and then it simply does not matter what you or I do. I can kill you and that should be just fine, because after all, there is nothing wrong with it, it is not evil, it is not good, it simply is.\n \n EF", 
   {}, 
   217082, 
   null, 
   1150418520.0
  ], 
  [
   217232, 
   null, 
   "Dr_Sprocket", 
   "This is a logical non-sequitor. GOod and evil cannot both be evil. That is the same as saying they do not exist. They must be polar opposites. If they are the same thing or are varying degrees of one thing then they cannot exist. Why? Because they exist only because one relates to the other. If there is evil, then by definition there MUST be good. You cannot say all is evil. In that case there is neither good nor evil only neutral.\n \n Good and evil are real. There is that which is good and that which is evil. It is not and cannot be in the eye of the beholder. Here is why. If it is in the eye of the beholder (good and evil that is) then good can be called evil and evil good and again the distinction, which occurs because they exist in relation to each other only, ceases to exist and they cease to exist and then it simply does not matter what you or I do. I can kill you and that should be just fine, because after all, there is nothing wrong with it, it is not evil, it is not good, it simply is.\n \n EF\n\n \n Well ya but, it only exists for people.\n \n And their grasp of it is hazy at best.", 
   {}, 
   217226, 
   null, 
   1150420140.0
  ], 
  [
   217279, 
   null, 
   "Adept", 
   "I once had a discussion with someone that claimed that there are no truly altruistic acts. Actions that someone takes which, on the surface, may look like they are only meant to benefit others still give benefits to that person through the pleasure they get from giving. He claimed there are no altruistic actions that give absolutely no benefit to the giver. \n\n \n A claim I whole-heartedly agree with.", 
   {}, 
   217154, 
   null, 
   1150444920.0
  ], 
  [
   217343, 
   null, 
   "Love Never Dies", 
   "This is a logical non-sequitor. GOod and evil cannot both be evil. That is the same as saying they do not exist. They must be polar opposites. If they are the same thing or are varying degrees of one thing then they cannot exist. Why? Because they exist only because one relates to the other. If there is evil, then by definition there MUST be good. You cannot say all is evil. In that case there is neither good nor evil only neutral.\n \n Good and evil are real. There is that which is good and that which is evil. It is not and cannot be in the eye of the beholder. Here is why. If it is in the eye of the beholder (good and evil that is) then good can be called evil and evil good and again the distinction, which occurs because they exist in relation to each other only, ceases to exist and they cease to exist and then it simply does not matter what you or I do. I can kill you and that should be just fine, because after all, there is nothing wrong with it, it is not evil, it is not good, it simply is.\n \n EF\n\n \n Good is not evil, it simply does not exist at all.\n \n Only evil exists.", 
   {}, 
   217226, 
   null, 
   1150475940.0
  ], 
  [
   217344, 
   null, 
   "Love Never Dies", 
   "The limit of the capacity to perform altruistic acts is when they produce a declining population trend, something like that.\n\n \n Among altruistic bugs and animals perhaps.", 
   {}, 
   217159, 
   null, 
   1150476120.0
  ], 
  [
   217350, 
   null, 
   "Dr_Sprocket", 
   "There is that which is good and that which is evil.\n \n EF\n\n \n What is the logic used to decide what is good and what is evil.\n \n Is there some device?\n \n Or do you just have to memorize a big list.", 
   {}, 
   217226, 
   null, 
   1150476960.0
  ], 
  [
   217448, 
   null, 
   "epaphras_faith", 
   "Good is not evil, it simply does not exist at all.\n \n Only evil exists.\n\n \n You missed the part of my post and the argument that says for one to exist the other must also. They are nothing without each other to compare with as they are comparative statements. Good means nothing if evil does not also exist. The opposite is also true.\n \n EF", 
   {}, 
   217343, 
   null, 
   1150495260.0
  ], 
  [
   217454, 
   null, 
   "epaphras_faith", 
   "What is the logic used to decide what is good and what is evil.\n \n Is there some device?\n \n Or do you just have to memorize a big list.\n\n \n Now this gets tricky, especially if you want to keep \"religious\" references out of it. The decision can only be made \"correctly\" by the one who defines good and evil. If people define it, then it fluctuates and flitters and essentially comes to the point of irrelevance. It is one of the reasons I believe God exists. I know Good and Evil. I have a sense of it. Since humans are all imperfect (and I think that is a reasonable assumption, very few I know would actually claim perfection and if they did their close relationships would quickly disavow them of such a notion) they cannot possibly correctly define it all the time. Therefore it must have come from somewhere else. There is no evidence to show that the knowledge of good and evil is genetically coded. Everyone simply has it, and a different notion of that as unique as the individual.\n \n My opinion is that it must be GOd that defines good and evil.", 
   {}, 
   217350, 
   null, 
   1150495620.0
  ], 
  [
   217472, 
   null, 
   "Love Never Dies", 
   "Now this gets tricky, especially if you want to keep \"religious\" references out of it. The decision can only be made \"correctly\" by the one who defines good and evil. If people define it, then it fluctuates and flitters and essentially comes to the point of irrelevance. It is one of the reasons I believe God exists. I know Good and Evil. I have a sense of it. Since humans are all imperfect (and I think that is a reasonable assumption, very few I know would actually claim perfection and if they did their close relationships would quickly disavow them of such a notion) they cannot possibly correctly define it all the time. Therefore it must have come from somewhere else. There is no evidence to show that the knowledge of good and evil is genetically coded. Everyone simply has it, and a different notion of that as unique as the individual.\n \n My opinion is that it must be GOd that defines good and evil.\n\n \n Most of that seams reasonable.\n \n What is the definition of evil?", 
   {}, 
   217454, 
   null, 
   1150499580.0
  ], 
  [
   217486, 
   null, 
   "epaphras_faith", 
   "Most of that seams reasonable.\n \n What is the definition of evil?\n\n \n The logical \"NOT\".", 
   {}, 
   217472, 
   null, 
   1150502640.0
  ], 
  [
   217496, 
   null, 
   "Love Never Dies", 
   "The logical \"NOT\".\n\n \n Forgive me, please explain.", 
   {}, 
   217486, 
   null, 
   1150504680.0
  ], 
  [
   217500, 
   null, 
   "epaphras_faith", 
   "Forgive me, please explain.\n\n \n Not is a logical operator. To say something is NOT 1 is to say that something is anything but 1.\n \n You ask what is evil and the answer is that which is NOT good.\n \n \n Good is defined. Evil is only defined as it exists in relation to good.\n \n EF", 
   {}, 
   217496, 
   null, 
   1150505160.0
  ], 
  [
   217508, 
   null, 
   "Dr_Sprocket", 
   "Not is a logical operator. To say something is NOT 1 is to say that something is anything but 1.\n \n You ask what is evil and the answer is that which is NOT good.\n \n \n Good is defined. Evil is only defined as it exists in relation to good.\n \n EF\n\n \n Ok, what is good?", 
   {}, 
   217500, 
   null, 
   1150506780.0
  ], 
  [
   217767, 
   null, 
   "epaphras_faith", 
   "Ok, what is good?\n\n \n My opinion would be God.\n \n EF", 
   {}, 
   217508, 
   null, 
   1150748700.0
  ], 
  [
   217819, 
   null, 
   "Dr_Sprocket", 
   "My opinion would be God.\n \n EF\n\n Well I am an atheist so...\n \n Seriously, is there some kind of logical definition of good?\n \n I have found this very interesting so far so don't bail on me now.", 
   {
    "unicode_changes_made": true
   }, 
   217767, 
   null, 
   1150758780.0
  ], 
  [
   218051, 
   null, 
   "epaphras_faith", 
   "Well I am an atheist so...\n \n Seriously, is there some kind of logical definition of good?\n \n I have found this very interesting so far so don't bail on me now.\n\n \n I wasn't trying to bail on you. Without resorting to a dictionary, which you are perfectly capable of on your own, I chose God. I can tell you why I chose that if you like, it is strictly from my point of view and not trying to sell you anything or convert you. It is just coming from me. Whether or not you choose to believe it is entirely up to you.\n \n Let me give you the why...One of the phrases I like is this \"Greater love has no man than he should give his life for a friend\". That is a pretty good definition in my opinion. I would call that good. However, even better is this, \"But while we were still enemies Christ died for me\". Sort of scripture paraphrases, but they illustrate my point.\n \n I as a human would be doing good if I were willing to lay down my life for a friend. I would say that would be Love and love is good. HOwever, imagine how good then it must be for someone who is willing to love his enemy to the point of laying down his life for them.\n \n I suppose the bottom line is Love is good. That might suit you better than God is good. Let us use Love is good.\n \n The problem is we then get into the problem of defining what is love. I will eventually come back to God. How do you as an atheist define Love or Good or both?\n \n EF\n \n PS, by the way you asked for a \"logical definition\" and logic is a process and does not define, but rather uses what is defined to draw conclusions.", 
   {
    "unicode_changes_made": true
   }, 
   217819, 
   null, 
   1150845720.0
  ], 
  [
   218060, 
   null, 
   "Dr_Sprocket", 
   "I wasn't trying to bail on you. Without resorting to a dictionary, which you are perfectly capable of on your own, I chose God. I can tell you why I chose that if you like, it is strictly from my point of view and not trying to sell you anything or convert you. It is just coming from me. Whether or not you choose to believe it is entirely up to you.\n \n Let me give you the why...One of the phrases I like is this \"Greater love has no man than he should give his life for a friend\". That is a pretty good definition in my opinion. I would call that good. However, even better is this, \"But while we were still enemies Christ died for me\". Sort of scripture paraphrases, but they illustrate my point.\n \n I as a human would be doing good if I were willing to lay down my life for a friend. I would say that would be Love and love is good. HOwever, imagine how good then it must be for someone who is willing to love his enemy to the point of laying down his life for them.\n \n I suppose the bottom line is Love is good. That might suit you better than God is good. Let us use Love is good.\n \n The problem is we then get into the problem of defining what is love. I will eventually come back to God. How do you as an atheist define Love or Good or both?\n \n EF\n \n PS, by the way you asked for a \"logical definition\" and logic is a process and does not define, but rather uses what is defined to draw conclusions.\n\n I was kind of hoping that we would end up with a neat little equation.\n \n I looked it up in the dictionary and while the definition is precisely delivered I am some how unsatisfied with it. \n \n What if something is good for you but bad for me does this make the situation lye somewhere between good and evil?\n \n Is a thing ether good or evil?\n \n What about natural disasters are they evil?", 
   {}, 
   218051, 
   null, 
   1150848300.0
  ], 
  [
   218064, 
   null, 
   "epaphras_faith", 
   "I was kind of hoping that we would end up with a neat little equation.\n \n I looked it up in the dictionary and while the definition is precisely delivered I am some how unsatisfied with it. \n \n What if something is good for you but bad for me does this make the situation lye somewhere between good and evil?\n \n Is a thing ether good or evil?\n \n What about natural disasters are they evil?\n\n \n Excellent philosophical questions.\n \n Good and Evil are relational things. We often associate such characterizations things that are not people. This is called personification. Events are not good or evil, they simply are. Tragic perhaps, but neither good nor evil. Good and evil have to do with a person. you or I can be good or evil, we can behave in ways that are good or evil.\n \n As to something being good for me and evil for you, I would submit that it then becomes evil. This is why I came down on the side of Love. A way of defining love (and it is a bit cheesy and inadequate) is doing something for someone elses best regardless of the cost. Here, there is a cost to me in order that I might achieve good for you. Love always involves a cost. Forgivenss is another idea that is costly for me and good for you. By the way though, paying the cost is also good for me.\\\n \n It is very difficult for me to relate to this topic without involving God. I keep coming back to a person that is better than I. If good and evil are relative and not objective then What is good for me is good regardless of what it does to you.\n \n What are your thoughts?\n \n EF", 
   {}, 
   218060, 
   null, 
   1150848900.0
  ], 
  [
   218086, 
   null, 
   "Dr_Sprocket", 
   "Excellent philosophical questions.\n \n Good and Evil are relational things. We often associate such characterizations things that are not people. This is called personification. Events are not good or evil, they simply are. Tragic perhaps, but neither good nor evil. Good and evil have to do with a person. you or I can be good or evil, we can behave in ways that are good or evil.\n \n As to something being good for me and evil for you, I would submit that it then becomes evil. This is why I came down on the side of Love. A way of defining love (and it is a bit cheesy and inadequate) is doing something for someone elses best regardless of the cost. Here, there is a cost to me in order that I might achieve good for you. Love always involves a cost. Forgivenss is another idea that is costly for me and good for you. By the way though, paying the cost is also good for me.\\\n \n It is very difficult for me to relate to this topic without involving God. I keep coming back to a person that is better than I. If good and evil are relative and not objective then What is good for me is good regardless of what it does to you.\n \n What are your thoughts?\n \n EF\n\n I was kind of thinking something along the lines of self organizing systems (I think mathematicians call it complexity theory) being of good (\"life is good\" one might say) and the destruction or injury of the same might be evil something like that.\n \n I haven't quite put my thinking together on it yet but I am thinking about things like complexity, chaos, order, entropy, so on.\n \n More down to earth, I once heard a theologian define evil as pain.\n \n In other words things evil always eventually result in pain.\n \n The net pain generated by any evil act my be felt by the evil doer himself or not, but at some point someone or group of someones suffers.\n \n I found that somewhat satisfying but all of it still leaves me with a lot wondering to do.\n \n You ever play with fractals?\n \n http://en.wikipedia.org/wiki/Self-organization", 
   {
    "unicode_changes_made": true
   }, 
   218064, 
   null, 
   1150852860.0
  ], 
  [
   218267, 
   null, 
   "epaphras_faith", 
   "I was kind of thinking something along the lines of self organizing systems (I think mathematicians call it complexity theory) being of good (\"life is good\" one might say) and the destruction or injury of the same might be evil something like that.\n \n I haven't quite put my thinking together on it yet but I am thinking about things like complexity, chaos, order, entropy, so on.\n \n More down to earth, I once heard a theologian define evil as pain.\n \n In other words things evil always eventually result in pain.\n \n The net pain generated by any evil act my be felt by the evil doer himself or not, but at some point someone or group of someones suffers.\n \n I found that somewhat satisfying but all of it still leaves me with a lot wondering to do.\n \n You ever play with fractals?\n \n http://en.wikipedia.org/wiki/Self-organization\n\n \n The self organization info is interesting. I have done a little with fractals. HOwever, I was a thermo guy in college and the disorder was always more important. I am still not certain how this would lead to good. Good in relation to what?\n \n Lets examine any event, say a man crosses the road. You can actually pick any event you want. Is it good or bad? On what do you base that? Good for whom? Is it then also bad for someone else?\n \n This is what I was saying earlier when determining good or bad. If you say that an event tends to lead to increased order in the universe, is that necessarily a good thing? Based on who's idea of good? If we were all to move toward perfect order and everything in the universe tended that way (taking the logical extreme in order to examine the idea) then that would still require the elimination of all energy. The reason self organization happens on the microscopic level is that it happens in an open system where energy can leave from the thing increasing in order. In the extreme that means that all of the energy in the universe goes away. Is that good?\n \n If however, everything tends toward disorder then the energy level increases to a maximum. We have maximum disorder and maximum energy. Is that good?\n \n You see the problem. When good and evil are determined by events then the determination is a RELATIVE one as opposed to an objective one. If you go that route, then you come back to the idea that there is no such thing as good and evil. The problem with that is, then why do we have any sense of it all? What is the \"evolutionary\" concept of it. It was conceived of long before christianity or even judaism (or others) as seen in various writings from caves etc. Good and evil are depicted in ancient aztec, ancient egypt, and even before man became society based.\n \n By the way, I am thoroughly enjoying this particular debate and discussion. \n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   218086, 
   null, 
   1150924080.0
  ], 
  [
   218690, 
   null, 
   "Dr_Sprocket", 
   "The self organization info is interesting. I have done a little with fractals. HOwever, I was a thermo guy in college and the disorder was always more important. I am still not certain how this would lead to good. Good in relation to what?\n \n Lets examine any event, say a man crosses the road. You can actually pick any event you want. Is it good or bad? On what do you base that? Good for whom? Is it then also bad for someone else?\n \n This is what I was saying earlier when determining good or bad. If you say that an event tends to lead to increased order in the universe, is that necessarily a good thing? Based on who's idea of good? If we were all to move toward perfect order and everything in the universe tended that way (taking the logical extreme in order to examine the idea) then that would still require the elimination of all energy. The reason self organization happens on the microscopic level is that it happens in an open system where energy can leave from the thing increasing in order. In the extreme that means that all of the energy in the universe goes away. Is that good?\n \n If however, everything tends toward disorder then the energy level increases to a maximum. We have maximum disorder and maximum energy. Is that good?\n \n You see the problem. When good and evil are determined by events then the determination is a RELATIVE one as opposed to an objective one. If you go that route, then you come back to the idea that there is no such thing as good and evil. The problem with that is, then why do we have any sense of it all? What is the \"evolutionary\" concept of it. It was conceived of long before christianity or even judaism (or others) as seen in various writings from caves etc. Good and evil are depicted in ancient aztec, ancient egypt, and even before man became society based.\n \n By the way, I am thoroughly enjoying this particular debate and discussion. \n \n EF\n\n I need to think about this more.", 
   {}, 
   218267, 
   null, 
   1151078880.0
  ], 
  [
   218763, 
   null, 
   "epaphras_faith", 
   "I need to think about this more.\n\n \n I was just about to answer you, but it looks like you have edited?\n \n EF", 
   {}, 
   218690, 
   null, 
   1151095020.0
  ], 
  [
   218781, 
   null, 
   "Dr_Sprocket", 
   "I was just about to answer you, but it looks like you have edited?\n \n EF\n\n \n Yea, when I said I haven't quite put my thinking together on it before I wasn't joken!", 
   {
    "unicode_changes_made": true
   }, 
   218763, 
   null, 
   1151103960.0
  ], 
  [
   218791, 
   null, 
   "epaphras_faith", 
   "Yea, when I said I haven't quite put my thinking together on it before I wasn't joken!\n\n \n I will be back to the board after the weekend. So take your time.\n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   218781, 
   null, 
   1151106900.0
  ], 
  [
   218946, 
   null, 
   "Dr_Sprocket", 
   "I will be back to the board after the weekend. So take your time.\n \n EF\n\n Ok, here is what I have so far.\n \n First:\n \n Does good exist outside of the human mind, (excluding god)?\n \n I think it does.\n \n There was a gorilla named Koko who was taught sign language.\n \n Koko clearly displayed an understanding of the concept of good.\n \n I know animals have feelings like I do, my dog wags his tail when he is happy.\n \n I can't be sure but I would also say he probably has some rudimentary understanding of what good is too.\n \n This is kind of a stretch but maybe all life \"understands\" good as well.\n \n When things are good, life flourishes.\n \n Assuming we agree we could now say that, good does indeed exist outside of the human mind. \n \n Second:\n \n Imagine you hold a glass sphere in each hand.\n \n Within each sphere exists an entire universe.\n \n One of these universes is like ours, there is life.\n \n The other is completely lifeless.\n \n In the lifeless universe there is no good, it's just a bunch of rocks and dirt floating in space.\n \n In the other there are people like us with an idea or concept of good.\n \n This universe has good in it. \n \n That's all I have so far.\n \n Your thoughts?\n \n As the necessary materials to make a person or even humble \"rocks and dirt\" are only created in nova and super nova, my example is obviously impossible but it has lead me to have some peculiar thoughts.\n \n Perhaps a universe without life is as impossible as one with out stairs, given enough time.\n \n Carl Sagan used to say that we are all made of stair stuff.\n \n Perhaps we have always known this with out realizing it.\n \n We use almost the same word to describe our continuation of life: \"my son.\"\n \n In a way, we are all sons of a sun, so to speak.", 
   {
    "unicode_changes_made": true
   }, 
   218791, 
   null, 
   1151242260.0
  ], 
  [
   218973, 
   null, 
   "Wraith", 
   "This doesn't make much sense. If Good and evil are truly as you describe then nothing would be either. In that case, I could smash you in the head with a miner's pick and you and your family should be quite happy because I was, after all, only doing what I wanted to do.\n\n \n You're mixing the subjective with the objective.\n \n There is no objective evil hence your act wasn't objectively evil, you will however anger his family who have social attachments, and emotional investment in the individual so they'll likely think negatively towards you.\n \n Many humans are barely able to think rationally especially when loved one's are involved hence what they *should* think doesn't really matter to them.\n \n \n I also notice you seem to wish to equate happiness with good and evil with suffering.\n \n Interesting that many religious people often equate acts which cause people to feel happy as 'evil'.\n \n Also\n \n It is often that I see religious people espousing acts which cause suffering to individuals as 'good'.", 
   {}, 
   218946, 
   null, 
   1151257560.0
  ], 
  [
   219145, 
   null, 
   "simone", 
   "My opinion would be God.\n \n EF\nGod is good and evil. Not good.", 
   {}, 
   217767, 
   null, 
   1151337960.0
  ], 
  [
   219200, 
   null, 
   "epaphras_faith", 
   "God is good and evil. Not good.\n\n \n Interesting assertion.", 
   {}, 
   219145, 
   null, 
   1151353680.0
  ], 
  [
   219202, 
   null, 
   "epaphras_faith", 
   "You're mixing the subjective with the objective.\n \n There is no objective evil hence your act wasn't objectively evil, you will however anger his family who have social attachments, and emotional investment in the individual so they'll likely think negatively towards you.\n \n Many humans are barely able to think rationally especially when loved one's are involved hence what they *should* think doesn't really matter to them.\n \n \n I also notice you seem to wish to equate happiness with good and evil with suffering.\n \n Interesting that many religious people often equate acts which cause people to feel happy as 'evil'.\n \n Also\n \n It is often that I see religious people espousing acts which cause suffering to individuals as 'good'.\n\n \n Actually, I do not equate happiness with good and evil with suffering. Both suffering and happines occur from things that are good. They are separate concepts.\n \n You make an assertion that there is no objective evil. It is objective just defined off of Who (in my opinion) is good. It is defined as the opposite of him. That is its objective definition.", 
   {}, 
   218973, 
   null, 
   1151353800.0
  ], 
  [
   219206, 
   null, 
   "epaphras_faith", 
   "Ok, here is what I have so far.\n \n First:\n \n Does good exist outside of the human mind, (excluding god)?\n \n I think it does.\n \n There was a gorilla named Koko who was taught sign language.\n \n Koko clearly displayed an understanding of the concept of good.\n \n I know animals have feelings like I do, my dog wags his tail when he is happy.\n \n I can't be sure but I would also say he probably has some rudimentary understanding of what good is too.\n \n This is kind of a stretch but maybe all life \"understands\" good as well.\n \n When things are good, life flourishes.\n \n Assuming we agree we could now say that, good does indeed exist outside of the human mind. \n \n Second:\n \n Imagine you hold a glass sphere in each hand.\n \n Within each sphere exists an entire universe.\n \n One of these universes is like ours, there is life.\n \n The other is completely lifeless.\n \n In the lifeless universe there is no good, it's just a bunch of rocks and dirt floating in space.\n \n In the other there are people like us with an idea or concept of good.\n \n This universe has good in it. \n \n That's all I have so far.\n \n Your thoughts?\n \n As the necessary materials to make a person or even humble \"rocks and dirt\" are only created in nova and super nova, my example is obviously impossible but it has lead me to have some peculiar thoughts.\n \n Perhaps a universe without life is as impossible as one with out stairs, given enough time.\n \n Carl Sagan used to say that we are all made of stair stuff.\n \n Perhaps we have always known this with out realizing it.\n \n We use almost the same word to describe our continuation of life: \"my son.\"\n \n In a way, we are all sons of a sun, so to speak.\n\n \n You need to pull away from the idea that happiness equals good. That is not always the case. \n \n Carl Sagan did say we are all made of star stuff and even in christian doctrine that would be true. But there is a difference between one that comes about purely by accident and one that is specifically created for a purpose and a good purpose at that.\n \n You have shown that good potentially exists outside the human mind, however you have not shown that what you say is good is indeed actually good. To what standard do you compare it to make that determination.\n \n You see that is my point precisely. To make a determination of good or evil there MUST be a standard. If there is not a standard (objective) reality for comparison then it simply does not exist. \n \n One might then say, well then it doesn't exist. But you would be hard pressed given empirical evidence to prove that one. Good and evil exist. It is clear everytime a news story comes on for some heinous crime. People have a natural desire to determine good and evil. Why? Because there is good and evil. If there were no good and evil then the need for its determination, evolutionarily speaking, actually becomes counter productive and would cause more war, famine, etc. It would cause the species to die not survive. So you see, even from the philosophy of evolution thinking, good and evil must exist and must have an objective standard.\n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   218946, 
   null, 
   1151354220.0
  ], 
  [
   219241, 
   null, 
   "Dr_Sprocket", 
   "You need to pull away from the idea that happiness equals good. That is not always the case. \n \n Carl Sagan did say we are all made of star stuff and even in christian doctrine that would be true. But there is a difference between one that comes about purely by accident and one that is specifically created for a purpose and a good purpose at that.\n \n You have shown that good potentially exists outside the human mind, however you have not shown that what you say is good is indeed actually good. To what standard do you compare it to make that determination.\n \n You see that is my point precisely. To make a determination of good or evil there MUST be a standard. If there is not a standard (objective) reality for comparison then it simply does not exist. \n \n One might then say, well then it doesn't exist. But you would be hard pressed given empirical evidence to prove that one. Good and evil exist. It is clear everytime a news story comes on for some heinous crime. People have a natural desire to determine good and evil. Why? Because there is good and evil. If there were no good and evil then the need for its determination, evolutionarily speaking, actually becomes counter productive and would cause more war, famine, etc. It would cause the species to die not survive. So you see, even from the philosophy of evolution thinking, good and evil must exist and must have an objective standard.\n \n EF\n\n Yes, good is what is good for life, which is not necessarily happiness all the time.\n \n Illegal drugs for example will make you real happy but overall are bad for life.\n \n \n Like I said, I don't think one can create a universe like ours and not have life be inevitable.\n \n If you were god and going to make a universe wouldn't you make it so you just plant the seed (big bang) and watch it grow?\n \n You would after all be omnipotent.\n \n Plus, just look around you, that is how everything else works, especially living things.\n \n If you want an apple you don't manufacture it all at once, you plant an apple tree.\n \n \n Good for life = good\n \n One may say \"Well this infection is NOT good but the bacteria in it are living things.\"\n \n That is kind of sticky but one also needs to consider that we need certain bacteria to live.\n \n One might say bacteria are a necessary evil.\n \n \n My intent is not to cover every detail; I just want to be able to say one or two things right now and kind of peace it together.\n \n It would be nice to be able to say that we could deal with good as at least somewhat of an objective thing.\n \n I figure once we define good that we apply what you said earlier, the logical not, was it?", 
   {
    "unicode_changes_made": true
   }, 
   219206, 
   null, 
   1151359620.0
  ], 
  [
   219245, 
   null, 
   "Dr_Sprocket", 
   "God is good and evil. Not good.\n\n So are you.", 
   {}, 
   219145, 
   null, 
   1151360100.0
  ], 
  [
   219257, 
   null, 
   "epaphras_faith", 
   "Yes, good is what is good for life, which is not necessarily happiness all the time.\n \n Illegal drugs for example will make you real happy but overall are bad for life.\n \n \n Like I said, I don't think one can create a universe like ours and not have life be inevitable.\n \n If you were god and going to make a universe wouldn't you make it so you just plant the seed (big bang) and watch it grow?\n \n You would after all be omnipotent.\n \n Plus, just look around you, that is how everything else works, especially living things.\n \n If you want an apple you don't manufacture it all at once, you plant an apple tree.\n \n \n Good for life = good\n \n One may say \"Well this infection is NOT good but the bacteria in it are living things.\"\n \n That is kind of sticky but one also needs to consider that we need certain bacteria to live.\n \n One might say bacteria are a necessary evil.\n \n \n My intent is not to cover every detail; I just want to be able to say one or two things right now and kind of peace it together.\n \n It would be nice to be able to say that we could deal with good as at least somewhat of an objective thing.\n \n I figure once we define good that we apply what you said earlier, the logical not, was it?\n\n \n rather than assuming, let me ask. Define life. Is it the 80 or so years on the planet or is it a life that continues forever. \n \n Good for eternal life could be very different than good for now.\n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   219241, 
   null, 
   1151361360.0
  ], 
  [
   219260, 
   null, 
   "Dr_Sprocket", 
   "rather than assuming, let me ask. Define life. Is it the 80 or so years on the planet or is it a life that continues forever. \n \n Good for eternal life could be very different than good for now.\n \n EF\n\n This is the philosophy forum, so please...\n \n lol\n \n I think we should stick to general concepts, but I'll bite give me an example.", 
   {
    "unicode_changes_made": true
   }, 
   219257, 
   null, 
   1151361660.0
  ], 
  [
   219270, 
   null, 
   "epaphras_faith", 
   "This is the philosophy forum, so please...\n \n lol\n \n I think we should stick to general concepts, but I'll bite give me an example.\n\n \n Well, what is more philosophical than something that is eternal. It certainly is not physical is it?\n \n Logically, lets consider, if I am going to live forever then my 80 or 100 years on the earth are a very very small portion of that time, correct? If what I did during that 80 to 100 years had an impact on the rest of the time, then what is good would be me investing in things that will have a positive impact on what is beyond the 80-100 years. It may be different.\n \n If I am only going to live 80 to 100 years and then die and there is nothing more, then perhaps a vast money making empire might be considered good (at least in some societies). But then, if life goes beyond that, you know the old saying, \"You can't take it with you\" you invest your efforts into things that don't matter for the majority of the time.\n \n That is if one has an eternal being. But that must be considered when discussing good and evil. it is why I brought up the objective versus the subjective. Everything temporal is subjective. This is easily seen because if it is temporal then it is based on culture and time and individuals etc. The very definition of subjective. If it is objective then it must be clearly outside of time. That would be the definition of eternity wouldn't it?\n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   219260, 
   null, 
   1151362980.0
  ], 
  [
   219276, 
   null, 
   "Dr_Sprocket", 
   "Well, what is more philosophical than something that is eternal. It certainly is not physical is it?\n \n Logically, lets consider, if I am going to live forever then my 80 or 100 years on the earth are a very very small portion of that time, correct? If what I did during that 80 to 100 years had an impact on the rest of the time, then what is good would be me investing in things that will have a positive impact on what is beyond the 80-100 years. It may be different.\n \n If I am only going to live 80 to 100 years and then die and there is nothing more, then perhaps a vast money making empire might be considered good (at least in some societies). But then, if life goes beyond that, you know the old saying, \"You can't take it with you\" you invest your efforts into things that don't matter for the majority of the time.\n \n That is if one has an eternal being. But that must be considered when discussing good and evil. it is why I brought up the objective versus the subjective. Everything temporal is subjective. This is easily seen because if it is temporal then it is based on culture and time and individuals etc. The very definition of subjective. If it is objective then it must be clearly outside of time. That would be the definition of eternity wouldn't it?\n \n EF\n\n Exactly where do you see the two parting?\n \n Good for life and good for eternal life that is.", 
   {}, 
   219270, 
   null, 
   1151363880.0
  ], 
  [
   219282, 
   null, 
   "epaphras_faith", 
   "Exactly where do you see the two parting?\n \n Good for life and good for eternal life that is.\n\n \n I thought my example demonstrated that. What is good here is not necessarily good in eternity. If there is no good or evil and there is no eternity then life is best lived getting all I can get and living like I am a filthy leucre and d#$%ed anyone else. \n \n If on other hand there is something eternal, then my life here should be spent learning about that so that I can invest my time properly.\n \n EF", 
   {}, 
   219276, 
   null, 
   1151364360.0
  ], 
  [
   219298, 
   null, 
   "Dr_Sprocket", 
   "If I am only going to live 80 to 100 years and then die and there is nothing more, then perhaps a vast money making empire might be considered good (at least in some societies). But then, if life goes beyond that, you know the old saying, \"You can't take it with you\" you invest your efforts into things that don't matter for the majority of the time.\n \n EF\n\n OK, lets say you own a big company and you employ cruel child slave labor in third world countries and relentlessly pollute the environment at every turn, you are going to hell.\n \n But on the other hand if you run the most responsible life on earth of all kinds friendly company you can, and you make generous contributions to various charities and go to your church on Sunday and so on, what then?\n \n I don't see where what is good for life and what is good for your imagination, I mean, immortal soul, are in conflict.\n \n Preaching responsibility in life is one of the things that works in your favor.\n \n Why try to draw a division here?", 
   {}, 
   219270, 
   null, 
   1151370240.0
  ], 
  [
   219448, 
   null, 
   "simone", 
   "But, more importantly, are good and evil tiered?", 
   {}, 
   219298, 
   null, 
   1151429400.0
  ], 
  [
   219462, 
   null, 
   "Dr_Sprocket", 
   "But, more importantly, are good and evil tiered?\n\n Do you mean tied, as in tied together?\n \n I would say, as much as black and white or light and dark are tied together, so to speak.", 
   {}, 
   219448, 
   null, 
   1151433000.0
  ], 
  [
   219501, 
   null, 
   "epaphras_faith", 
   "OK, lets say you own a big company and you employ cruel child slave labor in third world countries and relentlessly pollute the environment at every turn, you are going to hell.\n \n But on the other hand if you run the most responsible life on earth of all kinds friendly company you can, and you make generous contributions to various charities and go to your church on Sunday and so on, what then?\n \n I don't see where what is good for life and what is good for your imagination, I mean, immortal soul, are in conflict.\n \n Preaching responsibility in life is one of the things that works in your favor.\n \n Why try to draw a division here?\n\n \n Well, I have a set of beliefs that make heaven and hell not about my behavior but about the grace of God. However on the philosophical note here, I think I would draw the division because in SOME cases what you talk about would be correct, but not in all. And as I said before, that puts the concept of good and evil back in the subjective forum. If it isn't an objective item then there is no such thing as good and evil.\n \n Now, if you throw in that my going to heaven or hell is due to God's grace and not my works then it gets even more interesting. But, that is assuming quite a bit such as the existence of god and my particular theology (philosophy of God). Those are subjects I don't want to argue on this thread.\n \n EF", 
   {}, 
   219298, 
   null, 
   1151446560.0
  ], 
  [
   219535, 
   null, 
   "Dr_Sprocket", 
   "Well, I have a set of beliefs that make heaven and hell not about my behavior but about the grace of God. However on the philosophical note here, I think I would draw the division because in SOME cases what you talk about would be correct, but not in all. And as I said before, that puts the concept of good and evil back in the subjective forum. If it isn't an objective item then there is no such thing as good and evil.\n \n Now, if you throw in that my going to heaven or hell is due to God's grace and not my works then it gets even more interesting. But, that is assuming quite a bit such as the existence of god and my particular theology (philosophy of God). Those are subjects I don't want to argue on this thread.\n \n EF\n\n I guess I would say that the majority of the time being a good responsible person is good for life.\n \n It seams to me that is what religon for the most part asks people to do.\n \n I don't see a point of contention here.", 
   {
    "unicode_changes_made": true
   }, 
   219501, 
   null, 
   1151464020.0
  ], 
  [
   219722, 
   null, 
   "epaphras_faith", 
   "I guess I would say that the majority of the time being a good responsible person is good for life.\n \n It seams to me that is what religon for the most part asks people to do.\n \n I don't see a point of contention here.\n\n \n For the most part you are correct. For the most part, religion does ask people to do that very thing. It is true of judaism, islam, bhuddism, hinduism, etc. All of them declare methods for people to be considered good.\n \n I would argue that christianity (and some christians would actually argue against this) states that we as humans do not have what it takes to be good (the definition being that God is good) and therefore can only depend upon the grace of god.\n \n This is why I define good that way. Good is defined objectively outside of the human. We are only good because (I believe) Someone outside of us declares us good. \n \n To determine goodness by behavior is still relative and not objective. It does not really matter how many people or religions state that goodness is determined by behavior. That does not make that definition the correct one.\n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   219535, 
   null, 
   1151530440.0
  ], 
  [
   219735, 
   null, 
   "Dr_Sprocket", 
   "For the most part you are correct. For the most part, religion does ask people to do that very thing. It is true of judaism, islam, bhuddism, hinduism, etc. All of them declare methods for people to be considered good.\n \n I would argue that christianity (and some christians would actually argue against this) states that we as humans do not have what it takes to be good (the definition being that God is good) and therefore can only depend upon the grace of god.\n \n This is why I define good that way. Good is defined objectively outside of the human. We are only good because (I believe) Someone outside of us declares us good. \n \n To determine goodness by behavior is still relative and not objective. It does not really matter how many people or religions state that goodness is determined by behavior. That does not make that definition the correct one.\n \n EF\n\n Does that mean you give up on trying to define it?", 
   {}, 
   219722, 
   null, 
   1151533200.0
  ], 
  [
   219754, 
   null, 
   "epaphras_faith", 
   "Does that mean you give up on trying to define it?\n\n \n No. In fact, I defined it outside of human behavior. I defined good as God. God is good. That is my definition. I define it that whatever God causes or allows is good because God is good. It is not that I give up, simply that I do not define it by human behavior.\n \n Now, you may be asking about whether or not certain behaviors are good. The answer is yes. I thought I had agreed with you that many behaviors, by and large, are good for people both now and in eternity. HOwever, some are not. \n \n The problem I run into is determining the relative goodness or evilness of something. For me to do that I have to assume myself better than others in order to pass judgement on them. I don't like doing that.\n \n EF", 
   {}, 
   219735, 
   null, 
   1151536920.0
  ], 
  [
   219920, 
   null, 
   "epaphras_faith", 
   "EF, this is tantamount to a copout.\n \n You ###### better have something fancy up your sleeve.\n\n \n I will have to ask your forgiveness because I do not see the cop out.\n \n I had defined this earlier in the thread. Go back and reread our posts. If you are referring to my determining the relative goodness or evilness of something and my saying that I cannot legitimately do so then this is my response.\n \n For me to say what you did is evil or good is for me to look down through eterninty, past and present (and remember we had a agreed to cosider eternity as possible) and decide what impact a given behavior would have. Some things we know are not good, and you would likely agree to that. The question we are debating is how do we make an objective determination. The point I have been making all along is that to do that there must be some objective source outside of humanity. Otherwise it is me and my guys against you and your guys (and I use that figuratively) that get to say what is or is not good.\n \n Society is already doing just such a thing. It was not that long ago that attempting suicide was consider a mental illness problem. Now, in Oregon at least, it is perfectly okay to do provided you are suffering. NOw then the question becomes what kind of suffering makes it okay. This is the creep that goes on when good and evil become subjective in definition. Eventually either everything is okay or nothing is okay. \n \n For me to say to you that I cannot determine good and evil in a single event with a single person, is for me to say simply that I know my limitations when it comes to others. I can more readily determine it in my own behavior as I can tell what is happening inside of me (at least to some degree). Inside of you, I really don't know. Even with me, I cannot deal with the eternity aspect that well. My beliefs give me an option in that I can depend on the one who can see those things and to live according to his principles as I trust Him. But those are my beliefs.\n \n Does this explain it better?", 
   {}, 
   219754, 
   null, 
   1151613660.0
  ], 
  [
   220264, 
   null, 
   "Love Never Dies", 
   "I will have to ask your forgiveness because I do not see the cop out.\n \n I had defined this earlier in the thread. Go back and reread our posts. If you are referring to my determining the relative goodness or evilness of something and my saying that I cannot legitimately do so then this is my response.\n \n For me to say what you did is evil or good is for me to look down through eterninty, past and present (and remember we had a agreed to cosider eternity as possible) and decide what impact a given behavior would have. Some things we know are not good, and you would likely agree to that. The question we are debating is how do we make an objective determination. The point I have been making all along is that to do that there must be some objective source outside of humanity. Otherwise it is me and my guys against you and your guys (and I use that figuratively) that get to say what is or is not good.\n \n Society is already doing just such a thing. It was not that long ago that attempting suicide was consider a mental illness problem. Now, in Oregon at least, it is perfectly okay to do provided you are suffering. NOw then the question becomes what kind of suffering makes it okay. This is the creep that goes on when good and evil become subjective in definition. Eventually either everything is okay or nothing is okay. \n \n For me to say to you that I cannot determine good and evil in a single event with a single person, is for me to say simply that I know my limitations when it comes to others. I can more readily determine it in my own behavior as I can tell what is happening inside of me (at least to some degree). Inside of you, I really don't know. Even with me, I cannot deal with the eternity aspect that well. My beliefs give me an option in that I can depend on the one who can see those things and to live according to his principles as I trust Him. But those are my beliefs.\n \n Does this explain it better?\n\n Ok so state to your goal here.\n \n By the way, apparently you can get banned for typing six pound sings. emoticon_xangel", 
   {}, 
   219920, 
   null, 
   1151758500.0
  ], 
  [
   220595, 
   null, 
   "epaphras_faith", 
   "Ok so state to your goal here.\n \n By the way, apparently you can get banned for typing six pound sings. emoticon_xangel\n\n \n I am not sure I understand the question. My goal is to answer the topic. I have defined good and evil but have not defined them in terms of behavior but rather more philosophically.\n \n EF", 
   {}, 
   220264, 
   null, 
   1151944980.0
  ], 
  [
   221415, 
   null, 
   "Love Never Dies", 
   "I am not sure I understand the question. My goal is to answer the topic. I have defined good and evil but have not defined them in terms of behavior but rather more philosophically.\n \n EF\n\n It strikes me as being a little too easy for you to just say, good is god.", 
   {}, 
   220595, 
   null, 
   1152400740.0
  ], 
  [
   221650, 
   null, 
   "epaphras_faith", 
   "It strikes me as being a little too easy for you to just say, good is god.\n\n \n If that was all that I said then you might be right. I have spent a fair amount of time discussing the why's and wherefore's of my reasoning.\n \n AND I did not say that Good is god although He is. Good does not define god. At least not completely. What I said was that God is good. God is the definer of good and he is good. I have offered a fair amount of analysis.\n \n I submit that you think it is \"too easy\" just because you disagree with it.\n \n EF", 
   {}, 
   221415, 
   null, 
   1152555240.0
  ], 
  [
   221781, 
   null, 
   "Love Never Dies", 
   "If that was all that I said then you might be right. I have spent a fair amount of time discussing the why's and wherefore's of my reasoning.\n \n AND I did not say that Good is god although He is. Good does not define god. At least not completely. What I said was that God is good. God is the definer of good and he is good. I have offered a fair amount of analysis.\n \n I submit that you think it is \"too easy\" just because you disagree with it.\n \n EF\n\n I disagree with it because there is no god.\n \n These are your words:\n \n \"I propose that a standard of Good or Evil cannot be defined by humans or human constructs.\"\n \n I guess I shouldn't be surprised that I cant get a straight answer.\n \n You don't know.\n \n I am surprised your \"god\" has not provided you with more adaquate ansures.", 
   {
    "unicode_changes_made": true
   }, 
   221650, 
   null, 
   1152643740.0
  ], 
  [
   221801, 
   null, 
   "epaphras_faith", 
   "I disagree with it because there is no god.\n \n These are your words:\n \n \"I propose that a standard of Good or Evil cannot be defined by humans or human constructs.\"\n \n I guess I shouldn't be surprised that I cant get a straight answer.\n \n You don't know.\n \n I am surprised your \"god\" has not provided you with more adaquate ansures.\n\n \n For pete's sake, read the thread. I started posting on this idea back in post number 11. Go back and read through everything. I am not going to repeat many many postings over and over again because you won't read the thread. My answers to your queries have been posted long ago. \n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   221781, 
   null, 
   1152647460.0
  ], 
  [
   221991, 
   null, 
   "Love Never Dies", 
   "For pete's sake, read the thread. I started posting on this idea back in post number 11. Go back and read through everything. I am not going to repeat many many postings over and over again because you won't read the thread. My answers to your queries have been posted long ago. \n \n EF\n\n No need to become emotional.\n \n What makes you think I haven't read it?", 
   {
    "unicode_changes_made": true
   }, 
   221801, 
   null, 
   1152696840.0
  ], 
  [
   222077, 
   null, 
   "epaphras_faith", 
   "No need to become emotional.\n \n What makes you think I haven't read it?\n\n \n \"emotional\"???? I would really like to know how you can determine emotionality on a bulletin board.\n \n The reason I think you haven't read it is already stated. You must be ignoring everything being said if you read it. One statement of mine does not make a complete argument. You are taking what I have said in ONE sentence and then arguing without including the context nor any of my other statements which clearly qualify that one.\n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   221991, 
   null, 
   1152736200.0
  ], 
  [
   222323, 
   null, 
   "INRI", 
   "If there is a God then he decides what is Good and what is evil, he then announces it to the world through his authority, the Church.\n \n \n But if there is no God then there is no Good or evil only preferences \n \n Government grants liberty for some and oppresion for others.\n \n Is it good to steal?\n \n If there is a God - no!\n \n If there is no God, its down to each individuals preference to steal or not\n \n Or\n \n A Governement to allow it to happen or to oppress those who choose to do so.", 
   {}, 
   222077, 
   null, 
   1152884640.0
  ], 
  [
   222377, 
   null, 
   "sinjin", 
   "If there is a God then he decides what is Good and what is evil, he then announces it to the world through his authority, the Church.\n \n \n But if there is no God then there is no Good or evil only preferences \n \n Government grants liberty for some and oppresion for others.\n \n Is it good to steal?\n \n If there is a God - no!\n \n If there is no God, its down to each individuals preference to steal or not\n \n Or\n \n A Governement to allow it to happen or to oppress those who choose to do so.\n\n \n In most cases people don't commit transgressions so as not to be punished in this life not the next. It is wrong to steal because society says so and that is our collective \"preference\". I don't need a god to tell me that what is not mine by my own effort I have no right to take. Do unto others you know.", 
   {}, 
   222323, 
   null, 
   1152904320.0
  ], 
  [
   222400, 
   null, 
   "epaphras_faith", 
   "In most cases people don't commit transgressions so as not to be punished in this life not the next. It is wrong to steal because society says so and that is our collective \"preference\". I don't need a god to tell me that what is not mine by my own effort I have no right to take. Do unto others you know.\n\n \n Well, I have a society that says it is just fine to wack people on the head with a 2X4 when they tell me I am wrong. Is that good?", 
   {}, 
   222377, 
   null, 
   1152907800.0
  ], 
  [
   222403, 
   null, 
   "Waxy", 
   "Well, I have a society that says it is just fine to wack people on the head with a 2X4 when they tell me I am wrong. Is that good?\n\n \n It's good work if you can get it. :p\n \n I doubt you'll be able to keep your society together for too long though....\n \n Waxy", 
   {}, 
   222400, 
   null, 
   1152908160.0
  ], 
  [
   222404, 
   null, 
   "sinjin", 
   "Well, I have a society that says it is just fine to wack people on the head with a 2X4 when they tell me I am wrong. Is that good?\n\n Do you like being whacked on the head with a 2x4? I said do unto others.", 
   {}, 
   222400, 
   null, 
   1152908400.0
  ], 
  [
   222434, 
   null, 
   "epaphras_faith", 
   "Do you like being whacked on the head with a 2x4? I said do unto others.\n\n \n Yes but that is your morals and your society not mine.", 
   {}, 
   222404, 
   null, 
   1152915180.0
  ], 
  [
   222439, 
   null, 
   "sinjin", 
   "Yes but that is your morals and your society not mine.\n\n But yours is imaginary.", 
   {}, 
   222434, 
   null, 
   1152915780.0
  ], 
  [
   222451, 
   null, 
   "epaphras_faith", 
   "But yours is imaginary.\n\n \n irrelevant, if it were real you would still have to deal with the argument.\n \n There is a tribe that lives in the Amazon called the Wadoni that was known for its fierceness and they killed anyone for any reason. It was their culture and to them it was the right thing to do. The governments around them were ready to destroy them because of it. Now, according to your philosophy it is perfectly okay and the governments should leave them alone even though it was the Wadoni that were raiding nearby settlements and killing the residents.\n \n Based on your statement they should have let them kill. It was okay for them afterall.\n \n EF", 
   {}, 
   222439, 
   null, 
   1152918060.0
  ], 
  [
   222452, 
   null, 
   "sinjin", 
   "irrelevant, if it were real you would still have to deal with the argument.\n \n There is a tribe that lives in the Amazon called the Wadoni that was known for its fierceness and they killed anyone for any reason. It was their culture and to them it was the right thing to do. The governments around them were ready to destroy them because of it. Now, according to your philosophy it is perfectly okay and the governments should leave them alone even though it was the Wadoni that were raiding nearby settlements and killing the residents.\n \n Based on your statement they should have let them kill. It was okay for them afterall.\n \n EF\n\n It was okay for them when they were a society unto themselves. Not when they became part of a larger society that frowned on their practices, assuming you have the story straight which I doubt.", 
   {}, 
   222451, 
   null, 
   1152918180.0
  ], 
  [
   222458, 
   null, 
   "epaphras_faith", 
   "It was okay for them when they were a society unto themselves. Not when they became part of a larger society that frowned on their practices, assuming you have the story straight which I doubt.\n\n \n So then it is okay for another society to impose their values on them?", 
   {}, 
   222452, 
   null, 
   1152918660.0
  ], 
  [
   222462, 
   null, 
   "sinjin", 
   "So then it is okay for another society to impose their values on them?\n\n Okay with whom?\n \n I believe your belief in absolutes is getting in the way here.", 
   {}, 
   222458, 
   null, 
   1152919080.0
  ], 
  [
   222469, 
   null, 
   "epaphras_faith", 
   "Okay with whom?\n \n I believe your belief in absolutes is getting in the way here.\n\n \n not at all. You are the one who is saying that there are no absolutes. I am agreeing and showing you the absurdity of such a stance.\n \n If morality and ethical behavior (what is good and evil) is truly relative then who gets to decide. Why is it that your society gets to decide. What is it that makes it okay in your society to dominate another society's beliefs. It requires someone to declare themselves at better or knowing more. \n \n If you are going to claim that your society's morals are better than mine, then I get to claim that mine are better than yours. No one ever is responsible then to anyone else. If you don't like the effect my society's morals have on your society then tough noogies. There is no way you can claim authority over me without appealing to something beyond yourself. Because I get the same opportunity to appeal to my authority over you.\n \n My belief in absolutes is not getting in the way. It is the nature of reality that is causing you problems.\n \n EF", 
   {}, 
   222462, 
   null, 
   1152922860.0
  ], 
  [
   222475, 
   null, 
   "sinjin", 
   "If morality and ethical behavior (what is good and evil) is truly relative then who gets to decide. Why is it that your society gets to decide. What is it that makes it okay in your society to dominate another society's beliefs. It requires someone to declare themselves at better or knowing more. \n EF\n\n \n Nothing makes it \"okay\" EF, it just is. If my society dominates yours we get to make you live by our rules.", 
   {}, 
   222469, 
   null, 
   1152923460.0
  ], 
  [
   222476, 
   null, 
   "epaphras_faith", 
   "Nothing makes it \"okay\" EF, it just is. If my society dominates yours we get to make you live by our rules.\n\n \n How interesting. So to you then If my society dominates your society and decide that killing your family is right and make you watch then there is nothing evil in that it simply is?\n \n I afraid I don't buy that. One way to tell if you really believe in absolutes when you say you don't is to look at what ticks you off. You will find that you believe yourself to be right and others to be wrong. \n \n EF", 
   {}, 
   222475, 
   null, 
   1152923580.0
  ], 
  [
   222477, 
   null, 
   "sinjin", 
   "How interesting. So to you then If my society dominates your society and decide that killing your family is right and make you watch then there is nothing evil in that it simply is?\n EF\n\n \n Maybe evil from my perspective but from yours maybe a \"necessary evil\" which is another way of saying for the good.\n \n Certainly good and evil exist and we could find much common ground but what is absolutely good/evil is tough to nail down.", 
   {}, 
   222476, 
   null, 
   1152923820.0
  ], 
  [
   222918, 
   null, 
   "epaphras_faith", 
   "Maybe evil from my perspective but from yours maybe a \"necessary evil\" which is another way of saying for the good.\n \n Certainly good and evil exist and we could find much common ground but what is absolutely good/evil is tough to nail down.\n\n I disagree with your first sentence. necessary evil is not the same as good. It is a recognition that it is still evil but felt to be better than the alternatives. \n \n Secondly, you are right in that it is somewhat difficult to nail down between a given set of individuals which is why, logically, there must be an outside standard.\n \n EF", 
   {}, 
   222477, 
   null, 
   1153167600.0
  ], 
  [
   223349, 
   null, 
   "nameless", 
   "According to the Judeo-Xtian mythology, stealing the 'knowledge of good and evil' was the 'original sin'. Odd it is how now, the fruits of this 'disobedience'/'sin' are proudly practiced and 'enjoyed' as if it were not 'sin'. Perhaps the more 'sin' is practiced, the more it becomes rationalized and acceptable? Look at all the horror that the obsolete concepts of 'sin', 'good', 'evil', 'judgement', etc... have visited upon man!\n \n 'Good and evil' are egoic judgements. Ego feels in a (superior) position when it can 'judge' another person.\n \n Instead of the ego word 'good', how about 'correct', 'useful', 'efficient', 'uplifting', etc... There are many more accurate, commonly understood words for description then those vague, highly subjective judgemental terms.\n \n More often than not, 'good' and evil' simply refer to one's personal comfort. 'Good' adds to that comfort... \n What shallow reasoning!", 
   {}, 
   222918, 
   null, 
   1153278660.0
  ], 
  [
   223676, 
   null, 
   "epaphras_faith", 
   "According to the Judeo-Xtian mythology, stealing the 'knowledge of good and evil' was the 'original sin'. Odd it is how now, the fruits of this 'disobedience'/'sin' are proudly practiced and 'enjoyed' as if it were not 'sin'. Perhaps the more 'sin' is practiced, the more it becomes rationalized and acceptable? Look at all the horror that the obsolete concepts of 'sin', 'good', 'evil', 'judgement', etc... have visited upon man!\n \n 'Good and evil' are egoic judgements. Ego feels in a (superior) position when it can 'judge' another person.\n \n Instead of the ego word 'good', how about 'correct', 'useful', 'efficient', 'uplifting', etc... There are many more accurate, commonly understood words for description then those vague, highly subjective judgemental terms.\n \n More often than not, 'good' and evil' simply refer to one's personal comfort. 'Good' adds to that comfort... \n What shallow reasoning!\n\n \n You are incorrect in the original sin. That is not true to judeo christians.\n \n EF", 
   {}, 
   223349, 
   null, 
   1153434360.0
  ], 
  [
   223974, 
   null, 
   "Caprii", 
   "Good or evil doesn't exist.\n \n I find that what does exist is pain and joy, life and death. By an act of nature or by an act of \"mankind\" how we respond with our emotions is how we define good and evil, but it doesn't make it true.", 
   {}, 
   223676, 
   null, 
   1153539120.0
  ], 
  [
   224836, 
   null, 
   "epaphras_faith", 
   "Good or evil doesn't exist.\n \n I find that what does exist is pain and joy, life and death. By an act of nature or by an act of \"mankind\" how we respond with our emotions is how we define good and evil, but it doesn't make it true.\n\n \n I would encourage you to reread the thread. I began debating this very statement in post 11. I address arguments from there forward to this statement above.", 
   {}, 
   223974, 
   null, 
   1153954860.0
  ], 
  [
   224864, 
   null, 
   "Ooaman", 
   "Anything done out of love is done beyond good and evil.\n -Nietzsche\n \n Sorry, I couldn't resist.\n \n As far as the question goes, I would say society and the conscious.\n With society, it's based off of laws.\n with the conscious, it's more of a feeling of what's good and what's evil.", 
   {}, 
   224836, 
   null, 
   1153967760.0
  ], 
  [
   224865, 
   null, 
   "Caprii", 
   "Good and evil are real and do exist and should exist. \n \n An earlier question was how do we define good, evil, and reality. Those are the correct questions and they need to be answered in order for the discussion on this thread to be meaningful.\n \n \n \n EF\n\n \n \n I read your post, but you're missing my ANSWER. Good and Evil doesn't exist, therefore, it cannot be DEFINED.\n \n Out of my curiosity, please define the color Pleytin. You can't because it doesn't exist. Like in my answer below, only pain and joy exist, life and death.", 
   {}, 
   216968, 
   null, 
   1153968660.0
  ], 
  [
   224958, 
   null, 
   "epaphras_faith", 
   "I read your post, but you're missing my ANSWER. Good and Evil doesn't exist, therefore, it cannot be DEFINED.\n \n Out of my curiosity, please define the color Pleytin. You can't because it doesn't exist. Like in my answer below, only pain and joy exist, life and death.\n\n \n The difference is that I can easily prove that pleytin does not exist. My posts below show logically why good and evil MUST exist, therefore a simple statement by you that they do not exist is a non argument it is restating the statement I argued against. Restatement does not amount to an argument. If You can show logically WHY it cannot exist I would be happy to debate you. Otherwise your statement is irrelevant.\n \n EF\n \n Edit, by the way, it is impossible to prove the non existence of something. The best you will be able to do is show the flaws in my argument which you have not even attempted.\n \n EF", 
   {}, 
   224865, 
   null, 
   1154021340.0
  ], 
  [
   224964, 
   null, 
   "Kronus", 
   "\n Edit, by the way, it is impossible to prove the non existence of something. \n EF\n\n \n Sorry to jump in here, but that's not quite correct. It is possible to prove the non-existence of something, if it's existence would leave evidence. For example, a careful visual search of the room I'm in proves the lack of existence of any elephants in the room. It's only when something wouldn't necessarliy leave any traces, like God or aliens in another galaxy, that you can't prove that they don't exist.", 
   {}, 
   224958, 
   null, 
   1154022660.0
  ], 
  [
   224970, 
   null, 
   "epaphras_faith", 
   "Sorry to jump in here, but that's not quite correct. It is possible to prove the non-existence of something, if it's existence would leave evidence. For example, a careful visual search of the room I'm in proves the lack of existence of any elephants in the room. It's only when something wouldn't necessarliy leave any traces, like God or aliens in another galaxy, that you can't prove that they don't exist.\n\n \n I will accept that with the caveat that you have just shown that you can prove non existence with a qualification. Namely \"in the room I am in\". Your inability to see elephants does not prove the non existence of elephants. Just like we cannot prove the non existence of big foot just because no one has seen him. (I don't believe in a big foot so lets no go there). Lack of observance can only prove nonexistence only if you can show that you can observe everything. Which is simply not possible.\n \n EF", 
   {}, 
   224964, 
   null, 
   1154024340.0
  ], 
  [
   224973, 
   null, 
   "Kronus", 
   " Lack of observance can only prove nonexistence only if you can show that you can observe everything. Which is simply not possible.\n \n EF\n\n \n Not everything. Just everywhere that the evidence ought to be. I don't need to check Mars for evidence of Nessie, I just need to look everywhere in Loch Ness. Your point is well taken, though. There will be many cases where checking everywhere for evidence simply cannot be done.", 
   {}, 
   224970, 
   null, 
   1154025120.0
  ], 
  [
   224999, 
   null, 
   "epaphras_faith", 
   "Not everything. Just everywhere that the evidence ought to be. I don't need to check Mars for evidence of Nessie, I just need to look everywhere in Loch Ness. Your point is well taken, though. There will be many cases where checking everywhere for evidence simply cannot be done.\n\n \n Remember too, that short of draining loch ness (and then not necessarily if nessie went with the water) you would have a tough time observing that as well.\n \n But, I am just beeing cheeky now. So, thanks for the nod. \n \n Back to Caprii: Still waiting for a response", 
   {}, 
   224973, 
   null, 
   1154036340.0
  ], 
  [
   225164, 
   null, 
   "Caprii", 
   "The difference is that I can easily prove that pleytin does not exist. My posts below show logically why good and evil MUST exist, therefore a simple statement by you that they do not exist is a non argument it is restating the statement I argued against. Restatement does not amount to an argument. If You can show logically WHY it cannot exist I would be happy to debate you. Otherwise your statement is irrelevant.\n \n EF\n \n Edit, by the way, it is impossible to prove the non existence of something. The best you will be able to do is show the flaws in my argument which you have not even attempted.\n \n EF\n\n \n Hezbollah. Good or evil? If you feel comfort in Hezbollah, if you feel safe with Hezbollah, then Hezbollah is good. The opposite is if you feel pain, or sadness at the hands of Hezbollah then you might characterize Hezbollah as evil. In either case, it doesn't prove evil and good exist, it proves we need to label those things that do hurtful things to us and label that which makes us feel comfort and joy.\n \n Remember in this greedy, selfish society we live in, one man's pain is another man's pleasure.", 
   {}, 
   224958, 
   null, 
   1154123940.0
  ], 
  [
   225183, 
   null, 
   "epaphras_faith", 
   "Hezbollah. Good or evil? If you feel comfort in Hezbollah, if you feel safe with Hezbollah, then Hezbollah is good. The opposite is if you feel pain, or sadness at the hands of Hezbollah then you might characterize Hezbollah as evil. In either case, it doesn't prove evil and good exist, it proves we need to label those things that do hurtful things to us and label that which makes us feel comfort and joy.\n \n Remember in this greedy, selfish society we live in, one man's pain is another man's pleasure.\n\n \n Which, if you read my posts you would know is what makes it ridiculous to say that man gets to decide what good and evil are. We may perceive things one way or another, but Good and Evil absolutely exist and they exist objectively. The mere fact that we perceive them or need to perceive them points to the existence of them. There is no society alive that does not have a concept of good and evil. How to define what is what is another story. That can be argued and debated. However, the existence of them is not up for grabs. NO society says that there is no such thing as good or evil.\n \n Good and evil are built into the very fabric of the universe. They cannot simply be social constructs (which is essentially your argument) as there is no way to test that. The fact that good and evil are now and have always been perceived points directly it their existence. \n \n Just because we cannot agree on what they are does not prove that they do not exist. Were you not reading? You cannot prove the non existence of something. \n \n Now, that doesn't mean that they DO exist just because you cannot prove that they don't. You have to look at the remaining data. The presence of a perception of good and evil for all time is a good indicator that they exist. \n \n Additionally, The presence of both in all people is also a good indicator. NO one is perfect and no one is either good or evil. They are a mixture of both. \n \n My argument previously that the definition of good and evil comes from outside of man is based on the fact that no man is perfect and therefore cannot accurately define good and evil. Good and evil exist and must be defined externally to man based on these reasons.\n \n You have no succeded in making me retype my position and wasting my time. If you are not going to read the threads before you argue, then simply make no argument.\n \n EF", 
   {}, 
   225164, 
   null, 
   1154130360.0
  ], 
  [
   225239, 
   null, 
   "Zardoz", 
   "\n Remember in this greedy, selfish society we live in, one man's pain is another man's pleasure.\n\n \n Greed?\n Selfish?\n Pain?\n Comfort?\n Pleasure?\n \n Some of your terms are imaginary.\n If you can say good and evil are ficticious, I can say any other nebulous terms you have used are too.\n \n Saying 'This is good or evil' is akin to saying a color is grey.\n Grey encompases many different shades from slightly off white to slightly off-black.\n Good and Evil are encompasing terms used to bind many similar concepts together.\n They can be subjective and applied from that perspective or objective and applied there.\n \n From the sounds of it, you view things subjectively and think everything begins and ends there.", 
   {}, 
   225164, 
   null, 
   1154169960.0
  ], 
  [
   226046, 
   null, 
   "Caprii", 
   "Greed?\n Selfish?\n Pain?\n Comfort?\n Pleasure?\n \n Some of your terms are imaginary.\n If you can say good and evil are ficticious, I can say any other nebulous terms you have used are too.\n \n Saying 'This is good or evil' is akin to saying a color is grey.\n Grey encompases many different shades from slightly off white to slightly off-black.\n Good and Evil are encompasing terms used to bind many similar concepts together.\n They can be subjective and applied from that perspective or objective and applied there.\n \n From the sounds of it, you view things subjectively and think everything begins and ends there.\n\n \n Obviously, when I write I use a language we all know, not that I agree with it.\n \n Sure, \n \n Greed and Selfish are \"imaginary\" and subjective like good and evil and\n \n Pain, comfort and pleasure are real but subjective to the individual\n \n What really exist universally and is NOT subjective is:\n \n creation\n growth (development doesn't have to be full development)\n deterioration \n \n and how we react, often subjectively, depends on our biology and our environment.", 
   {}, 
   225239, 
   null, 
   1154567820.0
  ], 
  [
   227042, 
   null, 
   "Judeau", 
   "EF, I have read your posts and from a philisophical point of view, I completely agree with you. It is a very sound and solid argument. You are also absolutely correct that you cannot prove the negative. That is why the burden of proof in our court systems is on the prosecution and not the defense. The good-evil scale is much like the litmus tests. (I'll say acid is analogous to evil and basic is analogous to good) 1 being the most acidic and 14 being the most basic. 7 is water (neutral). If each person were a piece of litmus paper every time they made a decision, then everyone would have a rating every decision. Writing this post was a decision I made and I might have a litmus rating of about 7 for writing it since it is almost equally good as it is evil. The higher the number the larger the portion of good. I would say 1's and 14's are extremely rare. EF's argument is philosophically the best argued point I read. Now, religiously I have some objections but that belongs in another topic.", 
   {}, 
   226046, 
   null, 
   1155159660.0
  ], 
  [
   227121, 
   null, 
   "epaphras_faith", 
   "EF, I have read your posts and from a philisophical point of view, I completely agree with you. It is a very sound and solid argument. You are also absolutely correct that you cannot prove the negative. That is why the burden of proof in our court systems is on the prosecution and not the defense. The good-evil scale is much like the litmus tests. (I'll say acid is analogous to evil and basic is analogous to good) 1 being the most acidic and 14 being the most basic. 7 is water (neutral). If each person were a piece of litmus paper every time they made a decision, then everyone would have a rating every decision. Writing this post was a decision I made and I might have a litmus rating of about 7 for writing it since it is almost equally good as it is evil. The higher the number the larger the portion of good. I would say 1's and 14's are extremely rare. EF's argument is philosophically the best argued point I read. Now, religiously I have some objections but that belongs in another topic.\n\n \n I appreciate your support. How would you define either?", 
   {}, 
   227042, 
   null, 
   1155172200.0
  ], 
  [
   227200, 
   null, 
   "Judeau", 
   "I appreciate your support. How would you define either?\n\n \n Well actually, I explain what I think about evil in a thread in the religion section. I think it is the Jesus zapping people thread.", 
   {}, 
   227121, 
   null, 
   1155237720.0
  ], 
  [
   230389, 
   null, 
   "epaphras_faith", 
   "Well actually, I explain what I think about evil in a thread in the religion section. I think it is the Jesus zapping people thread.\n\n \n perhaps you could post a link or something as I have not found it. You can copy and paste if you wish and note it is from a different thread. I have just not had any luck.", 
   {}, 
   227200, 
   null, 
   1157757660.0
  ], 
  [
   232311, 
   null, 
   "epaphras_faith", 
   "No it is bad.\n \n Funny thing is, I hate your god.\n \n I am a heathen.\n \n I do not comply with YOUR value system.\n \n I indulge my self in every vice imaginable.\n \n I am as baser a human being as you will ever find.\n \n I am more animal then man, yet I totally understand every thing you say.\n \n All with out gods help.\n \n Go figure.\n \n You have no idea how to approach this problem of good and evil.\n \n You shirk the responsibility and simply resign your self to an antiquated pre fabed paradigm, which NO ONE knows how it will turn out in the end.\n \n It will turn out in disaster.\n \n Why?\n \n Because we got a bunch of people like you who have elected them selves the keepers of morality, really dont know the first thing about good and evil.\n\n \n You also have terrible grammar and worse spelling. You are the one who has no real concept. How do I know this, you have posted no argumentation and instead resort to a plethora of ad hominem. You have a prejudicial comment and cannot seem to land on a conclusion other than you don't like me because of a group to which I belong. I notice that you hate my God and yet you still acknowledge he exists. Otherwise, why hate something that does not exist. Interesting that you appear to know more than a God that you admit exists.\n \n EF", 
   {}, 
   222400, 
   null, 
   1159207080.0
  ], 
  [
   232335, 
   null, 
   "Love Never Dies", 
   "You also have terrible grammar and worse spelling. You are the one who has no real concept. How do I know this, you have posted no argumentation and instead resort to a plethora of ad hominem. You have a prejudicial comment and cannot seem to land on a conclusion other than you don't like me because of a group to which I belong. I notice that you hate my God and yet you still acknowledge he exists. Otherwise, why hate something that does not exist. Interesting that you appear to know more than a God that you admit exists.\n \n EF\n\n I do not remember saying that I dont like you.\n \n Can you point it out for me?\n \n I do remember saying: You really dont know the first thing about good and evil.\n \n I think the fact that you perceive this as me saying \"I dont like you\" says something and this concerns me.\n \n I do like you!\n \n So what I will do is delete my post, if I can.\n \n I don't know if it will work because I have never done it before.\n \n Btw, picking at spelling and grammar is beneath you.", 
   {
    "unicode_changes_made": true
   }, 
   232311, 
   null, 
   1159211280.0
  ], 
  [
   232386, 
   null, 
   "Love Never Dies", 
   "Just because I think you dont know what you talking about on this particular topic doesnt mean I dont like you.\n \n Is the idea that my view opposes yours offend you in some way?\n \n I think you are reading too much in to the comment.\n \n And you make some assumptions that are incorrect.", 
   {}, 
   232335, 
   null, 
   1159226280.0
  ], 
  [
   232388, 
   null, 
   "epaphras_faith", 
   "Just because I think you dont know what you talking about on this particular topic doesnt mean I dont like you.\n \n Is the idea that my view opposes yours offend you in some way?\n\n \n Did you not read my last post? It has nothing to do with you opposing my view. Oppose all you want. It is the phrase \"people like you\" that offends me. In particular you state:\n \n \"people like you who have elected themselves the keepers of morality\"\n \n You might as well have said \"it is people like you who have black skin\". They are the same thing. The comment is prejudiced. Do you not see that?\n \n If you want to oppose my view then say \"I disagree\" Say \"I think that the world works this way and heres why\". Then you own your own statements. By saying \"people like you who have elected themselves....\" you blame me for your problems with what I think. Highly inappropriate. Not argumentative. Ad hominem where logic is concerned. \n \n Adds nothing except to show that you are a prejudiced individual. If that is the way you want to live your life, fine, just own up to it.\n \n EF", 
   {}, 
   232386, 
   null, 
   1159227240.0
  ], 
  [
   232454, 
   null, 
   "Love Never Dies", 
   "I edited my posts to remove the offending coments.", 
   {}, 
   232388, 
   null, 
   1159281780.0
  ], 
  [
   232497, 
   null, 
   "epaphras_faith", 
   "I edited my posts to remove the offending coments.\n\n \n appreciated. Now, would you care to post an argument concerning what is good/evil? Perhaps take a position and support it with logic. After all this is the philosophy thread. Logic is the cornerstone. Give it a stab. I look forward to your statements (sincerely).\n \n EF", 
   {}, 
   232454, 
   null, 
   1159306200.0
  ], 
  [
   232560, 
   null, 
   "Love Never Dies", 
   "Please let me first ask you, what is good?", 
   {}, 
   232497, 
   null, 
   1159324200.0
  ], 
  [
   232689, 
   null, 
   "epaphras_faith", 
   "Please let me first ask you, what is good?\n\n \n I have already done this multiple times. YOu can read through the thread if you like. However for expediency sake, here is a link to post number 36 where I provide a reasonable summary of my position.\n \n http://www.4forums.com/political/showthread.php?t=8160&page=3\n \n I would suggest you read through the thread before just arguing with me. I really don't want to repeat too many arguments. This is why I asked for your position and your support for it. My position and support are already clearly laid out in the many posts I have on this thread. It is time for you to pony up.\n \n EF", 
   {}, 
   232560, 
   null, 
   1159379400.0
  ], 
  [
   232786, 
   null, 
   "Shooterandproud", 
   "Im not really sure what determines whats good or evil.\n \n I dont know how we can really label someone as \"evil\". Because, if we were in their situation, in their conditions, with their brain and line of thinking, we would do the same. We do what we were meant to do, and i dont think there is really any stopping that. I dont think it is right to judge people, because if you were in their exact shoes, you would've done the same. Therefore, you are really no better.", 
   {}, 
   232689, 
   null, 
   1159413840.0
  ], 
  [
   232823, 
   null, 
   "Jill White", 
   "epaphras_faith,\n \n Do you not see that the post you found so offensive that Love Never Dies \"deleted for you\" is still quoted in your post? emoticon_wow", 
   {}, 
   232786, 
   null, 
   1159450020.0
  ], 
  [
   232824, 
   null, 
   "Jill White", 
   "I have already done this multiple times. YOu can read through the thread if you like. However for expediency sake, here is a link to post number 36 where I provide a reasonable summary of my position.\n \n http://www.4forums.com/political/showthread.php?t=8160&page=3\n \n I would suggest you read through the thread before just arguing with me. I really don't want to repeat too many arguments. This is why I asked for your position and your support for it. My position and support are already clearly laid out in the many posts I have on this thread. It is time for you to pony up.\n \n EF\n\n Please forgive me for butting in but...\n \n Dr_Sprocket: Ok, what is good?\n \n epaphras_faith: My opinion would be God.\n \n I think this is what Love Never Dies is talking about.\n \n When asked what is good your answer is good is God.\n \n Seam like sort of a cop out on your part to me.", 
   {
    "unicode_changes_made": true
   }, 
   232689, 
   null, 
   1159450440.0
  ], 
  [
   232842, 
   null, 
   "simone", 
   "God is good?\n \n Who, then is God?\n \n Is God the primary mover of the Universe and the World? Why then the huge tsunami which killed hundreds of thousands of humans on and during the days after 26 December 2004? Was it to celebrate the birth of his son some 2,000 years before?", 
   {}, 
   232824, 
   null, 
   1159459980.0
  ], 
  [
   232887, 
   null, 
   "epaphras_faith", 
   "epaphras_faith,\n \n Do you not see that the post you found so offensive that Love Never Dies \"deleted for you\" is still quoted in your post? emoticon_wow\n\n \n Whoops! I do apologize. I did not even think of that. I shall delete my post as well.\n \n EF", 
   {}, 
   232823, 
   null, 
   1159470120.0
  ], 
  [
   232890, 
   null, 
   "epaphras_faith", 
   "Please forgive me for butting in but...\n \n Dr_Sprocket: Ok, what is good?\n \n epaphras_faith: My opinion would be God.\n \n I think this is what Love Never Dies is talking about.\n \n When asked what is good your answer is good is God.\n \n Seam like sort of a cop out on your part to me.\n\n \n \n Actually, keep reading the posts. I later define it as love. I also explain WHY I define it as God. It is not a cop out in any form. I take great pains to describe the reality that if it is defined by humans then it is subjective. I take a lot of time to point out the logical fallacies of it being humanly defined. I show clearly WHY it must come from outside humans. \n \n I have chosen to call that God. I explain why on that too. A cop out would be if I did not support my position or not allow argument against it. I respond to arguments and I support my position.\n \n Love Never Dies may disagree with my position. All I ask for is that Love Never Dies or you or anyone take a position and support it and refute my argumentation. I would think someone simply stating I am wrong or having a problem with my position but not supporting it would be more of a cop out.", 
   {
    "unicode_changes_made": true
   }, 
   232824, 
   null, 
   1159470420.0
  ], 
  [
   232893, 
   null, 
   "epaphras_faith", 
   "Shooter:\n \nIm not really sure what determines whats good or evil.\n \n I dont know how we can really label someone as \"evil\". Because, if we were in their situation, in their conditions, with their brain and line of thinking, we would do the same. We do what we were meant to do, and i dont think there is really any stopping that. I dont think it is right to judge people, because if you were in their exact shoes, you would've done the same. Therefore, you are really no better.\n\n \n First, I do not presuppose to label a PERSON as evil. I do think there are ACTS of evil and Good. People do these acts. But in my opinion, only God can determine that person's nature.\n \n EF\n \n Simone:\n \n \nGod is good?\n \n Who, then is God?\n \n Is God the primary mover of the Universe and the World? Why then the huge tsunami which killed hundreds of thousands of humans on and during the days after 26 December 2004? Was it to celebrate the birth of his son some 2,000 years before?\n\n \n People die. That is a fact of life. Why is it evil for a Tsunami to take the lives of people and not evil for old age to take the life of a person? Would you consider it to be actually good that no one ever died ever?\n \n EF", 
   {}, 
   232786, 
   null, 
   1159470660.0
  ], 
  [
   232974, 
   null, 
   "Jill White", 
   "Actually, keep reading the posts. I later define it as love. I also explain WHY I define it as God. It is not a cop out in any form. I take great pains to describe the reality that if it is defined by humans then it is subjective. I take a lot of time to point out the logical fallacies of it being humanly defined. I show clearly WHY it must come from outside humans. \n \n I have chosen to call that God. I explain why on that too. A cop out would be if I did not support my position or not allow argument against it. I respond to arguments and I support my position.\n \n Love Never Dies may disagree with my position. All I ask for is that Love Never Dies or you or anyone take a position and support it and refute my argumentation. I would think someone simply stating I am wrong or having a problem with my position but not supporting it would be more of a cop out.\n\n \"I later define it as love.\"\n \n Thank you!\n \n Next question: What is love?", 
   {}, 
   232890, 
   null, 
   1159500480.0
  ], 
  [
   233039, 
   null, 
   "epaphras_faith", 
   "\"I later define it as love.\"\n \n Thank you!\n \n Next question: What is love?\n\n \n I am thinking that could be a thread all on its own. However, the best I have ever heard is:\n \n \"Acting in the best interests of another regardless of the cost.\"\n \n It is hard to do that all the time for people you like let alone for those you hate. Loving the ones you hate can be a very trying concept. People are not perfect. Only that which is perfect can be truly good.\n \n EF", 
   {}, 
   232974, 
   null, 
   1159555260.0
  ], 
  [
   233486, 
   null, 
   "Jill White", 
   "I am thinking that could be a thread all on its own. However, the best I have ever heard is:\n \n \"Acting in the best interests of another regardless of the cost.\"\n \n It is hard to do that all the time for people you like let alone for those you hate. Loving the ones you hate can be a very trying concept. People are not perfect. Only that which is perfect can be truly good.\n \n EF\n\n Love is a bio chemical reaction in the brain that helps our species to survive.\n \n Or do you wish to discuss things in terms of frivolous concepts?", 
   {}, 
   233039, 
   null, 
   1159882200.0
  ], 
  [
   233534, 
   null, 
   "epaphras_faith", 
   "Love is a bio chemical reaction in the brain that helps our species to survive.\n \n Or do you wish to discuss things in terms of frivolous concepts?\n\n \n \n you have no engaged in the logical fallacy of equivocation. I am speaking of the word Love in terms of a VERB. Please note that you asked for my definition. I gave the definition. If you wish to argue it do so. My definition is in terms of action. You are defining the biochemical reaction undoubtedly referring to emotions. I do not refer to the emotion of love but rather the action. It is not meant for preservation of the species.\n \n The reason I say this is because I do not believe that this life is all there is. Therefore, I define in terms of consideration of an afterlife. This would obviate the need for preservation of the species.\n \n EF", 
   {}, 
   233486, 
   null, 
   1159907040.0
  ], 
  [
   233596, 
   null, 
   "mae", 
   "Do all human beings have good and evil in them ? \n \n Yes, but they are evil only if they commit evil acts. The barrier that prevents them from committing evil acts is conscience. So, the question is why some have a conscience and some don't. Do murderers have a conscience ?\n \n http://americanism.ws/yabb/YaBB.pl", 
   {
    "post_info": {
     "post_title": "Evil"
    }
   }, 
   217069, 
   null, 
   1159928100.0
  ], 
  [
   233964, 
   null, 
   "epaphras_faith", 
   "Do all human beings have good and evil in them ? \n \n Yes, but they are evil only if they commit evil acts. The barrier that prevents them from committing evil acts is conscience. So, the question is why some have a conscience and some don't. Do murderers have a conscience ?\n \n http://americanism.ws/yabb/YaBB.pl\n\n \n A little off topic, but interesting. You have one logical problem. Your conscience only comes into play AFTER an act is committed. It makes you feel guilty when you do something wrong.\n \n I submit that it is not an act that makes a person good or evil. There are good and evil in each person true. Good people can do acts of evil. Do you believe you cannot commit acts of evil? \n EF", 
   {}, 
   233596, 
   null, 
   1160159100.0
  ], 
  [
   233966, 
   null, 
   "Master_Shake", 
   "A little off topic, but interesting. You have one logical problem. Your conscience only comes into play AFTER an act is committed. It makes you feel guilty when you do something wrong.\n \n I submit that it is not an act that makes a person good or evil. There are good and evil in each person true. Good people can do acts of evil. Do you believe you cannot commit acts of evil? \n EF\n\n But good and evil only matters in terms of actions.", 
   {}, 
   233964, 
   null, 
   1160159580.0
  ], 
  [
   233985, 
   null, 
   "epaphras_faith", 
   "That is a very temporal view.\n \n Good and evil are a state and not an action.\n \n EF", 
   {}, 
   233966, 
   null, 
   1160164920.0
  ], 
  [
   234431, 
   null, 
   "Master_Shake", 
   "That is a very temporal view.\n \n Good and evil are a state and not an action.\n \n EF\n\n How do you know what \"state\" someone or something is then? The only way to judge this is by their actions.", 
   {}, 
   233985, 
   null, 
   1160521200.0
  ], 
  [
   234450, 
   null, 
   "epaphras_faith", 
   "How do you know what \"state\" someone or something is then? The only way to judge this is by their actions.\n\n \n Your statement begs the question. You assume that we SHOULD determine what state someone is in. My point would be that by definition, we call that \"judgement\".\n \n \n Good and evil do matter in terms of actions, but not only. In considering what are good and what are evil, it is not a matter of developing a laundry list of examples. Definition by example is a poor method of definition. Instead, what is it that constitutes evil and/or good. \n \n I have defined them earlier in the thread. \n EF", 
   {}, 
   234431, 
   null, 
   1160527080.0
  ], 
  [
   234475, 
   null, 
   "Master_Shake", 
   "Your statement begs the question. You assume that we SHOULD determine what state someone is in. My point would be that by definition, we call that \"judgement\".\n \n \n Good and evil do matter in terms of actions, but not only. In considering what are good and what are evil, it is not a matter of developing a laundry list of examples. Definition by example is a poor method of definition. Instead, what is it that constitutes evil and/or good. \n \n I have defined them earlier in the thread. \n EF\n\n I wasn't assuming anything, I was only continuing down the line you began.\n \n And for the sake of time, could you point me toward that post?", 
   {}, 
   234450, 
   null, 
   1160545380.0
  ], 
  [
   234571, 
   null, 
   "epaphras_faith", 
   "I wasn't assuming anything, I was only continuing down the line you began.\n \n And for the sake of time, could you point me toward that post?\n\n \n So I don't keep posting links, please refer to post 117 where I link. Please read the surrounding posts for context and prior to delivering argumentation. I do not wish to repeat my arguments. I would explain if you don't understand them though.\n \n Also, a begged question is a statement where there is an assumed position not in evidence. In this case you stated \nHow do you know what \"state\" someone or something is then? The only way to judge this is by their actions.\n\n \n Asking the question of How do you know what state someone is in assumes that it is actually important to know what state someone is in. It is not. therefore if we should not know what state someone is in, you question becomes moot. That is what I meant by assuming. You simply fell into a logical fallacy.\n \n EF\n \n PS Post 103 is a reasonable summary along with others.", 
   {}, 
   234475, 
   null, 
   1160604000.0
  ], 
  [
   236880, 
   null, 
   "Master_Shake", 
   "Good and evil are a state and not an action.\n\n You are declaring them a state not an action, saying that's unimportant to know what state someone is is, and yet you continue discussing this subject. Why?", 
   {}, 
   234571, 
   null, 
   1161987840.0
  ], 
  [
   236895, 
   null, 
   "epaphras_faith", 
   "You are declaring them a state not an action, saying that's unimportant to know what state someone is is, and yet you continue discussing this subject. Why?\n\n \n Because this is a philosophical discussion. The point is what is good and evil. Knowing which state any given person is in is unimportant to the definition. Knowing what actions any given person does is unimportant to the definition.\n \n It is a purely philosophical question. I like to think about such things.\n \n I also like thinking about concepts such as the nature of the universe, what effects quarks have on electromagnetics, does god exist, what is the nature of reality, what is wisdom etc. I like to discuss such things with people. \n \n On this topic Most go after the actions or try to define others. I like to stretch people to think beyond what is the norm to think. To really consider the logic of their positions. People often hold illogical and contradictory positions. I am sure I do as well, although I do not know what they would be at this point.\n \n So, I discuss what is good/evil.\n \n EF", 
   {}, 
   236880, 
   null, 
   1161993720.0
  ], 
  [
   238966, 
   null, 
   "Adept", 
   "Which, if you read my posts you would know is what makes it ridiculous to say that man gets to decide what good and evil are. We may perceive things one way or another, but Good and Evil absolutely exist and they exist objectively. The mere fact that we perceive them or need to perceive them points to the existence of them. There is no society alive that does not have a concept of good and evil. How to define what is what is another story. That can be argued and debated. However, the existence of them is not up for grabs. NO society says that there is no such thing as good or evil.\n\n \n Yes.\n \n \nGood and evil are built into the very fabric of the universe. They cannot simply be social constructs (which is essentially your argument) as there is no way to test that. The fact that good and evil are now and have always been perceived points directly it their existence.\n\n \n No.\n \n Good and Evil are adjectives, not nouns. Just like big and small. Big things and small things exist, and have always existed in every society. But big and small do not exist in isolation. Big cannot be something. Something has to be big. Just like evil cannot exist by itself, it is only a label to apply to something else.\n \n So we will always percieve big and small, good and evil, beautiful and ugly, heavy and lightweight, and so on. But those things do not exist by themselves. You can't have a jug of heavy, or a box full of evil. They're just adjectives.", 
   {}, 
   225183, 
   null, 
   1163171340.0
  ], 
  [
   238992, 
   null, 
   "Peeling", 
   "These are quotes from another thread, but concern the same subject:\n \n \nThe evidence supports that man has always known some concept of good and evil.\n\n \nFor these and other reasons it MUST be objective and for it to be objective it MUST come from outside of humans.\n\n And from this thread:\n \nThe fact that good and evil are now and have always been perceived points directly it their existence.\n\n \n I reject these arguments on two levels:\n \n First, your use of the word 'always' troubles me greatly. How many billions of years into the past does your assertion extend? We have no evidence to support the concept of good and evil existing for more than a tiny fraction of time, and considerable evidence to support the existence of our ancestors for much, much longer than that.\n \n Secondly, even if we are trying to grasp or define something external to our individual selves, that does not imply its objectivity or independent existence. This may seem like an impossible statement, but I will justify it in due course.\n \n To evidence, then:\n \n Evolution (the observation of its occurrence, not the theory) demonstrates that the concept of 'success' and 'failure' exists outside of the human mind. A successful organism makes more of itself; an unsuccessful one disappears. The process embodies success and failure, regardless of any individual organism's awareness of it. \n \n From that one can extrapolate definitions of beneficial and harmful. However, they may still be applied at a number of levels in often contradictory fashion. An elephant's teeth, for example, are eventually ground down to the root, starving to death an animal often still perfectly capable of reproduction. Harmful for the survival of the individual, but ultimately beneficial for the continuation of the genes it contains. On another level you have humans, who have enjoyed immense success as a species, possibly to the fatal detriment of the biosphere that supports them.\n \n What picture of Good and Evil do we paint on such a canvas?\n \n First, we can very quickly define 'good' or 'bad' behaviour in terms of the benefit or harm it causes, pausing to note that good and bad are indeed adjectives we apply to categorise actions. \n \n But that definition is inextricably bound to the level of abstraction at which you are measuring benefit or harm. An act which benefits an individual may harm other individuals, or society as a whole, or even the whole planet. Contrarywise, an act which benefits society may harm an individual - or even all individuals.\n \n From there, we can appreciate that what at first glance appears to be a historical struggle to define 'objective' good and evil is better explained as our progressively more sophisticated social intellect coming to grips with higher levels of abstraction of 'success', 'failure', 'benefit' and 'harm', and seeking the optimum balance.\n \n It's obvious (and marvellous) that pure selfish bean-counting individualism is less successful than a degree of commitment and cooperation. But we can also see that higher levels of abstraction are not necessarily better either - and this is where I return to the issue of objectivity. \n \n Objective Good and Evil (note capitals) would necessarily occupy the highest possible level of abstraction. But the human cost of Communism as pursued in the Soviet Union clearly shows the flaw in placing 'the good of' highly abstract concepts like society or ideology entirely before 'the good of' individuals. The endless strife in the middle east is an equally poignant illustration of what happens when people get it into their heads that 'the greater good' is all that matters.\n \n In most modern cultures, when defining morality, we seek to balance benefit and harm to individuals with that caused to society, the species and the biosphere. Are we seeking to arrive at some objective definition? Not at all; whatever conclusion we reach (or more likely orbit like a strange attractor), it is defined by the tension between our desires, our nature and our circumstances. Were our success due to less individualistic behaviour, as in the ant kingdom, our morals would be far different than they are. Were selfishness inherently more successful, they would be different again. In straightened circumstances, we adopt different social mores than in more comfortable times.\n \n Good and Evil, then, are terms we use to describe behaviour in the context of our chosen balance between individualism, social obligation and our responsibility to the wider world. They are defined by that balance, and as a consequence could not have existed beforehand. And although they are outside us as individuals, they are inextricably linked with our natures, belonging as they do to no other entity or creature.", 
   {}, 
   238966, 
   null, 
   1163182500.0
  ], 
  [
   239755, 
   null, 
   "Waxy", 
   "Peeling, excellent post. I have the same reservations with the logic and conclusions/assertions presented by EF on this topic.\n \n I wish I had the time to get into this debate further.\n \n Waxy", 
   {}, 
   238992, 
   null, 
   1163538300.0
  ], 
  [
   240460, 
   null, 
   "wascallywabbit", 
   "Hi all;\n \n Debates about good, evil, and human morality are fun, aren't they? Especially as they never seem to get resolved, one way or another.\n \n A couple of points that always arise, as they have done in this thread:--\n \n A/ There are events that are labelled 'evil', like volcanic eruptions, or 'good', like a big catch of fish, that are neither 'good' nor 'evil' in moral terms. This has already been pointed out and should not be brought up again in this thread except as a rejoinder to those who hold the position that the source of all 'good' is their notion of an absolute, \"god\", one who is in complete and perfect control of all things, of each and every event in the universe. For such believers the terms 'good' and 'evil' are rendered meaningless and absurd, and so cease to exist. Or should, rationally. They generally are, and are replaced by 'fate', 'kismet', 'fortune', 'pre-destination/grace', and in modern materialistic terms, 'mechanical/genetic determinism'.\n \n B/ The distinction between relative morality and absolute morality. Everyone agrees to the existence of relative, that is say, 'local', separation of thoughts, goals, desires, beliefs, values, and above all, actions/behaviours, into categories described as [using the adjectives of] 'good', 'evil', their cognates, and any combination of them to shade and classify by degrees, on what appears to be an open-ended continuum. Relative morality, aside from 'good wars', and whatnot, has, at some time or place, in some society or other, found that everything from cannibalism to burning babies alive were 'good' behaviours. This relative, local morality is hardly more than custom and zeitgeist, and is hardly worth debating.\n \n This leaves us with the issue of absolute morality; that is, a morality in which good and evil exist without any people to determine which is which, a morality that is independent of human definition. Does it or does it not exist? If it does, can it be discovered? \n \n If you begin with the premise, \"Such absolute morality does not exist.\", there is hardly any point in arguing further, since you cannot prove a negative proposition/opinion through mental argumentation/reasoning alone, but only with physical, empirical, sensory observation of an absence or contradictory fact. And then only in the relative, local sense, and that will never prove any 'a priori' absolute, universal position in any case. This has, of course, been pointed out earlier in the thread. Elephants in the room, dragons in the garage, and all that.\n \n So that leaves only those who believe that an absolute moral arbiter or criterion exists that is independent of human definition and human belief in it. Can such believers present evidence, from logic or from empirical observation or from any combination of the two, that supports this positive premise of universal, independently-existing, non-corporeal entities (nouns) named 'good' and 'evil', or not? And, if they exist as a 'state', (as has been posited by one poster, and which I take him to mean a \\'condition or mode of being, existing\\', what rational or empirical evidence exists to substantiate that claim?\n \n These are not rhetorical questions. I have wasted many any idle hour asking them of myself, but have not yet found a truly satisfactory answer. Hope to hear from someone with more insight than myself.", 
   {}, 
   239755, 
   null, 
   1163981400.0
  ], 
  [
   240964, 
   null, 
   "Jill White", 
   "Because this is a philosophical discussion. The point is what is good and evil. Knowing which state any given person is in is unimportant to the definition. Knowing what actions any given person does is unimportant to the definition.\n \n It is a purely philosophical question. I like to think about such things.\n \n I also like thinking about concepts such as the nature of the universe, what effects quarks have on electromagnetics, does god exist, what is the nature of reality, what is wisdom etc. I like to discuss such things with people. \n \n On this topic Most go after the actions or try to define others. I like to stretch people to think beyond what is the norm to think. To really consider the logic of their positions. People often hold illogical and contradictory positions. I am sure I do as well, although I do not know what they would be at this point.\n \n So, I discuss what is good/evil.\n \n EF\n\n No you do not; you want to discuss religion and god not the topic.\n \n I was reading this thread way back when you were told by Sprocket that he was not interested in continuing with the discussion with you because it was your intent to discuss religion in the philosophy section.\n \n You insisted he continue the discussion with you and he did, probably against his better judgment only to find that the discussion once again became your personal religious crusade.\n \n I can't see that this has changed.\n \n If you want to talk about god do it in religion where it belongs.\n \n Or don't you think a topic like this belongs in religion?\n \n If so then I agree religion has nothing to do with good, the religious have no idea how to define it and because of this should excluded them selves from rational discussion of it.", 
   {
    "post_info": {
     "post_title": "Good Is Not God"
    }, 
    "unicode_changes_made": true
   }, 
   236895, 
   null, 
   1164474840.0
  ], 
  [
   241288, 
   null, 
   "epaphras_faith", 
   "No you do not; you want to discuss religion and god not the topic.\n \n I was reading this thread way back when you were told by Sprocket that he was not interested in continuing with the discussion with you because it was your intent to discuss religion in the philosophy section.\n \n You insisted he continue the discussion with you and he did, probably against his better judgment only to find that the discussion once again became your personal religious crusade.\n \n I can't see that this has changed.\n \n If you want to talk about god do it in religion where it belongs.\n \n Or don't you think a topic like this belongs in religion?\n \n If so then I agree religion has nothing to do with good, the religious have no idea how to define it and because of this should excluded them selves from rational discussion of it.\n\n \n You have obviously not read everything. You have only read what I wrote. Any time I brought God into the picture it was a direct result of someone asking me what I believed. It is not a religious crusade. I have my own beliefs to be sure, when I am asked what they are I respond truthfully. \n \n Religion and philosophy often intermingle. It is the nature of the beast. \n \n Deal with it.\n \n My discussion has been perfectly respectable concerning a philosophy thread. You have obviously never taken a philosophy class. Had you done so you would have encountered all kinds of religious information.\n \n EF", 
   {
    "unicode_changes_made": true
   }, 
   240964, 
   null, 
   1164740940.0
  ], 
  [
   242737, 
   null, 
   "Yossarian", 
   "Are you concerned with enlightenment,\n which implies a static attainment,\n or rather enlightening,\n an unending process\n of continual opening?\n Are you concerned with answers\n or rather with boundless questions?\n For the answer\n never fails to kill enlightening;\n the mind then reverts\n to the static knowing,\n soon becomes caught\n again in the web\n of associations and\n reduces the entirety\n of the world to the mundane.\n \n - Ji Aoi Isshi\n\n \n Good and Evil are concepts that are mutually dependent. Just like \"big\" has no meaning without the idea of \"small\", Good can\\'t be defined without a precise definition of Evil. Defining either one in a way that everyone can understand and agree to is impossible. A Satanist might tell you that \"good\" is anything that provides pleasure. Sean Hannity will tell you that \"evil\" is Al Qaeda and the Democratic Party.", 
   {}, 
   241288, 
   null, 
   1165730160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is good/What is evil?", 
  "url": "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 8160, 
  "discussion_files": [
   [
    "5492.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-print.html"
   ], 
   [
    "5493.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-10-print.html"
   ], 
   [
    "5494.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-8-print.html"
   ], 
   [
    "5495.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-6-print.html"
   ], 
   [
    "5496.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-4-print.html"
   ], 
   [
    "5497.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-5-print.html"
   ], 
   [
    "5498.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-7-print.html"
   ], 
   [
    "5499.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-9-print.html"
   ], 
   [
    "5500.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-3-print.html"
   ], 
   [
    "5501.html", 
    "http://www.4forums.com/political/philosophy-debates/8160-what-good-what-evil-2-print.html"
   ]
  ], 
  "identifier": 8160
 }
]