[
 [
  [
   214647, 
   null, 
   "simone", 
   "It could last six days, six weeks. I doubt six months. . . \n\n Here we have a classic example of a Top Demon invoking the demons of the deep through deceit, unleashing the demons of unending war, humans dying horrible deaths by the tens of thousands, all the ravages of war which bring great joy to the devil and all his demons.\n \n Note the repetitive use of the word \"SIX,\" a magical formula which calls forth these demons, which only a Top Demon can use.", 
   {
    "post_info": {
     "post_title": "DevilSpeak and DemonSpeak"
    }
   }, 
   null, 
   null, 
   1148824320.0
  ], 
  [
   214662, 
   null, 
   "Tastyfish", 
   "The daemonic (and angelic) languages are very precise, words like 'could' and 'doubt' don't have an equivalent.", 
   {}, 
   214647, 
   null, 
   1148833680.0
  ], 
  [
   214665, 
   null, 
   "Monster", 
   "Was it Bush that said that?", 
   {}, 
   214662, 
   null, 
   1148837520.0
  ], 
  [
   214710, 
   null, 
   "simone", 
   "Rummy. But Tastyfish, there must be some demonic reason for the way this war situation was created! It's like something out of a horror novel.\n \n And, you know the Republican Bohemian Club was performing demonic rites in the California hills.", 
   {}, 
   214665, 
   null, 
   1148857620.0
  ], 
  [
   214716, 
   null, 
   "Inyx", 
   "On June 6th, date will be 6. 6. 06", 
   {}, 
   214710, 
   null, 
   1148860800.0
  ], 
  [
   214731, 
   null, 
   "pandion", 
   "I once had a silly cashier tell me that my purchase was evil. It totaled 11.34. This silly little twit actually read it upside down and came up with \"he.ll\". I told her that I would return some items if she preferred a total of 6.66. She was quite upset by that suggestion.\n \n How stupid can some fundies be? Numbers on a cash register, when read upside down have some moral meaning? How mindless!", 
   {}, 
   214716, 
   null, 
   1148884440.0
  ], 
  [
   214732, 
   null, 
   "Tastyfish", 
   "I once had a silly cashier tell me that my purchase was evil. It totaled 11.34. This silly little twit actually read it upside down and came up with \"he.ll\". I told her that I would return some items if she preferred a total of 6.66. She was quite upset by that suggestion.\n \n How stupid can some fundies be? Numbers on a cash register, when read upside down have some moral meaning? How mindless!\n\n You're sure it wasn't the two infant's hearts and the quart of virgin blood that made her think that?", 
   {}, 
   214731, 
   null, 
   1148908320.0
  ], 
  [
   214747, 
   null, 
   "simone", 
   "On June 6th, date will be 6. 6. 06\nBut, of course, Inyx. ROFL!", 
   {}, 
   214716, 
   null, 
   1148917320.0
  ], 
  [
   214798, 
   null, 
   "maximus", 
   "Simone,\n You believe in demons!? (but only in demons and not in gods)", 
   {}, 
   214747, 
   null, 
   1148966760.0
  ], 
  [
   214812, 
   null, 
   "simone", 
   "I have been a student of Buddhism and I am extremely intrigued by the Buddhist concept of six levels of existence:\n \n http://www.lioncity.net/buddhism/index.php?act=ST&f=2&t=95\n \n \nThe world of heaven. This is the world of enjoyment, pleasure or pleasant things. The condition of heaven is impermanent, and this state of mind will also change.\n \n The world of humans. (Human beings) In the world of humans, sometimes we are happy, sometimes we are sad, sometimes we are laughing, sometimes we are crying.\n \n The world of asuras. This is the world of fighting, or strife. The realm or state of mind of fighting.\n \n The world of hungry spirits. This is the realm of dissatisfaction, not being content. The state of having endless unsatisfied desires, or greed. Figuratively speaking, always being hungry.\n \n The world of animals. It is the realm lacking reason. The state without reason. Without reason, mistakes are made, causing hardships or suffering to self, and at times others. Without reason, being dominated by one's desires.\n \n The world of hell. Hell refers to the realm of suffering. The state of suffering and pain, which through cause and condition people will enter.\n", 
   {}, 
   214798, 
   null, 
   1149007620.0
  ], 
  [
   214813, 
   null, 
   "simone", 
   "When one examines the human situation one finds humanity in each one of the following categories:\n \nThe world of heaven. This is the world of enjoyment, pleasure or pleasant things. The condition of heaven is impermanent, and this state of mind will also change.\nThis heaven is not the heaven of Christianity and Islam. This is the realm of humans who have the lives of the Lesser Gods, those who have happy circumstances in this life through wealth or the accident of birth and they tend to be lost in their material pleasures and are unaware of the suffering of others.\n \nThe world of humans. (Human beings) In the world of humans, sometimes we are happy, sometimes we are sad, sometimes we are laughing, sometimes we are crying.\nThis is the real world. This is where we have the best environment for questioning our existence.\n \nThe world of asuras. This is the world of fighting, or strife. The realm or state of mind of fighting.\nThe macho world. The world of testosterone in vast quanities, where \"boys will be boys\" and we overlook their pranks because that's the way \"boys\" are, including the cute boyish president we have who delighted in branding the buttocks of initiates into his Yale University cult, of administering scars with a cigarette, some other acts that were echoed in the horrors of Abu Ghraib.\n \nThe world of hungry spirits. This is the realm of dissatisfaction, not being content. The state of having endless unsatisfied desires, or greed. Figuratively speaking, always being hungry.\nThe true spirit of capitalism, endless greed, financial growth at the cost of all else.\n \nThe world of animals. It is the realm lacking reason. The state without reason. Without reason, mistakes are made, causing hardships or suffering to self, and at times others. Without reason, being dominated by one's desires.\nThis has been illustrated in a number of elections in recent times, where the beasts were panicked by an image of Osama bin Laden on their TV screens, the man who has inexplicably excaped capture, and the beasts were warned that Osama bin Laden wanted John Kerry to win. They panicked in their beastly way and voted for Kerry's opponent.\n \nThe world of hell. Hell refers to the realm of suffering. The state of suffering and pain, which through cause and condition people will enter.\nAlas, too much of humanity is suffering in this state--starvation, the ravages of warfare, the ravages of natural disasters.", 
   {}, 
   214812, 
   null, 
   1149008400.0
  ], 
  [
   214820, 
   null, 
   "simone", 
   "I believe that the Realm of Asuras is also the Realm of Demons but I'm going to have to do a bit of research to verify that.", 
   {}, 
   214813, 
   null, 
   1149011340.0
  ], 
  [
   214821, 
   null, 
   "simone", 
   "To further complicate the understanding of Buddhism, it can also be argued that the Realm of Hell is also the Realm of Demons because demons are considered to be rather stupid beings.\n \n And, according to some schools of Buddhism there are ten realms, the four higher and the six lower:\n \n http://www.reference.com/browse/wiki/Ten_spiritual_realms\n \n Within this construct the six lower realms are divided into the three good and the three evil realms.\n \n Arghhhh!\n \n One is tempted to lapse into simple Christianity as practised by many, Good vs. Evil and someone else to tell you what is good and evil so that you don't have to think.", 
   {}, 
   214820, 
   null, 
   1149011760.0
  ], 
  [
   214889, 
   null, 
   "Inyx", 
   "\n One is tempted to lapse into simple Christianity as practised by many, Good vs. Evil and someone else to tell you what is good and evil so that you don't have to think.\n\n \n Now now, Simone, where is the fun in that? Having to choose in which buddhist realm you currently find yourself in, is so much more satisfying than burdon yourself with the black & white dilema what is good or evil (although even others tell you that ). :) \n \n The realms exist simuntaniously so i don't think there would be much problem to skip from one to another, although it is best for you to avoid some.", 
   {}, 
   214821, 
   null, 
   1149069120.0
  ], 
  [
   214894, 
   null, 
   "simone", 
   "And, quite frankly, I have found myself at times in all realms.", 
   {}, 
   214889, 
   null, 
   1149090060.0
  ], 
  [
   214949, 
   null, 
   "Inyx", 
   "Exhausting that can be sometimes, can't it?", 
   {}, 
   214894, 
   null, 
   1149119520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  DevilSpeak and DemonSpeak", 
  "url": "http://www.4forums.com/political/religion-debates/8190-devilspeak-demonspeak.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8190, 
  "discussion_files": [
   [
    "27186.html", 
    "http://www.4forums.com/political/religion-debates/8190-devilspeak-demonspeak-print.html"
   ], 
   [
    "27187.html", 
    "http://www.4forums.com/political/religion-debates/8190-devilspeak-demonspeak-2-print.html"
   ]
  ], 
  "identifier": 8190
 }
]