[
 [
  [
   12156, 
   null, 
   "Ness757", 
   "My religion is a mix between Christianity, Buddhism and atheism so I have taken what I think is satisfying out of all three and made it into one.\n \n I believe in science, but I beleive it as the way that God created the universe. I think he just gave it a push (the big bang) and is letting it run it's course. Also, I don't believe in heaven or hell, but I do think our souls are recycled after death. \n \n Probably the most wierd of my beliefs is that the person we view as God may be a member of an advance alien race capable of creating their own universes.", 
   {
    "post_info": {
     "post_title": "My Thoughts on God"
    }
   }, 
   null, 
   null, 
   1059010680.0
  ], 
  [
   12163, 
   null, 
   "Crim", 
   "My religion is a mix between Christianity, Buddhism and atheism \n \n \nI believe in science, but I beleive it as the way that God created the universe. \n \n \n Atheism has only one tenet, and you don't hold it.", 
   {}, 
   12156, 
   null, 
   1059023280.0
  ], 
  [
   12172, 
   null, 
   "Ness757", 
   "I should have said science instead of atheism. My mistake.", 
   {}, 
   12163, 
   null, 
   1059076440.0
  ], 
  [
   12229, 
   null, 
   "maximus", 
   "Ness,\n Do you embrace the theology of Christianity, the morals, the ritual? What component?", 
   {}, 
   12172, 
   null, 
   1059175500.0
  ], 
  [
   12325, 
   null, 
   "Pikeman85", 
   "Sounds like you're a deist mixed with a belief in reincarnation.", 
   {}, 
   12229, 
   null, 
   1059521220.0
  ], 
  [
   12333, 
   null, 
   "SilentPoet", 
   "\"My religion is a mix between Christianity, Buddhism and atheism so I have taken what I think is satisfying out of all three and made it into one.\"\n \n \n - Sorry but I find that hard to beleive even if you substitue science for atheism.\n \n \n Thanks for reading this\n \n Always Stay Open Minded", 
   {}, 
   12325, 
   null, 
   1059526620.0
  ], 
  [
   12336, 
   null, 
   "Ness757", 
   "Ness,\n Do you embrace the theology of Christianity, the morals, the ritual? What component?\n\n \n \n I believe that science explains the way God created the universe.", 
   {}, 
   12229, 
   null, 
   1059532020.0
  ], 
  [
   12660, 
   null, 
   "gilligan8503", 
   "many people hold your belief. about the buddhism thing; no. reincarnation is also held dear to those of the jahova's witnesses. they are 'christians'.\n \n you are a considered a modern christian, due to your belief in science.", 
   {}, 
   12336, 
   null, 
   1060032300.0
  ], 
  [
   12672, 
   null, 
   "maximus", 
   "Gilligan,\n I'm not sure Jehovah's Witnesses can be considered Christians. Not in the accepted and traditional use of the word Christian. They do not believe in the divinity of Christ.", 
   {}, 
   12660, 
   null, 
   1060060440.0
  ], 
  [
   12692, 
   null, 
   "ApathySam", 
   "They do not believe in the divinity of Christ.\n\n \n Whoa, they don't? What do they believe?", 
   {}, 
   12672, 
   null, 
   1060064700.0
  ], 
  [
   12706, 
   null, 
   "maximus", 
   "Whoa, they don't? What do they believe?\n\n \n SAm,\n Check out this official Jehovah's Witness website:\n \n http://www.watchtower.org/library/ti/article_06.htm \n \n Make sure to read the section \"God Superior At All Times\" specifically the 3rd paragraph, although the entire article applies", 
   {}, 
   12692, 
   null, 
   1060070640.0
  ], 
  [
   12742, 
   null, 
   "Mysterium16", 
   "Science does explain the way God runs the universe. \n Science is rational. The idea of something happening without cause just for the fun of it is not rational.\n I think religion and reason can coexist. They just don't cuz people like being stubborn.\n I know alot of Jehovah Witnesses. \n They used to come visit me all the time. They didn't come to talk about thier religion tho. They came to play with my baby sister and eat all our food. They are such nice people.", 
   {}, 
   12706, 
   null, 
   1060106460.0
  ], 
  [
   12746, 
   null, 
   "AMD4EVER", 
   "Science does explain the way God runs the universe. \n Science is rational. The idea of something happening without cause just for the fun of it is not rational.\n I think religion and reason can coexist. They just don't cuz people like being stubborn.\n\n \n Its not about science vs religion really. Religion really doesn't mean belief in a greater being when people are debating science vs religion. Religion has somehow taken on all the attributes of Christianity. So really when debating science vs Christianity, there is a good reason why the two cannot coexist. They contradict each other too many times.\n \n However in the debate of actual religion vs science, there is no question that the two can coexist. No one is going to debate this either because who is to say that one cannot have a religious belief that a higher being created science and that he let the entire universe be dictated by it?\n \n So just realize that it is not people being stubborn that makes it impossible for science vs religion to exist, people are actually just being ignorant and changing the meaning of religion to fit into Christianity which in turn makes their conflict with science.", 
   {}, 
   12742, 
   null, 
   1060109820.0
  ], 
  [
   12757, 
   null, 
   "Mysterium16", 
   "[QUOTE]\nIts not about science vs religion really. Religion really doesn't mean belief in a greater being when people are debating science vs religion. Religion has somehow taken on all the attributes of Christianity. So really when debating science vs Christianity, there is a good reason why the two cannot coexist. They contradict each other too many times.\n So just realize that it is not people being stubborn that makes it impossible for science vs religion to exist, people are actually just being ignorant and changing the meaning of religion to fit into Christianity which in turn makes their conflict with science\n\n \n \n I'm a Christian and I love science. In fact, I plan to be a scientist for the rest of my life. \n Nothing I learn in a textbook will ever contradict the existence of God, nothing will ever contradict the value of brotherly love in human society and science will not contradict the value of wisdom.\n Our word 'science' is derived from the Latin 'scientia' meaning 'to know' Science is the search for knowledge.\n The Christian doctrine is about Love and Wisdom and that's all. \n Wisdom can't be without the pursuit of knowledge.\n So in truth, the Christian doctrine would be incomplete without science. \n Ignorance is 'not knowing', if you've been educated you can't choose to go back to 'not knowing' (unless you give yourself amnesia).\n So people who are taught science and choose to ignore it are being stubborn (unreasonably unyeilding) , they are choosing not to investigate the truth, but to feign ignorance.", 
   {}, 
   12746, 
   null, 
   1060124280.0
  ], 
  [
   12760, 
   null, 
   "AMD4EVER", 
   "I'm a Christian and I love science. In fact, I plan to be a scientist for the rest of my life. \n Nothing I learn in a textbook will ever contradict the existence of God, nothing will ever contradict the value of brotherly love in human society and science will not contradict the value of wisdom.\n Our word 'science' is derived from the Latin 'scientia' meaning 'to know' Science is the search for knowledge.\n The Christian doctrine is about Love and Wisdom and that's all. \n Wisdom can't be without the pursuit of knowledge.\n So in truth, the Christian doctrine would be incomplete without science. \n Ignorance is 'not knowing', if you've been educated you can't choose to go back to 'not knowing' (unless you give yourself amnesia).\n So people who are taught science and choose to ignore it are being stubborn (unreasonably unyeilding) , they are choosing not to investigate the truth, but to feign ignorance.\n\n \n I was also a Christian scientist for a while but the two are just too very different when you dig deep into them. Modern science can often show things that contradict the Bible just as the Bible shows things that contradict science. Our science shows that all things happen for a very logical reason and not a spiritual reason. For instance, if I pray for something like a car and suddenly I find a car in my driveway and the keys are in it, science would suggest that the car didn't just appear there because it is impossible for that to happen. However those that believe in the Bible wouldn't be completely surprised that such a thing would be possible and that the car could have just come from God himself. Even the Bible suggests many times that if you pray for something you may recieve it. Science would not suggest that this is so. It doesn't even matter which side is correct in this debate since all I am trying to show is that science and Christianity are not in harmony with each other at all points.\n \n One person I used to debate Christianity vs religion with often used science to explain certain events and for many of his explainations the rules of science needed to be bent and sometimes broken. Such as his explaination for the evidence against the likelihood of dinosaurs being alive at the same time as man which the Bible would have you believe. A 6-10,000 year old earth wouldn't leave much time for shifting of continents properly to explain for patterns of life based on fossils and nor would it leave much time for the creation of oil or the depth at which the dinosaur bones are burried when compared to human bones which are not often found at the depths or show the compressions over time as human bones. Carbon dating explainations ignored, his explainations included strange cosmic forces mixed with the great flood of the Earth. The great flood alone would have needed to break all the laws of physics by creating more water than Earth had while changing the speed of the orbit on Earth and its angle on its axis. He believed strongly that things in the Bible could be proven by science although he needed to fill in the blank areas with some God miracles to make them work.\n \n I have no problem with a Christian also being a scientist although I don't think you can claim that both agree with each other. Critical thinking will show that science and the Bible conflict in many areas and these areas often cause conflict between people of both of these beliefs. A single individual can just decide to ignore these mistakes and believe in both but it is still inaccurate to do so although sometimes fit the will of the individual. However, you do say your a Christian over a scientist. Scientists don't marry a conclusion that is not proven and you have married your idea of there being a God therefore cannot be 100% scientific and logical about it.\n \n I also believe that nothing can contradict the existance of God. Even disproving the Bible wouldn't disprove God. The new argument would become that the Bible is a fraud and was tainted by the enemies of God long after Jesus, son of God, walked the Earth. God will always exist to those who want to believe in him because there is no way to disprove that he exists. One of my favorite quotes about this topic comes from a video game I play:\n \"Man's unfailing capacity to believe what he prefers to be true rather than what the evidence shows to be likely and possible has always astounded me. We long for a caring Universe which will save us from our childish mistakes, and in the face of mountains of evidence to the contrary we will pin all our hopes on the slimmest of doubts. God has not been proven not to exist, therefore he must exist.\"\n \n Perhaps the belief in both science and Christianity makes you feel safe as it did to me years ago. It helped make my life complete by allowing me to use logic to interpret the known world and faith to avoid fear and doubt and promote hope. It failed in this view only after I tried looking too hard into the truths of the Bible and the psychology of humans. My advice to you is avoid this sort of research if you are happy as you are, because you are right. \"If you've been educated you can't choose to go back to 'not knowing'\".", 
   {}, 
   12757, 
   null, 
   1060136280.0
  ], 
  [
   12789, 
   null, 
   "Mysterium16", 
   "The Bible is not a useless story book for the blissfully ignorant. \n I am going to show you how the Bible is useful in your life regardless of whether or not it's true.\n \n Your argument brought to mind the story of the Fall of Man :) \n When you eat from the tree of Knowledge of Good and Evil you do feel sorow (trust me I know this, most definitely).\n It is hard to be the one who knows. That is what the Fall of Man story tells us. \n Does the actual story have to be true for this lesson to be true?\n No. It doesn't. But humans eat from the tree everyday and gain sorrow because they can't handle knowledge. Sometimes it's better not to know.Only the insanely courageous seek knowledge. Science will tell you this, too.\n \n \nMy advice to you is avoid this sort of research if you are happy as you are, because you are right. \"If you've been educated you can't choose to go back to 'not knowing'\n\n \n So you are warning not to eat from the tree of knowledge (and research). \n You play God I'll play Adam. I know what I'm doing so I'm going to disobey you emoticon_xangel \n Just promise not to smite me. \n \n What does the flood story say?\n First of all, a flood must have happened in the region for so many Mid-East cultures to form stories around it.\n And maybe a man really [U] save himself by putting himself on a boat with his animals and his wife. \n As the archaeologists say: absence of evidence is not evidence of absence.\n But the story also tells us this: when a man works hard to do well in his every endeavor, when he cares enough to notice the world around him, he will be saved by his own intuition and observation. \n Who can disagree with this? Certainly not Science!", 
   {}, 
   12760, 
   null, 
   1060191360.0
  ], 
  [
   12793, 
   null, 
   "AMD4EVER", 
   "The Bible is not a useless story book for the blissfully ignorant. \n I am going to show you how the Bible is useful in your life regardless of whether or not it's true.\n \n Your argument brought to mind the story of the Fall of Man :) \n When you eat from the tree of Knowledge of Good and Evil you do feel sorow (trust me I know this, most definitely).\n It is hard to be the one who knows. That is what the Fall of Man story tells us. \n Does the actual story have to be true for this lesson to be true?\n No. It doesn't. But humans eat from the tree everyday and gain sorrow because they can't handle knowledge. Sometimes it's better not to know.Only the insanely courageous seek knowledge. Science will tell you this, too.\n \n \n \n So you are warning not to eat from the tree of knowledge (and research). \n You play God I'll play Adam. I know what I'm doing so I'm going to disobey you emoticon_xangel \n Just promise not to smite me. \n \n What does the flood story say?\n First of all, a flood must have happened in the region for so many Mid-East cultures to form stories around it.\n And maybe a man really [U] save himself by putting himself on a boat with his animals and his wife. \n As the archaeologists say: absence of evidence is not evidence of absence.\n But the story also tells us this: when a man works hard to do well in his every endeavor, when he cares enough to notice the world around him, he will be saved by his own intuition and observation. \n Who can disagree with this? Certainly not Science!\n\n \n \n If this is how you view it than you and I are in total agreement already. The Bible is really a great thing. It inspires people and gives them hope while allowing them to be productive in society. The meanings of the stories in the Bible can be true without the Bible being true. However, as far as Christianity goes, it should stop praising the Bible for being the word of God and just accept that the principles of the Bible are a way of life and not the will of an all-powerful spirit.", 
   {}, 
   12789, 
   null, 
   1060192380.0
  ], 
  [
   13231, 
   null, 
   "oshi", 
   "\n Probably the most wierd of my beliefs is that the person we view as God may be a member of an advance alien race capable of creating their own universes.\n\n \n wow, thats a new one, sorta. someone told me jesus was an alein once. which makes sense cuz he didnt come from this planet. so are you saying there are more gods out there? maybe one for every planet with life on it.. hmm", 
   {}, 
   12156, 
   null, 
   1060757640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  My Thoughts on God", 
  "url": "http://www.4forums.com/political/religion-debates/820-my-thoughts-god.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 820, 
  "discussion_files": [
   [
    "7175.html", 
    "http://www.4forums.com/political/religion-debates/820-my-thoughts-god-print.html"
   ], 
   [
    "7176.html", 
    "http://www.4forums.com/political/religion-debates/820-my-thoughts-god-2-print.html"
   ]
  ], 
  "identifier": 820
 }
]