[
 [
  [
   214862, 
   null, 
   "David2004", 
   "Are the Israelis any safer today almost 60 years after the founding of the Jewish State? Most nations of people will agree that the State of Israel is a modern day military super power that is threatening world peace along with the United States with their current military actions. The preemptive military strikes of the United States and Israel have created more enemies than allies making a bad situation worst. Both the United States and Israel are trying to defend policies that are unfair and immoral by global standards. Only the United States and Israel are united with the majority of the nations of the world are in opposition of their policies and actions. \n \n Neither the United States nor the State of Israel can maintain their current military policies and actions for the next sixty years. It is the military industrial complex of both nations that are the greatest threat to world peace. It is not a lack of military intelligent information but a lack of understanding of the grievances of the people of the other side that is the problem. Both sides are guilty of corrupting the information and facts to manipulate the perception of their people. \n \n There are religious military extremists on all sides that are fanning the flames to the fire. If only the people in power could put themselves in the shoes of the people on the other side. There is no way to win a war if you do not understand who you are fighting. The United States-Israeli Middle East Policies have compounded the problems in the Middle East. Not until there are major changes in the policies and actions of Israel and the United States will there be peace. \n \n Israel a nation the size of the State of New Jersey maintains one of the world's most powerful military forces. The United States military spending accounts for 42% of the world's total military spending. Isn't there something wrong with this picture? There is no way a nation can spend this amount of their nation's natural resources and have the resources for the humanitarian aid that is needed to build peace. \n \n Both the State of Israel and the United States must change their military industrial economies to peacetime economies. This change alone will make new things possible leading to a better world if done right. For starter imagine if both the State of Israel and the United States cut their military spending by 50% and allocated half of it for humanitarian projects with their neighbors. If the United States took half of what it gives to the State of Israel annually and invests it into the Palestinian society. Then things could be different but reality tells you there is no chance this would ever happen. \n \n http://peacereform.blogspot.com/", 
   {
    "post_info": {
     "post_title": "The Jewish People in Their Fight for Israel will Destroy the World"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1149044880.0
  ], 
  [
   214886, 
   null, 
   "MTKnight", 
   "I can understand about the US cutting the military spending. That would help a lot and maybe even lower the increasing debt. It wouldn't be good for right now seeing how we have troops stationed everywhere in the world. Maybe after this Iraq conflict...whenever that ends...\n \n Although Israel I really don't think would ever do that with the infighting and the fear of another war with other nations.\n \n Although about the artice mentioned I really could never imagine the UN doing anything from one of those city states to prevent war with a full blown nation.", 
   {}, 
   214862, 
   null, 
   1149062160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Jewish People in Their Fight for Israel will Destroy the World", 
  "url": "http://www.4forums.com/political/peace-middle-east/8201-jewish-people-their-fight-israel-will-destroy-world.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 8201, 
  "discussion_files": [
   [
    "31042.html", 
    "http://www.4forums.com/political/peace-middle-east/8201-jewish-people-their-fight-israel-will-destroy-world-print.html"
   ]
  ], 
  "identifier": 8201
 }
]