[
 [
  [
   215101, 
   null, 
   "jyoshu", 
   "http://www.breitbart.com/news/2006/06/01/D8HVQLM00.html\n \n Not a new revelation or anything, but a current look at a recent issue with the upcoming elections. I don't support this amendment and feel that it is ill-conceived on several grounds. It's an unnecessary intrusion of the federal government. It's also something that states should take up on their own if it is to be taken up.\n \n The last part of the article quoted someone as saying this was a religious freedom issue, and I don't get that. This has nothing to do with religion whatsoever.\n \n And apparently there will be a fresh round of ballot initiatives concerning marriage in the upcoming elections for the states of South Carolina, South Dakota, Tennessee, Virginia and Wisconsin.", 
   {
    "post_info": {
     "post_title": "Bush to Back Gay Marriage Ban Amendment"
    }
   }, 
   null, 
   null, 
   1149264660.0
  ], 
  [
   215103, 
   null, 
   "BobNelson2", 
   "This has nothing to do with religion whatsoever.\n\n \n Well... someone hasn't been following the campaigns for the so-called \"protection of marriage\" amendments, federal or state.", 
   {}, 
   215101, 
   null, 
   1149265620.0
  ], 
  [
   215107, 
   null, 
   "Kronus", 
   "\n The last part of the article quoted someone as saying this was a religious freedom issue, and I don't get that. This has nothing to do with religion whatsoever.\n \n\n \n How do you figure? Many, if not most, people who oppose homosexuality do so on religious grounds. And one of the stated purposes of the amendment is to protect the \"sanctity\" of marriage; a reference to the religious, as opposed to civil, aspect of marriage. If you take away those who are pushing this amendment in an attempt to get others to conform to their religious views than who are you left with?", 
   {}, 
   215101, 
   null, 
   1149267480.0
  ], 
  [
   215108, 
   null, 
   "MrWriteLA", 
   "One wonders what non-religious (i.e., rational) justification the poster who began the thread has for supporting the amendment.", 
   {}, 
   215101, 
   null, 
   1149267840.0
  ], 
  [
   215109, 
   null, 
   "BobNelson2", 
   "One wonders what non-religious (i.e., rational) justification the poster who began the thread has for supporting the amendment.\n\n \n He said he does not support it. That's good.\n \n That he sees no relationship between many of the \"moral\" arguments he makes on these threads and the campaign for the amendment is, at best, mysterious.", 
   {}, 
   215108, 
   null, 
   1149268380.0
  ], 
  [
   215110, 
   null, 
   "jyoshu", 
   "How do you figure? Many, if not most, people who oppose homosexuality do so on religious grounds. And one of the stated purposes of the amendment is to protect the \"sanctity\" of marriage; a reference to the religious, as opposed to civil, aspect of marriage. If you take away those who are pushing this amendment in an attempt to get others to conform to their religious views than who are you left with?\n\n \n I guess my thinking was that since the amendment was an issue of federal benefits and who gets them, I didn't see that as taking away anyone's religious freedom (therefore my statement that it's not really a \"religious freedom\" issue. Maybe I misunderstood the quote in the article). But I can agree the amendment is being pushed from some religious groups who have religious motivations for it. One could argue however that it's simply a part of our culture that is behind it. Personally I'm not so much bothered by the fact that people have religious motivations behind the amendment as I am the fact the amendment is an over-intrusion by the federal govt in affairs that aren't their place to meddle in. People have all sorts of reasons for supporting or opposing govt. initiatives (laws, acts, amendments, etc.), relgious beliefs included, and that's a normal part of our system--people supporting and opposing based on their views. So the argument that this is a breach of separation of church and state is pretty weak, IMO.", 
   {}, 
   215107, 
   null, 
   1149268680.0
  ], 
  [
   215111, 
   null, 
   "Kronus", 
   " People have all sorts of reasons for supporting or opposing govt. initiatives (laws, acts, amendments, etc.), relgious beliefs included, and that's a normal part of our system--people supporting and opposing based on their views. So the argument that this is a breach of separation of church and state is pretty weak, IMO.\n\n \n It's been a long standing standard that if the only motivation for a law, act, etc is religious, then it's a violation of SOCAS. If a proposed law just happens to agree with your religion, or if religion is just one small part of the motivation, then it's not a problem. But if you take out religion and you're left with pretty much nothing, then you've got an issue.", 
   {}, 
   215110, 
   null, 
   1149269220.0
  ], 
  [
   215114, 
   null, 
   "jyoshu", 
   "It's been a long standing standard that if the only motivation for a law, act, etc is religious, then it's a violation of SOCAS. If a proposed law just happens to agree with your religion, or if religion is just one small part of the motivation, then it's not a problem. But if you take out religion and you're left with pretty much nothing, then you've got an issue.\n\n \n Well . . . one could make that argument about anything--voting for instance. Amendments are created by voting, and people and legislatures vote (hopefully) their conscience (and the will of their constituents), even if they are religious. I think this is a different matter than, say, displaying religious icons on courtroom walls or grounds, which is a clear endorsement of religion by the government. \n \n The 18th amendment was religion-motivated, but it didn't get rescinded for THAT reason. It got rescinded because it didn't work practically. (and because FDR wanted to see the returns on the economy for his New Deal)", 
   {}, 
   215111, 
   null, 
   1149269700.0
  ], 
  [
   215116, 
   null, 
   "Kronus", 
   "Well . . . one could make that argument about anything--voting for instance. Amendments are created by voting, and people and legislatures vote (hopefully) their conscience (and the will of their constituents), even if they are religious. I think this is a different matter than, say, displaying religious icons on courtroom walls or grounds, which is a clear endorsement of religion by the government. \n\n Did you not understand me? It's fine if religion is part of one's motivation. It just can't be the primary or only motivation. If the only motivation behind a law is religious, than that's a no-no, because then you are codifying that religion as law, and you can't have much more of an endorsement than that. Do you see now?\n \n \n\n The 18th amendment was religion-motivated, but it didn't get rescinded for THAT reason. It got rescinded because it didn't work practically. (and because FDR wanted to see the returns on the economy for his New Deal)\n\n The point is that the 18th amendment wasn't based solely on religion. While some people had religion among their motivations, you could also point to the effects of alchoholism as a reasonable motivation for outlawing booze.", 
   {}, 
   215114, 
   null, 
   1149272160.0
  ], 
  [
   215117, 
   null, 
   "BobNelson2", 
   "So the argument that this is a breach of separation of church and state is pretty weak, IMO.\n\n \n Oh, oh, and don't forget to include the proposed Federal Kosher Amendment's text, which just coincidentally matches the Levitical proscriptions, in your argument that things like the FMA have nothing to do with separation of church and state.", 
   {}, 
   215110, 
   null, 
   1149274020.0
  ], 
  [
   215129, 
   null, 
   "jyoshu", 
   "Did you not understand me? It's fine if religion is part of one's motivation. It just can't be the primary or only motivation. If the only motivation behind a law is religious, than that's a no-no, because then you are codifying that religion as law, and you can't have much more of an endorsement than that. Do you see now?\n\n \n I understand exactly what you are saying, but regardless, it's too big a gray area; there's no 'motivation-police' to go and read people's minds and find out what their motivation is behind what they vote for. Maybe religion is behind it, maybe not. Maybe it's just the 'ick' factor. Now, if you want to change your statement to say that amendments primarily pushed by religious organizations are a breach of CAS, then you at least have a much more provable and qualifiable point. But when you're dealing in the realm of motivation, that's too gray an area to change due process.\n \n \nThe point is that the 18th amendment wasn't based solely on religion. While some people had religion among their motivations, you could also point to the effects of alchoholism as a reasonable motivation for outlawing booze.\n\n \n Historically, religion WAS the primary motivation in the sense that religious groups were the main force behind it. Just like the FMA.\n \n \nOh, oh, and don't forget to include the proposed Federal Kosher Amendment's text, which just coincidentally matches the Levitical proscriptions, in your argument that things like the FMA have nothing to do with separation of church and state.\n\n \n I have NO idea what you're talking about. If there's an amendment out there that says says people have to be kosher, then that's imposing religion itself on people, not changing the definition of marriage, or the definition of 'kosher.' I'd be against such an amendment too.", 
   {}, 
   215116, 
   null, 
   1149278640.0
  ], 
  [
   215134, 
   null, 
   "Kronus", 
   "I understand exactly what you are saying, \n\n No, you clearly don't. Please read below.\n \n \n\n but regardless, it's too big a gray area; there's no 'motivation-police' to go and read people's minds and find out what their motivation is behind what they vote for. Maybe religion is behind it, maybe not. Maybe it's just the 'ick' factor. Now, if you want to change your statement to say that amendments primarily pushed by religious organizations are a breach of CAS, then you at least have a much more provable and qualifiable point. But when you're dealing in the realm of motivation, that's too gray an area to change due process.\n\n We are not talking about voting. We don't care about voting. We're talking about the writing of a law. What is the motivation behind the writing of a law, act, amendment, etc? The purpose behind a law cannot be religious. It's purpose cannot be to establish a religious point of view. It's simply not allowed. This isn't that grey an area. It's pretty easy, especially in this case, to see that there is no reason that isn't religious behind the proposed amendment. One cannot provide a rational for this amendment which does not ultimately rely on the Bible.\n \n \n\n I have NO idea what you're talking about. If there's an amendment out there that says says people have to be kosher, then that's imposing religion itself on people, not changing the definition of marriage, or the definition of 'kosher.' I'd be against such an amendment too.\n\n He was trying to make you understand by proposing an extreme case. It clearly didn't work.", 
   {}, 
   215129, 
   null, 
   1149280980.0
  ], 
  [
   215136, 
   null, 
   "jyoshu", 
   "We are not talking about voting. We don't care about voting. We're talking about the writing of a law. What is the motivation behind the writing of a law, act, amendment, etc? The purpose behind a law cannot be religious. It's purpose cannot be to establish a religious point of view. It's simply not allowed. This isn't that grey an area. It's pretty easy, especially in this case, to see that there is no reason that isn't religious behind the proposed amendment. One cannot provide a rational for this amendment which does not ultimately rely on the Bible.\n\n \n No one HAS to provide any rationale other than trying to convince people to VOTE to let it proceed! Sorry, but voting is exactly how amendments are done. You can't have a discussion of the amendment process without talking about voting. ANY legislator can write an amendment however he/she wants and bring it forward--the way the amendment is determined good or bad (or a breach of CAS) is by the voting process. That's WHY it has to pass the House, the Senate, and state legislatures, ALL through a process of voting. So there is no law that says any given amendment can't be \"written\" any certain way initially. The process of voting weeds out the bad ones and prevents them from being enacted; at least that's what's supposed to happen. \n \n You can't discuss amendments without the issue of people voting their conscience or for their constituents; it's part of it. Religion may or may not be an issue. \n \n \nHe was trying to make you understand by proposing an extreme case. It clearly didn't work.\n\n \n It clearly wasn't necessary. I understand his and your position just fine--it's just that you all aren't taking into consideration that this is a lot more complicated than that.", 
   {}, 
   215134, 
   null, 
   1149281940.0
  ], 
  [
   215140, 
   null, 
   "BobNelson2", 
   "\n It clearly wasn't necessary. I understand his and your position just fine--it's just that you all aren't taking into consideration that this is a lot more complicated than that.\n\n \n We know how \"complicated\" it is. It's so \"complicated\" that it requires Americans to put aside cherished beliefs about freedom and equality and individual rights to enshrine ONE hypocritical \"belief\" of ONE particular brand of Christianity in a Constitution that supposedly belongs to everyone.", 
   {}, 
   215136, 
   null, 
   1149285180.0
  ], 
  [
   215141, 
   null, 
   "Kronus", 
   "\n You can't discuss amendments without the issue of people voting their conscience or for their constituents; it's part of it. Religion may or may not be an issue. \n \n\n \n Whatever. You didn't understand how religious freedom played into this. I've explained as best I can.", 
   {}, 
   215136, 
   null, 
   1149285960.0
  ], 
  [
   215143, 
   null, 
   "BobNelson2", 
   "Here's an example for jyoshu:\n \n http://www.civilrights.org/issues/glbt/details.cfm?id=43886\n WASHINGTON, June 1 -- On Tuesday, during his daily radio show, Family News in Focus, Focus on the Family Chairman James Dobson said: \"...as you all very well know, marriage is under vicious attack now, I think from the forces of hell itself. And it's either going to continue to decline, and as I told you in my office a few minutes ago, I believe with that destruction of marriage will come the decline of Western civilization itself....We're really in a crisis point, right now, right now...where the family is either going to survive or it's going to fall apart and it will happen in the next few years....\" In the past, Dobson has said same-sex marriage will destroy the U.S., destroy the earth, and is more important than the war on terror. He also has compared marriage equality advocates to Hitler and the attack on Pearl Harbor. \n Now, to be fair, Mr. Dobson isn't a supporter of the FMA. He's one of its architects, so it's not surprising that his position is more uh... uhm... \"moral\".", 
   {}, 
   215141, 
   null, 
   1149286500.0
  ], 
  [
   215144, 
   null, 
   "jyoshu", 
   "We know how \"complicated\" it is. It's so \"complicated\" that it requires Americans to put aside cherished beliefs about freedom and equality and individual rights to enshrine ONE hypocritical \"belief\" of ONE particular brand of Christianity in a Constitution that supposedly belongs to everyone.\n\n \n Good luck getting Americans to not want their ideologies to influence their political thinking. \n \n Regardless of all that, we agree the amendment is ill-conceived.", 
   {}, 
   215140, 
   null, 
   1149288960.0
  ], 
  [
   215151, 
   null, 
   "BobNelson2", 
   "Good luck getting Americans to not want their ideologies to influence their political thinking. \n \n Regardless of all that, we agree the amendment is ill-conceived.\n\n \n The primary ideology of any American is supposed to be support for freedom and democracy, even the freedom of those with whom one disagrees. It is only recently that some people's sectarian views have outstripped their committment to what America stands for.", 
   {}, 
   215144, 
   null, 
   1149293280.0
  ], 
  [
   215157, 
   null, 
   "robbie0517", 
   "If a law or admendment is entireley based in religion. How would such a law or admendment get changed? Isn't it all up to the people voting? I'm asking because I don't know, I'm hoping there is a safeguard in this country to either prevent such things or overturn. \n I watched the 2 hr 20 minute webcast of the gay marriage hearing in NY. It was funny to watch the attorneys for the state try to give a reason why gays shouldn't get married. There was NO rational reason they could come up with. At one point, one of the judges even looked at the attorney, while he was trying to think of something, and said something like \"you can't give a good reason, can you?\".. so interesting. \n Is the safeguard the courts?? When they do \"right\" \"wrongs\" , they are called \"activist\" judges. Seems some only like the system when It works in their favor.", 
   {}, 
   215151, 
   null, 
   1149301260.0
  ], 
  [
   215163, 
   null, 
   "Kronus", 
   "If a law or admendment is entireley based in religion. How would such a law or admendment get changed? Isn't it all up to the people voting? I'm asking because I don't know, I'm hoping there is a safeguard in this country to either prevent such things or overturn. \n\n \n If a law is based on religion, making it unconstitutional, than someone would have to sue to get it overturned. It would go to the courts, and a judge would overturn the law. Depending on how much supporters of the law fought, it could end up in the Supreme Court.\n \n Amendmants are trickier. If you're talking state amendments than the procedure would vary from state to state. If you're talking about the US constitution, than the main protection is that it's so hard to get an amendment through. If somehow an amendment got throught that violated some other part of the constitution I'm not sure what would happen, I don't believe that's ever happened before. However, a popular vote would not be the way it would be overturned. Passing an amendment to the US constitution, or revoking one, is entirely up to congress and the state legislatures. I suppose some state legislatures might base their decision on a popular vote; again, that would vary from state to state.", 
   {}, 
   215157, 
   null, 
   1149307080.0
  ], 
  [
   215197, 
   null, 
   "jyoshu", 
   "If a law or admendment is entireley based in religion. How would such a law or admendment get changed? Isn't it all up to the people voting? I'm asking because I don't know, I'm hoping there is a safeguard in this country to either prevent such things or overturn. \n\n \n For amendments (which is what this thread is about), the safeguard IS the voting by the the house, senate, and state legislatures.\n \n And once an amendment is put in place, only another amendment can overturn it.", 
   {}, 
   215157, 
   null, 
   1149354120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush to Back Gay Marriage Ban Amendment", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8221-bush-back-gay-marriage-ban-amendment.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8221, 
  "discussion_files": [
   [
    "1338.html", 
    "http://www.4forums.com/political/gay-rights-debates/8221-bush-back-gay-marriage-ban-amendment-print.html"
   ], 
   [
    "1339.html", 
    "http://www.4forums.com/political/gay-rights-debates/8221-bush-back-gay-marriage-ban-amendment-2-print.html"
   ]
  ], 
  "identifier": 8221
 }
]