[
 [
  [
   215200, 
   null, 
   "foundit66", 
   "WASHINGTON (AFP) - A small American town is facing accusations of seeking to drive unmarried couples with children out of town on grounds they do not fit the local definition of a family. \n \n The brewing controversy in Black Jack, a town of 6,800 in the central state of Missouri, began unfolding earlier this year when Olivia Shelltrack and Fondray Loving were denied an occupancy permit after moving into a four-bedroom house they had purchased.\n \n Local officials told the couple that the fact they were not married and had three children, one from Shelltrack's previous relationship, did not fit the town's definition of \"family\".\n \n A Black Jack ordinance prohibits more than three people from living together in a single family home unless they are related by \"blood, marriage or adoption\".\n \n The couple were then left with the option of getting married, packing their bags and leaving town, or putting up a fight, which is what they decided to do.\n \n \"I think the city wants to send a clear message that they don't want children born out of wedlock,\" Shelltrack told AFP in a phone interview. \"It has become a moral issue for them.\n \n \"They see family in a certain way and that's the only acceptable way.\"\n \n Shelltrack, 31, said she and Loving, her partner of 13 years, never imagined when they moved to Black Jack from Minnesota in January that a legal nightmare awaited them.\n \n \"We though the occupancy permit was a housing code issue, that an inspector would come by and check the house,\" Shelltrack said. \"But we figured something was wrong when they asked for the children's birth certificates and a marriage certificate.\"\n \n She said the family has received a lot of support from neighbors and local residents, many of whom are baffled by what they consider an archaic law.\n \n Sheldon Stock, the town's attorney, told AFP there were no plans to evict the couple after the City Council earlier this month rejected a measure that would have changed the definition of a family to include unmarried couples with two or more children.\n \n Nonetheless, he said, Shelltrack and Loving would have to abide by the law or face fines and a court battle.\n \n \"The city intends to enforce its ordinances and we think under the current state of the law that we have every right to do so,\" he said.\n \n Stock noted that numerous other cities in Missouri have similar occupancy codes, but he acknowledged that the majority don't enforce them.\n \n \"Everybody in their occupancy codes has a definition of family,\" he said. \"Somewhere you draw a line and unfortunately in this case they (Shelltrack and Loving) don't fall on the right side of the line.\"\n \n The couple have taken their case to the American Civil Liberties Union (ACLU), which is considering filing a lawsuit against the city on their behalf.\n \n The US Department of Housing and Urban Development is also conducting an investigation.\n \n Anthony Rothert, the legal director for the ACLU in eastern Missouri, told AFP that some 10 unmarried couples with children had been denied occupancy permits in recent years in Black Jack and were essentially driven out of town. \n \n One unmarried couple that owns a house in the mainly Catholic town and that recently had a second child is facing the same fate, Rothert said. \n \n \"I find this ordinance very bizarre,\" he said, adding that the city's argument that the law, adopted in 1985, was aimed at preventing overcrowding did not hold up. \n \n \"If Olivia and Fondray were married and had 20 kids they could live in the house,\" he said. \"I think this is all about the city trying to impose its moral values on its citizens.\"\n \n http://news.yahoo.com/news?tmpl=story&u=/afp/20060524/ts_alt_afp/afplifestyleustown_060524012000", 
   {
    "post_info": {
     "post_title": "Marry or get out, US town tells unwed parents"
    }
   }, 
   null, 
   null, 
   1149358560.0
  ], 
  [
   215201, 
   null, 
   "foundit66", 
   "I realize this isn't strictly a \"gay\" issue, but I post it here because I see it as definitely a related issue. It's got a definite impact on any gay family that might want to live there, effectively precluding them.\n \n And in addition, it's type of \"thinking\" comes from the same place where people have their set of morality standards, and then they seek to enforce those standards on others and make others conform to their standards.", 
   {}, 
   215200, 
   null, 
   1149358740.0
  ], 
  [
   215207, 
   null, 
   "Ooaman", 
   "I would say \"Screw Black Jack, Missouri!\"\n \n Why do people have to be \"legal\" to be a family? I guess some people and places are just against good family values.", 
   {}, 
   215201, 
   null, 
   1149363060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Marry or get out, US town tells unwed parents", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8223-marry-get-out-us-town-tells-unwed-parents.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8223, 
  "discussion_files": [
   [
    "3395.html", 
    "http://www.4forums.com/political/gay-rights-debates/8223-marry-get-out-us-town-tells-unwed-parents-print.html"
   ]
  ], 
  "identifier": 8223
 }
]