[
 [
  [
   215477, 
   null, 
   "Docc", 
   "As economist-general I should note with distaste that staff of EU High Commissioner for Foreign Policy and Security has proposed to concentrate EU efforts in the sphere of energy security at searching for other EU energy suppliers instead of further developing cooperation with Russia. I agree that in any moment Europe should be ready to take all necessary emergency measures in default of transit countries, when it leads to failed access of oil or gas in European system. But why we should change our old and time-tested Russian partner to such problem countries as Algeria, Azerbaijan, Turkmenistan or others. It is clear as day that construction of new pipelines or rehabilitation of existing ones will lead to heavy spending for European countries. It is ruinous expenditures for old Europe. And it can be profitable politically only for USA.\n I'm not speaking about internal difficulties of our future partners (who are planned to take place of Russia). Take, for instance, such perspective (at first sight) oil supplier as Algeria. EU leadership should realize that its internal conflicts (struggle against Islamists) give no way for Algerian authorities to develop oil and gas recovery, directed to EU scale. Needless to say about EU high level of oil and gas imposts totaled up to 80 % from oil or gas basic cost. Certainly it is prohibitive expenses for backward economies of named countries of Central Asia and Africa.\n Thus, it is better for EU authorities to remember such proverb - better an egg today than a hen tomorrow!", 
   {
    "post_info": {
     "post_title": "As economist-general I should note with distaste"
    }
   }, 
   null, 
   null, 
   1149607800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  As economist-general I should note with distaste", 
  "url": "http://www.4forums.com/political/european-politics-economics/8234-economist-general-i-should-note-distaste.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 8234, 
  "discussion_files": [
   [
    "24701.html", 
    "http://www.4forums.com/political/european-politics-economics/8234-economist-general-i-should-note-distaste-print.html"
   ]
  ], 
  "identifier": 8234
 }
]