[
 [
  [
   215478, 
   null, 
   "simone", 
   "Well, here's a pickle, plucked fresh from the Wall Street Journal. I'm not making any judgments, but what would you do in this situation?\n \n In Echo of a Murder, Two $1 Million Gifts Stir School Protests\n Louis Capano Jr., Implicated In a Notorious Crime, Turns to Philanthropy\n By PAUL DAVIES\n June 6, 2006; Page A1\n The headmaster of Archmere Academy in Wilmington, Del., called his teachers together last year for a surprise champagne reception.\n \n A former student had pledged $1 million for a new student center at the Roman Catholic high school. But not everybody shared The Rev. John Zagarella's enthusiasm. Some looked stunned, two people who were there say. Two people walked out after learning the identity of the donor: a wealthy property developer who played a pivotal role in one of the state's most infamous murder trials.\n \n Almost exactly a decade ago, Louis Capano Jr. helped his older brother cover up a murder -- a case that riveted Delaware for years. Now his philanthropy -- two $1 million donations to put his family's name on buildings at elite Catholic schools he attended -- is triggering a debate over whether charity can help earn forgiveness.\n \n The murder generated two books and a television movie. Thomas Capano, a Wilmington attorney who had been a state prosecutor and a governor's counsel, had an extramarital affair with Anne Marie Fahey, scheduling secretary for then-Gov. Tom Carper. After she tried to end it, Thomas Capano shot and killed her in his home on June 27, 1996.\n \n A state-court jury convicted him three years later, after authorities unraveled a coverup engineered with two brothers. Gerard Capano helped Thomas Capano dump the body in the ocean. Louis Capano disposed of a bloody sofa, tampered with a witness and lied to a grand jury. Threatened with prison, both pleaded guilty to crimes, testified against their brother and were put on probation. Thomas Capano initially was sentenced to death but appealed and got life in prison without parole.\n \n The family has had its share of brushes with the law. Louis Capano Jr., head of a property-development company founded by his father, also named Louis, bribed a county councilman in 1989 to get a favorable rezoning ruling. He escaped prosecution by cooperating in a federal sting to catch the official.\n \n Another brother, Joseph, was charged with rape in 1991 and pleaded guilty to charges of misdemeanor assault, unlawful sexual contact and criminal mischief.\n \n A fund-raiser at Archmere says Louis Capano, 54 years old, said he wanted to make amends for his family's past. The donation was to be in the name of his parents: Louis Capano Sr., who died in 1980, and 82-year-old Marguerite Capano.\n \n \"I have got to make an attempt to show the younger kids there's a better way to go,\" Mr. Capano said, according to John E. Healy III, a construction-company chief who is helping spearhead Archmere's fund-raising campaign. \"He's making an effort to walk to the light,\" Mr. Healy says.\n \n Mr. Capano didn't respond to interview requests. In a statement issued through his attorney, Mr. Capano says the schools approached him as part of a fund-raising campaign, and that he appreciated the education he received and wanted to honor his parents. He says he is sorry for the suffering his brother Thomas caused, and that his donation is an attempt \"to do something positive for the community.\"\n \n (More)", 
   {
    "post_info": {
     "post_title": "Catholic Mores and Money"
    }
   }, 
   null, 
   null, 
   1149607980.0
  ], 
  [
   215479, 
   null, 
   "simone", 
   "When the fund-raising committee at Mr. Capano's old elementary school, St. Edmond's Academy, informed its board of directors of his $1 million donation for a new gymnasium in March 2005, several members expressed dismay.\n \n One of St. Edmond's directors was Louis Freeh, who headed the Federal Bureau of Investigation during the Clinton administration and assigned agents to investigate the Fahey murder.\n \n \"This is a school for boys, and what message do we send to them when we take $1 million and put his name on the building?\" Mr. Freeh asked at a board meeting last spring, according to someone who attended the meeting.\n \n St. Edmond's headmaster Michael Marinelli responded that the building would bear the parents' name, not Mr. Capano's. Another member argued that good Catholics believe in forgiveness.\n \n \"I am a good Catholic, but there is a difference between forgiveness and honoring someone,\" Mr. Freeh shot back, according to a person who attended the meeting.\n \n Mr. Marinelli says he doesn't recall the specifics of the conversation.\n \n Delaware U.S. Attorney Colm F. Connolly also urged representatives of the schools not to name buildings for the Capanos. Mr. Connolly led the prosecution of Thomas Capano and became a close Fahey family friend. He is also an Archmere alumnus, and briefed St. Edmond's board of directors on the Capano brothers' legal troubles.\n \n \"The schools are naming the buildings after a family that has not one, not two, not even three, but four criminals,\" says Mr. Connolly.\n \n St. Edmond's approached Mr. Capano to see if he would consider naming the building after a religious figure, people familiar with the matter say. Mr. Capano rejected the idea, and suggested doubling Archmere's donation instead, Archmere's Mr. Healy recalls.\n \n After learning that Archmere might get all the money, St. Edmond's board reversed course. The majority of its 18 directors felt the decision followed the Church's teaching of \"fairness and forgiveness,\" says Mr. Marinelli, St. Edmond's headmaster. \"At what point do you continue to punish and at what point do you begin to heal?\" he asks.\n \n St. Edmond's board member Brian Gimlett, head of the U.S. Secret Service's New York office before moving to Delaware, quit in protest. \"My action speaks for itself,\" he says.\n \n Mr. Freeh, his board term at St. Edmond's expiring, declined another term. \"I love the schools; they just got this one wrong,\" says Mr. Freeh, who has children at both schools.\n \n Archmere's board also voted to accept Mr. Capano's donation. Construction begins this month. \"We're a family here,\" says Thomas Mallon, Archmere's public-relations director. \"We embrace everyone. Not everyone is perfect. We accepted this as a heartfelt gift.\"\n \n The school had originally planned to name the building for another well-known alumnus, Democratic Senator Joseph Biden, who co-chairs the school's fund-raising committee. Bishop Michael Saltarelli of Wilmington, however, invoked a Church directive that opposes honoring politicians who support abortion rights.\n \n A Biden spokeswoman says the episode \"hasn't diminished his affection for the school,\" and that \"he continues to work on the capital campaign knowing that the building will be named after the Capano family.\"\n \n (More)", 
   {}, 
   215478, 
   null, 
   1149608100.0
  ], 
  [
   215480, 
   null, 
   "simone", 
   "As word of Mr. Capano's donations spread, some parents spoke up, including Marybeth Phillips, who has one son who graduated from Archmere and another going into his senior year there.\n \n \"This is immoral and dead wrong,\" Ms. Phillips recalls telling Father Zagarella, the Archmere headmaster, last year as she waited at an airport for one of her sons to fly to Rome for a school trip. \"You're selling out Christ for a lousy million bucks.\"\n \n \"That's a lot of money -- I wish parents like you would give me $1 million,\" the headmaster replied before walking off, according to Ms. Phillips. She says he apologized minutes later. Mr. Mallon says Father Zagarella recalls the conversation but not his exact words. Father Zagarella declined to comment.\n \n The late Ms. Fahey's family also is upset. \"We have to live with the hurt every day,\" says Debbie Gioffre, mother of Ms. Fahey's nephew Brian, 14, a St. Edmond's eighth grader who plans to attend Archmere next year. \"It's not fair to have to live with other reminders.\"\n \n Ms. Fahey's sister, Kathleen Fahey-Hosey, says \"it was like a kick in the stomach\" when she heard about Mr. Capano's donation. Her children are on another school's basketball team that competes against St. Edmond's.\n \n \"My kids play basketball there, and if they are going to put that name on the gym, I don't want to go in there,\" she says.", 
   {}, 
   215479, 
   null, 
   1149608160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Catholic Mores and Money", 
  "url": "http://www.4forums.com/political/religion-debates/8235-catholic-mores-money.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8235, 
  "discussion_files": [
   [
    "8551.html", 
    "http://www.4forums.com/political/religion-debates/8235-catholic-mores-money-print.html"
   ]
  ], 
  "identifier": 8235
 }
]