[
 [
  [
   216020, 
   null, 
   "MrWriteLA", 
   "WHITE PLAINS (AP) - County Executive Andrew Spano has issued an executive order that makes Westchester the first county in the state to recognize gay marriages. \n Spano read the order Wednesday night at a meeting of gay groups and received a standing ovation. The effect of the order is to give married gay couples the same county privileges as heterosexual couples, such as the right to buy family passes to county parks and the right to seek emergency housing as a family. \n \n \"I don't see why people, just because they're the same sex, shouldn't have the same benefits,\" Spano said Thursday. \n \n The order does not require towns and villages within the county to recognize the marriages, and it does not help same-sex couples get state or federal privileges. \n \n It applies only to couples who were married in a state or country where gay marriages are legally performed. Massachusetts is the only such state; Canada, Belgium, Spain and the Netherlands have legalized same-sex marriages. \n http://www.buffalonews.com/editorial/20060609/3033484.asp", 
   {
    "post_info": {
     "post_title": "New York county accepts same-sex marriages"
    }
   }, 
   null, 
   null, 
   1149884100.0
  ], 
  [
   216023, 
   null, 
   "Kronus", 
   "\"County benefits\"?\n \n So pretty much just a symbolic victory. Still, it's progress.", 
   {}, 
   216020, 
   null, 
   1149884640.0
  ], 
  [
   216031, 
   null, 
   "BobNelson2", 
   "\"County benefits\"?\n \n So pretty much just a symbolic victory. Still, it's progress.\n\n \n It's not a big deal, but it is significant. Most city and country accommodations for gay people have required the couple to register yet again (more of that paperwork that some people say will solve all of our legal problems). That the county will recognize out-of-state legal status is important. It's also significant in that it reflects the majority position in New York State which favors same-sex marriage.", 
   {}, 
   216023, 
   null, 
   1149888540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New York county accepts same-sex marriages", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8257-new-york-county-accepts-same-sex-marriages.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8257, 
  "discussion_files": [
   [
    "4170.html", 
    "http://www.4forums.com/political/gay-rights-debates/8257-new-york-county-accepts-same-sex-marriages-print.html"
   ]
  ], 
  "identifier": 8257
 }
]