[
 [
  [
   216278, 
   null, 
   "David2004", 
   "Soon after Mr. Mahmoud Abbas took office as the President of the Palestinian Authority. Hamas agreed to a cease in suicide bombings. Meanwhile the Israeli government continues their military campaign against the Palestinian society. Last year Hamas won control of the Palestinian Authority to the dismay of the United States and Israel. It was an open and fair election according to international election observers including the former President Jimmy Carter. \n \n Today the Palestinian people are living in conditions that are continuing to get worst. By the condition imposed onto them by the Israeli and United States government actions and policies. The Israeli and the United States government have labeled Hamas as a terrorist organization making Hamas an illegitimate as far as they are concerned. The majority of the Palestinian people say \"Israel is a terrorist nation\" and they have the facts and reality on the ground to prove it. The Israelis call them \"targeted assassinates\" while the people of the world call them \"acts of terror\" with the exception of the United States government and mass mainstream media. \n \n Since the 1968 Palestinian-Israel War the Israelis have had a chokehold over the Palestinian society. The Israelis control the airspace over the Palestinian people bombing them at will. The Israelis control the boarders surrounding the Palestinian people letting in or out, whoever or whatever they wish when ever they want. This is making the Palestinian people prisoner within less than 22% of their homeland. The Jewish State of Israel was imposed onto the Palestinian people by the international community of nation in 1947 in the United Nations Resolution 181 mandating that two nations created out of one land. There were terms and conditions in this mandate that were never lived up to by the Israelis that provoked the Palestinian people into fighting for their survival. \n \n The Israelis claiming to be the victims when in reality they are the real perpetrator in this life long conflict. The facts and reality on the ground are the proof. The little land that is left of the Palestinian Territory is a war torn by the Israelis. The original mandate (U.N. Resolution181) called for a 48% of the land a Jewish State and a 52% of the land a Palestinian State with the Jewish State in three unconnected sections and the Palestinian one continuous state. With the Old City of Jerusalem being an International City controlled by neither side. \n \n The real story on who is attacking who has not been heard by the American people. The majority of the free people in the world have heard the true while the American mainstream mass media have kept the American people in the dark to the true story. From the 120 Un-Recognized Palestinian Villages in what is commonly referred to as Israel proper to the daily Israeli attacks on the Palestinian society. The most recent Israel government (surgical) attacks on a Hamas leader and a Palestinian Family of seven having a picnic on the beach in Gaza was the straw that broke the camels back for Hamas. \n \n The question who is and who is not a terrorist will depend upon who you ask. The reality of facts tells you there are terrorists on both sides. Where there are people willing to kill and maim other people for their gains. The Jewish people went from controlling almost none of the land to controlling more than 100% of the Palestinian land. The human rights and dignity of the Palestinian people have been trample by the Jewish Zionists in the name of God and paid for by Americans. \n http://www.globalcrier.blogspot.com/", 
   {
    "post_info": {
     "post_title": "Hamas Calls Off the Truce with Israel"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1150050900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hamas Calls Off the Truce with Israel", 
  "url": "http://www.4forums.com/political/peace-middle-east/8266-hamas-calls-off-truce-israel.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 8266, 
  "discussion_files": [
   [
    "8618.html", 
    "http://www.4forums.com/political/peace-middle-east/8266-hamas-calls-off-truce-israel-print.html"
   ]
  ], 
  "identifier": 8266
 }
]