[
 [
  [
   12260, 
   null, 
   "ApathySam", 
   "I don't know how much national coverage this has gotten, but the Texas House is currently in a special session (which will end Tuesday) to try to redraw the districts for the Texas delegation in Washington.\n \n This has become a hugely partisan deal. Despite a clear Republican trend in Texas, Texas Democrats hold a 17-15 majority in the US House. So the Republicans in the Texas House decided to redraw the map to give Republicans an edge -- they want to split up Democratic districts or shift them over so the incumbents would no longer be residents of their own districts. Their reasoning is that the map we have now was heavily gerrymandered by Democrats in 1991, and since a) every statewide office is held by a Republican, b) Republicans hold a 97-53 (or thereabouts) majority in the Texas House, c) a vast majority voted for Bush and d) we have a Republican governor, then Texans must have meant to vote for Republicans in the US House elections.\n \n Republicans tried to redraw the map in the normal session, but 51 (out of 53, I think) Democrats in the Texas House got fed up and evacuated to Oklahoma for a few days. Since the House needs two-thirds present to debate a bill, and there are 150 Representatives, the redistricting bill died before the Democrats came back. So Gov. Perry called a special session. Now the session's almost up, with no decision on the map, so he's said he'll probably call another one.\n \n Each special session costs $1.7 million.\n \n Anyone been following this? What do you think?", 
   {
    "post_info": {
     "post_title": "Gerrymandering"
    }
   }, 
   null, 
   null, 
   1059254640.0
  ], 
  [
   12291, 
   null, 
   "wjim1269", 
   "I heard about the democrats leaving in Texas, but I haven't been following the situation recently. However, the state of Illinois went through a similar situation (I think within the past year). Since I lived there, I followed that.\n \n The Illinois system had a panel of eight people (4 republicans, 4 democrats) who were supposed to determine the new system. If they couldn't submit an approved plan, then the leading member of each party submitted another name for the panel. One of those people were selected at random.\n \n That system wound up very much like the Texas situation. As you could probably guess, the eight person panel split and a ninth name had to be drawn out. However, the system wound up in court to determine its \"constitutionality\" (I can only imagine how much it cost for the state supreme court to read the state constitution and say, \"Yep, they followed the rules.\") The case got turned down by the federal supreme court, and that was the end of the debate.\n \n I agree that these types of situations result in a waste of money, but yet, I can't think of any better way to do it.", 
   {}, 
   12260, 
   null, 
   1059370440.0
  ], 
  [
   12397, 
   null, 
   "ApathySam", 
   "Update:\n \n Our Lt. Governor ended the special session a day early, and Gov. Perry called a second special session immediately.\n \n Then 11 Democratic Senators fled the state for Albuquerque, for the same reason that the 52 House members did in May. There are 32 Texas Senators, and they also need two thirds to debate anything, so their intention was to break the quorum. Which they did. The only thing is that while the House only had to stay out of the state for a few days, these Senators have to (and are prepared to) stay out for a month. \n \n One more thing.. Republicans have been arguing that redistricting is necessary because although they generally have about two-thirds control everywhere else, Democrats outnumber them 17-15 in the US House. So theoretically, there should be an 21-11 lead for Republicans (although they're pushing for 22-10).\n \n But it turns out in FIVE districts, while the voters had Republican majorities and voted for Bush, they voted for the incumbent Democrat House members. They just split their vote for two parties. That means that Republicans DO have majorities in 20 out of 32 districts (pretty close to 2/3), but the Republican voters CHOSE Democrats anyway.\n \n Maybe Republicans should just put up better candidates. Good Lord, this is ridiculous.", 
   {}, 
   12260, 
   null, 
   1059629340.0
  ], 
  [
   12398, 
   null, 
   "ApathySam", 
   "\n I agree that these types of situations result in a waste of money, but yet, I can't think of any better way to do it.\n\n \n \n Hey wjim,\n \n I think the last redistricting case in Texas was drawn by the courts. At that point, we had a Democratic majority in our House, and the Republicans didn't like the way the Democrats had carved it up (rightly so, from what I hear). So they tried to have the courts, supposedly party-neutral, draw up the lines.\n \n Apparently it still favored Democrats, so the Republicans decried it as political, blah blah blah. But not everyone will be happy every time. I do think there's a better chance to get a fair map with the courts than with the Legislature, since even a small panel has a vested interest in which of their colleagues they can oust.", 
   {}, 
   12291, 
   null, 
   1059629520.0
  ], 
  [
   12399, 
   null, 
   "wjim1269", 
   "Yet, at least in Illinois, leaving it up to the courts could still result in partisan politics. In Illinois, the judges are elected, and the districting is very unproportional (Chicago (very democratic) gets 3 and the suburbs (generally democratic) get 1, the rest of the state (generally republican) gets 3). Even though Republicans had the majority in the legislature and most of the statewide offices (they don't anymore, but the reason why is a different debate), the breakdown of the judges was 4-3 for the democrats. So then you would have republicans crying out that it's unfair that despite their hold on a majority of everything except the state courts, they still lose out in the elections.", 
   {
    "unicode_changes_made": true
   }, 
   12398, 
   null, 
   1059630780.0
  ], 
  [
   12430, 
   null, 
   "ApathySam", 
   "I wonder if it would be a better idea to leave it to a federal circuit. I don't know much about the hierarchy of the judicial branch, but I do think it would be better to leave it to courts composed of appointed judges rather than elected Justices of the Peace, or what have you. Maybe even each state's Supreme Court, since they're presumably chosen by a variety of past and present governors?\n \n I'd agree that elected judges are almost if not just as partisan as elected officials. But appointed judges certainly get less of a spotlight than either of the other groups, and would have a better chance of making bipartisan decisions.", 
   {}, 
   12399, 
   null, 
   1059682980.0
  ], 
  [
   12477, 
   null, 
   "wjim1269", 
   "I wonder if it would be a better idea to leave it to a federal circuit. I don't know much about the hierarchy of the judicial branch, but I do think it would be better to leave it to courts composed of appointed judges rather than elected Justices of the Peace, or what have you.\n\n \n I don't know if I would send it to the federal courts immediately, but I agree that would be better, especially in the Texas case. Maybe set a deadline and if it's not met, then send it to the federal courts to determine. This would have the advantage of satisfying both the majority and minority powers because the people determining the issue would be appointed by a non-state figure and could have been appointed prior to the current administration by a member of a different party.\n \n \nMaybe even each state's Supreme Court, since they're presumably chosen by a variety of past and present governors?\n\n \n In Illinois, the Supreme Court justices are elected. (I presume it's different in Texas.)", 
   {}, 
   12430, 
   null, 
   1059718980.0
  ], 
  [
   12479, 
   null, 
   "ApathySam", 
   "\n In Illinois, the Supreme Court justices are elected. (I presume it's different in Texas.)\n\n \n That's weird. I just assumed everyone was like Texas. Heh.", 
   {}, 
   12477, 
   null, 
   1059724080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gerrymandering", 
  "url": "http://www.4forums.com/political/politics-debates/827-gerrymandering.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 827, 
  "discussion_files": [
   [
    "11201.html", 
    "http://www.4forums.com/political/politics-debates/827-gerrymandering-print.html"
   ]
  ], 
  "identifier": 827
 }
]