[
 [
  [
   216344, 
   null, 
   "Monster", 
   "Was Jesus a martyr?", 
   {
    "post_info": {
     "post_title": "Was Jesus a martyr?"
    }
   }, 
   null, 
   null, 
   1150086240.0
  ], 
  [
   216437, 
   null, 
   "simone", 
   "How do you define \"martyr\"?\n \n How does the scholarly Maximus define \"martyr\"?\n \n How does the opiniated EZ define \"martyr\"?", 
   {}, 
   216344, 
   null, 
   1150131840.0
  ], 
  [
   216460, 
   null, 
   "Monster", 
   "Come on baby, you know I don't know what I am talking about.\n \n Teach me.", 
   {
    "post_info": {
     "post_title": "your so sexy"
    }, 
    "unicode_changes_made": true
   }, 
   216437, 
   null, 
   1150136520.0
  ], 
  [
   220096, 
   null, 
   "Animguy", 
   "Technically, I would say no, Jesus was not a martyr.\n \n From dictionary.com, one of the definitions of martyr is:\n one who voluntarily suffers death as the penalty for refusing to renounce their religion \n \n If you believe that Jesus was the Son of God, then he was not a martyr in that he voluntarily suffered death in order to save people's souls rather than refusing to renounce his religion.\n \n However, his death did have a similar effect to many martyr's deaths in that it helped cause the spread of his teachings. It should be noted that this may not have happened if he had not appeared to his disciples after his resurection. When Jesus was crucified, instead of reinforcing their beliefs and encouragig them to stand up for what Jesus taught the disciples went into hiding. It was not until three days later when he appeared before them that they were able to overcome their fears and go out into the world again.\n \n \n Another definition found on dictionary.com is one who bears witness of the truth, and suffers death in the cause of Christ\n \n In which case, Jesus is most definately not a martyr since he was not dying for himself.", 
   {}, 
   216460, 
   null, 
   1151691900.0
  ], 
  [
   220103, 
   null, 
   "thelmoose", 
   "Assuming you believe the God stuff, (which I do not) Jesus was still no martyr. If someone gives up his life for a cause, that is a real sacrifice. Jesus, a.k.a. God, knew he couldn't die, so it was really no biggy. So he suffered a bit, he knew things would be all hunky-dory in the end. I really don't see what all the fuss was about the big ol' sacrifice that Jesus died to save humankind. It was more like a really good magic trick, actually.", 
   {}, 
   220096, 
   null, 
   1151695140.0
  ], 
  [
   220165, 
   null, 
   "Easyrider", 
   "Assuming you believe the God stuff, (which I do not) Jesus was still no martyr. If someone gives up his life for a cause, that is a real sacrifice. Jesus, a.k.a. God, knew he couldn't die, so it was really no biggy. \n\n \n I think according to that you can classify a great many martyrs as being \"no biggie deal\" then, since many of them were religious and knew they \"wouldn't die\" (but be resurrected in heaven or somewhere).", 
   {}, 
   220103, 
   null, 
   1151707740.0
  ], 
  [
   220182, 
   null, 
   "Ooaman", 
   "I think according to that you can classify a great many martyrs as being \"no biggie deal\" then, since many of them were religious and knew they \"wouldn't die\" (but be resurrected in heaven or somewhere).\n\n The difference is because all of those other people who died for their religious beliefs believed that they would be going on to Heaven (or some afterlife depending on what they believed.) Jesus knew that he was going to be coming back to life on Earth before going up to Heaven. The other ones don't come back to life on Earth.", 
   {}, 
   220165, 
   null, 
   1151710620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Was Jesus a martyr?", 
  "url": "http://www.4forums.com/political/religion-debates/8273-jesus-martyr.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8273, 
  "discussion_files": [
   [
    "3263.html", 
    "http://www.4forums.com/political/religion-debates/8273-jesus-martyr-print.html"
   ]
  ], 
  "identifier": 8273
 }
]