[
 [
  [
   216878, 
   null, 
   "jyoshu", 
   "\"Here is a small sample of the side of the debate we almost never hear:\n \n Appearing before the Commons Committee on Environment and Sustainable Development last year, Carleton University paleoclimatologist Professor Tim Patterson testified, \"There is no meaningful correlation between CO2 levels and Earth's temperature over this [geologic] time frame. In fact, when CO2 levels were over ten times higher than they are now, about 450 million years ago, the planet was in the depths of the absolute coldest period in the last half billion years.\" Patterson asked the committee, \"On the basis of this evidence, how could anyone still believe that the recent relatively small increase in CO2 levels would be the major cause of the past century's modest warming?\"\n \n Patterson concluded his testimony by explaining what his research and \"hundreds of other studies\" reveal: on all time scales, there is very good correlation between Earth's temperature and natural celestial phenomena such changes in the brightness of the Sun. \n \n Karlén clarifies that the 'mass balance' of Antarctica is positive - more snow is accumulating than melting off. As a result, Ball explains, there is an increase in the 'calving' of icebergs as the ice dome of Antarctica is growing and flowing to the oceans. When Greenland and Antarctica are assessed together, \"their mass balance is considered to possibly increase the sea level by 0.03 mm/year - not much of an effect,\" Karlén concludes\n \n Carter does not pull his punches about Gore's activism, \"The man is an embarrassment to US science and its many fine practitioners, a lot of whom know (but feel unable to state publicly) that his propaganda crusade is mostly based on junk science.\"\n \n http://www.canadafreepress.com/2006/harris061206.htm", 
   {
    "post_info": {
     "post_title": "Al Gore Debunked"
    }
   }, 
   null, 
   null, 
   1150304880.0
  ], 
  [
   216885, 
   null, 
   "Steeeeve", 
   "I hate to be on the global warming side (as I don't believe in global warming due to human causes) but this article might debunk these claims http://www.factcheck.org/article395.html\n \n Even so, the most you could say about global warming is that in recent years the earth has warmed slightly. The cause is not known.", 
   {}, 
   216878, 
   null, 
   1150306080.0
  ], 
  [
   216900, 
   null, 
   "Kronus", 
   "\n Even so, the most you could say about global warming is that in recent years the earth has warmed slightly. The cause is not known.\n\n \n The cause has not been conclusively proven, but the evidence points to green house gas emmisions. I am, in general, a big fan of the scientific process. Form hypothesis, test in the lab, refine theory, lather, rinse, repeat. But there's a problem with doing that here. First off, we can't run a conclusive test. The only lab big enough is the entire world. To conclusively prove or debunk global warming you need to lower or raise greenhouse gas emmisions on a global scale in a controlled manner. Kinda tough to pull off for your average scientist. The second issue is a simply cost/risk analysis. If the evidence is correct but we ignore it, then we risk dooming millions and causing a global catastophe. If the evidence is wrong but we act anyway, then we put a light strain on the economy. The science we have says we should act, and there's not a good way of getting better science at this point. Better to act and find out that we were wrong than to ignore the data we have and find out it was right.", 
   {}, 
   216885, 
   null, 
   1150309560.0
  ], 
  [
   216902, 
   null, 
   "Steeeeve", 
   "I think it would be a little more than a \"light strain\" on the economy.\n \n The biggest eniviromental thing i would like to see happen is to get rid of cars that use gas. It would be nice to one day be able to stand 10 feet from the LA skyline and actually be able to see the building in front of you. It is amazing how you can go from the mountains and see for miles and then go to D.C. and not see the Washington Monument from the lawn.\n \n The scientists that say \"it is too inconclusive\" tend to be the more credible ones for many of the reasons you state.", 
   {}, 
   216900, 
   null, 
   1150310040.0
  ], 
  [
   216911, 
   null, 
   "Kronus", 
   "I think it would be a little more than a \"light strain\" on the economy.\n\n Economics gives me a headache. I've seen reports that say trying to fight global warming would bankrupt us, and I've seen reports that say developing the new technologies and infrastructure would be an economic bonanza. I split the difference.\n \n \n\n The scientists that say \"it is too inconclusive\" tend to be the more credible ones for many of the reasons you state.\n\n The issue here is that we aren't just talking about science, we're talking about public policy. With pure science you proceed slowly, make sure you've covered everything, and don't leap to conclusions. Sometimes, with public policy, you don't have that luxury. There are times when you have to make a decision now, based on the information you have, even if it is incomplete. If global warming is fact, which seems quite possible, than the longer we wait to take action the less effective that action will be. By the time we have proof, it'll be too late.", 
   {}, 
   216902, 
   null, 
   1150312500.0
  ], 
  [
   216939, 
   null, 
   "donniedarko", 
   "How does Steve define credible?", 
   {}, 
   216911, 
   null, 
   1150321020.0
  ], 
  [
   216945, 
   null, 
   "Master_Shake", 
   "Here comes crowd that like Bush, somehow thinks \"the science isn't in.\" Statements like this just completely blow my mind and really show why the U.S. is falling behind the world in science.", 
   {
    "post_info": {
     "post_title": "Here we go again"
    }
   }, 
   216939, 
   null, 
   1150323300.0
  ], 
  [
   216956, 
   null, 
   "Waxy", 
   "Here comes crowd that like Bush, somehow thinks \"the science isn't in.\" Statements like this just completely blow my mind and really show why the U.S. is falling behind the world in science.\n\n \n Statements like this blow my mind.\n \n I have no doubt that Jyoshu's attack on global warming is equally an attack on Al Gore, but to completely ignore the content of the post, and the science behind it, boggles my mind.\n \n It's a Canadian article, done by Canadian scientists, and they're far from being alone in their viewpoint. Climate science is NOT definative, why people continue to insist that it is in the face of the evidence presented is completely beyond me. \n \n The power of the \"greens\". Anyone who's ever crossed paths with the environmental lobby will be very quick to tell you of the power they wield when in comes to propaganda and public opinion.\n \n Waxy", 
   {}, 
   216945, 
   null, 
   1150327500.0
  ], 
  [
   217658, 
   null, 
   "Diogenes99", 
   "See also Michael Crichton Is Right!. Crichton's book State Of Fear is fictional, but the discussions between the characters are heavily footnoted with references to reputable science - real science, with numbers to back it up, not the imaginative fantasy of the doomsayers.\n \n Gore has as much science on his side as the guy in a robe walking the streets with a sign that reads \"The End Is Near.\"", 
   {}, 
   216956, 
   null, 
   1150655100.0
  ], 
  [
   217905, 
   null, 
   "dugman_74", 
   "Gore will not lets science get in the way of his agenda", 
   {}, 
   216878, 
   null, 
   1150780140.0
  ], 
  [
   218061, 
   null, 
   "DrNo", 
   "Gore will not lets science get in the way of his agenda\n\n \n I agree, and I will elaborate. Al Gore ran for president as a Democratic candidate. With the lack of promising Democrats to run for president in 2008, it is not unlikely that Al Gore will make another run. I don't think the Democratic party will risk losing another election by nominating Hillary Clinton. Right now, she is just too risky. So I can't think of anybody better than Al Gore for the Democrats. So, with that in mind, what would be the best way to get America to vote for Gore in 2008? Simple. Create a Michael Moore-esque mockumentary about the horrible doom we all face because of global warming. Unfortunately, most of the general public are XXXXXX and will accept this movie at face value without actually doing any research. Once the general public is properly convinced that they face a horrible crisis and Al Gore is the hero who brought it all to light (through Hollywood, no less), they will turn to him for the solution. Naturally, he won't have a solution, but he will promise one until he gets elected. Mark my words: AL Gore will be the Democratic candidate in 2008.", 
   {}, 
   217905, 
   null, 
   1150848360.0
  ], 
  [
   218070, 
   null, 
   "Jo Bennett", 
   "That's a nice theory, apart from the obvious holes in that the vast majority of the global scientific community (particularly those competent in the area of study) agree that the earth is warming and that the evidence points to it being significantly contributed to by humans. Add to the fact the Al Gore has been on board with this issue for years, certainly since before the 2000 election.", 
   {}, 
   218061, 
   null, 
   1150849680.0
  ], 
  [
   218077, 
   null, 
   "dugman_74", 
   "That's a nice theory, apart from the obvious holes in that the vast majority of the global scientific community (particularly those competent in the area of study) agree that the earth is warming and that the evidence points to it being significantly contributed to by humans. Add to the fact the Al Gore has been on board with this issue for years, certainly since before the 2000 election.\n\n \n Dr No had a great theory and the story that started this thread explains that Gore in fact DOES NOT have the support of the scientists who are competent in that area of study. \n http://www.canadafreepress.com/2006/harris061206.htm\n No; Carter is one of hundreds of highly qualified non-governmental, non-industry, non-lobby group climate experts who contest the hypothesis that human emissions of carbon dioxide (CO2) are causing significant global climate change. \"Climate experts\" is the operative term here. Why? Because what Gore's \"majority of scientists\" think is immaterial when only a very small fraction of them actually work in the climate field. \n \n Even among that fraction, many focus their studies on the impacts of climate change; biologists, for example, who study everything from insects to polar bears to poison ivy. \"While many are highly skilled researchers, they generally do not have special knowledge about the causes of global climate change,\" explains former University of Winnipeg climatology professor Dr. Tim Ball. \"They usually can tell us only about the effects of changes in the local environment where they conduct their studies.\"", 
   {}, 
   218070, 
   null, 
   1150851240.0
  ], 
  [
   218154, 
   null, 
   "daewoo", 
   "I tend to agree with Master Shake here. There is no question that global warming is taking place, nor is there any question at all that if it continues at its current state it will have serious if not catastrophic consequences. As far as I can tell there is no serious debate on this. \n \n Where the debate lies is in how much of this climate change is human caused, if any. \n \n I do tned to disagree with Steeeve on this on in that the changes are minor. While the increase in average global temperature has not been great, that does not mean they are minor. There was not that much of a ddifference in average global temperature between now and hte last ice age. Relatively small changes in average global temperature can lead to major changes in climate models and heat distribution.", 
   {}, 
   218077, 
   null, 
   1150868820.0
  ], 
  [
   218191, 
   null, 
   "Jo Bennett", 
   "Pretty much all the claims about climate change are debunked in this article:\n http://www.newmatilda.com/home/articledetailmagazine.asp?ArticleID=1585&CategoryID=135\n The author is a sceptic, but sees the junk from the right for what it is, a smokescreen thrown up to obscure their long running campaign against science, whether it be the link between smoking and cancer, the theory of evolution, the effectiveness of contraception, the earth going round the sun (though to be fair most of them have accepted the last one now).", 
   {}, 
   218154, 
   null, 
   1150879320.0
  ], 
  [
   218194, 
   null, 
   "Ripskar", 
   "Of course the problem here is that we're up against the likes of Ann Coulter;\n \n\"The ethic of conservation is the explicit abnegation of man's dominion over the Earth. The lower species are here for our use. God said so: Go forth, be fruitful, multiply, and rape the planet - it's yours. That's our job: drilling, mining and stripping. Sweaters are the anti-Biblical view. Big gas-guzzling cars with phones and CD players and wet bars - that's the Biblical view.\"\n\n Sometimes I wonder just what depths of muppetry America's Right will sink to...", 
   {
    "unicode_changes_made": true
   }, 
   218191, 
   null, 
   1150890480.0
  ], 
  [
   218215, 
   null, 
   "Waxy", 
   "Pretty much all the claims about climate change are debunked in this article:\n http://www.newmatilda.com/home/articledetailmagazine.asp?ArticleID=1585&CategoryID=135\n The author is a sceptic, but sees the junk from the right for what it is, a smokescreen thrown up to obscure their long running campaign against science, whether it be the link between smoking and cancer, the theory of evolution, the effectiveness of contraception, the earth going round the sun (though to be fair most of them have accepted the last one now).\n\n \n Firstly, I find it interesting, and more than a little disturbing, that you're willing to simply accept as fact the points in an editorial article written by someone who is not a climate scientist.\n \n Secondly, I am always very distrubed by the fact that those who oppose, or at the very least, question, this \"catastrophic global warming\" hypothesis, are painted as quacks, religious fundamentalists, or pawns of \"big oil\", either incompetent or incapable of proper and unbiased scientific research. It's a ridiculous attempt to claim a moral and intellectual high ground in the debate, and rather assinine.\n \n Waxy", 
   {}, 
   218191, 
   null, 
   1150912260.0
  ], 
  [
   218238, 
   null, 
   "dugman_74", 
   "Firstly, I find it interesting, and more than a little disturbing, that you're willing to simply accept as fact the points in an editorial article written by someone who is not a climate scientist.\n \n Secondly, I am always very distrubed by the fact that those who oppose, or at the very least, question, this \"catastrophic global warming\" hypothesis, are painted as quacks, religious fundamentalists, or pawns of \"big oil\", either incompetent or incapable of proper and unbiased scientific research. It's a ridiculous attempt to claim a moral and intellectual high ground in the debate, and rather assinine.\n \n Waxy\n\n \n These tactics are necessary due to the fact that science is not on their side.", 
   {}, 
   218215, 
   null, 
   1150917660.0
  ], 
  [
   218251, 
   null, 
   "Jo Bennett", 
   "Firstly, I find it interesting, and more than a little disturbing, that you're willing to simply accept as fact the points in an editorial article written by someone who is not a climate scientist.\n \n Secondly, I am always very distrubed by the fact that those who oppose, or at the very least, question, this \"catastrophic global warming\" hypothesis, are painted as quacks, religious fundamentalists, or pawns of \"big oil\", either incompetent or incapable of proper and unbiased scientific research. It's a ridiculous attempt to claim a moral and intellectual high ground in the debate, and rather assinine.\n \n Waxy\n\n \n I picked out an easy to understand summary article, it covers the salient points. I can find plenty of scientists that concur with the view that global warming is both occurring and largely man made, but I don't think that it would make any difference what they said.", 
   {}, 
   218215, 
   null, 
   1150920060.0
  ], 
  [
   218301, 
   null, 
   "Waxy", 
   "I picked out an easy to understand summary article, it covers the salient points. I can find plenty of scientists that concur with the view that global warming is both occurring and largely man made, but I don't think that it would make any difference what they said.\n\n \n And vice versa apparently........\n \n Waxy", 
   {}, 
   218251, 
   null, 
   1150932780.0
  ], 
  [
   218329, 
   null, 
   "dugman_74", 
   "I picked out an easy to understand summary article, it covers the salient points. I can find plenty of scientists that concur with the view that global warming is both occurring and largely man made, but I don't think that it would make any difference what they said.\n\n \n And what about those scientists who disagree?", 
   {}, 
   218251, 
   null, 
   1150936920.0
  ], 
  [
   219536, 
   null, 
   "jyoshu", 
   "Well, to be fair, here's a very recent article citing scientists who say Gore's new film was very accurate . . .\n \n http://www.cnn.com/2006/TECH/science/06/27/gore.science.ap/index.html\n \n I think the best we can conclude is that there are viable people on both sides of this issue.", 
   {}, 
   218329, 
   null, 
   1151464140.0
  ], 
  [
   219570, 
   null, 
   "zachvac", 
   "Well, to be fair, here's a very recent article citing scientists who say Gore's new film was very accurate . . .\n \n http://www.cnn.com/2006/TECH/science/06/27/gore.science.ap/index.html\n \n I think the best we can conclude is that there are viable people on both sides of this issue.\n\n \n Well I think everyone agrees that the Earth is getting warmer, and that if it keeps up the results will be very bad. I still say regardless of whether it causes global warming or not, cutting down on pollution is a good thing. It's just disgusting walking into a big city like DC. You can smell the difference. Clean air just smells better, and if it turns out that Al Gore is right, helping reduce global warming will just be a bonus.", 
   {}, 
   219536, 
   null, 
   1151479440.0
  ], 
  [
   219582, 
   null, 
   "Jo Bennett", 
   "Well, to be fair, here's a very recent article citing scientists who say Gore's new film was very accurate . . .\n \n http://www.cnn.com/2006/TECH/science/06/27/gore.science.ap/index.html\n \n I think the best we can conclude is that there are viable people on both sides of this issue.\n\n \n I disagree, the best we can conclude is that the majority opinion among scientists, barring a few oil-backed rent-a-quotes, is that human are influencing the climate, causing a rise in average temperature.", 
   {}, 
   219536, 
   null, 
   1151492520.0
  ], 
  [
   219619, 
   null, 
   "jyoshu", 
   "And then again . . .\n \n http://www.epw.senate.gov/pressitem.cfm?party=rep&id=257909\n \"(AP) article titled \"Scientists OK Gore's Movie for Accuracy\" by Seth Borenstein raises some serious questions about AP's bias and methodology.\n \n AP chose to ignore the scores of scientists who have harshly criticized the science presented in former Vice President Al Gore's movie \"An Inconvenient Truth.\"\"\n \n In the interest of full disclosure, the AP should release the names of the \"more than 100 top climate researchers\" they attempted to contact to review \"An Inconvenient Truth.\" AP should also name all 19 scientists who gave Gore \"five stars for accuracy.\" AP claims 19 scientists viewed Gore's movie, but it only quotes five of them in its article. AP should also release the names of the so-called scientific \"skeptics\" they claim to have contacted.\"\n \n The AP also chose to ignore Gore's reliance on the now-discredited \"hockey stick\" by Dr. Michael Mann, which claims that temperatures in the Northern Hemisphere remained relatively stable over 900 years, then spiked upward in the 20th century, and that the 1990's were the warmest decade in at least 1000 years.\"", 
   {
    "unicode_changes_made": true
   }, 
   219582, 
   null, 
   1151511780.0
  ], 
  [
   219660, 
   null, 
   "Waxy", 
   "I disagree, the best we can conclude is that the majority opinion among scientists, barring a few oil-backed rent-a-quotes, is that human are influencing the climate, causing a rise in average temperature.\n\n \n emoticon_rolleyes\n \n Waxy", 
   {}, 
   219582, 
   null, 
   1151517660.0
  ], 
  [
   219712, 
   null, 
   "DrNo", 
   "I disagree, the best we can conclude is that the majority opinion among scientists, barring a few oil-backed rent-a-quotes, is that human are influencing the climate, causing a rise in average temperature.\n\n \n That is the best that YOU can conclude. You do, of course, realize that everything on the planet must influence the climate. A lot of scientists think that volcanic gasses that we have no control over are leading to global warming. If that is true, we are screwed anyway. It seems to me that very simple-minded people find it easiest to blame whatever is on top. The humans are on top of the animal kingdom, therefore everything in the environment is their fault. America is on top of the human kingdom, therefore everything in the world is all their fault.\n \n What do you think will happen if icebergs start to melt? Will the ocean levels rise? Of course not. The icebergs are already displacing the ocean water with their mass. If they melt, the water level should stay the same. If you pour a glass of ice water and let it sit out in the sun, does the water spill out of the glass as the ice melts? And if it gets hot enough for the polar ice caps to melt, we are all dead anyway.", 
   {}, 
   219582, 
   null, 
   1151527440.0
  ], 
  [
   219717, 
   null, 
   "Kronus", 
   "\n What do you think will happen if icebergs start to melt? Will the ocean levels rise? Of course not. The icebergs are already displacing the ocean water with their mass. If they melt, the water level should stay the same. If you pour a glass of ice water and let it sit out in the sun, does the water spill out of the glass as the ice melts? And if it gets hot enough for the polar ice caps to melt, we are all dead anyway.\n\n Most of the world's ice is on land, not in the water. When it melts it will cause flooding. And we've already seen significant melting with just a fraction of a degree increase in temperature. A temperature rise of just a couple degrees won't kill us directly, but would be quite enough to flood most low lying areas. Like, for example, New York, LA, Washington, and most of the state of Florida. It really doesn't sound like you know enough about this issue to be dismissing what scientists, or indeed anyone, says so cavalierly.", 
   {}, 
   219712, 
   null, 
   1151529060.0
  ], 
  [
   219727, 
   null, 
   "DrNo", 
   "Most of the world's ice is on land, not in the water. When it melts it will cause flooding. And we've already seen significant melting with just a fraction of a degree increase in temperature. A temperature rise of just a couple degrees won't kill us directly, but would be quite enough to flood most low lying areas. Like, for example, New York, LA, Washington, and most of the state of Florida. It really doesn't sound like you know enough about this issue to be dismissing what scientists, or indeed anyone, says so cavalierly.\n\n \n Actually, I said icebergs, not \"the world's ice.\" At one point, most of the entire North American continent was covered in ice. Clearly, at least to me, this shows that the earth is capable of going through major climate changes regardless of what humans are doing.", 
   {}, 
   219717, 
   null, 
   1151531280.0
  ], 
  [
   219728, 
   null, 
   "sinjin", 
   "What do you think will happen if icebergs start to melt? Will the ocean levels rise? Of course not. The icebergs are already displacing the ocean water with their mass. If they melt, the water level should stay the same. If you pour a glass of ice water and let it sit out in the sun, does the water spill out of the glass as the ice melts? And if it gets hot enough for the polar ice caps to melt, we are all dead anyway.\n\n \n Did you come up with that boneheaded notion on your own? It's not about icebergs. Sheesh.\n \n Please don't feel compelled to share your wisdom on every subject.", 
   {}, 
   219712, 
   null, 
   1151531520.0
  ], 
  [
   219729, 
   null, 
   "Kronus", 
   "Actually, I said icebergs, not \"the world's ice.\" At one point, most of the entire North American continent was covered in ice. Clearly, at least to me, this shows that the earth is capable of going through major climate changes regardless of what humans are doing.\n\n I know you said icebergs, and you brought them up as if they had anything to do with anyone's concerns about flooding. That fact that you did shows how little you understand these issues. So rather than settling for what's \"clear to you\" at the moment you should really try to gain some understanding of the issues before leaping to any conclusions. Your call, of course.", 
   {}, 
   219727, 
   null, 
   1151531760.0
  ], 
  [
   219731, 
   null, 
   "sinjin", 
   "Actually, I said icebergs, not \"the world's ice.\" At one point, most of the entire North American continent was covered in ice. Clearly, at least to me, this shows that the earth is capable of going through major climate changes regardless of what humans are doing.\n\n \n Where was sea level then?", 
   {}, 
   219727, 
   null, 
   1151531940.0
  ], 
  [
   219737, 
   null, 
   "Waxy", 
   "Where was sea level then?\n\n \n http://www.mesa.edu.au/conf98/bowler_fig2.htm\n \n http://palaeo.gly.bris.ac.uk/Palaeofiles/Triassic/images/sealev.jpg\n \n http://people.hofstra.edu/faculty/J_B_Bennington/135notes/eustacy.html\n \n I've got a fantastic stratigraphy and sea level curve chart for the Cambrian to the Quaternary or North America on my wall, I wish I had some way of reproducing it for you.\n \n Waxy", 
   {}, 
   219731, 
   null, 
   1151533380.0
  ], 
  [
   219745, 
   null, 
   "sinjin", 
   "Thanks Waxy.\n \n How about info on when sea level was at its highest?\n \n If I read your first link correctly at approx. 20,000 yrs ago sea level was approx. 140 meters lower than today.", 
   {}, 
   219737, 
   null, 
   1151534580.0
  ], 
  [
   219758, 
   null, 
   "Waxy", 
   "Globally, seal level was at its consistent lowest during the early Jurassic (208-167mya), wiht short lived lows also being experience during periods of glaciation. Peak mean sea levels were seen during the Cretaceous (116-66mya). (That's 2000-1800, and 1000-600 years ago for you YEC'ers out there. emoticon_xgood )\n \n Peak sea levels during the Cretaceous are estimated to have been consistently in the range of 400-600m higher than current levels.\n \n As an aside, it was during the Cretaceous period that the greatest portion of the North American continent was submerged, and from those Cretaceous sediments (sourced from the laramide events that formed the Rocky Mountain chains, also happening during the Cret.) that the majority of oil and gas in the world is produced.\n \n The other period of peak sea levels, the Devonian-Mississippian (400-320mya) is the second major source of petroleum reservoirs.\n \n Waxy", 
   {}, 
   219745, 
   null, 
   1151538420.0
  ], 
  [
   219762, 
   null, 
   "sinjin", 
   "Peak sea levels during the Cretaceous are estimated to have been consistently in the range of 400-600m higher than current levels.\n\n \n What do we know about atmospheric temperatures during the Cretaceous?", 
   {}, 
   219758, 
   null, 
   1151538900.0
  ], 
  [
   219771, 
   null, 
   "Waxy", 
   "What do we know about atmospheric temperatures during the Cretaceous?\n\n \n Largely tropical - warm and humid over most of the planet. I don't know specific temps off the top of my head, I'd have to look it up.\n \n Basically, most of NA was one big XXX beach. Just sip on a cool one and watch the dinosaurs go by.\n \n Waxy", 
   {}, 
   219762, 
   null, 
   1151539560.0
  ], 
  [
   219913, 
   null, 
   "DrNo", 
   "\n Peak sea levels during the Cretaceous are estimated to have been consistently in the range of 400-600m higher than current levels.\n \n Waxy\n\n \n Again, this would lead me to believe that whatever change we are seeing today is inevitable. If the sea level used to be 400-600 meters higher than today, what would lead anybody to believe that is isn't possible for it to return to that level entirely on its own?", 
   {}, 
   219758, 
   null, 
   1151609580.0
  ], 
  [
   219927, 
   null, 
   "jim's trucking", 
   "Y'all should cut Al some slack. He's still stressed out from inventing the Internet and from losing the election.\n \n As for global warming, it's a naturally recurring phenomenon and there's little we can do about it except brace for the coming destruction of our current way of life.\n \n emoticon_xhoho", 
   {}, 
   219913, 
   null, 
   1151614980.0
  ], 
  [
   220054, 
   null, 
   "GreenMtnBoy", 
   "Of course the earth's climate can vary between much colder and much hotter than it is today, that isn't debatable. The debate on global warming is over as well, it's a fact the earth is warming. What is debatable is whether humans have played a role in the current warming trend. \n \n To get your answer all you need to do is look at the rate of change in global temperatures. In the last 200 years temperatures have been rising at an astounding rate, and they continue to accelerate. Have global temperatures been higher before? Yes. Have they ever risen so quickly? No.", 
   {}, 
   219927, 
   null, 
   1151661000.0
  ], 
  [
   220603, 
   null, 
   "Kronus", 
   "\n As for global warming, it's a naturally recurring phenomenon and there's little we can do about it except brace for the coming destruction of our current way of life.\n \n\n \n So if you acknowledge that things are heating up and that said heating is going to be Very Bad, why are you so ready to just give up? If lowering greenhouse gas emmisions could help, if it has any chance at all, then wouldn't we be XXXXXX to not try it?", 
   {}, 
   219927, 
   null, 
   1151946360.0
  ], 
  [
   237590, 
   null, 
   "Jim Colyer", 
   "Gore just wants to be in the news and will do anything to get in the news.", 
   {}, 
   218191, 
   null, 
   1162398240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Al Gore Debunked", 
  "url": "http://www.4forums.com/political/environmental-debates/8289-al-gore-debunked.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 8289, 
  "discussion_files": [
   [
    "2002.html", 
    "http://www.4forums.com/political/environmental-debates/8289-al-gore-debunked-print.html"
   ], 
   [
    "2003.html", 
    "http://www.4forums.com/political/environmental-debates/8289-al-gore-debunked-3-print.html"
   ], 
   [
    "2004.html", 
    "http://www.4forums.com/political/environmental-debates/8289-al-gore-debunked-2-print.html"
   ]
  ], 
  "identifier": 8289
 }
]