[
 [
  [
   217029, 
   null, 
   "Liminus", 
   " Scientists recreate evolution of butterfly species\n \n \n \n A species of butterfly has been recreated in the laboratory in an experiment that may have captured the real evolutionary steps leading to the formation of a new breed of animal.\n \n The experimental species was produced from two different types of butterfly that had been interbred to produce a fertile hybrid which was shown in subsequent tests to prefer mating with its own kind. British and American researchers said that this is probably how the brightly coloured Heliconius heurippa - a wild species from South America - first came about as a distinct entity thousands of years ago.\n \n \"We recreated the evolutionary steps that may have given rise to Heliconius heurippa, a hybrid butterfly species, in the lab,\" said Jesus Mavarez of the Smithsonian Tropical Research Institute in Panama City. The study, published inNature, sheds fresh light on how species come into existence. It also shows that the process can occur very quickly when two closely related species are occasionally able to interbreed to produce fertile hybrids.\n \n There are about 60 species of butterfly belonging to the Heliconius genus and all have distinctive matt-black wings with red, orange, yellow and white markings to indicate to predators that the butterflies are poisonous to eat. Scientists had long suspected that the H. heurippa, which has red and yellow stripes on its wings, was closely related to two similar looking butterflies, H. cydno and H. melpomene. They set up a laboratory breeding programme and found thatH. heurippa could be quickly recreated by interbreeding these two parental types.\n \n \"We found a wing pattern almost identical to that of the hybrid can be obtained in months - just three generations of lab crosses,\" said Mauricio Linares, of the University of the Andes in Colombia. \"Natural hybrids from San Cristobel in Venezuela show wing patterns very similar to H. heurippa, further supporting the idea of a hybrid origin of this species.\"\n \n But the key finding from the experiment was that the hybrid offspring preferred to mate among themselves rather than breeding with butterflies belonging their parental types.\n \n Chris Jiggins of the University of Edinburgh said this may be related to the wing patterns in a group of butterflies that are important in warning away predators. Wing coloration is so finely tuned that even slight deviations in colours or patterns produce confusing signals that could result in greater predation.\n \n \"Butterflies tend to choose partners that look like themselves, as they are attracted to others with wing patterns similar to their own,\" Dr Jiggins said.\n \n \"So, once the new pattern was established, these individuals have tended to shun... their parental species,\" he said.", 
   {
    "post_info": {
     "post_title": "Scientists recreate evolution of butterfly species"
    }
   }, 
   null, 
   null, 
   1150366560.0
  ], 
  [
   217035, 
   null, 
   "peteratwar", 
   "Lovely design on the wings\n \n Do you think they are intelligent ?emoticon_xangel", 
   {}, 
   217029, 
   null, 
   1150375860.0
  ], 
  [
   217048, 
   null, 
   "electrolyte", 
   " Scientists recreate evolution of butterfly species\n \n A species of butterfly has been recreated in the laboratory in an experiment that may have captured the real evolutionary steps leading to the formation of a new breed of animal.\n\n [mode=creationist]But it's still a butterfly!!!1111one[/mode]", 
   {}, 
   217029, 
   null, 
   1150385100.0
  ], 
  [
   217061, 
   null, 
   "peteratwar", 
   "Let us hope it doesn't flutter its wings in the Amazon Rain Forest!:)", 
   {}, 
   217048, 
   null, 
   1150390920.0
  ], 
  [
   217066, 
   null, 
   "wallninja", 
   "electrolyte has a point. If the butterfly had changed into another creature then it would have been somethin worth noting. The butterfly stayed as a butterfly. It's just like a Mexican and an American Indian having a child. It would have a different skin color and facial features and stuff like that, but it would still be a human.", 
   {}, 
   217061, 
   null, 
   1150392120.0
  ], 
  [
   217074, 
   null, 
   "trebor", 
   "electrolyte has a point. If the butterfly had changed into another creature then it would have been somethin worth noting. The butterfly stayed as a butterfly. It's just like a Mexican and an American Indian having a child. It would have a different skin color and facial features and stuff like that, but it would still be a human.\n\n \n But, it is a new TYPE of butterfly. \n \n It would be more like if a bonobo and a human had a child. That is theorotically possible...", 
   {}, 
   217066, 
   null, 
   1150393560.0
  ], 
  [
   217162, 
   null, 
   "electrolyte", 
   "electrolyte has a point. If the butterfly had changed into another creature then it would have been somethin worth noting. The butterfly stayed as a butterfly. It's just like a Mexican and an American Indian having a child. It would have a different skin color and facial features and stuff like that, but it would still be a human.\n\n But Mexicans and Native Americans are the same species, so it's not just like that. This butterfly is a species different than either parent.\n \n One reason that that particular creationist objection has no merit is because the butterflies are significantly biologically different (i.e. different species). The fact that we call each species a type of butterfly has only to do with our taxonomic system.\n \n If we were to somehow have fossils representing the complete record of the water-to-land transition, one would be forced to pick a point at which a fish became a land animal. Just because one finds this a difficult task to accomplish doesn't mean that there was no transition. Likewise, this applies to any line of ancestry.\n As an example, look at creationists' response to Archaeopteryx. Many insisted that it is a bird. Others insisted that it is a reptile. A few have originally called it a bird, then decided that it must be a reptile. The fact that people have trouble fitting an organism into our previously-learned concepts of classifications is a sign that species have changed significantly.", 
   {}, 
   217066, 
   null, 
   1150407960.0
  ], 
  [
   217240, 
   null, 
   "prschuster", 
   "Have you noticed how creationism is just a logical extension of fundamentalist, absolutist, \"either / or\", thinking? Everything has to be well defined or their world falls apart on them, and they have anxiety attacks. No inbetween... no transitional forms... no microevolutionary steps leading to macroevolution... no messy complexity in the natural world without a Designer present to organize it... no grey areas... everything is either a fish or an amphibian, a reptile or a bird, an ape or a human, prebiotic or fully alive. These are extremely insecure, reactive folks. I hope I didn't offend anybody (ha ha ha ha).", 
   {
    "post_info": {
     "post_title": "No Inbetween"
    }
   }, 
   217162, 
   null, 
   1150421940.0
  ], 
  [
   217242, 
   null, 
   "marc9000", 
   "Have you noticed how creationism is just a logical extension of fundamentalist, absolutist, \"either / or\", thinking? Everything has to be well defined or their world falls apart on them, and they have anxiety attacks. No inbetween... no transitional forms... no microevolutionary steps leading to macroevolution... no messy complexity in the natural world without a Designer present to organize it... no grey areas... everything is either a fish or an amphibian, a reptile or a bird, an ape or a human, prebiotic or fully alive. These are extremely insecure, reactive folks. I hope I didn't offend anybody (ha ha ha ha).\n\n \n Anxiety attacks? Notice what happens on these forums when a creationist gives an opinion; see how many different evolutionists personally ridicule them. Then compare that to when an evolutionist gives their opinion; see how many creationists personally ridicule them. It's not hard to see who's insecure and reactive.", 
   {}, 
   217240, 
   null, 
   1150422540.0
  ], 
  [
   217253, 
   null, 
   "prschuster", 
   "Anxiety attacks? Notice what happens on these forums when a creationist gives an opinion; see how many different evolutionists personally ridicule them. Then compare that to when an evolutionist gives their opinion; see how many creationists personally ridicule them. It's not hard to see who's insecure and reactive.\n\n \n \n \n Walking-fish:\n Let's not get touchy, now. We're not being reactive. We're just amused by the ridiculous assertions of creationists.", 
   {}, 
   217242, 
   null, 
   1150427400.0
  ], 
  [
   217261, 
   null, 
   "Steeeeve", 
   "I don't think I understand this very well....they took 2 different butterflys and combined them to make a 3rd? What 2 things combined together made a human then?\n \n This isn't an anti-evolution or anti-ID post....i'm just asking a question cause I don't understand (this is for those that were just going to give some smart a** answer)", 
   {}, 
   217253, 
   null, 
   1150436580.0
  ], 
  [
   217263, 
   null, 
   "electrolyte", 
   "Anxiety attacks? Notice what happens on these forums when a creationist gives an opinion; see how many different evolutionists personally ridicule them. Then compare that to when an evolutionist gives their opinion; see how many creationists personally ridicule them. It's not hard to see who's insecure and reactive.\n\n I ridicule most any \"opinion\" that is demonstrably false. Unfortunately for creationists, that includes virtually all of their \"evidence.\"", 
   {}, 
   217242, 
   null, 
   1150437780.0
  ], 
  [
   217264, 
   null, 
   "electrolyte", 
   "I don't think I understand this very well....they took 2 different butterflys and combined them to make a 3rd?\n\n They interbred two different species of butterfly, and the offspring that were produced were of yet another species. This is a speciation event.\n \n \nWhat 2 things combined together made a human then?\n\n There are different ways in which species can arise; the above is one of these ways. Humans are not thought to have arisen in this manner.", 
   {}, 
   217261, 
   null, 
   1150438140.0
  ], 
  [
   217321, 
   null, 
   "Love Never Dies", 
   "Blasphemy!", 
   {}, 
   217264, 
   null, 
   1150470600.0
  ], 
  [
   217711, 
   null, 
   "Liminus", 
   "I don't think I understand this very well....they took 2 different butterflys and combined them to make a 3rd? What 2 things combined together made a human then?\n \n This isn't an anti-evolution or anti-ID post....i'm just asking a question cause I don't understand (this is for those that were just going to give some smart a** answer)\n\n \n Scientists recreate new species\n \n \nThe process of speciation usually occurs when one species splits into two, but there are some cases in which new species result from the mating between two good species. Wait a minute, you may be saying, isn't the definition of a species is that it can only produce viable offspring with members of its own species?\n \n Yes, but. Usually when members of different species mate, their offspring die or are infertile. On occasion, polyploid hybrids -- individuals with multiple copies of their parents' chromosomes, survive and establish a new lineage or species. Polyploid hybrid speciation often occurs in plants when polyploid individuals go on to reproduce asexually. Some lizards, frogs, fish and many invertebrates also pull this trick.\n \n But hybrid matings may also produce normal, sexual offspring with the same number of chromosomes as their parents (homoploids). These offspring don't usually go on to become new species, because they backcross with individuals from their parent species.\n \n At least two other species in the group, H. timareta and H. pachinus, are also proposed to result from H. cydno/H. melpomene hybridization. \"We will feel very fortunate if there are more hybrid species in this group,\" Mavarez continues, \"Cases of hybrid animal species are extremely rare and you're very lucky to have one in your preferred group. So, imagine our excitement about the possibility of finding several hybrid species in Heliconius! A whole new set of questions could be addressed.\" A new research project to identify the specific genetic contribution of each parental species to the genome of H. heurippa promises to shed new light on this kind of hybrid speciation. \n\n \n My apologies for just cutting and pasting but the article explains it better than I could in my own words.\n \n \nAnxiety attacks? Notice what happens on these forums when a creationist gives an opinion; see how many different evolutionists personally ridicule them. Then compare that to when an evolutionist gives their opinion; see how many creationists personally ridicule them. It's not hard to see who's insecure and reactive.\n\n \n You have a point but you weaken your position by not addressing the topic of the thread. If you do not want to be ridiculed by others you'll have to do better than just whining about the evolution/ID debate in general terms.", 
   {}, 
   217261, 
   null, 
   1150718220.0
  ], 
  [
   217809, 
   null, 
   "marc9000", 
   "You have a point but you weaken your position by not addressing the topic of the thread. \n\n \n I was responding to a post which also did not address the topic of the thread. Which position was weakened the most, mine or the post/position I was responding to? Does the initiating of an ad hom attack show less weakness than responding to one?\n \n \n \nIf you do not want to be ridiculed by others you'll have to do better than just whining about the evolution/ID debate in general terms.\n\n \n I'd say I'd have to do a LOT better!! :) You're saying that there's a way a Christian can post at this forum and NOT be ridiculed?? The only way that's going to happen is if the insecurity and reactivism of atheism is toned way down. I'll not be holding my breath. emoticon_xangel", 
   {}, 
   217711, 
   null, 
   1150756800.0
  ], 
  [
   217851, 
   null, 
   "electrolyte", 
   "Does the initiating of an ad hom attack show less weakness than responding to one?\n\n While it is true that repeated ad hominem fallacies is a sign of weakness of an argument (insofar as substantive arguments are lacking), it is not necessarily true that initiating said fallacies is a sign of weakness. For example, there have been numerous posts in which I have substantially and substantively dismantled your talking points, and you've insisted that my barbs therein are personal attacks. The strength or weakness of an argument has more to do with the argument itself.\n \n \nYou're saying that there's a way a Christian can post at this forum and NOT be ridiculed??\n\n As I stated earlier, I hardly give a damn what religion, worldview, political leaning, etc., someone claims; I take on demonstrably false claims with no qualms.\n If anyone -- Christian or not -- can post a well-written entry free of false assertions, proselytization attempts, fallacies and the like, their entry will not be ridiculed by me.\n \n Speaking of entries worth ridicule, have you abandoned the second law of thermodynamics thread, or are you simply overwhelmed with science?", 
   {}, 
   217809, 
   null, 
   1150767300.0
  ], 
  [
   217871, 
   null, 
   "marc9000", 
   "While it is true that repeated ad hominem fallacies is a sign of weakness of an argument (insofar as substantive arguments are lacking), it is not necessarily true that initiating said fallacies is a sign of weakness. For example, there have been numerous posts in which I have substantially and substantively dismantled your talking points, and you've insisted that my barbs therein are personal attacks. The strength or weakness of an argument has more to do with the argument itself. \n\n \n The question that you responded to was directed at Liminus. Why did you answer as if it was asked of you? Are you and Liminus the same person? In the \"clergy letter project\" thread, you ignored my post #70 which was directed at you, and responded to my post # 78 which was directed at Liminus. Do you sometimes forget to use the right name? Or are you just trolling as usual?\n \n \n \n \nAs I stated earlier, I hardly give a damn what religion, worldview, political leaning, etc., someone claims; I take on demonstrably false claims with no qualms.\n If anyone -- Christian or not -- can post a well-written entry free of false assertions, proselytization attempts, fallacies and the like, their entry will not be ridiculed by me.\n\n \n But I wasn't asking about YOU ONLY, Liminus, prschuster, or whoever you are. I was asking about posts in general on these forums. Can you name any one Christian creationist who has posted here about creation, who hasn't been personally riduculed by an anxious and reactive atheist? Copy/paste it.\n \n \nSpeaking of entries worth ridicule, have you abandoned the second law of thermodynamics thread, or are you simply overwhelmed with science?\n\n \n A few others came along and somewhat changed the subject in that one, and that's okay of course, the thread didn't start out with the thermodynamics subject anyway. When we were on thermodynamics, there were about nine atheists anxiously and reactively working on me - about 5 of them gave their views in an acceptable way, and the other 4 were doing nothing but trolling. (you fall into the latter catagory) Here's a little from your last post there;\n \n \nOriginally Posted by marc9000\n But what is the mechanism for those steps? The refrigerator is the mechanism in your example. Not only is it complex and intelligently designed, but it needs specially designed energy (electricity) to work.\n \n (electrolyte) Sorry, I don't have time to recite complex biochemistry to you. \n\n \n This is common evolution debate, to claim that something is \"too complex\" for anyone but an atheist to understand. \n \n \n \n \n \nOriginally Posted by marc9000\n I see now that entropy has only a marginal application to our discussion. You seem more concerned with entropy's existance after something has developed. This discussion is about changes in entropy during a development process. The effects of thermodynamics is change, evolution is about change. \n \n (electrolyte)I have no idea what the main point of this passage is. \n\n \n More common evolution debate, to claim confusion when stumped, and somehow imply that it's not your fault, like this; \n \n \n \n(electrolyte) or whatever you think you're talking about \n\n \n \n \nI can kick your XXX.....\n \n And again, I'll kick your XXX on \n\n \n Trolls can be fun to work up into a frenzy like this, but there comes a time when things should be dropped.", 
   {}, 
   217851, 
   null, 
   1150773480.0
  ], 
  [
   217940, 
   null, 
   "electrolyte", 
   "The question that you responded to was directed at Liminus. Why did you answer as if it was asked of you?\n\n I answered it as if it were a question. After all, it was a general question that wasn't dependent upon Liminus's viewpoint. I simply used an example from my own experience to back up my answer. And you responded in a way that exemplified my point.\n \n \nAre you and Liminus the same person?\n\n Aren't you forgetting Collin? It's funny that you insist that there's a huge number of evil atheists out to get you, yet you at the same time imply that I alone am responsible for no fewer than three usernames.\n \n \nBut I wasn't asking about YOU ONLY, Liminus, prschuster, or whoever you are.\n\n Well of course... But of course, I can't speak for people who aren't me. But then, maybe you think I'm all of those people, too?\n \n \nCan you name any one Christian creationist who has posted here about creation, who hasn't been personally riduculed by an anxious and reactive atheist? Copy/paste it.\n\n Depends: Can you cite any one Christian creationist's post that contains none of the things that I said I tackle with no qualms?\n \n \nA few others came along and somewhat changed the subject in that one, and that's okay of course, the thread didn't start out with the thermodynamics subject anyway.\n\n So you didn't abandon the thread because you were getting your points handily refuted but instead because somebody changed the subject?! Get real.\n \n \nWhen we were on thermodynamics, there were about nine atheists anxiously and reactively working on me - about 5 of them gave their views in an acceptable way, and the other 4 were doing nothing but trolling. (you fall into the latter catagory) Here's a little from your last post there;\n \nOriginally Posted by marc9000\n But what is the mechanism for those steps? The refrigerator is the mechanism in your example. Not only is it complex and intelligently designed, but it needs specially designed energy (electricity) to work.\n \n (electrolyte) Sorry, I don't have time to recite complex biochemistry to you.\n\n \n This is common evolution debate, to claim that something is \"too complex\" for anyone but an atheist to understand.\n\n I didn't say you were incapable of understanding (which very well may be true), I said that I don't have time to be your personal tutor, especially when you're unwilling to learn. I pointed you toward the photosystems several times, including with links, and you refused to look into it.\n \n But really, I just wanted to say this:\n This is common evolution debate, to claim that something is \"too complex\" for anything but God to design.\n \n \n \nOriginally Posted by marc9000\n I see now that entropy has only a marginal application to our discussion. You seem more concerned with entropy's existance after something has developed. This discussion is about changes in entropy during a development process. The effects of thermodynamics is change, evolution is about change. \n \n (electrolyte)I have no idea what the main point of this passage is.\n\n \n More common evolution debate, to claim confusion when stumped, and somehow imply that it's not your fault, like this; \n \n \n(electrolyte) or whatever you think you're talking about\n\n\n Who said I'm stumped? You're the one paying absolutely no attention to what I've said. I am perfectly willing to apply the second law of thermodynamics to any classical system, regardless of whatever \"development\" has occurred between the initial and final states. What makes no sense whatsoever is to insist that the concept of entropy is only marginal to a discussion regarding the second law of thermodynamics.\n \n \n\n I can kick your XXX.....\n \n And again, I'll kick your XXX on\n\n Trolls can be fun to work up into a frenzy like this, but there comes a time when things should be dropped.\n\n Let's not take things out of context, now. Contrary to your edited citations, there were no physical threats. Here are the full passages:\n \nEvolution is not reasonably accountable (mostly because you wouldn't dare quantify the entropy of the earth), and it's not a proper physical system, but that doesn't mean it's not testable, repeatable, or observable. I can kick your XXX (again) on these three topics in another thread if you like, but let's stick to your second law claptrap for this one.\n\n \n \nI'm getting an education in how those who represent science seem to arbitrarily define what a \"system\" is, and what testable, repeatable, and observable really are.\nThere's no arbitration involved. And again, I'll kick your XXX on evolution being testable, repeatable, and observable in another thread at your request.\n\n Just because you don't like the fact that I've demolished your talking points doesn't mean that it didn't happen, nor does it mean I'll sit back and let you make them again.\n \n I suppose the following informative, substantive, and effective refutations of your points qualify as \"trolling\" because they are, after all, effective refutations of your points? For your sake, rather than repeating my better damning of your arguments, I'll cite only from the post you insist illustrates my status as a troll.\n \n \nLook at two atoms of hydrogen. See how long it takes for the electron in each to collapse into the proton at the center. Go ahead.\n They won't, because the law doesn't apply to them. It's not because they are already at a state of maximum entropy -- allow the two to interact and they will bond -- but because nothing says they ought to.\n\n \n \nThere are a number of problems with your model. Most organisms are not \"exposed to unrestricted amounts of energy,\" but this is really the least of your concern. More importantly, animals are consumers, not producers; they do not get their energy from the sun. On the other hand, if you leave some plants in a car with the windows down, it will live happily, and if you leave a zebra in a field with grass to eat, it will live too, despite being exposed to lots and lots of light.\n Furthermore, your example neglects to feed the animal in the car. Food serves as a sink for entropy (that is, a source of usable energy). By removing this sink, your example becomes inapplicable to all organisms that are able to eat.\n\n \n \nEntropy is a state function relating heat (transfer) and temperature.\n\n \n \nNo, the evolving of it isn't random or chance. An antonym of \"random\" is \"selective\"... Natural selection isn't random, it's selection!\n\n These are not the remarks of a troll. 'Tis quite a shame that you are unable to tell the difference.", 
   {}, 
   217871, 
   null, 
   1150785480.0
  ], 
  [
   217945, 
   null, 
   "pandion", 
   "The effects of thermodynamics is change, evolution is about change.\n\n Without question the most ignorant and mindless assertion possible. When my underwear are dirty I change them, which means that the laws of thermodynamics and the theory of evolution must apply.", 
   {}, 
   217940, 
   null, 
   1150787880.0
  ], 
  [
   222396, 
   null, 
   "SassyTeffie", 
   "So, back on topic. What's the big deal about scientists breeding two differnt butterflies to obtain a third type of butterfly? Amateur botanists have been doing this with flowers for ages. You take two different types of pansies and breed them together to create a third type of pansy. I repeat...what's the big deal? I don't get it.", 
   {}, 
   217945, 
   null, 
   1152907080.0
  ], 
  [
   222450, 
   null, 
   "pandion", 
   "So, back on topic. What's the big deal about scientists breeding two differnt butterflies to obtain a third type of butterfly?\nThe big deal is that they have duplicated the probable events by which the butterfly species was formed. Didn't you read it?\n \nAmateur botanists have been doing this with flowers for ages.\nAnd it has been happening in the wild too. It was only recently discovered that wheat is a hybrid of two other species. Nevertheless, since it cannot be crossed with either parent, it is a separate species.\n \nYou take two different types of pansies and breed them together to create a third type of pansy.\nI believe you are mistaken. You do understand that you are claiming that crossing two different types of pansy creates a separate species that cannot be crossed with either parent. You do understand that in the case of the butterfly and in the case of the wheat I mentioned above, the new species is more than just a matter of color. Besides, as far as I know, all pansies belong to the same species of violet, Viola tricolor. Most are even in the same subspecies, V. t. hortensis. I also understand that many varieties are hybrids with other violet species.\n \nI repeat...what's the big deal? I don't get it.\nObviously.", 
   {}, 
   222396, 
   null, 
   1152917820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Scientists recreate evolution of butterfly species", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8294-scientists-recreate-evolution-butterfly-species.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 8294, 
  "discussion_files": [
   [
    "22850.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8294-scientists-recreate-evolution-butterfly-species-print.html"
   ], 
   [
    "22851.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8294-scientists-recreate-evolution-butterfly-species-2-print.html"
   ]
  ], 
  "identifier": 8294
 }
]