[
 [
  [
   217317, 
   null, 
   "Caesar", 
   "What are democratic perspectives for Georgia? \n Methinks Saakashvili is doomed to failure in his drive to \"bring democracy\" to Georgia 'cause he's just copying American rotten democracy pattern. Matter of fact American democracy itself is lacking vitality nowadays. Iraqi ongoing mess is vivid confirmation.\n Generally, I can't get it. If Georgia claims she's part of EU why is Saakashvili always seeking American pat on the back and not that of EU? What's actually Saakashvili's been doing has nothing to do with democracy. At least in Germany and France we see it somewhat differently.\n Political opponents of Saakashvili's regime are kidnapped and killed, get imprisoned and are subject to tortures. Luckily for Georgians he doesn't possess technical tools to keep a spying eye on all the country citizens unlike Americans. But that's quite a probability if he sticks to his nexus with Washington.\n Interestingly, Americans unwillingly did some useful piece of job for EU. They tested EU newcomers loyalty to true democracy by tempting them with that secret jails deal. So EU freshers showed their real worth. Say Czechia has passed the test by refusing to house the CIA prisons on her soil. And Georgia has failed it by gladly embracing them. \n Why on earth should we pacify ourselves with authoritarian and prone to betrayal Georgia being in European democratic structures? Georgia is only able to mar their reputation!", 
   {
    "post_info": {
     "post_title": "What are democratic perspectives for Georgia?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1150469460.0
  ], 
  [
   422216, 
   null, 
   "Foliashvili", 
   "For example here in Georgia our president Saakashvili depends quite a lot on his Dutch wife Sandra Roelofs. At least take the recent story with one of the Dutch banks - ABN Amro which is said to belong to the Roelofs family. You see earlier the bank used to transfer the money of Georgian Diaspora in Europe to Saakashvili's accounts in the Bank of Georgia via the Netherlands Development Finance Company under the assistance to developing countries initiative. Actually no one knows for sure what kind of money it is but there's little doubt that it's far from being honest, however that's not the case here... You see recently the consortium of banks which includes ABN Amro too and is headed by the RBS decided to cut down the initiative by 70%. And that resulted in billions of dirty dollars of Saakashvili being frozen! And in order to unfreeze them Saakashvili had to show the consortium that Georgia deserved to get her share from the intact 30%. Well the most amazing part of the story begins here! In order to achieve the aim that cunning polly Roelofs convinced Saakashvili to pay off all international loans to the consortium from the budget money... and (!!) 90% of the loans are again from that ABN Amro bank! So you see now, you do surely... Saakashvili transfers the budget money to the accounts of his wife's bank (i.e. his own) so as to unfreeze  his own funds ! Double shot... And the fact that it puts our country on the brink of bankruptcy doesn't actually concern them much. \n So this is the way our 'beloved' [S]bitch[/S] first lady influences her imbecile of a husband... BTW Saakashvili doesn't even bother concealing it! Every Georgian is aware of that!", 
   {
    "post_info": {
     "post_title": "I wonder how first ladies of various countries influence their husbands."
    }
   }, 
   217317, 
   null, 
   1294941060.0
  ], 
  [
   427232, 
   null, 
   "tomibraniste", 
   "You are right Foliashvili", 
   {}, 
   422216, 
   null, 
   1302552720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What are democratic perspectives for Georgia?", 
  "url": "http://www.4forums.com/political/european-politics-economics/8317-what-democratic-perspectives-georgia.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 8317, 
  "discussion_files": [
   [
    "26292.html", 
    "http://www.4forums.com/political/european-politics-economics/8317-what-democratic-perspectives-georgia-print.html"
   ]
  ], 
  "identifier": 8317
 }
]