[
 [
  [
   12344, 
   null, 
   "WarriorPoet", 
   "Let me pose a scenario...\n \n You have a 12 year old daughter. She is fresh with life and just as pretty as a picture. She comes home and says that her friends are joining the local chapter of some organization just for young girls. She wants to join up. You think it is probably a good idea, but being a responsible and caring parent, you want to check out the organization just to be sure. You walk into the local building for the organization and start asking a few innocent questions. Soon you find out that the girls often go on camping trips to a national park nearby the learn about nature, etc. You think that is really a good thing. You ask about the leaders, and you suddenly find out that the camping trips, while made up entirely of young girls from 12 -15 years of age, are completely led by grown men that are anywhere from 25 -40 years old. Do you let your daughter join this organization and go out on these camping trips alone with men?\n \n Now, if you answered yes to this question, then you are sick and this does not apply to you. If you answered no, then why on earth would you allow your 12 year old boy go on a camping trip with gay men? I am in no way advocating that all gay men (or men in general for that matter) are pedophiles, but isn't the situation the same? Why would anyone advocate this if they are a parent? It just does not make sense to me.", 
   {
    "post_info": {
     "post_title": "Gay men as boy scout leaders, etc."
    }
   }, 
   null, 
   null, 
   1059535560.0
  ], 
  [
   13432, 
   null, 
   "Morfos", 
   "Your Scenerio makes no sense what so ever. It has nothing to do with being gay. Why shouldn't boy scout leaders be gay? If they sexually harass children they will be fired. Straights sexually harass children too so what point are you trying to make? Anyone who votes no is a sickenly hatefull fascist.", 
   {}, 
   12344, 
   null, 
   1061105760.0
  ], 
  [
   13466, 
   null, 
   "WarriorPoet", 
   "Your Scenerio makes no sense what so ever. It has nothing to do with being gay. Why shouldn't boy scout leaders be gay? If they sexually harass children they will be fired. Straights sexually harass children too so what point are you trying to make? Anyone who votes no is a sickenly hatefull fascist.\n\n \n \n If you can't see the correlation, then you are either stupid (I am not calling you stupid) or you are ignoring it. I believe the latter is the case.\n \n It is simple. If you allow your minor daughter to be alone with a grown man in the woods, then you are irresponsible and downright not fit for parenthood. The same is true if you allow your minor son to be alone with a gay man in the woods. There is no difference.\n \n And I am not saying all gay men are pedophiles. But the argument still stands.", 
   {}, 
   13432, 
   null, 
   1061539020.0
  ], 
  [
   13486, 
   null, 
   "rapture", 
   "I seriously doubt a boy will become a MAN in a scout ran by males that aren't men, and I personally wouldn't want my daughter around such, either. Such confusion and perversity", 
   {}, 
   13466, 
   null, 
   1061602920.0
  ], 
  [
   13504, 
   null, 
   "dsadevil", 
   "This is so ironic. Actually, most gay rights cases end up showcasing this type of irony.\n Conservatives such as rapture allege that a homosexual couldn't possible make a good scout or scoutleader. They are all wimp fairies right? Unfortunately, the very case where they make their claim (BSA v. Dale) disproves the point. The target former scout was an Eagle scout, with numerous awards and decorations, and one constantly cited as a \"model\" scout by the national office. In the gays in the military case (Steffan v. Perry), same thing. The target naval midshipman was subject to numerous decorations and awards, selected as battalion commander his senior year, ranking him as one of the top 10 ranking midshipmen in the academy. A model sailor by any stretch.\n \n The fact remains that the very cases in which conservatives have won the right to discriminate (Dale, Perry), their very targets are living contradictions of the conservative claim. Rapture, you would do well to do some research.", 
   {}, 
   13486, 
   null, 
   1061618100.0
  ], 
  [
   13508, 
   null, 
   "rapture", 
   "[Quote]\nThis is so ironic. Actually, most gay rights cases end up showcasing this type of irony.\n Conservatives such as rapture allege that a homosexual couldn't possible make a good scout or scoutleader.\n\n \n \n I said they couldn't make a MAN\n \n \n \nThe fact remains that the very cases in which conservatives have won the right to discriminate (Dale, Perry), their very targets are living contradictions of the conservative claim. Rapture, you would do well to do some research.\n\n \n \n The Roman Catholic Church?", 
   {}, 
   13504, 
   null, 
   1061619660.0
  ], 
  [
   13515, 
   null, 
   "ApathySam", 
   "I said they couldn't make a MAN\n\n \n \n Rapture, read the rest of the **** post. It's just two paragraphs. He gave two examples of gay men that were considered \"MEN\" before people found out they were gay.", 
   {}, 
   13508, 
   null, 
   1061632980.0
  ], 
  [
   13516, 
   null, 
   "ApathySam", 
   "WarriorPoet,\n \n Would you object to a male piano teacher giving private lessons to your 12-year-old daughter in his house? Math tutor? Youth group leader? Tennis instructor? Teacher? Principal? Any number of a thousand other common professions where an adult male will be left alone with pre-pubescent girls? If a parent consistently sheltered his child in this way, he'd have a pretty hard time finding anyone for whatever job he's looking to fill. I had almost exclusively female babysitters when I was a kid, yet my parents are and were certainly well \"fit for parenthood\".\n \n I can understand not wanting a male PE coach for a girls' volleyball team, or anything else that would require the girls to be in the presence of men while changing, or whatever. Boy scout leaders and camp counselors don't sit in the dormitories or cabins or tents or whatever and watch the kids change, though. I tend to put counselors in the same category as babysitters or tutors, not PE coaches.", 
   {}, 
   13466, 
   null, 
   1061633820.0
  ], 
  [
   13518, 
   null, 
   "rapture", 
   "Rapture, read the rest of the damn post. It's just two paragraphs. He gave two examples of gay men that were considered \"MEN\" before people found out they were gay.\n\n \n \n I did. Has nothing do with MASCULINITY\n \n \n \n \n \n XXXXX Scouts? Sodomy 101", 
   {}, 
   13515, 
   null, 
   1061653920.0
  ], 
  [
   13560, 
   null, 
   "WarriorPoet", 
   "Would you object to a male piano teacher giving private lessons to your 12-year-old daughter in his house? Math tutor? Youth group leader? Tennis instructor? Teacher? Principal? Any number of a thousand other common professions where an adult male will be left alone with pre-pubescent girls? \n\n \n Yes, yes, yes, yes, yes, yes, and yes a thousand times. If an adult male is left alone with a pre-pubescent (or even a teenager under 18) female, then someone is being seriously irresponsible. If you cannot see that it is a problem, then you have a serious issue. If I had a daughter, I would not leave her alone with any man other than myself or a very close relative (and I would often have a problem with that).\n \n \n\n If a parent consistently sheltered his child in this way, he'd have a pretty hard time finding anyone for whatever job he's looking to fill. I had almost exclusively female babysitters when I was a kid, yet my parents are and were certainly well \"fit for parenthood\".\n\n \n First, if you want to call keeping your child safe \"sheltering\", then I am guilty. And I am not in the least bit ashamed of it.\n \n Second, having a hard time in life because you want your child to be safe is called responsibility. It comes with being a parent. It is a shame that many people out there don't take that responsibility seriously. Maybe many more children would be alive and safe today if they did. \n \n Third, this is about MALES, not females. Males are typically more aggressive and driven by sexual desires than women. My wife and I leave my boys with a friend of the family whenever we go out. Their \"Aunt\" Marilyn takes very good care of them. However, I would not let Aunt Marilyn's husband watch my daughter (I don't have a daughter yet - just an example).\n \n \nI can understand not wanting a male PE coach for a girls' volleyball team, or anything else that would require the girls to be in the presence of men while changing, or whatever.\n\n \n At the risk of sounding like a jerk... I have to say that judging from some of your statements in this conversation, I really don't understand why you would have a problem with that. \n \n \n Boy scout leaders and camp counselors don't sit in the dormitories or cabins or tents or whatever and watch the kids change, though. I tend to put counselors in the same category as babysitters or tutors, not PE coaches.\n\n \n If they are in the woods, ALONE, how do you have any idea what they are doing???!!!\n \n I have to ask (and I am afraid of the answer I will receive), do you have children, ApathySam?", 
   {}, 
   13516, 
   null, 
   1061703540.0
  ], 
  [
   13568, 
   null, 
   "ApathySam", 
   "Yes, yes, yes, yes, yes, yes, and yes a thousand times. If an adult male is left alone with a pre-pubescent (or even a teenager under 18) female, then someone is being seriously irresponsible. If you cannot see that it is a problem, then you have a serious issue. If I had a daughter, I would not leave her alone with any man other than myself or a very close relative (and I would often have a problem with that).\n\n \n Parents leave their children with people they trust all the time, and they manage to do it without being \"seriously irresponsible.\" Someone could just as easily make a snap judgement call on that last sentence and say that anyone who would even hesitate to keep their daughter under the supervision of a very close male relative has serious issues and isn't at all mentally stable enough to give parenting a go.\n \n \n \n \n\n First, if you want to call keeping your child safe \"sheltering\", then I am guilty. And I am not in the least bit ashamed of it.\n \n\n \n Theoretically, someone's 12-year-old daughter would be \"safest\" locked in her room until her 18th birthday. She could have a workout bench and visitors three times a week, and you could slip food under her door. And, since you loved her, maybe you could let her listen to music or read a book while she's in there. \n \n No one does that to their child because that would be absolutely absurd. You can't ever have 100% safety for your child, and there has to be a line you draw (as a responsible parent) to determine when to intervene and when to back off. I think not allowing her to be watched by ANY adult males (even ones that you trust with your life) is overkill, while you think it's routine safety. That's fine; the difference is that you think people who don't follow your extreme beliefs are guilty of negligence and shouldn't be parents. That's rather arrogant.\n \n \n\n Second, having a hard time in life because you want your child to be safe is called responsibility. It comes with being a parent. It is a shame that many people out there don't take that responsibility seriously. Maybe many more children would be alive and safe today if they did.\n \n\n \n Like I said before, many more children would be alive and safe today if they were still locked in their rooms. Of course it's important to keep kids safe, and to do as much as is reasonably possible, but there's absolutely no way to achieve it perfectly. You seem to be implying that the slightest chance of harm coming to your child is reason enough to intervene in whatever given situation. In that case, don't ever drive her anywhere. Don't let her take the bus. Homeschool her. Go with her everywhere she goes. And certainly don't ever, ever let her eat red meat.\n \n \n\n Third, this is about MALES, not females. Males are typically more aggressive and driven by sexual desires than women. My wife and I leave my boys with a friend of the family whenever we go out. Their \"Aunt\" Marilyn takes very good care of them. However, I would not let Aunt Marilyn's husband watch my daughter (I don't have a daughter yet - just an example).\n \n\n \n Fine, but the examples still hold. I'm sure you could find a male violin teacher nearby who was plenty of female students, whose parents have no problem leaving their daughters in the care of this man. By your statements, CPS should come in and take all these children away, because those parents are clearly putting their children in harm's way. You have effectively narrowed the definition of a \"good parent\" to yourself and the handful of others who would hold such an extreme position. I find it a little disturbing that regardless of how trustworthy and close a friend Marilyn is, her husband would never be good enough to watch a future daughter. The aversion to a male teacher or principal threw me off, too. I'm assuming you trust your own wife completely. If you trust Marilyn enough to look after your boys, why can't you trust her enough to at least know her spouse wouldn't molest a 12-year-old girl? And how, by the way, is Marilyn ever supposed to trust you enough to ever be your friend? You could easily sexually assault her if you wanted to.\n \n Do you have a problem with leaving your boys with straight men? Say a very close relative, or Mr. Marilyn. Your original post only talked about gay men because you were drawing the parallel between a girl with a straight man. But how many cases have there been on the news involving married men abusing little boys? If we're in the business of keeping our children safe, then even allegedly straight male counselors/youth leaders/eagle scouts/piano teachers wouldn't be safe enough for a 7-year-old son. This defeats the parallel, because it's not the gender of the child versus the sexual orientation of the adult that matters; it's the gender of the adult only that matters. You're right, males are more typically aggressive, and certainly less trustworthy. But apparently you have to watch out for the straight ones too. What you're talking about are pedopheliacs, a whole different class of people than homosexuals. \n \n \n \n\n At the risk of sounding like a jerk... I have to say that judging from some of your statements in this conversation, I really don't understand why you would have a problem with that. \n \n\n \n Then I'll explain it. It's because you seem to think having a male PE coach inside the 7th-grade girls' dressing room while they shower and change is the same thing as having a male math tutor review notes with a teenage girl, while I tend to differentiate between the two. We just draw the line in two different places. You think I'd be negligent, I think you'd be extreme.\n \n Any sentence that starts off with \"At the risk of sounding like a jerk\" probably doesn't need that clarification.\n \n \n\n If they are in the woods, ALONE, how do you have any idea what they are doing???!!!\n \n\n \n How in the world do you know what ANYONE is doing to or in front of your child, ever, unless you're right there by their side at all times? How do you know a married counselor won't attack a little boy alone in the woods? If you think you've somehow achieved a state of perfect safety for your children, then you might want to share that secret with the rest of the world.\n \n \n\n I have to ask (and I am afraid of the answer I will receive), do you have children, ApathySam?\n\n \n This was needlessly insulting. I'm not a parent. I'm 21, barely a legal adult. I definitely am not yet fit to be a parent, but that's because of a level of emotional (and financial) maturity I haven't reached yet. It's not because I'd be willing to let my daughter take piano lessons from a guy. I'm still at a point where I feel like I have enough on my plate just taking care of myself without having to worry about supporting another human being -- that's why I'm not a parent.", 
   {}, 
   13560, 
   null, 
   1061720580.0
  ], 
  [
   13569, 
   null, 
   "ApathySam", 
   "I did. Has nothing do with MASCULINITY\n \n\n \n A highly decorated soldier is a good standard of masculinity.", 
   {}, 
   13518, 
   null, 
   1061720940.0
  ], 
  [
   13598, 
   null, 
   "rapture", 
   "A highly decorated soldier is a good standard of masculinity.\n\n \n \n \n Shallow?\n \n \n One should know this by now Priestly garbs don't make one Holy.", 
   {}, 
   13569, 
   null, 
   1061770200.0
  ], 
  [
   13609, 
   null, 
   "WarriorPoet", 
   "Theoretically, someone's 12-year-old daughter would be \"safest\" locked in her room until her 18th birthday. She could have a workout bench and visitors three times a week, and you could slip food under her door. And, since you loved her, maybe you could let her listen to music or read a book while she's in there.\n\n \n You are twisting my words, and you know it. That is dishonest and below you, ApathySam.\n \n \nthe difference is that you think people who don't follow your extreme beliefs are guilty of negligence and shouldn't be parents. That's rather arrogant.\n\n \n My \"extreme\" beliefs are that a parent should not leave their daughter alone with a man outside their immediate family. People can judge that for themselves. I see no need to defend that position.\n \n \nOf course it's important to keep kids safe, and to do as much as is reasonably possible, but there's absolutely no way to achieve it perfectly.\n\n \n Please quote me where I said I could achieve perfect protection for my child. \n \n Your position would put convenience before protection. \"I want my child to learn the piano, but the only time I can get Mr. Smith to teach my daughter is when I would be at work, leaving them totally alone at home. Oh well, she'll be fine.\" If you cannot see the problem with that, then I don't know what else to say. I guess I am just arrogant.\n \n \nHomeschool her.\n\n \n Don't worry, I will. Already started on the boys.\n \n \nDo you have a problem with leaving your boys with straight men?\n\n \n Here is the crux of this: I would trust my Dad, my brothers, and my best friend with my boys. Also, I know that \"Mr. Marilyn\" is not a bad person, and I have no reason to believe that he would ever harm my children. It is not a matter of him not being good enough. But why would I, for any reason other than a life or death situation, leave them alone with someone if I didn't have to? There have been so many instances where people left their children alone with someone they trusted and something happened. A few Catholic priests fit that bill perfectly. \n \n \nThis was needlessly insulting.\n\n My question was not meant as an insult. I simply wanted to guage your reaction and answer. I got pretty much what I thought I would get.\n \n \nI'm not a parent. I'm 21, barely a legal adult. I definitely am not yet fit to be a parent, but that's because of a level of emotional (and financial) maturity I haven't reached yet. It's not because I'd be willing to let my daughter take piano lessons from a guy. I'm still at a point where I feel like I have enough on my plate just taking care of myself without having to worry about supporting another human being -- that's why I'm not a parent.\n\n \n I applaud your honesty about why you do not have children. When you do reach that level of maturity, you will know of what I speak. I know I will sound like an old codger here (actually, I am only 31), but I was once as you are. I thought I had the answers on how people should raise their children. \"My children won't throw fits in the supermarket.\" \"My children will be perfect.\" \"Their children wouldn't act that if they would just do such-and-such...\" It really doesn't amount to anything until you experience it for yourself. This is not meant as an insult. I am not trying to be arrogant. It is simply truth. You just won't realize it until you are there.", 
   {}, 
   13568, 
   null, 
   1061786580.0
  ], 
  [
   17140, 
   null, 
   "sundowner", 
   "WarriorPoet: \n \n I feel sorry for your children...and as a matter of fact, I feel sorry for you and those affected by you.", 
   {}, 
   13609, 
   null, 
   1064437680.0
  ], 
  [
   17652, 
   null, 
   "Gader'el", 
   "Warrior Poet, i do see where you're coming from but your argument has flaws (again, i apologise, i have only skimmed through the posts and not read them fully). Does this mean that if you had a daughter you wouldn't want her going to school were male teachers are? The teachers could always keep her back after lesson...put her in detention...punish her...and other such shtuffs...anyway, thats all i can think of to post...feel free to jump in and reply...and shtuffs...yes. Bye.", 
   {
    "post_info": {
     "post_title": "Toodles"
    }
   }, 
   17140, 
   null, 
   1064759400.0
  ], 
  [
   68830, 
   null, 
   "pickleweaseler", 
   "Would anyone here object to your 16 year old daughter camping out with 21 year old men?\n \n How about your 16 year old son with 21 year old women?\n \n Edit: Whoa! This thread is older than I thought.", 
   {}, 
   17652, 
   null, 
   1096398600.0
  ], 
  [
   68837, 
   null, 
   "jitobear", 
   "I am a 34 year old woman with a ten year old boy. There are miriad of people I allow him to spend time with alone - my siblings, my mom, a handful of friends male and female.\n \n He also spends countless hours alone with his mentor who happens to be gay. They play ball, fish, go to movies, bike, bowl, go camping, mini-golf, work on cars, do yard work, and all kinds of activities. And I do not worry one iota. I trust this man with my life.\n \n Seems like somebody has some really weird ideas about sexuality. Adults engage in sexual activity with children for two reason. The least common is a pedaphile - somebody who is actually sexually attracted to kids. They aren't gay or straight, because being gay or straight means are into ADULTS.\n There are also people who rape/sexually abuse kids. These folks are rapists. Rape is not a sexual act - it is a violent one and the point is power and control. Perps look for easy targets, not folks they are turned on by. Most common perp - white straight men.\n \n What a RESPONSIBLE parent really ought to do, is get to know and know about the people in their kids lives before trusting them with them. The super-shelter does little to prep a kid for adulthood. In the real world there are all kinds of folks, most of them good, some of them bad. So you teach your kids to be careful. And you teach your kid how to behave in a threatening situation. And you teach and show your kid that no matter what you are there for them and they can come to you.\n \n However, barring people from your kids just because of the person's sex or sexual orientation is simply promoting misinformation and stereotypes and is removing opportunity from the life of your kid. If I had walked away from my son's mentor just because he was gay - we would have lost out on the best man I have ever known.", 
   {}, 
   68830, 
   null, 
   1096400040.0
  ], 
  [
   68878, 
   null, 
   "sinjin", 
   "I can understand the distrust of gays from someone familiar with only straight, church-going men since their proclivity for sexual abuse is legend.\n \n btw manhood has nothing to do with masculinity.", 
   {}, 
   68837, 
   null, 
   1096411620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gay men as boy scout leaders, etc.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/832-gay-men-boy-scout-leaders-etc.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 832, 
  "discussion_files": [
   [
    "8828.html", 
    "http://www.4forums.com/political/gay-rights-debates/832-gay-men-boy-scout-leaders-etc-print.html"
   ], 
   [
    "8829.html", 
    "http://www.4forums.com/political/gay-rights-debates/832-gay-men-boy-scout-leaders-etc-2-print.html"
   ]
  ], 
  "identifier": 832
 }
]