[
 [
  [
   217517, 
   null, 
   "foundit66", 
   "Bush Apologizes to L.A. Times Reporter\n By NEDRA PICKLER, Associated Press Writer\n Wed Jun 14, 8:22 PM\n \n WASHINGTON - President Bush, who often teases members of the White House press corps, apologized Wednesday after he poked fun at a reporter for wearing sunglasses without realizing they were needed for vision loss.\n \n The exchange occurred at a news conference in the Rose Garden.\n \n Bush called on Los Angeles Times reporter Peter Wallsten and asked if he was going to ask his question with his \"shades\" on.\n \n \"For the viewers, there's no sun,\" Bush said to the television cameras.\n \n But even though the sun was behind the clouds, Wallsten still needs the sunglasses because he has Stargardt's disease, a form of macular degeneration that causes progressive vision loss. The condition causes Wallsten to be sensitive to glare and even on a cloudy day, can cause pain and increase the loss of sight.\n \n Wallsten said Bush called his cell phone later in the day to apologize and tell him that he didn't know he had the disease. Wallsten said he interrupted and told the president that no apology was necessary and that he didn't feel offended since he hadn't told anyone at the White House about his condition.\n \n \"He said, `I needle you guys out of affection,'\" Wallsten said. \"I said, 'I understand that, but I don't want you to treat me any differently because of this.'\"\n \n Wallsten said the president said he would not treat him differently, so Wallsten encouraged him to \"needle away.\"\n \n \"He said, `I will. Next time I'll just use a different needle,'\" Wallsten said.\n \n Wallsten said he thought that was a pretty good line. And his only complaint is that the president didn't answer his question at the news conference.\n \n Wallsten, who is also author of a book coming out next month titled \"One Party Country: The Republican Plan for Dominance in the 21st Century,\" had asked about White House credibility now in the aftermath of top aide Karl Rove having been cleared in the CIA leak investigation. But Bush said he wouldn't comment with another top White House aide still facing prosecution in the case.", 
   {
    "post_info": {
     "post_title": "Bush Kicks Puppy After Making Fun of Blind Man..."
    }
   }, 
   null, 
   null, 
   1150519500.0
  ], 
  [
   217519, 
   null, 
   "foundit66", 
   "Okay. No puppy was kicked.\n And the comment to the reporter was obviously entirely innocent under circumstances that the President couldn't have been expected to foresee.\n \n And the \"Next time I'll just use a different needle.\" comment?\n That was actually pretty cool and witty!", 
   {}, 
   217517, 
   null, 
   1150519680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush Kicks Puppy After Making Fun of Blind Man...", 
  "url": "http://www.4forums.com/political/politics-debates/8323-bush-kicks-puppy-after-making-fun-blind-man.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 8323, 
  "discussion_files": [
   [
    "13610.html", 
    "http://www.4forums.com/political/politics-debates/8323-bush-kicks-puppy-after-making-fun-blind-man-print.html"
   ]
  ], 
  "identifier": 8323
 }
]