[
 [
  [
   217635, 
   null, 
   "Matthew S", 
   "I found this artical http://www.pridesource.com/article.shtml?article=19126\n Why is it that these conservative XXXXXX can never see the other side of things like these? Don't they realize that this law, as with the one that allows doctors not to treat people who the doctor has a moral objection too, could be used against the christians pushing for the law. If this passes then a secular adoption agency could stop placing children in evangelical christian homes using the moral objection law. A gay doctor could refuse to treat a evangelical christian. Why can they not see that this could be used against them?", 
   {
    "post_info": {
     "post_title": "Because I said so"
    }
   }, 
   null, 
   null, 
   1150638720.0
  ], 
  [
   217659, 
   null, 
   "foundit66", 
   "I found this artical http://www.pridesource.com/article.shtml?article=19126\n Why is it that these conservative XXXXXX can never see the other side of things like these? Don't they realize that this law, as with the one that allows doctors not to treat people who the doctor has a moral objection too, could be used against the christians pushing for the law. If this passes then a secular adoption agency could stop placing children in evangelical christian homes using the moral objection law. A gay doctor could refuse to treat a evangelical christian. Why can they not see that this could be used against them?\n\n \n A couple of passages come to mind.\n \n Jhn 8:7 So when they continued asking him, he lifted up himself, and said unto them, He that is without sin among you, let him first cast a stone at her.\n \n Mat 7:3 And why beholdest thou the mote that is in thy brother's eye, but considerest not the beam that is in thine own eye? \n \n Mat 7:1 Judge not, that ye be not judged.\n \n What's next?\n Being Hindu violates the first commandment. Should we legalize being able to object to people of different religions getting babies?\n After all, a Hindu probably will raise a child in their religion, just like a Christian raises their child in their religion.\n \n \n And on a separate issue, this is my favorite part of the article.\n \n \"According to Stahl, who happens to be the bill's sponsor, he's gotten letters and phone calls from agencies just quakin' in their boots over this issue, so afraid are they that the big, bad liberal State of Michigan is going to force them to place children into homes reeking of sin. Especially the homes of homos.\n \n But when asked at last week's Family and Children Services hearing to provide any proof that these complaints, in fact, exist, Stahl balked. No, he said, you can't see any proof; you're just going to have to take my word on it.\"\n http://www.pridesource.com/article.shtml?article=19126\n \n I would love to see the hearing subpoena his records.\n I wonder if he was sworn in before he gave this testimony...\n Are they thinking about refusing adoption for liars too?", 
   {}, 
   217635, 
   null, 
   1150656060.0
  ], 
  [
   217662, 
   null, 
   "Matthew S", 
   "I think it must have PCBs in the milk here in michigan in the 1970's that have turned these conservatives crazy. Just as I think there must be someting in the water in Virginia that killed too many of these conservatives brain cells.", 
   {}, 
   217659, 
   null, 
   1150659840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Because I said so", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8331-because-i-said-so.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8331, 
  "discussion_files": [
   [
    "21479.html", 
    "http://www.4forums.com/political/gay-rights-debates/8331-because-i-said-so-print.html"
   ]
  ], 
  "identifier": 8331
 }
]