[
 [
  [
   217661, 
   null, 
   "simone", 
   "This scrawny little feeble pipsqueak from Longview or Tyler, Texas (Louie Gohmert):\n \n Rep. Louie Gohmert: Let me close by saying some have not had nice things to say about our colleague Mr. Murtha, and others wanting to pull out of Iraq quickly. I understand the faithful visitation that he does routinely. So i say thank god for his big heart. I say thank god for his compassion. Thank god for his visits to the wounded. Thank god for his ministering to grieving families. But thank god he was not here and prevailed after the bloodbaths at Normandy and in the Pacific or we would be here speaking Japanese or German. Thank you.\n \n Rep. Jack Murtha: Was the gentleman at any of those locations? Either at normandy or any of those locations?\n \n Rep. Gohmert: You want to know which locations?\n \n Rep. Murtha: Yeah. Normandy?\n \n Rep. Murtha: I say were you there?\n \n Rep. Gohmert: No, sir. I wasn't.\n \n Rep. Murtha: Were you in Vietnam?\n \n Rep. Gohmert: No, sir.\n \n Rep. Murtha: Iraq?\n \n Rep. Gohmert: No. I have been over there. I haven't been fighting.\n \n Rep. Murtha: Boots on the ground?\n \n Rep. Gohmert: I do admire the gentleman's compassion and all he has done for our wounded. He has done a great service that would be you, Mr. Murtha.\n \n http://www.youtube.com/watch?v=G6nR7mgjfmE&eurl=http%3A%2F%2Famericablog%2Eblogspot%2Ecom%2F", 
   {
    "post_info": {
     "post_title": "I'm As Mad As Hell and I'm Not Taking It Anymore"
    }
   }, 
   null, 
   null, 
   1150659720.0
  ], 
  [
   217663, 
   null, 
   "Matthew S", 
   "Is it funny that the ones who rush to war are the ones who have never either served in combat or the millitary.", 
   {}, 
   217661, 
   null, 
   1150660080.0
  ], 
  [
   217677, 
   null, 
   "jyoshu", 
   "What's the point of this? It sounds like Louis Gohmert was respectful in every way of Murtha's record.", 
   {}, 
   217663, 
   null, 
   1150679220.0
  ], 
  [
   217706, 
   null, 
   "Matthew S", 
   "What's the point of this? It sounds like Louis Gohmert was respectful in every way of Murtha's record.\n\n \n \n This is respectfull? \n \n But thank god he was not here and prevailed after the bloodbaths at Normandy and in the Pacific or we would be here speaking Japanese or German. Thank you.\n\n \n To compare Iraq to Germany and Japan is just pain ignorant. His veiled attack on Murtha is typical republican bouble speak.", 
   {}, 
   217677, 
   null, 
   1150708620.0
  ], 
  [
   217719, 
   null, 
   "jyoshu", 
   "To compare Iraq to Germany and Japan is just pain ignorant. His veiled attack on Murtha is typical republican double speak.\n\n \n Sorry, I just don't see any attack on Murtha here at all. I see a guy commending him multiple times for his military service. Did you watch the clip?", 
   {}, 
   217706, 
   null, 
   1150729380.0
  ], 
  [
   217751, 
   null, 
   "simone", 
   "Jyoshu, read Gohmert's comments again VERY carefully.\n \n Gohmert commends Murtha specifically for \"the faithful visitation that he does routinely. So i say thank god for his big heart. I say thank god for his compassion. Thank god for his visits to the wounded. Thank god for his ministering to grieving families.\" Gohmert specifically does not commend Murtha for his Boots on the Ground Service in Iraq. Do you understand what the term \"Boots on the Ground\" means?\n \n Gohmert is trying to portray Murtha as a \"girlie-man\" who does the womanly thing of comforting wounded soldiers, not for what he, Murtha, has done as a soldier.\n \n Gohmert hasn't a clue about what's like to serve in combat. That's why it's so easy for a real \"girlie-man\" like Gohmert to make idiotic statements about speaking German or Japanese if Murtha had been around in that era.\n \n Do I have to explain this anymore to you?", 
   {}, 
   217719, 
   null, 
   1150743660.0
  ], 
  [
   217778, 
   null, 
   "jyoshu", 
   "Jyoshu, read Gohmert's comments again VERY carefully.\n \n Gohmert commends Murtha specifically for \"the faithful visitation that he does routinely. So i say thank god for his big heart. I say thank god for his compassion. Thank god for his visits to the wounded. Thank god for his ministering to grieving families.\" Gohmert specifically does not commend Murtha for his Boots on the Ground Service in Iraq. Do you understand what the term \"Boots on the Ground\" means?\n \n Gohmert is trying to portray Murtha as a \"girlie-man\" who does the womanly thing of comforting wounded soldiers, not for what he, Murtha, has done as a soldier.\n\n \n I think you're getting carried away. \n \n The only way to know for sure what this exchange involved completely was to have been able to see the whole thing--it looks like the clip only has the more tempestuous part, and it needs the context of the whole conversation.\n \n \nGohmert hasn't a clue about what's like to serve in combat. \n\n \n And he readily admitted he hasn't been in combat.", 
   {}, 
   217751, 
   null, 
   1150751340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I'm As Mad As Hell and I'm Not Taking It Anymore", 
  "url": "http://www.4forums.com/political/politics-debates/8335-im-mad-hell-im-not-taking-anymore.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 8335, 
  "discussion_files": [
   [
    "15856.html", 
    "http://www.4forums.com/political/politics-debates/8335-im-mad-hell-im-not-taking-anymore-print.html"
   ]
  ], 
  "identifier": 8335
 }
]