[
 [
  [
   217684, 
   null, 
   "jyoshu", 
   "A key committee of the U.S. Episcopal Church, responding to criticism from fellow Anglicans worldwide for the consecration of an openly gay bishop, approved on Saturday an expanded and more strongly worded apology for the action.\n \n The approved statement says the U.S. church expresses its \"regret for breaching the proper restraints of the bonds of affection\" with the events surrounding the 2003 convention and \"the consequences which followed.\" It offers the church's \"sincerest apology\" to those \"who are offended by our failure to accord sufficient importance ... to the impact on our church\" and asks \"forgiveness as we seek to live in deeper levels of communion one with another.\"\n http://news.yahoo.com/s/nm/20060617/us_nm/religion_episcopals_dc_3", 
   {
    "post_info": {
     "post_title": "Episcopal committee approves apology for consecrating gay Bishop"
    }
   }, 
   null, 
   null, 
   1150681020.0
  ], 
  [
   217705, 
   null, 
   "Matthew S", 
   "So the US church is aplogizing for the rest of the worlds bigotry and hatred. This is stupid. Just because the rest of the world are ignorant bigots doesn't mean the US church has to preach hatred.", 
   {}, 
   217684, 
   null, 
   1150708080.0
  ], 
  [
   217718, 
   null, 
   "Kronus", 
   "So the US church is aplogizing for the rest of the worlds bigotry and hatred. This is stupid. Just because the rest of the world are ignorant bigots doesn't mean the US church has to preach hatred.\n\n \n You gotta learn to speak politics. Unless I missed it they didn't say they were going to undo it, or promise to never to do it again. This is a delaying action, meant to quiet things down and unruffle feathers. Meanwhile they'll have a gay bishop, who with any luck will do a good job. The world won't end, God won't smite anyone, business as usual will continue. A few years down the line people, some anyway, will look back and wonder what the big to do was all about. But to get to that point they need to calm things down right now.", 
   {}, 
   217705, 
   null, 
   1150728600.0
  ], 
  [
   217774, 
   null, 
   "Steeeeve", 
   "You gotta learn to speak politics. Unless I missed it they didn't say they were going to undo it, or promise to never to do it again. This is a delaying action, meant to quiet things down and unruffle feathers. Meanwhile they'll have a gay bishop, who with any luck will do a good job. The world won't end, God won't smite anyone, business as usual will continue. A few years down the line people, some anyway, will look back and wonder what the big to do was all about. But to get to that point they need to calm things down right now.\n\n I think the problem with it is that it is a lifesytle that is against what the Bible teaches.", 
   {}, 
   217718, 
   null, 
   1150749840.0
  ], 
  [
   217776, 
   null, 
   "Kronus", 
   "I think the problem with it is that it is a lifesytle that is against what the Bible teaches.\n\n \n How does that have anything to do with anything I said?", 
   {}, 
   217774, 
   null, 
   1150750260.0
  ], 
  [
   217796, 
   null, 
   "Steeeeve", 
   "How does that have anything to do with anything I said?\n\n your post seemed to think that the church will just ignore parts of the Bible in the future just to calm things down.", 
   {}, 
   217776, 
   null, 
   1150755000.0
  ], 
  [
   217798, 
   null, 
   "Kronus", 
   "your post seemed to think that the church will just ignore parts of the Bible in the future just to calm things down.\n\n \n Alright, I guess I see what you're getting at. Yes. The church already ignores the parts of the Bible that don't make sense anymore, or doesn't take them literally. They're probably hoping that, given time, people will understand that gay bishops should fall in that category. The prohibition against gay bishops already makes no sense, they're playing for time so that people can come to realise it. At least, that's my take on what's happening here.", 
   {}, 
   217796, 
   null, 
   1150755300.0
  ], 
  [
   217813, 
   null, 
   "foundit66", 
   "your post seemed to think that the church will just ignore parts of the Bible in the future just to calm things down.\n\n Isn't this precisely what happens all the time?\n \n Bible passages endorsing slavery...\n Bible passages preaching misogyny...\n \n Heck. Just take a look at the third commandment. I have yet to meet a Christian who thinks that working on the Sabbath is a big deal.\n \n And how about the whole \"divorce\" thing? Some Christian sects have tried to stick to their guns in being more against divorce, but NONE of them have better stats than the atheists and agnostics. At best, a couple of Christian sects tie with atheists and agnostics...\n \n The church \"just ignores parts of the Bible\" all the time...", 
   {}, 
   217796, 
   null, 
   1150757520.0
  ], 
  [
   217820, 
   null, 
   "Steeeeve", 
   "Alright, I guess I see what you're getting at. Yes. The church already ignores the parts of the Bible that don't make sense anymore, or doesn't take them literally. They're probably hoping that, given time, people will understand that gay bishops should fall in that category. The prohibition against gay bishops already makes no sense, they're playing for time so that people can come to realise it. At least, that's my take on what's happening here.\n\n \n The Bible wasn't a \"change with the times\" book. It is an all or nothing document and if a church chooses to do away with that than who are they worshiping? We feel differently and so God should too? Don't think that will work ;)", 
   {}, 
   217798, 
   null, 
   1150758780.0
  ], 
  [
   217833, 
   null, 
   "Kronus", 
   "The Bible wasn't a \"change with the times\" book. It is an all or nothing document and if a church chooses to do away with that than who are they worshiping? We feel differently and so God should too? Don't think that will work ;)\n\n \n That's your interpretation. You're welcome to it, but unless you're actually God incognito don't claim that your interpretation is the only one that could possibly be correct. If a church wants to look at the Bible as, in part, a set of moral guidelines which need to be interpreted based on current understanding than that's just as valid as your stance.", 
   {}, 
   217820, 
   null, 
   1150761900.0
  ], 
  [
   217839, 
   null, 
   "MrWriteLA", 
   "WASHINGTON (Reuters) - Newly elected leader of the U.S. Episcopal Church Bishop Katharine Jefferts Schori said on Monday she believed homosexuality was no sin and homosexuals were created by God to love people of the same gender.\n \n Jefferts Schori, bishop of the Diocese of Nevada, was elected on Sunday as the first woman leader of the 2.3 million-member Episcopal Church. the U.S. branch of the worldwide Anglican Communion. She will formally take office later this year.\n \n Interviewed on CNN, Jefferts Schori was asked if it was a sin to be homosexual.\n \n \"I don't believe so. I believe that God creates us with different gifts. Each one of us comes into this world with a different collection of things that challenge us and things that give us joy and allow us to bless the world around us,\" she said. \n \n \"Some people come into this world with affections ordered toward other people of the same gender and some people come into this world with affections directed at people of the other gender.\"\n http://today.reuters.com/news/newsArticle.aspx?type=topNews&storyID=2006-06-19T193318Z_01_N19347151_RTRUKOC_0_US-RELIGION-EPISCOPALS-BISHOP.xml&archived=False", 
   {
    "post_info": {
     "post_title": "Episcopalians elect pro-gay leader"
    }
   }, 
   217833, 
   null, 
   1150762980.0
  ], 
  [
   217881, 
   null, 
   "jyoshu", 
   "Interviewed on CNN, Jefferts Schori was asked if it was a sin to be homosexual.\n \n \"I don't believe so. I believe that God creates us with different gifts. Each one of us comes into this world with a different collection of things that challenge us and things that give us joy and allow us to bless the world around us,\" she said.\n\n \n The interviewer made it too easy on her by asking her about homosexuality as a state of being. They should have been more direct about the religious belief by asking her about the behavioral aspect (which is the issue as far as the religious question is concerned). That would have really revealed her views; otherwise it doesn't really tell anything.", 
   {}, 
   217839, 
   null, 
   1150774560.0
  ], 
  [
   217970, 
   null, 
   "Kronus", 
   "The interviewer made it too easy on her by asking her about homosexuality as a state of being. They should have been more direct about the religious belief by asking her about the behavioral aspect (which is the issue as far as the religious question is concerned). That would have really revealed her views; otherwise it doesn't really tell anything.\n\n \n I don't know what the interviewer or Schori were thinking, of course, but the whole being gay vs. acting gay dichotomy isn't one that most people I know use. If you think of it as a sin than I can understand wanting to emphasize the difference between being tempted by the sin and giving in to the sin. But if you don't think there's anything wrong with being gay then you simply don't make the distinction. You're simply gay. Since Schori doesn't think it's a sin I doubt she was playing the game of thinking that being gay is fine as long as you don't act gay. I can't know that, of course, but I've only seen people who disapprove of gays make use of the doing/being distinction.", 
   {}, 
   217881, 
   null, 
   1150816740.0
  ], 
  [
   217978, 
   null, 
   "jyoshu", 
   "I don't know what the interviewer or Schori were thinking, of course, but the whole being gay vs. acting gay dichotomy isn't one that most people I know use. If you think of it as a sin than I can understand wanting to emphasize the difference between being tempted by the sin and giving in to the sin. But if you don't think there's anything wrong with being gay then you simply don't make the distinction. You're simply gay. Since Schori doesn't think it's a sin I doubt she was playing the game of thinking that being gay is fine as long as you don't act gay. I can't know that, of course, but I've only seen people who disapprove of gays make use of the doing/being distinction.\n\n \n Well, that's often the difference between people who view it as sinful and those who don't. Those who view it as sinful DO view the matter from the behavioral aspect (they often don't have an opinion either way on the state-of-being as that's not really what the Bible addresses). Those who don't emphasize it as a state of being, but don't really address the behavioral aspect. So I still feel that if the interviewer had asked her about it from the standpoint of behavior, it would have been more telling from the standpoint of what religious people consider sinful. Maybe something like \"do you believe it is a sin to engage in homosexual relations?\"", 
   {}, 
   217970, 
   null, 
   1150818240.0
  ], 
  [
   217979, 
   null, 
   "MrWriteLA", 
   " I can't know that, of course, but I've only seen people who disapprove of gays make use of the doing/being distinction.\n \n Ah, but it's the cornerstone of this \"pro-gay\" (sic) poster-in-question's arguments. He offers a second definition of ONE on-line dictionary for \"homosexual\" as unassailable proof.", 
   {}, 
   217970, 
   null, 
   1150820700.0
  ], 
  [
   217981, 
   null, 
   "jyoshu", 
   "Ah, but it's the cornerstone of this \"pro-gay\" (sic) poster-in-question's arguments. He offers a second definition of ONE on-line dictionary for \"homosexual\" as unassailable proof.\n\n \n I do??? News to me.", 
   {}, 
   217979, 
   null, 
   1150821780.0
  ], 
  [
   217982, 
   null, 
   "Steeeeve", 
   "That's your interpretation. You're welcome to it, but unless you're actually God incognito don't claim that your interpretation is the only one that could possibly be correct. If a church wants to look at the Bible as, in part, a set of moral guidelines which need to be interpreted based on current understanding than that's just as valid as your stance.\n\n \n It is pretty clear that the Bible says his Word is the final say on the matter. Like I have said before...you aren't a Christian because you want to claim yourself as one. I can't be a cat because I claim to be one. Being a Christian has certain guildlines..one of which is following the Word of God...which is very clear on this issue. It is only when you got people that go \"well...if we say this a different way we might get the result desired\" and then claim its a matter of interpretation. I don't think God will be like \"oh...you interpretated it that way? Well, I guess I understand....come on in\"...its His way or the highway, shouldn't be any \"interpreting\" in that.", 
   {}, 
   217833, 
   null, 
   1150823520.0
  ], 
  [
   217989, 
   null, 
   "Matthew S", 
   "It is pretty clear that the Bible says his Word is the final say on the matter. Like I have said before...you aren't a Christian because you want to claim yourself as one. I can't be a cat because I claim to be one. Being a Christian has certain guildlines..one of which is following the Word of God...which is very clear on this issue. It is only when you got people that go \"well...if we say this a different way we might get the result desired\" and then claim its a matter of interpretation. I don't think God will be like \"oh...you interpretated it that way? Well, I guess I understand....come on in\"...its His way or the highway, shouldn't be any \"interpreting\" in that.\n\n \n \n Oh really then what exactly is the price that you will sell your daughter for? Are you really saying that we should enforce the Levitical punishment codes? After all as you say \"...its His way or the highway, shouldn't be any \"interpreting\" in that.\"\n You can't have it both ways either the bible, all of it, is the word of God and his commands or it is not. Which is it?", 
   {}, 
   217982, 
   null, 
   1150826760.0
  ], 
  [
   217991, 
   null, 
   "Kronus", 
   "...its His way or the highway, shouldn't be any \"interpreting\" in that.\n\n \n And yet we still have upteen hundred different Christian churches, all with a slightly different take. Guess the Bible isn't quite as clear as you'ld like to think.", 
   {}, 
   217982, 
   null, 
   1150827180.0
  ], 
  [
   217994, 
   null, 
   "MrWriteLA", 
   "A scholarly and exhaustive site devoted to Biblical interpretation can be found here: http://www.bibleinterp.com/articles/Sandys-Wunsch_History_Biblical_Interp.htm\n \n An excerpt: \nThe Importance of the History of Biblical Interpretation:\n \n In the matter of biblical interpretation, if we are not to fantasize about the imperfections and the mistakes of the past, we have to take a close look at how past scholars have made sense of Holy Writ and to ask whether what they said is useful or misleading, perceptive or simply outdated. The danger is that rather than recognize the individual views of past writers, we will content ourselves with generalizations, such as \"the Enlightenment project,\" which are illegitimate means of dismissing those who in many ways were much better scholars than most of us.\n \n With the emergence of the modern Western world, the change in our view of the Bible, even among the most conservative Christians, is one of the great shifts in our culture. We no longer go to the Bible for definitive scientific information about geography, geology, animal classification, world history and chronology, astronomy, and many other areas. Whatever the Bible may say, nobody now believes the sun rotates around the Earth - score one for Galileo against the Inquisition. The only remnant of the universal validity that was attached to the Bible five hundred years ago is the last ditch stand on the factual nature of the two incompatible stories of creation in Genesis. This is rather like the resistance of some Japanese soldiers on remote Pacific islands who refused to surrender for thirty years after the end of World War II - the determination is admirable, but the cause is long lost. \n \n Some of the Major Questions Faced in Biblical Interpretation:\n [*]which books belong in the canon [*]the transmission of these books from the time of writing to the present [*]the meaning of a text to its writers and first hearers [*]the time when a biblical book was written and its historical context [*]how to translate the Bible into modern languages [*]the dating of biblical books and of the documents some of them contain [*]problems of relating the chronology and history in the Bible with records from other ancient civilizations [*]problems of scientific accuracy [*]problems of immoral actions condoned and offensive laws set out [*]problems of the discontinuities, not to mention outright contradictions within the Bible itself\n Many of these problems are not new perceptions of the past two hundred years; rather, they have always existed. For example, the problem of the accurate transmission of the actual text of a biblical book began the morning after the first scribe had a go at copying it out, probably about 1000 B.C.E. Before the New Testament was written, Jewish scholars faced many of these problems, and in the Christian Church of the first centuries, Origen (c.185-c.254) struggled with the issues of text, Jerome (c. 342-420) with the matter of translation, and Augustine (354-430) with all the improbable and worrying passages of the Old Testament. Even secular scholars got into the act, for Porphyry (c.233-301) demonstrated that the book of Daniel was written several hundred years after its nominal date.\n", 
   {
    "unicode_changes_made": true
   }, 
   217991, 
   null, 
   1150830840.0
  ], 
  [
   217995, 
   null, 
   "Steeeeve", 
   "A scholarly and exhaustive site devoted to Biblical interpretation can be found here: http://www.bibleinterp.com/articles/Sandys-Wunsch_History_Biblical_Interp.htm\n \n An excerpt:\n\n \n sounds like a real openminded guy emoticon_rolleyes\n \n \nAnd yet we still have upteen hundred different Christian churches, all with a slightly different take. Guess the Bible isn't quite as clear as you'ld like to think.\n Doesn't mean one of them isn't right ;)", 
   {}, 
   217994, 
   null, 
   1150831560.0
  ], 
  [
   217998, 
   null, 
   "Kronus", 
   "\n Doesn't mean one of them isn't right ;)\n\n \n Possibly. But like I said, unless you're really God in disguise don't tell me it's got to be yours.\n \n And what it does mean is that the Bible is not clear cut, which was my original point.", 
   {}, 
   217995, 
   null, 
   1150831980.0
  ], 
  [
   218000, 
   null, 
   "jyoshu", 
   "sounds like a real openminded guy emoticon_rolleyes\n\n \n Yep . . . yet another site of someone trying to question the validity of a spiritual text by scientific standards. Yawn. \n \n \"The only remnant of the universal validity that was attached to the Bible five hundred years ago is the last ditch stand on the factual nature of the two incompatible stories of creation in Genesis. This is rather like the resistance of some Japanese soldiers on remote Pacific islands who refused to surrender for thirty years after the end of World War II - the determination is admirable, but the cause is long lost.\"\n Apparently it's not too lost at all, given the worldwide respect and universal acceptance of the Bible among Christians (and Jews for the Torah). That doesn't mean, of course, that people don't sometimes vary on specifics.\n \n None of this is anything new. Most conservatives I know who study the Bible and it's interpretation in-depth are well aware of all this, myself included. Where they differ most is that for them, the Bible isn't just an intellectual exercise to take apart like a puzzle, but is sacred as the Word of God. And for that matter, there are competing theories on most everything that site points out.", 
   {
    "unicode_changes_made": true
   }, 
   217994, 
   null, 
   1150832040.0
  ], 
  [
   218001, 
   null, 
   "Steeeeve", 
   "Possibly. But like I said, unless you're really God in disguise don't tell me it's got to be yours.\n\n Well, I guess the point is...if one is right, you have to have a basis for determining which to follow instead of going at a whim. If you choose to honor some stuff of the Bible and not some other stuff in it than you pretty much ruled out that religion, have you not? If you haven't than what basis to you have for changing the rules? The preists surely aren't \"God in disguise\" now are they?", 
   {}, 
   217998, 
   null, 
   1150832160.0
  ], 
  [
   218006, 
   null, 
   "BobNelson2", 
   "Most conservatives I know who study the Bible and it's interpretation in-depth are well aware of all this, myself included. Where they differ most is that for them, the Bible isn't just an intellectual exercise to take apart like a puzzle, but is sacred as the Word of God. \n\n \n Gosh, you must be deeply, deeply offended by the biblical inerrancy folks. \n \n I know how you feel, though for different reasons.", 
   {}, 
   218000, 
   null, 
   1150832940.0
  ], 
  [
   218007, 
   null, 
   "Kronus", 
   "Well, I guess the point is...if one is right, you have to have a basis for determining which to follow instead of going at a whim. If you choose to honor some stuff of the Bible and not some other stuff in it than you pretty much ruled out that religion, have you not? If you haven't than what basis to you have for changing the rules? The preists surely aren't \"God in disguise\" now are they?\n\n \n Have you ever worn a poly-cotton shirt? Yes? Then you've thrown out the Bible too. Guess I'll be seeing you downstairs! emoticon_xgood \n \n The point is that you can look at the Bible as a set of unrelated instructions, all of which are supposed to be obeyed, or you can look at it as a book, the entirety of which conveys a unified message. You can believe that every word in there came straight from God, or you can believe that it was written by men who did their best to understand God. There are lots of ways to look at it, and to be blunt it's incredibly closed mined of you to say that anyone who looks at it differently than you is wrong and shouldn't call themselves Christians.", 
   {}, 
   218001, 
   null, 
   1150833240.0
  ], 
  [
   218013, 
   null, 
   "Steeeeve", 
   "Have you ever worn a poly-cotton shirt? Yes? Then you've thrown out the Bible too. Guess I'll be seeing you downstairs! emoticon_xgood \n \n The point is that you can look at the Bible as a set of unrelated instructions, all of which are supposed to be obeyed, or you can look at it as a book, the entirety of which conveys a unified message. You can believe that every word in there came straight from God, or you can believe that it was written by men who did their best to understand God. There are lots of ways to look at it, and to be blunt it's incredibly closed mined of you to say that anyone who looks at it differently than you is wrong and shouldn't call themselves Christians.\n\n \n Not look at it differently from me...look at it differently from what it says. If you get inspired by it becuase you think it has a nice fuzzy message than you really have no basis for a belief system. You can get a good feeling by reading a childrens book if you want. This is the same problem faced today with regard to the constitution....people seem to think it is just a nice document that sets out the basic goal of liberty. In reality, the document sets up a system of government in order for people to decide...for themselves...what liberties they wish to have. It is like people just ignore what is in front of them in order to achieve what their own desires. I guess my way of looking at certain things is less gratifying.", 
   {}, 
   218007, 
   null, 
   1150834620.0
  ], 
  [
   218018, 
   null, 
   "jyoshu", 
   "Gosh, you must be deeply, deeply offended by the biblical inerrancy folks. \n\n \n More so by the \"I-could-care-less-that-it's-sacred-to-you\" folks.", 
   {}, 
   218006, 
   null, 
   1150835700.0
  ], 
  [
   218025, 
   null, 
   "Kronus", 
   "Not look at it differently from me...look at it differently from what it says. \n\n \n Like I said, if you wear poly-cotton shirts, and I bet you do, then you're ignoring what it says too. The point I am clearly failing to make here is that \"what it says\" is not at all obvious. There is no clear and obvious answer to the question \"what does the Bible say?\" If there were then there wouldn't be so many different churchs. This isn't a question of people randomly picking and choosing bits they like on a whim. This is a question of people sincerely trying to do what the Bible says and coming to a different conclusion than you about what that is. For whatever reason you've decided that \"don't be gay\" is a bit of the Bible that must be followed, but you don't care about the prohibition about poly-cotton shirts. Others have lumped them both together in the \"rules that were just meant for the wandering tribes, not as rules for all people for all time\" category. They're both cases of people trying to follow the Bible, you've just disagreed on what the message is. Do you get that?", 
   {}, 
   218013, 
   null, 
   1150836300.0
  ], 
  [
   218026, 
   null, 
   "jyoshu", 
   "Not look at it differently from me...look at it differently from what it says. If you get inspired by it becuase you think it has a nice fuzzy message than you really have no basis for a belief system. You can get a good feeling by reading a childrens book if you want. This is the same problem faced today with regard to the constitution....people seem to think it is just a nice document that sets out the basic goal of liberty. In reality, the document sets up a system of government in order for people to decide...for themselves...what liberties they wish to have. It is like people just ignore what is in front of them in order to achieve what their own desires. I guess my way of looking at certain things is less gratifying.\n\n \n What's interesting to me is that people who push the post-modern interpretation that Biblical directives against homosexual behavior should be ignored ALWAYS only compare them to the obscure Leviticus-type OT examples of things like shellfish, cotton shirts, etc. They chastise others for thinking that avoiding homosexual relationships is the only correct interpretation, but then turn around and take an equally-all-or-nothing approach by thinking that completely throwing it out is the only correct interpretation. What's to say that God didn't intend it to be more like other Biblical commandments that are to be taken seriously regardless of the culture or time (NOT the \"shellfish issues\")? Particularly since both the old AND new testaments speak out againt it?\n \n And then there's those that insist the Bible 'never really' speaks out against homosexual relations. That it really means something else, or that there were translation issues (in several mulitple places!) One has to go through a LOT more hermanuetic hoops to get the Bible to condone homosexual relations than simply admit it discourages it (which it clearly does). The more honest approach for the critic here would simply be to admit and accept that the Bible says what it says about homosexuality, and disagree with it if one is so-inclined, rather than try and rewrite it or pretend it says something else. It's almost like some of them so much want the Bible to read the way they want that they'll read it that way at all costs even though it clearly says something different. I say let the moral teaching of the Bible say what it says, and let the chips fall where they may.", 
   {}, 
   218013, 
   null, 
   1150836540.0
  ], 
  [
   218027, 
   null, 
   "BobNelson2", 
   "More so by the \"I-could-care-less-that-it's-sacred-to-you\" folks.\n\n \n If things continue on their current path, you'll look back someday and really miss those folks.", 
   {}, 
   218018, 
   null, 
   1150836720.0
  ], 
  [
   218028, 
   null, 
   "Kronus", 
   "What's interesting to me ...\n\n Fascinating. However, if you only responded to things people in the actual thread actually said, rather than dragging any argument you ever heard and didn't like, things would stay a bit more focused. :)", 
   {}, 
   218026, 
   null, 
   1150836900.0
  ], 
  [
   218029, 
   null, 
   "Steeeeve", 
   "Like I said, if you wear poly-cotton shirts, and I bet you do, then you're ignoring what it says too. The point I am clearly failing to make here is that \"what it says\" is not at all obvious. There is no clear and obvious answer to the question \"what does the Bible say?\" \n Well, if you have the mindset that you want it to say something so it benefits you than it is hard to find out what it says. You argue that words pretty much have no meaning.\n \n \nIf there were then there wouldn't be so many different churchs. This isn't a question of people randomly picking and choosing bits they like on a whim. This is a question of people sincerely trying to do what the Bible says and coming to a different conclusion than you about what that is. For whatever reason you've decided that \"don't be gay\" is a bit of the Bible that must be followed, but you don't care about the prohibition about poly-cotton shirts. Others have lumped them both together in the \"rules that were just meant for the wandering tribes, not as rules for all people for all time\" category. They're both cases of people trying to follow the Bible, you've just disagreed on what the message is. Do you get that?\nmost \"different\" churches are just different ways of worship.", 
   {}, 
   218025, 
   null, 
   1150837980.0
  ], 
  [
   218031, 
   null, 
   "Kronus", 
   "Well, if you have the mindset that you want it to say something so it benefits you than it is hard to find out what it says. You argue that words pretty much have no meaning.\n\n \n So in other words you're done here. Fine, I tried.", 
   {}, 
   218029, 
   null, 
   1150838160.0
  ], 
  [
   218036, 
   null, 
   "MrWriteLA", 
   "I'm always endlessly amused at the denial capacity of Biblical literalists. You can link them to countless scholarly interpretations by unbiased linguists and cultural anthropologists, you can demonstrate that they themselves blatantly don't practice any of Leviticus' laws, you can point out that they're obviously not following the Bible by not insisting that gays be stoned to death (and by the way, the punishment for disobeying any--repeat, ANY--of the Levitical admonitions is a laundry list of ghastly repercussions, including one about \"your enemy will devour your seed\"... think I'll pass on that one), and they always react like Robby the Robot in Forbidden Planet when told to shoot a human: sparks fly in their transparent domes and they're reduced to monosyllabic blathering--if they do anything at all but retire from the field altogether--about THEIR interpretation being the only \"right\" one and the myriad others are heretical \"non-mainstream\", \"revisionistic,\" \"activist,\" \"gay agenda\" blasphemies.\n \n Impressive, I suppose, if you like special effects, but intellectually bankrupt.", 
   {}, 
   217979, 
   null, 
   1150840560.0
  ], 
  [
   218037, 
   null, 
   "jyoshu", 
   "and they always react like Robby the Robot in Forbidden Planet when told to shoot a human: sparks fly in their transparent domes and they're reduced to monosyllabic blathering\n\n \n Wow, I'd like to see that! they have sparking transparent domes as heads??? \n \n Literalism sux . . . \n \n emoticon_xclown emoticon_xangel", 
   {}, 
   218036, 
   null, 
   1150840920.0
  ], 
  [
   218038, 
   null, 
   "BobNelson2", 
   "Wow, I'd like to see that! they have sparking transparent domes as heads??? \n \n\n \n Under the big hair.", 
   {}, 
   218037, 
   null, 
   1150841220.0
  ], 
  [
   218039, 
   null, 
   "jyoshu", 
   "Under the big hair.\n\n \n The big hair is cool. An 80s retro thing (or maybe that's 60s)", 
   {}, 
   218038, 
   null, 
   1150841460.0
  ], 
  [
   218040, 
   null, 
   "Kronus", 
   "The big hair is cool. An 80s retro thing (or maybe that's 60s)\n\n \n It's only retro if you go back to doing it, and a certain irony should be employed. If you've been doing it since the 80's then it's just out of style.", 
   {}, 
   218039, 
   null, 
   1150841820.0
  ], 
  [
   218043, 
   null, 
   "BobNelson2", 
   "The big hair is cool. An 80s retro thing (or maybe that's 60s)\n\n \n Someone appears to have a bit of drag-queen sensibilities...\n \n emoticon_xgood", 
   {}, 
   218039, 
   null, 
   1150842120.0
  ], 
  [
   218046, 
   null, 
   "jyoshu", 
   "It's only retro if you go back to doing it, and a certain irony should be employed. If you've been doing it since the 80's then it's just out of style.\n\n \n Oh, ok. :) I'll ditch the mullet", 
   {}, 
   218040, 
   null, 
   1150844400.0
  ], 
  [
   218053, 
   null, 
   "Kronus", 
   "Oh, ok. :) I'll ditch the mullet\n\n \n A mullet! Ewww! Bad Jyoshu, no donut!", 
   {}, 
   218046, 
   null, 
   1150846380.0
  ], 
  [
   218056, 
   null, 
   "BobNelson2", 
   "Oh, ok. :) I'll ditch the mullet\n\n \n Oh. Correction: drag-king sensibilities", 
   {}, 
   218046, 
   null, 
   1150846860.0
  ], 
  [
   218203, 
   null, 
   "MrWriteLA", 
   "COLUMBUS, Ohio - Episcopal delegates Tuesday snubbed Anglican leaders' request to temporarily stop electing openly gay bishops, a vote that further frustrated conservatives in the American church and could hasten a break with Anglicans worldwide. \n \n The vote by the Episcopal House of Deputies came just hours before Presbyterians, at a separate meeting, approved a plan to let local congregations hire gay ministers if they wish.\n http://news.yahoo.com/s/ap/20060620/ap_on_re_us/protestants_gays_8", 
   {
    "post_info": {
     "post_title": "Episcopalians reject ban on gay bishops"
    }
   }, 
   217684, 
   null, 
   1150906320.0
  ], 
  [
   218205, 
   null, 
   "Kronus", 
   "\"Episcopal delegates Tuesday snubbed Anglican leaders' request to temporarily stop electing openly gay bishops, a vote that further frustrated conservatives in the American church and could hasten a break with Anglicans worldwide.\"\n \n This is a really tough call. They clearly want to end the bigotry against gays, which is of course a good thing. On the other hand, if they can mantian good relations with the other Anglican chuches they can continure to influence them, and maybe drag them out of their rut too. Do you compromise your beliefs now in the hope that you may be able to do a greater good later, or do you stick to your guns and deal with the fall out as best you can?", 
   {}, 
   218203, 
   null, 
   1150907160.0
  ], 
  [
   218213, 
   null, 
   "jyoshu", 
   "The American Anglicans are largely alone in this push toward electing gay bishops. Most of the Anglican community around the world is against it. And there's already been a split over it already.\n \n When a significant portion of a Christian church decides to completely ignore the scriptures, the foundation of their faith, it's not surprising that there's going to be a lot of opposition. The claim of some that it's bigotry that's at the root of the opposition may make good gay-rights-movement propaganda, but it's a poor reflection in terms of accuracy. It's like one of the conservatives pointed out in an interview I saw 3 years ago during the bishop Robinson debacle: \"The issue is really about whether this book really means what it says.\"\n \n At the heart of this, within the church, it's not really even about homosexuality. It's about how people view the Bible. Social PC-ness is at odds with what the Bible says. If the liberal Anglicans want the conservatives to leave, then if I were the conservatives, I'd leave. It's the conservative Christian groups that do the most good and flourish the most in the world anyway (The SBC for instance, has more missions efforts in the world against hunger, poverty, and other problems than any group), so they might be better off without the liberals. 'Unity' isn't always the best answer.", 
   {}, 
   218205, 
   null, 
   1150911000.0
  ], 
  [
   218234, 
   null, 
   "foundit66", 
   "The American Anglicans are largely alone in this push toward electing gay bishops. Most of the Anglican community around the world is against it. And there's already been a split over it already.\n \n When a significant portion of a Christian church decides to completely ignore the scriptures, the foundation of their faith, it's not surprising that there's going to be a lot of opposition. The claim of some that it's bigotry that's at the root of the opposition may make good gay-rights-movement propaganda, but it's a poor reflection in terms of accuracy. It's like one of the conservatives pointed out in an interview I saw 3 years ago during the bishop Robinson debacle: \"The issue is really about whether this book really means what it says.\"\n At the heart of this, within the church, it's not really even about homosexuality. It's about how people view the Bible. Social PC-ness is at odds with what the Bible says. If the liberal Anglicans want the conservatives to leave, then if I were the conservatives, I'd leave. It's the conservative Christian groups that do the most good and flourish the most in the world anyway (The SBC for instance, has more missions efforts in the world against hunger, poverty, and other problems than any group), so they might be better off without the liberals. 'Unity' isn't always the best answer.\n\n The Christian churches CURRENTLY IGNORE NUMEROUS Levitical laws with NO pretense given.\n \n This has been pointed out over and over again.\n You talk about how this is a bible regarding \"what the Bible says\".\n I can't help but wonder why this is virtually the ONLY significant battle regarding what the Bible says...\n \n Specifically, do we see any pastors having their priesthood questioned because they wear multi-fabric clothing?\n How about farmers who plant more than one type of crop in their fields? Are they being ostracized?\n \n Why the Christians to focus on this one law while ignoring COUNTLESS others is a valid point. When you have a law that you apply to ONLY one group, while ignoring other groups that transgress against that law, that IS PREJUDICE.\n \n How come the Christian church doesn't fight against HETEROSEXUAL sodomy?\n In fact, I'm amazed at how many Christians I have to EXPLAIN WHAT sodomy actually is, as they typically ignore the heterosexual sodomy...\n \n Maybe I need to include a \"robbie the robot\" comment so you can focus myopically on that one comment while ignoring everything else that is being said.", 
   {}, 
   218213, 
   null, 
   1150917420.0
  ], 
  [
   218248, 
   null, 
   "jyoshu", 
   "The Christian churches CURRENTLY IGNORE NUMEROUS Levitical laws with NO pretense given.\n\n \n There certainly is a pretense--it's that those ignored Levitical laws come out of the ceremonial law which Christians believe was abolished with the incarnation and death of Christ. Admonitions against homosexuality are considered part of the moral law, which is still there.\n \n And that doesn't even cover the fact that homosexual behavior is also discouraged in the new testament.\n \n \nThis has been pointed out over and over again.\n You talk about how this is a bible regarding \"what the Bible says\".\n I can't help but wonder why this is virtually the ONLY significant battle regarding what the Bible says...\n\n \n Because it's the predominant issue some are demanding the church change their beliefs on. But there are controversies in denominations over doctrine and interpretation all the time, on many different issues, that you probably have no idea about. This just happens to be getting a lot of press, because there's a national debate going on about it.\n \n \nSpecifically, do we see any pastors having their priesthood questioned because they wear multi-fabric clothing? How about farmers who plant more than one type of crop in their fields? Are they being ostracized?\n\n \n I answered these law examples above in my comment about ceremonial versus moral law.\n \n \nHow come the Christian church doesn't fight against HETEROSEXUAL sodomy?\n In fact, I'm amazed at how many Christians I have to EXPLAIN WHAT sodomy actually is, as they typically ignore the heterosexual sodomy...\n\n \n You have this exactly backwards. The church definitely would discourage sodomy of any kind, and have at times in the past. They discourage lots of sinful behavior. But because gay rights groups are making an issue of accepting those as priests who are into homosexual behavior, even within denominations, THIS is the issue at hand. It's not that the churches wouldn't oppose hetero sodomy, it's that hertero sodomy isn't controversial right now. If there were \"hetero-sodomy-rights\" groups demanding the church change it's views, the church certainly would be more vocal because they'd need to. Or if there were active movements within the denominations trying to get the church to allow bishops who were into hetero-sodomy, you'd certainly be hearing more about it.", 
   {}, 
   218234, 
   null, 
   1150918440.0
  ], 
  [
   218264, 
   null, 
   "Kronus", 
   "There certainly is a pretense--it's that those ignored Levitical laws come out of the ceremonial law which Christians believe was abolished with the incarnation and death of Christ. Admonitions against homosexuality are considered part of the moral law, which is still there.\n \n\n The moral law, like \"thou shall not suffer a witch to live\"? I'm pretty sure that one has been determined to be \"not good\" any more.\n \n \n\n And that doesn't even cover the fact that homosexual behavior is also discouraged in the new testament.\n \n\n Yes, but only in Paul's letters, much of which is also ignored. For example, much of the way Paul insists that women be treated has been tossed out due to being backwards and outdated.\n \n \n The point here isn't to say that the Bible says \"go be gay\". The point here is that no modern Christian actually follows all the Bible. They all pick and choose. It's hypocritical to rant about the 3-4 times the Bible says \"don't be gay\" while ignoring all the other prohibitions that don't make any sense today, like sequestering women who are having their periods or stoning people or burning witches or not planting hybrid crops. The fact is that some parts of the Bible, even the NT, simply don't apply anymore. We all know this, no one actually thinks we should follow every instruction Paul wrote down. When people insist that 4 lines be obeyed, but they themselves ignore hundreds of lines, their argument simply falls flat. Before you critisize others for picking and choosing, do a reality check and reread Paul. Alot of it isn't followed anymore, simply because it no longer makes sense. It's time for us to add this aversion to homosexuality to that list. It's a prejudice whose time has more than passed.", 
   {}, 
   218248, 
   null, 
   1150923420.0
  ], 
  [
   218265, 
   null, 
   "foundit66", 
   "There certainly is a pretense--it's that those ignored Levitical laws come out of the ceremonial law which Christians believe was abolished with the incarnation and death of Christ. Admonitions against homosexuality are considered part of the moral law, which is still there.\n\n I see.\n So if Christians create NEW standards which ARE NOT FOUND in the bible, they can explain away whatever law they please, right?\n \n I guess that's all they'll have to do for homosexuality then, eh? Just start claiming that homosexuality issues were part of \"ceremonial\" law, and that will be that...\n \n Just out of curiousity, did Jesus or Paul ever say that \"ceremonial\" laws were abolished? Did they ever state that it was okay to do away with the multi-fabric clothing restriction? Or the planting crops restrictions?\n Or is this all something that was decide much later?\n \n \n \nAnd that doesn't even cover the fact that homosexual behavior is also discouraged in the new testament.\n\n Mentioned by Paul, whose writings differ so much from Christ's that it isn't even funny...\n And do you really want to go into Paul's statements which are presently being ignored by the church?\n Like his statements AGAINST heterosexual marriage? Like his misogynistic statements against women?\n \n You would think that if it truly were such a big deal, Jesus would have mentioned it.\n He brought up divorce multiple times, and Christians have a higher divorce rate than atheists...\n \n \n \nBecause it's the predominant issue some are demanding the church change their beliefs on. But there are controversies in denominations over doctrine and interpretation all the time, on many different issues, that you probably have no idea about. This just happens to be getting a lot of press, because there's a national debate going on about it.\n\n Actually, I've talked to my Christian friends about these \"controversies\".\n Like whether or not the bread and the wine symbolizes body and blood, or whether or not it actually IS body and blood?\n \n You're trying to compare THAT type of discussion to a discussion on gays?\n Give me a break!\n \n \n \nYou have this exactly backwards. The church definitely would discourage sodomy of any kind, and have at times in the past. They discourage lots of sinful behavior.\n\n Pure b.s.\n I have YET to meet a Christian on these message boards who actually knows what \"sodomy\" means in the first place, beyond the new age representation which doesn't even include oral sex as sodomy.\n Show me ANY church discouragement of heterosexual oral sex.\n The Catholics are the ONLY christian sect I have ever take a stand on it.\n \n \n \nBut because gay rights groups are making an issue of accepting those as priests who are into homosexual behavior, even within denominations, THIS is the issue at hand.\n\n You've got a backwards way of looking at things.\n The Christian sects focus EXCLUSIVELY at expelling gays amongst their midst, and you try to pretend that the gays are responsible for the focus?\n That it's the gay rights groups that are making this \"an issue\"?\n \n Gays exist in the church.\n Heterosexual sodomy exists in the church.\n Only one of these groups has the church trying to expel them.\n \n \n \nIt's not that the churches wouldn't oppose hetero sodomy, it's that hertero sodomy isn't controversial right now.\n\n \"isn't controversial\"?\n It \"isn't controversial\" because the vast majority of Christian sects HAVE NO PROBLEM with it. It's \"not controversial\" because the christians aren't making it controversial.\n \n \n \nIf there were \"hetero-sodomy-rights\" groups demanding the church change it's views, the church certainly would be more vocal because they'd need to.\n\n Let's cut through the XXXX Jyoshu.\n SHOW ME the church's views on the subjects.\n You don't have \"hetero-sodomy-rights\" groups because \"hetero-sodomy\" IS NOT DISCRIMINATED against.", 
   {}, 
   218248, 
   null, 
   1150923660.0
  ], 
  [
   218270, 
   null, 
   "Kronus", 
   "\n Just out of curiousity, did Jesus or Paul ever say that \"ceremonial\" laws were abolished? Did they ever state that it was okay to do away with the multi-fabric clothing restriction? Or the planting crops restrictions?\n Or is this all something that was decide much later?\n \n\n \n I'll field that one, if you don't mind. Jesus said exactly the opposite. He said not one bit of the law would be done away with. And the first Christians followed the \"cerimonial\" laws. It was Paul who changed things. He realized that Christianity would never make it in Greece and Rome if followers had to cut off the tips of their penises, give up pigs knuckles and oysters, and otherwise make changes to their lifestyles. He decided that a bunch of rules simply didn't make sense and weren't needed, so he did away with them. I don't know if he specifically called them ceremonial vs moral or if those labels came later. So the fact that people insist on following the writings of a man who threw out half of Leviticus just because it wouldn't be popular is, to my mind, doubly ironic.", 
   {}, 
   218265, 
   null, 
   1150924740.0
  ], 
  [
   218275, 
   null, 
   "jyoshu", 
   "The moral law, like \"thou shall not suffer a witch to live\"? I'm pretty sure that one has been determined to be \"not good\" any more.\n\n \n Well now you're talking about punishments, not behavior according to the law. That's a whole other ballgame too--and it's what the stoning the adulteress fits into as well.\n \n \nYes, but only in Paul's letters, much of which is also ignored. For example, much of the way Paul insists that women be treated has been tossed out due to being backwards and outdated.\n\n \n Not as often as you think. The women dress very plainly in several mainline denominations, and the very refusal to let women be church leaders and preachers IS because of the very thing you are saying has been tossed out, so apparently it hasn't been so tossed out. \n \n \nThe point here isn't to say that the Bible says \"go be gay\". The point here is that no modern Christian actually follows all the Bible. They all pick and choose. It's hypocritical to rant about the 3-4 times the Bible says \"don't be gay\" while ignoring all the other prohibitions that don't make any sense today, like sequestering women who are having their periods or stoning people or burning witches or not planting hybrid crops. \n\n \n So you're arguing that churches should not obey the Bible in THIS area, on the basis that they don't obey it in certain other areas? Interesting. Do you really feel that's a compelling reason? And again, it's interesting that those who think churches should abandon the Biblical directives against homosexual behavior ONLY compare it to the parts of the law which have been abandoned. What's to say Christians should view it comparable to the parts of the law that haven't been abandoned?\n \n Either way, I think I am correct in my assertion that this issue is not so much about homosexuality specifically, as it is how churches are going to view the Bible--that was my point.\n \n \nJust out of curiousity, did Jesus or Paul ever say that \"ceremonial\" laws were abolished? Did they ever state that it was okay to do away with the multi-fabric clothing restriction? Or the planting crops restrictions? Or is this all something that was decide much later? \n\n \n Jesus Himself did this by the way he broke the Sabbath (in the eyes of the Jewish leaders). Paul also did this in the way he allowed for people to eat food set aside for idol worship. This is not a new concept--it's been a very understood part of Biblical scholarship for a very long time.\n \n \n \nMentioned by Paul, whose writings differ so much from Christ's that it isn't even funny... And do you really want to go into Paul's statements which are presently being ignored by the church? Like his statements AGAINST heterosexual marriage? Like his misogynistic statements against women?\n\n \n Whether you like it or not, Paul IS a central part of the New Testament as an apostle. You'd like to cut those epistles off onthe basis that you don't like what they say, but furtunately, you don't get to fragment the Bible for everyone else. \n \n See my comments to Kronos on Paul's teachings on women. And his statements on hetero marriage were not forbidding it--he simply said he thought it was better to stay single. But then he also said specifically that it was ok.\n \n \nActually, I've talked to my Christian friends about these \"controversies\". Like whether or not the bread and the wine symbolizes body and blood, or whether or not it actually IS body and blood? You're trying to compare THAT type of discussion to a discussion on gays? Give me a break!\n\n \n That's only ONE example. Every denomination has numerous issues that they struggle on in terms of what the Bible is saying.\n \n \n\"isn't controversial\"? It \"isn't controversial\" because the vast majority of Christian sects HAVE NO PROBLEM with it. It's \"not controversial\" because the christians aren't making it controversial.\n\n \n The point is that there are plenty of issues that go on in church meetings and denominational conventions that are areas of enormous disagreeement and struggle. It happens--it's not just this issue. You just don't hear about them because the press isn't interested in those issues.", 
   {}, 
   218264, 
   null, 
   1150925940.0
  ], 
  [
   218278, 
   null, 
   "jyoshu", 
   "I'll field that one, if you don't mind. Jesus said exactly the opposite. He said not one bit of the law would be done away with. \n\n \n In context, he said he fulfilled the law, and that all the law was summed up in the \"greatest commandment.\"", 
   {}, 
   218270, 
   null, 
   1150926060.0
  ], 
  [
   218279, 
   null, 
   "MrWriteLA", 
   "The condemnation of homogenital acts occurs in a section of Leviticus called \"The Holiness Code\". This list of laws and punishments spells out requirements for Isreal to remain \"holy\" in God's sight. What does this mean? According to Jewish belief, Israel was God's \"chosen people\" and was bound to God by a covenant, a pact. That covenant required that the Israelites not take part in the religious practices of the Canaanites, the people the Israelites had conquered. To remain separate from the Gentiles was to be \"holy\", set apart, different. So, a main concern of The Holiness Code was to keep Israel different from the Gentiles. \n \n The Canaanite religion included fertility rites according to the Hebrew testament. These ceremonies allegedly involved sexual rituals that were thought to bring blessing on the cycle of the seasons, the production of crops, the birth of livestock. Supposedly, during there was much sexual variation in these rituals. The Holiness Code prohibits all those acts and calls them all \"abominations\". This same section of The Holiness Code includes the prohibition of male homogenital acts. \n \n The point is that The Holiness Code of Leviticus prohibits male same-sex acts because of religious considerations, not because of sexual or moral ones. The concern was to keep Israel from taking part in Gentile practices. The argument in Leviticus is religious, not ethical or moral. That is to say, no thought is given to whether the sex in itself is right or wrong. All concern is for keeping Jewish identity strong. The reasons used to forbid it then have no bearing on today's discussion of homosexuality. \n http://www.geocities.com/WestHollywood/Heights/7608/levit.htm", 
   {}, 
   218278, 
   null, 
   1150926840.0
  ], 
  [
   218282, 
   null, 
   "MrWriteLA", 
   "What people believe the Bible does or doesn't \"say\" is beside the point.\n \n The Bible is so self-contradictory, so incapable of clear translation or interpretation as to be a virtual tabula rasa from which anyone can draw justification for anything from child-slaughtering to slavery to killing people for opening their drugstore on Sunday.\n \n The point is what people choose to believe it says and what reasons (justification) they have for doing so. For every interpretation that says \"gays are bad\", I can produce one that says they're not (and with much more logic, like the fact that agrarians who lived 2000+ years ago didn't know jack-sh!t about sexual orientation). So why do people choose to buy the gays are bad one and rebel against a scholarly, reasoned alternative, when it's just as viable--if not more so--and would treat a group of people more humanely?\n \n That's the real question. It's not about what the Bible says. There is no \"consensus\" on what the Bible says about homosexuality. Some people say one thing and present their reasons; other people say the opposite and present their reasons. You choose whom to believe. If you can't present cogent reasons why you choose one over the other, then that says a great deal more about you than about the Bible.", 
   {}, 
   218279, 
   null, 
   1150927440.0
  ], 
  [
   218283, 
   null, 
   "Kronus", 
   "\n So you're arguing that churches should not obey the Bible in THIS area, on the basis that they don't obey it in certain other areas? \n \n\n \n No, that isn't what I'm saying. Try to follow this, because I don't think you've ever quite gotten it when I've said it before.\n \n The argument \"You can't do that because the Bible says not to\" doesn't work if you yourself ignore some part of the Bible. If you try to present the Bible as an absolute authority, than you have to act like it's an absolute authority. You don't get to have it both ways. Either it is an absolute authority, which means you need to treat it as such, or it isn't, and so you can't cite it as something which must be obeyed. You can't say that it must all be obeyed, but only follow select bits yourself.", 
   {}, 
   218275, 
   null, 
   1150927620.0
  ], 
  [
   218285, 
   null, 
   "foundit66", 
   "In context, he said he fulfilled the law, and that all the law was summed up in the \"greatest commandment.\"\n\n Which of course is CRYSTAL clear in what it means and the boundaries of its implications, as all of Christianity typically is...\n emoticon_xgood", 
   {}, 
   218278, 
   null, 
   1150928760.0
  ], 
  [
   218286, 
   null, 
   "Kronus", 
   "\n Not as often as you think. The women dress very plainly in several mainline denominations, and the very refusal to let women be church leaders and preachers IS because of the very thing you are saying has been tossed out, so apparently it hasn't been so tossed out. \n \n\n \n You don't actually know anyting about what Paul said about women, do you? :) \n Or were you just ignoring all the stuff which proves you wrong?\n \n They have to keep their heads covered when they pray and they aren't to speak in church. These are very clear and specific instructions, and I don't know a single church which doesn't allow women to talk. It's a stupid rule, and so it's ignored, even though it's in the Bible! No one, no one, actually treats the Bible as an absolute authority. Everyone filters it through common sense first, and discards clear specific instructions which don't make sense anymore. And given that fact, there is no justification for saying that you must or must not do something just becasue it's in the Bible. If you don't follow it yourself than don't cite it as if you do.", 
   {}, 
   218275, 
   null, 
   1150928940.0
  ], 
  [
   218295, 
   null, 
   "jyoshu", 
   "No, that isn't what I'm saying. Try to follow this, because I don't think you've ever quite gotten it when I've said it before.\n\n \n Now, now, I know exactly WHAT you're saying. I just think it's beside the point.\n \n \nThe argument \"You can't do that because the Bible says not to\" doesn't work if you yourself ignore some part of the Bible. If you try to present the Bible as an absolute authority, than you have to act like it's an absolute authority. You don't get to have it both ways. Either it is an absolute authority, which means you need to treat it as such, or it isn't, and so you can't cite it as something which must be obeyed. You can't say that it must all be obeyed, but only follow select bits yourself.\n\n \n Apparently it does work for them, given that that most denominations hold to the view that homosexual behavior is wrong. But I'm not interested in arguing in the direction you're wanting to take things here because I'm not going to sit here and defend a premise I didn't make. The point I made was that for the people in the Anglican church, it's not about homosexuality. It's about whether they are going to do what the Bible says (from their POV of what it says). The fact there's inconsistency in the things they obey from it in OTHER areas (which is about all your point substantially is) is beside the point.\n \n \nYou don't actually know anyting about what Paul said about women, do you?\n\n \n You've been doing so well arguing honestly and civily lately--don't blow it all now!\n \n \nThey have to keep their heads covered when they pray and they aren't to speak in church.\n\n \n I agree with you about the covering the heads in church thing; churches should be consistent on that. But many churches don't allow women to speak in front of the church, which is what that's talking about. Surely you didn't think it meant they were supposed to be mute inside the church building . . . . did you?\n \n \nIf you don't follow it yourself than don't cite it as if you do.\n\n \n Again, that's something you'll have to take up with conservative Anglicans.", 
   {}, 
   218283, 
   null, 
   1150931340.0
  ], 
  [
   218298, 
   null, 
   "jyoshu", 
   "What people believe the Bible does or doesn't \"say\" is beside the point.\n\n \n Wonder how they decide WHAT to believe? \n \n (hint: they go by what they read in it)", 
   {}, 
   218282, 
   null, 
   1150931580.0
  ], 
  [
   218300, 
   null, 
   "Kronus", 
   "Now, now, I know exactly WHAT you're saying. I just think it's beside the point.\n\n Based on your response you clearly don't understand what I'm saying. Ah well...\n \n \n\n You've been doing so well arguing honestly and civily lately--don't blow it all now!\n\n It was a legitimate question, and fully justified based on your response. You really don't seem to have more than a passing knowledge of the Bible, despite being such a fan.\n \n \n\n But many churches don't allow women to speak in front of the church, which is what that's talking about. \n\n No it wasn't. Women were not meant to participate in the church in any way what so ever, it's quite clear. He wasn't saying no female priests, he was saying that women should show up and shut up, and if they have any issues bring them up with their husbands when they get home. And what's this about \"many\" churches? If the Bible is so clear and authoritative, why isn't it all of them?\n \n \n\n Again, that's something you'll have to take up with conservative Anglicans.\n\n No, I'll take it up with you as long as you cite the Bible as a reason why people should do certain things.", 
   {}, 
   218295, 
   null, 
   1150932060.0
  ], 
  [
   218303, 
   null, 
   "foundit66", 
   "Wonder how they decide WHAT to believe? \n (hint: they go by what they read in it)\n\n \n Don't you mean \"what they read INTO it\"?\n \n I asked: Just out of curiousity, did Jesus or Paul ever say that \"ceremonial\" laws were abolished? Did they ever state that it was okay to do away with the multi-fabric clothing restriction? Or the planting crops restrictions?\n Or is this all something that was decide much later?\n \n You gave a response to a response to that question saying: \"In context, he said he fulfilled the law, and that all the law was summed up in the \"greatest commandment.\"\"\n \n Would you mind quoting those passages and translating, in unambiguous terms, what it means?\n Or can you admit that there exists a GOOD PORTION of Levitical laws which are ignored based on completely arbitrary claimed interpretations...", 
   {}, 
   218298, 
   null, 
   1150933080.0
  ], 
  [
   218456, 
   null, 
   "BobNelson2", 
   "None of the really old versions of Christianity believe in biblical literalism and being \"born again\". It's a new plague... pardon me, invention. The \"traditionalists\" are actually outside tradition.", 
   {}, 
   218303, 
   null, 
   1150957500.0
  ], 
  [
   218457, 
   null, 
   "BobNelson2", 
   "It's about whether they are going to do what the Bible says (from their POV of what it says). The fact there's inconsistency in the things they obey from it in OTHER areas (which is about all your point substantially is) is beside the point.\n\n \n Will a couple lines in Hebrew cleanliness laws overrule much of the message of Jesus? That's the question.", 
   {}, 
   218295, 
   null, 
   1150957620.0
  ], 
  [
   218458, 
   null, 
   "BobNelson2", 
   "At the heart of this, within the church, it's not really even about homosexuality. It's about how people view the Bible. Social PC-ness is at odds with what the Bible says. \n\n \n It's really more New Testament vs. Old Testament. \"Social PC-ness\" is quite a bit younger than this debate.", 
   {}, 
   218213, 
   null, 
   1150957740.0
  ], 
  [
   218467, 
   null, 
   "Matthew S", 
   "Well, I guess the point is...if one is right, you have to have a basis for determining which to follow instead of going at a whim. If you choose to honor some stuff of the Bible and not some other stuff in it than you pretty much ruled out that religion, have you not? If you haven't than what basis to you have for changing the rules? The preists surely aren't \"God in disguise\" now are they?\n\n \n \n I assume you are christian? Do you follow everything in the bible? I guess you better get stoning of your neighbors going then for working on sunday and wearing blended fabric. Oh yes I do take offense that you want to kill gay people since you believe that you can't ignor some parts of the bible. You are then comanded to kill gay people, prostitutes, and smartmouthed children.", 
   {}, 
   218001, 
   null, 
   1150982100.0
  ], 
  [
   218469, 
   null, 
   "Kronus", 
   "\n Surely you didn't think it meant they were supposed to be mute inside the church building . . . . did you?\n \n\n \n Sorry for the delay on this one, I don't carry a concordance around with me.\n \n Now, what does it actually say? Let's see.\n \n 1 Cor 14:34\n Let your women keep silence in the churches: for it is not permitted unto them to speak; but [they are commanded] to be under obedience, as also saith the law.\n \n So what I think it means is irrelevant, right Jyoshu? If we go with your assertion, we're supposed to only care about what it says. And it does, in fact, say that women should be mute in church. Now, based on your question, you find this to be a silly rule, to say the very least. None the less, it's in the Bible. So what's it going to be Jyoshu? Will you use your own common sense and judgement and decide that this rule has no place anymore, or will you stick to the Bible regardless of whatever else your brain might be telling you, because \"picking and choosing\" is wrong? Does the Bible, in fact, mean what it says? Or should people of good will be able to say, \"That's just dumb, there's no reason for that anymore.\"?", 
   {}, 
   218295, 
   null, 
   1150987620.0
  ], 
  [
   218471, 
   null, 
   "jyoshu", 
   " Now, what does it actually say? Let's see. 1 Cor 14:34\n Let your women keep silence in the churches: for it is not permitted unto them to speak; but [they are commanded] to be under obedience, as also saith the law.\"\n\n \n Ah, I see where you're problem is here. You have to take more than one verse rather than taking one verse out of context. Verses 29-33 up to that point are talking about preaching. It's not talking about casual conversation and being mute. Those verses are talking about speaking (in front of the church), and then YOUR verse 34 is also talking about speaking (or rather NOT speaking), but in this directed about the women. If you take the comment in context with what Paul was talking about leading up to that it's clear he's talking about women in the context of preaching. The whole passage is about speaking and not speaking in front of the church. This is a common thing I notice when people try to use the Bible against evangelical views--they pick and choose one verse here and there with complete disregard for the context of the broader passage. Believe it or not, you aren't likely to bring anything new to mainline Biblical studies--it's been going on for a VERY long time by and done VERY thoroughly by Christians. Context is an important factor in Biblical studies. For someone who chastises others for not knowing much about the Bible (implying that you are in a knowledgeable position to make that judgement), it's interesting you didn't even realize the scope of the entire passage.\n \n In the same vein, interestingly, the context the Bible usually puts homosexual activities in (particularly in the NT) is sexual promiscuity and lewdness.\n \n \nSo what I think it means is irrelevant, right Jyoshu? If we go with your assertion, we're supposed to only care about what it says.\n\n \n And what it says is quite clear--unless you're taking verses right out of context to fit what you want it to say, as you did above. \n \n \nNo, I'll take it up with you as long as you cite the Bible as a reason why people should do certain things.\n\n \n Then I'll keep pointing out the fact that you're barking up the wrong tree, unless you're prepared to show where I've cited the Bible as a reason. All I've done is point out the thinking on the part of conservative evangelicals. Your beef is with them.\n \n \nNone of the really old versions of Christianity believe in biblical literalism and being \"born again\". \n\n \n You mean conversion? Coming to the point where one believes in faith in Christ?\n \n You do know that's all \"born again\" means, don't you?\n \n I suppose now you'll be arguing that the Ethiopian didn't really at that point believe in faith in Christ (Conversion! Born again!)--even though it clearly says right there in Acts that he did. Or that the thief on the cross didn't 'convert' at the end. I'd sat those are pretty \"old versions\" of Christianity.", 
   {}, 
   218469, 
   null, 
   1150989780.0
  ], 
  [
   218477, 
   null, 
   "Kronus", 
   "Ah, I see where you're problem is here. You have to take more than one verse rather than taking one verse out of context. Verses 29-33 up to that point are talking about preaching. It's not taking about casual conversation and being mute. Those verses are talking about speaking (in front of the church), and then YOUR verse 34 is also talking about speaking (or rather NOT speaking), but in this case about the women. \n\n Since that is clearly not the case, 29-33 being about prophecy, I\"ll assume you're just punting. And given the nature of your point, I think it's safe to assume that you did, in fact, understand my point, even if you won't admit it publicly. So I'll just let it percolate; we can come back to this later after you've thought about it some more.", 
   {}, 
   218471, 
   null, 
   1150993380.0
  ], 
  [
   218480, 
   null, 
   "jyoshu", 
   "Since that is clearly not the case, 29-33 being about prophecy, I\"ll assume you're just punting. And given the nature of your point, I think it's safe to assume that you did, in fact, understand my point, even if you won't admit it publicly. So I'll just let it percolate; we can come back to this later after you've thought about it some more.\n\n \n Of course I understood your point, I already told you I did. Prophecy, by the way, is an interchangeable term with preaching in the NT Biblical context. The point here is that speaking publically is the common denominator issue in this passage, NOT women be kept from conversation inside the church building. Therefore, by context, it's obvious that Paul is forbidding women to speak out in front of everyone. (which a lot of churches follow) Note the consistent terms in bold before, during, and after the one verse you pulled out:\n Let two or three prophets speak, and let the others weigh what is said. If a revelation is made to another sitting there, let the first be silent. For you can all prophesy one by one, so that all may learn and all be encouraged, and the spirits of prophets are subject to prophets. For God is not a God of confusion but of peace. As in all the churches of the saints, the women should keep silent in the churches. For they are not permitted to speak, but should be in submission, as the Law also says. If there is anything they desire to learn, let them ask their husbands at home. For it is shameful for a woman to speak in church. Or was it from you that the word of God came? Or are you the only ones it has reached? If anyone thinks that he is a prophet\n So, now that we have that issue of Biblical interpretation out of the way, I think the conservative Anglicans simply hate to see the church abandon what they believe the Bible clearly states, in terms of homosexual behavior. Obviously, some contemporary interpretation has tried to re-interpret those passages to be about other things, such as emphasizing the \"offender\" term in 1 Cor 6 of the phrase \"homosexual offender\", while de-emphasizing the \"homosexual\" term. Or assuming Romans 1:27 refers to temple prostitution (when there's absolutely no mention of it in the passage).\n \n However, it is also important to note that Christ was the first to recognize 'sexual outcasts' as worthy of God's kingdom. In Christ, there is departure from hating the homosexual, or the law directing one's prejudices. In Christ, one would care for the homosexual even while disapproving of his or her actions. Two extremes are usually taken in viewing Christ on this--one is is the more liberal view that ALL concerns and objections about homosexual behavior are thrown out as if Christ didn't still forbid sin or expect people to keep the spirit of the law. (This, I believe, is what people are about when they throw Christ up as teaching something different than objection toward homosexual behavior.) The other extreme (sometimes taken by fundies) is to assume Christ would condone prejudices against homosexuals, ignoring the fact that Christ loved the sinner, ate and drank with them, and set them free from the stoning pharisees. \n \n So the balance is somewhere in between. I think it's too much to expect conservative Anglicans to just roll over and accept that their church is abandoning a pretty obvious and historically accepted Biblical view. And at the same time, the Christian message should never go without the understanding and point that Christians should love and care for ALL people, gays included. But then Christ also told the sinner, once the pharisees departed, to \"go and sin no more.\" So loving people doesn't mean we have to refuse objection to their actions if we feel they are wrong.", 
   {}, 
   218477, 
   null, 
   1150996440.0
  ], 
  [
   218483, 
   null, 
   "Kronus", 
   "\n So, now that we have that issue of Biblical interpretation out of the way,...\n\n \n When he said this, he actually meant that, and this bit really is a reference to that bit over there, and this whole part has to be taken in the context of this other thing...\n \n Whew, glad we got that out of the way!\n \n Like I said, let it percolate and we'll come back to it when you're ready. emoticon_xgood", 
   {}, 
   218480, 
   null, 
   1150998600.0
  ], 
  [
   218486, 
   null, 
   "jyoshu", 
   "When he said this, he actually meant that, and this bit really is a reference to that bit over there, and this whole part has to be taken in the context of this other thing...\n \n Whew, glad we got that out of the way!\n \n Like I said, let it percolate and we'll come back to it when you're ready. emoticon_xgood\n\n \n Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that context shows that the passage was about speaking in front of people\" and moving on back to the issues on the religious treatment of homosexual behavior that I addressed as well would have been so much more respectable. Believe it or not, it's OK to concede a point every now and then in these fora when you're proven wrong as in this case. There's no shame in it. It was even on a side-point.", 
   {}, 
   218483, 
   null, 
   1150999440.0
  ], 
  [
   218498, 
   null, 
   "foundit66", 
   "Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that context shows that the passage was about speaking in front of people\" and moving on back to the issues on the religious treatment of homosexual behavior that I addressed as well would have been so much more respectable. Believe it or not, it's OK to concede a point every now and then in these fora when you're proven wrong as in this case. There's no shame in it. It was even on a side-point.\n\n Man-oh-man-oh-man-oh-man Jyoshu. emoticon_xdonno \n You are NOT one to try and set a standard on *a person \"didn't address my points\"* =< *that person is saying \"I concede...\"*\n \n I mean, if you REALLY want to do that, I'll be happy to take you up on it.\n But somehow, I don't think you want to.\n For example, in this thread I have tried to limit my response to get you to respond to a specific question and not get side-tracked with other comments I could make. But that just left you with one point that you \"didn't address\".\n Are you saying that you concede my point on that question then?\n \n And of course, the irony is that if you \"don't address\" this post...", 
   {}, 
   218486, 
   null, 
   1151002800.0
  ], 
  [
   218500, 
   null, 
   "foundit66", 
   "1Timothy 2:11 Let the woman learn in silence with all subjection. \n 1Ti 2:12 But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. \n 1Ti 2:13 For Adam was first formed, then Eve. \n 1Ti 2:14 And Adam was not deceived, but the woman being deceived was in the transgression. \n 1Ti 2:15 Notwithstanding she shall be saved in childbearing, if they continue in faith and charity and holiness with sobriety. \n \n I think these bible verses have to be my favorite on the issue Bible misogyny. They just demonstrate a variety of misogynistic ideals, all in one compact section.\n And if Jyoshu wants to show how they are in any way isolated to just the church, I would welcome it.\n \n Especially since the last verse discusses \"childbearing\".\n Were they asking that women give birth as part of the Sabbath Sermon?\n \n And regardless, the misogyny continues today. I've been to a few of my Christian friends' weddings, and I've noticed how some of them specify that the wife is promising to be subordinate to her husband, who they proclaim to be head of the house-hold.\n Modern day Christian misogyny...", 
   {}, 
   218498, 
   null, 
   1151003280.0
  ], 
  [
   218502, 
   null, 
   "BobNelson2", 
   "Ah, I see where you're problem is here. You have to take more than one verse rather than taking one verse out of context. Verses 29-33 up to that point are talking about preaching. It's not talking about casual conversation and being mute. Those verses are talking about speaking (in front of the church), and then YOUR verse 34 is also talking about speaking (or rather NOT speaking), but in this directed about the women. If you take the comment in context with what Paul was talking about leading up to that it's clear he's talking about women in the context of preaching. The whole passage is about speaking and not speaking in front of the church. \n\n \n Yet almost all Christian denominations allow women to serve at least as lectors. Many even allow women to be pastors. Bishops, even. Ah, the heresy!!!\n \n \nContext is an important factor in Biblical studies.\n\n \n Coming from you, on this board, that's quite a stunner.\n \n \nIn the same vein, interestingly, the context the Bible usually puts homosexual activities in (particularly in the NT) is sexual promiscuity and lewdness.\n\n \n \"Homosexual actitivies\" were put into the relevant passages by English-speaking translators of the Bible within the last two decades. The meaning of what is in the original Greek (\"original\", that is) is unknown to us. The word used is odd, uncommon, and not used to describe homosexuality in contemporary texts. And this is where context comes in. Paul wrote within the context of a society in which homosexuality was commonly practiced. It wasn't just tolerated, it was CELEBRATED. There were many words to describe various homosexual relationships and practices. NONE OF THOSE were used. Was Paul being obtuse on purpose? Hardly seems likely. \n \n So, does the Bible condemn homosexuality along with promiscuity and lewdness or does it condemn one form of homosexual promiscuity or lewdness along with promiscuity and lewdness in general, using a word whose exact meaning is lost to us today? Within the \"context\", which is more likely? Which is more intellectually honest?\n \n Context does matter. And, to my thinking, IF people are going to use a 2000-old-book to condemn fellow human beings, now understood to be naturally what they are, it is their DUTY to be absolutely certain they're right. \n \n Furthermore, homosexuality was not condemned by the church for over a thousand years. What's up with that??? \n \n I guess those folks just didn't understand what Paul \"really meant\". \n \n \n \nYou mean conversion? Coming to the point where one believes in faith in Christ?\n\n \n If all it means is \"conversion\" to Christianity, why do so many evangelicals seek to convert those who are already Christian???\n \n Odd. (kind dishonest, too, if you ask me)", 
   {}, 
   218471, 
   null, 
   1151004180.0
  ], 
  [
   218503, 
   null, 
   "BobNelson2", 
   "As a side note, I'm sure that women find it deeply comforting that they're actually allowed to speak by God as long as it isn't in front of anybody.\n \n Probably makes 'em feel all warm and fuzzy (assuming they're allowed to feel that way).\n \n emoticon_xdonno", 
   {}, 
   218502, 
   null, 
   1151004360.0
  ], 
  [
   218511, 
   null, 
   "jyoshu", 
   "1Timothy 2:11 Let the woman learn in silence with all subjection. \n 1Ti 2:12 But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. \n 1Ti 2:13 For Adam was first formed, then Eve. \n 1Ti 2:14 And Adam was not deceived, but the woman being deceived was in the transgression. \n 1Ti 2:15 Notwithstanding she shall be saved in childbearing, if they continue in faith and charity and holiness with sobriety. \n \n I think these bible verses have to be my favorite on the issue Bible misogyny. They just demonstrate a variety of misogynistic ideals, all in one compact section.\n And if Jyoshu wants to show how they are in any way isolated to just the church, I would welcome it.\n \n Especially since the last verse discusses \"childbearing\".\n Were they asking that women give birth as part of the Sabbath Sermon?\n \n And regardless, the misogyny continues today. I've been to a few of my Christian friends' weddings, and I've noticed how some of them specify that the wife is promising to be subordinate to her husband, who they proclaim to be head of the house-hold.\n Modern day Christian misogyny...\n\n \n \nAs a side note, I'm sure that women find it deeply conforting that they're actually allowed to speak by God as long as it isn't in front of anybody.Probably makes 'em feel all warm and fuzzy (assuming they're allowed to feel that way).\n\n \n Look, I'm not going to argue with you and play this strawman game of yours on whether the Bible is patriarchal and women are subjected to more 'rules.' ('Misogyny', as you call it) Make whatever judgement calls on Christians you think are appropriate regarding that. I never said that wasn't the case about Christianity. I was taking issue with Kronos on a specific verse he brought up. The root issue here isn't women speaking, but rather Biblical interpretation in general.\n \n I'm sure you'd love Christianity to completely avoid the use of the Bible for what it says and just let whatever social acceptance hot-button issue of the day determine the way they read the Bible. I suspect however, there's always going to be an orthodox remnant out there.\n \n \n\"Homosexual actitivies\" were put into the relevant passages by English-speaking translators of the Bible within the last two decades.\n\n \n well of course--the terminology of \"homosexual\" for that behavior wasn't even widespreadly used until this century. King James, and all the pre20th century English Bibles didn't have that term. Doesn't mean they didn't know about the fact that some people engaged in sexual relations with people of the same gender and that it was wrong. Just because that term wasn't there, doesn't mean that's not what the Bible was talking about. \n \n \nPaul wrote within the context of a society in which homosexuality was commonly practiced. It wasn't just tolerated, it was CELEBRATED. There were many words to describe various homosexual relationships and practices. NONE OF THOSE were used. Was Paul being obtuse on purpose? Hardly seems likely.\n\n \n Um, no--let's be clear here: pedarasty was celebrated. (I'm going to assume you understand the difference.) For much different reasons than physical attraction, BTW. The 'homosexuality' you are a part of today is a different matter altogether than the pedarasty of that time--at that time of the world it was a cultural phenomenon; they were no different in their human hormonal make-up than we are--there's no reason to assume the percentage of gays in the population was any higher then than it is now. So obviously it was a cultural phenomenon and not one of attraction (other than the under-10% of people that WERE gay). \n \n Now, since Paul didn't directly address pedarasty (according to your way of seeing scripture), am I to assume you think going back to a pedarastic culture is ok? Because the way you're wanting Christians to interpret scripture (going on what Paul DIDN'T say) would logically lead to that, on your part. \n \n Now I don't know why Paul didn't specifically directly address the pedarasty in the culture--maybe it was because by that time it was already in decline from the height of the hellenistic culture, or because the Christian churches he wrote to didn't do it given that they weren't greek pagan any longer. Some would definitely say pedarasty IS condemned by these verses. But when it comes to homosexual practices (not just cultural pedarasty) I'm not sure what other evidence you could possibly need other than \"men consumed with passion for one another\" and commiting shameless acts with men\" as is stated in Romans 1. He may not have used any specific term for homosexuality, but good grief, it's not like what he said isn't pretty darn straightforward, even if you still DO think homosexuality was a widespread cultural pehenomenon.", 
   {}, 
   218500, 
   null, 
   1151009400.0
  ], 
  [
   218516, 
   null, 
   "foundit66", 
   "Look, I'm not going to argue with you and play this strawman game of yours on whether the Bible is patriarchal and women are subjected to more 'rules.' ('Misogyny', as you call it) Make whatever judgement calls on Christians you think are appropriate regarding that. I never said that wasn't the case about Christianity.\n\n Uh. Gee.\n And I never claimed you said that about Christianity.\n \n No strawman argument was made Jyoshu.\n If you can't or won't debate the issue, that's fine.\n \n \n \nI was taking issue with Kronos on a specific verse he brought up. The root issue here isn't women speaking, but rather Biblical interpretation in general.\n\n And this IS ALONG that line of thought...\n \n Specifically, how the Bible specifically advocates a specific treatment of women that is usually abandoned by modern day Christianity.\n \n Does modern day Christianity demand that women not be teachers? No.\n Does modern Christianity preach that women are to be saved in childbearing? No.\n \n \n \nI'm sure you'd love Christianity to completely avoid the use of the Bible for what it says and just let whatever social acceptance hot-button issue of the day determine the way they read the Bible. I suspect however, there's always going to be an orthodox remnant out there.\n\n Gee. NOW who is arguing Strawman...\n \n Jyoshu, I DO NOT CARE what fairy tales Christians want to follow. I don't care how outdated they choose to live THEIR lives.\n The important thing is that THEY are choosing it for THEIR lives and not enforcing it upon the rest of us who don't follow their religious practices", 
   {}, 
   218511, 
   null, 
   1151011080.0
  ], 
  [
   218646, 
   null, 
   "BobNelson2", 
   "Look, I'm not going to argue with you and play this strawman game of yours on whether the Bible is patriarchal and women are subjected to more 'rules.' ('Misogyny', as you call it) Make whatever judgement calls on Christians you think are appropriate regarding that. I never said that wasn't the case about Christianity. I was taking issue with Kronos on a specific verse he brought up. The root issue here isn't women speaking, but rather Biblical interpretation in general.\n\n \n The \"strawman game\", erh, strawwoman in this case, was yours and Kronus'. I just chimed in. That said, I think it's quite on point. Christianity's varied interpretations of the role of women based on the teachings of the bible, literal and non-literal, bear remarkable similarity to any arguments about how it should treat gay people. Plenty of Christians used and USE quotes just like the one you were discussing in order to impose on half of humanity a set of restrictions that aren't just called \"mysogyny\" (a word I didn't use by the way), they ARE mysogyny. Other people repudiate that view and used and use the same religion to free half of humanity.\n \n \n \nUm, no--let's be clear here: pedarasty was celebrated. (I'm going to assume you understand the difference.) For much different reasons than physical attraction, BTW. The 'homosexuality' you are a part of today is a different matter altogether than the pedarasty of that time--at that time of the world it was a cultural phenomenon; they were no different in their human hormonal make-up than we are--there's no reason to assume the percentage of gays in the population was any higher then than it is now. So obviously it was a cultural phenomenon and not one of attraction (other than the under-10% of people that WERE gay). \n\n \n Um, no. Pederasty was a phenomenon, but it was not the only expression of homosexuality, nor was it the most common. It was an upperclass tradition. the upperclass was small. And there's plenty of reason to assume that homosexual behavior (that thing you object to) was far more common than 10%. Even in THIS culture, with all its proscriptions against same-sex behavior, 25-35% of males engage in at least some homosexual conduct. Females even more. If it were EXPECTED or encourages, of course it would be even more common. And even if it weren't, I'd much rather live in a culture without all the XXXX I've had to put up with.\n \n \n \n I'm not going to even bother replying to all the rest of your post except to say that you are avoiding what I see as a moral obligation to honestly assess \"what the bible says\". You're also obscuring the real history of the Greek and Roman culture within which Christianity arose. And you are ignoring the liguistic challenge of understanding a biblical quote that means something but does not mean \"homosexuality\" and does not mean \"burning with lust for each other\". And, lastly, you are refusing to address Christianity's thousand-year tolerance of homosexuality.\n \n I'm sure you'll say I haven't proven any of these things. Of course I haven't and I'm not going to try. You've already read about them here dozens of times over the years. The way I see it, your religion obligates you to inform yourself before continuing to bear (false) witness. I can't make you care enough to check it out in a serious effort to understand.", 
   {}, 
   218511, 
   null, 
   1151040360.0
  ], 
  [
   218693, 
   null, 
   "jyoshu", 
   " Christianity's varied interpretations of the role of women based on the teachings of the bible, literal and non-literal, bear remarkable similarity to any arguments about how it should treat gay people. Plenty of Christians used and USE quotes just like the one you were discussing in order to impose on half of humanity a set of restrictions that aren't just called \"mysogyny\" (a word I didn't use by the way), they ARE mysogyny. Other people repudiate that view and used and use the same religion to free half of humanity.\n\n \n From a non-religious view, looking at it from the outside, I can see why you'd perceive it as mysogyny. The only thing I can say really is that I'd talk to some people who go to churches like this and see what their take on it is, if you want to get a fair assessment. The thing is, what it really boils down to is the the NT world viewed the roles of men and women very differently. For the Bible it wasn't (and isn't) an issue of worth, which often seems to be the religion critic's take on it. In fact, if that culture's view of women was mysogyny, then Christianity was a liberating influence in that area.\n \n \nUm, no. Pederasty was a phenomenon, but it was not the only expression of homosexuality, nor was it the most common.\n\n \n I didn't say it was the only expression, but it was at least AS publically common, and was NOT limited to the upperclass. It was very common. If you want I'll be glad to point you to some sources that make that clear.\n \n \nAnd there's plenty of reason to assume that homosexual behavior (that thing you object to) was far more common than 10%. \n\n \n I think I made clear that it was more common that the less-than-10%; that's because it was a cultural phenomenon and not an issue of attraction.\n \n \nEven in THIS culture, with all its proscriptions against same-sex behavior, 25-35% of males engage in at least some homosexual conduct. Females even more.\n\n \n LOL!!!! Maybe in the circles you run around with, Bob. Or is it that your idea of \"homosexual conduct\" is awfully open-ended to the point where you can include pretty much whatever you want even if attraction is not an issue. Let me guess: you're taking into account everything from hugs to slaps on the tush in a football game.\n \n Let's cut the XXXX here (to use a 'Foundit-ism'). On one hand you emphasize homosexuality as an inborn attraction, but when it's convenient for you you suddenly shift to muddying the waters with cultural phenomenon of greek culture (or some vague comment about 25-35% homosexual conduct in out culture) that had NOTHING to do with attraction or sexual orientation. Most of them weren't gay, Bob!! And even if your wishful-thinking-on-your-part figure for our time were true, it wouldn't prove anything.\n \n \nI'm not going to even bother replying to all the rest of your post \n\n \n Looks like you DID.\n \n \nexcept to say that you are avoiding what I see as a moral obligation to honestly assess \"what the bible says\". \n\n \n Bob, Christians spend their lives honestly assessing what the Bible says. The real problem here is that you don't like the fact they come to different conclusions than you.\n \n \nYou're also obscuring the real history of the Greek and Roman culture within which Christianity arose.\n\n \n And you're overemphasizing it. Why do you think it would matter to this discussion if homosexuality were around every corner and every other person's pastime? I already told you, Paul was darn clear about it in Romans. it doesn't get any clearer than that. The frequency of gay sex doesn't change what he wrote.\n \n \nAnd you are ignoring the liguistic challenge of understanding a biblical quote that means something but does not mean \"homosexuality\" and does not mean \"burning with lust for each other\". \n\n \n Gee, I guess when it doesn't read the way you want it to, always fall back on the minority position re. the translation, huh, since THAT one fits what you want it to say. Regarding 'men having relations with men and having lust (or passion) for ea other', Every reputable modern translation translates it that way from the greek. (from the earliest manuscripts we have, NOT from other english Bibles, or the Vulgate.) Including translations that 'conservatives' don't really like. Are you telling me you think you know more about greek translation than majority of greek experts who have do this all their lives?? heck I'm no expert, but I've had 2 years of Biblical greek studies myself. It means what it's translated as.\n \n \nAnd, lastly, you are refusing to address Christianity's thousand-year tolerance of homosexuality.\n\n \n This is one of the more flabergasting claims I read here from time to time. Christian history is largely silent about homosexuality in their writings. They were silent about a lot of things in their writings--it doesn't mean they \"tolerated\" them. That's not the same as tolerance. What it means is that it wasn't a big enough problem in culture for the church to respond in writing. It means that your pride movement is a relatively recent phenomenon in any significant sense. \n \n \nThe way I see it, your religion obligates you to inform yourself before continuing to bear (false) witness. I can't make you care enough to check it out in a serious effort to understand.\n\n \n When your only standard of \"serious effort\" is accepting YOUR conclusions instead of possibly coming to other conclusions, it's meaningless. Not to mention downright arrogant of you.", 
   {}, 
   218646, 
   null, 
   1151079840.0
  ], 
  [
   218734, 
   null, 
   "BobNelson2", 
   "Not to mention downright arrogant of you.\n\n \n You know what's arrogant? Ignoring years of discussion with every post. Starting over at square one with every post. Pretending not to have learned a blessed thing with every post.\n \n You, jyoshu, are a tabula rasa with every fricken post.\n \n You many get brownie points for keeping the XXXXXX engaged or something. Or maybe you pat yourself on the back for keeping up your side of the \"debate\". But someday you'll look back on this endless dishonesty and feel shame.\n \n I've had enough of it. I'm taking a jyoshu-vacation.", 
   {}, 
   218693, 
   null, 
   1151089500.0
  ], 
  [
   218747, 
   null, 
   "jyoshu", 
   "I've had enough of it. I'm taking a jyoshu-vacation.\n\n \n I hear Tahiti is very nice this time of year.", 
   {}, 
   218734, 
   null, 
   1151090700.0
  ], 
  [
   218784, 
   null, 
   "tonybrown74", 
   "\n \n I've had enough of it. I'm taking a jyoshu-vacation.\n\n \n It'll do wonders for your sanity.\n \n Trust me!", 
   {}, 
   218734, 
   null, 
   1151104980.0
  ], 
  [
   218800, 
   null, 
   "robbie0517", 
   "Why argue that the bible doesn't say women should be silent in church but rather don't speak in front of church? As if that's somehow better. They're both equally disgusting. \n Really, do christians ever just use common sense? Does anyone really believe this stuff about \"it's not you they object to, its your behavior?\" Ok, so God made me gay but doesn't want me to act on it. He justs wants all of the gay people to live a life of sufferage? (more than we already do) Common sense is not a sin is it? Does anyone really believe the world populated from 2 people? \n Any half minded person can see how most christians pick and choose. When they are called out on it, it's about context. When homosexuals or others try to put the references to homosexuals in context they are twisting the bible to fit their agenda. \n Any free thinking person (by that I mean not sheep) can see all this for what it is. Evangelicals don't fight to keeps gays in their place, they fight because they don't want their bigotry exposed to all of society. It's about their future, not ours.", 
   {}, 
   218784, 
   null, 
   1151113020.0
  ], 
  [
   218851, 
   null, 
   "jyoshu", 
   "It'll do wonders for your sanity.\n \n Trust me!\n\n \n Shhh . . listen. You hear that? Tahiti is calling you too. emoticon_xangel", 
   {}, 
   218784, 
   null, 
   1151175660.0
  ], 
  [
   218853, 
   null, 
   "jyoshu", 
   "Why argue that the bible doesn't say women should be silent in church but rather don't speak in front of church? As if that's somehow better. They're both equally disgusting. \n\n \n That may be, but this was not a discussion in terms of a value-judgement of these views, at least until Bob tried to hijack things by focusing more on the example that what it exemplfied. This was about Biblical interpretation in terms of gay marriage. \n \n \nReally, do christians ever just use common sense? Does anyone really believe this stuff about \"it's not you they object to, its your behavior?\"\n\n \n Whether or not you believe has no bearing on whether or not it's really true. Do you hate alcoholics every time you think that drinking too much liquor is a bad thing? Surely you can understand the difference between objecting to actions and making value judgements on people.\n \n I suspect the real reason you are determined to not see the difference here is that you WANT to think of Christians in the worst possible light you can, because of the value judgements YOU make on them. (In other words, you hate them.) I hope I'm wrong.", 
   {}, 
   218800, 
   null, 
   1151176560.0
  ], 
  [
   218870, 
   null, 
   "foundit66", 
   "Whether or not you believe has no bearing on whether or not it's really true. Do you hate alcoholics every time you think that drinking too much liquor is a bad thing? Surely you can understand the difference between objecting to actions and making value judgements on people.\n\n \n We've been down this road before Jyoshu. And it's a dead end for you.\n \n Does the Florida law prohibit people who have sex with others of the same gender from adopting?\n Or does it prohibit gays from adopting, and their sexual activity is actually irrelevant?\n \n Does the military exclude only people who have sex with people of the same gender?\n Or do they prohibit all gays regardless of whether or not they know of any sexual activity?\n \n When a bigot fires a gay person, is it typically because he was busted having sex?\n Or is it just because they found out he was gay, and the sexual activity is irrelevant?\n \n The argument you pose is like a cop claiming he doesn't like blacks who listen to rap and drive fancy cars. But then he pulls over blacks who drive simple cars listening to classical music as well.\n \n The actual actions of the prejudice speak louder than your claims.\n \n And feel free to ignore this Jyoshu, as your own statements have admitted that will be a sign that you concede my point...", 
   {}, 
   218853, 
   null, 
   1151184660.0
  ], 
  [
   218883, 
   null, 
   "jyoshu", 
   "Does the Florida law prohibit people who have sex with others of the same gender from adopting? Or does it prohibit gays from adopting, and their sexual activity is actually irrelevant?\n \n Does the military exclude only people who have sex with people of the same gender?\n Or do they prohibit all gays regardless of whether or not they know of any sexual activity?\n \n When a bigot fires a gay person, is it typically because he was busted having sex?\n Or is it just because they found out he was gay, and the sexual activity is irrelevant?\n\n \n All of these examples are different than what we're talking about. I'm talking about people having the moral view that engaging in gay behavior is wrong. The fact that you're using these examples only indicates that you still conflate these two separate issues. There is not a single example you just gave that I don't agree with you on. But I still believe that gay romantic relationships are morally wrong. You see, your examples are about bigotry (a seaprate matter), not moral belief. Sure . . . you like to muddy the two as if they are the same, because it's better for your movement's objectives to do that. But it's a dead end.\n \n \nAnd feel free to ignore this Jyoshu, as your own statements have admitted that will be a sign that you concede my point...\n\n \n Ignoring your posts will never be a concession on my part. The times I've ignored them in the past is because you've been proven wrong and continue on as if you haven't. I don't mind you feeding your need to always get the last word in, if it makes you feel better. emoticon_xangel", 
   {}, 
   218870, 
   null, 
   1151187900.0
  ], 
  [
   218888, 
   null, 
   "foundit66", 
   "All of these examples are different than what we're talking about.\n\n They are examples of the things that people fight for to discriminate against gays.\n How can you say that people are just against gay \"behavior\" when the truth is blatantly obvious?\n \n \n \nI'm talking about people having the moral view that engaging in gay behavior is wrong.\n\n I realize they have that view.\n My point is that it goes BEYOND that view.\n \n It's an excuse, much like people talking about how they hate it when people \"act\" black, and then they hate ALL blacks, including the doctors and lawyers and engineers...\n \n \n \nThe fact that you're using these examples only indicates that you still conflate these two separate issues. There is not a single example you just gave that I don't agree with you on. But I still believe that gay romantic relationships are morally wrong. You see, your examples are about bigotry (a seaprate matter), not moral belief.\n\n Haven't we been down this boring road before?\n Bigotry typically claims to be formed on \"MORAL BELIEF\".\n It may not be YOUR moral belief, but it IS the moral belief of a LOT of people who are anti-gay.\n \n So don't pretend to extrapolate your \"support\" for gay rights and how you \"feel\" about the situation onto all the other people who DON'T support gay rights.\n \n \n \nIgnoring your posts will never be a concession on my part. The times I've ignored them in the past is because you've been proven wrong and continue on as if you haven't. I don't mind you feeding your need to always get the last word in, if it makes you feel better. emoticon_xangel\n\n < yawn < Jyoshu.\n Dishonest to the end, aren't you...\n A lot of these times they are issues that you HAVEN'T EVEN BROACHED.\n \n You acted cocky, and you got lambasted with your own words.\n It's what happens when you come from such a dishonest position...\n \n If you want to go back and look at ANY of these issues you claim you have \"proven\" me \"wrong\", I'm game.\n But I know you aren't.\n The others reading this KNOW you aren't.\n \n So just who in the heck do you REALLY think you're kidding?", 
   {}, 
   218883, 
   null, 
   1151191320.0
  ], 
  [
   218890, 
   null, 
   "jyoshu", 
   "I realize they have that view.\n My point is that it goes BEYOND that view.\n\n \n For some, maybe. Not for all. Either way, there's a difference between moral belief and bigotry.\n \n \nIt's an excuse, much like people talking about how they hate it when people \"act\" black, and then they hate ALL blacks, including the doctors and lawyers and engineers...\n\n \n \nHaven't we been down this boring road before?\n Bigotry typically claims to be formed on \"MORAL BELIEF\".\n It may not be YOUR moral belief, but it IS the moral belief of a LOT of people who are anti-gay.\n\n \n And bigotry is NOT the moral belief of MANY people as well.\n \n \nSo don't pretend to extrapolate your \"support\" for gay rights and how you \"feel\" about the situation onto all the other people who DON'T support gay rights.\n\n \n I'd say the same to you--don't extrapolate how YOU feel about these people onto all others who don't support gay rights. If I'm \"extrapolating\", you're doing the same thing by assuming it's bigotry. Unless you're willing to simply concede the truth that for many, it's not about bigotry.\n \n \nIf you want to go back and look at ANY of these issues you claim you have \"proven\" me \"wrong\", I'm game. But I know you aren't. The others reading this KNOW you aren't.\n\n \n Yawn. Yeah, yeah, yeah, what ev. You can quit pounding your chest now. FWIW, I'm willing to do that any time. Most instances where you think you \"won\" are probably where you've not argued honestly.", 
   {}, 
   218888, 
   null, 
   1151192880.0
  ], 
  [
   218900, 
   null, 
   "foundit66", 
   "For some, maybe. Not for all. Either way, there's a difference between moral belief and bigotry.\n\n I am well aware of that...\n \n \n \nAnd bigotry is NOT the moral belief of MANY people as well.\n\n That's not what I said, but it's not surprising to see your dishonesty in full swing attempting to distort what I said.\n Man people CLAIM their bigotry on homosexuality is a \"moral belief\"...\n \n \n \nI'd say the same to you--don't extrapolate how YOU feel about these people onto all others who don't support gay rights. If I'm \"extrapolating\", you're doing the same thing by assuming it's bigotry. Unless you're willing to simply concede the truth that for many, it's not about bigotry.\n\n I have explicitly given you the means by which I define bigotry.\n A desire to discriminate against gay...\n \n What YOU did is take YOUR position that YOU hold, and then pretend that it was a unilateral position for the many.\n I did nothing of the sort. I'm talking about REAL people who have espoused a desire to discriminate against gays.\n \n \n \nYawn. Yeah, yeah, yeah, what ev. You can quit pounding your chest now.\n\n You're a hoot, but in a sad hypocritical way.\n I was only using the tactic that YOU USED EARLIER against you...\n \n \n \nFWIW, I'm willing to do that any time. Most instances where you think you \"won\" are probably where you've not argued honestly.\n\n And predictably, you've started to try to turn accusations of \"honesty\" against others...\n When it is you who is being dishonest.\n \n There are a variety of threads that this can be continued on.\n Like the \"Gay Macy's Dummy\" thread where you claimed the presence of a gay dummy was a \"social statement\". I asked you what the \"social statement\" was, and you avoided the question. I never saw you answer it.\n \n Or how about the \"Marriage and crime\" thread where you claimed the author wasn't trying to link gay marriage to crime...\n \n Or how about the \"Judging the Judges...\" thread where you dishonestly tried to obfuscate the issue by saying the examples weren't relevant because of juries, when only one of the examples, out of many, was a jury?\n \n Three should be enough to start with, eh?\n Oh. And you better be prepared to show where I was \"dishonest\" in those threads...\n ... or it would be you who would be the liar then...", 
   {}, 
   218890, 
   null, 
   1151201760.0
  ], 
  [
   218915, 
   null, 
   "robbie0517", 
   "Whether or not you believe has no bearing on whether or not it's really true. Do you hate alcoholics every time you think that drinking too much liquor is a bad thing? Surely you can understand the difference between objecting to actions and making value judgements on people.\n \n I suspect the real reason you are determined to not see the difference here is that you WANT to think of Christians in the worst possible light you can, because of the value judgements YOU make on them. (In other words, you hate them.) I hope I'm wrong.\n\n \n Alchoholism is a disease, homosexuality is not. \n Do you see the difference? \n \n Homosexuality is innate and can not be changed. Wether you believe this or not doesn't change that it is fact. One that experts have all agreed upon and a fact that some so-called religious people ignore. \n \n If a person is intolerant of a person or group due to something they have no more control over than skin color, this is bigotry. Wether you see it this way or not this is the case. History will clearly put this in the proper light. Actually, it already is. This is truely what worries religious bigots the most. Notice I said religous bigots, meaning not all people of faith, there is a difference that I do recognize. The religious bigot is the one who ignores parts of the Bible that do not fit their lifestyle then enforce other parts that fit their bigotry. \n \n I do not hate anyone. I do not hate Christians. If I did, I would hate most of my family and friends. What I do hate are the actions of Christians when they intentionally choose to inflict harm on a group of people because of who they are, what God made them. All while blatently dismissing other parts of the Bible. \n \n Saying that they don't disapprove of the homosexual only the actions of the homosexual is like saying I don't hate blacks only the color of their skin. See how stupid that sounds.", 
   {}, 
   218853, 
   null, 
   1151214780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Episcopal committee approves apology for consecrating gay Bishop", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8337, 
  "discussion_files": [
   [
    "27640.html", 
    "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop-print.html"
   ], 
   [
    "27641.html", 
    "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop-7-print.html"
   ], 
   [
    "27642.html", 
    "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop-5-print.html"
   ], 
   [
    "27643.html", 
    "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop-4-print.html"
   ], 
   [
    "27644.html", 
    "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop-6-print.html"
   ], 
   [
    "27645.html", 
    "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop-3-print.html"
   ], 
   [
    "27646.html", 
    "http://www.4forums.com/political/gay-rights-debates/8337-episcopal-committee-approves-apology-consecrating-gay-bishop-2-print.html"
   ]
  ], 
  "identifier": 8337
 }
]