[
 [
  [
   218210, 
   null, 
   "RiFo", 
   "That's the meat of their foreign policy. Condy seems to dislike routine work. Look what's going on in Iraq. That's real mess with no perspective of bettering things in the visible future. We owe this to America. \n Now they are trying to act kind of mediators in Abkhazia and Georgia dispute. LOL Do we need one more Iraq in the region of vital EU interests? \n Well, Americans have already held their \"master class\" in the region in Georgia! Saakashvili is Bush's pet and he's having American financial funding and all that. Still Georgia is lying in poverty and is being involved in drugs+arms traffic. There is widespread corruption there and some fishy links with terrorists. I've read in the web American diplomats and special services are no strangers to some of those things and ignoring lots of negative events in Georgia.\n Mind Georgia is positioning itself as part of Europe! It means European agencies should not just keep an eye on Georgia but delve into all the challenges she faces. We must be helpful and we are! \n Relating America... Let'em rather make order in Iraq!!", 
   {
    "post_info": {
     "post_title": "Americans are here and there living off the fat of the lands!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1150909320.0
  ], 
  [
   218222, 
   null, 
   "Steeeeve", 
   "let me guess....you are from Europe and have been listening to the anti-American press.\n \n While some of what you said may be true (although it would still be the pot calling the kettle black) the fact that you just trust everything anti-american negates all of your points.", 
   {}, 
   218210, 
   null, 
   1150914420.0
  ], 
  [
   218317, 
   null, 
   "dugman_74", 
   "emoticon_confused \n \n Please raise your hand if you understood the post.", 
   {}, 
   218210, 
   null, 
   1150935840.0
  ], 
  [
   218353, 
   null, 
   "Phunting", 
   "let me guess....you are from Europe and have been listening to the anti-American press.\nIs this worse than being from America and listening to the anti-Europe press?", 
   {}, 
   218222, 
   null, 
   1150942500.0
  ], 
  [
   218354, 
   null, 
   "dugman_74", 
   "Is this worse than being from America and listening to the anti-Europe press?\n\n \n There is an anti-Europe press?", 
   {}, 
   218353, 
   null, 
   1150942560.0
  ], 
  [
   218479, 
   null, 
   "Jo Bennett", 
   "There is an anti-Europe press?\n\n \n There doesn't need to be, you've got an anti-european government to go with it. \"cheese eating surrenders monkies\" anyone? Freedom fries?", 
   {}, 
   218354, 
   null, 
   1150996320.0
  ], 
  [
   218493, 
   null, 
   "daewoo", 
   "There doesn't need to be, you've got an anti-european government to go with it. \"cheese eating surrenders monkies\" anyone? Freedom fries?\n\n \n They get especially upset if the cheese eating surrender monkeys turn out to be right.", 
   {}, 
   218479, 
   null, 
   1151001000.0
  ], 
  [
   218571, 
   null, 
   "dugman_74", 
   "There doesn't need to be, you've got an anti-european government to go with it. \"cheese eating surrenders monkies\" anyone? Freedom fries?\n\n \n Yeah, how close was france to surrendering to the muslim kids?", 
   {}, 
   218479, 
   null, 
   1151022420.0
  ], 
  [
   218622, 
   null, 
   "Phunting", 
   "There is an anti-Europe press?\nErr yes. The slating France and other countries got in the press for daring to actually do what they though was right and not what the US/UK thought was right...", 
   {}, 
   218354, 
   null, 
   1151030820.0
  ], 
  [
   218676, 
   null, 
   "Scactha", 
   "There is an anti-Europe press?\n\n Pick up almost any issue of The Economist or Newsweek and read an article on a comparison of EU vs US economy. Despite the Petro-Dollar alimony system where everyobody else is helping the US finance it's economy through the printing press it's always the same \"USA r00lz, EU suxx0rz!\" articles. However many times the UN reports that it is NOT the land of opportunity, whatever the propaganda says, it's the same tired spiel. Welfarestates in Europe gives people better chances to get off but are ridiculed in the face off the everyman to himself egoconomy making the US have the most poor on the streets. Kofi Annan even lamented this fact in a comment a few months back.", 
   {
    "unicode_changes_made": true
   }, 
   218354, 
   null, 
   1151064180.0
  ], 
  [
   218772, 
   null, 
   "Ripskar", 
   "Region of \"Vital European Intrests\", Georgia???\n Intresting use of the term...\n How far down the list of Europe's intrests do you have to go before you come to Georgia?\n As I recall the curvature of bananas was higher on the list of priorities!", 
   {}, 
   218676, 
   null, 
   1151099520.0
  ], 
  [
   218799, 
   null, 
   "Rovdak", 
   "Pick up almost any issue of The Economist or Newsweek and read an article on a comparison of EU vs US economy. Despite the Petro-Dollar alimony system where everyobody else is helping the US finance it's economy through the printing press it's always the same \"USA r00lz, EU suxx0rz!\" articles. However many times the UN reports that it is NOT the land of opportunity, whatever the propaganda says, it's the same tired spiel. Welfarestates in Europe gives people better chances to get off but are ridiculed in the face off the everyman to himself egoconomy making the US have the most poor on the streets. Kofi Annan even lamented this fact in a comment a few months back.\n\n \n Well it has to be said that the economist published this report", 
   {
    "unicode_changes_made": true
   }, 
   218676, 
   null, 
   1151111940.0
  ], 
  [
   218801, 
   null, 
   "daewoo", 
   "Well it has to be said that the economist published this report\n\n \n Very interesting piece. The autor did miss one importnat item and that is the fact that we changed the way we calculated productivity in the early 80's. It was apparent to Reagan that our crumbiling industrial infrastructure woudlno longer support providing numbers that would make the public happy,so he changed the way those numbers were calculated. It used to be that productivity had a work output component. Now it does not, it is strictly economic \"output\". What this means is that we can get away with calling marking up cheap foreign goods \"productivity\". 90% of the excess productivity since 2000 has been the result not of greater industrial or material output, but simply the result of marking up cheap foreign goods. \n \n This also explains the gap and the crunch on the middle class. After all, how many people do you need, and how good do they have to be, to mark up chinese junk?", 
   {}, 
   218799, 
   null, 
   1151113620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Americans are here and there living off the fat of the lands!", 
  "url": "http://www.4forums.com/political/european-politics-economics/8354-americans-here-there-living-off-fat-lands.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 8354, 
  "discussion_files": [
   [
    "1905.html", 
    "http://www.4forums.com/political/european-politics-economics/8354-americans-here-there-living-off-fat-lands-print.html"
   ]
  ], 
  "identifier": 8354
 }
]