[
 [
  [
   218355, 
   null, 
   "dugman_74", 
   "http://abcnews.go.com/International/story?id=2094224&CMP=OTC-RSSFeeds0312\n \n ABC News is looking for stories from everyday folks about the impacts of global warming on our lives. \n \n Here is what they are looking for: \n \"We want to hear and see your stories. Have you noticed changes in your own backyard or hometown? The differences can be large or small - altered blooming schedules, unusual animals that have arrived in your community, higher water levels encroaching on your property.\"\n \n So altered blooming schedules are signs of global warming? Or is this another unscientific scare tactic of the left?", 
   {
    "post_info": {
     "post_title": "Nope, they aren't using scare tactics...."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1150942980.0
  ], 
  [
   218478, 
   null, 
   "Jo Bennett", 
   "so anyone who disagrees with you is now on \"the left\"? A piece of news for you, ultra right wing Margaret Thatcher was one of the first world leaders to talk seriously about climate change.\n \n It's not a question of being signs of global warming, as if they were someone trying to prove that climate change was occurring by anecdote, it's merely a case of trying to humanise an issue that is abstract and not well undertood by many people. The fact remains that the vast majority of scientists competent in this area of study believe climate change is occurring and significantly impacted by human activity.", 
   {}, 
   218355, 
   null, 
   1150996260.0
  ], 
  [
   218485, 
   null, 
   "jyoshu", 
   "I for one, would be fine with accepting that global warming by human causes is a very real issue if it's conclusively proven. The problem is that it hasn't been conclusivenly proven, although that may indeed happen. This issue is an unfortunate case of politics being an influence on BOTH sides of the issue. \n \n A recent article gives some more credence to the possibility of global warming by human causes: (http://www.cnn.com/2006/TECH/science/06/22/global.warming.ap/index.html)\n \"The National Academy of Sciences, reaching that conclusion in a broad review of scientific work requested by Congress, reported Thursday that the \"recent warmth is unprecedented for at least the last 400 years and potentially the last several millennia.\"\n \n However, it does point out that \"of or all but the most recent 150 years, the academy scientists relied on \"proxy\" evidence from tree rings, corals, glaciers and ice cores, cave deposits, ocean and lake sediments, boreholes and other sources. They also examined indirect records such as paintings of glaciers in the Alps.\" So for everything up until the last 150 years, they have no direct data. Interestingly, they put the end of the \"little ice age\" at 1850, and refer to the 20th century as the spike upwards. I wonder if they thought about the fact that their date for the spike in heating increase happens to be about the time they claim to have real data to rely on . . . :)\n \n Oh, and FWIW, while Margaret Thatcher was conservative, she was certainly not of the \"ultra right wing\".", 
   {}, 
   218478, 
   null, 
   1150999380.0
  ], 
  [
   218487, 
   null, 
   "Jo Bennett", 
   "She practically declared war on the working class, shifted taxation from progressive taxes to regressive ones, set union recognition back a century, gutted healthcare and education spending, legislated to hobble student activism, brought in Section 28 of the local government act which declared that gay people had \"pretended family relationships\". Unemployment topped 3 million, with more hidden by incapacity benefit, because Thatcher bought the far right freidmannite rubbish about controlling the money supply. Areas of northern england remain derelict to this day because of her.", 
   {}, 
   218485, 
   null, 
   1151000040.0
  ], 
  [
   218542, 
   null, 
   "Ripskar", 
   "Sounds like an attempt to copy BBC's Springwatch which has collected data on several spring events over the past few years. \n http://www.bbc.co.uk/nature/animals/wildbritain/springwatch/\n The results of the study are here;\n http://www.phenology.org.uk/standard/home/introduction/swresultsindex.htm\n On the side issue of Thatcherism, she was a harridan who should have been strangled at birth, but at least we aren't at the mercy of the Unions like the French and Spanish.", 
   {}, 
   218487, 
   null, 
   1151018520.0
  ], 
  [
   218557, 
   null, 
   "Jo Bennett", 
   "I'd rather be at the mercy of the unions than the CBI, at least union leaders are elected.", 
   {}, 
   218542, 
   null, 
   1151020800.0
  ], 
  [
   218584, 
   null, 
   "dugman_74", 
   "so anyone who disagrees with you is now on \"the left\"? A piece of news for you, ultra right wing Margaret Thatcher was one of the first world leaders to talk seriously about climate change.\n \n It's not a question of being signs of global warming, as if they were someone trying to prove that climate change was occurring by anecdote, it's merely a case of trying to humanise an issue that is abstract and not well undertood by many people. The fact remains that the vast majority of scientists competent in this area of study believe climate change is occurring and significantly impacted by human activity.\n\n \n Actually, I was talking about our left wing media using scare tactics. I couldn't give a XXXX about Thatcher if I tried. \n You mention that it is not well understood. Tell me how misleading people is going to make them understand?", 
   {}, 
   218478, 
   null, 
   1151024280.0
  ], 
  [
   218743, 
   null, 
   "DrNo", 
   "http://abcnews.go.com/International/story?id=2094224&CMP=OTC-RSSFeeds0312\n \n ABC News is looking for stories from everyday folks about the impacts of global warming on our lives. \n \n Here is what they are looking for: \n \"We want to hear and see your stories. Have you noticed changes in your own backyard or hometown? The differences can be large or small - altered blooming schedules, unusual animals that have arrived in your community, higher water levels encroaching on your property.\"\n \n So altered blooming schedules are signs of global warming? Or is this another unscientific scare tactic of the left?\n\n \n I'm going to write them a letter that says I saw a sabre-toothed tiger in my backyard.", 
   {
    "unicode_changes_made": true
   }, 
   218355, 
   null, 
   1151090160.0
  ], 
  [
   218744, 
   null, 
   "DrNo", 
   "Now ABC is asking any crackpot off the street to submit their story and they are going to pass this off as news? I thought Dan Rather was bad, but this is pathetic. Today's media is a joke.", 
   {
    "post_info": {
     "post_title": "When did journalists quit?"
    }
   }, 
   218743, 
   null, 
   1151090280.0
  ], 
  [
   218783, 
   null, 
   "Ripskar", 
   "I'd rather be at the mercy of the unions than the CBI, at least union leaders are elected.\n\n Union leaders like Scargill and Prescott?\n You're too young to remember how bad life was when the unions went on strike. The demise of socialism was too high a price though. \n \n At least we haven't gone to the American extreme where everyone seems to tow the company line.", 
   {}, 
   218557, 
   null, 
   1151104800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Nope, they aren't using scare tactics....", 
  "url": "http://www.4forums.com/political/environmental-debates/8359-nope-they-arent-using-scare-tactics.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 8359, 
  "discussion_files": [
   [
    "9203.html", 
    "http://www.4forums.com/political/environmental-debates/8359-nope-they-arent-using-scare-tactics-print.html"
   ]
  ], 
  "identifier": 8359
 }
]