[
 [
  [
   218381, 
   null, 
   "Hi_Its_Me", 
   "Hello all, this is my first post, so I want to make it good.\n \n I found a web site that makes a good argument for Intelligent Design:\n How The Evolution Debate Can Be Won\n Visit it and take a look around. I am going to post responses to some quotes that irritate me (there are a lot).\n \n \"I was fascinated with the evolutionary story, which is really the creation myth of the modern age.\"\n Note: a myth has little basis in fact. Evolution is a fact, as evolution is defined as \"a change in the gene pool over time.\" This has been repeatedly observed, probably by you (any new living thing is evolution). It also does not involve abiogenesis, which is what creationists have a problem with. Scientists are coming closer to finding out how it happened (if it did), and they have no real need for a deity... yet. If abiogenesis is found to be not possible, you may be in luck.\n \n \"Nature had to do its own creating because they assume that nature is a closed system that can never be influenced by anything outside-like God, for example.\"\n Actually, scientists are not going to want to accept a deity if there is an alternative explanation. The definition of science involves a natural explanation.\n If you do not think this method produces valid results, why does your computer work?\n \n \"There's light and dark moths at the beginning and at the end. And that's it. That's the most powerful demonstration of what natural selection has actually been seen to do.\"\n Not the most powerful, but one of the more observable. Scientists observed birds passing by camouflaged moths and eating easy to see ones. Also, natural selection is a scientific theory for many reasons, one of which is that it makes definite predictions. One prediction is that species that have helpful traits will tend to survive and reproduce more than other species. This is an excellent example of this prediction being accurate.\n \n \"It's now well known in the scientific world, and has been in the major journals, that the moths don't even sit on tree trunks...In order to make the pictures, the scientists actually glued the moths to the tree trunks. I am not kidding.\"\n That does show how one of them blends in (even while flying). Also, if they do not land on the trunks, where do they land? Or do they fly for their whole lives?\n \n \"...starts with the premise that nature had to do its own creating.\"\n ...or maybe they want to leave their options open. If you do not assume anything except the facts (for example, a pencil will fall to earth if dropped), you can come up with this theory, and if there must be a deity involved, so be it. So far, though, you have not convinced scientists that a deity must be involved.\n \n \"Now, if you're looking for confirmation of something you know just has to be true, you're not very critical about the evidence that's offered for it.\"\n True. However, Darwin came up with the basics of this based on what he saw, not on the basis of \"it must be true.\" At the time, many scientists accepted the bible as fact, but this was persuasive enough to change their minds.\n Also, this reasoning is more often used when referring to creationists. You want to believe in god, so you twist the facts (which point to evolution).\n \n \"The scientific enterprise says that our job is to explain the whole world and the cosmos and all the creatures in it without any reference to God as the Creator, without any supernatural acts, and on the basis of invariable natural laws that were the same from the beginning-all so that the creating was done by nature itself without God participating. And if you don't do that, it's not science; it's religion.\"\n Nice try; it almost works. You are saying that because science doesn't believe in God, it isn't science? Or are you saying that science isn't reliable because it excludes God? What science does is looks at evidence and tries to explain it as simply as possible. Occam's Razor describes the logic nicely, so please look it up.\n \n \"Suppose the evidence points to the conclusion that you need a Creator to get life started, to get things as complicated as biological cells, let alone human brains, in existence. Should we follow the evidence, or should we say, 'Oh, bother the evidence. It's pointing in the wrong direction. We want to stick with the philosophy.'\"\n I doubt that the evidence will point that way, because so far, science has been able to explain most of the universe in a plausible way. If it does, then the correct scientific conclusion would be to accept God as part of our universe. This would not, however, stop scientists from trying to understand God :) .\n \n \"The true answer to that is that they stick with the philosophy. But, of course, they can't afford to admit that...\"\n Maybe. However, it is more likely that a more reliable non-creationist option will surface.\n \n \"The first thing you understand is that the Darwinian Theory isn't true. It's falsified by all of the evidence, and the logic is terrible.\"\n I do not think so. My opinion is that your logic is terrible: the evidence supports evolution (you might find some examples if you googled \"fossil record\").\n \n \"Dr. Phillip Johnson has been called 'our age's clearest thinker on evolution' and the 'principal lay critic of Darwinism.' He is the author of Darwin on Trial, Reason in the Balance, Defeating Darwinism by Opening Minds, and Objections Sustained.\"\n He was obviously called that by fellow creationists. I also note that he wrote plenty of books. I didn't realize that there was that much to cover. How much can you write about a topic you don't understand or try to misinterpret?\n \n Ok, I'm done.", 
   {
    "post_info": {
     "post_title": "A good argument... debunked"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1150946700.0
  ], 
  [
   219810, 
   null, 
   "prschuster", 
   "\"Hi it's me\" wrote:\n \"Dr. Phillip Johnson has been called 'our age's clearest thinker on evolution' and the 'principal lay critic of Darwinism.' He is the author of Darwin on Trial, Reason in the Balance, Defeating Darwinism by Opening Minds, and Objections Sustained.\"\n He was obviously called that by fellow creationists. I also note that he wrote plenty of books. I didn't realize that there was that much to cover. How much can you write about a topic you don't understand or try to misinterpret?\n \n \n \n \n Walking-fish:\n I love it when creationists/IDers quote Phillip Johnson, but I hate the fact that he has my first name. Lawyers make excellent sophists, being able to support both sides of an argument with equal effectiveness. They can expound forever about topics they are totally ignorant about. And this is what makes Mr Johnson such a valuable resource for the creationist movement.", 
   {
    "post_info": {
     "post_title": "Don't Trust Lawyers"
    }
   }, 
   218381, 
   null, 
   1151546340.0
  ], 
  [
   220936, 
   null, 
   "scifmania", 
   "\"Hi it's me\" wrote:\n \"Dr. Phillip Johnson has been called 'our age's clearest thinker on evolution' and the 'principal lay critic of Darwinism.' He is the author of Darwin on Trial, Reason in the Balance, Defeating Darwinism by Opening Minds, and Objections Sustained.\"\n He was obviously called that by fellow creationists. I also note that he wrote plenty of books. I didn't realize that there was that much to cover. How much can you write about a topic you don't understand or try to misinterpret?\n \n \n \n \n Walking-fish:\n I love it when creationists/IDers quote Phillip Johnson, but I hate the fact that he has my first name. Lawyers make excellent sophists, being able to support both sides of an argument with equal effectiveness. They can expound forever about topics they are totally ignorant about. And this is what makes Mr Johnson such a valuable resource for the creationist movement.\n\n \n That's it? That was your post? To attack a source without anything backing you up? Bravo!", 
   {
    "post_info": {
     "post_title": "Thats it?"
    }
   }, 
   219810, 
   null, 
   1152137280.0
  ], 
  [
   220940, 
   null, 
   "trebor", 
   "That's it? That was your post? To attack a source without anything backing you up? Bravo!\n\n \n It's as much of a point that Phillp Johnson has. Trying to use Philip Johnson as a source about evolution is like trying to use Jack Chick as a source about Catholism.", 
   {}, 
   220936, 
   null, 
   1152140340.0
  ], 
  [
   221080, 
   null, 
   "prschuster", 
   "scifmania wrote:\n \"That's it? That was your post? To attack a source without anything backing you up? Bravo!\"\n \n \n \n Walking-fish:\n I admittedly attacked the credibility of Phillip Johnson, because he is a lawyer commenting on facts & theories in biology (something he has no expertise in). I would attack the city dog catcher just as vehemently for making a comment dismissing relativity theory or heliocentrism. In fact I also take issue with Dubya making his comment about teaching Intelligent Design. When a comment comes from someone who has no expertise to expound on what they are saying, I don't have to give it any credibility. Phillip Johnson's comments don't merit a refutation, which is why it is a shame that anyone even listens to him. \n \n However, when Michael Behe speaks about Intelligent Design, we all know that his expertise in biochemistry merits some attention, so he is worth responding to. He still doesn't have any solid evidence for ID, but is still qualified to speak about problems in biochemical evolution. I can't give Mr Johnson the same level of respect.", 
   {}, 
   220940, 
   null, 
   1152206340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A good argument... debunked", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8362-good-argument-debunked.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 8362, 
  "discussion_files": [
   [
    "15698.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8362-good-argument-debunked-print.html"
   ]
  ], 
  "identifier": 8362
 }
]