[
 [
  [
   218488, 
   null, 
   "simone", 
   "Senate Intelligence Committee Members: Weapons of Mass Destruction Exist in Iraq \n By Jim Kouri, CPP on Jun 22, 2006\n Sen. Rick Santorum (R-Pa.) and Rep. Peter Hoekstra (R-Mich.) announced Wednesday the discovery of over 500 munitions or weapons of mass destruction. The WMD found were sarin gas and mustard gas contained in projectiles, according to Fox News Channel's Special Report. \n \n Sen. Santorium, reading from a newly declassified intelligence, said, \"Since 2003, coalition forces have recovered approximately 500 weapons munitions which contain degraded mustard or sarin nerve agent. Despite many efforts to locate and destroy Iraq's pre-Gulf War chemical munitions, filled and unfilled pre-Gulf War chemical munitions are assessed to still exist.\" The statement was aired on The Mark Levin Show, as well as FNC. \n \n \"That means in addition to the 500, there are filled and unfilled munitions still believed to exist within the country,\" said Santorium. \n \n Reading from the document on camera, Santorum added, \"Pre-Gulf War Iraqi chemical weapons could be sold on the Black Market. Use of these weapons by terrorist or insurgent groups would have implications for coalition forces in Iraq. The possibility of use outside of Iraq cannot be ruled out. The most likely munitions remaining are sarin- and mustard-filled projectiles. And I underscore filled.\" \n \n Santorum also said the \"purity of the agents inside the munitions depends on many factors, including the manufacturing process, potential additives and environmental storage conditions.\" . . .\nWashington Post", 
   {
    "post_info": {
     "post_title": "Why Is Sanctorum Spouting This Lie?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1151000400.0
  ], 
  [
   218489, 
   null, 
   "simone", 
   "http://thinkprogress.org/2006/06/21/santorum-wmd/\n \n \nThe Bush administration commissioned the Iraq Survey Group to determine whether in fact any WMD existed in Iraq. After a year and half of meticulously combing through the country, here's what the administration's own inspectors reported:\n \n While a small number of old, abandoned chemical munitions have been discovered, ISG judges that Iraq unilaterally destroyed its undeclared chemical weapons stockpile in 1991. There are no credible Indications that Baghdad resumed production of chemical munitions thereafter, a policy ISG attributes to Baghdad's desire to see sanctions lifted, or rendered ineffectual, or its fear of force against it should WMD be discovered.\n", 
   {
    "unicode_changes_made": true
   }, 
   218488, 
   null, 
   1151000520.0
  ], 
  [
   218490, 
   null, 
   "simone", 
   "What we really out to do is count the number of screws loose in Sanctorum's skull.", 
   {}, 
   218489, 
   null, 
   1151000580.0
  ], 
  [
   218491, 
   null, 
   "Liminus", 
   "This pathetic, ambiguous report has already been brought up in the \"There were no WMDs?\" thread. My response to it is post 22 on this page:\n \n http://4forums.com/political/showthread.php?t=7681&page=2\n \n They are just trying to trot out any old XXXX they can because it keeps the approval ratings from dropping so fast, and because it reminds the US public that they must live in a state of FEAR at all times and therefore must trust their corrupt, duplicituous, warmongering pseudo-government to protect them from ever-changing enemies whose only reason for violence is that they 'hate freedom'.\n \n Orwell's 1984 should be required reading for anyone over the age of 10. Never has a more important, accurately prophetic text been written.", 
   {}, 
   218490, 
   null, 
   1151000940.0
  ], 
  [
   218492, 
   null, 
   "daewoo", 
   "There is already a thread here where this has been posted. The Bush apologists are, of course, all over it. Sad. Truly sad.", 
   {}, 
   218490, 
   null, 
   1151000940.0
  ], 
  [
   218495, 
   null, 
   "Liminus", 
   "From Santorum's website:\n \n \n\n The information contained in the report proves that weapons of mass destruction are, in fact, in Iraq. It is essential for the American people to understand that these weapons are in Iraq.\n\n \n http://santorum.senate.gov/public/\n \n The report is no remotely comprehensible way proves anything, he even provides a link to the report so anyone can see it doesn't prove anything and then says it does. How do these guys get elected?", 
   {}, 
   218491, 
   null, 
   1151001240.0
  ], 
  [
   218497, 
   null, 
   "Kronus", 
   "To answer the original question, I believe it's because he's running for reelection and is about 18 points behind.", 
   {}, 
   218495, 
   null, 
   1151002080.0
  ], 
  [
   218499, 
   null, 
   "daewoo", 
   "This seems to be current GOP strategy. Try to muddy the waters until some future time, and hope that you have gotten what you wanted before the public figures out you are full of XXXX.", 
   {}, 
   218497, 
   null, 
   1151002860.0
  ], 
  [
   218551, 
   null, 
   "dugman_74", 
   "What lie is he spouting? He is giving info from an intelligence report.\n \n Oh that's right, I keep forgetting that Bush is evil and Saddam was a great humanitarian.", 
   {}, 
   218488, 
   null, 
   1151020440.0
  ], 
  [
   218566, 
   null, 
   "Kronus", 
   "What lie is he spouting? He is giving info from an intelligence report.\n \n Oh that's right, I keep forgetting that Bush is evil and Saddam was a great humanitarian.\n\n \n The lie is that Saddam had WMD when Bush said he did. The intel report says, quite clearly, that everything that has been found was utterly inert. Santorum is trying to beat the drum and pretend that Saddam had real, honest to goodness, weapons of MASS DESTRUCTION *roll of thunder* at his command when Bush bravely decided to halt his evil schemes. The actual truth, which Santorum would prefer you ignore, is that all we've found is a bunch of old artillery shells that would only hurt you if they landed on your head. Santorum, for reasons only known to him, thinks that dredging up that embrassing blunder will help him get re-elected.", 
   {}, 
   218551, 
   null, 
   1151021880.0
  ], 
  [
   218575, 
   null, 
   "dugman_74", 
   "The lie is that Saddam had WMD when Bush said he did. The intel report says, quite clearly, that everything that has been found was utterly inert. Santorum is trying to beat the drum and pretend that Saddam had real, honest to goodness, weapons of MASS DESTRUCTION *roll of thunder* at his command when Bush bravely decided to halt his evil schemes. The actual truth, which Santorum would prefer you ignore, is that all we've found is a bunch of old artillery shells that would only hurt you if they landed on your head. Santorum, for reasons only known to him, thinks that dredging up that embrassing blunder will help him get re-elected.\n\n \n Actually it does not say that. A UN inspector on Fox this morning said that the sarin gas could easily still be usable. The shells themselves cannot be used, but the sarin gas can.\n http://www.foxnews.com/projects/pdf/Iraq_WMD_Declassified.pdf", 
   {}, 
   218566, 
   null, 
   1151022900.0
  ], 
  [
   218601, 
   null, 
   "daewoo", 
   "Actually it does not say that. A UN inspector on Fox this morning said that the sarin gas could easily still be usable. The shells themselves cannot be used, but the sarin gas can.\n http://www.foxnews.com/projects/pdf/Iraq_WMD_Declassified.pdf\n\n \n BUT, the administration official that commented on it (link in other thread) said it ws not, so no dice there.\n \n Sarin has a decent shelf life if properly stored. This was apparently not properly stored.\n \n You are grasping at straws here. Pathetic.", 
   {}, 
   218575, 
   null, 
   1151027640.0
  ], 
  [
   218657, 
   null, 
   "daewoo", 
   "You are a terrorist and a traitor to this country. You called our troops cowards. You have misquoted almost everything I have said. You have misquoted referrence material I have given you. You can't count. You can't read. If you would take two damned seconds to put thought into anything before you type, your head would probably explode.\n\n \n No, I have not. I have a nifty cut and paste function. It ensures that I do not misquote people. I have given plenty of numbers to back up my assertions. You have given none. The fact that YOU have failed to read and fully understand your sources is not my fault. I did not make you stupid. That was genetics.\n \n \nThe single greatest thing that has ever happened to this forum has given you countless evidence that you simply ignore. You ignore this because your hatred for Bush, this country, and simple logic is more important that the truth. \n\n \n \n The greatest thing that has ever happened to this forum was when Voice of Reason was banned. You are an interesting troll, no more, no less. \n \n If your \"truth\" fails the test of logic, it is not truth, it is illogical BS. \n \n As far as your other rediculous BS.....In the service of my country I have been awarded a purple heart w/ 3 clusters, a silver star, and a distinguished service cross. How about you, REMF? You can question my politics, you can question my logic, but do not question my patriotism. YOU have not earned the right. \n \n My politics and my viewpoints are the result of my patriotism. My country is being destroyed by neofascist and XXXXXX acting in concert to undermine the very foundations of this nation. You are one of those XXXXXX. You have a head full of ideas that are illogical and ignorant, and you infect others with your idiocy. \n \n If you really gave a rats XXX about our soldiers, you would be working your butt off to get them home. There is a reason that soldiers home from Vietnam suffered mental problems at nearly twice the rate of those that returned from Bosnia, or Panama, Gulf I or even WW II. Currently they are serving in an active combat engagement. All their infomration is very clsoely controlled by psy ops. Their news, newspapers, and other media access is strictly controlled. They will believe what they are told to believe becuase they HAVE to believe that. After all, if they are not fighting the good fight for democracy in a just war, then they are just murderers, and nobody wants to be a murderer.\n \n THAT is why guys in vietnam went nuts when they got back. It was not a just war. They were not protectign our country, nor were they being particularly helpful to anyody but a bunch of jackasses in washington and their defense contractor buddies who made trillions off the war. After they returned home, and they got a view of the war that was not strictly controlled, their mental conditioning started to break down. Reality creeps in and they could not handle the things they have done.\n \n 2 or 3 or 5 years after this little escpade is over, the soldiers that are in IRaq right now will wake up from dreams of dead civilians. Whether they are able to deal with those dreams wihtout going nuts will largely be decided on the merits of the war.\n \n If the war had turned out to be a real response to a threat to the united states, they would be able to roll over and go back to sleep knowing that they had committed some necessary evils. That is not the way it has worked out, though. You have to be either completely delusional or a complete idiot to believe that this was a response to a real threat. So those guys will get up and spend the rest of the night just knowing that they did things that were evil.", 
   {}, 
   218601, 
   null, 
   1151041200.0
  ], 
  [
   218708, 
   null, 
   "simone", 
   "Actually it does not say that. A UN inspector on Fox this morning said that the sarin gas could easily still be usable. The shells themselves cannot be used, but the sarin gas can.\n http://www.foxnews.com/projects/pdf/Iraq_WMD_Declassified.pdf\nDugman, thank you for my first giggle of the morn: The notable scientists of FauxNews hold forth with their notable scientific authority.", 
   {}, 
   218575, 
   null, 
   1151082540.0
  ], 
  [
   218726, 
   null, 
   "jyoshu", 
   "THAT is why guys in vietnam went nuts when they got back. It was not a just war. They were not protectign our country, nor were they being particularly helpful to anyody but a bunch of jackasses in washington and their defense contractor buddies who made trillions off the war. After they returned home, and they got a view of the war that was not strictly controlled, their mental conditioning started to break down. Reality creeps in and they could not handle the things they have done.\n\n \n Of course I'm sure the fact so many of them were treated like total scum and traitors when they got back had absolutely nothing to do with it. emoticon_rolleyes emoticon_rolleyes \n \n I agree with you that Vietnam, with all factors taken into consideration, was a bad idea. But your logic regarding the post-war mental state of it's troops doesn't take into account that there are other wars we've been involved in that could be considered \"unjust\" for the same reasons Vietnam was. Take the Korean War for instance--it wasn't a defensive war either, and one that didn't NEED to fight. Where are the scores of mentally troubled soldiers wrestling with their guilt over THAT \"unjust\" war? The reason is simple--people supported the troops that went there. Luckily, giving strong support to our soldiers (or at least not treat them like traitors) is one lesson that DID come out of Vietnam, and luckily the anti-war movement was the ones who learned it for this time around.", 
   {}, 
   218657, 
   null, 
   1151087460.0
  ], 
  [
   218741, 
   null, 
   "Jo Bennett", 
   "On the contrary, it was the US government that learned that if you try to hitch support for the troops to support for the war, it will backfire and people will support neither. They've allowed the two to be separate because they gain nothing by conflating the two.", 
   {}, 
   218726, 
   null, 
   1151090100.0
  ], 
  [
   218745, 
   null, 
   "daewoo", 
   "Of course I'm sure the fact so many of them were treated like total scum and traitors when they got back had absolutely nothing to do with it. emoticon_rolleyes emoticon_rolleyes \n \n I agree with you that Vietnam, with all factors taken into consideration, was a bad idea. But your logic regarding the post-war mental state of it's troops doesn't take into account that there are other wars we've been involved in that could be considered \"unjust\" for the same reasons Vietnam was. Take the Korean War for instance--it wasn't a defensive war either, and one that didn't NEED to fight. Where are the scores of mentally troubled soldiers wrestling with their guilt over THAT \"unjust\" war? The reason is simple--people supported the troops that went there. Luckily, giving strong support to our soldiers (or at least not treat them like traitors) is one lesson that DID come out of Vietnam, and luckily the anti-war movement was the ones who learned it for this time around.\n\n \n No, actually guys coming home from Korea had mental problems at about the same rate as those coming home from Vietnam.\n \n Let me let you in on a little secret, Josh. Soldiers don't give a rats behind whetehr those at home support the war or not. It makes no difference in the field, it makes no difference when you get back home. When you are in the field, it doesn't influence your actions because youa re trying to stay alive. You don't decide to die because the folks back home don't like what you are doing.\n \n When you get home, it really doesn't matter because regardless of what they think, your actions would have been pretty much the same either way because you were following orders. \n \n \"Support the troops\" campaigns are generally politically motivated. This time out the MILITARY did a pretty good job of seperating \"Support our troops\" from \"support their mission\" because they learned during Vietnam to never let the politicians confuse the two. The Bush administration did a fine job of trying ot integrate the 2, but lucklily it looks like only about 25% of people were stupid enough to fall for it (if the polls are to be believed). \n \n If you want to support our troops, get them out of the terrible situation they are in. Impeach the son of a bitch that lied to put them there, then as soon as the impeachment is over, try him for treason and execute him on public TV. THEN you can claim that you support our troops. As long as you argue for continuing to execute a war based on a lie and with no justification, you are just ####### on those troops.", 
   {}, 
   218726, 
   null, 
   1151090340.0
  ], 
  [
   218749, 
   null, 
   "daewoo", 
   "On the contrary, it was the US government that learned that if you try to hitch support for the troops to support for the war, it will backfire and people will support neither. They've allowed the two to be separate because they gain nothing by conflating the two.\n\n \n \n I disagree here. Several top adminsitration officials have come right out and said that you cannot support the troops without supporitng their mission.\n \n EVERY military official that has spoken on the matter has said the exact opposite. The military learned form Vietnam, and seperating the troops as people formthe mission at hand has been drilled into every officer in the US military. Even under political pressure, the military has not backed down on this. Tommy Franks got up immediatly after Rumsfeld said \"the troops ARE the mission, to support one you must support the other\" and said \"The troops and the mission are two entirely seperate entities. Whether you support the mission or not, these young men and women are doing the job their country has asked them to do\".\n \n The bush administration has CONSTANTLY tried to pull the old vietnam era trick of combining troops and mission to try to drum up support for their war. The military has been VERY vocal in trying to seperate the two.", 
   {}, 
   218741, 
   null, 
   1151090700.0
  ], 
  [
   218757, 
   null, 
   "jyoshu", 
   "No, actually guys coming home from Korea had mental problems at about the same rate as those coming home from Vietnam.\n\n \n I've haven't seen any claim to that effect or evidence. I'd love to see it, if you are willing to cite it.\n \n \nLet me let you in on a little secret, Josh. Soldiers don't give a rats behind whetehr those at home support the war or not. It makes no difference in the field, it makes no difference when you get back home.\n \n \n I didn't say they did. But you are out of your mind if you think soldiers, uopn being spat on, yelled at, called traitors, etc. weren't affected by it. We aren't talking about just 'lackluster support' here. We're talking about mistreatment. Maybe you're the sort of person who enjoys that sort of thing--I don't know. I doubt most of them did.\n \n I respect you service as soldier (whether you care if I do or not), but I have to tell you that NONE of the soldiers and veterans I talk to corroborate many of the opinions you have. Every soldier I know cares very much about the support he or she has back home.", 
   {}, 
   218745, 
   null, 
   1151092200.0
  ], 
  [
   218775, 
   null, 
   "daewoo", 
   "I've haven't seen any claim to that effect or evidence. I'd love to see it, if you are willing to cite it.\n\n \n I will dig you up some good numbers tonight. The ones I use are from a book entitled \"Command Decisions: An officers guide to the safety and well being of his troops\".\n \n Interestingly enough, we are ALREADY seeing a difference in the number of mental problems between soldiers in Iraq and those in Afghanistan:\n \n http://www.cbsnews.com/stories/2006/03/01/iraq/main1357296.shtml\n \n \nNineteen percent of those back from Iraq reported mental health concerns, compared with 11 percent of those back from Afghanistan and 8.5 percent of those returning from other places, such as Bosnia. \n\n \n Why do you suppose that is? Are members of the public lining up with flowers for guys coming back from Afghanistan and spitting on the guys from Iraq? I think not. Are there being parades thrown for guys coming back from Bosnia while they burn crosses in front of Iraq veterans houses? Probably not, you would probably see that kind of thing in the news.\n \n If the current line of psyco babble is correct, they are having trouble because they saw atrocitites commited on civilains and felt powerless to do anything about it. We know thats BS because if that was the case, the guys who were in Bosnia would be the ones with the serious problem. They are under a \"no fire\" order. They are not allowed to engage the enemy unless they are actively under attack. That means you stand there with your safety on while civilains get mowed down 50 ft in front of you. Been there, done that, and it sucks, but those aren't the faces in my nightmares, the faces I see are those of the folks I am responsible for killing for no good reason. \n \n The simple fact of the matter is that soldiers in Afghanistan get home and feel that their serive was worthwhile. The soldiers in bosnia feel the same. Soldiers get back from Iraq and learn that they went through all that BS on a lie, and that they did NOTHING to serve their country.\n \n \n \nI didn't say they did. But you are out of your mind if you think soldiers, uopn being spat on, yelled at, called traitors, etc. weren't affected by it. We aren't talking about just 'lackluster support' here. We're talking about mistreatment. Maybe you're the sort of person who enjoys that sort of thing--I don't know. I doubt most of them did.\n\n \n I'm sure they didn't like it. Then again, you do not go bonkers because the guy down the street does not like you or like what you did. You go nuts because YOU don't like you or like what you did. If somebody else disaproving of your actions had the ability to make you crazy, half the world would be in straight jackets. \n \n \nI respect you service as soldier (whether you care if I do or not), but I have to tell you that NONE of the soldiers and veterans I talk to corroborate many of the opinions you have. Every soldier I know cares very much about the support he or she has back home.\n\n \n If that was really the case, none of those guys would have come home because the minute public opinion turned against the war, they would have curled up in little balls and waited for the enemy to come kill them. A LARGE percentage of basic training is spent breaking down your psyche to ensure that regardless of what others think, and regardless of what YOU think, you will do your job and follow orders. Once you get home, you can always fall back on \"was following orders\" if others question your actions. You know when you close your eyes at night what you have done and why you did it, and you judge yourself every day when you look in the mirror as to whether the things you did were justified or not. \n \n how many of the guys you have spoken to were combat vets? I can understand a motor pool guy or a communications tech, or a shop keeper worryign about popularity polls. Combat troops, which are the guys who end up all screwed up in the head, do not.", 
   {}, 
   218757, 
   null, 
   1151100120.0
  ], 
  [
   218847, 
   null, 
   "georged", 
   "Here's what happens to mental health when a country lures individuals from under-privileged backgrounds using high compensation to fight as mercenaries:\n \n http://www.schizophrenia.com/sznews/archives/003205.html\n \n 33% of Afghanistan and Iraq US military veterans suffer from some form of serious mental illness classified under anxiety disorders attributed to the stress of fighting what any simpleton can define as an unjust war. Afghanistan shows a lower rate of mental illness than Iraq due to primarily professional soldiers (special forces) serving there. Those who wish to argue the percentage can take it up with the Veterans Affairs Healthcare System. \n \n Vietnam - 8% (short tours) \n \n Korea - 24.2%\n \n WW2 - 18%\n \n General US population suffering from anxiety disorders - 7-12%", 
   {}, 
   218775, 
   null, 
   1151172960.0
  ], 
  [
   218854, 
   null, 
   "jyoshu", 
   "Here's what happens to mental health when a country lures individuals from under-privileged backgrounds using high compensation to fight as mercenaries\n\n \n So tell me, George . . . what would suffice, in your view, for a soldier to not be fighting as a mercenary, but as a bona fide member of a country's armed forces? What degree (or rather lack thereof) of compensation would that take?\n \n Half their current pay? A draft-only situation? Maybe no pay and all-volunteer? \n \n I wonder what the guy who joins the armed forces because he loves his country would think about you calling him a mercenary just because the US is actually paying well for combat service for once. But I get the impression you really wouldn't care what he thought.", 
   {}, 
   218847, 
   null, 
   1151177100.0
  ], 
  [
   218858, 
   null, 
   "georged", 
   "So tell me, George . . . what would suffice, in your view, for a soldier to not be fighting as a mercenary, but as a bona fide member of a country's armed forces? What degree (or rather lack thereof) of compensation would that take?\n \n Half their current pay? A draft-only situation? Maybe no pay and all-volunteer? \n \n I wonder what the guy who joins the armed forces because he loves his country would think about you calling him a mercenary just because the US is actually paying well for combat service for once. But I get the impression you really wouldn't care what he thought.\n\n \n \n When that soldier is used to defend the US. IMO nation building in Afghanistan and Iraq is not a suitable use of our military or financial resources.\n \n No, I don't care what he thought. The US military currently pays far better than anything else available for unskilled, entry level employment. Read some of the recruiting verbiage and individual reasoning for military enlistment in our voluntary military and perhaps you'll better understand the terms cannon fodder and economically disadvantaged.", 
   {}, 
   218854, 
   null, 
   1151178120.0
  ], 
  [
   218859, 
   null, 
   "jyoshu", 
   "When that soldier is used to defend the US. IMO nation building in Afghanistan and Iraq is not a suitable use of our military or financial resources.\n \n No, I don't care what he thought. The US military currently pays far better than anything else available for unskilled, entry level employment.\n\n \n But it doesn't offer raises once the training is there, and they aren't \"unskilled\" anymore. It's not like the service and tours of duty are conducted unskilled. They train them. So your entire portrayal of the situation here is dishonest, or hopefully just ill-informed. Read some of the military's training programs and initiatives and maybe you'll understand that they don't do their job \"unskilled.\"\n \n As far as your beef with incentives, when people get so bent out of shape over the idea of a draft, and (more importantly) when there's an active movement going on in this country to discourage the military and it's actions, that's what happens. If you don't like the idea of incentives, then maybe you should do your part and be taking a less cynical and insulting view of our armed forces men and women.", 
   {}, 
   218858, 
   null, 
   1151179380.0
  ], 
  [
   218860, 
   null, 
   "georged", 
   "But it doesn't offer raises once the training is there, and they aren't \"unskilled\" anymore. It's not like the service and tours of duty are conducted unskilled. They train them. So your entire portrayal of the situation here is dishonest, or hopefully just ill-informed. Read some of the military's training programs and initiatives and maybe you'll understand that they don't do their job \"unskilled.\"\n \n As far as your beef with incentives, when people get so bent out of shape over the idea of a draft, and (more importantly) when there's an active movement going on in this country to discourage the military and it's actions, that's what happens. If you don't like the idea of incentives, then maybe you should do your part and be taking a less cynical and insulting view of our armed forces men and women.\n\n \n Hogwash. Few are trained for anything applicable to the civilian world. Almost all logistical functions down to cook are now performed by civilian contractors. \n \n I have the utmost of admiration for those professional warriors who make the military their vocation. What I dislike is and take a cynical view of is amassing an aggressive military for nation building using incentives to attract disadvantaged young people. And pity the naivety of those youth in responding to incentives to become what are mercenaries in every sense of the word.", 
   {}, 
   218859, 
   null, 
   1151180520.0
  ], 
  [
   218867, 
   null, 
   "Rovdak", 
   "As far as your beef with incentives, when people get so bent out of shape over the idea of a draft, and (more importantly) when there's an active movement going on in this country to discourage the military and it's actions, that's what happens. If you don't like the idea of incentives, then maybe you should do your part and be taking a less cynical and insulting view of our armed forces men and women.\n\n \n Or one could abandon militarism and downsize the army, cut defence spending by 50% and the US'd still have a larger budget than China, France, Japan, the UK and Germany combined.", 
   {}, 
   218859, 
   null, 
   1151183820.0
  ], 
  [
   218869, 
   null, 
   "jyoshu", 
   "Hogwash. Few are trained for anything applicable to the civilian world.\n\n \n Well of course . . . why would it? their job is not in the civilian world. Their job is to prepare for combat and take part, or support those who do.\n \n \nWhat I dislike is and take a cynical view of is amassing an aggressive military for nation building using incentives to attract disadvantaged young people. And pity the naivety of those youth in responding to incentives to become what are mercenaries in every sense of the word.\n\n \n Why is that bad? There are lots of them that have gotten college degrees are a result. Why can you not see that as a opportunity?", 
   {}, 
   218860, 
   null, 
   1151184420.0
  ], 
  [
   218889, 
   null, 
   "daewoo", 
   "33% of Afghanistan and Iraq US military veterans suffer from some form of serious mental illness classified under anxiety disorders attributed to the stress of fighting what any simpleton can define as an unjust war. Afghanistan shows a lower rate of mental illness than Iraq due to primarily professional soldiers (special forces) serving there. Those who wish to argue the percentage can take it up with the Veterans Affairs Healthcare System. \n \n\n \n Good show, George. I was going to scan the relevant pages from my book into PDF and post them. Thanks for saving the trouble!\n \n It is interesting that you mention both special forces and soldiers recruited from under-privelaged backgrounds. In the same book (which is primarily about keeping your men in line and productive and keeping them from going nuts on you) it si stated in several places that the lower the soldiers location on the social ladder prior to service, the more likely he is to go bananas on you when he gets home. Officers, who tend to be from the middle or upper middle class, have mental illness rates following service that are less than 10% those of enlisted men, and in SF soldiers, mental illness following service is almost unheard of (2-4%). \n \n I have heard it argued (jokingly) that this is because SF sodiers are not quite right to begin with.", 
   {}, 
   218869, 
   null, 
   1151192340.0
  ], 
  [
   218891, 
   null, 
   "daewoo", 
   "But it doesn't offer raises once the training is there, and they aren't \"unskilled\" anymore. It's not like the service and tours of duty are conducted unskilled. They train them. So your entire portrayal of the situation here is dishonest, or hopefully just ill-informed. Read some of the military's training programs and initiatives and maybe you'll understand that they don't do their job \"unskilled.\"\n\n \n That depends on the future. Most people join the military but do not plan to make it a career (lets face it, only a fool would enlist and say \"this is what I want ot do with the rest of my life\"...anybody with brains goes in through ROTC as an officer). Where enlisted men get into trouble is in actually believing that the training they pick up in the military is going to be useful when they leave. Military training in most fields is absolutly worthless due to the propreitary nature of military systems and lack of broad spectum training. For example, you may be trained as a technician on a wxrz radar system. They do not actually train you as an electronics technician, jsut a technician for THAT piece fo equipment. You know how to troubleshoot and repair a wxrz radar system. The problem is that military systems are almost all propreitary, so you will NEVER find a wxrz radar system outside the military. Your training is useless and worthless. \n \n \nAs far as your beef with incentives, when people get so bent out of shape over the idea of a draft, and (more importantly) when there's an active movement going on in this country to discourage the military and it's actions, that's what happens. If you don't like the idea of incentives, then maybe you should do your part and be taking a less cynical and insulting view of our armed forces men and women.\n\n \n This is simple math. We simply cannot afford to take the dredges of society and continue to offer them escalating incentives in order to act as mercenaries. It would be cheaper to simply hire mercenaries.", 
   {}, 
   218859, 
   null, 
   1151193480.0
  ], 
  [
   218892, 
   null, 
   "daewoo", 
   "Or one could abandon militarism and downsize the army, cut defence spending by 50% and the US'd still have a larger budget than China, France, Japan, the UK and Germany combined.\n\n \n \n That would be too logical. Believe it or not, despite the fact that our military is already GROSSLY oversized, whenever you talk about military spending cuts, people wail about \"defense\".\n \n We have TWO defensive military bases in the US. Thats IT. Everythign else is projection of force BS that has a lot to do with ensureing US hegemony, but NOTHING to do with defending the country.", 
   {}, 
   218867, 
   null, 
   1151193720.0
  ], 
  [
   218893, 
   null, 
   "Jo Bennett", 
   "I do find it interesting that there was never any intention that the US would have a standing army, hence the RTKABA, the militia was supposed to do the defending. After all, in 1776, who among the new Americans ever expected the US to want to project its will across the globe in exactly the same way the UK had done?", 
   {}, 
   218892, 
   null, 
   1151195760.0
  ], 
  [
   218896, 
   null, 
   "daewoo", 
   "I do find it interesting that there was never any intention that the US would have a standing army, hence the RTKABA, the militia was supposed to do the defending. After all, in 1776, who among the new Americans ever expected the US to want to project its will across the globe in exactly the same way the UK had done?\n\n \n IMO that was because many Americans at the time were radicals. They had just shrugged off the British Empire and understood fully that there was no such thing as freedom at the end of a gun. Many british felt that they were doign a great service in conqureing other lands. Those in the other lands tended to disagree. The \"benifits\" being given to india by the british (according to the british, that is) were far more convincing than the \"benifits\" that the us is bestowing on Iraq.\n \n If you study the writings of those who founded this country, and I am not just talking those who drafted the constitution but other American thinkers of the time, the prohibition against a standing army was not just a matter of ensuring that such an army wouodl never be used against our own people, but to ensure that at a later date the world did not have to fear well intentioned tyranny from the United States. Too bad we didn't listen.", 
   {}, 
   218893, 
   null, 
   1151197980.0
  ], 
  [
   218960, 
   null, 
   "georged", 
   "I do find it interesting that there was never any intention that the US would have a standing army, hence the RTKABA, the militia was supposed to do the defending. After all, in 1776, who among the new Americans ever expected the US to want to project its will across the globe in exactly the same way the UK had done?\n\n \n And for the same reasons, control of natural resources. Crown wealth began its descent after the costs of WW1 and emergence of US industrial dominance utilizing low-cost labor in mass production with readily available natural resources. WW2 exhausted remaining crown wealth and the UK was sensible enough to abandon the cost of maintaining colonial entities. As the US exhausted cheap domestic natural resources, especially oil, it turned to military support of dictatorships offering those required resources and then military enforcement of Petrodollars without need of formal colonization (other than the recent direction in Afghanistan and Iraq). \n \n A definite economic parallel that, IMO, was far beyond the mental scope of US founders. The original US constitution definition of defense has been interpreted in a self-serving manner that would make those founders spin in their graves.", 
   {}, 
   218893, 
   null, 
   1151248800.0
  ], 
  [
   219044, 
   null, 
   "dugman_74", 
   "No, I have not. I have a nifty cut and paste function. It ensures that I do not misquote people. I have given plenty of numbers to back up my assertions. You have given none. The fact that YOU have failed to read and fully understand your sources is not my fault. I did not make you stupid. That was genetics.\n \n \n \n \n The greatest thing that has ever happened to this forum was when Voice of Reason was banned. You are an interesting troll, no more, no less. \n \n If your \"truth\" fails the test of logic, it is not truth, it is illogical BS. \n \n As far as your other rediculous BS.....In the service of my country I have been awarded a purple heart w/ 3 clusters, a silver star, and a distinguished service cross. How about you, REMF? You can question my politics, you can question my logic, but do not question my patriotism. YOU have not earned the right. \n \n My politics and my viewpoints are the result of my patriotism. My country is being destroyed by neofascist and XXXXXX acting in concert to undermine the very foundations of this nation. You are one of those XXXXXX. You have a head full of ideas that are illogical and ignorant, and you infect others with your idiocy. \n \n If you really gave a rats XXX about our soldiers, you would be working your butt off to get them home. There is a reason that soldiers home from Vietnam suffered mental problems at nearly twice the rate of those that returned from Bosnia, or Panama, Gulf I or even WW II. Currently they are serving in an active combat engagement. All their infomration is very clsoely controlled by psy ops. Their news, newspapers, and other media access is strictly controlled. They will believe what they are told to believe becuase they HAVE to believe that. After all, if they are not fighting the good fight for democracy in a just war, then they are just murderers, and nobody wants to be a murderer.\n \n THAT is why guys in vietnam went nuts when they got back. It was not a just war. They were not protectign our country, nor were they being particularly helpful to anyody but a bunch of jackasses in washington and their defense contractor buddies who made trillions off the war. After they returned home, and they got a view of the war that was not strictly controlled, their mental conditioning started to break down. Reality creeps in and they could not handle the things they have done.\n \n 2 or 3 or 5 years after this little escpade is over, the soldiers that are in IRaq right now will wake up from dreams of dead civilians. Whether they are able to deal with those dreams wihtout going nuts will largely be decided on the merits of the war.\n \n If the war had turned out to be a real response to a threat to the united states, they would be able to roll over and go back to sleep knowing that they had committed some necessary evils. That is not the way it has worked out, though. You have to be either completely delusional or a complete idiot to believe that this was a response to a real threat. So those guys will get up and spend the rest of the night just knowing that they did things that were evil.\n\n \n Pay attention slime ball\n \n You have misquoted me. You have misquoted the links I have given you. You cannot read. You hate this country. You have done nothing in support of this country. You are a traitor. You are a terrorist. You have yet to prove anything I have said is incorrect. When I have shot you down you have resorted to lies and insults because that is all you know. \n If you gave a damn about the soldiers you would not be spouting the lies you have told about them. You would express your support for them instead of calling them cowards. You would acknowledge that Saddam was a terrorist thug with illegal weapons. \n You would do a number of things differently if you gave a #### about those troops or this country. But you are too full of hatred to do so.", 
   {}, 
   218657, 
   null, 
   1151297220.0
  ], 
  [
   219045, 
   null, 
   "dugman_74", 
   "Dugman, thank you for my first giggle of the morn: The notable scientists of FauxNews hold forth with their notable scientific authority.\n\n \n Can anyone in this forum read?????\n \n Who the hell said anything about a FoxNews anything? The man was UN inspector.", 
   {}, 
   218708, 
   null, 
   1151297400.0
  ], 
  [
   219061, 
   null, 
   "daewoo", 
   "Pay attention slime ball\n \n You have misquoted me. You have misquoted the links I have given you. You cannot read. You hate this country. You have done nothing in support of this country. You are a traitor. You are a terrorist. You have yet to prove anything I have said is incorrect. When I have shot you down you have resorted to lies and insults because that is all you know. \n If you gave a damn about the soldiers you would not be spouting the lies you have told about them. You would express your support for them instead of calling them cowards. You would acknowledge that Saddam was a terrorist thug with illegal weapons. \n You would do a number of things differently if you gave a #### about those troops or this country. But you are too full of hatred to do so.\n\n \n The problem with that is that it has been conclusively proven that Saddam did NOT have illegal weapons or ties to Al Queda. It simply was not true. It was a LIE. If your ideaology requires that we accept and repeat lies, I want no part of it. \n \n Please quote for me where I have misquoted you. Every time I quote you, I use my cut and paste function, so I think it is EXTREMELY unlikely that I have misquoted you anywhere.\n \n Also, PLEASE direct me to where you have shot down anything I have said.\n \n Maybe a less intellectual forum would suit you better?", 
   {}, 
   219044, 
   null, 
   1151299860.0
  ], 
  [
   219064, 
   null, 
   "dugman_74", 
   "The problem with that is that it has been conclusively proven that Saddam did NOT have illegal weapons or ties to Al Queda. It simply was not true. It was a LIE. If your ideaology requires that we accept and repeat lies, I want no part of it. \n\n \n http://www.foxnews.com/projects/pdf/Iraq_WMD_Declassified.pdf\n Read the last page\n \n \n \n\n Please quote for me where I have misquoted you. Every time I quote you, I use my cut and paste function, so I think it is EXTREMELY unlikely that I have misquoted you anywhere.\n \n Also, PLEASE direct me to where you have shot down anything I have said.\n \n Maybe a less intellectual forum would suit you better?\n\n \n I have shot down EVERYTHING you have said, so to point them all out would take too long.", 
   {}, 
   219061, 
   null, 
   1151300040.0
  ], 
  [
   219067, 
   null, 
   "daewoo", 
   "http://www.foxnews.com/projects/pdf/Iraq_WMD_Declassified.pdf\n Read the last page\n\n \n I read the last page. We also linked and discussed the bush adminstrations release on thsi where they state that these are NOT the WMDs that we were after, they are either weapon that were declared or weapons that were declared missing. \n \n Do try to keep up.\n \n \n \nI have shot down EVERYTHING you have said, so to point them all out would take too long.\n\n \n Then maybe you could limit your list to just one or two.", 
   {}, 
   219064, 
   null, 
   1151300580.0
  ], 
  [
   219079, 
   null, 
   "dugman_74", 
   "I read the last page. We also linked and discussed the bush adminstrations release on thsi where they state that these are NOT the WMDs that we were after, they are either weapon that were declared or weapons that were declared missing. \n \n Do try to keep up.\n \n Then maybe you could limit your list to just one or two.\n\n \n I am keeping up. Read the last page again.\n \n And this discussion is one.", 
   {}, 
   219067, 
   null, 
   1151301420.0
  ], 
  [
   219185, 
   null, 
   "jyoshu", 
   "The problem is that military systems are almost all propreitary, so you will NEVER find a wxrz radar system outside the military. Your training is useless and worthless. \n\n \n We aren't talking about post-military civilian life here. I think you know that.\n \n \nThis is simple math. We simply cannot afford to take the dredges of society and continue to offer them escalating incentives in order to act as mercenaries. It would be cheaper to simply hire mercenaries.\n\n \n But not the right thing to do. Such a solution only takes the monetary factor into account; there are other factors as well.", 
   {}, 
   218891, 
   null, 
   1151349660.0
  ], 
  [
   219234, 
   null, 
   "daewoo", 
   "We aren't talking about post-military civilian life here. I think you know that.\n\n \n but it was addressed\n \n \n \n \nBut not the right thing to do. Such a solution only takes the monetary factor into account; there are other factors as well.\n\n \n True enough. Unfortunatly the monetary factors are quickly becomign the over riding consideration, and that trend will accelerate in the future.", 
   {}, 
   219185, 
   null, 
   1151358900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why Is Sanctorum Spouting This Lie?", 
  "url": "http://www.4forums.com/political/politics-debates/8363-why-sanctorum-spouting-lie.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 8363, 
  "discussion_files": [
   [
    "3124.html", 
    "http://www.4forums.com/political/politics-debates/8363-why-sanctorum-spouting-lie-print.html"
   ], 
   [
    "3125.html", 
    "http://www.4forums.com/political/politics-debates/8363-why-sanctorum-spouting-lie-3-print.html"
   ], 
   [
    "3126.html", 
    "http://www.4forums.com/political/politics-debates/8363-why-sanctorum-spouting-lie-2-print.html"
   ]
  ], 
  "identifier": 8363
 }
]