[
 [
  [
   218709, 
   null, 
   "simone", 
   "And those blasted String Theorists can go hang themselves with their yarn!\n \n From the Wall Street Journal's Sharon Begley:\n \n Has String Theory Tied Up Better Ideas In Field of Physics?\n June 23, 2006; Page B1\n Nobel physicist Wolfgang Pauli didn't suffer fools gladly. Fond of calling colleagues' work \"wrong\" or \"completely wrong,\" he saved his worst epithet for work so sloppy and speculative it is \"not even wrong.\"\n \n That's how mathematician Peter Woit of Columbia University describes string theory. In his book, \"Not Even Wrong,\" published in the U.K. this month and due in the U.S. in September, he calls the theory \"a disaster for physics.\"\n \n A year or two ago, that would have been a fringe opinion, motivated by sour grapes over not sitting at physics' equivalent of the cool kids' table. But now, after two decades in which string theory has been the doyenne of best-seller lists and the dominant paradigm in particle physics, Mr. Woit has company.\n \n \"When it comes to extending our knowledge of the laws of nature, we have made no real headway\" in 30 years, writes physicist Lee Smolin of the Perimeter Institute in Waterloo, Canada, in his book, \"The Trouble with Physics,\" also due in September. \"It's called hitting the wall.\"\n \n He blames string theory for this \"crisis in particle physics,\" the branch of physics that tries to explain the most fundamental forces and building blocks of the world.\n \n String theory, which took off in 1984, posits that elementary particles such as electrons are not points, as standard physics had it. They are, instead, vibrations of one-dimensional strings 1/100 billion billionth the size of an atomic nucleus. Different vibrations supposedly produce all the subatomic particles from quarks to gluons. Oh, and strings exist in a space of 10, or maybe 11, dimensions. No one knows exactly what or where the extra dimensions are, but assuming their existence makes the math work.\n \n String theory, proponents said, could reconcile quantum mechanics (the physics of subatomic particles) and gravity, the longest-distance force in the universe. That impressed particle physicists to no end. In the 1980s, most jumped on the string bandwagon and since then, stringsters have written thousands of papers.\n \n But one thing they haven't done is coax a single prediction from their theory. In fact, \"theory\" is a misnomer, since unlike general relativity theory or quantum theory, string theory is not a concise set of solvable equations describing the behavior of the physical world. It's more of an idea or a framework.\n \n Partly as a result, string theory \"makes no new predictions that are testable by current -- or even currently conceivable -- experiments,\" writes Prof. Smolin. \"The few clean predictions it does make have already been made by other\" theories.\n \n Worse, the equations of string theory have myriad solutions, an extreme version of how the algebraic equation X squared equals four has two solutions (2 and -2). The solutions arise from the fact that there are so many ways to \"compactify\" its extra dimensions -- to roll them up so you get the three spatial dimensions of the real world. With more than 10 raised to 500th power (1 followed by 500 zeros) ways to compactify, there are that many possible universes.\n \n \"There is no good insight into which is more likely,\" concedes physicist Michael Peskin of the Stanford Linear Accelerator Center.\n \n If string theory made a prediction that didn't accord with physical reality, stringsters could say it's correct in one of these other universes. As a result, writes Prof. Smolin, \"string theory cannot be disproved.\" By the usual standards, that would rule it out as science.\n \n String theory isn't any more wrong than preons, twistor theory, dynamical triangulations, or other physics fads. But in those cases, physicists saw the writing on the wall and moved on. Not so in string theory.\n \n \"What is strange is that string theory has survived past the point where it should have been clear that it wouldn't work,\" says Mr. Woit. Not merely survived, but thrived. Virtually every young mathematically inclined particle theorist must sign on to the string agenda to get an academic job. By his count, of 22 recently tenured professors in particle theory at the six top U.S. departments, 20 are string theorists.\n \n One physicist commented on Mr. Woit's blog that Ph.D. students who choose mathematical theory topics that \"are non-string are seriously harming their career prospects.\"\n \n To be fair, string theory can claim some success. A 1985 paper showed that if you compactify extra dimensions in a certain way, the number of quarks and leptons you get is exactly the number found in nature. \"This is the only idea out there for why the number of quarks and leptons is what it is,\" says Prof. Peskin. Still, that is less a prediction of string theory than a consequence.\n \n (More)", 
   {
    "post_info": {
     "post_title": "Now Maybe Physicists Will Hear Out My Hairy Brane Theory"
    }
   }, 
   null, 
   null, 
   1151082960.0
  ], 
  [
   218710, 
   null, 
   "simone", 
   "If fewer physicists were tied to strings might some of the enduring mysteries of the universe be solved? Might we know why there is more matter than antimatter? Why the proton's mass is 1,836 times the electron's? Why the 18 key numbers in the standard model of fundamental particles have the values they do?\n \n \"With smart people pursuing these questions, more might have been answered,\" says Mr. Woit. \"Too few really good people have been working on anything other than string theory.\"\n \n That string theory abandoned testable predictions may be its ultimate betrayal of science.", 
   {}, 
   218709, 
   null, 
   1151083020.0
  ], 
  [
   218713, 
   null, 
   "Jo Bennett", 
   "It's a ludicrous article. String theory is, yes, still an idea, but to suggest that it is being pursued to the exclusion of other ideas is a bit ridiculous. The current paradigm in particle physics is still the Standard Model, and has been for some years. What we know, however, is that the standard model is incomplete. There are a number of competing theories explaining the missing parts, string theory is just one. Note how carefully worded the \"tenured professors in particle theory\" is. Supersymmetry also has its supporters, but I suspect they tend to be among the experimentalists, as supersymmetry hypothesises a set of supersymmetric particles just beyond the range of current detectors, and supersymmetry hence provides a brilliant excuse for pumping money out of the US government.", 
   {}, 
   218710, 
   null, 
   1151083680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Now Maybe Physicists Will Hear Out My Hairy Brane Theory", 
  "url": "http://www.4forums.com/political/science-math-debates/8370-now-maybe-physicists-will-hear-out-my-hairy-brane-theory.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 8370, 
  "discussion_files": [
   [
    "21034.html", 
    "http://www.4forums.com/political/science-math-debates/8370-now-maybe-physicists-will-hear-out-my-hairy-brane-theory-print.html"
   ]
  ], 
  "identifier": 8370
 }
]