[
 [
  [
   218879, 
   null, 
   "GodIsDead", 
   "I don't ever intend to get married. Whenever I express this to somebody they respond like that is a decision that requires some justification. Neither my girlfriend or I are religious people, nor do we like parties, so holy matrimony and a wedding are out. If I were to get a legal marriage I would just be having the government affirm my relationship, what do I care about what the government thinks of my relationship? Admittedly Marriage is a tradition in both of our families, but that doesn't really mean much to me. So I don't see that there is any justification for my getting married.\n \n Furthermore, though I don't need to in order to justify not getting married, I can think of justification for avoiding marriage. I think its inauthentic, peoples feelings and emotions change all the time, how can a person really promise to always feel a particular way? Also, I've heard multiple accounts of people feeling trapped by marriage. I knew a guy, John, who felt the same way I do about marriage, but he discovered that he would receive some benefits at work if he was married to his girlfriend, so he did. He says that ever since their relationship hasn't been the same because he Is never as sure of his love. He says that before they were married he took for granted that her staying with him and his staying with her, was justified only by love, but after the marriage, he could never be sure if he was with her because he really loved her, or because it would be difficult to leave her or if she felt the same way.\n \n is there any good reason to face the negitive possiblitys and get married?", 
   {
    "post_info": {
     "post_title": "What\u0092s the big deal about marriage?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1151186520.0
  ], 
  [
   218907, 
   null, 
   "georged", 
   "is there any good reason to face the negitive possiblitys and get married?\n\n \n Legal marriage is accepted by general society as a financial and moral commitment statement between two people. Depending on your lifestyle and personal wealth, lack of same could close social and financial doors. It remains a personal decision within society not devoted to rituals and/or power.", 
   {}, 
   218879, 
   null, 
   1151208720.0
  ], 
  [
   218909, 
   null, 
   "GodIsDead", 
   "oh, i guess that makes sence.", 
   {}, 
   218907, 
   null, 
   1151212500.0
  ], 
  [
   218944, 
   null, 
   "Ripskar", 
   "For me it would be like life insurance, if I got killed the girl I loved would have a right to my property, be informed of my fate and recieve a pension.\n Living in the forces I know of a couple of cases where the first a long term girlfriend/common law wife learned of her lover's death was being evicted from his billet.", 
   {}, 
   218909, 
   null, 
   1151234580.0
  ], 
  [
   219001, 
   null, 
   "Master_Shake", 
   "Sounds like a guy trying to find a justification to not get married emoticon_xangel", 
   {}, 
   218944, 
   null, 
   1151276040.0
  ], 
  [
   219088, 
   null, 
   "GodIsDead", 
   "haha, no, not really. my girlfrend and i bolth agree on this. its one of the things we enjoyed agreeing with eachother on during some of our first conversations with eachother, while we were still getting to know eachother. we have been together a long time, and to tell you the truth, its hard sometiems. She really knows that she dosent have to stay with me, and while that makes our realtionship feel very real to me - at other times i must admit that i feel like i wish that i could just know that she couldent just leave if she wanted to. on the other hand though, as much as that would give me some comfrot somtimes, i dont feel like it would be right, or real.", 
   {}, 
   219001, 
   null, 
   1151303220.0
  ], 
  [
   219089, 
   null, 
   "Master_Shake", 
   "I think it's one thing to think that marriage isn't right for a particular relationship, I think it's another to say it will never be right for you for any relationship.\n \n And like georged said, it only has as much religious significance as you want it to, but it has non-religious significance as well.", 
   {}, 
   219088, 
   null, 
   1151303460.0
  ], 
  [
   219093, 
   null, 
   "Ooaman", 
   "haha, no, not really. my girlfrend and i bolth agree on this. its one of the things we enjoyed agreeing with eachother on during some of our first conversations with eachother, while we were still getting to know eachother. we have been together a long time, and to tell you the truth, its hard sometiems. She really knows that she dosent have to stay with me, and while that makes our realtionship feel very real to me - at other times i must admit that i feel like i wish that i could just know that she couldent just leave if she wanted to. on the other hand though, as much as that would give me some comfrot somtimes, i dont feel like it would be right, or real.\n\n Even in marriage, a person can \"get out\" of it. It's a thing called divorce. Of course, that winds up with a bunch of legal stuff which you might find to be more of a hassle.", 
   {}, 
   219088, 
   null, 
   1151304120.0
  ], 
  [
   219148, 
   null, 
   "simone", 
   "But, Polish and Italian weddings are fun!", 
   {}, 
   219093, 
   null, 
   1151338500.0
  ], 
  [
   220303, 
   null, 
   "trebor", 
   "I don't ever intend to get married. Whenever I express this to somebody they respond like that is a decision that requires some justification. Neither my girlfriend or I are religious people, nor do we like parties, so holy matrimony and a wedding are out. If I were to get a legal marriage I would just be having the government affirm my relationship, what do I care about what the government thinks of my relationship? Admittedly Marriage is a tradition in both of our families, but that doesn't really mean much to me. So I don't see that there is any justification for my getting married.\n \n Furthermore, though I don't need to in order to justify not getting married, I can think of justification for avoiding marriage. I think its inauthentic, peoples feelings and emotions change all the time, how can a person really promise to always feel a particular way? Also, I've heard multiple accounts of people feeling trapped by marriage. I knew a guy, John, who felt the same way I do about marriage, but he discovered that he would receive some benefits at work if he was married to his girlfriend, so he did. He says that ever since their relationship hasn't been the same because he Is never as sure of his love. He says that before they were married he took for granted that her staying with him and his staying with her, was justified only by love, but after the marriage, he could never be sure if he was with her because he really loved her, or because it would be difficult to leave her or if she felt the same way.\n \n is there any good reason to face the negitive possiblitys and get married?\n\n \n There are a few benefits for being married. In our scoiety it is not so much of a religious insitutition as a economic one. 1) there are tax benefits (assuming you are in the states). 2) A spouce has rights for authorising medical treatment in case of a medical emergancy where the other partner is not able to respond for some reason. 3) the inheritance\n law are a lto simpler. If your partner dies without a will, didyou know their heirs in come into your apartment, and take half of anything they want, unless you have evidence it si yours alone? 4) if there should be offspring, there is protection provided by the law for the wellbeing of those kids. You, as their father (you hope at least), have more rights for them (and more obligations of course).", 
   {
    "unicode_changes_made": true
   }, 
   218879, 
   null, 
   1151774820.0
  ], 
  [
   228258, 
   null, 
   "somnolence", 
   "My SO and I are not jumping up and down to get married or to live together, but we probably will get married at some point for the legal benefits. We don't want a wedding or rings or any of those trappings either. I can't stand stuff on my fingers or hands, so I won't ever wear a ring no mater what it's for anyways. We may even decide to maintain seperate residences after we marry depending on the circumstances, and will definiately maintain seperate finances for the most part. If it ain't broke, don't fix it. :)", 
   {}, 
   220303, 
   null, 
   1156131000.0
  ], 
  [
   228309, 
   null, 
   "simone", 
   "Somnolence! Not even a Polish wedding? No polkas, no wild drinking contests??", 
   {}, 
   228258, 
   null, 
   1156176360.0
  ], 
  [
   228365, 
   null, 
   "somnolence", 
   "Somnolence! Not even a Polish wedding? No polkas, no wild drinking contests??\n\n \n \n lol, no my last wedding satisfied my curiousity about the whole event plenty, and my SO finds the whole idea mortifying. I'm inclined to agree. emoticon_rolleyes", 
   {}, 
   228309, 
   null, 
   1156204440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What\u0092s the big deal about marriage?", 
  "url": "http://www.4forums.com/political/society-debates/8378-what-s-big-deal-about-marriage.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 8378, 
  "discussion_files": [
   [
    "24630.html", 
    "http://www.4forums.com/political/society-debates/8378-what-s-big-deal-about-marriage-print.html"
   ]
  ], 
  "identifier": 8378
 }
]