[
 [
  [
   219357, 
   null, 
   "Dr_Sprocket", 
   "Are mind and soul two separate things?", 
   {
    "post_info": {
     "post_title": "Are mind and soul two separate things?"
    }
   }, 
   null, 
   null, 
   1151382540.0
  ], 
  [
   219402, 
   null, 
   "trebor", 
   "Are mind and soul two separate things?\n\n \n Define \"Soul\". If you mean by a thing that is seperate from the body that lasts forever, it doesn't exist at all.", 
   {}, 
   219357, 
   null, 
   1151417280.0
  ], 
  [
   219405, 
   null, 
   "Dr_Sprocket", 
   "Define \"Soul\". If you mean by a thing that is seperate from the body that lasts forever, it doesn't exist at all.\n\n The thing that goes to heaven when you die.", 
   {}, 
   219402, 
   null, 
   1151421480.0
  ], 
  [
   219409, 
   null, 
   "trebor", 
   "The thing that goes to heaven when you die.\n\n \n \n AH.\n \n Then, it doesn't exist. THere is no afterlife.", 
   {}, 
   219405, 
   null, 
   1151422800.0
  ], 
  [
   219414, 
   null, 
   "Ripskar", 
   "That description does rather rely on a belief in an afterlife.\n As such anyone who takes the Epicurean view is going to respond as above.\n Alternatively there is the sence of soul as in an artist's soul or an author's soul as expressed in his/her output.\n \n Then there's this;\n Dr. Duncan MacDougall was an early 20th century doctor in Haverhill, Massachusetts who sought to measure the weight purportedly lost by a human body when the soul departed the body upon death.\n \n In the early 1900s, MacDougall weighed dying patients in an attempt to prove that the soul was material and measurable. In March 1907, accounts of MacDougall's experiments were published in the New York Times and the medical journal American Medicine.\n \n Although generally regarded either as meaningless or considered to have had little if any scientific merit, MacDougall's finding that the human soul weighed 21 grams has become a meme in the public consciousness, and lent itself to the title of the mainstream film 21 Grams.", 
   {}, 
   219409, 
   null, 
   1151424480.0
  ], 
  [
   219416, 
   null, 
   "Dr_Sprocket", 
   "AH.\n \n Then, it doesn't exist. THere is no afterlife.\n\n Perhaps, however:\n \n I was hopping to receive the religious wisdom on the subject for a change.\n \n You relentless atheists.\n \n Stop frightening the timid religious people away.", 
   {}, 
   219409, 
   null, 
   1151424660.0
  ], 
  [
   219424, 
   null, 
   "trebor", 
   "That description does rather rely on a belief in an afterlife.\n As such anyone who takes the Epicurean view is going to respond as above.\n Alternatively there is the sence of soul as in an artist's soul or an author's soul as expressed in his/her output.\n\n \n \n That, of course, is why I asked for a definition. If you are talking about the 'soul' as experessed in an artists output, then the 'soul' is the part of the mind that uses artistic abilty to describe an emotional. As such, it is a subsection of the 'mind'.", 
   {}, 
   219414, 
   null, 
   1151425860.0
  ], 
  [
   219426, 
   null, 
   "Kronus", 
   "This will probably devolve into a debate about definitions, however...\n \n The mind is the bit that thinks, right? If you're sentient in any meaningful way you must have a mind. So, if you have an afterlife, wherever your soul is supposed to go, than what happens there? Are you just a free-floating energy blob? Or are you conscious of existing, do you have some sort of free will? If the later than you must have some sort of mind. Now whether that mind is seperate from the soul or not sounds like exactly the same debate as whether the mind is seperate from the brain in living people. Last I checked that was still an open question.", 
   {}, 
   219416, 
   null, 
   1151425920.0
  ], 
  [
   219429, 
   null, 
   "Dr_Sprocket", 
   "This will probably devolve into a debate about definitions, however...\n \n The mind is the bit that thinks, right? If you're sentient in any meaningful way you must have a mind. So, if you have an afterlife, wherever your soul is supposed to go, than what happens there? Are you just a free-floating energy blob? Or are you conscious of existing, do you have some sort of free will? If the later than you must have some sort of mind. Now whether that mind is seperate from the soul or not sounds like exactly the same debate as whether the mind is seperate from the brain in living people. Last I checked that was still an open question.\n\n So you soul has your mind?\n \n Or your mind has your sole?", 
   {}, 
   219426, 
   null, 
   1151426400.0
  ], 
  [
   219431, 
   null, 
   "Kronus", 
   "So you soul has your mind?\n \n Or your mind has your sole?\n\n \n \"Has\"? Come on, gimme something to work with here. What are you trying to ask? What is \"has\" supposed to mean? Feel free to use lots of words, whole paragraphs if you like. I don't mind. :)", 
   {}, 
   219429, 
   null, 
   1151426760.0
  ], 
  [
   219433, 
   null, 
   "Dr_Sprocket", 
   "\"Has\"? Come on, gimme something to work with here. What are you trying to ask? What is \"has\" supposed to mean? Feel free to use lots of words, whole paragraphs if you like. I don't mind. :)\n\n Is your soul a component of your mind?\n \n Or is your mind a component of your sole?", 
   {}, 
   219431, 
   null, 
   1151427120.0
  ], 
  [
   219434, 
   null, 
   "trebor", 
   "So you soul has your mind?\n \n Or your mind has your sole?\n\n \n \n My Mind does not have my sole. My foot does", 
   {}, 
   219429, 
   null, 
   1151427120.0
  ], 
  [
   219440, 
   null, 
   "Dr_Sprocket", 
   "My Mind does not have my sole. My foot does\n\n I thought atheists believed that they have no souls and thus be without no shoes on there feet.\n \n It's that simple idea that has made me complete!", 
   {
    "unicode_changes_made": true
   }, 
   219434, 
   null, 
   1151427840.0
  ], 
  [
   219441, 
   null, 
   "Kronus", 
   "Is your soul a component of your mind?\n \n Or is your mind a component of your sole?\n\n \n You ask some interesting questions some times, but your habit of only posting short disjointed sentences makes it really hard to hold a real debate. What's your motivation behind your questions? What are you thinking? The more you write the better the conversation will go.\n \n First off, are you in fact assuming that you're still sentient after you die? Do you think you do have a mind at all? And your questions seem to be assuming that mind and soul are not, in fact, seperate things. Is that right? And how can one non-physical thing be a component of another? I mean, my heart is a component of my body, and not the other way around; that's clear. But I don't see how non-corporial things can be considered to have components.", 
   {}, 
   219433, 
   null, 
   1151427900.0
  ], 
  [
   219442, 
   null, 
   "sinjin", 
   "I don't believe in souls or minds.", 
   {}, 
   219441, 
   null, 
   1151428260.0
  ], 
  [
   219443, 
   null, 
   "Dr_Sprocket", 
   "You ask some interesting questions some times, but your habit of only posting short disjointed sentences makes it really hard to hold a real debate. What's your motivation behind your questions? What are you thinking? The more you write the better the conversation will go.\n \n First off, are you in fact assuming that you're still sentient after you die? Do you think you do have a mind at all? And your questions seem to be assuming that mind and soul are not, in fact, seperate things. Is that right? And how can one non-physical thing be a component of another? I mean, my heart is a component of my body, and not the other way around; that's clear. But I don't see how non-corporial things can be considered to have components.\n\n I figure every one here is smart enough to figure me out.\n \n I'm not really that hard, of that theres no doubt.", 
   {}, 
   219441, 
   null, 
   1151428440.0
  ], 
  [
   219444, 
   null, 
   "Dr_Sprocket", 
   "You ask some interesting questions some times, but your habit of only posting short disjointed sentences makes it really hard to hold a real debate. What's your motivation behind your questions? What are you thinking? The more you write the better the conversation will go.\n \n First off, are you in fact assuming that you're still sentient after you die? Do you think you do have a mind at all? And your questions seem to be assuming that mind and soul are not, in fact, seperate things. Is that right? And how can one non-physical thing be a component of another? I mean, my heart is a component of my body, and not the other way around; that's clear. But I don't see how non-corporial things can be considered to have components.\n\n The questions in your second paragraph sound good to me.\n \n Lets start with those, now, who has some answers for free?", 
   {}, 
   219441, 
   null, 
   1151428860.0
  ], 
  [
   219445, 
   null, 
   "Dr_Sprocket", 
   "I don't believe in souls or minds.\n\n What do you belive in?", 
   {}, 
   219442, 
   null, 
   1151429220.0
  ], 
  [
   219446, 
   null, 
   "unkerpaulie", 
   "i think the question is trying to explore the idea of remembering events from earth when you get to heaven. your mind is basically the collective identity of one's self. if you lose your mind youre nobody. not only that, but iirc, scriptures in the bible hint that we will meet our loved ones there, meaning that we will have some level of earthly memory, and therefore some level of earthly identity\n \n the idea is kinda hard to justify, but i suppose god will use his miraculous power to selectively delete feelings of sadness and worry and bad memories, while keeping intact the memories of those we loved, as well as the fact that we were christians during our earthly lives, so we wouldnt be wondering how we got there. ironically enough, we would forget any memory of any loved ones we might have had who ended up in hell as well, since remembering them would understandably be very grievious\n \n to answer the question, i suppose the ideal scenario would be that the soul and the mind are seperate, but selective chunks of your mind are deleted as it accompanies your soul to its final afterlife destination\n \n hope that helps :)", 
   {}, 
   219441, 
   null, 
   1151429280.0
  ], 
  [
   219460, 
   null, 
   "Dr_Sprocket", 
   "i think the question is trying to explore the idea of remembering events from earth when you get to heaven. your mind is basically the collective identity of one's self. if you lose your mind youre nobody. not only that, but iirc, scriptures in the bible hint that we will meet our loved ones there, meaning that we will have some level of earthly memory, and therefore some level of earthly identity\n \n the idea is kinda hard to justify, but i suppose god will use his miraculous power to selectively delete feelings of sadness and worry and bad memories, while keeping intact the memories of those we loved, as well as the fact that we were christians during our earthly lives, so we wouldnt be wondering how we got there. ironically enough, we would forget any memory of any loved ones we might have had who ended up in hell as well, since remembering them would understandably be very grievious\n \n to answer the question, i suppose the ideal scenario would be that the soul and the mind are seperate, but selective chunks of your mind are deleted as it accompanies your soul to its final afterlife destination\n \n hope that helps :)\n\n Why do you say, the ideal scenario would be that the soul and the mind are separate?\n \n Why is that ideal scenario?", 
   {}, 
   219446, 
   null, 
   1151432460.0
  ], 
  [
   219478, 
   null, 
   "GodIsDead", 
   "Define \"Soul\". If you mean by a thing that is seperate from the body that lasts forever, it doesn't exist at all.\n\n \n \nThis will probably devolve into a debate about definitions\n\n \n Soul and Mind are words. words do not have absolute deffinitions - they are creative expresssions that intend to refer to consepts. in some contexts used by some people, mind and soul can refer to the same thing, in other context and by differarnt people they could be used in opposition to eachother.\n \n i think its safe to say that bolth of these words are generaly used to refer to the nonphisical things about a person. i would think the term 'mind' has more secular connotations, i generaly use it to refer to my thoughts and ideas in terms of a location containing or produceing them. On the other hand, i would think that the term 'Soul' has religous connotations (but not nessiarly, as has been ponited out). 'Soul' is not really a term i use very much, if at all, so im not srue what it means to me.\n \n this is a great question though - what nonphisical things about a person are there? is the mind an actual thing in any real way? or is it just a way of talking about ideas and thoughts that are your own as a group while in reality they dont nessiarly exist in the same place or come from the same place? do your thoughts and ideas continue to exist after you die? (is your mind your soul?) or is it something else that continues to exist after you die? did this something else exist before you died?", 
   {}, 
   219402, 
   null, 
   1151438160.0
  ], 
  [
   219486, 
   null, 
   "unkerpaulie", 
   "Why do you say, the ideal scenario would be that the soul and the mind are separate?\n \n Why is that ideal scenario?\n\n because it would best fit the ideology of afterlife and heaven and bible theology\n \n the bible actually teaches that the mind and soul are seperate. while everybody's mind is remarkably unique, because they are based on individual experiences and perspectives, all souls have only 2 states: pure and tarnished. the remedy for a tarnished soul is repentence and faith that jesus has purified it. its actually a very simple process. but each soul is associated with its unique mind counterpart, making that soul unique in itself.\n \n now that i think about it, it probably wouldnt matter if you believe that the soul is a part/function of the mind, because the results would work out the same anyway...", 
   {}, 
   219460, 
   null, 
   1151440500.0
  ], 
  [
   219490, 
   null, 
   "Ripskar", 
   "i think its safe to say that bolth of these words are generaly used to refer to the nonphisical things about a person. i would think the term 'mind' has more secular connotations, i generaly use it to refer to my thoughts and ideas in terms of a location containing or produceing them. On the other hand, i would think that the term 'Soul' has religous connotations (but not nessiarly, as has been ponited out). 'Soul' is not really a term i use very much, if at all, so im not srue what it means to me.\n \n this is a great question though - what nonphisical things about a person are there? is the mind an actual thing in any real way? or is it just a way of talking about ideas and thoughts that are your own as a group while in reality they dont nessiarly exist in the same place or come from the same place? do your thoughts and ideas continue to exist after you die? (is your mind your soul?) or is it something else that continues to exist after you die? did this something else exist before you died?\n\n \n Personally I see 'mind' as being more associated with 'personality', we have observed that personality can change after brain injury. In the religous context does this mean their soul has changed?\n After my grandmother had a stroke it wasn't till she tried to talk that I could tell she was 'still the same person' on the other hand my grandfather's personality did change after he had a stroke.", 
   {}, 
   219478, 
   null, 
   1151442000.0
  ], 
  [
   219520, 
   null, 
   "Dr_Sprocket", 
   "It seems we are having difficulty dividing the two.", 
   {}, 
   219490, 
   null, 
   1151456340.0
  ], 
  [
   219596, 
   null, 
   "unkerpaulie", 
   "this is a great question though - what nonphisical things about a person are there? is the mind an actual thing in any real way? or is it just a way of talking about ideas and thoughts that are your own as a group while in reality they dont nessiarly exist in the same place or come from the same place? do your thoughts and ideas continue to exist after you die? (is your mind your soul?) or is it something else that continues to exist after you die? did this something else exist before you died?\n\n if there is an afterlife, then the soul must continue to exist after you die. the mind and body apparently are destroyed completely when you die (unless youre mummified/preserved, etc) and at the time of the rapture both your body and mind will be miraculously regenerated, so that youll look and feel like you, but a bit different. for one thing, your body will be indestructible, immune to disease, pain and any form of malfunction. cripple and mentally challenged people that make it to heaven will be fully functional and normal. bodies with physical deformities and missing parts will be replaced with structrally whole ones. as for the mind, any tendencies towards corrupt or malicious thoughts will be fully removed, and i suppose everyone will be optimally healthy and alert and in a perpetual state of feeling good\n \n the soul is the only thing that completely stays intact. if it was impure before death, it will be impure during the afterlife, and youll end up resurrected in hell after the rapture. i'm not sure what kind of transformation will take place in the mind, but i suppose it would make sense for hell residents to have renewed mind that are incapable of hope and solutions, and so are constantly spiralling downward in despair. also, the ressurected bodies in hell would probably be indestructible as well, so that being subject to an enternity of torture and abuse wouldnt destroy them. its actually harder to imagine a body being constantly physically damaged and not being able to heal, yet never dying, but hey, its what the bible says :)", 
   {}, 
   219478, 
   null, 
   1151507100.0
  ], 
  [
   219598, 
   null, 
   "Dr_Sprocket", 
   "Both your body and mind will be miraculously regenerated, so that youll look and feel like you, but a bit different. for one thing, your body will be indestructible, immune to disease, pain and any form of malfunction. cripple and mentally challenged people that make it to heaven will be fully functional and normal. bodies with physical deformities and missing parts will be replaced with structrally whole ones. as for the mind, any tendencies towards corrupt or malicious thoughts will be fully removed, and i suppose everyone will be optimally healthy and alert and in a perpetual state of feeling good\n\n Holy XXXX!\n \n I wanna stick it in a syringe and shoot it up!", 
   {}, 
   219596, 
   null, 
   1151507580.0
  ], 
  [
   219756, 
   null, 
   "Steerpike", 
   "My mind makes decisions.\n My decisions govern my actions.\n My actions are judged.\n \n Why is my soul the part of me that lasts for eternity when it is my mind that determines where i spend that eternity?", 
   {}, 
   219598, 
   null, 
   1151538180.0
  ], 
  [
   219765, 
   null, 
   "sinjin", 
   "Why is my soul the part of me that lasts for eternity when it is my mind that determines where i spend that eternity?\n\n \n They don't allow thinking in heaven. Amazing how some of us are just built for heaven isn't it?emoticon_xangel", 
   {}, 
   219756, 
   null, 
   1151539380.0
  ], 
  [
   219766, 
   null, 
   "epaphras_faith", 
   "Are mind and soul two separate things?\n\n \n This is a good question. It is a shame that some will not actually discuss the question but want to argue another question \"does the soul exist?\" \n \n That is my two cents for that. Now on to the question at hand: I heard a philosophy professor address this and found this article:\n \n \"On the Texture and Substance of the Human Soul \n Notes for a talk before BIOLA Philosophy Group, Nov. 22, 1994 \n \n --------------------------------------------------------------------------------\n \n Colin McGinn comments that \"the idea of a peculiarly mental substance is, when you think about it, extremely weird: it is quite unclear that there is any intelligible conception associated with the words `immaterial substance'. This is shown in the fact that the alleged substance tends to get characterised purely negatively; it is simply a kind of substance that is not material. But we need some more positive description of what it is if we are to be convinced that we are speaking of anything comprehensible... We are prone,...to picture it in imagination as an especially ethereal or attenuated kind of matter, stuff of the rarefied sort we imagine...the bodies of ghosts to be made of--the kind of stuff through which a hand could pass without disturbance.\" (The Character of Mind, p. 23)\n \n McGinn goes on in this passage to wonder whether \"the immaterial substance is capable of discharging the role it was introduced to play,\" and whether it is only lack of clarity about immaterial substance that \"induces us to suppose that locating mental phenomena in it is any advance on monism. The properties of the immaterial substance are supposed to constitute the nature of mental states: but what sorts of property are these? Here we seem faced with a dilemma: either we award the immaterial substance properties beyond the familiar mental properties, or we do not. If we do, thus conjecturing the existence of properties of mind hitherto undiscovered,...there will still be the question how these properties can constitute the essential nature of sensations and propositional attitudes. We cannot, without absurdity, postulate the existence of other conscious states which constitute the nature of the familiar ones; but it seems that nothing else can be the essence of our conscious states.\" (p. 24)\n \n Earlier statements by McGinn in this same work are hard to reconcile with what he says here about the \"familiar mental properties,\" and leave me, at least, somewhat uncertain as to where his real problem with mental or immaterial substance lies. Here he talks as if the problem were with what the \"familiar mental properties\" belong to or were found in, not with those properties themselves. In conformity with this he earlier said that \"Consciousnesss, like redness or sweetness, belongs to that range of properties that can be grasped only by direct acquaintance.\" (p. 12) Concepts--such as sensation and belief--that apply to consciousness \"can be grasped only through acquaintance with what they are concepts of,\" and hence are, in his terms, ineffable. But then he goes on to say some very remarkable things, in this earlier passage: namely, that \"consciousness is elusive even to acquaintance, as an exercise in introspection will reveal. Consider you consciousness of some item--an external object, your own body, a sensation--and try to focus attention on that relation: as many philosophers have observed, this relation of consciousness to its objects is peculiarly impalpable and diaphanous--all you come across in introspection are the objects of consciousness, not consciousness itself. This feature of consciousness has induced some thinkers to describe consciousness as a kind of inner emptiness; it is nothing per se but a pure directedness on to things other than itself. No wonder then that it is hard to say what consciousness intrinsically is.\" (pp. 12-13)\n \n I have quoted at length from McGinn because I think he gets out in a rather neat fashion many of the commonplaces about the mind or soul and how it presents itself that have framed the philosophy of mind and self since the 18th Century or before.\n Descartes says what he is and replies to objection that we have no image of the self.\n \n Locke surrenders possibility of knowledge of substance because we have no idea of substance itself, but only of a \"whatever\" that gathers qualities together.\n \n Hume draws the consequences of the Lockean epistemology and makes the famous statement that that: \"When I turn my reflexion on myself, I never can perceive this self without some one or more perceptions; nor can I ever perceive any thing but the perceptions. 'Tis the composition of these, therefore, which forms the self.\" He continues to say that \"Philosophers begin to be reconcil'd to the principle, that we have no idea of external substance, distinct from the ideas of particular qualities. This must pave the way for a like principle with regard to the mind, that we have no notion of it, distinct from the particular perceptions.\" (Appendix to his Treatise of Human Nature, pp. 634f of the Selby-Bigge edition) In the chapter, \"Of Personal Identity,\" in Book I of the Treatise he compared the mind to a theatre, \"where several perceptions successively make their appearance, pass, re-pass, glide away, and mingle in an infinite variety of postures and situations.\" Then he adds: \"The comparison of the theatre must not mislead us. They are the successive perceptions only, that constitute the mind; nor have we the most distant notion of the place, where these scenes are represented, or the materials, of which it is compos'd.\" (p. 253)\n \n Kant's section on the \"Paralogisms\" in the 1st Critique.\n \n Comte's insistence on the impossibility of grasping our mental acts by reflection: \"like a hand striking itself.\"\n \n G. E. Moore's statements, in \"The Refutation of Idealism\" (Mind, 1903), that in a sensation of blue \"the term `blue' is easy enough to distinguish, but the other element which I have called `consciousness'--that which sensation of blue has in common with sensation of green--is extremely difficult to fix. That many people fail to distinguish it at all is sufficiently shown by the fact that there are materialists. <Reeeeeaaaly!< And, in general, that which makes the sensation of blue a mental fact seems to escape us: it seems, if I may use a metaphor, to be transparent--we look through it and see nothing but the blue; we may be convinced that there is something but what it is not philosopher, I think, has yet clearly recognised.\" (p. 20 of his Philosophical Studies)\n \n And again Moore says (p. 25): \"The moment we try to fix our attention upon consciousness and to see what, distinctly, it is, it seems to vanish: it seems as if we had before us a mere emptiness. When we try to introspect the sensation of blue, all we can see is the blue: th other element is as if it were diaphanous. Yet it can be distinguished if we look attentively enough, and if we know that there is something to look for. My main object in this paragraph has been to try to make the reader see it; but I fear I shall have succeeded very ill.\"\n \n And again Moore says (p. 26): \"Introspection does enable me to decide that...I am aware of blue...., that my awareness...has to blue the simple and unique relation the existence of which alone justifies us in distinguishing knowledge of a thing from the thing known, indeed in distinguishing mind from matter.\" And: \"The relation of a sensation to its object is certainly the same as that of any other instance of experience to its object.\" (p. 28) This is the general relation of intentionality or reference, no doubt.\n \n So McGinn's statements stand in a long tradition--perhaps a long tradition of confusion. Certainly it is hard to make sense of all that McGinn says. He moves from the claim that the relation of consciousness to its object is \"peculiarly impalpable and diaphanous\" to the claim that \"all you come across in introspection are the objects of consciousnes, not consciousness itself,\" and here by \"consciousness itself\" he clearly is not refering to the substance of consciousness but \"familiar mental properties.\" But if that's all you come across, then you could not know that you were introspecting--since you are only conscious of objects of consciousness--and you would not know that consciousness is impalpable and diaphanous. And you would not know it is a \"pure directedness on to things other than itself\" (as J.-P. Sartre says: Trying to catch a bus, e.g.) And if it is pure directedness, then that is, precisely, a determinate nature and not an \"inner emptiness\" at all. And if that is true one wonders why--beyond general problems of substance and quality that afflict the physical as well as the mental--these determinate natures could not come together to form substances quite as well as the determinate natures that enter into physical objects do. Ultimately, of course, everything is \"weird.\" That is a part of what it means to be ultimate.\n \n Over against the idea that subjectivity or the mental or soulish is an emptiness stands our de facto awareness of our own mental or experiential states. When someone asks us how we feel, we can tell them in great detail. When the Optometrist asks us to look through the lenses and read the letters or report on other aspects of our visual experience, we do so promptly and accurately. There is nothing vacuous at all about what we report on. Motivational psychologists, actors, novelists, poets, interior decorators and cooks constantly report on and describe the subjective flood of mental life that makes up our existence. The idea of \"inner emptiness\" is a ridiculous contrivance of a view of mind based on the mythology of empiricism.\n \n One finds this inner flood, instead of emptiness, dealt with rather well in Wm. James Principles of Psychology, Chapters IX and X--\"The Stream of Thought\" and \"The Consciousness of Self\" respectively--though James also will have nothing to do with the soul as a substance. Chapters XVII-XXVI cover particular segments of the mental flood, from sensation to reasoning, from emotions to will, etc. etc. Edmund Husserl treats \"the pure psychical being or the psychical life...as a nature-resembling flow of events in a quasi-space of consciousness\" (\"Author's Preface to the English Edition,\" hardback ed. p. 24) Here in the nature `transcending' sphere we have an \"infinitude of knowledge previous to all deduction\" (p. 12) or theorizing, \"an absolutely independent realm of direct experience, although for reasons of an essential kind it has so far remained inaccessibe.\" (p. 11) In Being and Nothingness, J.-P. Sartre takes 900 pages of turgid French to describe that `nothing' that is the life of the mind. John Searle states that it is an obvious fact about our own experience that \"we are all conscious and that our conscious states have quite specific irreducible phenomenological properties.\" (Rediscovery of the Mind, p. 28) And: \"Beliefs and desires are experienced as such, and they are certainly not `postulated' to explain behavior, because they are not postulated at all.\" (p. 61) He emphasizes throughout his book \"the enormous variety of our consciousness life\" (p. 227), which we \"experience as such,\" though not \"incorrigibly\" or by some special faculty of \"introspection.\"\n \n The \"inner emptiness\" line cannot account for what we actually know about the flow of reality that makes up our own lives. Empiricism as a theory of knowledge is a recognized failure in any form that has been definitely specified, and has nothing left to support it but the bias of a sensualistic culture. There is no reason to regard conclusions about mind or substance that derive from it as serious challenges to what the ordinary, thoughtful and experienced person assumes to be the case about self-knowledge and self-identity. Anything that we can accurately report about our experience must be assumed to be the case, and there are a huge number of things of various general types that any individual can accurately report about their own minds and experience. It is these accurately reportable events and structures that make up the texture of the human mind and soul and reveal its substance.\"\n \n You can see the article at: http://www.dwillard.org/articles/artview.asp?artID=49 \n \n This article (particularly in the highlighted area) equates mind with soul. It is an awareness, a coordination of other parts including emotion and body. This article is primarily about the logical existence of something called soul but goes a great deal to the actual nature of it.\n \n EF", 
   {}, 
   219357, 
   null, 
   1151539440.0
  ], 
  [
   219769, 
   null, 
   "sinjin", 
   "What do you belive in?\n\n \n Almost forgot.\n \n I believe I'm not. It just feels that way.", 
   {}, 
   219445, 
   null, 
   1151539560.0
  ], 
  [
   219814, 
   null, 
   "trebor", 
   "This is a good question. It is a shame that some will not actually discuss the question but want to argue another question \"does the soul exist?\" \n \n That is my two cents for that. Now on to the question at hand: I heard a philosophy professor address this and found this article:\n \n <long c/p removed<\n You can see the article at: http://www.dwillard.org/articles/artview.asp?artID=49 \n \n This article (particularly in the highlighted area) equates mind with soul. It is an awareness, a coordination of other parts including emotion and body. This article is primarily about the logical existence of something called soul but goes a great deal to the actual nature of it.\n \n EF\n\n \n So, other than using someone else's rather long, involved, boring words \n filled with unwarented assumptions, what do you think?", 
   {}, 
   219766, 
   null, 
   1151547600.0
  ], 
  [
   219866, 
   null, 
   "Dr_Sprocket", 
   "Almost forgot.\n \n I believe I'm not. It just feels that way.\n\n Not going to believe?", 
   {}, 
   219769, 
   null, 
   1151589840.0
  ], 
  [
   219870, 
   null, 
   "unkerpaulie", 
   "My mind makes decisions.\n My decisions govern my actions.\n My actions are judged.\n \n Why is my soul the part of me that lasts for eternity when it is my mind that determines where i spend that eternity?\n\n because as far as the afterlife is concerned, only the soul matters. even though your body and mind are destroyed after you die, apparently all the data necessary to recover your mind and body are stored in a celestial database, and at the time of the rapture ALL the records of every single person that ever lived are retrieved. those that match a pure soul are recovered with renewed bodies and minds customized for heaven (i.e., all corrupt tendencies and flaws are purged), and those that match a tarnished soul are also recovered but with specially fitted bodies and souls customized for maximum torment in hell.\n \n so when you think about it, your mind and body technically last forever, but its the state of your soul that determines how your mind and body spend eternity", 
   {}, 
   219756, 
   null, 
   1151593140.0
  ], 
  [
   219919, 
   null, 
   "epaphras_faith", 
   "So, other than using someone else's rather long, involved, boring words \n filled with unwarented assumptions, what do you think?\n\n \n You presume to tell a professor of philosophy at USC that his words are full of unwarrented assumptions. Now I know that you are truly illogical. This man is one of the formost logicians and philosophers in the country. He lectures all over the country and has written many many papers and has a vitae that makes you look like a kinder gartner.\n \n Just because it is over your head or you refused to read it and actually understand it doesn't mean it is poorly argued. \n \n Your above post is totally irrelevant, non topical, non argument. I have stated clearly what I think and posted this article as it clearly stated in a thoughtful and logical manner exactly what I think. If you are unable to argue against this logically that is fine, just don't post an argument. But, if you are going to say that he is using assumptions, point them out, argue them thoughtfully and logically, and by the way tell us why your thoughts have more validity than those of a man with such high credentials.\n \n EF", 
   {}, 
   219814, 
   null, 
   1151612940.0
  ], 
  [
   219928, 
   null, 
   "trebor", 
   "You presume to tell a professor of philosophy at USC that his words are full of unwarrented assumptions. Now I know that you are truly illogical. This man is one of the formost logicians and philosophers in the country. He lectures all over the country and has written many many papers and has a vitae that makes you look like a kinder gartner.\n \n Just because it is over your head or you refused to read it and actually understand it doesn't mean it is poorly argued. \n \n Your above post is totally irrelevant, non topical, non argument. I have stated clearly what I think and posted this article as it clearly stated in a thoughtful and logical manner exactly what I think. If you are unable to argue against this logically that is fine, just don't post an argument. But, if you are going to say that he is using assumptions, point them out, argue them thoughtfully and logically, and by the way tell us why your thoughts have more validity than those of a man with such high credentials.\n \n EF\n\n \n Why, yes, I do. He is making assumptions that I do not see any evidnece for.\n \n Most 'philophers' build a structure based on their assumptions, and I do not have the same assumptions about 'Mind' and \"soul' this guy does.\n \n He plays word games that in my opnion are meaningless.", 
   {}, 
   219919, 
   null, 
   1151614980.0
  ], 
  [
   219937, 
   null, 
   "epaphras_faith", 
   "Why, yes, I do. He is making assumptions that I do not see any evidnece for.\n\n \n Assertion. NO specifics as to what assumptions or how they are assumptions and specifics on what needs and does not need evidence. Argument falls due to a lack of an actual argument.\n \n \nMost 'philophers' build a structure based on their assumptions, and I do not have the same assumptions about 'Mind' and \"soul' this guy does.\n Opinion. Possibly admissable but no credentials given concerning the one opining that could be compared to the credentials of a major university professor professor and national lecturer. Argument falls for lack of source evidence.\n \n \nHe plays word games that in my opnion are meaningless.\n Opinoin, assertion. No specifics applied. Word games not specified nor analysis given into their alleged meaninglessness. Argument falls for lack of an actual argument. ONce again nothing more than a child saying \"I said so.\"\n \n EF", 
   {}, 
   219928, 
   null, 
   1151617440.0
  ], 
  [
   219943, 
   null, 
   "unkerpaulie", 
   "to be fair, e_faith, nowhere in your reply did you indicate that this copy/paste had anything to do with your own view. you site the view of a professor, and paraphrase what you gather from the essay, and leave it at that. if you review your own post youll see that its reasonable to ask \"so what do YOU think about it?\", which is what trebor did. furthermore, you tried to take the focus away from your lack of a stated position, and onto whether the professor's opinion was substantial or not.\n \n what youve done is paste a third-hand quote that actually doesnt address the topic of this thread\n \n even the highlighted part of the article does nothing but show the author doing what youre doing: quoting somebody else's opinion without indicating their own.\n \n the real source of the opinion starts with colin mcginn, who actually does nothing but describe how engimatic the nature of the mind and soul are. in other words, everybody involved here: you, the article write, and mcginn, all agree that the mind are soul are vague and nebulous entities that nobody really has a grasp on.\n \n its very high-level question dodging, in my view...", 
   {}, 
   219937, 
   null, 
   1151618520.0
  ], 
  [
   219952, 
   null, 
   "Easyrider", 
   " (To Trebor) Assertion. NO specifics as to what assumptions or how they are assumptions and specifics on what needs and does not need evidence. Argument falls due to a lack of an actual argument.\n \n Opinion. Possibly admissable but no credentials given concerning the one opining that could be compared to the credentials of a major university professor professor and national lecturer. Argument falls for lack of source evidence.\n \n Opinoin, assertion. No specifics applied. Word games not specified nor analysis given into their alleged meaninglessness. Argument falls for lack of an actual argument. ONce again nothing more than a child saying \"I said so.\"\n \n EF\n\n \n Looks like Trebor is again unable to intellectually provide credible arguments to support his \"bum's rush\" denials.", 
   {}, 
   219937, 
   null, 
   1151621340.0
  ], 
  [
   219956, 
   null, 
   "epaphras_faith", 
   "to be fair, e_faith, nowhere in your reply did you indicate that this copy/paste had anything to do with your own view. you site the view of a professor, and paraphrase what you gather from the essay, and leave it at that. if you review your own post youll see that its reasonable to ask \"so what do YOU think about it?\", which is what trebor did. furthermore, you tried to take the focus away from your lack of a stated position, and onto whether the professor's opinion was substantial or not.\n \n what youve done is paste a third-hand quote that actually doesnt address the topic of this thread\n \n even the highlighted part of the article does nothing but show the author doing what youre doing: quoting somebody else's opinion without indicating their own.\n \n the real source of the opinion starts with colin mcginn, who actually does nothing but describe how engimatic the nature of the mind and soul are. in other words, everybody involved here: you, the article write, and mcginn, all agree that the mind are soul are vague and nebulous entities that nobody really has a grasp on.\n \n its very high-level question dodging, in my view...\n\n \n I see your point. I simply agree with his equation of soul with mind. It is why I posted it. \n \n It is not high level question dodging. It is an attempt to to answer a question that in its nature is nebulous. Nobody really has a grasp on it is true, that is why I went to someone with some credentials in the field of philosophy. It is a philosophical question and needed more than I had. I found someone who stated my position eloquently and offered it up for discussion.\n \n It is not the question of what I think that was bothersome it was the statement: \"So, other than using someone else's rather long, involved, boring words filled with unwarented assumptions...\" that I took issue with. I posted what I posted because he expressed my thoughts better than I could on a very nebulous and difficult topic. I agree with the analysis and while not having read all the referenced articles in their entirety I have read some of them and skimmed the rest.\n \n I offered up legitimate food for debate and instead was tracked down a rabbit trail which is what trebor does. Trebor debates by hitting side items and leaving the issue alone or by using ad hom and declaring someone close minded or quoting out of context or by prejudicial comments. My ire here is not entirely due to info in this thread.\n \n I do apologize to all in this thread for an overreaction on my part. I should have stuck to the debate and not let it get personal. I simply tire of a lack of direct argumentation and analysis and instead attacks on me personally or issues that have nothing to do with the topic.\n \n EF", 
   {}, 
   219943, 
   null, 
   1151621820.0
  ], 
  [
   219968, 
   null, 
   "trebor", 
   "Assertion. NO specifics as to what assumptions or how they are assumptions and specifics on what needs and does not need evidence. Argument falls due to a lack of an actual argument.\n \n Opinion. Possibly admissable but no credentials given concerning the one opining that could be compared to the credentials of a major university professor professor and national lecturer. Argument falls for lack of source evidence.\n \n Opinoin, assertion. No specifics applied. Word games not specified nor analysis given into their alleged meaninglessness. Argument falls for lack of an actual argument. ONce again nothing more than a child saying \"I said so.\"\n \n EF\n\n \n \n Shrug, I am not here to debate a c/p on a web site. He isn't here to defend his position.\n \n How about if you give YOU position in your own words.", 
   {}, 
   219937, 
   null, 
   1151623980.0
  ], 
  [
   219983, 
   null, 
   "epaphras_faith", 
   "Shrug, I am not here to debate a c/p on a web site. He isn't here to defend his position.\n \n How about if you give YOU position in your own words.\n\n \n My position is his. I have now made this very clear. You can still debate me. If you disagree with something then argue against it. If you are unable or unwilling then quit bugging me.\n \n EF", 
   {}, 
   219968, 
   null, 
   1151629620.0
  ], 
  [
   219986, 
   null, 
   "trebor", 
   "My position is his. I have now made this very clear. You can still debate me. If you disagree with something then argue against it. If you are unable or unwilling then quit bugging me.\n \n EF\n\n \n Fine.. show me that you have actually read the article.. and explain what he said in your own words.\n \n Can you use your own words?", 
   {}, 
   219983, 
   null, 
   1151630640.0
  ], 
  [
   219990, 
   null, 
   "epaphras_faith", 
   "Fine.. show me that you have actually read the article.. and explain what he said in your own words.\n \n Can you use your own words?\n\n \n Very well, but if I do this and you respond with something like, \"you make unfounded assumptions,\" or \"you right wing evangelicals all....\" then I will cease discussion with you immediately.\n \n Essentially, he summarizes the findings of a number of philosophers concerning the existence of the soul and in particular the idea that the mind/soul which is equated (particularly in the highlighted section) does not exist is preposterous. He points out that the non existence of such amounts to an \"internal emptiness\" I have talked about it previously on other threads in terms of emergent downward causality (not the emptiness but the presence of the mind and soul). Her Willard points out and I agree that the fact that we can introspect and actually be aware of such a thing is evidence of the mind. If there were no such thing as mind or soul then we would simply note observations and those things around us. We would not be able to actually report what is going on inside our minds. \n \n He doesn't say this but it amounts to the difference between instinct (conditioned behavior) and having a soul/mind. \n \n The truth is that it is very simple to report what is going on inside our minds. We can tell anyone readily what we see think feel etc. We can actually report the inter-relationships between things such as seeing, feeling, thinking etc.\n \n What makes the equation of mind and soul is that they are defined throughout history as difficult to grasp \"substances\" that play a coordinating role in our conciousness. It is in conciousness and in fact, the conciousness of conciousness that provides the evidence and support for its existence.\n \n That is a bare knuckles review. It is not as eloquent or complete as Willard. I would also adopt the full article. \n \n EF", 
   {}, 
   219986, 
   null, 
   1151632080.0
  ], 
  [
   219996, 
   null, 
   "trebor", 
   "Very well, but if I do this and you respond with something like, \"you make unfounded assumptions,\" or \"you right wing evangelicals all....\" then I will cease discussion with you immediately.\n \n Essentially, he summarizes the findings of a number of philosophers concerning the existence of the soul and in particular the idea that the mind/soul which is equated (particularly in the highlighted section) does not exist is preposterous. He points out that the non existence of such amounts to an \"internal emptiness\" I have talked about it previously on other threads in terms of emergent downward causality (not the emptiness but the presence of the mind and soul). Her Willard points out and I agree that the fact that we can introspect and actually be aware of such a thing is evidence of the mind. If there were no such thing as mind or soul then we would simply note observations and those things around us. We would not be able to actually report what is going on inside our minds. \n \n He doesn't say this but it amounts to the difference between instinct (conditioned behavior) and having a soul/mind. \n \n The truth is that it is very simple to report what is going on inside our minds. We can tell anyone readily what we see think feel etc. We can actually report the inter-relationships between things such as seeing, feeling, thinking etc.\n \n What makes the equation of mind and soul is that they are defined throughout history as difficult to grasp \"substances\" that play a coordinating role in our conciousness. It is in conciousness and in fact, the conciousness of conciousness that provides the evidence and support for its existence.\n \n That is a bare knuckles review. It is not as eloquent or complete as Willard. I would also adopt the full article. \n \n EF\n\n \n \n Yes.. but you see, he basically says 'we don't know what conciousness is', and then makes assumptions about 'the soul'.\n \n His whole arguemtns (and those he quotes) are based on definitions that are so vague as to be irrelavent.", 
   {}, 
   219990, 
   null, 
   1151633280.0
  ], 
  [
   220073, 
   null, 
   "unkerpaulie", 
   "Very well, but if I do this and you respond with something like, \"you make unfounded assumptions,\" or \"you right wing evangelicals all....\" then I will cease discussion with you immediately.\n \n Essentially, he summarizes the findings of a number of philosophers concerning the existence of the soul and in particular the idea that the mind/soul which is equated (particularly in the highlighted section) does not exist is preposterous. He points out that the non existence of such amounts to an \"internal emptiness\" I have talked about it previously on other threads in terms of emergent downward causality (not the emptiness but the presence of the mind and soul). Her Willard points out and I agree that the fact that we can introspect and actually be aware of such a thing is evidence of the mind. If there were no such thing as mind or soul then we would simply note observations and those things around us. We would not be able to actually report what is going on inside our minds. \n \n He doesn't say this but it amounts to the difference between instinct (conditioned behavior) and having a soul/mind. \n \n The truth is that it is very simple to report what is going on inside our minds. We can tell anyone readily what we see think feel etc. We can actually report the inter-relationships between things such as seeing, feeling, thinking etc.\n \n What makes the equation of mind and soul is that they are defined throughout history as difficult to grasp \"substances\" that play a coordinating role in our conciousness. It is in conciousness and in fact, the conciousness of conciousness that provides the evidence and support for its existence.\n \n That is a bare knuckles review. It is not as eloquent or complete as Willard. I would also adopt the full article. \n \n EF\n\n very well. i think we agree that the mind exists. but of course i have a few questions\n 1. are you saying that a being with the ability to review its own mental input and processes autonomously (i.e., think about what he's thinking about) would mean that being has a soul?\n 2. the use of the word \"equate\" is still ambiguous. is it that the soul is equal to the mind (two equal things), or the soul and the mind are one and the same? both the mind and the soul are \"difficult to grasp substances\" as you say, but it doesnt answer the question of whether or not they are seperate", 
   {}, 
   219990, 
   null, 
   1151683980.0
  ], 
  [
   220104, 
   null, 
   "epaphras_faith", 
   "Yes.. but you see, he basically says 'we don't know what conciousness is', and then makes assumptions about 'the soul'..\n\n \n Speaking of vague.\n \n \n \nHis whole arguemtns (and those he quotes) are based on definitions that are so vague as to be irrelavent.\n\n \n your arguement is the very definition of vague. I will not debate you futher on this question since you cannot post a specific argument.", 
   {}, 
   219996, 
   null, 
   1151695680.0
  ], 
  [
   220106, 
   null, 
   "epaphras_faith", 
   "very well. i think we agree that the mind exists. but of course i have a few questions\n 1. are you saying that a being with the ability to review its own mental input and processes autonomously (i.e., think about what he's thinking about) would mean that being has a soul?\n 2. the use of the word \"equate\" is still ambiguous. is it that the soul is equal to the mind (two equal things), or the soul and the mind are one and the same? both the mind and the soul are \"difficult to grasp substances\" as you say, but it doesnt answer the question of whether or not they are seperate\n\n \n 1) I am essentially saying that although your characterization is incomplete. I defined soul or mind as those coordinating activities that complete other functions of the person including emotions and physical sensations. The term coordinating is an appropriate term. The psychological term is emergent downward causality. The spiritual term is soul. The evidence is found in if a=b and b=c then a=c. If two things are equal to the same thing then the two things are equal (transitive property)\n \n 2) I think I just answered this. Essentially I am saying that mind and soul are the same. They are different terms used in different arenas. From a christian view of the new testament mind and soul are often the same greek words. They are translated differently depending on the context so as to have a contiguous thought in the text but they have and had the same meaning.\n \n Additionally, psychology defines mind the same way that we spiritually define soul. I use the term emergent downward causality which refers to the coordinating activity that comes from the brains activity and then re-informs the brains activity so as to change that activity. Psychologists cannot point to it directly but declare it based on the observed effects. It is a not so new term to explain a very old concept.\n \n EF", 
   {}, 
   220073, 
   null, 
   1151696340.0
  ], 
  [
   220111, 
   null, 
   "trebor", 
   "Speaking of vague.\n \n \n \n \n your arguement is the very definition of vague. I will not debate you futher on this question since you cannot post a specific argument.\n\n \n What is vague about saying 'He is being vague about what \"concousness' is?? \n \n What is vague about saying 'He is making unwarrented assumptoins about 'soul'. \n \n However, I am not debating a web site. \n \n You can't come up with your won words to say ANYTHING. You jsut cut/paste, and quote from a book. That means, you don't have anything to debate.. because you dont' even understand what you believe yourself.\n \n \n I believe if you understood what you really believe, you would be able to say with your own words, rather than use a 'cut/paste', or insist you need to quote scripture.", 
   {}, 
   220104, 
   null, 
   1151698080.0
  ], 
  [
   220132, 
   null, 
   "unkerpaulie", 
   "1) I am essentially saying that although your characterization is incomplete. I defined soul or mind as those coordinating activities that complete other functions of the person including emotions and physical sensations. The term coordinating is an appropriate term. The psychological term is emergent downward causality. The spiritual term is soul. The evidence is found in if a=b and b=c then a=c. If two things are equal to the same thing then the two things are equal (transitive property)\n \n 2) I think I just answered this. Essentially I am saying that mind and soul are the same. They are different terms used in different arenas. From a christian view of the new testament mind and soul are often the same greek words. They are translated differently depending on the context so as to have a contiguous thought in the text but they have and had the same meaning.\n \n Additionally, psychology defines mind the same way that we spiritually define soul. I use the term emergent downward causality which refers to the coordinating activity that comes from the brains activity and then re-informs the brains activity so as to change that activity. Psychologists cannot point to it directly but declare it based on the observed effects. It is a not so new term to explain a very old concept.\n \n EF\n\n if weight A weighs 5lbs and weight B weighs 5lbs, they are equal and of the same weight. they are two things that are the same, but they are still two seperate things\n \n anyway, if the mind is defined as the function that controls brain activity (as well as output) and feedbacks that activity into the brain for reevaluation and more processing, then other animals besides humans also do this. and if a being that does this has a soul (being that soul and mind are one and the same) would you then say that animals other than humans also have souls?", 
   {}, 
   220106, 
   null, 
   1151701560.0
  ], 
  [
   220160, 
   null, 
   "epaphras_faith", 
   "if weight A weighs 5lbs and weight B weighs 5lbs, they are equal and of the same weight. they are two things that are the same, but they are still two seperate things\n \n anyway, if the mind is defined as the function that controls brain activity (as well as output) and feedbacks that activity into the brain for reevaluation and more processing, then other animals besides humans also do this. and if a being that does this has a soul (being that soul and mind are one and the same) would you then say that animals other than humans also have souls?\n\n \n Show me one study that shows that animals have a mind. That they are concious of what they think. Gorilla's communicating can easily be explained by conditioning. Show me how you can prove animals are thinking about what they think about.", 
   {}, 
   220132, 
   null, 
   1151707200.0
  ], 
  [
   220166, 
   null, 
   "epaphras_faith", 
   "What is vague about saying 'He is being vague about what \"concousness' is?? .\n\n \n You make an assertion but offer no analysis. Where specifically is the vagueness. What statement is vague? Why is it vague? That is what I mean by you are the one who is vague. You assert something and then provide no analysis to back it up. You do exactly what you claim christians do (which only shows your prejudice).\n \n \nWhat is vague about saying 'He is making unwarrented assumptoins about 'soul'. .\n What statement is unwarrented? What is your analysis of what has been said in the article or by me that is unwarrented? Nice of you to once again assert something with no analysis and no support. Quote another authority on the subject as support, use analysis why you or that authority has a better idea instead of just saying, \"That is wrong.\"\n \n \nHowever, I am not debating a web site. \n \n You can't come up with your won words to say ANYTHING. You jsut cut/paste, and quote from a book. That means, you don't have anything to debate.. because you dont' even understand what you believe yourself.\n \n \n I believe if you understood what you really believe, you would be able to say with your own words, rather than use a 'cut/paste', or insist you need to quote scripture.\n\n \n Did you look at my post. I was asked to provide what was said in my own words. I did. I did post what he said earlier and then explained it on request. I provided analysis and support. I offered logic.\n \n Your BEST arguement thus far has been, \"He is making unwarrented assumptoins about 'soul'\" and I got to tell you, you leave everybody on the board sadly wanting. In fact, those that are debating on the same side as you are done a great disservice by such arguments. \n \n Trebor, unless you truly have an argument, truly, and use actual argumentation, please do not respond to my posts. It is a free country (at least mine is) and you can do what you want, but please either learn something about philosophy and logic and debate or go to the threads where they discuss the best kind of gum.\n \n EF", 
   {}, 
   220111, 
   null, 
   1151707800.0
  ], 
  [
   220187, 
   null, 
   "trebor", 
   "Show me one study that shows that animals have a mind. That they are concious of what they think. Gorilla's communicating can easily be explained by conditioning. Show me how you can prove animals are thinking about what they think about.\n\n \n Nonsense.. gorilla's commujicating can be passed off as 'conditoning' as much as our comminuincating can be passed off as 'conditioning'.\n \n THere are also the problem solving capabilities of dolphins, parrots, octupuses.. new problems. \n \n Then, there are the experiments that show chimps have concious that the imiage in the mirorr is THEM. A chimp looking a a spot over their eye in the mirror will clean off THEIR own eye, while monkeys try to clear off the eye of the monkey in the mirror. This shows some visual self awareness.", 
   {}, 
   220160, 
   null, 
   1151712360.0
  ], 
  [
   220256, 
   null, 
   "Ripskar", 
   "Tool use by Chimps and Monkeys, including the cultural tool use that differs between Chimp troops.", 
   {}, 
   220187, 
   null, 
   1151754840.0
  ], 
  [
   220357, 
   null, 
   "unkerpaulie", 
   "Show me one study that shows that animals have a mind. That they are concious of what they think. Gorilla's communicating can easily be explained by conditioning. Show me how you can prove animals are thinking about what they think about.\n\n i dont have to, my post was in the form of a question. i'm going by the definition of a mind according to what you wrote.\n \nI defined soul or mind as those coordinating activities that complete other functions of the person including emotions and physical sensations. \n\n animals also have coordinating activities that complete their other functions including emotions and physical sensations.", 
   {}, 
   220160, 
   null, 
   1151819340.0
  ], 
  [
   220378, 
   null, 
   "Ripskar", 
   "http://news.nationalgeographic.com/news/2003/09/0917_030917_monkeyfairness_2.html\n \n Capuchins using tools and displaying a sence of fairness...\n Is this an example of mindless activity?", 
   {}, 
   220357, 
   null, 
   1151838360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are mind and soul two separate things?", 
  "url": "http://www.4forums.com/political/religion-debates/8390-mind-soul-two-separate-things.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8390, 
  "discussion_files": [
   [
    "25581.html", 
    "http://www.4forums.com/political/religion-debates/8390-mind-soul-two-separate-things-print.html"
   ], 
   [
    "25582.html", 
    "http://www.4forums.com/political/religion-debates/8390-mind-soul-two-separate-things-4-print.html"
   ], 
   [
    "25583.html", 
    "http://www.4forums.com/political/religion-debates/8390-mind-soul-two-separate-things-3-print.html"
   ], 
   [
    "25584.html", 
    "http://www.4forums.com/political/religion-debates/8390-mind-soul-two-separate-things-2-print.html"
   ]
  ], 
  "identifier": 8390
 }
]