[
 [
  [
   219418, 
   null, 
   "Bob367", 
   "Jeepers creepers! UK becomes involved in terrorism through people who are juvenile delinquents, who were converted to Islam right on the territory of this country. And now Great Britain has become a center for radicalized Islamic cells, for clerics, for open speaking against the government. And partly it started as a result of the very lax asylum laws. Thus, now we're seeing a radicalization within the large community of British Muslims, who were born and grown tall in the country, where the most citizens are humanists. And certainly it is very, very troubling and dangerous development. Take, for instance, the case of 4 young British Muslims, arrested in London. According to reports of British police they were charged with implication in terrorist activity that they had initiated together with other members of nationalist organization \"Revival of the Nation of Islam\", sponsored by notorious exiled Russian oligarch, B. Berezovsky, who, by the way, is also famous for his close friendship with terrorists of all types and has found political asylum in UK.", 
   {
    "post_info": {
     "post_title": "Jeepers creepers! UK becomes involved in terrorism through people..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1151424780.0
  ], 
  [
   219436, 
   null, 
   "peteratwar", 
   "I won't go in to the idiocies of how the UK immigration laws are working in comparison with certain other EU countries who seem to handle things better.\n \n It is high time the current poorly drafted Human Rights legislation was redrafted with a far bigger emphasis on responsibilities and less on someone whining that they are sleeping uncomfortably etc", 
   {}, 
   219418, 
   null, 
   1151427300.0
  ], 
  [
   219439, 
   null, 
   "Ripskar", 
   "Immigration laws vary enormously across the Europe from Denmarks draconian policies to Spains lunacy.\n Our problem is that we are an end point destination, but then the problem seems to be concentrated in London, and there doesn't seem to be that many imigrants elsewhere in the country.", 
   {}, 
   219436, 
   null, 
   1151427840.0
  ], 
  [
   219452, 
   null, 
   "peteratwar", 
   "as one who is living in another part, don't you believe it! Think Bradford, Leicester Birmingham and others", 
   {}, 
   219439, 
   null, 
   1151430240.0
  ], 
  [
   219455, 
   null, 
   "Jo Bennett", 
   "But, peteratwar, are all the people you're thinking of in those areas immigrants, or are they native britons whose parents or grandparents were immigrants? There is little to no evidence that our, already pretty severe, immigration and asylum rules have any effect on the radicalisation of British muslims. There is nothing substantially wrong with the current human rights legislation. Yes it protects the rights of everyone, including criminals, but that is the point, it doesn't just protect people who do as they're told, it gives everyone the right to due process and freedom from being tortured or abused by the state.", 
   {}, 
   219452, 
   null, 
   1151431200.0
  ], 
  [
   219489, 
   null, 
   "Ripskar", 
   "If I go to Chinatown in Manchester or Liverpool or the curry mile in Rusholme, most people have been born in Britain.\n If you look at any new imigrants chances are they live in London.\n Of course a fair few of them seem to be Iraqi in origin for obvious reasons.\n \n Having said that Bob's original point was about British Born Muslims not imigrants. Radicals seem to be exception rather than the norm, indeed people in their teens and twenties in general tend to be drawn to idealistic groups (Just ask Jack Straw).", 
   {}, 
   219455, 
   null, 
   1151441220.0
  ], 
  [
   219580, 
   null, 
   "peteratwar", 
   "Well, where I am living an enormous increase in immigrant numbers have been noted.\n \n I am not sure where you get the idea our immigration laws are severe. They may be in theorey in practice they might as well not be there if only 1% of news reports are correct. I will grant you the Government make all sorts of tough noises but in practice do little or nothing or the legislation is so badly drawn that with the equally poorly drafted Human Rights Legislation the lawyers have a field day in confusing the situation.\n \n If everything is so well drawn, how come the Government admit they have no idea of numbers and basically have no idea what to do. Doesn't sound like very strict or severe legislation to me.\n \n They are of course extremely strict on people who are living a good and proper life and working/studying hard but who may have strayed over their time limit. By all means get them out as fast as you can, but please welcome murderers rapist etc.\n \n If something like 800,000 have come in in the last few years as seems to be a general consensus, something is wrong somewhere.", 
   {}, 
   219489, 
   null, 
   1151490180.0
  ], 
  [
   219581, 
   null, 
   "Jo Bennett", 
   "they don't know anything about the illegal immigrants, pretty much by definition. And that will always be the case, no matter how much legislation you have, simply because there are so many possible points of entry. The idea that the government is deliberately letting in rapists and murderers is absurd. You will find it pretty difficult to get admitted to this country legally if you have a conviction for either of those. What happens to those who have been convicted in Britain and served their time is another issue, it seems bizarre to me to additionally punish people, beyond the sentence for their crime, simply for being foreign.\n \n Ultimately though, does it really matter if someone is here illegally? They can't claim benefits, if they commit a crime they're as likely to be caught as anyone else, they can't use the health service. If they can get false ID, then they'll be paying taxes on the work they do, and hence should be entitled to use the health service etc. There is no evidence linking terrorism to illegal immigration, so what's the problem.", 
   {}, 
   219580, 
   null, 
   1151492220.0
  ], 
  [
   219599, 
   null, 
   "Ripskar", 
   "And this so-called vast increase in imigrant numbers where you live has had what effect exactly?\n Where exactly are these imigrants from, proportionately?\n How do you propose counting people who arrive in the back of lorries, or on small boats?\n Illegal imigrants seem to be the victims of organised crime (Morcambe Bay) rather than any threat to the country.", 
   {}, 
   219581, 
   null, 
   1151507580.0
  ], 
  [
   219603, 
   null, 
   "georged", 
   "\n If something like 800,000 have come in in the last few years as seems to be a general consensus, something is wrong somewhere.\n\n \n At about 1.2% of the total UK population, why would you consider that to be an alarming number?", 
   {}, 
   219580, 
   null, 
   1151508300.0
  ], 
  [
   219653, 
   null, 
   "peteratwar", 
   "And growing. It is the concentration in certain areas not a spread through the whol population\n \n Certainly I have know that many who come here are hardworking and decent law abiding citizens. You should be aware that my family is multi-cultural and all get on fine. I have no problem with genuine immigrants coming in and contributing to society.\n \n However, there are too many reports on people lying their way into the country, little or no checks are done and little or no hindrance is given. One has only to look at the case of the radical preachers who are now fighting deportation who are the visible profile of the problem.\n \n A problem certainly exists in that the Government's knowledge is woefully lacking. Part of not having Police on the beat. The beat copper knew pretty well what was going on in his patch.\n \n We are a country with limited resources many of which are badly run and seem to be barely sufficient to cope with existing numbers. There are considerable criminal problems in many of the big cities much fuelled by people who have no real right to be here other than they have made life too difficult for themselves in their home countries. Tough, send them back no hesitation.\n \n Why is it now that I would take a taxi to go from A - B whereas only a few years ago I would walk it ? Where I live there has been a big increase in immigrants very many of them illegal many involved in crime. Arrests follow sooner or later but all that happens is they may or may not get locked up, deportation is a joke and back they are again.", 
   {}, 
   219603, 
   null, 
   1151517000.0
  ], 
  [
   219683, 
   null, 
   "georged", 
   "\n Why is it now that I would take a taxi to go from A - B whereas only a few years ago I would walk it ? Where I live there has been a big increase in immigrants very many of them illegal many involved in crime. Arrests follow sooner or later but all that happens is they may or may not get locked up, deportation is a joke and back they are again.\n\n \n Don't feel too shocked. In virtually any moderate to large US city that danger exists from 'legal' US citizens.", 
   {}, 
   219653, 
   null, 
   1151521020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Jeepers creepers! UK becomes involved in terrorism through people...", 
  "url": "http://www.4forums.com/political/current-events-debates/8392-jeepers-creepers-uk-becomes-involved-terrorism-through-people.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8392, 
  "discussion_files": [
   [
    "21118.html", 
    "http://www.4forums.com/political/current-events-debates/8392-jeepers-creepers-uk-becomes-involved-terrorism-through-people-print.html"
   ]
  ], 
  "identifier": 8392
 }
]