[
 [
  [
   219857, 
   null, 
   "Matthew S", 
   "Govenor Romney believes that the people should be able to vote on civil rights. He further believes that the people can and should vote on everything. http://www.365gay.com/Newscon06/06/062806romney.htm\n \n I say to the people of Massachusetts put Romneys words into action vote to outlaw the Republican party. He should have no objection since he thinks the vote of the people override the courts and all branches of government.", 
   {
    "post_info": {
     "post_title": "Romney has it wrong"
    }
   }, 
   null, 
   null, 
   1151585460.0
  ], 
  [
   219869, 
   null, 
   "Kronus", 
   "\"We have a Constitution. ... It says you vote on all matters in this country and we'll decide what is a civil right and what's not.\"\n \n Which Constitution was he reading? Certainly not the US Constitution. It's amazing the lies people will tell in their attempts to push bigotry. Actually, I guess it isn't all that amazing; what can you use to back up bigotry except lies?", 
   {}, 
   219857, 
   null, 
   1151592240.0
  ], 
  [
   219909, 
   null, 
   "Steeeeve", 
   "\"We have a Constitution. ... It says you vote on all matters in this country and we'll decide what is a civil right and what's not.\"\n \n Which Constitution was he reading? Certainly not the US Constitution. It's amazing the lies people will tell in their attempts to push bigotry. Actually, I guess it isn't all that amazing; what can you use to back up bigotry except lies?\n\n \n Well, the constitution does set up a system for how we decide what rights will be protected. I find it ironic that you say voting is not in the constitution yet gay marriage and homosexual sodomy is. Once again proving that your view on the constitution is only to suit your needs and not look at what it says.", 
   {}, 
   219869, 
   null, 
   1151604120.0
  ], 
  [
   219910, 
   null, 
   "Kronus", 
   " I find it ironic that you say voting is not in the constitution yet gay marriage and homosexual sodomy is. Once again proving that your view on the constitution is only to suit your needs and not look at what it says.\n\n \n Sort of like the way you read my posts? Only seeing what you want and not what's actually there?\n \n Any point in going on here, or shall we just assume that at some point you'll say that \"cat\" and \"dog\" mean the same thing, I'll say they don't, and you'll say I think words have no meaning? This has all the earmarks of that sort of a discussion, and I see no need to travel that same ground again.", 
   {}, 
   219909, 
   null, 
   1151604840.0
  ], 
  [
   219912, 
   null, 
   "Steeeeve", 
   "Sort of like the way you read my posts? Only seeing what you want and not what's actually there?\n \n Any point in going on here, or shall we just assume that at some point you'll say that \"cat\" and \"dog\" mean the same thing, I'll say they don't, and you'll say I think words have no meaning? This has all the earmarks of that sort of a discussion, and I see no need to travel that same ground again.\n\n Well lets put it this way...if you look at the constitution literally, it does not say you can vote on anything...but the constitution allows you to vote on anything (via numerous parts) whether it be an amendment or a bill or whatever...the constitution set up a system or voting on everything. The idea that you can't vote on Civil Rights is a funny thing. You would somehow have to define Civil Rights and we have traditionally done this by voting. Oddly enough enough the \"Civil Rights Act\" was voted on as opposed to made up by a judge. \n \n \nHe should have no objection since he thinks the vote of the people override the courts and all branches of government.\n This might be the funniest thing you have said. Yeah, the people should override the courts and all branches of government...that is how our system is set up. It even says this in the federalist papers if you ever bother to read them. Our founding fathers would probably XXXX their pants if they heard your statement.", 
   {}, 
   219910, 
   null, 
   1151609220.0
  ], 
  [
   219914, 
   null, 
   "Kronus", 
   "Well lets put it this way...if you look at the constitution literally, it does not say you can vote on anything...\n\n Actually, it quite clearly says that you vote on your representatives\n The House of Representatives shall be composed of \"Members chosen every second Year by the People of the several Statesrepresentatives\"\n \"The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof\"\n You are correct that it does not give people the right to vote on laws.\n \n \n\n but the constitution allows you to vote on anything (via numerous parts) whether it be an amendment or a bill or whatever...the constitution set up a system or voting on everything. \n\n No, it does not. Not even by implication. It doesn't forbid it; the states can decide those things on there own. But if you can find anything that suggest the Constitution explicity says that people can vote on laws, than by all means share!\n \n \n\n The idea that you can't vote on Civil Rights is a funny thing. \n \n Any point asking who said we can't? Shouldn't, perhaps. Not expicitly granted that right by the Constitution, definately. But can't? No one said that.\n \n \n\n Oddly enough enough the \"Civil Rights Act\" was voted on as opposed to made up by a judge. \n \n Romney is not talking about something being debated and voted on by the legislature, he's talking about the people voting, so your comment has no relevance. Or is this the source of your confusion here? Did you not understand that? He's not talking about the legislature at all.", 
   {}, 
   219912, 
   null, 
   1151610180.0
  ], 
  [
   219917, 
   null, 
   "Steeeeve", 
   "Romney is not talking about something being debated and voted on by the legislature, he's talking about the people voting, so your comment has no relevance. Or is this the source of your confusion here? Did you not understand that? He's not talking about the legislature at all.\n And? Why does it matter if people vote as opposed to legislature? This is not unheard of...many things in a state are voted on by the people, such as the legislature.\n \n \nAny point asking who said we can't? Shouldn't, perhaps. Not expicitly granted that right by the Constitution, definately. But can't? No one said that.\n You are granted the right to vote...what you vote on is irrelevant.\n \n \nNo, it does not. Not even by implication. It doesn't forbid it; the states can decide those things on there own. But if you can find anything that suggest the Constitution explicity says that people can vote on laws, than by all means share!\n\n You are allowed to vote for anything that is up for a vote...\n \n The right of citizens of the United States to vote shall not be denied or abridged by the United States or by any State on account of race, color, or previous condition of servitude\n \n Voting is mentioned as a right numerous times....I can't believe you are debating me on whether or not we have a right to vote.", 
   {}, 
   219914, 
   null, 
   1151611680.0
  ], 
  [
   219918, 
   null, 
   "Kronus", 
   "And? Why does it matter if people vote as opposed to legislature? This is not unheard of...many things in a state are voted on by the people, such as the legislature.\n\n Why does it matter? Because the legislature are the people with the training and experience to decide on matters of law. Not to mention the fact that that's what we, the people, elected them to do. But the point is that Romeny was simply dead wrong when he said that the right for people to vote on laws is in the Constitution. It's just not. Again I invite you to show me otherwise.\n \n \n\n You are granted the right to vote...what you vote on is irrelevant.\n\n That's almost surreal. Ok, I vote that you wear a tu-tu tomorrow!\n \n \n\n You are allowed to vote for anything that is up for a vote...\n\n Duh, that's not the issue here.\n \n \n\n Voting is mentioned as a right numerous times....I can't believe you are debating me on whether or not we have a right to vote.\n\n Good, you shouldn't believe it because I'm not. That's almost as bizarre as your original post on this thread.", 
   {}, 
   219917, 
   null, 
   1151612280.0
  ], 
  [
   219922, 
   null, 
   "Steeeeve", 
   "Why does it matter? Because the legislature are the people with the training and experience to decide on matters of law. Not to mention the fact that that's what we, the people, elected them to do. But the point is that Romeny was simply dead wrong when he said that the right for people to vote on laws is in the Constitution. It's just not. Again I invite you to show me otherwise.\n Surely you aren't saying that people can't vote on laws. Does the constitution say \"you have the right to vote on laws\"....no...it says you have the right to vote no matter what may come up (I also assume he meant US Constitution). \n \n \nThat's almost surreal. Ok, I vote that you wear a tu-tu tomorrow!\n If that comes up for a vote, I am sure you can.\n \n \nDuh, that's not the issue here.\n I take it you are taking his words at the most strict meaning. I think you took his words a little out of context to get the meaning you want out of it.\n \n \nThat's almost as bizarre as your original post on this thread.\n You seem so quick to defend rights not in the constitution by saying they are in the constitution...it just sparked my interest.\n \n I also don't see you critizing Matthew S's quote which is dead wrong as a strict reading of Romneys is.\n \n \nHe should have no objection since he thinks the vote of the people override the courts and all branches of government.\n\n This just seems on considering the federalist papers consider the \"people\" to be \"superior\" to all the branches of government.", 
   {}, 
   219918, 
   null, 
   1151614020.0
  ], 
  [
   219932, 
   null, 
   "Kronus", 
   "Does the constitution say \"you have the right to vote on laws\"....no...\n\n Thank you. That was, in fact, the entire point here. Romney says that the Constitution does grant that right. He's wrong, just as you say. That's it, that's the point of the thread. I'm glad you get it now.\n \n \n\n I take it you are taking his words at the most strict meaning. I think you took his words a little out of context to get the meaning you want out of it.\n \n\n You haven't read the article, have you? Or are you just setting things up so that my prediction will come true. Believe me, I won't be crushed if it doesn't.\n \n \n\n I also don't see you critizing Matthew S's quote which is dead wrong as a strict reading of Romneys is.\n\n He's not jockying for a shot at the Presidency. I don't particualarly see a need to worry about what Matthew says, or waste time picking at it. You wanna, feel free.", 
   {}, 
   219922, 
   null, 
   1151616540.0
  ], 
  [
   220015, 
   null, 
   "jyoshu", 
   "Actually this whole thread is misguided. The article doesn't say Romney wants to vote \"on a civil right\" (as in whether people should get what's already a right); it says he wants to vote on what defines a civil right. There's quite a difference. (Even 365Gay didn't misrepresent it in THIS case.)\n \n So . . . when people come along wanting something that's never been a civil right before (same-sex marriage) to be a civil right, and the constitution says NOTHING about it being a right, how else are we supposed to define it, exactly? Flip a coin?\n \n Question: if the gay marriage crowd knew they'd WIN a vote on gay marriage (as opposed to lose it, which they would do in reality), would they be so opposed to using voting to determine something like that? I suspect not.", 
   {}, 
   219932, 
   null, 
   1151643300.0
  ], 
  [
   220061, 
   null, 
   "foundit66", 
   "Actually this whole thread is misguided. The article doesn't say Romney wants to vote \"on a civil right\" (as in whether people should get what's already a right); it says he wants to vote on what defines a civil right. There's quite a difference. (Even 365Gay didn't misrepresent it in THIS case.)\n \n So . . . when people come along wanting something that's never been a civil right before (same-sex marriage) to be a civil right, and the constitution says NOTHING about it being a right, how else are we supposed to define it, exactly? Flip a coin?\n \n Question: if the gay marriage crowd knew they'd WIN a vote on gay marriage (as opposed to lose it, which they would do in reality), would they be so opposed to using voting to determine something like that? I suspect not.\n\n We've been over this before....\n \n INTERRACIAL MARRIAGE used to NOT be recognized as a \"civil right\" as well.\n The constitution says NOTHING about it being a right.\n The people DID vote on that issue as well, and decided against interracial marriage.\n \n In 1967, when SCOTUS established it as a constitutional right, would you rather have had history decide to take it to the people where they would have decided to KEEP IT ILLEGAL?\n By over 70% of the population voting against interracial marriage, at a margin of 3 to 1??\n \n \n ALL of these arguments have been laid out before. NO good constitutional reason has been established for denying the right of gay marriage.\n In such a case, do we really need to give the people the chance to IGNORE the constitution and vote against it anyways?\n \n Rights which the majority approve of ARE NOT the rights that need protecting.\n If we are talking about voting on rights that aren't popular, then there IS NO protection of rights in this country, but only mob rule.", 
   {}, 
   220015, 
   null, 
   1151676120.0
  ], 
  [
   220070, 
   null, 
   "jyoshu", 
   "In 1967, when SCOTUS established it as a constitutional right, would you rather have had history decide to take it to the people where they would have decided to KEEP IT ILLEGAL?\n By over 70% of the population voting against interracial marriage, at a margin of 3 to 1??\n\n \n If SCOTUS decides marriage should be defined as being between a man and a man, or a woman and woman, then SCOTUS will have spoken and I'll accept that. I wouldn't agree, but it would be the law of the land. Nevertheless, this is not the same issue as interracial marriage and the 2 issues are not the same.", 
   {}, 
   220061, 
   null, 
   1151682720.0
  ], 
  [
   220082, 
   null, 
   "joebrummer", 
   "If SCOTUS decides marriage should be defined as being between a man and a man, or a woman and woman, then SCOTUS will have spoken and I'll accept that. I wouldn't agree, but it would be the law of the land. Nevertheless, this is not the same issue as interracial marriage and the 2 issues are not the same.\n\n \n \n No you won't accept it, you will scream \"activist judges\"", 
   {}, 
   220070, 
   null, 
   1151688180.0
  ], 
  [
   220083, 
   null, 
   "Kronus", 
   "\n Question: if the gay marriage crowd knew they'd WIN a vote on gay marriage (as opposed to lose it, which they would do in reality), would they be so opposed to using voting to determine something like that? I suspect not.\n\n \n And that pretty well sums up why voting on civil rights is a bad idea. Thanks.\n \n Civil rights are there to protect the minority from the majority, the weak from the strong. It's to avoid the tyrany of the majority that we have civil rights, and why we don't let the majority decide what they are.", 
   {}, 
   220015, 
   null, 
   1151688180.0
  ], 
  [
   220123, 
   null, 
   "jyoshu", 
   "Civil rights are there to protect the minority from the majority, the weak from the strong. It's to avoid the tyrany of the majority that we have civil rights, and why we don't let the majority decide what they are.\n\n \n And you're still avoiding the central issue here. This is not about whether we should have civil rights, or their purpose--that soapbox is used up. It's about how they are defined and who defines them. I have no problem with your assessment as long as we aren't, as a nation, under the assumption that anything and everything that anyone wants to be a civl right IS one just on the basis that they want it to be. Believe it or not, there needs to be some consensus SOMEWHERE on how civil rights are defined.", 
   {}, 
   220083, 
   null, 
   1151700180.0
  ], 
  [
   220131, 
   null, 
   "Kronus", 
   "And you're still avoiding the central issue here. This is not about whether we should have civil rights, or their purpose--that soapbox is used up. It's about how they are defined and who defines them. \n\n Well, that may be your central issue. The central issue of this thread is whether or not the Constitution says that the people vote on everything, which it clearly doesn't. That was the lie Romney was telling in his push to keep the ballot initiative alive. The defintion of civil rights isn't the issue here at all.", 
   {}, 
   220123, 
   null, 
   1151701320.0
  ], 
  [
   220164, 
   null, 
   "jyoshu", 
   "That was the lie Romney was telling in his push to keep the ballot initiative alive. The defintion of civil rights isn't the issue here at all.\n\n \n Wow, you really are having trouble reading here! (Or maybe it's just easier for you respond to things people didn't say than what they did say.) I didn't say the \"definition of civil rights\" was the issue! I said it's about how they are defined and who defines them.\n \n From the 365Gay article:Boston, Massachusetts) Massachusetts Republican Gov. Mitt Romney, renewing his support for a ballot question banning gay marriage, said Wednesday it's the job of voters - not the courts or lawmakers - to define what constitutes a civil right.", 
   {}, 
   220131, 
   null, 
   1151707740.0
  ], 
  [
   220179, 
   null, 
   "BobNelson2", 
   "My, my, what authority you place in the wording of a news article. We'll have to remember that for future reference.\n \n Regardless of the wording, Romney is saying (and then retracting) that the people should vote on civil rights issues. Of course, he's ultimately correct. Afterall, the people DID decide all sorts of civil rights issues when they adopted the federal and state constitutions. What he's pushing is that the people can also vote to destroy the civil rights of a small group. Too bad the virulently anti-Mormon population of the late 1800's didn't come up with an idea like this to \"clarify\" the freedom of religion clause. (No, I don't really think that, but I sure do wish Mr. Romney would have a dream/nightmare along those lines tonight.)\n \n Typical of GOP politicians these days, he's riled up the base and can now backtrack to calm the moderates.", 
   {}, 
   220164, 
   null, 
   1151709420.0
  ], 
  [
   220192, 
   null, 
   "jyoshu", 
   "My, my, what authority you place in the wording of a news article. We'll have to remember that for future reference.\n\n \n Well this is an unusually less-biased one for 365Gay . . .", 
   {}, 
   220179, 
   null, 
   1151714400.0
  ], 
  [
   220281, 
   null, 
   "Steeeeve", 
   "Well, that may be your central issue. The central issue of this thread is whether or not the Constitution says that the people vote on everything, which it clearly doesn't. \n Actually the orignal poster said the following:\n \n\n Govenor Romney believes that the people should be able to vote on civil rights.\n\n Regardless of what the article says, that was the posters initial central issue. The answer is, yes we can vote on civil rights and yes we should.", 
   {}, 
   220131, 
   null, 
   1151768880.0
  ], 
  [
   220282, 
   null, 
   "Steeeeve", 
   "\n \n Typical of GOP politicians these days, he's riled up the base and can now backtrack to calm the moderates.\n Why limit it to GOP? You make it seem like the democrats don't do it. \n \n It amazes me that people get mad at one party for something and when their party does it....its ok.", 
   {}, 
   220179, 
   null, 
   1151769060.0
  ], 
  [
   220291, 
   null, 
   "Kronus", 
   "\n Regardless of what the article says, that was the posters initial central issue. The answer is, yes we can vote on civil rights and yes we should.\n\n \n Um, no. That's the posters first sentence. That doesn't make it his \"central issue\". You can divine that more clearly from the title \"Romney has it wrong.\"\n \n Of course, Matthew could also clear this up. Kinda silly to argue about what he meant when he can speak for himself.", 
   {}, 
   220281, 
   null, 
   1151770140.0
  ], 
  [
   220292, 
   null, 
   "Kronus", 
   " I didn't say the \"definition of civil rights\" was the issue! I said it's about how they are defined and who defines them.\n\n So how something is defined and who defines it has nothing to do with the definition? Fascinating! Just as fascinating is the fact that you, who repeatedly claims to hate nit-picking about the meaning of words, is nit-picking about the meaning of words rather than addressing what I said.", 
   {}, 
   220164, 
   null, 
   1151770260.0
  ], 
  [
   220305, 
   null, 
   "foundit66", 
   "So how something is defined and who defines it has nothing to do with the definition? Fascinating! Just as fascinating is the fact that you, who repeatedly claims to hate nit-picking about the meaning of words, is nit-picking about the meaning of words rather than addressing what I said.\n\n Sigh. You beat me to that comment...\n emoticon_xgood", 
   {}, 
   220292, 
   null, 
   1151775000.0
  ], 
  [
   220311, 
   null, 
   "MrWriteLA", 
   "Don't get him started on the meaning of the word \"nit-picking,\" now...", 
   {}, 
   220305, 
   null, 
   1151778660.0
  ], 
  [
   220345, 
   null, 
   "BobNelson2", 
   "Why limit it to GOP? \n\n \n Because Romney is running for the GOP presidential nomination and the gay-related tactics he is employing and has employed for over three years now all fit the same GOP pattern.\n \n If you have a complaint about my associating this gay-baiting stuff, take your comments to Karl Rove. They're his idea.", 
   {}, 
   220282, 
   null, 
   1151803140.0
  ], 
  [
   220352, 
   null, 
   "Matthew S", 
   "Why limit it to GOP? You make it seem like the democrats don't do it. \n \n It amazes me that people get mad at one party for something and when their party does it....its ok.\n\n \n \n The problem is that for the republicans homophobia and anti gay tactics are a systemic disease. You can pretty much bet that most if not all republicans are anti gay. This is not the case with the majority of Democrats. Yes it is bad when Democrats use anti gay tactics but the rebublican party thrives ond proudly uses anti gay tactics. In short most of the loudest anti gay politicians happen to be republican.", 
   {}, 
   220282, 
   null, 
   1151813340.0
  ], 
  [
   220416, 
   null, 
   "Steeeeve", 
   "The problem is that for the republicans homophobia and anti gay tactics are a systemic disease. You can pretty much bet that most if not all republicans are anti gay. This is not the case with the majority of Democrats. Yes it is bad when Democrats use anti gay tactics but the rebublican party thrives ond proudly uses anti gay tactics. In short most of the loudest anti gay politicians happen to be republican.\n\n \n yet you missed the point. Every politicans does this sort of tactic but on various other issues. I wouldn't even have faith in the democrats if I were you. They are clearly going to be a fair weather friend and my guess is that they are holding out of the courts making law instead of them having to take a real stance on an issue.", 
   {}, 
   220352, 
   null, 
   1151859360.0
  ], 
  [
   220421, 
   null, 
   "jyoshu", 
   "So how something is defined and who defines it has nothing to do with the definition? Fascinating! Just as fascinating is the fact that you, who repeatedly claims to hate nit-picking about the meaning of words, is nit-picking about the meaning of words rather than addressing what I said.\n\n \n Hey, you're the one quibbling about whether we should have civil rights or not, which is not what this thread started as at all, as Steeeeve pointed out", 
   {}, 
   220292, 
   null, 
   1151861580.0
  ], 
  [
   220424, 
   null, 
   "Kronus", 
   "Hey, you're the one quibbling about whether we should have civil rights or not, which is not what this thread started as at all, as Steeeeve pointed out\n\n \n Wow. I've been trying to talk about Romney being a liar, and Steve is saying the thread is about civil rights. <sarcasm<But aside from that you're dead on.</sarcasm<\n \n Do you simply have nothing to say about the fact that the governor of Masachusetts, and a likely GOP candidate for the presidency, is lying about what's in the Constitution in order to push his anti-gay agenda? No relevant comment at all?", 
   {}, 
   220421, 
   null, 
   1151862480.0
  ], 
  [
   220428, 
   null, 
   "jyoshu", 
   "Do you simply have nothing to say about the fact that the governor of Masachusetts, and a likely GOP candidate for the presidency, is lying about what's in the Constitution in order to push his anti-gay agenda? No relevant comment at all?\n\n \n Three things. (and I'm not defending Romney here--I just wonder if you're knee-jerking here a bit with the whole \"liar!\" accusation.)\n A.) Why do you assume Romney doesn't actually think of the Constitution in those terms? Given that voting is definitely part of the constitution, what's to say he doesn't believe voting in this case is consistent with the spirit of the constitution?\n \n B.) Where is your connection here to his supposed \"anti-gay agenda\"? \n \n c.) Even though you're pointing you comments over this at Romney, it seems to me that your real beef here, like Matthew, would be with the very fact that ballot initiatives like this exist. If not, then I have to wonder why it wouldn't be. So I question why your posts aren't geared toward having the ballot initiative system changed, as opposed to focusing on Romney.\n ", 
   {}, 
   220424, 
   null, 
   1151863260.0
  ], 
  [
   220445, 
   null, 
   "foundit66", 
   "If SCOTUS decides marriage should be defined as being between a man and a man, or a woman and woman, then SCOTUS will have spoken and I'll accept that. I wouldn't agree, but it would be the law of the land. Nevertheless, this is not the same issue as interracial marriage and the 2 issues are not the same.\n\n Really?\n \n I thought we were talking about Romney's discussion on voting on civil rights...\n \n Not \"the same\", but incredibly relevant.\n Do you deny it's relevance?", 
   {}, 
   220070, 
   null, 
   1151870340.0
  ], 
  [
   220484, 
   null, 
   "Matthew S", 
   "yet you missed the point. Every politicans does this sort of tactic but on various other issues. I wouldn't even have faith in the democrats if I were you. They are clearly going to be a fair weather friend and my guess is that they are holding out of the courts making law instead of them having to take a real stance on an issue.\n\n \n \n I agree with you I like the democrats a little less then the repulinazis. My heart lies with the green party. We are however in a two party system, like it or not, and I must choose the lesser of two evils. The democrat that I can count on to support 90% of gay issues is a million times better then the republican that would send me to the camps.", 
   {}, 
   220416, 
   null, 
   1151884560.0
  ], 
  [
   220587, 
   null, 
   "Kronus", 
   "\n A.) Why do you assume Romney doesn't actually think of the Constitution in those terms? Given that voting is definitely part of the constitution, what's to say he doesn't believe voting in this case is consistent with the spirit of the constitution?\n\n Because Romeny is A) a professional politician and B) not an idiot. In other words, he knows better. The Constitution doesn't say what he claimed; that's not a matter of interpretation, it's a matter of fact. Joe Blow on the street might be able to claim ignorance, but Romney has been in politics for ages; he knows what is and isn't in the Constitution.\n \n \n\n B.) Where is your connection here to his supposed \"anti-gay agenda\"? \n\n You mean my personal connection? Nothing direct, I'm just opposed to injustice in general, and really don't want to see another president, or any politician really, who thinks lying is an acceptable way to sway the public opinion.\n \n \n\n c.) Even though you're pointing you comments over this at Romney, it seems to me that your real beef here, like Matthew, would be with the very fact that ballot initiatives like this exist. If not, then I have to wonder why it wouldn't be. So I question why your posts aren't geared toward having the ballot initiative system changed, as opposed to focusing on Romney.\n \n\n I don't deny that I think the idea of voting on civil rights is utterly idiotic. That is, however, another issue for another thread, which is why I'm not addressing it here. I also have a bone to pick with lying politicians, particularly those that lie about the basic workings of our government. And that's what I'm bitching about here.\n \n \n I'm still curious. Do you have an actual stance here? Are we going to get anything out of you but questions? Are you, or are you not, upset by Romeny lying like this? Do you think lying is an acceptable tactic to overturn gay marriage?", 
   {}, 
   220428, 
   null, 
   1151938260.0
  ], 
  [
   220629, 
   null, 
   "jyoshu", 
   "Because Romeny is A) a professional politician and B) not an idiot. In other words, he knows better. The Constitution doesn't say what he claimed; that's not a matter of interpretation, it's a matter of fact.\n\n \n There's a heck of a lot more the constitution doesn't say about democracy than what it does. I find it interesting that suddenly you've turned into a constitutional literalist here . . . you know, one of those folks you argue against here from time to time that thinks the constitution is static and with no room for interpretation other than what it specifically spells out as allowable. It's unreasonable that you would expect Romney to be a constitutional literalist when you yourself are not.\n \n \nand really don't want to see another president, or any politician really, who thinks lying is an acceptable way to sway the public opinion.\n\n \n Come on now, even if Romney is truly \"lying\", I think you know that there's about as much chance of him becoming president as hell freezing over.\n \n \nAre you, or are you not, upset by Romeny lying like this? Do you think lying is an acceptable tactic to overturn gay marriage?\n\n \n What I find is that when people strongly disagree with someone's stance, they sometimes make the claim that they're \"lying\" when it often simply comes down to a different POV. I think you are kidding yourself if you don't think Romney really does believe what he says.", 
   {}, 
   220587, 
   null, 
   1151955900.0
  ], 
  [
   220658, 
   null, 
   "Kronus", 
   "There's a heck of a lot more the constitution doesn't say about democracy than what it does. I find it interesting that suddenly you've turned into a constitutional literalist here . . . you know, one of those folks you argue against here from time to time that thinks the constitution is static and with no room for interpretation other than what it specifically spells out as allowable. It's unreasonable that you would expect Romney to be a constitutional literalist when you yourself are not.\n\n There is no interpretation of the Constitution that says that people must be allowed to vote on laws. It simply is not in there. No conservative or liberal slant, no play on words, no alternate definitions, nothing can lead you to that conclusion. I invite you to show me any possible way that Romeny could legitimately have an \"interpretation\" that leads him to think people must be allowed to vote on laws. You can't, because he simply made it up from whole cloth. But if you think you've got something, than share.\n \n \n\n Come on now, even if Romney is truly \"lying\", I think you know that there's about as much chance of him becoming president as hell freezing over.\n\n Probably correct. And the more people point out his lies, the less likely it becomes.\n \n \n\n What I find is that when people strongly disagree with someone's stance, they sometimes make the claim that they're \"lying\" when it often simply comes down to a different POV. I think you are kidding yourself if you don't think Romney really does believe what he says.\n\n \n Man, you just can't do it, can you? I asked for your position, not your critique of my position. You almost took a stand with that last sentence, but you still had to couch it in terms of what I said. What's the big deal, why won't you simply tell us what you think?", 
   {}, 
   220629, 
   null, 
   1151962140.0
  ], 
  [
   220662, 
   null, 
   "BobNelson2", 
   " I think you are kidding yourself if you don't think Romney really does believe what he says.\n\n \n Yeah, I'm sure he wishes tolerance of Mormonism had been put to a vote.\n \n Actually, he might, now that I think about it. Had they banned his faith, his ancestors would have converted to some sort of Protestant sect, he'd probably still be of that faith, and his chances of being elected would be greatly improved.", 
   {}, 
   220629, 
   null, 
   1151962380.0
  ], 
  [
   220701, 
   null, 
   "jyoshu", 
   "There is no interpretation of the Constitution that says that people must be allowed to vote on laws.\n\n \n Since when do we let the constitution deterimine everything we CAN do? \n \n I'm curious, do you think it should be illegal have mail-in ballots at elections? After all, there is no interpretation of the Constitution that says that people must be allowed to be granted mail-in ballots at voting time. Do you believe ANY couples should be given marriage benefits? After all, there is no interpretation of the Constitution that says that people must be allowed to have marriage benefits to begin with, much less gay people. What if you have to take a leak on the street? The constitution doesn't spell out that public restrooms are mandatory. Guess with your view of things, you'd be having to hold it 'till you get home.\n \n And again, since when are you such a constitutional literalist???\n \n \nMan, you just can't do it, can you? I asked for your position, not your critique of my position.\n\n \n When you make premises; you shouldn't expect them to never be challenged. I already told you MY position: Romney believes what he said; it's completely irrational to think of the constitution in such a literal way that you do, so I don't think he does.", 
   {}, 
   220658, 
   null, 
   1151983560.0
  ], 
  [
   220712, 
   null, 
   "Steeeeve", 
   "I agree with you I like the democrats a little less then the repulinazis. My heart lies with the green party. We are however in a two party system, like it or not, and I must choose the lesser of two evils. The democrat that I can count on to support 90% of gay issues is a million times better then the republican that would send me to the camps.\n\n It is this line of thinking that makes me never take anything you say seriously. If you actually think republicans want to send you to a 'camp' then perhaps you better off in Europe.", 
   {}, 
   220484, 
   null, 
   1151994840.0
  ], 
  [
   220724, 
   null, 
   "Matthew S", 
   "It is this line of thinking that makes me never take anything you say seriously. If you actually think republicans want to send you to a 'camp' then perhaps you better off in Europe.\n\n \n \n Those who do not remember the past are doomed to repeat it. The gays and jews in germany in the 1920's and early 30's thought the courts and the law would protect them from the nazis. We must look at the past and see what happens when a far right, religious, fear mongering party dominates government. After all the nazi party and its policies were supported by the majority of germans. They where voted into office and as even you say, majority rules and the will of the majority must over ride the rights of the minority.", 
   {}, 
   220712, 
   null, 
   1152021360.0
  ], 
  [
   220727, 
   null, 
   "Steeeeve", 
   "Those who do not remember the past are doomed to repeat it. The gays and jews in germany in the 1920's and early 30's thought the courts and the law would protect them from the nazis. We must look at the past and see what happens when a far right, religious, fear mongering party dominates government. After all the nazi party and its policies were supported by the majority of germans. They where voted into office and as even you say, majority rules and the will of the majority must over ride the rights of the minority.\n\n \n Should we look at the past to see what happens when courts take over the rule of law?\n \n I can't exactly say what I want to say without being insulting...but your comment will speak for itself.", 
   {}, 
   220724, 
   null, 
   1152023880.0
  ], 
  [
   220728, 
   null, 
   "Matthew S", 
   "Should we look at the past to see what happens when courts take over the rule of law?\n \n I can't exactly say what I want to say without being insulting...but your comment will speak for itself.\n\n \n Because you have no examples or that you know deep down that I am right? That the republican party is showing early signs of facism and if not stopped they could become an american version of the german nazi party.\n Would you give and example of when the courts have taken over the rule of law? What you may see as the courts taking over the law may just be the courts protecting and delivering justice to a minority.", 
   {}, 
   220727, 
   null, 
   1152025020.0
  ], 
  [
   220729, 
   null, 
   "Kronus", 
   "Since when do we let the constitution deterimine everything we CAN do? \n\n That's not what Romeny said, which is the point here, remember? It's not a question of can we vote on laws, Romeny says that the Constitution specifically says we get to. The ability to vote on laws is not guaranteed in the Constitution, Romeny says it is, therefore he's a liar.\n \n \n\n I'm curious, do you think it should be illegal have mail-in ballots at elections? After all, there is no interpretation of the Constitution that says that people must be allowed to be granted mail-in ballots at voting time. \n\n I'll cover this one example, just in case you really don't get it. The Constitution says that people get to vote for their representitives. It guarantees that. The fact that you're out of state on election day shouldn't prevent you from exercising that right. Absentee ballots are one way of guaranteeing your right to vote isn't violated. So, no, absentee ballots aren't mentioned, but the right to vote is guaranteed. That's why we have those ballots. So, you're wrong, a very straight forward reading of the Constitution says that something must be done to allow out of state people to vote. But there is nothing in the Constitution that\n says one word about people voting for laws. It's just not in there, even by implication. And Romeny must know that.\n \n \n\n I already told you MY position: Romney believes what he said;\n it's completely irrational to think of the constitution in such a literal way that you do, so I don't think he does.\n\n I'm not a constitutional literalist, as you well know. And of course you aren't a sufficient non-literalist (?) to read into the Constitution anything close to what Romney has said is there. Or are you? Back up your premise, show me any way you can find anything that says people must be allowed to vote on laws. Actual quotes from the actual Constitution, please.", 
   {}, 
   220701, 
   null, 
   1152025380.0
  ], 
  [
   220734, 
   null, 
   "Steeeeve", 
   "Because you have no examples or that you know deep down that I am right? That the republican party is showing early signs of facism and if not stopped they could become an american version of the german nazi party.\n I think it is safe to say you have the most extreme view on these forums and I hope no one else support this.\n \n \n\n Would you give and example of when the courts have taken over the rule of law? What you may see as the courts taking over the law may just be the courts protecting and delivering justice to a minority.\n You don't even have to go back far for this one...just look at Europe (human \"rights\" court and even our own court).", 
   {}, 
   220728, 
   null, 
   1152026940.0
  ], 
  [
   220738, 
   null, 
   "jyoshu", 
   "That's not what Romeny said, which is the point here, remember? It's not a question of can we vote on laws, Romeny says that the Constitution specifically says we get to. \n \n But there is nothing in the Constitution that\n says one word about people voting for laws. It's just not in there, even by implication. And Romeny must know that.\n\n \n I really think you need to go back and review the 15th amendment. When you do, please show me where the amendment specifies that it's only talking about voting for 'people running for public office'.", 
   {}, 
   220729, 
   null, 
   1152030120.0
  ], 
  [
   220740, 
   null, 
   "georged", 
   "Because you have no examples or that you know deep down that I am right? That the republican party is showing early signs of facism and if not stopped they could become an american version of the german nazi party.\n\n \n Not far off the mark when administration begins making its own rules and legal interpretations under the guise of a war against an organization (Al Qaeda) while congressional oversight supports interested parties benefiting from those rules.", 
   {}, 
   220728, 
   null, 
   1152030480.0
  ], 
  [
   220742, 
   null, 
   "Matthew S", 
   "I think it is safe to say you have the most extreme view on these forums and I hope no one else support this.\n \n You don't even have to go back far for this one...just look at Europe (human \"rights\" court and even our own court).\n\n \n \n Evasion!! I gave you an example and you gave evasion. Is it possible that you don't trust and support the courts because you do not believe in justice and minority rights?", 
   {}, 
   220734, 
   null, 
   1152030780.0
  ], 
  [
   220744, 
   null, 
   "jyoshu", 
   "There is a long tradition of ballot initiative voting in this country. In the U.S. it goes all the way back to 1777, when the first such post-revolutionary-war example took place. It is an example of what's known as \"direct democracy\": an example of democracy going way back to 1630s New England colonies.\n \n What is often left out by the critics of such initiatives is that it is only allowable concerning state laws or lower. NO ballot initiative can determine anything in federal law, or to change the U.S. Constitution.\n \"Court battles over the constitutionality of direct democracy, from the early 1900s to the late 1990s, have repeatedly established that the combination of sovereign citizen lawmaking and representative government is, in fact, a historically traditional republican form of government.\"(http://en.wikipedia.org/wiki/Direct_democracy_%28history_in_the_United_States%29)", 
   {}, 
   220742, 
   null, 
   1152031200.0
  ], 
  [
   220745, 
   null, 
   "Matthew S", 
   "There is a long tradition of ballot initiative voting in this country. In the U.S. it goes all the way back to 1777, when the first such post-revolutionary-war example took place. It is an example of what's known as \"direct democracy\": an example of democracy going way back to 1630s New England colonies.\n \n What is often left out by the critics of such initiatives is that it is only allowable concerning state laws or lower. NO ballot initiative can determine anything in federal law, or to change the U.S. Constitution.\n \"Court battles over the constitutionality of direct democracy, from the early 1900s to the late 1990s, have repeatedly established that the combination of sovereign citizen lawmaking and representative government is, in fact, a historically traditional republican form of government.\"(http://en.wikipedia.org/wiki/Direct_democracy_%28history_in_the_United_States%29)\n\n \n \n I can see the usefullness and acknowledge the people right to vote on these iniatives. My problem, as a victim of these iniatives, is the subject of the iniatives. Is it morally acceptable to vote on someone elses civil rights? I just don't understand why the people, who put these discriminatory ballot iniates on the ballot, don't realize that it could be their civil rights could be on the ballot someday. Once the line is crossed everything and everything can go on the ballot.", 
   {}, 
   220744, 
   null, 
   1152032520.0
  ], 
  [
   220746, 
   null, 
   "Kronus", 
   "I really think you need to go back and review the 15th amendment. When you do, please show me where the amendment specifies that it's only talking about voting for 'people running for public office'.\n\n \n If instead of going for sarcasm you tried to actually make a point this would go much quicker. Duh, it applies to all voting. So what? How do you leap from there to \"the people must be allowed to vote on laws\". Which, as it seems I must remind you constantly, is what Romney said. If a state decides to allow people to vote on a law, then you can't be disqualified from voting because of race. Nothing there says that states must allow people, any people, to vote on laws. Anyone who says so is a liar.", 
   {}, 
   220738, 
   null, 
   1152032580.0
  ], 
  [
   220747, 
   null, 
   "Kronus", 
   "\n What is often left out by the critics of such initiatives is that it is only allowable concerning state laws or lower. NO ballot initiative can determine anything in federal law, or to change the U.S. Constitution.\n \n\n \n Gee, that almost sounds like there's nothing in the Constitution that says people must be allowed to vote on laws. It's up to the states to decide that. Exactly the opposite of what Romney said.", 
   {}, 
   220744, 
   null, 
   1152032700.0
  ], 
  [
   220763, 
   null, 
   "jyoshu", 
   "I can see the usefullness and acknowledge the people right to vote on these iniatives. My problem, as a victim of these iniatives, is the subject of the iniatives. Is it morally acceptable to vote on someone elses civil rights?\n\n \n Good point. Maybe, if ballot-initiative reform is needed, it should be simply that there are some issues that should be off-limits to voting. The thing is though, someone at some point with the authority to do so has to decree that gay marriage is indeed a civil right.\n \n \nDuh, it applies to all voting. So what? How do you leap from there to \"the people must be allowed to vote on laws\". \n\n \n Read what you just said!!\n \"it applies to ALL voting\"\n ALL voting means, ALL voting.\n \n What part if \"the right of citizens . . . to vote shall not be denied\" do you not understand? If a state wants to vote on a law, they get to do so, and the people must be allowed to do that. It's that simple. Plain as day.", 
   {}, 
   220745, 
   null, 
   1152043920.0
  ], 
  [
   220770, 
   null, 
   "Kronus", 
   "\n Read what you just said!!\n \"it applies to ALL voting\"\n ALL voting means, ALL voting.\n \n What part if \"the right of citizens . . . to vote shall not be denied\" do you not understand? If a state wants to vote on a law, they get to do so, and the people must be allowed to do that. It's that simple. Plain as day.\n\n \n How about you read what I said, since you're the one who doesn't seem to be getting it. IF something comes up for a vote, everyone gets to vote. That does not mean that EVERYTHING comes up for a vote. If a state WANTS to hold a vote, they can. The constitution does NOT say that they HAVE to. Which is the lie that Romeny told, in case you've forgotten. Do you get it? The states do not HAVE to let people vote on laws, and anyone who says they do is a liar.\n \n Frankly, I'm sure you do understand this. What's your real problem here, why the dog and pony show? What's your beef with admitting that a politician lied? Do you just not like seeing non-fundies pulling this sort of thing, or what?", 
   {}, 
   220763, 
   null, 
   1152046560.0
  ], 
  [
   220775, 
   null, 
   "BobNelson2", 
   "Good point. Maybe, if ballot-initiative reform is needed, it should be simply that there are some issues that should be off-limits to voting. The thing is though, someone at some point with the authority to do so has to decree that gay marriage is indeed a civil right.\n\n \n Uh... you do remember the context of this thread, don't you? The Massachussets Supreme Court, to which the Commonwealth constitution gives the necessary authority, has determined that same-sex marriage IS a civil right. Romney, supposedly sworn by oath to uphold that constitution, is going around telling people they should vote to remove a civil right from some of the people he has sworn to protect.\n \n Personally, I don't understand why he hasn't been called on the carpet for this.\n \n \nRead what you just said!!\n \"it applies to ALL voting\"\n ALL voting means, ALL voting.\n \n What part if \"the right of citizens . . . to vote shall not be denied\" do you not understand? If a state wants to vote on a law, they get to do so, and the people must be allowed to do that. It's that simple. Plain as day.\n\n \n The right to vote shall not be denied to any individual when there's a vote being held, silly.\n \n What's \"plain as day\" is the lengths to which you'll go to prolong another one of your absurd arguments. (Do you get absurdity-bonus points????)", 
   {}, 
   220763, 
   null, 
   1152047820.0
  ], 
  [
   220776, 
   null, 
   "BobNelson2", 
   "What's your real problem here, why the dog and pony show? What's your beef with admitting that a politician lied? Do you just not like seeing non-fundies pulling this sort of thing, or what?\n\n \n See Section V, paragraph iii of his job-description: Prolong discussion, even if it requires taking outlandish positions.", 
   {}, 
   220770, 
   null, 
   1152047940.0
  ], 
  [
   220788, 
   null, 
   "jyoshu", 
   "How about you read what I said, since you're the one who doesn't seem to be getting it. \n \n What's your beef with admitting that a politician lied? Do you just not like seeing non-fundies pulling this sort of thing, or what?\n\n \n Fine, if whining about something said by a single politician is what you prefer over the broader and main issue, then go for it. Let me know if you decide you want to discuss the real and substantive issues at hand.\n \n \nSee Section V, paragraph iii of his job-description: Prolong discussion, even if it requires taking outlandish positions.\n\n \n You know, it's obvious that the endless immature comments you make claiming I'm somehow being paid to post are obviously there for one purpose: to chain yank. If you, in any way, reflect your movement and that's the best you can do, your opponents on this issue have NOTHING to worry about.", 
   {}, 
   220770, 
   null, 
   1152054480.0
  ], 
  [
   220832, 
   null, 
   "Steeeeve", 
   "How about you read what I said, since you're the one who doesn't seem to be getting it. IF something comes up for a vote, everyone gets to vote. That does not mean that EVERYTHING comes up for a vote. If a state WANTS to hold a vote, they can. The constitution does NOT say that they HAVE to. Which is the lie that Romeny told, in case you've forgotten. Do you get it? The states do not HAVE to let people vote on laws, and anyone who says they do is a liar.\n \n Frankly, I'm sure you do understand this. What's your real problem here, why the dog and pony show? What's your beef with admitting that a politician lied? Do you just not like seeing non-fundies pulling this sort of thing, or what?\n\n \n You seem to be harping on something that is not that big of a deal. I don't think he literally meant \"you vote on everyone\"...the man is probably not an idiot. It seems a little more likely that he mispoke and at best is wrong. To say he is lying implies he knew he was wrong....can you give it a rest already?", 
   {}, 
   220770, 
   null, 
   1152080280.0
  ], 
  [
   220853, 
   null, 
   "BobNelson2", 
   "Fine, if whining about something said by a single politician is what you prefer over the broader and main issue, then go for it. Let me know if you decide you want to discuss the real and substantive issues at hand.\n\n \n The \"real and substantive\" issue in a thread about Gov. Romney IS Gov. Romney. He's the single politician being discussed.\n \n \nYou know, it's obvious that the endless immature comments you make claiming I'm somehow being paid to post are obviously there for one purpose: to chain yank. If you, in any way, reflect your movement and that's the best you can do, your opponents on this issue have NOTHING to worry about.\n\n \n My comments about your employment are hardly \"endless\" when compared with the number of times you drag the discussion through absurd points. Besides, as I've explained to you before, I find it better to rib you a bit about \"your job\" than to consider other reasons for your behavior on this board. All the other ones would require me to think of you in a far less charitable way. You're getting off easy this way. Plus, it's kind of funny.", 
   {}, 
   220788, 
   null, 
   1152090780.0
  ], 
  [
   220855, 
   null, 
   "gaetano", 
   "[QUOTE=jyoshu] After all, there is no interpretation of the Constitution that says that people must be allowed to have marriage benefits to begin with, much less gay people. \n \n \n \n Since there is no delineation between people and gay people in the constitution why did you choose to create one on your own? \"Much less gay people\".....................That helps to explain why you have trouble seeing gay rights as an equality issue.", 
   {}, 
   220701, 
   null, 
   1152094380.0
  ], 
  [
   220860, 
   null, 
   "jyoshu", 
   "You seem to be harping on something that is not that big of a deal. I don't think he literally meant \"you vote on everyone\"...the man is probably not an idiot. It seems a little more likely that he mispoke and at best is wrong. To say he is lying implies he knew he was wrong....can you give it a rest already?\n\n \n Don't you know that only Dem candidates are allowed to mis-speak from time to time? Others don't get that kind of leeway . . . emoticon_rolleyes\n \n \nBesides, as I've explained to you before, I find it better to rib you a bit about \"your job\" than to consider other reasons for your behavior on this board. All the other ones would require me to think of you in a far less charitable way. You're getting off easy this way. Plus, it's kind of funny.\n\n \n And with comments like that, you're STILL chain yanking. Are you at all capable of discussing issues without throwing in personal judgements and attacks on those you're discussing with? Apparently you aren't.\n \n \nSince there is no delineation between people and gay people in the constitution why did you choose to create one on your own? \"Much less gay people\".....................That helps to explain why you have trouble seeing gay rights as an equality issue.\n\n \n The point there was that marriage benefits themselves aren't even guaranteed by the constitution. The only truly constitutional stance the pro-gay marriage side could take would be to remove marriage benefits from ALL people.", 
   {}, 
   220832, 
   null, 
   1152112320.0
  ], 
  [
   220866, 
   null, 
   "foundit66", 
   "The point there was that marriage benefits themselves aren't even guaranteed by the constitution. The only truly constitutional stance the pro-gay marriage side could take would be to remove marriage benefits from ALL people.\n\n Can you elaborate on your comments here?\n \n Marriage is a right recognized by our government. There are court rulings substantiating this.\n The marriage benefits and rights and privileges are protected under the 14th amendment as well. People can't just violate their equal protection without a legitimate state interest.\n \n What did you mean by your comments?", 
   {}, 
   220860, 
   null, 
   1152114000.0
  ], 
  [
   220869, 
   null, 
   "jyoshu", 
   "Can you elaborate on your comments here?\n \n Marriage is a right recognized by our government. There are court rulings substantiating this.\n The marriage benefits and rights and privileges are protected under the 14th amendment as well. People can't just violate their equal protection without a legitimate state interest.\n \n What did you mean by your comments?\n\n \n I should have said \"literalist constitutional stance\" rather than \"constitutional\".", 
   {}, 
   220866, 
   null, 
   1152114480.0
  ], 
  [
   220873, 
   null, 
   "Kronus", 
   "You seem to be harping on something that is not that big of a deal.\n\n I wouldn't be harping on it if people weren't trying to defend/excuse his lies. And the fact that people think that having the Governor of a major state lie about what's in the Constitution and how the country is run is \"no big deal\" is really sad and a bit scary.\n \n \n\n To say he is lying implies he knew he was wrong....\n\n Actually, it's out and out stating that he knew he was wrong. Like you said, he's not an idiot. He knows what's in the Constitution, and he knew what he was saying.\n \n \ncan you give it a rest already?\n\n No one's forcing you to read this thread. You want to talk about something more interesting, start a new topic. emoticon_xgood", 
   {}, 
   220832, 
   null, 
   1152115860.0
  ], 
  [
   220875, 
   null, 
   "Steeeeve", 
   "\n \n \n No one's forcing you to read this thread. You want to talk about something more interesting, start a new topic. emoticon_xgood\n\n you already hijacked this one....are you saying I can hijack it back?", 
   {}, 
   220873, 
   null, 
   1152116160.0
  ], 
  [
   220897, 
   null, 
   "foundit66", 
   "I should have said \"literalist constitutional stance\" rather than \"constitutional\".\n\n \n Okay. Talking \"literally\" here...\n \n Amendment IX\n The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people. \n \n It seems that our founding fathers \"literally\" and explicitly stated that not all rights of the people are enumerated in the constitution.\n And like it or not, our government does recognize marriage as one of these rights...", 
   {}, 
   220869, 
   null, 
   1152124200.0
  ], 
  [
   220919, 
   null, 
   "BobNelson2", 
   "And with comments like that, you're STILL chain yanking. Are you at all capable of discussing issues without throwing in personal judgements and attacks on those you're discussing with? Apparently you aren't.\n\n \n I guess you're only reading those few posts in which I rib you. Pity. You're missing a lot of substance.\n \n And, by the way, in the \"personal judgements\" category, what is your entire position about gay people other than the personal judgement that we are all immoral? Have I missed something about your \"moral\" argument?\n \n \nThe only truly constitutional stance the pro-gay marriage side could take would be to remove marriage benefits from ALL people.\n\n \n emoticon_rolleyes", 
   {}, 
   220860, 
   null, 
   1152129360.0
  ], 
  [
   220920, 
   null, 
   "jyoshu", 
   "It seems that our founding fathers \"literally\" and explicitly stated that not all rights of the people are enumerated in the constitution.\n And like it or not, our government does recognize marriage as one of these rights...\n\n \n There's a difference between marriage in the sense of the freedom to join together in matrimony and getting marriage benefits. I don't see how you can say that getting marriage benefits is any more a constitutional right in and of itself than social security, or disability pension for the disabled. When Loving recongized marriage as a right in the context of race, I think it was speaking in terms of equality--that if you give it to one group you have to give it to another. It was not a statement on whether marriage benefits, to begin with, are a constitutional right. (If it did say that, then I disagree with Loving. Marriage benefits are simply benefits--like social security. If marriage benefits are a constitutional right, then we discriminate against SINGLE people every time we give them.) And of course, it was talking about marriage in the way it was defined at the time in society's view: between a man and a woman; it does not speak to the issue of gay marriage: a whole different definition. But I certainly agree that the right to join together with someone and pledge a lifelong commitment or whatever should be there for all people.\n \n As far as whether or not all rights are enumerated in the constitution--I think if you'll read my recent posts here to Kronos over the voting-on-laws issue, that's pretty much exactly what I've been saying. We don't base rights on whether or not the constitution specifically states them or not. If we did, the constitution might be the longest document ever written.", 
   {}, 
   220897, 
   null, 
   1152130020.0
  ], 
  [
   220921, 
   null, 
   "jyoshu", 
   "And, by the way, in the \"personal judgements\" category, what is your entire position about gay people other than the personal judgement that we are all immoral? Have I missed something about your \"moral\" argument?\n\n \n The difference is that I try to only state that in a response when asked, and I don't try to use it as a jab at any given opportunity.", 
   {}, 
   220919, 
   null, 
   1152130440.0
  ], 
  [
   220926, 
   null, 
   "BobNelson2", 
   "The difference is that I try to only state that in a response when asked, and I don't try to use it as a jab at any given opportunity.\n\n \n Well, here's the difference about my \"jabs\". It's just a joke.", 
   {}, 
   220921, 
   null, 
   1152133380.0
  ], 
  [
   220929, 
   null, 
   "foundit66", 
   "There's a difference between marriage in the sense of the freedom to join together in matrimony and getting marriage benefits.\n\n So sayeth you...\n Got any legal precedent to back that up?\n \n Because if an insurance company refused to recognize an interracial MARRIED couple with the same \"benefits\" as a same-race married couple, you can bet dollars to doughnuts the law wouldn't treat it as an arbitrary \"benefit\".\n \n These things are encoded in our law. Over 1,000 rights and privileges and whatever you want to call them.\n The 14th amendment protects them all.\n \n \n \nI don't see how you can say that getting marriage benefits is any more a constitutional right in and of itself than social security, or disability pension for the disabled.\n\n 1) Marriage IS a right. Period.\n 2) Marriage \"benefits\", as you call them, are subject to 14th amendment requirements. The 14th amendment IS in the constitution.\n 3) Anything beyond this just gets into meaningless semantics.\n Do you see a difference between \"constitutional right\" and what I describe above?\n If so, what?\n \n \n \nWhen Loving recongized marriage as a right in the context of race, I think it was speaking in terms of equality--that if you give it to one group you have to give it to another.\n\n What Loving \"recognized\" was marriage IS A RIGHT. Period.\n Marriage IS a right.\n \n They concluded OTHER THINGS based on that fact and based on the 14th amendment and the like, but if you actually LOOK at what Loving said, they said that Marriage was a RIGHT. Period.\n \n \n \nIt was not a statement on whether marriage benefits, to begin with, are a constitutional right. (If it did say that, then I disagree with Loving. Marriage benefits are simply benefits--like social security. If marriage benefits are a constitutional right, then we discriminate against SINGLE people every time we give them.)\n\n Name me ANY marriage \"benefit\" which makes sense for a single person to get...\n Can a single person automatically will themselves things when they die?\n Can a single person get ADDITIONAL insurance benefits for themselves under insurance regulations?\n Can a single person guarantee himself visitation rights for himself in the hospital?\n \n And on another level, saying that we \"discriminate\" against single people (with regards to marriage benefits) is like saying people who don't own guns are \"discriminated\" against in the right to bear arms...\n \n \n \nAnd of course, it was talking about marriage in the way it was defined at the time in society's view: between a man and a woman; it does not speak to the issue of gay marriage: a whole different definition.\n\n Jyoshu, jyoshu, jyoshu...\n \"at the time in society's view\", it wasn't JUST \"between a man and a woman\".\n \"Society's view\" was \"between a man and a woman OF THE SAME RACE\".\n By an overwhelming majority that is EVEN LARGER than the majority against gay marriage today. A margin of 3-to-1, with OVER 70% opposed to interracial marriage.\n \n So you see, the COURT was changing the legal definition FROM society's definition TO \"a whole different definition\".", 
   {}, 
   220920, 
   null, 
   1152134400.0
  ], 
  [
   221101, 
   null, 
   "jyoshu", 
   "So sayeth you...\n Got any legal precedent to back that up?\n\n \n Huh??? You need \"legal\" precendent to know that a commitment between 2 people and govt. benefits are not the same thing??\n \n \nBecause if an insurance company refused to recognize an interracial MARRIED couple with the same \"benefits\" as a same-race married couple, you can bet dollars to doughnuts the law wouldn't treat it as an arbitrary \"benefit\".\n\n \n That's exactly what they would treat the things the govt gives them--benefits, because that's what they are. \n \n \n1) Marriage IS a right. Period.\n 2) Marriage \"benefits\", as you call them, are subject to 14th amendment requirements. The 14th amendment IS in the constitution.\n 3) Anything beyond this just gets into meaningless semantics.\n\n \n Sure, to married people. Gays aren't married, according to society's standards.\n \n \nWhat Loving \"recognized\" was marriage IS A RIGHT. Period. Marriage IS a right.\n\n \n Of course. That's why men and women marry one another, even if their races are mixed. It doesn't speak to other types of arrangements: same-gender, groups (polygamy), polyandry, etc.\n \n \nName me ANY marriage \"benefit\" which makes sense for a single person to get...\n\n \n Any of them. Did it never occur to you that single people co-habitate sometimes? They they might want or need the benefits as dating, or in logn-term livein relationships?\n \n \nCan a single person automatically will themselves things when they die?\n Can a single person get ADDITIONAL insurance benefits for themselves under insurance regulations?\n Can a single person guarantee himself visitation rights for himself in the hospital?\n\n \n No, but they might want to do All these things for someone else OUTSIDE the marriage relationship. They're single, but they still might need the benefits.\n \n \nAnd on another level, saying that we \"discriminate\" against single people (with regards to marriage benefits) is like saying people who don't own guns are \"discriminated\" against in the right to bear arms...\n\n \n That doesn't make any sense. Feel free to elaborate.", 
   {}, 
   220929, 
   null, 
   1152213900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Romney has it wrong", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8401-romney-has-wrong.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8401, 
  "discussion_files": [
   [
    "21321.html", 
    "http://www.4forums.com/political/gay-rights-debates/8401-romney-has-wrong-print.html"
   ], 
   [
    "21322.html", 
    "http://www.4forums.com/political/gay-rights-debates/8401-romney-has-wrong-5-print.html"
   ], 
   [
    "21323.html", 
    "http://www.4forums.com/political/gay-rights-debates/8401-romney-has-wrong-4-print.html"
   ], 
   [
    "21324.html", 
    "http://www.4forums.com/political/gay-rights-debates/8401-romney-has-wrong-3-print.html"
   ], 
   [
    "21325.html", 
    "http://www.4forums.com/political/gay-rights-debates/8401-romney-has-wrong-2-print.html"
   ]
  ], 
  "identifier": 8401
 }
]