[
 [
  [
   219894, 
   null, 
   "San-Fran", 
   "http://www.timesonline.co.uk/article/0,,29389-2197754,00.html\n \n \n The Times reports that two Islamic extremists - Omar Khyam, 24, and Jawad Akbar, 22 - plotted to blow up a \"dirty bomb\" in one of Britain's biggest nightclubs in particular Ministry of Sound in South London. \n \n After MI5 agents had taken in charge these two young Islamists, the lads confessed they plotted to detonate a \"dirty bomb\" they intended to buy from members of some other terrorist group that has its headquarters in London, presumably, these are Chechens. \n \n This information sounds like true especially if you take into consideration that Chechen terrorists are know to be trading in \"dirty bombs\" made of cesium-137 stolen from abandoned radioactive materials storage in North Georgia. I only wonder what the means are that Chechens were expecting to use to deliver a \"dirty bomb\" to London. Our security services are doing their job well and it is almost impossible to bring in something illegally. Unless you are an oligarch who has infinite possibilities and enjoys utmost credit by authorities. And I think I know who it might be - Boris Berezovski who is know to be in sort of good terms with Chechen terrorists in Britain. Of course, he may have part of profit from this deal staying above suspicion while he boldly assists Chechens. I don't get it why MI5 don't take him in charge as well? Why do we keep nursing this viper in bosom?", 
   {
    "post_info": {
     "post_title": "Boris Berezovski trades in &quot;dirty bombs&quot;?"
    }
   }, 
   null, 
   null, 
   1151599320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Boris Berezovski trades in \"dirty bombs\"?", 
  "url": "http://www.4forums.com/political/european-politics-economics/8404-boris-berezovski-trades-dirty-bombs.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 8404, 
  "discussion_files": [
   [
    "898.html", 
    "http://www.4forums.com/political/european-politics-economics/8404-boris-berezovski-trades-dirty-bombs-print.html"
   ]
  ], 
  "identifier": 8404
 }
]