[
 [
  [
   220323, 
   null, 
   "simone", 
   "Is this a new doctine of the church?:\n \n http://www.nytimes.com/2006/07/01/world/europe/01vatican.html\n \n July 1, 2006\n Excommunication Is Sought for Stem Cell Researchers \n By ELISABETH ROSENTHAL\n ROME, June 30 - Scientists who engage in stem cell research using human embryos should be subject to excommunication from the Roman Catholic Church, according to a senior Vatican official. \n \n Cardinal Alfonso López Trujillo, who heads the group that proposes family-related policy for the church, said in an interview with the Catholic weekly Famiglia Cristiana published Thursday that stem cell researchers should be punished in the same way as women who have abortions and doctors who perform them. \n \n \"Destroying an embryo is equivalent to abortion,\" said the cardinal. \"Excommunication is valid for the women, the doctors and researchers who destroy embryos.\"\n \n It was unclear if the pope supported the position, and the Vatican did not return calls for comment. But such blunt remarks from a powerful cardinal just a week before the church convenes a meeting to discuss the topic could foreshadow a hardening of Vatican policy on the issue, experts said. \n \n On Saturday, Cardinal Trujillo will open the church's fifth World Meeting of Families in Valencia, Spain, and Pope Benedict XVI will attend on July 9, the closing day. As head of the Pontifical Council for the Family, it will be up to Cardinal Trujillo to propose new church policies, though adopting any such measure could require a long and complicated process. \n \n The church has long opposed embryonic stem cell research, and has campaigned against any medical procedure or research technique that harms human embryos or fetuses. \n \n But the threat of individual excommunication - the most serious punishment meted out by the church - was previously directed at women and medical personnel who participated in abortions. Cardinal Trujillo's stand would broaden the use of that sanction to biomedical researchers who use embryos. \n \n \"The cardinal's view is that the penalty of excommunication should be extended to stem cell research,\" said the Rev. Brian Johnstone, a moral theologian at the Alphonsian Academy here. \"The provisions of canon law about what leads to excommunication are very precise.\" \n \n But Father Johnstone cautioned that it was unlikely that the church would formally adopt a final position next week. \"Clarification of such a delicate point of this importance is unlikely to be made at such a large gathering,\" he said. \n \n Even some Catholics who are opposed to the use of embryos in research felt that excommunication was too strong a sanction. \"If we're defending the principle that human life should not be touched, it should not be done in a punitive, castigatory or burn-in-hell sort of way,\" said Paola Binetti, a leading Catholic politician here. \n \n The specification of the punishment for embryonic stem cell research was partly needed so the church could catch up with advances in science. \n \n When the 1990 Evangelium Vitae came out reaffirming that abortion would lead to automatic excommunication, \"Embryonic stem cell research was not a front-page issue,\" Ms. Binetti said. \n \n While doctors and scientists claim that embryonic stem cell research holds the promise to cure many intractable diseases, the church opposes the practice because human embryos are used to harvest cells for the work. Some of these embryos are left over after in vitro fertilization procedures, but scientists can also create embryos themselves. \n \n The church regards such early-stage embryos as a human life, not to be used or destroyed. It maintains that there are other ways to obtain stem cells for research purposes - from umbilical cord blood after a birth, for example - though it acknowledges that they are significantly more cumbersome. \n \n According to current church law, excommunication for abortion is \"latae senentiae,\" meaning that it is automatic and does not require an action or proclamation by a church official. This type of excommunication is reserved for acts deemed so serious that no verdict or judgment is required. Even so, many women who have had abortions continue to practice Catholicism, and many parishes take pains to embrace and reintegrate them into church life. \n \n Other acts that result in automatic excommunication include violence against the pope and consecrating a bishop without authorization. Now, experts said, Cardinal Trujillo's remarks raise the possibility that being involved in stem cell research might be added to the category. Secret Papal Archives to Be Opened\n \n By The New York Times\n \n ROME, June 29 - The Vatican has authorized secret files from Pope Pius XI and his pre-World War II pontificate, from 1922 to 1939, to be released from their secret archives. \n \n In 2003, under Pope John Paul II, the Vatican released archival material from the same period in an effort to allay accusations that the Vatican did not do enough to save Jews from the Holocaust. \n \n For years, the Vatican has struggled to defend the reputation of Pius's successor, Pope Pius XII, who has been accused of shirking his responsibilities by looking the other way during the atrocities of World War II. \n \n Peter Kiefer contributed reporting from Rome for this article, and Elisabetta Povoledo from Milan.", 
   {
    "post_info": {
     "post_title": "Excommunicating Women Who Abort"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1151789100.0
  ], 
  [
   220324, 
   null, 
   "simone", 
   "I wasn't aware that women who had had abortions were excommunicated by the church before.", 
   {}, 
   220323, 
   null, 
   1151789160.0
  ], 
  [
   220333, 
   null, 
   "GodIsDead", 
   "i dident know that either, but its no suprize to me. The christian church is now and has alwase been a woman hateing orginizaiton.", 
   {}, 
   220324, 
   null, 
   1151794260.0
  ], 
  [
   220343, 
   null, 
   "Bell", 
   "What Would Jesus Do?", 
   {}, 
   220333, 
   null, 
   1151802480.0
  ], 
  [
   220435, 
   null, 
   "maximus", 
   "Catechism of the Catholic Church (CCC) 2272 Formal cooperation in an abortion constitutes a grave offense. The Church attaches the canonical penalty of excommunication to this crime against human life. \"A person who procures a completed abortion incurs excommunication latae sententiae,\" \"by the very commission of the offense,\" and subject to the conditions provided by Canon Law. The Church does not thereby intend to restrict the scope of mercy. Rather, she makes clear the gravity of the crime committed, the irreparable harm done to the innocent who is put to death, as well as to the parents and the whole of society.\n \n http://www.scborromeo.org/ccc/para/2272.htm\n \n A person committing this act severs their relationship with God and his Church due to the seriousness of the act. A person cannot claim to be in communion with God and at the same time kill a developing human being. But the mercy and healing of God is infinite and his forgiveness awaits those who acknowledge what they did was wrong, confess their sin, do penance, and amend their way of life to avoid the sin in the future.", 
   {}, 
   220343, 
   null, 
   1151867340.0
  ], 
  [
   220452, 
   null, 
   "GodIsDead", 
   "if that was true, then how would you explain a woman post-abortion still feeling a close and positive connection with god?", 
   {}, 
   220435, 
   null, 
   1151872020.0
  ], 
  [
   220572, 
   null, 
   "Master_Shake", 
   "Does anybody actually get officially excommunicated anymore?", 
   {}, 
   220452, 
   null, 
   1151915700.0
  ], 
  [
   220614, 
   null, 
   "DrNo", 
   "i dident know that either, but its no suprize to me. The christian church is now and has alwase been a woman hateing orginizaiton.\n\n \n Strange, I was under the impression this article was referring to the Roman Catholic Church.", 
   {}, 
   220333, 
   null, 
   1151949600.0
  ], 
  [
   220621, 
   null, 
   "Master_Shake", 
   "i dident know that either, but its no suprize to me. The christian church is now and has alwase been a woman hateing orginizaiton.\n\n \nStrange, I was under the impression this article was referring to the Roman Catholic Church.\n\n You're not one of those people who doesn't consider Catholics christians are you?", 
   {}, 
   220333, 
   null, 
   1151952000.0
  ], 
  [
   220625, 
   null, 
   "DrNo", 
   "You're not one of those people who doesn't consider Catholics christians are you?\n\n \n There all types of denominations of the Catholic religion. However, most religions that I consider \"Christian\" are really not the same as \"Catholic.\" Catholicism tends to be even more strict and loony than Christianity.", 
   {}, 
   220621, 
   null, 
   1151954040.0
  ], 
  [
   220630, 
   null, 
   "Master_Shake", 
   "There all types of denominations of the Catholic religion. However, most religions that I consider \"Christian\" are really not the same as \"Catholic.\" Catholicism tends to be even more strict and loony than Christianity.\n\n I believe you are thinking of orders, not denominations. There is a big difference.\n Strict and loony? Could you be a little more specific, because this statement sounds like it's coming out of complete ignorance.\n You also seem to be making the assumption that all of the non-Catholic Christians are somehow very similar, which couldn't be further from the truth.", 
   {}, 
   220625, 
   null, 
   1151956020.0
  ], 
  [
   220635, 
   null, 
   "simone", 
   "Maximus, in what year was that particular item, #2272, I believe, enacted?", 
   {}, 
   220630, 
   null, 
   1151957880.0
  ], 
  [
   221717, 
   null, 
   "Master_Shake", 
   "DrNo? .", 
   {}, 
   220635, 
   null, 
   1152599340.0
  ], 
  [
   221734, 
   null, 
   "Ooaman", 
   "Does anybody actually get officially excommunicated anymore?\n\n Someone told me back in March or April that Katie Holmes got excommunicated.\n \nYou also seem to be making the assumption that all of the non-Catholic Christians are somehow very similar, which couldn't be further from the truth.\n\n Which is why their are many different denominations among the protestant faith.\n Also, many people within one congregation tends to have different views on things. I know, I know, it doesn't make sense but it happens.\n Also, I don't know about most other protestant faiths, but I know my own says that the only one who can tell you to or not to take communion is YOU based upon your personal beliefs.\n In fact, the first time I ever heard of the word \"Excommunication\" was in a movie I had to see my Senior year of high school about Thomas Abecket (or whatever his name was) who ordered that some guy be excommunicated. I thought he was ordering that the guy have his head chopped off so that he could no longer communicate with anyone.", 
   {}, 
   220572, 
   null, 
   1152602880.0
  ], 
  [
   221746, 
   null, 
   "Ender", 
   "Well since you guys are talking about Catholics I might as well give some input.\n I'm glad I'm not a Catholic, they seem much, much stricter than the Lutheran church I attend.", 
   {}, 
   221734, 
   null, 
   1152610620.0
  ], 
  [
   221754, 
   null, 
   "Master_Shake", 
   "Well since you guys are talking about Catholics I might as well give some input.\n I'm glad I'm not a Catholic, they seem much, much stricter than the Lutheran church I attend.\n\n No offense, but that's not really any input. What the Catholic Church vaguely feels like to you doesn't really tell us anything.", 
   {}, 
   221746, 
   null, 
   1152635040.0
  ], 
  [
   221755, 
   null, 
   "Another opinion", 
   "Well since you guys are talking about Catholics I might as well give some input.\n I'm glad I'm not a Catholic, they seem much, much stricter than the Lutheran church I attend.\n\n I just wanted to put in a somewhat good word about the actual practice of Catholicism. Though my actual current beliefs certainly don't conform to the vast majority of official Catholic dogma, I must mention that, in growing up Catholic in the liberal state of Massachusetts, I very rarely if ever encountered any of the strictest aspects of Catholic dogma in the masses I attended. I never heard anything said against abortion or contraception, no mention of homosexuality, no \"fire and brimstone\" homilies, etc. Even if there was a reading of the Old Testament that touched upon a wife needing to obey her husband, the subsequent homily on the subject was almost apologetic in its tone - as if they themselves recognized how outdated that concept was. \n \n My only point in bringing this up is that there are many versions of the actual practice of Catholicism as well - some more liberal than others. I was lucky in having mainly only encountered the more liberal side of Catholicism so that my departure from established dogma is far more based on intellectual arguements than on emotional reactions against irrational beligerance that others have experienced.", 
   {}, 
   221746, 
   null, 
   1152635280.0
  ], 
  [
   221756, 
   null, 
   "jim's trucking", 
   "This strengthens my opinion of the RC church...as being among the silliest and most hypocritical of the religions I am aware of.\n \n If the RC church really wanted to punish sinners, they would draw and quarter or burn at the stake ALL of the child-molesting priests that have been protected and transferred to other communities.\n \n A bunch of pompous men electing each other to higher positions in a corrupt church garners no respect from me.", 
   {}, 
   221755, 
   null, 
   1152636180.0
  ], 
  [
   221765, 
   null, 
   "Another opinion", 
   "This strengthens my opinion of the RC church...as being among the silliest and most hypocritical of the religions I am aware of.\n \n If the RC church really wanted to punish sinners, they would draw and quarter or burn at the stake ALL of the child-molesting priests that have been protected and transferred to other communities.\n \n A bunch of pompous men electing each other to higher positions in a corrupt church garners no respect from me.\n\n I'm not sure if it was my post you were responding to. If so, then why would you not see it as a positive trend in the Roman Catholic Church for there to be areas where the practice is more liberal? Religions evolve and, personally, I think evolution toward a more open-minded liberal approach can only be a good thing.\n \n As for the hypocracy of the Church protecting some child-molesting priests, I also was angry at the lack of response from the church of my youth. Though I am sure that there were aspects of a dual standard shown toward their own (i.e. other clergy) and a desire to protect the Church from losing public respect by denying the problem, I also strongly suspect that there was a large dose of naivete thrown in as well - in that the higher clergy might have genuinely not believed that their friends could commit such acts, or trusted in the apologies of those who were clearly shown to be guilty. The higher clergy clearly need to do some soul-searching about their lack of action - reform is clearly needed.", 
   {}, 
   221756, 
   null, 
   1152638100.0
  ], 
  [
   221772, 
   null, 
   "simone", 
   "Another, I think Rick Sanctorem, Senator from Pennsylvania, castigated the liberal Catholics of Massachussetts as being a direct cause of the rash of pedophilia disclosed in the Boston area.\n \n Conversely, I wonder if the liberal Catholics of Massachussetts were responsible for getting angry about and disclosing the extent of pedophilia in the priesthood of that area. The liberals found it intolerable and cast aside the old \"the priest is next to God and cannot be criticized for any sort of misbehavior.\"\n \n I think that old-line Catholics closed their eyes to such things and refused to believe that such things happened.", 
   {}, 
   221765, 
   null, 
   1152641880.0
  ], 
  [
   221803, 
   null, 
   "Another opinion", 
   "Another, I think Rick Sanctorem, Senator from Pennsylvania, castigated the liberal Catholics of Massachussetts as being a direct cause of the rash of pedophilia disclosed in the Boston area.\n\n Do you know specifically why he was blaming the liberals of Massachusetts? Namely, did he have any logical arguement or was it purely one of those knee-jerk irrational reactions against liberals so typical of right-wing conservatives?\n \nConversely, I wonder if the liberal Catholics of Massachussetts were responsible for getting angry about and disclosing the extent of pedophilia in the priesthood of that area. The liberals found it intolerable and cast aside the old \"the priest is next to God and cannot be criticized for any sort of misbehavior.\"\n \n I think that old-line Catholics closed their eyes to such things and refused to believe that such things happened.\n\n I think you might be right there. One aspect of liberals in general is hesitancy in automatically accepting the word of authority. This not only includes government authority but that of organized religion as well. It is much more in line with old-line conservative Catholics to trust without suspicion. \n \n My biases may well be showing in those statements but, time after time, I have found that trend to be so true. Conservatives seem to have some level of blind faith in all those institutions that they claim to support.", 
   {}, 
   221772, 
   null, 
   1152647640.0
  ], 
  [
   221811, 
   null, 
   "Steeeeve", 
   "I'm not sure if it was my post you were responding to. If so, then why would you not see it as a positive trend in the Roman Catholic Church for there to be areas where the practice is more liberal? Religions evolve and, personally, I think evolution toward a more open-minded liberal approach can only be a good thing.\n \n As for the hypocracy of the Church protecting some child-molesting priests, I also was angry at the lack of response from the church of my youth. Though I am sure that there were aspects of a dual standard shown toward their own (i.e. other clergy) and a desire to protect the Church from losing public respect by denying the problem, I also strongly suspect that there was a large dose of naivete thrown in as well - in that the higher clergy might have genuinely not believed that their friends could commit such acts, or trusted in the apologies of those who were clearly shown to be guilty. The higher clergy clearly need to do some soul-searching about their lack of action - reform is clearly needed.\n So you want to make the church even more hypocritical?", 
   {}, 
   221765, 
   null, 
   1152649740.0
  ], 
  [
   221818, 
   null, 
   "Another opinion", 
   "So you want to make the church even more hypocritical?\n\n I'm not quite sure where you are going with that question. \n \n If it is a comment about my desire for the Roman Catholic Church to become more liberal and thus farther away from the current dogma, then I don't see any hypocracy since I would of course hope that not only the practice but the dogma and clergy itself would evolve in that direction. This is highly likely an unrealistic hope, especially given the current conservative Pope and the fact that most of the recent growth in the RC Church has been in poor third world countries where views are more conservative.\n \n If your comment suggests, as Rick Santorum seemed to, that liberalism in itself is a cause of pedofelia, and that that is where you see hypocracy, then I would ask you to explain your reasoning.", 
   {}, 
   221811, 
   null, 
   1152650700.0
  ], 
  [
   221820, 
   null, 
   "jim's trucking", 
   "I'm not quite sure where you are going with that question. \n \n If it is a comment about my desire for the Roman Catholic Church to become more liberal and thus farther away from the current dogma, then I don't see any hypocracy since I would of course hope that not only the practice but the dogma and clergy itself would evolve in that direction. This is highly likely an unrealistic hope, especially given the current conservative Pope and the fact that most of the recent growth in the RC Church has been in poor third world countries where views are more conservative.\n \n If your comment suggests, as Rick Santorum seemed to, that liberalism in itself is a cause of pedofelia, and that that is where you see hypocracy, then I would ask you to explain your reasoning.\nPlease tell me why you think the views are more conservative in third world countries.\n \n If the recent growth of the RC church is concentrated in third world countries, it is more likely attributable to the fact that they just don't know any better and the RC church is aggressive in the expansion of their supply of contributions.", 
   {}, 
   221818, 
   null, 
   1152651000.0
  ], 
  [
   221822, 
   null, 
   "Another opinion", 
   "Please tell me why you think the views are more conservative in third world countries.\n\n I am speaking more of social conservatism as opposed to financial conservatism. With respect to financial conservatism, I would think that the actual populations of the third world would be far more left of center than in the US, while their controling elite would usually be more on the right. \n \n As for social trends, women's rights are typically much less developed in the third world than in the West; people often tend to be more divided with respect to race, tribe, class, or cast; and there seem to be far fewer people who will challenge social and religious norms than you typically find in the West. Of course, there are exceptions, but I am speaking of the general trends.\n \nIf the recent growth of the RC church is concentrated in third world countries, it is more likely attributable to the fact that they just don't know any better and the RC church is aggressive in the expansion of their supply of contributions.\n\n That tends to be true of the growth of all religions. Either they grow through conquest or through attempts at conversion by church representatives or both. Rarely do a people choose to change their religion without some influencing figure or culture. I hear that the Roman Catholic Church is having more competition recently from other evangelizing groups.", 
   {}, 
   221820, 
   null, 
   1152652080.0
  ], 
  [
   222032, 
   null, 
   "jim's trucking", 
   "I am speaking more of social conservatism as opposed to financial conservatism. With respect to financial conservatism, I would think that the actual populations of the third world would be far more left of center than in the US, while their controling elite would usually be more on the right. \n \n As for social trends, women's rights are typically much less developed in the third world than in the West; people often tend to be more divided with respect to race, tribe, class, or cast; and there seem to be far fewer people who will challenge social and religious norms than you typically find in the West. Of course, there are exceptions, but I am speaking of the general trends.\n \n That tends to be true of the growth of all religions. Either they grow through conquest or through attempts at conversion by church representatives or both. Rarely do a people choose to change their religion without some influencing figure or culture. I hear that the Roman Catholic Church is having more competition recently from other evangelizing groups.\nAnother opinion from Another opinion. You have yet to present any facts behind your reasoning. Rather than conservative, I would see third world unindustrialized countries as being far more socialistic than holding to the social beliefs of conservatives.\n \n I also question your statement that women's rights are typically much less developed. Do you have some statistical data for this claim or is it too just another opinion?", 
   {}, 
   221822, 
   null, 
   1152726180.0
  ], 
  [
   222033, 
   null, 
   "INRI", 
   "The catholic faith is undoubtedly hated in the world, it always has been and always will be, it comes as no suprise jesus said it would be so.\n \n Also its obvious that it seems stupid to the secular world, to those perishing the way of the cross is folly but to those who are being saved it is the strengh of God.\n \n For gods foolishness is wiser the human wisdom and Gods weakness stronger than human strengh.\n \n Yes you may laugh and mock and call us foolish, stupid, loony....just like they did to Jesus a carpenter from nazareth when he walked around telling everyone he was God and that unless they ate him, they would die.\n \n but you know their mocking turned to worry and hatred and they lashed him and hung him on a tree, but he stuck to his ways, he didnt change to suit others, he was STRICTly focused on his mission", 
   {}, 
   221822, 
   null, 
   1152726240.0
  ], 
  [
   222035, 
   null, 
   "Steeeeve", 
   "I'm not quite sure where you are going with that question. \n \n If it is a comment about my desire for the Roman Catholic Church to become more liberal and thus farther away from the current dogma, then I don't see any hypocracy since I would of course hope that not only the practice but the dogma and clergy itself would evolve in that direction. This is highly likely an unrealistic hope, especially given the current conservative Pope and the fact that most of the recent growth in the RC Church has been in poor third world countries where views are more conservative.\n \n If your comment suggests, as Rick Santorum seemed to, that liberalism in itself is a cause of pedofelia, and that that is where you see hypocracy, then I would ask you to explain your reasoning.\n\n \n It just seems odd that you would want a church to \"evolve\" out of the teachings in the Bible and kinda develop their own set of standards. When Jesus said there is only one way I don't think he meant your own personal wants way.", 
   {}, 
   221818, 
   null, 
   1152726540.0
  ], 
  [
   222037, 
   null, 
   "jim's trucking", 
   "The catholic faith is undoubtedly hated in the world, it always has been and always will be, it comes as no suprise jesus said it would be so.\n \n Also its obvious that it seems stupid to the secular world, to those perishing the way of the cross is folly but to those who are being saved it is the strengh of God.\n \n For gods foolishness is wiser the human wisdom and Gods weakness stronger than human strengh.\n \n Yes you may laugh and mock and call us foolish, stupid, loony....just like they did to Jesus a carpenter from nazareth when he walked around telling everyone he was God and that unless they ate him, they would die.\n \n but you know their mocking turned to worry and hatred and they lashed him and hung him on a tree, but he stuck to his ways, he didnt change to suit others, he was STRICTly focused on his mission\nI don't hate the Catholic religion. I thank the Catholics for saving the world from the Muslims ages ago. Maybe they can do it again.\n \n However, that does not prevent me from wondering why the hell the Catholic church held Galleleo back, why they adhere to so much pomp and ceremony regarding Cardinals and Popes, why they think preists should be passed to another congregation when they are caught being human, etc. The Catholic church makes me wonder.", 
   {}, 
   222033, 
   null, 
   1152726600.0
  ], 
  [
   222078, 
   null, 
   "Another opinion", 
   "It just seems odd that you would want a church to \"evolve\" out of the teachings in the Bible and kinda develop their own set of standards. When Jesus said there is only one way I don't think he meant your own personal wants way.\n\n Politics and historical trends largely determined what is currently considered the range of beliefs about Jesus which we call Christianity. In the early years, these beliefs varied very widely - from beliefs in Jesus being purely human to beliefs in him being purely divine (with the human form being an illusion). So, when you say that \"there is only one way\", that is only your opinion based on the traditions you are most familiar with. Other faiths believed in a different way. Unfortuntately, we don't have a time capsule to take us back through time to watch the events and listen to Jesus speak, so we have to rely on the early sources. Unfortunately, these early Christians were not in agreement with each other - including Peter vs. Paul about whether Chrisitianity should be part of Judaism, etc. So, we may never know exactly what was said and done with regard to the reality of Jesus.\n \n This brings up a question that I brought up in the Religion forum. Namely, how far can a religion evolve from its origins and still be called that religion?", 
   {}, 
   222035, 
   null, 
   1152736200.0
  ], 
  [
   222088, 
   null, 
   "Another opinion", 
   "Another opinion from Another opinion. You have yet to present any facts behind your reasoning. Rather than conservative, I would see third world unindustrialized countries as being far more socialistic than holding to the social beliefs of conservatives.\n\n If by \"socialistic\", you mean supporting Socialist political / economic policies, then I had already generally agreed in my first paragraph: \"With respect to financial conservatism, I would think that the actual populations of the third world would be far more left of center than in the US, while their controling elite would usually be more on the right. \" It was social, not economic conservatism that I was referring to.\n \n Otherwise, by \"socialistic\", do you mean that the third world people are more socially liberal? If so, then justify your claim. I have already given a list of why I view that most are less socially liberal.\n \nI also question your statement that women's rights are typically much less developed. Do you have some statistical data for this claim or is it too just another opinion?\n\n This claim is based on decades of new stories from various third world countries, from my travels to some third world countries, and from some discussions (either personal or seen on documentaries) with people from those countries. From female genital mutilation in Africa, to significant limits on women's rights in the Middle East, to discriminatory social practices within the poorer classes of China and India, these trends are clearly visible. Though there are always exceptions, generally speaking, the poorer the country, or the poorer the people within a country, the worse the record of women's rights. Here are a few web sites about women's rights in different regions:\n \n Middle East and North Africa:\n http://www.freedomhouse.org/template.cfm?page=163\n \n Sub-Saharan Africa:\n http://www.africaaction.org/docs96/wom9607.htm\n \n Also, though India and China have laws regarding women's equality, many of these laws are often not enforced - particularly in the rural areas where traditions remain firm:\n \n India:\n http://www.indianchild.com/womens_issues_in_india.htm\n \n China:\n http://www.christusrex.org/www1/sdc/hr_facts.html#Woman\n \n So, I have given you some arguements and links about why I view social issues as being more conservative in the third world. Now, if you claim otherwise, you must likewise present some arguements and links. Otherwise, your view will simply be an unsupported opinion - worth much less than a supported opinion.", 
   {}, 
   222032, 
   null, 
   1152738060.0
  ], 
  [
   222093, 
   null, 
   "jim's trucking", 
   "If by \"socialistic\", you mean supporting Socialist political / economic policies, then I had already generally agreed in my first paragraph: \"With respect to financial conservatism, I would think that the actual populations of the third world would be far more left of center than in the US, while their controling elite would usually be more on the right. \" It was social, not economic conservatism that I was referring to.\n \n Otherwise, by \"socialistic\", do you mean that the third world people are more socially liberal? If so, then justify your claim. I have already given a list of why I view that most are less socially liberal.\n \n This claim is based on decades of new stories from various third world countries, from my travels to some third world countries, and from some discussions (either personal or seen on documentaries) with people from those countries. From female genital mutilation in Africa, to significant limits on women's rights in the Middle East, to discriminatory social practices within the poorer classes of China and India, these trends are clearly visible. Though there are always exceptions, generally speaking, the poorer the country, or the poorer the people within a country, the worse the record of women's rights. Here are a few web sites about women's rights in different regions:\n \n Middle East and North Africa:\n http://www.freedomhouse.org/template.cfm?page=163\n \n Sub-Saharan Africa:\n http://www.africaaction.org/docs96/wom9607.htm\n \n Also, though India and China have laws regarding women's equality, many of these laws are often not enforced - particularly in the rural areas where traditions remain firm:\n \n India:\n http://www.indianchild.com/womens_issues_in_india.htm\n \n China:\n http://www.christusrex.org/www1/sdc/hr_facts.html#Woman\n \n So, I have given you some arguements and links about why I view social issues as being more conservative in the third world. Now, if you claim otherwise, you must likewise present some arguements and links. Otherwise, your view will simply be an unsupported opinion - worth much less than a supported opinion.\nIt was not my intent to start a debate..just to discuss. Today's meaning of \"Third World Country\" has changed from what it meant in the Cold War days. We'd have to agree on the definition to go on.\n \n An unindustrialized country I would picture as an area replete with tribal villages inhabited by hunter/gatherers all of which share the bounty of the land. This leans toward socialism rather than capitalism. Sharing seems more likely than selling goods for profit.\n \n I appreciate the links. I'll be reading for a while.\n \n ...and I didn't mean to skew the thread away from it's topic...the RC church rules...\n \n IMO, excommunication of a woman who chooses abortion is just as ridiculous as the coddling of pedophile priests...nothing more than the expression of the self-righteousness of the pompous church hierarchy.", 
   {}, 
   222088, 
   null, 
   1152740160.0
  ], 
  [
   222114, 
   null, 
   "Another opinion", 
   "It was not my intent to start a debate..just to discuss. Today's meaning of \"Third World Country\" has changed from what it meant in the Cold War days. We'd have to agree on the definition to go on.\n\n I don't know if there even is a clear definition of \"third world\" anymore. I would think that even the term \"Developing country\" (which is used more often) is relative since, after all, even the richest countries are continuiing to develop. It is just that some are developing faster than others. I guess for me it was a generalization comparing the dominant Western countries (ex. US, France, Germany, Great Britain, Canada, etc.) to the third world. Essentially, since the original subject was the spread of Roman Catholicism then I was comparing the countries that dominate the old areas of Roman Catholicism to those areas where it is currently continuing to spread - Africa and Asia in particular - since these cultures will introduce new influences into the Catholic Church.\n \nAn unindustrialized country I would picture as an area replete with tribal villages inhabited by hunter/gatherers all of which share the bounty of the land. This leans toward socialism rather than capitalism. Sharing seems more likely than selling goods for profit.\n\n This brings up and interesting point. Where does one draw the line between social issues and economic issues? I had also made the point earlier that I would think that most people of third world countries would have economically more left-of-center views - often, as you say, leaning toward socialism. My main point was about the conservativism of their views on social issues not economic ones. However, now I am thinking that one probably cannot competely separate economic issues from social ones since one's economic system is bound to influence social interactions - ex. barter on equal terms vs personal profit, shared possessions vs individual possessions, ones main loyalty belonging to a larger collective group vs. loyalty primarily to ones nuclear family, etc. In speaking of social issues, I had mostly concentrated on issues such as women's rights; racial, ethnic and class/cast relations; and the freedom and social acceptance to speak out on views not held by the majority - issues about which I continue to claim that the third world is more conservative. The third world is probably then a strange mixture of social views - conservative toward underpriviledged groups (women, other races/casts, or people who hold minority opinions) but more collective in their mindsets toward those who have a similar standing within their group.\n \nIMO, excommunication of a woman who chooses abortion is just as ridiculous as the coddling of pedophile priests...nothing more than the expression of the self-righteousness of the pompous church hierarchy.\n\n I agree with your criticisms of the Roman Catholic Church regarding these types of issues. However, despite its problems, I still see a lot of good intentions and good benefits for people who follow at least more moderate forms of Catholicism. I may not be much of a believer myself (mainly for various intellectual / scientific reason) but I can still see those parts of it that are positive. I simply wouldn't \"throw the baby out with the bathwater\".", 
   {}, 
   222093, 
   null, 
   1152749040.0
  ], 
  [
   222153, 
   null, 
   "jim's trucking", 
   "I don't know if there even is a clear definition of \"third world\" anymore. I would think that even the term \"Developing country\" (which is used more often) is relative since, after all, even the richest countries are continuiing to develop. It is just that some are developing faster than others. I guess for me it was a generalization comparing the dominant Western countries (ex. US, France, Germany, Great Britain, Canada, etc.) to the third world. Essentially, since the original subject was the spread of Roman Catholicism then I was comparing the countries that dominate the old areas of Roman Catholicism to those areas where it is currently continuing to spread - Africa and Asia in particular - since these cultures will introduce new influences into the Catholic Church.\n \n This brings up and interesting point. Where does one draw the line between social issues and economic issues? I had also made the point earlier that I would think that most people of third world countries would have economically more left-of-center views - often, as you say, leaning toward socialism. My main point was about the conservativism of their views on social issues not economic ones. However, now I am thinking that one probably cannot competely separate economic issues from social ones since one's economic system is bound to influence social interactions - ex. barter on equal terms vs personal profit, shared possessions vs individual possessions, ones main loyalty belonging to a larger collective group vs. loyalty primarily to ones nuclear family, etc. In speaking of social issues, I had mostly concentrated on issues such as women's rights; racial, ethnic and class/cast relations; and the freedom and social acceptance to speak out on views not held by the majority - issues about which I continue to claim that the third world is more conservative. The third world is probably then a strange mixture of social views - conservative toward underpriviledged groups (women, other races/casts, or people who hold minority opinions) but more collective in their mindsets toward those who have a similar standing within their group.\n \n I agree with your criticisms of the Roman Catholic Church regarding these types of issues. However, despite its problems, I still see a lot of good intentions and good benefits for people who follow at least more moderate forms of Catholicism. I may not be much of a believer myself (mainly for various intellectual / scientific reason) but I can still see those parts of it that are positive. I simply wouldn't \"throw the baby out with the bathwater\". \nNeither would I. There's likely some redeeming value attached to every religion. I'm saying that the RC church is the silliest one of which I know. To select from a group of Cardinals a man (human) who will now occasionally speak with the presumed authority of infallible God represents the absolute pinnacle of audacity and arrogance (to me) (IMHO) (I think).\n \n A bunch of grown men, wearing expensive robes and pointy hats, carrying golden sticks, sitting in golden chairs, speaking with self-appointed authority, bilking their parisioners of hard earned money (to pay for the ornateness of the clergy life), \"absolving\" parisioners of confessed sins with poems to be repeated a number of times dependent on the severity of the sin,...\n \n Get serious!\n \n This is not to say that the RC church does nothing good. I used to buy all my Christmas trees at the Catholic High School Tree Sale. I've been to a lot of Catholic Fairs and bought some good home cooking. I've \"had\" Catholic girlfriends. I've been to some of the most beautiful Catholic churches in the world (you should see the one in Poland where the first King of Poland was crowned...I've got pictures of it somewhere.) and we've had a good Catholic President...AND they saved our asses from the Muslims once.\n \n It's just that the pomposity and the \"you gotta go through us to get to God\" XXXX is simply a manipulating tool used to perpetuate the power and lifestyle of the hierarchy. The rulings passed down to the parisioners are nothing more than fear spears designed to maintain control over the masses.\n \n Excommunication from such a tightly run power machine should be a welcomed relief. There are many denominations that welcome ALL sinners...including women who've had abortions. I guess I'm protesting (like the first Protestants did!)", 
   {}, 
   222114, 
   null, 
   1152799800.0
  ], 
  [
   222154, 
   null, 
   "Steeeeve", 
   "Politics and historical trends largely determined what is currently considered the range of beliefs about Jesus which we call Christianity. In the early years, these beliefs varied very widely - from beliefs in Jesus being purely human to beliefs in him being purely divine (with the human form being an illusion). So, when you say that \"there is only one way\", that is only your opinion based on the traditions you are most familiar with. \n \n that and the fact that they Bible says so. I don't know of anytime that Jesus was considered not the \"trinity\" (atleats for Christians)\n \n \n\n Other faiths believed in a different way. Unfortuntately, we don't have a time capsule to take us back through time to watch the events and listen to Jesus speak, so we have to rely on the early sources. Unfortunately, these early Christians were not in agreement with each other - including Peter vs. Paul about whether Chrisitianity should be part of Judaism, etc. So, we may never know exactly what was said and done with regard to the reality of Jesus.\n \n This brings up a question that I brought up in the Religion forum. Namely, how far can a religion evolve from its origins and still be called that religion?\n\n Thats my point...you can't evolve a religion just for the fun of it. Evolving it to support abortion or gay marriage (for example) would be against the only teachings we have....even if some believe them to be wrong. What else would you base your religious decision on? It makes no sense to just evolve with the times....that is a baseless religion.", 
   {}, 
   222078, 
   null, 
   1152800340.0
  ], 
  [
   222158, 
   null, 
   "Another opinion", 
   "that and the fact that they Bible says so. I don't know of anytime that Jesus was considered not the \"trinity\" (atleats for Christians)\n\n I took a CD course from \"the Teaching Company\" (teach12.com) titled \"Lost Christianities: Christian Scriptures and the Battles over Authentication\" which outlined many of the early Chrisitian beliefs - before they were all excluded in favor of the proto-orthodox belief that became the standard Roman Catholic belief. To name a few differing beliefs (quoting from that course):\n The Ebionites were Jewish Christians who followed Jewish laws but accepted Jesus as the Messiah without believing he was divine.\n The Marcionites rejected Judaism completely to the extent that they believed that the God of the Old Testament and the God of Jesus were two separate Gods. \n Gnostics believed that there was one true God but that there were also many other deities.\n As you can see then, early Christianity was far more varied than most Christians might ever imagine. The Bible, with its New Testiment as we generally know it, was codified many centuries after the death of Jesus- at a time when so much was lost to human memory and politics played enough of a role that I, along with many others, simply don't take the current Bible as the only possible source about Jesus.\n \nThats my point...you can't evolve a religion just for the fun of it. Evolving it to support abortion or gay marriage (for example) would be against the only teachings we have....even if some believe them to be wrong. What else would you base your religious decision on? It makes no sense to just evolve with the times....that is a baseless religion.\n\n I have not heard about any quote from the original Gospels which directly addresses gay marriage or abortion. Even if it did, the choice of which Gospels to include in the New Testament was made many centuries after Jesus' death and politics played a role. Even the first Gospel - the Gospel of Mark - was written a few decades after Jesus' death when stories about Jesus easily could have already been distorted. We simply lack good contemporary sources about Jesus written by people who had actually known him - those missing sources would be the ones I would put more trust in. \n \n As for changing a religion, I might agree with you that one cannot change Roman Catholicism too much and still call it that since its founding was directly related to the consolidation and codification of Christianity in the 4th century, so the political decision about which particular view of Christianity to follow defined Roman Catholicism. However, this is not true about the more general religion of \"Christianity\" which, as I had shown in the first section, followed very wide ranges of beliefs.", 
   {}, 
   222154, 
   null, 
   1152801900.0
  ], 
  [
   222172, 
   null, 
   "Steeeeve", 
   "I took a CD course from \"the Teaching Company\" (teach12.com) titled \"Lost Christianities: Christian Scriptures and the Battles over Authentication\" which outlined many of the early Chrisitian beliefs - before they were all excluded in favor of the proto-orthodox belief that became the standard Roman Catholic belief. To name a few differing beliefs (quoting from that course):\n The Ebionites were Jewish Christians who followed Jewish laws but accepted Jesus as the Messiah without believing he was divine.\n The Marcionites rejected Judaism completely to the extent that they believed that the God of the Old Testament and the God of Jesus were two separate Gods.\n Gnostics believed that there was one true God but that there were also many other deities.\n As you can see then, early Christianity was far more varied than most Christians might ever imagine. The Bible, with its New Testiment as we generally know it, was codified many centuries after the death of Jesus- at a time when so much was lost to human memory and politics played enough of a role that I, along with many others, simply don't take the current Bible as the only possible source about Jesus.\n Quote:\n Can you clarify which part you quoted and which part was your own writting. If the last sentence was from the class than that class is garbage and you wasted your money.\n \n \nI have not heard about any quote from the original Gospels which directly addresses gay marriage or abortion. Even if it did, the choice of which Gospels to include in the New Testament was made many centuries after Jesus' death and politics played a role. Even the first Gospel - the Gospel of Mark - was written a few decades after Jesus' death when stories about Jesus easily could have already been distorted. We simply lack good contemporary sources about Jesus written by people who had actually known him - those missing sources would be the ones I would put more trust in.\n While I disagree, the point is irrelevant. A religion still has to be based on something. If it is to be based on something that is 100% wrong than so be it but if one were to just \"evolve\" away from that and create its own rules than it really is a religion based on nothing and it pretty much becomes worthless.", 
   {}, 
   222158, 
   null, 
   1152806340.0
  ], 
  [
   222176, 
   null, 
   "Another opinion", 
   "It's just that the pomposity and the \"you gotta go through us to get to God\" XXXX is simply a manipulating tool used to perpetuate the power and lifestyle of the hierarchy. The rulings passed down to the parisioners are nothing more than fear spears designed to maintain control over the masses.\n \n Excommunication from such a tightly run power machine should be a welcomed relief. There are many denominations that welcome ALL sinners...including women who've had abortions. I guess I'm protesting (like the first Protestants did!)\n\n But you are assuming that that power machine is tightly run and that those \"fear spears\", as you call them, are indeed passed down to all of the masses. That is simply not true for the Roman Catholicism that I experienced in my youth in Massachusetts and that I still occasionally experience in visits to my folks - the rare occasions when I still go to mass. There is some pagiantry in the robes and customs but, frankly, I always found those enjoyeable to watch - a bit of the beauty of old world pageantry put into the new world. The British probably enjoy the pageantry of the royal family for similar reasons. As for the dogma of papal infalibility, etc., that was never brought up in my experience in mass. Really, the only time the pope or other clergy were ever mentioned was in weekly prayers where, along with praying for those who are in need, for wisdom for our political leaders, for peace, one would also pray for the pope and bishops. All of the negative aspects which you mention were largely invisible to those of us in my congregation in Massachusetts. This is not to say that many, most likely most, congregations do experience at least some of those negative aspects - just not mine. \n \n Apparently, it is thought in higher clerical circles that American Roman Catholicism has gone too far astray from orthodox belief and, I can imagine, that Catholicism in Massachusetts is even farther left of main American Roman Catholicism. You might ask whether the version of Roman Catholicism that I experienced was true Roman Catholicism. That is an interesting issue - the evolution of a religion. At what point are differences large enough to warrant a split? Interesting points to ponder. As I had said, I hold a hope that the Roman Catholic church will evolve toward the left-of-center but am quite pessimistic about that happenning.", 
   {}, 
   222153, 
   null, 
   1152807360.0
  ], 
  [
   222180, 
   null, 
   "Another opinion", 
   "Can you clarify which part you quoted and which part was your own writting. If the last sentence was from the class than that class is garbage and you wasted your money.\n\n The three sentences about the Ebionites, Marcionites and Gnostics come from the web site outlining the course. The last few sentences are my conclusions based on the variety of early Christian beliefs outlined in that course and on another course I had taken on the \"Historical Jesus\" that analyzed the early sources about Jesus, comparing the Gospels to each other, their point in history, other beliefs about holy men contemporary to Jesus, and on some external mentions.\n \n While I disagree, the point is irrelevant. A religion still has to be based on something. If it is to be based on something that is 100% wrong than so be it but if one were to just \"evolve\" away from that and create its own rules than it really is a religion based on nothing and it pretty much becomes worthless.\n\n All of those early Christian beliefs had as a common thread that Jesus existed and was a good, highly important holy being - that is what \"Christianity\" seems to be based on. Outside of that, they seemed to vary widely. One would not even have to think of Jesus as divine to be considered a Christian at those times (as with the Ebionites). The muslims believe that Mohammed was a mortal man, after all, that was only deeply inspired and led by God - so their religion is based on the devotion to a mortal, along with the worship of God/Allah. I am not claiming that Jesus was only human - I just don't know. There is no independent evidence for his divinity but I personally still hold out some hope for it. I simply dispute the claim that a belief cannot be \"Christian\" unless it follows the standard beliefs - that was far from the truth.", 
   {}, 
   222172, 
   null, 
   1152808440.0
  ], 
  [
   222182, 
   null, 
   "Steeeeve", 
   "All of those early Christian beliefs had as a common thread that Jesus existed and was a good, highly important holy being - that is what \"Christianity\" seems to be based on. Outside of that, they seemed to vary widely. One would not even have to think of Jesus as divine to be considered a Christian at those times (as with the Ebionites). The muslims believe that Mohammed was a mortal man, after all, that was only deeply inspired and led by God - so their religion is based on the devotion to a mortal, along with the worship of God/Allah. I am not claiming that Jesus was only human - I just don't know. There is no independent evidence for his divinity but I personally still hold out some hope for it. I simply dispute the claim that a belief cannot be \"Christian\" unless it follows the standard beliefs - that was far from the truth.\n This is still irrelevant. The point is, you can't just go changing the views on your religion if you base it on nothing. Saying \"Jesus was a holy being\" probably won't cut it and certainly doesn't cut it for the Roman Catholic Church. The church says they believe in the Bible. Even if it is wrong they still need to go by it and base their belief system on it. If not then they would be a worthless institution. Your early point was that the RCC should become more liberal and pretty much stray away from their belief in the Bible. If they do this than why even have the religion? You are believing in anything and just instead creating a club to make you feel good which chances on the whims of the people.", 
   {}, 
   222180, 
   null, 
   1152809100.0
  ], 
  [
   222184, 
   null, 
   "jim's trucking", 
   "But you are assuming that that power machine is tightly run and that those \"fear spears\", as you call them, are indeed passed down to all of the masses. That is simply not true for the Roman Catholicism that I experienced in my youth in Massachusetts and that I still occasionally experience in visits to my folks - the rare occasions when I still go to mass. There is some pagiantry in the robes and customs but, frankly, I always found those enjoyeable to watch - a bit of the beauty of old world pageantry put into the new world. The British probably enjoy the pageantry of the royal family for similar reasons. As for the dogma of papal infalibility, etc., that was never brought up in my experience in mass. Really, the only time the pope or other clergy were ever mentioned was in weekly prayers where, along with praying for those who are in need, for wisdom for our political leaders, for peace, one would also pray for the pope and bishops. All of the negative aspects which you mention were largely invisible to those of us in my congregation in Massachusetts. This is not to say that many, most likely most, congregations do experience at least some of those negative aspects - just not mine. \n \n Apparently, it is thought in higher clerical circles that American Roman Catholicism has gone too far astray from orthodox belief and, I can imagine, that Catholicism in Massachusetts is even farther left of main American Roman Catholicism. You might ask whether the version of Roman Catholicism that I experienced was true Roman Catholicism. That is an interesting issue - the evolution of a religion. At what point are differences large enough to warrant a split? Interesting points to ponder. As I had said, I hold a hope that the Roman Catholic church will evolve toward the left-of-center but am quite pessimistic about that happenning.\nIt would likely be interesting to read a comprehensive study of the evolution of sects and denominations from day one. I've often heard of Episcopalians being referred to as \"bob-tailed Catholics\" and we have Southern Baptists, Orthodox Jews, Mormons (who simply added a book to the Bible) and other versions of other basic religions each of which share some link to their common source foundations.\n \n I suppose this (splitting of congregations into opposing groups) somewhat supports my belief that religion is the single most powerful source of divisiveness that we have...it divides people even within groups who already claim to have the same beliefs. The ordainment of gay priests is currently doing that to one group as we speak. (I forget which, but it's been in the news lately...maybe the Presbyterians?)\n \n This discussion has opened many fascinating windows of opportunity to ponder religion and human nature. I maintain that the RC church is out to lunch. There is no sound reason to ostracize women based upon abortion. \n \n \n But...I ain't Catholic!emoticon_xhoho", 
   {}, 
   222176, 
   null, 
   1152809400.0
  ], 
  [
   222210, 
   null, 
   "Another opinion", 
   "This is still irrelevant. The point is, you can't just go changing the views on your religion if you base it on nothing. Saying \"Jesus was a holy being\" probably won't cut it and certainly doesn't cut it for the Roman Catholic Church. The church says they believe in the Bible. Even if it is wrong they still need to go by it and base their belief system on it. If not then they would be a worthless institution. Your early point was that the RCC should become more liberal and pretty much stray away from their belief in the Bible. If they do this than why even have the religion? You are believing in anything and just instead creating a club to make you feel good which chances on the whims of the people.\n\n It depends on what level of the religion you are trying to change. As I mentioned in post 36, the Roman Catholic Church was essentially founded on the consolidation and codification of Christianity in the 4th century so any deviation from those chosen limitations on Christian belief would probably no longer be allowed to be called Roman Catholic. However, even within those constraints, a lot of laws of the Roman Catholic church were determined by subsequent generations of clergy and scholars and their personal interpretations of original texts (Gospels, etc.) that were either vague on certain issues or silent on those issues. Just look at the issue of abortion (the main topic of this forum, after all). There were long periods in the history of the Roman Catholic Church when abortion was not considered murder until \"quickening\" when it was thought that the soul enters the body. At other times, the soul was thought to enter the body at about 40 days. These variations show that the original texts are far from clear on the subject. I suspect the same is true for approaches to gays, etc. Another issue is the possession of wealth and keeping it away from the poor. Anyone familiar with the teachings of Jesus as explained in the Gospels would know how such hoarding of property was frowned upon by him. Nevertheless, the Roman Catholic Church, though it does give a non-insignificant portion of its wealth to the poor, certainly does hoard significant property. All I am saying is that so much of Roman Catholic faith is based on the interpretations and, essentially, guesses of generations of clergy that may or may not have even been based on those original texts. Therefore, even within a particular faith, there is still a lot of room to maneuver.\n \n As for the adaptability of \"Christianity\" in general, the wide range of early Christian beliefs show that a completely novel interpretation, much different than the current range of Christian faiths, could still call itself Christian. Personally, I would love to see one emerge that is more liberal. Episcopalianism is somewhat more liberal than the others - with its ordaining of women and gay bishops. That seems to be causing a potential split. If that happens, then so be it. It might free the more liberal wing to evolve farther.", 
   {}, 
   222182, 
   null, 
   1152817620.0
  ], 
  [
   222213, 
   null, 
   "Another opinion", 
   "It would likely be interesting to read a comprehensive study of the evolution of sects and denominations from day one. I've often heard of Episcopalians being referred to as \"bob-tailed Catholics\" and we have Southern Baptists, Orthodox Jews, Mormons (who simply added a book to the Bible) and other versions of other basic religions each of which share some link to their common source foundations.\n \n I suppose this (splitting of congregations into opposing groups) somewhat supports my belief that religion is the single most powerful source of divisiveness that we have...it divides people even within groups who already claim to have the same beliefs. The ordainment of gay priests is currently doing that to one group as we speak. (I forget which, but it's been in the news lately...maybe the Presbyterians?)\n\n Well at least those splits, where Christianity is concerned, are no longer followed by violence. It also certainly seems that most people readily accept others of different Christian faiths. Also, many, if not most, also readily accept others of completely different non-Christian faiths. It is a different world (in the West at least) than it was centuries ago when wars were fought over religious splits.\n \n It is the Episcopalians that have recently ordained a gay bishop and thus provoked a lot of anger from the more conservative parts of the Anglican community. I believe that they also had ordained a divorced female higher level bishop some years back. That is the most liberal Church I have heard of so far - more power to them emoticon_xgood \n \nThis discussion has opened many fascinating windows of opportunity to ponder religion and human nature. I maintain that the RC church is out to lunch. There is no sound reason to ostracize women based upon abortion. \n\n Well, I would agree with you about the official Roman Catholic Church, but maintain the large differences between that and some of the actual Roman Catholic practice.", 
   {}, 
   222184, 
   null, 
   1152820020.0
  ], 
  [
   222233, 
   null, 
   "Steeeeve", 
   "It depends on what level of the religion you are trying to change. As I mentioned in post 36, the Roman Catholic Church was essentially founded on the consolidation and codification of Christianity in the 4th century so any deviation from those chosen limitations on Christian belief would probably no longer be allowed to be called Roman Catholic. However, even within those constraints, a lot of laws of the Roman Catholic church were determined by subsequent generations of clergy and scholars and their personal interpretations of original texts (Gospels, etc.) that were either vague on certain issues or silent on those issues. Just look at the issue of abortion (the main topic of this forum, after all). There were long periods in the history of the Roman Catholic Church when abortion was not considered murder until \"quickening\" when it was thought that the soul enters the body. At other times, the soul was thought to enter the body at about 40 days. These variations show that the original texts are far from clear on the subject. I suspect the same is true for approaches to gays, etc. Another issue is the possession of wealth and keeping it away from the poor. Anyone familiar with the teachings of Jesus as explained in the Gospels would know how such hoarding of property was frowned upon by him. Nevertheless, the Roman Catholic Church, though it does give a non-insignificant portion of its wealth to the poor, certainly does hoard significant property. All I am saying is that so much of Roman Catholic faith is based on the interpretations and, essentially, guesses of generations of clergy that may or may not have even been based on those original texts. Therefore, even within a particular faith, there is still a lot of room to maneuver.\n \n As for the adaptability of \"Christianity\" in general, the wide range of early Christian beliefs show that a completely novel interpretation, much different than the current range of Christian faiths, could still call itself Christian. Personally, I would love to see one emerge that is more liberal. Episcopalianism is somewhat more liberal than the others - with its ordaining of women and gay bishops. That seems to be causing a potential split. If that happens, then so be it. It might free the more liberal wing to evolve farther.\nWell, as stated, no one ever accussed the Roman Catholic Church of being consistent. While they may maneuver (as you put it) it really contradicts everything they stand for. At the end of the day, God is right and the changing of opinions means the RCC (or others) will be wrong...atleast one time. But if they become more liberal you are basically saying that they should just change with the times and thus have no basis for a religion other than the wishes of the people. \n \n I believe there is only one true meaning to the Bible. I disagree that it is a matter of interpreting. While the Bible doesn't have to state every issues directly, you can easily recognize basic principals and apply them to other situations. For example, the Bible doesn't say cutting of peoples arms for fun is wrong but you could easily apply principals of the Bible to this. I think abortion and gay \"rights\" work the same way..although gay rights is a little more explicit. But this is a little off topic. My main point is that making the Roman Catholic Church just change it views based on nothing would render the RCC more worthless than it already is.", 
   {}, 
   222210, 
   null, 
   1152825480.0
  ], 
  [
   222235, 
   null, 
   "Steeeeve", 
   "I maintain that the RC church is out to lunch. There is no sound reason to ostracize women based upon abortion. \n Yeah, it seems a main point Jesus made was that you need to forgive and love as opposed to kick to the curb. No wonder Jesus often critized the pharohs.", 
   {}, 
   222233, 
   null, 
   1152825660.0
  ], 
  [
   222248, 
   null, 
   "Another opinion", 
   "Well, as stated, no one ever accussed the Roman Catholic Church of being consistent. While they may maneuver (as you put it) it really contradicts everything they stand for. At the end of the day, God is right and the changing of opinions means the RCC (or others) will be wrong...atleast one time. But if they become more liberal you are basically saying that they should just change with the times and thus have no basis for a religion other than the wishes of the people.  \n\n If there was some clear and unquestionable evidence revealing what God required of humans (assuming God exists), then any religion about God would not be able to stray from those rules. No such evidence exist, so the rest is a leap of faith. We have no clear way to know who is right and who is wrong. People base their faith on texts - i.e. the Bible - that are considered sacred. What made them sacred? It wasn't until the fourth century that the New Testament was codified by fallible human beings. To trust in the truth of the Bible means that you trust that those human beings knew God's requirements. That is a leap of faith about people that I do not choose to make. Humans make good faith interpretations but those good faith interpretations can easily be wrong. New, more liberal interpretations of the original stories about Jesus have no better or worse chance of being right or wrong than the early intepretations. In fact, I would think that added scientific and historical knowledge would only give them a greater chance at guessing the truth (if there truly is a supernatural truth out there). Ultimately, I don't have blind trust in the Bible due to (a) the fallibility of personal interpretation of many of the writers and (b) the delay between the death of Jesus and even the first of the Gospels easily allowing for original true stories to be distorted.\n \n However, the Roman Catholic Church does claim to rely on the truth of the Bible - at least in the form it took at its founding. Thus, as I had already agreed, the Roman Catholic Church is limited in how far it can evolve since it is ultimately limited by the canonized texts. However, even there, the original texts were so vague on certain subjects that many interpretations were possible. I am curious, regarding those canonized texts (i.e. the Bible), and more specifically the Gospels: What specific quotes do you know of most related to gay marriage? As for abortion, I have seen quotes that claim to support both sides of the arguement.\n \n The limits on religious evolution would be much less strict for other possible Christian denominations. As I had explained, some early Christians didn't even think that Jesus was divine and some didn't think the God of the Old Testament was the same as that of the New Testament - beliefs far different from current versions of Christianity. The \"Christian\" relgion in general thus has much more freedom to evolve than does Roman Catholicism.", 
   {}, 
   222233, 
   null, 
   1152828420.0
  ], 
  [
   222252, 
   null, 
   "Steeeeve", 
   "If there was some clear and unquestionable evidence revealing what God required of humans (assuming God exists), then any religion about God would not be able to stray from those rules. No such evidence exist, so the rest is a leap of faith. We have no clear way to know who is right and who is wrong. People base their faith on texts - i.e. the Bible - that are considered sacred. What made them sacred? It wasn't until the fourth century that the New Testament was codified by fallible human beings. To trust in the truth of the Bible means that you trust that those human beings knew God's requirements. That is a leap of faith about people that I do not choose to make. Humans make good faith interpretations but those good faith interpretations can easily be wrong. New, more liberal interpretations of the original stories about Jesus have no better or worse chance of being right or wrong than the early intepretations. In fact, I would think that added scientific and historical knowledge would only give them a greater chance at guessing the truth (if there truly is a supernatural truth out there). Ultimately, I don't have blind trust in the Bible due to (a) the fallibility of personal interpretation of many of the writers and (b) the delay between the death of Jesus and even the first of the Gospels easily allowing for original true stories to be distorted.\n \n However, the Roman Catholic Church does claim to rely on the truth of the Bible - at least in the form it took at its founding. Thus, as I had already agreed, the Roman Catholic Church is limited in how far it can evolve since it is ultimately limited by the canonized texts. However, even there, the original texts were so vague on certain subjects that many interpretations were possible. I am curious, regarding those canonized texts (i.e. the Bible), and more specifically the Gospels: What specific quotes do you know of most related to gay marriage? As for abortion, I have seen quotes that claim to support both sides of the arguement.\n \n The limits on religious evolution would be much less strict for other possible Christian denominations. As I had explained, some early Christians didn't even think that Jesus was divine and some didn't think the God of the Old Testament was the same as that of the New Testament - beliefs far different from current versions of Christianity. The \"Christian\" relgion in general thus has much more freedom to evolve than does Roman Catholicism.\n\n \n I don't wish to argue the merits of the basis from which a religion is based (although I do disagree with you). My point is that a religion has to be consistent with its views or you render the religion worthless. Changing with the wants of people is no basis for a religion. You are pretty much making it a faith in people which is probably a bad idea if you are a religion who claims a faith in God. A more \"liberal\" approach does nothing more than make it a Sunday club for people to feel good about themselves rather than seek the love of God. But it seems we mostly agree on this point.", 
   {}, 
   222248, 
   null, 
   1152829080.0
  ], 
  [
   222290, 
   null, 
   "Another opinion", 
   "I don't wish to argue the merits of the basis from which a religion is based (although I do disagree with you). My point is that a religion has to be consistent with its views or you render the religion worthless. Changing with the wants of people is no basis for a religion. You are pretty much making it a faith in people which is probably a bad idea if you are a religion who claims a faith in God. A more \"liberal\" approach does nothing more than make it a Sunday club for people to feel good about themselves rather than seek the love of God. But it seems we mostly agree on this point.\n\n I don't believe that religions are fully changeable, but the wide range of early Christian beliefs clearly show that Christianity is far more variable than most people ever imagine - that is my main point. That variability allows a fair amount of room for evolution of religious belief. \n \n I agree with you that Roman Catholicism or the other much more tightly defined sub-categories of Christianity are far less changeable than the general category of \"Christianity\".", 
   {}, 
   222252, 
   null, 
   1152851160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Excommunicating Women Who Abort", 
  "url": "http://www.4forums.com/political/abortion-debates/8415-excommunicating-women-who-abort.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 8415, 
  "discussion_files": [
   [
    "7786.html", 
    "http://www.4forums.com/political/abortion-debates/8415-excommunicating-women-who-abort-print.html"
   ], 
   [
    "7787.html", 
    "http://www.4forums.com/political/abortion-debates/8415-excommunicating-women-who-abort-4-print.html"
   ], 
   [
    "7788.html", 
    "http://www.4forums.com/political/abortion-debates/8415-excommunicating-women-who-abort-3-print.html"
   ], 
   [
    "7789.html", 
    "http://www.4forums.com/political/abortion-debates/8415-excommunicating-women-who-abort-2-print.html"
   ]
  ], 
  "identifier": 8415
 }
]