[
 [
  [
   220924, 
   null, 
   "simone", 
   "That would be George Walker Bush's hometown, by the way:\n \n http://www.ufppc.org/content/view/4738/\n \n NEWS: Soldier charged with Iraq rape-murder is from Bush's hometown, rape capital of Texas \n Written by Hank Berger \n Tuesday, 04 July 2006\n Because Steven D. Green, 21, was recently honorably discharged from the military (with a \"personality disorder\"), it was in U.S. District Court in Charlotte, NC, that he appeared Monday, after being arrested there on Jun. 30, to hear charges brought in Louisville, KY, the New York Times reported Monday.\n \n Green was charged with the premeditated rape and murder of Abeer Qasem Hamzeh, described as \"an Iraqi woman\" (though the mayor of Mahmudiya, the Iraqi town south of Baghdad where the crimes took place, said the rape victim was only 15 years old), and with the murder of three other members of her family: her sister, Hadeel, her father, Qasem Hamzeh Rasheed, and her mother, Fakhariya Taja Muhassain. -- Peter Spiegel of the Los Angeles Times reported that the murder of the rape victim's family took place prior to the rape.\n \n Spiegel noted that \"Because Green's is the first case of alleged wrongdoing by American servicemen in Iraq to go through the civilian U.S. legal process, Ahlers' six-page affidavit -- submitted Friday in support of a request for an arrest warrant -- is one of the most detailed public accountings of abuse accusations [in Iraq] yet.\" -- A Washington Post report gave the date of the incident: Mar. 12, 2006.\n \n The Post also pointed out that Green and others involved in the crime were members of the same platoon as the two American soldiers kidnapped and beheaded last month. -- The Post reported that neighbors of the rape victim \"said she had expressed concerns about the U.S. troops to her mother in the days before her death because the soldiers made advances toward her.\" -- An uncle of Steven Green was interviewed by the Post, which reported that Green grew up in Midland, TX, but refrained from pointing out that Midland is George W. Bush is proud to call his hometown (Bush said in a speech to the Republican National Convention in 2000: \"I come from a different place and it has made me a different leader. In Midland, Texas, where I grew up, the town motto was, 'The sky's the limit,' and we believed it. There was a restless energy . . .\").\n \n Some in the U.S. military seemed inclined to blame \"society\" for the crime, Josh White of the Post reported. -- Retired Maj. Gen. John Batiste, who commanded the Army's 1st Infantry Division in Iraq, said: \"The military is a reflection of society, and because of that there is always a percentage of soldiers, Marines, airmen, and sailors who get it terribly wrong.\" -- He may have a point: A Bush Watch collection of pieces about Midland incluldes a snippet from the Midland (TX) Reporter-Telegram of Jul. 2, 2000, reporting that \"For almost seven years, Midland has retained the unwanted reputation for having the most rapes per capita in Texas,\" according to Betty Dickerson, the director of the Midland Rape Crisis Center.", 
   {
    "post_info": {
     "post_title": "The Soldier from the Rape Capital of Texas"
    }
   }, 
   null, 
   null, 
   1152131700.0
  ], 
  [
   221020, 
   null, 
   "Dono", 
   "No one will ever accuse me of being a Bush fan, but what does the rape rate in Midland have to do with him. The report mentioned is over 5 years old. If the rape rate has improved since then, is it because he left? Every state has a city/area that has the highest rape rate per capita. Is Bush to blame for that? I often speak against the president, and he gives me more than enough reason to do so, but this is a real stretch. \n Dono", 
   {}, 
   220924, 
   null, 
   1152175020.0
  ], 
  [
   221069, 
   null, 
   "simone", 
   "Just one of those interesting facts of life.", 
   {}, 
   221020, 
   null, 
   1152203820.0
  ], 
  [
   221074, 
   null, 
   "simone", 
   "I had a very interesting chat with someone from the rape crisis center in Midland, Texas, and she opined that Midland, Texas probably has a higher incidence of reporting rapes as opposed to the incidence of rapes, owing to a comprehensive program to education the public, as well as kids in age-appropriate curriculum, about sexual abuse from kindergarten age upward.\n \n http://www.mrccac.org/aboutus/index.html\n \n I could not find specific references to their sexual abuse curriculum on their website, but I think it is a dynamic way of decreasing the incidence of rape.\n \n Unfortunately, Steven D. Green, 21, didn't seem to catch on to the idea that rape is wrong. Men do seem to have a higher incidence of learning disabilities than women do.", 
   {}, 
   221069, 
   null, 
   1152205440.0
  ], 
  [
   221114, 
   null, 
   "Dono", 
   "I used to visit Midland and sister city Odessa often on business. It is in the middle of nowhere, but seems to function quite well. Oil and football are the primary industries there. I would never hold the presence of a transmitted Yankee against them.\n Dono", 
   {}, 
   221074, 
   null, 
   1152216060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Soldier from the Rape Capital of Texas", 
  "url": "http://www.4forums.com/political/politics-debates/8434-soldier-rape-capital-texas.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 8434, 
  "discussion_files": [
   [
    "9181.html", 
    "http://www.4forums.com/political/politics-debates/8434-soldier-rape-capital-texas-print.html"
   ]
  ], 
  "identifier": 8434
 }
]