[
 [
  [
   220997, 
   null, 
   "zachvac", 
   "Amendment XIII, Section 1: \"Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.\"\n \n Amendment XIV, Section 1: \"All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States, nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\"\n \n \n Prove me wrong. Is compulsory eduction not involuntary servitude? Have all children been convicted of a crime?\n \n I'm not trying to get out of school, after all I'm planning on going to college, which is optional. But compulsory education defeats the purpose of education.", 
   {
    "post_info": {
     "post_title": "Compulsory Education is Unconstitutional"
    }
   }, 
   null, 
   null, 
   1152167040.0
  ], 
  [
   221332, 
   null, 
   "electrolyte", 
   "It's not servitude, so it's not involuntary servitude.", 
   {}, 
   220997, 
   null, 
   1152340500.0
  ], 
  [
   221338, 
   null, 
   "zachvac", 
   "It's not servitude, so it's not involuntary servitude.\n\n \n one of the definitions of servitude on dictionary.com is:\n \n \"Lack of personal freedom, as to act as one chooses.\"\n \n Kids are forced to sit in a classroom, walk to the next, do homework outside of school, and even Constitutionally don't have as many rights while in school. How much more before it becomes servitude?\n \n BTW, I figure even if it isn't compulsory it will still have a lot of kids go since it's their parents' decision. Similarly look at college. It would become necessary to complete just like college to get a decent job anywhere.", 
   {}, 
   221332, 
   null, 
   1152341400.0
  ], 
  [
   221346, 
   null, 
   "Jo Bennett", 
   "the difference is that by the time you get to college you're generally more capable of thinking and planning ahead.", 
   {}, 
   221338, 
   null, 
   1152348600.0
  ], 
  [
   221386, 
   null, 
   "electrolyte", 
   "one of the definitions of servitude on dictionary.com is:\n \n \"Lack of personal freedom, as to act as one chooses.\"\n\n So if I want to kill you, but I'm not allowed to, I am in servitude?\n \n \nKids ... even Constitutionally don't have as many rights while in school.\n\n Kids have ridiculously few rights whether they're in or out of school.", 
   {}, 
   221338, 
   null, 
   1152387360.0
  ], 
  [
   221442, 
   null, 
   "GreenMtnBoy", 
   "You don't have to go to school. You could be home schooled.", 
   {}, 
   221386, 
   null, 
   1152413760.0
  ], 
  [
   221466, 
   null, 
   "zachvac", 
   "So if I want to kill you, but I'm not allowed to, I am in servitude?\n \n\n Nope, that is violating my right to life. Not attending school is hardly violating any rights.\n \n \n\n Kids have ridiculously few rights whether they're in or out of school.\n\n Which by the 14th amendment, is unconstitutional", 
   {}, 
   221386, 
   null, 
   1152419160.0
  ], 
  [
   221473, 
   null, 
   "electrolyte", 
   "Nope, that is violating my right to life. Not attending school is hardly violating any rights.\n\n An excellent point, but we are discussing the definition of \"servitude.\" According to the definition you cited, I would be \"in servitude,\" regardless of whatever rights I might be violating.\n \n \nWhich by the 14th amendment, is unconstitutional\n\n Yes, see, I wasn't really disagreeing with you on this point. Really, more than just the 14th Amendment is involved.", 
   {}, 
   221466, 
   null, 
   1152419880.0
  ], 
  [
   221482, 
   null, 
   "zachvac", 
   "the difference is that by the time you get to college you're generally more capable of thinking and planning ahead.\n\n \n Which is why the parents would still have the ultimate say, but if they and the kid don't want the kid to attend school, why make them?", 
   {}, 
   221346, 
   null, 
   1152421620.0
  ], 
  [
   224019, 
   null, 
   "Jo Bennett", 
   "Which is why the parents would still have the ultimate say, but if they and the kid don't want the kid to attend school, why make them?\n\n \n Because some parents don't have the best interests of their children at heart.", 
   {}, 
   221482, 
   null, 
   1153587480.0
  ], 
  [
   224028, 
   null, 
   "zachvac", 
   "Because some parents don't have the best interests of their children at heart.\n\n \n So we violate the Constitution? Most of our laws assume that they do have the best interests of the kids at heart, unless they are physically abusing them.", 
   {}, 
   224019, 
   null, 
   1153594200.0
  ], 
  [
   239197, 
   null, 
   "flaja", 
   "the difference is that by the time you get to college you're generally more capable of thinking and planning ahead.\n\n \n \n Unlike the child whose immaturity prevents him from seeing the necessity of a good education.\n \n I used to have thoughts similar to what is posted here in the first thread. But, I gave them up when I got out of the 3rd grade.", 
   {}, 
   221346, 
   null, 
   1163298600.0
  ], 
  [
   308036, 
   null, 
   "peejay", 
   "Some great comments.\n I would agree that compulsory education is about controlling the masses, and\n forcing people to accept the warped ideas of those in power.\n \n If you are interested, there is another debate going on here:\n \n \n \n riledup.com/debate/1647/public-education-mind-control-or-benefit-to-society\n \n \n you will need to add the http colon and two backslashes to view it.", 
   {
    "post_info": {
     "post_title": "Great debate, one that is needed today"
    }
   }, 
   239197, 
   null, 
   1207765800.0
  ], 
  [
   308144, 
   null, 
   "Iuris", 
   "This just tells me it's about damn time the US did a little renovating of their constitution...", 
   {}, 
   308036, 
   null, 
   1207821780.0
  ], 
  [
   309434, 
   null, 
   "CUNxTime", 
   "Amendment XIII, Section 1: \"Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.\"\n \n Amendment XIV, Section 1: \"All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States, nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\"\n \n \n Prove me wrong. Is compulsory eduction not involuntary servitude? Have all children been convicted of a crime?\n \n I'm not trying to get out of school, after all I'm planning on going to college, which is optional. But compulsory education defeats the purpose of education.\n\n \n The problem with your argument is that 'children' aren't, legally, in complete control of their lives. Minors aren't, by definition, capable of making the proper choices regarding what's best for them. Otherwise, they'd be allowed to drive, buy alcohol, be convicted of Adult crimes, etc...\n \n It has been decided that education is a necessary ingredient to make a child into an adult and allow them to become a productive member of society. If children weren't required to go to school, there would be many more people who require substantial govt. programs and assistance, thus becoming more of a drag on society.", 
   {}, 
   220997, 
   null, 
   1208884620.0
  ], 
  [
   324467, 
   null, 
   "yes", 
   "Amendment XIII, Section 1: \"Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.\"\n \n Amendment XIV, Section 1: \"All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States, nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\"\n \n \n Prove me wrong. Is compulsory eduction not involuntary servitude? Have all children been convicted of a crime?\n \n I'm not trying to get out of school, after all I'm planning on going to college, which is optional. But compulsory education defeats the purpose of education.\n\n \n ... I'm playing devils advocate here ...\n \n If it's not compulsory won't it become compulsory through the burden's on the additional use of taxes when they can't support themselves?", 
   {}, 
   220997, 
   null, 
   1222012560.0
  ], 
  [
   334181, 
   null, 
   "Joel_Henderson", 
   "Amendment XIII, Section 1: \"Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to.\n\n \n You're missing the big picture. \n The Constitution is just LAW; and law is simply written guidelines considered by the ruling sovereign. \n \n In 1833-65, sovereignty passed from the people of the individual states, to the federal government. \n IMMEDIATELY after that-- starting in 1867, only a year or two after the war ended state sovereignty, the walls started closing in in terms of freedom, as power-hungry socialists began began passing laws left and right to destroy freedom, according to however they presumed to decide how best to determine other people's lives-- most notably with the passage of comulsory school-attendance laws. \n \n This typial arrogance was demonstrated in 1872 by B.G. Northrop, Secretary of the Connecticut State Board of Education, used his annual report to spell out the points of opposition to compulsory attendance legislation and his refutation of them. That report is excerpted here:\n \n \n\n 1. \"Such a law would create a new crime.\"\n I reply, it ought to. To bring up children in ignorance is a crime and should be treated as such. As the most prolific source of criminality it should be under the ban of legal condemnation and the restraint of legal punishment.\n \n 2. \"It interferes with the liberty of parents.\" I reply again, it ought to, when they are incapacitated by vice or other causes for the performance of essential duties as parents.... If the law may prohibit the owner from practicing cruelty upon his horse or ox, it may restrain the parent from dwarfing the mind and debasing the character of his child.... The child has rights which not even a parent may violate. He may not rob his child of the sacred right of a good education.... When a parent is disqualified by intemperance, cruelty, or insanity, society justly assumes the control of the children.... The State should protect the helpless, and especially these, its defenseless wards, who otherwise will be vicious as well as weak.\n \n 3. \"It arrogates new power by the Government.\" So do all quarantine and hygienic regulations and laws for the abatement of nuisances. Now, ignorance is as noxious as the most offensive nuisance, and more destructive than bodily contagions.\n \n 4. \"It is un-American and unadapted to our free institutions.\"\n To put the question in the most offensive form, it may be asked, \"Would you have policemen drag your children to school?\" I answer, \"Yes, if it will prevent his dragging them to jail a few years hence.\"\n \n 5. \"Compulsory education is monarchical in its origin and history.\" Common as is this impression it is erroneous.... Before the peace of Westphalia, before Prussia existed as a kingdom, and while Frederick William was only \"elector of Brandenburg,\" Connecticut adopted coercive education.\n \n 6. \"Attendance would be just as large without the law as it is now.\"\n It may be so. But so far from being an objection, this fact is strong proof of the efficiency of that law which has itself helped create so healthful a public sentiment. Were the law to be abrogated tomorrow the individual and general interest in public education would remain. The same might have been said of Connecticut for more than 170 years after the adoption of compulsory education. During all that period a native of this State of mature age unable to read the English language would have been looked upon as a prodigy. Still, in Connecticut as well as in Germany, it was the law itself which greatly aided in awakening public interest and in fixing the habits, associations, and traditions of the people.\n\n \n This demostrates the pompous Hitler-complex following the Civil War, displayed by those power-crazy snorts who suddenly flocked to positions of power in the newly-unchecked all-powerful government-- particularly schooling (which among all other child-rearing duties and obligations, parents were suddenly deemed incapable).\n \n And in explaining the reason for this absurd discrepancy, thus we get back to the \"Big Picture\" I mentioned at the outset-- i.e. it was never about education: it was about POWER, i.e. the power to teach citizens from birth, that they HAD NO RIGHTS, and that their lives were WHOLLY SUBORDINATE to those of the US government-- and that they HAVE no rights in the \"inalienable\" sense, but rather simply PRIVILEGES that society graciously ALLOWS them.\n \n That's why Francis Bellamy wrote the Plege of Allegiance only 20 years later-- and kids have been FORCED to recite it ever since: i.e. to swear an oath of loyalty to the US government--- and that it is \"one nation, indivisible,\" even though the LAW says that it is is NEITHER.\n They want to mold the young and impressionable kids to submit to the state.\n Likewise, the phrase \"liberty and justice for all,\" simply adds insult to injury, by telling them that their all-powerful government is FAIR, no matter WHAT it does.\n \n Schools, being part of a socialist government, simply thus exist to rip out and destroy the human soul.", 
   {}, 
   220997, 
   null, 
   1227617340.0
  ], 
  [
   334257, 
   null, 
   "Joel_Henderson", 
   "... I'm playing devils advocate here ...\n \n If it's not compulsory won't it become compulsory through the burden's on the additional use of taxes when they can't support themselves?\n\n \n That's not Devil's Advocate-- that's PLAYING GOD.\n This is exactly what they said about slavery too; i.e. that the black and indian \"savages\" couldn't care for themselves in a white man's world, any more than livestock. And thus the price of freedom, is eternal vigilance.\n \n See above: \n \nTo put the question in the most offensive form, it may be asked, \"Would you have policemen drag your children to school?\" I answer, \"Yes, if it will prevent his dragging them to jail a few years hence.\"\n\n \n And thus absolute power, corrupts absolutely; as William Pitt said, \"\"Necessity is the plea for every infringement of human freedom. It is the argument of tyrants; it is the creed of slaves.\" \n Even Hitler claimed that the Holocaust was \"necessary.\"", 
   {}, 
   324467, 
   null, 
   1227654360.0
  ], 
  [
   334372, 
   null, 
   "simone", 
   "You don't have to go to school. You could be home schooled.\n\n So, who is standing in the way of home schooling?\n \n You also forgot the other option.\n \n Being stupid and uneducated.", 
   {}, 
   221442, 
   null, 
   1227731580.0
  ], 
  [
   334373, 
   null, 
   "simone", 
   "Some great comments.\n I would agree that compulsory education is about controlling the masses, and\n forcing people to accept the warped ideas of those in power.\n \n If you are interested, there is another debate going on here:\n \n \n \n riledup.com/debate/1647/public-education-mind-control-or-benefit-to-society\n \n \n you will need to add the http colon and two backslashes to view it.\n\n What about the largely local control of education which is still in place.\n \n There are no nationally-mandated curriculums to the best of my knowledge save for a rudimentary understanding of reading, writing and arithmetic.", 
   {}, 
   308036, 
   null, 
   1227731700.0
  ], 
  [
   334639, 
   null, 
   "Joel_Henderson", 
   "So, who is standing in the way of home schooling?\n \n You also forgot the other option.\n \n Being stupid and uneducated.\n\n \n As you are.", 
   {}, 
   334372, 
   null, 
   1227936180.0
  ], 
  [
   334641, 
   null, 
   "Joel_Henderson", 
   "What about the largely local control of education which is still in place.\n \n\n \n You're right, governments need to stop controlling people. It's evil.\n \n \nThere are no nationally-mandated curriculums to the best of my knowledge save for a rudimentary understanding of reading, writing and arithmetic.\n\n \n And again, the key word is \"mandated.\" \n As for \"nationally,\" it's fairly irrelevant if a person is arrested by the federal or state authority, for failure to submit to its indoctrination-centers. \n \n In the absence of actual proof of harm, parents are never required to submit to state authority and control for any of a child's needs EXCEPT education; therefore it's clear that the purpose is not child-welfare but state omnipotence-- and omniscience, by using force to impose its claims of truth on individuals through INDOCTRINATION. \n \n But it calls this \"education\" in order to get away with it; and hence we see the statist paradox of \"shadow-government,\" \n \n Likewise, the term \"nationally mandated\" can be either active or CONSTRUCTIVE, i.e. when the Supreme Court claimed state compulsory-attendance-laws was constitutional; when the court looks the other way against a clear case of involuntary servitude by a state, that's the same as a national mandate.\n \n And what's the FIRST THING that the federal government mandates? THE PLEDGE OF ALLEGIANCE. I.e. all children are FORCED to swear oaths of loyalty to the federal republic-- as well as acceptance of LIES, that the federal government as the supreme and absolute national authority.\n \n And once again, as with abortion, we see that indeed \"all roads lead to Rome:\" it's no accident that these laws were enacted immediately after the Civil War, since that's when the federal government usurped national authority over the states-- which made state governments into lackeys for the Leviathan state. And thus, once the people had no state sovereignty to protect them, the walls of freedom began closing in, like an Indiana Jones movie; the federal government was now God.\n \n As Madison clearly warned in 1800:\n \n \"However true, therefore, it may be, that the judicial department is, in all questions submitted to it by the forms of the Constitution, to decide in the last resort, this resort must necessarily be deemed the last in relation to the authorities of the other departments of the government; not in relation to the rights of the parties to the constitutional compact [i.e. the individual states], from which the judicial, as well as the other departments, hold their delegated trusts. On any other hypothesis, the delegation of judicial power would annul the authority delegating it; and the concurrence of this department with the others in usurped powers, might subvert forever, and beyond the possible reach of any rightful remedy, the very Constitution which all were instituted to preserve.\"\n \n People want to pretend that this doesn't affect all things-- just like they want to pretend that the 900-lb. gorilla in the room isn't there, and won't step on them if they're careful and don't do anything wrong. \n Famous last words-- the American people are only as \"free\" as the leash they're on, and if they pull too hard then the state will hang them by it.\n And the other sheep will blame the victim.", 
   {}, 
   334373, 
   null, 
   1227937860.0
  ], 
  [
   396346, 
   null, 
   "GentlemanJim", 
   "\n And what's the FIRST THING that the federal government mandates? THE PLEDGE OF ALLEGIANCE. I.e. all children are FORCED to swear oaths of loyalty to the federal republic-- as well as acceptance of LIES, that the federal government as the supreme and absolute national authority.\n\n \n In 1943, the Supreme Court ruled in West Virginia State Board of Education v. Barnette that kids didn't have to say the pledge. Just wanted to throw that out there.", 
   {}, 
   334641, 
   null, 
   1269897420.0
  ], 
  [
   409605, 
   null, 
   "kimi725", 
   "Compulsory attendance is only for people in public schools. State law will vary for each state, but in Texas it doesn't even apply to private schools.\n \n it is not servitude. There is no service being provided by the student, only the school. Servitude requires someone to \"serve\" another.", 
   {
    "post_info": {
     "post_title": "Unconstitutional"
    }
   }, 
   396346, 
   null, 
   1281391860.0
  ], 
  [
   418317, 
   null, 
   "fzgrums", 
   "It's not servitude", 
   {}, 
   309434, 
   null, 
   1291360140.0
  ], 
  [
   430945, 
   null, 
   "Pottersville", 
   "You don't have to go to school. You could be home schooled.\n\n \n By far the better option.", 
   {}, 
   221442, 
   null, 
   1306633920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Compulsory Education is Unconstitutional", 
  "url": "http://www.4forums.com/political/education-debates/8440-compulsory-education-unconstitutional.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 8440, 
  "discussion_files": [
   [
    "28471.html", 
    "http://www.4forums.com/political/education-debates/8440-compulsory-education-unconstitutional-print.html"
   ], 
   [
    "28472.html", 
    "http://www.4forums.com/political/education-debates/8440-compulsory-education-unconstitutional-2-print.html"
   ]
  ], 
  "identifier": 8440
 }
]