[
 [
  [
   221630, 
   null, 
   "Patriotus", 
   "6-7 July, 2006 in Tbilisi was held anti corruption GUAM conference. To tell the truth it was spit into souls of countries-members people. The fact is that it's well known in the World that Georgia is most bribable GUAM country.\n SECI and OSCE representatives who took part in conference confirm this fact openly. Especially after information about weapons spread in the district and in the World (Sudan) which were delivered to Georgia from East Europe (Romania, Bulgaria, Poland and other OSCE members). I think that there is no point speak about the fact that 75% of all aid funds coming to Georgia for its development are coming into pockets of Georgian officials. In addition to it some high rate representatives of Georgian Ministry of Internal Affairs and Ministry of Defense hold control over drags traffic from Central Asia to Europe. \n Look, Saakashvili has the cheek to accuse Baku in corruption and power elite clannish! I think that Georgia is drawing GUAM up to the end. Well, I see only one way for Azerbaijan to save its face - leave GAUM. In fact Ukraine, Georgia and Moldavia are using our stability in political and economic spheres to their own interests. There is no place for Azerbaijan in GUAM.", 
   {
    "post_info": {
     "post_title": "6-7 July, 2006 in Tbilisi was held anti corruption GUAM conference"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1152545280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  6-7 July, 2006 in Tbilisi was held anti corruption GUAM conference", 
  "url": "http://www.4forums.com/political/current-events-debates/8474-6-7-july-2006-tbilisi-held-anti-corruption-guam-conference.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8474, 
  "discussion_files": [
   [
    "31872.html", 
    "http://www.4forums.com/political/current-events-debates/8474-6-7-july-2006-tbilisi-held-anti-corruption-guam-conference-print.html"
   ]
  ], 
  "identifier": 8474
 }
]