[
 [
  [
   222157, 
   null, 
   "hero of the day", 
   "Ukraine which aims to enter EU and NATO is grieving about the death of international terrorist Shamil Basaev! Well, representatives of velvet revolution are trying to show him who killed people by barbarous methods (seizure maternity hospital in Budenovsk and children in Beslan School, detonation of buildings and metro in Moscow) as national hero who fought for independency. It looks like Yuschenko and Timoshenko surely do it for the sake of Ukraine prosperity :) .\n But it's not strange for me because of orange leaders came to power on the wave of nationalism and racism. It's well-known that Yuschenko used active members of nationalistic 'Pora!' and UNA-UNSO which had close ties with Chechen rebels and Basaev. Eh and how can country with so high level of nationalism aim to become part of European family. Look, we are living by civil law of 21 century but not by Lynch law. \n To tell the truth I think that such attitude to terrorists was brought by to the Ukrainian leaders in their childhood. For example it's well known that the father of Yuschenko's wife, who is an American citizen and is also a true nationalist, was a member of punitive Ukranian nationalist forces during WW II in Volin (30 thousand of Poles were killed there). In this connection it's no a surprise in Ukrainian nationals' attitude to the terrorists. But as it's known, fish always stinks from the head downwards.", 
   {
    "post_info": {
     "post_title": "Ukraine which aims to enter EU and NATO is grieving about the death of international"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1152801720.0
  ], 
  [
   222168, 
   null, 
   "Collin", 
   "It's well-known that Yuschenko used active members of nationalistic 'Pora!' and UNA-UNSO which had close ties with Chechen rebels and Basaev.\n\n \n Oh yes, of course. I agree entirely. emoticon_xhoho", 
   {
    "unicode_changes_made": true
   }, 
   222157, 
   null, 
   1152804960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ukraine which aims to enter EU and NATO is grieving about the death of international", 
  "url": "http://www.4forums.com/political/current-events-debates/8491-ukraine-aims-enter-eu-nato-grieving-about-death-international.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8491, 
  "discussion_files": [
   [
    "30718.html", 
    "http://www.4forums.com/political/current-events-debates/8491-ukraine-aims-enter-eu-nato-grieving-about-death-international-print.html"
   ]
  ], 
  "identifier": 8491
 }
]