[
 [
  [
   223143, 
   null, 
   "marquez", 
   "Dutch court refuses to ban 'pedophile party'\n A Dutch court refused Monday to ban a political party whose main goal is to lower the age of sexual consent to 12 from 16, with the ruling judge saying it's up to voters to judge the appeal of political movements.\n \n The party at the heart of the ruling is the PNVD, which stands for party of brotherly love, freedom and diversity. It has only three known members, one of whom was convicted of molesting an 11-year-old boy in 1987.\n \n Widely dubbed the \"pedophile party,\" the PNVD is unlikely ever to win a seat in parliament. The group would need around 60,000 votes, and pollsters estimate it would get fewer than 1,000.\n \n http://www.cbc.ca/story/world/national/2006/07/17/pedophile-party.html\n \n http://www.culturebattles.com", 
   {
    "post_info": {
     "post_title": "Paedophile party ok'd in Holland"
    }
   }, 
   null, 
   null, 
   1153246320.0
  ], 
  [
   223152, 
   null, 
   "Rovdak", 
   "Same with the racist CD party in the 80s\n \n You can't forbid it unless members are involved in criminal activities, such are the ways of a free society.", 
   {}, 
   223143, 
   null, 
   1153247160.0
  ], 
  [
   223165, 
   null, 
   "marquez", 
   "This country jails people for hate speech, homophobic comments, and holocaust denial. I doubt their commitment to a \"free society\". That they allow this kind of speech, but not the aforementioned ones, speaks volumes about their society.", 
   {}, 
   223152, 
   null, 
   1153248900.0
  ], 
  [
   223184, 
   null, 
   "Rovdak", 
   "Last time anyone here felt any negative consequences for WW2-related bannings was a decade ago when a radio DJ proclaimed to his public he read mein kampf and found it interesting, the DJ sued and was rehired, it's a dead letter law. You guys are mixing us up again, Austria is in the business of sending holocaust deniers to prison, we just think they're making fools of themselves, well except the neo nazis and some radical islamists, I suppose, anywho, we don't even speak the same frikkin language, and the weight of nazism's bloody past weighs a bit heavier on Austrian shoulders. I feel the laws done their job and can be scrapped, it seems the Austrians feel less self-confident, must be the constant accusations of still being antisemites and closet-nazis...\n \n I disagree with the DJ, btw, mein kampf is drivel.\n \n Homophobic comments illegal? Homosexuals are protected in the anti-discrimination laws, which means I can say homosexuality is a disease, mental illness, perverse, whatever really (which would, again, just make me look like a fool in most circles), but if I were to call for the culling of homosexuals, I would be eligible for a visit to the courts. I can call whoever I want whatever I want (save the Queen, since the demands of her position means she is by law unable to defend herself), as long as I don't imply harming them would be a good thing.", 
   {}, 
   223165, 
   null, 
   1153250700.0
  ], 
  [
   223187, 
   null, 
   "zachvac", 
   "Dutch court refuses to ban 'pedophile party'\n A Dutch court refused Monday to ban a political party whose main goal is to lower the age of sexual consent to 12 from 16, with the ruling judge saying it's up to voters to judge the appeal of political movements.\n \n The party at the heart of the ruling is the PNVD, which stands for party of brotherly love, freedom and diversity. It has only three known members, one of whom was convicted of molesting an 11-year-old boy in 1987.\n \n Widely dubbed the \"pedophile party,\" the PNVD is unlikely ever to win a seat in parliament. The group would need around 60,000 votes, and pollsters estimate it would get fewer than 1,000.\n \n http://www.cbc.ca/story/world/national/2006/07/17/pedophile-party.html\n \n http://www.culturebattles.com\n\n \n so what's the problem? If they won't get seats in parliament who cares if they exist or not?", 
   {}, 
   223143, 
   null, 
   1153251540.0
  ], 
  [
   233861, 
   null, 
   "Rovdak", 
   "To revisit this\n \n \nso what's the problem? If they won't get seats in parliament who cares if they exist or not?\n\n \n That's not even an issue anymore, unless we get a very unusual turn of events.\n \n http://news.bbc.co.uk/2/hi/europe/5410970.stm", 
   {}, 
   223187, 
   null, 
   1160090640.0
  ], 
  [
   234559, 
   null, 
   "Rovdak", 
   "It's over, the PedoParty gave up knowing they failed to get the signatures to be admitted to the general elections.\n \n There was of course never a snowflake's chance in hell this party would get a single seat in parliament, let alone find it's way into a ruling coalition, but incidents like this are always good measures to how committed people REALLY are to freedom. The party never engaged in any illegal acts, they just had a programme utterly alien to the majority of us. If the rule of law means anything, they have the right to have just that, we can condemn them the way we should, by utterly refusing to support them. People may point at the anti Nazi laws and cry hypocrisy, but fail to realise that they won't create a right by adding one wrong to another.", 
   {}, 
   233861, 
   null, 
   1160599920.0
  ], 
  [
   255310, 
   null, 
   "noe", 
   "Dutch court refuses to ban 'pedophile party' - yes", 
   {
    "post_info": {
     "post_title": "Agree"
    }
   }, 
   223143, 
   null, 
   1174671840.0
  ], 
  [
   296157, 
   null, 
   "ibelieveyou", 
   "Dutch court refuses to ban 'pedophile party'\n A Dutch court refused Monday to ban a political party whose main goal is to lower the age of sexual consent to 12 from 16, with the ruling judge saying it's up to voters to judge the appeal of political movements.\n \n The party at the heart of the ruling is the PNVD, which stands for party of brotherly love, freedom and diversity. It has only three known members, one of whom was convicted of molesting an 11-year-old boy in 1987.\n \n Widely dubbed the \"pedophile party,\" the PNVD is unlikely ever to win a seat in parliament. The group would need around 60,000 votes, and pollsters estimate it would get fewer than 1,000.\n \n \n\n \n as long as party members don't engage in the 'despicable' jailable activities of revisionism (e.g. holocaust) and question the current newspeak of 'war on (of) terror', they should be fine and free to bugger who they choose", 
   {}, 
   223143, 
   null, 
   1199616420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Paedophile party ok'd in Holland", 
  "url": "http://www.4forums.com/political/european-politics-economics/8530-paedophile-party-okd-holland.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 8530, 
  "discussion_files": [
   [
    "2883.html", 
    "http://www.4forums.com/political/european-politics-economics/8530-paedophile-party-okd-holland-print.html"
   ]
  ], 
  "identifier": 8530
 }
]