[
 [
  [
   223506, 
   null, 
   "foundit66", 
   "Are Israel's troubles in the Gaza Strip and Lebanon and the Hezbollah rockets slamming daily into major Israeli population centers here a result of the Jewish state's tacit support for a homosexual parade slated for next month in Jerusalem? \n \n Some rabbis seem to think so, and they are attempting to block the event from taking place in Judaism's holiest city. \n \n \"Why does this war break out this week, all of sudden with little warning? Because this is the exact week the Jewish people are trying to decide whether the gay pride parade should take place in Jerusalem or Tel Aviv,\" Pinchas Winston, a noted author, rabbi and lecturer based in Jerusalem told WND.\n \n Winston is one of many rabbinic leaders here to blast the World Pride Parade, a mass international gathering of homosexual, lesbian, bisexual and transgendered people scheduled Aug. 6-12. \n \n The week-long homosexual celebration will feature a parade down the streets of central Jerusalem, a beach party, health conference and a \"Youth Day\" to take place in the Knesset, Israel's main legislative government building. \n \n The festival is being run by an organization called World Pride, which seeks to promote an atmosphere of \"love without borders,\" according to group's website. \n \n Yet many religious leaders believe the Israeli government's decision to allow a world homosexual parade in Jerusalem is having real-life consequences. \n \n \"This [parade] is an attack against God himself,\" Winston said. \"God has told the Jewish people, 'If you are not going to fight for my honor, you will be forced to fight for your own honor.'\" \n \n Winston points to the clashes that broke out after Hezbollah staged a raid last week in which two Israeli soldiers were kidnapped and eight more soldiers were killed. Israel has been retaliating inside Lebanon while the Lebanese terror group has fired hundreds of deadly Katyusha rockets at northern Israeli population centers, killing 18 civilians and wounding hundreds, some seriously. \n \n On a second battlefront, Israel also recently sent ground troops into Gaza following the kidnapping by Hamas of Israeli soldier Gilad Shalit. Hamas and other Gaza-based Palestinian Arab terror groups have launched hundreds of rockets into Jewish communities near Gaza, including Ashkelon, home to Israel's major power stations and strategic oil and gas pipelines. \n \n Lazer Brody, an author and dean of the Breslov Rabbinical College in Ashdod, Israel, concurred with Winston. \n \n \"When God's presence is in the camp, nothing can happen to the Jewish people,\" Brody stated. \"But If the Jewish people bring impurity into the camp of Israel, this chases away God's presence.\" \n \n Brody contends the \"removal of God's presence\" led to the recent violence here, but he said he still feels the Jewish state is being protected. \n \n \"Over 1,000 Katyusha rockets have been fired thus far, and the damage has been equivalent to scratches,\" Brody said. \n \n Before becoming a rabbi, Brody served for many years in the Israeli army, where he fought in combat missions in Beirut during Israel's incursion into Lebanon in the early 1980's. He said the public display of homosexuality in Jerusalem \"soils the camp of Israel with impurity, and pushes away the divine presence and protection.\" \n \n He cites Deuteronomy, [23:13-15]: \"For the Lord, your God, goes along in the midst of your camp, to rescue you and to deliver your enemies before you. [Therefore,] your camp shall be holy, so that He should not see anything unseemly among you and would turn away from you.\" \n \n \"The Torah is the ultimate book of human rights, giving each individual the right to free choice,\" said Brody. \"What a person does behind closed doors is at one's own risk; but to partake of that behavior in public spreads the impurity to the entire camp.\" \n \n The Rabbinical Congress for Peace, a worldwide coalition of over 1200 rabbinic leaders and pulpit rabbis released a statement this week asking Israelis to \"increase the holiness\" of the country while it was at war by praying and among other thing cancelling the World Pride event. \n \n The World Pride event previously was held in 2000 in Rome, where it attracted about a quarter of a million participants. Images of the Rome festivities, featured on various homosexual websites, show throngs of shirtless men in shorts and bikini briefs congregated on the streets, some of them holding hands. \n \n Earlier this year, the Israeli Supreme Court granted tacit support for the event. The Israeli police department has thus far supported the parade, although some security officials have stated an upsurge in national violence can bog down police forces and force the event to cancel. \n \n The police also are worried about violent protesters at any Jerusalem homosexual parade. Last year, at a smaller, local homosexual pride parade, three males were stabbed shortly after fellow paraders were seen kissing outside Jerusalem's Great Synagogue. \n \n Despite Judicial support, a recent poll shows that nearly 70 percent of all Jerusalemites oppose the march. Mayor Uri Lupolianski, an orthodox Jew, has filed a petition to prevent the event from taking place. About half of the Knesset's 120 legislatures signed a petition against holding a homosexual parade in Jerusalem. \n \n But activists from World Pride claim the event will \"bring a new inner-faith message of equality and tolerance\" to Israel's populace. Event organizers say the parade in Jerusalem has been suited to the city's nature in respect to the local religious population. \n \n Hagai El-Ad, Executive Director of Jerusalem Open House, the main organizer of World Pride, is upset by attempts to move or cancel the weeklong event. \n \n \"An orchestrated campaign to sabotage Jerusalem World Pride has been launched by those who propagate the fallacy that only they have a right to claim faith as their mantle,\" El-Ad said. \n \n \"This campaign will fail, as it has in previous years,\" El-Ad stated, \"but the news that the mayor of Jerusalem has signed a petition calling for the cancellation of World Pride, accompanied by reports that extremist Jewish preacher Amnon Yitzhak is planning a so-called 'humility march' in opposition of World Pride, should be troubling to anyone who believes in Jerusalem as a welcoming city for all people.\" \n \n Meanwhile, Yehuda Levin, a member of the Rabbinical Alliance of America, has come to Israel specifically to prevent the homosexual celebration from taking place. He said a homosexual parade is akin to a parade of \"prostitutes promoting prostitution, or adulterers encouraging others to try adultery at least once in their life.\" \n \n \"Israel is the Holy Land, not the homo-land,\" Levin told WND. \n \n Levin has been posting signs across Jerusalem urging citizens, politicians and Israel's chief rabbinate to use all legal means to prevent the festival. \n \n \"We'll use our bodies if we have to,\" Levin says. \n \n Sharon Kleinbaum, North American co-chair of the Jerusalem World Pride event, stated in response to Levin's activities, \"I am both outraged and saddened by American Rabbi Yehuda Levin's efforts to undermine and threaten World Pride, its organizers and participants.\" \n \n Kleinbaum said, \"Levin's use of religion as a weapon of bigotry and violence is offensive to all who care about God and religion and morality. He blasphemes God's name when he says that Jerusalem does not belong to all of us. \n \n \"Jerusalem was chosen as the site for World Pride because it represents a center of tolerance, pluralism and love for all humanity,\" Kleinbaum added. \"The thousands of World Pride participants, from Israel and all over the world and of diverse faiths will be the best answer to Levin' display of intolerance and unholy values.\" \n \n World Pride organizers also are concerned about the current violence between Israel and Lebanon. A statement on the organization' website reads, \"Our hearts go to all the people affected by the violence, as we continue to hope that peace will prevail. As Jerusalemites, we are acutely aware of the complexities of the reality that we face in our city and in the region. We feel that these days optimistic messages speaking for tolerance and against violence, as are indeed the core messages of the Jerusalem World Pride events, are even more significant than during calmer times.\" \n \n Like some other rabbis here, Levin believes that there is a direct correlation between the homosexual parade scheduled to take place in Jerusalem and the recent onslaught of rockets raining from Lebanon and Gaza. \n \n Citing Leviticus [18:22-28], Levin said the Torah relates to Israel' current conflict. \n \n Leviticus states, \"You shall not lie down with a male, as with a woman: this is an abomination. For the nations, whom I am sending away from before you, have defiled themselves with all these things. And the land became defiled, and I visited its sin upon it, and the land vomited out its inhabitants. ... For the people of the land who preceded you, did all of these abominations, and the land became defiled. And let the land not vomit you out for having defiled it, as it vomited out the nation that preceded you.'\" \n \n Said Levin, \"The terrorists, the leaders of Israel's enemies are working for the destruction of Israel, to wipe the Jewish people off the map.\" \n \n Levin believes their efforts are succeeding due to what he calls sexual promiscuity in the land of Israel. \n \n \"Lebanon is a part of biblical Israel, and we were forced to evacuate there,\" he said. \"Gaza is a part of biblical Israel, and last summer the land spit out over 8,000 Jewish residents.\" \n \n Levin notes that holding a gay pride parade in Israel is not a new idea. \n \n \"For years, local gay parades were held in Tel Aviv and Jerusalem,\" he said. \"This is like boiling water in a pot. First the water starts to simmer, and eventually it boils over.\" \n \n Last summer, according to Levin, the pot did indeed boil over. In August 2005, the international World Pride organization sought to hold its yearly event in Jerusalem. After giving initial approval, Israeli police were forced to cancel the event due to Israel's withdrawal from Gaza. Israeli police would have been unable to carry out the forced expulsion of Jewish residents from the 21 communities of Gush Katif and at the same time provide the required protection for the tens of thousands of participants scheduled to take part in the Jerusalem parade. \n \n Levin said the part of the event he finds most despicable is the \"Youth Day,\" which he charges is intended to present homosexuality as a viable life option to kids and young adults. \n \n \"Last time I checked, sexual contact of any nature with a minor under the age of 18 is illegal,\" Levin stated. \n \n \"Homosexuality is wrong,\" Levin said. \"This is something every school kid knows.\" \n \n http://worldnetdaily.com/news/article.asp?ARTICLE_ID=51128", 
   {
    "post_info": {
     "post_title": "Violence in Israel caused by 'gay' event?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1153354260.0
  ], 
  [
   223508, 
   null, 
   "foundit66", 
   "WorldNetDaily Poll:\n \n Any correlation between Jerusalem Gay Pride event and Mideast violence?\n \n * 27.56% (479)\n Yes, definitely, it's obvious God is not happy about homosexuals there.\n \n * 20.83% (362)\n I don't know, but Israel is playing with fire by even considering the event\n \n * 13.12% (228)\n No, the very idea is ludicrous\n \n * 12.60% (219)\n It's possible, just look at the hurricanes wiping out 'gay' events in the U.S. last year\n \n * 9.78% (170)\n I admit it sounds strange, but I would not rule it out\n \n * 9.15% (159)\n I really think there's something to this idea, though it can't be proven\n \n * 3.91% (68)\n Other\n \n * 2.42% (42)\n No, send the rabbis suggesting it back to Torah school\n \n * 0.63% (11)\n No, the presence of peace-loving homosexuals would actually help end hostilities\n \n (total votes: 1738)\n \n So if you add up all five of the forms of \"Yes\" that provides, then a whopping 79.92% of respondents are giving credence to the idea that a gay parade could be responsible for the crisis in Israel!!!!! This compared to the 16.17% who answered using one of the 23 forms of \"No!\" \n http://www.goodasyou.org/\n \n For updated results...\n http://www.worldnetdaily.com/polls/index.asp?VIEW_RESULTS=Y\n (The poll has been erratic in its availability)", 
   {
    "post_info": {
     "attachments": 1, 
     "post_title": "WND Poll Answers Question with YES."
    }
   }, 
   223506, 
   null, 
   1153354740.0
  ], 
  [
   223509, 
   null, 
   "robbie0517", 
   "God must really hate us. We not only are responsible for natural disasters, now we're responsible for bombings! I wonder why Mass. hasn't been destroyed yet?", 
   {}, 
   223506, 
   null, 
   1153354800.0
  ], 
  [
   223513, 
   null, 
   "thelmoose", 
   "The failure to see the increasing dissatisfaction among the Palestians in Gaza since the Israeli \"withdrawal\", the effect of a Shia resurgicence in Iraq, Syria and Hezbollah, and any other of the numerous causes of the recent escalation in violence and instead, view a parade as somehow causative is mind-boggling and dangerously stupid. Having some bonehead make such a statement is one thing, but much more frightening is the result of such a poll. Is this not another example of the danger of religious thought? - trying to explain complex real-world problems with \"the gods are angry, it must be the homos!\"", 
   {}, 
   223509, 
   null, 
   1153356960.0
  ], 
  [
   223524, 
   null, 
   "foundit66", 
   "Most people should be able to look at these claims of gays causing violence in Israel and realize it's absurd. (Except for the WorldNetDaily viewers, of course...)\n \n But you change the claim slightly to \"gay marriage causes decline in straight marriages\", and suddenly you have more believers. The substantiation for these arguments is COMPLETELY NON-EXISTENT, but the argument sounds more credible to some just because they're both issues of \"marriage\".\n In fact, examining the proclaimed \"evidence\" should lead a rational person to realize that nothing has been shown. (How the \"effect\" can precede the \"cause\" has yet to be explained...)\n \n (And for the record, Kurtz NEVER SHOWED HOW/WHY gay marriage is supposed to have a decline on straight marriage, much less prove a causal relationship... The only thing that Kurtz does is similar to the \"Israel violence\" situation. He shows some problems, and then TRIES to point the finger in the direction of gay marriage.)\n \n It really just boils down to an issue of wanting to blame things on gays because of prejudice. Not rational thought. Just a desire to blame gays.\n But people see that more obviously for \"Israel violence\" than \"gay marriage\"...", 
   {
    "post_info": {
     "post_title": "Eerie Similarities"
    }
   }, 
   223513, 
   null, 
   1153361640.0
  ], 
  [
   223590, 
   null, 
   "jyoshu", 
   "Most people should be able to look at these claims of gays causing violence in Israel and realize it's absurd. (Except for the WorldNetDaily viewers, of course...)\n \n But you change the claim slightly to \"gay marriage causes decline in straight marriages\", and suddenly you have more believers. The substantiation for these arguments is COMPLETELY NON-EXISTENT, but the argument sounds more credible to some just because they're both issues of \"marriage\".\n In fact, examining the proclaimed \"evidence\" should lead a rational person to realize that nothing has been shown. (How the \"effect\" can precede the \"cause\" has yet to be explained...)\n \n (And for the record, Kurtz NEVER SHOWED HOW/WHY gay marriage is supposed to have a decline on straight marriage, much less prove a causal relationship... The only thing that Kurtz does is similar to the \"Israel violence\" situation. He shows some problems, and then TRIES to point the finger in the direction of gay marriage.)\n \n It really just boils down to an issue of wanting to blame things on gays because of prejudice. Not rational thought. Just a desire to blame gays.\n But people see that more obviously for \"Israel violence\" than \"gay marriage\"...\n\n \n 1.) Your demands that Kurtz show \"how\" gay marriage led to the decline in straight marriage is ridiculous. It's like if a lot of churches moved into an area, asking for exactly \"HOW\" more people in that became religious over time. It just happens, due to influences and trends. Kurtz never claimed there was a some magic direct causal factor involved (as you are demanding to see). By inferring that he did, you are dishonestly misrepresenting his arguments. It's about broader social changes and trends. Changes in the way people view families and marriage. No one ever said it was an A + B = C situation. You say there's no direct cause; well duh!!! No one ever said there WAS a magic bullet here.\n \n 2.) Concerning your comments that the cycle of violence was not due to the gay parade, you aren't in the middle east, and are not privy to the issues, social tensions, problems, etc. that go on there. You look at the situation through more western eyes, from the U.S. For all we know, they might indeed be related. It probably wasn't a direct cause, but what's to say it didn't contribute to the overall tension and problems going on there? One thing is certain, between the opinions of people who live there experiencing those issues everyday, and YOUR opinion on it which is most likely completely removed from the culture there, it's clear who would have the better inside track and pulse of what's going on there. And it's not you. The point is, we don't know. Taking a stand either way, as people far removed from the situation, isn't going to be any closer to the truth on that.\n \n 3.) Concerning your last paragraph above, just because some might believe gay marriage might lead to a decline in opposite-sex marriage doesn't mean it's prejudice. You don't get to just take anything you disagree with or that seems illogical and tack on a \"prejudice\" sign to it. If you are going to make that accusation, you need to pony up and prove it. Being mistaken on the facts does not automatically equal prejudice. If you can't prove it, then it will be given all the credibility an unrproven assertion deserves. emoticon_xangel That tactic you use is used here a lot, but it doesn't pass muster if you can't put your money where your mouth is and pony up with the proof. Just calling someone a \"bigot\" or \"prejudiced\" will get you NOwhere.", 
   {}, 
   223524, 
   null, 
   1153410180.0
  ], 
  [
   223596, 
   null, 
   "foundit66", 
   "1.) Your demands that Kurtz show \"how\" gay marriage led to the decline in straight marriage is ridiculous. It's like if a lot of churches moved into an area, asking for exactly \"HOW\" more people in that became religious over time. It just happens, due to influences and trends.\n\n That's inane. You have assumed your own conclusion to its own ends. Circular logic demanding not to be questioned.\n More churches \"moving into an area\" is an issue of obvious supply and demand. And if necessary, we can view the MEMBERSHIP of these churches to verify an actual increase in \"religion over time\".\n But with gay marriage, it's not an issue of exactly \"how\" more people have become religious. It's something else entirely.\n By analogy, you would be claiming ANOTHER EFFECT based on the increase in religion. Like claiming crime went up because of more churches in the area, as compared to marriage stats going down because of gay marriage in the area.\n THAT is the analogy. You're missing a crucial step.\n \n But then you try to put that up next to \"gay marriage to the decline in straight marriage\" to try and obfuscate away a need to actually SHOW SCIENTIFIC LOGIC IN CAUSALITY, which is absurd. There is no obvious link inbetween gay marriage and declines in straight marriages.\n As I pointed out previously, these declines in straight marriages started WAYYYY BEFORE gay marriages were legal.\n And these declines in straight marriages ARE NOT CONSISTENT. Some straight marriages have had their stats IMPROVE after gay marriage became legal.\n \n You can't just claim \"due to influences and trends\".\n You have to PROVE it.\n \n \n \nKurtz never claimed there was a some magic direct causal factor involved (as you are demanding to see). By inferring that he did, you are dishonestly misrepresenting his arguments.\n\n Kurtz does claims a \"causal\" relationship. Have you even READ his articles?\n \n \n \nIt's about broader social changes and trends. Changes in the way people view families and marriage. No one ever said it was an A + B = C situation. You say there's no direct cause; well duh!!! No one ever said there WAS a magic bullet here.\n\n This is like the other thread where you claimed the article wasn't claiming a causal relationship between gay marriage AND CRIME.\n Without surprise, you slunk away when the article was quoted DIRECTLY STATING such a claim.\n \n And regardless, gay marriage has NO PART in any cause of decline. NOBODY has presented ANY reason to believe it does.\n You pretend that by saying \"it's not direct\" that somehow you have removed burden of proof. You have not.\n If you claim that gay marriage has ANY PART in the issue, you have to prove it.\n It's your claim. PROVE it.\n You can't obfuscate away that obvious burden of proof.\n \n \n \n2.) Concerning your comments that the cycle of violence was not due to the gay parade, you aren't in the middle east, and are not privy to the issues, social tensions, problems, etc. that go on there. You look at the situation through more western eyes, from the U.S. For all we know, they might indeed be related.\n\n Here we go again with the Jyoshu riff of \"you don't know...\" Trying to make an argument out of ignorance.\n Jyoshu, can ANYBODY show a cause and effect relationship?\n If not, then it's inane to make the claim.\n \n And I suspect the World Net Daily viewers would fall under the same category as \"western eyes\".\n But predictably, you chide me for \"not knowing\" and you blithely ignore the fact that THEY OBVIOUSLY do not know either for the same reasons...\n \n Your biases are worn blatantly on your sleeve Jyoshu.\n \n \n \n3.) Concerning your last paragraph above, just because some might believe gay marriage might lead to a decline in opposite-sex marriage doesn't mean it's prejudice. You don't get to just take anything you disagree with or that seems illogical and tack on a \"prejudice\" sign to it.\n\n If gay marriage opponents can believe away any burden of proof for why gay marriage has any type of cause for a decline in straight marriage, then I can \"believe away\" any need for proof for why it's prejudice.\n <end sarcasm<\n \n The difference being that I am not just \"believing away\" the issue of why it's prejudice.\n My observation that it is \"prejudice\" is grounded in my personal DEFINITION of prejudice.\n You can't say the same for gay marriage opponents believing gay marriage causes a decline in straight marriages.\n \n And how come you don't make similar comments when Steeeeve starts labelling everybody as bigots and prejudice for their beliefs...\n Again, your bias is obvious in watching your responses to different people who are doing the same actions.\n \n \n \nIf you are going to make that accusation, you need to pony up and prove it.\n\n And I leave the viewing audience with THIS QUOTE RIGHT HERE.\n \n Jyoshu has just chided me for demanding proof of claims...\n But then he has insisted that I prove mine...\n \n If that doesn't reek of hypocrisy, I don't know what does...\n :xbanghead :xbanghead :xbanghead", 
   {}, 
   223590, 
   null, 
   1153412160.0
  ], 
  [
   223629, 
   null, 
   "foundit66", 
   "And for the record Jyoshu, I see \"Marriage stats got worse? The presence of gay marriage must have some part in it.\" as \"prejudice\" in the same way that I see \"Somebody got robbed? That black guy standing there must have had some part in it.\" as also prejudiced.\n \n The prejudice is present in the COMPLETE LACK of objective explanation as to how the two issues are in any way related in any type of causal relationship.\n And of course, my classification of an irrational and biased blaming of a group for something negative occurring as \"prejudice\" is my opinion. I'm not sure how I could \"prove\" that to you...\n \n But it would be interesting to see if you believe \"Somebody got robbed? That black guy standing there must have had some part in it.\" is an example of prejudice.\n If so, what's the difference between the two examples above???\n \n Of course, you're free to ignore the tough questions like you usually do...\n \n And if you're going to claim that you're not trying to claim any type of \"causality\", then the question comes up as to WHY BRING UP gay marriage in the first place in the discussion...", 
   {}, 
   223596, 
   null, 
   1153422240.0
  ], 
  [
   223635, 
   null, 
   "thelmoose", 
   "\n \n And if you're going to claim that you're not trying to claim any type of \"causality\", then the question comes up as to WHY BRING UP gay marriage in the first place in the discussion...\n\n \n A great question that I, too, would like to see answered.", 
   {}, 
   223629, 
   null, 
   1153423140.0
  ], 
  [
   223646, 
   null, 
   "jyoshu", 
   "This is like the other thread where you claimed the article wasn't claiming a causal relationship between gay marriage AND CRIME.\n Without surprise, you slunk away when the article was quoted DIRECTLY STATING such a claim.\n\n \n I dropped it because you obviously never read the article, since you make claims about that aren't even accurate.\n \n \nThe difference being that I am not just \"believing away\" the issue of why it's prejudice. My observation that it is \"prejudice\" is grounded in my personal DEFINITION of prejudice.\n\n \n With emphasis on personal definition . . .\n \n \nAnd how come you don't make similar comments when Steeeeve starts labelling everybody as bigots and prejudice for their beliefs...\n\n \n That's easy. Because he's rarely ever said it, and when he did it was to prove a point at how flippantly YOU throw words like that around.\n \n \nJyoshu has just chided me for demanding proof of claims...\n But then he has insisted that I prove mine...\n\n \n Bull. Your problem is that you demand proof for claims that haven't even been made. Like where you claim Kurtz says there a direct causal relationship. You can't even point out where he said there's a majic bullet. I guess it's easier to debate if you make up arguments for your opponents.\n \n \nIf that doesn't reek of hypocrisy, I don't know what does...\n :xbanghead :xbanghead :xbanghead\n\n \n Careful, you're letting Mr. Hyde get the best of you again.", 
   {}, 
   223596, 
   null, 
   1153427220.0
  ], 
  [
   223647, 
   null, 
   "jyoshu", 
   "A great question that I, too, would like to see answered.\n\n \n Well, why don't you ask the person who DID bring it up here? (Foundit, when he posted the article)", 
   {}, 
   223635, 
   null, 
   1153427280.0
  ], 
  [
   223652, 
   null, 
   "foundit66", 
   "Well, why don't you ask the person who DID bring it up here? (Foundit, when he posted the article)\n\n Dollars to doughnuts says that when Jyoshu's lame reply is countered, he'll still not answer the question...\n \n \n Jyoshu, if thelmoose is looking for an answer to the question that I ASKED, I think it's fairly obvious that I am NOT the person who should be supplying the answer.\n ESPECIALLY when people should be able to see that I was asking YOU that question, within the context of my post...\n MY question: \"And if you're going to claim that you're not trying to claim any type of \"causality\", then the question comes up as to WHY BRING UP gay marriage in the first place in the discussion...\"\n To explain it further for the reading impaired...\n If you, Jyoshu, are not claiming a causation relationship between \"gay marriage\" and \"decline of straight marriage\", then WHY bring up the issue of \"gay marriage\" in a discussion of \"decline of straight marriage\" in the first place?\n And a follow-on question, in case you attempt to weasel out of the point (which I'm sure you'll do anyways), is why do people who talk about \"gay marriage\" and \"decline of straight marriage\" bring up the issue of \"gay marriage\" in a discussion of \"decline of straight marriage\" in the first place?\n \n \n But your snippy little remark is noted and predicted.\n To address the question that you were attempting to OBFUSCATE the original question into, I just have to say that I've already addressed that. When I raised the parallel examples in the first place. I explained it. If you don't understand, ask a specific question on what you're confused on.\n \n The question I asked was aimed at you and others who bring up \"gay marriage\" in talking about \"decline of straight marriage\".\n I don't think anybody expected a real answer out of you anyways...", 
   {}, 
   223647, 
   null, 
   1153427940.0
  ], 
  [
   223653, 
   null, 
   "JimStPete", 
   "This is basically the same thing that Jerry Falwell and Pat Robertson did with the 9/11 attack. They took something that pretty much terrified everyone in the USA and then tried to use it to turn all Americans against gays, feminists, atheists, etc. Of course the attack had nothing to do with any of those people, it actually had to do with religion and our governments policies in Muslim areas of the world which have been totally selfish on our part.\n \n It's another tactic of creating 'The Other\"....I won't say who last use that tactic back in the 1930's and 40's, because you all know who that was. People that do this sort of thing are just plain evil. There is no good in any of them. And yet these people claim to speak for god and people send money to them to support them. It's obvious to any 'sane' people that they are simply nuts.\n \n Personally, I blame religion for the middle east problems. Jews claim Israel is their's because some old dusty book says so. I don't know why they didn't simply take part of Germany and give it to the Jews instead as that would have been the fair thing to do.", 
   {
    "post_info": {
     "post_title": "Anything To Demoinize, Even Bear False Witness...."
    }
   }, 
   223647, 
   null, 
   1153428060.0
  ], 
  [
   223656, 
   null, 
   "foundit66", 
   "I dropped it because you obviously never read the article, since you make claims about that aren't even accurate.\n\n You lie like a bassett hound.\n What did I say that wasn't accurate?\n \n (Let me guess. Another question ignored.)\n \n \n \nWith emphasis on personal definition . . .\n\n Do you disagree with my definition?\n Which aspect of my definition do you disagree with?\n I gave an example of the usage of the definition which some questions regarding your opinion of it. Why have you ignored those?\n (Let me guess. MORE questions ignored.)\n \n \n \nThat's easy. Because he's rarely ever said it, and when he did it was to prove a point at how flippantly YOU throw words like that around.\n\n \"rarely ever said it\"?\n That's a hoot.\n \n And when I use the word \"prejudice\", I defend it if necessary.\n And for the record, I don't use it that often...\n If you want to debate whether any individual use of the word I actually used was \"flippant\", I'm more than ready and willing.\n Somehow, I don't think you're able though...\n \n \n \nBull. Your problem is that you demand proof for claims that haven't even been made. Like where you claim Kurtz says there a direct causal relationship.\n\n Jyoshu, quit obfuscating.\n I never used the word \"direct\".\n That was a word YOU PUT INTO my statements claiming I demanded a \"direct\" causal relationship.\n \n I am asking Kurtz to prove ANY causal relationship.\n \n \n \nYou can't even point out where he said there's a majic bullet.\n\n Again, YOUR TERM.\n Why should I have to point to a place where he used a term that YOU BROUGHT to the table???\n \n \n \nCareful, you're letting Mr. Hyde get the best of you again.\n\n < snort <\n Good ol' Jyoshu.\n Eternally complaining that people point out his hypocrisy and obfuscation and misrepresentations.\n Almost NEVER actually arguing against the fact that he is committing acts of hypocrisy or obfuscation or misrepresentation.\n \n Why do you think that is Jyoshu?\n Because you can't argue against the truth?", 
   {}, 
   223646, 
   null, 
   1153428660.0
  ], 
  [
   223659, 
   null, 
   "foundit66", 
   "I dropped it because you obviously never read the article, since you make claims about that aren't even accurate.\n\n \n \nKurtz never claimed there was a some magic direct causal factor involved (as you are demanding to see). By inferring that he did, you are dishonestly misrepresenting his arguments.\n\n \n 1) I never used the words \"direct causal factor\". That is Jyoshu's demand based on something I didn't say.\n Here IS what I said: \"He (Kurtz) shows some problems (with straight marriage), and then TRIES to point the finger in the direction of gay marriage.\"\n \n 2) Kurtz DID TRY to claim a causal relationship inbetween gay marriage and the negative trends in straight marriage stats.\n If Jyoshu is to try and bash anybody for \"never reading\" the article as he tries to deny this, then he should look in the mirror.\n \n The following is from the VERY FIRST PARAGRAPH of one of Kurtz's editorials: \"Will same-sex marriage undermine the institution of marriage? It already has.\"\n \n So let's put an end to this ridiculous XXXX, shall we?\n Kurtz DOES try to blame gay marriage for some problems with straight marriage.\n Denying that is just plain ridiculous!", 
   {}, 
   223656, 
   null, 
   1153429080.0
  ], 
  [
   223664, 
   null, 
   "thelmoose", 
   " Concerning your comments that the cycle of violence was not due to the gay parade, you aren't in the middle east, and are not privy to the issues, social tensions, problems, etc. that go on there. You look at the situation through more western eyes, from the U.S. For all we know, they might indeed be related. It probably wasn't a direct cause, but what's to say it didn't contribute to the overall tension and problems going on there? One thing is certain, between the opinions of people who live there experiencing those issues everyday, and YOUR opinion on it which is most likely completely removed from the culture there, it's clear who would have the better inside track and pulse of what's going on there. And it's not you. The point is, we don't know. Taking a stand either way, as people far removed from the situation, isn't going to be any closer to the truth on that.\n \n\n \n Jyoshu. This is out to lunch. Puhlease.\n \n If you had even a shred of credibility in your posts before, this post of yours has assured the members of this forum that even that shred is non-existent. \n \n Trying to suggest that there is even the most unimaginably remote chance that the violence between Israel/Gaza Palestinians/Hezbollah in Lebanon is related to a gay pride event is appallingly ludicrous. \n \n Even more hilarious is the suggestion that now you are considering cultural sensitivity. After a comment like this, no one, I mean no one with a neuron in his skull, could possibly doubt your anti-gay bias.", 
   {}, 
   223590, 
   null, 
   1153431960.0
  ], 
  [
   223665, 
   null, 
   "jyoshu", 
   "Jyoshu. This is out to lunch. Puhlease. If you had even a shred of credibility in your posts before, this post of yours has assured the members of this forum that even that shred is non-existent. Trying to suggest that there is even the most unimaginably remote chance that the violence between Israel/Gaza Palestinians/Hezbollah in Lebanon is related to a gay pride event is appallingly ludicrous. Even more hilarious is the suggestion that now you are considering cultural sensitivity. After a comment like this, no one, I mean no one with a neuron in his skull, could possibly doubt your anti-gay bias.\n\n \n Why is that so hard for you to grasp? Foundit is trying to refutes statements by people in the ME who are much closer to the situation, much more familiar with the culture, and much more familiar with the influences and tensions there. Sorry, but unless there's evidence otherwise, it makes a lot more sense to take peoples' views as more credible who are IN the situation and not so far removed from it. He has NO IDEA whether or not what those ME people say is true or not. I'll grant you he's probably right, but who knows?? He sure doesn't (even if he thinks he does).\n \n And frankly, I don't really care one iota if you think I have some amount of anti-gay bias or not. I'm not here to convince you of anything about ME in any way, or to please you. Your personal judgements on me mean nothing. Your approval means nothing. If you want to debate my points and the argument, then do so, but it does nothing for your position to make personal judgements on me or anyone else. Why it even matters to you my (or anyone else's) personal beliefs is beyond me. Maybe it's the same thing that makes anti-gay people make personal judgements on you. You and Foundit are always down on people who make judgements on gay people and then you turn around and do the same thing every day in this forum. THAT'S hypocrisy.", 
   {}, 
   223664, 
   null, 
   1153432860.0
  ], 
  [
   223671, 
   null, 
   "foundit66", 
   "Why is that so hard for you to grasp? Foundit is trying to refutes statements by people in the ME who are much closer to the situation, much more familiar with the culture, and much more familiar with the influences and tensions there. Sorry, but unless there's evidence otherwise, it makes a lot more sense to take peoples' views as more credible who are IN the situation and not so far removed from it.\n\n \n Using Jyoshu's OWN WORDS: \"If you are going to make that accusation, you need to pony up and prove it.\"\n \n HOW has this claim of THEIRS been in ANY WAY shape or form \"proven\"?\n \n You demand \"evidence\" from people to DISPROVE their claims, but you COMPLETELY IGNORE the fact that they have NO EVIDENCE to attempt to prove their claims.\n \n \n \nHe has NO IDEA whether or not what those ME people say is true or not. I'll grant you he's probably right, but who knows?? He sure doesn't (even if he thinks he does).\n\n \n Jyoshu, my response to the whole issue is basically along the lines that their claim HAS NO MERIT because they HAVE NO PROOF.\n They have NO RATIONAL REASON for thinking the two are related.\n Your response seems to indicate that you think (or at least reserve for the possibility of it but you don't care to figure out if it's real) that their experience is leading them to that conclusion.\n So then that begs the question of WHAT EXPERIENCES do they have that lead them to that conclusion?\n But oh yeah. You're not going to care if THAT question gets answered...\n \n You obviously understand the standard of \"make a claim, prove the claim\" when you apply it to the pro-gay side.\n You also obviously don't recognize that standard's application to the anti-gay side.\n \n \n \nAnd frankly, I don't really care one iota if you think I have some amount of anti-gay bias or not. I'm not here to convince you of anything about ME in any way, or to please you. Your personal judgements on me mean nothing. Your approval means nothing. If you want to debate my points and the argument, then do so, but it does nothing for your position to make personal judgements on me or anyone else. Why it even matters to you my (or anyone else's) personal beliefs is beyond me.\n\n This coming from the guy who earlier asked ME if I thought anybody would believe my statements about my opinion...\n \n Boggles the mind ladies and gentlemen who quickly he will turn on his own standards and abandon them...\n \n \n \nMaybe it's the same thing that makes anti-gay people make personal judgements on you. You and Foundit are always down on people who make judgements on gay people and then you turn around and do the same thing every day in this forum. THAT'S hypocrisy.\n\n Jyoshu, if we were criticizing you because you were \"making judgments\", THAT would be hypocrisy...\n But that IS NOT really what's going on here.\n \n For this to show \"hypocrisy\", we would have to be guilty of that which we were complaining about.\n \n And instead, all we have is that you don't like people making accurate observations about you, and you don't like people calling you a hypocrite, so you accuse others of hypocrisy...\n \n And before you even try to deny it, you have complained WAYYYYY too much about it for anybody to even think that the truth isn't stinging you...", 
   {}, 
   223665, 
   null, 
   1153433880.0
  ], 
  [
   223673, 
   null, 
   "MrWriteLA", 
   "If you had even a shred of credibility in your posts before\n\n Credibility is patently not on his list of priorities. His concern is the number of anti-gay messages he can post, not whether they actually convince anyone, are consistent with each other, or even make surface sense. IOW, \"Counter the XXXXXX\" at all costs. Throw everything you can at the wall, however risible, and maybe something will stick, somehow, for someone. \n \n By the way, the concept of \"Internet buzz\" has become increasingly important to those whose work is affected by public perception, and is now even being measured by Nielsen. I wouldn't discount the possibility of paid right-wing anti-gay shills working fora like these.", 
   {}, 
   223665, 
   null, 
   1153434180.0
  ], 
  [
   223677, 
   null, 
   "MrWriteLA", 
   "Oh, and by the way... \n \n \nPROVING A NEGATIVE \n \n (The Objectivist Newsletter, April 1963) \"Proving the non-existence of \n that for which no evidence of any kind exists. Proof, logic, reason, \n thinking, knowledge pertain to and deal only with that which exists. They \n cannot be applied to that which does not exist. Nothing can be relevant or \n applicable to the non-existent. The non-existent is nothing. A positive \n statement, based on facts that have been erroneously interpreted, can be \n refuted - by means of exposing the errors in the interpretation of the \n facts. Such refutation is the disproving of a positive, not the proving of a \n negative.... Rational demonstration is necessary to support even the claim \n that a thing is possible. It is a breach of logic to assert that that which \n has not been proven to be impossible is, therefore, possible. An absence \n does not constitute proof of anything. Nothing can be derived from nothing.\" \n \n Doubt must always be specific, and can only exist in contrast to things \n which cannot properly be doubted. \n", 
   {}, 
   223673, 
   null, 
   1153434420.0
  ], 
  [
   223686, 
   null, 
   "jyoshu", 
   "Credibility is patently not on his list of priorities. His concern is the number of anti-gay messages he can post, not whether they actually convince anyone, are consistent with each other, or even make surface sense. IOW, \"Counter the XXXXXX\" at all costs. Throw everything you can at the wall, however risible, and maybe something will stick, somehow, for someone.\n\n \n Wow, what a strange post. I have no other motive to be here other than learning about the issues and sharing my views. Pretty much the same as everyone else I suspect. Not only is it pretty bizarre that anyone here would even be concerning themselves with it, but the idea that I would be posting based on how many I can do is absolutely ridiculous; if I did post in forums for pay (an accusation that's just nuts) it would make no sense to do in terms of volume. Of course, the whole idea that organzations would sink their hard-to-come-by funds into posting in forums like these instead of other means that would reach a lot more people is pretty ridiculous in and of itself. Frankly I find it much MORE disturbing that someone would rarely weigh in here except to give opinions about one particular poster, or slander that poster by flat out lying.\n \n \nPROVING A NEGATIVE\n\n \n Yeah, isn't it funny you never point that out when the \"proving-a-negative\" fallacy is carried out by gay marriage proponents . . .\n \n \"No, prove to me why we should NOT have gay marriage . . .\"", 
   {}, 
   223673, 
   null, 
   1153435260.0
  ], 
  [
   223724, 
   null, 
   "Kronus", 
   "\n Yeah, isn't it funny you never point that out when the \"proving-a-negative\" fallacy is carried out by gay marriage proponents . . .\n \n \"No, prove to me why we should NOT have gay marriage . . .\"\n\n \n Which is, of course, not trying to prove a negative. Proving a negative means showing that something doesn't exist, not that it shouldn't be. For someone who cites \"logical falacies\" so often, you're pretty fast and loose with their actual defintions.", 
   {}, 
   223686, 
   null, 
   1153448460.0
  ], 
  [
   223725, 
   null, 
   "foundit66", 
   "Yeah, isn't it funny you never point that out when the \"proving-a-negative\" fallacy is carried out by gay marriage proponents . . .\n \"No, prove to me why we should NOT have gay marriage . . .\"\n\n \n And once again Jyoshu fails to give any real argument other than obfuscation.\n Did you even read the definition of \"proving-a-negative\"? The very first sentence should have showed you that your response was inane and inaccurate.\n \n \"Proving the non-existence of that for which no evidence of any kind exists.\"\n THAT is what \"proving a negative\" means.\n \n Asking somebody to show WHY something should be ILLEGAL (or not legally recognized) is NOT \"proving a negative\".\n \n But of course, you can't reply to simple posts pointing out the blatant obfuscation that you portray. Instead, you just whine about how somebody has exposed your tactic and proven you wrong...\n -------------------------------------------------\n \n And as a side-note, considering you asked me to prove that homosexuality IS NOT causing violence in the Middle East, and then you pull that fast-and-loose misrepresentation of the \"proving-a-negative\" term...\n Take how YOU used the \"proving-a-negative\" interpretation and apply it to your OWN DEMAND!\n \n MAN! You just can't help but contradict yourself from post to post...", 
   {}, 
   223686, 
   null, 
   1153448820.0
  ], 
  [
   223731, 
   null, 
   "jyoshu", 
   "Which is, of course, not trying to prove a negative. Proving a negative means showing that something doesn't exist, not that it shouldn't be. For someone who cites \"logical falacies\" so often, you're pretty fast and loose with their actual defintions.\n\n \n \nAnd once again Jyoshu fails to give any real argument other than obfuscation.\n Did you even read the definition of \"proving-a-negative\"? The very first sentence should have showed you that your response was inane and inaccurate.\n \n \"Proving the non-existence of that for which no evidence of any kind exists.\"\n THAT is what \"proving a negative\" means.\n\n \n Hey, that's even worse for you. Considering your assertions that people here are prejudiced (or that prejudice \"exists\" with them since you're hung up on semantics here) and making them try to prove to you otherwise. They shouldn't have to--you should be proving it's existence with them to begin with.\n \n Thanks for the clarification. All the better, as far as I'm concerned.", 
   {}, 
   223724, 
   null, 
   1153453200.0
  ], 
  [
   223741, 
   null, 
   "foundit66", 
   "Hey, that's even worse for you. Considering your assertions that people here are prejudiced (or that prejudice \"exists\" with them since you're hung up on semantics here) and making them try to prove to you otherwise.\n\n And thus Jyoshu continues with his LIES.\n \n I have never asked anybody to \"prove otherwise\". It is my opinion that what I described earlier was an example of prejudice, but I NEVER asked anybody to prove they weren't prejudiced.\n I DID ask you to discuss my standard and its merits, but that is hardly the same thing at all with what you're claiming.\n You can quote me for where you think I said what you claim.\n \n \n \nThanks for the clarification. All the better, as far as I'm concerned.\n\n Of course you think that.\n You just lied about what I claimed, ignored what I actually said, and appointed yourself the victor off of your deceit.", 
   {}, 
   223731, 
   null, 
   1153454940.0
  ], 
  [
   223776, 
   null, 
   "jyoshu", 
   "And thus Jyoshu continues with his LIES.\n \n I have never asked anybody to \"prove otherwise\". It is my opinion that what I described earlier was an example of prejudice, but I NEVER asked anybody to prove they weren't prejudiced.\n\n \n Please stop being intentionally obtuse. When you claim someone is prejudiced without offering proof, you ARE, by default, expecting them to show otherwise--what else are they supposed to do??? And seriously, drop the constant 'you-lie' canard, and the immature red-font super-size text tactics already. it's getting downright comical the way you take every little thing as a \"lie\" and blow everything out of proportion. No one is lying to you; I didn't say you made any \"claim\" so chill out. Good grief.", 
   {}, 
   223741, 
   null, 
   1153459440.0
  ], 
  [
   223777, 
   null, 
   "foundit66", 
   "Please stop being intentionally obtuse.\n\n Wow! Aren't you the pot calling the kettle on TWO levels.\n 1) The label you attempted to attach to my actions. \"intentionally obtuse\".\n 2) The fact that you ATTEMPTED to attach that label to my actions when you have whined up a storm when others have made similar observations about you.\n \n What's that called again?\n Oh yeah. Hypocritical.\n \n \n \nWhen you claim someone is prejudiced without offering proof, you ARE, by default, expecting them to show otherwise--what else are they supposed to do???\n\n No. I'm not.\n I realize you may think you're a mind-reader, but you're not.\n Quite frankly, I \"expected\" you to do nothing about the observation other than whine about the fact that I made it.\n And to the greater degree, my expectation was fulfilled.\n \n If somebody wanted to show otherwise, that was their perogative. But there is no such \"expectation\" inherent to my observation.\n And you claimed that I was \"making them try to prove to you otherwise\", which is a FAR CRY from just \"expecting\" anything...\n \n \n \nAnd seriously, drop the constant 'you-lie' canard, and the immature red-font super-size text tactics already. it's getting downright comical the way you take every little thing as a \"lie\" and blow everything out of proportion. No one is lying to you; I didn't say you made any \"claim\" so chill out. Good grief.\n\n I'll stop observing your dishonesty when you start acting honestly.\n And for the record, \"ONE\" person is lying here. You.\n \n You lied when you claimed I was \"making them try to prove to you otherwise\".\n That was blatantly false.\n Nitpicking over whether or not you made a \"claim\" or not is the inane and juvenile aspect of this.\n \n And I'm not alone in that observation either... emoticon_xangel\n \n Do yourself a favor Jyoshu. Approach these discussions with honesty and you'll get some respect.\n Continue in the path that you are going, and you'll get the response you deserve.", 
   {}, 
   223776, 
   null, 
   1153460940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Violence in Israel caused by 'gay' event?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8536-violence-israel-caused-gay-event.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8536, 
  "discussion_files": [
   [
    "14429.html", 
    "http://www.4forums.com/political/gay-rights-debates/8536-violence-israel-caused-gay-event-print.html"
   ], 
   [
    "14430.html", 
    "http://www.4forums.com/political/gay-rights-debates/8536-violence-israel-caused-gay-event-2-print.html"
   ]
  ], 
  "identifier": 8536
 }
]