[
 [
  [
   223815, 
   null, 
   "chloe", 
   "Al Mohler has an interesting commentary on an ongoing debate between two pro-choice journalists. Check it out here.\n \n An Op-Ed writer for the NY Times, William Saletan is arguing that the pro-choice movement is loosing in the national debate and should admit that abortion is a \"bad thing.\"\n \n Katha Pollit, a columnist for The Nation is putting forth an argument that says as prochoicers seek to reframe their arguments, injecting more moralism into the antiabortion debate will not keep abortion legal and accessible.\n \n \n Here is Mohler's conclusion on this interesting dialogue between Saletan and Pollit:\n \n \n \"Why should pro-lifers pay attention to this debate among advocates of abortion rights? The answer to that question is simple--the exchange between William Saletan and Katha Pollitt demonstrates the inherent weakness of the pro-abortion argument, or its pro-choice variant. Lacking any objective definition of human life and the status of the unborn, the pro-abortion movement is mired in a pattern of endless internal debates and confusions. Saletan's argument is less radical than Pollitt's, but his position is morally arbitrary, based more in pragmatic concern than in moral philosophy.\n \n In any event, the exchange between William Saletan and Katha Pollitt indicates that the pro-abortion movement knows that it has work to do in reaching the hearts and minds of Americans. The pro-life movement had better remind itself of the same challenge. Both sides are locked in a race to reach the hearts and minds of those still stuck in the middle.\"", 
   {
    "post_info": {
     "post_title": "Debate a signal of prochoice confusion and breakdown?"
    }
   }, 
   null, 
   null, 
   1153495440.0
  ], 
  [
   223836, 
   null, 
   "happygrl35", 
   "Al Mohler has an interesting commentary on an ongoing debate between two pro-choice journalists. Check it out here.\n \n An Op-Ed writer for the NY Times, William Saletan is arguing that the pro-choice movement is loosing in the national debate and should admit that abortion is a \"bad thing.\"\n \n Katha Pollit, a columnist for The Nation is putting forth an argument that says as prochoicers seek to reframe their arguments, injecting more moralism into the antiabortion debate will not keep abortion legal and accessible.\n \n \n Here is Mohler's conclusion on this interesting dialogue between Saletan and Pollit:\n \n \n \"Why should pro-lifers pay attention to this debate among advocates of abortion rights? The answer to that question is simple--the exchange between William Saletan and Katha Pollitt demonstrates the inherent weakness of the pro-abortion argument, or its pro-choice variant. Lacking any objective definition of human life and the status of the unborn, the pro-abortion movement is mired in a pattern of endless internal debates and confusions. Saletan's argument is less radical than Pollitt's, but his position is morally arbitrary, based more in pragmatic concern than in moral philosophy.\n \n In any event, the exchange between William Saletan and Katha Pollitt indicates that the pro-abortion movement knows that it has work to do in reaching the hearts and minds of Americans. The pro-life movement had better remind itself of the same challenge. Both sides are locked in a race to reach the hearts and minds of those still stuck in the middle.\"\nI agree that pro-life is *getting one up* on pro-choice ,for the past 20 years the pro-choice movement has't been pushing as hard as the pro-life.The thought that reproductive rights could one day be taken away was outlandish.The pro-choice movement is paying for it's retreat now.The pro-life is winning hearts of americans because of it's over emotionalism and lies.I disagree with William Saletan,no one should be forced to say \"abortion is bad\" The pro-choice movement is regrouping.I guess we will just wait and see what happens.TY for the commentary:)", 
   {}, 
   223815, 
   null, 
   1153499100.0
  ], 
  [
   223850, 
   null, 
   "simone", 
   "ABORTION IS NOT BAD.\n \n That's all that needs to be said.", 
   {}, 
   223836, 
   null, 
   1153503720.0
  ], 
  [
   223873, 
   null, 
   "Another opinion", 
   "I agree that pro-life is *getting one up* on pro-choice ,for the past 20 years the pro-choice movement has't been pushing as hard as the pro-life.The thought that reproductive rights could one day be taken away was outlandish.The pro-choice movement is paying for it's retreat now.The pro-life is winning hearts of americans because of it's over emotionalism and lies.I disagree with William Saletan,no one should be forced to say \"abortion is bad\" The pro-choice movement is regrouping.I guess we will just wait and see what happens.TY for the commentary:)\n\n I agree that most people who have pro-choice views have been complacent about their rights since, after Roe vs. Wade, they did not feel that those rights were under threat any longer. Far too often, on any subject (global warming also comes to mind), people will not respond to a problem until they start to suffer from that problem and they don't bother to pay enough attention to prevent the problem in the first place. In this case, the problem would be that of the loss of abortion rights.\n \n I have actually been surprised by the number of people who don't realize what the debate is all about. A surprising number of people I have spoken with actually think that the debate is about whether or not a woman \"should\" have an abortion, not about whether or not she \"can\" have an abortion. Just look at the absurd use of the word \"pro-abortion\" in that post. I, personally, have never had a discussion with anyone who was arguing that women \"should\" have abortions. Even with people who are arguing that abortion is an important option for women who are in deep poverty and who are pregnant, I don't remember hearing any arguements that they \"should\" have an abortion. The use of the term \"pro-abortion\" is simply absurd. Unfortunately, as with so much of the pro-choice/pro-life debate, the pro-life people distort the picture in order to try to win their arguement.", 
   {}, 
   223836, 
   null, 
   1153507560.0
  ], 
  [
   223876, 
   null, 
   "simone", 
   "Good point, another, thanks!", 
   {}, 
   223873, 
   null, 
   1153509120.0
  ], 
  [
   223882, 
   null, 
   "Steeeeve", 
   " Unfortunately, as with so much of the pro-choice/pro-life debate, the pro-life people distort the picture in order to try to win their arguement.\n\n And pro-\"choice\" doesn't distort? That alone shows an unreasonable look on the issue.\n \n I agree that many are uneducated about the subject (which helps the pro-choicers I might add) and I think many that get an abortion are not educated about whether or not it is morally ok to do. Many have just grown up with it and assumed it to be ok (which neither side of the issue should support...there is nothing wrong with education on an issue).", 
   {}, 
   223873, 
   null, 
   1153510860.0
  ], 
  [
   223885, 
   null, 
   "jitobear", 
   "\"Why should pro-lifers pay attention to this debate among advocates of abortion rights? \n\n \n Why should choicers listen to lifers? Dumb statement.\n \n \nLacking any objective definition of human life and the status of the unborn, the pro-abortion movement is mired in a pattern of endless internal debates and confusions. \n\n \n Where he misses the boat is that for many choicers an \"objective definition of human life\" is not required to determine whether a woman can make her own medical decisions.", 
   {}, 
   223815, 
   null, 
   1153512420.0
  ], 
  [
   223902, 
   null, 
   "Another opinion", 
   "And pro-\"choice\" doesn't distort? That alone shows an unreasonable look on the issue.\n\n In debates between those of us not in power (such as ourselves), there are ranges of views on both sides - both intelligent and well thought out, vs. knee-jerk emotional reactions. So, both camps in these types of forums can be occasionally guilty of distortion. However, where the leaders of the movements are concerned (those that run NARAL or Democratic congresspeople), I haven't heard too many extreme distorted comments. If you have heard such distortions at those high levels, could you name some?\n \nI agree that many are uneducated about the subject (which helps the pro-choicers I might add) and I think many that get an abortion are not educated about whether or not it is morally ok to do. Many have just grown up with it and assumed it to be ok (which neither side of the issue should support...there is nothing wrong with education on an issue).\n\n I would be fine with information pamphlets on abortion (or other sources of information on abortion which are read by women considering that procedure) having a section with arguements on both sides - about the views on health concerns, morality, etc. Then, the woman can continue to choose for herself and would have heard summaries of both arguements. \n \n As for your comment about many getting abortions since they have grown up with it and assume it to be ok, the same can be said of those who are automatically against abortion because their parents and their communities are. As can be seen in the arguements in this forum, the issue is far too complicated to easily convince people one way or the other. I would love to see a calm and rational televised public debate on the subject but suspect that the issue is too emotionally charged and any such debate would end up degenerating into angry mutual accusations.", 
   {}, 
   223882, 
   null, 
   1153520340.0
  ], 
  [
   223905, 
   null, 
   "Bell", 
   "I agree that many are uneducated about the subject (which helps the pro-choicers I might add) and I think many that get an abortion are not educated about whether or not it is morally ok to do. Many have just grown up with it and assumed it to be ok (which neither side of the issue should support...there is nothing wrong with education on an issue).\n\n \n (Kind of like religion.)\n \n I would like to hear how you propose \"educating\" women on whether or not abortion is a moral decision for them. \n \n I personally am all for education. I want women to have access to talk to other women who have had abortions, who have been single mothers, who have had the children they wanted to abort, who have had adoptions, etc. I think it's in insult to require this of them, I certainly am educated enough to make up my own mind about my own body, but others may desire additional input.", 
   {}, 
   223882, 
   null, 
   1153521120.0
  ], 
  [
   223908, 
   null, 
   "Steeeeve", 
   "I would like to hear how you propose \"educating\" women on whether or not abortion is a moral decision for them. \n Educating them on the two sides of the debate....not a hard concept.\n \n \nI personally am all for education. I want women to have access to talk to other women who have had abortions, who have been single mothers, who have had the children they wanted to abort, who have had adoptions, etc. I think it's in insult to require this of them, I certainly am educated enough to make up my own mind about my own body, but others may desire additional input.\n I'm not talking about whether or not to obtain an abortion...just mainly explain the debate to those considering one. \n \n \nHowever, where the leaders of the movements are concerned (those that run NARAL or Democratic congresspeople), I haven't heard too many extreme distorted comments. If you have heard such distortions at those high levels, could you name some?\n I have named a few as I have seen them. NARAL is famous for it and PP does it as well...but it happens on the pro-life side....I am not a fool to think distorting is one sided.\n \n \nAs for your comment about many getting abortions since they have grown up with it and assume it to be ok, the same can be said of those who are automatically against abortion because their parents and their communities are. As can be seen in the arguements in this forum, the issue is far too complicated to easily convince people one way or the other. I would love to see a calm and rational televised public debate on the subject but suspect that the issue is too emotionally charged and any such debate would end up degenerating into angry mutual accusations.\n I would like to see this too...in fact, at the university I graduated from we tried to get a public debate but the other side refused which was kinda lame but it happens. I also think that growing up with it being legal has more of an impact than having your parents be against it but the law for it. And I feel many just don't talk about it and thus you go with what the law says normally. Most of my friends don't know anything about the subject and just assume it to be ok but haven't thought about it. I used to think it was ok before I thought about it.", 
   {}, 
   223905, 
   null, 
   1153522140.0
  ], 
  [
   223911, 
   null, 
   "Bell", 
   "Educating them on the two sides of the debate....not a hard concept. \n\n \n Like HOW. Can you be a little more specific? Sitting them in front of a pro-lifer and a pro-choicer and make them watch the two battle it out? Reading our forum? Reading some pamplets? I am tired of generalizations, I want to hear specific ideas and concepts, especially from people who are against abortion.", 
   {}, 
   223908, 
   null, 
   1153522620.0
  ], 
  [
   223979, 
   null, 
   "Caprii", 
   "Like HOW. Can you be a little more specific? Sitting them in front of a pro-lifer and a pro-choicer and make them watch the two battle it out? Reading our forum? Reading some pamplets? I am tired of generalizations, I want to hear specific ideas and concepts, especially from people who are against abortion.\n\n \n Bell, you're very open-minded and when I respond to you I know you try to see what I'm saying.\n \n As for debating, pro-choicers simply can't say without losing credibility \"anytime during the pregnancy is a valid time\" for a woman to have an abortion. Nationwide, up to 24 weeks, any pregnant woman can get an abortion just because. She can have an arguement with her boyfriend and say f-u and get an abortion. As fair, social beings, we know its very wrong when one person can control one being's fate and effect another beings life, because she's so chooses?. A pro-choicers has no credibility when they deny that a 24 week fetus is not a human being, worthy of continuing its life. No one buys it and the bottom line why women have abortions, is because they can't cope, be that emotionally or financially or both. An excuse of emotional or financial distress should not give any human being greater power than another human being.\n \n Come on, you tell me this baby (link below) is not a human being like you and I, deserving of the same rights we enjoy.\n \n http://www.doublepr.com.au/ringofconfidencesml.jpg\n \n this is a premature baby, that lived. Many babies are aborted at this stage because of one person. How fair is that. Wanted babies have rights, unwanted babies have no rights and end up in the garbage. You cannot deny this is a human being, inside or outside the womb.", 
   {}, 
   223911, 
   null, 
   1153541340.0
  ], 
  [
   223984, 
   null, 
   "Bell", 
   "Bell, you're very open-minded and when I respond to you I know you try to see what I'm saying.\n \n As for debating, pro-choicers simply can't say without losing credibility \"anytime during the pregnancy is a valid time\" for a woman to have an abortion. Nationwide, up to 24 weeks, any pregnant woman can get an abortion just because. She can have an arguement with her boyfriend and say f-u and get an abortion. As fair, social beings, we know its very wrong when one person can control one being's fate and effect another beings life, because she's so chooses?. A pro-choicers has no credibility when they deny that a 24 week fetus is not a human being, worthy of continuing its life. No one buys it and the bottom line why women have abortions, is because they can't cope, be that emotionally or financially or both. An excuse of emotional or financial distress should not give any human being greater power than another human being.\n \n Come on, you tell me this baby (link below) is not a human being like you and I, deserving of the same rights we enjoy.\n \n http://www.doublepr.com.au/ringofconfidencesml.jpg\n \n this is a premature baby, that lived. Many babies are aborted at this stage because of one person. How fair is that. Wanted babies have rights, unwanted babies have no rights and end up in the garbage. You cannot deny this is a human being, inside or outside the womb.\n\n \n I have no problem with any of this that you've said. I do not think late term abortions should be done, period, unless there is a serious medical issue at hand. (I would not ask a woman to sacrifice her life for her baby's-I would educate the heck out of her and allow her to make a decision) 24 weeks is six months pregnant. That, to me, is late term and six months, half a year, is plenty of time to figure out what the heck you're going to do.\n \n I have never felt that a fetus, at one week or at 24 weeks or whenever is not a human being. Of course it is a human being, what is it if it isn't a human being? A caterpillar in a cocoon? A mass of cells? No.\n \n Even as a pro-choicer, I believe there has to be some line drawn in the sand.\n \n That being said, I don't know where to draw the line. I do believe that we still need for abortion to be legal, safe, and accessible at least within the first three months. I have read conflicting reports about fetus development and am trying to make up my mind about when it is not okay anymore. This has been very hard for me to do, as I can clearly see both sides of the issue. \n I don't want women to get abortions, and I don't encourage anyone to ever do it. However, until we address the reasons women get them, which are very life effecting and legitimate (many will argue against me), then we need to keep abortions legal.\n \n No one wins the abortion debate.", 
   {}, 
   223979, 
   null, 
   1153542960.0
  ], 
  [
   224027, 
   null, 
   "Steeeeve", 
   "Like HOW. Can you be a little more specific? Sitting them in front of a pro-lifer and a pro-choicer and make them watch the two battle it out? Reading our forum? Reading some pamplets? I am tired of generalizations, I want to hear specific ideas and concepts, especially from people who are against abortion.\n All those ideas are fine. Just have them know the two arguments.\n \n \nI have never felt that a fetus, at one week or at 24 weeks or whenever is not a human being. Of course it is a human being, what is it if it isn't a human being? A caterpillar in a cocoon? A mass of cells? No.\n This is pretty impressive. Many pro-choicers say otherwise.\n \n \nHowever, until we address the reasons women get them, which are very life effecting and legitimate (many will argue against me), then we need to keep abortions legal.\n I don't think anyone thinks the reasons women get them do not need to be addressed. The problem is I think many feel it is an option so they won't address any of the other issues. As a teen if a girl is deciding whether or not to have sex she might say \"well, there is always abortion if I get into a bad situation\"....so they feel their is a remedy for a mistake happening.\n \n \n \n No one wins the abortion debate.[/QUOTE]", 
   {}, 
   223911, 
   null, 
   1153593900.0
  ], 
  [
   224041, 
   null, 
   "SassyTeffie", 
   "A life begins when the egg and sperm unite and an entirely new DNA pattern is formed. Looking at it from a purely scientific standpoint, most biologists feel that what makes a human being a human being is the unique DNA pattern. Therefore, when a new DNA pattern begins a human life has begun as well. If abortion is not the taking of an innocent child's life, then why do so many women (and many men) feel intense guilt and sorrow after the abortion (be it right after the procedure or years down the road)? As for pro-life arguments being largely emotional, how can you look at an aborted child http://www.abortiontruth.com/images/abortion/thumbs/31.jpg and not have an emotional reaction?", 
   {}, 
   224027, 
   null, 
   1153606380.0
  ], 
  [
   224043, 
   null, 
   "happygrl35", 
   "And pro-\"choice\" doesn't distort? That alone shows an unreasonable look on the issue.\n \n I agree that many are uneducated about the subject (which helps the pro-choicers I might add) and I think many that get an abortion are not educated about whether or not it is morally ok to do. Many have just grown up with it and assumed it to be ok (which neither side of the issue should support...there is nothing wrong with education on an issue).\n\n The morality of abortion is subjective,so there isn't anything to be educated about.I think not be educated about ALL the aspects of abortion would lead one to be pro-life.I actually fell into this trap years ago when I was a die-hard pro-lifers until some VERY patient pro-choicers gave me new insight on abortion tht the pro-lifers fail to mention.", 
   {}, 
   223882, 
   null, 
   1153606680.0
  ], 
  [
   224046, 
   null, 
   "happygrl35", 
   "Bell, you're very open-minded and when I respond to you I know you try to see what I'm saying.\n \n As for debating, pro-choicers simply can't say without losing credibility \"anytime during the pregnancy is a valid time\" for a woman to have an abortion. Nationwide, up to 24 weeks, any pregnant woman can get an abortion just because. She can have an arguement with her boyfriend and say f-u and get an abortion. As fair, social beings, we know its very wrong when one person can control one being's fate and effect another beings life, because she's so chooses?. A pro-choicers has no credibility when they deny that a 24 week fetus is not a human being, worthy of continuing its life. No one buys it and the bottom line why women have abortions, is because they can't cope, be that emotionally or financially or both. An excuse of emotional or financial distress should not give any human being greater power than another human being.\n \n Come on, you tell me this baby (link below) is not a human being like you and I, deserving of the same rights we enjoy.\n \n http://www.doublepr.com.au/ringofconfidencesml.jpg\n \n this is a premature baby, that lived. Many babies are aborted at this stage because of one person. How fair is that. Wanted babies have rights, unwanted babies have no rights and end up in the garbage. You cannot deny this is a human being, inside or outside the womb.\nThis is where people need to do more research and where the general public is ignorant of the fatcs.A fetus before the 22-24 weeks has the brain activity of a brain-dead person.People in general don't have moral issue with removing a brain-dead person from life support.People in general doen't have knowledge of the constitution and it's interpretation.People in general don't understand what at risk with the removal of reproduction rights.All they see are cute little pictures of babies and automatically assume that abortion is wrong.", 
   {}, 
   223979, 
   null, 
   1153607100.0
  ], 
  [
   224047, 
   null, 
   "happygrl35", 
   "Come on, you tell me this baby (link below) is not a human being like you and I, deserving of the same rights we enjoy.\n \n \n\n Something esle the general public is not aware of,over 90% of abortions take place by 12 weeks..the picture doesn't represent that.", 
   {}, 
   223979, 
   null, 
   1153607220.0
  ], 
  [
   224051, 
   null, 
   "SassyTeffie", 
   "This is where people need to do more research and where the general public is ignorant of the fatcs.A fetus before the 22-24 weeks has the brain activity of a brain-dead person.People in general don't have moral issue with removing a brain-dead person from life support.People in general doen't have knowledge of the constitution and it's interpretation.People in general don't understand what at risk with the removal of reproduction rights.All they see are cute little pictures of babies and automatically assume that abortion is wrong.\n\n \n First of all, there are many people who disagree with removing a brain dead person from life support. I have an uncle who chose to remove my aunt from life support because she was brain dead. Now his children refuse to speak to him (and it's been 15 years since this happened). Second, the constitution was not written to be interpreted. It is written in plain English, and was meant to be easily understood by the average person. Peopl who 'interpret' the Constitution are simply unhappy with what is written and trying to twist the words to fit their own agenda. Third, what is really at risk with the removal of reproduction rights? Could you be referring to the fact that people will once again be held accountable for their actions? That they will not be able to simply remove the outcome of their actions? Or perhaps you are referring to all the couple who have been waiting to adopt a baby, after all, we would want them to actually be able to provide a secure and loving home for a child.\n \n If you are interested in some factual reading, try this link. It goes to a scientific studying linking abortion with increased substance abuse.\n http://www.bentham.org/cwhr/sample/cwhr1-1/D0003W.pdf\n \n As for you comment on the other link to the 24 week premature baby, check out my link on page one of this thread. That link goes to a picture of a ten week old aborted baby. Looks like a person to me (although a gruesomely murdered person).", 
   {}, 
   224046, 
   null, 
   1153608420.0
  ], 
  [
   224061, 
   null, 
   "Another opinion", 
   " I have named a few as I have seen them. NARAL is famous for it and PP does it as well...but it happens on the pro-life side....I am not a fool to think distorting is one sided.\n\n Can you quote a few views that you consider extreme from the NARAL leadership and the Democratic congresspeople, along with the links from which those quotes came (so I can see them in context)? I have heard extreme comments from some pro-choice people, but I don't remember hearing any from the higher leadership (though I haven't done much searching on the subject).\n \n I would like to see this too...in fact, at the university I graduated from we tried to get a public debate but the other side refused which was kinda lame but it happens. I also think that growing up with it being legal has more of an impact than having your parents be against it but the law for it. And I feel many just don't talk about it and thus you go with what the law says normally. Most of my friends don't know anything about the subject and just assume it to be ok but haven't thought about it. I used to think it was ok before I thought about it.\n\n Regarding the debate that the other side opted out of, they might not have trusted that the debate would happen in a calm, reasonable manner and, if it would happen in an school where people would be mostly pro-life, they might have been afraid of the intimidation they might face as a consequence of participation in such a debate. I, for one, would be quite weary of participating in a public debate (if such an occasion came up) for precisely that reason. That is why the anonymous setting of a forum, where one can ignore flamers and those who argue with beligerent irrationality, is a far more productive setting. I can imagine that there are some on the pro-life side that might feel the same way.\n \n As for people being comfortable with something because it is lawful, I think a far larger influence is the beliefs of one's friends and family - i.e. whether they think that a particular action is acceptable. After all, being promiscuous is lawful, so is being an alcoholic, or being homosexual or a goth for that matter. There are actions and ways of being that certain communities do not accept. Abortion is one of those actions when it comes to communities that are of the religious right persuasion.", 
   {}, 
   223908, 
   null, 
   1153616460.0
  ], 
  [
   224062, 
   null, 
   "Another opinion", 
   "First of all, there are many people who disagree with removing a brain dead person from life support. I have an uncle who chose to remove my aunt from life support because she was brain dead. Now his children refuse to speak to him (and it's been 15 years since this happened). \n\n What was it in the brain dead person that your uncle's children so cherish? Did they think that there was still a chance for recovery? Did they think that their mother was still existing mentally in that body? What was it specifically about that brain dead person that you would cherish? \n \n This is an important question since the same question can be asked about an early fetus: What is it about the early fetus that you so cherish? The main question I would ask you (and I hope that you don't chicken out of it) is: Do you believe that that early fetus has a mind?", 
   {}, 
   224051, 
   null, 
   1153616700.0
  ], 
  [
   224066, 
   null, 
   "SassyTeffie", 
   "What was it in the brain dead person that your uncle's children so cherish? Did they think that there was still a chance for recovery? Did they think that their mother was still existing mentally in that body? What was it specifically about that brain dead person that you would cherish? \n \n This is an important question since the same question can be asked about an early fetus: What is it about the early fetus that you so cherish? The main question I would ask you (and I hope that you don't chicken out of it) is: Do you believe that that early fetus has a mind?\n\n \n In regards to my uncle's children, I cannot answer that. I do not see them that often, and I have not asked them the same questions that you asked me.\n \n In regards to an unborn child in the first trimester, I cherish the knowledge that another life has begun. I think about all the things this new life may accomplish in the world, the joy that he/she will bring to others, the differences that he/she will make in other people's lives. Yes, I believe that an unborn child in any stage has a mind. I have been pregnant three times and given birth to three wonderful children. I have also known several women who miscarried during the first twelve weeks and one friend who had an abortion during the first twelve weeks. If an unborn child during this time is not a life, a human being, than why do all these women grieve over the loss of these children?", 
   {}, 
   224062, 
   null, 
   1153623840.0
  ], 
  [
   224073, 
   null, 
   "Another opinion", 
   "In regards to an unborn child in the first trimester, I cherish the knowledge that another life has begun. I think about all the things this new life may accomplish in the world, the joy that he/she will bring to others, the differences that he/she will make in other people's lives. Yes, I believe that an unborn child in any stage has a mind. I have been pregnant three times and given birth to three wonderful children. I have also known several women who miscarried during the first twelve weeks and one friend who had an abortion during the first twelve weeks. If an unborn child during this time is not a life, a human being, than why do all these women grieve over the loss of these children?\n\n I can understand your respect for the potential of that fetus. For those who want to be pregnant, the thought of that potential can be a wonderful thing - something to look forward to. However, for those with an unwanted pregnancy, the potential that they see is purely hardship. \n \n For women in a tough situation who might be considering abortion, there really are no good options:\n 1) They can continue the pregnancy and keep the born baby, but women who typically would opt for abortion are typically women for whom this choice would be frought with difficulties and regrets. Some simply cannot afford a baby, some are too young. For some, there would be major health reprecussions, etc. I give my full support to those who are willing to try to bring such an otherwise unwanted child into the world. For some, this is simply not a realistic option - for those, I support their decision to abort.\n 2) They can give the baby up for adoption. I admire the women who are able to do this, since it is a large sacrifice on their part that can be a great benefit to a childless couple. Unfortunately, from a wide variety of anecdotal evidence I have heard, this is a very depressing option for women, so I can understand why many do not choose this option.\n 3) They can abort. How depressing an option this is for them depends on their belief system. Yes, some will be depressed. Others will be relieved - most from what I have heard. I, personally, would love to see fewer women need to choose this option by improved birth control methods (to limit the number of unwanted pregnancies) and by support for unwed mothers.\n \n You believe that a fetus has a mind at all stages. That is where I disagree and that is the main reason that I lean much farther to pro-choice than to pro-life. My own views are based on the views of neurologists that the mind cannot start to exist until around the beginning of the third trimester. Therefore, I would strongly restrict late term abortions but allow first and second term abortions. Your view, as stated, is that the fetus at all stages has a mind. Given that view, I can understand why you would like to outlaw nearly all abortions. However, I suspect that view is based on religious beliefs - which many people, including myself, do not share. Do you base that view of the early existence of the mind on something other than those religious beliefs?", 
   {}, 
   224066, 
   null, 
   1153629660.0
  ], 
  [
   224127, 
   null, 
   "SassyTeffie", 
   "I can understand your respect for the potential of that fetus. For those who want to be pregnant, the thought of that potential can be a wonderful thing - something to look forward to. However, for those with an unwanted pregnancy, the potential that they see is purely hardship. \n \n For women in a tough situation who might be considering abortion, there really are no good options:\n 1) They can continue the pregnancy and keep the born baby, but women who typically would opt for abortion are typically women for whom this choice would be frought with difficulties and regrets. Some simply cannot afford a baby, some are too young. For some, there would be major health reprecussions, etc. I give my full support to those who are willing to try to bring such an otherwise unwanted child into the world. For some, this is simply not a realistic option - for those, I support their decision to abort.\n 2) They can give the baby up for adoption. I admire the women who are able to do this, since it is a large sacrifice on their part that can be a great benefit to a childless couple. Unfortunately, from a wide variety of anecdotal evidence I have heard, this is a very depressing option for women, so I can understand why many do not choose this option.\n 3) They can abort. How depressing an option this is for them depends on their belief system. Yes, some will be depressed. Others will be relieved - most from what I have heard. I, personally, would love to see fewer women need to choose this option by improved birth control methods (to limit the number of unwanted pregnancies) and by support for unwed mothers.\n \n You believe that a fetus has a mind at all stages. That is where I disagree and that is the main reason that I lean much farther to pro-choice than to pro-life. My own views are based on the views of neurologists that the mind cannot start to exist until around the beginning of the third trimester. Therefore, I would strongly restrict late term abortions but allow first and second term abortions. Your view, as stated, is that the fetus at all stages has a mind. Given that view, I can understand why you would like to outlaw nearly all abortions. However, I suspect that view is based on religious beliefs - which many people, including myself, do not share. Do you base that view of the early existence of the mind on something other than those religious beliefs?\n\n \n In answer to your question, I do have religious beliefs, but I spent most of my youth as an atheist, then began practicing vampirism and Wiccan (during which time I had my first child). What my religious beliefs are now is not relevant to this discussion. I have held these views since I was a teenager and actually researched abortion (and yes, I did research both sides of the issue). I have also seen too many people eaten away by the fact that they had an abortion. If, as you say, most women are merely relieved, why are their so many post-abortion trauma groups and counselors? Why is the suicide rate higher among women who have had an abortion? Why is it that the rate of child abuse is higher among women who have had an abortion?\n \n As for the pregnant woman who is experiencing hardship, I firmly believe that abortion is still a selfish choice. They think it will be too hard, so they don't even try to give their unborn child a chance at life. I got pregnant at 18. The father of my child was not in the picture. I spent the majority of my pregnancy living in a box-like structure made of wood and tarps that I had found in a small wooded area near a Denny's. I wrote bad checks so I could buy food. When that stopped working I started begging for food, and hitting homeless shelters. Towards the end of my pregnancy I heard about a home for pregnant women. Since it was heading into winter (I was due in January) I decieded to check it out. I moved into this shelter despite the fact that it was a religiously ran shelter and they did not let me practice Wicca in the house. I knew that the temporary difficulty that presented meant a better chance for my baby. Since the birth of my daughter I have had two more children. Luckily, I found and married a wonderful man. Our life is still difficult, and the recent birth of our son has made it more so, but just because something is hard does not mean that it shouldn't be done.", 
   {}, 
   224073, 
   null, 
   1153669440.0
  ], 
  [
   224131, 
   null, 
   "simone", 
   ". . . . I have named a few as I have seen them. NARAL is famous for it and PP does it as well...but it happens on the pro-life side....I am not a fool to think distorting is one sided. . . .\nSo, where are some examples of this behavior by NARAL and Planned Parenthood?", 
   {}, 
   223908, 
   null, 
   1153672020.0
  ], 
  [
   224132, 
   null, 
   "simone", 
   "A life begins when the egg and sperm unite and an entirely new DNA pattern is formed. Looking at it from a purely scientific standpoint, most biologists feel that what makes a human being a human being is the unique DNA pattern. Therefore, when a new DNA pattern begins a human life has begun as well. If abortion is not the taking of an innocent child's life, then why do so many women (and many men) feel intense guilt and sorrow after the abortion (be it right after the procedure or years down the road)? As for pro-life arguments being largely emotional, how can you look at an aborted child http://www.abortiontruth.com/images/abortion/thumbs/31.jpg and not have an emotional reaction?\nLife existed before the egg and sperm united. If the egg had been dead or the sperm, Surprise! Life stops.\n \n So, this little fertilized egg can think, make decisions, vote, pay taxes?\n \n People feel guilty when they have been conditioned to feel guilty by their religion, their parents, their society.\n \n Most women do not feel guilty after having had an abortion. They may feel sorry that they were obliged to have one, but they are far more relieved that safe, legal and accessible abortion was there for them, as it ought to be for every woman. And child raped by her father or uncle or brother or whatever.", 
   {}, 
   224041, 
   null, 
   1153672380.0
  ], 
  [
   224147, 
   null, 
   "happygrl35", 
   "First of all, there are many people who disagree with removing a brain dead person from life support. I have an uncle who chose to remove my aunt from life support because she was brain dead. Now his children refuse to speak to him (and it's been 15 years since this happened). Second, the constitution was not written to be interpreted. It is written in plain English, and was meant to be easily understood by the average person. Peopl who 'interpret' the Constitution are simply unhappy with what is written and trying to twist the words to fit their own agenda. Third, what is really at risk with the removal of reproduction rights? Could you be referring to the fact that people will once again be held accountable for their actions? That they will not be able to simply remove the outcome of their actions? Or perhaps you are referring to all the couple who have been waiting to adopt a baby, after all, we would want them to actually be able to provide a secure and loving home for a child.\n \n If you are interested in some factual reading, try this link. It goes to a scientific studying linking abortion with increased substance abuse.\n http://www.bentham.org/cwhr/sample/cwhr1-1/D0003W.pdf\n \n As for you comment on the other link to the 24 week premature baby, check out my link on page one of this thread. That link goes to a picture of a ten week old aborted baby. Looks like a person to me (although a gruesomely murdered person).\nYou would be hard-pressed to find many people who actually *know* what brain-death is advocating the *right to life* of the brain-dead.I was personally responsible for making the decission to remove my 24 yearold brain-dead brother from life support and donating his organs.I spent many,many hours talking with neurosurgeons until I finally came to the relization that \"nobody was in there\" my brothers personhood no longer resided in his body.The same with a ZEF,before brainwaves are present *nobody is in there*.Regardless the public is being mis-informed by the pro-life group.Many casual pro-lifers don't relize that the pro-life groups are opposed to birth-control.They don't relize that the cute pictures of babies don't represent what is removed in 90% of abortions.They don't relize that historically western abortion laws were a way to control the sex lives of women.A plain reading of the constitution protects reproductive rights BTW.I made another thread on Abortion and the Constitution.", 
   {}, 
   224051, 
   null, 
   1153677660.0
  ], 
  [
   224151, 
   null, 
   "SassyTeffie", 
   "Life existed before the egg and sperm united. If the egg had been dead or the sperm, Surprise! Life stops.\n \n So, this little fertilized egg can think, make decisions, vote, pay taxes?\n \n People feel guilty when they have been conditioned to feel guilty by their religion, their parents, their society.\n \n Most women do not feel guilty after having had an abortion. They may feel sorry that they were obliged to have one, but they are far more relieved that safe, legal and accessible abortion was there for them, as it ought to be for every woman. And child raped by her father or uncle or brother or whatever.\n\n \n A. If the ability to think, make decisions, vote, and pay taxes are the criteria for determining a person's right to life, then I know a lot of people who should be killed. I know grown people who are incapable of doing some or all of those things. \n \n B. Have you ever looked up the numbers on women who regret their choice and feel guilty about it? Or the number of women who commit suicide that have had an abortion as compared to the number who had their baby? Maybe you should do a little more research before stating things in terms of most women.\n \n Happygrl: I read your thread on abortion and the Constitution. Great sense of humor! Actually, I took it over to the history/political science department at the university in my town, and the professors there got quite a kick out of it! FYI the Constitution was written in plain English so all citizens could understand it. I t does not need to be interoreted except by people who don't like what is says. Then they 'interpret' it by twisting the language so that it better suits their political agenda.\n \n I honestly feel sorry for both of you. You are so blind to the truth and so stubborn that you insist on remaining blind. Someday you will realize the error of your thinking, but, unfortunately, by that time it will probably be too late. It was nice talking to you. Feel free to respond if you have anything intelligent and factual to say.", 
   {}, 
   224132, 
   null, 
   1153682880.0
  ], 
  [
   224159, 
   null, 
   "electrolyte", 
   "A life begins when the egg and sperm unite and an entirely new DNA pattern is formed. Looking at it from a purely scientific standpoint, most biologists feel that what makes a human being a human being is the unique DNA pattern.\n\n Let's reduce this to absurdity: an ovum is fertilized, and BOOM, a life begins. They zygote divides once, then undergoes further division and differentiation. You now have identical twins who share a single life.\n Whoops, hang on... the twins have, for all intents and purposes, identical DNA patterns. As identical twins don't have unique DNA patterns, you think that this makes them not human. (No, I realize this is not your belief, but it is the logical consequence of your rationalization.)\n Also, as a biologist of sorts, I can assert that \"most biologists\" certainly don't feel that way.\n \n \nIf abortion is not the taking of an innocent child's life, then why do so many women (and many men) feel intense guilt and sorrow after the abortion (be it right after the procedure or years down the road)?\n\n Why do women get post-partem depression after completing a pregnancy? According to your logic, they must have done something wrong by carrying the pregnancy to term. Again, this is absurd.\n \n \nIf an unborn child during this time is not a life, a human being, than why do all these women grieve over the loss of these children?\n\n Again, we can reduce this to absurdity. Let's say my dog dies. I grieve. Therefore, my dog was human. Or perhaps I lose my favorite stapler. I'm upset, and sad. Therefore, my favorite stapler was alive.\n \n \nI have also seen too many people eaten away by the fact that they had an abortion.\n\n And I've seen people who regretted having a child at a very inconvenient or dangerous time in their lives, leading to further hardship. What's your point?\n \n \nWhy is the suicide rate higher among women who have had an abortion? Why is it that the rate of child abuse is higher among women who have had an abortion?\n\n Why is the abortion rate higher among women who have had an abortion? You may have done some research, but it doesn't appear that you have actually analyzed the data. Assuming that \"having had an abortion\" is the only pertinent factor is asinine.\n \n \n Here's a fun approach that I saw just recently from a guy with mostly nutjob views but occassionally interesting ideas. Maybe I can get some feedback from some folks here.\n \n Suppose you wake up one morning, and I have surgically attached myself to you such that I subsist off of you. I do not eat, drink, or breathe, but I have tapped into your bloodstream to get the chemicals I need. My presence restricts your lifestyle; you can't go play tennis, or hang out in bars with your friends, or have a romantic dinner with candlelight and wine with your significant other. I continually make you sick, sore, and weak. Suffice it to say, you want me gone, but removing me from you would kill me. What do you do?\n \n The point here is, if one concedes -- merely for the sake of argument, of course -- that a fetus is alive, or has a soul, or however one chooses to look at it, the dilemma of \"unwillingly allowing another human to live off of you\" applies.\n \n \n P.S.:\n \nFYI the Constitution was written in plain English so all citizens could understand it.\n\n Did you take this little nugget of brilliance to your local university's history/political science department too? I think the professors would get quite a kick out of it, too...\n \n P.P.S.:\n \nFeel free to respond if you have anything intelligent and factual to say.\n\n Why the qualifier? We can see those requirements certainly don't stop you.", 
   {}, 
   224147, 
   null, 
   1153684680.0
  ], 
  [
   224168, 
   null, 
   "georged", 
   "Glad to see someone stepping up to the plate with biological knowledge and common sense before some of the more adamant pro-life posters began naming sperm and eggs.", 
   {}, 
   224159, 
   null, 
   1153687620.0
  ], 
  [
   224175, 
   null, 
   "thelmoose", 
   ". \n \n Have you ever looked up the numbers on women who regret their choice and feel guilty about it? Or the number of women who commit suicide that have had an abortion as compared to the number who had their baby? Maybe you should do a little more research before stating things in terms of most women.\n \n \n\n So What are those numbers?\n I would like you to provide evidence of this assertion.\n Certainly people have regrets and even develop depression over decisions they have made in their lives. However, the so-called \"post abortion syndrome\" is a myth. There is a certain subset of women who feel inordinate remorse, but for the most part, this is not the case. The incidence of mental health problems is no greater for women after an abortion than the general population.\n \n I would like you to provide evidence to back up your claim. This evidence should be from the medical literature as you are making a medical claim. I quote you: \"Maybe you should do a little more research before stating things in terms of most women\"\n \n Also, your sarcastic tone is not helpful in making your case.", 
   {}, 
   224151, 
   null, 
   1153690500.0
  ], 
  [
   224180, 
   null, 
   "Another opinion", 
   "In answer to your question, I do have religious beliefs, but I spent most of my youth as an atheist, then began practicing vampirism and Wiccan (during which time I had my first child). What my religious beliefs are now is not relevant to this discussion. I have held these views since I was a teenager and actually researched abortion (and yes, I did research both sides of the issue). I have also seen too many people eaten away by the fact that they had an abortion. If, as you say, most women are merely relieved, why are their so many post-abortion trauma groups and counselors? Why is the suicide rate higher among women who have had an abortion? Why is it that the rate of child abuse is higher among women who have had an abortion?\n\n Whether or not you hold the views about a mind existing in the early fetus due to religious reasons is very much part of the discussion. The reason that it is part of the discussion is that, in this country (the USA), people from one religious group cannot impose their views in law on the country in general. The founders had dealt with state imposed religion in the form of the Church of England and felt it important for people to have freedom of belief - not to have it imposed on them. If you hold your beliefs about the early mind purely for religious reasons, then you are trying to impose your religious beliefs on others.\n \n As for statistics and reasons behind women's psychological state after abortion, just a quick Google search came up with this site (that sites references for its data):\n \n http://www.jimandellen.org/gmuhome/abortion.html\n \n To quote from that site:\n \nFor example, feelings of anxiety, depression, guilt and regret do occur in 5-30% of woman but usually subside in a matter of weeks (2). These articles and reviews showed that 75% of women who had an abortion have a feeling of relief and/or happiness. The most common post abortion reaction is relief (7): \n \"The biggest thing that I remember feeling was relief, because at neither of those times in my life was I ready to accept the responsibility of being a parent again, because I already had a child, or had children.\" This was said by a forty-four year old psychologist who is now a mother of three but had an illegal abortion performed at the age of eighteen and a legal abortion performed at the age of twenty-eight (7).For many women who have undergone this procedure years down the road looking back on their decision, the abortion has been a positive experience because it made them a stronger person and gave them motivation to refocus their lives in a meaningful way (2). Some positive effects of the post abortion are a maturing experience, a successful coping of a person crisis and 98% of the women who have had an abortion have no regrets (9). Some other feelings that are felt post operative are the feelings of self worth, self image and self esteem. After all the debating of whether or not she should get an abortion and then deciding to go through with the procedure many women feel delighted because they feel they are able to have control over their own lives (7): \"I learned a certain kind of self-reliance. It was the first thing that happened to me that I had to go through completely alone. It was probably the first time I really had to stand up for myself.\" A forty-four year old stated this after having an abortion at the age of thirty-four.\n\n Note: Most sites listed on Google were either clearly pro-choice (ex. Planned Parenthood) or clearly pro-life (Abortionfacts.com sponsored by pro-life Heritage House).\n \nAs for the pregnant woman who is experiencing hardship, I firmly believe that abortion is still a selfish choice. They think it will be too hard, so they don't even try to give their unborn child a chance at life. I got pregnant at 18. The father of my child was not in the picture. I spent the majority of my pregnancy living in a box-like structure made of wood and tarps that I had found in a small wooded area near a Denny's. I wrote bad checks so I could buy food. When that stopped working I started begging for food, and hitting homeless shelters. Towards the end of my pregnancy I heard about a home for pregnant women. Since it was heading into winter (I was due in January) I decieded to check it out. I moved into this shelter despite the fact that it was a religiously ran shelter and they did not let me practice Wicca in the house. I knew that the temporary difficulty that presented meant a better chance for my baby. Since the birth of my daughter I have had two more children. Luckily, I found and married a wonderful man. Our life is still difficult, and the recent birth of our son has made it more so, but just because something is hard does not mean that it shouldn't be done.\n\n I can admire the courage it took for you to go through all of those hardships in order to keep the child. It sounds like your belief system compelled you to make that choice and you fought hardship to live up to that belief system. However, not all people have the same belief system. Since you believe that a mind exists in a fetus from early on, I can understand why you would have felt repelled by the idea of aborting the fetus. However, for those that don't share those beliefs, the early fetus is not yet a being with which one can sympathize and for which one need feel the obligation to sacrifice for - it is still just a body without a mind. Then, their own circumstances compell them to make the decision for abortion in some cases. You may call that selfish, but selfishness is ignoring someone else's needs in order to satisfy one's own. If there is no other \"someone\" yet, then the picture of whether or not it is selfish is far murkier. I, personally, do hold some respect for the potential of the fetus, even if it does not yet have a mind, and would hope that any decision that a woman takes about abortion would keep that potential in mind. However, I cannot force them to consider that - it has to ultimately be their choice.", 
   {}, 
   224127, 
   null, 
   1153694400.0
  ], 
  [
   224181, 
   null, 
   "thelmoose", 
   "THis is to add to what Another Opinion just posted:\n \n \n\n WOMEN'S FEELINGS AFTER PREGNANCY TERMINATION - The most common emotional reactions after pregnancy termination are relief, transient guilt, sadness, and a sense of loss [1]. There is no good evidence from large surveys that choosing to terminate an unwanted first pregnancy places a woman at higher risk of subsequent depression than choosing to deliver an unwanted first pregnancy [2]. The frequency of psychiatric diagnoses in women who have undergone an abortion procedure is similar to that in women with no such history. Risk factors for postabortal psychosocial problems include previous or concurrent psychiatric illness, coercion, medical indications that force the patient to chose between possible life threatening complications and termination of a wanted pregnancy, increasing length of gestation, ambivalence, and lack of social support [3,4]. In 1993, the American Psychiatric Association's Diagnostic and Statistical Manual of Mental Disorders revised (DSM-IV-R) ceased to recognize abortion as a type of psychosocial stressor.\n \n 1. Stotland NL. The myth of the abortion trauma syndrome. JAMA 1992 Oct 21;268(15):2078-9. \n \n 2. Schmiege S; Russo NF Depression and unwanted first pregnancy: longitudinal cohort study. BMJ 2005 Dec 3;331(7528):1303.\n \n 3. Stotland NL Psychosocial aspects of induced abortion. Clin Obstet Gynecol 1997 Sep;40(3):673-86.\n \n 4. Korenromp MJ; Christiaens GC; van den Bout J; Mulder EJ; Hunfeld JA; Bilardo CM; Offermans JP; Visser GH. Long-term psychological consequences of pregnancy termination for fetal abnormality: a cross-sectional study. Prenat Diagn 2005 Mar;25(3):253-60. \n \n", 
   {
    "post_info": {
     "post_title": "evidence"
    }, 
    "unicode_changes_made": true
   }, 
   224180, 
   null, 
   1153694820.0
  ], 
  [
   224225, 
   null, 
   "chloe", 
   "Let's reduce this to absurdity: an ovum is fertilized, and BOOM, a life begins. They zygote divides once, then undergoes further division and differentiation. You now have identical twins who share a single life.\n Whoops, hang on... the twins have, for all intents and purposes, identical DNA patterns. As identical twins don't have unique DNA patterns, you think that this makes them not human. (No, I realize this is not your belief, but it is the logical consequence of your rationalization.)\n Also, as a biologist of sorts, I can assert that \"most biologists\" certainly don't feel that way.\n\n \n Actually, an ovum is fertilized by a sperm and BOOM a new human life does begin. A new human life begins also, if this zygote/blastocyst eventually splits to form an identical twin. These are a facts recognized by those of us in the scientific community. I am not sure if I get the point of your twins example. The way identical twins come about is indeed an amazing process, but this process in no way assumes that these are not unique individual human lives. The logical conclusion of your rationalization would have to assume that identical twins of any age are not unique separate human lives?", 
   {}, 
   224159, 
   null, 
   1153716840.0
  ], 
  [
   224226, 
   null, 
   "chloe", 
   "So, this little fertilized egg can think, make decisions, vote, pay taxes?\n\n \n What does this have to do with anything? I can barely do any of these things myself - let alone balance my own checkbook. Does this make me any less of a person? Life/Personhood is not earned or attained unto. \n Your comment does give us a unique insight into your worldview (naturalism/relativism?) as well as some of its conclusions: \n 1. That human life does not have any absolute inherent meaning, value, or dignity within itself. \n \n 2. That the value of human life is relative and that it is determined by people like yourself.", 
   {}, 
   224132, 
   null, 
   1153717440.0
  ], 
  [
   224237, 
   null, 
   "electrolyte", 
   "Actually, an ovum is fertilized by a sperm and BOOM a new human life does begin.\n\n Well, this goes back to the debate over when the life begins. (Frankly, as one who meticulously analyzes things, I have a hard time defining anything as alive in such a way that holes in the argumentation don't exist.) However, this is Sassy's claim, and while I choose not to strenuously object to it here, I don't need to; I used it as foundation upon which her argument can be reduced to absurdity. Insisting that this portion of her statement is correct does nothing to resolve the absurdity.\n \n Let us look again at Sassy's statements, chloe, just for clarification:\n \nA life begins when the egg and sperm unite and an entirely new DNA pattern is formed.\n\n She clearly states that a life begins when both (A) fertilization occurs and (B) a new DNA pattern is formed.\n \n She continues,\n \nLooking at it from a purely scientific standpoint, most biologists feel that what makes a human being a human being is the unique DNA pattern.\n\n Suffice it to say that this is not what most biologists \"feel\" makes a human being a human being; regardless, we can discredit a clearly absurd claim despite the false appeal to authority. If her assertion were true, the existence of a non-unique DNA pattern would disqualify the owner (or perhaps owners) from being human. This is, of course, ridiculous by any biological standard.\n Furthermore, upon the first cell division, fertilization had not again occurred and a new DNA pattern was not produced. Therefore, according to her statement, only one life exists. Again, this is absurd.\n Please keep in mind that these are not my positions or beliefs. I am simply following Sassy's statements to their logical consequences. This is a common philosophical approach known as reductio ad absurdum; if you are unfamiliar with it, I suggest you follow the link.\n \n \nThe way identical twins come about is indeed an amazing process, but this process in no way assumes that these are not unique individual human lives. The logical conclusion of your rationalization would have to assume that identical twins of any age are not unique separate human lives?\n\n Sorry, chloe, I didn't make that claim. In fact, I reduced Sassy's claim using that as an example of absurdity.", 
   {}, 
   224225, 
   null, 
   1153719900.0
  ], 
  [
   224264, 
   null, 
   "happygrl35", 
   "Happygrl: I read your thread on abortion and the Constitution. Great sense of humor! Actually, I took it over to the history/political science department at the university in my town, and the professors there got quite a kick out of it! FYI the Constitution was written in plain English so all citizens could understand it. I t does not need to be interoreted except by people who don't like what is says. Then they 'interpret' it by twisting the language so that it better suits their political agenda\n Thats nice,now where are the legal rebuttals?Regardless NOBODY has the right to substain life of the body of another without consent.Why should a fetus get MORE rights than a born person?\nI honestly feel sorry for both of you. You are so blind to the truth and so stubborn that you insist on remaining blind. Someday you will realize the error of your thinking, but, unfortunately, by that time it will probably be too late. It was nice talking to you. Feel free to respond if you have anything intelligent and factual to say.\nTo what truth?", 
   {}, 
   224151, 
   null, 
   1153735500.0
  ], 
  [
   224283, 
   null, 
   "Steeeeve", 
   "This is where people need to do more research and where the general public is ignorant of the fatcs.A fetus before the 22-24 weeks has the brain activity of a brain-dead person.People in general don't have moral issue with removing a brain-dead person from life support.\n If they have the ability to come out of that state they do.\n \n \n\n People in general doen't have knowledge of the constitution and it's interpretation.People in general don't understand what at risk with the removal of reproduction rights. \n Didn't you just say people shouldn't be further educated? \n \n \n\n All they see are cute little pictures of babies and automatically assume that abortion is wrong.\n\n \nso there isn't anything to be educated about\n Don't complain then :)\n \n \nCan you quote a few views that you consider extreme from the NARAL leadership and the Democratic congresspeople, along with the links from which those quotes came (so I can see them in context)? I have heard extreme comments from some pro-choice people, but I don't remember hearing any from the higher leadership (though I haven't done much searching on the subject).\n I mentioned a few in previous threads on these forums from NARAL and PP. You can go dig them up if you like but I don't want to bother. If you choose not to believe me then no skin off my nose :) My point is just that both sides will distort and to think otherwise makes you blind.\n \n \nRegarding the debate that the other side opted out of, they might not have trusted that the debate would happen in a calm, reasonable manner and, if it would happen in an school where people would be mostly pro-life, they might have been afraid of the intimidation they might face as a consequence of participation in such a debate.\n Actually, it was lack of organization. I didn't meant to imply they were scared or anything...it was just not an \"active\" group.\n \n \nThat is why the anonymous setting of a forum, where one can ignore flamers and those who argue with beligerent irrationality, is a far more productive setting. I can imagine that there are some on the pro-life side that might feel the same way.\n \n While both sides have flamers...pro-lifers are they only ones that need to worry at a college campus. I don't recall ever hearing such hatred from one side of the fense....it is different in other places it seems.\n \n \nAs for people being comfortable with something because it is lawful, I think a far larger influence is the beliefs of one's friends and family - i.e. whether they think that a particular action is acceptable. After all, being promiscuous is lawful, so is being an alcoholic, or being homosexual or a goth for that matter. There are actions and ways of being that certain communities do not accept. Abortion is one of those actions when it comes to communities that are of the religious right persuasion.\n Perhaps if it is talked about. If your family doesn't talk about that kinda stuff then you probably would default it to being \"right\" based upon the law. I doubt many families have discussions about abortion all the time. I know mine didn't.\n \n I also thank you for providing a civil discussion as some are not doing so in this thread :(", 
   {}, 
   224046, 
   null, 
   1153753740.0
  ], 
  [
   224284, 
   null, 
   "Steeeeve", 
   "Also, on the idea that women are at higher risk for certain things after an abortion. A study that came out Jan 2006 suggests that women are at higher risks for drug and alcohol dependence, depression, and other things of that nature. This was the longest running study on the issue to date.\n \n For information about this study please search the forums as we had a long debate about it.", 
   {}, 
   224283, 
   null, 
   1153753860.0
  ], 
  [
   224287, 
   null, 
   "simone", 
   "Also, on the idea that women are at higher risk for certain things after an abortion. A study that came out Jan 2006 suggests that women are at higher risks for drug and alcohol dependence, depression, and other things of that nature. This was the longest running study on the issue to date.\n \n For information about this study please search the forums as we had a long debate about it.\nWooh! Wait a minute. Women are at higher risk for certain things AFTER an abortion?\n \n Are you very, very, very sure then that these women were not at higher risk for these certain things BEFORE an abortion?\n \n Truth now, just the truth. No lies please. No twisting of facts.", 
   {}, 
   224284, 
   null, 
   1153754460.0
  ], 
  [
   224295, 
   null, 
   "Steeeeve", 
   "Wooh! Wait a minute. Women are at higher risk for certain things AFTER an abortion?\n \n Are you very, very, very sure then that these women were not at higher risk for these certain things BEFORE an abortion?\n \n Truth now, just the truth. No lies please. No twisting of facts.\n\n \n Oops...alcohol dependence was not one of them.\n \n http://4forums.com/political/showpost.php?p=194563&postcount=78\n \n The rest was accurate though....which doesn't mean this is the final word. In fact the study even says more needs to be researched.", 
   {}, 
   224287, 
   null, 
   1153755480.0
  ], 
  [
   224307, 
   null, 
   "Another opinion", 
   " I mentioned a few in previous threads on these forums from NARAL and PP. You can go dig them up if you like but I don't want to bother. If you choose not to believe me then no skin off my nose :) My point is just that both sides will distort and to think otherwise makes you blind.\n\n I suppose that we are both limited in the time we are willing to spend to dig things up. We will just have to leave this point of arguement as unresolved.\n \n While both sides have flamers...pro-lifers are they only ones that need to worry at a college campus. I don't recall ever hearing such hatred from one side of the fense....it is different in other places it seems.\n\n I would think that the reprecussions of public debate that either a pro-life or a pro-choice group would face in a university would depend on the political demographics of that University. Most Eastern universities end up being left-of-center, in which case the pro-life groups might face more harrassment than the pro-choice groups. Those attending universities in the South and Mid-West would probably be much harsher on the pro-choice groups.\n \nPerhaps if it is talked about. If your family doesn't talk about that kinda stuff then you probably would default it to being \"right\" based upon the law. I doubt many families have discussions about abortion all the time. I know mine didn't.\n\n My folks didn't talk about it but neither were they strongly religious. Their political leanings, apart from their strong anti-communism, were generally left-of-center which I'm sure shaped my own political leanings. I would expect that people who grow up in strongly religious communities would feel strong societal pressure against getting an abortion despite it being legal.\n \nI also thank you for providing a civil discussion as some are not doing so in this thread :(\n\n I always think that civil discussions are the only ones that ever have a chance of accomplishing anything. Even where people disagree, as when you and I disagree about when the mind can first start to exist, civil discussions often reveal that the assumptions we might first make about our opponents might be wrong. There are good people on both sides, as well as selfish and unthinking people on both sides. Though I highly doubt that pro-choice and pro-life sides will ever reach a good compromise, at least with our current technologies, a lot can be gained by just understanding where the other side is coming from.", 
   {}, 
   224283, 
   null, 
   1153758780.0
  ], 
  [
   224319, 
   null, 
   "happygrl35", 
   "Your comment does give us a unique insight into your worldview (naturalism/relativism?) as well as some of its conclusions: \n 1. That human life does not have any absolute inherent meaning, value, or dignity within itself. \n \n 2. That the value of human life is relative and that it is determined by people like yourself.\n\n I was just curious why you believe human life has inherent value?", 
   {}, 
   224226, 
   null, 
   1153763160.0
  ], 
  [
   224320, 
   null, 
   "happygrl35", 
   "Also, on the idea that women are at higher risk for certain things after an abortion. A study that came out Jan 2006 suggests that women are at higher risks for drug and alcohol dependence, depression, and other things of that nature. This was the longest running study on the issue to date.\n \n For information about this study please search the forums as we had a long debate about it.\n\n These studies commit the fallacy of \"false cause\"", 
   {}, 
   224284, 
   null, 
   1153763340.0
  ], 
  [
   224324, 
   null, 
   "thelmoose", 
   "These studies commit the fallacy of \"false cause\"\n\n \n \n I disagree.\n I read the entire study. While assigning causation is always the most difficult things to establish, and, of course the authors were well aware of this difficulty, after adjusting for all confounders there is a strong relationship, suggestive of causation. It is not clear. The authors freely admitted that the young women (this was looking at women ages 15-25 only, with the youngest women the most affected) who were had the abortions had clearly different socioeconomic bcakgrounds that could explain the mental health problems, but those are the women that had the abortions. \n \n Thanks for that reference, Steeve.", 
   {}, 
   224320, 
   null, 
   1153764960.0
  ], 
  [
   224334, 
   null, 
   "happygrl35", 
   "I disagree.\n I read the entire study. While assigning causation is always the most difficult things to establish, and, of course the authors were well aware of this difficulty, after adjusting for all confounders there is a strong relationship, suggestive of causation. It is not clear. The authors freely admitted that the young women (this was looking at women ages 15-25 only, with the youngest women the most affected) who were had the abortions had clearly different socioeconomic bcakgrounds that could explain the mental health problems, but those are the women that had the abortions. \n \n Thanks for that reference, Steeve.\n\n I still don't agree,the study is flawed.And here is why.\nUnder the 1977 Contraception, Sterilisation and Abortion Act every abortion requires two \"certifying consultants\" to approve it on certain grounds, usually that a woman's mental health would be endangered by continuing with the pregnancy. \n \n Of the 18,211 abortions performed in New Zealand in 2004, about 98 per cent were carried out for this reason. \n \nYou won't get the same results in the US because we don't have to prove mental illness to get an abortion.The control group for the study didn't have abortions.Seems to me the reason that a person would consider abortion would also cause depression and so forth not necessarily the abortion itself.Seeing that you have to prove mental illnes to get an abortion in NZ means that women who get abortion in NZ are mentally ill.", 
   {}, 
   224324, 
   null, 
   1153767900.0
  ], 
  [
   224338, 
   null, 
   "happygrl35", 
   "Here is another possible reason WHY young women who get abortions experience more mental health problems .\nFor women with induced abortion, doubt about the decision to abort was related to depression at T2 (p <0.05), while a negative attitude towards induced abortion was associated with anxiety at T2 (p <0.05) and T4 (p <0.05). CONCLUSION: Correlates of anxiety and depression may be used to better identify women who are at risk of negative psychological responses following pregnancy termination.\n \nSocial stigma,and religious beliefs can actually CAUSE depression and so forth in people who do abort.Although I still don't think is the case in the NZ study.http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=PubMed&list_uids=8122509&dopt=Abstract", 
   {}, 
   224334, 
   null, 
   1153769160.0
  ], 
  [
   224339, 
   null, 
   "Steeeeve", 
   "I suppose that we are both limited in the time we are willing to spend to dig things up. We will just have to leave this point of arguement as unresolved.\n Obviously....we both probably hate stating things over and over again.\n \n \n\n I would think that the reprecussions of public debate that either a pro-life or a pro-choice group would face in a university would depend on the political demographics of that University. Most Eastern universities end up being left-of-center, in which case the pro-life groups might face more harrassment than the pro-choice groups. Those attending universities in the South and Mid-West would probably be much harsher on the pro-choice groups.\n Who knows :) That age group tends to be a more liberal anyway.\n \n \nMy folks didn't talk about it but neither were they strongly religious. Their political leanings, apart from their strong anti-communism, were generally left-of-center which I'm sure shaped my own political leanings. I would expect that people who grow up in strongly religious communities would feel strong societal pressure against getting an abortion despite it being legal.\n Yeah, I have a weird view I guess. I grew up in a religious family (not overly religious I might add) yet I was pro-choice up until I went on to college (a few years into college). Too much time to think I suppose :p\n \n \n\n I always think that civil discussions are the only ones that ever have a chance of accomplishing anything. Even where people disagree, as when you and I disagree about when the mind can first start to exist, civil discussions often reveal that the assumptions we might first make about our opponents might be wrong. There are good people on both sides, as well as selfish and unthinking people on both sides. Though I highly doubt that pro-choice and pro-life sides will ever reach a good compromise, at least with our current technologies, a lot can be gained by just understanding where the other side is coming from.\nI tend to fight dirty back sometimes though and it is hard to remember that this is just a forum and putting the other person down doesn't really do anything but make you look like an idiot haha.\n \n \n \nI still don't agree,the study is flawed.And here is why.\n \n\n Under the 1977 Contraception, Sterilisation and Abortion Act every abortion requires two \"certifying consultants\" to approve it on certain grounds, usually that a woman's mental health would be endangered by continuing with the pregnancy.\n \n Of the 18,211 abortions performed in New Zealand in 2004, about 98 per cent were carried out for this reason. \n\n You won't get the same results in the US because we don't have to prove mental illness to get an abortion.The control group for the study didn't have abortions.Seems to me the reason that a person would consider abortion would also cause depression and so forth not necessarily the abortion itself.Seeing that you have to prove mental illnes to get an abortion in NZ means that women who get abortion in NZ are mentally ill.\n\n \n Can you post a link of where you got this from so I can see it in context. And can you show me why it relates to the study?", 
   {}, 
   224307, 
   null, 
   1153770180.0
  ], 
  [
   224347, 
   null, 
   "thelmoose", 
   "I still don't agree,the study is flawed.And here is why.\n \n\n Under the 1977 Contraception, Sterilisation and Abortion Act every abortion requires two \"certifying consultants\" to approve it on certain grounds, usually that a woman's mental health would be endangered by continuing with the pregnancy. \n \n Of the 18,211 abortions performed in New Zealand in 2004, about 98 per cent were carried out for this reason. \n \n \nYou won't get the same results in the US because we don't have to prove mental illness to get an abortion.The control group for the study didn't have abortions.Seems to me the reason that a person would consider abortion would also cause depression and so forth not necessarily the abortion itself.Seeing that you have to prove mental illnes to get an abortion in NZ means that women who get abortion in NZ are mentally ill.\n\n \n You have a very good point there. I missed that. The authors state that they corrected for all the socioeconomics differences between the two groups. However, this could suggest that the women in the abortion group are selected specifically for pre-existing mental illness.\n \n I know in the past, when abortion has been illegal, the wealthy could always get a physician to declare that the woman was \"psychiatrically unfit\" for pregnancy, hence a medical reason for abortion would be deemed necessary. I wonder how rigorous the NZ evaluation is. It may not be a factor, but I am suprised that that authors didn't even mention it.", 
   {}, 
   224334, 
   null, 
   1153772820.0
  ], 
  [
   224558, 
   null, 
   "Another opinion", 
   " Yeah, I have a weird view I guess. I grew up in a religious family (not overly religious I might add) yet I was pro-choice up until I went on to college (a few years into college). Too much time to think I suppose :p\n\n From curiosity, if you would be willing to say, what in particular was it that changed your mind from pro-choice to pro-life?\n \nI tend to fight dirty back sometimes though and it is hard to remember that this is just a forum and putting the other person down doesn't really do anything but make you look like an idiot haha.\n\n Dealing with flamers on either side can be a hard thing to handle. If I encounter a flamer whose post contains no point worth discussing, then I will generally ignore them (it is no fun on their side if no one is responding). However, sometimes a flamer might have a valid or interesting point hidden within otherwise beligerent irrationality. Then, it can be worth continuing the discussion but it really does try one's patience to refrain from responding back in a nasty way, and every so often I also lose my patience and respond back. My general hope is that the flamer will calm down enough to present a more well thought-out version of their opinions. Then, the real communication starts to happen.", 
   {}, 
   224339, 
   null, 
   1153858980.0
  ], 
  [
   224828, 
   null, 
   "sinjin", 
   "...I was pro-choice up until I went on to college (a few years into college).\n\n Were you \"saved/born again\" in college Steeeeeeve or what?", 
   {}, 
   224339, 
   null, 
   1153951260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Debate a signal of prochoice confusion and breakdown?", 
  "url": "http://www.4forums.com/political/abortion-debates/8544-debate-signal-prochoice-confusion-breakdown.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 8544, 
  "discussion_files": [
   [
    "7184.html", 
    "http://www.4forums.com/political/abortion-debates/8544-debate-signal-prochoice-confusion-breakdown-print.html"
   ], 
   [
    "7185.html", 
    "http://www.4forums.com/political/abortion-debates/8544-debate-signal-prochoice-confusion-breakdown-4-print.html"
   ], 
   [
    "7186.html", 
    "http://www.4forums.com/political/abortion-debates/8544-debate-signal-prochoice-confusion-breakdown-3-print.html"
   ], 
   [
    "7187.html", 
    "http://www.4forums.com/political/abortion-debates/8544-debate-signal-prochoice-confusion-breakdown-2-print.html"
   ]
  ], 
  "identifier": 8544
 }
]