[
 [
  [
   224014, 
   null, 
   "simone", 
   "Bush has done well in his mission to destroy America:\n \n http://www.nytimes.com/2006/07/21/nyregion/21cnd-power.html\n \n July 21, 2006\n Blackout in Queens Affects Many More Than Estimated \n By MARIA NEWMAN\n The number of people who have been without power in Queens for five days now is actually closer to 100,000, not the figure of 2,000 customers that officials of Consolidated Edison had cited in previous days.\n \n At a press conference in Queens, Mayor Michael R. Bloomberg called the discrepancy annoying, and said that Con Edison apparently based its earlier count on the number of customers who complained to the utility company that they had no power, and not on any systematic assessment of the power outage.\n \n \"I think what is annoying is that their first estimate was done based on phone calls,\" the mayor said, saying he should have directed them earlier just to drive around the area to get an actual count of the number of people whose power was out.\n \n The mayor said some customers may not get power back until Sunday, and that Con Edison workers are trying to at least get traffic lights working by rush hour this evening.\n \n His acknowledgment that the power problem was actually much larger than anyone had thought explains some of the anger and frustration heard in sections of Queens, where the system began to fail on Monday, the third day of a severe heat wave. The problem was probably aggravated by thunderstorms on Tuesday that also blew out power to thousands of other customers in the region.\n \n As businesses were complaining of spoiled food and lost revenue, and police officers had to direct traffic at dozens of intersections where traffic lights were not working, several elected officials today called for a criminal investigation into how Con Edison has handled the problem.\n \n \"Not only did they drop the ball when the power went out, they've been absolutely reckless over the last four days in leveling with the public,'' said Councilman Eric Gioia of Queens. \"We've got to get to the bottom of this.''\n \n But the mayor, at a news conference with a number of other leading city officials who are helping people cope with the situation, said he was not interested in accusing Con Edison of mismanaging the problem. Instead, he said, he wanted to make sure power was restored quickly.\n \n \"It did not change the number of people who did not have service,\" he said. \"Rather than point fingers at Con Ed and vilify all of the people who work for them, I want all of their employees to just continue to work as hard as they can until we get everybody back up.\"\n \n The mayor said some 250 Con Edison crews would be out working today to restore power. But their job was complicated by heavy rain showers that fell off and on during the day. \n \n Residents of 28th Street in Astoria, across from a Con Edison plant, were trying to bail out their basements, which flooded from rain that began last night, at a time when the building has only limited power.\n \n \"It's really disgusting,'' said Lila Stathis, 75, who had just paid someone $463 to pump out her basement because she has power to only one outlet in her home. \"I mean, how many days we have no air? And I'm right across from the Con Edison plant. It really makes you angry.''\n \n A spokesman for Con Edison said crews would be working throughout the night to try to restore power to as many customers as possible.\n \n \"We totally understand people's frustrations,\" Michael Clendenin, a Con Ed spokesman, told NY1 News today. \"Right now we're conducting a full assessment of why this happened. Meanwhile, our focus is completely on restoration.\"\n \n His words may have been small consolation to the thousands of customers in western Queens who have received no definitive word yet on when they would get power back, or why their particular neighborhoods were most affected. \n \n \"I think we were not being told the truth,\" said Catherine Volpe, who lives on the 12th floor of the Berkeley Towers in Sunnyside, Queens, where power was restored on Thursday, although residents say the supply is so weak that they cannot use air conditioners or other high-drawing appliances.\n \n \"I welcome the investigation,\" she said. \"I think we were actually lied to.\"\n \n Con Edison also said it will be surveying the area that includes Long Island City, Sunnyside, Woodside, Hunters Point, and Astoria to better identify each block and home or business without power. It urged customers with power to leave a lamp switched on overnight until full power is restored to the area, to help crews see which homes have service as they work through the night.Con Edison also said today that 35,000 customers in Westchester County - not the 25,000 reported earlier - lost power after Tuesday's storm. About 6,000 were still out on Friday morning.\n \n Even the new estimate of 100,000 people being affected by the power problems may not be so accurate, the mayor acknowledged today, when he explained how Con Edison and he arrived at that number. . . .", 
   {
    "post_info": {
     "post_title": "American Infrastructure Kaput!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1153586820.0
  ], 
  [
   224015, 
   null, 
   "simone", 
   "http://www.chron.com/disp/story.mpl/ap/nation/4062251.html\n \n July 20, 2006, 11:50PM\n Guard to St. Louis; heat deaths rise\n \n \n By CHERYL WITTENAUER Associated Press Writer \n © 2006 The Associated Press \n \n ST. LOUIS - The governor sent in the National Guard to evacuate people from their sweltering homes Thursday after storms knocked out power to more than half a million St. Louis-area households and businesses in the middle of a deadly heat wave.\n \n Utility crews raced to restore electricity, and Gov. Matt Blunt declared a state of emergency, granting the mayor's request to send in nearly 300 troops to take people to air-conditioned public buildings and to clear debris.\n \n \"We can't overemphasize the danger of this heat,\" Mayor Francis Slay said. \"The longer the heat goes on and the power is out, the riskier it is.\"\n \n The heat has contributed to at least 20 deaths across the country in the last week.\n \n Police used public-address speakers from their squad cars to announce locations of the community centers and other places designated as cooling centers. Volunteers went door to door, checking on people with no power to run fans or air conditioners.\n \n Utility workers urged customers to find a cool place to stay. They warned that power could be out in some areas for three to five days.\n \n The day's high was 97 degrees, but the humidity made it feel like 111. The region could get some relief on Friday, when the high was expected to drop to the mid-80s.\n \n The storms tore through the city a day earlier, ripping off a section of airport roof and dumping it on a highway. Windows were blown out of a hotel restaurant and a press box at baseball's Busch Stadium. At least three buildings collapsed, and more than 30 people were injured.\n \n \"I've never seen this many people without power, this much debris, buildings collapsed, lines down,\" the mayor said.\n \n By Thursday evening, power had been restored to 160,000 customers, but new reports of outages kept coming in.\n \n St. Louis-based AmerenUE, the utility serving Missouri and Illinois, said it would restore power to hospitals, nursing homes, water-treatment plants and other \"critical facilities\" first.\n \n \"If you're out of power, go to family, a friend or a cooling shelter,\" Vice President Richard Mark said. \"Take whatever means necessary, but stay out of your home.\"\n \n City Health Director William Kincaid cautioned that the city's older housing, much of it made of red brick, can heat up like furnaces in the summer heat.\n \n \"It could be a very dangerous day,\" Police Chief Joe Mokwa said.\n \n John Swapshire, 39, grabbed the next-to-last window fan at a hardware store for $14.99. The electricity at his home was out, but he had a gas-powered generator.\n \n \"I had to go to six stores to get this. They were either closed because of the electricity or sold out,\" Swapshire said. \"I don't think you can buy a cube of ice in all of St. Louis, either.\"\n \n Stanley Shelton, 53, found a cool spot under a tree in a downtown park where piles of broken limbs and branches covered the grass.\n \n \"I've never experienced anything like this. I don't know anyone with power,\" Shelton said. \"I'll just sit in my yard with a big jug of water and wait for it to pass. Maybe I'll take a couple cold showers. That works too.\"\n \n The death toll from the heat wave that has gripped much of the country for the past week rose to at least 20 people in seven states. Four more people died in the Chicago area, bringing the total number there to seven, officials said. Two have died in the Philadelphia area, two in Oklahoma City, two in Arkansas, two in Indiana and one each in South Dakota and Tennessee.\n \n In St. Louis, officials reported the death of a 93-year-old woman who had air conditioning but no power. In Indiana, a 25-year-old woman taking medications that might have affected her body's ability to stay cool died from heat exposure when temperatures inside her apartment reached 100 degrees, officials said Thursday.\n \n Also Thursday, authorities in Kansas confirmed that two men in their 60s died from the heat. One was homeless and died in a Witchita park. The other did not have air conditioning.\n \n In Wisconsin, a 6-year-old girl was killed Thursday when storms knocked part of a tree onto a tent at a park.\n \n The storms also brought heavy rain, hail and 80 mph winds to Illinois on Wednesday night. Roughly 79,000 homes and businesses remained without power Thursday, but the weather was cooler in the central and northern parts of the state, with temperatures in the upper 70s or lower 80s.\n \n Three people were injured in St. Louis when a residential building collapsed in a neighborhood south of downtown, police said. The historic Switzer building near the Mississippi River, once home to the famous licorice maker, also partially collapsed.\n \n Many of the injuries were to baseball fans waiting for a St. Louis Cardinals-Atlanta Braves game. Winds blowing at nearly 80 mph blew out press box windows and ripped the tarp, injuring at least 30 people, five of whom were taken to hospitals, said Norm Corley, a supervisor with Accu-Care, which handles medical problems at the stadium.", 
   {
    "unicode_changes_made": true
   }, 
   224014, 
   null, 
   1153586940.0
  ], 
  [
   224016, 
   null, 
   "simone", 
   "We have an antiquated power grid structure in this country which desperately needs to be redesigned. No chance of that happening while get-rich-quick Bush heads the nation. He's too busy filling the pockets of his friends.", 
   {}, 
   224015, 
   null, 
   1153587120.0
  ], 
  [
   224036, 
   null, 
   "georged", 
   "We have an antiquated power grid structure in this country which desperately needs to be redesigned. No chance of that happening while get-rich-quick Bush heads the nation. He's too busy filling the pockets of his friends.\n\n \n US infrastructure is a low priority when a country is struggling to service debt while military spending is more than the combined military spending of the next twenty-three nations.\n \n Besides, US citizens are so overweight air conditioning to cool that fat is now considered a necessity, not a luxury.", 
   {}, 
   224016, 
   null, 
   1153602540.0
  ], 
  [
   224135, 
   null, 
   "simone", 
   "And we get diddly squat for all our military spending.\n \n Soldiers are not outfitted properly, war planning is pitiful, soldiers are treated like dog poop when they return from the field missing limbs, psyches, and coming home to joblessness.\n \n This is the most wastrel, scoundrelly administration I have ever seen--and to think I used to think Warren Harding was bad.", 
   {}, 
   224036, 
   null, 
   1153673160.0
  ], 
  [
   224194, 
   null, 
   "georged", 
   "And we get diddly squat for all our military spending.\n \n Soldiers are not outfitted properly, war planning is pitiful, soldiers are treated like dog poop when they return from the field missing limbs, psyches, and coming home to joblessness.\n \n This is the most wastrel, scoundrelly administration I have ever seen--and to think I used to think Warren Harding was bad.\n\n \n I'll be greatly surprised if historical analysis doesn't note current administration policies as some of the most self-serving and detrimental to the country in US history.", 
   {}, 
   224135, 
   null, 
   1153698960.0
  ], 
  [
   224296, 
   null, 
   "Steeeeve", 
   "This thread is funny....I didn't realize George W. Bush had control over the weather and over the wiring in New York. Is the president responsible for your breakfast being cold as well?", 
   {}, 
   224194, 
   null, 
   1153755780.0
  ], 
  [
   224335, 
   null, 
   "Dono", 
   "This thread is funny....I didn't realize George W. Bush had control over the weather and over the wiring in New York. Is the president responsible for your breakfast being cold as well?\n\n Yes. While reading a story about him groping the Chancellor of Germany, my toast got cold.", 
   {}, 
   224296, 
   null, 
   1153768380.0
  ], 
  [
   224384, 
   null, 
   "jyoshu", 
   "Simone, come on. Is there ANYTHING you won't blame on Bush?\n \n What's next, earthquakes? Sun flares? \n \n I think it's safe to say that Bush is not to blame for the blackout in Queens.", 
   {}, 
   224335, 
   null, 
   1153783980.0
  ], 
  [
   224400, 
   null, 
   "Waxy", 
   "I can't believe I'm actually about to agree with Steeeeve and Jyoshu on something, but simone, come on, blaming this on Bush is ridiculous.\n \n Waxy\n \n P.S. Dono - good one LOL. The \"highlights\" of that press conference on The Daily Show were the hardest I've laughed in a long time.", 
   {}, 
   224384, 
   null, 
   1153787100.0
  ], 
  [
   224407, 
   null, 
   "lord tammerlain", 
   "I can't believe I'm actually about to agree with Steeeeve and Jyoshu on something, but simone, come on, blaming this on Bush is ridiculous.\n \n Waxy\n \n P.S. Dono - good one LOL. The \"highlights\" of that press conference on The Daily Show were the hardest I've laughed in a long time.\n\n \n \n A certain level of blame would go to the Bush admin. Not for the specific incidents of course but the lack of direction the federal/state governments in the US has placed on such infrustructure. After the massive blackouts that occured in 2002? across the eastern US/Canada, a smart proactive government would have made it a priority to ensure that such important civilian infrustructure was updated and modernized. Simple changes to the tax policy could have accomplished much ( ie full write off for infrustructure investments)", 
   {}, 
   224400, 
   null, 
   1153795980.0
  ], 
  [
   224438, 
   null, 
   "Waxy", 
   "A certain level of blame would go to the Bush admin. Not for the specific incidents of course but the lack of direction the federal/state governments in the US has placed on such infrustructure. After the massive blackouts that occured in 2002? across the eastern US/Canada, a smart proactive government would have made it a priority to ensure that such important civilian infrustructure was updated and modernized. Simple changes to the tax policy could have accomplished much ( ie full write off for infrustructure investments)\n\n \n Do you really think anything would be different with Kerry? Or ANYONE else?\n \n IMHO, this starts at local and state gov't level, not a federal level.\n \n Besides a \"smart proactive gov't\" is an oxymoron. :p\n \n Waxy", 
   {}, 
   224407, 
   null, 
   1153808340.0
  ], 
  [
   224490, 
   null, 
   "simone", 
   "Simone, come on. Is there ANYTHING you won't blame on Bush?\n \n What's next, earthquakes? Sun flares? \n \n I think it's safe to say that Bush is not to blame for the blackout in Queens.\nUm, the power grid in Queens. No maintenance, upkeep because warfare is more important?\n \n Are you enjoying the Wargasm, Jyoshu. Do you get your jollies?", 
   {}, 
   224384, 
   null, 
   1153844520.0
  ], 
  [
   224532, 
   null, 
   "Steeeeve", 
   "I can't believe I'm actually about to agree with Steeeeve and Jyoshu on something, but simone, come on, blaming this on Bush is ridiculous.\n \n Waxy\n \n P.S. Dono - good one LOL. The \"highlights\" of that press conference on The Daily Show were the hardest I've laughed in a long time.\n\n \n emoticon_xdonno I thought the ground was getting a little cold :p\n \n Yeah, infrastructure shouldn't be a main federal issue anyway. A state is better off handling this kinds of things and to blame this on the Bush administration just shows the inability to think reasonably about things.", 
   {}, 
   224400, 
   null, 
   1153855260.0
  ], 
  [
   224550, 
   null, 
   "lord tammerlain", 
   "Do you really think anything would be different with Kerry? Or ANYONE else?\n \n IMHO, this starts at local and state gov't level, not a federal level.\n \n Besides a \"smart proactive gov't\" is an oxymoron. :p\n \n Waxy\n\n \n While I could not say if Kerry would be any different, but there would be a few that would be. Examples of past intelligent politicians do exist. From the ones that decided to build the Hoover Dam, the Interstate highway system among others.\n \n I would actually consider a smart proactive government to be less of an oxymoron then most, China for instance, is certainly proactive, and has led China to a rather massive economic boom", 
   {}, 
   224438, 
   null, 
   1153857660.0
  ], 
  [
   224591, 
   null, 
   "georged", 
   "Do you really think anything would be different with Kerry? Or ANYONE else?\n \n IMHO, this starts at local and state gov't level, not a federal level.\n \n Besides a \"smart proactive gov't\" is an oxymoron. :p\n \n Waxy\n\n \n It should be a state issue. Most states are so poorly managed that raising private capital for infrastructure improvement without regulated utilities would be a difficult, if not impossible task. Most states effectively deregulated their utilities when energy industry affiliated politicians convinced dumb as rocks voters they'd pay less for their utilities with deregulation. That pretty well eliminates private industry furnishing the capital, even with acceptable tax relief to drive yield. \n \n For a state to fund infrastructure with tax revenue is even more daunting. Few politicians in today's economic climate are willing to risk supporting additional taxation to dedicate a revenue stream for something as vast and nebulous as infrastructure improvements. Thanks to our totally disastrous foreign policy, federal revenue sharing with states has dried up to a point where the feds are now selling public land under the guise of funding rural schools. \n \n What we've spent on Iraq and the resulting increase in interest rates to peddle enough bonds to service our abnormal debt would go a long way in solving a lot of infrastructure and other problems, but hey, this is the US, where our sole concerns are spreading democracy at the point of a gun, closing our borders and attempting to mix belief system morality into government legislation. What we need is an excuse to blame our failing infrastructure on terrorists, illegal immigrants or atheists and current administration would immediately raise taxes or borrow money to update them.", 
   {}, 
   224438, 
   null, 
   1153864200.0
  ], 
  [
   224598, 
   null, 
   "Dono", 
   "Most states do not have the luxury of operating on unlimited borrowed money as the national gov has. Thankfully, balanced budgets are required .... a concept long lost in D.C.. With the inflow of federal money drying up and costs rising, the states are having trouble funding infrastructure. There is a flap going on now in my state about lowering pollution standards so that cheaper operating, cheaper to build coal power generators can be built. \n Dono", 
   {}, 
   224591, 
   null, 
   1153865760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  American Infrastructure Kaput!", 
  "url": "http://www.4forums.com/political/politics-debates/8552-american-infrastructure-kaput.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 8552, 
  "discussion_files": [
   [
    "3355.html", 
    "http://www.4forums.com/political/politics-debates/8552-american-infrastructure-kaput-print.html"
   ], 
   [
    "3356.html", 
    "http://www.4forums.com/political/politics-debates/8552-american-infrastructure-kaput-2-print.html"
   ]
  ], 
  "identifier": 8552
 }
]