[
 [
  [
   224133, 
   null, 
   "simone", 
   "Get this, the Bush administration blabs:\n \n http://www.nytimes.com/2006/07/23/washington/23diplo.html\n \n \nJuly 23, 2006\n U.S. Plan Seeks to Wedge Syria From Iran \n By HELENE COOPER and DAVID E. SANGER\n WASHINGTON, July 22 - As Secretary of State Condoleezza Rice heads to Israel on Sunday, Bush administration officials say they recognize Syria is central to any plans to resolve the crisis in the Middle East, and they are seeking ways to peel Syria away from its alliance of convenience with Iran.\n \n In interviews, senior administration officials said they had no plans right now to resume direct talks with the Syrian government. President Bush recalled his ambassador to Syria, Margaret Scobey, after the assassination of Rafik Hariri, a former Lebanese prime minister, in February 2005. Since then, America's contacts with Damascus have been few, and the administration has imposed an array of sanctions on Syria's government and banks, and frozen the assets of Syrian officials implicated in Mr. Hariri's killing.\n \n But officials said this week that they were at the beginning stages of a plan to encourage Saudi Arabia and Egypt to make the case to the Syrians that they must turn against Hezbollah. With the crisis at such a pivotal stage, officials who are involved in the delicate negotiations to end it agreed to speak about their expectations only if they were not quoted by name.\n \n \"We think that the Syrians will listen to their Arab neighbors on this rather than us,'' a senior official said, \"so it's all a question of how well that can be orchestrated.'' . . .\nFrankly, if I were engaged in this sort of negotiation I would not want to broadcast what I'm doing to Iran. Do Bush and his people think that the Iranian leaders don't read the newspapers and follow what's going on in the world?\n \n Just because Bush is a demned nincompoop and could care less about what's happening in the world does not mean other leaders are as stupid and incurious as he is.\n \n I think this is a public relations ploy to make American people think that Bush might actually be doing something about the situation in the Middle East besides sitting on his hands and having his friends make big bucks in the munititions industry.\n \n And, six months or a year from now some newspaper will mention that this was happening and Bush's people will scream bloody murder that the press is revealing state secrets, is traitorous, blah blah blah!", 
   {
    "post_info": {
     "post_title": "Hooboy! I Can See It All Unfolding"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1153672860.0
  ], 
  [
   231706, 
   null, 
   "Merlin", 
   "The best way to drive a wedge between Syria and Iran and stop Syria Arming Hezbolhah is to return the Golan Heights to Syria and then the Chebba Farms to Lebanon. Of course there would have to a transistional international force put in place before the hand over. In fact it is the only way for America to develop better relations with Syria.", 
   {}, 
   224133, 
   null, 
   1158858180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hooboy! I Can See It All Unfolding", 
  "url": "http://www.4forums.com/political/peace-middle-east/8558-hooboy-i-can-see-all-unfolding.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 8558, 
  "discussion_files": [
   [
    "6907.html", 
    "http://www.4forums.com/political/peace-middle-east/8558-hooboy-i-can-see-all-unfolding-print.html"
   ]
  ], 
  "identifier": 8558
 }
]