[
 [
  [
   224632, 
   null, 
   "lunchmoney", 
   "I have a question to pose to the public for consumption.\n \n What defines us as human as apposed to a really smart animal?", 
   {
    "post_info": {
     "post_title": "what defines us as human"
    }
   }, 
   null, 
   null, 
   1153870800.0
  ], 
  [
   224642, 
   null, 
   "electrolyte", 
   "I have a question to pose to the public for consumption.\n \n What defines us as human as apposed to a really smart animal?\n\n I have an answer: A human simply is a really smart animal; however, I must admit that some humans are smarter than others...", 
   {}, 
   224632, 
   null, 
   1153873920.0
  ], 
  [
   224734, 
   null, 
   "simone", 
   "We are human because we define ourselves as human.", 
   {}, 
   224642, 
   null, 
   1153930860.0
  ], 
  [
   224738, 
   null, 
   "Kronus", 
   "I have a question to pose to the public for consumption.\n \n What defines us as human as apposed to a really smart animal?\n\n \n Well, we are animals (as opposed to plants or bacteria) and we are really smart, for some definitions of smart, so I don't see that as a bad starting definition. You just need to fine tune what you mean by smart.", 
   {}, 
   224632, 
   null, 
   1153932360.0
  ], 
  [
   224739, 
   null, 
   "Steeeeve", 
   "considering we created and defined words...the word human is defined as follows:\n \n \nn.\n \n 1. A member of the genus Homo and especially of the species H. sapiens.\n 2. A person: the extraordinary humans who explored Antarctica.\n \n \n adj.\n \n 1. Of, relating to, or characteristic of humans: the course of human events; the human race.\n 2. Having or showing those positive aspects of nature and character regarded as distinguishing humans from other animals: an act of human kindness.\n 3. Subject to or indicative of the weaknesses, imperfections, and fragility associated with humans: a mistake that shows he's only human; human frailty.\n 4. Having the form of a human.\n 5. Made up of humans: formed a human bridge across the ice.\n\n \n The is no reason to start changing defintions now.", 
   {}, 
   224738, 
   null, 
   1153932480.0
  ], 
  [
   224742, 
   null, 
   "Kronus", 
   "considering we created and defined words...the word human is defined as follows:\n \n A member of the genus Homo and especially of the species H. sapiens.\n \n The is no reason to start changing defintions now.\n\n \n So you're saying that humans are nothing more than genetics? Our passions, dreams, accomplishments, souls, triumphs and tragedies mean nothing with regards to what we are? We're just DNA and biochemistry?", 
   {}, 
   224739, 
   null, 
   1153933140.0
  ], 
  [
   224862, 
   null, 
   "Ooaman", 
   "1. A member of the genus Homo and especially of the species H. sapiens.\n\n Homo=same\n sapiens=monkey\n \n \n Therefor, humans are the same monkey.\n \n I believe some really old humans were called Homo Erectus\n Homo=Same\n Erectus=Sticking up straight.\n \n They were the same sticking up.", 
   {}, 
   224742, 
   null, 
   1153967040.0
  ], 
  [
   224863, 
   null, 
   "Ooaman", 
   "So you're saying that humans are nothing more than genetics? Our passions, dreams, accomplishments, souls, triumphs and tragedies mean nothing with regards to what we are? We're just DNA and biochemistry?\n\n I believe the original question ask what defines a human, not what defines a person.", 
   {}, 
   224742, 
   null, 
   1153967160.0
  ], 
  [
   224883, 
   null, 
   "electrolyte", 
   "So you're saying that humans are nothing more than genetics? Our passions, dreams, accomplishments, souls, triumphs and tragedies mean nothing with regards to what we are? We're just DNA and biochemistry?\n\n All life is just biochemistry, in my view. \"Human\" is a consequence of the Biological Species Concept.\n \n \nHomo=same\n sapiens=monkey\n\n Homo = man\n sapiens = wise\n (Homo sapiens = oxymoron?)", 
   {}, 
   224742, 
   null, 
   1153976760.0
  ], 
  [
   224886, 
   null, 
   "Ooaman", 
   "Homo = man\n sapiens = wise\n (Homo sapiens = oxymoron?)\n\n Would Wise Guy count also?", 
   {}, 
   224883, 
   null, 
   1153979940.0
  ], 
  [
   224914, 
   null, 
   "electrolyte", 
   "Would Wise Guy count also?\n\n \"'Wise guy,' eh?\" *pokes you in the eyeballs*", 
   {}, 
   224886, 
   null, 
   1153984920.0
  ], 
  [
   224961, 
   null, 
   "Kronus", 
   "I believe the original question ask what defines a human, not what defines a person.\n\n \n \"What defines us as human as apposed to a really smart animal\"\n \n One could argue that what sets us apart is the scope of our dreams and ambitions, our desires, our motivations. Animals are content to simply survive day to day. Eat, sleep, procreate. Animals, to the best of my knowledge, don't yearn for \"bigger and better\" the way humans do. We create for the sake of creating, we climb mountains \"because they're there\". We do things with no survival value, or even negative survival value, just for the sake of doing them.", 
   {}, 
   224863, 
   null, 
   1154022300.0
  ], 
  [
   224966, 
   null, 
   "Ooaman", 
   "We do things with no survival value, or even negative survival value, just for the sake of doing them.\n\n One thing about survival I wanted to point out that separates humans from the other animals is that the only survival we care about is our own. We don't want to die. For other animals, it's the survival of their species. It doesn't matter if they live or die as long as the species continues. But with approx. 6.5 billion people in the world (or something along those lines) we don't need to (at the moment) worry about survival of the species.", 
   {}, 
   224961, 
   null, 
   1154023440.0
  ], 
  [
   224969, 
   null, 
   "Kronus", 
   "One thing about survival I wanted to point out that separates humans from the other animals is that the only survival we care about is our own. We don't want to die. For other animals, it's the survival of their species.\n\n \n That's not true at all. People often sacrifice their lives to help loved ones. A parent will starve so that their child can eat, or a man will push his wife out of the way of a truck, only to get hit himself. Conversely, a male polar bear will kill any cubs that aren't his, so that the mother will come back into heat so that he can breed with her. The way individuals of a species deal with personal desires vs what's good for the species varies widely from species to species; humans don't have a unique position on that scale.", 
   {}, 
   224966, 
   null, 
   1154024040.0
  ], 
  [
   224978, 
   null, 
   "Ooaman", 
   "That's not true at all. People often sacrifice their lives to help loved ones. A parent will starve so that their child can eat, or a man will push his wife out of the way of a truck, only to get hit himself.\n\n Okay, I view \"human\" and \"people/person\" in a different context. I view \"human\" as the species and \"people\" or \"Person\" as the individual(s). It is the individual who makes the conscious decision on issues.\n It has a different conotacion to say that we are all human and for someone else to say we are all people. The people in your example (the parent, the husband with a truck coming near his wife) are individuals. It's natural for humans to insure their own survival. A person can individually decide to sacrifice themselves.", 
   {}, 
   224969, 
   null, 
   1154027940.0
  ], 
  [
   224986, 
   null, 
   "Kronus", 
   "Okay, I view \"human\" and \"people/person\" in a different context. I view \"human\" as the species and \"people\" or \"Person\" as the individual(s). \n\n So what's the difference, if any, between \"humans\" and \"all people\"? It's the same, isn't it? The human species is simply a collection of individual people.\n \n \n\n It is the individual who makes the conscious decision on issues.\n It has a different conotacion to say that we are all human and for someone else to say we are all people. The people in your example (the parent, the husband with a truck coming near his wife) are individuals. It's natural for humans to insure their own survival. A person can individually decide to sacrifice themselves.\n\n \n Well, when you're talking about death or decision making you have to talk about individuals. All individuals, regardless of species, have a survival instinct. I guess I'm just not seeing what you think is unique about the way humans act concerning death and survival of the species, compared to other animals.", 
   {}, 
   224978, 
   null, 
   1154029560.0
  ], 
  [
   225303, 
   null, 
   "lunchmoney", 
   "so....most responded something along the lines of really smart animal. some gave a dictionary definition.....i asked your opinion, not the opinion of Merriam Webster. and to the person who made the differentiation between \"humans\" and \"person.\" i will ignore this. a person is an individual human. to be human is not just to be alive and walk on two feet. it is to act as a human being, dignified and purposeful. a homo-sapien who throws away his life to cheap physical pleasures, is not living as a human being.\n \n i would like to pose an interesting difference between humans and animals. \n humans are the only specie on earth capable of making the decision to commit suicide. they are the only specie on earth capable of doing anything harmful to themselves.\n \n there are two categories of pleasure on earth. the physical, and the mental. the physical is simply the touching of certain nerve endings to give a pleasurable feeling. nothing inherently satisfying for any length of time. physical pleasures come in waves, they come at a huge high, and then leave a huge depression. which is why people get out of great relationships right when they are at their best and rock stars commit suicide on the night of their biggest concert. not only that but physical pleasures fade over time, the same thing doesn't stimulate the nerve endings to the same extent. which is why guys need the new girl, and the new car, and the new phone. we are all here on this planet trying to derive as much pleasure as possible. each person has his own way of doing it. \n \n however there is an interesting thing about physical pleasures which i have noticed. if you let one sit idle for an extended period of time, and then indulge only sparingly, the pleasure is just like new again. fascinating. i found this out by playing guitar, i used to play 2-3 hrs a day. but i was frustrated by it, and wasn't enjoying it. so i put it down for a month, and when i picked it back up, i was not only better, but i enjoyed it all the more.\n \n also i would like to pose the idea that the mental pleasures of this world are greater and more satisfying than the physical ones. ask any (normal) parent what their biggest pleasure is, and what their biggest pain is. the answer to both is probably their kids. they get pleasure out of seeing their kids because they love their children. and love is a mental pleasure. sex is not love. sex is sex and love is love. do not confuse the two. also do not confuse infatuation with love. love is something built over time. infatuation is the one time you accidentally walked in on a naked girl and \"fell in love.\" \n the older a person gets (dealing with men primarily) older, they have less interest in the physical pleasures and enjoy the mental much more. why? because they last longer. you can look back on accomplishments, or love, or any time you did something good, and derive pleasure out of it. amazing isn't it. \n what makes humans different and unique is our capabilities of having mental pleasures. there are two parts to a human being, the physical and the mental. you cannot ignore one part. you need to satisfy both pleasure drives. when you ignore the mental, you no longer enjoy the world because you are bored of it. and if you ignore the physical, you commit suicide (not necessarily literal, ex: can commit a social suicide) because you no longer connect with other human beings. \n \n why do we harm ourselves? because we think that in the end it will bring us pleasure. the animal side to us helps us survive by: eating, sleeping, procreating, and so on. and the mental side keeps us sane. humans need to be sane. for if insane, we are no better than animals. To be human is to choose to be more than the animal within us. To choose something we know is right. To choose the longterm over the immediate pleasure. That is what makes us human.", 
   {}, 
   224986, 
   null, 
   1154214180.0
  ], 
  [
   225395, 
   null, 
   "Zardoz", 
   "Define suicide.\n \n Does simply laying down, refusing to eat and withering away to death out of apparent despondancy count?\n Animals do that.\n Dog who lost their master for example.\n \n I think your observations have already been beaten to death by trained professionals who do this foer a living.\n You'll find that humans and animals experience a lot more in common than you'd imagine.\n \n I remember back in the 80's a friend of mine was lamenting how humans suck due to their 'barbarism and conflict with one another' he made the flippant comment that apes didn't do that. An hour later, we were both in psychology class where he learned that, yes, apes DO do that.\n \n Humans are a genetic distinction from other animal groups. People don't need to form a half arsed opinion when the ANSWER is already formulated.\n If you want to get into splitting hairs on doublespeak on what a 'person' is, go for it.\n But, if you want to say personhood is merely individualism...well, animals have that too.\n \n If you're looking to see what seperates humans from animals, well, it's not much. We're just better at it than they are.\n More complex, convoluted in out actions if you will.\n \n As an adoptive parent and a biological one, I can attest that the bond (for me) amongst my children are different. \n You will see, in various species that attachments differ. Some animals have the same attachment (love) for their offspring as a human would. Mourn their loss as a human would.\n Also, plenty of humans have NO attachments to their children. Don't bat an eye for the loss as an insect would. Believe me, I see it daily.\n \n In the end, the choices you say humans have...aren't. They're genetically triggered. They can be blunted artificially and triggered artificially. \n \n And humans aren't the only species that plans long term. \n \n But, we may be the only species that's AWARE of it.\n \n Now, I'm off to try to go to sleep.\n I know I shant. As that capacity to fall asleep when I'm very tired has been blunted by massive doses of caffiene.", 
   {}, 
   225303, 
   null, 
   1154266560.0
  ], 
  [
   225417, 
   null, 
   "lunchmoney", 
   "Define suicide.\n \n Does simply laying down, refusing to eat and withering away to death out of apparent despondency count?\n Animals do that.\n Dog who lost their master for example.\n\n \n i was thinking more of pulling a trigger or jumping off a bridge, but i guess laying down and dying also works. \n \n no wild animal does such a thing. domesticated dogs are not what i was speaking about, because domesticating a dog is not its natural state of being. find me one wild dog that will mourn the loss of a human life. even a human that fed it. \n \n \nI remember back in the 80's a friend of mine was lamenting how humans suck due to their 'barbarism and conflict with one another' he made the flippant comment that apes didn't do that. An hour later, we were both in psychology class where he learned that, yes, apes DO do that.\n\n why do they apes do it? do they do it because another tribe is taking their food? or because they need the territory for their young? no ape just goes out on a murder rampage because he feels like it that day. he doesn't have the capabilities of doing something out of his innate drive to survive.\n \n \nBut, if you want to say person hood is merely individualism...well, animals have that too.\n\n please don't say you are one of those P.E.T.A. people who think that animals are equals to humans.\n \n \nIf you're looking to see what separates humans from animals, well, it's not much. We're just better at it than they are.\n\n better at what? hunting? procreating? every animal has just enough capacity to survive. just enough strength, weight, size, speed...you name it. humans are the only ones who have to go harness nature to have it work for them. animals natural capabilities far exceed humans.\n \n \nAs an adoptive parent and a biological one, I can attest that the bond (for me) amongst my children are different.\n\n do tell which bond is stronger.\n \n\n You will see, in various species that attachments differ. Some animals have the same attachment (love) for their offspring as a human would. Mourn their loss as a human would.\n\n such as....\n \n\n Also, plenty of humans have NO attachments to their children. Don't bat an eye for the loss as an insect would. Believe me, I see it daily.\n \n\n then they are terrible parents who shouldn't be having kids. children need psychological support from parents, there is so much that goes into raising kids well. and nowadays i don't see many kids who were raised well, which says a lot about the parent world today.\n \n \nIn the end, the choices you say humans have...aren't. They're genetically triggered. They can be blunted artificially and triggered artificially.\n\n just because you can get doped up, does not mean that you are an animal. and they are genetically triggered only through the process your brain goes through each time it has to make a decision. as far as instincts, such as protecting your face, yes that is the animalistic side of you. but you are not totally animal. \n \n \nAnd humans aren't the only species that plans long term. \n\n just the opposite, we are the only specie having the capability of ignoring the long term and doing something that will be harmful in the long run. animals' survival drive will force them to do things to make sure they survive in the long run. \n \n \nBut, we may be the only species that's AWARE of it.\n\n our AWARENESS is part of what separates us from animals.", 
   {}, 
   225395, 
   null, 
   1154284620.0
  ], 
  [
   225537, 
   null, 
   "Inyx", 
   "I'd say that what defines us as human is our ability to go beyond our instincs, the ability to control our impulses (more or less successfully) and i will not forgot our lovely emotion called greed. emoticon_xkill", 
   {}, 
   224978, 
   null, 
   1154360640.0
  ], 
  [
   225708, 
   null, 
   "Zardoz", 
   "i was thinking more of pulling a trigger or jumping off a bridge, but i guess laying down and dying also works. \n \n no wild animal does such a thing. domesticated dogs are not what i was speaking about, because domesticating a dog is not its natural state of being. find me one wild dog that will mourn the loss of a human life. even a human that fed it. \n\n Define natural state of being?\n Animals have been 'domesticated' for nearly as long as their existence.\n Animals have been observed mouring the loss of a mate or offspring 'in the wild' as for dying as a result. \n All dogs are doing is accepting humans as part of their packs...hopefully as the alpha. It only take a bit for them to go feral and their offspring, could easily return to a somewhat successful life in the 'wild' free of human influence.\n \n \nwhy do they apes do it? do they do it because another tribe is taking their food? or because they need the territory for their young? no ape just goes out on a murder rampage because he feels like it that day. he doesn't have the capabilities of doing something out of his innate drive to survive.\n\n Tigers have been known IIRC to kill for pleasure. Many animals that kill for food have been observed to waste...but, knowing how the cycle of nature works, for all we know, they could just feeding the carrion creatures.\n As far as can be observed, apes have killed for non-food/territory reasons. The problem comes from not being able to ask them exactly WHY they do so...although, asking many humans why they have killed can often result in an 'Uhhh, I don't know' response. Would you be saying that humans don't kill for the reasons you have posted? 'Resources', competition in mating, other 'animalistic' reasons?\n We do know animals appear to be capable of emotional responses at times. Emotion can be a cause of doing something out of an 'inate drive for survival'.\n Constantly comments similar to the one you have posted have been disproven. Recently, there was a study where gold fish were stated to have emotions and a longer memory than given credit for in the past. \n \n \n \nplease don't say you are one of those P.E.T.A. people who think that animals are equals to humans.\n\n LMFAO. I'd eat humans if given an opprotunity. Waste not, want not. ;) What I'm saying is don't be speciest and dismissive of what 'animals' are capable of. Humans are animals too. It's good to post questions but, unless you're an expert in the field or are working towards such, it's not advisable to make blanket comments. Sure, animals have personality and individuality. So what? If I'm hungry and have 2 toy poodles, one with a good temperment and one with a bad one...I'm still going to eat one. I just might chose to eat the bad one first for various reasons.\n \n \n \nbetter at what? hunting? procreating? every animal has just enough capacity to survive. just enough strength, weight, size, speed...you name it. humans are the only ones who have to go harness nature to have it work for them. animals natural capabilities far exceed humans.\n\n Actually, animals suck. Most waste and aren't as effecient at what they do as humans are willing to give them credit for. Those tales of 'perfect killing machines' are pretty exagerated by people infatuated with the animal they're studying. Remember, many go fricking extinct all the time. Humans are adaptable and IMO, fafr more effecient. We recycle and have other humans living off our trash before the carrion creatures can get to it. We can live in ALL environments...something even cockroaches can't do. Barring our own fratricidal conflicts over resources and expansion (animalistic in nature) we have little to fear from ATM in an extinction type event. I wonder how many species will go to the dodo in global warming (human caused or otherwise) while we sip iced tea and bitch about the cost of the AC bills? Animals actually have more than enough to 'just survive' it's inbuilt. Animals don't spend all their time mating and eating...although that does seem like a pretty good life. \n \n Yeah, I think we go animals beat hands down. As a matter of fact, I'd say if we put our minds to it, we could probably selectively erradicate any species we desired. I know we're responsible for saving some from extinction or at least delaying it long enough for the next generation to revive it. Must be nice being the gawds of this planet. Heck, my dog's an Irish Wolfhound. It's breed exist due to human intervention. Purely due to human whim.\n \n Our ability to do this IS NATURAL. Unless you believe we were uplifted by aliens or some such. Every percieved imperfection we preserve in our species brings a possible benefit. \n \n \ndo tell which bond is stronger.\n\n With which ever one who is closest to me in 'nature'. This 'unconditional love' thing rarely exist. Many try to say it's uncondional love as they shelter their homocidal ofspring when in fact, it's closer to shame. \n Look at the wonderful story oft told of the prodigal son. Did the father go out and beg his son to come back? Or, did he forgive him for being an arse and accept his apology and welcome him back. I doubt the father would have welcomed him back if the son came back being an arse and further demanding more funds to live off of.\n \n \nsuch as....\n\n The species that mate with one partner for life for example. How long then 'mourn' and how intense could be less. Elephants are said to do so. Some song birds.\n \n \nthen they are terrible parents who shouldn't be having kids. children need psychological support from parents, there is so much that goes into raising kids well. and nowadays i don't see many kids who were raised well, which says a lot about the parent world today.\n\n I'd have a tendency to agree. But the question would be why? \n \n \njust because you can get doped up, does not mean that you are an animal. and they are genetically triggered only through the process your brain goes through each time it has to make a decision. as far as instincts, such as protecting your face, yes that is the animalistic side of you. but you are not totally animal.\n\n I'd say I am an animal. The human species just has differing characteristics than others. And it's not really doped up although you could easily use that as an example of chemical manipulation that affects outcome. \n \n \njust the opposite, we are the only specie having the capability of ignoring the long term and doing something that will be harmful in the long run. animals' survival drive will force them to do things to make sure they survive in the long run.\n \n Actually, animals can easily abandon their young more so than humans, which is a form of long term species survival just to save their own necks. Do so all the time...with no guarantee that they'll breed again. Witness forest fires. Bye-bye young, bye food stocks saved all eyar long...just to escape the flames. I'm sure some grab their offspring by the scruff of the neck and run with them, but, they probably chose the ones that are strongest of the litter.\n \n \n \nour AWARENESS is part of what separates us from animals.\n\n I'm pretty sure some primates have shown awareness, not 100% versed in it. Some primates come to mind.\n \n But, still, being aware doesn't make us magically not an animal. Just makes us an animal with a unique ability. Kinda like how platypuses lay eggs even though they are mammals. Many species have unique abilities. Still...they are animals.\n \n In the end, I'd say humans are animals, just far more complex than anyother.\n I don't believe in mistreating them nor squandering them as a resource. IMO, if PETA got it's way. Many more would go extinct than currently are. I don't think we should advance their extinction but, I'd rather see an animal being used for laboratory experimentation than a human...even if we have an abundance of humans that really have no value to society or an individual and it'd be more practical and useful to experiment on humans.", 
   {}, 
   225417, 
   null, 
   1154433120.0
  ], 
  [
   225709, 
   null, 
   "Zardoz", 
   "I'd say that what defines us as human is our ability to go beyond our instincs, the ability to control our impulses (more or less successfully) and i will not forgot our lovely emotion called greed. emoticon_xkill\n\n \n Greed is an animalistic trait. Hoarding is resource management. Found quite often in nature. Gluttony is too. Nothing like over indulgence to build yourself up.", 
   {}, 
   225537, 
   null, 
   1154433240.0
  ], 
  [
   225727, 
   null, 
   "Inyx", 
   "Greed is an animalistic trait. Hoarding is resource management. Found quite often in nature. Gluttony is too. Nothing like over indulgence to build yourself up.\n\n \n There is greed (exccesive desire to have more than you need for survival and things you don't need for survival) - human trait and hoadring, compiling (getting what you need for survival) - animalistic trait, also a human trait.", 
   {}, 
   225709, 
   null, 
   1154446200.0
  ], 
  [
   226077, 
   null, 
   "Ooaman", 
   "so....most responded something along the lines of really smart animal. some gave a dictionary definition.....i asked your opinion, not the opinion of Merriam Webster. and to the person who made the differentiation between \"humans\" and \"person.\" i will ignore this.\n\n As you said, you asked for opinions. I gave an opinion and you're ignoring it. Well fine then. But then what happened. You went on to say this...\n \na person is an individual human. to be human is not just to be alive and walk on two feet. it is to act as a human being, dignified and purposeful. a homo-sapien who throws away his life to cheap physical pleasures, is not living as a human being.\n\n Did what I say offend you or something? Either ignore it or comment on it. But don't say you're going to ignore it and then comment on it. I now wish I just stuck with my humans are the same monkey post. I still think that humans are the species and I believe humans are animals. This is why we are considered mammels. I don't have a problem with a person being an individual human. But maybe my argument would fit better in Society Debates than here in Philosophy.", 
   {}, 
   225303, 
   null, 
   1154587500.0
  ], 
  [
   226120, 
   null, 
   "Nadogi", 
   "Homo=same\n sapiens=monkey\n \n \n Therefor, humans are the same monkey.\n \n I believe some really old humans were called Homo Erectus\n Homo=Same\n Erectus=Sticking up straight.\n \n They were the same sticking up.\n\n \n This is actually not true:\n \n There is the Greek word \"homo\": same (i.e. \"homosexuality\")\n and the Latin word \"homo\": human\n the Latin word \"sapiens\" is the gerund of the verb \"sapere\" which means \"to know\"\n \n \"sapiens\" therefore means \"knowing\" or better put \"wise\"\n \"homo sapiens\" is a Latin word that means \"the wise human\" This is a later stage of human evolution. Homo can be anything from an australopithecus, to a neanderthal. \"homo sapiens\" is a human sub-species that came into existense shortly after the cromagnens\n Technically, today's humans are knowns as homo sapiens sapiens, with the word \"wise\" used twice, just to differ from the humans of 20,000 years ago.\n \n Homo erectus is a term used for the point at which humans began walking up straight. The word means erect human\n \n The word \"human\" is also a Latin word. Comes from the adjective \"humanus\"", 
   {
    "double posts": [
     226121
    ]
   }, 
   224862, 
   null, 
   1154623320.0
  ], 
  [
   226124, 
   null, 
   "Nadogi", 
   "When defining what makes us human, one needs to consider what one means by human.\n \n Biologically speaking, our genes make us part of the human species.\n \n If you're asking what qualities make us human, then I believe it is impossible to come up with an answer.\n \n If you say, \"intelligence\", you'll definitely find people who are not very intelligent, although our overal intelligence does seperate us from other species\n \n If you say, \"creativity\", you'll definitely find people who are not very, or not at all creative.\n \n If you say kindness, compassion virtue and whatnot, you'll find a whole lot of people who do not possess these qualities. \n \n You can't say \"love\" makes us human, as an animal mother can experience just as much love for her young. \n \n I think when defining humanity, one can not speak on an individual level, but on a collective one. You can define what makes us as a species different from other species on this planet.\n \n The main quality is the fact that we do not go with the tide of nature. We hve the ability to change our environments according to our liking. There may be other species that can do this too, however, with them, it's mostly based on genetic programing. \n \n All bee hives and ant farms will basically look the same. No great social, or political revolution will ever come about in a pack of wolves that will change their way of life. With the human species, it is different. You see with totalitarian dictatorships or the October Revolution in Russia or the Cultural Revolution in China how the idea of one person can influence entire ways of life. there are of course other, more positive examples, but I think you get my point. Airplanes, nuclear reactors and satelites are all examples of how humans separate themselves from nature. This could be seen as a quality.\n \n You also see that humans in general have a much more developed logic than that of other species. this can mostly be said in a collective way", 
   {}, 
   226120, 
   null, 
   1154624460.0
  ], 
  [
   226160, 
   null, 
   "electrolyte", 
   "Homo can be anything from an australopithecus, to a neanderthal.\n\n As Austalophithecus is a genus taxonomically different from Homo, how can Homo can include australopithecines?\n \n \n\"homo sapiens\" is a human sub-species...\n\n Has taxonomy changed radically, or something? I know there's a push for the three-domain system, but this is confusing. Homo sapiens is the name of a species, not a subspecies. If I'm not mistaken, Homo sapiens sapiens and Homo sapiens idaltu would be subspecies.\n \n \nBiologically speaking, our genes make us part of the human species.\n\n I tried this one already:\"Human\" is a consequence of the Biological Species Concept.\nIt didn't seem to catch on...", 
   {}, 
   226124, 
   null, 
   1154636820.0
  ], 
  [
   226163, 
   null, 
   "lunchmoney", 
   "the question was more aimed to the idea of humans over animals. the definitions of latin words used by scientists to describe how humans walk isnt important.", 
   {}, 
   226160, 
   null, 
   1154637840.0
  ], 
  [
   226165, 
   null, 
   "electrolyte", 
   "the question was more aimed to the idea of humans over animals.\n\n I answered that one, too:A human simply is a really smart animal;\nIt didn't seem to catch on either...\n \n I think you need to make your question just slightly more clear than mud. What is it you're actually asking? Or were you just looking for an opportunity to go on a spiel about hurting oneself?", 
   {}, 
   226163, 
   null, 
   1154638680.0
  ], 
  [
   226168, 
   null, 
   "Ooaman", 
   "...Has taxonomy changed radically, or something? I know there's a push for the three-domain system, but this is confusing. Homo sapiens is the name of a species, not a subspecies. If I'm not mistaken, Homo sapiens sapiens and Homo sapiens idaltu would be subspecies.\n\n Homo sapiens idaltu?\n \n Would that be a wise idiot?:p\n By the way, most of my dictionary definitions were just to be humorous anyway.", 
   {}, 
   226160, 
   null, 
   1154639580.0
  ], 
  [
   226212, 
   null, 
   "electrolyte", 
   "By the way, most of my dictionary definitions were just to be humorous anyway.\n\n You know, I sometimes get accused of being a bit too serious, but considering I (1) used your framework to make a second (and dare I say pretty funny) joke -- using the correct terms, no less -- and (2) ended up poking you in the eyes Three Stooges-style, I don't think this is such an instance.", 
   {}, 
   226168, 
   null, 
   1154650860.0
  ], 
  [
   226222, 
   null, 
   "Ooaman", 
   "You know, I sometimes get accused of being a bit too serious, but considering I (1) used your framework to make a second (and dare I say pretty funny) joke -- using the correct terms, no less -- and (2) ended up poking you in the eyes Three Stooges-style, I don't think this is such an instance.\n\n No, it was funny, but my what you just quoted me...\n \nBy the way, most of my dictionary definitions were just to be humorous anyway.\n\n Was mainly in response to this...\n \nsome gave a dictionary definition.....i asked your opinion, not the opinion of Merriam Webster\n\n I guess I should have put that up so it didn't get confused with my resonse to your quote. My response to your quote was the Wise Idiot.\n \n But on the subject, what is idaltu?", 
   {}, 
   226212, 
   null, 
   1154652780.0
  ], 
  [
   243124, 
   null, 
   "cheungshunsang", 
   "condition worth", 
   {
    "post_info": {
     "post_title": "my reason"
    }
   }, 
   224978, 
   null, 
   1165983420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  what defines us as human", 
  "url": "http://www.4forums.com/political/philosophy-debates/8576-what-defines-us-human.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 8576, 
  "discussion_files": [
   [
    "2843.html", 
    "http://www.4forums.com/political/philosophy-debates/8576-what-defines-us-human-print.html"
   ], 
   [
    "2844.html", 
    "http://www.4forums.com/political/philosophy-debates/8576-what-defines-us-human-3-print.html"
   ], 
   [
    "2845.html", 
    "http://www.4forums.com/political/philosophy-debates/8576-what-defines-us-human-2-print.html"
   ]
  ], 
  "identifier": 8576
 }
]