[
 [
  [
   224968, 
   null, 
   "georged", 
   "Reading those posts supporting Israel's invasion of Lebanon, I'm reminded of those who supported current administration claims of WMDs as a rationalization to invade and occupy Iraq. \n \n While Israel has kidnapped Hezbollah and other enemies of Israeli policy while periodically using air power and rockets to attack those enemies, the enemies have retaliated in kind. This has been going on for years with negligible escalation by either side. All through the period of those skirmishes, Israel had slowly been relinquishing territory taken by force to appease world opinion and satisfy the claims of those enemies.\n \n All of a sudden Israel, for all practical purposes, destroys the infrastructure of Lebanon and invades that country, all based on two kidnapped soldiers and some rocket attacks, nothing that hasn't been going on for years. And again sends troops into Gaza.\n \n What causes individual Americans who are paying for this destruction and death on borrowed money to defend Israel under those circumstances? Anyone who has been there and experienced the Israeli attitude towards Palestinians and other ME indigenous ethnic groups can testify Israel is as racist a nation as it gets, very similar to the US. Could it be that blindly patriotic Americans supporting current administration and Israeli actions subconsciously associate our taking the US from Native Americans with what they consider Israel's right to take land from neighbors under the guise of defense, just as the US did in decimating Native American populations to protect settlers taking Native American lands from being attacked by those Native Americans? \n \n What's the difference between the US Military taking land from Native Americans under the rationalization of defense, attempted occupation of Vietnam to defend the US from communism, invasion and occupation of Iraq under the same defense pretense and a US supported Israel invading Lebanon under the guise of defense? Are we experiencing a mindset from individuals including leadership who still live in the past?", 
   {
    "post_info": {
     "post_title": "Israel's Invasion of Lebanon"
    }
   }, 
   null, 
   null, 
   1154023800.0
  ], 
  [
   224993, 
   null, 
   "jim's trucking", 
   "Reading those posts supporting Israel's invasion of Lebanon, I'm reminded of those who supported current administration claims of WMDs as a rationalization to invade and occupy Iraq. \n \n While Israel has kidnapped Hezbollah and other enemies of Israeli policy while periodically using air power and rockets to attack those enemies, the enemies have retaliated in kind. This has been going on for years with negligible escalation by either side. All through the period of those skirmishes, Israel had slowly been relinquishing territory taken by force to appease world opinion and satisfy the claims of those enemies.\n \n All of a sudden Israel, for all practical purposes, destroys the infrastructure of Lebanon and invades that country, all based on two kidnapped soldiers and some rocket attacks, nothing that hasn't been going on for years. And again sends troops into Gaza.\n \n What causes individual Americans who are paying for this destruction and death on borrowed money to defend Israel under those circumstances? Anyone who has been there and experienced the Israeli attitude towards Palestinians and other ME indigenous ethnic groups can testify Israel is as racist a nation as it gets, very similar to the US. Could it be that blindly patriotic Americans supporting current administration and Israeli actions subconsciously associate our taking the US from Native Americans with what they consider Israel's right to take land from neighbors under the guise of defense, just as the US did in decimating Native American populations to protect settlers taking Native American lands from being attacked by those Native Americans? \n \n What's the difference between the US Military taking land from Native Americans under the rationalization of defense, attempted occupation of Vietnam to defend the US from communism, invasion and occupation of Iraq under the same defense pretense and a US supported Israel invading Lebanon under the guise of defense? Are we experiencing a mindset from individuals including leadership who still live in the past?\nStill upset about the costs, are you?\n \n I'm really sorry for you that the ME conflict is troubling you from a financial standpoint.\n \n Mistaken opinions stated as if in fact often lead to misinformed readers. Rather than present your one-sided, prejudiced synopsis of the current situation, tell us what REALLY happened. Show us some links that describe what you want us to believe is historical.\n \n If one reads the history of the Israeli/Palestinian conflict, one can see that Israel has tried to but been unable to live peacefully in their lawfully given territory. They are presently occupying slightly more than their originally partitioned area as a result of wars fought in defense of their existence.\n \n http://www.historyguy.com/israeli-palestinian_conflict.html\n \n http://www.mideastweb.org/nutshell.htm\n \n http://www.afsc.org/israel-palestine/learn/conflict-history.htm\n \n http://en.wikipedia.org/wiki/History_of_the_Israeli-Palestinian_conflict\n \n \n And these links are about as unbiased as I can find.\n \n http://www.israelipalestinianprocon.org/\n \n http://www.israelipalestinianprocon.org/summary.html\n \n http://www.israelipalestinianprocon.org/didyouknow.html\n \n \n If you really want to blame the conflict on someone, blame the British. They made conflicting promises about the control of the land after they were granted control in the early 1900s upon defeat of the Ottoman Empire.\n \n All of what is now Jordan and Israel was once Palestine. Palestine was split into Arab and Jewish states, Israel and Jordan. If the Palestinian Arabs want their own state, they should move into Jordan as it was originally set up as the Arab part of the partitioned land.\n \n Here is an interesting and informative map site that shows the progression of boundaries and names of countries throughout history.\n \n http://www.israelipalestinianprocon.org/Maps/introduction.html\n \n Just scroll to the era you want to look at and the map changes, always showing dotted lines denoting the present-day boundaries.", 
   {}, 
   224968, 
   null, 
   1154033340.0
  ], 
  [
   225346, 
   null, 
   "daewoo", 
   "Still upset about the costs, are you?\n \n I'm really sorry for you that the ME conflict is troubling you from a financial standpoint.\n \n Mistaken opinions stated as if in fact often lead to misinformed readers. Rather than present your one-sided, prejudiced synopsis of the current situation, tell us what REALLY happened. Show us some links that describe what you want us to believe is historical.\n\n \n I have never seen you interested in what really happened before, Jim. If you want what really happened, here it is:\n \n http://www.forbes.com/technology/feeds/ap/2006/07/12/ap2873051.html\n \n \nThe militant group Hezbollah captured two Israeli soldiers during clashes Wednesday across the border in southern Lebanon, prompting a swift reaction from Israel, which sent ground forces into its neighbor to look for them. \n \n The forces were trying to keep the soldiers' captors from moving them deeper into Lebanon, Israeli government officials said on condition of anonymity. \n\n \n This was the first report on the incident. It is from AP. AND, you see it has it ebign confirmed by an Israeli gvt official.\n \n SO, those soldiers were captured in Lebanon, not in Israel. Israel ran a cross border raid, and Hizbollah captured some of their people. Certainly self defense...by the Lebanese.\n \n the ismple fact of the matter is, we are paying for Israel to act like thugs, adn it is hurting the US. Maybe you do not care if your tax dollars are being used to slaughter civilians. I do. And George is correct to be concerned about the costs. Our economy is slowing, but inflation continues upwards without a pause. Our last treasury offering did not go well. At the VERY LEAST, we are staring serious stagflation in the face. Energy prices are going through the roof, and we are basically going out of our way to tick off the folks who live where energy comes from.\n \n The fact that we are going to end up footing the bill for what turns out to be a VERY expensive israeli temper tantrum should certainly be included when considering the situation in the ME.", 
   {}, 
   224993, 
   null, 
   1154228520.0
  ], 
  [
   225535, 
   null, 
   "jim's trucking", 
   "I have never seen you interested in what really happened before, Jim. If you want what really happened, here it is:\n \n http://www.forbes.com/technology/feeds/ap/2006/07/12/ap2873051.html\n \n \n \n This was the first report on the incident. It is from AP. AND, you see it has it ebign confirmed by an Israeli gvt official.\n \n SO, those soldiers were captured in Lebanon, not in Israel. Israel ran a cross border raid, and Hizbollah captured some of their people. Certainly self defense...by the Lebanese.\n \n the ismple fact of the matter is, we are paying for Israel to act like thugs, adn it is hurting the US. Maybe you do not care if your tax dollars are being used to slaughter civilians. I do. And George is correct to be concerned about the costs. Our economy is slowing, but inflation continues upwards without a pause. Our last treasury offering did not go well. At the VERY LEAST, we are staring serious stagflation in the face. Energy prices are going through the roof, and we are basically going out of our way to tick off the folks who live where energy comes from.\n \n The fact that we are going to end up footing the bill for what turns out to be a VERY expensive israeli temper tantrum should certainly be included when considering the situation in the ME.\nAh, the Marx Brothers at it again.\n \n I don't really know where to start. I guess with the fact that both of you are keyed in on the cost rather than the underlying causes of the ongoing, seemingly unstoppable conflict. You take it back to the last incident prior to the major push and say that's the reason, the silly, miniscule reason that Isreal \"started\" this mess, costing us money. I doubt that Forbes magazine has as much actual knowledge of what's been going on as you do...and I doubt they are anymore likely to present evidence against their own argument than you are...which is NOT AT ALL!\n \n You seem to ignore the story about the tunnel and the abduction of an Israeli officer some weeks ago. You ignore the fact that Hezballah has been lobbing rockets into Israel for quite some time. You ignore that fact that Israel was moving out of or had already moved out of the Gaza Strip and was thanked for that with rocket attacks. You ignore the fact that Hezballah has stated its goal is the complete destruction of Israel (as is that or Syria, Hamas and other Jew haters).\n \n The taking of the two soldiers was merely the straw that broke the camel's back. There's no use in trying to reduce the argument to one based on such a relatively insignificant action.\n \n As for invading Lebanon, Israel had no other choice. The weak Lebanese government sits back on its thumbs while Hezballah operates unrestrained on its land. They claim no responsibility for the attrocities committed against Israel but they also do absolutely nothing to stop it from happening again, and again, and again. Why would anyone be expected to take such punishment from just across their borders without one day retaliating with forces across the border.\n \n I do not blame Israel at all for \"invading\" Lebanon. I hope they are able to kill the majority of Hezballah and all of its cowardly leaders before retreating to Israel for a few more years of peace. Then, when the next round of terrorists start peppering Israel again, I hope Israel wipes out everything necessary to rid the world of these terrorist bastards again.\n \n Innocent people are dying on both sides of this battle. On the Israeli side, the innocents are targeted by the terrorists. On Lebanon's turf, the innocents are unnecessarily close to the targets. (That's because the terrorist cowards hide behind women and children, hoping for some innocent deaths to gain sympathy for their side and admonishment for the \"attackers\".)\n \n Israel is simply defending itself in the only possible way...with retaliation. No Forbes article can convince me otherwise.\n \n And you should not confuse Hezballah with the Lebanese. They are not the same.\n \n The thugs are Hezballah, not Israel. Unfortunately, Hezballah, Hamas and some others have the destruction of Israel etched in their brains and will not be negotiated with on that issue. They will continue to use their cowardly methods of killing innocent people to spread terror and death until all Jews are dead.\n \n Why can't you admit this is true?\n \n BTW, you sound as if you'd eagerly trade the lives of all the Israelis for a better economy and its end result...more money in your own pocket. If that's not a scumbag philosophy, I don't know of one.\n \n \n \n \n Kill emoticon_xkill all terrorists and those who support them!!", 
   {}, 
   225346, 
   null, 
   1154358540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Israel's Invasion of Lebanon", 
  "url": "http://www.4forums.com/political/current-events-debates/8594-israels-invasion-lebanon.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8594, 
  "discussion_files": [
   [
    "9646.html", 
    "http://www.4forums.com/political/current-events-debates/8594-israels-invasion-lebanon-print.html"
   ]
  ], 
  "identifier": 8594
 }
]