[
 [
  [
   225162, 
   null, 
   "epaphras_faith", 
   "Another good one. My opinion is wisdom is a recognition of reality and an ability to live in terms with reality.\n \n EF", 
   {
    "post_info": {
     "post_title": "What is wisdom"
    }
   }, 
   null, 
   null, 
   1154123640.0
  ], 
  [
   235671, 
   null, 
   "dixie", 
   "Knowledge is wisdom,but mostly, common sence.", 
   {
    "post_info": {
     "post_title": "Knowledge"
    }
   }, 
   225162, 
   null, 
   1161329040.0
  ], 
  [
   235728, 
   null, 
   "epaphras_faith", 
   "Knowledge is wisdom,but mostly, common sence.\n\n \n Welcome to the board!emoticon_xhoho \n \n Please explain how knowlege and wisdom are equivalent. I personally think Common sense is neither common nor sensible in many cases. If you see wisdom as common sense tell me how it is that.\n \n I look forward to your response.\n \n EF", 
   {}, 
   235671, 
   null, 
   1161369480.0
  ], 
  [
   235734, 
   null, 
   "DrNo", 
   "I think wisdom is how well you use and understand your knowledge.", 
   {}, 
   235728, 
   null, 
   1161376380.0
  ], 
  [
   235737, 
   null, 
   "epaphras_faith", 
   "I think wisdom is how well you use and understand your knowledge.\n\n \n This is interesting. How so?", 
   {}, 
   235734, 
   null, 
   1161377280.0
  ], 
  [
   236144, 
   null, 
   "Inyx", 
   "Wisdom is knowing how to enjoy being a human being. (not mine definition, I found it somwhere on the internet, but I agree with it).", 
   {}, 
   235737, 
   null, 
   1161617640.0
  ], 
  [
   236147, 
   null, 
   "peteratwar", 
   "Wisdom is realising how little you know", 
   {}, 
   236144, 
   null, 
   1161618120.0
  ], 
  [
   236201, 
   null, 
   "epaphras_faith", 
   "pretarwar and inyx\n \n these are both very interesting concepts. Please supply some detailed analysis on why these would make good definitions of wisdom.\n \n EF", 
   {}, 
   236147, 
   null, 
   1161638760.0
  ], 
  [
   237231, 
   null, 
   "Inyx", 
   "Wisdom is knowing how to enjoy being a human being.\n\n \n It past some time before i realised why this definiton suits me because it bugged me for quite some time before I figured out what the person who wrote this meant by it. \n I think that what he or she meant, is that only the realization that you know yourself, what your desires, limitations and strenghts are and how do you function, metally and phisically. Once you know this you can then begin to accept yourself. You begin to appreciate life, yours and of others. You know then what it means to be human. To use your intelect, your resourses and in the end your feelings as an integrated whole at your disposal to deal with everyday struggles, obsticals in your dayly life. To accept your failures, your successes without being beaten down or your ego going overboard. It means realization that life is to short to worry about petty things and that it is worth to fight for what you percive as a worthy cause, no matter if it appears to be trivial to others. The word of joy reflects it. You enjoy being human. You enjoy the sensations of your body, the pits and hills of emotions, the perks of intelectual challenge and strength the use of all together gives you.", 
   {}, 
   236144, 
   null, 
   1162151280.0
  ], 
  [
   240463, 
   null, 
   "wascallywabbit", 
   "I think that wisdom is the ability to discriminate wrt the material you think you know, so as to determine what knowledge has been tested by experience and been validated by it, and what 'knowledge' is only just untested supposition; notions that are as likely to be wrong as right. Meaning that 'truth' is any idea that corresponds positively to lived experience. The higher the degree of positive correspondence, the greater th idea of truth. Wisdom consists of demanding that high degree of correspondence.", 
   {}, 
   237231, 
   null, 
   1163982480.0
  ], 
  [
   298065, 
   null, 
   "Archangel", 
   "Another good one. My opinion is wisdom is a recognition of reality and an ability to live in terms with reality.\n \n EF\n\n \n I wouldn't disagree with your definition at all. But now you must define what is REALITY really? I maintain through personal revelation and personal experience that Man is both a Spiritual and Physical being. And that those who deny the spiritual aspects of their nature are denying the part of themselves that lives forever, as this body of flesh is just a temporary vessel with a very limited life expectancy. That simple realization is the beginning of Wisdom. From there the journey to true wisdom begins.", 
   {}, 
   225162, 
   null, 
   1200849600.0
  ], 
  [
   298068, 
   null, 
   "jitobear", 
   "Wisdom is realising how little you know\n\n \n I think I agree with this one. I also believe that wisdom is about what life teaches, not books.", 
   {}, 
   236147, 
   null, 
   1200850620.0
  ], 
  [
   298087, 
   null, 
   "Zardoz", 
   "Wisdom is applied knowledge.\n \n Using what you know.", 
   {}, 
   298068, 
   null, 
   1200860100.0
  ], 
  [
   299971, 
   null, 
   "charlie horse", 
   "For me, wisdom is about sound judgement and discernment. It decrees a measure of intelligence, but intelligence of itself is not wisdom. A practical and beneficial application of insight.", 
   {}, 
   298087, 
   null, 
   1202054040.0
  ], 
  [
   299972, 
   null, 
   "charlie horse", 
   "Wisdom is realising how little you know\n\n I can't remember who coined it, but there's a learning point there.", 
   {}, 
   236147, 
   null, 
   1202054160.0
  ], 
  [
   300032, 
   null, 
   "Zardoz", 
   "For me, wisdom is about sound judgement and discernment. It decrees a measure of intelligence, but intelligence of itself is not wisdom. A practical and beneficial application of insight.\n\n \n Most things peope take for granted, discernment, insight and the like comes from learning. Be it education or experience.\n That's a reason why young people are often considered naieve.\n \n When these learnt abilities and skills are applied, often without active thought, many are left in awe and can seek some 'supernatural' explanation for it.\n It's just the mind operating rapidly on a reflexive level.\n \n Much like someone who's trained in martial arts for years all of a sudden can instinctively ward off blows due to muscle memory simply by swinging his arm up to block. For many, it's become instinct.\n \n My quote above, 'Wisdom is applied knowledge' comes from a 'wise man'. :p\n Heard it like 15 years ago.", 
   {}, 
   299971, 
   null, 
   1202066400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is wisdom", 
  "url": "http://www.4forums.com/political/philosophy-debates/8599-what-wisdom.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 8599, 
  "discussion_files": [
   [
    "20166.html", 
    "http://www.4forums.com/political/philosophy-debates/8599-what-wisdom-print.html"
   ], 
   [
    "20167.html", 
    "http://www.4forums.com/political/philosophy-debates/8599-what-wisdom-2-print.html"
   ]
  ], 
  "identifier": 8599
 }
]