[
 [
  [
   225546, 
   null, 
   "neon", 
   "Last tendencies in the world, Arab-Israel conflict especially, show that USA turned into Israel puppet. To tell the truth US movements prove that time of our sight of USA as real independent political power ends. And striking example of it is US veto at UN resolution about cease-fire in Middle East. Well, Americans sank in their own ambitions, problems and plans. Washington refuses to think wisely and carefully and is going by the way of self distruction and Israel is pushing it in the back to it. \n USA became terrorists' main target and the reason of it is rash and aggressive US foreign policy masterminded by Jewish lobby. Unfortunately I'm sure that Jews lobby is directing US policy in all its aspects. I think that Americans chose a wrong ally in fight against terrorism and for democracy. They made so many mistakes by Israel isn't attempting to help by advice. The fact is that US policy is profitable for Israel!\n It's frightful that Americans will exhaust their own sources by interminable campaigns in the world. USA is already on the verge of great economic and social crisis. And what will happen in a year nobody can forecast, White House is manipulated by Israel and this is a notorious fact!", 
   {
    "post_info": {
     "post_title": "Last tendencies in the world, Arab-Israel conflict especially"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1154364780.0
  ], 
  [
   225554, 
   null, 
   "peteratwar", 
   "Oh dear me, another anti-semitic rant.", 
   {}, 
   225546, 
   null, 
   1154368020.0
  ], 
  [
   225563, 
   null, 
   "sinjin", 
   "Why do you suppose Jews wield such influence over U.S. Middle East policy? Where is this \"Jew lobby\"?", 
   {}, 
   225554, 
   null, 
   1154371140.0
  ], 
  [
   225577, 
   null, 
   "daewoo", 
   "Why do you suppose Jews wield such influence over U.S. Middle East policy? Where is this \"Jew lobby\"?\n\n \n As far as I can tell, his only mistake is in attributing things to a jewish lobby as opposed to the zionist lobby. They are not necessarily the same thing. I am willing to overlook this based on the posters lack of command of the english language, unless further posts actually ARE ant semitic.\n \n Where is the zionist lobby? Are you kidding?\n \n http://www.washingtonpost.com/wp-dyn/articles/A62438-2004Sep4.html\n \n \nPro-Israel Lobby Has Strong Voice\n AIPAC Is Embroiled in Investigation of Pentagon Leaks\n\n \n This is the FOURTH time that AIPAC has been caught running spies in the US. How many \"lobbying organizations\" do you know of that have been caught operating as the control agents of a spy ring FOUR TIMES and walked away every time?\n \n http://www.foxnews.com/story/0,2933,53785,00.html\n \n \nBut widespread congressional support is rooted in more than just a long-term relationship. It is traced to the power of the collective Jewish or pro-Israeli lobby, a well-organized, well-funded, extremely active, and extraordinarily connected group, according to political analysts.\n \n \"They are very savvy and sophisticated,\" said Richard Semiatin, a political science professor at American University. \"They are extremely knowledgeable and some of the best lobbyists in the country when they get into congressional offices.\" \n\n \n Here is a report out of the JFK school of government at Harvard that covers the question pretty well:\n \n http://ksgnotes1.harvard.edu/Research/wpaper.nsf/rwp/RWP06-011/$File/rwp_06_011_walt.pdf\n \n And a list of top recipients of pro Israeli lobby funds:\n \n http://www.wrmea.com/archives/July_Aug_2004/0407027.html\n \n There is no doubt that there is an EXTREMELY strong zionist lobby in the us.", 
   {}, 
   225563, 
   null, 
   1154374800.0
  ], 
  [
   225610, 
   null, 
   "lord tammerlain", 
   "\n \n There is no doubt that there is an EXTREMELY strong zionist lobby in the us.\n\n \n \n But do not and I mean do not talk about it or you will be labelled as anti semitic(sp) as happened to the two University Prof who wrote a report on the Israeli lobby and its influence on US foreign policy.", 
   {}, 
   225577, 
   null, 
   1154383800.0
  ], 
  [
   225629, 
   null, 
   "sinjin", 
   "$1.38 million annually doesn't sound like much. Is is that our politicians are so easily bought?", 
   {}, 
   225610, 
   null, 
   1154389200.0
  ], 
  [
   225644, 
   null, 
   "georged", 
   "Oh dear me, another anti-semitic rant.\n\n \n I don't read it as anti-semitic but pointing out how easily US policy can be influenced in a manner destructive to the US by money dominating our elected officials. Given our electoral system, I don't think anyone can deny that fact.", 
   {}, 
   225554, 
   null, 
   1154395380.0
  ], 
  [
   225658, 
   null, 
   "daewoo", 
   "$1.38 million annually doesn't sound like much. Is is that our politicians are so easily bought?\n\n \n And yet the Israeli lobby is still considered by most to be the most powerful in washington. \n \n At least part of that sucess seems to be due to a variation of the mossads methodology. For years the mossad worked on the basis that every Jew on the planet was a spy for israel. Anything that they needed to know, they just found a jew who knew it and rolled them over. for years this kept the mossad at the top of the intelligence world. It was not that they were particularly good at gathering intel first hand, but they had people passing on intel from the US, GB, France, Germany, Russia, etc... and were able to take all that classified material they had stolen and construct a more complete picture than anybody was getting from just the protions that they were holding. \n \n In the long term, this has not worked out in the intel world, because it has gotten to the point where nobody in the intel world trusts a jew. Even when I dealt with military intel, there were some jewish guys in the intel division and they were pointed out immediatly and it was made VERY clear that they were not to be trusted. Companies like Boeing and Lockheed that do a lot of military contracts have jewish R&D guys, engineers, etc... but they keep them compartmentalized. It is similar to folks who have been in the Peace Corps. While I certainly admire the motivation that drives most peace corps volunteers to do what they do, the Peace Corps has been used as a CIA front so many times over the years that if you are an ex peace corps volunteer, you are considered damaged goods. Your loyalty is always in question at some level and there are some jobs you simply cannot get. The difference iwth the jews in the intel world is that they cannot be disciminated against (you can't refuse to hire them for being a jew), so they are hired and then never trusted. This is why the mossad is not NEARLY as sucessful as it once was (the mossad has largely gone from the top intel agency in the world to one of the bottom).\n \n For years the Israeli lobby used a similar approch. They considered every jew to be a lobbyist, available as needed. \n \n This backfired to some small degree during the presidency of Bush Sr. He opposed giving Israel another $10 billion. He was essentially trying to bring Israel to the peace table, using US loan guarantees to do so. He said in a press conference:\n \n \nI think it will sell, but it's taken a little time. And we're up against a very strong and effective, sometimes, groups that go up to the Hill. I heard today there was something like a thousand lobbyists on the Hill working the other side of the question. We've got one lonely little guy down here doing it. [Laughter] However, I like this forum better too. \n\n \n A transcript of the rest of the conference can be found at:\n \n http://www.presidency.ucsb.edu/ws/index.php?pid=19969&st=&st1=\n \n After that, many American Jews backed off on their supprt for israel, at least in the short term. they did not like being portrayed as part of a shadow conspiracy. Polls showed over 86% of americans strongly agreeing with the president. \n \n Bush paid for it at election time:\n \n http://www.thornwalker.com/ditch/snieg_prefiguration_03.htm\n \n \nThe role of Israel's chief lobby, the American Israel Public Affairs Committee (AIPAC), in the loan-guarantee controversy was starkly revealed in a private conversation in October 1992 between the president of AIPAC, David Steiner, and potential contributor Harry Katz, which the latter secretly taped. Steiner boasted about AIPAC's political sway, saying he had \"cut a deal\" with James Baker to give more aid to Israel. He had arranged for \"almost a billion dollars in other goodies that people don't even know about.\" [63]\n \n When Katz brought up the concern that Baker had cursed the Jewish people, Steiner said, \"Of course, do you think I'm ever going to forgive him for that?\" He acknowledged that AIPAC was backing Democratic presidential candidate Bill Clinton, and had supported him before he received the nomination. Steiner boasted that AIPAC had numerous supporters in the Clinton campaign and that Clinton would put their people in top positions when he entered office. In fact the Democratic platform contained a strong pro-Israel plank (proving that not all platform planks are just for show), and the Clinton campaign attacked the Bush administration for \"bullying\" Israel.\n\n \n That whole article is a good read and well documented if you have the time.", 
   {}, 
   225629, 
   null, 
   1154402940.0
  ], 
  [
   225659, 
   null, 
   "Collin", 
   "Last tendencies in the world, Arab-Israel conflict especially, show that USA turned into Israel puppet. To tell the truth US movements prove that time of our sight of USA as real independent political power ends. And striking example of it is US veto at UN resolution about cease-fire in Middle East. Well, Americans sank in their own ambitions, problems and plans. Washington refuses to think wisely and carefully and is going by the way of self distruction and Israel is pushing it in the back to it.\n USA became terrorists' main target and the reason of it is rash and aggressive US foreign policy masterminded by Jewish lobby. Unfortunately I'm sure that Jews lobby is directing US policy in all its aspects. I think that Americans chose a wrong ally in fight against terrorism and for democracy. They made so many mistakes by Israel isn't attempting to help by advice. The fact is that US policy is profitable for Israel!\n It's frightful that Americans will exhaust their own sources by interminable campaigns in the world. USA is already on the verge of great economic and social crisis. And what will happen in a year nobody can forecast, White House is manipulated by Israel and this is a notorious fact!\n\n \n You're not thinking at all. The US isn't bending over for Israel in the least. Our government is obviously hoping Iran and Syria will be provoked, thus justifying a campaign against them.", 
   {
    "unicode_changes_made": true
   }, 
   225644, 
   null, 
   1154403000.0
  ], 
  [
   225660, 
   null, 
   "daewoo", 
   "But do not and I mean do not talk about it or you will be labelled as anti semitic(sp) as happened to the two University Prof who wrote a report on the Israeli lobby and its influence on US foreign policy.\n\n \n Absolutly. The Isarelis have parlayed holocaust guilt into the most potent weapon in their arsenal. IMO this is part of israels recent problems. We are far enough removed from WWII that trying to tie sending billions $$ in aid to the nazis actions in WWII is getting more difficult. Additionally, there is an increasingly powerful movement in the jewish community in the US and abroad to seperate zionism from judiasm.", 
   {}, 
   225610, 
   null, 
   1154403120.0
  ], 
  [
   225661, 
   null, 
   "daewoo", 
   "You're not thinking at all. The US isn't bending over for Israel in the least. Our government is obviously hoping Iran and Syria will be provoked, thus justifying a campaign against them.\n\n \n This is the most nonsensical explanation I have seen for our actions, and I see it a lot. If Syrai and Iran move into lebanon and start attacking israel, or eevn start attacking israel right now independant of lebanon, that still provides no justification for action against either one. Syria and Iran both have mutual defense treaties with lebanon. Lebanon has been illegally attacked and partially invaded. Anybody in the planet at this point can opt to help them and it won't jsutify squat when it comes to a response.\n \n As nonsensical as this is, I do believe it was the bush administrations plan on this. Like all of the Bush adminsitrations covert plans to undermine pretty much everythign on the planet, this one has backfired. Iran is openly sending Iranians to fight in lebanon, and the rest of the world just yawns. Nobody cares because REASONABLE people are not going to support action against a nation for assisting another nation that has been illegally attacked and invaded. This would be like if the russians had delcared war on the US for kicking Iraq out of Kuwait.", 
   {}, 
   225659, 
   null, 
   1154403480.0
  ], 
  [
   225949, 
   null, 
   "Gator", 
   "And yet the Israeli lobby is still considered by most to be the most powerful in washington.\nThe Israeli lobby is indeed powerful but not the most powerful when you consider all lobby groups, including those with domestic focus. Your statement requires a qualifier... for example, the Israeli lobby is most powerful foreign policy lobby.\n \n Several publications periodically compose a listing of the most powerful lobby groups in America. Without exception, the pensioners lobby (AARP) is always at the top of the list. The NRA was recently ranked above AIPAC. The Business Roundtable is likely the most powerful lobby on economic issues. Their membership is a Who's Who of America's largest corporations, and was the prime mover of NAFTA. By any measure the Israel lobby has earned a spot near the top of the list, but to say it's #1 is overreach.\n \n \n \nBush paid for it at election time:\n \n http://www.thornwalker.com/ditch/snieg_prefiguration_03.htm\nBush's stand on the Israeli loan guarantees didn't cost him the election. The biggest factor appears to be his broken campaign pledge: \"I'm the one who will not raise taxes... my opponent won't rule out raising taxes... Congress will push me to raise taxes and I'll say no. And they'll push, and I'll say no, and they'll push again, and I'll say, to them, 'Read my lips: no new taxes.'\n \n After Bush raised taxes in a backroom deal with Capitol Hill big spenders, that famous phrase became a lightning rod for his reelection opponents. Buchanan used the broken pledge during the primary battle as his reason for challenging Bush, and Clinton used it very effectively in TV commercials to undercut Bush's character and trustworthines.\n \n Also, with regard to Bush's defeat in the 1992 election, your \"well-documented\" article neglects entirely to mention Ross Perot, despite his winning one-fourth of the vote.", 
   {
    "unicode_changes_made": true
   }, 
   225658, 
   null, 
   1154538720.0
  ], 
  [
   225980, 
   null, 
   "Gator", 
   "http://www.washingtonpost.com/wp-dyn/articles/A62438-2004Sep4.html\n \n This is the FOURTH time that AIPAC has been caught running spies in the US. How many \"lobbying organizations\" do you know of that have been caught operating as the control agents of a spy ring FOUR TIMES and walked away every time?\nHere you are again posting a link and then make false statements which your link does not support. Apparently this habit is hard for you to break.\n \n I read the Post article. It does not give even one instance where AIPAC was 'caught running spies,' yet you emphasize with letters standing tall that this is the 'FOURTH time.'\n \n I know the song and dance routine. There are thousands of google hits that would prove your point but it's not your job to present one. If you're sure that an AIPAC official was ever convicted of spying, then skip the song and dance and post your evidence now. Pollard is the only convicted spy I recall, and his case has no connection to AIPAC.\n \n Meanwhile, I note your Washington Post link is nearly two years old, so let me give you a 2006 update. The trial against the two former senior AIPAC staffers has been repeatedly postponed due to problems with the government's case. Here's a link from The News Media & the Law, a quarterly publication from The Reporters Committee for Freedom of the Press.\n \n The weakness of the government's case is indicated by the judge's comment in a recent hearing:\nIn a March 24 hearing, U.S. District Judge T.S. Ellis acknowledged that the AIPAC case is \"in new uncharted waters and that's why I'm going to consider this matter extremely carefully.\"\nSo what are these new uncharted water the government is fishing in?\n \n If you had bothered to read the indictment you would know that Rosen and Weissman are not being prosecuted for spying, contrary to you belief. They did not uncover information nor handle any documents. Instead, the government is using an obscure, never-before-used provision from the 1917 Espionage Act basically charging these private citizens with illegal gossip.\n \n That's what undergirds Judge Ellis' warning to the prosecution that by invoking this statute they were entering uncharted waters that may threaten free speech. Legal analysts are of the opinion that the government's case will collapse and eventually be dismissed. In any event, this non-spying trial hardly constitutes the fourth time (or even the first time) that AIPAC was caught running spies, which was your claim.", 
   {}, 
   225577, 
   null, 
   1154544900.0
  ], 
  [
   226017, 
   null, 
   "daewoo", 
   "The Israeli lobby is indeed powerful but not the most powerful when you consider all lobby groups, including those with domestic focus. Your statement requires a qualifier... for example, the Israeli lobby is most powerful foreign policy lobby.\n \n Several publications periodically compose a listing of the most powerful lobby groups in America. Without exception, the pensioners lobby (AARP) is always at the top of the list. The NRA was recently ranked above AIPAC. The Business Roundtable is likely the most powerful lobby on economic issues. Their membership is a Who's Who of America's largest corporations, and was the prime mover of NAFTA. By any measure the Israel lobby has earned a spot near the top of the list, but to say it's #1 is overreach.\n\n \n Actually, depending on how you figure \"power\" (which is difficult to calculate), I personally doubt that the zionist lobby is even the most powerful foreign policy lobby. I would consider the measure of power to be the amount of money and man hours that a lobby is able to muster in a pinch. \n \n People that I have heard argue that the pro israeli lobby is the most powerful in washington generally argue that power is calcualted by results and that by this measure, the pro israeli lobby eclipses others. What other lobby has managed to grab so many billions in taxpayer dollars as well as managing to cause the US to incur such massive expenses for a third part country with no return, and often to the detriment, of the US?\n \n So, where exactly the zionist lobby ranks among US political lobbying organizations is a matter of some debate, but there is no doubt that there is an extremely powerful zionist lobby at work in the US.\n \n \n Bush's stand on the Israeli loan guarantees didn't cost him the election. The biggest factor appears to be his broken campaign pledge: \"I'm the one who will not raise taxes... my opponent won't rule out raising taxes... Congress will push me to raise taxes and I'll say no. And they'll push, and I'll say no, and they'll push again, and I'll say, to them, 'Read my lips: no new taxes.'\n \n \nAfter Bush raised taxes in a backroom deal with Capitol Hill big spenders, that famous phrase became a lightning rod for his reelection opponents. Buchanan used the broken pledge during the primary battle as his reason for challenging Bush, and Clinton used it very effectively in TV commercials to undercut Bush's character and trustworthines.\n \n Also, with regard to Bush's defeat in the 1992 election, your \"well-documented\" article neglects entirely to mention Ross Perot, despite his winning one-fourth of the vote.\n\n \n Perot only received 9% of the jewish vote, not 25% ( http://www.jewishvirtuallibrary.org/jsource/US-Israel/jewvote.html)\n \n I don't think that anyboyd is saying that the loss of jewish support cost Bush the election, merely that it was a component.", 
   {
    "unicode_changes_made": true
   }, 
   225949, 
   null, 
   1154552040.0
  ], 
  [
   226023, 
   null, 
   "jim's trucking", 
   "Actually, depending on how you figure \"power\" (which is difficult to calculate), I personally doubt that the zionist lobby is even the most powerful foreign policy lobby. I would consider the measure of power to be the amount of money and man hours that a lobby is able to muster in a pinch. \n \n People that I have heard argue that the pro israeli lobby is the most powerful in washington generally argue that power is calcualted by results and that by this measure, the pro israeli lobby eclipses others. What other lobby has managed to grab so many billions in taxpayer dollars as well as managing to cause the US to incur such massive expenses for a third part country with no return, and often to the detriment, of the US?\n \n So, where exactly the zionist lobby ranks among US political lobbying organizations is a matter of some debate, but there is no doubt that there is an extremely powerful zionist lobby at work in the US.\n \n \n Bush's stand on the Israeli loan guarantees didn't cost him the election. The biggest factor appears to be his broken campaign pledge: \"I'm the one who will not raise taxes... my opponent won't rule out raising taxes... Congress will push me to raise taxes and I'll say no. And they'll push, and I'll say no, and they'll push again, and I'll say, to them, 'Read my lips: no new taxes.'\n \n \n \n Perot only received 9% of the jewish vote, not 25% ( http://www.jewishvirtuallibrary.org/jsource/US-Israel/jewvote.html)\n \n I don't think that anyboyd is saying that the loss of jewish support cost Bush the election, merely that it was a component.\nIt appears you erred with the quote commands here. You want to fix it or just let us wonder?", 
   {
    "unicode_changes_made": true
   }, 
   226017, 
   null, 
   1154554200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Last tendencies in the world, Arab-Israel conflict especially", 
  "url": "http://www.4forums.com/political/current-events-debates/8617-last-tendencies-world-arab-israel-conflict-especially.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8617, 
  "discussion_files": [
   [
    "9157.html", 
    "http://www.4forums.com/political/current-events-debates/8617-last-tendencies-world-arab-israel-conflict-especially-print.html"
   ]
  ], 
  "identifier": 8617
 }
]