[
 [
  [
   12798, 
   null, 
   "AMD4EVER", 
   "The little country of India has already surpassed 1 billion in total population and is still climbing, the world population has passed 6 billion without pause, and all the while certain individuals are claiming the world is already over populated.\n \n What is the largest number of people you think can live on Earth given our current technology and world resources? emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "Earths max population?"
    }
   }, 
   null, 
   null, 
   1060199580.0
  ], 
  [
   12800, 
   null, 
   "SilentPoet", 
   "After the third world war with around a billion casulaties we can slow it down a bit.", 
   {}, 
   12798, 
   null, 
   1060200720.0
  ], 
  [
   12802, 
   null, 
   "AMD4EVER", 
   "After the third world war with around a billion casulaties we can slow it down a bit.\n\n \n Oh don't be so negative here. This is the fun debate forum emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer", 
   {}, 
   12800, 
   null, 
   1060201860.0
  ], 
  [
   12803, 
   null, 
   "gilligan8503", 
   "hmmm... i don't know. there is a lot of land not in use. i suppose the earth can hold much, much more as technology furthers. if india can reach 1 billion, take all land on earth and apply indias to it. i'm staring at a globe and i see about 35 indias, thus, about 35 billion. ummm... jesus, i hope that never happens.", 
   {}, 
   12802, 
   null, 
   1060203420.0
  ], 
  [
   12842, 
   null, 
   "Pikeman85", 
   "Max capacity is estimated at about 50 Billion now, or at least it was when I took my environ sci class last year.\n \n However we would be living a life fit for less than pigs at a trough, with that many people.", 
   {}, 
   12803, 
   null, 
   1060252140.0
  ], 
  [
   12849, 
   null, 
   "AMD4EVER", 
   "Max capacity is estimated at about 50 Billion now, or at least it was when I took my environ sci class last year.\n \n However we would be living a life fit for less than pigs at a trough, with that many people.\n\n \n At a population growth rate of 1.32% per year that gives us 148 years before the world reaches max population. Hmmm, I figured the number would be bigger. Perhaps I miscalculated?? Wow, I guess there really isn't a whole lot of time to figure out how to get population under control. However I think the answer to that is industrialization since industrialized nations often slow their population growth substantially. If India and China were both to become industrialized, I think population growth worldwide would be almost stagnant.", 
   {}, 
   12842, 
   null, 
   1060275420.0
  ], 
  [
   12853, 
   null, 
   "Crim", 
   "AMD, China doesn't have a lot of population growth anymore.", 
   {}, 
   12849, 
   null, 
   1060285020.0
  ], 
  [
   12860, 
   null, 
   "Broker", 
   "Is that because of the law only allowing you two children?", 
   {}, 
   12853, 
   null, 
   1060296900.0
  ], 
  [
   12867, 
   null, 
   "AMD4EVER", 
   "AMD, China doesn't have a lot of population growth anymore.\n\n \n True but at their growth rate, it is like adding an entire US to the worlds population every 25 years. In short, at even a lower rate than the average they will be adding more to the worlds population than most any other country. India and China are the ones that will really increase the worlds population until they lower their rate to almost zero.", 
   {}, 
   12853, 
   null, 
   1060314720.0
  ], 
  [
   13227, 
   null, 
   "oshi", 
   "i have the idea that if we stop trying to produce more and more food each year then our population will level out, we can't eat more food than we have. and we need to stop trying to help everyone else, like sending aid to dying africans or something. if we stop sending them peanut butter and pop tarts nature will take its course. its sad to say, but i think we should let it.", 
   {}, 
   12867, 
   null, 
   1060755060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Earths max population?", 
  "url": "http://www.4forums.com/political/fun-debates/862-earths-max-population.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 862, 
  "discussion_files": [
   [
    "31327.html", 
    "http://www.4forums.com/political/fun-debates/862-earths-max-population-print.html"
   ]
  ], 
  "identifier": 862
 }
]