[
 [
  [
   226194, 
   null, 
   "jyoshu", 
   "Reality check . . .\n \n \"The so-called culture wars rending America over such issues as abortion, gay marriage and stem cell research may be overblown, based on a U.S. poll released on Thursday.\n \n \"Despite talk of 'culture wars' and the high visibility of activist groups on both sides of the cultural divide, there has been no polarization of the public into liberal and conservative camps,\" the Pew Research Center said, commenting on its poll of 2,003 American adults.\"\n \n I think this goes to show that most Americans aren't issue-driven ideologues given to the extremes of the left OR the right. Most people just don't hate gays, most don't picket family-planning clinics, most don't care about knowthyneighbor sites, etc. Most people are just people with their everyday issues. \n \n http://today.reuters.com/news/newsarticle.aspx?type=domesticNews&storyID=2006-08-03T194441Z_01_N03310313_RTRUKOC_0_US-LIFE-POLL.xml&WTmodLoc=NewsArt-L3-U.S.+NewsNews-4", 
   {
    "post_info": {
     "post_title": "&quot;Culture war&quot; in America may be overblown"
    }
   }, 
   null, 
   null, 
   1154645880.0
  ], 
  [
   226200, 
   null, 
   "Master_Shake", 
   "Of course it's overblown. It's just a way to get people's attention and get them watching TV and buying papers and magazines.", 
   {}, 
   226194, 
   null, 
   1154647560.0
  ], 
  [
   226202, 
   null, 
   "foundit66", 
   "Reality check . . .\n \n \"The so-called culture wars rending America over such issues as abortion, gay marriage and stem cell research may be overblown, based on a U.S. poll released on Thursday.\n \n \"Despite talk of 'culture wars' and the high visibility of activist groups on both sides of the cultural divide, there has been no polarization of the public into liberal and conservative camps,\" the Pew Research Center said, commenting on its poll of 2,003 American adults.\"\n \n I think this goes to show that most Americans aren't issue-driven ideologues given to the extremes of the left OR the right. Most people just don't hate gays, most don't picket family-planning clinics, most don't care about knowthyneighbor sites, etc. Most people are just people with their everyday issues. \n \n http://today.reuters.com/news/newsarticle.aspx?type=domesticNews&storyID=2006-08-03T194441Z_01_N03310313_RTRUKOC_0_US-LIFE-POLL.xml&WTmodLoc=NewsArt-L3-U.S.+NewsNews-4\n\n I chalk this up against the claims of the religious right that they got Bush elected on \"moral\" issues.\n Most people have bigger concerns on their mind. Gas prices. War on Iraq. Social Security and health care.\n \n And the repubs try to trot out the \"gay marriage\" and \"flag burning\" issues in order to get the support of the radicals, while I think a few in society see it for the stunt it is and get turned off by the idea.\n \n \n Anywho, other significant portions of the article which discuss gays...\n \n \"On the subject of gay unions, 56 percent opposed giving gays the right to marry, but 53 percent favored allowing gays to enter into legal agreements that provide many of the same rights as married couples.\n \n There has been an increase in recent years in the proportion of Americans who believe homosexuality is innate -- 36 percent, up from 30 percent in 2003. Similarly, 49 percent believed homosexuals cannot be changed to heterosexual, compared to 42 percent in 2003.\"\n \n Like I've been saying all along. The anti-gay side is losing the battle. They're losing it the same way racism was lost. The young are growing up and seeing through the prejudices of the older generation.", 
   {}, 
   226194, 
   null, 
   1154647980.0
  ], 
  [
   226221, 
   null, 
   "Ooaman", 
   "Like I've been saying all along. The anti-gay side is losing the battle. They're losing it the same way racism was lost. The young are growing up and seeing through the prejudices of the older generation.\n\n But they do take their time. There is still a lot of racism out there. There probibly always will be racism just because \"old habbits die hard.\" I hope it does come to end. But I don't think that's going to happen within the next 50 years.", 
   {}, 
   226202, 
   null, 
   1154652180.0
  ], 
  [
   226223, 
   null, 
   "Kronus", 
   "Reality check . . .\n \n I think this goes to show that most Americans aren't issue-driven ideologues \n\n \n And whose reality, exactly, are you checking there? You're the one who was just talking about society staging a revolution in response to gay marriage; I can't recall anyone else saying that Americans were quite that polarized (maybe Mathew). So if you're saying that you've realized that your previous take was off, good for you! I think the rest of us have recognized that it's a loud minority, and an apathetic majority, that's impeding the progress of gay rights.", 
   {}, 
   226194, 
   null, 
   1154652900.0
  ], 
  [
   226231, 
   null, 
   "jyoshu", 
   "And whose reality, exactly, are you checking there? You're the one who was just talking about society staging a revolution in response to gay marriage; \n\n \n That discussion on my part was not about what WOULD happen, it was about the fact that the people ultimately have the final say about their govt., and they do. This is a separate issue entirely.", 
   {}, 
   226223, 
   null, 
   1154655180.0
  ], 
  [
   226237, 
   null, 
   "Kronus", 
   "That discussion on my part was not about what WOULD happen, it was about the fact that the people ultimately have the final say about their govt., and they do. \n\n \n So those were just random observations that weren't meant to have any basis in reality or be of any particular relevance to the debate at hand? You weren't trying to actually make an observation, you were just posing a rather extreme hypothetical? Gotcha. I misunderstood and thought you were talking about something that you thought might actually come to pass.\n \n I'm still wondering whose reality you're checking though. Who do you think your gestalt is a revelation to? I'll grant that the right is always saying \"the people don't want this\", but the gay right's people clearly think that gay right's time has come. So while I'll agree that the right certainly needs to learn this lesson, I'm really curious who on the left you think doesn't already know this? The very fact that gay rights doesn't directly effect most people is one of the reasons that we see no reason why they shouldn't be promoted. Why would people oppose something that has no real bearing on their lives, but can greatly help someone else's?", 
   {}, 
   226231, 
   null, 
   1154657520.0
  ], 
  [
   226246, 
   null, 
   "jyoshu", 
   "So those were just random observations that weren't meant to have any basis in reality or be of any particular relevance to the debate at hand? You weren't trying to actually make an observation, you were just posing a rather extreme hypothetical? Gotcha. I misunderstood and thought you were talking about something that you thought might actually come to pass.\n\n \n They were certainly relevant; it's just that the comments weren't the way you tried to misrepresent them--I wasn't making some kind of prediction or statement about what WOULD happen. I was trying to demonstrate that the people hold the power over the govt, ultimately. \n \n And frankly, I also find it pretty hard to believe that you \"misunderstood\" the whole time given that I explained that more than once (though not necessarily directly to you), and this certainly isn't the first time I've said that.\n \n \nI'm still wondering whose reality you're checking though. Who do you think your gestalt is a revelation to? \n\n \n Then why not just say \"ok, I agree with that\"? It's really not that hard.\n \n I also note you're STILL spending more effort commenting about the way people argue rather than simply debating. But to each his own, I guess.\n \n \nI'll grant that the right is always saying \"the people don't want this\", but the gay right's people clearly think that gay right's time has come. So while I'll agree that the right certainly needs to learn this lesson, I'm really curious who on the left you think doesn't already know this? \n\n \n So then if you agree that gay rights isn't on most peoples' minds, then why does your movement portray so much of society as being against gays? I think this argument is evidence that in fact most people aren't. And that there's in fact NOT some widespread hatred of gays around every corner.", 
   {}, 
   226237, 
   null, 
   1154662860.0
  ], 
  [
   226247, 
   null, 
   "jyoshu", 
   "I chalk this up against the claims of the religious right that they got Bush elected on \"moral\" issues.\n\n \n Actually, I agree with you here. I think claims that moral issues elected Bush are way overstated.", 
   {}, 
   226202, 
   null, 
   1154662980.0
  ], 
  [
   226261, 
   null, 
   "Matthew S", 
   "I don't know about the \"culture war\" But I am at war with evangelical anti gay christianity. I will do whatever it takes to knock then down.", 
   {}, 
   226247, 
   null, 
   1154677380.0
  ], 
  [
   226281, 
   null, 
   "Kronus", 
   "\n I also note you're STILL spending more effort commenting about the way people argue rather than simply debating. \n\n And you spend more time responding to my critiques of how you debate than you do when I critique the topic at hand. I guess you must like it. Go figure. emoticon_xangel \n \n \n\n So then if you agree that gay rights isn't on most peoples' minds, then why does your movement portray so much of society as being against gays? \n\n We don't. Where'd you get that from? Seriously here, you always say things like \"Your movement says...\". Where do you get these things from; whose press releases are you reading or whose web site do you follow? You are almost never right about what the gay movement is about, so whatever your source is you should ditch it, it's not actually speaking for gay rights. \n \n To correct your view, we know that most people aren't actively campaigning against gays. That's just a vocal, and sometimes violent, minority. There is, however, a general prejudice against gays which is widespread, based on antiquated societal standards. It may not affect the average person's behavior on a day to day basis, but can arise when triggered. The gay rights movement is fighting this prejudice, but not in a way which is at all related to your \"revelation\". It's not a culture war, it's simply education; showing people that their prejudices aren't based in reality.", 
   {}, 
   226246, 
   null, 
   1154703300.0
  ], 
  [
   226285, 
   null, 
   "jyoshu", 
   "We don't. Where'd you get that from?\n\n \n So you don't think a great many people in society are anti-gay? If that's true, maybe you're coming around. \n \n \nTo correct your view, we know that most people aren't actively campaigning against gays. That's just a vocal, and sometimes violent, minority. There is, however, a general prejudice against gays which is widespread, based on antiquated societal standards. \n\n \n Sigh. You are absolutely contradicting yourself here. Above you said you DIDN'T believe that. \n \n I think this article is evidence that what you say \"a general prejudice against gays which is widespread\" is not really true. Most people, frankly, could care less.\n \n That's the very point I'm making. Thanks for helping! emoticon_xgood\n \n \nI don't know about the \"culture war\" But I am at war with evangelical anti gay christianity.\n\n \n I have no doubt about that, Matthew.", 
   {}, 
   226281, 
   null, 
   1154705100.0
  ], 
  [
   226288, 
   null, 
   "Kronus", 
   "So you don't think a great many people in society are anti-gay? If that's true, maybe you're coming around. \n \n Sigh. You are absolutely contradicting yourself here. Above you said you DIDN'T believe that. \n \n I think this article is evidence that what you say \"a general prejudice against gays which is widespread\" is not really true. Most people, frankly, could care less.\n \n That's the very point I'm making. Thanks for helping! emoticon_xgood\n \n\n \n Do you trully not see a differnce between \"culture war\" and \"widespread prejudice\"? Or have we simply left the realm of honest debate, again. Given the way you misquote me, I think the answer is clear.", 
   {}, 
   226285, 
   null, 
   1154706480.0
  ], 
  [
   226299, 
   null, 
   "jyoshu", 
   "Do you trully not see a differnce between \"culture war\" and \"widespread prejudice\"? Or have we simply left the realm of honest debate, again. Given the way you misquote me, I think the answer is clear.\n\n \n In this case I don't think there is that much of a difference. The \n widespread prejudice\" IS a culture war (if it were all that widespread. I don't think it IS as widespread as you think). In otherwords, I think the article debunks the idea of a culture war against gays, or in part what you call \"widespread prejudice\".\n \n Also, please, I'm asking you nicely, to simply debate and stop throwing insults in into every post (such as you comment about \"honest debate\" above. I AM debating honestly--if you don't agree with my take on YOUR statements, then simply clarify your statements. That's really all you have to do. If I've misquoted you, then show me, or let's just drop the pettiness.", 
   {}, 
   226288, 
   null, 
   1154715480.0
  ], 
  [
   226303, 
   null, 
   "Kronus", 
   "In this case I don't think there is that much of a difference. The \n widespread prejudice\" IS a culture war (if it were all that widespread. I don't think it IS as widespread as you think). In otherwords, I think the article debunks the idea of a culture war against gays, or in part what you call \"widespread prejudice\"..\n\n No. A war is an active campaign. Prejudice is a passive mindset. In a war you're actively trying to achieve your goals. Prejudice just sort of sits there until something comes up to trigger it. The article in no way even suggests that people aren't prejudiced.\n \n \n\n Also, please, I'm asking you nicely, to simply debate and stop throwing insults in into every post (such as you comment about \"honest debate\" above. I AM debating honestly--if you don\\'t agree with my take on YOUR statements, then simply clarify your statements. That\\'s really all you have to do. If I\\'ve misquoted you, then show me, or let\\'s just drop the pettiness.\n\n It\\'s really simple Jyoshu. You\\'ve blown your goodwill. You have a long and extensive history of lying, and you\\'ve wasted too many people\\'s time trying to decipher if you\\'re simply confused or deliberately being deceitful. If you were a newbie than I would certainly give you the benefit of the doubt and work with you to figure out where any misunderstanding was. But I\\'ve tried the polite approach with you too many times just to have you spit it back in my face for me to waste any more time doing so again. I don\\'t there\\'s anyone out there who won\\'t say that I\\'ve been more than fair with you, but my patience has limits. So until such time as you\\'ve demonstrated that you have in fact changed your tune, if it looks like you\\'re lying I\\'ll call you a liar and not waste my time.", 
   {}, 
   226299, 
   null, 
   1154719080.0
  ], 
  [
   226310, 
   null, 
   "jyoshu", 
   "No. A war is an active campaign.\n\n \n So you agree then, that there isn't really that much of a broad culture war going on against gays except that which is limited in scope by some fringe fundies? \n \n \nIt's really simple Jyoshu. You've blown your goodwill.\n\n \n Kronos, I don't care. People don't come here to show you \"goodwill,\" they're here to debate and discuss; besides I've shown you a lot more goodwill than your posts have warranted. This is not a beauty pageant or popularity contest. I'm not interested in what you and maybe a whopping 2-3 others think of me in terms of \"goodwill\" when you yourselves play the very games you make accusations of. You seem to think you represent some sort of majority here and you don't. When you want to debate instead of trying to play little one-up petty games, let me know. If you want goodwill, this isn't the place--this is a debate forum. If goodwill is what you're after, go find a charity to help you, for cryin' out loud. But it's becoming pretty obvious that debate and discussion is not what you're here for. It takes skin for that. Now are we done with yet another episode of Kronos-Gets-Personal? Because frankly, it's a waste of good bandwidth.", 
   {}, 
   226303, 
   null, 
   1154720340.0
  ], 
  [
   226314, 
   null, 
   "Steeeeve", 
   "It's really simple Jyoshu. You've blown your goodwill. You have a long and extensive history of lying, and you've wasted too many people's time trying to decipher if you're simply confused or deliberately being deceitful. If you were a newbie than I would certainly give you the benefit of the doubt and work with you to figure out where any misunderstanding was. But I've tried the polite approach with you too many times just to have you spit it back in my face for me to waste any more time doing so again. I don't there's anyone out there who won't say that I've been more than fair with you, but my patience has limits. So until such time as you've demonstrated that you have in fact changed your tune, if it looks like you're lying I'll call you a liar and not waste my time.\n Why don't you not respond to Jyoshu then? Now i understand I wasn't there when the first posts between you two happened but it seems that Jyoshu is not the one that goes straight for the throat of the poster. From what I can gather from forum searches, you were attacking Jyoshu as early as september of 05 which was about your 4 or 5th direct response to him. It seems you are the one that started with mispresenting posts and name calling towards Jyoshu (as opposed to him doing it to you). \n \n http://4forums.com/political/showthread.php?p=163708&highlight=Jyoshu#post163708", 
   {}, 
   226303, 
   null, 
   1154721120.0
  ], 
  [
   226319, 
   null, 
   "Kronus", 
   "\n Kronos, I don't care. People don't come here to show you \"goodwill,\" they're here to debate and discuss.\n\n It was the good will I was extending to you that you've used up, not the other way around. You wasted it by not debating but instead lying. And rest assured, every time you lie, I'll call you on it. If you don't like being called a liar than the solution is quite simple, and entirely in your hands.", 
   {}, 
   226310, 
   null, 
   1154721960.0
  ], 
  [
   226320, 
   null, 
   "Kronus", 
   "Why don't you not respond to Jyoshu then?\n\n \n Because lies need to be countered. Does that make sense, or do I need to expand on that?", 
   {}, 
   226314, 
   null, 
   1154722080.0
  ], 
  [
   226321, 
   null, 
   "foundit66", 
   "Why don't you not respond to Jyoshu then? Now i understand I wasn't there when the first posts between you two happened but it seems that Jyoshu is not the one that goes straight for the throat of the poster. From what I can gather from forum searches, you were attacking Jyoshu as early as september of 05 which was about your 4 or 5th direct response to him. It seems you are the one that started with mispresenting posts and name calling towards Jyoshu (as opposed to him doing it to you). \n http://4forums.com/political/showthread.php?p=163708&highlight=Jyoshu#post163708\n\n \n 0) \n Steeeeve: Why don't you not respond to Jyoshu then?\n Kronus: Because lies need to be countered. Does that make sense, or do I need to expand on that?\n \n Foundit66: Seems simple enough. Do you see any problem with that Steeeeve?\n \n 1) What \"mispresenting posts\" are you talking about?\n 2) If somebody lies, and that lie is exposed by somebody else, that is not a bad thing.\n Blindly labelling that situation as \"name calling\" is inane. It is not \"attacking\".\n People don't get extra points just because they choose to engage in deceit instead of pointing out deceit in others...", 
   {}, 
   226314, 
   null, 
   1154722200.0
  ], 
  [
   226325, 
   null, 
   "Steeeeve", 
   "0) \n Steeeeve: Why don't you not respond to Jyoshu then?\n Kronus: Because lies need to be countered. Does that make sense, or do I need to expand on that?\n \n Foundit66: Seems simple enough. Do you see any problem with that Steeeeve?\n \n 1) What \"mispresenting posts\" are you talking about?\n 2) If somebody lies, and that lie is exposed by somebody else, that is not a bad thing.\n Blindly labelling that situation as \"name calling\" is inane. It is not \"attacking\".\n People don't get extra points just because they choose to engage in deceit instead of pointing out deceit in others...\n\n When all you do is point out fake deceit in others it gets old and shows that the only way one can win is to attempt to smear the other...kinda like what you were doing in the Lawerence V. Texas thread.", 
   {}, 
   226321, 
   null, 
   1154722740.0
  ], 
  [
   226326, 
   null, 
   "Steeeeve", 
   "Because lies need to be countered. Does that make sense, or do I need to expand on that?\n\n You need to explain why you were the first to attack Jyoshu and have not let up sense..instead you refuse to have a reasonable discussion and just rely on saying someone is \"lying\" or \"misrepresenting you\" and thus being \"deceitful\". \n \n You have shown a willingness to admit wrong doing when you mispresent me (a time or two only) but it seems when Jyoshu may mispresent you just go straight for the kill..no questions asked. You did it since the beginning and I see no way this will change in the future.", 
   {}, 
   226320, 
   null, 
   1154722920.0
  ], 
  [
   226333, 
   null, 
   "foundit66", 
   "When all you do is point out fake deceit in others it gets old ...\n\n 1) Show me an example of where I pointed out \"deceit\" and it was fake.\n 2) Steeeeve, what gets old is when we point out deceit, and neither you nor Jyoshu argue that it isn't deceit.\n But then later, you claim it's \"fake deceit\".\n \n \n \n... and shows that the only way one can win is to attempt to smear the other...kinda like what you were doing in the Lawerence V. Texas thread.\n\n Steeeeve, you didn't know what you were talking about.\n You didn't know that there were NUMEROUS precedents included in the Lawrence v Texas case.\n You didn't know the ACTUAL RATIONALE involved in deciding the case.\n \n You just waited until I made some comment you could balk at to use it as an excuse to disengage from a conversation that you weren't holding your own on.\n \n And THAT is another tactic we see over and over again.\n Whining about the fact that \"deceit\" or \"no ACTUAL knowledge\" is pointed out and ignoring all arguments just because that was pointed out.\n \n Would you like to go back to the Lawrence v Texas thread and I will make it a point to avoid ALL \"smears\"?", 
   {}, 
   226325, 
   null, 
   1154723820.0
  ], 
  [
   226334, 
   null, 
   "foundit66", 
   "[QUOTE=Steeeeve]You have shown a willingness to admit wrong doing when you mispresent me (a time or two only) but it seems when Jyoshu may mispresent you just go straight for the kill..no questions asked.[/quote\n \n One of the key differences is that Jyoshu DOES NOT admit wrong doing when he misrepresents others.\n That's rather significant.\n \n He habitually misrepresents others in a distinct pattern with no remorse or recognition/acknowledgement of his \"mistakes\". Moreover, he'll often CONTINUE to misrepresent despite being told.\n \n Ergo, the response he gets is justified, IMO.", 
   {}, 
   226326, 
   null, 
   1154723940.0
  ], 
  [
   226339, 
   null, 
   "Steeeeve", 
   "Because he was a liar back then and hasn't let up since. If you need evidence of that than do more searches. See how many others call Jyoshu a liar, and also see how often those people make a habit of accusing others of lying. I think you'll find the results telling.\n \n You have to understand that I have nothing against Jyoshu per se. Despite what he may think these aren't personal attacks. There are times when he is willing to stick to honesty, and on those occasions we have quite civil debates. It's only when he lies that things go downhill.\n \n Out of all the posts I have read from Jyoshu (which I admit are not all of them) I haven't seen any evidence of him lying or trying to be deceitful. He has had some posts that are off the mark but if there is a person here that doesn't please let me know.\n \n \n\n Not quite since the beginning. There was a period when I gave him the benefit of the doubt. He abused it, in a big way. After debating with him for over a year now I know his tactics and deceits, and have no patience for them any more. When he starts pulling one of his old tricks I have no desire to drag it out, going over the same ground repeatedly, correcting his misquotes and lies, building up a airtight case to prove beyond a shadow of a doubt that he lied, just to have him drop the thread and tell the same lies again in a new one. The enjoyment value of that fades very quickly; I'd much rather nip it in the bud.\n Since the beginning of you replying to him (minus a few posts) it has been non-stop attacks eventhough at the time you admit Jyoshu was normally an honest poster. \n \n There are few debaters here that actually lie and are purposely deceitful...I wouldn't say you or Jyoshu are one of them and many of those debaters have been banned now anyway.", 
   {}, 
   226326, 
   null, 
   1154724960.0
  ], 
  [
   226342, 
   null, 
   "jyoshu", 
   "When all you do is point out fake deceit in others it gets old and shows that the only way one can win is to attempt to smear the other...kinda like what you were doing in the Lawerence V. Texas thread.\n\n \n Kronos is more than welcome to point to any specific lies he thinks I've told. Otherwise it will be given all the credibility any unproven accusation deserves. The \"how-many-others\" he keeps bringing up that he things represents a huge group agreeing with him is all of about 2 to 3 people here--who tend to be reactionaries when they are disgreed with in an extended way. I haven't lied. And I have nothing against Kronos other than the fact he makes these personal attacks from time to time.\n \n It doesn't really matter though--I've reported the posts so I suspect that they will be deleted by the admin as soon as he sees them just like a number of other perfectly good threads that Kronos has hijacked by throwing them off-track making personal attacks. It's happened before, more than once.", 
   {}, 
   226325, 
   null, 
   1154725260.0
  ], 
  [
   226343, 
   null, 
   "Steeeeve", 
   "1) Show me an example of where I pointed out \"deceit\" and it was fake.\n 2) Steeeeve, what gets old is when we point out deceit, and neither you nor Jyoshu argue that it isn't deceit.\n But then later, you claim it's \"fake deceit\".\n \n \n we probably don't point it out because these kinds of conversation are annoying. Yet I will humor you for a few more posts.\n \n If you want examples, see any time in the last few months where you have said the word \"misrepresent\"\n \n Here is one example: http://4forums.com/political/showpost.php?p=226059\n \n \n\n Steeeeve, you didn't know what you were talking about.\n You didn't know that there were NUMEROUS precedents included in the Lawrence v Texas case. \n Wait, weren't you just complaining about people misrepresenting posts?\n \n\n You didn't know the ACTUAL RATIONALE involved in deciding the case.\n \n and you know this how?\n \n\n You just waited until I made some comment you could balk at to use it as an excuse to disengage from a conversation that you weren't holding your own on.\n \n And THAT is another tactic we see over and over again.\n Whining about the fact that \"deceit\" or \"no ACTUAL knowledge\" is pointed out and ignoring all arguments just because that was pointed out.\n \n Would you like to go back to the Lawrence v Texas thread and I will make it a point to avoid ALL \"smears\"?\n No, your chance at a civil discussion has been exhausted on that topic. You can debate Phyllis on there I suppose.", 
   {}, 
   226333, 
   null, 
   1154725320.0
  ], 
  [
   226350, 
   null, 
   "foundit66", 
   "we probably don't point it out because these kinds of conversation are annoying. Yet I will humor you for a few more posts.\n \n If you want examples, see any time in the last few months where you have said the word \"misrepresent\"\n \n Here is one example: http://4forums.com/political/showpost.php?p=226059\n\n Did you lose track of what we were talking about?\n The point wasn't just that we claimed Jyoshu \"misrepresented\" something.\n Your ATTEMPTED point was that our claims of misrepresentation were false.\n \n This example is clearly an ACCURATE example of misrepresentation.\n Here is what Jyoshu said: \"The only 'good' things anyone seems to be able to come up with are that gays can know who around them doesn't support gay marriage... \"\n \n And that is false. The fact that this can be used to combat fraud (which I believe was the MAIN POINT that was promulgated for its usage) was pointed out.\n \n He inaccurately claimed \"The only 'good' things anyone seems to be able to come up...\" when it was blatantly false.\n ========================================\n \n Steeeeve goes on to bring up something that was separate than his link, but I'll address that here.\n \n \nSteeeeve, you didn't know what you were talking about.\n You didn't know that there were NUMEROUS precedents included in the Lawrence v Texas case. \n\n \nWait, weren't you just complaining about people misrepresenting posts?\n\n Steeeeve, you claimed: \"Are we looking at a different case? I am looking at Lawerence v. Texas ruled on in 2003. I guess if you mean \"they used precedent\" as in they reversed precedent then yeah they used it....the case reversed the Bowers decision made 10-15 years earlier.\"\n \n This misrepresented what Lawrence v Texas stated. They used NUMEROUS precedents, which I subsequently pointed out.\n \n \n \nYou didn't know the ACTUAL RATIONALE involved in deciding the case.\n\n \nand you know this how?\n\n You repeatedly failed to argue about the ACTUAL RATIONALE used in Lawrence v Texas.\n At the start of the discussion, you erroneously claimed: \"The case has no merits in law but is based on emotion and feelings of the judges that wrote the opinion.\"\n \n I challenged you to show me ANYWHERE in the ruling where they used their \"emotions and feelings\". You failed on that request.\n Claiming that they did something they didn't do, and refusing to acknowledge what they ACTUALLY did, is a demonstration of you not knowing what they did.\n \n \n \nNo, your chance at a civil discussion has been exhausted on that topic. You can debate Phyllis on there I suppose.\n\n Steeeeve, you're funny.\n You claim that my \"chance at a civil discussion has been exhausted\", but then you continue to discuss with me.\n You REPEATEDLY REFER BACK to the Lawrence v Texas discussion, but you refuse to discuss the ACTUAL CONTENT of the case. You only refer back to it to whine about my observations, yet you REFUTE NONE of my observations.\n \n If you don't think others can see that you OBVIOUSLY CANNOT discuss Lawrence v Texas, but instead want to whine about me pointing out that you cannot discuss it, then you are fooling yourself.", 
   {}, 
   226343, 
   null, 
   1154726340.0
  ], 
  [
   226357, 
   null, 
   "Steeeeve", 
   "Steeeeve, you're funny.\n You claim that my \"chance at a civil discussion has been exhausted\", but then you continue to discuss with me.\n You REPEATEDLY REFER BACK to the Lawrence v Texas discussion, but you refuse to discuss the ACTUAL CONTENT of the case. You only refer back to it to whine about my observations, yet you REFUTE NONE of my observations.\n \n If you don't think others can see that you OBVIOUSLY CANNOT discuss Lawrence v Texas, but instead want to whine about me pointing out that you cannot discuss it, then you are fooling yourself.\n I refer to it as an example of your dicussion style of smearing. The fact that i refuse to address your kooky claims in that thread has nothing to do with me referring back to it.", 
   {}, 
   226350, 
   null, 
   1154727840.0
  ], 
  [
   226359, 
   null, 
   "foundit66", 
   "I refer to it as an example of your dicussion style of smearing. The fact that i refuse to address your kooky claims in that thread has nothing to do with me referring back to it.\n\n No. It's an obvious indicator of a pattern with you.\n \n Because you see, the best defense against slander is the truth. You don't seem to get that.\n \n And you complain about the ACTUAL OBSERVATIONS being made, but habitually fail to argue about whether or not the observations are true.\n \n It's like the boy who cried wolf complaining that people point out that he lies.\n \n You may not realize the significance of that, and that's amazing to me.\n But others get the significance of that...", 
   {}, 
   226357, 
   null, 
   1154728560.0
  ], 
  [
   226363, 
   null, 
   "MrWriteLA", 
   "It's like the boy who cried wolf complaining that people point out that he lies, and he never denies he lies.\n I ran into the syndrome in spades on another gay rights forum some years ago. In that case, the Poster in Question even admitted that he lied, yet still complained about the people who'd pointed it out. Funny, he used to misspell some of the same words Steeeeve does...", 
   {}, 
   226359, 
   null, 
   1154729700.0
  ], 
  [
   226368, 
   null, 
   "Steeeeve", 
   "I ran into the syndrome in spades on another gay rights forum some years ago. In that case, the Poster in Question even admitted that he lied, yet still complained about the people who'd pointed it out. Funny, he used to misspell some of the same words Steeeeve does...\n\n \n Yet here we have a case of everytime Jyoshu says something it is \"a lie\"...but no effort into pointing out how it is a lie...just name calling.", 
   {}, 
   226363, 
   null, 
   1154731440.0
  ], 
  [
   226371, 
   null, 
   "Kronus", 
   "Yet here we have a case of everytime Jyoshu says something it is \"a lie\"...but no effort into pointing out how it is a lie...just name calling.\n\n \n Frankly, his deceptions seem so transparent to me that I can't believe that others don't see them as well; advanced analysis seems redundant. That could well simply be because I've seen them so often and know what to look for, however. For your sake, and the sake of others who may be new here, I'll spell out in greater detail exactly what form his deceptions are taking in the future. Will that satisfy you?\n \n Edit: And for the record, I don't call everything Jyoshu says a lie. Just the lies. :)", 
   {}, 
   226368, 
   null, 
   1154735460.0
  ], 
  [
   226374, 
   null, 
   "foundit66", 
   "Yet here we have a case of everytime Jyoshu says something it is \"a lie\"...but no effort into pointing out how it is a lie...just name calling.\n\n \"everytime\" eh?\n \"no effort into pointing out how it is a lie\" eh?\n \n I welcome you to give ANY example of what you claim...", 
   {}, 
   226368, 
   null, 
   1154737320.0
  ], 
  [
   226377, 
   null, 
   "jyoshu", 
   "For your sake, and the sake of others who may be new here, I'll spell out in greater detail exactly what form his deceptions are taking in the future. Will that satisfy you?\n \n Edit: And for the record, I don't call everything Jyoshu says a lie. Just the lies. :)\n\n \n The future? You haven't even specified the instances behind your current accusations. I'm still waiting for you to simply specify what 'lies' you're talking about. \n \n In a matter of a few posts your progression of posts have devolved into nothing less than a smear campaign. Since you're determined to abandon the topical discussion for this, let's look at your smear progression, shall we?\n - You started on a lighter note by saying I rarely know what your movement is about. Maybe that's the case.\n \n - Then however, you progressed by saying something about \"leaving the realm of honest debate\".\n \n - Next, you said I'd blown my \"goodwill\" and that I'd been deceitful. \n \n - Then you ratcheted it up and changed your terminlogy to saying I \"lie\" \n \n - Then you go one step farther and asserting that I'm a \"liar\", no longer addressing my arguments and statements but focusing on me personally (without saying how and where I've lied, I might add).\n \n - At this point, you're no longer posting on topic at all, and are devoting your few posts here entirely toward your reckless accusations, and defending your indefensible smears.\n So basically, you have not made a single post since post #11 that wasn't a personal smear of some kind (we're now at 35 posts in this thread). Since post #15, you abandoned the actual topic of the thread completely (even though I was still asking you to confirm your stance at that point on the topic) infavor of using it as a platform for your accusations (with no citations as proof). As far back as post #14 I even asked you specifically (and politely) to \"please stop.\"\n \n Is that a debate record you're actually proud of??? To not be able to go more than a very few posts without decending into completely into off-topic personal attacks? Because that's what you've done.\n \n In case you care anything whatsoever about debate and care to actually get back on topic, I'll ask again what I last asked in post #16, which you never answered: So you agree then, that there isn't really that much of a broad culture war going on against gays except that which is limited in scope by some fringe fundies?", 
   {}, 
   226371, 
   null, 
   1154739540.0
  ], 
  [
   226410, 
   null, 
   "Matthew S", 
   "\n \n In case you care anything whatsoever about debate and care to actually get back on topic, I'll ask again what I last asked in post #16, which you never answered: So you agree then, that there isn't really that much of a broad culture war going on against gays except that which is limited in scope by some fringe fundies?\n\n \n That finge fundie group has control of the republican party and the repubilcan party has the US by the throat. But it is more then a fringe fundie groups. It is Pat robertson, Jerry Falwell, James Dobson and their organizations. The AFA, Conserned Women of America, The anti gay marriage organizations in every state that are puting marriage amendments on the ballot. Kenneth Blackwell from ohio, Jeff Sessions, Tom Delay, Bob Frist, George W Bush, Maryln Musgrave of colorado, and the majority of top republican party leaders in congress, Dick Devos of Michigan, Ralph Reed, Pat Bucannan, The christian cololition, the southern baptists and the southern baptist convention, the roman Catholic chrurch, any church with bible in its name and there are many more people and organizations that I haven't listed that are anti gay and involved in the culture war. All of these groups, and people, have an anti gay agenda they are either leaders of the culture war or soldiers of that war.", 
   {}, 
   226377, 
   null, 
   1154777460.0
  ], 
  [
   226415, 
   null, 
   "Kronus", 
   "\n To not be able to go more than a very few posts without decending into completely into off-topic personal attacks? \n\n If you want to classify calling you on it when you're deceitful a personal attack I can't stop you, but it's not going to stop me from doing it. If you don't want debates to go off topic then stop flying off the handle when you get caught at it, or better yet stop doing it all together.\n \n \n\n I'll ask again what I last asked in post #16, which you never answered: So you agree then, that there isn't really that much of a broad culture war going on against gays except that which is limited in scope by some fringe fundies?\n\n \n Ok, lets go with this one. No Jyoshu, I don't agree with this, and nothing I've posted in this thread should lead you to think so. You just pulled that bit about the fundies out of nowhere and tried to sneak it in there. And of course you've also been trying to pretend that \"culture war\" and predjudice are the same, and haven't backed off from that stance, so by trying to get me to agree to this particular wording you are in fact trying to get me to say that not many people are prejudiced, which I have specifically said I don't believe. So in that one question we have both a bait and switch and an underhanded attempt to deflect blame. All this after I pointed out that I thought you were being deceitful. \n \n Are you happier now that you've gotten a more detailed analysis of how you're dishonest in debate? I suppose I could have \"fallen for it\" and let you actually pull the bait and switch to gather harder evidence, but is it really necessary?", 
   {}, 
   226377, 
   null, 
   1154792940.0
  ], 
  [
   226427, 
   null, 
   "jyoshu", 
   "That finge fundie group has control of the republican party and the repubilcan party has the US by the throat. But it is more then a fringe fundie groups. It is Pat robertson, Jerry Falwell, James Dobson and their organizations. The AFA, Conserned Women of America, The anti gay marriage organizations in every state that are puting marriage amendments on the ballot. Kenneth Blackwell from ohio, Jeff Sessions, Tom Delay, Bob Frist, George W Bush, Maryln Musgrave of colorado, and the majority of top republican party leaders in congress, Dick Devos of Michigan, Ralph Reed, Pat Bucannan, The christian cololition, the southern baptists and the southern baptist convention, the roman Catholic chrurch, any church with bible in its name and there are many more people and organizations that I haven't listed that are anti gay and involved in the culture war. All of these groups, and people, have an anti gay agenda they are either leaders of the culture war or soldiers of that war.\n\n \n So then am I to assume you DO believe there is a widespread culture war against gays?\n \n \nAnd of course you've also been trying to pretend that \"culture war\" and predjudice are the same, and haven't backed off from that stance, so by trying to get me to agree to this particular wording you are in fact trying to get me to say that not many people are prejudiced, which I have specifically said I don't believe. So in that one question we have both a bait and switch \n \n Are you happier now that you've gotten a more detailed analysis of how you're dishonest in debate? I suppose I could have \"fallen for it\" and let you actually pull the bait and switch to gather harder evidence, but is it really necessary?\n\n \n I am happier because at least there's now something to analyze. (Though if this is the best you can do to back up asserting that someone is a \"liar\" I don't think I have too much to worry about here.) So when you contradict yourself, you don't want me to note it? There's no bait and switch going on here--you're imagining things. The wording I'm using is to try to get you to understand that they might as well be one and the same. When you say you disagree with the idea ofa culture war, I believe that means you disagree with the idea that there is widespread prejudice. I don't think you can have your cake and eat it too here--This is a case where I think Matthew is more on target than you are citing examples of what he believes is a culture war.\n \n I think what's really happening here is, to avoid the prospect of the article debunking something you hold to, you're switching your stance and watering it down on the fly, by saying it's not a culture war, but just merely \"widespread prejudice\". Essentially, you're trying to move the goalposts. You've tried to reframe the debate to be about your view that widespread prejudice and culture war are not the same thing.\n \n And before you start into the usual claim-without-evidence \"liar\" accusations, I haven't lied about you at all here--I'm telling you what it looks like to me.", 
   {}, 
   226410, 
   null, 
   1154799120.0
  ], 
  [
   226450, 
   null, 
   "Matthew S", 
   "So then am I to assume you DO believe there is a widespread culture war against gays?\n \n\n \n \n YES \n These people will never give up their war on us untill we are dead, wiped out of existance, converted, cured, or they die off. \n \n I sometimes believe that things will not change until several southern cites go up in flames and riots as they did in the 1960's", 
   {}, 
   226427, 
   null, 
   1154830440.0
  ], 
  [
   226482, 
   null, 
   "Kronus", 
   "Just a final analysis, mostly for Steve's sake.\n \n \n\n So when you contradict yourself, you don't want me to note it? \n\n I didn't, of course. I simply didn't agree with his assertion that two different things were the same thing.\n \n \n\n There's no bait and switch going on here--you're imagining things.\n\n Lie. He knew I didn't accept his correlation, so rather than try to prove it he tried to trick me into accepting it.\n \n \n\n The wording I'm using is to try to get you to understand that they might as well be one and the same. \n\n Another lie. If he wanted me to understand he would have tried explaining, not the bait and switch.\n \n \n\n When you say you disagree with the idea ofa culture war, I believe that means you disagree with the idea that there is widespread prejudice.\n\n Since I explicitly said I don't believe that, his assertions about what I believe are clearly not true. As for whether he really believes that his assertion is true himself; possible, but I doubt it. Jyoshu is too intelligent to not know the difference. \n \n \n\n I think what's really happening here is, to avoid the prospect of the article debunking something you hold to, you're switching your stance and watering it down on the fly, by saying it's not a culture war, but just merely \"widespread prejudice\". \n\n Blatant twisting of both what I and the article say. Jyoshu is the only one trying to equate prejudice and culture wars. The article says nothing like that, and I've been saying they're different from the word go.\n \n \n\n You've tried to reframe the debate to be about your view that widespread prejudice and culture war are not the same thing.\n\n They, of course, aren't the same thing; see above. And of course since this is his thesis, discussing it is the core of the debate. But Jyoshu knew he could never show that they're the same legitimately, so he resorted to lies and trickery. And also, he jumped at the chance to deflect attention from the crucial flaw in his argument by going after me when I pointed it out.\n \n \n So, that's it for this thread I think.", 
   {}, 
   226427, 
   null, 
   1154877060.0
  ], 
  [
   226490, 
   null, 
   "jyoshu", 
   "Just a final analysis, mostly for Steve's sake.\n\n \n I'm right here, Kronos. If you want to argue about this somemore, you don't have to do it in the 3rd person--you can address me directly. Steeeeve agrees with me, remember? Now even though you seem to be pretending to be talking about me instead of TO me, I'll respond to you, because I consider it somewhat rude to not have the courtesy to respond to someone directly (instead of in the 3rd person) if you have something to say to them. \n \n \nLie. He knew I didn't accept his correlation, so rather than try to prove it he tried to trick me into accepting it.\n\n \n No one is trying to \"trick\" you into anything. This is not a 'lie'; I really was not trying any bait and switch. If there's any 'lie' going on here, it's your assertion in the first place that it's a bait and switch. But this is getting downright silly--you're basically to the point of taking anything you see differently than me and asserting that it's a lie on my part because I see it differently. Ridiculous.\n \n \nAnother lie. If he wanted me to understand he would have tried explaining, not the bait and switch.\n\n \n I did try explaining. And I'm getting curious as to what specific standard(s) you go by in deciding what is a lie or not. Apparently your standards are VERY, VERY anything-goes and ill-defined for deciding what a lie is and isn't. in fact, I suspect you're just throwing the word around at this point, because you're to the point of taking anything and calling it lie, simply on the basis of difference of opinion. You're taking you OWN assertions \"of bait-and-switch\" and pretending their gospel, when I could just as easily argue that the assertion you've made of a 'bait and switch' is a lie. (If I used the reckless open-ended-standards you're using for what constitutes a lie.) \n \n So Kronos, you're a LIAR because you are asserting I haven't tried explaining this to you. (Wow, using anything-goes standards for calling someone a liar works pretty well, Kronos--now I see why you're doing it. But it's not my style, and it not debating with integrity, so I probably won't use your tactic.)\n \n \nSince I explicitly said I don't believe that, his assertions about what I believe are clearly not true. As for whether he really believes that his assertion is true himself; possible, but I doubt it. Jyoshu is too intelligent to not know the difference. \n\n \n If that's what you believe, fine. But you are approaching the issue like your view is gospel--I accept that's what you believe. I'm not saying you don't; I'm saying I think you are wrong--we simply have a difference of opinion here. No one is LYING. \n \n \nBlatant twisting of both what I and the article say. Jyoshu is the only one trying to equate prejudice and culture wars. The article says nothing like that, and I've been saying they're different from the word go.\n\n \n You're the one that brought them up as two separate entities. The phrase widespread prejudice did not even come into this debate until you brought it up, trying to shift things in that direction. (That's my opinion, anyway. Apparently I need to amend everything I say with that caveat, or you'll claim it's a 'lie', and therefore lie yourself.)\n \n \nThey, of course, aren't the same thing; see above. And of course since this is his thesis, discussing it is the core of the debate. But Jyoshu knew he could never show that they're the same legitimately\n \n \n I don't have to show their the same legitimately--that's a strawman you've created. Remember, you brought up \"widespread prejudice,\" not me. Since you brought it up, you need to show how they are different. \n \n \nSo, that's it for this thread I think.\n\n \n Apparently not, since you seem determined to keep this disagreement alive. I thought we were done.", 
   {}, 
   226482, 
   null, 
   1154884500.0
  ], 
  [
   226508, 
   null, 
   "Kronus", 
   "I'm right here, Kronos. If you want to argue about this somemore, you don't have to do it in the 3rd person--you can address me directly. Steeeeve agrees with me, remember? \n\n \n Exactly. You know what you're up to, but Steve seems to not get it. I know you'll never fess up, but Steve may come around. That's why it was addressed to him.", 
   {}, 
   226490, 
   null, 
   1154890380.0
  ], 
  [
   226512, 
   null, 
   "jyoshu", 
   "Exactly. You know what you're up to, but Steve seems to not get it. I know you'll never fess up, but Steve may come around. That's why it was addressed to him.\n\n \n Kronos, I'm not \"up to\" anything. There's noting to 'fess up' to. You've abandoned even responding to my posts. I've explained what's going on--no one's 'lying' to you.", 
   {}, 
   226508, 
   null, 
   1154891520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"Culture war\" in America may be overblown", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8634-culture-war-america-may-overblown.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8634, 
  "discussion_files": [
   [
    "1459.html", 
    "http://www.4forums.com/political/gay-rights-debates/8634-culture-war-america-may-overblown-print.html"
   ], 
   [
    "1460.html", 
    "http://www.4forums.com/political/gay-rights-debates/8634-culture-war-america-may-overblown-3-print.html"
   ], 
   [
    "1461.html", 
    "http://www.4forums.com/political/gay-rights-debates/8634-culture-war-america-may-overblown-2-print.html"
   ]
  ], 
  "identifier": 8634
 }
]