[
 [
  [
   226316, 
   null, 
   "jyoshu", 
   "LOL, I wonder how global warming activists feel about their newest member?\n \n http://news.yahoo.com/s/nm/20060803/od_uk_nm/oukoe_uk_robertson_1\n \n But despite Robertson's conversion due to the heat, it's not necessarly a sign of global warming at all--and certainly not the hottest summer on record.\n \n http://www.cnsnews.com/ViewNation.asp?Page=/Nation/archive/200608/NAT20060804c.html", 
   {
    "post_info": {
     "post_title": "Global Warming Activists' Newest Ally: Pat Robertson!"
    }
   }, 
   null, 
   null, 
   1154721300.0
  ], 
  [
   226345, 
   null, 
   "Jo Bennett", 
   "Robertson, like the proverbial stopped clock, is sometimes right by sheer luck.\n \n As for your second point, 9 of the 10 hottest years on record have been in the last decade. The fact that there are local variations is neither here nor there.", 
   {}, 
   226316, 
   null, 
   1154725980.0
  ], 
  [
   226383, 
   null, 
   "jyoshu", 
   "As for your second point, 9 of the 10 hottest years on record have been in the last decade. The fact that there are local variations is neither here nor there.\n\n \n Maybe. There's good scientists on both sides of the issue.\n \n But regarding Robertson, he's not basing his views on science at all. He's basing it on the fact he was hot the other day.", 
   {}, 
   226345, 
   null, 
   1154742000.0
  ], 
  [
   226399, 
   null, 
   "Steeeeve", 
   "Does anyone else get the impression that he might have alsheimers? I am not saying that to be mean because it is an aweful disease, it just appears to me he is developing it.", 
   {}, 
   226383, 
   null, 
   1154761200.0
  ], 
  [
   226400, 
   null, 
   "Master_Shake", 
   "Maybe. There's good scientists on both sides of the issue.\n\n No. There really aren't. If you want to live in LaLa Land and pretend climate change isn't happening, be my guest, but don't try to make it seem as if there is some major controversy in the scientific community about it when there isn't.", 
   {}, 
   226383, 
   null, 
   1154764860.0
  ], 
  [
   226408, 
   null, 
   "Jo Bennett", 
   "Maybe. There's good scientists on both sides of the issue.\n \n But regarding Robertson, he's not basing his views on science at all. He's basing it on the fact he was hot the other day.\n\n \n No, there really aren't. As for Robertson, why do you think I said he was right (as in global warming is happening and we are largely responsible) by sheer luck?", 
   {}, 
   226383, 
   null, 
   1154774340.0
  ], 
  [
   226454, 
   null, 
   "jyoshu", 
   "No, there really aren't. As for Robertson, why do you think I said he was right (as in global warming is happening and we are largely responsible) by sheer luck?\n\n \n Yes, there ARE good scientists on both sides of the issue--you've been shown this before already in another thread, as I recall.", 
   {}, 
   226408, 
   null, 
   1154831820.0
  ], 
  [
   226477, 
   null, 
   "Jo Bennett", 
   "No, it's been claimed before in other threads, and all that has come up are people who don't specialise in the subject or people on the pay roll of the oil companies.", 
   {}, 
   226454, 
   null, 
   1154863500.0
  ], 
  [
   226504, 
   null, 
   "Ripskar", 
   "Here's a list of papers published in New Scientist on Global Warming, which do you think show that it isn't happening?\n \n 1. The bucket of bugs we all came from\n There are hundreds of times more species of microbes in the oceans than previously thought, a genetic analysis of sea samples reveals\n 06 August 2006 Breaking News \n 2. The bucket of bugs we all came from\n There are hundreds of times more species of microbes in the oceans than previously thought, a genetic analysis of sea samples reveals\n 05 August 2006 From magazine issue 2563 News \n 3. 60 Seconds\n 05 August 2006 From magazine issue 2563 News \n 4. Ocean acidification: the other CO2 problem\n As the oceans soak up ever more carbon dioxide, coral reefs could perish along with innumerable other sea creatures. New Scientist reports on a disaster in the making\n 05 August 2006 From magazine issue 2563 Features \n 5. New pathway to pollution in Arctic\n As global warming allows new shipping shortcuts through the Arctic, the pristine environment may suffer \n 26 July 2006 From magazine issue 2561 News \n 6. Global warming will hurt Californian wine industry\n The changing climate could scorch up to 80% of the US's grape-growing areas, making them too hot to produce wine by the end of the century\n 15 July 2006 From magazine issue 2560 News \n 7. Editorial: Kyoto in crisis\n Can the protocol survive a loss of faith from Germany, its staunchest supporter?\n 08 July 2006 From magazine issue 2559 Editorial \n 8. Review: An Inconvenient Truth\n Al Gore may be a master at getting his message across, but his new movie is still an unlikely success story - what are the magic ingredients?\n 08 July 2006 From magazine issue 2559 Review \n 9. The hidden cost of wind turbines\n When the turbines go up, it's not just the scenery that suffers, it's the atmosphere too. Ed Douglas reveals the environmental costs of wind power\n 08 July 2006 From magazine issue 2559 Features \n 10. Bird extinction rates far worse than realised\n Every year another species of bird vanishes forever, and the rate could accelerate to 10 per year by the end of the century\n 03 July 2006 Breaking News \n 11. US Congress starts to believe in climate change\n A weighty report concludes that the controversial 'hockey stick' graph showing global warming this century is real\n 01 July 2006 From magazine issue 2558 News \n 12. Carbon proposals\n 01 July 2006 From magazine issue 2558 Letters \n 13. Histories: The parable of the vanishing fish\n In 1386 the Mayor of London wanted answers to a question that was bothering the entire city. Why had all the fish disappeared from the river Thames? The culprit was one of the most powerful women in England, the Abbess of Barking\n 01 July 2006 From magazine issue 2558 Histories \n 14. Why aliens love a good moon\n Who says ET lives on a planet? We may be more likely to find him on a giant moon rocked by violent earthquakes and volcanic eruptions\n 30 June 2006 From magazine issue 2558 Features \n 15. Fertilisers give the lungs of the planet bad breath\n Rainforest soils polluted with fertilisers could trigger the release of disproportionately large quantities of carbon dioxide\n 28 June 2006 From magazine issue 2557 News \n 16. Venus's double vortex raises new mystery\n The atmospheric structure, long ago detected over the planet's north pole, has been seen for the first time above the south pole - but its cause is unknown\n 27 June 2006 Breaking News \n 17. US Supreme Court to rule on climate change\n The court will decide whether the evidence for global warming is sufficient to merit controls on carbon dioxide emissions from cars\n 27 June 2006 Breaking News \n 18. US report backs study on global warming\n A report commissioned by the US Congress backs findings that the past few decades were the warmest in 400 years\n 23 June 2006 Breaking News \n 19. Kyoto promises are nothing but hot air\n Governments are hugely under-reporting greenhouse gas emissions from their territories\n 22 June 2006 From magazine issue 2557 News \n 20. Histories: Captain William's obsession with tides\n In the 18th century, commercial ships often ran a gauntlet when approaching a dock, but one man took the guesswork out of tide prediction\n 17 June 2006 From magazine issue 2556 Histories \n 21. Tidal stretch\n 17 June 2006 From magazine issue 2556 Letters \n 22. Night flights give bigger boost to global warming\n Analysis of aircraft movements reveal that contrails left by night flights cause more warming than those of daytime flights\n 14 June 2006 From magazine issue 2556 News \n 23. The rise and fall of William Shockley\n How can someone go from being a Nobel-prizewinning physicist and entrepreneur to a detested outsider? An answer is provided by Broken Genius, which vividly portrays the life of \"the creator of the electronic age\"\n 10 June 2006 From magazine issue 2555 Review \n 24. The heat is on for desert life\n Global warming and human incursions are set to make life harder than ever for the highly specialised creatures and plants that live in the driest places on Earth\n 10 June 2006 From magazine issue 2555 News \n 25. Coral algae could adapt to warming\n The algae that live inside coral polyps may be able to adapt to global warming - up to a point\n 10 June 2006 From magazine issue 2555 News", 
   {
    "unicode_changes_made": true
   }, 
   226477, 
   null, 
   1154888160.0
  ], 
  [
   226718, 
   null, 
   "jyoshu", 
   "No, it's been claimed before in other threads, and all that has come up are people who don't specialise in the subject or people on the pay roll of the oil companies.\n\n \n See, this is the problem I have with your view. Anyone who was really interested in good science would never make blanket statements like 'there are no good scientists on the other side of the issue' (which by saying no to me, you're essentially saying). It's not only an insult to those scientists, it abandons the scientific process of peer-review, skepticism, etc. Views like yours on this sound more like fundamentalists than scientists.\n \n I suspect you have no degree in a related field such as climatology, and yet you claim some very well-known and good scientists are not good scientists:\n [*]Patrick Michaels from the Department of Environmental Services at the University of Virginia[*]Robert Balling of Arizona State University[*]Sherwood B. Idso of the U.S. Water Conservation Laboratory[*]Fred Singer, atmospheric physicist and professor emeritus of environmental sciences at the University of Virginia[*]Richard Lindzen of Massachusetts Institute of Technology.[*]Frederick Seitz (anti-global warming treaties, accepts the temperature rise as real, but not yet properly explained)[*]William M. Gray, emeritus professor at Colorado State University and one of the world's leading experts on tropical storms. Claims that there is no link between increasing ocean temperatures and more intense hurricanes in recent decades and dismisses computer climate models.[*]Roy Spencer, known for his satellite-based temperature monitoring work\n Remember that in the context of the global warming debate, self-identifying as an opponent of global warming doesn't mean necessarily that one doesn't accept the earth is warming, but rather that they don't believe it is warming because of human causes. So unlike what you apparently believe, there certainly ARE those who have a different view on this who also specialize in the field.\n \n http://en.wikipedia.org/wiki/Global_warming_controversy\n \n http://en.wikipedia.org/wiki/List_of_scientists_opposing_global_warming_consensus\n \n There ARE good scientists on both sides of the issue.", 
   {}, 
   226477, 
   null, 
   1154998260.0
  ], 
  [
   226719, 
   null, 
   "jyoshu", 
   "Here's a list of papers published in New Scientist on Global Warming, which do you think show that it isn't happening?\n\n \n The issue is not whether the earth is warming--that's not what being on the other side of the global warming debate means. The issue is, assuming it is getting warmer, whether the cause is natural or because of humans.", 
   {}, 
   226504, 
   null, 
   1154998560.0
  ], 
  [
   226733, 
   null, 
   "Kronus", 
   "The issue is not whether the earth is warming--that's not what being on the other side of the global warming debate means. The issue is, assuming it is getting warmer, whether the cause is natural or because of humans.\n\n \n That's an interesting question, but does the answer really matter? We know the Earth is getting warmer, and we know this will have devastating effects on millions if not billions of people. Given that, shouldn't we do everything we can to reverse the trend, even if we aren't the primary cause? We know that greenhouse gases can contribute to warming, so even if we can't prove that they're causing the current warming trend, shouldn't we cut them anyway, simply because that's all we can do?", 
   {}, 
   226719, 
   null, 
   1155008820.0
  ], 
  [
   226737, 
   null, 
   "Steeeeve", 
   "That's an interesting question, but does the answer really matter? We know the Earth is getting warmer, and we know this will have devastating effects on millions if not billions of people. Given that, shouldn't we do everything we can to reverse the trend, even if we aren't the primary cause? We know that greenhouse gases can contribute to warming, so even if we can't prove that they're causing the current warming trend, shouldn't we cut them anyway, simply because that's all we can do?\n\n It would be bad to waste your time when you coulda been spending resources on a way to actually identify and fix the problem assuming there is one", 
   {}, 
   226733, 
   null, 
   1155009960.0
  ], 
  [
   226743, 
   null, 
   "Kronus", 
   "It would be bad to waste your time when you coulda been spending resources on a way to actually identify and fix the problem assuming there is one\n\n \n Well, first off we don't have to assume that there's a problem. We know that average temperature are increasing; it's not rocket science, it just takes reading a thermometer and writing down the result. That aside, what you say is true in general, of course. But in this particular case cutting greenhouse gas emmisions is all we can do. It's the only thing that can have an effect that's under our control. There is simply no way to know, with 100% iron clad scientific certainty, what's casuing global warming. But we do know, with absolute certainty, that greenhouse gases could be responsible to some degree, and that if that's the case then reducing emmisions would help. There are other theories as to what's behind global warming, but none of them involve anything that humans have control over. At this point we only have two options. Do the only thing available to us that might help, or do nothing. Considering what's at stake, doing nothing seems like a trully horrible idea. Even if greenhouse gas emmisions aren't the root cause of global warming reducing them could still help. If you know of anything else that we could do that has a chance of helping I'd love to hear it, because from what I've read this is our only option.", 
   {}, 
   226737, 
   null, 
   1155016260.0
  ], 
  [
   226762, 
   null, 
   "Jo Bennett", 
   "Let's look at that list shall we?\n \n Patrick Michaels - known to have received money from at least 1 energy company, and edits the World Climate Report which is funded by the Western Fuels Association, major suppliers of coal in the western US.\n \n Robert Balling - reported to have received $400,000 from oil and coal companies including Exxon-Mobil\n \n Sherwood B. Idso - of the Center for the Study of Carbon Dioxide and Global Change, has been on the pay roll of Western Fuels and received money from Exxon-Mobil.\n \n Fred Singer - one of the more amusing candidates, veteran rent-a-scientist for not only Exxon-Mobil but for big tobacco firms needing a stooge too.\n \n Richard Lindezen - reportedly received $2500/day for consulting on behalf of oil and coal companies, and has links to the WFA front organisation Greening Earth.\n \n Frederick Seitz - specialism is in solid state physics, yet feels himself qualified to talk on both tobacco effects and global warming. Funding of his SEPP organisation remains obscure, though he is believed to have links to the Moonies.\n \n William M. Gray - so far the only one who doesn't appear to have dubious funding sources. However, while he may be perfectly qualified to dispute the effects of warming on hurricanes, the fact remains that he is not a specialist in the area of warming itself. As far as I can tell he has not published papers on the subject.\n \n Roy Spencer - a supporter of intelligent design which suggests his scientific credentials are suspect right off the bat. Again, his papers are not on the issue itself, but solely on temperature monitoring.\n \n So we've got 2 guys in areas semi-detached from the subject, one of whom is prepared to substitute religion for science when it suits him, and the others of whom is a conspiracy theorist. Hardly a brilliant selection of \"good scientists\".", 
   {}, 
   226743, 
   null, 
   1155040560.0
  ], 
  [
   226785, 
   null, 
   "jyoshu", 
   "That's an interesting question, but does the answer really matter? We know the Earth is getting warmer, and we know this will have devastating effects on millions if not billions of people.\n\n \n Of course it matters! If it's being caused by humans it's something we can do something about, assuming enough people understand the need.\n \n \nGiven that, shouldn't we do everything we can to reverse the trend, even if we aren't the primary cause? We know that greenhouse gases can contribute to warming, so even if we can't prove that they're causing the current warming trend, shouldn't we cut them anyway, simply because that's all we can do?\n\n \n If humans aren't the cause, then why should they, given the regulatory and economic issues involved. If it's going to happen regardless. If you knew a 10,000-acre forest fire was approaching your house, is there really any point in buying a box of fire extinguishers, or making rules to have them placed in every room? \n \n And just so you don't misinterpret my statements (as a lie or whatever else), let me add that I'm not necessarily siding with those against global warming here. I'm saying that there are good scientists on both sides of the issue.", 
   {}, 
   226733, 
   null, 
   1155051840.0
  ], 
  [
   226789, 
   null, 
   "jyoshu", 
   "Let's look at that list shall we?\n \n Patrick Michaels - known to have received money from at least 1 energy company, and edits the World Climate Report which is funded by the Western Fuels Association, major suppliers of coal in the western US.\n \n Robert Balling - reported to have received $400,000 from oil and coal companies including Exxon-Mobil\n \n Sherwood B. Idso - of the Center for the Study of Carbon Dioxide and Global Change, has been on the pay roll of Western Fuels and received money from Exxon-Mobil.\n \n Fred Singer - one of the more amusing candidates, veteran rent-a-scientist for not only Exxon-Mobil but for big tobacco firms needing a stooge too.\n \n Richard Lindezen - reportedly received $2500/day for consulting on behalf of oil and coal companies, and has links to the WFA front organisation Greening Earth.\n \n Frederick Seitz - specialism is in solid state physics, yet feels himself qualified to talk on both tobacco effects and global warming. Funding of his SEPP organisation remains obscure, though he is believed to have links to the Moonies.\n \n William M. Gray - so far the only one who doesn't appear to have dubious funding sources. However, while he may be perfectly qualified to dispute the effects of warming on hurricanes, the fact remains that he is not a specialist in the area of warming itself. As far as I can tell he has not published papers on the subject.\n \n Roy Spencer - a supporter of intelligent design which suggests his scientific credentials are suspect right off the bat. Again, his papers are not on the issue itself, but solely on temperature monitoring.\n \n So we've got 2 guys in areas semi-detached from the subject, one of whom is prepared to substitute religion for science when it suits him, and the others of whom is a conspiracy theorist. Hardly a brilliant selection of \"good scientists\".\n\n \n Your post here is pretty much entirely a logical fallacy on your part.\n \n It's known as Guilt by Association . . .\n \n Guilt by Association is the attempt to discredit an idea based upon disfavored people or groups associated with it. This is the reverse of an Appeal to Misleading Authority, and might be justly called \"Appeal to Anti-Authority\". An argument to authority argues in favor of an idea based upon associating an authority figure with the idea, whereas Guilt by Association argues against an idea based upon associating it with disreputable people or groups. (from FallacyFiles.com)\n \n Essentially what this means is that you are using a fallacy; the point being that just because these men have (or may have) received funds or have ties to energy companies does not mean they have can't or haven't conducted good science to come to their conclusions. Their science and processes should be looked at independently of whatever motivations they might have. Your argument is no different than saying, for instance, that we should automatically discount the views of someone regarding the development of a fetus within the context of the abortion debate, simply because they are given support by Planned Parenthood.\n \n The same can be said of automatically discrediting a scientist due to their religion. (By your standards, Issac Newton, one of the greatest scientists who ever lived, was a bad scientist! As would be William Thomson.)", 
   {}, 
   226762, 
   null, 
   1155052620.0
  ], 
  [
   226791, 
   null, 
   "Steeeeve", 
   "Well, first off we don't have to assume that there's a problem. We know that average temperature are increasing; it's not rocket science, it just takes reading a thermometer and writing down the result. \n this alone doesn't establish a problem.\n \n \n Considering what's at stake, doing nothing seems like a trully horrible idea. Even if greenhouse gas emmisions aren't the root cause of global warming reducing them could still help. If you know of anything else that we could do that has a chance of helping I'd love to hear it, because from what I've read this is our only option.\n Your post seemed like the same reasoning behind the Iraq war. \"We don't know for 100% certain if Iraq has WMDs but we only have 2 opitions...if we don't invade they might fire them and cause WWIII or we could invade them and find out for sure\". Perhaps with a little more thought (as we know now) the US could have come up with a better plan. \n \n We keep barking up the tree of humans causing the problem but no one is bothering to look at solutions to what other causes their might be. It seems that saying \"we can't do anything about it\" isn't good enough. I think we should find out what tree to bark out before we begin doing so :)", 
   {}, 
   226743, 
   null, 
   1155054000.0
  ], 
  [
   226792, 
   null, 
   "Jo Bennett", 
   "My statement was that opponents of global warming are either in the pay of the oil companies or not specialists in the field. I have just stated which and how this applies for each of those listed. If you want to make the claim that their science is good, feel free to state the science and explain how it disproves the overwhelming body of evidence in favour of anthropogenic warming.", 
   {}, 
   226791, 
   null, 
   1155054300.0
  ], 
  [
   226798, 
   null, 
   "Kronus", 
   "\n If humans aren't the cause, then why should they, given the regulatory and economic issues involved. If it's going to happen regardless. \n\n Even if we aren't the primary cause greenhouse gases are still probably contributing. Even if temperatures were going to rise anyway we're probably pushing them up faster and higher. Basically, we only have one thing we can do, there's only one knob we can turn. It may halt global warming, it may just slow it down, there's even a non-zero chance that it won't do a thing. But given that it's the only knob we have, and given how disasterous inaction will be, how can we do anything but turn it?\n \n \n \n\n And just so you don't misinterpret my statements (as a lie or whatever else), let me add that I'm not necessarily siding with those against global warming here. \n\n Don't worry, I have no trouble telling the difference between a lie and a difference of opinion. I am, however, having trouble with the phrase \"not necessarily siding\". Telling us what you might not be doing is all well and good, but how about telling us what you are definately doing. Do you have a stance, or are you undecided?", 
   {}, 
   226785, 
   null, 
   1155055680.0
  ], 
  [
   226799, 
   null, 
   "Waxy", 
   "Your post here is pretty much entirely a logical fallacy on your part.\n \n It's known as Guilt by Association . . .\n \n Guilt by Association is the attempt to discredit an idea based upon disfavored people or groups associated with it. This is the reverse of an Appeal to Misleading Authority, and might be justly called \"Appeal to Anti-Authority\". An argument to authority argues in favor of an idea based upon associating an authority figure with the idea, whereas Guilt by Association argues against an idea based upon associating it with disreputable people or groups. (from FallacyFiles.com)\n \n Essentially what this means is that you are using a fallacy; the point being that just because these men have (or may have) received funds or have ties to energy companies does not mean they have can't or haven't conducted good science to come to their conclusions. Their science and processes should be looked at independently of whatever motivations they might have. Your argument is no different than saying, for instance, that we should automatically discount the views of someone regarding the development of a fetus within the context of the abortion debate, simply because they are given support by Planned Parenthood.\n \n The same can be said of automatically discrediting a scientist due to their religion. (By your standards, Issac Newton, one of the greatest scientists who ever lived, was a bad scientist! As would be William Thomson.)\n\n \n Well done Jyoshu. emoticon_xgood \n \n I get so sick and tired of this fallacy that I just ignore these threads for the most part now.\n \n Ever stop to wonder about all the \"scientists\" out there that publish pro anthropogenic warming papers? Where does their funding come from? What organizations are they affiliated with? The righteous position assumed by the \"man's fault\" side is nonsense, an d is the text book example of your second fallacy.\n \n The whole thing is a joke. It's simply a way of avoiding having to give any thought or credence to science that doesn't fit the mainstream mantra of global warming. \n \n Simply put, it's unscientific.\n \n Waxy", 
   {}, 
   226789, 
   null, 
   1155056280.0
  ], 
  [
   226854, 
   null, 
   "jyoshu", 
   "Even if we aren't the primary cause greenhouse gases are still probably contributing. Even if temperatures were going to rise anyway we're probably pushing them up faster and higher. Basically, we only have one thing we can do, there's only one knob we can turn. It may halt global warming, it may just slow it down, there's even a non-zero chance that it won't do a thing. But given that it's the only knob we have, and given how disasterous inaction will be, how can we do anything but turn it?\n\n \n That may be true; but it needs to be weighed against the cost of making such changes (and I'm not saying I know what those costs are; i don't), as well as the repercussions more regulation. \n \n \n Do you have a stance, or are you undecided?\n\n \n I already have, more than once now: that there are good scientists on both sides of the issue. That's what Jo Bennett disagreed with, and it's the discussion you weighed in on.", 
   {}, 
   226798, 
   null, 
   1155070620.0
  ], 
  [
   226873, 
   null, 
   "Kronus", 
   "That may be true; but it needs to be weighed against the cost of making such changes (and I'm not saying I know what those costs are; i don't), as well as the repercussions more regulation. \n\n It'll cost the oil and coal companies, that's fairly certain. But the development of new technologies will spur the economy in other ways. And of course if it works the savings would be huge, both in terms of property damage avoided and loss of human life. I don't know what the final costs would be either, but given what's at stake there's no way they can be too high to try. The drain on the economy would be tiny compared to, say, the Iraq war, and the potential benefits are huge. Likewise, the costs if we do nothing could be staggering.\n \n \n\n I already have, more than once now: that there are good scientists on both sides of the issue. \n\n That's true, you did say that. But you also said \"let me add that I'm not necessarily siding with those against global warming here.\" , and that's what I was asking about. Which side of the issue, if any, are you on? Do you think people are responsible for global warming? Contribute? Have had no effect? Or do you not have an opinion?\n \n \n\n That's what Jo Bennett disagreed with, and it's the discussion you weighed in on.\n\n No, the topic I weighed in on was this statement of yours:\n \"The issue is, assuming it is getting warmer, whether the cause is natural or because of humans.\"\n If you don't want to discuss this with me and the merits of various scientists with Jo at the same time I'll yield the floor. Just say the word.", 
   {}, 
   226854, 
   null, 
   1155074400.0
  ], 
  [
   226878, 
   null, 
   "Ripskar", 
   "I suspect you have no degree in a related field such as climatology, and yet you claim some very well-known and good scientists are not good scientists:\n\n As I recall Jo Bennet is a Physicist of some description, (Also a member of the CofE which makes what is said elsewhere somewhat bizare.) ID isn't science, the Authors (Behe and Dembski) admit that it is religously inspired and the Judge in the recent case declared that it was Creationism, even the Vatican Observatory denounces it as psuedoscience.\n I'm a Zoologist, so I deal with the effects of climate change as it effects populations of animals. There is something of a Silent Spring effect taking place. \n I will draw your attention to three articles in New Scientist;\n US report backs study on global warming\n A report commissioned by the US Congress backs findings that the past few decades were the warmest in 400 years\n 23 June 2006 Breaking News \n \n US Supreme Court to rule on climate change\n The court will decide whether the evidence for global warming is sufficient to merit controls on carbon dioxide emissions from cars\n 27 June 2006 Breaking News \n \n US Congress starts to believe in climate change\n A weighty report concludes that the controversial 'hockey stick' graph showing global warming this century is real\n 01 July 2006 From magazine issue 2558 News \n \n The \"Hockey Stick\" graph shows the change in CO2 levels in the atmosphere, almost stable since the last glaciation, which show a sudden and increasing rise in CO2 since the start of the Industrial Revolution.", 
   {}, 
   226718, 
   null, 
   1155075600.0
  ], 
  [
   226879, 
   null, 
   "Jo Bennett", 
   "Ok Jyoshu, or anyone else who feels like taking up the challenge. If this issue is so hotly contested, find me two scientists meeting the following criteria:\n 1. has published in a peer reviewed journal 1 or more papers contradicting the core science of global warming directly\n 2. is not receiving income or grants from any organisation with a vested interest in greenhouse gas emissions larger than the income or grant.\n Find me these and I'll stop disputing that there are competent scientists on both sides.", 
   {}, 
   226873, 
   null, 
   1155075720.0
  ], 
  [
   226889, 
   null, 
   "jyoshu", 
   "As I recall Jo Bennet is a Physicist of some description, (Also a member of the CofE which makes what is said elsewhere somewhat bizare.) ID isn't science, the Authors (Behe and Dembski) admit that it is religously inspired and the Judge in the recent case declared that it was Creationism, even the Vatican Observatory denounces it as psuedoscience.\n I'm a Zoologist, so I deal with the effects of climate change as it effects populations of animals. There is something of a Silent Spring effect taking place. \n I will draw your attention to three articles in New Scientist;\n US report backs study on global warming\n A report commissioned by the US Congress backs findings that the past few decades were the warmest in 400 years\n 23 June 2006 Breaking News \n \n US Supreme Court to rule on climate change\n The court will decide whether the evidence for global warming is sufficient to merit controls on carbon dioxide emissions from cars\n 27 June 2006 Breaking News \n \n US Congress starts to believe in climate change\n A weighty report concludes that the controversial 'hockey stick' graph showing global warming this century is real\n 01 July 2006 From magazine issue 2558 News \n \n The \"Hockey Stick\" graph shows the change in CO2 levels in the atmosphere, almost stable since the last glaciation, which show a sudden and increasing rise in CO2 since the start of the Industrial Revolution.\n\n \n None of those except the last one does anything other than to argue that the earth is warming, rather than indicate a human cause, so I'll only deal with the last example you give, since that's the only one pertinent here.\n \n Ah, the infamous \"hockey stick\" graph, done by Michael Mann. That graph has been discredited by numerous statiticians who reviewed his work and methodology, including Edward J. Wegman of George Mason University, David W. Scott of Rice University and Yasmin H. Said of Johns Hopkins University, Ross McKitrick, an economist at the University of Guelph in Ontario, and Steven McIntyre, a veteran of mineral exploration. \"Their task was to look at Mr. Mann's methods from a statistical perspective and assess their validity. Their conclusion is that Mr. Mann's papers are plagued by basic statistical errors that call his conclusions into doubt.\" (WSJ, 7/14/06)", 
   {}, 
   226878, 
   null, 
   1155076980.0
  ], 
  [
   226893, 
   null, 
   "jyoshu", 
   "I don't know what the final costs would be either, but given what's at stake there's no way they can be too high to try. The drain on the economy would be tiny compared to, say, the Iraq war, and the potential benefits are huge. Likewise, the costs if we do nothing could be staggering.\n\n \n That may be, but the question is, how far is just \"trying\"? Specifically, what do you mean in terms of regulation and dollars spent? A blank check and all-powerful unchecked Big Brother on drivers, consumers, companies, etc. is NOT a good thing. And if you mean anything less than that, then tell what your solutions are, specifically. Anyone can say we should \"try.\"\n \n \nWhich side of the issue, if any, are you on? Do you think people are responsible for global warming? Contribute? Have had no effect? Or do you not have an opinion?\n\n \n At this point I think \"contributing\" is the most I could say, but maybe not even that. I'm still reading various views and opinions. \n \n \n\"The issue is, assuming it is getting warmer, whether the cause is natural or because of humans.\" If you don't want to discuss this with me and the merits of various scientists with Jo at the same time I'll yield the floor. Just say the word.\n\n \n Regarding your statements, I just gave you my 'stance' on global warming. And no, I'm not interested in seeing who's meeting Jo's guilt-by-association criteria for what's a good scientist; she still has the ties-to-energy-companies qualifier in play (the #2 thing she listed). That doesn't speak to whether or not they are good scientists.", 
   {}, 
   226873, 
   null, 
   1155077700.0
  ], 
  [
   226897, 
   null, 
   "Waxy", 
   "Ok Jyoshu, or anyone else who feels like taking up the challenge. If this issue is so hotly contested, find me two scientists meeting the following criteria:\n 1. has published in a peer reviewed journal 1 or more papers contradicting the core science of global warming directly\n 2. is not receiving income or grants from any organisation with a vested interest in greenhouse gas emissions larger than the income or grant.\n Find me these and I'll stop disputing that there are competent scientists on both sides.\n\n \n The following have published disputing primarily the effect of humans on climate change, but have also challenged the core science behind global warming - \n \n Tad Murty\n Jan Veizer\n Ross McKittrick/Steven McIntyre\n \n That's just 4 guys I picked off the top of my head. I'm sure I could post you a list of a hundred or more, but would it really matter?\n \n You may not agree with them, but the fact remains that they are competent scientists who interpret the data differently than you do (or at least those on the side you've chosen to take do). It's pretty clear to me that the data is NOT indisputable, and that there is NOT a complete consensus among those qualified to speak on the data. \n \n The problem is, Al Gore is out making movies while these guys are actually doing scientific research.\n \n Waxy", 
   {}, 
   226879, 
   null, 
   1155078840.0
  ], 
  [
   226898, 
   null, 
   "Kronus", 
   "That may be, but the question is, how far is just \"trying\"? Specifically, what do you mean in terms of regulation and dollars spent? A blank check and all-powerful unchecked Big Brother on drivers, consumers, companies, etc. is NOT a good thing. And if you mean anything less than that, then tell what your solutions are, specifically. Anyone can say we should \"try.\"\n\n Well of course I'm not talking about an \"all-powerful unchecked Big Brother\", that's just silly. And I don't have a specific set of policy statements prepared. At this point simply getting people to conceed that anything should be done is enough of a challenge. Once we can get people to agree that change is necessary than we can sit down and hack out the details of which changes, how much to spend, what time frames, etc etc. There's no point in trying to convince someone that cutting emmisions 15% over 5 years at a cost of $5 billion is the way to go if they won't even conceed that we should be trying to cut emmisions at all. \n \n \n \n\n At this point I think \"contributing\" is the most I could say, but maybe not even that. I'm still reading various views and opinions.\n\n If you have any specific questions, maybe I could help.\n \n \n And no, I'm not interested in seeing who's meeting Jo's guilt-by-association criteria for what's a good scientist; she still has the ties-to-energy-companies qualifier in play (the #2 thing she listed). That doesn't speak to whether or not they are good scientists.\n\n So did you catch the bit where I said that wasn't what I was discussing with you? emoticon_xangel", 
   {}, 
   226893, 
   null, 
   1155078840.0
  ], 
  [
   226906, 
   null, 
   "Jo Bennett", 
   "Waxy, would you mind giving me a link to Tad Murty's work on climate change? My googling isn't telling me much more than that he's an expert on tsunamis, which as far as I'm aware have nothing to do with climate change.\n \n Jan Veizer seems well intentioned, but his cosmic ray theory has been fairly thoroughly demolished and he has been accused of fiddling his data, by up to 40 million years, to show a correlation between temperature and cosmic rays which the data simply doesn't support, and he's even more guilty of what the anti-climate change group accuse scientists of - relying on insufficient data. It's worth looking into, just to make sure, but in any case it's an alternative hypothesis, with gaping holes in it, and it doesn't do anything to contradict the science underpinning the greenhouse effect.\n \n Ross McKittrick is an economist, he hasn't done any work on the science of climate change.\n Steven McIntyre is, again, not a scientist. He's a semi-retired businessman, and I can't find any published works of his regarding the science of climate change.\n \n Incidentally the reason I want to exclude scientists in the pay of the oil companies is that if the dispute is significant, there would doubtless be scientists not bought and paid for by big oil who would be on the minority side. I'm not saying that science paid for by the oil companies is automatically suspect, but the experience with tobacco and lung cancer should teach us a lot about trusting data from big businesses with a vested interest in the status quo.", 
   {}, 
   226898, 
   null, 
   1155084300.0
  ], 
  [
   226952, 
   null, 
   "Ripskar", 
   "Ah, the infamous \"hockey stick\" graph, done by Michael Mann. That graph has been discredited by numerous statiticians who reviewed his work and methodology, \"Their task was to look at Mr. Mann's methods from a statistical perspective and assess their validity. Their conclusion is that Mr. Mann's papers are plagued by basic statistical errors that call his conclusions into doubt.\" (WSJ, 7/14/06)\n\n It wasn't discredited, indeed the US congress said;\n \n \"We roughly agree with the substance of their findings,\" says Gerald North, the committee's chair and a climate scientist at Texas A&M University in College Station. In particular, he says, the committee has a \"high level of confidence\" that the second half of the twentieth century was warmer than any other period in the past four centuries.\"the 1990s are likely the warmest decade, and 1998 the warmest year, in at least a millennium\", \n\n http://www.nature.com/news/2006/060626/full/4411032a.html\n This paper is far from alone, I for one haven't seen any papers in the peer reviewed journals that dispute the correlation between the industrial revolution and the rise in CO2.\n \n Specifically regarding the statistics:\n \nThe NAS also confirmed some problems with the statistics. But the mistakes had a relatively minor impact on the overall finding, says Peter Bloomfield, a statistician at North Carolina State University in Raleigh\n\n Indeed Jo Bennet's remarks regarding vested intrests springs to mind; An Economist, someone in mineral exploration (Oil prospecting) and a Republican poltician from Oil producing Texas...", 
   {}, 
   226889, 
   null, 
   1155124620.0
  ], 
  [
   226981, 
   null, 
   "Waxy", 
   "Waxy, would you mind giving me a link to Tad Murty's work on climate change? My googling isn't telling me much more than that he's an expert on tsunamis, which as far as I'm aware have nothing to do with climate change.\n\n \n http://www.friendsofscience.org/documents/debate.pdf\n \n \nRoss McKittrick is an economist, he hasn't done any work on the science of climate change.\n Steven McIntyre is, again, not a scientist. He's a semi-retired businessman, and I can't find any published works of his regarding the science of climate change.\n\n \n McKittrick is an economist that specializes in environmental economics and policy analysis. He was written several papers, and published a book, evaluating the data and techniques used to reach conclusions such as the \"hockey stick\" graph. He is infinitely qualified to do this kind of analysis. \n \n McIntyre co-authored many of the papers with McKittrick.\n \n A person does not have to be out there reading thermometers to be qualified to speak on global warming. The data is there for anyone and everyone to evaluate.\n \n Essex,C. & McKitrick,R.: \"Taken by Storm\" , Key Porter Books. ISBN 1552632121.\n \n \nIncidentally the reason I want to exclude scientists in the pay of the oil companies is that if the dispute is significant, there would doubtless be scientists not bought and paid for by big oil who would be on the minority side. I'm not saying that science paid for by the oil companies is automatically suspect, but the experience with tobacco and lung cancer should teach us a lot about trusting data from big businesses with a vested interest in the status quo.\n\n \n Fair enough.\n \n I would then like to exclude the works of anyone associated with the Sierra Club, Greenpeace, etc..., as they have a clearly defined agenda, and a vested interest in the results.\n \n Waxy", 
   {}, 
   226906, 
   null, 
   1155142920.0
  ], 
  [
   226984, 
   null, 
   "Jo Bennett", 
   "Greenpeace et al aim to protect the planet. If it turns out it doesn't need protecting in this area then no-one will be happier than us (I'm a Greenpeace supporter). Feel free to exclude scientists funded by these groups if you so wish, it still leaves an overwhelming consensus among scientists working in the field.\n \n You're not qualified to evaluate climate models if you don't know enough about the climate. If McKittirck's work was scientific it would be published in a peer reviewed scientific journal, not an economics one.", 
   {}, 
   226981, 
   null, 
   1155143580.0
  ], 
  [
   227003, 
   null, 
   "Waxy", 
   "Greenpeace et al aim to protect the planet. If it turns out it doesn't need protecting in this area then no-one will be happier than us (I'm a Greenpeace supporter). Feel free to exclude scientists funded by these groups if you so wish, it still leaves an overwhelming consensus among scientists working in the field.\n\n \n Radical enviro groups do as much to harm the enviroment as help it IMHO, and public opinion would be on my side. Google it if you wish.\n \n The hard line extreme stance taken by groups like the Sierra Club only hinders advancement and cooperation on environmental issues. I for one am VERY suspicious of the science presented by these extreme enviro groups, as it has been proven to be cooked and biased in the past. It becomes more of a religion than science, and objectivity is lost.\n \n I would suggest that many qualifiers are in order for it to be considered \"overwhelming\".\n \n The point - there are bad apples on both sides of the fence. Dismissing the work of either side out of hand is careless and unscientific.\n \n \nYou're not qualified to evaluate climate models if you don't know enough about the climate. If McKittirck's work was scientific it would be published in a peer reviewed scientific journal, not an economics one.\n\n \n You mean like these ones?\n \n Peer-Reviewed Science Journal Articles\n \n Essex, Christopher, Andresen, Bjarne and Ross McKitrick. Is There a Global Temperature? Accepted, Journal of Nonequilibrium Thermodynamics \n McIntyre, Stephen and Ross McKitrick (2005) Reply to Comment by von Storch and Zorita on \"Hockey Sticks, Principal Components and Spurious Significance\" Geophysical Research Letters 32(20) L20714 10.1029/2005GL023089 21 October 2005 \n McIntyre, Stephen and Ross McKitrick (2005) Reply to Comment by Huybers on \"Hockey Sticks, Principal Components and Spurious Significance\" Geophysical Research Letters 32(20) L20714 10.1029/2005GL023586 21 October 2005 \n McIntyre, Stephen and Ross McKitrick (2005) The M&M Critique of the MBH98 Northern Hemisphere Climate Index: Update and Implications Energy and Environment 16(1) pp. 69-100. \n McIntyre, Stephen and Ross McKitrick (2005) Hockey Sticks, Principal Components and Spurious Significance Geophysical Research LettersVol. 32, No. 3, L03710 10.1029/2004GL021750 12 February 2005. \n McKitrick, Ross and Patrick J. Michaels (2004). \"Are Temperature Trends Affected by Economic Activity? Reply to Benestad (2004)\" Climate Research 27(2) pp. 175-176. \n McIntyre, S. and R. McKitrick (2004). \"Materials Complaint Concerning 'Global Scale Temperature Patterns and Climate Forcing over the Past Six Centuries'\" Nature 430 July 1, 2004, p. 105. \n McKitrick, Ross and Patrick J. Michaels (2004). \"A Test of Corrections for Extraneous Signals in Gridded Surface Temperature Data\" Climate Research 26 pp. 159-173. \n McIntyre, Steven and Ross McKitrick, (2003). \"Corrections to the Mann et. al. (1998) Proxy Data Base and Northern Hemisphere Average Temperature Series.\" Environment and Energy 14(6) pp. 751-771. \n McKitrick, Ross R. (2002). \"Inference About Trends in Temperature Data After Controlling for Serial Correlation and Heteroskedastic Variance.\" Invited Paper, Proceedings of the Russian Geographical Society 164(3) pp. 16-24. (English version) \n \n Climate models are based on data. Data is universal. Someone highly skilled in evaluating the raw data is perfectly qualified to do so and form conclusions.\n \n On top of that, you haven't proven in any way, shape, or form, that McKittrick's knowledge of climate and climate models is insufficient. You simply and convienently label it as such with no proof.\n \n I knew this was a pointless exercise from the beginning. \n \n Irregardless of what I post for you, you will find a way to discredit it as being not up to your standards. I have given you exactly what you asked for, with a very minimum of effort, and yet, your mind remains as closed as it ever was, convinced that your position is unequivocably correct.\n \n This is why I try to stay out of these debates. People's positions are so cemented in their righteous certainty that there really is no debate. \n \n Waxy", 
   {}, 
   226984, 
   null, 
   1155149340.0
  ], 
  [
   227010, 
   null, 
   "Steeeeve", 
   "I knew this was a pointless exercise from the beginning.\n \n Irregardless of what I post for you, you will find a way to discredit it as being not up to your standards. I have given you exactly what you asked for, with a very minimum of effort, and yet, your mind remains as closed as it ever was, convinced that your position is unequivocably correct.\n \n This is why I try to stay out of these debates. People's positions are so cemented in their righteous certainty that there really is no debate.\n yeah, that is kinda lame...Jo Bennett asked for two you gave four. \n \n \n As for Kronus, I agree that we should probably reduce our pollution to some degree as it would be \"better safe than sorry\" but at the same time I don't think a full blown effort is needed. Pollution controll will have effects beyond \"global warming\" anyway....it will make us healthier and have the ability to actually see a city skyline. With the rest of the money we should continue researching and deciding what actually is causing global warming. No use barking up the wrong tree when you can find the right one :)", 
   {}, 
   227003, 
   null, 
   1155152520.0
  ], 
  [
   227036, 
   null, 
   "Kronus", 
   "With the rest of the money we should continue researching and deciding what actually is causing global warming. No use barking up the wrong tree when you can find the right one :)\n\n \n Again, if human emissions aren't the cause then we're pretty much screwed, since they're the only potential cause that we can do anything about, so searching for other causes before doing anything about emissions really doesn't make much sense. And, of course, if human emissions are the right tree, and we waste too much time and money checking every other possibility, it'll be much, much harder to do anything about it. There could very well be a \"tip over\" point past which merely stopping emissions won't reverse the trend. Just something else to keep in mind.", 
   {}, 
   227010, 
   null, 
   1155158460.0
  ], 
  [
   227115, 
   null, 
   "Jo Bennett", 
   "Right, I conceed that there have been a small number of papers published atacking some of the methodology used by some proponents of global warming, and there are a small number of people with credible knowledge of the field who have different theories about the warming. Now is either Waxy or jyoshu prepared to concede the overwhelming consensus in support of anthropogenic warming, and that the media is massively over-emphasising the tiny number of dissenting voices?", 
   {}, 
   227036, 
   null, 
   1155169740.0
  ], 
  [
   227116, 
   null, 
   "danjrush04", 
   "Bravo Jo Bravo!", 
   {}, 
   227115, 
   null, 
   1155169860.0
  ], 
  [
   227119, 
   null, 
   "Waxy", 
   "Right, I conceed that there have been a small number of papers published atacking some of the methodology used by some proponents of global warming, and there are a small number of people with credible knowledge of the field who have different theories about the warming. Now is either Waxy or jyoshu prepared to concede the overwhelming consensus in support of anthropogenic warming,\n\n \n I believe that the general consensus it that the earth is warming. I agree with that.\n \n The majority believe it is anthropogenic, an overwhelimg consensus - that's a stretch.\n \n I don't believe that there is any consensus whatsoever regarding what the impact of the warming is/will be, what can/should be done about, or how to go about doing anything.\n \n \nand that the media is massively over-emphasising the tiny number of dissenting voices?\n\n \n No offense Joe, but I laughed out loud when I read this.\n \n The media overemphasizing the dissenters? You have got to be kidding. It is nearly impossible for dissenting voices to be heard by the media.\n \n The general public is bombarded on a daily basis with global warming paranoia. Extreme weather, ice caps disappearing, global flooding, every day a new record temp, etc.....\n \n There are feature length movies made by former vice presidents playing in theatres around the country that are sounding the global warming alarm bells, and you actually have the audacity to suggest that the media is over-emphasizing the the dissenting voices? Try to find me 3-4 \"anti global warming\" stories of any kind garnereing attention in the current mainstream media. You lost some major credibility points with me on this one Joe.\n \n Waxy", 
   {}, 
   227115, 
   null, 
   1155170760.0
  ], 
  [
   227120, 
   null, 
   "danjrush04", 
   "I believe that the general consensus it that the earth is warming. I agree with that.\n \n The majority believe it is anthropogenic, an overwhelimg consensus - that's a stretch.\n \n I don't believe that there is any consensus whatsoever regarding what the impact of the warming is/will be, what can/should be done about, or how to go about doing anything.\n \n \n \n No offense Joe, but I laughed out loud when I read this.\n \n The media overemphasizing the dissenters? You have got to be kidding. It is nearly impossible for dissenting voices to be heard by the media.\n \n The general public is bombarded on a daily basis with global warming paranoia. Extreme weather, ice caps disappearing, global flooding, every day a new record temp, etc.....\n \n There are feature length movies made by former vice presidents playing in theatres around the country that are sounding the global warming alarm bells, and you actually have the audacity to suggest that the media is over-emphasizing the the dissenting voices? Try to find me 3-4 \"anti global warming\" stories of any kind garnereing attention in the current mainstream media. You lost some major credibility points with me on this one Joe.\n \n Waxy\n\n \n \n \n I really have to put a point in, it my not be valid as I did sort of just \"jump\" into this forum, so if because I wasn't a part of the start of this forum my point is non taken that's fine with me but.... Again Waxy you are talking about ALL the actions that might/will happen now think of the IDEA behind the actions..... Water level increases less land.... less land faster over population.... faster over population.... more control over the people.... more control over the people less freedoms..... open your mind man you are s blind......", 
   {}, 
   227119, 
   null, 
   1155171060.0
  ], 
  [
   227171, 
   null, 
   "Waxy", 
   "I really have to put a point in, it my not be valid as I did sort of just \"jump\" into this forum, so if because I wasn't a part of the start of this forum my point is non taken that's fine with me but.... Again Waxy you are talking about ALL the actions that might/will happen now think of the IDEA behind the actions..... Water level increases less land.... less land faster over population.... faster over population.... more control over the people.... more control over the people less freedoms..... open your mind man you are s blind......\n\n \n emoticon_xdonno \n \n emoticon_xbye \n \n Waxy", 
   {}, 
   227120, 
   null, 
   1155226860.0
  ], 
  [
   227174, 
   null, 
   "Steeeeve", 
   "Again, if human emissions aren't the cause then we're pretty much screwed, since they're the only potential cause that we can do anything about, so searching for other causes before doing anything about emissions really doesn't make much sense. And, of course, if human emissions are the right tree, and we waste too much time and money checking every other possibility, it'll be much, much harder to do anything about it. There could very well be a \"tip over\" point past which merely stopping emissions won't reverse the trend. Just something else to keep in mind.\n\n \n I don't concede that global warming is even a bad thing. If it is a natural climate pattern then whats the big deal?", 
   {}, 
   227036, 
   null, 
   1155228660.0
  ], 
  [
   227176, 
   null, 
   "Kronus", 
   "I don't concede that global warming is even a bad thing.\n\n It is. Any point trying to convince you of this? And that's a serious question.\n \n \n\n If it is a natural climate pattern then whats the big deal?\n\n \n You can't actually mean what you just said, but I can't figure out any other way to interpret it. If something's natural it's no big deal? A hurricane that causes billions in damage, or a tsunami that kills thousands are no big deal, because they're natural? Try again, I'm sure that's not what you were actually trying to say, and I have no clue what you really meant.", 
   {}, 
   227174, 
   null, 
   1155229440.0
  ], 
  [
   227185, 
   null, 
   "jyoshu", 
   "It wasn't discredited, indeed the US congress said;\n \n http://www.nature.com/news/2006/060626/full/4411032a.html\n This paper is far from alone, I for one haven't seen any papers in the peer reviewed journals that dispute the correlation between the industrial revolution and the rise in CO2.\n \n\n \n The point is, there's not universal consensus. Some HAVE discredited it, and I gave you the names and sources. No one is saying here that it's WRONG--the point here is that there are good scientists on both sides of this, and there is no universal consensus.", 
   {}, 
   226952, 
   null, 
   1155231540.0
  ], 
  [
   227264, 
   null, 
   "Ripskar", 
   "I don't concede that global warming is even a bad thing. If it is a natural climate pattern then whats the big deal?\n\n Some of the projections suggest over a billion people dying as a result, and it's already started.\n Exactly how bad does it have to get?\n \n There isn't \"Universal Concensus\" on the world being round, I can't think of a single scientist I've met who seriously believes the cause of global warming is anything other than human in origin in all the time since I first went to University. \n You don't dispute that Warming is occuring, do you dispute that CO2 is a Greenhouse Gas or that the activities of people since the industrial revolution have increased the volume of CO2 being put into the atmosphere?", 
   {}, 
   227174, 
   null, 
   1155291480.0
  ], 
  [
   227285, 
   null, 
   "jyoshu", 
   "There isn't \"Universal Concensus\" on the world being round, I can't think of a single scientist I've met who seriously believes the cause of global warming is anything other than human in origin in all the time since I first went to University.\n\n \n Then with all due respect, you should read more. You've been given names right here.\n \n And yes, there IS universal consensus among scientists that the world is round.", 
   {}, 
   227264, 
   null, 
   1155315900.0
  ], 
  [
   227288, 
   null, 
   "Ripskar", 
   "You cited the article;\n McIntyre, S. and R. McKitrick (2004). \"Materials Complaint Concerning 'Global Scale Temperature Patterns and Climate Forcing over the Past Six Centuries'\" Nature 430 July 1, 2004, p. 105. \n \n I've run it through Nature's search engine but haven't found it.\n http://search.nature.com/search/?sp-q=McIntyre%2C+S.+and+R.+McKitrick+%282004%29.+%22Materials+Complaint+Concerning+%27Global+Scale+Temperature+Patterns+and+Climate+Forcing+over+the+Past+Six+Centuries%27%22+Nature+430+July+1%2C+2004%2C+p.+105.+&sp-x-9=cat&sp-s=date&sp_a=sp1001702d&sp_sfvl_field=subject%7Cujournal&sp_t=results&sp_x_1=ujournal&sp_p_1=phrase\n \n Does anyone actually have access to the text?\n I also note that there isn't a volume number which should be cited as follows:\n Current issue\n : Volume 442 Number 7103", 
   {}, 
   227285, 
   null, 
   1155317340.0
  ], 
  [
   227296, 
   null, 
   "Jo Bennett", 
   "http://www.nature.com/nature/journal/v430/n6995/index.html\n \n Is the relevant link. You need a subscription to nature to view it (if you're a student you may have a site licence available, mine ran out when I graduated a couple of months ago).", 
   {}, 
   227288, 
   null, 
   1155320880.0
  ], 
  [
   227302, 
   null, 
   "Steeeeve", 
   "It is. Any point trying to convince you of this? And that's a serious question.\n You can try but in the sense I am referring to...if global warming is natural it really isn't a bad thing overall (probably bad for Miami) \n \n \n\n You can't actually mean what you just said, but I can't figure out any other way to interpret it. If something's natural it's no big deal? A hurricane that causes billions in damage, or a tsunami that kills thousands are no big deal, because they're natural? Try again, I'm sure that's not what you were actually trying to say, and I have no clue what you really meant.\n In the sense that there is no use freaking out about it...yeah it is no big deal. You aren't going to stop a tsunami from taking out an island so trying to solve an unsolvable problem is rather worthless.", 
   {}, 
   227176, 
   null, 
   1155323340.0
  ], 
  [
   227304, 
   null, 
   "Waxy", 
   "You cited the article;\n McIntyre, S. and R. McKitrick (2004). \"Materials Complaint Concerning 'Global Scale Temperature Patterns and Climate Forcing over the Past Six Centuries'\" Nature 430 July 1, 2004, p. 105. \n \n I've run it through Nature's search engine but haven't found it.\n http://search.nature.com/search/?sp-q=McIntyre%2C+S.+and+R.+McKitrick+%282004%29.+%22Materials+Complaint+Concerning+%27Global+Scale+Temperature+Patterns+and+Climate+Forcing+over+the+Past+Six+Centuries%27%22+Nature+430+July+1%2C+2004%2C+p.+105.+&sp-x-9=cat&sp-s=date&sp_a=sp1001702d&sp_sfvl_field=subject%7Cujournal&sp_t=results&sp_x_1=ujournal&sp_p_1=phrase\n \n Does anyone actually have access to the text?\n I also note that there isn't a volume number which should be cited as follows:\n Current issue\n : Volume 442 Number 7103\n\n \n Are you talkin' to me?\n \n I don't have access to the Nature article.\n \n I guess you'll have to make a trip to the library. :p\n \n Waxy", 
   {}, 
   227288, 
   null, 
   1155324180.0
  ], 
  [
   230936, 
   null, 
   "Tastyfish", 
   "Giving thats its a fairly general global warming debate...\n \n The overall consensus (regardless of who's consensus we're using;)) is that global warming is happening, and there is some pretty disasterous results predicted because of this. However, if humans are responsible for the rapid increase, surely it would make more sense to direct as much funding as possible to deal with these rather than risk going primarily on prevention when its not known whether its possible to undo the damage/reverse the trend?\n \n I'm all for environmental advances as generally they result in better long term efficiency and greater sustainability, however unless serious effort is made to drastically reduce existing greenhouse gas levels as well as the rates they are being produced then its not going to make a lot of difference when something like New Orleans 2 occurs. \n \n What sort of measures would be required to deal with the biggest problems (moving developments away from vunerable areas and toward safer ones etc) and are they things above and beyond what is actually possible?", 
   {}, 
   227304, 
   null, 
   1158274860.0
  ], 
  [
   231079, 
   null, 
   "jyoshu", 
   "Giving thats its a fairly general global warming debate...\n \n The overall consensus (regardless of who's consensus we're using;)) is that global warming is happening, and there is some pretty disasterous results predicted because of this. However, if humans are responsible for the rapid increase, surely it would make more sense to direct as much funding as possible to deal with these rather than risk going primarily on prevention when its not known whether its possible to undo the damage/reverse the trend?\n\n \n \"As much funding as possible?\" What does that mean, exactly? Funnel money away from other areas we need it? I mean, sure, we could eliminate every domestic and foreign military spending item the US engages in and put our entire national budget into dealing with global warming if we wanted to. But would that really be wise? I don't think the issue with much of anyone is whether it should be funded to ANY degree, but rather how far we're willing to go with it. What people don't get sometimes is that the US is already pouring MORE into environmental issues such as dealing with greenhouse gas emissions than any other nation in the world. We'd have to directly shut down oil companies (which would be a fascist thing to do) in order to truly force the US to stop using oil, and the ramifications of such a sudden action on our economy by doing that would do worse to the environment than anything.\n \n \nhowever unless serious effort is made to drastically reduce existing greenhouse gas levels as well as the rates they are being produced then its not going to make a lot of difference when something like New Orleans 2 occurs. \n\n \n Other than forcing the public to change by big-brother efforts, what other 'efforts' could be taken? It's not like people in the US don't know we need to be less dependent on oil. We could as a nation, I suppose, make symbolic gestures like ratifying the kyoto protocol. But with the UN giving complete exemption to the 2nd largest greenhouse gas emmission source country in the world, and the fact the treaty heavily affects trade issues, it's pretty hard to take the UN seriously on it. And if we are serious about cutting emissions (we have, a lot, already), we don't need a Kyoto protocol to do that.", 
   {}, 
   230936, 
   null, 
   1158358020.0
  ], 
  [
   231130, 
   null, 
   "Tastyfish", 
   "\"As much funding as possible?\" What does that mean, exactly? Funnel money away from other areas we need it? I mean, sure, we could eliminate every domestic and foreign military spending item the US engages in and put our entire national budget into dealing with global warming if we wanted to. But would that really be wise? I don't think the issue with much of anyone is whether it should be funded to ANY degree, but rather how far we're willing to go with it. What people don't get sometimes is that the US is already pouring MORE into environmental issues such as dealing with greenhouse gas emissions than any other nation in the world. We'd have to directly shut down oil companies (which would be a fascist thing to do) in order to truly force the US to stop using oil, and the ramifications of such a sudden action on our economy by doing that would do worse to the environment than anything.\n I was thinking of the money allocated toward global warming related projects - it appears at least that the balance is heavily weighted toward prevention/reduction and I don't think I've really heard of much at all being spent on dealing with what seems to be inevitable (relocating homes and businesses away from endangered areas, strengthening and improving storm defenses etc)\n \n \n\n Other than forcing the public to change by big-brother efforts, what other 'efforts' could be taken? It's not like people in the US don't know we need to be less dependent on oil. We could as a nation, I suppose, make symbolic gestures like ratifying the kyoto protocol. But with the UN giving complete exemption to the 2nd largest greenhouse gas emmission source country in the world, and the fact the treaty heavily affects trade issues, it's pretty hard to take the UN seriously on it. And if we are serious about cutting emissions (we have, a lot, already), we don't need a Kyoto protocol to do that.\n This is partly my point, if you're not going to really throw everything into trying to stop it, surely it makes a lot of sense with making sure you can survive the consquences. At some point the government is going to have to be a bit cruel - either get out of the red zones or you will receive no funding or assistance to rebuild if the area floods or is devestated by a storm, that is really the nicest way it could be done if you aren't going to accept forced (but subsidised) relocation.", 
   {}, 
   231079, 
   null, 
   1158410160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Global Warming Activists' Newest Ally: Pat Robertson!", 
  "url": "http://www.4forums.com/political/environmental-debates/8641-global-warming-activists-newest-ally-pat-robertson.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 8641, 
  "discussion_files": [
   [
    "18114.html", 
    "http://www.4forums.com/political/environmental-debates/8641-global-warming-activists-newest-ally-pat-robertson-print.html"
   ], 
   [
    "18115.html", 
    "http://www.4forums.com/political/environmental-debates/8641-global-warming-activists-newest-ally-pat-robertson-4-print.html"
   ], 
   [
    "18116.html", 
    "http://www.4forums.com/political/environmental-debates/8641-global-warming-activists-newest-ally-pat-robertson-3-print.html"
   ], 
   [
    "18117.html", 
    "http://www.4forums.com/political/environmental-debates/8641-global-warming-activists-newest-ally-pat-robertson-2-print.html"
   ]
  ], 
  "identifier": 8641
 }
]