[
 [
  [
   226582, 
   null, 
   "stanleyg", 
   "Is Christ's Father the God of Abraham or is He someone different? \n \n John8 \n [42] Jesus said unto them, If God were your Father, ye would love me: for I proceeded forth and came from God; neither came I of myself, but he sent me.\n [43] Why do ye not understand my speech? even because ye cannot hear my word.\n [44] Ye are of your father the devil, and the lusts of your father ye will do. He was a murderer from the beginning, and abode not in the truth, because there is no truth in him. When he speaketh a lie, he speaketh of his own: for he is a liar, and the father of it.", 
   {
    "post_info": {
     "post_title": "Is Christ's Father the God of Abraham?"
    }
   }, 
   null, 
   null, 
   1154950440.0
  ], 
  [
   226601, 
   null, 
   "simone", 
   "Well! If the Father God of Jesus is not the God of Abraham, then Jesus must surely be a heretic.", 
   {}, 
   226582, 
   null, 
   1154968860.0
  ], 
  [
   226666, 
   null, 
   "INRI", 
   "Well said simone", 
   {}, 
   226601, 
   null, 
   1154988240.0
  ], 
  [
   226708, 
   null, 
   "epaphras_faith", 
   "Well! If the Father God of Jesus is not the God of Abraham, then Jesus must surely be a heretic.\n\n \n I agree..............", 
   {}, 
   226601, 
   null, 
   1154996760.0
  ], 
  [
   226752, 
   null, 
   "lunchmoney", 
   "Well! If the Father God of Jesus is not the God of Abraham, then Jesus must surely be a heretic.\n\n but jesus was a heretic, thats why the jews didnt step in and stop the romans from killing him. according to judaism, a heretic has a death penalty on his head. however i do think that jesus believed in the same G-d as Abraham, Isaac, and Jacob, mainly because he grew up as a good jewish boy in israel who learned in yeshiva until he was kicked out.\n jesus was deemed a heretic because he was teaching ideas contrary to judaism and getting other people to go off the correct path.", 
   {}, 
   226708, 
   null, 
   1155029220.0
  ], 
  [
   226754, 
   null, 
   "peteratwar", 
   "First, the Romans didn't wish to execute Jesus, it was the Jewish clergy who pushed for it.\n \n Second a heretic is someone whose interpretation of a specific theology is different from the current church's thinking. Established churches cannot bear dissenters. However, on the whole they don't burn them now", 
   {}, 
   226752, 
   null, 
   1155030240.0
  ], 
  [
   226766, 
   null, 
   "trebor", 
   "First, the Romans didn't wish to execute Jesus, it was the Jewish clergy who pushed for it.\n \n Second a heretic is someone whose interpretation of a specific theology is different from the current church's thinking. Established churches cannot bear dissenters. However, on the whole they don't burn them now\n\n \n \n Well, that is accordign to the Gospels. However, from a historical perspective, that is not very realistic. The whole arrest and trail of Jesus bears all the earmarks of a made up story.. because it ignored the laws of the time frame. \n \n And do you think that Rome would life a finger to get rid of an irritation of the locals?? Not likely at all. If Jesus did exist, he probably was viewed as rebel scum (claiming to be the king of the jews was treason, since it was challenging Romes authority). That would be plenty of reason for Rome to remove him.. and they would not need the urging of the jewish authorities at that point at all.", 
   {}, 
   226754, 
   null, 
   1155043860.0
  ], 
  [
   226774, 
   null, 
   "Matthew S", 
   "First, the Romans didn't wish to execute Jesus, it was the Jewish clergy who pushed for it.\n \n Second a heretic is someone whose interpretation of a specific theology is different from the current church's thinking. Established churches cannot bear dissenters. However, on the whole they don't burn them now\n\n \n \n Oh they would if they still had the political clout.", 
   {}, 
   226754, 
   null, 
   1155047880.0
  ], 
  [
   226777, 
   null, 
   "INRI", 
   "POLITICAL CLOUT?\n \n There is no other Government more powerful than the catholic church, that includes the united states, the church snaps its fingures suggests christians vote for bush and bush wins, euthinasia all but ready to be legalised in the uk, click of the fingure by the church and the euthinasia bill is dead in the water, the church very very really uses its \"clout\" but when it does it very rarely loses.\n \n Catholics are a nation within nations our alligence is to christ and his church and the government of our nations are subject to our authority over them.", 
   {}, 
   226774, 
   null, 
   1155050160.0
  ], 
  [
   226780, 
   null, 
   "Matthew S", 
   "\n Catholics are a nation within nations our alligence is to christ and his church and the government of our nations are subject to our authority over them.\n\n \n \n So much for the freedom of others. It is this type statement that is leading me to believe more and more everyday that the world would be better off without religion. It is also why I believe if given a chance they will open reeducation,convertion,exterimination camps.", 
   {}, 
   226777, 
   null, 
   1155051240.0
  ], 
  [
   226781, 
   null, 
   "Jo Bennett", 
   "I hardly think the defeat in the Lords of the assisted dying bill can be attributed to Rome, given that the Church of England opposed the bill, and hence did the Lords Spiritual. Of course, if you're willing to acknowledge the apostolic succession of the Anglican church, and hence admit that the CofE is part of the Catholic church described by the Nicene Creed then I'll conceed the point. ;)\n \n Attributing the victory of Bush to Rome also doesn't hold a lot of water, particularly given that the Catholic vote split 52-47, which is not far off the split in the country as a whole (51-48).", 
   {}, 
   226777, 
   null, 
   1155051240.0
  ], 
  [
   226808, 
   null, 
   "simone", 
   "First, the Romans didn't wish to execute Jesus, it was the Jewish clergy who pushed for it.\n \n Second a heretic is someone whose interpretation of a specific theology is different from the current church's thinking. Established churches cannot bear dissenters. However, on the whole they don't burn them now\nHey! Jesus was a lowdown rabble-rouser who might end up preaching against the domination of Rome--a definite threat to the regime.", 
   {}, 
   226754, 
   null, 
   1155058320.0
  ], 
  [
   226811, 
   null, 
   "peteratwar", 
   "Afraid not, he didn't preach against Rome. He had a lot to say about Judaism thus upsetting the local Clergy. From Roman point of view that was purely a local matter. 'I find no guilt in him'. Didn't satisfy the local clergy who pushed for a death sentence more by blackmail than anything", 
   {}, 
   226808, 
   null, 
   1155058620.0
  ], 
  [
   226843, 
   null, 
   "INRI", 
   "So much for the freedom of others. It is this type statement that is leading me to believe more and more everyday that the world would be better off without religion. It is also why I believe if given a chance they will open reeducation,convertion,exterimination camps.\n\n \n My country is a democratic country, I vote and so do my fellow catholics.\n \n What is wrong with educating people in the faith?\n \n I dont know what you mean by \"convertion\" and when did we have extermination camps lol\n \n \nI hardly think the defeat in the Lords of the assisted dying bill can be attributed to Rome, given that the Church of England opposed the bill, and hence did the Lords Spiritual. Of course, if you're willing to acknowledge the apostolic succession of the Anglican church, and hence admit that the CofE is part of the Catholic church described by the Nicene Creed then I'll conceed the point.\n\n \n oh come on now it was all over the TV, rome done a deal with the british authorities, if they quashed the Euthinasia bill, then they would not oppose certain other things.\n \n As for bush, yeah that one is a bit dodgy but when rome came out in favour of bush which catholic didnt pray bush would win, remember our \"clout\" isnt just politicalemoticon_xgood", 
   {}, 
   226811, 
   null, 
   1155068160.0
  ], 
  [
   226912, 
   null, 
   "trebor", 
   "Afraid not, he didn't preach against Rome. He had a lot to say about Judaism thus upsetting the local Clergy. From Roman point of view that was purely a local matter. 'I find no guilt in him'. Didn't satisfy the local clergy who pushed for a death sentence more by blackmail than anything\n\n \n \n It isn't a matter of preachign against rome. It was a matter of declaring himself 'king of the Jews'.. Since at that point of time, Juddah had become part of the providence of syria, and Juddah had not had a king since the death of Herod in 4 bce, that would be construed as instigation to revolt.", 
   {}, 
   226811, 
   null, 
   1155088500.0
  ], 
  [
   226949, 
   null, 
   "peteratwar", 
   "No, he did not proclaim himself as King of the Jews.\n \n Pontius Pilate found no guilt in him.\n \n The Jewish clergy pushed for execution CLAIMING he was stirring up trouble against Rome, but had no proof.\n \n It was Rome's policy to let the provinces deal with their own internal differences providing they acknowledged Roman supremacy & paid their taxes. As said until pushed Pontius Pilate found no guilt in Jesus from a roman point of view as it was a purely Jewish problem (never forget Jesus was Jewish). Gave in to the Jewish rabbis and then washed his hands of the whole affair.", 
   {}, 
   226912, 
   null, 
   1155122700.0
  ], 
  [
   226956, 
   null, 
   "trebor", 
   "No, he did not proclaim himself as King of the Jews.\n \n Pontius Pilate found no guilt in him.\n \n The Jewish clergy pushed for execution CLAIMING he was stirring up trouble against Rome, but had no proof.\n \n It was Rome's policy to let the provinces deal with their own internal differences providing they acknowledged Roman supremacy & paid their taxes. As said until pushed Pontius Pilate found no guilt in Jesus from a roman point of view as it was a purely Jewish problem (never forget Jesus was Jewish). Gave in to the Jewish rabbis and then washed his hands of the whole affair.\n\n \n \n That's the story. However, if Jesus really existed, Pointious Pilate wouldn't have met with a random person to execute. He had a lot to kill.\n \n Can you show me even one other case where the Rabbi's asked the Romans to execute someone? Can you show me any evidence outside the gospels that the Rabbi's did so?", 
   {}, 
   226949, 
   null, 
   1155129960.0
  ], 
  [
   226968, 
   null, 
   "peteratwar", 
   "Whether or not there were other cases is irrelevant. There may have been, there may not have been.\n \n The Gospels state that on this occasion they did. The Gospels weren't interested in anyone else.\n \n Israel/Judaea was a powderkeg at that time (when hasn't it been ? answer under Byzantine and Turkish rule) and Pontius Pilate did not want a revolt on his hands. So he caved in. Jesus, to him, was just another Jewish zealot and if crucifying him kept the peace for a while then fair enough.\n \n It only put off the evil day for a few years before the diaspora.", 
   {}, 
   226956, 
   null, 
   1155135600.0
  ], 
  [
   226997, 
   null, 
   "epaphras_faith", 
   "That's the story. However, if Jesus really existed, Pointious Pilate wouldn't have met with a random person to execute. He had a lot to kill.\n \n Can you show me even one other case where the Rabbi's asked the Romans to execute someone? Can you show me any evidence outside the gospels that the Rabbi's did so?\n\n \n This is an illegitimate debate tactic. In the first place you claim jesus is a myth as is everything in the bible. Therefore you do not allow the bible as a source. \n \n Use of the gospels as source document on the times is perfectly legitimate. You may use your own sources. Holding the bible to the same scrutiny as other source documents shows it has at least the same level of reliability, archeologically speaking. I have posted those arguments in may other threads and will not duplicate them yet again here. You have failed to provide any evidence that jesus claimed to be king of the jews. You merely state that he did. Where is your source?\n \n You are the one with the burden of proof as you are the one making the claim. \n \n Show one shred of evidence that proves your argument. Trebor you do this all the time. You post assertions and then provide no evidence and then insist that others use your sources and your choices to prove their point.\n \n This is just poor debating technique.\n \n EF", 
   {}, 
   226956, 
   null, 
   1155147360.0
  ], 
  [
   227224, 
   null, 
   "lunchmoney", 
   "This is an illegitimate debate tactic. In the first place you claim jesus is a myth as is everything in the bible. Therefore you do not allow the bible as a source.\n\n this is a legitimate tactic being as he is saying that your sources are faulty. you can say whatever you want and even source them well, but if your sources were written by ignorant fishermen then they dont mean much do they.\n \n \nUse of the gospels as source document on the times is perfectly legitimate. You may use your own sources. Holding the bible to the same scrutiny as other source documents shows it has at least the same level of reliability, archeologically speaking.\n\n then by the same token you have to take the sources of the rabbis to them same level of reliability. such as the talmud in which you will never see one case of the rabbis of that time ever looking to the romans to kill someone for them. keep in mind that the talmud was written at the time of the Romans and you would think that an event like this would make at least some mention somwhere.\n \n\n You are the one with the burden of proof as you are the one making the claim. \n\n actually the assumption that jesus was killed by the jews and not the romans alone would be the item to prove. being as the jews dont kill people in that manner, and that the rabbis never looked to the romans to do their dirty work, it seems logical that the romans did it of their own volition. so the burden of proof would be on you to show that the jews would go out of their norms to look to the romans for help with jesus.\n \n \nShow one shred of evidence that proves your argument.\n\n thats just it, the arguement is self evident as it follows logical assumptions based on the people of that time.\n \n \nIsrael/Judaea was a powderkeg at that time (when hasn't it been ? answer under Byzantine and Turkish rule) and Pontius Pilate did not want a revolt on his hands. So he caved in. Jesus, to him, was just another Jewish zealot and if crucifying him kept the peace for a while then fair enough.\n\n dont get ahead of yourself. pontius pilate was no peace loving hippie. he was a tyranical psycho who would put 1000 people to death in a day because he was in a bad mood. \n there are many stories in the talmud where the caesar was told of the jews rebelling, at which caesae started killing people to get rid of the threat to his rule. such as the case of bar-kamtza. it happened all the time, and it seems likely that caesar would do the same with someone who claimed he was the jewish messiah and was going to liberate the jews from the caesars rule and build the third temple.\n \n \nNo, he did not proclaim himself as King of the Jews.\n \n Pontius Pilate found no guilt in him.\n \n The Jewish clergy pushed for execution CLAIMING he was stirring up trouble against Rome, but had no proof.\n\n which of the gospels is that from? correct me if i am wrong, those quotes come from the later gospels, who were written by people who didnt even live to meet jesus. \n o and claiming you are the messiah IS claiming you are the king of the jews, its part of the deal of becoming the messiah.", 
   {}, 
   226997, 
   null, 
   1155250260.0
  ], 
  [
   227263, 
   null, 
   "peteratwar", 
   "Pontius Pilate was a normal Roman for the times. Sure he was no peace-loving hippie but then neither was he a psychopath killing hundreds if not thousands.\n \n All the main Gospels make it clear Pilate did not think Jesus was guilty of anything. There have been many dubious translations of the Gospels.\n \n What is known is that under the normal political arrangements Pilate rules in conjunction with the local authorities; both sides were happy to keep the peace on their terms and at a highly volatile time such as the Passover would be double vigilant. Don't forget there was a considerable resistance movement going then by the Jews against the Romans. Hence the diaspora a few years later.\n \n Never forget also that what is a major action in our eyes was only a minor incident in the eyes of authority then. Jesus was presented as a rabble-rouser by the Jewish authorities. Pilate couldn't find any guilt in Jesus but hey lets keep a lid on things, execute him and peace will prevail.", 
   {}, 
   227224, 
   null, 
   1155291060.0
  ], 
  [
   227276, 
   null, 
   "trebor", 
   "Pontius Pilate was a normal Roman for the times. Sure he was no peace-loving hippie but then neither was he a psychopath killing hundreds if not thousands.\n \n All the main Gospels make it clear Pilate did not think Jesus was guilty of anything. There have been many dubious translations of the Gospels.\n \n What is known is that under the normal political arrangements Pilate rules in conjunction with the local authorities; both sides were happy to keep the peace on their terms and at a highly volatile time such as the Passover would be double vigilant. Don't forget there was a considerable resistance movement going then by the Jews against the Romans. Hence the diaspora a few years later.\n \n Never forget also that what is a major action in our eyes was only a minor incident in the eyes of authority then. Jesus was presented as a rabble-rouser by the Jewish authorities. Pilate couldn't find any guilt in Jesus but hey lets keep a lid on things, execute him and peace will prevail.\n\n \n \n Begging your pardon, but yes he was a psychopath that killed thousands. He was removed from his positions for excessive cruelty... according to the letters of Philo Judas of Alexander. One incident that was recorded is that during a pilgramage, he hide a lot of soliders in the crowd in ordinary cloths. When a preacher started giving a sermon, he gave a signal, and the soliders started slaughtering the people in the crowd. He had the Samaratian preacher and his disciples captured and cruxified.", 
   {}, 
   227263, 
   null, 
   1155307620.0
  ], 
  [
   227280, 
   null, 
   "peteratwar", 
   "Those letters are somewhat suspect.\n \n There was one occasion when he had a confrontation (militarily) and that was when a bunch of freedom fighters mingled with a crowd to cause trouble. He put it down pretty harshly, but not overly so by the standards of those times.\n \n There is no suggestion that he was anything like a psychopath. Indeed if the rumours are correct, he became a christian himself.", 
   {}, 
   227276, 
   null, 
   1155308820.0
  ], 
  [
   227295, 
   null, 
   "trebor", 
   "Those letters are somewhat suspect.\n \n There was one occasion when he had a confrontation (militarily) and that was when a bunch of freedom fighters mingled with a crowd to cause trouble. He put it down pretty harshly, but not overly so by the standards of those times.\n \n There is no suggestion that he was anything like a psychopath. Indeed if the rumours are correct, he became a christian himself.\n\n \n AH, you are refering to a letter that is known to be a 3rd century fake.\n \n And it isn't just the references in Philo. There are the multiple references in Josephus that showed he was a tyrant, and brutal.", 
   {}, 
   227280, 
   null, 
   1155320880.0
  ], 
  [
   227319, 
   null, 
   "epaphras_faith", 
   "AH, you are refering to a letter that is known to be a 3rd century fake.\n And it isn't just the references in Philo. There are the multiple references in Josephus that showed he was a tyrant, and brutal.\n\n \n Based on what evidence? Please provide a source other than the \"we just know it\" source.\n \n EF", 
   {}, 
   227295, 
   null, 
   1155329040.0
  ], 
  [
   227453, 
   null, 
   "Joe@actsii", 
   "Hello everyone, my name is Joe and I am new around here. So far I am finding things to be very interesting, but I have a question. Is it normal for topics such as this to become so far off topic?", 
   {}, 
   227319, 
   null, 
   1155441660.0
  ], 
  [
   227465, 
   null, 
   "johnhanks", 
   "Hello everyone, my name is Joe and I am new around here. So far I am finding things to be very interesting, but I have a question. Is it normal for topics such as this to become so far off topic?\n\n \n Welcome, Joe. Unfortunately, yes, it is.", 
   {}, 
   227453, 
   null, 
   1155458340.0
  ], 
  [
   227590, 
   null, 
   "peteratwar", 
   "AH, you are refering to a letter that is known to be a 3rd century fake.\n \n And it isn't just the references in Philo. There are the multiple references in Josephus that showed he was a tyrant, and brutal.\n\n \n Josephus was hardly unbiased, nor did he have any persoanl knowledge of what went on. It was only what he heard from what someone else had heard etc.\n \n Remember an old saying 'Believe nothing of what you hear and only half of what you see'. First told to me by an Army Sergeant.\n \n Josephus had a serious Jewish bias with an agenda for doing down Roman officials. There is considerable evidence (when you unearth the facts from the rumours) that Pilate was pretty even-handed and had a considerable empathy for the jewish customs once he had learnt the ropes and understood their ways.\n \n There is little or no reliable evidence to show that he was a bloodthirsty tyrant and psychopath. More that he was your average Roman official carrying on normal Roman policy.\n \n If he thought Jesus was so dangerous how come all the apostles were left alone, a decent burial was granted Jesus and no retribution fell on anyone ? If Pilate really thought there was a problem and if he was really the psychopath you are claiming then one would have expected violent action. There was none.", 
   {}, 
   227295, 
   null, 
   1155552600.0
  ], 
  [
   227594, 
   null, 
   "trebor", 
   "Josephus was hardly unbiased, nor did he have any persoanl knowledge of what went on. It was only what he heard from what someone else had heard etc.\n \n Remember an old saying 'Believe nothing of what you hear and only half of what you see'. First told to me by an Army Sergeant.\n \n Josephus had a serious Jewish bias with an agenda for doing down Roman officials. There is considerable evidence (when you unearth the facts from the rumours) that Pilate was pretty even-handed and had a considerable empathy for the jewish customs once he had learnt the ropes and understood their ways.\n \n There is little or no reliable evidence to show that he was a bloodthirsty tyrant and psychopath. More that he was your average Roman official carrying on normal Roman policy.\n \n If he thought Jesus was so dangerous how come all the apostles were left alone, a decent burial was granted Jesus and no retribution fell on anyone ? If Pilate really thought there was a problem and if he was really the psychopath you are claiming then one would have expected violent action. There was none.\n\n \n Well, I don't accept the gospels as a source for historical information. I will just point out that both Josephus and Philo disagreed. Other than that, and the gospels, we have no information about Pilate. He did get removed for cruxifiying tons of pilgrams though.. That doesn't seem to match the gospels at all.", 
   {}, 
   227590, 
   null, 
   1155563220.0
  ], 
  [
   227595, 
   null, 
   "peteratwar", 
   "'Fraid not he did not crucify tons of pilgrims. He had a run in with what was thought to be an infiltration of freedom fighters using a procession as cover using his local troops armed with cudgels. A big fight broke out and some in the procession were killed but hardly a massacre.", 
   {}, 
   227594, 
   null, 
   1155565860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Christ's Father the God of Abraham?", 
  "url": "http://www.4forums.com/political/religion-debates/8649-christs-father-god-abraham.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8649, 
  "discussion_files": [
   [
    "33125.html", 
    "http://www.4forums.com/political/religion-debates/8649-christs-father-god-abraham-print.html"
   ], 
   [
    "33126.html", 
    "http://www.4forums.com/political/religion-debates/8649-christs-father-god-abraham-2-print.html"
   ]
  ], 
  "identifier": 8649
 }
]