[
 [
  [
   226778, 
   null, 
   "jim's trucking", 
   "A pervert weighing in excess of 300 pounds has been arrested for molesting three young sisters over the past few months. The pervert lives in the same neighborhood as his victims and molested them repeatedly while their mother was at work. He has raped and molested (and admits to it) all three of the girls and was caught only because the 12 year old (THE OLDEST OF THE THREE) finally told her mother about it. \n \n The girls are FIVE, SEVEN and TWELVE YEARS OLD.\n \n This man should surely die.\n \n Is there any good reason to allow this man to live?", 
   {
    "post_info": {
     "post_title": "A perfect candidate for roasting over an open fire..."
    }
   }, 
   null, 
   null, 
   1155050340.0
  ], 
  [
   226779, 
   null, 
   "Jo Bennett", 
   "Because if the state kills him then we all have blood on our hands?\n \n Because life isn't ours to give and take away?\n \n Because there is always the possibility of redemption?\n \n Because even from prison this person may still make some contribution to the world?\n \n Because he at least admitted it and presumably saved the victims the further trauma of a trial? (small consolation but you asked for reasons)", 
   {}, 
   226778, 
   null, 
   1155050640.0
  ], 
  [
   226784, 
   null, 
   "georged", 
   "A pervert weighing in excess of 300 pounds has been arrested for molesting three young sisters over the past few months. The pervert lives in the same neighborhood as his victims and molested them repeatedly while their mother was at work. He has raped and molested (and admits to it) all three of the girls and was caught only because the 12 year old (THE OLDEST OF THE THREE) finally told her mother about it. \n \n The girls are FIVE, SEVEN and TWELVE YEARS OLD.\n \n This man should surely die.\n \n Is there any good reason to allow this man to live?\n\n \n Is child molestation now a capital offense carrying the death penalty? \n \n The obvious question is what were children aged five and seven doing all day with no adult supervision.", 
   {}, 
   226778, 
   null, 
   1155051720.0
  ], 
  [
   226786, 
   null, 
   "peteratwar", 
   "So ?\n \n Why not at Society level ?\n \n The Good Lord could always send him back ?\n \n Unlikely other than for scientific experiment\n \n No reason at all!", 
   {}, 
   226779, 
   null, 
   1155051840.0
  ], 
  [
   226830, 
   null, 
   "jim's trucking", 
   "Is child molestation now a capital offense carrying the death penalty? \nIt should be. I have long advocated the death penalty for child molesters, rapists and murderers (along with a few other categories).\n \n \n \n\n The obvious question is what were children aged five and seven doing all day with no adult supervision.\nYou wouldn't try to make culprits out of the victims, would you?\n \n I've heard similar arguments regarding rape victims who were dressed provocatively...saying it was their own fault that they got raped. Maybe I'm projecting too much of my own will power and respect for women and children into what I think other men should feel. I simply cannot bring myself to have any compassion for a rapist, regardless of the age of the victim or the circumstances surrounding the rape.\n \n I'm pulled one way by the reality that we are animals with a natural tendency to satisfy our sexual needs and the other way by the forced decency that must exist to keep us from indulging in mass orgies. Somebody has to slap these overly horny bastards back in line.\n \n There are plenty of seemingly valid arguments in favor of excusing the rapist, saying that he is only satisfying his natural sex drive. Though many people interject religion into the fray by saying that we shouldn't be playing God or by quoting \"Thou shalt not kill\" from the bible, the rules regarding punishment for rape should in no way be tied to religion. The State, shunning all arguments tainted with religious doctrine, should protect it's citizens from rapists...by killing the rapists...especially when the victims are children.\n \n Naturally, I expect the bleeding heart left to support the rapists and try to return them to society all spruced up in a new suit and with the same civil rights that they enjoyed before they literally ruined someone else's life. That's what recently happened here...a convicted rapist served a measely 10 years in prison, was released; then raped and murdered another woman who was out enjoying a biking trail.", 
   {}, 
   226784, 
   null, 
   1155064980.0
  ], 
  [
   226848, 
   null, 
   "jitobear", 
   "Naturally, I expect the bleeding heart left to support the rapists and try to return them to society all spruced up in a new suit and with the same civil rights that they enjoyed before they literally ruined someone else's life. That's what recently happened here...a convicted rapist served a measely 10 years in prison, was released; then raped and murdered another woman who was out enjoying a biking trail.\n\n \n This is a pretty nasty thing to say, Jim. You know I do not support the death penalty at all - and most certainly not for rapists - and I am a rape victim. You are too free and easy using death as punishment - and frankly - that is frightening. There is no question, however, that rapists serve way too light a sentence.", 
   {}, 
   226830, 
   null, 
   1155069840.0
  ], 
  [
   226858, 
   null, 
   "jim's trucking", 
   "This is a pretty nasty thing to say, Jim. \nI would accept \"harsh\" more so than \"nasty\".\n \n \n You know I do not support the death penalty at all - and most certainly not for rapists - and I am a rape victim. \nYou stand with quite a few others who do not support the death penalty. What I have yet to understand is how someone who is against the death penalty can stand up for the rights of a serial murderer who carried out his own version of the death penalty on people who had done nothing to deserve the death he brought upon them. It's almost as if you turn a blind eye to the killings of the innocent and fight for the life of the killer...giving him/her the opportunity to kill again.\n \n \n You are too free and easy using death as punishment - and frankly - that is frightening. There is no question, however, that rapists serve way too light a sentence.\nWhy should it be frightening? I have no control over it and it will never be implemented to the degree I propose. There are just too many bleeding hearts living amongst us for that to happen.\n \n So don't be frightened. Be disgusted!\n \n \n \n Kill emoticon_xkill all terrorists and those who support them, child molesters, rapists and murderers!!!", 
   {}, 
   226848, 
   null, 
   1155071400.0
  ], 
  [
   226860, 
   null, 
   "jitobear", 
   "I would accept \"harsh\" more so than \"nasty\".\n\n \n It's nasty. Not everyone who disagrees with your wish for vigalante justice supports criminals. I don't. And I'm a victim. I find your statement nasty AND insulting.\n \n \nYou stand with quite a few others who do not support the death penalty. What I have yet to understand is how someone who is against the death penalty can stand up for the rights of a serial murderer who carried out his own version of the death penalty on people who had done nothing to deserve the death he brought upon them. It's almost as if you turn a blind eye to the killings of the innocent and fight for the life of the killer...giving him/her the opportunity to kill again.\n\n \n It's my and your rights I seek to protect. Due process, time to consider more than what the naked eye sees, and the willingness to accept the possibility of error.\n \n I do not support the death penalty because there is no return from it if an error is made, because there is inequity in representation based upon income, because it is too damned expensive, and because I do not want my government to have the right to execute. Next time you feel inclined to insult a rape victim who does not wish to see rapists executed, you might want to actually find out why.\n \n \n \nWhy should it be frightening? I have no control over it and it will never be implemented to the degree I propose. There are just too many bleeding hearts living amongst us for that to happen.\n \n So don't be frightened. Be disgusted!\n\n \n Oh, I am.\n \n Also - I hate the phrase \"bleeding heart liberals\". What pumps through the hearts of conservatives? Dust?", 
   {}, 
   226858, 
   null, 
   1155072060.0
  ], 
  [
   226868, 
   null, 
   "Judeau", 
   "I think hard labor should be reinstituted if the death penalty is abolished. Until that happens, I am in support of the death penalty in the extreme cases. High treason, capital murder, etc. The usual list. But if people knew that they would have a life of hard labor if they did one of these things, that would be (I believe) just as effective of a deterrant.", 
   {}, 
   226860, 
   null, 
   1155073320.0
  ], 
  [
   226869, 
   null, 
   "Jo Bennett", 
   "This isn't about deterrent. Once you get beyond a certain jail term, you pretty much reach a maximum in terms of deterrence. You have to remember that people committing these crimes either don't expect to get caught, or don't care. How many people do you think would rationally sit down and think \"right well I want to rape some kids, but I won't because the penalty is hard labour rather than life in prison\"?", 
   {}, 
   226868, 
   null, 
   1155073620.0
  ], 
  [
   226870, 
   null, 
   "jim's trucking", 
   "It's nasty. Not everyone who disagrees with your wish for vigalante justice supports criminals. I don't. And I'm a victim. I find your statement nasty AND insulting.\nI am sorry that you took it as an insult. The fact that you may find it insulting does not mean that I meant it to be so.\n \n I know you're a victim. That doesn't change my stance on killing the convicted perpetrator. No matter what victims or non-victims think, I think he should die.\n \n \n \n\n It's my and your rights I seek to protect. Due process, time to consider more than what the naked eye sees, and the willingness to accept the possibility of error.\nYou seek no more than I do. I'm for the rights of innocent people. I am not seeking rights for convicted criminals. I seek the death penalty for criminals convicted of certain crimes. If a mistake is made, it's during the trial, not the execution. I trust the jury system to let off more guilty parties than it convicts innocent parties.\n \n I haven't personally read of the way Japan carries out their death penalty, but I've heard that there is no date set...the convicted criminal never knows when he will be executed. It may be weeks or years after the trial that the guards come for the criminal and put him to death without fanfare. There are no announcements to the press, no prayer vigils, no protest gatherings. The first time the criminal's family knows of his death is when the body arrives at their house for burial.\n \n \n \n\n I do not support the death penalty because there is no return from it if an error is made, because there is inequity in representation based upon income, because it is too damned expensive, and because I do not want my government to have the right to execute. Next time you feel inclined to insult a rape victim who does not wish to see rapists executed, you might want to actually find out why.\nThen let's correct the jury system so it makes no errors, let's provide equally fervent representation to all those accused of capital crimes, let's lower the cost of the trials by paying lawyers what they are actually worth and let's privatize executions so that the government does not take part in them.\n \n \n \n \n\n \n [snip]...\n \n Also - I hate the phrase \"bleeding heart liberals\". What pumps through the hearts of conservatives? Dust?\nIce water!\n \n \n Does this mean you don't want to see a picture of my truck?:)", 
   {}, 
   226860, 
   null, 
   1155073740.0
  ], 
  [
   226902, 
   null, 
   "jitobear", 
   "let's lower the cost of the trials by paying lawyers what they are actually worth\n\n \n This I can get behind!\n \n \nDoes this mean you don't want to see a picture of my truck?:)\n\n \n You know I do - but all you do is tease.", 
   {}, 
   226870, 
   null, 
   1155080220.0
  ], 
  [
   226935, 
   null, 
   "Ooaman", 
   "A pervert weighing in excess of 300 pounds...\n\n Would you feel differently if the pervert weighed 225 or 189lbs? Why is the fact that he weighed in excess of 300 pounds important?", 
   {}, 
   226778, 
   null, 
   1155106860.0
  ], 
  [
   226937, 
   null, 
   "danjrush04", 
   "jim's trucking I agree with you a 100%, however I'd like to point out I hate our government and I think everything needs to be redone, who says we have to chose from an already established government why not form a entire different form of government, with all our experience from this ###### government we have in place right now you'd think we could come up with something better....", 
   {}, 
   226935, 
   null, 
   1155108720.0
  ], 
  [
   226958, 
   null, 
   "jim's trucking", 
   "Would you feel differently if the pervert weighed 225 or 189lbs? Why is the fact that he weighed in excess of 300 pounds important?\nNo. I revealed his weight just to emphasize the unfairness of his actions. Had he been a 98 pound pervert, the 12 year old might have been able to fight him off.", 
   {}, 
   226935, 
   null, 
   1155131700.0
  ], 
  [
   226960, 
   null, 
   "jim's trucking", 
   "jim's trucking I agree with you a 100%, however I'd like to point out I hate our government and I think everything needs to be redone, who says we have to chose from an already established government why not form a entire different form of government, with all our experience from this ###### government we have in place right now you'd think we could come up with something better....\nThen why not start a thread in one of the government forums explaining what your platform would look like?\n \n There's no need to expand on it here in this \"death to child molesters\" thread, but I would like to hear your ideas for a mo betta guvamint.", 
   {}, 
   226937, 
   null, 
   1155131940.0
  ], 
  [
   227252, 
   null, 
   "Ooaman", 
   "No. I revealed his weight just to emphasize the unfairness of his actions. Had he been a 98 pound pervert, the 12 year old might have been able to fight him off.\n\n Yes, but if he was a 98 pound pervert, he would still be a pervert and an attempted rapist.", 
   {}, 
   226958, 
   null, 
   1155279900.0
  ], 
  [
   227253, 
   null, 
   "Ooaman", 
   "Originally Posted by georged\n The obvious question is what were children aged five and seven doing all day with no adult supervision.\n \n \n You wouldn't try to make culprits out of the victims, would you?\n \n\n I don't think this is to blame the victims but to say that the parents should have kept a better eye on them.\n By the way, is anything said about where the parent's were?", 
   {}, 
   226958, 
   null, 
   1155280200.0
  ], 
  [
   227271, 
   null, 
   "peteratwar", 
   "Ultimately a child's safety is the responsibility of the parents although clearly e.g. at school that gets delegated.\n \n There is of course the argument that if little John or Joyce wants to play in such and such a place they should be allowed to.\n \n There is also the common-sense argument 'Don't be so bloody silly'. In this or mostly any other age this argument wins.\n \n This does not mean that there is any justification for such acts of perversion. I have no problem with execution in such cases.", 
   {}, 
   227253, 
   null, 
   1155300600.0
  ], 
  [
   227312, 
   null, 
   "Dan Dailey", 
   "Is child molestation now a capital offense carrying the death penalty? \n \n The obvious question is what were children aged five and seven doing all day with no adult supervision.\n\n \n Oklahoma just passed a law adding child rape to the list of capital crimes for repeat offenders. They joined a few other states that have the same staute however none have yet to us it. I say ththe states that have it on the books need to start using it.", 
   {}, 
   226784, 
   null, 
   1155327420.0
  ], 
  [
   227316, 
   null, 
   "Ooaman", 
   "Oklahoma just passed a law adding child rape to the list of capital crimes for repeat offenders. They joined a few other states that have the same staute however none have yet to us it. I say ththe states that have it on the books need to start using it.\n\n So the first time is a warning but to do it and get caught more than once is a capital crime?", 
   {}, 
   227312, 
   null, 
   1155328560.0
  ], 
  [
   227322, 
   null, 
   "jim's trucking", 
   "I don't think this is to blame the victims but to say that the parents should have kept a better eye on them.\n By the way, is anything said about where the parent's were?\nI don't doubt that there are many parents who cannot afford a nanny or day care center. It's not uncommon for a 12 year old child to be home watching its younger siblings.\n \n The RAPIST/MOLESTER is at fault, not the parents, not the children.", 
   {}, 
   227253, 
   null, 
   1155331020.0
  ], 
  [
   227338, 
   null, 
   "Ooaman", 
   "I don't doubt that there are many parents who cannot afford a nanny or day care center. It's not uncommon for a 12 year old child to be home watching its younger siblings.\n \n The RAPIST/MOLESTER is at fault, not the parents, not the children.\n\n I don't doubt that it's the rapist/molester who's at fault. I just think it could have been prevented if their were a parent (or some adult) around. A pedophile probably would not be interested in raping an adult because that wouldn't be how they got their kicks.", 
   {}, 
   227322, 
   null, 
   1155335340.0
  ], 
  [
   239083, 
   null, 
   "Rekhyt2238", 
   "I think hard labor should be reinstituted if the death penalty is abolished. Until that happens, I am in support of the death penalty in the extreme cases. High treason, capital murder, etc. The usual list. But if people knew that they would have a life of hard labor if they did one of these things, that would be (I believe) just as effective of a deterrant.\n\n \n I agree with this. The death penelty is a deterent, not just to current criminals, but to potential criminals. Hard labor, would almost be as good as a deterent. But, the government and the country could actually benefit from this!!!\n \n \nSo the first time is a warning but to do it and get caught more than once is a capital crime?\n\n \n No, not really. This just helps to eliminate your concern of a mistake, which will execute an innocent person. This uses the logic that it's possible to get falsely convicted once, but what's the chance of getting falsely convicted twice?", 
   {}, 
   226868, 
   null, 
   1163218860.0
  ], 
  [
   239521, 
   null, 
   "DrNo", 
   "I don't doubt that it's the rapist/molester who's at fault. I just think it could have been prevented if their were a parent (or some adult) around. A pedophile probably would not be interested in raping an adult because that wouldn't be how they got their kicks.\n\n \n You are missing the point. People like this are predators. They actively stalk and seek out children who are not attended. They are disgusting, sick cowards who prey on helpless children. Of course it could have been prevented if somebody had been around. What kind of argument is that? What does that prove? It would make just as much sense to say if this guy wasn't a child molesting pervert this wouldn't have happened. But it did happen. And the molestor is at fault. This man has violated the rights of three people, he deserves to lose his rights and be locked away for life if not put to death. These people are PREDATORS. They need to be eliminated from our society.", 
   {}, 
   227338, 
   null, 
   1163446680.0
  ], 
  [
   240095, 
   null, 
   "Anastasia", 
   "I don't think this is to blame the victims but to say that the parents should have kept a better eye on them.\n By the way, is anything said about where the parent's were?\n\n \n What about the times when the parent IS the abuser?", 
   {}, 
   227253, 
   null, 
   1163714640.0
  ], 
  [
   240157, 
   null, 
   "Shooterandproud", 
   "Is there any reason to kill a sentinent human life form unless you are in imminent danger?\n \n Call me a bleeding heart, but \"an eye for an eye leaves everyone blind\" as Ghandi says.", 
   {}, 
   226958, 
   null, 
   1163738940.0
  ], 
  [
   240158, 
   null, 
   "Shooterandproud", 
   "It should be. I have long advocated the death penalty for child molesters, rapists and murderers (along with a few other categories).\n\n \n No offense, but thats completely stupid. In some ancient culture, they made robbery a capital offense, so all the robbers just killed their victims. The same will happen here, the rapist and molesters will just murder their victims. Even though I am against the DP, this is pretty stupid. If you really wanted to stop them in their tracks, get a carry permit and come join us at the NRA. I think it is morally right to kill someone if you are in imminent danger, but morally wrong if you are not. Your agenda will have a negative effect on society.\n \n \n \n \n I\n've heard similar arguments regarding rape victims who were dressed provocatively...saying it was their own fault that they got raped. Maybe I'm projecting too much of my own will power and respect for women and children into what I think other men should feel. I simply cannot bring myself to have any compassion for a rapist, regardless of the age of the victim or the circumstances surrounding the rape.\n\n \n Agreed and disagreed.\n \n \nI'm pulled one way by the reality that we are animals with a natural tendency to satisfy our sexual needs and the other way by the forced decency that must exist to keep us from indulging in mass orgies.\n\n \n Thats how we were made. You can thank evolution for that :xbanghead.\n \n \nThere are plenty of seemingly valid arguments in favor of excusing the rapist, saying that he is only satisfying his natural sex drive.\n\n \n I may be a liberal, but I dont go that far.\n \n \n The State, shunning all arguments tainted with religious doctrine, should protect it's citizens from rapists...by killing the rapists...especially when the victims are children.\n\n \n See above. Do you want victims to be murdered? I sure don't want to go back in history, executing people who violate non murder or treason laws. I want to move forward, abolishing the barbaric DP.\n \n \nNaturally, I expect the bleeding heart left to support the rapists and try to return them to society all spruced up in a new suit and with the same civil rights that they enjoyed before they literally ruined someone else's life.\n\n \n I believe thats a bit of a strawman, but dont be prejudice. Not all of us are like that.\n \n \n \nThat's what recently happened here...a convicted rapist served a measely 10 years in prison, was released; then raped and murdered another woman who was out enjoying a biking trail.\n\n \n Nothing a Carry permit and a 1911 can't prevent from happening.", 
   {}, 
   226830, 
   null, 
   1163739360.0
  ], 
  [
   240159, 
   null, 
   "Shooterandproud", 
   "You stand with quite a few others who do not support the death penalty. What I have yet to understand is how someone who is against the death penalty can stand up for the rights of a serial murderer who carried out his own version of the death penalty on people who had done nothing to deserve the death he brought upon them. It's almost as if you turn a blind eye to the killings of the innocent and fight for the life of the killer...giving him/her the opportunity to kill again.\n\n \n Its because the criminal is a disgusting pig, and we are not. Are you really saying we should sink to the criminal's level.\n \n \nWhy should it be frightening? I have no control over it and it will never be implemented to the degree I propose. There are just too many bleeding hearts living amongst us for that to happen.\n\n \n The bleeding hearts are here to keep people like you out of politics emoticon_xhoho.\n \n \nSo don't be frightened. Be disgusted!\n\n \n Make love not war. emoticon_love \n \n \n \n \nKill emoticon_xkill all terrorists and those who support them, child molesters, rapists and murderers!!!\n\n \n Make love not war emoticon_love.", 
   {}, 
   226858, 
   null, 
   1163739660.0
  ], 
  [
   240160, 
   null, 
   "Shooterandproud", 
   "jim's trucking I agree with you a 100%, however I'd like to point out I hate our government and I think everything needs to be redone, who says we have to chose from an already established government why not form a entire different form of government, with all our experience from this ###### government we have in place right now you'd think we could come up with something better....\n\n \n It never worked before and it sure as hell wont work again.", 
   {}, 
   226937, 
   null, 
   1163739720.0
  ], 
  [
   240161, 
   null, 
   "Shooterandproud", 
   "I agree with this. The death penelty is a deterent,\n\n \n Yet studies have been conducted that contradict that.", 
   {}, 
   239083, 
   null, 
   1163739960.0
  ], 
  [
   242493, 
   null, 
   "Judeau", 
   "This isn't about deterrent. Once you get beyond a certain jail term, you pretty much reach a maximum in terms of deterrence. You have to remember that people committing these crimes either don't expect to get caught, or don't care. How many people do you think would rationally sit down and think \"right well I want to rape some kids, but I won't because the penalty is hard labour rather than life in prison\"?\n\n \n I like the way you worded this, it made me chuckle. I guess I can see your point, but I still believe it acts as a deterrant. I know we aren't discussing this but I brought up high treason earlier and people who commit that are probably considering consequences more thoroughly than the child rapists. The penalties we have must work to some extent because I have to believe that if there were absolutely no penalty at all for raping children, there would be a lot more cases of it, particularly in schools and churches.", 
   {}, 
   226869, 
   null, 
   1165518840.0
  ], 
  [
   242542, 
   null, 
   "foundit66", 
   "The penalties we have must work to some extent because I have to believe that if there were absolutely no penalty at all for raping children, there would be a lot more cases of it, particularly in schools and churches.\n\n \n I would be seriously surprised if it didn't act as a deterrent for some.\n \n But on another level, I think the most effective solution is to talk to kids about such things, let them know their \"rights\" regarding personal boundaries, and ensure that there is an open line of ready communication for them to tell an authority/guardian anything of this nature.\n \n That it's not their fault or responsibility, and that it's not their embarrassment.\n Ultimately, the victim's silence is what prolongs continuing abuse, and at a young age it is easy for a pedophile to take advantage of a young person's innocence ...\n \n < steps down off of soap-box <", 
   {}, 
   242493, 
   null, 
   1165531620.0
  ], 
  [
   242581, 
   null, 
   "Rekhyt2238", 
   "That is a good thing to do, but it wouldn't help for everything. Such as the very violent ones, where they are raped then killed, or vice versa.", 
   {}, 
   242542, 
   null, 
   1165545960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A perfect candidate for roasting over an open fire...", 
  "url": "http://www.4forums.com/political/crime-debates/8658-perfect-candidate-roasting-over-open-fire.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 8658, 
  "discussion_files": [
   [
    "28326.html", 
    "http://www.4forums.com/political/crime-debates/8658-perfect-candidate-roasting-over-open-fire-print.html"
   ], 
   [
    "28327.html", 
    "http://www.4forums.com/political/crime-debates/8658-perfect-candidate-roasting-over-open-fire-3-print.html"
   ], 
   [
    "28328.html", 
    "http://www.4forums.com/political/crime-debates/8658-perfect-candidate-roasting-over-open-fire-2-print.html"
   ]
  ], 
  "identifier": 8658
 }
]