[
 [
  [
   226978, 
   null, 
   "Another opinion", 
   "Instead of the usual thread where one person posts a view or news article and a discussion continues from there, I was hoping to present this thread for people to simply present a one-post summary of their views on abortion. The goal, then, is for this not to be a discussion thread but a survey of the views on abortion. So please, if you can, simply present a summary of your views and try to avoid starting a discussion by making comments about any specific person's views. I, for one, will not be responding to any comments if they do come up.\n \n The hope is that some of those readers who rarely post will also be willing to present their views so that we get a wider range of views on the subject. I hope you think this is a good idea and participate.\n \n One last note: Since the goal is to put ones views in one post, later editing of that post should be no problem (ex. if you realize that there was a point that you did not add). \n \n Again, please do not make comments about any specific person's views so that this thread will remain a survey thread - not a discussion thread.\n \n --------------------------------------------------------------------\n I'll start with my own view:\n \n For me, the question of abortion rights comes down to a balance between the rights of the mother and the rights of the fetus. On the side of the rights of the mother, there is a very important right to the control over one's own body and to not be forced to carry something as important and taxing as a pregnancy against one's will. Some may say that, in agreeing to have sex, a woman is agreeing to a pregnancy, but I strongly disagree. A pregnancy is a possible outcome of sex but only has a very small percentage chance if birth control is used. It would be like saying that you agree to be mugged if you walk in a bad neighborhood. The great majority of sex acts - for both married and unmarried women, religious or non-religious, conservative or liberal - are not done for the purposes of having children but are done for emotional and/or purely physical reasons. Pregnancy is the goal for only a minority of sex acts. So, women are not agreeing to a pregnancy when they have sex. In the case of unwanted pregnancies, it is a significant burden that they never agreed to. If they are forced to carry such a pregnancy, it would be a strong imposition against the rights over their own bodies.\n \n On the other hand, one has the rights of the fetus. What rights the fetus has depends on your belief system and priorities. For me, the most important thing when it comes to the rights of any human being is whether or not there is a mental existence - at least a rudimentary mind. I believe that I did not exist until I started to mentally exist and that applies to all others. My view is that, once a mental existence begins, the right to life of a fetus kicks in and takes priority over the mother's rights over her own body, under most circumstances. The neurological view is that a mind cannot exist before the third trimester. Therefore, I would allow abortion-on-demand for the first and second trimester and restrict it in the third trimester. For that third trimester, I would limit abortions to those that are done to mitigate a significant risk to the mother's life or physical or mental health (ex. leading to, say, paralysis or strong possibility of suicide, etc.) and, in case of severe incurable deformations of the fetus discovered late, to end the life of a fetus that would otherwise strongly suffer (i.e. mercy killing). Otherwise, I believe abortions should be restricted. If a woman has not decided on an abortion by the third trimester, she should have to carry the pregnancy to term (minus the perviously mentioned exceptions). She would have had ample time to decide.\n \n Lastly, here are a couple of links which describe the neurological view of a mind not existing before the third trimester:\n \n Part 4 of http://www.2think.org/abortion.shtml \n \n http://7e.devbio.com/article.php?ch=21&id=162", 
   {
    "post_info": {
     "post_title": "Survey of views on abortion"
    }
   }, 
   null, 
   null, 
   1155141960.0
  ], 
  [
   226980, 
   null, 
   "jim's trucking", 
   "Mother's choice available through 1st trimester.\n \n Mother's choice not available after 1st trimester with exception in cases where mother's life is threatened by continuing pregnancy.\n \n Pregnancy due to incest-abortion mandatory.\n \n Pregnancy due to rape-cost of abortion paid by rapist or by the courts who generally let the rapists off scot-free.", 
   {}, 
   226978, 
   null, 
   1155142740.0
  ], 
  [
   226983, 
   null, 
   "simone", 
   "Abortion on demand until the fetus is viable outside the womb. Abortions only if necessary because of health issues thereafter, exceptions in cases of rape or incest where a victim has been denied access to medical care and knowledge.\n \n Full and complete education on sexuality and contraception, as well access to contraception in order to made it unnecessary to have abortions. Abortions are routinely used as birth control in Japan and other parts of the world because women lack access to far better forms of contraception in those regions.\n \n The sexuality education will include sections on building self-esteem so that young people can have identities as valuable individuals in and of themselves, not as slutty rap star studs or whorish Brittany Spears wannabes.", 
   {}, 
   226980, 
   null, 
   1155143520.0
  ], 
  [
   226990, 
   null, 
   "georged", 
   "Mother's choice at all times.", 
   {}, 
   226983, 
   null, 
   1155145980.0
  ], 
  [
   226993, 
   null, 
   "sinjin", 
   "If it's gotta go, please make it sooner than later.", 
   {}, 
   226990, 
   null, 
   1155146640.0
  ], 
  [
   226995, 
   null, 
   "jitobear", 
   "Mother's choice always.\n \n Restrictions once the fetus is viable would not bother me so much if it weren't for the fact that the laws penned to date flippantly ignore any health issue the woman faces short of death. I do feel few doctors perform abortions this late without good cause, so legal restrictions seem to be more of political move than any kind effort that will help women or children.\n \n I also support more education, better health care, more birth control, more self esteem and respect (especially for women), getting a grown up attitude (vs. prudish) about sex in this country, and finding more constructive ways of helping pregnant women get ALL their needs met.", 
   {}, 
   226990, 
   null, 
   1155147120.0
  ], 
  [
   227069, 
   null, 
   "Ooaman", 
   "I say if everyone is healthy, then have the baby.\n \n If the mother's health comes into question, than do whatever can be done but leave abortion as an absolute last resort.\n \n If a 9-14 year old girl gets pregnant in a rape then I don't believe I would be ashamed of her (along with many others here) if she got an abortion. If she got pregnant by her father, then whatever she does, I say the father should get some help and have that help be required by law.", 
   {}, 
   226995, 
   null, 
   1155164400.0
  ], 
  [
   227241, 
   null, 
   "Evan", 
   "I think that an abortion should only be used in the situation where the mothers life is at risk, and no other. no one should get an abortion if the baby was just unplanned do to complications, a lack of responsibility, or even if the mother has been raped. \n \n Its a horrible thing to be raped and i would have no problem having the rapest killed, but I just don't think that the child should be punished for the sins of their biological father. I understand that the women that got pregnant as a reasult of being raped will have to go through alot in order to have the child but that doesn't give them a \"kill for free card\". When weighing the situations i feel that it is much more horrible to kill the child then to have the women go through the birth.", 
   {}, 
   227069, 
   null, 
   1155274440.0
  ], 
  [
   227242, 
   null, 
   "Bell", 
   "Abortion on demand until the fetus is viable outside the womb. Abortions only if necessary because of health issues thereafter, exceptions in cases of rape or incest where a victim has been denied access to medical care and knowledge.\n \n Full and complete education on sexuality and contraception, as well access to contraception in order to made it unnecessary to have abortions. Abortions are routinely used as birth control in Japan and other parts of the world because women lack access to far better forms of contraception in those regions.\n \n The sexuality education will include sections on building self-esteem so that young people can have identities as valuable individuals in and of themselves, not as slutty rap star studs or whorish Brittany Spears wannabes.\n\n \n Me, too. \n \n Allow me to add that I do not counsel any woman to obtain an abortion if she is in said situation. However, regardless of her decision, until society changes dramatically, I will support her decision regardless.", 
   {}, 
   227241, 
   null, 
   1155276180.0
  ], 
  [
   227282, 
   null, 
   "simone", 
   "Amen, Bell, her choice, not mine, not anyone else's.", 
   {}, 
   227242, 
   null, 
   1155314520.0
  ], 
  [
   227300, 
   null, 
   "Steeeeve", 
   "I'll just insert a placeholder here....\n \n I see Simone is already breaking the thread request", 
   {}, 
   227282, 
   null, 
   1155322740.0
  ], 
  [
   227692, 
   null, 
   "Joe@actsii", 
   "Instead of the usual thread where one person posts a view or news article and a discussion continues from there, I was hoping to present this thread for people to simply present a one-post summary of their views on abortion. The goal, then, is for this not to be a discussion thread but a survey of the views on abortion. So please, if you can, simply present a summary of your views and try to avoid starting a discussion by making comments about any specific person's views. I, for one, will not be responding to any comments if they do come up.\n \n\n \n \n I believe abortion is murder and should be illegal. The only possible circumstance when an abortion should be an option is when the \"LIFE\" of both the mother and her unborn child is at risk. When both lives are going to be lost, it is better to save one as opposed to losing two. The holocaust on the unborn children of this country is something that we should be ashamed of as a country.", 
   {
    "unicode_changes_made": true
   }, 
   226978, 
   null, 
   1155610800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Survey of views on abortion", 
  "url": "http://www.4forums.com/political/abortion-debates/8671-survey-views-abortion.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 8671, 
  "discussion_files": [
   [
    "198.html", 
    "http://www.4forums.com/political/abortion-debates/8671-survey-views-abortion-print.html"
   ]
  ], 
  "identifier": 8671
 }
]