[
 [
  [
   227351, 
   null, 
   "billsco", 
   "One thing that has been slightly bothering me about this forum (besides the typo in the header) is the editorial comment implicit in the header: Creation (Intelligent Design) vs Evolution.\n \n Is there a bias present?", 
   {
    "post_info": {
     "post_title": "Biased Forum?"
    }
   }, 
   null, 
   null, 
   1155339420.0
  ], 
  [
   227359, 
   null, 
   "Ooaman", 
   "I know that when I first joined almost a year ago, there was no (Intelligent Design) added on to \"Creation.\" I think it's because Intelligent Design is supposed to be something added to make \"Creation\" sound more professional or something I don't know.\n \n \n At least we don't have a forum called \"Intelligent Falling Vs. Gravity.\"", 
   {}, 
   227351, 
   null, 
   1155345120.0
  ], 
  [
   227363, 
   null, 
   "Master_Shake", 
   "One thing that has been slightly bothering me about this forum (besides the typo in the header) is the editorial comment implicit in the header: Creation (Intelligent Design) vs Evolution.\n \n Is there a bias present?\n\n I don't know if it's a bias as much as it is an attempt to include people who identify as ID and not creation and vice versa.", 
   {}, 
   227351, 
   null, 
   1155345540.0
  ], 
  [
   227372, 
   null, 
   "pandion", 
   "I'm not sure what the source of the bias would be. Do you mean that it is somehow prejudicial to link ID with creationism, because, somehow ID is scientific while creationism isn't? But that's just not true. In the Dover case the court concluded that ID isn't science any more than creationism is. In fact, it was clearly demonstrated that the motivation for ID is an effort to disguise the fact that it is nothing more than creationism without the mention of god. Basically, if you scratch an IDer, you get a creationist.", 
   {}, 
   227363, 
   null, 
   1155347880.0
  ], 
  [
   227390, 
   null, 
   "Kronus", 
   "The bias I noticed comes from the list of potential topics:\n \n \"Did Charles Darwin Recant, Bombardier beetle, Moon Dust, Dinosaurs and Human Footprints, Evolution in School, Magnetic Field, Second Law of Thermodynamics, Shrinking Sun, Nebraska Man\"\n \n Every one is an argument against evolution. There's nothing there for fossil record or genetic studies or anything that supports evolution.", 
   {}, 
   227372, 
   null, 
   1155393720.0
  ], 
  [
   227402, 
   null, 
   "johnhanks", 
   "The bias I noticed comes from the list of potential topics:\n \n \"Did Charles Darwin Recant, Bombardier beetle, Moon Dust, Dinosaurs and Human Footprints, Evolution in School, Magnetic Field, Second Law of Thermodynamics, Shrinking Sun, Nebraska Man\"\n \n Every one is an argument against evolution. There's nothing there for fossil record or genetic studies or anything that supports evolution.\n\n \n You could argue this either way. The people who run the forum presumably write that list as a prod to discussion; discussion is fuelled by controversy; omitting evidence for evolution thus implies that such evidence is not controversial enough - i.e. too well-established and lacking intellectually serious opposition - to act as a prod to potential posters.\n \n \n \"Did Charles Darwin Recant\", by contrast, is guaranteed to set off some dingbat somewhere...", 
   {}, 
   227390, 
   null, 
   1155405660.0
  ], 
  [
   227410, 
   null, 
   "billsco", 
   "I made a number of suggestions to admin some months ago which were designed to freshen up the home page a bit. Inserting Intelligent Design in parentheses next to Creation was one of them. Trying to look anew at the forums, I began to question whether editorial comment had slipped in. I would think the forum headers would try to maintain neutrality. \n \n Let me ask it this way: How would you like the forum presented? Would you prefer to keep ID in the header; change the descriptor list; or leave it alone?", 
   {}, 
   227402, 
   null, 
   1155411480.0
  ], 
  [
   227426, 
   null, 
   "Collin", 
   "I've always figured that whoever made the ToE topic didn't have much of an idea what they were talking about. \"Shrinking sun\" and \"moon dust\"? Come on! The topic's name suggests an utter lack of thought, not bias.", 
   {}, 
   227410, 
   null, 
   1155423660.0
  ], 
  [
   227429, 
   null, 
   "Ooaman", 
   "I used to (and still do sometimes) wonder what somethings have to do with the subject. For example, what does moon dust have to do with Creation vs. Evolution anyway?", 
   {}, 
   227426, 
   null, 
   1155425820.0
  ], 
  [
   227431, 
   null, 
   "Belfrey", 
   "I used to (and still do sometimes) wonder what somethings have to do with the subject. For example, what does moon dust have to do with Creation vs. Evolution anyway?\n\n Young-Earth Creationists have often claimed that the observed thickness of dust on the moon is inconsistent with an old moon.\n \n Talkorigins CE101: Moon Dust", 
   {}, 
   227429, 
   null, 
   1155427500.0
  ], 
  [
   227432, 
   null, 
   "georged", 
   "I think of ID, or creation, versus evolution as a sub-topic of religion. Given the topic volume, where pro-ID posters rely primarily on faith and testimony in one form or another for their opinions, it would certainly fit in religion but that could be said of most all popular US topics regardless of how the header presents the topic, typos, biased or not.", 
   {}, 
   227429, 
   null, 
   1155427800.0
  ], 
  [
   227435, 
   null, 
   "electrolyte", 
   "I think of ID, or creation, versus evolution as a sub-topic of religion. Given the topic volume, where pro-ID posters rely primarily on faith and testimony in one form or another for their opinions, it would certainly fit in religion but that could be said of most all popular US topics regardless of how the header presents the topic, typos, biased or not.\n\n Creationism may be religiously based, but evolutionary theory is science, and creationists want their views to be science, so shouldn't we put it in the Science forum?\n No, wait, thanks to the religious right, the creationism/evolution debate has been highly politicized, so let's make it a subsection of the Politics forum.\n Or, how about, since as a result of this politicization, the field of education is being affected by this \"debate,\" let's put it in Education.\n No, let's put it in Worldviews. No, wait, Philosophy. No, Society Debates. I got it: General!\n \n This forum is generally a very active forum. I think it's reasonable for it to exist independently of these related fora, especially considering some of the expertise present on this board.\n I occasionally post on a discussion board where the only three main topics are Politics, Religion, and Science. When it comes to the politicization of pseudoscientific religious beliefs, I never know where to create a new thread.\n \n billsco, here's my recommendation: take out around half of these \"creationist arguments\" in the description and replace them with some \"evolutionist arguments,\" e.g. nested hierarchies, endogenous retroviral insertions, vestigial structures, pseudogenes; or maybe even some subjects without including an argument/view, like \"common descent\" or \"macroevolution.\"\n Perhaps the title could also be changed to something like \"Creationism, Intelligent Design, and Evolution,\" which would clearly indicate the topic of the forum without \"questionably\" grouping any viewpoints together.", 
   {}, 
   227432, 
   null, 
   1155430620.0
  ], 
  [
   227446, 
   null, 
   "marc9000", 
   "I made a number of suggestions to admin some months ago which were designed to freshen up the home page a bit. Inserting Intelligent Design in parentheses next to Creation was one of them. Trying to look anew at the forums, I began to question whether editorial comment had slipped in. I would think the forum headers would try to maintain neutrality. \n \n Let me ask it this way: How would you like the forum presented? Would you prefer to keep ID in the header; change the descriptor list; or leave it alone?\n\n \n IMO it should be left alone, or the descriptor list made shorter. It simply won't affect the content or quality of how the forum is used at all. \n \n I believe what sets the tone for how the forum is used is the content and balance of it's existing threads.", 
   {}, 
   227410, 
   null, 
   1155436440.0
  ], 
  [
   227609, 
   null, 
   "Waxy", 
   "At least we don't have a forum called \"Intelligent Falling Vs. Gravity.\"\n\n \n LOL. :p\n \n emoticon_xhoho \n \n Waxy", 
   {}, 
   227359, 
   null, 
   1155574680.0
  ], 
  [
   227966, 
   null, 
   "Ooaman", 
   "Young-Earth Creationists have often claimed that the observed thickness of dust on the moon is inconsistent with an old moon.\n \n Talkorigins CE101: Moon Dust\n\n \n I was under the impression that the moon was not as old as the Earth because a huge Mars size object crashed into Earth and that caused the moon to form. Isn't that the working theory?", 
   {}, 
   227431, 
   null, 
   1155833400.0
  ], 
  [
   227976, 
   null, 
   "electrolyte", 
   "I was under the impression that the moon was not as old as the Earth because a huge Mars size object crashed into Earth and that caused the moon to form. Isn't that the working theory?\n\n Right, but the creationists have finagled the math a bit to come up with a 6000-year old moon. The giant impact hypothesis holds that the impact occurred very early in Earth's lifetime.", 
   {}, 
   227966, 
   null, 
   1155837600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Biased Forum?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8683-biased-forum.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 8683, 
  "discussion_files": [
   [
    "22184.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8683-biased-forum-print.html"
   ], 
   [
    "22185.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8683-biased-forum-2-print.html"
   ]
  ], 
  "identifier": 8683
 }
]