[
 [
  [
   227400, 
   null, 
   "simone", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n \n Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.", 
   {
    "post_info": {
     "post_title": "Love of God, Hatred of Humanity"
    }
   }, 
   null, 
   null, 
   1155404700.0
  ], 
  [
   227403, 
   null, 
   "georged", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n \n Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.\n\n \n Or at least accepted only for their mythological value by those requiring a defined supreme being with detailed dogma comfort zone. That requires far more general education at primary levels, sadly lacking in most aggressive religious support base populations.", 
   {}, 
   227400, 
   null, 
   1155409740.0
  ], 
  [
   227404, 
   null, 
   "Ooaman", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n\n This is because you only get to see the extreamists' side of things.", 
   {}, 
   227400, 
   null, 
   1155410040.0
  ], 
  [
   227405, 
   null, 
   "georged", 
   "This is because you only get to see the extreamists' side of things.\n\n \n No different than what a nation experiences (sees) from acts of leadership.", 
   {}, 
   227404, 
   null, 
   1155410280.0
  ], 
  [
   227418, 
   null, 
   "Jo Bennett", 
   "Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.\n\n \n Gandhi was a religious man, I don't think many people would claim he wasn't motivated by love of his fellow humans. Humans fall short of what we're called to be. Christians believe that Christ said two commandments were important, to love God, and to love your neighbour. And you have to do the latter in order to do the former (though not necessarily vice-versa).", 
   {}, 
   227400, 
   null, 
   1155420600.0
  ], 
  [
   227425, 
   null, 
   "trebor", 
   "Gandhi was a religious man, I don't think many people would claim he wasn't motivated by love of his fellow humans. Humans fall short of what we're called to be. Christians believe that Christ said two commandments were important, to love God, and to love your neighbour. And you have to do the latter in order to do the former (though not necessarily vice-versa).\n\n \n \n \n Gandhi walked barefoot everywhere, to the point that his feet became quite thick and hard. Even when he wasn't on a hunger strike, he did not eat much and became quite thin and frail. Due to his poor diet and deteriorating health, he suffered from very bad breath. Nevertheless he was highly respected as an important spiritual leader\n \n \n In other words, he was known as a super-calloused fragile mystic plagued with halitosis.", 
   {}, 
   227418, 
   null, 
   1155423600.0
  ], 
  [
   227427, 
   null, 
   "simone", 
   "Treborrrrrrrrrr! Gar! Gnash! Snarl! Snap! Snap!", 
   {}, 
   227425, 
   null, 
   1155424320.0
  ], 
  [
   227430, 
   null, 
   "Ooaman", 
   "Simone, as I said before, you're only getting to see what the extremist (or I think the more appropriate term is fundamentalist.)\n But you know what, be thankful that they are the ones that you hear of. The point of news is to report what is new and unusual. If you only heard about the non fundamentalist, then that would mean that that was the norm.", 
   {}, 
   227427, 
   null, 
   1155426300.0
  ], 
  [
   227438, 
   null, 
   "jyoshu", 
   "Simone, as I said before, you're only getting to see what the extremist (or I think the more appropriate term is fundamentalist.)\n\n \n Personally, I think the problem is not that it's all she's \"getting\" to see, but rather all she chooses to see. It doesn't take much looking to realize that violent fundamentalism is by far the exception and not the rule of religion.", 
   {}, 
   227430, 
   null, 
   1155433140.0
  ], 
  [
   227439, 
   null, 
   "georged", 
   "Personally, I think the problem is not that it's all she's \"getting\" to see, but rather all she chooses to see. It doesn't take much looking to realize that violent fundamentalism is by far the exception and not the rule of religion.\n\n \n Are we talking about US or Islamic fundamentalism in the ME? Both have embraced violence over diplomacy and, when considering US/Israeli military and Iraqi Government Shiite death squad actions, I can't ascertain any difference between them and what is now called insurgents and civilians harboring resistance fighters deemed terrorists by the US and its UK lapdog. Doesn't any country or religion bear the image of of its public leadership and/or actions?", 
   {}, 
   227438, 
   null, 
   1155434040.0
  ], 
  [
   227444, 
   null, 
   "marc9000", 
   "Personally, I think the problem is not that it's all she's \"getting\" to see, but rather all she chooses to see. It doesn't take much looking to realize that violent fundamentalism is by far the exception and not the rule of religion.\n\n \n Exactly right. It also doesn't take much looking to find that a lack of religion can involve violence, and the murder of millions. An opposition to religion, often combined with an effort to make it subservient to special interests. Hitler, Stalin, Lenin, Mao, Ho Chi Min, Tito, Napolion, and Breshnev all come to mind.\n \n \nPiety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed. \n\n \n Actual history shows us that a love of self, an opposition to religion, can also forbid love and concern for one's fellow man. It's my scariest thought to see atheism established in U.S. government.", 
   {}, 
   227438, 
   null, 
   1155435840.0
  ], 
  [
   227477, 
   null, 
   "Big_Bear_Scot", 
   "Exactly right. It also doesn't take much looking to find that a lack of religion can involve violence, and the murder of millions. An opposition to religion, often combined with an effort to make it subservient to special interests. Hitler, Stalin, Lenin, Mao, Ho Chi Min, Tito, Napolion, and Breshnev all come to mind.\n\n \n You could actually say that those people you mentioned actually went and created their own Religion with their cults of personality. \n \n Like Religion the Figure head was totally infallible and everything that was good in peoples lives was because of the Direct Intervention of the Leader/God. \n \n \nActual history shows us that a love of self, an opposition to religion, can also forbid love and concern for one's fellow man. It's my scariest thought to see atheism established in U.S. government.\n\n \n So you are actually saying that if US became an Atheist country, then everyone would stop caring for their fellow man ?\n \n I think it has been shown that there is selfish people on all sides, be it the Preacher who steal peoples money, or the deeply religious man who defrauds thousands. On the Atheist side you can have exactly the same thing. \n \n It is Capitalism(not Religion or Atheism) that makes everyone into the materialistic selfish people they are today.(but hey that is for another thread :) )", 
   {}, 
   227444, 
   null, 
   1155466800.0
  ], 
  [
   227480, 
   null, 
   "Bradamante", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n\n I'm sure it was before then that you went down that path.\n \n Anyway, your logic's like saying \"I've despised scientists since they invented t VX-Nerve gas\"", 
   {}, 
   227400, 
   null, 
   1155470940.0
  ], 
  [
   227481, 
   null, 
   "Bradamante", 
   "Gandhi was a religious man, \n\n Didn't he sell poisoned milk to school-children?", 
   {}, 
   227418, 
   null, 
   1155471000.0
  ], 
  [
   227496, 
   null, 
   "Joe@actsii", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n\n \n Hello Simone, my name is Joe and I am new here. I was just reading your above comment and I was wondering why what one religion did, turned you off of all religions? To me it is like if I got sick off of one kind of food, then saying I would never eat any kind of food again. I try to remember that there is good and bad in all religions, races, political parties, sexes, etc. I am not trying to make light of your comments, but I am trying to better understand them.", 
   {}, 
   227400, 
   null, 
   1155479820.0
  ], 
  [
   227500, 
   null, 
   "simone", 
   "Joe, the founding fathers of my nation, the United States, were careful students of history and observed a troubling recurrence in international behavior, an ongoing threat of war fueled on by religious belief. This was particularly true in Europe where it took centuries for the wars between Roman Catholics and Protestants to finally cooled down and, hopefully, these religious wars are at the same point of tamping down in Ireland and Northern Ireland. I haven't even touched on the persecution of Jews by Christians, not to mention those who followed pagan religions by the evils of the Inquisition.\n \n Unfortunately, there has been a resurgence of the eternal European religious wars in former Yugoslavia between and amongst Roman Catholics, Orthodox Catholics and Muslims.\n \n The founding fathers, however, full of hope for the nation they were creating, firmly decreed that there would be a separation of church and state in order to prevent the possibility of state-sponsored religious wars erupting within this nation. Unfortunately, George Walker Bush, \"Jesus is my favorite philosopher,\" and his band of thugs have attacked the wall of separation between church and state and seek to impose their version of onerous religiousity upon the rest of us.\n \n These religious thugs have also embarked upon what they have famously termed a \"crusade\" in the Middle East to impose democracy, or what these thugs deem to be \"democracy\" upon all nations in the Middle East. It is to be noted, however, that when these nations actually practice democracy and have free elections, the so-called \"democracy\" Neo-Con thugs of the U.S. get ticked off and plot invasions. Look at the rapid reshuffling of the leadership of Iraq, for example. Bush and his thugs didn't like the people that the citizens of Iraq elected and reshuffled Iraq's rulership several times. Palestine is under attack for electing Hamas people. Lebanon is under attack for electing Hezbollah people. \n \n You know, if you're going to yell and stomp around about promoting democracy, you'd better be ready to accept the whole damned ball of wax or whatever that democracy will bring about. Otherwise, you're a bunch of damned liars.", 
   {}, 
   227496, 
   null, 
   1155488580.0
  ], 
  [
   227503, 
   null, 
   "jitobear", 
   "I have little use for religion myself. As an organization is has been known to do much that is good and it has been used as justification to do other people harm. However I think that is the fault of humanity. I believe we would be doing great good or great evil regardless of whether we have religion.", 
   {}, 
   227496, 
   null, 
   1155489720.0
  ], 
  [
   227509, 
   null, 
   "thelmoose", 
   "I have little use for religion myself. As an organization is has been known to do much that is good and it has been used as justification to do other people harm. However I think that is the fault of humanity. I believe we would be doing great good or great evil regardless of whether we have religion.\n\n \n That reminds me of a quote by Steven Weinberg, the physicist and Nobel Laureate:\n \n \" Religion is an insult to human dignity. With or without it you would have good people doing good things and evil people doing evil things. But for good people to do evil things, that takes religion. \"", 
   {}, 
   227503, 
   null, 
   1155497040.0
  ], 
  [
   227517, 
   null, 
   "Joe@actsii", 
   "Joe, the founding fathers of my nation, the United States, were careful students of history and observed a troubling recurrence in international behavior, an ongoing threat of war fueled on by religious belief. This was particularly true in Europe where it took centuries for the wars between Roman Catholics and Protestants to finally cooled down and, hopefully, these religious wars are at the same point of tamping down in Ireland and Northern Ireland. I haven't even touched on the persecution of Jews by Christians, not to mention those who followed pagan religions by the evils of the Inquisition.\n \n Unfortunately, there has been a resurgence of the eternal European religious wars in former Yugoslavia between and amongst Roman Catholics, Orthodox Catholics and Muslims.\n \n The founding fathers, however, full of hope for the nation they were creating, firmly decreed that there would be a separation of church and state in order to prevent the possibility of state-sponsored religious wars erupting within this nation. Unfortunately, George Walker Bush, \"Jesus is my favorite philosopher,\" and his band of thugs have attacked the wall of separation between church and state and seek to impose their version of onerous religiousity upon the rest of us.\n \n These religious thugs have also embarked upon what they have famously termed a \"crusade\" in the Middle East to impose democracy, or what these thugs deem to be \"democracy\" upon all nations in the Middle East. It is to be noted, however, that when these nations actually practice democracy and have free elections, the so-called \"democracy\" Neo-Con thugs of the U.S. get ticked off and plot invasions. Look at the rapid reshuffling of the leadership of Iraq, for example. Bush and his thugs didn't like the people that the citizens of Iraq elected and reshuffled Iraq's rulership several times. Palestine is under attack for electing Hamas people. Lebanon is under attack for electing Hezbollah people. \n \n You know, if you're going to yell and stomp around about promoting democracy, you'd better be ready to accept the whole damned ball of wax or whatever that democracy will bring about. Otherwise, you're a bunch of damned liars.\n\n \n I am sorry if I am being a pest Simone, but I still don't understand your original comments. Why has the actions of one religion turned you off of all religions?", 
   {}, 
   227500, 
   null, 
   1155500880.0
  ], 
  [
   227529, 
   null, 
   "Ooaman", 
   "I am sorry if I am being a pest Simone, but I still don't understand your original comments. Why has the actions of one religion turned you off of all religions?\n\n \n I think what the deal is (and Simone, please tell me straight out if I'm wrong about where you're coming from) is that there have been many wars through out history where religion has been used as fuel for the fire. I'm not naive to this face but I don't get why it is true. Now I'm not 100% sure of the Islamic faith or how the religions of East Asia would feel on this, but the 2 absolute most important rules in the Jewish faith and Christian faith is...\n 1) Love the Lord your God with all your heart, soul and strength.\n 2) Love your neighbor as yourself.\n These are important to the Jewish faith because down through history, when the scribes or Rabbis or whoever opened up the Torah, those would be the first rules to be seen. Also, they are the only ones that Jesus specifically refers to.\n So a better or at least related question; why is it that religion is used as fire for preverbial flames when it comes to war?", 
   {}, 
   227517, 
   null, 
   1155502740.0
  ], 
  [
   227532, 
   null, 
   "Joe@actsii", 
   "What someone believes can have a great impact on there actions. Thats why thoughts and ideas are so important.", 
   {}, 
   227529, 
   null, 
   1155503100.0
  ], 
  [
   227535, 
   null, 
   "Ooaman", 
   "What someone believes can have a great impact on there actions. Thats why thoughts and ideas are so important.\n\n \n I agree. But it seems sometime that what is said in the Bible can easily get skewed to mean something different to 2 different people. I was talking one time with this one guy who was Muslim. I asked him how the fundementalist get their start with being terrorist and he said that what they do is open up their bible, see a passage that specifically says kill (someone chose to kill or had to kill someone else) and say, \"Hey, the Bible says to kill.\"", 
   {}, 
   227532, 
   null, 
   1155503880.0
  ], 
  [
   227538, 
   null, 
   "Joe@actsii", 
   "You are right. To often people take the parts of the Bible out of context. That is why we need to read the Bible as a whole book, and not take verses to twist into the meaning we want. To many people do this, including many Christians.", 
   {}, 
   227535, 
   null, 
   1155504840.0
  ], 
  [
   227548, 
   null, 
   "marc9000", 
   "You could actually say that those people you mentioned actually went and created their own Religion with their cults of personality. \n\n \n Like some atheist organizations are attempting to do in the U.S. today, their \"cult of personality\" is to attack religion.\n \n \nLike Religion the Figure head was totally infallible and everything that was good in peoples lives was because of the Direct Intervention of the Leader/God. \n\n \n And in today's atheist organizations, the Leader/God is science. (The American Atheists symbol is an example)\n \n \n \n \nSo you are actually saying that if US became an Atheist country, then everyone would stop caring for their fellow man ? \n\n \n No, I'm saying that if the U.S. became an atheist country, it could very well end up with leadership comparable to the leadership exercised by the gentlemen I named above.\n \n \nI think it has been shown that there is selfish people on all sides, be it the Preacher who steal peoples money, or the deeply religious man who defrauds thousands. On the Atheist side you can have exactly the same thing. \n\n \n There is a difference between selfishness and dishonesty. But I agree, there is no such thing as perfection in any ideology. \n \n \nIt is Capitalism(not Religion or Atheism) that makes everyone into the materialistic selfish people they are today.(but hey that is for another thread :) )\n\n \n Capitalism isn't perfect. But there's nothing to replace it - it's the best we can do. Communism, dictatorships, etc, cause far more despair and non production than capitalism does.", 
   {}, 
   227477, 
   null, 
   1155507660.0
  ], 
  [
   227560, 
   null, 
   "INRI", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n \n Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.\n\n \n I Cant speak for protestants but as a catholic our religion sees God almight manifesting himself as a human being and him as Jesus Christ embracing humanity and raising it up as divine, so we look upon our humanity as a call to image god, just as he imaged us in Christ, he lifts humanity up to a divine level, Christianity embraces our fellow human beings and encourages us to love and have concern for our fellow man so much so that we love and have concern for members of our human race that perhaps even you yourself would forbid, the unborn.", 
   {}, 
   227496, 
   null, 
   1155517380.0
  ], 
  [
   227582, 
   null, 
   "johnhanks", 
   "So a better or at least related question; why is it that religion is used as fire for preverbial flames when it comes to war?\n\n \n Because that's what it's for. Not exclusively, of course: religion fulfills scores of purely pragmatic functions in societies. But one of those functions is to provide unquestionable sanction for declaring another society infidel and 'Other' and therefore justify its subjugation or extermination. (Check out Numbers 31 for an example; the Crusades provide another.)\n \n Odd, isn't it, how wars waged ostensibly with purely religious motivation - such as the Crusades, or the Israelites' boasted genocide of the Midianites - just happen to result in territorial and material gain for the belligerents? Has there ever been a religiously inspired war whose instigators knew from the outset they would be left spiritually righteous but materially worse off?", 
   {}, 
   227529, 
   null, 
   1155543000.0
  ], 
  [
   227587, 
   null, 
   "Bradamante", 
   "That reminds me of a quote by Steven Weinberg, the physicist and Nobel Laureate:\n \n \" Religion is an insult to human dignity. With or without it you would have good people doing good things and evil people doing evil things. But for good people to do evil things, that takes religion. \"\n\n \n To understand 'good' and 'evil' you'd need religion", 
   {}, 
   227509, 
   null, 
   1155550020.0
  ], 
  [
   227593, 
   null, 
   "trebor", 
   "To understand 'good' and 'evil' you'd need religion\n\n \n Not true at all. All you need is a brain, and to understand elightened self interest.", 
   {}, 
   227587, 
   null, 
   1155563100.0
  ], 
  [
   227597, 
   null, 
   "simone", 
   "I think what the deal is (and Simone, please tell me straight out if I'm wrong about where you're coming from) is that there have been many wars through out history where religion has been used as fuel for the fire. I'm not naive to this face but I don't get why it is true. Now I'm not 100% sure of the Islamic faith or how the religions of East Asia would feel on this, but the 2 absolute most important rules in the Jewish faith and Christian faith is...\n 1) Love the Lord your God with all your heart, soul and strength.\n 2) Love your neighbor as yourself.\n These are important to the Jewish faith because down through history, when the scribes or Rabbis or whoever opened up the Torah, those would be the first rules to be seen. Also, they are the only ones that Jesus specifically refers to.\n So a better or at least related question; why is it that religion is used as fire for preverbial flames when it comes to war?\nYou state what is assumed to be the essence of Christianity and Judaism, the major problem is the hypocrisy, particularly of Christianity, to demand that others obey these dictims whilst most Christians merely give lip service to them.", 
   {}, 
   227529, 
   null, 
   1155568020.0
  ], 
  [
   227598, 
   null, 
   "simone", 
   "To understand 'good' and 'evil' you'd need religion\nAbolutely not! Humans have decided what is good and what is evil independently of religion. Religion has been used to enforce whatever a particular society determines to be be good or evil. Religion is a construction which has, unfortunately, largely been used for evil ends.", 
   {}, 
   227587, 
   null, 
   1155568260.0
  ], 
  [
   227599, 
   null, 
   "georged", 
   "To understand 'good' and 'evil' you'd need religion\n\n \n Nonsense. Many belief systems impose dogmatic definitions of right and wrong most often employed to justify self-serving standards.", 
   {}, 
   227587, 
   null, 
   1155568500.0
  ], 
  [
   227600, 
   null, 
   "peteratwar", 
   "Depending on your viewpoint and philosophy, the end may be good but the means foul ! Age old question of end justifying the means.\n \n For me religion has equally been a great power for good and a great power for evil.\n \n I personally believe that religion needs to be taken out of all public domains and made personal. I have no problem in such a case with churches and all the paraphanalia that goes with them as long as you personally are happy with that.\n \n Funnily enough Roman times showed the greatest religious tolerance that there has been for many a long year.\n \n It has been the intrusion of religion into political life that has been the disaster for mankind. The demand that 'your' religion is the only right one and that everyone else should acknowledge that has been a huge blot on mankind's existence.\n \n As I have said before mankind's imperfect understanding of God's will is the prism which divides such will into a variety of different lights. Which is the right light, the red, the blue, the green and so on. What puerile arguments. How sad for humanity that so much suffering has been caused over that", 
   {}, 
   227598, 
   null, 
   1155569280.0
  ], 
  [
   227604, 
   null, 
   "johnhanks", 
   "I personally believe that religion needs to be taken out of all public domains and made personal. ... It has been the intrusion of religion into political life that has been the disaster for mankind.\n\n \n With respect, I don't think this statement makes any sense, certainly not in an anthropological or a historical context. In its earliest manifestations religion was inseparable from what then passed for politics: rulers were identified as gods, or as people chosen by god, or having a special and favoured relationship with god; priests were consulted for auguries when strategic decisions were needed. It's only in relatively recent times, and in the West, that your first proposal above could even be contemplated: in most societies throughout history it would have seemed bizarre, even oxymoronic.", 
   {}, 
   227600, 
   null, 
   1155572580.0
  ], 
  [
   227606, 
   null, 
   "peteratwar", 
   "What you say is perfectly true but doesn't change what I have stated. You want to list the wars/invasions which have used religion as a cover/reason ?\n \n It would be nice to think the human race was growing up a bit as hinted at in the later part of your response. However I think we have a long way to go yet.\n \n I have no problem with one's belief being a personal affair and I have no problem with my neighbours down the road having a different belief from me. In their pure form there is not a whole lot of difference between them, i.e. what the great ones from each is teaching.", 
   {}, 
   227604, 
   null, 
   1155573000.0
  ], 
  [
   227607, 
   null, 
   "johnhanks", 
   "You want to list the wars/invasions which have used religion as a cover/reason ?\n\n \n Indeed I do not. In fact, in post #26 I wondered if someone could do the opposite and cite an ostensibly religious casus belli that was not in fact a pretext for material gain. Islamic jihadis might come to mind, but they are not representative of a state or society, and it can be argued that their grudges against the West go deeper than the purely theological; and the states quietly sponsoring them certainly have territorial and material gain at stake.", 
   {}, 
   227606, 
   null, 
   1155573840.0
  ], 
  [
   227739, 
   null, 
   "Bradamante", 
   "Nonsense. Many belief systems impose dogmatic definitions of right and wrong most often employed to justify self-serving standards.\n\n \n So you're saying what's 'good' for some is simply whatever serves them? SOunds like the homosexual lobby!", 
   {}, 
   227599, 
   null, 
   1155636060.0
  ], 
  [
   227746, 
   null, 
   "georged", 
   "So you're saying what's 'good' for some is simply whatever serves them? SOunds like the homosexual lobby!\n\n \n What does that have to do with the subject?", 
   {}, 
   227739, 
   null, 
   1155654300.0
  ], 
  [
   227763, 
   null, 
   "JimStPete", 
   "So you're saying what's 'good' for some is simply whatever serves them? SOunds like the homosexual lobby!\n\n \n Or the Republican Party! Greed - oh it's ok as long as WE (the rich) benefit, bearing false witness - sorry, science doesn't fit our mission, so we'll make stuff up and ignore facts and use superstition instead since nobody can prove or disprove it, coveting your neighbors everything....perfectly fine, nothing wrong with that. And of course hating anyone that doesn't have the same superstitions as you....hate is as American as apple pie!\n \n All of this coming from people that want the Ten Suggestions on all public buildings. None of 'those rules' apply to them...only the little people.", 
   {}, 
   227739, 
   null, 
   1155666300.0
  ], 
  [
   227766, 
   null, 
   "jim's trucking", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n \n Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.\nWhile it may be true that religion is the single largest source of divisiveness on earth, it does not follow that ridding the world of all religion would put a stop to the random violence, hatred and murder that takes place daily.\n \n You are putting all religious peoples in the same bag with the radical Islamo-fascist pigs who think we should all convert or die.\n \n There are good Muslims. There are bad Muslims. Why don't you just hate the bad Muslims and leave the rest of us alone?\n \n \nYou state what is assumed to be the essence of Christianity and Judaism, the major problem is the hypocrisy, particularly of Christianity, to demand that others obey these dictims whilst most Christians merely give lip service to them.\nYou should be aware that there are many Christians who do not share the views of the vocal hypocrits...and I am not aware of any Christians who DEMAND that others obey. It's the radical Islamo-fascist pig Muslims that do that.\n \n Not all Muslims! Just the radical Islamo-fascist pigs.\n \n Christians do not say \"Convert or die (by my hand)\"\n They say \"Convert or you will not (by the hand of God) enjoy everlasting life.\"\n \n Radical Islamo-fascist pig Muslims say \"Convert or die (BY MY HAND...today)!\"\n \n I can deal with the Christain threat as most people should be able to do. Just brand them as nuts and go your merry way.\n \n I cannot deal with the radical Islamo-fascist pig Muslim threat as it is impossible to turn my back as they slay their way through the multitude of \"infidels\" left on the earth. You leave them to their ways and they will eventually get to your doorstep...holding a big sword...in the name of Allah.\n \n Kill emoticon_xkill all radical Islamo-fascist Muslims and ALL OF THEIR CHILDREN!!!\n \nAbolutely not! Humans have decided what is good and what is evil independently of religion. Religion has been used to enforce whatever a particular society determines to be be good or evil. Religion is a construction which has, unfortunately, largely been used for evil ends.\nNot quite sure what you're saying here. Religion drives a lot of governments. In Poland, it would be hard to elect a non-Catholic because Poland is 98% Catholic. There are other countries whose populations are almost 100% of a certain religion.\n \n It will be difficult to convince me that a group's beliefs regarding good and evil are independent of religion. The fact that Atheists know the difference between good and evil is the only argument you have and it won't hold water.", 
   {}, 
   227763, 
   null, 
   1155669000.0
  ], 
  [
   227768, 
   null, 
   "jim's trucking", 
   "So you're saying what's 'good' for some is simply whatever serves them? SOunds like the homosexual lobby!\n\n \n \nWhat does that have to do with the subject?\n\n \n About as much as some of my statements in other threads have to do with Fascism.....NOTHING!!", 
   {}, 
   227766, 
   null, 
   1155669420.0
  ], 
  [
   227770, 
   null, 
   "simone", 
   "Jim's, I will concede that MOST Christians have reached a relatively civilized state. There are a few backsliders, however, who want to slide back to Neolithic times. I won't name any names.\n \n And, I wonder if Muslims might not have progressed in a normal manner to a more enlightened state of mind if their lands and sovereignty were not under constant assault by Christian Europe who wanted their oil.\n \n It certainly wasn't very civilized of Winston Churchill and Dwight D. Eisenhower to jump into Iran and pull a coup that deposed the democratically elected Mohammed Mossadegh in 1953 and to put into place the Shah, who was an incredibly weak man and the tool of the CIA. Winnie had a hissyfit because Mossadegh had the audacity to declare that the oil under Iran's soil beloned to Iran, not to British Petroleum.\n \n Time after time after time, European and American Christians have pulled this very same type of crapola on those in the Middle East. We must never forget that horrible, murderous thug Saddam Hussein was installed as supreme rule of Iraq by the U.S. and Britain.\n \n That certainly wasn't very Christian, oh, the bleeding hypsocrisy of Christians. \n \n Oh, and what is going on in Lebanon appears to be the thuggish machinations of oil goon Dick Cheney.", 
   {}, 
   227768, 
   null, 
   1155670380.0
  ], 
  [
   227780, 
   null, 
   "jim's trucking", 
   "Jim's, I will concede that MOST Christians have reached a relatively civilized state. There are a few backsliders, however, who want to slide back to Neolithic times. I won't name any names.\n \n And, I wonder if Muslims might not have progressed in a normal manner to a more enlightened state of mind if their lands and sovereignty were not under constant assault by Christian Europe who wanted their oil.\n \n It certainly wasn't very civilized of Winston Churchill and Dwight D. Eisenhower to jump into Iran and pull a coup that deposed the democratically elected Mohammed Mossadegh in 1953 and to put into place the Shah, who was an incredibly weak man and the tool of the CIA. Winnie had a hissyfit because Mossadegh had the audacity to declare that the oil under Iran's soil beloned to Iran, not to British Petroleum.\n \n Time after time after time, European and American Christians have pulled this very same type of crapola on those in the Middle East. We must never forget that horrible, murderous thug Saddam Hussein was installed as supreme rule of Iraq by the U.S. and Britain.\n \n That certainly wasn't very Christian, oh, the bleeding hypsocrisy of Christians. \n \n Oh, and what is going on in Lebanon appears to be the thuggish machinations of oil goon Dick Cheney.\nThis dog won't hunt either. The radical Muslims have been pushed back several times by the Christain Catholics even before the world saw oil coming from anything besides whales and olives. The early Crusades happened before the discovery of crude oil beneath the soil and certainly before discovery of vast deposits under the ME.\n \n The Muslims started all this :xcensored hundreds of years ago. They will not quit 'til we kill them back enough that the next great push waits on those who are now infant to grow large enough to hold a sword. Then we'll have to wipe their asses out again.\n \n As I said before, it's like a good old fashioned rat killin'. You never get them all, but the problem seems to go away for a while.\n \n As I said before, it's like scraping rust off a steel ship. You never get it all and you will have to do it again, but the ship looks good for a long time between sandblastings.\n \n As I said before:\n \n Kill emoticon_xkill all radical Islamo-facist Muslim pigs and ALL OF THEIR CHILDREN!!!", 
   {}, 
   227770, 
   null, 
   1155674640.0
  ], 
  [
   227782, 
   null, 
   "epaphras_faith", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n \n Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.\n\n \n What if you are wrong and God actually does require love of those that follow him?", 
   {}, 
   227400, 
   null, 
   1155676320.0
  ], 
  [
   227791, 
   null, 
   "Master_Shake", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n \n Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.\n\n Wow, thanks for this new thought from you simone. emoticon_rolleyes", 
   {}, 
   227400, 
   null, 
   1155678300.0
  ], 
  [
   227882, 
   null, 
   "simone", 
   "So you're saying what's 'good' for some is simply whatever serves them? SOunds like the homosexual lobby!\nHomosexual lobby? Isn't that another rightwing buzzword?", 
   {}, 
   227739, 
   null, 
   1155750180.0
  ], 
  [
   227913, 
   null, 
   "epaphras_faith", 
   "Homosexual lobby? Isn't that another rightwing buzzword?\n\n \n \n \"rightwing buzzword\", isn't that another \"left wing buzzword\"\n \n emoticon_rolleyes", 
   {}, 
   227882, 
   null, 
   1155760980.0
  ], 
  [
   228202, 
   null, 
   "Bradamante", 
   "\"rightwing buzzword\", isn't that another \"left wing buzzword\"\n \n \n\n ROFL emoticon_xhoho Kudos epaphras_faith", 
   {}, 
   227913, 
   null, 
   1156072320.0
  ], 
  [
   228203, 
   null, 
   "Bradamante", 
   "What does that have to do with the subject?\n\n Well, you'd said...\n \n\n Nonsense. Many belief systems impose dogmatic definitions of right and wrong most often employed to justify self-serving standards.\n\n \n \nSo you're saying what's 'good' for some is simply whatever serves them? SOunds like the homosexual lobby!\n\n \n You're saying that what's 'right' and 'wrong' is simply defined by whatever serves the people making the definitions.\n \n Don't you know the implications of what you said? jim's trucking obviously doesn't", 
   {}, 
   227746, 
   null, 
   1156072440.0
  ], 
  [
   228434, 
   null, 
   "Adept", 
   "You're saying that what's 'right' and 'wrong' is simply defined by whatever serves the people making the definitions.\n\n \n Pretty much, yes.\n \n \nDon't you know the implications of what you said?\n\n \n The implications I can see are:\n \n Definitions of right and wrong will vary from culture to culture, and also vary through time.\n \n Laws based on definitions of right and wrong will become outdated, and won't be applicable to everyone.", 
   {}, 
   228203, 
   null, 
   1156264920.0
  ], 
  [
   228453, 
   null, 
   "paul.boys", 
   "You state what is assumed to be the essence of Christianity and Judaism, the major problem is the hypocrisy, particularly of Christianity, to demand that others obey these dictims whilst most Christians merely give lip service to them.\n\n \n \n Thanks for this comment about Christian hypocrisy, Simone. I often wonder what it would be like on earth to have a church that lives the selfless life of Jesus.\n \n However, I would ask you to critically evaluate your statement, \"it would be my happiest wish to see all religions destroyed,\" and restate it as a response to the thoughts below. My greatest concern is that the above quote bears similarity to the religious denunciations of the past which have been used to justify the killing of our fellow humans.\n \n Your diagnosis of hypocrisy is valid not only of Christians but also of many secular humanists. Many secular humanists vow to be in an open minded search for the truth; in reality this is a thick curtain hiding a struggle for power (ie: \"If I prove the truth of some theory x, I will have increased authority in all realms relating to theory x. Therefore I will do my most convincing job of proving theory x.\"). Secularists who have been possessed by their own greed or loyalty to a nation may forcefullly promote a \"truth position\" in the face of strong opposing evidence (eg: the theologian Adolph von Harnack who used not religious ideals but secular ideals to show God's approval of his country's aggression in WWI). \n \n I need to mention the name Mao Tse-Tung when considering violence. Mao brutally killed millions in his zeal to establish the truth of Marxism (a set of Christian principals which Karl Marx 'removed from religion') in China. To say that he did this without the help of religion might be too simplistic. For Mao and his leadership, Marxism brewed within them a power that could easily be dubbed religious. However, Mao did commit these atrocities outside the realm of religion as it is traditionallly cenceptualized; even outisde the realm of God-related beliefs in general.\n \n Perhaps zeal for power is the common denominator that underlies many 'religious acts' of violence. A violent power struggle ensues when my desire (or my group's desire--nation, church, school) for power becomes the controlling motive. Two of the weapons at my disposal in this power struggle are language and force. Language is used to sanctify myself (or my group) and demonize the other (those outside myself or my group with whom the struggle ensues). The other is villified and painted as evil while I am proclaimed as being in the right. Once language is accepted that paints a stark contrast between the other's evilness and my own right-ness, it becomes a moral imperative to remove the evil with any force necessary. Case in point would be the US government's torture of detainees based on the idea that the president needs \"nearly unfettered power to deal with terrorists\" (http://www.washingtonpost.com/wp-dyn/content/article/2005/11/06/AR2005110601281.html). \"Terrorist\" is a label that has been used to brand a vast smattering of Arabs as evil and justify our violence upon them.\n \n A second case in point would be the radical Islamists who have used language such as \"infidel\" to paint Americans and Isralis as purely evil. Convinced of our wickedness, they have begun the process of destroying the evil (9/11).\n \n You said that, \"I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\" In this statement I detect a voice that is painting all religion (your other) as evil. Might this sentiment not be the first step in a series of satements used to justify violence upon religious fundamentalists? Would not this contradict your high view of love for all humanity. With this in mind, I wonder how you may or may not rephrase your statement?", 
   {
    "post_info": {
     "post_title": "Violence against the evil other..."
    }
   }, 
   227597, 
   null, 
   1156273200.0
  ], 
  [
   228566, 
   null, 
   "simone", 
   "I respect the right of religious fundamentalists to be religious fundamentalists and to believe whatever it is that religious fundamentalists believe in, as long as it doesn't harm them or others. That's what the separation of church and state is all about. Religion imposed upon no one. Interference with one's religious beliefs not allowed.\n \n I am an atheist, I feel no need to be violent, save in self-defense or in defense of others.", 
   {}, 
   228453, 
   null, 
   1156349820.0
  ], 
  [
   228667, 
   null, 
   "Bradamante", 
   "I respect the right of religious fundamentalists to be religious fundamentalists and to believe whatever it is that religious fundamentalists believe in, as long as it doesn't harm them or others. \n\n \n Depends what you mean by 'harm'. A popularist atheist and evolutionist Richard Dawkins believes religious instruction, of itself, is harmful.\n \n \n\n That's what the separation of church and state is all about. Religion imposed upon no one. Interference with one's religious beliefs not allowed.\n\n No, it's so no ONE religious view is imposed on anyone\n \n\n I am an atheist, I feel no need to be violent, save in self-defense or in defense of others.\n\n \n I'm a Christian. I feel no need to be violent. I am commanded by God to be peaceful. That you're not violent, admittedly on a whim, is nothing to crow about.", 
   {}, 
   228566, 
   null, 
   1156395360.0
  ], 
  [
   228668, 
   null, 
   "Bradamante", 
   "Pretty much, yes.\n \n \n \n The implications I can see are:\n \n Definitions of right and wrong will vary from culture to culture, and also vary through time.\n \n Laws based on definitions of right and wrong will become outdated, and won't be applicable to everyone.\n\n \n So potentially cold-blooded murder could become right?", 
   {}, 
   228434, 
   null, 
   1156395540.0
  ], 
  [
   228678, 
   null, 
   "paul.boys", 
   "I am an atheist, I feel no need to be violent, save in self-defense or in defense of others.\n\n \n Thank you for your clear and level headed response, Simone. I'll grant you that religion has promoted violence time and time again. I am very interested to learn from you about religionlesss causes of violence. Particularly the role of symantics in justifying violence.\n \n I have a long hypothetical situation detailing motives for violence and I have two follow up questions. For everyone's sake I will pose the questions here and send the situation to you via private messaging.\n \n QUESTION 1) Would you consider using violence for reasons outside of self-defense or defense of others (ie: anger, vengeance, vigilante justice, etc.)?\n \n QUESTION 2) How would you respond to people villifying you and wishing to destroy you or literature near and dear to you (maybe some poems you have written)?", 
   {
    "post_info": {
     "post_title": "Religionless Violence."
    }
   }, 
   228566, 
   null, 
   1156401900.0
  ], 
  [
   228685, 
   null, 
   "johnhanks", 
   "[QUOTE=paul.boys;228678]\nQUESTION 2) How would you respond to people villifying you and wishing to destroy you or literature near and dear to you (maybe some poems you have written)?\n\n \n This is blatant conflation. You appear to be asking for a single answer to three completely different questions. [*]People vilifying you[*]people wishing to destroy you[*]people wishing to destroy literature near and dear to youare wholly different situations. I would seriously doubt the judgement and reasoning ability of someone who responded in the same way to all three.", 
   {}, 
   228678, 
   null, 
   1156404240.0
  ], 
  [
   228694, 
   null, 
   "paul.boys", 
   "[QUOTE=johnhanks;228685]\n\n \n This is blatant conflation. You appear to be asking for a single answer to three completely different questions. [*]People vilifying you[*]people wishing to destroy you[*]people wishing to destroy literature near and dear to youare wholly different situations. I would seriously doubt the judgement and reasoning ability of someone who responded in the same way to all three.\n\n \n Hello, johnhanks. The questions are admitedly broad. I am asking for a rich answer to a universal problem (violence). Perhaps you might like to choose one and reply to it. Again, my interest is in the connection between symantics and physical violence (hence the inclusion of vilifying and destruction in the question).", 
   {}, 
   228685, 
   null, 
   1156406580.0
  ], 
  [
   228696, 
   null, 
   "johnhanks", 
   "[QUOTE=paul.boys;228694]\n\n \n The questions are admitedly broad. I am asking for a rich answer to a universal problem (violence). Perhaps you might like to choose one and reply to it. Again, my interest is in the connection between symantics and physical violence (hence the inclusion of vilifying and destruction in the question).\n\n \n People vilifying you? Ignore it unless the vilification amounts to incitement to violence against you. In that case, have recourse to the law.\n \n People wishing to destroy you? It depends whether the wish is translated into action. If so, take whatever steps are necessary to defend yourself (cf. your question 1). If not, live with it.\n \n People wishing to destroy literature near and dear to you? Too vague a question. You suggest 'maybe some poems you have written'. If the poems are published, and someone finds them so awful they burn a copy in disgust, live with it. If you mean they break into my house to destroy the manuscript, once again I have recourse to the law.", 
   {}, 
   228694, 
   null, 
   1156407420.0
  ], 
  [
   228701, 
   null, 
   "Adept", 
   "So potentially cold-blooded murder could become right?\n\n \n Yes. Just like how, at different times and in different places, cannabilism, slavery, rape and murder were all 'right'.", 
   {}, 
   228668, 
   null, 
   1156419120.0
  ], 
  [
   228704, 
   null, 
   "Bradamante", 
   "Yes. Just like how, at different times and in different places, cannabilism, slavery, rape and murder were all 'right'.\n\n \n Were they?\n \n How do you then argue for or against something? You might simply be out-of-touch", 
   {}, 
   228701, 
   null, 
   1156421640.0
  ], 
  [
   228709, 
   null, 
   "trebor", 
   "Were they?\n \n How do you then argue for or against something? You might simply be out-of-touch\n\n \n \n Yes, they were. Particularly slavery. And for a large part of slavery in the U.S., the 'rights' of the master appearently included 'sexual favors' from the woman slaves.", 
   {}, 
   228704, 
   null, 
   1156426320.0
  ], 
  [
   228724, 
   null, 
   "simone", 
   ". . . . I'm a Christian. I feel no need to be violent. I am commanded by God to be peaceful. That you're not violent, admittedly on a whim, is nothing to crow about.\nThat I am nonviolent because of a bloody damned whim? What gross impertinence! What ignorance!", 
   {}, 
   228667, 
   null, 
   1156438020.0
  ], 
  [
   228733, 
   null, 
   "johnhanks", 
   "That I am nonviolent because of a bloody damned whim? What gross impertinence! What ignorance!\n\n \n All of that, but what is more remarkable is the suggestion that refraining from violence because a higher authoriy has told you to is somehow more admirable than adopting non-violence on your own volition.", 
   {}, 
   228724, 
   null, 
   1156439220.0
  ], 
  [
   228769, 
   null, 
   "paul.boys", 
   "All of that, but what is more remarkable is the suggestion that refraining from violence because a higher authoriy has told you to is somehow more admirable than adopting non-violence on your own volition.\n\n \n I like what johnhanks said. Virtue is virtue whether you possess it because your mother instilled it in you or because you have choosen it of your own volition.\n \n Johnhanks, would you say that non-violence (never using violence for any reason) is a virtue that you admire?", 
   {}, 
   228733, 
   null, 
   1156446060.0
  ], 
  [
   228771, 
   null, 
   "paul.boys", 
   "That I am nonviolent because of a bloody damned whim? What gross impertinence! What ignorance!\n\n \n Sorry for confusing my questions with so many words, Simone. Let me restate the questions of my initial post on this strand so that I can hear your answer.\n \n Is religion the more elementary cause for violence or is power? \n \n Is it possible that phrases like \"destroy all religion\" eventually exist in a critical mass of memeplexes (Dawkins speculation on societal means for passing on information) within a societal group such that this statement acts like a societal word-action (where saying the phrase becomes consistent with acting out the phrase)? Why or why not?", 
   {}, 
   228724, 
   null, 
   1156446840.0
  ], 
  [
   228810, 
   null, 
   "paul.boys", 
   "[QUOTE=johnhanks;228696]\n\n \n People vilifying you? Ignore it unless the vilification amounts to incitement to violence against you. In that case, have recourse to the law.\n \n People wishing to destroy you? It depends whether the wish is translated into action. If so, take whatever steps are necessary to defend yourself (cf. your question 1). If not, live with it.\n \n People wishing to destroy literature near and dear to you? Too vague a question. You suggest 'maybe some poems you have written'. If the poems are published, and someone finds them so awful they burn a copy in disgust, live with it. If you mean they break into my house to destroy the manuscript, once again I have recourse to the law.\n\n \n johnhanks, allow me to elicit a nuance in your answers through a hypothetical situation. what if you did not have recourse to the law (a situation common in the world's population outside the US today)? after a person incited violence against you through vilification, would you respond in kind?", 
   {}, 
   228696, 
   null, 
   1156455660.0
  ], 
  [
   228854, 
   null, 
   "Adept", 
   "Were they?\n \n How do you then argue for or against something? You might simply be out-of-touch\n\n \n Usually with a utilitarian slant. What is best for the most people, and so on.\n \n Often, with a personal slant. I favour that which is best for me.", 
   {}, 
   228704, 
   null, 
   1156475820.0
  ], 
  [
   228864, 
   null, 
   "Bradamante", 
   "Usually with a utilitarian slant. What is best for the most people, and so on.\n \n Often, with a personal slant. I favour that which is best for me.\n\n \n Potential for conflict", 
   {}, 
   228854, 
   null, 
   1156482600.0
  ], 
  [
   228876, 
   null, 
   "Adept", 
   "Potential for conflict\n\n \n I always consider myself more important than the unwashed masses, so there is rarely an internal conflict. \n \n There always exists the potential for external conflict as people disagree.", 
   {}, 
   228864, 
   null, 
   1156488060.0
  ], 
  [
   228883, 
   null, 
   "johnhanks", 
   "\n johnhanks, allow me to elicit a nuance in your answers through a hypothetical situation. what if you did not have recourse to the law (a situation common in the world's population outside the US today)?\n\n \n I'm sorry? You really believe most of 95.4% of the world population who aren't American have no recourse to law?\n \n \nafter a person incited violence against you through vilification, would you respond in kind?\n\n \n You are transparently contorting your hypotheticals so as to elicit a pre-planned response in the cause of some further agenda. Why not just put your cards on the table?", 
   {}, 
   228810, 
   null, 
   1156493340.0
  ], 
  [
   228892, 
   null, 
   "trebor", 
   "Potential for conflict\n\n \n How is he doing anything different than the average Christian? Except, of course,, he is taking responsiblity for his own actions, and Christians defere that to god.", 
   {}, 
   228864, 
   null, 
   1156513200.0
  ], 
  [
   228894, 
   null, 
   "Bradamante", 
   "How is he doing anything different than the average Christian?\n\n I don't know. How?\n \n Except, of course,, he is taking responsiblity for his own actions, and Christians defere that to god.\n\n \n Are you saying that when a Christian chooses to obey God they're not taking an active part in that choice?", 
   {}, 
   228892, 
   null, 
   1156514280.0
  ], 
  [
   228898, 
   null, 
   "georged", 
   "\n \n Are you saying that when a Christian chooses to obey God they're not taking an active part in that choice?\n\n \n You certainly answer your own questions but given the context of your answer I doubt that you're aware of it.", 
   {}, 
   228894, 
   null, 
   1156519860.0
  ], 
  [
   228914, 
   null, 
   "simone", 
   "Damned whim?\n Not so, I say,\n A world of thought in play,\n My wealth of books in wild array \n Naysay.", 
   {}, 
   228898, 
   null, 
   1156526580.0
  ], 
  [
   228921, 
   null, 
   "trebor", 
   "I don't know. How?\n \n \n Are you saying that when a Christian chooses to obey God they're not taking an active part in that choice?\n\n \n \n I am saying they are actively avoiding responsiblity for their own action. They proclaim \"their sins are forgiven\" because they believe that a human sacrifice washed away their sins in blood.", 
   {}, 
   228894, 
   null, 
   1156528320.0
  ], 
  [
   228981, 
   null, 
   "epaphras_faith", 
   "That I am nonviolent because of a bloody damned whim? What gross impertinence! What ignorance!\n\n \n If not your \"whim\" then what then. Since you as an atheist are the final arbiter of right and wrong then by definition you choose to be non-violent at your whim. Likewise I would doubt it to be ture given your vehemence to the statement and complete lack of objectivity to the statement.\n \n EF", 
   {}, 
   228724, 
   null, 
   1156549860.0
  ], 
  [
   228994, 
   null, 
   "Bradamante", 
   "You certainly answer your own questions but given the context of your answer I doubt that you're aware of it.\n\n \n Then it's not a choice, not in any real sense (if I'm not aware of it). It's a kind of choice like a program makes", 
   {}, 
   228898, 
   null, 
   1156556220.0
  ], 
  [
   228995, 
   null, 
   "georged", 
   "Then it's not a choice, not in any real sense (if I'm not aware of it). It's a kind of choice like a program makes\n\n \n That's the way I read it. Most belief systems are programs with reaction parameters subject to peer approval based on faith.", 
   {}, 
   228994, 
   null, 
   1156558320.0
  ], 
  [
   229001, 
   null, 
   "paul.boys", 
   "I'm sorry? You really believe most of 95.4% of the world population who aren't American have no recourse to law?\n \n \n \n You are transparently contorting your hypotheticals so as to elicit a pre-planned response in the cause of some further agenda. Why not just put your cards on the table?\n\n \n \n \n johnhanks, i'm sorry, i wrote incorrectly. i should have written, \"Inadequate recourse to the law is more common outside the US than within.\" Thank you for your astute comments.\n \n i wrote the hypothetical on an assumption, perhaps an incorrect one. when i read your summary (of how you would respond to being vilified, etc) i interpreted it as a response cultivated to be consistent with your philosophy. while claiming a practice that is consistent with your philosophy is essential, especially given the nature of this forum, i am more curious about the dynamic nature of offense/reprisal and its role in perpetuating violence. the question put more to the point is, \"Would you really respond non-violently in all cases concerning vilification or theft or incitement? What if you were in a situation where you did not have due recourse to the law (ie: living among policing agencies who discriminated against you)?\"", 
   {}, 
   228883, 
   null, 
   1156564080.0
  ], 
  [
   229002, 
   null, 
   "Bradamante", 
   "That's the way I read it. Most belief systems are programs with reaction parameters subject to peer approval based on faith.\n\n \n So then must your own belief, or lack thereof", 
   {}, 
   228995, 
   null, 
   1156564500.0
  ], 
  [
   229003, 
   null, 
   "paul.boys", 
   "I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001.\n \n To love one's god so much that one thinks nothing of killing thousands of one's fellow humanity.\n \n Piety, the love of god, if you will, seems to forbid love and concern for one's fellow man and, as such, it would be my happiest wish to see all religions utterly destroyed.\n\n \n Simone, I believe their is a kernal of truth in the Foucault's idea that there is an exclusionary shadow that stubbornly trails modernity's history of inclusion. He carries his line of thought from Nietzsche (Thus Spake Zarathustra) who in his reading of the gospels makes the point that it was the \"good and just\" who murdered Jesus not the \"wicked.\" The \"good and just\" could not understand Jesus because their \"spirit was imprisoned in their good conscience\" and they crucified him because they construed as evil his rejection of their notions of good. Foucault lifts up \"the rational\" and \"the civilized\" (Madness and Civilization) in much the same light as Nietzsche's \"good and just.\" For Foucault \"civilization\" is a smooth destroyer of those things inside and outside of itself that it construes as \"immoral\" and \"barbarous.\"\n \n Think what you might about Nietzsche and Foucault, they raise a good point here that the \"moral\" and \"civilized\" self all too often relies on the exclusion of the \"barberous\" and \"immoral\" other. The \"moral\" and \"civilized\" self looks upon the \"barberous\" Muslims that suicidally killed Americans and says \"You are wrong\" from an imiplied position of \"I am right.\"\n \n As Jesus so prophetically asked in front of his audience, \"Why do you look at the speck of sawdust in your brother's eye and pay no attention to the plank in your own eye? How can you say to your brother, 'Let me take the speck out of your eye,' when all the time there is a plank in your own eye?\"\n \n Bringing these above ideas to bear upon your statements I might ask, why do you wish destruction of religion and not reformation? Such a statement on destruction bears uncanny resemblence to another statement on this forum proporting to wish to \"kill all those rats (Muslim extremists).\"\n \n As before, thank you again for pointing out the hypocrisy and violence within religion. The subject cannot be given enough attention.", 
   {
    "post_info": {
     "post_title": "Blinded by religion's glarring imperfection..."
    }
   }, 
   227400, 
   null, 
   1156566300.0
  ], 
  [
   229020, 
   null, 
   "johnhanks", 
   "If not your \"whim\" then what then. Since you as an atheist are the final arbiter of right and wrong then by definition you choose to be non-violent at your whim.\n\n \n This is not just a non sequitur, it's a gross abuse of the phrase 'by definition'. Even if we were to accept the proposal that every individual is her/his own arbiter of right and wrong (i.e. that social consensus counts for nothing), to claim that the outcome is therefore a 'whim' is mere mud-slinging.\n \n You have, in effect, resuscitated the tired old false dichotomy 'either morality comes from god, or there is none'. We've been over this ground several times, I think.", 
   {}, 
   228981, 
   null, 
   1156582080.0
  ], 
  [
   229021, 
   null, 
   "johnhanks", 
   "the question put more to the point is, \"Would you really respond non-violently in all cases concerning vilification or theft or incitement? What if you were in a situation where you did not have due recourse to the law (ie: living among policing agencies who discriminated against you)?\"\n\n \n The bracketed section above suggests that your hidden agenda is getting closer to the surface - the 'i.e.' is especially suggestive, since not having recourse to law is by no means necessarily the same as 'living among policing agencies who discriminate against you'. I conclude that you have some particular beef about a situation of the latter kind: why not just be up-front about it? (I suppose it is possible you meant 'e.g.' and not 'i.e.', but for the moment I will respond to your post as written.)", 
   {}, 
   229001, 
   null, 
   1156582740.0
  ], 
  [
   229023, 
   null, 
   "Adept", 
   "why not just be up-front about it?\n\n \n Why not be up-front, and just answer the question? For the sake of brevity, if nothing else.", 
   {}, 
   229021, 
   null, 
   1156586340.0
  ], 
  [
   229027, 
   null, 
   "Bradamante", 
   "This is not just a non sequitur, it's a gross abuse of the phrase 'by definition'. Even if we were to accept the proposal that every individual is her/his own arbiter of right and wrong (i.e. that social consensus counts for nothing), to claim that the outcome is therefore a 'whim' is mere mud-slinging.\n\n Perhaps its just your memes!", 
   {}, 
   229020, 
   null, 
   1156593180.0
  ], 
  [
   229036, 
   null, 
   "paul.boys", 
   "The bracketed section above suggests that your hidden agenda is getting closer to the surface - the 'i.e.' is especially suggestive, since not having recourse to law is by no means necessarily the same as 'living among policing agencies who discriminate against you'. I conclude that you have some particular beef about a situation of the latter kind: why not just be up-front about it? (I suppose it is possible you meant 'e.g.' and not 'i.e.', but for the moment I will respond to your post as written.)\n\n \n johnhanks, my hidden agenda is this statement: \"Violence is ugly.\" my open question to you has been, \"is non-violence a virtue that you admire?\"", 
   {}, 
   229021, 
   null, 
   1156600920.0
  ], 
  [
   229037, 
   null, 
   "johnhanks", 
   "Why not be up-front, and just answer the question? For the sake of brevity, if nothing else.\n\n \n Because I'm suspicious of loaded questions. If the prolixity bothers you, stop reading.", 
   {}, 
   229023, 
   null, 
   1156601100.0
  ], 
  [
   229038, 
   null, 
   "johnhanks", 
   "johnhanks, my hidden agenda is this statement: \"Violence is ugly.\" my open question to you has been, \"is non-violence a virtue that you admire?\"\n\n \n In which case my answer is 'Not unconditionally'.", 
   {}, 
   229036, 
   null, 
   1156601220.0
  ], 
  [
   229048, 
   null, 
   "simone", 
   "If not your \"whim\" then what then. Since you as an atheist are the final arbiter of right and wrong then by definition you choose to be non-violent at your whim. Likewise I would doubt it to be ture given your vehemence to the statement and complete lack of objectivity to the statement.\n \n EF\nI am not the final arbiter of right and wrong. I adhere to human law painfully derived from human experience through the milleniums.", 
   {}, 
   228981, 
   null, 
   1156611000.0
  ], 
  [
   229078, 
   null, 
   "paul.boys", 
   "Simone, why do you wish destruction of religion and not reformation? Such a statement on destruction bears uncanny resemblence to another statement on this forum proporting to wish to \"kill all those rats (Muslim extremists).\"\n \n As you have reiterated so many times, Bush would like to subvert all of Christianity into destroying the Muslim religion. You however, would wish to see all of non-religion subverted into destroying all religion. Perhaps you so frequently verbally punish Bush because you are projecting your own guilt of broad brushed demonizing onto him?", 
   {}, 
   229003, 
   null, 
   1156634220.0
  ], 
  [
   229107, 
   null, 
   "Bradamante", 
   "I am not the final arbiter of right and wrong. I adhere to human law painfully derived from human experience through the milleniums.\n\n \n Do you mean white Anglo-Saxon, male-dominated experience*? Or something else?\n \n \n *-a dominant force in the West", 
   {}, 
   229048, 
   null, 
   1156653600.0
  ], 
  [
   229148, 
   null, 
   "simone", 
   "Do you mean white Anglo-Saxon, male-dominated experience*? Or something else?\n \n *-a dominant force in the West\nRoman law existed before the Anglo-Saxon model. Greek ideas about governance existed before Roman law and has some influence upon the construct of Roman society. Nevertheless, Babylonian law and Egyptian law existed well before Greece rose to prominence and their influence has never died. The wandering Jews had a minor role in world law until the codification of their precepts as Christianization largely overtook Europe.\n \n One must also note that the first primitive form of a democratic parliament was created by the Norse, a governing body known as the \"Thing\" in which disputes were resolved and conduct was negotiated. The cultural laws of the Norse treated women as equals and as sexual free agents fully equal to men. There was no such thing as an \"illegitimate\" child within Norse society prior to its forced conversion to Christianity.\n \n The questionable \"ideals\" of the Anglo-Saxon male are rather Johnny-come-latelies in my eyes.", 
   {}, 
   229107, 
   null, 
   1156699920.0
  ], 
  [
   229149, 
   null, 
   "simone", 
   "Simone, why do you wish destruction of religion and not reformation? Such a statement on destruction bears uncanny resemblence to another statement on this forum proporting to wish to \"kill all those rats (Muslim extremists).\"\n \n As you have reiterated so many times, Bush would like to subvert all of Christianity into destroying the Muslim religion. You however, would wish to see all of non-religion subverted into destroying all religion. Perhaps you so frequently verbally punish Bush because you are projecting your own guilt of broad brushed demonizing onto him?\nSuch ignorance! I have no desire to bloody my hands with the deaths of religionists! How utterly repugnant!\n \n My view is similar to that of Christians in re homosexuality, forgive the sinner his or her sins and try to get him or her to reform. I am getting rather tired of being painted as such a murderous extremist, especially since my major problem with religionists is their murderous extremism. Catholics murdering Protestants, Christians murdering Jews, Muslims murdering Christians and Christians murdering Muslims.\n \n Too damned much blood spilled in the nonsensical name of God!", 
   {}, 
   229078, 
   null, 
   1156700160.0
  ], 
  [
   229150, 
   null, 
   "simone", 
   "Simone, I believe their is a kernal of truth in the Foucault's idea that there is an exclusionary shadow that stubbornly trails modernity's history of inclusion. He carries his line of thought from Nietzsche (Thus Spake Zarathustra) who in his reading of the gospels makes the point that it was the \"good and just\" who murdered Jesus not the \"wicked.\" The \"good and just\" could not understand Jesus because their \"spirit was imprisoned in their good conscience\" and they crucified him because they construed as evil his rejection of their notions of good. Foucault lifts up \"the rational\" and \"the civilized\" (Madness and Civilization) in much the same light as Nietzsche's \"good and just.\" For Foucault \"civilization\" is a smooth destroyer of those things inside and outside of itself that it construes as \"immoral\" and \"barbarous.\"\n \n Think what you might about Nietzsche and Foucault, they raise a good point here that the \"moral\" and \"civilized\" self all too often relies on the exclusion of the \"barberous\" and \"immoral\" other. The \"moral\" and \"civilized\" self looks upon the \"barberous\" Muslims that suicidally killed Americans and says \"You are wrong\" from an imiplied position of \"I am right.\" . . .\nI am currently wrestling with Rousseau, which is far distant from Foucault and Nietsche, when I get to the 20th century of ideas, I might have a look.\n \n As for the \"barbarous\" Muslims, I swoon because they gave us barbaric Europeans the Arabic numbering system, algebra, many concepts in geometry, they saved the learning of the Greeks from the book burning Christians of the Dark Ages. They built marvelous cities and cultures and libraries and their buildings of that golden age are to die for! The Alhambra in Granada, Spain, gasp! In the fourteenth century before those barbarians Phillip and Isabella took control of Spain!", 
   {}, 
   229003, 
   null, 
   1156700760.0
  ], 
  [
   229167, 
   null, 
   "paul.boys", 
   "I am currently wrestling with Rousseau, which is far distant from Foucault and Nietsche, when I get to the 20th century of ideas, I might have a look.\n \n As for the \"barbarous\" Muslims, I swoon because they gave us barbaric Europeans the Arabic numbering system, algebra, many concepts in geometry, they saved the learning of the Greeks from the book burning Christians of the Dark Ages. They built marvelous cities and cultures and libraries and their buildings of that golden age are to die for! The Alhambra in Granada, Spain, gasp! In the fourteenth century before those barbarians Phillip and Isabella took control of Spain!\n\n \n Simone, it is in this enlightened way of looking at history as reaching its climax in our secular world that exclusion again raises its ugly head. It is always \"they\" that are barbarians and \"we\" who are civilized. Take note of the way the American public (media, friends, etc...) respond with such moral indignation against the 1990's killings in the Balcans and Rwanda. We construe \"those\" Slavs and \"those\" Hutus as barbarians by symantically removing them so far from civilized people (\"us\") that we in the \"civilized\" and \"secluar\" west do not have to honestly reckon with our own barbarity. It is an overly positive view of the history of the \"civilized\" and enlightened West which contorts it into moving along a straight line, ever progressing and improving.\n \n It was very refreshing to read your words, \"My view is similar to that of Christians...forgive the sinner his or her sins and try to get him or her to reform.\" Reform is a far cry from destruction.\n \n It was with a totalizing view of the Jewish people that Germany worked itself up into a genocidal frenzy. It has been in a totalizing view that the Orthodox and Muslim faithful have worked themselves into the same frenzy in Europe. Why are you commiting the same mistake, Simone? \"I wish ALL religion destroyed?\"? Why not rephrase your statement and put it in a more humble and self scrutinizing light?", 
   {}, 
   229150, 
   null, 
   1156708320.0
  ], 
  [
   229170, 
   null, 
   "georged", 
   "\n It was with a totalizing view of the Jewish people that Germany worked itself up into a genocidal frenzy. It has been in a totalizing view that the Orthodox and Muslim faithful have worked themselves into the same frenzy in Europe. Why are you commiting the same mistake, Simone? \"I wish ALL religion destroyed?\"? Why not rephrase your statement and put it in a more humble and self scrutinizing light?\n\n \n Aren't you reversing roles between Jews and Muslims? Germany's purpose in eradicating Jews was initially for financial gain using racism, then slave labor with those unable to perform disposed of with genocide. Germany's methodology never varied from Germany itself to defeated and occupied countries. Most Muslim extremists are retaliating against perceived or real oppression by the US and a long history of US supported dictatorships. The Jews didn't have the numbers to resist oppression, Muslims have the numbers. It becomes convenient to label all Muslims as extremists, which will eventually happen as the US and its bought and paid for lapdogs continue their strategy to control natural resources and monetary exchange through military aggression. Religion is just as convenient as racial purity for self-serving labeling purposes.", 
   {}, 
   229167, 
   null, 
   1156709820.0
  ], 
  [
   229172, 
   null, 
   "simone", 
   "Religion clouds men's minds and blinds them to evil because they believe that their belief system will save them.", 
   {}, 
   229167, 
   null, 
   1156709820.0
  ], 
  [
   229177, 
   null, 
   "paul.boys", 
   "Religion clouds men's minds and blinds them to evil because they believe that their belief system will save them.\n\n \n Simone, this is true of any belief system (regardless of its degree of veracity) that is held with a view toward self promotion over and above a view toward knowing the truth. The danger of saying, \"Since 9/11, I have wished all religion destroyed\" is that this statement is held with a tacit assertion that ALL religion (any group who has ever met together to worship) is worthy of destruction because all religions make people violent. Such a statement is vindictive and resembles the ideals it is attacking.\n \n This is logically equivolent to Franklin Graham's statment, \"Isalm is an evil religion\" in response to the attack of a hand full of Muslim extremists on 9/11. Franklin's statement makes no room for the possibility that many Muslims practice their religion genuinely and in a way that is beneficial for their communities. Simone, why are you allowing your thought pattern to keep company with such conservative folks? Are you a wolf in liberals clothing? Should your liberal friends beware?\n \n While I appreciate your desire to open people's minds to the evil around them, I am bothered by your stubbornness in refusing to see the evil in your own statement, \"I wish all religion destroyed.\" Why not rephrase your statment?", 
   {}, 
   229172, 
   null, 
   1156716360.0
  ], 
  [
   229197, 
   null, 
   "paul.boys", 
   "Aren't you reversing roles between Jews and Muslims? Germany's purpose in eradicating Jews was initially for financial gain using racism, then slave labor with those unable to perform disposed of with genocide. Germany's methodology never varied from Germany itself to defeated and occupied countries. Most Muslim extremists are retaliating against perceived or real oppression by the US and a long history of US supported dictatorships. The Jews didn't have the numbers to resist oppression, Muslims have the numbers. It becomes convenient to label all Muslims as extremists, which will eventually happen as the US and its bought and paid for lapdogs continue their strategy to control natural resources and monetary exchange through military aggression. Religion is just as convenient as racial purity for self-serving labeling purposes.\n\n \n Georged, there was heated theological debate during the 1930's that revolved around the \"orders of creation.\" This belief was argued in Lutheran circles and it roughly stated that the Volk (~race or people) is created by God. The nazi's harnassed this thought and made it do work for them by proclaiming the need to keep the Volk pure. Nearly all genuine theologians laughed at this Nazi rendering of the theological belief (Ludwig Muller was run out of his position as Reich's bishop for so blatantly enforcing the Aryan clause within the church). Sadly most of these theologians were unwilling to stand against the belief that \"Jews were bringing religious impurity into the country\" and the Lutheran church became a pawn in the hand of Hitler.\n \n My assertion is that in order for mass violence to be authorized by a government, certain symantical shifts need to take place. In using totalizing statements, all Jews were painted as \"other\" (\"they steal our profits,\" \"they corrupt our religion\"). The moral authority for genocide stemmed from a moral viewpoint that all Jews are in some way dangerously bad (whether it be in business or in religion or in genetics). The Nazi's would use all arguements (religious, economical, biological) at their disposal to vilify the Jews. The point I am laboring over with Simone, is that the statement, \"I wish all religion destroyed,\" is a totalizing statement like those of the Nazi's. While I by no means expect Simone to go about killing religious folk, her statement creates a moral superiority for the non-religious or the \"sensical\" people of the world. Such symantics, when embraced by enough people, have power to turn into societal actions that remove the \"other\" or destroy the \"barbarian.\"", 
   {}, 
   229170, 
   null, 
   1156724100.0
  ], 
  [
   229223, 
   null, 
   "Bradamante", 
   "Roman law existed before the Anglo-Saxon model. \n\n Do you operate under Roman law? You see, you originally said\n \n \nI am not the final arbiter of right and wrong. I adhere to human law painfully derived from human experience through the millennia (edited word by me).\n\n the 'experience' we live under is dominated by the white Anglo-Saxon, male-dominated experience, irrespective of how Egyptians ran their laws, etc.\n \nThe questionable \"ideals\" of the Anglo-Saxon male are rather Johnny-come-latelies in my eyes.\n\n They are the dominant cultural experience. So, it's irrelevant UNLESS you mean to say you study the 'experiences' of all human societies over all the millennia. Or, are you just saying you derive your own idea from studying a more limited; Roman, Greek, Egyptian, and Hebrew experience?\n \n Please clarify.", 
   {}, 
   229148, 
   null, 
   1156737780.0
  ], 
  [
   229273, 
   null, 
   "simone", 
   "I am an American. I live under a law derived from the wisdom of the ages, from the wisdom of other nations, Greek concepts passed through Roman hands and passed down to modern Europe, Babylonian legal precepts which passed into the hands of the Jews, all of which were gravely considered by my nation's founders. Legal concepts and ways of justice were even derived from the first Americans who came first into the Western Hemisphere, our founders strived to make a perfect legal system--admittedly this system still has its human flaws but its study goes on and we may yet come close to success.", 
   {}, 
   229223, 
   null, 
   1156780500.0
  ], 
  [
   229385, 
   null, 
   "paul.boys", 
   "Religion clouds men's minds and blinds them to evil because they believe that their belief system will save them.\n\n \n Simone, maybe I can paint the picture a little differently in the hopes of illuminating the tendency to totalize with semantics.\n \n \"I have despised and condemned religion, all religions, since the religious abomination of September 11, 2001...it would be my happiest wish to see all religions utterly destroyed?\" This is the statement you typed. How about I adopt a language that is similar to that statement and apply it to something that you might hold to be infallible (in a similar way that the Muslim extremists hold their belief to be infallible)?\n \n \"I have despised and condemned secular institutions, all secular institutions, since the secular abomination of January 21, 1949 (Mao's attack on Kuomintang)....it would be my happiest wish to see all secular institutions utterly destroyed.\"\n \n Secular thought is so vast in its span that it would be a lie to paint it all one color. Furthermore, the abomination of January 21, 1949 is in no ways the best representation of the heart of 'secularism.' \n \n Not to mention that the people who subscribe to 'secular' thought span in color, size, ethnicity and behavior. 'Secular' folks are sometimes violent, sometimes happy, sometimes gluttons, sometimes depressed, sometimes careless with their words. These people do not have these characteristics simply because they subscribe to 'secular' thought. They are simply humans, just like the people who reject 'secular' thought.\n \n See how belittling it is to totalize? See how dishonest it is to take a multiform and Technicolor thing, turn it into one shape and paint it one color for the purposes of being able to show how unlike you and wrong \"it\" is? It turns out that we both (the religious and the \"non-religious\") are human and use our different beliefs to act badly. It also turns out that, by times, we both engage in noble acts based on different beliefs.\n \n Claiming that non-religious folks are the only ones who have \"unclouded\" thoughts and are the only ones with the potential to discern evil resembles the claims of many in the religious community. \"Only we discern evil because only we have God's infallible perspective.\" What is important here is not writing something off as evil through broad categorization--religion, philosophy, race, etc. What is important is that we recognize the evil and name it. Killing vulnerable people simply because you can get away with it is evil...do it as a Christian, do it as an atheist, do it as a scientist, do it as a medical doctor, do it as an enemy, do it as a caucasian...it is evil regardless.\n \n Simone, do you see what I'm getting at?", 
   {}, 
   229172, 
   null, 
   1156827780.0
  ], 
  [
   229405, 
   null, 
   "Bradamante", 
   "I am an American. I live under a law derived from the wisdom of the ages, from the wisdom of other nations, Greek concepts passed through Roman hands and passed down to modern Europe, Babylonian legal precepts which passed into the hands of the Jews, all of which were gravely considered by my nation's founders. Legal concepts and ways of justice were even derived from the first Americans who came first into the Western Hemisphere, our founders strived to make a perfect legal system--admittedly this system still has its human flaws but its study goes on and we may yet come close to success.\n\n \n Are you now arguing 'what is legal' as 'what is right'?\n \n Are you saying that the American system is the best?\n \n In your legal system; what legal precepts come from native Americans? Can you cite any major case that was drawn upon traditional Inidan legal opinion. Which Babylonian cases do your judges cite? Which Jewish ones? Are there any Greek or Roman cases that are cited? Please provide specific examples.\n \n I note that in your little spiel about how your nation has derived its laws you leave out Christianity. Obviously there was no (positive) influence there; perhaps 2,000 years of darkness??? ;)", 
   {}, 
   229273, 
   null, 
   1156847760.0
  ], 
  [
   229416, 
   null, 
   "jim's trucking", 
   "Religion clouds men's minds and blinds them to evil because they believe that their belief system will save them.\nYou bring out the antidisestablishmentarianist in me.emoticon_xgood", 
   {}, 
   229172, 
   null, 
   1156866600.0
  ], 
  [
   229426, 
   null, 
   "simone", 
   "Are you now arguing 'what is legal' as 'what is right'?\n \n Are you saying that the American system is the best?\n \n In your legal system; what legal precepts come from native Americans? Can you cite any major case that was drawn upon traditional Inidan legal opinion. Which Babylonian cases do your judges cite? Which Jewish ones? Are there any Greek or Roman cases that are cited? Please provide specific examples.\n \n I note that in your little spiel about how your nation has derived its laws you leave out Christianity. Obviously there was no (positive) influence there; perhaps 2,000 years of darkness??? ;)\nBradamente, are you saying that you only obey the laws that you deem to be \"right\"? How is it that you determine if a law is \"right\" or not?\n \n I don't see how I can make any judgment as to which legal system is the best, whether the American system of justice is the best.\n \n There is a thread of belief that continues on from Babylonian times to the present. The Jews very likely incorporated a goodly bit of Babylonian law into their Ten Commandments, several concepts of the Ten Commandments are incorporated into western law, regarding murder, theft, lying under oath, etc. \n \n As to the law of the first Americans being used in American law:\n \n \nThis September at Cornell University, a special conference entitled The Iroquois Great Law of Peace and the U.S. Constitution, 200 scholars examined a lost and forgotten origin of the U.S. Constitution. Convened by the North American Indian Studies Program, this gathering reviewed historical and scholarly evidence that the oldest democracy on Earth isn't the U.S.A., but rather the Six Nation Confederacy of the Iroquois. \n\n \n http://www.championtrees.org/yarrow/greatlaw.htm\n \n Greek concepts of governance were used in Roman times, these concepts passed down to Europe, you must remember that Great Britain in 1066 was conquered by one, William the Conqueror, who brought with him a legal system molded from a system descended from Greece and Rome. A goodly bit of American law is derived from the British model.", 
   {}, 
   229405, 
   null, 
   1156869960.0
  ], 
  [
   229442, 
   null, 
   "johnhanks", 
   "... you must remember that Great Britain in 1066 was conquered by one, William the Conqueror, who brought with him a legal system molded from a system descended from Greece and Rome.\n\n \n Simone, you won't thank me for this, but the pedant in me can't let this pass.\n [*]There was no such entity as 'Great Britain' in 1066, nor was there until 1707. Through quite astonishing good fortune, William the Conqueror won the throne of England.\n [*]Apart from granting privileges to the invaders, the law instituted by William was not markedly different from the Anglo-Saxon law it replaced:\nThis also I command and will, that all shall have and hold the law of the king Edward in respect of their lands and all their possessions, with the addition of those decrees I have ordained for the welfare of the English people\n\n \n 'The king Edward' (Edward the Confessor) was the penultimate Anglo-Saxon king, and it was kinship to him that 'legitimised' William's claim to the throne.\n \n Bear in mind that William the Conqueror was not a Frenchman, but a Norman. The Normans (from Norway) had conquered the French some years earlier.", 
   {}, 
   229426, 
   null, 
   1156880460.0
  ], 
  [
   229447, 
   null, 
   "paul.boys", 
   "Simone, why are you allowing your thought pattern to keep company with such conservative folks? Are you a wolf in liberals clothing? Should your liberal friends beware?\n \n While I appreciate your desire to open people's minds to the evil around them, I am bothered by your stubbornness in refusing to see the evil in your own statement, \"I wish all religion destroyed.\" Why not rephrase your statment?", 
   {}, 
   229426, 
   null, 
   1156882680.0
  ], 
  [
   229449, 
   null, 
   "Judeau", 
   "Simone, why are you allowing your thought pattern to keep company with such conservative folks? Are you a wolf in liberals clothing? Should your liberal friends beware?\n \n While I appreciate your desire to open people's minds to the evil around them, I am bothered by your stubbornness in refusing to see the evil in your own statement, \"I wish all religion destroyed.\" Why not rephrase your statment?\n\n \n I don't know if you are trying to imply that conservatives are evil but if you are, I don't really appreciate that any more than you appreciate me calling liberals evil. But I do agree with your request to Simone to rephrase his statement. There is inherent evil in a statement like that because it asks for a pox to be put on all people who have religion. Because I follow a religion, should I too be destroyed? Or does it need to be ripped away from me and the several billion other people who are monotheistic? To what end does all religion need to be destroyed?", 
   {}, 
   229447, 
   null, 
   1156884780.0
  ], 
  [
   229462, 
   null, 
   "paul.boys", 
   "I don't know if you are trying to imply that conservatives are evil but if you are, I don't really appreciate that any more than you appreciate me calling liberals evil.\n\n \n Thanks, Judeau. I'm not implying that conservatives are evil. However, I am teasing Simone with the hopes of eliciting a response. Simone is an avowed anti Bush-ite, even though she shares similar language habits with Bush and other conservatives.", 
   {}, 
   229449, 
   null, 
   1156887300.0
  ], 
  [
   229542, 
   null, 
   "Bradamante", 
   "Are you now arguing 'what is legal' as 'what is right'?\n\n \n \n Bradamante, are you saying that you only obey the laws that you deem to be \"right\"? How is it that you determine if a law is \"right\" or not?\n\n Firstly, asking me a question doesn't answer my question. But assuming you're not trying to evade answering, I'll answer you. Regardless of the law, I follow Christian beliefs.\n \n \nAre you saying that the American system is the best?\n\n \n \n\n I don't see how I can make any judgment as to which legal system is the best, whether the American system of justice is the best.\n\n \n \nIn your legal system; what legal precepts come from native Americans? Can you cite any major case that was drawn upon traditional Indian legal opinion. Which Babylonian cases do your judges cite? Which Jewish ones? Are there any Greek or Roman cases that are cited? Please provide specific examples.\n\n \n\n As to the law of the first Americans being used in American law:\n \n Quote:This September at Cornell University, a special conference entitled The Iroquois Great Law of Peace and the U.S. Constitution, 200 scholars examined a lost and forgotten origin of the U.S. Constitution. Convened by the North American Indian Studies Program, this gathering reviewed historical and scholarly evidence that the oldest democracy on Earth isn't the U.S.A., but rather the Six Nation Confederacy of the Iroquois. \n http://www.championtrees.org/yarrow/greatlaw.htm\n \n\n \n Your link shows an excerpt taken from the following...\n (follow link at bottom of your own citation) to\n The Dragon and the Ice Castle \n Rediscovery of Sacred Space in the Finger Lakes \n http://www.championtrees.org/Dragon/index.htm\n He is also the author of \"Return of the Dragon: Hazards of Man-Made Magnetism\"\n \n Leaving that aside, the key words in the quote you give are \"lost and forgotten\" therefore of no real relevance in the realm of modern American law - so it seems to me -as it's not something used as a source if it's lost.\n \n An example of another 'experts' at that site...\n \"Conference speaker Bruce Barton, Chair of English at Castleton College, has written a novel on the founding of the Iroquois Confederacy\"\n http://www.championtrees.org/yarrow/greatlaw.htm\n A novelist and chair of English!\n \n There's a hint of very pro-American bigotry in the site; that democracy is indigenous to the US; as sort of an 'essentialist' argument. The essence of the US is democracy; because it was there long before the English-speaking peoples were; and these brought nothing with them.\n \n \nI note that in your little spiel about how your nation has derived its laws you leave out Christianity. Obviously there was no (positive) influence there; perhaps 2,000 years of darkness??? \n\n \n \nThere is a thread of belief that continues on from Babylonian times to the present. The Jews very likely incorporated a goodly bit of Babylonian law into their Ten Commandments, several concepts of the Ten Commandments are incorporated into western law, regarding murder, theft, lying under oath, etc. \n \n Greek concepts of governance were used in Roman times, these concepts passed down to Europe, you must remember that Great Britain in 1066 was conquered by one, William the Conqueror, who brought with him a legal system molded from a system descended from Greece and Rome. A goodly bit of American law is derived from the British model.\n\n \n English common law was not derived from Greco-Roman tradition, but from the customary laws of the Germanic peoples who settled England. When all England was united, good men from government were sent about the country to make notes of the laws and customs held in various parts of that country. Then they collated these to find what laws were held in 'common'; hence 'common law'. Into this model came the idea that one would look back to see what judgments had been made before. Thus 'precedent' or 'judge made law' is a major component of this system.\n \n William invaded England. Not Great Britain. The language of law was decidedly European after William, with large numbers of Latin and French words coming into use, but he did not overturn the 'system' of law, i.e. 'common law'; although some areas such as concerning business and the church (I believe) arose from canon law - ie. from Greco-Roman Europe... but modified by Christianity.\n \n All the US (except the state of Louisiana) follow this 'common law system'.\n \n But I still note you don't acknowledge 'Christian' influence (even the OT is \"Jewish\" law).", 
   {}, 
   229442, 
   null, 
   1156935120.0
  ], 
  [
   229546, 
   null, 
   "trebor", 
   "Firstly, asking me a question doesn't answer my question. But assuming you're not trying to evade answering, I'll answer you. Regardless of the law, I follow Christian beliefs.\n \n \n \n \n \n \n \n \n Your link shows an excerpt taken from the following...\n (follow link at bottom of your own citation) to\n The Dragon and the Ice Castle \n Rediscovery of Sacred Space in the Finger Lakes \n http://www.championtrees.org/Dragon/index.htm\n He is also the author of \"Return of the Dragon: Hazards of Man-Made Magnetism\"\n \n Leaving that aside, the key words in the quote you give are \"lost and forgotten\" therefore of no real relevance in the realm of modern American law - so it seems to me -as it's not something used as a source if it's lost.\n \n An example of another 'experts' at that site...\n \"Conference speaker Bruce Barton, Chair of English at Castleton College, has written a novel on the founding of the Iroquois Confederacy\"\n http://www.championtrees.org/yarrow/greatlaw.htm\n A novelist and chair of English!\n \n There's a hint of very pro-American bigotry in the site; that democracy is indigenous to the US; as sort of an 'essentialist' argument. The essence of the US is democracy; because it was there long before the English-speaking peoples were; and these brought nothing with them.\n \n \n \n \n \n English common law was not derived from Greco-Roman tradition, but from the customary laws of the Germanic peoples who settled England. When all England was united, good men from government were sent about the country to make notes of the laws and customs held in various parts of that country. Then they collated these to find what laws were held in 'common'; hence 'common law'. Into this model came the idea that one would look back to see what judgments had been made before. Thus 'precedent' or 'judge made law' is a major component of this system.\n \n William invaded England. Not Great Britain. The language of law was decidedly European after William, with large numbers of Latin and French words coming into use, but he did not overturn the 'system' of law, i.e. 'common law'; although some areas such as concerning business and the church (I believe) arose from canon law - ie. from Greco-Roman Europe... but modified by Christianity.\n \n All the US (except the state of Louisiana) follow this 'common law system'.\n \n But I still note you don't acknowledge 'Christian' influence (even the OT is \"Jewish\" law).\n\n \n \n Tell me, what part of our law came from the Christian , or Jewish law that also didn't have it's roots in older civilizations?", 
   {}, 
   229542, 
   null, 
   1156947060.0
  ], 
  [
   229616, 
   null, 
   "epaphras_faith", 
   "This is not just a non sequitur, it's a gross abuse of the phrase 'by definition'. Even if we were to accept the proposal that every individual is her/his own arbiter of right and wrong (i.e. that social consensus counts for nothing), to claim that the outcome is therefore a 'whim' is mere mud-slinging.\n \n You have, in effect, resuscitated the tired old false dichotomy 'either morality comes from god, or there is none'. We've been over this ground several times, I think.\n\n \n There are a number of definitions of \"whim\", this is the one that I was intending\"\n \n \nArbitrary thought or impulse\n \n \n The context of my statements agree with that as well. I would not call it gross abuse to say that someone arbitrarily determining right or wrong based on their own thoughts and desires from a subjective standpoint woudl actually qualify as the definition cited above. \n \n You may have argument here but \"gross abuse\" is hardly appropriate.\n \n EF\n \n oops, forgot, my source for the definition is dictionary.com", 
   {}, 
   229020, 
   null, 
   1156975380.0
  ], 
  [
   229647, 
   null, 
   "simone", 
   "Simone, you won't thank me for this, but the pedant in me can't let this pass.\n [*]There was no such entity as 'Great Britain' in 1066, nor was there until 1707. Through quite astonishing good fortune, William the Conqueror won the throne of England.\nJH, I quite agree with you. I was being intellectually lazy because I did not want to bloody list Wessex and Sussex and all those precursors of the present day counties that almost existed as separate national entities.\n \n \n[*]Apart from granting privileges to the invaders, the law instituted by William was not markedly different from the Anglo-Saxon law it replaced:\n \n 'The king Edward' (Edward the Confessor) was the penultimate Anglo-Saxon king, and it was kinship to him that 'legitimised' William's claim to the throne.\n \n Bear in mind that William the Conqueror was not a Frenchman, but a Norman. The Normans (from Norway) had conquered the French some years earlier.\nWilliam carried the French language over from France, however, because he was quite Frenchified and did not speak a Nordic tongue. Many of the English words we presently use are of French origin, beef, pork, mutton, as opposed to dining on cow or pig or sheep. In the tradition of the English we very seldom dine on swine, but I don't know that a Germanic person would have a problem with that. Frenchified English was the patois of the nobility and was the gift of William.\n \n I don't know enough about very early English law and French law to argue with you about that particular point. However, my reading of William does not lead me to believe that he was an advocate of Norse law.", 
   {}, 
   229442, 
   null, 
   1156989240.0
  ], 
  [
   229684, 
   null, 
   "Bradamante", 
   "Tell me, what part of our law came from the Christian , or Jewish law that also didn't have it's roots in older civilizations?\n\n \n Trebor, thank you for the question. This is 1st year law stuff! (at least in this country).*\n \n From the concept of 'love thy neighbour' which Jesus taught, James Richard Atkin (aka Lord Atkin) (in the case of Donoguhe and Stevenson (the UK)) was swayed to rule that there's a concept of a 'duty of care' between a manufactuer and the ultimate end-user of that person's product. In the British and Commonwealth nations it can be commonaly called the 'good neighbour' case, but in the American it's the 'good Samaritan' case.\n \n \"In 1932, as a member of the House of Lords, he delivered the leading judgement in the landmark case of Donoghue v. Stevenson which established the modern law of negligence in the UK.\"\n http://en.wikipedia.org/wiki/Lord_Atkin\n \n \"The case is perhaps most well known for the speech of Lord Atkin and his \"neighbour\" or \"neighbourhood\" principle, where he applied Luke 10 to law - that is, where an established duty of care does not already exist, a person will owe a duty of care not to injure those who it can be reasonably foreseen would be affected by their acts or omissions. The practical effect of this case was to provide individuals with a remedy against suppliers of consumer products, even where the complainant had no privity of contract with those individual or company tortfeasors.\"\n http://en.wikipedia.org/wiki/Lord_Atkin\n \n This precendent setting case then had a flow on affect througout the common law world, even the USA. US law firms use the 'good neighbour/good samaritan' concept all the time...\n \"Moore v. Trevino, 94 S.W.3d 723 (Tex. App.--San Antonio 2002, pet. denied) (holding, as a matter of first impression, that Good Samaritan statute protected paramedics and awarding defendants their trial court costs)\"\n http://www.croftscallaway.com/CM/Cases/Cases7.asp\n \n And, the 'Good Neigbour' principle in Jewish tradition was more restrictive. Jesus Himself differentiates between His idea and the earlier Jewish one whne in Matthew 5:43 He says &#8220;You have heard that it was said, 'Love your neighbor and hate your enemy.' 44 But I tell you: Love your enemies and pray for those who persecute you\n \n \n \n This is contrasted with a much more narrower view in Leviticus. 19:18:'Do not seek revenge or bear a grudge against one of your people, but love your neighbor as yourself. I am the LORD.\"\n \n \n \n \n \n *\n \n \"Donoghue (or McAlister) v. Stevenson ([1932] A.C. 532, 1932 S.C. (H.L.) 31, [1932] All ER Rep 1) is one of the most famous cases in the legal history of the English common law system\"\n \n http://en.wikipedia.org/wiki/Lord_Atkin", 
   {}, 
   229546, 
   null, 
   1157024100.0
  ], 
  [
   229685, 
   null, 
   "Bradamante", 
   "JH, I quite agree with you. I was being intellectually lazy because I did not want to bloody list Wessex and Sussex and all those precursors of the present day counties that almost existed as separate national entities.\n\n \n You didn't need to. As Johnhanks pointed out, William invaded 'England'. The countries of Wessex, Sussex, Essex, Mercia, Northumbria, Bernicia et al had by 1066 been brought together into England.\n \n \nWilliam carried the French language over from France, however, because he was quite Frenchified and did not speak a Nordic tongue.\n\n This is true.\n \nMany of the English words we presently use are of French origin, beef, pork, mutton, as opposed to dining on cow or pig or sheep.\n\n Almost. The words of the 'table' are derived from the French. The words of the farm are still Anglo-Saxon (hence we still use 'cow', 'pig' and 'sheep'). This is probably because the farm worker was an Anglo-Saxon serf and when he brought the food to his lord, the lord used the French words for his cuts of meat.\n \nIn the tradition of the English we very seldom dine on swine, but I don't know that a Germanic person would have a problem with that. Frenchified English was the patois of the nobility and was the gift of William.\n \n I don't know enough about very early English law and French law to argue with you about that particular point. However, my reading of William does not lead me to believe that he was an advocate of Norse law.\n\n William was not an advocate of Norse law. At best he was an advocate of a French super-structure to govern English law. It is why we in the common law world have a different system of law from that influenced by the continent.", 
   {}, 
   229647, 
   null, 
   1157024520.0
  ], 
  [
   229686, 
   null, 
   "trebor", 
   "Trebor, thank you for the question. This is 1st year law stuff! (at least in this country).*\n \n From the concept of 'love thy neighbour' which Jesus taught, James Richard Atkin (aka Lord Atkin) (in the case of Donoguhe and Stevenson (the UK)) was swayed to rule that there's a concept of a 'duty of care' between a manufactuer and the ultimate end-user of that person's product. In the British and Commonwealth nations it can be commonaly called the 'good neighbour' case, but in the American it's the 'good Samaritan' case.\n \n \"In 1932, as a member of the House of Lords, he delivered the leading judgement in the landmark case of Donoghue v. Stevenson which established the modern law of negligence in the UK.\"\n http://en.wikipedia.org/wiki/Lord_Atkin\n \n \"The case is perhaps most well known for the speech of Lord Atkin and his \"neighbour\" or \"neighbourhood\" principle, where he applied Luke 10 to law - that is, where an established duty of care does not already exist, a person will owe a duty of care not to injure those who it can be reasonably foreseen would be affected by their acts or omissions. The practical effect of this case was to provide individuals with a remedy against suppliers of consumer products, even where the complainant had no privity of contract with those individual or company tortfeasors.\"\n http://en.wikipedia.org/wiki/Lord_Atkin\n \n This precendent setting case then had a flow on affect througout the common law world, even the USA. US law firms use the 'good neighbour/good samaritan' concept all the time...\n \"Moore v. Trevino, 94 S.W.3d 723 (Tex. App.--San Antonio 2002, pet. denied) (holding, as a matter of first impression, that Good Samaritan statute protected paramedics and awarding defendants their trial court costs)\"\n http://www.croftscallaway.com/CM/Cases/Cases7.asp\n \n And, the 'Good Neigbour' principle in Jewish tradition was more restrictive. Jesus Himself differentiates between His idea and the earlier Jewish one whne in Matthew 5:43 He says \"You have heard that it was said, 'Love your neighbor and hate your enemy.' 44 But I tell you: Love your enemies and pray for those who persecute you\n \n \n \n This is contrasted with a much more narrower view in Leviticus. 19:18:'Do not seek revenge or bear a grudge against one of your people, but love your neighbor as yourself. I am the LORD.\"\n \n \n \n \n \n *\n \n \"Donoghue (or McAlister) v. Stevenson ([1932] A.C. 532, 1932 S.C. (H.L.) 31, [1932] All ER Rep 1) is one of the most famous cases in the legal history of the English common law system\"\n \n http://en.wikipedia.org/wiki/Lord_Atkin\n\n \n \n That sounds like a load of hooky to me. The \"good samaratian\" statue has nothign to do with 'Love thy neighbor'. You are also quite wrong about the Jewish laws concerning helping someone out on the sabbath.\n \n I am not surprised you would totally misconstrue the Jewish laws though.\n \n Also, the 'Golden Rule' is not even unique to the Judeo-christian religion. There is the tale of the Eloquent Peasent that gives the same idea (2000 BC), and then there is the sayings of Hindusim , Zorastorism, Confusiousism, and such.\n \n So, that is not unique to Judeo-christanity, and the \"tale of the eloquent peasent' predates Judaism.\n \n So, I find that example to show that americian Judaprudance being based on the Christian religion strained to begin with, and there is nothing that you attempted to show that wasn't already stated pre-judaism.", 
   {
    "unicode_changes_made": true
   }, 
   229684, 
   null, 
   1157033340.0
  ], 
  [
   229741, 
   null, 
   "Bradamante", 
   "That sounds like a load of hooky to me. The \"good samaratian\" statue has nothign to do with 'Love thy neighbor'. \n\n It has everything to do with it. Jesus was asked \"Who is my neighbour\"\n \n Luke 10:25On one occasion an expert in the law stood up to test Jesus. \"Teacher,\" he asked, \"what must I do to inherit eternal life?\" \n 26\"What is written in the Law?\" he replied. \"How do you read it?\" \n \n 27He answered: \" 'Love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind'[c]; and, 'Love your neighbor as yourself.'[d]\" \n \n 28\"You have answered correctly,\" Jesus replied. \"Do this and you will live.\" \n \n 29But he wanted to justify himself, so he asked Jesus, \"And who is my neighbor?\" \n \n And then Jesus ellaborated on this to give the 'Good Samaritan' parable. The idea was that every man who shows love for any other man is loving their neighbour, this goes directly to the broadening of the Jewish concept mentioned earlier.\n \n It saddens me that when confronted with facts you believe your opinion is paramount. This is a problem with people's preconceived anti-clericalism.\n \n \nI am not surprised you would totally misconstrue the Jewish laws though.\n\n More opinion\n \n\n Also, the 'Golden Rule' is not even unique to the Judeo-christian religion. There is the tale of the Eloquent Peasent that gives the same idea (2000 BC), and then there is the sayings of Hindusim , Zorastorism, Confusiousism, and such.\n\n As I've already pointed out the 'neighbour' concept was in the Jewish tradition, but it had a differen emphasis. So to in Islam one is called to respect one's 'brothers' BUT by this they mean fellow Moslems.\n \n \nSo, that is not unique to Judeo-christanity, and the \"tale of the eloquent peasent' predates Judaism.\n\n Cite me a judge using that as an influence in his decision.\n \n\n So, I find that example to show that americian Judaprudance being based on the Christian religion strained to begin with, and there is nothing that you attempted to show that wasn't already stated pre-judaism.\n\n Given that I've shown a judge directly attributing the New Testament then your opinion, duly noted remains just that.\n \n Lord Atkin used the same question Jesus asked \"Who is my neighbour?\" he then applied this very broad idea (from the NT) to show that a maker of a drink has a duty of care to all people that come into contact with their product, not just the immediate purchaser - the owner of the restaurant.\n \n As noted also, this is really basic law stuff. You don't want to acknowledge it, that's entirely up to you... but you need to stop and think about your 'opinion' -v- 'fact'.\n \n The fact that other societies might have had 'similar' laws is irrelevant, unless you can show a causal relationship between their views, and that of some law-maker today.", 
   {}, 
   229686, 
   null, 
   1157065140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Love of God, Hatred of Humanity", 
  "url": "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8686, 
  "discussion_files": [
   [
    "30611.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-print.html"
   ], 
   [
    "30612.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-8-print.html"
   ], 
   [
    "30613.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-6-print.html"
   ], 
   [
    "30614.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-4-print.html"
   ], 
   [
    "30615.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-5-print.html"
   ], 
   [
    "30616.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-7-print.html"
   ], 
   [
    "30617.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-3-print.html"
   ], 
   [
    "30618.html", 
    "http://www.4forums.com/political/religion-debates/8686-love-god-hatred-humanity-2-print.html"
   ]
  ], 
  "identifier": 8686
 }
]