[
 [
  [
   227485, 
   null, 
   "Matthew S", 
   "If the bible is the word of God and many antigay christians believe it is. God sanctioned Jacob to have 2 wives and two or more concubines. David had a husband and several wives. Abraham had a wife and a concubine. So all those anti gay christians that are pushing for \"one man one woman\" are slapping their God in the face when they say they believe the Bible is the literal truth and the word of God then refuse to live by that standard. Furthermore they are also slapping thier God in the face when they push for only one man one woman and do not allow the mormans to live by the biblical standards. \n \n So anti gay christians either live by the standard you believe is the word of your God or get off the backs of gay people.", 
   {
    "post_info": {
     "post_title": "Evangelicals are sinning against their God"
    }
   }, 
   null, 
   null, 
   1155474240.0
  ], 
  [
   227510, 
   null, 
   "jyoshu", 
   "If the bible is the word of God and many antigay christians believe it is. God sanctioned Jacob to have 2 wives and two or more concubines. David had a husband and several wives. Abraham had a wife and a concubine. So all those anti gay christians that are pushing for \"one man one woman\" are slapping their God in the face when they say they believe the Bible is the literal truth and the word of God then refuse to live by that standard. Furthermore they are also slapping thier God in the face when they push for only one man one woman and do not allow the mormans to live by the biblical standards. \n \n So anti gay christians either live by the standard you believe is the word of your God or get off the backs of gay people.\n\n \n Actually, you bring up an interesting point in this by showing a contradiction between \"anti-gay\" evangelicals' beliefs of one-man-one-woman and that of the Bible. Nice job.\n \n The way that I reconcile the one-man-one-woman argument with the Bible is with the New Testament which doesn't really support polygamy or concubinage any longer. (Just as it did away with things like stoning people for breaking the sabbath law.)\n \n In reading and taking the NT as a whole, I believe polygamy and concubinage are not really consistent with NT Christianity.", 
   {}, 
   227485, 
   null, 
   1155497340.0
  ], 
  [
   227515, 
   null, 
   "Ooaman", 
   "...David had a husband and several wives...\n\n \n I'm confused.emoticon_confused When did he have a husband? Who was his husband?", 
   {}, 
   227485, 
   null, 
   1155500460.0
  ], 
  [
   227526, 
   null, 
   "foundit66", 
   "The way that I reconcile the one-man-one-woman argument with the Bible is with the New Testament which doesn't really support polygamy or concubinage any longer. (Just as it did away with things like stoning people for breaking the sabbath law.)\n In reading and taking the NT as a whole, I believe polygamy and concubinage are not really consistent with NT Christianity.\n\n \n That's the usual way that trick is pulled off...\n Ignore the fact that polygamy is NOWHERE condemned in the Bible, and read monogamy \"into\" a lot of places where it isn't even really implied...", 
   {}, 
   227510, 
   null, 
   1155502020.0
  ], 
  [
   227530, 
   null, 
   "foundit66", 
   "I'm confused.emoticon_confused When did he have a husband? Who was his husband?\n\n \n I think he's referring to David and Jonathan.\n \n 1 Samuel\n \n 18:1 And it came to pass, when he had made an end of speaking unto Saul, that the soul of Jonathan was knit with the soul of David, and Jonathan loved him as his own soul.\n 18:2 And Saul took him that day, and would let him go no more home to his father's house. \n 18:3 Then Jonathan and David made a covenant, because he loved him as his own soul. \n 18:4 And Jonathan stripped himself of the robe that was upon him, and gave it to David, and his garments, even to his sword, and to his bow, and to his girdle. \n \n \n 20:30 Then Saul's anger was kindled against Jonathan, and he said unto him, Thou son of the perverse rebellious woman, do not I know that thou hast chosen the son of Jesse to thine own confusion, and unto the confusion of thy mother's nakedness? \n \n 20:41 And as soon as the lad was gone, David arose out of a place toward the south, and fell on his face to the ground, and bowed himself three times: and they kissed one another, and wept one with another, until David exceeded.", 
   {}, 
   227515, 
   null, 
   1155502860.0
  ], 
  [
   227542, 
   null, 
   "jyoshu", 
   "That's the usual way that trick is pulled off...\n Ignore the fact that polygamy is NOWHERE condemned in the Bible . . .\n\n \n Apparently being the \"husband of ONE wife\" as a moral standard in 2 Tim 3:2 is completely lost on you . . . as well as Titus 1:6 and 1 Tim 3:12.", 
   {}, 
   227526, 
   null, 
   1155505980.0
  ], 
  [
   227543, 
   null, 
   "jyoshu", 
   "I think he's referring to David and Jonathan.\n \n 1 Samuel\n \n 18:1 And it came to pass, when he had made an end of speaking unto Saul, that the soul of Jonathan was knit with the soul of David, and Jonathan loved him as his own soul.\n 18:2 And Saul took him that day, and would let him go no more home to his father's house. \n 18:3 Then Jonathan and David made a covenant, because he loved him as his own soul. \n 18:4 And Jonathan stripped himself of the robe that was upon him, and gave it to David, and his garments, even to his sword, and to his bow, and to his girdle. \n \n \n 20:30 Then Saul's anger was kindled against Jonathan, and he said unto him, Thou son of the perverse rebellious woman, do not I know that thou hast chosen the son of Jesse to thine own confusion, and unto the confusion of thy mother's nakedness? \n \n 20:41 And as soon as the lad was gone, David arose out of a place toward the south, and fell on his face to the ground, and bowed himself three times: and they kissed one another, and wept one with another, until David exceeded.\n\n \n Er, that says nothing about them being married or having a gay relationship.\n \n You do know that close friends can love each other without being gay, and that kissing is a very common (non-gay) middle eastern greeting between same-gender people, don't you? There's certainly nothing there to prove they had a gay relationship.", 
   {}, 
   227530, 
   null, 
   1155506160.0
  ], 
  [
   227545, 
   null, 
   "Joe@actsii", 
   "If the bible is the word of God and many antigay christians believe it is. God sanctioned Jacob to have 2 wives and two or more concubines. David had a husband and several wives. Abraham had a wife and a concubine. So all those anti gay christians that are pushing for \"one man one woman\" are slapping their God in the face when they say they believe the Bible is the literal truth and the word of God then refuse to live by that standard. Furthermore they are also slapping thier God in the face when they push for only one man one woman and do not allow the mormans to live by the biblical standards. \n \n So anti gay christians either live by the standard you believe is the word of your God or get off the backs of gay people.\n\n \n We need to remember that everything that the Bible tells us about, was not always sanctioned or approved of by God. Using that argument would mean that God approves of cutting people's ears off.\n \n Mark 14:47\n \n 47 And one of them that stood by drew a sword, and smote a servant of the high priest, and cut off his ear.\n KJV\n \n Luke 22:50\n \n 50 And one of them smote the servant of the high priest, and cut off his right ear.\n KJV\n \n John 18:26\n \n 26 One of the servants of the high priest, being his kinsman whose ear Peter cut off, saith, Did not I see thee in the garden with him?\n KJV", 
   {
    "unicode_changes_made": true
   }, 
   227485, 
   null, 
   1155506880.0
  ], 
  [
   227556, 
   null, 
   "foundit66", 
   "Apparently being the \"husband of ONE wife\" as a moral standard in 2 Tim 3:2 is completely lost on you . . . as well as Titus 1:6 and 1 Tim 3:12.\n\n \n 2Ti 3:2 For men shall be lovers of their own selves, covetous, boasters, proud, blasphemers, disobedient to parents, unthankful, unholy, \n \n Tts 1:6 If any be blameless, the husband of one wife, having faithful children not accused of riot or unruly. \n \n 1Ti 3:12 Let the deacons be the husbands of one wife, ruling their children and their own houses well. \n \n Your first passage must have been a mistake.\n The second is not commandments against polygamy. It discusses one wife, but never outlaw multiple wives.\n The third is a statement to DEACONS. By the same token, would you extrapolate the Catholic church's standard on priests being monogamous as something applicable to ALL Catholics?", 
   {}, 
   227542, 
   null, 
   1155511560.0
  ], 
  [
   227557, 
   null, 
   "foundit66", 
   "Er, that says nothing about them being married or having a gay relationship.\n\n \"Married\"? I would agree.\n \"Gay relationship\"? It has as much to do with a \"gay relationship\" as the liberal interpretations of other segments of the bible, such as Sodom and Gomorrah.\n \n \n \nYou do know that close friends can love each other without being gay, and that kissing is a very common (non-gay) middle eastern greeting between same-gender people, don't you? There's certainly nothing there to prove they had a gay relationship.\n\n 1) Now if only the same standard would be applied to other Bible passages...\n Yeah. Like that'll happen.\n \n 2) Jonahan stripping down is conveniently ignored by you.\n As is the comment regarding \"hast chosen the son of Jesse to thine own confusion, and unto the confusion of thy mother's nakedness\".\n While you complain about \"proving\" they had a gay relationship, it seems obvious that there is no proof that they DID NOT have a gay relationship either...", 
   {}, 
   227543, 
   null, 
   1155511800.0
  ], 
  [
   227562, 
   null, 
   "Matthew S", 
   "We need to remember that everything that the Bible tells us about, was not always sanctioned or approved of by God. Using that argument would mean that God approves of cutting people&#8217;s ears off.\n \n Mark 14:47\n \n 47 And one of them that stood by drew a sword, and smote a servant of the high priest, and cut off his ear.\n KJV\n \n Luke 22:50\n \n 50 And one of them smote the servant of the high priest, and cut off his right ear.\n KJV\n \n John 18:26\n \n 26 One of the servants of the high priest, being his kinsman whose ear Peter cut off, saith, Did not I see thee in the garden with him?\n KJV\n\n \n \n \n Not the point\n \n Many anti gay christians believe that the Bible is the literal word of God and every word is fact stated by God to be followed down to the last word.", 
   {}, 
   227545, 
   null, 
   1155519000.0
  ], 
  [
   227564, 
   null, 
   "jyoshu", 
   "Your first passage must have been a mistake.\n\n \n Yes, I meant 1st Timothy 3:2. It's about church leaders, but see below as to why the passage still matters.\n \n \nThe second is not commandments against polygamy. It discusses one wife, but never outlaw multiple wives.\n\n \n I didn't say any of them are \"commandments\" against polygamy--no one ever claimed here the Bible singles out polygamy in a \"commandment\", so I'm not sure why you would be using that phraseology (except perhaps to try and make my arguments out to be something they weren't). But it does say \"the husband of one wife\" therefore indicating that to be the better way. Seems to definitely discourage polygamy, wouldn't you say?\n \n \nThe third is a statement to DEACONS. By the same token, would you extrapolate the Catholic church's standard on priests being monogamous as something applicable to ALL Catholics?\n\n \n Yes, it is referring ro deacons, but I think it is safe to say that because of the other items it talks about, it is encouraging monogamy. \n \n The bottom line here is that I'm not using any \"trick\" and \"reading monogamy\" into the Bible as you asserted here. There really is indication that polygamy is discouraged in the NT.", 
   {}, 
   227556, 
   null, 
   1155519180.0
  ], 
  [
   227565, 
   null, 
   "jyoshu", 
   "\"Gay relationship\"? It has as much to do with a \"gay relationship\" as the liberal interpretations of other segments of the bible, such as Sodom and Gomorrah.\n\n \n I agree, the idea that there's a gay relationship is a very liberal interpretation. In the sense that it takes enormous \"liberty\" with the text.\n \n \n1) Now if only the same standard would be applied to other Bible passages... Yeah. Like that'll happen.\n\n \n That's extranneous to this discussion.\n \n \n2) Jonahan stripping down is conveniently ignored by you. As is the comment regarding \"hast chosen the son of Jesse to thine own confusion, and unto the confusion of thy mother's nakedness\".\n While you complain about \"proving\" they had a gay relationship, it seems obvious that there is no proof that they DID NOT have a gay relationship either...\n\n \n Foundit, come on. Why should someone \"stripping down\" have sexual connotations???? Or Saul's disapproval of the friendship? None of this is indicative of a romantic relationship.\n \n Maybe if you were straight you'd be able to identify with the fact that people can change clothes in front a good friend without it being sexual.", 
   {}, 
   227557, 
   null, 
   1155519660.0
  ], 
  [
   227566, 
   null, 
   "foundit66", 
   "I didn't say any of them are \"commandments\" against polygamy--no one ever claimed here the Bible singles out polygamy in a \"commandment\", so I'm not sure why you would be using that phraseology (except perhaps to try and make my arguments out to be something they weren't). But it does say \"the husband of one wife\" therefore indicating that to be the better way. Seems to definitely discourage polygamy, wouldn't you say?\n\n 1) To elaborate, the \"commandment\" comment was with regards to the observation that Christians want not just their relationships to be monogamous (as opposed to polygamous), but other people's relationships to be that way as well.\n That was part of the reason.\n \n The other part was because of MY ORIGINAL COMMENT on the subject. \"Ignore the fact that polygamy is NOWHERE condemned in the Bible...\"\n I brought up how polygamy IS NOT CONDEMNED in the Bible. Not even in the passages you brought forward.\n \n I never claimed you were saying something you weren't, although I am not surprised that you would jump to that unwarranted conclusion. So much easier for you to deceitfully misrepresent the situation, eh Jyoshu?\n \n 2) \"Encouraging monogamy\" is not the same thing as \"discouraging polygamy\".\n \n \n \nYes, it is referring ro deacons, but I think it is safe to say that because of the other items it talks about, it is encouraging monogamy.\n\n Encouraging monogamy FOR DEACONS.\n Again, refer to the Catholics example, which you quote but don't respond to.\n \n \n \nThe bottom line here is that I'm not using any \"trick\" and \"reading monogamy\" into the Bible as you asserted here. There really is indication that polygamy is discouraged in the NT.\n\n Where?\n Show me ANY bible passage which says \"polygamy is discouraged\", or some variant of a CONDEMNATION OF POLYGAMY.", 
   {}, 
   227564, 
   null, 
   1155522360.0
  ], 
  [
   227567, 
   null, 
   "foundit66", 
   "I agree, the idea that there's a gay relationship is a very liberal interpretation. In the sense that it takes enormous \"liberty\" with the text.\n\n That's your opinion, and you're entitled to it.\n Others can see that the text establishes VERY strong over-tones which can easily be read as \"gay\".\n \n \n \nThat's extranneous to this discussion.\n\n 1) I'm sorry. Did you mean \"inconvenient for your discussion\" instead of \"extraneous\"?\n That seems to fit better...\n \n 2) The translations of Sodom and Gomorrah take liberal liberties in trying to make the situation about \"homosexuality\", and here when two guys profess love for each other, one strips in front of the other, the father criticizes the son about \"confusion\" and \"confusion\" about the \"mother\", and the two guys kiss, THAT is frowned upon as being \"gay\"?\n We've got MORE of a reason to believe David and Jonathan is a gay story than the story of Sodom and Gomorrah.\n \n \n \nFoundit, come on. Why should someone \"stripping down\" have sexual connotations???? Or Saul's disapproval of the friendship? None of this is indicative of a romantic relationship.\n\n 1) Kissing, which CAN be platonic or romantic.\n 2) Stripping down, which I don't know if it is EVER described elsewhere in the Bible. I don't know what context would make such a thing a part of a platonic relationship.\n 3) The comment on \"confusion\" and \"confusion\" regarding the mother.\n 4) \"loved him as his own soul\". Again, could be platonic or romantic.\n \n Taken all into perspective, it sounds \"gay\"...\n \n \n \nMaybe if you were straight you'd be able to identify with the fact that people can change clothes in front a good friend without it being sexual.\n\n What was the purpose of the stripping?\n You'll note that it DOES NOT say \"changed clothes\".\n It says that he STRIPPED his clothes off, INCLUDING THE GIRDLE!\n What was the purpose of this?\n \n The context establishes them talking about their LOVE for each other, and establishing a COVENANT with one another.\n And then one of them gets naked...\n \n Tell you what. Why don't you take one of your \"straight\" male \"friends\", tell him that you love him, make a \"covenant\" with him, and then start to strip in front of him.\n Tell me if he doesn't start saying something about \"gay\"...\n emoticon_xdonno", 
   {}, 
   227565, 
   null, 
   1155522960.0
  ], 
  [
   227573, 
   null, 
   "jyoshu", 
   "1) To elaborate, the \"commandment\" comment was with regards to the observation that Christians want not just their relationships to be monogamous (as opposed to polygamous), but other people's relationships to be that way as well.\n That was part of the reason.\n\n \n That's extranneous to this discussion.\n \n \nThe other part was because of MY ORIGINAL COMMENT on the subject. \"Ignore the fact that polygamy is NOWHERE condemned in the Bible...\" I brought up how polygamy IS NOT CONDEMNED in the Bible. Not even in the passages you brought forward.\n \n 2) \"Encouraging monogamy\" is not the same thing as \"discouraging polygamy\".\n\n \n So? I think it does both.\n \n And I never said it was condemned in the Bible. It seems you're much more interested in trying to refute things I DIDN'T say rather than responding to what I HAVE said. All the while asserting I'm being deceitful when you're the one doing so and backpedaling everytime I point out your misrepresentations.\n \n \nEncouraging monogamy FOR DEACONS. Again, refer to the Catholics example, which you quote but don't respond to.\n\n \n By that logic that it's JUST for deacons (rather than a moral standard), everyone else is free to be a poor manager of their home. After all, it also gave that to aspire to as well. Do you think that's just for deacons??? Take it in context with the other things he said. I seriously doubt Paul thinks non-deacons should have out-of-control families. These are moral standards we're in the realm of.\n \n \nWhere?\n Show me ANY bible passage which says \"polygamy is discouraged\", or some variant of a CONDEMNATION OF POLYGAMY.\n\n \n Foundit, this is getting ridiculous on your part. I've just shown you several places where polygamy was discouraged, and you are now asking me to show you that exact wording! You know discouragement doesn't require it to say \"polygamy is discouraged.\" That's just silly. You're moving the goalposts, and it's getting tiresome. But expected. \n \n And I don't need to show you where polygamy is condemned because I never claimed there was such a passage.", 
   {}, 
   227566, 
   null, 
   1155529920.0
  ], 
  [
   227576, 
   null, 
   "jyoshu", 
   "Others can see that the text establishes VERY strong over-tones which can easily be read as \"gay\".\n\n \n Sure, the extremely minority view. \n \n Just like there's an extremely minority view that thinks Jesus and Mary Magdalene had something going. If you prefer interpretations that require speculation and isogesis to come to conclusions that's your choice.\n \n \n1) I'm sorry. Did you mean \"inconvenient for your discussion\" instead of \"extraneous\"?\n\n \n No, extraneous. \n \n \n2) The translations of Sodom and Gomorrah take liberal liberties in trying to make the situation about \"homosexuality\", and here when two guys profess love for each other, one strips in front of the other, the father criticizes the son about \"confusion\" and \"confusion\" about the \"mother\", and the two guys kiss, THAT is frowned upon as being \"gay\"?\n We've got MORE of a reason to believe David and Jonathan is a gay story than the story of Sodom and Gomorrah.\n\n \n I'd say BOTH are examples of isogesis. Ironically, you're following in the footsteps of those translators of Genesis 19 by reading homosexuality into the passage.\n \n \n1) Kissing, which CAN be platonic or romantic.\n 2) Stripping down, which I don't know if it is EVER described elsewhere in the Bible. I don't know what context would make such a thing a part of a platonic relationship.\n\n \n The context is the rest of the passage--that he was giving him gifts--his costly royal gear and expensive royal apparel. Did you read the rest of it?\n \n And again, kissing (as well as hugging and handholding) is much, much more common in middle-eastern and African societies among males. It doesn't mean something sexual. Judas kissed Christ as well. What you are not getting is that the Bible is very explicit in stating the actions and feelings of David (take the Bathsheba passage for example)--if he had been sexually attracted to Jonathan, it would have come out and said so. It wouldn't be a veiled implication.\n \n And for that matter, the Bathsheba passage pretty much puts the bed any idea that David was gay.\n \n \n3) The comment on \"confusion\" and \"confusion\" regarding the mother.\n\n \n I don't get how it is that you ascertain that means David and Jonathan were gay.\n \n \n4) \"loved him as his own soul\". Again, could be platonic or romantic.\n\n \n Only for someone who reads something sexual into non-sexual things.\n \n \nWhat was the purpose of the stripping?\n You'll note that it DOES NOT say \"changed clothes\".\n It says that he STRIPPED his clothes off, INCLUDING THE GIRDLE!\n What was the purpose of this?\n\n \n Yeah sure Foundit, they were just gettin' nekkid and gettin' it on. Whatever. emoticon_rolleyes He was giving his gear and royal garments (worth a LOT) as gifts. And did you not read the parts of the passage where David calls him his \"brother\"? \n \n \nThe context establishes them talking about their LOVE for each other, and establishing a COVENANT with one another. And then one of them gets naked... Tell you what. Why don't you take one of your \"straight\" male \"friends\", tell him that you love him, make a \"covenant\" with him, and then start to strip in front of him. Tell me if he doesn't start saying something about \"gay\"...emoticon_xdonno\n\n \n Well that pretty much shows me once and for all that you have not made any effort whatsoever to take cultural context into account with the passage, nor separate it from our context.\n \n And like I said, maybe you'd need to be straight to understand how deep two guys can be close friends (and not be gay), like brothers.", 
   {}, 
   227567, 
   null, 
   1155531600.0
  ], 
  [
   227592, 
   null, 
   "Matthew S", 
   "\n \n And like I said, maybe you'd need to be straight to understand how deep two guys can be close friends (and not be gay), like brothers.\n\n \n Yet you have no proof that they were not lovers. They lived in a Phillistne dominated society where gay relationships were the norm. Jonathans binding his soul with David is a really unusual thing to do. The only other place I have heard of people binding their souls is in weddings.\n \n So here is the evedence for the gay relationship.\n \n 1 the culture the dominated the area at the time this was the norm\n 2 Jonathan binds his soul to David\n 3 No where else in the Bible or any place other then weddings do you read of or hear people binding/kitting of souls\n 4 Not even very good freinds bind/knit their souls. Have you and your close male friend?\n 5 Saul was angry that his son would do such a thing so much so that he was willing to kill David\n 6 Jonathan and David had secret meetings where they kissed. Once again do you go around kissing and weeping with your close male friends?\n \n \n The problem is that evagelicals are trying to ignore Jonathan and David and trying to gloss over the fact that they where lovers. What is futher more that God approved of this relationship.\n It is staring them in the face and their refuse to accept that there is a same sex marriage in the Bible by Gods golden boy. They try and gloss over the fact that Jonathan had the hots for and married David.", 
   {}, 
   227576, 
   null, 
   1155553080.0
  ], 
  [
   227611, 
   null, 
   "jyoshu", 
   "So here is the evedence for the gay relationship.\n \n 1 the culture the dominated the area at the time this was the norm\n 2 Jonathan binds his soul to David\n 3 No where else in the Bible or any place other then weddings do you read of or hear people binding/kitting of souls\n 4 Not even very good freinds bind/knit their souls. Have you and your close male friend?\n 5 Saul was angry that his son would do such a thing so much so that he was willing to kill David\n 6 Jonathan and David had secret meetings where they kissed. Once again do you go around kissing and weeping with your close male friends?\n \n \n The problem is that evagelicals are trying to ignore Jonathan and David and trying to gloss over the fact that they where lovers. What is futher more that God approved of this relationship.\n It is staring them in the face and their refuse to accept that there is a same sex marriage in the Bible by Gods golden boy. They try and gloss over the fact that Jonathan had the hots for and married David.\n\n \n I don't agree with your interpretation--I think you are reading way too much into phrases like \"knit to the soul of\" and the fact they participated in a common form of greeting of the day (kissing). The phrase \"binding/knitting of souls\" is pretty subjective--I see reason that couldn't mean a very close bond of friendship, like brothers. And who says homosexuality was the 'norm' in philistine culture? Citation please. (Even then, it wasn't philistine culture. They were Israelites, and the Philistines were their enemies.)\n \n No one is \"glossing over\" anything--yours is by far the less taken interpretation. And per your last sentence, there is NO evidence they were ever married.", 
   {}, 
   227592, 
   null, 
   1155575580.0
  ], 
  [
   227628, 
   null, 
   "foundit66", 
   "That's extranneous to this discussion.\n\n It's amazing how much you don't want to talk about is \"extranneous\" to the conversation.\n I guess I forgot to check my rule book where it states that YOU and YOU ALONE decide the boundaries of these discussions...\n \n If you don't want to discuss it, that's fine. It proves a point unto itself.\n \n \"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu\n \n \n \nSo? I think it does both.\n\n Of course you \"think\" that.\n You have nothing that actually CONDEMNS polygamy, so OF COURSE you can't admit that...\n OF COURSE you have to go the route of claiming that encouraging monogamy is also the action of discouraging polygamy...\n \n \n \nAnd I never said it was condemned in the Bible. It seems you're much more interested in trying to refute things I DIDN'T say rather than responding to what I HAVE said. All the while asserting I'm being deceitful when you're the one doing so and backpedaling everytime I point out your misrepresentations.\n\n THIS is an example of your deceit.\n I am not \"refuting\" anything you \"didn't say\".\n I am confirming one of the points that I SAID.\n The fact that you aren't refuting my point is irrelevant.\n You keep trying to make me talking about a point that I MADE an issue about you, when I never claimed it was about you.\n I already told you that the reason I talk about whether or not the bible \"condemns\" polygamy is because it is MY OBSERVATION.\n \n And STILL you try to make my comments about you.\n Do you comprehend that not EVERYTHING I say has to be in opposition to you?\n \n \n \nBy that logic that it's JUST for deacons (rather than a moral standard), everyone else is free to be a poor manager of their home. After all, it also gave that to aspire to as well. Do you think that's just for deacons???\n\n This is inane.\n When it says that it's a directive for deacons, then it's a directive FOR DEACONS.\n It's just that simple.\n \n \n \nTake it in context with the other things he said. I seriously doubt Paul thinks non-deacons should have out-of-control families. These are moral standards we're in the realm of.\n\n Man. You're just REALLY reaching here, aren't you.\n So if Jack tells Bill that Bill needs to clean his house and pay his ex-wife alimony, then that must mean that Doug must also need to pay Bill's ex-wife some alimony also...\n And if Doug DOES NOT do that, then Jack must think it's okay for Doug to have a rat-infested pig sty...\n \n Do you realize the logic error you are committing here?\n \n Just because the Bible tells deacons how to act DOES NOT mean it's telling EVERYBODY to act that way...\n ... and if we acknowledge that it's not telling everybody to act that way, then it IS NOT saying that it is okay for everybody to act otherwise.\n \n It IS SILENT on the issue.\n Do you get that? Do you know what \"silence\" means?\n \n Geez. If you want to take on the directives that were given to a deacon, then that's your own outlook. That's your perogative.\n But it would be YOUR CHOICE to do it or not to do it. You ARE NOT DIRECTED to be monogamous.\n \n \n \nFoundit, this is getting ridiculous on your part. I've just shown you several places where polygamy was discouraged, and you are now asking me to show you that exact wording!\n\n What is ridiculous is your claim that you have shown where polygamy is discouraged.\n You haven't.\n You have shown some bible passages where monogamy is encouraged for deacons, but that's it.\n That isn't the same as discouraging it for everybody.\n \n \n \nYou know discouragement doesn't require it to say \"polygamy is discouraged.\" That's just silly.\n\n A discouragement of polygamy requires A MENTION of polygamy.\n \n \n \nAnd I don't need to show you where polygamy is condemned because I never claimed there was such a passage.\n\n 1) Is this telling or what?\n Jyoshu just said that he never claimed there were any bible passages where polygamy is \"condemned\".\n \n Earlier, he claimed (inaccurately) \"I've just shown you several places where polygamy was discouraged...\"\n \n Is there a discrepancy here?\n \n 2) Then can you admit that polygamy is not condemned in the bible?", 
   {}, 
   227573, 
   null, 
   1155580140.0
  ], 
  [
   227631, 
   null, 
   "foundit66", 
   "Sure, the extremely minority view. \n Just like there's an extremely minority view that thinks Jesus and Mary Magdalene had something going. If you prefer interpretations that require speculation and isogesis to come to conclusions that's your choice.\n\n That would pretty much define the Sodom and Gomorrah pretense that it's about \"homosexuality\"...\n With the exception that it's the \"majority\" view.\n Do you condemn people who make that speculation as well?\n \n \n \nI'd say BOTH are examples of isogesis. Ironically, you're following in the footsteps of those translators of Genesis 19 by reading homosexuality into the passage.\n\n Quite frankly, if I were going to use something to \"condemn\" a group of people, I wouldn't base it on speculation.\n And I admit that my comments are speculatory.\n Do the translators of Genesis 19 do the same?\n \n \n \nThe context is the rest of the passage--that he was giving him gifts--his costly royal gear and expensive royal apparel. Did you read the rest of it?\n\n If you give clothes to Goodwill, do you typically wear them to the store to strip right in front of the staff.\n \n \n \nAnd again, kissing (as well as hugging and handholding) is much, much more common in middle-eastern and African societies among males. It doesn't mean something sexual. Judas kissed Christ as well. What you are not getting is that the Bible is very explicit in stating the actions and feelings of David (take the Bathsheba passage for example)--if he had been sexually attracted to Jonathan, it would have come out and said so. It wouldn't be a veiled implication.\n\n < snort <\n You REALLY are not getting the big picture about gays in history, are you...\n It's often \"veiled\" in some accounts, when other accounts are quite explicit as to what happened.\n \n \n \nAnd for that matter, the Bathsheba passage pretty much puts the bed any idea that David was gay.\n\n Did I say David was gay?\n Have you ever heard of \"bisexual\"?\n \n \n \nI don't get how it is that you ascertain that means David and Jonathan were gay.\n\n Have you ever read some of the posts around here (and other boards) about theories on why people are gay???\n The old \"oppressive mother / absent father causes homosexuality\" routine?\n \n \n \nOnly for someone who reads something sexual into non-sexual things.\n\n I admit that it COULD BE platonic or it COULD BE romantic.\n I think it would be more accurate to say FOR YOU \"Only for someone who excludes things sexual from professions of 'love'\".\n \n \n \nYeah sure Foundit, they were just gettin' nekkid and gettin' it on. Whatever. emoticon_rolleyes He was giving his gear and royal garments (worth a LOT) as gifts. And did you not read the parts of the passage where David calls him his \"brother\"? \n\n He told his FATHER they were brothers.\n Have you ever heard of gay people referring to their partner as a \"room-mate\"? \n \n \n \nWell that pretty much shows me once and for all that you have not made any effort whatsoever to take cultural context into account with the passage, nor separate it from our context.\n\n So, do you have any friends of a culture where this is acceptable?\n And why is it that the rest of the Bible doesn't describe things like this amongst \"friends\"? At least not to the levels discussed in these chapters...\n \n I acknowledge \"cultural context\".\n The point is that it does not EXCLUDE what I am talking about either...\n \n \n \nAnd like I said, maybe you'd need to be straight to understand how deep two guys can be close friends (and not be gay), like brothers.\n\n Yeah. You said it.\n It was ignorant the first time, and it's ignorant the second time.\n I can understand how two men can be close friends in a non-homosexual relationship, and be like brothers.\n \n The issue is not me excluding that as a possibility.\n But of course, you dishonestly portray it as that.\n I guess THAT should be expected...", 
   {}, 
   227576, 
   null, 
   1155581400.0
  ], 
  [
   227632, 
   null, 
   "jyoshu", 
   "It's amazing how much you don't want to talk about is \"extranneous\" to the conversation.\n \n If you don't want to discuss it, that's fine. It proves a point unto itself.\n\n \n Yeah, it proves I prefer to stay on topic.\n \n \nOf course you \"think\" that.\n You have nothing that actually CONDEMNS polygamy, so OF COURSE you can't admit that...\n\n \n Please don't lie. I've already told you I know there's nothing \"condemning\" polygamy--I told you more that once now I never claimed it was 'condemned.'\n \n \nTHIS is an example of your deceit.\n I am not \"refuting\" anything you \"didn't say\".\n I am confirming one of the points that I SAID.\n The fact that you aren't refuting my point is irrelevant.\n You keep trying to make me talking about a point that I MADE an issue about you, when I never claimed it was about you.\n\n \n Foundit, that's not deceit on my part. It's just that you apparently like to interject a lot of extra stuff, and I'm starting to realize that about you.\n \n \nJust because the Bible tells deacons how to act DOES NOT mean it's telling EVERYBODY to act that way...\n ... and if we acknowledge that it's not telling everybody to act that way, then it IS NOT saying that it is okay for everybody to act otherwise.\n \n It IS SILENT on the issue.\n Do you get that? Do you know what \"silence\" means?\n\n \n Apparently, you are absolutely incapable of thinking in terms of anything other than pure black and white. To you, a specification to one group (deacons) means a full license to commit whatever else anyone wants to for non-deacons! \n \n Are you able to understand that concept of moral standards? It's not about saying WHO GETS TO DO WHAT; it's about a standard and that deacons should aspire to the higher standard!\n \n Geez.\n \n And you keep expecting me to show you OVER and OVER wher polygamy is CONDEMNED in the Bible and I HAVE TOLD YOU I NEVER SAID IT WASN'T. I DON'T DISAGREE WITH YOU THAT IT'S NOT SPECIFICALLY CONDEMNED. Apparently, that has to be spelled out for you verbatim. \n \n Holy cow. emoticon_xdonno Unbelieveable.", 
   {}, 
   227628, 
   null, 
   1155581520.0
  ], 
  [
   227635, 
   null, 
   "foundit66", 
   "Sure, the extremely minority view. \n Just like there's an extremely minority view that thinks Jesus and Mary Magdalene had something going. If you prefer interpretations that require speculation and isogesis to come to conclusions that's your choice.\n\n That would pretty much define the Sodom and Gomorrah pretense that it's about \"homosexuality\"...\n With the exception that it's the \"majority\" view.\n Do you condemn people who make that speculation as well?\n \n \n \nI'd say BOTH are examples of isogesis. Ironically, you're following in the footsteps of those translators of Genesis 19 by reading homosexuality into the passage.\n\n Quite frankly, if I were going to use something to \"condemn\" a group of people, I wouldn't base it on speculation.\n And I admit that my comments are speculatory.\n Do the translators of Genesis 19 do the same?\n \n \n \nThe context is the rest of the passage--that he was giving him gifts--his costly royal gear and expensive royal apparel. Did you read the rest of it?\n\n If you give clothes to Goodwill, do you typically wear them to the store to strip right in front of the staff.\n \n \n \nAnd again, kissing (as well as hugging and handholding) is much, much more common in middle-eastern and African societies among males. It doesn't mean something sexual. Judas kissed Christ as well. What you are not getting is that the Bible is very explicit in stating the actions and feelings of David (take the Bathsheba passage for example)--if he had been sexually attracted to Jonathan, it would have come out and said so. It wouldn't be a veiled implication.\n\n < snort <\n You REALLY are not getting the big picture about gays in history, are you...\n It's often \"veiled\" in some accounts, when other accounts are quite explicit as to what happened.\n \n \n \nAnd for that matter, the Bathsheba passage pretty much puts the bed any idea that David was gay.\n\n Did I say David was gay?\n Have you ever heard of \"bisexual\"?\n \n \n \nI don't get how it is that you ascertain that means David and Jonathan were gay.\n\n Have you ever read some of the posts around here (and other boards) about theories on why people are gay???\n The old \"oppressive mother / absent father causes homosexuality\" routine?\n \n \n \nOnly for someone who reads something sexual into non-sexual things.\n\n I admit that it COULD BE platonic or it COULD BE romantic.\n I think it would be more accurate to say FOR YOU \"Only for someone who excludes things sexual from professions of 'love'\".\n \n \n \nYeah sure Foundit, they were just gettin' nekkid and gettin' it on. Whatever. emoticon_rolleyes He was giving his gear and royal garments (worth a LOT) as gifts. And did you not read the parts of the passage where David calls him his \"brother\"? \n\n He told his FATHER they were brothers.\n Have you ever heard of gay people referring to their partner as a \"room-mate\"? \n \n \n \nWell that pretty much shows me once and for all that you have not made any effort whatsoever to take cultural context into account with the passage, nor separate it from our context.\n\n So, do you have any friends of a culture where this is acceptable?\n And why is it that the rest of the Bible doesn't describe things like this amongst \"friends\"? At least not to the levels discussed in these chapters...\n \n I acknowledge \"cultural context\".\n The point is that it does not EXCLUDE what I am talking about either...\n \n \n \nAnd like I said, maybe you'd need to be straight to understand how deep two guys can be close friends (and not be gay), like brothers.\n\n Yeah. You said it.\n It was ignorant the first time, and it's ignorant the second time.\n I can understand how two men can be close friends in a non-homosexual relationship, and be like brothers.\n \n The issue is not me excluding that as a possibility.\n But of course, you dishonestly portray it as that.\n I guess THAT should be expected...", 
   {}, 
   227576, 
   null, 
   1155581820.0
  ], 
  [
   227639, 
   null, 
   "foundit66", 
   "Yeah, it proves I prefer to stay on topic.\n\n You prefer to stay on the topic that's convenient for you.\n That much is obvious, as again and again you drop discussion and refuse to discuss things that you cannot defend.\n \n \n \nPlease don't lie. I've already told you I know there's nothing \"condemning\" polygamy--I told you more that once now I never claimed it was 'condemned.'\n\n WHERE did you tell me *I know there's nothing \"condemning\" polygamy*???\n \n \n \nFoundit, that's not deceit on my part. It's just that you apparently like to interject a lot of extra stuff, and I'm starting to realize that about you.\n\n Gee. I talk about stuff. All types of stuff. Even \"extra\" stuff, as you put it...\n Oooh. Alert the cops!\n emoticon_wow \n \n \nApparently, you are absolutely incapable of thinking in terms of anything other than pure black and white. To you, a specification to one group (deacons) means a full license to commit whatever else anyone wants to for non-deacons!\n\n I am capable of thinking in things LOGICALLY.\n The same can't be said of you...\n A specification of requirements FOR DEACONS is a specification of requirements FOR DEACONS.\n If the same requirements, or other requirements, are to be made of the general population, then those requirements should be listed ELSEWHERE.\n \n As is your usual lack of style, you have resorted to hyperbole to try and rebuff my point.\n I'm not talking about \"a full license to commit whatever else anyone wants\".\n But if it is NOT SPECIFICALLY condemned for the general population, and directives are ONLY given for deacons, then the general population is free to follow or NOT FOLLOW those directives...\n \n \n \nAre you able to understand that concept of moral standards? It's not about saying WHO GETS TO DO WHAT; it's about a standard and that deacons should aspire to the higher standard!\n\n Got it.\n That's not my point. \n \n \n \nAnd you keep expecting me to show you OVER and OVER wher polygamy is CONDEMNED in the Bible and I HAVE TOLD YOU I NEVER SAID IT WASN'T. I DON'T DISAGREE WITH YOU THAT IT'S NOT SPECIFICALLY CONDEMNED. Apparently, that has to be spelled out for you verbatim.\n\n It's funny how you phrase that....\n You \"don't disagree with me that it's not specifically condemned\".\n As opposed to the more CONCRETE statement of \"I agree with you that it's not specifically condemned\".\n Was that on purpose?", 
   {}, 
   227632, 
   null, 
   1155582240.0
  ], 
  [
   227643, 
   null, 
   "jyoshu", 
   "That would pretty much define the Sodom and Gomorrah pretense that it's about \"homosexuality\"...\n With the exception that it's the \"majority\" view.\n Do you condemn people who make that speculation as well?\n\n \n I haven't \"condemned\" anyone here for anything (your hyperbole is so noted). I WILL agree with you here that saying the sin of Sodom and Gomorrah was \"homosexuality\" is incorrect.\n \n \nIf you give clothes to Goodwill, do you typically wear them to the store to strip right in front of the staff.\n\n \n A more correct analogy would be to have a good enough friend that one doesn't have a problem changing in front of them. The question should be would have I have problem changing in front of something I considered close as a brother to later give my clothes to goodwill. And the answer is no, if I were that close to someone as a friend I woundn't care.\n \n \nYou REALLY are not getting the big picture about gays in history, are you...\n It's often \"veiled\" in some accounts, when other accounts are quite explicit as to what happened.\n\n \n Not in the books of Samuel though, which is what matters here.\n \n \nDid I say David was gay?\n Have you ever heard of \"bisexual\"?\n\n \n No you didn't. But Matthew did, I believe. I'll double check.\n \n \nHave you ever read some of the posts around here (and other boards) about theories on why people are gay???\n The old \"oppressive mother / absent father causes homosexuality\" routine?\n\n \n That's a pretty modern pop-pseudo-psychology take on things. Again, an example of interpreting a 3000-year old account by modern context, IMO.\n \n \nI admit that it COULD BE platonic or it COULD BE romantic.\n\n \n Fair enough, then I admit it COULD be either way as well, though like you I have my views on which it is.\n \n Let's leave it at that and put this ridiculous rabbit chase to bed, shall we?", 
   {}, 
   227635, 
   null, 
   1155583080.0
  ], 
  [
   227645, 
   null, 
   "jyoshu", 
   "It's funny how you phrase that....\n You \"don't disagree with me that it's not specifically condemned\".\n As opposed to the more CONCRETE statement of \"I agree with you that it's not specifically condemned\".\n Was that on purpose?\n\n \n \n OMG. \n \n Foundit, here you go . . . I agree with you that it's not specifically condemned. Happy? You are reading WAAAAY too much into what's not said sometimes.", 
   {}, 
   227639, 
   null, 
   1155583260.0
  ], 
  [
   227655, 
   null, 
   "foundit66", 
   "I haven't \"condemned\" anyone here for anything (your hyperbole is so noted). I WILL agree with you here that saying the sin of Sodom and Gomorrah was \"homosexuality\" is incorrect.\n\n Understood.\n \n \n \nA more correct analogy would be to have a good enough friend that one doesn't have a problem changing in front of them. The question should be would have I have problem changing in front of something I considered close as a brother to later give my clothes to goodwill. And the answer is no, if I were that close to someone as a friend I woundn't care.\n\n Seriously dude.\n If I were to \"give\" somebody clothing, I wouldn't be WEARING the clothing 10 seconds before I gave it to them.\n And giving your UNDERWEAR to a friend as a gift???\n emoticon_wow \n \n \n \nNot in the books of Samuel though, which is what matters here.\n\n According to your opinion...\n \n \n \nThat's a pretty modern pop-pseudo-psychology take on things. Again, an example of interpreting a 3000-year old account by modern context, IMO.\n\n A \"modern\" pretense at psychology? Yes.\n But claims of \"confusion\" regarding homosexuality? That's pretty old.\n And confusion regarding the mother? More modern times have made that claim, but that doesn't mean anything regarding how long it has been in use...\n \n \n \nFair enough, then I admit it COULD be either way as well, though like you I have my views on which it is.\n Let's leave it at that and put this ridiculous rabbit chase to bed, shall we?\n\n Done.", 
   {}, 
   227643, 
   null, 
   1155590580.0
  ], 
  [
   227656, 
   null, 
   "foundit66", 
   "OMG. \n Foundit, here you go . . . I agree with you that it's not specifically condemned. Happy? You are reading WAAAAY too much into what's not said sometimes.\n\n Jyoshu, I just know how you phrase things and how you often you use phrasings like what I pointed out as opposed to the easier statement.", 
   {}, 
   227645, 
   null, 
   1155590700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evangelicals are sinning against their God", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8689-evangelicals-sinning-against-their-god.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8689, 
  "discussion_files": [
   [
    "32762.html", 
    "http://www.4forums.com/political/gay-rights-debates/8689-evangelicals-sinning-against-their-god-print.html"
   ], 
   [
    "32763.html", 
    "http://www.4forums.com/political/gay-rights-debates/8689-evangelicals-sinning-against-their-god-2-print.html"
   ]
  ], 
  "identifier": 8689
 }
]