[
 [
  [
   227756, 
   null, 
   "simone", 
   "http://www.nytimes.com/2006/08/15/science/sciencespecial2/15essa.html\n \n August 15, 2006\n Essay\n How to Make Sure Children Are Scientifically Illiterate \n By LAWRENCE M. KRAUSS\n Voters in Kansas ensured this month that noncreationist moderates will once again have a majority (6 to 4) on the state school board, keeping new standards inspired by intelligent design from taking effect.\n \n This is a victory for public education and sends a message nationwide about the public's ability to see through efforts by groups like the Discovery Institute to misrepresent science in the schools. But for those of us who are interested in improving science education, any celebration should be muted.\n \n This is not the first turnaround in recent Kansas history. In 2000, after a creationist board had removed evolution from the state science curriculum, a public outcry led to wholesale removal of creationist board members up for re-election and a reinstatement of evolution in the curriculum. \n \n In a later election, creationists once again won enough seats to get a 6-to-4 majority. With their changing political tactics, creationists are an excellent example of evolution at work. Creation science evolved into intelligent design, which morphed into \"teaching the controversy,\" and after its recent court loss in Dover, Pa., and political defeats in Ohio and Kansas, it will no doubt change again. The most recent campaign slogan I have heard is \"creative evolution.\" \n \n But perhaps more worrisome than a political movement against science is plain old ignorance. The people determining the curriculum of our children in many states remain scientifically illiterate. And Kansas is a good case in point.\n \n The chairman of the school board, Dr. Steve Abrams, a veterinarian, is not merely a strict creationist. He has openly stated that he believes that God created the universe 6,500 years ago, although he was quoted in The New York Times this month as saying that his personal faith \"doesn't have anything to do with science.\"\n \n \"I can separate them,\" he continued, adding, \"My personal views of Scripture have no room in the science classroom.\" \n \n A key concern should not be whether Dr. Abrams's religious views have a place in the classroom, but rather how someone whose religious views require a denial of essentially all modern scientific knowledge can be chairman of a state school board. \n \n I have recently been criticized by some for strenuously objecting in print to what I believe are scientifically inappropriate attempts by some scientists to discredit the religious faith of others. However, the age of the earth, and the universe, is no more a matter of religious faith than is the question of whether or not the earth is flat.\n \n It is a matter of overwhelming scientific evidence. To maintain a belief in a 6,000-year-old earth requires a denial of essentially all the results of modern physics, chemistry, astronomy, biology and geology. It is to imply that airplanes and automobiles work by divine magic, rather than by empirically testable laws. \n \n Dr. Abrams has no choice but to separate his views from what is taught in science classes, because what he says he believes is inconsistent with the most fundamental facts the Kansas schools teach children. \n \n Another member of the board, who unfortunately survived a primary challenge, is John Bacon. In spite of his name, Mr. Bacon is no friend of science. In a 1999 debate about the removal of evolution and the Big Bang from science standards, Mr. Bacon said he was baffled about the objections of scientists. \"I can't understand what they're squealing about,\" he is quoted as saying. \"I wasn't here, and neither were they.\" \n \n This again represents a remarkable misunderstanding of the nature of the scientific method. Many fields - including evolutionary biology, astronomy and physics - use evidence from the past in formulating hypotheses. But they do not stop there. Science is not storytelling. \n \n These disciplines take hypotheses and subject them to further tests and experiments. This is how we distinguish theories that work, like evolution or gravitation. \n \n As we continue to work to improve the abysmal state of science education in our schools, we will continue to battle those who feel that knowledge is a threat to faith. \n \n But when we win minor skirmishes, as we did in Kansas, we must remember that the issue is far deeper than this. We must hold our elected school officials to certain basic standards of knowledge about the world. The battle is not against faith, but against ignorance.\n \n Lawrence M. Krauss is a professor of physics and astronomy at Case Western Reserve University.", 
   {
    "post_info": {
     "post_title": "Meanwhile, the War Against Ignorance"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1155660360.0
  ], 
  [
   227793, 
   null, 
   "Master_Shake", 
   "Praise Jesus!!!!!! emoticon_xhoho", 
   {}, 
   227756, 
   null, 
   1155679020.0
  ], 
  [
   228199, 
   null, 
   "Baphomet73", 
   "God, I'm glad I don't live in the south (AKA the land of ignorance).", 
   {}, 
   227793, 
   null, 
   1156068000.0
  ], 
  [
   228230, 
   null, 
   "daewoo", 
   "More BS on this non issue. \n \n First, the shiny new school board is not stopping the implementation of the new science standards, which are STILL wither identical to or more stringent than standards in 46 other states. Our \"definition\" of science, which is what really caused all the recent controversy, is now the same as that used in 38 states, and more stringent than that used in 9 more. \n \n There was NEVER any question of removing evolution from the curriculem\n There was NEVER any question of adding anything to the curriculem, especially anything regarding intelligent design, creationism, \"teaching the controversy\" or anything even vaugly similar.\n \n This entire \"controversy\" amounted to nothing but a massive ####### match between 2 groups of zealots who saw fit to turn our state into a battleground over a non issue. \n \n Ironically, it was the creationists, who generally are less than honest, that looked like the honest, intelligent folks in this. They pointed out from the start that the proposed changes put is in line with the VAST majority of the rest of the nation, they they still did not allow the teaching of creationism, or even the discussion of creationism.\n \n IN FACT, evolutionary coursework INCREASED under the new standards, giving us the most stringent curriculum in the country when it comes to \n evolution.\n \n The anti creationists, on the other hand, wnet around telling bald face lies, like claiming that these were significant changes, or that we were removing evolution from the curriculum, or that we were allowing creationism to be taught in the classroom.\n \n IIRC, Master Shake went to school in kansas, in the shawnee mission school district. Until recently, that was the 3rd highest rates school district in the country. Blue Valley recently took the # 3 spot, forcing Shawnee mission down to #4. Thats right, folks, we have 2 of the top five school districts in the country here in kansas. Typically our kids score in the top THREE states when it comes to science. So, please, stop this idiotic BS. \n \n Odds are, you guys would have to spend a LOT of money and overhaul your entire educational systems to make your kids as \"ignorant\" as kansas kids. I could not help but laugh when one of the folks here was caliming that some colleges may stop accepting kids from kansas due to the controversy. What was humorous was that the person in quesiton was a teacher in texas. You put texas kids test scores in science and math next to kansas kids scores, you pick the test, and you have to wonder if they even HAVE science classes in texas.\n \n This entire issue made my life a living hell as I had to field calls from parents in my district who were concerned that their kids were going to be loaded up with religous XXXX. I had to explain at least 500 times that this was all a bunch of BS and that IN FACT, there would be no actual change in the education their children were getting. It was all simply a bunch of imagined BS from people who didn't have any clue what the hell they were talking about.", 
   {}, 
   228199, 
   null, 
   1156099500.0
  ], 
  [
   228486, 
   null, 
   "JPSartre12", 
   "More BS on this non issue. \n ...................\n This entire issue made my life a living hell as I had to field calls from parents in my district who were concerned that their kids were going to be loaded up with religous XXXX. I had to explain at least 500 times that this was all a bunch of BS and that IN FACT, there would be no actual change in the education their children were getting. It was all simply a bunch of imagined BS from people who didn't have any clue what the hell they were talking about.\n\n \n Why are parents calling you? Are you on the local school board? emoticon_confused", 
   {}, 
   228230, 
   null, 
   1156290360.0
  ], 
  [
   228492, 
   null, 
   "daewoo", 
   "Why are parents calling you? Are you on the local school board? emoticon_confused\n\n \n I was. I didn't run for re-election because after getting an inside look at how our public schools worked, I decided \"screw this\". My kids will be going to a private school. \n \n This whole abortive mess as just a big PITA brought on by a bunch of XXXXXX from out of state. There was this HUGE controversy about changes to a curriculum that only about 4% of the state actually uses (in Kansas curriculum is ultimately set by the local school board), that the kids would never actually see, and the net effect of the entire change would have been the POSSIBILITY of some rewording on the statewide standardized test that our kids take...rewording that would not have materially changed the questions. It was just a big ####### match between 2 groups of absolute XXXXXX with no idea of what was going on.", 
   {}, 
   228486, 
   null, 
   1156291980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Meanwhile, the War Against Ignorance", 
  "url": "http://www.4forums.com/political/science-math-debates/8699-meanwhile-war-against-ignorance.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 8699, 
  "discussion_files": [
   [
    "24673.html", 
    "http://www.4forums.com/political/science-math-debates/8699-meanwhile-war-against-ignorance-print.html"
   ]
  ], 
  "identifier": 8699
 }
]