[
 [
  [
   228067, 
   null, 
   "in vino veritas", 
   "Nevertheless Israel lost this military confrontation with Hezbollah, I think. And first of all it's due to false estimates of the opponent by Israel the day before war. As a result of negligence Israel's army faced well-prepared and equipped guerillas joining nation's support on top of that. Nobody in Israel suspected the situation to turn this way. Look, according to official information during a month of Israel military operation it lost 150 men. But when we remember who were Israelites opponents and we will understand that Israel's death toll is understated. I think that Israel losses are more than 500 or so. \n Well, this isn't unfounded conclusion, it's based at facts. The fact is that last time Israel ally USA provoked some military conflicts and hearth of tensity in district (Afghanistan, Iraq, Georgia and Iran soon). And the result of it was that Islamites found common ground and organized experience exchanging so to say. Most part of soldiers got fighting skills in al Qaeda and Taliban camps, some part of them were trained to conduct military operations with Chechens in Georgia. But Israel just ignored the fact in hope to win in blitzkrieg and got its bitters. The war isn't smatterers' work.", 
   {
    "post_info": {
     "post_title": "Nevertheless Israel lost this military confrontation with Hezbollah"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1155915120.0
  ], 
  [
   228068, 
   null, 
   "peteratwar", 
   "Apart from pure guess work have you any evidence to support your claims re Israeli losses ?\n \n Agreed they got a tougher fight than they were properly prepared for.\n \n However, if the truce holds and the Hezbollah have to retire behind the Litani river and disarm with an internationally patrolled buffer zone in Southern Lebanon, then that more closely accords with Israeli aims than Hezbollah's", 
   {}, 
   228067, 
   null, 
   1155915540.0
  ], 
  [
   228091, 
   null, 
   "georged", 
   "Apart from pure guess work have you any evidence to support your claims re Israeli losses ?\n \n Agreed they got a tougher fight than they were properly prepared for.\n \n However, if the truce holds and the Hezbollah have to retire behind the Litani river and disarm with an internationally patrolled buffer zone in Southern Lebanon, then that more closely accords with Israeli aims than Hezbollah's\n\n \n Israel's aim was to increase support for extremists in Lebanon by Lebanese and the rest of Islam by destroying Lebanon's infrastructure and creating hundreds of thousands of homeless Lebanese? Strategically, that's winning a battle on the way to losing a war. The US considers sponsored Israeli actions successful as they refocused attention from our gross failure in Iraq during an election year. \n \n Hezbollah disarm? Surely you jest. All the US wants is for Israel to force all extremists into Syria or Iran to justify attacking either or both of those nations.", 
   {}, 
   228068, 
   null, 
   1155922800.0
  ], 
  [
   228278, 
   null, 
   "peteratwar", 
   "Israel's aims was to either destroy (highly unlikely as they clearly knew) Hezbollah or force them behind the Litani river.\n \n The agreed truce accepted this and that Hezbollah should disarm. \n \n It was part of the truce that an International force should go into Southern Lebanon and together with the Lebanese own forces keep Hezbollah out of the area and from attacking Israel.\n \n If this doesn't happen the Israelis feel free to continue the offense.\n \n The Lebanese will be aware of this.", 
   {}, 
   228091, 
   null, 
   1156153980.0
  ], 
  [
   228338, 
   null, 
   "daewoo", 
   "Israel's aims was to either destroy (highly unlikely as they clearly knew) Hezbollah or force them behind the Litani river.\n \n The agreed truce accepted this and that Hezbollah should disarm. \n \n It was part of the truce that an International force should go into Southern Lebanon and together with the Lebanese own forces keep Hezbollah out of the area and from attacking Israel.\n \n If this doesn't happen the Israelis feel free to continue the offense.\n \n The Lebanese will be aware of this.\n\n \n The labaneze have already stated that they will not disarm hezbollah. \n \n Israel lost this war. When it became apparent that they were not going to be able to accomplish any of their objectives, they let the US pull their butts out of the fire with a ceasefire that is supposed to hand them all their goals. The problem with this is that israel has agreed to it, the US has agreed to it, France has agreed to it, but lebanon and hezbollah have not agreed to it. Hezbollah is already re-arming, and the lebanese troops moving into the area are taking defensive positions that only make sense if you accept that their primary goal is to take out any israeli resources that they try to bring to bear in lebanon. \n \n Hezbollah has shown that they are perfectly capable of surviving and operating even under full attack by israel. The international community has shown itself decidedly unwilling ot commit troops to enforce a ceasefire that if anything only one side is going to be willing to implement (Israel has already violated the cease fire). \n \n It is going to be fun to watch this one play out.", 
   {}, 
   228278, 
   null, 
   1156185900.0
  ], 
  [
   228341, 
   null, 
   "jyoshu", 
   "Interesting that now it seems some peoples' standards of what it means for a side to \"lose\" a war is apparently that their enemy was able to \"survive\". In the case of Hezbollah, if that's all it takes to be \"winning\" against Israel, I'd sure hate to see what losing would be.\n \n I've noticed that everyone seems to want to reinvent the engagement into what they want it to be--that it's a win or a loss depending on who they prefer to have won or lost. \n \n But in the end, both sides lost (as is often the case with warfare). The real issue is whether the engagement was necessary to begin with.", 
   {}, 
   228338, 
   null, 
   1156190940.0
  ], 
  [
   228398, 
   null, 
   "daewoo", 
   "Interesting that now it seems some peoples' standards of what it means for a side to \"lose\" a war is apparently that their enemy was able to \"survive\". In the case of Hezbollah, if that's all it takes to be \"winning\" against Israel, I'd sure hate to see what losing would be.\n\n \n You apparently missed \"capable of surviving AND OPERATING even under full attack by israel\". In order for israel to have won this war, they would have needed to fulfill at least one of their goals. Their primary goal was to push back and cripple Hezbollahs operational capacity. They failed at this. While Hezbollah obviously lost SOME operational capacity, for the most part they forged right ahead. They spent billions of dollars (mostly of our money) and did not manage to accomplish even a single one of their operational objectives. They didn't even manage to recover their soldiers, so now they are being forced into a prisoner swap, which is what Hezbollah wanted to begin with.\n \n \nI've noticed that everyone seems to want to reinvent the engagement into what they want it to be--that it's a win or a loss depending on who they prefer to have won or lost. \n\n \n Only the Bush administration seems to be doing that. Even the isralis admit they lost. Their prime minister got up and took responsibility for the failure (though it seems like their strategic planning sucked). You have to admi that Bush looks pretty stupid standing behind a podium claiming victory for israel while on the other side of the world the Israeli prime minister is taking responsibility for the defeat. \n \n Seymour Hersh wrote an intersting article (I can dig up a link if you have not read it already) that basically claims that the Bush administration not only greenlighted the israeli operation, but helped with tactical planning. According to Hersh, the Israeli attack on lebanon was essentially a trial run for the strategy the Bushies have in mind for Iran. If that is the case, we are screwed. \n \n \nBut in the end, both sides lost (as is often the case with warfare). The real issue is whether the engagement was necessary to begin with.\n\n \n I disagree. Hezbollah is stronger, israel is weaker. Hezbollah has gained face, israel has lost it. The only people I have seen who fail to recognize the US brokered \"cease fire\" as anything but a US bailout of Israel in the face of a humilitaing defeat are thso who tend to blindly follow the Bush administraion.\n \n The really bad part for israle is that for years Iran and Syria have refused to provide hezbollah with truly advanced weapons becuase they did not think that they woudl be able to effectively utilize them. Hezbollah has certainly proven itself on that count. Look at the ship that Hezbollah took out. Either they did so with a drone that Iran either supplied or assisted them in constructing, OR they took it out with a shore to ship missle. Either way, the fact that they managed to take it down shows a high level of technical proficiency. Iran and syria are certianly goign to keep this in mind as they re-arm hezbollah.\n \n Americans shoudl keep this in mind as well. Regardless of wheter it was a missile or a drone, the fact of the matter is that it took out an israli cruiser....a ship that uses the same anti missile systems that US ships use. If they can take down an israeli ship, they can take down a US ship. Thre has been a lot of conjecture that the US should place a naval blockade on Iran. If they can get missiles inside our missile defense systems, that is a recipe for disaster,\n \n I guess I am just not seeing any downside for hezbollah, nor am I seeing any upside for israel.", 
   {}, 
   228341, 
   null, 
   1156228860.0
  ], 
  [
   228406, 
   null, 
   "peteratwar", 
   "Israeli's don't have any cruisers. It was a gunboat.\n \n The war may not have gone totally Israel's way and the resistance they met was greater than they expected. However as I recollect they seem to have been advancing at the time a cease fire was called. They weren't in any headlong retreat.\n \n I would think that the cease fire pretty much saved Hezbollah. Resistance can only go so far and Israeli's have always been quick to learn from mistakes in their planning.\n \n If this war is resumed I think you may find some differences which Hezbollah won't like.", 
   {}, 
   228398, 
   null, 
   1156240440.0
  ], 
  [
   228427, 
   null, 
   "jyoshu", 
   "I disagree. Hezbollah is stronger, israel is weaker. Hezbollah has gained face, israel has lost it. The only people I have seen who fail to recognize the US brokered \"cease fire\" as anything but a US bailout of Israel in the face of a humilitaing defeat are thso who tend to blindly follow the Bush administraion.\n \n I guess I am just not seeing any downside for hezbollah, nor am I seeing any upside for israel.\n\n \n I'm more than happy to help you see it. The real question is whether or not the facts will really make any difference to you.\n \n On balance, Israel won this round\n \n \"Their probable goal in kidnapping two Israeli soldiers in July was to cause Israel to release Lebanese and Palestinian terrorists being held in its prisons, thereby boosting Hizbullah leader Hassan Nasrallah's significance in the region. But because of the subsequent Israeli response, Hizbullah wasn't able to achieve its aim.\n \n Israel has severely battered Hizbullah's military infrastructure, though certainly not put it out of commission. Nevertheless, the organization has lost a significant number of personnel and medium-range rockets. The organization has also lost, assuming that the present UN cease-fire plan is implemented as promised, its forward deployment positions along Israel's border and, indeed, exclusive control over territory south of the Litani River.\n \n Despite being cheered by many in the Arab world for its willingness to confront Israel and its ability to make life miserable for civilians in northern Israel, Hizbullah's actions have only created greater fear among Arab leaders of Iranian attempts to create a \"Shiite Arc\" stretching through Iraq and ending on the Lebanese shores of the Mediterranean.\n \n Most important, in the coming months, Hizbullah will discover that it has alienated most of the Lebanese population, including large numbers of Lebanese Shiites, because its aggressive actions produced a harsh Israeli response that has brought the destruction of significant areas and infrastructure in Lebanon, as well as a major loss of life. Ultimately, Hizbullah will come out of this conflict considerably weakened.\"\n \n And another important point:\n \"The media may have been seduced by footage of physical destruction, statistics of war dead, declarations of defiance by Nasrallah, as well as spats among the political and military leaders in Israel, but these are not the true measure of victory.\"\n ", 
   {}, 
   228398, 
   null, 
   1156259040.0
  ], 
  [
   228437, 
   null, 
   "daewoo", 
   "Israeli's don't have any cruisers. It was a gunboat.\n\n \n Actually it was a corvette...which is israels costal cruiser.\n \n \nThe war may not have gone totally Israel's way and the resistance they met was greater than they expected. However as I recollect they seem to have been advancing at the time a cease fire was called. They weren't in any headlong retreat.\n\n \n They never managed to capture and hold enough land to have anything to retreat from. The Hezbollah resistance was not that impressive...it barely existed. They fell back in any cases into their bubnker complex, which israel never managed to make significant headway against, and they pulled offensive attacks.\n \n The strategy they were using suggests that they have certainly been paying attention for the last several years. Rather than going head to head with israeli troops, hezbollah would wait until the israelis had extended a force, and then move to isolate that force and harass (or destroy) their supply lines. This is why israel never made any serious headway. They lacked the manpower and equipment to harden supply lines for advancing troops. \n \n If Israel had still been advancing, there would have been no cease fire. Bush and Co were intent on running interference long enough to allow the IDF to do its things. The problem is that they had completely stalled. They would advance a raiding force, Hezbollah would move to intercept and isolate the detachment, which would be forced to withdraw without achieving their objective. \n \n In the past, Hezbollah has tried to meet the israeli army head on and has always been quickly crushed. When they went into this, the IDF said they needed a week to accomplish their objectives. Then it was 2 weeks, then a month. A few days before the ceasefire was agreed upon, they said \"several months\". Now there is a cease fire, and they have not accomplished a single one of their objectives. \n \n \nI would think that the cease fire pretty much saved Hezbollah. Resistance can only go so far and Israeli's have always been quick to learn from mistakes in their planning\n \n If this war is resumed I think you may find some differences which Hezbollah won't like.\n\n \n \n The IDf has been fighting the same war, using the same tactics, for years. They fight the same way the US does. We use the same tactics and the same battle plans we always have, and count on our superior equipment to make up for our lack of flair in operational planning. \n \n Resistance can only go so far? This is true. Once they kick your butt back out of their country, there is no point in going further. If you are implying that a resistance cannot beat an invading force, you might drop the Viet Cong a letter and explain that according to peteratwars reasoning, they lost the vietnam war and should immadiatly capitulate Vietnam to direct US control. The soviet union might actually be more difficult to recitfy to your (ludicrous) worldview, since the resistance in Afghnaistan not only led to the withdrawal of the Soviet troops, but did so much economic damage to the Soviet Union that it crumbled. \n \n For that matter, there are some Iraqis that you should probably give your \"resistance is futile\" lecture to, since by all accounts they have been holding thier own against a full occupation by the worlds largest and most powerful military for several years now,a nd by all accounts are gaining strength. \n \n The truth of the matter is, the last time there was a total defeat of a guerilla force in a large conflict was the boer war, and that was so expensive as to negate any gain whatsoever.", 
   {}, 
   228406, 
   null, 
   1156266360.0
  ], 
  [
   228438, 
   null, 
   "daewoo", 
   "\"Their probable goal in kidnapping two Israeli soldiers in July was to cause Israel to release Lebanese and Palestinian terrorists being held in its prisons, thereby boosting Hizbullah leader Hassan Nasrallah's significance in the region. But because of the subsequent Israeli response, Hizbullah wasn't able to achieve its aim.\n\n \n And yet they HAVE accomplished this aim. Israel has agreed to the trade that Hezbollah wanted.\n \n \nIsrael has severely battered Hizbullah's military infrastructure, though certainly not put it out of commission. Nevertheless, the organization has lost a significant number of personnel and medium-range rockets. The organization has also lost, assuming that the present UN cease-fire plan is implemented as promised, its forward deployment positions along Israel's border and, indeed, exclusive control over territory south of the Litani River.\n\n \n LOL. Even the IDF has admitted that they ere not particularly sucessful at taking out Hezbollahs rockets (this is probably because they were stashed in Hezbollahs bunkers, which our bunker busters proved unable to penetrate). They \"lost\" a large number of their rockets becuase they launched them into israel. Also, even by Israeli estimations, Hezbollahs manpower losses have not been significant. FAR more civilains have been killed than Hezbollah fighters (probably due tot he fact that Israel, on finding that they could not find hezbollah, switched to bombing infrastructure targets like airporst, roads, powrer plants, and factories).\n \n \nDespite being cheered by many in the Arab world for its willingness to confront Israel and its ability to make life miserable for civilians in northern Israel, Hizbullah's actions have only created greater fear among Arab leaders of Iranian attempts to create a \"Shiite Arc\" stretching through Iraq and ending on the Lebanese shores of the Mediterranean.\n\n \n Irrelevant\n \n \nMost important, in the coming months, Hizbullah will discover that it has alienated most of the Lebanese population, including large numbers of Lebanese Shiites, because its aggressive actions produced a harsh Israeli response that has brought the destruction of significant areas and infrastructure in Lebanon, as well as a major loss of life. Ultimately, Hizbullah will come out of this conflict considerably weakened.\"\n]\n \n Nothing at all supports this. Hezbollahs popularity is WAY up. If the next round of Lebanese elections was held tomorrow, Hezbollah would be running the place by a landslide. There is absolutly nothing to suggest that this trend will reverse\n \n And another important point:", 
   {}, 
   228427, 
   null, 
   1156266840.0
  ], 
  [
   228439, 
   null, 
   "peteratwar", 
   "Popularity is a very transient thing.\n \n On your basis Winston Churchill should have won the UK elections in 1945 which he in fact lost by a large majority.\n \n Israel has no confirmed numbers of Hezbollah fighters killed.", 
   {}, 
   228438, 
   null, 
   1156267140.0
  ], 
  [
   228451, 
   null, 
   "jyoshu", 
   "Popularity is a very transient thing.\n \n On your basis Winston Churchill should have won the UK elections in 1945 which he in fact lost by a large majority.\n \n Israel has no confirmed numbers of Hezbollah fighters killed.\n\n \n Apparently it's not going to matter to people who have fallen hook line and sinker for the idea that mere survival is tantamount to 'victory', regardless of how much destroyed military-support infrastructure, removed ability to be armed, and insurgents were killed. I honestly think that for some here, if only one single Hizballah member were left alive, they'd still have fallen for Hizballah's claim that it was a victory.\n \n Again, if this was a \"victory\" for Hizballah and Lebanon, I'd sure hate to have seen the results of what they think of as defeat.", 
   {}, 
   228439, 
   null, 
   1156272240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Nevertheless Israel lost this military confrontation with Hezbollah", 
  "url": "http://www.4forums.com/political/current-events-debates/8719-nevertheless-israel-lost-military-confrontation-hezbollah.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8719, 
  "discussion_files": [
   [
    "5534.html", 
    "http://www.4forums.com/political/current-events-debates/8719-nevertheless-israel-lost-military-confrontation-hezbollah-print.html"
   ]
  ], 
  "identifier": 8719
 }
]