[
 [
  [
   12906, 
   null, 
   "WarriorPoet", 
   "Click  here.\n \n Let's talk about it.\n \n This place is fun. :p", 
   {
    "post_info": {
     "post_title": "In Defense of Homophobia"
    }
   }, 
   null, 
   null, 
   1060386960.0
  ], 
  [
   12909, 
   null, 
   "SilentPoet", 
   "Am I suppose to challenge an essay or are you going to defend your point of views yourself?\n \n \n Always Stay Open Minded", 
   {}, 
   12906, 
   null, 
   1060388580.0
  ], 
  [
   13355, 
   null, 
   "ApathySam", 
   "It's amazing that Katz apparently thinks heterosexuals can only get AIDS by a blood transfusion from a homosexual, or by having sex with someone who had that transfusion. Hey, that way he can blame the entire disease on homosexuals. Presumably, diseases can spontaneously self-create in homosexuals, but not heterosexuals.\n \n Homophobes are not people with moral convictions against homosexuals. Homophobes are people who hate the sin AND the sinner. They freely despise homosexuals, posting lavish, unfounded, and recklessly biased statistics against them. They are a class of citizens unconcerned with facts and objectivity.\n \n True Christians are not homophobes, regardless of their positions on homosexuality.", 
   {}, 
   12906, 
   null, 
   1060934460.0
  ], 
  [
   13367, 
   null, 
   "WarriorPoet", 
   "\n Homophobes are not people with moral convictions against homosexuals. Homophobes are people who hate the sin AND the sinner. They freely despise homosexuals, posting lavish, unfounded, and recklessly biased statistics against them. They are a class of citizens unconcerned with facts and objectivity.\n \n True Christians are not homophobes, regardless of their positions on homosexuality.\n\n \n Thank you, ApathySam! I am glad someone caught part of what I felt when I read this article. Homophobia means, \"Fear of or contempt for lesbians and gay men.\" I do not fear or have contempt for gay men or lesbians, therefore I am not a homophobe. Katz defines the term as somone who does not agree with homosexuality. I do fit in that catagory, but I do NOT agree with the definition of the term homophobe as it is given by Katz. \n \n \n \n\n It's amazing that Katz apparently thinks heterosexuals can only get AIDS by a blood transfusion from a homosexual, or by having sex with someone who had that transfusion. Hey, that way he can blame the entire disease on homosexuals. Presumably, diseases can spontaneously self-create in homosexuals, but not heterosexuals.\n\n \n I didn't get that entirely from his article, though I will agree that he seemed to try to pin promiscuity almost entirely on homosexuals. However, I have to agree with his assertion that AIDS was initially rampant in homosexual men and had very little presence in heterosexuals. I don't really think that is a disputable point. I believe the majority of the spread into the heterosexual world was likely caused by bisexual men, but a certain number (how large I do not know) of cases were obviously from other sources.\n \n I also agree with the fact that there were likely many victims of this epidemic that did not contract it by sexual contact (I would not consider an intravenous drug user a victim, but a person who contracts AIDS from a contaminated blood supply is a victim). This may not have been have even been an epidemic if not for the promiscuity of most gay men. There were even cases of gay men who knew they had the disease and spread it purposefully.", 
   {}, 
   13355, 
   null, 
   1060985220.0
  ], 
  [
   13372, 
   null, 
   "ApathySam", 
   "Hi WarriorPoet,\n \n Yeah, there seems to be an automatic link between Christianity and homophobia in the minds of a great deal of the public. It bothers me a lot for a couple reasons.. it wrongfully gives Christianity a bad name, and it gives the impression that all gay activists are anti-Christian hotheads. In the end, everyone's XXXXXX. But I can only imagine how frustrating it is for actual Christians.\n \n \n \n \n \n\n However, I have to agree with his assertion that AIDS was initially rampant in homosexual men and had very little presence in heterosexuals. I don't really think that is a disputable point. I believe the majority of the spread into the heterosexual world was likely caused by bisexual men, but a certain number (how large I do not know) of cases were obviously from other sources.\n \n\n \n No, it's not a disputable point at all, it's simple historical fact. I've always wondered how it started with homosexuals... actually, I think I'll do some research on that. It originally came to America from Africa, right? But I wonder why it was so prevalent in homosexuals first.\n \n Anyway, it was this paragraph I was referring to:\n \n \n\n Unfortunately, the victims are not only those whose reckless behavior brought death on themselves. There are many completely innocent victims, too: hemophiliacs (a substantial fraction died as a result of contaminated clotting factor), recipients of contaminated transfusions, and their spouses and children, for AIDS can be transmitted heterosexually (in America, only infrequently) and congenitally. The icy road was lined with unsuspecting innocents, who never chose to ride a motorcycle. Guilt for their deaths is on the hands of the homosexuals and intravenous drug abusers who poisoned the blood supply. These people died so the sodomites could feel good about themselves.\n \n\n \n Katz is completely unwilling to put any of the blame of heterosexual AIDS cases on heterosexual promiscuity... it's almost as if he refuses to believe heterosexuals can be promiscuous at all. He discusses the above causes of AIDS in heterosexuals as if they can only come from infected blood transfusions or the spouses of those infected, and not from, oh, I don't know, unsafe sex. He seems to be implying that AIDS magically sprung out of thin air in homosexuals, and that the only way heterosexuals can get it is through direct or indirect contact with gay people.\n \n This opinion is further explained in this next paragraph:\n \n \n\n However, should a new lethal blood-borne virus arise, it will not be detected, and a test developed, until thousands of people have been infected. Experience with HIV shows that the environments of homosexual promiscuity and intravenous drug abuse can readily turn a single infection into an epidemic.\n \n\n \n This \"new disease\" will appear in the homosexual community, he says, because the \"environment\" is apparently more hospitable to lethal viruses.\n \n \n \n\n This may not have been have even been an epidemic if not for the promiscuity of most gay men. There were even cases of gay men who knew they had the disease and spread it purposefully.\n\n \n I'm not sure about that. The vast majority of AIDS cases in heterosexuals come from sex with other heterosexuals, not from contaminated blood transfusions. The mere fact that AIDS is growing so rapidly among heterosexuals -- without any help from homosexuals -- suggests that even if it hadn't started among gay men, it would've hit the general public eventually. It might've been delayed, but I'd even doubt that.\n \n If you were to go back in time and make sure the first AIDS patient is straight, and then entirely wipe out the gay community, AIDS still would've become an epidemic. It was a generally unheard of disease and we had no weapon to fight it -- we really never had a chance. AIDS was spread by promiscuity, and every group is rather vulnerable to promiscuity.\n \n As for gay men spreading it purposefully, I don't doubt that. There are also plenty of straight people who spread it purposefully. Their orientation has little to do with whatever sick mania they subsribe to. This is effectively murder, and murderers are in a group all their own.", 
   {}, 
   13367, 
   null, 
   1060997460.0
  ], 
  [
   13380, 
   null, 
   "Goturuge", 
   "http://www.gibbsmagazine.com/Where%20AIDS%20Came%20From.htm\n \n http://www.stewartsynopsis.com/death_by_blackness_files/where_did_aids_come_from.htm\n \n In a quick five minute link search, I found those two most helpful. I actaully already knew quite a bit about the theories of the origins and such, but I figured I would give out links that appear closest to what I know. I figured if I just handed out my opinion alone nobody would care much for it, so I gave a few resources, weak as they may seem.\n \n Goturuge", 
   {}, 
   13372, 
   null, 
   1061006460.0
  ], 
  [
   13381, 
   null, 
   "tuesdeb", 
   "Gotruge,\n \n I think the links you provided make alot more sense than the common \"God's punishment for homosexuality\" claim.", 
   {}, 
   13380, 
   null, 
   1061007060.0
  ], 
  [
   15605, 
   null, 
   "JakeCJB", 
   "<< However, I have to agree with his assertion that AIDS was initially rampant in homosexual men and had very little presence in heterosexuals.<<\n \n In North America and western Europe that is true. However, in Africa, where many suspect the disease originated, and where most of the cases are now, it was/is spread mostly by unprotected hetero contact.", 
   {}, 
   12906, 
   null, 
   1063730100.0
  ], 
  [
   17656, 
   null, 
   "Gader'el", 
   "I always thought that AIDS came from Heterosexual Sailors having sex with Monkey's because they couldn't keep it in their pants. Meaning that Heterosexuals started the disease...Damn straights, i hate you all...heh.", 
   {}, 
   15605, 
   null, 
   1064760840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  In Defense of Homophobia", 
  "url": "http://www.4forums.com/political/gay-rights-debates/872-defense-homophobia.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 872, 
  "discussion_files": [
   [
    "31720.html", 
    "http://www.4forums.com/political/gay-rights-debates/872-defense-homophobia-print.html"
   ]
  ], 
  "identifier": 872
 }
]