[
 [
  [
   229580, 
   null, 
   "Aivlis", 
   "I'm not sure if there have been threads on this issue or not. \n \n I was wondering what people thought about Scientology? A fairly new religion (more like cult in my mind). Are there any Scientologists on this board? \n \n I find it disturbing (like I do most religions), that people will actually choose to follow someone who from my understanding, was a sci-fi author. They decide to make all their decisions in life based on what this man tells them to do. They even have to pay to be a member, correct? There also involves something about aliens?\n \n Life is short, I want to enjoy my life. I do not want to spend my short time on this planet being controlled, I do not want someone to tell me what to do. I can be a good person without someone telling me I need to be that way. I believe that people choose to be religious because they are afraid and they need comfort. They can't trust themselves to be good people so they need something or someone to tell them how to be good and to put \"the fear of god\" into them. I think that if people did not have religion, it would force them to be better people for the sake of their own humanity....not some prize like heaven. that is how I feel.", 
   {
    "post_info": {
     "post_title": "Scientology"
    }
   }, 
   null, 
   null, 
   1156961700.0
  ], 
  [
   229607, 
   null, 
   "Judeau", 
   "The main reason I don't like Scientology is because people confuse it with Christian Science (my religion) and they label me a cultist and say I believe in aliens. Other than that, as long as they don't bother me I won't actively be against their religion.", 
   {}, 
   229580, 
   null, 
   1156969860.0
  ], 
  [
   229646, 
   null, 
   "simone", 
   "It is rumored that L Ron Hubbard, the founder of Scientology, decided to found a religion for the purposes of amassing wealth and power.\n \n He concocted the religion from a mixture of half-digested Freudian psychology, science fiction, Buddhism (he claimed to be the Buddha of the West) and a systematic and detailed way of assessing personality types, his tone scale (which may be purchased for $X at any Scientology center. However, one may take a look at an assessment of this scale at:\n \n http://en.wikipedia.org/wiki/Tone_scale\n \n You might also want to take a look at his Dianetics:\n \n http://en.wikipedia.org/wiki/Dianetics\n \n Warning, do not allow yourself to be suckered into this org, they want your money.", 
   {}, 
   229607, 
   null, 
   1156988220.0
  ], 
  [
   229663, 
   null, 
   "Aivlis", 
   "I find any religion or cult that demands money from their members to be totally bogus.", 
   {}, 
   229646, 
   null, 
   1156997160.0
  ], 
  [
   229665, 
   null, 
   "Bassman", 
   "A great read on Scientology (and the fraud that it is) is a book written by Walter R. Martin titled: Kingdom of the Cults (Christian Science also has a chapter in it)", 
   {}, 
   229663, 
   null, 
   1156997760.0
  ], 
  [
   229669, 
   null, 
   "jitobear", 
   "Cults are a trip. Not all of them are religious either. There are corporate cults. Political cults. Mary Kay has been considered by some to be a cult. It mostly has to do with your leadership and organizational structure. Creepy stuff.", 
   {}, 
   229665, 
   null, 
   1157002620.0
  ], 
  [
   229690, 
   null, 
   "simone", 
   "Christian Science is not a cult. They have a damned fine newspaper, the Christian Science Monitor.\n \n I do find Christian Scientists to be a tad stiff and starchy, but certain Lutherans are that way, too.", 
   {}, 
   229669, 
   null, 
   1157035860.0
  ], 
  [
   229692, 
   null, 
   "trebor", 
   "Christian Science is not a cult. They have a damned fine newspaper, the Christian Science Monitor.\n \n I do find Christian Scientists to be a tad stiff and starchy, but certain Lutherans are that way, too.\n\n \n \n The book Bassman references includes Jehovah Witnesses and Mormonism as cults. The book was updated by 'Ravi Zacharias', a cultist figure in his own right.", 
   {}, 
   229690, 
   null, 
   1157037060.0
  ], 
  [
   229698, 
   null, 
   "doG", 
   "I was wondering what people thought about Scientology?\n\n \n I think it's a mental disorder. The problem is that scientologists need psychiatric care but they think psychiatrists are just a bunch of quacks trying to take their money when that's what their church is doing. emoticon_xangel Ron was pretty smart when he wrote that disbelief into his religion yielding myrmidon followers afraid of getting help.", 
   {}, 
   229580, 
   null, 
   1157040240.0
  ], 
  [
   229713, 
   null, 
   "sinjin", 
   "Speaking of cults, does anyone share my feeling that chiropractors are part of a cult?", 
   {}, 
   229698, 
   null, 
   1157047620.0
  ], 
  [
   229715, 
   null, 
   "Judeau", 
   "Christian Science is not a cult. They have a damned fine newspaper, the Christian Science Monitor.\n \n I do find Christian Scientists to be a tad stiff and starchy, but certain Lutherans are that way, too.\n\n \n I appreciate the support of our newspaper Simone but you are right about the 2nd part as well. LOL There are some real stoic :xcensored in the CS religion. I had to laugh when I read that because it is so true and I hate writing \"LOL.\"", 
   {}, 
   229690, 
   null, 
   1157048160.0
  ], 
  [
   229716, 
   null, 
   "Aivlis", 
   "Speaking of messed up cults....my boyfriend (and his whole family) spent much of their lives all over the world as members of a Christian sex cult called The Family or Children of God. It was founded by David Berg in the 60's as kind of like a hippie/christian thing. Free love and sex between adults and children and sex between children was common. They probably had tens of thousands of members at their peak. If you want more information...the only place to get the real information is from ex-members (movingon.org). You can read things by ex-members, stories and experiences. You can also look at a lot of The Family's literature. Lots of pictures depicting people having sex...(masturbating to Jesus). \n \n It's pretty hard core stuff and some people might remember the young man a few years ago who killed his \"nanny\" caretaker and then committed suicide, all after he videotaped himself in his kitchen talking about his experience. That was Ricky...or \"Davidito\", the supposed heir and son of David Berg. Many children have killed themselves because of the horror and devastation that The Family has left in its wake. My own boyfriend suffers greatly from what I think could be a case of post-traumatic stress disorder. It's sad that people like this could ever call themselves Christian.", 
   {}, 
   229698, 
   null, 
   1157048460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Scientology", 
  "url": "http://www.4forums.com/political/religion-debates/8792-scientology.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8792, 
  "discussion_files": [
   [
    "11657.html", 
    "http://www.4forums.com/political/religion-debates/8792-scientology-print.html"
   ]
  ], 
  "identifier": 8792
 }
]