[
 [
  [
   229921, 
   null, 
   "Matthew S", 
   "The evangelicals don't like the public schools\n \n http://www.365gay.com/Newscon06/09/090206evangel.htm\n \n I have worked with the homeschoolers as they begin to come into the workforce. Their parents are doing them a disservice. They have no social skills, no work ethic, are then shocked that people have different opinions about subjects ranging from religion to sex. The homeschoolers are raising children who are not prepared for the world they have to face as adults. You all may argue with me but I have seen this first hand with every homeschooler I have come into contract with. Further more these evangelicals are cowards instead of staying with the public schools and making them better they run off into their own sheltered secluded little worlds.", 
   {
    "post_info": {
     "post_title": "Evangelicals Pulling Kids Out Of Schools"
    }
   }, 
   null, 
   null, 
   1157285820.0
  ], 
  [
   229928, 
   null, 
   "georged", 
   "The evangelicals don't like the public schools\n \n http://www.365gay.com/Newscon06/09/090206evangel.htm\n \n I have worked with the homeschoolers as they begin to come into the workforce. Their parents are doing them a disservice. They have no social skills, no work ethic, are then shocked that people have different opinions about subjects ranging from religion to sex. The homeschoolers are raising children who are not prepared for the world they have to face as adults. You all may argue with me but I have seen this first hand with every homeschooler I have come into contract with. Further more these evangelicals are cowards instead of staying with the public schools and making them better they run off into their own sheltered secluded little worlds.\n\n \n In the case of evangelicals homeschooling their children I'd think a lack of reality would be the result considering the home life structure and parts of education being based on mythology.", 
   {}, 
   229921, 
   null, 
   1157295360.0
  ], 
  [
   229943, 
   null, 
   "foundit66", 
   "\"Homeschoolers avoid harmful school environments where God is mocked, where destructive peer influence is the norm, where drugs, alcohol, promiscuity and homosexuality are promoted,\" says the California-based Considering Homeschooling Ministry.\n\n \n 1) drugs and alcohol:\n Yeah. I always thought it was a strange Republican shift how they went from Nancy Reagan's \"Don't Do Drugs\" to Laura Bush's \"A needle in each arm, and a flask of Jim Beam in your back pocket.\" as the message in our schools.\n < end sarcasm <\n \n Some kids do engage in drugs and alcohol.\n Some do not.\n Isn't it better to teach your kids how to resist them while they are in high school?\n Or is the better option to have your kids completely under your watchful eye, excluding all temptation, and then send them off to college where the temptation is even greater?\n \n 2) promiscuity:\n Actually, recent trends have shown that kids are shifting more towards a less promiscuous, more abstinence environment.\n \n 3) homosexuality:\n Oh give me a freakin' break. This just reeks of the historical XXXX where white parents would pull their kids out of schools instead of allowing them to go to school with black kids.\n Just because schools don't allow condemnation of homosexuality, and refuse to give in to prejudice against homosexuality, doesn't equate to \"promotion\" of homosexuality.\n \n ----------------------------------------------------------\n \n And on another note, how does \"home-schooling\" work in conjunction with any future in colleges?\n \n 1) Do home-schoolers have any hope at scholarships for grades or extra-curricular sports?\n I would imagine that a home-schooled kid might have an argument for getting a recruiter to look at him in some league, but the \"grades\" aspect seems effectively negated.\n \n 2) What the heck do they fill in for \"grade\" if they were home schooled on college applications? Mommy gave me all A's?", 
   {}, 
   229928, 
   null, 
   1157322840.0
  ], 
  [
   229951, 
   null, 
   "Joe@actsii", 
   "The evangelicals don't like the public schools\n \n http://www.365gay.com/Newscon06/09/090206evangel.htm\n \n I have worked with the homeschoolers as they begin to come into the workforce. Their parents are doing them a disservice. They have no social skills, no work ethic, are then shocked that people have different opinions about subjects ranging from religion to sex. The homeschoolers are raising children who are not prepared for the world they have to face as adults. You all may argue with me but I have seen this first hand with every homeschooler I have come into contract with. Further more these evangelicals are cowards instead of staying with the public schools and making them better they run off into their own sheltered secluded little worlds.\n\n \n \n Well it sounds like you have meet some bad examples. The kids from my church who are homeschooled have great social skills and actually act 5 - 10 years older then they are. Don't get me wrong, they are still teens and like to do things that teens like, but they are a great deal more responsible as well as being hard workers. My wife and I plan on homeschooling our daughter, she is 15 months now, but we look forward to her growing and learning. My wife has been public schooled, private schooled & homeschooled. I have been public & private schooled. My wife enjoyed homeschooling the most and I wish I had the chance. I went through 4 years of public high school and learned/was taught very little. It was only after I became a Christian and finished high school that I developed a love for learning. \n \n Also my wife and I are not going to try to make the public school system better at the expense of our daughters education, mind, heart & soul. :xbanghead We have a couple in our church who homeschool there kids. The interesting thing is that he is a public school teacher with a Master's Degree & a Bachelors Degree. His wife has an Associates Degree. There oldest child had no problem getting into college. My pastors son was taking college courses when he was 17. He also had no problem getting into college. He is in his 2nd year as a full time student.", 
   {
    "unicode_changes_made": true
   }, 
   229921, 
   null, 
   1157344620.0
  ], 
  [
   229960, 
   null, 
   "Matthew S", 
   "Well it sounds like you have meet some bad examples. The kids from my church who are homeschooled have great social skills and actually act 5 &#8211; 10 years older then they are. Don&#8217;t get me wrong, they are still teens and like to do things that teens like, but they are a great deal more responsible as well as being hard workers. My wife and I plan on homeschooling our daughter, she is 15 months now, but we look forward to her growing and learning. My wife has been public schooled, private schooled & homeschooled. I have been public & private schooled. My wife enjoyed homeschooling the most and I wish I had the chance. I went through 4 years of public high school and learned/was taught very little. It was only after I became a Christian and finished high school that I developed a love for learning. \n \n Also my wife and I are not going to try to make the public school system better at the expense of our daughters education, mind, heart & soul. :xbanghead We have a couple in our church who homeschool there kids. The interesting thing is that he is a public school teacher with a Master&#8217;s Degree & a Bachelors Degree. His wife has an Associates Degree. There oldest child had no problem getting into college. My pastors son was taking college courses when he was 17. He also had no problem getting into college. He is in his 2nd year as a full time student.\n\n \n \n You don't understand do you? As I have stated EVERY ONE of these kids I have met has been screwed up and live in a dream world.", 
   {}, 
   229951, 
   null, 
   1157360520.0
  ], 
  [
   229986, 
   null, 
   "Joe@actsii", 
   "You don't understand do you? As I have stated EVERY ONE of these kids I have met has been screwed up and live in a dream world.\n\n \n What I am saying is that in my experance that is not the case. I don't believe that is the norm. I know it happens, but it is not the norm.", 
   {}, 
   229960, 
   null, 
   1157383440.0
  ], 
  [
   229987, 
   null, 
   "georged", 
   "What I am saying is that in my experance that is not the case. I don't believe that is the norm. I know it happens, but it is not the norm.\n\n \n You post makes it quite clear you conduct your life in a structured Christian environment. Would your viewpoint of normal not be constricted by that circumstance as versus the norm for general society?", 
   {}, 
   229986, 
   null, 
   1157384640.0
  ], 
  [
   229998, 
   null, 
   "Steeeeve", 
   "You post makes it quite clear you conduct your life in a structured Christian environment. Would your viewpoint of normal not be constricted by that circumstance as versus the norm for general society?\n\n \n No more than how anyone elses viewpoint is constricted by their own circumstances. I could just as easily say that your hatred towards christians skews your viewpoint.", 
   {}, 
   229987, 
   null, 
   1157390940.0
  ], 
  [
   230001, 
   null, 
   "georged", 
   "Few people can be bothered with generating the emotion hatred for a level of intellectualism confined by an antiquated, mythical belief system. I'm not one of those individuals. I do not use the word hatred in conjunction with Christianity, nor do I hate Christianity, so please leave your personal baggage at home instead of bringing it to a public forum.", 
   {}, 
   229998, 
   null, 
   1157393640.0
  ], 
  [
   230005, 
   null, 
   "Joe@actsii", 
   "You post makes it quite clear you conduct your life in a structured Christian environment. Would your viewpoint of normal not be constricted by that circumstance as versus the norm for general society?\n\n \n No I think that my view is based on the facts and the way that things are. As far as living in a \"structured Christian environment\", I assure you I don't live a sheltered life. I have spent less then half of my life as a Christian. I work in a secular where most people are not Christian or religious for that matter. Of those that are religious, they include Catholics, various denominations of Christian, Agnostics & Hindus. I also work with lesbians & gays as well as atheists. I would also add that 80-90% of the people I work with have a different political view then me. These people include some pot heads, party animals, unmarried couples. I count all of them as my friends. \n \n I am also very well informed on the different sides of the issues. I am willing to bet more opened minded then most on this board. Not only do I listen to teaching/preaching from my own church, but also from many others that are not my denomination. I listen to college courses on CD from the library. These are not Christian courses, but cover subjects such as Islam, Judaism, Catholicism, feminism, philosophy, ethics, evolution & many others. I also listen many audio books including those written by people that hold different views then I do on history, politics & religion. I work full time, go to college 3/4 full time as well as being very active in my local church. On top of this I have ADHD, which makes it a lot harder for me to learn things. Some of the above mentioned college CD's and audio books I have to listen to multiple times to let them sink in. \n \n I try very hard to have an honest, open, educated life.", 
   {
    "unicode_changes_made": true
   }, 
   229987, 
   null, 
   1157394960.0
  ], 
  [
   230007, 
   null, 
   "Steeeeve", 
   "Few people can be bothered with generating the emotion hatred for a level of intellectualism confined by an antiquated, mythical belief system. I'm not one of those individuals. I do not use the word hatred in conjunction with Christianity, nor do I hate Christianity, so please leave your personal baggage at home instead of bringing it to a public forum.\n\n \n Appears I hit a nerve? I don't know why you put in the \"personal baggage\" line...but ok. As for you not using the word \"hatred\"...I admit you didn't, I did. If you say you don't then I'll take your word for it but your posts on these forums seem to make me think otherwise.", 
   {}, 
   230001, 
   null, 
   1157395380.0
  ], 
  [
   230013, 
   null, 
   "jitobear", 
   "I see nothing woring with home schooling as long as you have the skills for it, you meet your states required standards, and as long as your child has other places to learn social skills.\n \n Personally - I prefer my kid to be part of the real world and I don't feel compelled to shelter him from ideas I do not agree with (as seems to be the motivation with some home-schoolers). I have never been a huge advocate for censoring or sheltering - period. Plus I would go nuts and have a job to go to.", 
   {}, 
   230007, 
   null, 
   1157396880.0
  ], 
  [
   230016, 
   null, 
   "Joe@actsii", 
   "I see nothing woring with home schooling as long as you have the skills for it, you meet your states required standards, and as long as your child has other places to learn social skills.\n \n Personally - I prefer my kid to be part of the real world and I don't feel compelled to shelter him from ideas I do not agree with (as seems to be the motivation with some home-schoolers). I have never been a huge advocate for censoring or sheltering - period. Plus I would go nuts and have a job to go to.\n\n \n You are right, some people don't have the skills to homeschool. I have to take offense when you say \"be part of the real world and I don't feel compelled to shelter him from ideas I do not agree with\" Homeschooled kids are still part of the real world, last I checked they did not teleport into a different dimension or to the twilight zone. They are being taught at home, not becoming part of the Quantum Leap show. For my wife and I it is not a matter of sheltering our daughter form ideas, but keeping her from being poisoned be much of the garbage that is forced on them in public schools.", 
   {
    "unicode_changes_made": true
   }, 
   230013, 
   null, 
   1157397540.0
  ], 
  [
   230018, 
   null, 
   "georged", 
   "No I think that my view is based on the facts and the way that things are. As far as living in a \"structured Christian environment\", I assure you I don't live a sheltered life. I have spent less then half of my life as a Christian. I work in a secular where most people are not Christian or religious for that matter. Of those that are religious, they include Catholics, various denominations of Christian, Agnostics & Hindus. I also work with lesbians & gays as well as atheists. I would also add that 80-90% of the people I work with have a different political view then me. These people include some pot heads, party animals, unmarried couples. I count all of them as my friends. \n \n I am also very well informed on the different sides of the issues. I am willing to bet more opened minded then most on this board. Not only do I listen to teaching/preaching from my own church, but also from many others that are not my denomination. I listen to college courses on CD from the library. These are not Christian courses, but cover subjects such as Islam, Judaism, Catholicism, feminism, philosophy, ethics, evolution & many others. I also listen many audio books including those written by people that hold different views then I do on history, politics & religion. I work full time, go to college 3/4 full time as well as being very active in my local church. On top of this I have ADHD, which makes it a lot harder for me to learn things. Some of the above mentioned college CD's and audio books I have to listen to multiple times to let them sink in. \n \n I try very hard to have an honest, open, educated life.\n\n \n Sounds like an honest opinion. I asked the question because I'm out of the work force and what I hear from friends and acquaintances regarding general employee evaluation is normally centered around performance based on seasoned and traveled employees, not those entering the work force as described by Matthew. In those instances I'm familiar with education, primarily undergrad and grad schooling achieved at recognized universities, is less important than ability, attitude and social adaptability because that education is in place. \n \n Considering the thread topic I wondered how those devoted to evangelistic principles and raised with those values would fare in the professional world where social adaptability is a key issue in doing business in the private sector. From what I can determine from posters on forums, there's no half-way for true evangelicals. When considering a home-schooled evangelical who has been raised and educated within that belief system to age 18 or so and entering the work force, I would have to agree with Matthew that for most it would take some individuality (not stressed in their upbringing and home-schooled education) to cope within the reality of general society without their peer group support. A square peg in a round hole.", 
   {
    "unicode_changes_made": true
   }, 
   230005, 
   null, 
   1157397960.0
  ], 
  [
   230031, 
   null, 
   "Matthew S", 
   "Sounds like an honest opinion. I asked the question because I'm out of the work force and what I hear from friends and acquaintances regarding general employee evaluation is normally centered around performance based on seasoned and traveled employees, not those entering the work force as described by Matthew. In those instances I'm familiar with education, primarily undergrad and grad schooling achieved at recognized universities, is less important than ability, attitude and social adaptability because that education is in place. \n \n Considering the thread topic I wondered how those devoted to evangelistic principles and raised with those values would fare in the professional world where social adaptability is a key issue in doing business in the private sector. From what I can determine from posters on forums, there's no half-way for true evangelicals. When considering a home-schooled evangelical who has been raised and educated within that belief system to age 18 or so and entering the work force, I would have to agree with Matthew that for most it would take some individuality (not stressed in their upbringing and home-schooled education) to cope within the reality of general society without their peer group support. A square peg in a round hole.\n\n \n \n Exactly. \n \n What happens to these children as they enter the work force and are disciplined for using thier prejudice against fellow gay, and other workers, that do not share the beliefs that they were raised with. They will not understand that companies will not tolerate harrassment of any kind.", 
   {}, 
   230018, 
   null, 
   1157408940.0
  ], 
  [
   230034, 
   null, 
   "jitobear", 
   "You are right, some people don't have the skills to homeschool. I have to take offense when you say \"be part of the real world and I don't feel compelled to shelter him from ideas I do not agree with\" Homeschooled kids are still part of the real world, last I checked they did not teleport into a different dimension or to the twilight zone. They are being taught at home, not becoming part of the Quantum Leap show. For my wife and I it is not a matter of sheltering our daughter form ideas, but keeping her from being poisoned be much of the garbage that is forced on them in public schools.\n\n \n I am not trying to be offensive but just what is what I have bolded above if not sheltering her from ideas you do not agree with? What are you defining as \"garbage\"? \n \n What I mean by the \"real world\" is that we all have deal with \"garbage\"; offensive ideas, nasty people, and stuff we do not agree with eventually in life. (I have to every time some proselitizer or most Republicans come to my door.) If my kid comes home from school having experienced or learned a thing that he or I do not like or agree with - I tell him how I see it, and we move on. Such is life. The world will not and should not be designed to fit me only.", 
   {
    "unicode_changes_made": true
   }, 
   230016, 
   null, 
   1157411700.0
  ], 
  [
   230047, 
   null, 
   "jyoshu", 
   "First, I wonder what the heck Gay365 is so worried about the fact that some evangelicals happen to homeschool. And what they would possibly do about it if they could.\n \n Second, it's interesting to me that on one hand people are constantly saying how much the US lags behind in education, but then when parents opt to avoid that lagging educational system and give a more individualized education away from the distractions of fights, apathetic poorly paid teachers, and being away from the support of family, they seem to think these parents are doing a disservice to their kids. \n \n Considering that one of the public schools in my city recently went through their weekly lockdown because of a fight involving over 200 students, I can certainly understand why some opt for homeschooling. A lot of public schools these days are more like prisons than schools. \n \n Homeschooling is not always because parents are avoiding secular teaching.", 
   {}, 
   230034, 
   null, 
   1157431740.0
  ], 
  [
   230086, 
   null, 
   "foundit66", 
   "Personally - I prefer my kid to be part of the real world and I don't feel compelled to shelter him from ideas I do not agree with (as seems to be the motivation with some home-schoolers). I have never been a huge advocate for censoring or sheltering - period. Plus I would go nuts and have a job to go to.\n\n \n I went to a very small grade school (five people in my grade), and then went to what would be considered by most as a small high school (about 75 in my graduating class).\n \n It was an eye-opener on the issue of being part of the \"real world\" and interacting with a variety of different types of people.\n \n If \"Evangelicals\" are pulling their kids out of schools because they don't like the social issues in schools, then I seriously pity these kids. I would hope that they would do something else besides \"home-schooling\" like sending them to a parochial school or something so they wouldn't be sheltered from peer interaction.\n \n If they are home-schooling out of an interest of sheltering them from certain elements like peer pressure, then they are possibly doing their kids a disservice, IMO. These kids are going to grow up, and they won't have any experience fighting off these \"temptations\" if they are sheltered.\n \n I would be curious as to how home-schooled kids interact and react to college issues (on average). College is often the first big grab at \"independence\", and some kids run amuck with the independence, and some don't.", 
   {}, 
   230013, 
   null, 
   1157482200.0
  ], 
  [
   230090, 
   null, 
   "foundit66", 
   "First, I wonder what the heck Gay365 is so worried about the fact that some evangelicals happen to homeschool.\n\n How many times have the \"evangelicals\" been \"so worried\" about what gay kids and gay parents are doing???\n Do you ever wonder why the \"family\" groups are \"so worried\" about them for when they report endlessly on their actions?\n \n \n \nAnd what they would possibly do about it if they could.\n\n Well, there have been a variety of posters here who have commented on this issue. I don't recall anybody talking about legislation or anything to \"do\" something \"about it\".\n Typically, it's the anti-gay who are \"doing\" something \"about\" the gays. Not so much vice versa...\n \n Quite frankly, the evangelicals have shown that they want to prevent gay / straight alliance clubs.\n They want to prevent gay adoption. They want to prevent any sign of acknowledging gay couples or parenting in our schools.\n \n I don't see anything on par with that from the gay side of things ...\n I, for one, would do nothing if I could \"possibly do\" something \"about it if I could\"...\n Does that surprise you?\n \n \n \nSecond, it's interesting to me that on one hand people are constantly saying how much the US lags behind in education, but then when parents opt to avoid that lagging educational system and give a more individualized education away from the distractions of fights, apathetic poorly paid teachers, and being away from the support of family, they seem to think these parents are doing a disservice to their kids.\n\n 1) There have been a variety of posts on the SPECIFIC WAYS that parents are doing a disservice to their kids, yet you back-handedly attack those arguments WITHOUT EVEN DISCUSSING their specific complaints.\n 2) Some recent evangelical statements have made it clear that they think rising home-schooling is due to the \"social\" issues in schools which they disapprove of.\n Are they wrong?\n \n \n \nHomeschooling is not always because parents are avoiding secular teaching.\n\n No. Not always...\n But if you listen the evangelicals, they seem to want to push \"secular teaching\" as the major reason...", 
   {}, 
   230047, 
   null, 
   1157482740.0
  ], 
  [
   230103, 
   null, 
   "jyoshu", 
   "Well, there have been a variety of posters here who have commented on this issue. I don't recall anybody talking about legislation or anything to \"do\" something \"about it\".\n\n \n So in other words, the gay365 article was just complaining with no intent to do anything about it. If they have no such intent, then they must not think it to be such a major problem after all. Thanks for clearing that up.\n \n \n1) There have been a variety of posts on the SPECIFIC WAYS that parents are doing a disservice to their kids, yet you back-handedly attack those arguments WITHOUT EVEN DISCUSSING their specific complaints.\n 2) Some recent evangelical statements have made it clear that they think rising home-schooling is due to the \"social\" issues in schools which they disapprove of.\n Are they wrong?\n\n \n Well, I think it's important to note that, while I know a number of evangelical families that homeschool, none of them do so based on one issue. I don't think there are many evangelicals who choose on the basis on these issues alone. I know of NO ONE that does that. They may indeed not believe gay/straight alliances are the best thing for kids, but that's only one reason. They also do it for the reasons I gave. These people don't just sit there and make some knee-jerk descision by saying \"oh, they accept gays so I'm not sending my kids there.\" A LOT of factors go into it, including the safety of the school, how well the teachers tend to do there, etc. It's true that their religious beliefs factor in (the gay issue) but I don't know any evangelical homeschooling family that bases their decision just on that. In fact, I know families that considered homeschooling and decided to try public schools despite their concerns about the acceptance of homosexuality.\n \n \nNo. Not always...\n But if you listen the evangelicals, they seem to want to push \"secular teaching\" as the major reason...\n\n \n That's because that secular teaching has become the vehicle for social awareness movements to try and teach kids values instead of straightforward education.\n \n These parents prefer to be the one to teach their kids values, not the school system. And I don't blame them one bit. That's what parents are supposed to do. Your problem is that you just happen to not like the particular values these parents teach, and think the kids should be getting the particular values you prefer.", 
   {}, 
   230090, 
   null, 
   1157494740.0
  ], 
  [
   230105, 
   null, 
   "jitobear", 
   "They may indeed not believe gay/straight alliances are the best thing for kids, but that's only one reason. \n \n It's true that their religious beliefs factor in (the gay issue) but I don't know any evangelical homeschooling family that bases their decision just on that. In fact, I know families that considered homeschooling and decided to try public schools despite their concerns about the acceptance of homosexuality.\n\n \n What I ponder here is just what these families expect the public schools to do? There are gay people. Gay students. And kids with gay parents. What is their solution - allow discrimination, don't allow these people access to the public schools? The schools have to provide a tolerant environment. The same one that allows for evangelicals to go to school without harassment and discrimination. (Granted - I know this perfect world does not exist and many people get harassed - but the rules are in place for it.)\n \n \nYour problem is that you just happen to not like the particular values these parents teach, and think the kids should be getting the particular values you prefer.\n\n \n And Evangelicals don't want to force their values? At least Georged's and my values are inclusive. \n \n But Matthew earlier brings up a good point. What about that world out there - colleges and jobs and even entire states that don't allow discrimination on the basis of sexual orientation? Someday they will have to deal with gay people and may even have to treat them well or end up in jail or fired.\n \n If the fact that there is an accepting environment for gays is even part of why they are pulling their kids from public schools - its a poor reason. And not a wise parenting choice in my estimation.\n \n Heck - my kid goes to school with LOTS of Christians, I have yet to pull him out.", 
   {}, 
   230103, 
   null, 
   1157496960.0
  ], 
  [
   230106, 
   null, 
   "jyoshu", 
   "What I ponder here is just what these families expect the public schools to do? There are gay people. Gay students. And kids with gay parents. What is their solution - allow discrimination, don't allow these people access to the public schools? The schools have to provide a tolerant environment. The same one that allows for evangelicals to go to school without harassment and discrimination. (Granted - I know this perfect world does not exist and many people get harassed - but the rules are in place for it.)\n\n \n The fact that they are not putting their kids in public schools should be a comforting thing to you because they are withdrawing instead of trying to change it. You are addressing things such as solutions of allowing discrimination in public schools, but these parents are avoiding putting the schools in such a predicament--they're letting the public schools be, by withdrawing.\n \n \nAnd Evangelicals don't want to force their values? At least Georged's and my values are inclusive. \n\n \n I've said this before, but believe it or not, evagelicals are a huge, extremely broad and varied group, and by no means is any one particular issue or tendency a unifying factor. I have no doubt, for instance, that there are evangelicals out there even more tolerant than you are.\n \n \nBut Matthew earlier brings up a good point. What about that world out there - colleges and jobs and even entire states that don't allow discrimination on the basis of sexual orientation? Someday they will have to deal with gay people and may even have to treat them well or end up in jail or fired.\n\n \n What I know is, I know several evangelical families that homschooled all the way through high school, and their kids dealt with it just fine, and are well aware there are gay people and treat them with respect. They haven't gone to jail or gotten fired. The problem here is that you are erroneously assuming these families are incapable of teaching a general respect of people regardless of disagreement or seeing things differently.", 
   {}, 
   230105, 
   null, 
   1157497860.0
  ], 
  [
   230116, 
   null, 
   "foundit66", 
   "So in other words, the gay365 article was just complaining with no intent to do anything about it. If they have no such intent, then they must not think it to be such a major problem after all. Thanks for clearing that up.\n\n Why do you think that something has to be a \"major problem\" before a news source reports it???\n \n At times, you make assumptions that just boggle the mind.\n \n In 2004, news sources reported that George Bush won the election. I guess they all thought it was a \"major problem\" that they all \"had to do something about\" then, eh???\n emoticon_wow \n \n \n \nWell, I think it's important to note that, while I know a number of evangelical families that homeschool, none of them do so based on one issue. I don't think there are many evangelicals who choose on the basis on these issues alone. I know of NO ONE that does that. They may indeed not believe gay/straight alliances are the best thing for kids, but that's only one reason. They also do it for the reasons I gave. These people don't just sit there and make some knee-jerk descision by saying \"oh, they accept gays so I'm not sending my kids there.\"\n\n So you're saying the evangelicals are wrong then? Just full of hot air are they?\n \n Well, I guess that settles that then.\n < end sarcasm <\n \n For the record Jyoshu, nobody was claiming that there was only \"one issue\".\n The article doesn't even say that. In fact, the article admits there are MULTIPLE issues.\n \n As you often do, you are again arguing something that nobody is objecting to...\n \n \n \nThat's because that secular teaching has become the vehicle for social awareness movements to try and teach kids values instead of straightforward education.\n\n Yeah. Values like \"prayer in school\" emoticon_wow \n Whoops! I guess it's not so much the \"teaching kids values\" that the evangelicals are objecting to, but rather objecting to the fact that it's not THEIR CHRISTIAN RELIGIOUS values which are being taught, eh...\n \n \n \nThese parents prefer to be the one to teach their kids values, not the school system. And I don't blame them one bit. That's what parents are supposed to do. Your problem is that you just happen to not like the particular values these parents teach, and think the kids should be getting the particular values you prefer.\n\n Jyoshu, you often prove that you haven't a clue what gay people are like, or what they think.\n Your allegation here regarding what I \"think\" is one perfect example.\n I may not like the \"particular values\" that these parents teach with regards to prejudice towards homosexuality, but I feel that the schools should be NEUTRAL towards homosexuals. DEVOID of \"values\" on homosexuality, and rather just teaching the FACTS regarding the issue.\n \n And I don't think ANY kids should be getting a \"value\" taught at school that their parent objects to.", 
   {}, 
   230103, 
   null, 
   1157503920.0
  ], 
  [
   230119, 
   null, 
   "jyoshu", 
   "Why do you think that something has to be a \"major problem\" before a news source reports it???\n\n \n When I saw the 1st post and the article, I was thinking \"why the heck is a gay media service even reporting on homeschooling when it's not a gay issue\"? I STILL don't see what's particularly newsworthy AT ALL here.\n \n \nFor the record Jyoshu, nobody was claiming that there was only \"one issue\". The article doesn't even say that. In fact, the article admits there are MULTIPLE issues.\n\n \n Odd since gay365 is a gay-based news service. If they admit there are multiple issues, then what's their problem with it? Better yet, what's YOUR problem with it?\n \n \nWhoops! I guess it's not so much the \"teaching kids values\" that the evangelicals are objecting to, but rather objecting to the fact that it's not THEIR CHRISTIAN RELIGIOUS values which are being taught, eh...\n\n \n Either way, they can do what they want. At least these parents are taking responsibility for their kids' values instead of leaving it up to schools.\n \n \nAnd I don't think ANY kids should be getting a \"value\" taught at school that their parent objects to.\n\n \n Then what's the problem? By that statement I would assume you're fine with these evangelicals homeschooling instead of sending them to public schools.", 
   {}, 
   230116, 
   null, 
   1157505660.0
  ], 
  [
   230121, 
   null, 
   "jitobear", 
   "The fact that they are not putting their kids in public schools should be a comforting thing to you because they are withdrawing instead of trying to change it. You are addressing things such as solutions of allowing discrimination in public schools, but these parents are avoiding putting the schools in such a predicament--they're letting the public schools be, by withdrawing.\n\n \n Comforting? Why? I already stated that I feel no need to remove my kid from ideas that I disagree with. If he were being taught at school that gays are evil I would tell him that they were wrong. End of story. And frankly I could care less if these folks tie their kids to a tree and fed them dog biscuits. \n \n \nI've said this before, but believe it or not, evagelicals are a huge, extremely broad and varied group, and by no means is any one particular issue or tendency a unifying factor. I have no doubt, for instance, that there are evangelicals out there even more tolerant than you are.\n\n \n Unquestionably they are varied. In this thread I am mocking stupid parents who need to shelter their kids from catching \"gay\". \n \n \nWhat I know is, I know several evangelical families that homschooled all the way through high school, and their kids dealt with it just fine, and are well aware there are gay people and treat them with respect. They haven't gone to jail or gotten fired. The problem here is that you are erroneously assuming these families are incapable of teaching a general respect of people regardless of disagreement or seeing things differently.\n\n \n Call me whacky - but my son's dad is gay and I don't consider people who pull their kids out of school because they erroneously think my family is bad as repectful. I find them to be ***holes.", 
   {}, 
   230106, 
   null, 
   1157507460.0
  ], 
  [
   230122, 
   null, 
   "foundit66", 
   "When I saw the 1st post and the article, I was thinking \"why the heck is a gay media service even reporting on homeschooling when it's not a gay issue\"? I STILL don't see what's particularly newsworthy AT ALL here.\n\n It's \"newsworthy\" in a gay news service because the evangelicals are claiming that gays are part of the reason people are leaving the public schools and shifting towards \"home-schooling\".\n And to your follow-on comment, just because they claim it isn't the SOLE reason doesn't make it any less of a newsworthy issue...\n Got it?\n \n \n \nOdd since gay365 is a gay-based news service. If they admit there are multiple issues, then what's their problem with it? Better yet, what's YOUR problem with it?\n\n Better question would be what's YOUR problem with assuming that a gay news service has to report on a \"problem\"...\n You keep asking about them and their perception of this \"problem\"...\n ... but you don't seem to realize that YOU are the driving force for trying to categorize it as a \"problem\" in their eyes.\n \n As for my OPINION on the matter, read my posts.\n I lack the patience to repeat myself for you...\n \n \n \nEither way, they can do what they want. At least these parents are taking responsibility for their kids' values instead of leaving it up to schools.\n\n 1) Nobody is saying that they can't do what they want with regards to homeschooling.\n 2) Quite frankly, your last statement is rather disturbing. Parents who have their kids in school can and do become involved in their kids' values. That's how it is in my family for my parents -< brothers/sisters, and also for my sisters -< their kids.\n It's not an either or situation, however some parents are disturbingly uninvolved. That happens on BOTH sides of the ideology fence...\n Quite frankly, I find it more disturbing how some parents insist that the things that they object to be COMPLETELY ABSENT so they don't have to talk to their kids about some of these things...\n For parents who pull their kids out because they don't like discussion on sex, I wonder how many of them actually discuss sex with their kids. For parents who pull their kids out because they don't like peer pressure on drugs or alcohol, I wonder how many of them actually discuss drugs and alcohol with their kids.\n Quite frankly, the vast majority of the kids I knew in high school who had parents who talked loudly about these issues to squash their discussion in schools also never talked to their own kids about the issue...\n \n \n \nThen what's the problem? By that statement I would assume you're fine with these evangelicals homeschooling instead of sending them to public schools.\n\n 1) It is their right to send their kids to homeschool instead of public schools.\n 2) The potential issues and concerns have been discussed throughout this thread. I would recommend you read the other posts if you are truly interested...", 
   {}, 
   230119, 
   null, 
   1157507820.0
  ], 
  [
   230126, 
   null, 
   "Joe@actsii", 
   "You can have totally different world views on a subject such as homosexuality or Christianity and still get along with and respect people that disagree with you. I am a Christian and into politics, I live in Massachusetts and disagree with many things in the school systems as well as the issue of same-sex marriage. Does that mean I hate homosexuals or that I want them to be persecuted? NO WAY! I have friends that are homosexual/lesbian, I work with them everyday (at least every work day). I am friends with not only them, but with there partners to. My wife and I have had them over for dinner. We talk about family, religion, politics & current events. We don't agree on everything, but we do get along and respect each other. They know how I feel about there lifestyles, but that does not change how I feel about them. I have gone out of my way to help them at work when something was said about them falsely. There lifestyle has nothing to do with it. If anyone does a crime against them or is even treats them badly, I don't think it is right. One of my lesbian coworkers is very smart and into nature. She raises honey bees. She is going to help us home school our daughter about nature and insects when the time comes.", 
   {
    "unicode_changes_made": true
   }, 
   230122, 
   null, 
   1157517000.0
  ], 
  [
   230168, 
   null, 
   "jyoshu", 
   "You can have totally different world views on a subject such as homosexuality or Christianity and still get along with and respect people that disagree with you. I am a Christian and into politics, I live in Massachusetts and disagree with many things in the school systems as well as the issue of same-sex marriage. Does that mean I hate homosexuals or that I want them to be persecuted? NO WAY! I have friends that are homosexual/lesbian, I work with them everyday (at least every work day). I am friends with not only them, but with there partners to. My wife and I have had them over for dinner. We talk about family, religion, politics & current events. We don't agree on everything, but we do get along and respect each other. They know how I feel about there lifestyles, but that does not change how I feel about them. I have gone out of my way to help them at work when something was said about them falsely. There lifestyle has nothing to do with it. If anyone does a crime against them or is even treats them badly, I don't think it is right. One of my lesbian coworkers is very smart and into nature. She raises honey bees. She is going to help us home school our daughter about nature and insects when the time comes.\n\n \n Right on! The \"concern\" that a different view about homosexuality means they'll somehow be incapable to function in the world or respect people nonetheless is the most ridiculous thing I've heard in awhile.", 
   {
    "unicode_changes_made": true
   }, 
   230126, 
   null, 
   1157569620.0
  ], 
  [
   230178, 
   null, 
   "foundit66", 
   "Right on! The \"concern\" that a different view about homosexuality means they'll somehow be incapable to function in the world or respect people nonetheless is the most ridiculous thing I've heard in awhile.\n\n \n As usual, you miss the point.\n It's not JUST that they have a \"different view about homosexuality\".\n The important part is that if they are SHELTERED FROM OTHER VIEWS on the world, they may have difficulty in coping when not everybody they meet doesn't have the same view.", 
   {}, 
   230168, 
   null, 
   1157580120.0
  ], 
  [
   230215, 
   null, 
   "obvious_child", 
   "I say let them. Their dollars pay for your schools. That means more money per student if they take them out. It also means your kids will have a better chance at a better life then they do. If they want to deny their children a education in the real world, let them. This is a zero-sum game and Evangelicals, especially fundamentalists should lose. The sole problem is we run the risk of what happens in Islamic countries. Disenchanted, poor fundamentalists start killing people rather then take responsibility for their own actions.", 
   {}, 
   230034, 
   null, 
   1157621880.0
  ], 
  [
   230252, 
   null, 
   "jyoshu", 
   "As usual, you miss the point.\n It's not JUST that they have a \"different view about homosexuality\".\n The important part is that if they are SHELTERED FROM OTHER VIEWS on the world, they may have difficulty in coping when not everybody they meet doesn't have the same view.\n\n \n How do you know they aren't being taught that those other views exist out there? In every case I know, homeschooling kids are taught about those views. Just because they aren't taught in public school doesn't mean they aren't being taught those views are out there.", 
   {}, 
   230178, 
   null, 
   1157653680.0
  ], 
  [
   230255, 
   null, 
   "jyoshu", 
   "I say let them . . . . It also means your kids will have a better chance at a better life then they do.\n\n \n Apparently you've never looked at college entrance exam stats for homeschoolers versus publically-schooled kids. Get the facts.\n Nonetheless, self-identified home-schoolers have bettered the national averages on the ACT for the past three years running, scoring an average 22.7 last year, compared with 21 for their more traditional peers, on a scale of one to 36. Home-schoolers scored 23.4 in English, well above the 20.5 national average; and 24.4 in reading, compared with a mean of 21.4. The gap was closer in science (21.9 vs. 21.0), and home-schoolers scored below the national average in math, 20.4 to 20.7.\n \n On the SAT, which began its tracking last year, home-schoolers scored an average 1,083 (verbal 548, math 535), 67 points above the national average of 1,016. Similarly, on the 10 SAT2 achievement tests most frequently taken by home-schoolers, they surpassed the national average on nine, including writing, physics and French.\n http://www.chec.org/Legislative/News/HomeschoolingStatistics/Index.html\n \n http://www.hslda.org/docs/nche/000010/200410250.asp", 
   {}, 
   230215, 
   null, 
   1157654220.0
  ], 
  [
   230307, 
   null, 
   "obvious_child", 
   "jyoshu, there is a difference between test scores and actual ability. How many home schoolers are CEOs? How many are engineers? How many are professors? \n \n Public schools weeds out those who can and those who can't. Sheltering your child from life results in their eventual failure.", 
   {}, 
   230255, 
   null, 
   1157691660.0
  ], 
  [
   230336, 
   null, 
   "jyoshu", 
   "jyoshu, there is a difference between test scores and actual ability. How many home schoolers are CEOs? How many are engineers? How many are professors? \n \n Public schools weeds out those who can and those who can't. Sheltering your child from life results in their eventual failure.\n\n \n I might agree, except that homeschooling doesn't equate with sheltering one's child. And where I live, a kid may not survive high school. You really need to read up on homeschooling these days. It sounds like you are thinking if it in terms of the way it was often done 25-30 years ago. Homeschooling is a current revolution going on in education, and it's not going to go away and it's only going to keep growing. Given the way most people homeschool these days, there's no reason anyone would oppose it except due to irrational prejudice.", 
   {}, 
   230307, 
   null, 
   1157727840.0
  ], 
  [
   230340, 
   null, 
   "foundit66", 
   "How do you know they aren't being taught that those other views exist out there?\n\n I'm sure that a lot of them are being taught that.\n It's just there is a HUGE difference inbetween \"teaching\" that and EXPERIENCING that.\n \n Take drugs and alcohol. You'ld be hard pressed to find any young kid who doesn't know they exist either.\n But a good deal of them can't cope with the peer pressure, and give in to it.\n \n But on the flip side of this question, those parents who are fighting to have gay references removed from schools are more than likely not teaching their kids anything on the issue.\n \n \n \nIn every case I know, homeschooling kids are taught about those views. Just because they aren't taught in public school doesn't mean they aren't being taught those views are out there.\n\n There is a difference inbetween \"being taught\", and EXPERIENCING.\n If a person were just \"taught\" how a computer works, without actually being able to see a computer in action, how effective do you think the lesson would be.\n \n Also, if the person being taught was being taught by a parent WHO HADN'T REALLY EXPERIENCED diverse views on homosexuality, how effective do you think the lesson will be. There is a HUGE generational gap on the issue, and the views that the \"parent\" experiences are much different from the views that the child is experiencing. Kids these days are growing up in high schools where MAJORITY opinion SUPPORTS gay marriage.", 
   {}, 
   230252, 
   null, 
   1157731860.0
  ], 
  [
   230342, 
   null, 
   "foundit66", 
   "I might agree, except that homeschooling doesn't equate with sheltering one's child.\n\n No. It doesn't \"equate\" to sheltering, but as usual you are missing the forest for the trees.\n This thread was built around an article discussing how Evangelicals were pulling their kids out of schools. The rationale being that they WERE SHELTERING these kids from views that they didn't like.\n \n \n \nYou really need to read up on homeschooling these days. It sounds like you are thinking if it in terms of the way it was often done 25-30 years ago. Homeschooling is a current revolution going on in education, and it's not going to go away and it's only going to keep growing. Given the way most people homeschool these days, there's no reason anyone would oppose it except due to irrational prejudice.\n\n There have been plenty of reasons that people have opposed it on this thread. I haven't really seen any that center around \"prejudice\".\n \n Your responses have centered around saying that the proposed problem does not have to BE the case, but it never addresses the cases where it IS the case.\n Homeschooling can be a good thing. I've got a brother whose kids are home-schooled. Their mother is very capable and knowledgeable.\n \n But on the flip side, if some parent is pulling their kid out of school not because the parent can do a better job, but rather because the parent wants to not teach evolution and not have ideas that may conflict with Christianity taught, then it's obviously questionable whether or not that parent is thinking in the child's best interests and instead trying to shelter the child.", 
   {}, 
   230336, 
   null, 
   1157732280.0
  ], 
  [
   230343, 
   null, 
   "georged", 
   "\n But on the flip side, if some parent is pulling their kid out of school not because the parent can do a better job, but rather because the parent wants to not teach evolution and not have ideas that may conflict with Christianity taught, then it's obviously questionable whether or not that parent is thinking in the child's best interests and instead trying to shelter the child.\n\n \n In spite of tangents posted by some to switch the topic to quality of education, your paragraph summarizes why evangelicals are pulling their children out of public schools. And it is questionable as to whether they have the best educational interests of their children in mind when their obvious motive is to eliminate conflicts with Christian dogma.", 
   {}, 
   230342, 
   null, 
   1157732820.0
  ], 
  [
   230353, 
   null, 
   "foundit66", 
   "In spite of tangents posted by some to switch the topic to quality of education, your paragraph summarizes why evangelicals are pulling their children out of public schools. And it is questionable as to whether they have the best educational interests of their children in mind when their obvious motive is to eliminate conflicts with Christian dogma.\n\n \n Building further upon your comments...\n \n In 1986, psychologist Mona Delahooke did a study on home-schooled children. The home-schooled children scored as well on standardized tests. Even so, she and other psychologists are concerned about some potential problems.\n [*]Lack of exposure to diversity - Home schoolers are less likely to meet children of other cultures and ethnic backgrounds. Instead of exposure to varied philosophies in school, home-schooled children only hear their parents' philosophies. If ignorant of contrary views, children are more likely to be influenced by them, when they are finally encountered. Gradually encountering a variety of philosophies can \"inoculate\" the children, especially if parents help their children understand how these philosophies compare to their own. Then children are more capable of forming their own views.[*]Lack of participation in the greater society - Keeping children at home may hinder their ability to get along with others in our pluralistic society. Public schooling teaches socialization skills like self-control and accountability. They are more likely to learn to respect others (even if the others are different), wait their turn, and share their resources.[*]Potential difficulty entering mainstream life - At some level, the children need to re-enter the educational system. Arguments about the placement of the children are likely to arise between parents and administrators. Even with standardized tests and college entrance exams, acceptance of home-schooled children into college varies on a case-by-case basis. Applications are difficult to judge without set standards.http://virgil.azwestern.edu/~dag/lol/SchoolingHome.html\n \n And if the parents VERY PURPOSE in taking their kids out of school is based on a desire to eliminate conflicting ideals, it seems obvious that a LOT of the issues previously discussed by others, and avoided by Jyoshu, will come into play.", 
   {
    "unicode_changes_made": true
   }, 
   230343, 
   null, 
   1157738280.0
  ], 
  [
   307547, 
   null, 
   "Existantia", 
   "I would do my children a disfavour by pulling them out of school simply because of the values being taught there.\n \n Also joe@actsii, if you don't accept your \"friends\" gay lifestyle, you truly dont accept them, therefore, you cannot teach them tolerance of gays and act like you like them. You ultimately don't. You like them as people, if only they knew which was the \"right way\" to live, right?\n \n I want my kids to be exposed to opinions other than my own and to be INVOLVED with other people in a learning environment. He/she will learn better that way and also learn his/her opinion, beliefs as he/she grows up, depending on how they feel. \n \n I believe it is too controlling to home-school. You can't force a kid to believe your way is best, because it may not be. If you trust your parenting skills and do a good job of being there for your kid, you wont have to worry about them much because you know they have good grounding. \n \n I agree, I dont want my kids to ever do drugs and all that stuff, but I cant watch them 24/7. Say my kid ends up dabbling in that....I'd rather address, why that kid feels compelled to do drugs or be promiscuous rather than blaming it on schools or peer pressure. Typically, it's a deeper issue, like how they feel about themselves, based on how they are treated within the family. I want my kids to learn how to cope with everything they will be dealing with in the world rather than teaching them there is only one way to think.", 
   {}, 
   230353, 
   null, 
   1207341900.0
  ], 
  [
   317661, 
   null, 
   "Galactababe", 
   "Existansia:\n \n \nI would do my children a disfavour by pulling them out of school simply because of the values being taught there.\n\n \n Interesting. What \"values\" do you feel public schools are teaching that a parent could not teach at home?\n \n \nAlso joe@actsii, if you don't accept your \"friends\" gay lifestyle, you truly dont accept them, therefore, you cannot teach them tolerance of gays and act like you like them. You ultimately don't. You like them as people, if only they knew which was the \"right way\" to live, right? \n\n \n Just because Joe identified gays, lesbians and atheists in his work place, doesn't mean he is intolerant of them. In fact, he counted them as his friends. Sounds to me like he is the one with the live and let live attitude, not you. You want to force people to either ignore or condone practices which are contrary to their own beliefs. Joe is tolerant. That doesn't mean he has to join GLAAD to prove it.", 
   {}, 
   307547, 
   null, 
   1217004900.0
  ], 
  [
   317673, 
   null, 
   "chester", 
   "Existansia:\n \n You want to force people to either ignore or condone practices which are contrary to their own beliefs.\n\n \n Strikes me that this is the essence of the American way. You can be biased toward gays, Jews, African-Americans, Mexicans, or whatever.\n \n That being said, you cannot take any action to demonstrate it, i.e., despite your beliefs, you must either ignore or condone who and what others are.\n \n Do you have a problem with that, or do you think that people have the right under American law to discriminate?\n \n Who knows, maybe some day, you might even ignore teachers - against whom you are so obviously biased.", 
   {}, 
   317661, 
   null, 
   1217008800.0
  ], 
  [
   317674, 
   null, 
   "chester", 
   "I would do my children a disfavour by pulling them out of school simply because of the values being taught there.\n \n Also joe@actsii, if you don't accept your \"friends\" gay lifestyle, you truly dont accept them, therefore, you cannot teach them tolerance of gays and act like you like them. You ultimately don't. You like them as people, if only they knew which was the \"right way\" to live, right?\n \n I want my kids to be exposed to opinions other than my own and to be INVOLVED with other people in a learning environment. He/she will learn better that way and also learn his/her opinion, beliefs as he/she grows up, depending on how they feel. \n \n I believe it is too controlling to home-school. You can't force a kid to believe your way is best, because it may not be. If you trust your parenting skills and do a good job of being there for your kid, you wont have to worry about them much because you know they have good grounding. \n \n I agree, I dont want my kids to ever do drugs and all that stuff, but I cant watch them 24/7. Say my kid ends up dabbling in that....I'd rather address, why that kid feels compelled to do drugs or be promiscuous rather than blaming it on schools or peer pressure. Typically, it's a deeper issue, like how they feel about themselves, based on how they are treated within the family. I want my kids to learn how to cope with everything they will be dealing with in the world rather than teaching them there is only one way to think.\n\n \n Well said. This is the essence of what America stands for.", 
   {}, 
   307547, 
   null, 
   1217008920.0
  ], 
  [
   317687, 
   null, 
   "Bassman", 
   "Well said. This is the essence of what America stands for, except for, of course, the radical hard right.\n\n Time to call the General!!\n \n \n \n General-Ization ;)", 
   {}, 
   317674, 
   null, 
   1217011260.0
  ], 
  [
   317690, 
   null, 
   "chester", 
   "Time to call the General!!\n General-Ization ;)\n\n \n Why not lay out in detail just what part of the post you disagree with.\n \n Oh, I forgot, you only carp and criticize, not contribute.", 
   {}, 
   317687, 
   null, 
   1217011920.0
  ], 
  [
   317744, 
   null, 
   "Bassman", 
   "Why not lay out in detail just what part of the post you disagree with.\n \n Oh, I forgot, you only carp and criticize, not contribute.\nwhy don't you take a good look at the post yoursaelf and see what the admin cut out. You cannot just lump Conservatives together like that and not expect repercussions. Your thinking that Conservatives and Conservatism are so bad that they have to be pushed aside in favor of a Soviet-type of society and economy are absurd to say the least!", 
   {}, 
   317690, 
   null, 
   1217031000.0
  ], 
  [
   317752, 
   null, 
   "chester", 
   "why don't you take a good look at the post yoursaelf and see what the admin cut out. You cannot just lump Conservatives together like that and not expect repercussions. Your thinking that Conservatives and Conservatism are so bad that they have to be pushed aside in favor of a Soviet-type of society and economy are absurd to say the least!\n\n \n Do you know what a false choice is?\n \n You just wrote one.\n \n No one here, least of all yours truly, has ever advocated for a \"Soviet-type of society.\"\n \n I make no bones about favoring democratic socialism; you don't.\n \n You have the right to argue and organize for your POV as do I.\n \n No one POV has a monopoly on loyalty to the country or on patriotism.\n \n Everyone, from the farthest hard right radical to the member of the American Communist Party, has an equal right to fly the Stars and Stripes in front of their homes.\n \n Now, the issue is that private and charter schools are a menace, as they lead to the Balkanization of America. Peirce v. Society of Sisters and Meier v. Nebraska were wrongly decided. \n \n Fortunately for the country, about 30 states have Blaine Amendments in their state Constitutions.:)", 
   {}, 
   317744, 
   null, 
   1217034540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evangelicals Pulling Kids Out Of Schools", 
  "url": "http://www.4forums.com/political/education-debates/8802-evangelicals-pulling-kids-out-schools.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 8802, 
  "discussion_files": [
   [
    "3887.html", 
    "http://www.4forums.com/political/education-debates/8802-evangelicals-pulling-kids-out-schools-print.html"
   ], 
   [
    "3888.html", 
    "http://www.4forums.com/political/education-debates/8802-evangelicals-pulling-kids-out-schools-4-print.html"
   ], 
   [
    "3889.html", 
    "http://www.4forums.com/political/education-debates/8802-evangelicals-pulling-kids-out-schools-3-print.html"
   ], 
   [
    "3890.html", 
    "http://www.4forums.com/political/education-debates/8802-evangelicals-pulling-kids-out-schools-2-print.html"
   ]
  ], 
  "identifier": 8802
 }
]