[
 [
  [
   230667, 
   null, 
   "Wellwisher", 
   "Turkey officials made a resolve about participation in peacekeeping mission in Lebanon in defiance of common opinion. It's well-known that 80% of Turkey population doesn't support government decision. Moreover people think why Turkey have troops and money for so mission realizing but has none of it when it comes to solving of our longstanding internal problem - Kurdish rebels in East of the country.\n We are absolutely subdued by America & Israel. Turkey's pursuing their line in the region actually. And this \"limited\" participation in peacekeeping mission in Lebanon testifies to the limited mental abilities of our top leaders! It may provoke violence both inside and outside. Most Turks (80% or so!) here support Hezbollah. And outside Muslim treat this participation call it limited or what just a betrayal of Muslim world. Well recent acts of terrorism have been warning I suspect. Still Tayyip Erdogan dared to go far. His main argument is that our troops will not take part in Hezbollah disarmament. But what is our mission in Lebanon in that case? Is it the fact of our presence? I think that prime-minister is trying to demonstrate something for somebody. USA? Now I am really scary of more deaths in new terror attacks we are going to face soon in our land. Perhaps our American patrons expect Turkey due to her \"limited participation\" to be chosen as target number 1for Islamic terrorists instead of Israel!", 
   {
    "post_info": {
     "post_title": "What is our mission in Lebanon?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1158048780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is our mission in Lebanon?", 
  "url": "http://www.4forums.com/political/current-events-debates/8852-what-our-mission-lebanon.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8852, 
  "discussion_files": [
   [
    "19986.html", 
    "http://www.4forums.com/political/current-events-debates/8852-what-our-mission-lebanon-print.html"
   ]
  ], 
  "identifier": 8852
 }
]