[
 [
  [
   231029, 
   null, 
   "Merlin", 
   "2) Return of Chebba Farms to Lebanon by Israel. The removal of all Israeli mines, troops and weaponary should also occur from this area.\n \n This has to occur has soon as possible to decrease militantancy in Lebanon. Not only that it does not actually belong to Israel. There is agreement between Lebanon and Syria that the Chebba Farms belong to Lebanon (White paper). If Israel wants to have a military base it should have it on the own land and not on Lebanese teritory. you have to deal with each issue in the Middle East on its own merrit. How do you get Israel to hand it back over?\n \n Lebanon (Hezbolhah) has to stop all acts of violence and formally regonise Israels right to exist. Then Israel has no justification to be on the land. A time table has to be set up after this - aprox 6 - 12 months, including removal of all mines in the area. Deal with it simply - return land to legal rightful owner - no questions no arguments...emoticon_cry emoticon_cry emoticon_cry emoticon_cry \n It is really is that simple.\n \n Merlin", 
   {
    "post_info": {
     "post_title": "return of chebba farms to Lebanon"
    }
   }, 
   null, 
   null, 
   1158335880.0
  ], 
  [
   231040, 
   null, 
   "peteratwar", 
   "And what do the Israelis get in return ?", 
   {}, 
   231029, 
   null, 
   1158338460.0
  ], 
  [
   231155, 
   null, 
   "Merlin", 
   "What does Israel get in return. Thats the wrong way to look at it. It does not belong to them so how can they want something for land that is not theirs.\n \n Come on Lebanon has beating to a pulp by Israel over the last 20 years it just wants it land back. Israel has to make the first move and return the land. For Israel it will mean a greater chance of peace and that is about all they should get for it has it does not belong to them anyway.", 
   {}, 
   231029, 
   null, 
   1158437400.0
  ], 
  [
   231310, 
   null, 
   "peteratwar", 
   "What does Israel get in return. Thats the wrong way to look at it. It does not belong to them so how can they want something for land that is not theirs.\n \n Come on Lebanon has beating to a pulp by Israel over the last 20 years it just wants it land back. Israel has to make the first move and return the land. For Israel it will mean a greater chance of peace and that is about all they should get for it has it does not belong to them anyway.\n\n \n Strange but I wonder where Hezbollah were firing their rockets from?", 
   {}, 
   231155, 
   null, 
   1158572820.0
  ], 
  [
   231451, 
   null, 
   "Merlin", 
   "Yes but to give the lebanese goverment a chance of gaining back control in the south of the country the Chebba Farms has to be returned to Lebanon.", 
   {}, 
   231310, 
   null, 
   1158677700.0
  ], 
  [
   231568, 
   null, 
   "peteratwar", 
   "Absolutely, provided Hezbollah are reined in and no further rocket attacks/raids by them on Israel are carried out.", 
   {}, 
   231451, 
   null, 
   1158763620.0
  ], 
  [
   231595, 
   null, 
   "Merlin", 
   "It is a catch 22 situation. The Lebanese goverment won't be able to reign in on hezbolahah unless is seen as making real tangiable ground on the issue of the mines, Chebba Farms and release of prisoners to gain the support of the population in the south of the country. But then Israel says it won't make consesions untill Hezbolhah is reigned in. It just won't happen untill you resolve the three above listed items above. Israel has to take the gamble and act on the three above items to have any chance of hezbolhah being reigned in.", 
   {}, 
   231568, 
   null, 
   1158777000.0
  ], 
  [
   231668, 
   null, 
   "peteratwar", 
   "I suspect the Israelis are a bit fed up with people advising them to gamble with their people's lives.\n \n One of the reasons for the muli-lateral force is to allow disengagement between the sides, disarming of Hezbollah and the withdrawal of the Israeli forces. The Israelis have agreed to this\n \n Hezbollah seem to be somewhat reluctant, so have a word with them & suggest they gamble", 
   {}, 
   231595, 
   null, 
   1158830040.0
  ], 
  [
   231702, 
   null, 
   "Merlin", 
   "Yes I aggree more guarantees of non aggresion from Hezbolhah are required, but Israeli soldiers should not be allowed to ocupy foriegn soil. If a buffer zone is required on a tempoary basis then it should be internation with UN control not Israeli military control. This is the same with the Golan heights where the area should be passed over to the UN to control for a set period of time until it considered safe to return to Syria.", 
   {}, 
   231668, 
   null, 
   1158857400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  return of chebba farms to Lebanon", 
  "url": "http://www.4forums.com/political/peace-middle-east/8873-return-chebba-farms-lebanon.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 8873, 
  "discussion_files": [
   [
    "837.html", 
    "http://www.4forums.com/political/peace-middle-east/8873-return-chebba-farms-lebanon-print.html"
   ]
  ], 
  "identifier": 8873
 }
]