[
 [
  [
   231390, 
   null, 
   "daewoo", 
   "Homebuilder sentiment sinks again in Sept: NAHB\n \n NEW YORK (Reuters) - U.S. homebuilder optimism sank for an eighth consecutive month in September to the lowest level in more than 15 years, with a surge in the backlog of unsold homes putting development on ice, an industry survey showed on Monday.\n \n The National Association of Home Builders said its index of homebuilder sentiment declined 3 points in September to 30, the lowest since February 1991, when the economy had slipped into recession. August's figure had been revised upward to 33 from 32.\n \n The NAHB said its gauge of sales expectations for the next six months fell 4 points to 37, indicating members see further downward momentum in the housing industry. The measure for current sales of new homes declined 5 points to 32.\n \n \"It's about a degree of oversupply and how builders will work it down,\" including cutbacks on new construction, said NAHB Chief Economist David Seiders. Many buyers on the sidelines are unmoved by \"substantial incentives,\" so price cuts are becoming more frequent, he said.\n \n A reading below 50 means more builders view sales conditions as poor rather than good.\n \n Builders continued to report increases in cancellations of sales contracts and inventories of unsold homes, especially for the bigger companies, Seiders said.\n\n \n Just homebuilders sentiment, but I would think that those guys would have the clearest picture of expectations.", 
   {
    "post_info": {
     "post_title": "More bad news in housing"
    }
   }, 
   null, 
   null, 
   1158613560.0
  ], 
  [
   231418, 
   null, 
   "Steeeeve", 
   "The worst part will be when people find out their McMansion made out of cardboard for 1/100 of what they paid is actually now worth 1/100 of what they paid...unless you can find some sucker that thinks having a cheaply built big house with 30 small rooms is a good thing", 
   {}, 
   231390, 
   null, 
   1158631380.0
  ], 
  [
   231423, 
   null, 
   "daewoo", 
   "The worst part will be when people find out their McMansion made out of cardboard for 1/100 of what they paid is actually now worth 1/100 of what they paid...unless you can find some sucker that thinks having a cheaply built big house with 30 small rooms is a good thing\n\n \n \n I think that would depend. Does it have an ISLAND in the kitchen? I read the other day that according to the NAR, Having an ISLAND in the kitchen can increase the value of your house by as much as $10,000. LMAO. Maybe if there was a welcome basket on the kitchen counter with vouchers for an all expense paid month long luxury trip to an ISLAND for 2.\n \n Steeve, I have so little hope for so many of my fellow americans at this point that I almost hope that AQ blows up washington and the housing market crashes quickly, just os it is over and done with. I was talking to a guy the other day that finaced his house last year at 110%. He paid WAY too much for it, on a variable rate mortgage, and his mortgage actually resets THIS year. He is not going to be able to afford the new payments. He tried to list his house at 20% over what he had paid, which is what the TV talking heads had told him it would be worth in a year when he bought it, and the realtors he spoke to told him that he could PROBABLY get 20% LESS than he paid for it. \n \n So, now he is concerend about the housing market crashing. What do we do about this? Well, he went out and bought a brand new pickup for him and an SUV for his wife, because the local dealrship is swamped with them and is giving them away at 15% under sticker. Now he can't afford to buy groceries, because he can't afford the new vehicle payments on top of the house payments. SO, his genius plan is to buy everythign else with credit cards, at \"only\" 12%, because he is sure that the housing market will come back before he runs out of credit.\n \n The problem is that FAR, FAR too many americans seem to have this mentality. You just want to slap them and yell \"HEY, XXXXX, BUYING A BUNCH OF XXXX THAT YOU COULD NOT AFFORD ON CREDIT IS WHAT GOT YOU INTO THIS IN THE FIRST PLACE. YOU ARE NOT GOING TO GET OUT OF IT BY BUYING MORE XXXX ON CREDIT\" \n \n As an accountant who has to understand things like cash flow and the cost of borrowing money, that kind of thing must just drive you nuts, huh?", 
   {}, 
   231418, 
   null, 
   1158633360.0
  ], 
  [
   231429, 
   null, 
   "Steeeeve", 
   "As an accountant who has to understand things like cash flow and the cost of borrowing money, that kind of thing must just drive you nuts, huh?\n You can capitalize the cost of borrowing up until construction complete...too bad that doesn't apply to your average home owner as they don't care about their balance sheet. But if they did, valuation rules would apply and you would write down that beastly looking house. \n \n I'm currently renting right now because I can give this POS, overpriced place back when I'm done hearing my neighbors through the paper walls. When I get around to it, I'll design a house worth something..have it built for 3 times less than current house prices because no one will be able to afford a house in a few years accept accountants who didn't waste money buying a crappy house (I loss money renting but it is probably less than having a house that is worthless now).\n \n Anyway, as an accountant I don't understand why you have an insane current ratio and attempt to make it worse. Screw cash flows at this point...just look at the Balance sheet effect of your friend....ugh, I'm getting a glass of wine.", 
   {}, 
   231423, 
   null, 
   1158638880.0
  ], 
  [
   231434, 
   null, 
   "daewoo", 
   "I'm currently renting right now because I can give this POS, overpriced place back when I'm done hearing my neighbors through the paper walls. When I get around to it, I'll design a house worth something..have it built for 3 times less than current house prices because no one will be able to afford a house in a few years accept accountants who didn't waste money buying a crappy house (I loss money renting but it is probably less than having a house that is worthless now).\n\n \n Smart man.\n \n I have a sister that just bought a house. I tried to talk her out of it, tried to talk her into renting for a year and then deeing where we stand. She woudl not hear of it. There is almost a social stigma to renting in some areas, and she was not willing to endure that, even if it did lead to disaster. Yes, we had the same parents. No, I don't know why she turned out an idiot.\n \n I had an interesting conversation with a friend of my fathers not long ago. He is the president of a fair sized (top 10) bank. He was explaining that the banking industry is trying to get foreclosure laws changed in many states and some federal laws changed. Apparently the way the law generally runs now, when a bank forecloses on a house, it has to be auctioned. Proceeds from the auction first go to pay the banks interest, and the remainder (if any) is paid to the previous homeowner.\n \n Apparently there are many in the banking industry that would like to see this changed so that if the sale of the home is not likely to net the previous homeowner any money, the bank can BULLDOZE the home rather than auctioning it. Apparently the inside scoop from the banking industry is that they expect 20-40% of ARMS written in the last 4 years to be in default within 3 years. That is a HUGE number of homes being auctioned on the courthouse steps. Additionally, if we see a 15% downward valuation of homes, they expect nearly 35% of homes nationwide to go into default due to protectionist mortgage clauses (and the fact that a lot of people will not continue to struggle to pay a $200,000 mortgage on a $170,000 house). Apparently there are some in the banking industry that see bulldozing a percentage of homes as a way to protect their remaing investment (the value of other homes).\n \n His frank assesment is (direct quote) \"In 5 years, the great depression will look like the roaring 20's, and theres not a damn thing anybody can do about it\".\n \n \nAnyway, as an accountant I don't understand why you have an insane current ratio and attempt to make it worse. Screw cash flows at this point...just look at the Balance sheet effect of your friend....ugh, I'm getting a glass of wine.\n\n \n He's just following the example the federal government is setting. I noticed that foreign treasury purches were only about 32 billion last month. They expected 60-70 billion. Same month average is $63 billion. Apparently other countries are NOT willing to finance our unsustainable spending frenzy forever. I wish my wifes friend (I do not have friends that are that stupid) woudl catch on to that. You cannot just charge it forever.", 
   {}, 
   231429, 
   null, 
   1158645240.0
  ], 
  [
   231455, 
   null, 
   "gamehuis", 
   "It will be interesting to see how this scenario unfolds over the next year. I expect to see a big pinkslip-o-rama in the building and real estate financing sector and I wonder how big the effect will be on the GDP. Some readings showed that the booming real estate sector was responsible for as much as 3/5 of the GDP growth over the last couple of years.\n \n As for foreclosures, the banks already owned the peoples homes even before the foreclosures, it's just that the people didn't realise it.\n ARM = All Real estate is Mine. ;)", 
   {}, 
   231434, 
   null, 
   1158680400.0
  ], 
  [
   231459, 
   null, 
   "Steeeeve", 
   "Smart man.\n It doesn't take a college education to realize investing in a house less sturdy than an ethiopian shanty is a poor investment. Trouble is...I am unclear about what to invest in now...last thing I want is the bank to close cause they can't afford the interest they promised me on my notes. Stocks are a semi-bad investment for an accountant for obvious related party reasons (although I probably freak about that too much)\n \n \n\n I have a sister that just bought a house. I tried to talk her out of it, tried to talk her into renting for a year and then deeing where we stand. She woudl not hear of it. There is almost a social stigma to renting in some areas, and she was not willing to endure that, even if it did lead to disaster. Yes, we had the same parents. No, I don't know why she turned out an idiot.\n I have been renting for a few years now because any house I would want would be over a million and be actually worth (in a true reality) about half that. My father just finally purchased a house after renting for a few years. He was smart...sold the old house when people were paying unreasonable prices...rented while prices were high....bought a house that was on the market forever in a great neighborhood for a fraction of what his neighbors paid for their own house. \n \n \n \nApparently there are many in the banking industry that would like to see this changed so that if the sale of the home is not likely to net the previous homeowner any money, the bank can BULLDOZE the home rather than auctioning it. Apparently the inside scoop from the banking industry is that they expect 20-40% of ARMS written in the last 4 years to be in default within 3 years. That is a HUGE number of homes being auctioned on the courthouse steps. Additionally, if we see a 15% downward valuation of homes, they expect nearly 35% of homes nationwide to go into default due to protectionist mortgage clauses (and the fact that a lot of people will not continue to struggle to pay a $200,000 mortgage on a $170,000 house). Apparently there are some in the banking industry that see bulldozing a percentage of homes as a way to protect their remaing investment (the value of other homes).\n That is great for me. I'll get my waterfront property free of a house I have to get rid of for an 1/8th of the cost that it cost last year. I can then wait for people to become unreasonable again and sell it for a boat load more....tax free of course.\n \n \n\n His frank assesment is (direct quote) \"In 5 years, the great depression will look like the roaring 20's, and theres not a damn thing anybody can do about it\".\ngovernment job = job security. Accounting is an underrated profession :)\n \n \n\n He's just following the example the federal government is setting. I noticed that foreign treasury purches were only about 32 billion last month. They expected 60-70 billion. Same month average is $63 billion. Apparently other countries are NOT willing to finance our unsustainable spending frenzy forever. I wish my wifes friend (I do not have friends that are that stupid) woudl catch on to that. You cannot just charge it forever.\n Yeah what is with that? Does our money have AIDS or something? Japan has a huge amount of savings and they don't do this debt spending thing like we do...considering Japan is doing fairly well, I would think we should follow their example.", 
   {}, 
   231434, 
   null, 
   1158682440.0
  ], 
  [
   231481, 
   null, 
   "jitobear", 
   "Five years a go I bought a cheap, sturdy, 100 year old house in an up and coming, albeit slightly colorful city neighborhood. Then our new governor promised no new taxes (excluding property taxes of course), hacked budgets everywhere, hundreds of cops are laid off, my neighborhood crime is skyrocketing (about half dozen murders within a block this summer) and I am stuck in a market where I could not sell my house for what its worth (partly due to the location), or even what I have left on the mortgage. All the small local businesses have been getting shut down and run out. And what really sucks is that most of the folks are hard-working - working class folks - it's only a small portion who are the problem, and so I really don't want to leave. I like my neighborhood. But my kid had to dodge bullets at park when playing basketball (chaperoned) this summer. If that happened in the burbs people would have lost their minds. It's frustrating.", 
   {}, 
   231459, 
   null, 
   1158691320.0
  ], 
  [
   231483, 
   null, 
   "daewoo", 
   "It will be interesting to see how this scenario unfolds over the next year. I expect to see a big pinkslip-o-rama in the building and real estate financing sector and I wonder how big the effect will be on the GDP. Some readings showed that the booming real estate sector was responsible for as much as 3/5 of the GDP growth over the last couple of years.\n \n As for foreclosures, the banks already owned the peoples homes even before the foreclosures, it's just that the people didn't realise it.\n ARM = All Real estate is Mine. ;)\n\n \n This just came across my news ticker a little while ago:\n \n \n[HOW MUCH FARTHER FOR CONSTRUCTION JOBS?] As noted in our 9.55am/13....\n [HOW MUCH FARTHER FOR CONSTRUCTION JOBS?] As noted in our 9.55am/13.55gmt update, US housing starts have closed the gap with other indicators of housing demand. If sales hold up, starts may stabilize. There are other linkages to consider, though, construction jobs among them. So far, construction employment has merely flattened out. Overall construction jobs were up 2.9% y/y in August vs 4.8% in January. Employment in specialty construction trades (mostly employed by sub-contractors) was up 2.8% y/y in August, after a 4.7% rise in January. If construction jobs were to fall 20%, in line with new home sales and housing starts, that would mean a loss of 1.5 mln jobs. In the narrower specialty construction component, it would mean a loss of over 950k jobs. \n\n \n I know we are already seeing large income losses in the construction industry at the employee level. In my area (and the Kansas city area) many companies were pushing their people 6 days a week, 12 hours a day less than 2 years ago. Now many companies have scaled back to 4 days a week, and those are 8 hour days. I also know from reading industry material than nearly 5% of new construction jobs in hte last year are the result of guys who have seen hours and wages cut breaking off and trying to form their own companies doing piecework (decks, rehabs, renovations, etc...), a market that is drying up as the home equity cash cow fails to give milk. \n \n \nhttp://msnbc.msn.com/id/14906165/\n \n Slowdown in US inflation and housing extends\n \n The decision last month by the Federal Reserve's open markets committee to halt the cycle of interest rate rises seemed to be vindicated on Tuesday as official data showed inflation is slowing more quickly than expected, and the housing market slowdown is gaining momentum.\n \n The core producer price index, which excludes volatile food and energy prices, fell by 0.4 per cent in August, the biggest drop since April 2003. Economists polled by Reuters had predicted a 0.2 per cent rise. In June the core PPI fell by 0.3 per cent. \n\n \n \n First, I think anybody who celebrates a .2% MtM rise in inflation should be shot. We got to where we are currently .2 or .3% at a time. \n \n \nMeanwhile, new housing starts fell by 6 per cent, compared to an expected drop of 2.6 per cent.\n \n --snip--\n \n Housing starts were nearly a fifth down on August last year, while building permits fell 2.3 per cent. The slump in the housing industry is significant because it can feed through to consumer spending as home owners fear that they have less wealth.\n \n The sharp slide in the housing market not likely to end any time soon, economists said.\n \n Assuming a further drop in September we reckon Q3 starts will fall 35 per cent annualised, following a 39.5 per cent drop in Q2,\" said Ian Shepherdson, chief US economist at High Frequency Economics. \"If that's not meltdown, it's pretty close.\"\n\n \n Not good. This is going to be REALLY ugly", 
   {}, 
   231455, 
   null, 
   1158691740.0
  ], 
  [
   231489, 
   null, 
   "daewoo", 
   "Five years a go I bought a cheap, sturdy, 100 year old house in an up and coming, albeit slightly colorful city neighborhood. Then our new governor promised no new taxes (excluding property taxes of course), hacked budgets everywhere, hundreds of cops are laid off, my neighborhood crime is skyrocketing (about half dozen murders within a block this summer) and I am stuck in a market where I could not sell my house for what its worth (partly due to the location), or even what I have left on the mortgage. All the small local businesses have been getting shut down and run out. And what really sucks is that most of the folks are hard-working - working class folks - it's only a small portion who are the problem, and so I really don't want to leave. I like my neighborhood. But my kid had to dodge bullets at park when playing basketball (chaperoned) this summer. If that happened in the burbs people would have lost their minds. It's frustrating.\n\n \n One thing I like about you is your optimism. If my kid had to dodge bullets at the local park, I would not refer to the neiborghood as \"slightly colorful\". The term I would use is \"war zone\". \n \n This seems to be a recurring theme throughout the US. When Bush pushed his tax cuts through, he largely funded them by cutting out state revenue sharing and pushing program costs down to the state and local levels. This left a lot of states and municipalities in a really tight spot. Many state and local governments have already raised taxes. In fact, if you factor in local and state tax increases that were a direct result of the tax cuts, most americans see no actual benifit from the cuts (if you factor in the inflation that was the result of the record federal borrowing that took place to fund what cutting city and state throats did not cover, 98% of Americans are loosing money on the tax cuts). \n \n A lot of cities and states have essentially abandoned \"colorful\" areas. Local and state governments do not enjoy the same immunity from accountability that federal officials enjoy. They actually have to answer for tax increases.", 
   {}, 
   231481, 
   null, 
   1158693000.0
  ], 
  [
   231495, 
   null, 
   "jitobear", 
   "One thing I like about you is your optimism. If my kid had to dodge bullets at the local park, I would not refer to the neiborghood as \"slightly colorful\". The term I would use is \"war zone\". \n\n \n HA HA! \"Slightly colorful\" was the term five years ago. And that was where I live. The park in question is two miles away on the edge of the burbs and what used to be a quiet area.\n \n \nThis seems to be a recurring theme throughout the US. When Bush pushed his tax cuts through, he largely funded them by cutting out state revenue sharing and pushing program costs down to the state and local levels. This left a lot of states and municipalities in a really tight spot. Many state and local governments have already raised taxes. In fact, if you factor in local and state tax increases that were a direct result of the tax cuts, most americans see no actual benifit from the cuts (if you factor in the inflation that was the result of the record federal borrowing that took place to fund what cutting city and state throats did not cover, 98% of Americans are loosing money on the tax cuts). \n\n \n Hell - I wish they would tax me. Even some of our state's wealthiest people placed an ad in the paper telling the government they could go ahead and tax them HIGHER. Granted Minnesota has always been a high tax state - but we also had a rep for having a high living standard - cleaner, greener, decent schools and a good social services. It's going to hell. \n \n \nA lot of cities and states have essentially abandoned \"colorful\" areas. Local and state governments do not enjoy the same immunity from accountability that federal officials enjoy. They actually have to answer for tax increases.\n\n \n Well my gov is gonna answer for not having any. Tax me PLEASE!", 
   {}, 
   231489, 
   null, 
   1158698640.0
  ], 
  [
   231509, 
   null, 
   "georged", 
   "This just came across my news ticker a little while ago:\n \n \n \n I know we are already seeing large income losses in the construction industry at the employee level. In my area (and the Kansas city area) many companies were pushing their people 6 days a week, 12 hours a day less than 2 years ago. Now many companies have scaled back to 4 days a week, and those are 8 hour days. I also know from reading industry material than nearly 5% of new construction jobs in hte last year are the result of guys who have seen hours and wages cut breaking off and trying to form their own companies doing piecework (decks, rehabs, renovations, etc...), a market that is drying up as the home equity cash cow fails to give milk. \n \n \n \n \n First, I think anybody who celebrates a .2% MtM rise in inflation should be shot. We got to where we are currently .2 or .3% at a time. \n \n \n \n Not good. This is going to be REALLY ugly\n\n \n Most residential projects are planned a minimum of a year in advance before ground is broken. Current activity is from past development money still in the pipeline. That, other than retirement projects, should be pretty well exhausted in another 2-3 months for a happy holidays. \n \n The traditional bellwether for the residential construction industry has always been cement. If you no longer see cement trucks on a regular basis, that means foundations aren't being poured. Drive by your local ready mix and I'll bet you see at least 50% if not more of their trucks parked. \n \n I just sold my F350 (eBay) and felt fortunate to get my price. The local vehicle auctions are already clogged with heavy duty pickups to the point of refusing dealer consignments, repos and turn-ins from the construction industry. Large SUVs are also being refused due to stagnated wages, inflation and gasoline prices. For those blind patriot posters, I bought a Nissan Titan, far superior to any of the current domestic 1/2T pickups. My patriotism stops at my wallet. \n \n When our last strong industry is in serious trouble with the holiday season coming up where retailers either make it or break it, I also think it's going to get very, very ugly.", 
   {}, 
   231483, 
   null, 
   1158703140.0
  ], 
  [
   231513, 
   null, 
   "Steeeeve", 
   "One thing I like about you is your optimism. If my kid had to dodge bullets at the local park, I would not refer to the neiborghood as \"slightly colorful\". The term I would use is \"war zone\". \n \n This seems to be a recurring theme throughout the US. When Bush pushed his tax cuts through, he largely funded them by cutting out state revenue sharing and pushing program costs down to the state and local levels. This left a lot of states and municipalities in a really tight spot. Many state and local governments have already raised taxes. In fact, if you factor in local and state tax increases that were a direct result of the tax cuts, most americans see no actual benifit from the cuts (if you factor in the inflation that was the result of the record federal borrowing that took place to fund what cutting city and state throats did not cover, 98% of Americans are loosing money on the tax cuts). \n \n A lot of cities and states have essentially abandoned \"colorful\" areas. Local and state governments do not enjoy the same immunity from accountability that federal officials enjoy. They actually have to answer for tax increases.\n\n \n Having the states pay for things as opposed to the federal government is not that bad of an idea and really is the way it was supposed to be. Atleast some states actually adhere to the idea that you can really only spend what you have and thus you don't fund things with debt like the federal government does. \n \n Anyway, you got way off topic....we are talking about worthless McMansions in this thread ;)", 
   {}, 
   231489, 
   null, 
   1158705240.0
  ], 
  [
   231514, 
   null, 
   "daewoo", 
   "I just sold my F350 (eBay) and felt fortunate to get my price. The local vehicle auctions are already clogged with heavy duty pickups to the point of refusing dealer consignments, repos and turn-ins from the construction industry. Large SUVs are also being refused due to stagnated wages, inflation and gasoline prices. For those blind patriot posters, I bought a Nissan Titan, far superior to any of the current domestic 1/2T pickups. My patriotism stops at my wallet. \n \n When our last strong industry is in serious trouble with the holiday season coming up where retailers either make it or break it, I also think it's going to get very, very ugly.\n\n \n I'm glad you got your truck sold. One of the largest dealer auctions in the country is located less than 100 miles form here. I drove by there over the weekend and they had roughly 40 acres covered with nothing but trucks and SUVs that they can't seem to sell. Dealers are leaving them there week to week (it is a weekly auction) so they are not cluttering up their lots. According to our local dealer, most dealers are trying to keep markups firm (not letting the vehicles go at giveaway prices) so as not to hurt their new truck sales but I know at least our local dealer is getting close to caving on that. He has only sold 2 new trucks and 1 large SUV in the last 6 weeks. \n \n I still have my F450. I don't think that anything smaller would haul what I need to haul. I wrote it off as a business expense, and in the end with the special write offs that we were enjoying, I believe I was essentially paid to take it, so I am not all that worried about it (thanks to all you taxpayers...I am enjoying the gift). \n \n I am still trying to decide whether or not there is enough left for a decent christmas season at the retail level. The only way I can see good retail sales numbers is with a large increase in credit card debt to match it.", 
   {}, 
   231509, 
   null, 
   1158706500.0
  ], 
  [
   231516, 
   null, 
   "daewoo", 
   "Having the states pay for things as opposed to the federal government is not that bad of an idea and really is the way it was supposed to be. Atleast some states actually adhere to the idea that you can really only spend what you have and thus you don't fund things with debt like the federal government does. \n \n Anyway, you got way off topic....we are talking about worthless McMansions in this thread ;)\n\n \n I agree on where spending money should come from. What I did NOT agree with was that Bush claimed that the tax cuts were going to be paid for with increased revenue and cuts in federal spending, not by killing off revenue sharing. Instead he killed off revenue sharing and boosted federal spending to an insane level. \n \n As far as the mcmansions go...what is left ot say? I think we are going ot see a SERRIOS fire slae onglorified cookie cutter cardboard shacks :)", 
   {}, 
   231513, 
   null, 
   1158706740.0
  ], 
  [
   231533, 
   null, 
   "georged", 
   "I am still trying to decide whether or not there is enough left for a decent christmas season at the retail level. The only way I can see good retail sales numbers is with a large increase in credit card debt to match it.\n\n \n Residential housing was a huge flow-through of jobs based on debt and a big chunk is still in the pipeline. Weather, increased heating costs on top of wage stagnation, will be also a definite economic factor at year-end.", 
   {}, 
   231514, 
   null, 
   1158723840.0
  ], 
  [
   231543, 
   null, 
   "Steeeeve", 
   "I guess you could hope that Nintendo sells lots of \"Wii\"s in order to keep the Holiday Season up...at $250 its the least costly thing many will pay for with debt :)", 
   {}, 
   231533, 
   null, 
   1158733080.0
  ], 
  [
   236722, 
   null, 
   "BeTolerant", 
   "... and they will buy it...", 
   {}, 
   231543, 
   null, 
   1161946200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  More bad news in housing", 
  "url": "http://www.4forums.com/political/economics-debates/8889-more-bad-news-housing.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 8889, 
  "discussion_files": [
   [
    "18168.html", 
    "http://www.4forums.com/political/economics-debates/8889-more-bad-news-housing-print.html"
   ], 
   [
    "18169.html", 
    "http://www.4forums.com/political/economics-debates/8889-more-bad-news-housing-2-print.html"
   ]
  ], 
  "identifier": 8889
 }
]