[
 [
  [
   231411, 
   null, 
   "INRI", 
   "The doctrine of Christ's divinity is the central Christian doctrine, for it is like a skeleton key that opens all the others. Many Christians have not independently reasoned out and tested each of the teachings of Christ received via Bible and Church, but believe them all on his authority. \n \n For if Christ is divine, He can be trusted to be infallible in everything He said, even hard things like exalting suffering and poverty, forbidding divorce, giving his Church the authority to teach and forgive sins in his name, giving Peter the Keys to heaven, warning about hell (very often and very seriously), instituting the scandalous sacrament of eating his flesh-we often forget how many \"hard sayings\" he taught! \n \n When the first Christians began to give a reason for the faith that was in them to unbelievers, this doctrine of Christ's divinity naturally came under attack, for it was almost as incredible to Gentiles as it was scandalous to Jews.\n \n That a man who was born out of a woman's womb and died on a cross, a man who got tired and hungry and angry and agitated and wept at his friend's tomb, that this man who got dirt under his fingernails should be God was, quite simply, the most astonishing, incredible, crazy-sounding idea that had ever entered the mind of man in all human history. \n \n \n \n The argument the early christians used to defend this apparently indefensible doctrine has become a classic one. C.S. Lewis used it often, e.g. in Mere Christianity, the book that convinced Chuck Colson (and thousands of others). \n \n I once spent half a book (Between Heaven and Hell) on this one argument alone. It is the most important argument in Christianity, for once an unbeliever accepts the conclusion of this argument (that Christ is divine), everything else in the Faith follows, not only intellectually (Christ's teachings must all then be true) but also personally (if Christ is God, He is also your total Lord and Savior). \n \n The argument, like all effective arguments, is extremely simple: Christ was either God or a bad man. \n \n Unbelievers almost always say he was a good man, not a bad man; that he was a great moral teacher, a sage, a philosopher, a moralist, and a prophet, not a criminal, not a man who deserved to be crucified.\n \n But a good man is the one thing he could not possibly have been according to simple common sense and logic. For he claimed to be God. He said, \"Before Abraham was, I Am\", thus speaking the word no Jew dares to speak because it is God's own private name, spoken by God himself to Moses at the burning bush. \n \n Jesus wanted everyone to believe that he was God. He wanted people to worship him. He claimed to forgive everyone's sins against everyone. (Who can do that but God, the One offended in every sin?) \n \n Now what would we think of a person who went around making these claims today? Certainly not that he was a good man or a sage. There are only two possibilities: he either speaks the truth or not. If he speaks the truth, he is God and the case is closed. We must believe him and worship him. \n \n If he does not speak the truth, then he is not God but a mere man. But a mere man who wants you to worship him as God is not a good man. He is a very bad man indeed, either morally or intellectually. If he knows that he is not God, then he is morally bad, a liar trying deliberately to deceive you into blasphemy. If he does not know that he is not God, if he sincerely thinks he is God, then he is intellectually bad-in fact, insane.\n \n \n A measure of your insanity is the size of the gap between what you think you are and what you really are. If I think I am the greatest philosopher in the world, I am only an arrogant fool; if I think I am Napoleon, I am probably over the edge; if I think I am a butterfly, I am fully embarked from the sunny shores of sanity. But if I think I am God, I am even more insane because the gap between anything finite and the infinite God is even greater than the gap between any two finite things, even a man and a butterfly. \n \n Josh McDowell summarized the argument simply and memorably in the trilemma \"Lord, liar, or lunatic?\" Those are the only options. Well, then, why not liar or lunatic? But almost no one who has read the Gospels can honestly and seriously consider that option.\n \n The savviness, the canniness, the human wisdom, the attractiveness of Jesus emerge from the Gospels with unavoidable force to any but the most hardened and prejudiced reader. Compare Jesus with liars like the Reverend Sun Myung Moon or lunatics like the dying Nietzsche. Jesus has in abundance precisely those three qualities that liars and lunatics most conspicuously lack: \n \n His practical wisdom, his ability to read human hearts, to understand people and the real, unspoken question behind their words, his ability to heal people's spirits as well as their bodies; \n \n His deep and winning love, his passionate compassion, his ability to attract people and make them feel at home and forgiven, his authority, \"not as the scribes\"; and above all....\n \n His ability to astonish, his unpredictability, his creativity. Liars and lunatics are all so dull and predictable! No one who knows both the Gospels and human beings can seriously entertain the possibility that Jesus was a liar or a lunatic, a bad man. \n \n No, the unbeliever almost always believes that Jesus was a good man, a prophet, a sage. Well then, if he was a sage, you can trust him and believe the essential things he says. And the essential thing he says is that he is the divine Savior of the world and that you must come to him for salvation. \n \n If he is a sage, you must accept his essential teaching as true. If his teaching is false, then he is not a sage. \n \n The strength of this argument is that it is not merely a logical argument about concepts; it is about Jesus. It invites people to read the Gospels and get to know this man. The premise of the argument is the character of Jesus, the human nature of Jesus. The argument has its feet on the earth. But it takes you to heaven, like Jacob's ladder (which Jesus said meant him: Gen 28:12; Jn 1:51). Each rung follows and holds together. The argument is logically airtight; there is simply no way out. \n \n What, then, do people say when confronted with this argument? Often, they simply confess their prejudices: \"Oh, I just can't believe that!\" (But if it has been proved to be true, you must believe it if you really seek the truth!) \n \n Sometimes, they go away, like many of Jesus' contemporaries, wondering and shaking their heads and thinking. That is perhaps the very best result you can hope for. The ground has been softened up and plowed. The seed has been sown. God will give the increase. \n \n But if they know some modern theology, they have one of two escapes. Theology has an escape; common sense does not. Common sense is easily convertible. It is the theologians, now as then, who are the hardest to convert. \n \n The first escape is the attack of the Scripture \"scholars\" on the historical reliability of the Gospels. Perhaps Jesus never claimed to be divine. Perhaps all the embarrassing passages were inventions of the early \"Christian community\"\n \n In that case, who invented traditional Christianity if not Christ? A lie, like a truth, must originate somewhere. Peter? The twelve? The next generation? What was the motive of whoever first invented the myth (euphemism for lie)? What did they get out of this elaborate, blasphemous hoax? For it must have been a deliberate lie, not a sincere confusion. No Jew confuses Creator with creature, God with man. And no man confuses a dead body with a resurrected, living one. \n \n Here is what they got out of their hoax. Their friends and families scorned them. Their social standing, possessions, and political privileges were stolen from them by both Jews and Romans.\n \n They were persecuted, imprisoned, whipped, tortured, exiled, crucified, eaten by lions, and cut to pieces by gladiators. So some silly Jews invented the whole elaborate, incredible lie of Chrisitanity for absolutely no reason and died for their lie, and in turn millions of Gentiles believed it, devoted their lives to it, and died for it too-for no reason. \n \n It was only a fantastic practical joke, a hoax. Yes, there is a hoax indeed, but the perpetrators of it are the twentieth-century theologians, not the Gospel writers. \n \n The second escape (notice how eager we are to squirm out of the arms of God like a greased pig) is to Orientalize Jesus, to interpret him not as the unique God-man but as one of many mystics or \"adepts\" who realized his own inner divinity just as a typical Hindu mystic does. \n \n This theory takes the teeth out of his claim to divinity, for he only realized that everyone is divine. The problem with that theory is simply that Jesus was not a Hindu but a Jew! When he said \"God\", neither he nor his hearers meant Brahman, the impersonal, pantheistic, immanent all; he meant Yahweh, the personal, theistic, transcendent Creator. It is utterly unhistorical to see Jesus as a mystic, a Jewish guru. He taught prayer, not meditation. His God is a person, not a pudding. He said he was God but not that everyone was. He taught sin and forgiveness, as no guru does. He said nothing about the \"illusion\" of individuality, as the mystics do. \n \n \n \n \n http://www.peterkreeft.com/topics/christ-divinity.htm", 
   {
    "post_info": {
     "post_title": "Was Jesus of Nazareth Divine?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1158627420.0
  ], 
  [
   231473, 
   null, 
   "sinjin", 
   "The second escape (notice how eager we are to squirm out of the arms of God like a greased pig) is to Orientalize Jesus, to interpret him not as the unique God-man but as one of many mystics or \"adepts\" who realized his own inner divinity just as a typical Hindu mystic does. \n \n This theory takes the teeth out of his claim to divinity, for he only realized that everyone is divine. The problem with that theory is simply that Jesus was not a Hindu but a Jew! When he said \"God\", neither he nor his hearers meant Brahman, the impersonal, pantheistic, immanent all; he meant Yahweh, the personal, theistic, transcendent Creator. It is utterly unhistorical to see Jesus as a mystic, a Jewish guru. He taught prayer, not meditation. His God is a person, not a pudding. He said he was God but not that everyone was. He taught sin and forgiveness, as no guru does. He said nothing about the \"illusion\" of individuality, as the mystics do.\n\n \n Unless he tailored his words to his audience. \"Pudding\"? How arrogantly dismissive. \n \n Where was Jesus between 12 and 30?", 
   {}, 
   231411, 
   null, 
   1158689160.0
  ], 
  [
   231474, 
   null, 
   "INRI", 
   "Unless he tailored his words to his audience.\n\n \n In which case your saying he was a bad man, since by your theory it would mean jesus knowingly decieved the Jews in regards to whatt he meant when he claimed divinity, but even then he used Jewish Terms like \"I AM\" which referes to the Jewish God the personal, theistic, transcendent Creator, not the impersonal, pantheistic, immanent all of oriental or eastern religions.\n \n \n \n Between 12 & 30.... Nazareth\n \n \n\"Pudding\"? How arrogantly dismissive.\n\n \n In Eastern oriental religions God is everything, including a \"pudding\"... its not arrogant at all if you take it in context.", 
   {}, 
   231473, 
   null, 
   1158689580.0
  ], 
  [
   231479, 
   null, 
   "jyoshu", 
   "They were persecuted, imprisoned, whipped, tortured, exiled, crucified, eaten by lions, and cut to pieces by gladiators. So some silly Jews invented the whole elaborate, incredible lie of Chrisitanity for absolutely no reason and died for their lie, and in turn millions of Gentiles believed it, devoted their lives to it, and died for it too-for no reason. \n\n \n What you point out is one of the greatest failing of the \"Jesus-was-a-fabrication-by-his-disciples\" hoax. I can't imagine a hoax that people would die and/or be tortured for, even if there are financial gains to be made. Another failing is that a hoax of that magnitude would have to be extremely widespread to be able to pull it off, to the point of basically making it impossible. For instance, it would have been a hoax that would have been perpetrated knowingly over more than one generation by various people--such as Polycarp who was John's disciple. As well as Irenaus, Ignatius, and Clement. The idea that all these people got together (even if we're only counting the 12 disciples and not assuming others would have been in on it which would have had to have been the case) to perpetrate a hoax even to the point of teaching it the rest of their lives to various people without any of them ever slipping up, changing their minds, etc. becomes as ridiculous to believe than the actual tradtional beliefs of historic Christianity.", 
   {
    "unicode_changes_made": true
   }, 
   231411, 
   null, 
   1158690720.0
  ], 
  [
   231482, 
   null, 
   "INRI", 
   "Exactly\n \n Again it dosnt make any sanse that 12 Jews who believed in a Almighty God would create a lie to lead people away from \"the one true god\" by proclaiming an ordinary man is that God and die for that lie, especially if they believe in life after death and eternal reward or punishment for their actions...It doesnt make sense why these Jews would not only sacrafice their Physical life but also their eternal life in order to spread a myth.... When you look at it logically the argument Jesus was a myth simply dosnt hold water.", 
   {}, 
   231479, 
   null, 
   1158691380.0
  ], 
  [
   231484, 
   null, 
   "johnhanks", 
   "Again it dosnt make any sanse that 12 Jews who believed in a Almighty God would create a lie to lead people away from \"the one true god\" by proclaiming an ordinary man is that God and die for that lie, especially if they believe in life after death and eternal reward or punishment for their actions...It doesnt make sense why these Jews would not only sacrafice their Physical life but also their eternal life in order to spread a myth...\n\n \n Tell all of that to the Branch Davidians.", 
   {}, 
   231482, 
   null, 
   1158691980.0
  ], 
  [
   231486, 
   null, 
   "sinjin", 
   "In which case your saying he was a bad man, since by your theory it would mean jesus knowingly decieved the Jews in regards to whatt he meant when he claimed divinity, but even then he used Jewish Terms like \"I AM\" which referes to the Jewish God the personal, theistic, transcendent Creator, not the impersonal, pantheistic, immanent all of oriental or eastern religions.\nWhat he meant and how it was internalized may differ. \n \nBetween 12 & 30.... Nazareth\nHow do we know this?http://reluctant-messenger.com/issa.htm\n \nIn Eastern oriental religions God is everything, including a \"pudding\"... its not arrogant at all if you take it in context.\nThe context is trivialization, hence my comment.", 
   {}, 
   231474, 
   null, 
   1158692520.0
  ], 
  [
   231488, 
   null, 
   "johnhanks", 
   "Josh McDowell summarized the argument simply and memorably in the trilemma \"Lord, liar, or lunatic?\" Those are the only options.\n\n Always, but always, distrust any argument that tells you 'Those are the only options'. In this case it is palpably untrue: other options include 'sane, sincere and deluded' and 'gullible and manipulated', among any number of others.\n \n \nNo, the unbeliever almost always believes that Jesus was a good man, a prophet, a sage. ... If he is a sage, you must accept his essential teaching as true.\n\n No, if he was a sage - a wise person - you must accept that he was ably interpreting information available to him within the prevailing paradigms of his age. Aristotle was a sage, but most of his teachings have long since been discarded.", 
   {}, 
   231411, 
   null, 
   1158692880.0
  ], 
  [
   231490, 
   null, 
   "Kronus", 
   "\n Again it dosnt make any sanse that 12 Jews who believed in a Almighty God would create a lie to lead people away from \"the one true god\" by proclaiming an ordinary man is that God and die for that lie, especially if they believe in life after death and eternal reward or punishment for their actions...It doesnt make sense why these Jews would not only sacrafice their Physical life but also their eternal life in order to spread a myth.... When you look at it logically the argument Jesus was a myth simply dosnt hold water.\n\n \n But he wouldn't have to be a myth. He could have been a real person, not divine but extremely wise and good, who was misunderstood. I'm not saying that his followers were perpetrating a hoax or deliberate lie, their belief may have been quite sincere. They simply read too much into what Jesus was saying. Their love of him may have made his memory of him greater than the reality. They may have remembered his greatness, and then thought about the various prophesies, and said \"Oh duh! Why didn't we see it before!\" If you believe something sincerely than it's not a lie, even if it's wrong. Jesus may have never claimed divinity, he may have simply claimed to have a path to the divine. Grief and time muddled the message, and his disciples believed that he claimed divinity, and spread that message.", 
   {}, 
   231482, 
   null, 
   1158693540.0
  ], 
  [
   231497, 
   null, 
   "trebor", 
   "What you point out is one of the greatest failing of the \"Jesus-was-a-fabrication-by-his-disciples\" hoax. I can't imagine a hoax that people would die and/or be tortured for, even if there are financial gains to be made. Another failing is that a hoax of that magnitude would have to be extremely widespread to be able to pull it off, to the point of basically making it impossible. For instance, it would have been a hoax that would have been perpetrated knowingly over more than one generation by various people--such as Polycarp who was John's disciple. As well as Polycarp. And Clement. The idea that all these people got together (even if we're only counting the 12 disciples and not assuming others would have been in on it which would have had to have been the case) to perpetrate a hoax even to the point of teaching it the rest of their lives to various people without any of them ever slipping up, changing their minds, etc. becomes as ridiculous to believe than the actual tradtional beliefs of historic Christianity.\n\n \n I don't believe that people would commit suicide for what they thought was a hoax either.\n \n Yet, you had the heaven's gate cult do jut that, to hitch a ride on a comet.\n \n Does that mean that a spaceship followed the Hale-bop comet??", 
   {}, 
   231479, 
   null, 
   1158699480.0
  ], 
  [
   231505, 
   null, 
   "epaphras_faith", 
   "I don't believe that people would commit suicide for what they thought was a hoax either.\n \n Yet, you had the heaven's gate cult do jut that, to hitch a ride on a comet.\n \n Does that mean that a spaceship followed the Hale-bop comet??\n\n \n Now you've hit upon something Trebor. This is absolutely correct. What is fascinating is that there are lots of documents both religious and secular that refer to Jesus (Pliny the younger for instance) and there is not one document, not one iota of information that denies what His followers claim happened. Not one documentary piece of information showing that the tomb was not empty. That it was a hoax or anything of that kind. Those did not show up for hundreds of years. If it was a simple as the guards playing fast a loose with a body then certainly they would have produced the body to prove that he did not rise from the dead. Not recorded. If it was that he didn't really die but went into hiding, then those that saw him and watched him ascend into the sky (thousands by scriptural reference) would certainly have not died for such lunacy.\n \n The point is that those of the day did NOT point out the problems that people today refer to. Just as you today are quick to point out the hoax of the space ship behind the comet. It occurred in your lifetime and you pointed out the idiocy of it in your lifetime. As have many many many. There will be documentation of it in the distant future. \n \n This is just not in the record for the people who lived at the time of christ. No where in the record. At the time people were being martyred they were people who knew him, who saw him, the apostles for heaven sake.\n \n Your argument fails for the very reason you use. \n \n EF", 
   {}, 
   231497, 
   null, 
   1158700800.0
  ], 
  [
   231508, 
   null, 
   "jyoshu", 
   "Now you've hit upon something Trebor. This is absolutely correct. What is fascinating is that there are lots of documents both religious and secular that refer to Jesus (Pliny the younger for instance)\n\n \n To be fair, what you say is not the case . . . there are NOT lots of secular documents that refer to Jesus from early on. And the Pliny letter refers to early Christians, not Christ directly. That said, I'm not saying these aren't reasonable forms of evidence that Jesus existed. The only possibly valid secular sources I know of that directly refer to Jesus are Josephus and Tacitus. And if you use Josephus, you're going to run into the common argument that the passage in Josephus was a later fabrication which of course may or may not be true. The Tacitus passage however, is pretty straightforward. Regardless, that's only 2 that refer to Jesus, there are other that refer to early followers of Jesus.\n \n As far as I'm concerned, the 4 gospels are evidence in and of themselves that Jesus was a real person. It's unfortunate that Christian apologetics has allowed the idea to grow out there that these works themselves aren't evidence as such, because to say they're not is a double standard. It's like saying we should not take any hieroglyphs found in Egypt as evidence of the existence of pharoahs when they mention them, on the basis that those hieroglyphs also have religious messages and themes as well. The whole idea that something being a religious document automatically invalidates it as evidence for the existence of people, places, or certain events accounted for in that document is downright fallacious.", 
   {}, 
   231505, 
   null, 
   1158702180.0
  ], 
  [
   231510, 
   null, 
   "INRI", 
   "What he meant and how it was internalized may differ.\n\n \n \nBut he wouldn't have to be a myth. He could have been a real person, not divine but extremely wise and good, who was misunderstood. I'm not saying that his followers were perpetrating a hoax or deliberate lie, their belief may have been quite sincere. They simply read too much into what Jesus was saying.\n\n \n Plausabe on many things but on the topic of his divinity, thats a very real improbability. Jesus was a Jew he was brought up a jew he was taught the jewish religion from a very early age \"the scriptures were never out of his mouth\" Jesus would have known exactly what he was saying and how his followers (fellow jews) were interperating it. In fact he at one point he asks them outright, \"Who do you say I AM\" and peter tells him he is the son of the living God in other words this jew was saying that Jesus shared the same nature of God, same divine nature as God. Jesus Said \"The father and I are one and the same\" he uses the term father a clear reference to the jewish understanding of God as creator in other words he says he is one with and the same as the creator...he is saying he is the creator.\n \n Its beyond reason to think that perhaps the followers of Jesus misinterpretated his teaching on his divine nature or internalized it wrong.\n \n \nI don't believe that people would commit suicide for what they thought was a hoax either.\n \n Yet, you had the heaven's gate cult do jut that, to hitch a ride on a comet.\n\n \n lunatic, the man was insane...are you saying Jesus was insane?", 
   {}, 
   231508, 
   null, 
   1158703740.0
  ], 
  [
   231512, 
   null, 
   "Kronus", 
   "Plausabe on many things but on the topic of his divinity, thats a very real improbability. Jesus was a Jew he was brought up a jew he was taught the jewish religion from a very early age \"the scriptures were never out of his mouth\" Jesus would have known exactly what he was saying and how his followers (fellow jews) were interperating it.\n\n I don't care how wise or smart or devout you are, there's no way you can be sure what someone's going to do with your words after you're gone. If we posit that Jesus was just a man than there's no way he could predict just what effect his words would have. He was clearly striving to change people, and people being the wacky things that they are you can't know for sure what shape that change will take.\n \n \n\n In fact he at one point he asks them outright, \"Who do you say I AM\" and peter tells him he is the son of the living God in other words this jew was saying that Jesus shared the same nature of God, same divine nature as God.\n\n The only absolute fact we have is that the Bible says that Jesus and Peter said that. We don't know for sure what he actually said. Nothing he said was written down until well after he died. Who knows how much grief, group think, and faulty memory led to having Jesus' words embellished?\n \n \n\n Its beyond reason to think that perhaps the followers of Jesus misinterpretated his teaching on his divine nature or internalized it wrong.\n \n\n People will kill themselves because a nutjob tells them to. Given that it's not beyond reason to think that people could think anything. (That's a comment on people and not on Jesus, in case anyone didn't catch that) It's utterly plausible that Jesus was trying to teach them about the divine, and then after his death, in their grief and loss, they felt that he was actually telling them that he was divine. Put yourself in their shoes. If he was just a man than their teacher and friend was lost to them forever. But if all the stories he told them about the divine was his secret way of revealing his divinity to them, than he's not really gone at all! He was telling them about the divine, he kept saying to act like him, he kept saying that his was the way to divinity. So sure, he's not really dead, because he was divine, and you can't kill the divine! I've seen and heard of people grasping at much flimsier straws than that in the depths of their sorrow, so I can't see how you think it's beyond reason for it to have happened that way.", 
   {}, 
   231510, 
   null, 
   1158705240.0
  ], 
  [
   231518, 
   null, 
   "INRI", 
   "I don't care how wise or smart or devout you are, there's no way you can be sure what someone's going to do with your words after you're gone. If we posit that Jesus was just a man than there's no way he could predict just what effect his words would have. He was clearly striving to change people, and people being the wacky things that they are you can't know for sure what shape that change will take.\n\n \n Not very wise, not very smart and I could be more devout.\n \n It doesnt make sense Jews dont just mistake a man for the \"unseen\" God, If your father, mother, son, brother, sister ect died all the grief in the world wouldnt make you believe he was God.\n \n \nThe only absolute fact we have is that the Bible says that Jesus and Peter said that. We don't know for sure what he actually said. Nothing he said was written down until well after he died. Who knows how much grief, group think, and faulty memory led to having Jesus' words embellished?\n\n \n If that is the case, if his apostles mixed up their masters teaching Jesus is the biggest failure known to mankind an idiot for putting his trust in \"fishermen\" but their testimony has changed the world, inspired millions to lead a Good life and still at the end of the day these Jews who believed in the \"unseen God\" the God who denounces Graven images and false Idols should mistake a mere human being with The same eternal God.... is not misinterpretation but sheer lunacy.\n \n Jesus was a failure and his apostles lunatics?\n \n \n \nI can't see how you think it's beyond reason for it to have happened that way.\n\n \n \n Again you need to remember their background as Jews, their beliefs about the Eternal God and how absurd it would be for a Jew to mistake creature for creator. Also you have to remember these men followed Jesus before he was crucified, when they were not suffering grief they obviously believed he was the messiah, the son of God fortold in their own Jewish Scriptures.\n \n The NT was finished some 60 years after the death of Christ do you really believe that these people were still so much in grief that they continued to mistake a man for the unseen God...No, your theory is highly unlikely.", 
   {}, 
   231512, 
   null, 
   1158707520.0
  ], 
  [
   231519, 
   null, 
   "sinjin", 
   "Not very wise, not very smart and I could be more devout.\n \n It doesnt make sense Jews dont just mistake a man for the \"unseen\" God, If your father, mother, son, brother, sister ect died all the grief in the world wouldnt make you believe he was God.\n \n \n \n If that is the case, if his apostles mixed up their masters teaching Jesus is the biggest failure known to mankind an idiot for putting his trust in \"fishermen\" but their testimony has changed the world, inspired millions to lead a Good life and still at the end of the day these Jews who believed in the \"unseen God\" the God who denounces Graven images and false Idols should mistake a mere human being with The same eternal God.... is not misinterpretation but sheer lunacy.\n \n Jesus was a failure and his apostles lunatics?\n \n \n \n \n \n Again you need to remember their background as Jews, their beliefs about the Eternal God and how absurd it would be for a Jew to mistake creature for creator. Also you have to remember these men followed Jesus before he was crucified, when they were not suffering grief they obviously believed he was the messiah, the son of God fortold in their own Jewish Scriptures.\n \n The NT was finished some 60 years after the death of Christ do you really believe that these people were still so much in grief that they continued to mistake a man for the unseen God...No, your theory is highly unlikely.\nJews will tell you the apostles were mistaken. The only thing \"beyond reason\" is your faith.emoticon_xangel", 
   {}, 
   231518, 
   null, 
   1158708120.0
  ], 
  [
   231521, 
   null, 
   "INRI", 
   "Jews will tell you the apostles were mistaken.\n\n \n \n Exactly... that reinforces my point.", 
   {}, 
   231519, 
   null, 
   1158708420.0
  ], 
  [
   231523, 
   null, 
   "Easyrider", 
   "THE DEITY OF CHRIST\n \n 1. Jesus existed in the beginning (John 1:1; Philip 2:6; Rev. 19:13; Micah 5:2).\n 2. He was with God (John 1:1).\n 3. He is God, the Son (John 1:1; Rom. 9:5; Heb. 1:8, 10; I John 5:20).\n 4. He is God manifest in the flesh (John 20:28; I Tim. 3:16; Col. 2:9; Acts 20:28; Heb. 1:8).\n 5. He is God foretold (Isaiah 9:6; Psalm 45:6).\n 6. He is Immanuel, God with us (Isaiah 7:14; Matthew 1:23).\n 7. He is the true God (I John 5:20 with Titus 2:13; Romans 9:5).\n 8. He is the great God (Titus 2:13).\n 9. He is God our Savior (II Peter 1:1).\n 10. He existed in the form of God before His incarnation and was equal with God the Father \n (Philippians 2:5-7).\n 11. He is the only wise God (Jude 25).\n 12. He is omnipotent over disease. (Matthew 8:1-4; Luke 4:39)\n 13. He is omnipotent over demons. (Matthew 8:16-17; Luke 4:35)\n 14. He is omnipotent over nature. ((Matthew 8:26)\n 15. He is omnipotent over death. (Luke 7:14-15; John 11:25)\n 16. He is omniscient, knowing the hearts of the Pharisees. (Matthew 12:25;\n Luke 5:22; 6:8; 7:39-40)\n 17. He knew the thoughts of the scribes. (Matthew 9:3-4)\n 18. He knew the history of the Samaritan woman. (John 4:24)\n 19. He is omnipresent. (Matthew 18:20; 28:20; John 3:13; 14:20)\n 20. He was worshiped as God by the angels (Hebrews 1:6); worshiped as\n God by the wise men (Matthew 2:2); worshiped as God by the shepherds\n (Luke 2:15); worshiped as God by a ruler (Matthew 9:18); worshiped as\n God by Thomas (John 20:28); worshiped as God by the apostles (Matthew\n 14:33; 28:9).\n 21. He forgives sins. (Mark 2:5)\n 22. He saves. (Matthew 18:11; John 10:28).\n 23. He judges. (John 5:22)\n 24. Paul, Peter, Jude, James, and John called Him God. (Galatians 2:20; 1 Peter\n 3:22; Jude 25; James 2:1; I John 5:20; Revelation 1:18; 19:16)\n 25. He is God's Son, who was sent to bring us eternal life. (John 3:16)\n 26. He arose from death in the flesh (John 20:26-28; Luke 24:39-43; I John 4:2-3). \n 27. One with the Father (John 10:30).", 
   {}, 
   231521, 
   null, 
   1158708900.0
  ], 
  [
   231524, 
   null, 
   "sinjin", 
   "Exactly... that reinforces my point.\n\n emoticon_confused I believe Jesus attempted to communicate his wisdom to uneducated country rubes. What happened next was beyond his control. Is his message less worthy if he was a man like other men? Not for me but I do not believe in the divine.", 
   {}, 
   231521, 
   null, 
   1158711060.0
  ], 
  [
   231537, 
   null, 
   "trebor", 
   "To be fair, what you say is not the case . . . there are NOT lots of secular documents that refer to Jesus from early on. And the Pliny letter refers to early Christians, not Christ directly. That said, I'm not saying these aren't reasonable forms of evidence that Jesus existed. The only possibly valid secular sources I know of that directly refer to Jesus are Josephus and Tacitus. And if you use Josephus, you're going to run into the common argument that the passage in Josephus was a later fabrication which of course may or may not be true. The Tacitus passage however, is pretty straightforward. Regardless, that's only 2 that refer to Jesus, there are other that refer to early followers of Jesus.\n \n As far as I'm concerned, the 4 gospels are evidence in and of themselves that Jesus was a real person. It's unfortunate that Christian apologetics has allowed the idea to grow out there that these works themselves aren't evidence as such, because to say they're not is a double standard. It's like saying we should not take any hieroglyphs found in Egypt as evidence of the existence of pharoahs when they mention them, on the basis that those hieroglyphs also have religious messages and themes as well. The whole idea that something being a religious document automatically invalidates it as evidence for the existence of people, places, or certain events accounted for in that document is downright fallacious.\n\n \n I am extremely sure that the Antiquiteis 18 is a total interpolition. That is because that Origen, when using that very same book to get source material \n about John the Baptist, was apparently unaware of the reference. \n \n In any case, Jospehus was writing in 93 C.E. .. long after the claimed events.", 
   {}, 
   231508, 
   null, 
   1158725700.0
  ], 
  [
   231539, 
   null, 
   "jyoshu", 
   "I am extremely sure that the Antiquiteis 18 is a total interpolition. That is because that Origen, when using that very same book to get source material \n about John the Baptist, was apparently unaware of the reference. \n\n \n Only that copy. There was another copy found by Shlomo Pines in an Arabic version that did not have the interpolation, but still mentioned Jesus. It left out parts like \"he was the Christ\" that the interpolated version had, but the simple mentionings of Jesus were still there.\n \n And Josephus also mentions Jesus in Antiquities 20.", 
   {}, 
   231537, 
   null, 
   1158726720.0
  ], 
  [
   231564, 
   null, 
   "trebor", 
   "Only that copy. There was another copy found by Shlomo Pines in an Arabic version that did not have the interpolation, but still mentioned Jesus. It left out parts like \"he was the Christ\" that the interpolated version had, but the simple mentionings of Jesus were still there.\n \n And Josephus also mentions Jesus in Antiquities 20.\n\n \n Yes, I know. I am reasonably sure that is a copiers gloss. \n \n The problem with the Arabic vefsion is that it was from a predominately Muslim country , and from the 10th century. Of course the muslims would modify it not to be so 'pro christian'.\n \n Now, if you could find a copy from before Euribus got a hold of it...", 
   {}, 
   231539, 
   null, 
   1158761760.0
  ], 
  [
   231597, 
   null, 
   "johnhanks", 
   "The only possibly valid secular sources I know of that directly refer to Jesus are Josephus and Tacitus. And if you use Josephus, you're going to run into the common argument that the passage in Josephus was a later fabrication which of course may or may not be true.\n\n \n Very few disinterested observers would support the veracity of the Josephus passage. That would involve accepting that Jospehus, a devout Jew, uttered the most extreme blasphemy in stating 'He was the Messiah.' Even if we can swallow that, there is the inexplicable fact of his remaining a Jew whilst asserting the truth of christianity.", 
   {}, 
   231508, 
   null, 
   1158777360.0
  ], 
  [
   231603, 
   null, 
   "Jo Bennett", 
   "I don't see how remaining a Jew and believing Jesus was the messiah are incompatible. For all such a belief may have been exploited by the Christian right, there have been many Jews who have become Christians, I seem to recall the Copts are one such group. \n \n In addition, there are no such thing as disinterested observers in this situation; there are believers and non-believers.", 
   {}, 
   231597, 
   null, 
   1158778260.0
  ], 
  [
   231605, 
   null, 
   "trebor", 
   "I don't see how remaining a Jew and believing Jesus was the messiah are incompatible. For all such a belief may have been exploited by the Christian right, there have been many Jews who have become Christians, I seem to recall the Copts are one such group. \n \n In addition, there are no such thing as disinterested observers in this situation; there are believers and non-believers.\n\n \n I am sorry, but I do see how remaining a Jew, and believing Jesus is the messiah is incompatable.. at least the CHristian concept of the Messiah.\n \n The jewish concept is quite different. Beliving that Jesus was god/part of the trinity/etc etc is incompatible", 
   {}, 
   231603, 
   null, 
   1158779340.0
  ], 
  [
   231611, 
   null, 
   "jyoshu", 
   "I am sorry, but I do see how remaining a Jew, and believing Jesus is the messiah is incompatable.. at least the CHristian concept of the Messiah.\n \n The jewish concept is quite different. Beliving that Jesus was god/part of the trinity/etc etc is incompatible\n\n \n It's no more incompatible than your self-claims of being Jewish, and yet beliving the things you do about religion and God (since the Jewish concept is quite different from your views as well). Being Jewish is often considered a cultural/ethnic identity, not necessarily a religious one (though it can be that as well).", 
   {}, 
   231605, 
   null, 
   1158782460.0
  ], 
  [
   231612, 
   null, 
   "INRI", 
   "I am sorry, but I do see how remaining a Jew, and believing Jesus is the messiah is incompatable\n\n \n It isnt. As a catholic I know my faith is entirely Jewish, we worship a Jew, our religion was started by Jews, I believe in the Jewish scriptures..In essence I am only a Jew who accepts Jesus as the messiah.", 
   {}, 
   231611, 
   null, 
   1158783780.0
  ], 
  [
   231614, 
   null, 
   "sinjin", 
   "It isnt. As a catholic I know my faith is entirely Jewish, we worship a Jew, our religion was started by Jews, I believe in the Jewish scriptures..In essence I am only a Jew who accepts Jesus as the messiah.\nAnd eats pork and shellfish.emoticon_xclown", 
   {}, 
   231612, 
   null, 
   1158784860.0
  ], 
  [
   231625, 
   null, 
   "Jo Bennett", 
   "I find your attitude very odd, trebor. I've heard the same thing from another Jew I discussed it with, and I don't see how someone can be an atheist and still be Jewish, but not be a Christian and still be Jewish.", 
   {}, 
   231614, 
   null, 
   1158791460.0
  ], 
  [
   231634, 
   null, 
   "INRI", 
   "And eats pork and shellfish\n\n \n Its not what a man puts into his body that makes him unlean, but what comes forth from his heart.", 
   {}, 
   231625, 
   null, 
   1158797100.0
  ], 
  [
   231728, 
   null, 
   "johnhanks", 
   "I don't see how remaining a Jew and believing Jesus was the messiah are incompatible. For all such a belief may have been exploited by the Christian right, there have been many Jews who have become Christians, I seem to recall the Copts are one such group.\n\n Jo, the two embolded assertions in your post are diametrical opposites; yet you seem to be using the second to bolster the validity of the first.\n \n It is a tenet of Judaism (I believe - please correct if wrong) that the Messiah has not yet come. If you believe Jesus was the messiah, you are outside Judaism.\n \n \nI don't see how someone can be an atheist and still be Jewish, but not be a Christian and still be Jewish.\n\n When I wrote about Josephus 'remaining a Jew', I meant - and assumed everybody would realise I meant - a religiously observant Jew. If you embrace the teachings of Christianity, you cannot be a religiously observant Jew.", 
   {}, 
   231603, 
   null, 
   1158864960.0
  ], 
  [
   231733, 
   null, 
   "Jo Bennett", 
   "What happens when the Messiah comes, then? Will there no longer be any Jews? I don't think so. Yes, the coming of the Messiah is an important part of Judaism, but I don't see how it is contradictory for a Jew to believe that the Messiah has come, and that the Messiah is Jesus Christ. I fully accept that there are very few in the world today who are in this situation (depending on what you believe the so-called \"Jews for Jesus\" are really about) but is it likely that in the 1st or 2nd century AD every Jewish Christian would have ceased to call themselves Jewish?", 
   {}, 
   231728, 
   null, 
   1158865800.0
  ], 
  [
   231735, 
   null, 
   "jyoshu", 
   "What happens when the Messiah comes, then? Will there no longer be any Jews? I don't think so. Yes, the coming of the Messiah is an important part of Judaism, but I don't see how it is contradictory for a Jew to believe that the Messiah has come, and that the Messiah is Jesus Christ. I fully accept that there are very few in the world today who are in this situation (depending on what you believe the so-called \"Jews for Jesus\" are really about) but is it likely that in the 1st or 2nd century AD every Jewish Christian would have ceased to call themselves Jewish?\n\n \n in fact, there is a case in the NT where Peter gets reprimanded by Paul for showing favoritism toward the Jewish Christians as opposed to the Gentile ones, as I recall.", 
   {}, 
   231733, 
   null, 
   1158868980.0
  ], 
  [
   231738, 
   null, 
   "trebor", 
   "What happens when the Messiah comes, then? Will there no longer be any Jews? I don't think so. Yes, the coming of the Messiah is an important part of Judaism, but I don't see how it is contradictory for a Jew to believe that the Messiah has come, and that the Messiah is Jesus Christ. I fully accept that there are very few in the world today who are in this situation (depending on what you believe the so-called \"Jews for Jesus\" are really about) but is it likely that in the 1st or 2nd century AD every Jewish Christian would have ceased to call themselves Jewish?\n\n \n \n There are strong indications that by the end of the first century, those people who considered themselves Christians were not welcome in Jewish synoguges.", 
   {}, 
   231733, 
   null, 
   1158872880.0
  ], 
  [
   231746, 
   null, 
   "Jo Bennett", 
   "I agree, but then protestants weren't particularly welcome in catholic churches after the reformation.", 
   {}, 
   231738, 
   null, 
   1158875400.0
  ], 
  [
   231748, 
   null, 
   "electrolyte", 
   "There are strong indications that by the end of the first century, those people who considered themselves Christians were not welcome in Jewish synoguges.\nI agree, but then protestants weren't particularly welcome in catholic churches after the reformation.\n\n And of course, the various Protestant-spinoff cults in my area refuse even to consider Catholicism a form of Christianity... So it seems to me the question(s) should be: where does one draw the line between religions (and is that line reasonable)?", 
   {}, 
   231746, 
   null, 
   1158877560.0
  ], 
  [
   231751, 
   null, 
   "Jo Bennett", 
   "I tend to think the best you can do is self-definition. I don't think I have the right, however much logic may demand it, to say that the US Christian Right is not Christian. Nor do I have the right to say that the JWs aren't Christian, however bizarre I may think some of their doctrines. Similarly I think if someone honestly beleives themself to be Jewish, then what right do I, or anyone else, have to contradict them. Yes this can be silly, but the alternatives all end up with the \"no true scotsman\" fallacy or worse.", 
   {}, 
   231748, 
   null, 
   1158878280.0
  ], 
  [
   231764, 
   null, 
   "Kronus", 
   "Similarly I think if someone honestly beleives themself to be Jewish, then what right do I, or anyone else, have to contradict them. Yes this can be silly, but the alternatives all end up with the \"no true scotsman\" fallacy or worse.\n\n \n I would say it depends on the structure of the group you claim to belong to. Christianity is so fractured, with some many different sects with so many different doctrines, that one would have to be pretty far out to be clearly \"not Christian\". But if someone claimed that it was his duty as a Christian to beat puppies to death with kittens, I would say he was wrong and feel comfortable with that stance. I don't know alot of the heirarchy of Judaism, but I do know that it's much less fractured than Christianity is, and I do believe that they have actual rules and guidelines that you must pass to be considered Jewish. For example, I have a friend who is Jewish in every way you can imagine, except that his mother isn't Jewish. That apparently disqualifies him, and so by the Jewish rules to which he adheres, he can't call himself Jewish. So with Christianity, which has no central body, I agree that it's tough to say what qualifies you. But if a religion is cohesive and centralized, and has a governing body that cares about that sort of thing, then I would say they get to decide who is or isn't a member of their religion.", 
   {}, 
   231751, 
   null, 
   1158881640.0
  ], 
  [
   231768, 
   null, 
   "INRI", 
   "Speaking of how fractured Christianity is. It really is heart renching for me to see it. I wonder how many people are put off or have less respect for Christianity by it. I would imagine a lot of non Christians see the disunity that way.", 
   {}, 
   231764, 
   null, 
   1158882600.0
  ], 
  [
   231813, 
   null, 
   "electrolyte", 
   "I tend to think the best you can do is self-definition.\n\n \nI would say it depends on the structure of the group you claim to belong to.\n\n Jo, while your \"no true Scotsman\" point has merit, I've got to lean more toward Kronus's idea. After all, if I say I'm a Hindu because I believe that Allah is the only deity, am I really a Hindu? After all, we're not talking about classification after the fact, as in, \"Well, he may have claimed to be a Christian, but a True Christian\u0099 would never murder eleven people.\"\n I often think of a Christian as one who accepts Jesus of Nazareth as the divine Christ. If you do that, you're a Christian, regardless of peripherals. Whether it is a Christian's duty to beat puppies to death with kittens is something one will probably have a hard time convincing others. Maybe someone thinks that this Jesus fellow was a great guy with good ideas, but doesn't consider Jesus either divine or a messiah; this person would not fit the definition of Christian, in my opinion, even if his or her behavior and other beliefs were largely consistent with that of bona fide, mainstream Christians.\n But maybe I'm oversimplifying. I'm open to more discussion on this topic.", 
   {}, 
   231764, 
   null, 
   1158904740.0
  ], 
  [
   231817, 
   null, 
   "jyoshu", 
   "Jo, while your \"no true Scotsman\" point has merit, I've got to lean more toward Kronus's idea. After all, if I say I'm a Hindu because I believe that Allah is the only deity, am I really a Hindu? After all, we're not talking about classification after the fact, as in, \"Well, he may have claimed to be a Christian, but a True Christian\u0099 would never murder eleven people.\"\n\n \n 3 thoughts, if I may . . .\n I still think it's important to point out that being Jewish isn't necessarily only a religious identity, but a cultural/ethnic/family one.And Christian Jews that I know of still participate in Jewish traditions, feasts, and customs. They observe the Passover, Shabbat, Hannakah, bar mitzvahs, etc. They still worship Yahweh, just like other Jews. Would you really tell someone who observes all these things regularly and was born and raised in a Jewish family that they aren't Jewish just because they happen to believe the messiah has come? Both religions share Yahweh worship. So I think comparing this to a Hindu worshipping Allah doesn't really fit. A better comparison might be Mormons who claim to be Christian. Mormonism uses much of the same scripture and practices as Christianity (Christians and Jews use much of the same scripture), yet Mormons also hold to the coming of another individual from God which is central to the Mormon faith. Yet despite these differences, many consider Mormons to be a Christian sect.Finally, if people ultimately define their own worship and religion, then it seems to me that if someone says they are a Christian Jew then that's good enough on the basis that they self-describe themselves as such and by their practices. No one can truly force someone to believe or disbelieve ideology--if a person wants to be a Christian Jew and oberseves both those religions to some degree, then that's what they are. Ultimately the deciding factor is what people say they are, particularly when they observe tenets of both religions, thereby demonstrating being active in both. When someone cofesses Christ, goes to church, prays, sings Christian hymns, reads the Bible, and says they are a Christian, then it seems to me they are a Christian even if for some reason the Church says they aren't. So if someone observes both Christian practices AND Jewish ones, and says they are a \"Christian Jew\", it seems to me they are a Christian Jew even if Jewish religious authorities say they aren't. There's no 'Christian Jew standard' or committee that defines some all-powerful rule here. If people say that's what they are, then that's what they are. And I think what helps is that these are very compatible religions--they both have Yahweh worship. That's why it would not work so well for there to be a, say, Hindu Jew. Certainly it would be far, far less likely; and self-described Christian Jews are not that uncommon.", 
   {}, 
   231813, 
   null, 
   1158906360.0
  ], 
  [
   231835, 
   null, 
   "Kronus", 
   "Speaking of how fractured Christianity is. It really is heart renching for me to see it. I wonder how many people are put off or have less respect for Christianity by it. I would imagine a lot of non Christians see the disunity that way.\n\n \n I, for one, believe that different paths can lead to the same destination. I don't see the fact that there are lots of branches of Christianity as inherently problamatic. What does lower my respect is when one branch or person claims that their way is the only possible correct way. That just smacks of hubris to me.", 
   {}, 
   231768, 
   null, 
   1158938400.0
  ], 
  [
   231870, 
   null, 
   "Easyrider", 
   "I, for one, believe that different paths can lead to the same destination. I don't see the fact that there are lots of branches of Christianity as inherently problamatic. What does lower my respect is when one branch or person claims that their way is the only possible correct way. That just smacks of hubris to me.\n\n \n Seems to me your \"all paths\" excludes Jesus' \"one way,\" and that view in your thinking is the \"only possible correct way\". So, how are you different?", 
   {}, 
   231835, 
   null, 
   1158953640.0
  ], 
  [
   231880, 
   null, 
   "epaphras_faith", 
   "I, for one, believe that different paths can lead to the same destination. I don't see the fact that there are lots of branches of Christianity as inherently problamatic. What does lower my respect is when one branch or person claims that their way is the only possible correct way. That just smacks of hubris to me.\n\n \n \n Apparently not all paths. My path which claims that there is only one way does not fit into YOUR concept. So you are essentially saying that you are right and I am wrong. Interesting.\n \n EF", 
   {}, 
   231835, 
   null, 
   1158956280.0
  ], 
  [
   231899, 
   null, 
   "Jo Bennett", 
   "But if someone claimed that it was his duty as a Christian to beat puppies to death with kittens, I would say he was wrong and feel comfortable with that stance.\n\n \n You're missing a subtle distinction. I completely agree with this statement, but that is not the same as saying that, because of this belief, that person is not a Christian.\n \n Incidentally Muslim scholars have historically believed that Hindus worship the same God as they do, as Hindu theology is monotheist, so there is not necessarily a contradiction between worshipping Allah and being a Hindu. This is what allowed Islam to expand into India peacefully.\n \n By any normal standard of Christian doctrine, Mormons and JWs are not Christians, but I don't consider that I have the right to exclude them simply because they disagree with me. I will spend time discussing with them and trying to persuade them, but ultimately God decides who are the \"true\" Christians, and I suspect He'll be casting a pretty wide net.", 
   {}, 
   231880, 
   null, 
   1158967680.0
  ], 
  [
   231901, 
   null, 
   "epaphras_faith", 
   "You're missing a subtle distinction. I completely agree with this statement, but that is not the same as saying that, because of this belief, that person is not a Christian.\n \n Incidentally Muslim scholars have historically believed that Hindus worship the same God as they do, as Hindu theology is monotheist, so there is not necessarily a contradiction between worshipping Allah and being a Hindu. This is what allowed Islam to expand into India peacefully.\n \n By any normal standard of Christian doctrine, Mormons and JWs are not Christians, but I don't consider that I have the right to exclude them simply because they disagree with me. I will spend time discussing with them and trying to persuade them, but ultimately God decides who are the \"true\" Christians, and I suspect He'll be casting a pretty wide net.\n\n \n I would tend to agree. After all jesus said \"by this, all men will know you are my disciples, your love for one another\".\n \n Love is the earmark of a christian. Does that mean christians can't be hateful, no. It simply means what the word actually means. Christian means \"christ like\". Jesus displayed love. But the ultimate is that God is the one who decides. He is really the only one who can. He is the only one with the ability to do such a thing.\n \n Men often think they do and then they engage in judgement, defined as declaring a person's eternal fate.\n \n EF", 
   {}, 
   231899, 
   null, 
   1158971820.0
  ], 
  [
   231926, 
   null, 
   "johnhanks", 
   "I fully accept that there are very few in the world today who are in this situation (depending on what you believe the so-called \"Jews for Jesus\" are really about)...\n\n They are first and foremost the creation of the Southern Baptist Convention.\n \n \n... but is it likely that in the 1st or 2nd century AD every Jewish Christian would have ceased to call themselves Jewish?\n\n If you look back to post #31, you'll note that I wasn't bothered about what Josephus called himself, but about the religion he practised; which was main-line Judaism. The main objection to the authenticity of the Testimonium Flavianum has to be that it would have Josephus adulating Jesus and enthusing about his supernatural status, whilst not actually adopting christianity as his own faith. The adulation is also at odds with Josephus' otherwise scathing comments about messianic cultists.", 
   {}, 
   231733, 
   null, 
   1159001880.0
  ], 
  [
   231937, 
   null, 
   "Kronus", 
   "Seems to me your \"all paths\" excludes Jesus' \"one way,\" and that view in your thinking is the \"only possible correct way\". So, how are you different?\n\n \n That was almost a serious question on your part, and I'm almost tempted to try to answer you, but you clearly have so many assumptions about what I think that aren't accurate that I really doubt it would be worth the effort.", 
   {}, 
   231870, 
   null, 
   1159024560.0
  ], 
  [
   231941, 
   null, 
   "Kronus", 
   "Apparently not all paths. My path which claims that there is only one way does not fit into YOUR concept. So you are essentially saying that you are right and I am wrong. Interesting.\n \n EF\n\n \n Your path seems to have two components. First, whatever it is that brings you to Jesus. Second, denial of all other paths. I have no problems with the first aspect of your path, but for the second? Well, yes, I do think you're wrong, or at least probably wrong. I don't have a problem with people thinking differently than I do, or disagreeing with me. I recognize that I could be wrong, that's the crux here. If you want to say that FOO is the way to Jesus than that's fine with me, for most values of FOO. (no genocide, for example) I don't have enough ego to claim that I know better than any other mortal what's on God's mind. If you're claiming that FOO, and only FOO is the way to Jesus, than you are claiming to have a greater insight into the divine than the bulk of humanity. Sorry, but I don't buy it. If there was only one narrow path than God would have made that path clear, and if that was the case than a majority of humanity would be on that path. But there is no majority religion, and whatever your particular take is EF I can state with some assurance that only a tiny fraction of the world's population follows it. Is that really how you think God would set things up?", 
   {}, 
   231880, 
   null, 
   1159025640.0
  ], 
  [
   231944, 
   null, 
   "billsco", 
   "Your path seems to have two components. First, whatever it is that brings you to Jesus. Second, denial of all other paths. I have no problems with the first aspect of your path, but for the second? Well, yes, I do think you're wrong, or at least probably wrong. I don't have a problem with people thinking differently than I do, or disagreeing with me. I recognize that I could be wrong, that's the crux here. If you want to say that FOO is the way to Jesus than that's fine with me, for most values of FOO. (no genocide, for example) I don't have enough ego to claim that I know better than any other mortal what's on God's mind. If you're claiming that FOO, and only FOO is the way to Jesus, than you are claiming to have a greater insight into the divine than the bulk of humanity. Sorry, but I don't buy it. If there was only one narrow path than God would have made that path clear, and if that was the case than a majority of humanity would be on that path. But there is no majority religion, and whatever your particular take is EF I can state with some assurance that only a tiny fraction of the world's population follows it. Is that really how you think God would set things up?\n\n \n Yes, that's indeed how God set it up, at least in the Christian's mind. He (the Christian) reads in his scriptures how wide and trodden the road to hell is, and how narrow the path is that leads to heaven. He believes hardly a blade of grass is bent to distinguish the trail. This is all quite satisfactory to the Christian, since he assuredly knows he'll be on the road less traveled. This scheme strikes me as quite elitist on the mortal's part, and heinous on the Immortal's part.", 
   {}, 
   231941, 
   null, 
   1159027320.0
  ], 
  [
   231967, 
   null, 
   "jyoshu", 
   "They are first and foremost the creation of the Southern Baptist Convention.\n\n \n As an official organization. Not as Christian Jews.", 
   {}, 
   231926, 
   null, 
   1159051980.0
  ], 
  [
   231976, 
   null, 
   "trebor", 
   "As an official organization. Not as Christian Jews.\n\n \n \n \"Christian Jews\" is an oxymoron.\n \n THe J4J is an Christian evangalsitic organisation that is dedicated to the destruction of the Jewish religion.", 
   {}, 
   231967, 
   null, 
   1159055940.0
  ], 
  [
   231978, 
   null, 
   "Kronus", 
   "Yes, that's indeed how God set it up, at least in the Christian's mind. He (the Christian) reads in his scriptures how wide and trodden the road to hell is, and how narrow the path is that leads to heaven. He believes hardly a blade of grass is bent to distinguish the trail. This is all quite satisfactory to the Christian, since he assuredly knows he'll be on the road less traveled. This scheme strikes me as quite elitist on the mortal's part, and heinous on the Immortal's part.\n\n \n Which is one of the primary reasons I can't believe it's the way things really work. If God is good than the system you describe, and which many people follow, can't be the real one.", 
   {}, 
   231944, 
   null, 
   1159058400.0
  ], 
  [
   231985, 
   null, 
   "jyoshu", 
   "\"Christian Jews\" is an oxymoron.\n\n \n Not according to Jews who have also become Christian.", 
   {}, 
   231976, 
   null, 
   1159061280.0
  ], 
  [
   231986, 
   null, 
   "jyoshu", 
   "Which is one of the primary reasons I can't believe it's the way things really work. If God is good than the system you describe, and which many people follow, can't be the real one.\n\n \n The problem I have with that view is that some people like yourself assume that God (a being which, by definition, would set rules of reality and morality, not be under them) has to conform to a standard of what you view \"good\" as being. Who says God has to abide by same rules he sets for mankind? If God is \"good\" in the sense you think He should be \"good\", then there would also be no natural disasters that kill people. Natural death wouldn't even be an issue, and poverty would not exist. Exclusivity wouldn't exist in ANY context, not just that of eternal life. So if we accept that God exists (and I understand you may not--but most people do) then we have to accept that God, for whatever reason, does not necessarily conform to what we think good should be. Maybe there are deeper, unknown-to-us reasons as to why there things exist, and as to why every religion doesn't lead to eternal life. He has to be a being that, for whatever reason, has decided that universe as we know it involves some degree (in fact a significant degree) of inequality and exclusivity.\n \n Universalism may be attractive to someone who doesn't want to accept any ONE view of religion, but arguing for it from the standpoint of God being \"good\" (at least our understanding of \"good\") doesn't add up. If you reject only Christianity based on the idea that God doesn't conform to your view of what's \"good\" because there's an exclusivity to it, then you'd have to reject all of religion and belief in God in every way on the basis that God doesn't conform to your view of \"good\" in other ways as well.\n \n The Christian religion has dealt with this issue since its beginning, and its way to deal with this is through the idea of the sinful fall of humankind, and atonement. And IMO there is plenty in the Bible to support that way of thinking.", 
   {}, 
   231978, 
   null, 
   1159062240.0
  ], 
  [
   232035, 
   null, 
   "johnhanks", 
   "The Christian religion has dealt with this issue since its beginning, and its way to deal with this is through the idea of the sinful fall of humankind, and atonement.\n\n \n Re-phrased: the Christian religion has desperately tried to rationalise this issue since its beginning. The whole farrago of a god which has to incarnate itself and sacrifice itself to itself before it can forgive humankind for a crime into which it itself entrapped them makes no sense whatsoever as a logical proposition, only as ad hoc rationalisation.", 
   {}, 
   231986, 
   null, 
   1159090860.0
  ], 
  [
   232099, 
   null, 
   "jyoshu", 
   "Re-phrased: the Christian religion has desperately tried to rationalise this issue since its beginning. The whole farrago of a god which has to incarnate itself and sacrifice itself to itself before it can forgive humankind for a crime into which it itself entrapped them makes no sense whatsoever as a logical proposition, only as ad hoc rationalisation.\n\n \n What you describe as a 'rationalization' is the heart and soul of the Christian religion. It's not just Christianity rationalizing an issue, it IS Christianity. The Christian view IS that humankind is sinful and needs saving.", 
   {}, 
   232035, 
   null, 
   1159129680.0
  ], 
  [
   232106, 
   null, 
   "thelmoose", 
   "You religious guys and your bloated diatribes.\n \n You think anybody besides your people are reading this?\n \n Please, be brief next time.\n \n Nothing ever changes.\n\n He actually cut and pasted that from some other source, so his verbosity isn't even his own.", 
   {}, 
   231411, 
   null, 
   1159130880.0
  ], 
  [
   232114, 
   null, 
   "Kronus", 
   "\n Universalism may be attractive to someone who doesn't want to accept any ONE view of religion, but arguing for it from the standpoint of God being \"good\" (at least our understanding of \"good\") doesn't add up. If you reject only Christianity based on the idea that God doesn't conform to your view of what's \"good\" because there's an exclusivity to it, then you'd have to reject all of religion and belief in God in every way on the basis that God doesn't conform to your view of \"good\" in other ways as well.\n \n\n \n All of religion? Perhaps. Belief in God? Not necessarily. God may exist, and all of man's religions could be imperfect attempts to devine his will. And of course not all religions claim that God is good in the way that Christians do. For that matter, not all Christians think of God's goodness the way you do. For example, many believe that Jesus's sacrifice was for all people, not just those who follow whatever ritual some Christian sect says is required. The act of his crucifiction made salvation available for everyone, even those who have never heard of him. Or so some believe. And really, nothing else makes sense. You talk about poverty and earthquakes, but I'm talking about eternity. I can let day to day inequities slide with talk of free will and mysterious ways, but if we're talking about what happens for the rest of existence and beyond, then the selection process had better be fair and available to all. I only have human morality to make that decision, but it screams that that is the only just way.", 
   {}, 
   231986, 
   null, 
   1159134900.0
  ], 
  [
   232118, 
   null, 
   "Love Never Dies", 
   "He actually cut and pasted that from some other source, so his verbosity isn't even his own.\n\n Ya, well I guess shouldnt be surprised as part of the deal is you get to give up thinking for your self after you been to bible school.\n \n You know now they have it so you can paste something like that into a word processor and it will condense it for you automatically.\n \n I will do it and see if it works and post it.", 
   {}, 
   232106, 
   null, 
   1159136400.0
  ], 
  [
   232119, 
   null, 
   "Love Never Dies", 
   "OK, this is the automatic condensed by computer verson.\n \n Enjoy!\n \n ---------------------------------\n \n The argument, like all effective arguments, is extremely simple: Christ was either God or a bad man. \n \n Jesus wanted everyone to believe that he was God. (Who can do that but God, the One offended in every sin?) No one who knows both the Gospels and human beings can seriously entertain the possibility that Jesus was a liar or a lunatic, a bad man. \n \n No, the unbeliever almost always believes that Jesus was a good man, a prophet, a sage. It invites people to read the Gospels and get to know this man. The premise of the argument is the character of Jesus, the human nature of Jesus. God will give the increase. Perhaps Jesus never claimed to be divine. No Jew confuses Creator with creature, God with man.", 
   {}, 
   232118, 
   null, 
   1159136580.0
  ], 
  [
   232122, 
   null, 
   "Love Never Dies", 
   "The unbeliever almost always believes that Jesus was a good man?\n \n Where is your statistical evidence?\n \n You dont have any because its an assumption.\n \n Its probably better that you pasted this guys drivel because I would be embraced to have written it.", 
   {}, 
   232119, 
   null, 
   1159137060.0
  ], 
  [
   232136, 
   null, 
   "trebor", 
   "What you describe as a 'rationalization' is the heart and soul of the Christian religion. It's not just Christianity rationalizing an issue, it IS Christianity. The Christian view IS that humankind is sinful and needs saving.\n\n \n \n That is probably the reason he is not a Christian. That is the reason I am not.", 
   {}, 
   232099, 
   null, 
   1159141800.0
  ], 
  [
   232138, 
   null, 
   "jyoshu", 
   "All of religion? Perhaps. Belief in God? Not necessarily. God may exist, and all of man's religions could be imperfect attempts to devine his will. And of course not all religions claim that God is good in the way that Christians do. For that matter, not all Christians think of God's goodness the way you do. For example, many believe that Jesus's sacrifice was for all people, not just those who follow whatever ritual some Christian sect says is required. The act of his crucifiction made salvation available for everyone, even those who have never heard of him. Or so some believe. And really, nothing else makes sense. You talk about poverty and earthquakes, but I'm talking about eternity. I can let day to day inequities slide with talk of free will and mysterious ways, but if we're talking about what happens for the rest of existence and beyond, then the selection process had better be fair and available to all. I only have human morality to make that decision, but it screams that that is the only just way.\n\n \n If God is God, then there would be no need for there to have been death on anyone's behalf, whether a few or everyone. The act of crucifixion wouldn't be needed if we believe God is \"good enough\" to die for everyone to begin with.", 
   {}, 
   232114, 
   null, 
   1159143960.0
  ], 
  [
   232139, 
   null, 
   "jyoshu", 
   "That is probably the reason he is not a Christian. That is the reason I am not.\n\n \n And that's fair enough. It's your descision.", 
   {}, 
   232136, 
   null, 
   1159144020.0
  ], 
  [
   232281, 
   null, 
   "Kronus", 
   "If God is God, then there would be no need for there to have been death on anyone's behalf, whether a few or everyone. The act of crucifixion wouldn't be needed if we believe God is \"good enough\" to die for everyone to begin with.\n\n \n I'm not sure where you're going with this. Almost everything you've posted on this thread boils down to saying that God isn't good in any sense that would be understandable to a mere human. If you feel that way than why do you worship him?", 
   {}, 
   232138, 
   null, 
   1159201020.0
  ], 
  [
   232293, 
   null, 
   "jyoshu", 
   "I'm not sure where you're going with this. Almost everything you've posted on this thread boils down to saying that God isn't good in any sense that would be understandable to a mere human. If you feel that way than why do you worship him?\n\n \n Where I'm going with it was showing you that your argument for universalism based on the idea of God being 'good' doesn't hold much water. If you're going to be consistent and based your views of God on whether or not He conforms to your standard of the way He should act, then one would think you'd reject God altogether in every way if that's your criteria. And assuming that people of faith should look at God and weigh whether or not he conforms to our understanding of how He should act before choosing Him indicates a fundamental misundertanding of how faith and Christianity works. Most people don't determine their Christian faith based on that--if they did, there would be NO Christians because obviously He allows natural disasters to occur. \n \n It's not that I am saying \"God isn't good in any sense that would be understandable to a mere human\", it's that I'm saying our standard of what's good and what's not doesn't necessarily apply to God. We don't have access to knowledge of future events, or deeper more divine reasons for why things happen. I'm saying that we're on a different scale of what constitutes right behavior. I don't know if you're a parent, but in parenting kids have a different standard of behavior than adults do. The adults may understand, for instance, that having the dog put to sleep because it's rabid or in pain is the right thing to do, even though it seems like a hateful tragedy to the child. Christians in general, IMO, base their faith on the sovereignty of God and His all-knowingness, not necessarily whether or not He conforms to the way we think He should act.", 
   {}, 
   232281, 
   null, 
   1159202340.0
  ], 
  [
   232309, 
   null, 
   "Kronus", 
   "Where I'm going with it was showing you that your argument for universalism based on the idea of God being 'good' doesn't hold much water.\n\n You know, I never said I was arguing for universalism, and you haven't defined what you mean by it. I really don't know if you're addressing my arguments at all or some completely other philosophy that you think I'm adhering to, but aren't.\n \n \n\n And assuming that people of faith should look at God and weigh whether or not he conforms to our understanding of how He should act before choosing Him indicates a fundamental misundertanding of how faith and Christianity works.\n\n And saying that people shouldn't think about it at all is denying human nature and intellect. \n \n \n\n Most people don't determine their Christian faith based on that--if they did, there would be NO Christians because obviously He allows natural disasters to occur. \n\n Not in the least. I already said I was willing to let poverty and earthquakes slide under the heading of \"mysterious ways\". But if you're talking about what happens for all eternity, then every moral fiber in my being screams for fair and just behavior.\n \n \n\n Christians in general, IMO, base their faith on the sovereignty of God and His all-knowingness, not necessarily whether or not He conforms to the way we think He should act.\n\n You may be right about that. Personally, I'd like to think that my diety was good, not just all knowing. But that's just me.", 
   {}, 
   232293, 
   null, 
   1159205400.0
  ], 
  [
   232314, 
   null, 
   "johnhanks", 
   "What you describe as a 'rationalization' is the heart and soul of the Christian religion.\n\n It can be both: there is no inconsistency in the proposition that the core teachings of first-century Christianity evolved as a way of rationalising its eponymous dedicatee's ignominious execution.\n \n \nThe Christian view IS that humankind is sinful and needs saving.\n\n Trebor suggested a few posts ago that this is why I am not a christian. There are actually several reasons, but certainly if I were inclined to be religious in any way this is a position that would repel me from christianity. It is a statement with no foundation other than scriptural assertion (which can, I accept, be enough for some). What makes it offensive is its insistence that the whole of humanity in all its glorious diversity must either be bound by the behavioural norms of one Middle Eastern sect or be labelled 'sinful'; that people living perfectly fulfilled lives of their own in blissful igorance of christianity nevertheless 'need saving' regardless of their own views to the contrary.", 
   {}, 
   232099, 
   null, 
   1159207500.0
  ], 
  [
   232319, 
   null, 
   "jyoshu", 
   "You know, I never said I was arguing for universalism, and you haven't defined what you mean by it. I really don't know if you're addressing my arguments at all or some completely other philosophy that you think I'm adhering to, but aren't.\n\n \n You made the statement earlier that \"I, for one, believe that different paths can lead to the same destination.\" I interpreted that as a form of universalism--which would argue that all these paths would lead to God, or to eternal life, not just one way of looking at it--and as a statement of your belief, since you stated that's what you \"believe\". If that's not what you meant, feel free to correct me and I apologize for the misunderstanding. Although your statement seemed pretty clear to me.\n \n \nAnd saying that people shouldn't think about it at all is denying human nature and intellect. \n\n \n Huh? I never said people shouldn't think about it. In my experience Christians think about these issues a lot. They just choose to base their experience on faith as opposed to what would seem to be the position of reason.\n \n \nNot in the least. I already said I was willing to let poverty and earthquakes slide under the heading of \"mysterious ways\". But if you're talking about what happens for all eternity, then every moral fiber in my being screams for fair and just behavior.\n\n \n Ok, I missed that. But letting such issues slide is like ignoring the proverbial 2000 lb elephant in the room--it's a very real issue that isn't so easily let slide for most people. I think, if we're going to argue for what's fair (from our perspectives anyway), or that God is good, then we'd need to argue for what's fair good all across the board. \n \n \nYou may be right about that. Personally, I'd like to think that my diety was good, not just all knowing. But that's just me.\n\n \n Well again, as I was trying to show with my analogy, what we think is a lack of goodness may not be to a diety who knows the future and has a divine perspective on things. I'm not sure that a diety that allows bad things to happen is necessarily \"not good\"--we're in a metaphysical realm here trying to fit a deity in a box. Sometimes we have to try in order to even understand Him, but in areas where there's an apparent contradiction (as in this case) it falls in the realm of mystery or \"otherness\" for most Christians, I think. So for the 2000lb elephant of human tragedy, we can't understand it, and for the possibility of some people not getting eternal life, we can't understand it. What we KNOW however, is that God (if He exists) allows people to physically die. So from that perspective He's either a.) Not good, or b.) good in a way we don't understand. I think most Christians view it as (b.). Why wouldn't your concerns about the eternal issue possibly fall under (b.) as well?", 
   {}, 
   232309, 
   null, 
   1159208880.0
  ], 
  [
   232321, 
   null, 
   "jyoshu", 
   "Trebor suggested a few posts ago that this is why I am not a christian. There are actually several reasons, but certainly if I were inclined to be religious in any way this is a position that would repel me from christianity. It is a statement with no foundation other than scriptural assertion (which can, I accept, be enough for some). What makes it offensive is its insistence that the whole of humanity in all its glorious diversity must either be bound by the behavioural norms of one Middle Eastern sect or be labelled 'sinful'; that people living perfectly fulfilled lives of their own in blissful igorance of christianity nevertheless 'need saving' regardless of their own views to the contrary.\n\n \n I understand your perception and that's your choice.", 
   {}, 
   232314, 
   null, 
   1159209240.0
  ], 
  [
   232327, 
   null, 
   "epaphras_faith", 
   "You religious guys and your bloated diatribes.\n \n You think anybody besides your people are reading this?\n \n Please, be brief next time.\n \n Nothing ever changes.\n\n \n Not an argument. You don't like it don't participate.", 
   {}, 
   231411, 
   null, 
   1159210620.0
  ], 
  [
   232333, 
   null, 
   "Kronus", 
   "\n Ok, I missed that. But letting such issues slide is like ignoring the proverbial 2000 lb elephant in the room--it's a very real issue that isn't so easily let slide for most people. I think, if we're going to argue for what's fair (from our perspectives anyway), or that God is good, then we'd need to argue for what's fair good all across the board. \n\n It's not like we're ignoring the issue. We discussed it and you made a very compelling argument that what happens here on Earth could be part of a higher plan that we can't understand. So I\"m willing to say that what happens here on Earth could well be fair, if we could only see the bigger picture. Which just leaves the very important issue of what happens after life here on Earth. \n \n \nWhat we KNOW however, is that God (if He exists) allows people to physically die. So from that perspective He's either a.) Not good, or b.) good in a way we don't understand. I think most Christians view it as (b.). Why wouldn't your concerns about the eternal issue possibly fall under (b.) as well?\n\n Because it's forever. There's no chance to learn, no growth, no parole. We can learn and grow from our trials here on Earth, we can change and improve ourselves. But once you're in hell you're in hell for all of eternity. According to some that's your fate if you didn't happen to choose the one right specific path. There's no objective way to know which is the right path, dozens (hundreds?) of groups claim to have the only correct one, and if you don't happen to pick the right one you burn forever. Either they are wrong, or God is grossly unfair. My bet is that the people who claim that they know the only true way are wrong.", 
   {}, 
   232319, 
   null, 
   1159211100.0
  ], 
  [
   232345, 
   null, 
   "jyoshu", 
   "Because it's forever. There's no chance to learn, no growth, no parole. We can learn and grow from our trials here on Earth, we can change and improve ourselves. But once you're in hell you're in hell for all of eternity. According to some that's your fate if you didn't happen to choose the one right specific path. There's no objective way to know which is the right path, dozens (hundreds?) of groups claim to have the only correct one, and if you don't happen to pick the right one you burn forever. Either they are wrong, or God is grossly unfair. My bet is that the people who claim that they know the only true way are wrong.\n\n \n But if God gives people the choice of eternal life, and they reject it, he is it that He's being unfair?", 
   {}, 
   232333, 
   null, 
   1159212060.0
  ], 
  [
   232347, 
   null, 
   "Kronus", 
   "But if God gives people the choice of eternal life, and they reject it, he is it that He's being unfair?\n\n \n Ok, try to be as clear and specific as you possibly can here. What do you mean by \"gives people the choice\" and what do you mean by \"reject\"? I won't prejudice your answer by giving my take yet, I just want to understand what you're trying to say.", 
   {}, 
   232345, 
   null, 
   1159212360.0
  ], 
  [
   232360, 
   null, 
   "jyoshu", 
   "Ok, try to be as clear and specific as you possibly can here. What do you mean by \"gives people the choice\" and what do you mean by \"reject\"? I won't prejudice your answer by giving my take yet, I just want to understand what you're trying to say.\n\n \n What I mean is that your answers seem to presupposed that Christianity would show God as damning people who don't choose Him to hell, but if He in fact DOES give them that choice to make, where they can choose eternal life, how is it unfair? What's to say the choice itself isn't the means by which we're to avoid this \"unfairness\"? If the choice is available to choose eternal life, the only ones left are the ones who never heard about the choice to begin with, which of course is the harder part to reconcile. I don't have an answer for that particular part. But among those who have the choice available to them, it's hard to see that as unfair.", 
   {}, 
   232347, 
   null, 
   1159215840.0
  ], 
  [
   232364, 
   null, 
   "Kronus", 
   "What I mean is that your answers seem to presupposed that Christianity would show God as damning people who don't choose Him to hell, but if He in fact DOES give them that choice to make, where they can choose eternal life, how is it unfair? What's to say the choice itself isn't the means by which we're to avoid this \"unfairness\"? If the choice is available to choose eternal life, the only ones left are the ones who never heard about the choice to begin with, which of course is the harder part to reconcile. I don't have an answer for that particular part. But among those who have the choice available to them, it's hard to see that as unfair.\n\n \n I understood your logic, it's your terms I don't understand. That's what I need you to clarify. What do you mean when you say God has given us a choice? How? In what manner was this choice presented? And what, exactly, is the choice? You say that people can reject the choice. Again, how? What is required to accept or reject the choice? And please, I need you to be specific here. I've asked this of others before and gotten nothing but hand-waving. I'm not looking for poetry, metaphor, or euphamisms; I'm looking for real, specific answers.", 
   {}, 
   232360, 
   null, 
   1159216620.0
  ], 
  [
   232367, 
   null, 
   "jyoshu", 
   "I understood your logic, it's your terms I don't understand. That's what I need you to clarify. What do you mean when you say God has given us a choice? How? In what manner was this choice presented? And what, exactly, is the choice? You say that people can reject the choice. Again, how? What is required to accept or reject the choice? And please, I need you to be specific here. I've asked this of others before and gotten nothing but hand-waving. I'm not looking for poetry, metaphor, or euphamisms; I'm looking for real, specific answers.\n\n \n The choice, as I see it, is to accept Christ and have eternal life. If you really want me to get into aspects of the gospel, I can and am more than willing to do so, but I'd suggest we take it into private messages rather than here because it could get rather involved and long. Do you really want to go there?", 
   {}, 
   232364, 
   null, 
   1159217280.0
  ], 
  [
   232373, 
   null, 
   "Kronus", 
   "The choice, as I see it, is to accept Christ and have eternal life. If you really want me to get into aspects of the gospel, I can and am more than willing to do so, but I'd suggest we take it into private messages rather than here because it could get rather involved and long. Do you really want to go there?\n\n \n Well, \"accept Christ\" is exactly the sort of vague answer I was hoping to not get. Does that mean recite a certain ritual phrase, go to this church but not that church, act in a certain manner, think a certain way, wear a cross, join a prayer circle, what? But really, I guess it doesn't matter, since your uber-answer rests in the Bible. To which I have to say that if that is God's way of presenting us with a choice, than he is still being utterly unfair. There are dozens of holy books out there, and there is no way to know which one is the one that God wants us to follow. It's a XXXX shoot, with our souls at stake. If God is going to condemn us to a fiery hell for all of eternity for not making a certain choice correctly than he should make utterly sure that we know what choice is the right one. And we have absolutely no way of knowing. You have faith in Christianity because of the culture you live in. If you'ld been born in Isreal you'ld most likely be Jewish, in Egypt you'ld be Muslim, in India Hindu. And you would be just as sure that you'ld made the right choice in those situations as you are now. Why would you, in any of those other situations, even begin to imagine that you're supposed to reject everything you've been raised to believe? And even if you did reject what you'ld been taught, how could you possibly be expected to know that \"accepting Christ\" is what you need to do, and not anything that any other religion asks of you?\n \n Imagine, if you can, that the correct answer is in fact \"Mormon\". (nods to South Park) To get into heaven you must be Mormon, as spelled out in the Book of Mormon. God has sent us his will, it's all there in black and white. All you, Jyoshu, need to do is read and accept it. Is it going to happen? Is there the slightest chance? No, not really. And so you've \"rejected\" God and are damned, largely because you weren't born in Utah. Fair? Not by the farthest stretch of the imagination. And yet, according to you, that's the fate most of the world faces.", 
   {}, 
   232367, 
   null, 
   1159219500.0
  ], 
  [
   232374, 
   null, 
   "trebor", 
   "The choice, as I see it, is to accept Christ and have eternal life. If you really want me to get into aspects of the gospel, I can and am more than willing to do so, but I'd suggest we take it into private messages rather than here because it could get rather involved and long. Do you really want to go there?\n\n \n \n I see a different choice. \n \n Chose \"Christ\", and choose a false god, and you don't get eternal life.", 
   {}, 
   232367, 
   null, 
   1159219560.0
  ], 
  [
   232378, 
   null, 
   "jyoshu", 
   "Well, \"accept Christ\" is exactly the sort of vague answer I was hoping to not get. Does that mean recite a certain ritual phrase, go to this church but not that church, act in a certain manner, think a certain way, wear a cross, join a prayer circle, what? But really, I guess it doesn't matter, since your uber-answer rests in the Bible.\n\n \n If you're trying to get me to give you some formula or invocation recipe, I don't think there is one necessarily, from my perspective. I've known people who couldn't point to any one event or moment in their life when they became a Christian, and yet based on the way they lived and their love for Christ, I have no doubt they are Christian. For some I think there's a definitive thing they went through: pray a certain prayer, walk an aisle, etc. For others it's more of a process, even long-term in some cases. I just don't think there's an easy, definitive answer to your question here. I know that's not the concrete answer you're wanting me to give, but I'm not sure there is one. (My opinion of course.) I DO think there are some central beliefs that are important to adopt, such as belief/confession of the life, death, and ressurection of Christ. \n \n \nTo which I have to say that if that is God's way of presenting us with a choice, than he is still being utterly unfair. There are dozens of holy books out there, and there is no way to know which one is the one that God wants us to follow. It's a XXXX shoot, with our souls at stake. If God is going to condemn us to a fiery hell for all of eternity for not making a certain choice correctly than he should make utterly sure that we know what choice is the right one. And we have absolutely no way of knowing.\n\n \n For someone looking at the situation outside of all religion, I could see how it would look that way to you. But from the perspective of being in a relationship with Christ, it's very clear.\n \n \nYou have faith in Christianity because of the culture you live in.\n\n \n I'd would agree only to the point that my culture is the vehicle by which I learned of and was exposed to Christianity, but there are many cases of people that became Christian despite their cultures--Muslim converts to Christianity are one such example.\n \n \nWhy would you, in any of those other situations, even begin to imagine that you're supposed to reject everything you've been raised to believe? And even if you did reject what you'ld been taught, how could you possibly be expected to know that \"accepting Christ\" is what you need to do, and not anything that any other religion asks of you?\n\n \n I can't answer that from experience, but I do know that there are many cases of converts that were once in other religions, which means that somehow these people DID come to that conclusion.", 
   {}, 
   232373, 
   null, 
   1159223040.0
  ], 
  [
   232396, 
   null, 
   "Kronus", 
   "If you're trying to get me to give you some formula or invocation recipe,\n\n Only if that is, in fact, what you meant. It seems that it isn't in your case, but some would disagree.\n \n \n\n I DO think there are some central beliefs that are important to adopt, such as belief/confession of the life, death, and ressurection of Christ. \n\n Ok, that's more what I was after. Am I safe in assuming that by life and death you don't just mean that some guy named Jesus lived and died about 2000 years ago? You are saying that to get to heaven you must believe in the divine Christ?\n \n \n\n For someone looking at the situation outside of all religion, I could see how it would look that way to you. But from the perspective of being in a relationship with Christ, it's very clear.\n\n Well sure. And everyone who is convinced of their religious choice would say the same thing. But if one starts not with \"this is my religion\" but instead with \"which religion is right\", or from outside all religion as you put it, than how is one supposed to reach the \"right\" answer? If there isn't a clear path, then condemning all those who make the wrong choice to an eternity of pain is a monstrous injustice.\n \n \n\n I'd would agree only to the point that my culture is the vehicle by which I learned of and was exposed to Christianity, but there are many cases of people that became Christian despite their cultures--Muslim converts to Christianity are one such example.\n \n I can't answer that from experience, but I do know that there are many cases of converts that were once in other religions, which means that somehow these people DID come to that conclusion.\n\n And people have converted from Christianity to other religions, so where does that leave us? There is no majority religion, there is no one faith that most people think is correct. To me that can only mean one of two things. Either God doesn't care all that much about your religion, or he does care but not enough to let us know what he wants, and is willing to damn most of humanity that doesn't guess correctly. I'm guessing the former.", 
   {}, 
   232378, 
   null, 
   1159230840.0
  ], 
  [
   232421, 
   null, 
   "jyoshu", 
   "Ok, that's more what I was after. Am I safe in assuming that by life and death you don't just mean that some guy named Jesus lived and died about 2000 years ago? You are saying that to get to heaven you must believe in the divine Christ?\n\n \n Well sure. Being a Christian would have to entail believing in a divine Christ.\n \n \nAnd everyone who is convinced of their religious choice would say the same thing. But if one starts not with \"this is my religion\" but instead with \"which religion is right\", or from outside all religion as you put it, than how is one supposed to reach the \"right\" answer? If there isn't a clear path, then condemning all those who make the wrong choice to an eternity of pain is a monstrous injustice.\n \n And people have converted from Christianity to other religions, so where does that leave us? There is no majority religion, there is no one faith that most people think is correct.\n\n \n I think the difference is that people have experienced Christ. It's more than just an intellectual exercise. And since Christianity is the largest most widespread religion on the planet by a pretty long shot, one can make the argument that it works for more people than any other.\n \n \nTo me that can only mean one of two things. Either God doesn't care all that much about your religion, or he does care but not enough to let us know what he wants, and is willing to damn most of humanity that doesn't guess correctly. I'm guessing the former.\n\n \n Or a third option: that 2.1 billion people are correct, and Christianity really is the right way so everyone has the option to go that route if they so choose. IOW, He HAS let us know what He wants, and it apparently makes the most sense to the most people in the world, and so I'd say it's not guesswork at all.", 
   {}, 
   232396, 
   null, 
   1159239720.0
  ], 
  [
   232465, 
   null, 
   "Kronus", 
   "Well sure. Being a Christian would have to entail believing in a divine Christ.\n\n Please, I'm trying for precision here. I didn't ask about being a Christian, I asked about getting into avoiding hell. Are they the same for you?\n \n \n\n I think the difference is that people have experienced Christ. It's more than just an intellectual exercise. And since Christianity is the largest most widespread religion on the planet by a pretty long shot, one can make the argument that it works for more people than any other.\n\n Or one could argue that the people who settled most of the world just happened to be Christians. And you're wrong about the \"difference\". People have had mysitical and profound experiences in every religion; Christianity doesn't have a corner on that market.\n \n \n\n Or a third option: that 2.1 billion people are correct, and Christianity really is the right way so everyone has the option to go that route if they so choose. IOW, He HAS let us know what He wants, and it apparently makes the most sense to the most people in the world, and so I'd say it's not guesswork at all.\n\n If it's not guess work than show it to me. Show me why your choice is right. More importantly, show me how God has made it clear to me that your choice is right. Nothing you've said about Christianity can't be said about every other religion, aside for census data. Like you said before, show me as if I were someone outside religion. If someone who doesn't share your assumptions can't be saved, than the choice isn't being fairly presented.", 
   {}, 
   232421, 
   null, 
   1159287960.0
  ], 
  [
   232472, 
   null, 
   "jyoshu", 
   "Please, I'm trying for precision here. I didn't ask about being a Christian, I asked about getting into avoiding hell. Are they the same for you?\n\n \n Yes, they are certainly the same, from my perspective.\n \n \nOr one could argue that the people who settled most of the world just happened to be Christians. \n\n \n Yes, I agree, that's a legitimate possible reason. \n \n \nAnd you're wrong about the \"difference\". People have had mysitical and profound experiences in every religion; Christianity doesn't have a corner on that market.\n\n \n Sure, but most people have had them with Christianity, apparently.\n \n \nIf it's not guess work than show it to me. Show me why your choice is right. \n\n \n A.) Because it's apparently worked for more people in the world than any other. Though you dismiss it as \"census data\", please keep in mind that with most things, that would be a valid reason to take it seriously. If the majority of people in the world preferred Volvos, wouldn't you think there just might be something better about Volvos? (Note: I don't drive a Volvo--that was just an analogy) It seems disingenuous to disregard public appeal widespreadness just because it's a religion we're talking about.\n \n B.) because IMO, the teachings of Christ are better appealing toward peace and people getting along than any other. This, IMO, probably has a lot to do with WHY so many people prefer Christianity as a religion over, say, Islam or Hinduism. I know of no other religion that teaches to not just stop at one mile when one is forced to carry something for someone, but to add yet another. Or to, instead of caring and showing compassion to one's friends and aqaintances, to go even farther and do so for one's enemies. This sort of thing, when carried out, has enormous transforming power in society. If you would, please give John Locke's essay The Reasonableness of Christianity a read. He does a better job of explaining this than I can. Now please keep in mind I'm talking about the teachings of Christ here, NOT about how well people in history have followed them. These moral teachings are an ideal, and obviously people declaring themselves Christian have not always measured up to keeping them. They've even done the very opposite at times. They were human. Nevertheless, I see those teachings as the best moral guide I've ever seen.\n \n I'll be thinking and if other reasons come to mind I'll tell you. I could certainly give you reasons like \"many people claim to have been changed by Christianity\" and point you to firsthand accounts, but I want to stick to reasons that are more specifc to Christianity because that seems to be what you're after. \n \n \nMore importantly, show me how God has made it clear to me that your choice is right. \n\n \n I don't know that He has to you, other than what I've said already and what you can discover if you do a serious investigation and query (more than just chatting with someone on a forum). If it does really matter to you, there are lots of things to read, both pro and con that I could recommend, and I'd also recommend reading some of the works of early Christianity as well. It's up to you. In other words, He may not have shown you at this point--it may take some further reading and research... it may take a LOT of it. This is something so involved that it can't be covered here. There have been volumes and volumes written down through the centuries on this stuff, and there are lots of people that have lived down through the centuries who have no doubt their lives have been changed by Christianity. If someone really seriously looks into the teachings of Christianity and reads the teachings of Christ with an open mind, I don't see how they could come to any other conclusion.", 
   {}, 
   232465, 
   null, 
   1159292460.0
  ], 
  [
   232476, 
   null, 
   "johnhanks", 
   "This is an interesting, well-argued exchange, and I butt into it with some trepidation: I hope you'll both excuse me.\n \nOr a third option: that 2.1 billion people are correct, and Christianity really is the right way so everyone has the option to go that route if they so choose. IOW, He HAS let us know what He wants, and it apparently makes the most sense to the most people in the world, and so I'd say it's not guesswork at all.\n\n This does not wash. A total of 2.1 billion christians sounds very impressive, but it leaves two-thirds of the world population non-christian. As Kronus pointed out, the vast majority of these were born into other cultural traditions which they adopted as effortlessly and unquestioningly as, say, mediaeval Italians would have adopted Catholicism. A 2:1 majority of the world population have not chosen to reject christianity in any meaningful sense whatsoever.\n \n And even if it could be fixed so that every child was somehow offered a free and unbiased choice of religion, to someone who is not already a christian christianity's truth and all other religions' falsity are simply not self-evident: we would just have the world's major and minor religions pitching their competing truth claims with more or less equal degrees of credibility, but with people being punished forever for making the wrong choice.", 
   {}, 
   232421, 
   null, 
   1159296720.0
  ], 
  [
   232478, 
   null, 
   "Kronus", 
   "\n A.) Because it's apparently worked for more people in the world than any other.\n\n That's no reason. Some religion has to have more members than any other, that's obvious, so the fact that it happens to be Christianity doesn't necessarily mean anything. And don't forget the fact that \"Christianity\" is a very big tent. Not all Christians agree on what exact path is necessary to get into heaven. I don't know exactly what you believe, since you haven't spelled it out here, but I'm quite sure that the number of people who hold the same beliefs as you is pretty small.\n \n \n\n I know of no other religion that teaches to not just stop at one mile when one is forced to carry something for someone, but to add yet another. Or to, instead of caring and showing compassion to one's friends and aqaintances, to go even farther and do so for one's enemies.\n\n Than you haven't looked. Try Buddism, taoism, or hinduism for starters. Read their sacred texts, you'll find them quite enlightening. \n \n \n \n\n I'll be thinking and if other reasons come to mind I'll tell you. I could certainly give you reasons like \"many people claim to have been changed by Christianity\" and point you to firsthand accounts, but I want to stick to reasons that are more specifc to Christianity because that seems to be what you're after. \n\n \n \n \n\n I don't know that He has to you, other than what I've said already and what you can discover if you do a serious investigation and query \n\n Well there you go. I have in fact done alot of reading about religion, and read alot of sacred texts. I was reading to learn, not to reinforce a belief I already held. And nothing jumped out at me as being the \"one\" correct path. And I looked more than most people have. If all I wanted was to back up a belief that I already held I'm sure I could find lots, but I was just looking, and the more I looked the more certain I was that all religions hold some truth and have some value.\n \n It sounds to me like most of your arguments are trying to justify Christianity. There's no need; I think it's a fine religion, at least in principle. The thing is, lots of religions are fine in principle, if you look at them with an open mind. All of them have the potential to change lives for the better. What I'm really pushing for here, and you seems to be drifting away from it, is why you think it's the only possible path, and how everyone is supposed to know that. The fact that lots of people have found it to be a great religion doesn't really address either of those questions, especially when you keep in mind the fact that there's no majority view among Christians about what's needed to get into heaven.\n \n And as an aside, I'm only \"going after\" Christianity because you're claiming it's the only true path. If you were pushing Zoroastianism than that's what I'd be concentrating on.\n \n \n If someone really seriously looks into the teachings of Christianity and reads the teachings of Christ with an open mind, I don't see how they could come to any other conclusion.\n\n That's because you're blinded by your faith. You have decided to base your thinking on faith rather than reason, and so naturally you can't understand that someone else may reach a different conclusion. Anyone who bases their thinking on faith will do the same thing, regardless of which faith it is. I don't know if you can see this or not, but their are people out there who feel about their religion exactly the way you do about yours; they can't imagine that anyone who just tried wouldn't see things their way. I understand that you feel strongly about your faith, but so do a gagillion other people who hold opposing faiths. If people of opposing faiths all feel strongly that they're right, than the fact that the all feel right helps not in the least in determining who is right.", 
   {}, 
   232472, 
   null, 
   1159298700.0
  ], 
  [
   232483, 
   null, 
   "sinjin", 
   "Nothing more than pedestrian chauvinism is all I see.", 
   {}, 
   232478, 
   null, 
   1159303020.0
  ], 
  [
   232486, 
   null, 
   "jyoshu", 
   "That's no reason. Some religion has to have more members than any other, that's obvious, so the fact that it happens to be Christianity doesn't necessarily mean anything.\n\n \n So if 1/3 of the world's drivers preferred driving a Volvo, with no other cars coming close in terms of percentage, you'd assume that was no reflection on Volvos at all? \n \n \nThan you haven't looked. Try Buddism, taoism, or hinduism for starters. Read their sacred texts, you'll find them quite enlightening.\n\n \n I have read them. They either DON'T go as far as Christianity in terms of Jesus' teachings, or they go too far in some directions (e.g. Buddhism's tendency to frown on destroying ANY life, such as insects and plants, for which there are often reeasonable needs to do so.) \n \n \nWell there you go. I have in fact done alot of reading about religion, and read alot of sacred texts. I was reading to learn, not to reinforce a belief I already held. And nothing jumped out at me as being the \"one\" correct path. And I looked more than most people have. \n\n \n well that's respectable--I have too; in fact my undergraduate degree is in comparative religion. FWIW, it's been my experience that most every Christian I've run into has indeed thought through these issues with at least some critical thought. I really don't think Christians in general go their whole lives approaching their faith only to reinforce preconceived notions. The issues you've brought up are well-realized in Christian circles; we're aware of the logical inconsistencies of Christianity, or religion in general for that matter. But then we're also aware of the failings of secular reasoning as well. I remained with Christianity in large part because it was the most reasonable to me, not just because I was, for instance, raised that way or because of my culture.\n \n \nIt sounds to me like most of your arguments are trying to justify Christianity.\n\n \n No, I was simply answering your question. You asked for reasons, and I gaven them the best I could. I find no need to \"justify\" Christianity; I do think there should have been justification for the actions quite a few self-described Christians down through the years, but that's not the same IMO.\n \n \nWhat I'm really pushing for here, and you seems to be drifting away from it, is why you think it's the only possible path, and how everyone is supposed to know that. The fact that lots of people have found it to be a great religion doesn't really address either of those questions, especially when you keep in mind the fact that there's no majority view among Christians about what's needed to get into heaven.\n\n \n Alright then, I can't answer that. I can only tell you that it works for me and for more people in the world than any other religion. to some degree people are pulled into Christianity by faith, and sometimes reason doesn't add up. I understand that. What you're asking is like asking me why I think one mountain stream is better than the others. Sure they all work; they all provide room to swim in. Maybe I think the water's cooler in mine or maybe I prefer the look of the rocks more. It's something you'd just have to genuinely try. And if it's not for you, no problem.\n \n \nThat's because you're blinded by your faith. You have decided to base your thinking on faith rather than reason, and so naturally you can't understand that someone else may reach a different conclusion. Anyone who bases their thinking on faith will do the same thing, regardless of which faith it is.\n \n \n Except that I've also evaluated Christianity by standards of reason as well, and found it better. It sounds like you believe that unless someone comes to the same conclusions you did, that they have to be blinded by faith. Again, I encourage you to read the Locke essay when you get a chance. Faith and reason aren't necessarily juxtaposed. There are very sound reasons for the Christian faith, and I've pointed you to someone who laid all that out in the 1600s already. (Locke by the way is no intellectual lightweight--our U.S. constitutional system was very much influenced by his thinking.) \n \n \nI don't know if you can see this or not, but their are people out there who feel about their religion exactly the way you do about yours; they can't imagine that anyone who just tried wouldn't see things their way. \n\n \n They may \"feel\" that way, but that doesn't mean their religion is equally as reasonable and beneficial in real-world terms. Which would you rather teach your child--forgiveness or retribution? Giving compassion and friendship to allies only or to enemies as well? Because, whether you realize it or not, Christianity represents and teaches the good sides of thoes questions, and other religions simply don't emphasize them either at all or to the degree that Christianity does. I'm not trying to sell it to you, I'm simply telling you what I've found after going through years of a comparative process.\n \n FWIW, I've enjoyed this exchange, Kronos.", 
   {}, 
   232478, 
   null, 
   1159303140.0
  ], 
  [
   232488, 
   null, 
   "jyoshu", 
   "This does not wash. A total of 2.1 billion christians sounds very impressive, but it leaves two-thirds of the world population non-christian.\n\n \n But fractured into smaller religions. I'm viewing this in terms of comparing it to other religions. Again, let me use the automobile analogy. If one car was driven by a 3rd of the world's drivers, and no other cars came close to that in terms of drivers, it seems to me we'd be suspecting there might be something better about that particular car. Numbers do matter, IMO.", 
   {}, 
   232476, 
   null, 
   1159304160.0
  ], 
  [
   232492, 
   null, 
   "Kronus", 
   "\n So if 2/3s of the world preferred driving a Volvo, you'd assume that was no reflection on Volvos at all? \n\n Not really a good analogy, since people have alot of free choice in the car they drive. People's religious choice is determined mostly by what their parents practice.\n \n \n\n Alright then, I can't answer that. I can only tell you that it works for me and for more people in the world than any other religion. \n\n I did some poking, and the numbers don't actually support that claim. Remember, I'm not talking about religion per se, I'm talking about path to heaven. There are about 2 billion christians in the world, yes. Half those are Catholic, the rest various forms of Protestant. They hold very different views on what's required to get to heaven. The largest group with a consistant view of how to get into heaven is, in fact, the Muslims, at 1.1 billion. No single Christian belief beats that.\n \n \n\n to some degree people are pulled into Christianity by faith, and sometimes reason doesn't add up. I understand that. What you're asking is like asking me why I think one mountain stream is better than the others.\n\n Not exactly. What I'm trying to get you to understand is that there is no way to say that one stream is better than another. And that it's absurd to think that God would punish us for all eternity for choosing any stream but one without being sure we knew what the right one was. You think Christianity is great, and that's fine. But you can't point to anything that someone who doesn't already share your mindset would accept as a valid reason to belive that your way is the only way. If God was really going to cast people in the pit for all eternity for making the wrong choice than I have to believe he'd make the correct choice clear. He hasn't. You've said why you feel it's the right choice for you, but you can't show any \"higher\" message that everyone has access to. I assert that's because there is no single message, there isn't just one choice. If there were, if God was making sure that everyone had equal access to heaven, than you'ld be able to point to it clearly.\n \n \n\n FWIW, I've enjoyed this exchange, Kronos.\n\n Yeah, me too. :)", 
   {}, 
   232486, 
   null, 
   1159305660.0
  ], 
  [
   232501, 
   null, 
   "jyoshu", 
   "I did some poking, and the numbers don't actually support that claim. Remember, I'm not talking about religion per se, I'm talking about path to heaven. There are about 2 billion christians in the world, yes. Half those are Catholic, the rest various forms of Protestant. They hold very different views on what's required to get to heaven. The largest group with a consistant view of how to get into heaven is, in fact, the Muslims, at 1.1 billion. No single Christian belief beats that.\n\n \n In terms of relgions (even when talking about \"path to heaven\"), it's not valid IMO to essentially view protestantism and Catholicism as two separate religions which seems effectively be what you're doing here; they still agree on many of the fundamentals. BBoth a Catholic AND a protestant will, in all likelihood tell you that belief and faith in Christ is what requires one be a Christian (and therefore go to heaven). Both will confirm what Jesus said that \"I am the way, the truth, and the life.\" Furthermore, Muslims are not so united as you say--fundamentalist Islam would say that there are a lot of mainline Muslims that in fact are not going to heaven. I think if we're going to go down the road of fracturing all these religions based on internal differences of belief rather than focusing on the areas they are like-minded, we're going to get nowhere. Comparing any large group like that for anything is always going to get differences when you look much closer; we have to view Christianity as Christianity to have any sort or reasonable discussion on this, because if you start viewing relgions as made up of indivdual religions, it can't be analyzed at all and we don't know if either one of us is correct because there's no way to even know.\n \n \nNot exactly. What I'm trying to get you to understand is that there is no way to say that one stream is better than another.\n\n \n I do understand that view, I just don't hold to it. It doesn't stand up to my experience, my research, and my comparisons. I'm of the conclusion, both in terms of evaluation AND experience that one stream really is better than the others, for the reasons I've pointed you to as well as the ones I've given.", 
   {}, 
   232492, 
   null, 
   1159306860.0
  ], 
  [
   232508, 
   null, 
   "Kronus", 
   "In terms of relgions (even when talking about \"path to heaven\"), it's not valid IMO to essentially view protestantism and Catholicism as two separate religions which seems effectively be what you're doing here; .\n\n You've drifted away from my point again. I'm not talking about religion per se. I'm talking about whether or not there is only one \"true\" path to get to heaven. The Catholics say that you must follow the sacraments or you go to hell, end of story. The protestants all say otherwise, although many of them do add their own takes on what one must or must not do. You may think they're all basically the same and all going to heaven, but they don't. You, as I said before, are in a rather small minority in your beliefs. You seem to think that just being Christian is enough, but most Christians would disagree with you. Alot of Christians firmly believe that you are damned, because you follow the wrong faith.\n \n \n\n I think if we're going to go down the road of fracturing all these religions based on internal differences of belief rather than focusing on the areas they are like-minded, we're going to get nowhere.\n\n Sorry, but it's got to be done if you think numbers are relevant. If you want to drop the \"Christianity is the biggest and therefore probably right\" argument than we can stop. Otherwise, we can't use umbrella labels, we have to look at the details of what they think is required to get to heaven.\n \n \n\n I do understand that view, I just don't hold to it. It doesn't stand up to my experience, my research, and my comparisons. I'm of the conclusion, both in terms of evaluation AND experience that one stream really is better than the others, for the reasons I've pointed you to as well as the ones I've given.\n\n You've given reasons why it appeals to you, sure. But you haven't shown that this appeal ought to be universal, that it's equally available to all. And that's the most important point. \n \n \n Allow me to back track a bit, I want to check something. I'm still a bit fuzzy on just what you think is reuqired to get into heaven. You have to be Christian, I got that. Anything else? Is it ok to just belong to a church? To believe in Christ but not follow any organized religion? Do you have to repent of your sins? Any rituals required? (baptism, last rites, communion, confession, etc) Good deeds? Please, give me the whole spiel. You are sure that your path is the one and only way to avoid hell, so what is it exactly? Alot of religions can supply what amounts to a checklist, so if you have something like that than that's what I'm looking for here.", 
   {}, 
   232501, 
   null, 
   1159308840.0
  ], 
  [
   232521, 
   null, 
   "jyoshu", 
   "You've drifted away from my point again. I'm not talking about religion per se. I'm talking about whether or not there is only one \"true\" path to get to heaven. \n\n \n That's why I also said \"(even when talking about \"path to heaven\")\". Even in Catholicism, the sacraments mean something--they aren't just empty actions--they demonstrate what's in the heart: belief and confession about Christ. This belief and cofession is shared by both Protestants and Catholics. We simply can't start drawing dividing lines here in with every group because such lines can be found in ANY group however big or small. The religions are Christianity, Islam, Hinduism, etc. To start spliting these into essentially individual separate religions as well gives us no frame of reference for this discussion at all. It's like trying to talk about two lakes, and then getting bogged down on saying that one lake may not constitute a lake because it's got some polluted water in it and so the water is different from the other one. That doesn't matter, it's still a lake as a whole. We have to approach these religions by saying that the heart of what it takes to get to heaven is the heart of the religion--in Christianity's case the way to get to heaven is through Christ. That's what no denomination in Christianity would disagree on, that I know of. Because that's the central difference between the religions. If we start getting into breaking down the differences between factions, we're going to have to do the same for every religion there is. And if we're going to discuss Christianity as compared to other religions in terms of getting to heaven, then it's only fair to deal in terms of what Christians agree on regarding this. Otherwise we're no longer discussing the same thing, unless you want to break every single religion down into factions, and various specific differences of belief. I do hope you don't want to do that.\n \n \nYou seem to think that just being Christian is enough, but most Christians would disagree with you. Alot of Christians firmly believe that you are damned, because you follow the wrong faith.\n\n \n But we're discussing Christianity contrasted to other religions, not the factions of Christianity. (Every religion has factions.) So we have to approach this from what Christian groups have in common--the common denominators. The common denominator of what gets someone to heaven is through Christ. \n \n \nSorry, but it's got to be done if you think numbers are relevant. If you want to drop the \"Christianity is the biggest and therefore probably right\" argument than we can stop.\n\n \n I didn't say that was the only factor--I gave you two arguments, and asked you to read more with the link I gave you. Numbers would be relevant in most any other topic, so I see no reason why numbers should not matter here. \n \n \nAllow me to back track a bit, I want to check something. I'm still a bit fuzzy on just what you think is reuqired to get into heaven. You have to be Christian, I got that. Anything else? Is it ok to just belong to a church? To believe in Christ but not follow any organized religion? Do you have to repent of your sins? Any rituals required? (baptism, last rites, communion, confession, etc) Good deeds? Please, give me the whole spiel.\n\n \n The only thing that matters, per this discussion (because it's about the merits of one religion over others) is that it's through Christ. (as opposed to what Muslims would say in general, or what hindus would say in general). And that's what Christian sects have in common. You're asking me to elevate the trees over the forest here, and I see no need given we're basically talking about broad religions compared to each other. Again, if we start getting into breaking down the differences between factions, we're going to have to do the same for every religion there is, to be fair.\n \n \nYou are sure that your path is the one and only way to avoid hell, so what is it exactly? Alot of religions can supply what amounts to a checklist, so if you have something like that than that's what I'm looking for here.\n\n \n I am sure that the only way to heaven is thru Christ as opposed to any other figure and means, and that's what Christians believe in common. I don't think you're going to be satisfied with that, because you seem to want to take this discussion into breaking down individual religions into factions and beliefs, and I'm just not interested in that right now--it will go on forever.", 
   {}, 
   232508, 
   null, 
   1159314000.0
  ], 
  [
   232526, 
   null, 
   "INRI", 
   "No single Christian belief beats that.\n\n \n yes it does.\n \n The single Christian belief that Christ is the path to heaven all 2 billion Christians believe that.", 
   {}, 
   232521, 
   null, 
   1159315260.0
  ], 
  [
   232613, 
   null, 
   "electrolyte", 
   "So if 2/3s of the world preferred driving a Volvo, you'd assume that was no reflection on Volvos at all?\nNot really a good analogy, since people have alot of free choice in the car they drive. People's religious choice is determined mostly by what their parents practice.\n\n I think a more applicable response would be:\n Not really a good analogy, since even if two-thirds of the world's drivers drove Volvos, we cannot conclude that Volvos are the only vehicles that get the driver to the intended destination.", 
   {}, 
   232492, 
   null, 
   1159335360.0
  ], 
  [
   232647, 
   null, 
   "Kronus", 
   "\n But we're discussing Christianity contrasted to other religions, not the factions of Christianity. \n \n The only thing that matters, per this discussion (because it's about the merits of one religion over others) \n \n\n \n I think we're starting to talk at cross purposes here. I am most emphatically not comparing one religion to another. I am talking strictly and soley about whether there is only one true path to get into heaven, and what it would mean if that were true. A discussion of various religions tenets and beliefs is bound to occur in the course of such a discussion, but I am not here to compare and contrast religions; that really is secondary to the point I'm trying to get across.", 
   {}, 
   232521, 
   null, 
   1159372260.0
  ], 
  [
   232656, 
   null, 
   "jyoshu", 
   "I think a more applicable response would be:\n Not really a good analogy, since even if two-thirds of the world's drivers drove Volvos, we cannot conclude that Volvos are the only vehicles that get the driver to the intended destination.\n\n \n But we can conclude that in all likelihood that percentage would believe it was the only way. The only way to conclusively prove (in the sense of empirical evidence) how to get to heaven is to choose a certain path and then die, and see what happens. But then you'd have no way to report back to everyone! :) \n \n \nI think we're starting to talk at cross purposes here. I am most emphatically not comparing one religion to another. I am talking strictly and soley about whether there is only one true path to get into heaven, and what it would mean if that were true. A discussion of various religions tenets and beliefs is bound to occur in the course of such a discussion, but I am not here to compare and contrast religions; that really is secondary to the point I'm trying to get across.\n\n \n Ok, fair enough, but it seems to me that if we're talking about whether Christianity's way to heaven is more valid than, say, Islams, then we are indeed comparing religions. You took issue with my idea that the Christian way was THE way to get to heaven (as opposed to other ways, such as Hinduism's or Islam's).", 
   {}, 
   232613, 
   null, 
   1159374060.0
  ], 
  [
   232664, 
   null, 
   "Kronus", 
   "\n Ok, fair enough, but it seems to me that if we're talking about whether Christianity's way to heaven is more valid than, say, Islams, then we are indeed comparing religions.\n\n \n Not in the least. I'm maintaining that saying that any one way is the only possible way is wrong; the details of the one way are irrelevant. I'm saying that all \"one path\" doctrines are equally wrong, you countered by trying to explain why you think yours is right. Not an unreasonable approach, but don't lose sight of what I'm saying. I'm not saying that one is better than another, I think they're all off the mark. God has not made clear that he wants us to follow one specific path, so either he doesn't want us to follow one specific path, or he has no problem condmening most of humanity to hell for guessing incorrectly. I say it's the former.", 
   {}, 
   232656, 
   null, 
   1159375140.0
  ], 
  [
   232685, 
   null, 
   "jyoshu", 
   "Not in the least. I'm maintaining that saying that any one way is the only possible way is wrong; the details of the one way are irrelevant. I'm saying that all \"one path\" doctrines are equally wrong, you countered by trying to explain why you think yours is right. Not an unreasonable approach, but don't lose sight of what I'm saying. I'm not saying that one is better than another, I think they're all off the mark. God has not made clear that he wants us to follow one specific path, so either he doesn't want us to follow one specific path, or he has no problem condmening most of humanity to hell for guessing incorrectly. I say it's the former.\n\n \n What if he has made it clear (in the form of one of the religions) but some people refuse to accept that one of them? In other words, why is it that one of them couldn't be right? Your thinking seems to assume we are incapable of either (a.) not seeing the truth when it's in front of us, and/or (b.) refusing to accept it. Your way would involve us not having freedom of choice. If He's given the path there, and people don't want it, how is that He's responsible for them refusing it? You keep calling that a guess, but it's only going to look like a guess to someone who won't accept it. And if they haven't accepted it, they've already made up their mind. I don't think anyone, including you, truly 'guesses' if you have something about the religion that makes you reject it. It seems to me you don't have to guess--I've pointed you to resources to show why one religion really is the better one, and more people agree on that one religion than any other religion. There really are reasons to choose that one.", 
   {}, 
   232664, 
   null, 
   1159379220.0
  ], 
  [
   232710, 
   null, 
   "Kronus", 
   "What if he has made it clear (in the form of one of the religions) but some people refuse to accept that one of them? In other words, why is it that one of them couldn't be right? Your thinking seems to assume we are incapable of either (a.) not seeing the truth when it's in front of us, and/or (b.) refusing to accept it.\n\n If 95% of the world followed the same path then your argument would make sense. But you only have about a third of the world following the most popular path. It can't be the case that 66% of the world is too blind to see the obvious truth, especially given the consequences. Either the truth isn't obvious, or there isn't just one truth. \n \n \n \nI've pointed you to resources to show why one religion really is the better one, and more people agree on that one religion than any other religion. There really are reasons to choose that one.\n\n \n But you must see that the arguments you made are the same arguments that any devout follower would make, regardless of faith. Every person of faith thinks their faith is best, and can come up with reasons why they're right, it comes with the territory. None of what you've said about your faith being best is based on reason, and so you haven't shown anything. Using faith to support faith only works on those who share your faith. For the rest, it's essentially meaningless.\n \n (note, I haven't made it through Locke's essay yet)", 
   {}, 
   232685, 
   null, 
   1159383540.0
  ], 
  [
   232711, 
   null, 
   "johnhanks", 
   "So if 1/3 of the world's drivers preferred driving a Volvo, with no other cars coming close in terms of percentage, you'd assume that was no reflection on Volvos at all?\n\n \n Let's push this analogy just a little further.\n \n Time was, virtually everyone in the old East Germany drove a Wartburg Trabant. This was not because the Trabant was a superior car - there just wasn't any alternative. The 1/3 of the world you're talking about haven't selected christianity after test-driving all of the available models: they've just accepted the one most readily available to them - in fact they've probably inherited it from their parents.\n \n And even if they were able to make a choice, no actual 'test drives' are available without dying first. While you're alive, all you've got to help you choose between all the competing religions is the manufacturers' promotional literature. Would you choose a car on that basis?", 
   {}, 
   232486, 
   null, 
   1159383960.0
  ], 
  [
   232714, 
   null, 
   "jyoshu", 
   "But you must see that the arguments you made are the same arguments that any devout follower would make, regardless of faith. Every person of faith thinks their faith is best, and can come up with reasons why they're right, it comes with the territory. \n\n \n But that's what you wanted me to do: come up with reasons why I think it's right. If there was no need then why did you ask for the reasons? I disagree with you that the same arguments for Christianity can be made for all or other religions. I think Christianity really is unique in terms of the potential good it offers to society; That's not to say other relgions aren't also beneficial.\n \n \n(note, I haven't made it through Locke's essay yet)\n\n \n I understand, it's written in very flamboyant English of the time.", 
   {}, 
   232710, 
   null, 
   1159387440.0
  ], 
  [
   232719, 
   null, 
   "jyoshu", 
   "Let's push this analogy just a little further.\n \n Time was, virtually everyone in the old East Germany drove a Wartburg Trabant. This was not because the Trabant was a superior car - there just wasn't any alternative.\n\n \n But in this case, of religions, there are alternatives.\n \n \nThe 1/3 of the world you're talking about haven't selected christianity after test-driving all of the available models: they've just accepted the one most readily available to them - in fact they've probably inherited it from their parents.\n\n \n That goes on the erroneous assumption that people don't go through a questioning process about their religion and at some point indeed make the choice. I believe most, if not all Christians, do. I guess I can't point you to numbers for it, but I do know I've never known any Christian that didn't go through that process.\n \n \nAnd even if they were able to make a choice, no actual 'test drives' are available without dying first.\n\n \n Yes, but I believe the reason Christianity's view of getting to heaven got and remains popular because it makes the most sense, out of other religions. This, I believe, is because it is based in part on the evil in humankind which is very easy to validate, and offers atonement.\n \n I also think it's somewhat unfair to base this discussion solely on \"what it takes to get to heaven\". That gives an approach to religion akin to fire insurance, or simply avoiding hell. It reduces it to nothing more than self-preservation. But in fact, the religious life most religious people live is much more than that, and involves what they call a relationship with their deity. People adopt religions for other reasons too such as (a.) comfort in time of tragedy, and (b.) because they are searching for answers and a give religion makes the most sense to them, and (c.) because of a religious experience. There may be other reasons too that I haven't thought of.", 
   {}, 
   232711, 
   null, 
   1159388040.0
  ], 
  [
   232741, 
   null, 
   "Kronus", 
   "But that's what you wanted me to do: come up with reasons why I think it's right. If there was no need then why did you ask for the reasons? \n\n \n Actually, what I really wanted was for you to show me how one was supposed to know that some specific path was the one and only path that God wants. That's slightly different from why you think it's right. The reasons you think it's right are faith based; that does nothing to address the issue of why someone should think it's the one and only correct path. If it's the only path than one should be able to know that before accepting that it's true. Otherwise, logically, where are you? You're stuck having to sincerely have faith in one religion after another until you finally hit the right one and realize you're done, and you better hope you hit the right one before that truck hits you, otherwise an eternity in hell; obviously an absurd proposition.", 
   {}, 
   232714, 
   null, 
   1159392840.0
  ], 
  [
   232746, 
   null, 
   "Kronus", 
   "\n Yes, but I believe the reason Christianity's view of getting to heaven got and remains popular because it makes the most sense, out of other religions. \n\n \n I really doubt that's true. As you said, most people don't shop around for religions and choose the \"best\". The vast majority of religious people are the same religion as their parents. The reason there are so many Christians is that Christian Europe settled the Americas. In modern times these are densely populated areas, so you get alot of Christians. If the dice had rolled differently and the Hindus had been in Europe around 1500, than we'd have lots of Hindus now.\n \n I thought it would be interesting to look at conversion numbers, in light of this dicussion, but I haven't been able to find any reliable ones. If anyone comes across a good collection I'd really like to see it.", 
   {}, 
   232719, 
   null, 
   1159393740.0
  ], 
  [
   232763, 
   null, 
   "electrolyte", 
   "But we can conclude that in all likelihood that percentage would believe it was the only way.\n\n Here is where it would really behoove you to distance yourself from the analogy, because -- quite obviously -- Volvos are not the only way to get to where one wants to go. Whether people truly believe that they are is not the question Kronus is asking.", 
   {}, 
   232656, 
   null, 
   1159402200.0
  ], 
  [
   233045, 
   null, 
   "johnhanks", 
   "That goes on the erroneous assumption that people don't go through a questioning process about their religion and at some point indeed make the choice. I believe most, if not all Christians, do.\n\n I doubt that. Do you really think that 'most, if not all' Catholic campesinos in Latin America 'go through a questioning process about their religion' and seriously contemplate adopting a different one? I imagine the majority of the faithful accept the faith they inherit.\n \n \nI also think it's somewhat unfair to base this discussion solely on \"what it takes to get to heaven\". That gives an approach to religion akin to fire insurance, or simply avoiding hell.\n\n Agreed - the same thought occurred to me whilst writing my last post. But the same point applies to any of the 'comforts' or 'answers' christianity might provide - since it isn't practicable to become serially a committed Christian, then a committed Jew, then a committed Hindu, then a committed Muslim etc, as part of some grand consumer survey to find which one gives the best answers, in practice people go by the promotional literature. Test drives aren't really an option.", 
   {}, 
   232719, 
   null, 
   1159556340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Was Jesus of Nazareth Divine?", 
  "url": "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 8891, 
  "discussion_files": [
   [
    "32109.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-print.html"
   ], 
   [
    "32110.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-8-print.html"
   ], 
   [
    "32111.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-6-print.html"
   ], 
   [
    "32112.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-4-print.html"
   ], 
   [
    "32113.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-5-print.html"
   ], 
   [
    "32114.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-7-print.html"
   ], 
   [
    "32115.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-3-print.html"
   ], 
   [
    "32116.html", 
    "http://www.4forums.com/political/religion-debates/8891-jesus-nazareth-divine-2-print.html"
   ]
  ], 
  "identifier": 8891
 }
]