[
 [
  [
   231718, 
   null, 
   "foundit66", 
   "SUMMARY: A Vermont judge could penalize a Virginia woman who failed to comply with a child-custody ruling that grew out of the breakup of her civil union. \n \n A family court judge in Vermont will decide after a hearing whether to penalize a Virginia woman who failed to comply with a child-custody ruling that grew out of the breakup of her civil union. \n \n Two years ago, Judge William Cohen found Lisa Miller-Jenkins in contempt of court for failing to comply with his order granting temporary visitation to Janet Miller-Jenkins, her former partner. \n \n Following that ruling, Lisa Miller-Jenkins argued the case should be heard in Virginia. Last month, the Vermont Supreme Court rejected her argument and sent the case back to family court, saying Vermont has exclusive jurisdiction. \n \n \"The Vermont Supreme Court was specific in its remand on the contempt finding of this court to impose a penalty, and that needs to be addressed,\" Cohen said in court Tuesday. \n \n Cohen did not set a date for the hearing, although he said he would like to schedule it within the next month or two. Cohen said he would delay the hearing until after the Supreme Court rules on a motion by Lisa Miller-Jenkins's attorneys asking the high court to reconsider its August ruling. \n \n The attorney for Janet Miller-Jenkins, Theodore Parisi, said after Tuesday's hearing that he was not sure what penalty he would ask the court to impose. Lisa Miller-Jenkins's Vermont attorney, Judy Barone, said she didn't know if her client would attend a Vermont hearing. \n \n The women left Virginia and went to Vermont in 2000 to get a civil union. They returned home, where Lisa was artificially inseminated and gave birth to a baby girl, Isabella. Later they moved to Vermont, where they lived together a little more than a year before splitting. \n \n Courts in Virginia have ruled that that state has jurisdiction in the custody case and that its laws banning same-sex marriage control it, Barone said. Many legal observers expect the underlying custody case eventually to be decided by the U.S. Supreme Court. \n \n Barone also said she didn't know what would happen if a Vermont court penalized her client with her client remaining in Virginia. \"I'm not a Virginia lawyer, so I can't comment on that,\" she said. (AP) \n http://news.yahoo.com/s/po/20060920/co_po/vamomfacespenaltyinmarathoncustodycase", 
   {
    "post_info": {
     "post_title": "Va. mom faces penalty in marathon custody case"
    }
   }, 
   null, 
   null, 
   1158863040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Va. mom faces penalty in marathon custody case", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8909-va-mom-faces-penalty-marathon-custody-case.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8909, 
  "discussion_files": [
   [
    "13134.html", 
    "http://www.4forums.com/political/gay-rights-debates/8909-va-mom-faces-penalty-marathon-custody-case-print.html"
   ]
  ], 
  "identifier": 8909
 }
]