[
 [
  [
   232191, 
   null, 
   "Shooterandproud", 
   "Ive dedicated this thread for people to post their funneist comebacks to antis. Here are some taken from The High Road:\n \n Funniest Comebacks for Antis:\n \n THEM: Why do you own a gun?\n \n ME: Because I don't think giving a rapist a free go at my wife and daughters is a good idea. \n \n OR\n \n THEM (man): I don't think people should have guns!\n \n ME: Why? You planning on raping my wife?\n \n THEM: No! \n \n ME: Then why do you need her to be helpless? \n \n THEM: Uhhh...\n \n -----------------------------\n \n \"Do you believe people should be allowed to defend themselves? Well...yes.\n \n Do you believe people should be allowd to learn martial arts to do it? Of course.\n \n Well, shooting is a martial art. We just don't wear the funny outfits.\"\n \n -------\n \n \"So you think only the police and military should have guns?\"\n \n \"Yes\"\n \n \"Well then, let's pretend that somehow all 'criminals' and 'citizens' have been disarmed and that I am a policeman.\"\n \n \"OK\"\n \n \"Now take you clothes off.\"\n --------\n \n You know there's a greater chance of having your gun taken away and used on you! \n \n \n Yeah, but whoever wants to will have to absord a full mag of .45ACP and then beat me to death with the empty. \n \n \n -----\n \n \"Oh, no, my husband and I don't believe in guns!\"\n \n \"Ma'am, I assure you, they exist.\"\n \n -------------------------\n \n Them: \"Why do you even need a gun?\"\n \n Me(said with serious expression): \"How else am I supposed to fight off the zombies\n -------------\n Them: \"I think you're just trying to compensate for other things.\"\n \n Me (if female): \"Would you like to test that theory?\"\n \n Me (if male): \"Exactly, such as society's inability to keep me safe from harm.\"\n -------\n \n Female DJ: So Mr. Brown, what do you have planned for the boy scouts today?\n \n Boy Scout Leader: We're going to be going to the firing range, where we'll be teaching them to shoot.\n \n FDJ: But isn't that dangerous?\n \n BSL: Oh no, they'll be closely supervised. I've ensured each of the boys has hearing and eye protection, and we'll be using single shot .22 rifles.\n \n FDJ: But aren't you equipping them to be murderers?\n \n BSL: Excuse me?\n \n FDJ: Well you're teaching them how to shoot. You're giving them the tools to be murderers.\n \n BSL: Well ma'am, you're equipped with the tools to be a prostitute, doesn't mean you are\n \n -------\n Them: I don't like guns!\n \n Me: Well I don't like you, but the difference between us is: you are trying to get rid of my gun, but I am not trying to get rid of you, even though I have the means [Pats hip].\n ------\n \n Them: \"You know there's a greater chance of having your gun taken away and used on you!\"\n \n Me: \"Where do you think I got this one?\"\n \n ------\n \n Ninny: \"We need gun control!\"\n Me: \"Gun control is the theory that 110lb. women have the 'right' to fistfight with 210lb. rapists.\"\n -----\n Right after Columbine,\n Male Starbucks Cashier: \"Boy, it sure takes a lot of guts to wear that NRA hat these days!\"\n Me: \"Who's going to make me take it off?\"\n ------\n \n anti-gunner: Civilians don't need firearms\n My wiseass answer: I have 5 words for you \"Katrina, Los Angeles and Auschwitz.\"\n \n anti-gunner: \"that's an extreme and silly argument\"\n My wiseass response: \"two of the 3 happened in the last decade and the unarmed were victims of criminals who didn't care if their weapons were illegal. in 2 of the 3 cases the courts said the police don't have to give a damn about your safety, and in the 3rd the police helped commit the crime.\"\n \n --------\n \n Anti. Why do you need guns?\n \n Me. Because I cant throw a rock at 1200 ft. a second.\n \n -------\n \n Her: I don't think people should be allowed to carry guns.\n \n Me: I bet every rapist in the country agrees with you.\n \n -----\n \n \"I hate guns.\"\n \"I despise ignorance. Your point is?\"\n \n \"Guns are only made to Kill.\"\n \"Or to defend a person from a killer.\"\n \n \"All guns should be outlawed.\"\n \"Then only outlaws will have guns and they'll use them against unarmed citizens, like you.\"\n \n \"Only the military and police should have guns.\"\n \"See any policemen or soldiers nearby?\" OR\n \"That worked so well in Europe back in the 30's didn't it?\"\n \n \"I'll never own or touch a gun.\"\n \"Why don't you post a sign that says just that outside your front door?\"\n \n \"I depend on the Police to keep me safe.\"\n \"Foolish child.\" OR\n \"You probably don't remember the Rodney King riots in LA then, right?\" OR \n \"You've been lucky so far, eh?\"\n -------------\n \n Them: Why do you need a gun?\n Me: Break into my house at 3am and find out\n \n Female: Real men don't need guns. \n Me: I knew you were a transvestite!\n \n Them: Who needs more than 10 rounds?\n Me: Who needs to throw more than 10 punches during a fistfight?\n \n Female: You must be compensating for something...\n Me: No, I assure you, my barrel is not ported.\n \n Them: Why does a classical musician need a gun?\n Me: Why do people need classical music... because it's good for them!\n \n ---------\n \"Texas Ranger Charlie Miller was minding his own business when a concerned citizen came up to him, noted the hammer cocked back on the big 1911 dangling from the Ranger's belt, and asked, \"Isn't that dangerous?\" Charlie replied, \"I wouldn't carry the son-of-a-bitch if it wasn't dangerous.\"\n -----------------\n \n \"Why do you carry a gun? Are you some sort of psycho?\"\n \"Why do you carry a backpack? Are you a suicide bomber?\"\n \n ---------------------------", 
   {
    "post_info": {
     "post_title": "Funniest comebacks for ANTIs."
    }
   }, 
   null, 
   null, 
   1159155360.0
  ], 
  [
   233662, 
   null, 
   "Count Otto", 
   "What actually backs up the assertion that arming of the Jews, Gypsies, homosexuals and handicapped of 1930's Germany, would have made any difference to the final outcome? I've always wondered. They were facing police, the SS and, ultimately, the most advanced, well equipped and well-trained army in Europe. They wouldn't have had a cat's chance and the first time a band of Jews (e.g.) had killed police or army it would've justified Hitler's actions to every non-Jewish member of the populace.\n \n The idea that arming the populace is a sure-fire way of preventing tyrannical government is spurious on at least two counts. Firstly, isn't it far more likely that you'll have a civil war rather than a revolution (cf Iraq circa 1991)? \n \n Secondly, your trust in the mechanisms of democracy and the 'spreading out' of the power (particularly in the federal systems of the US) seems rather thin. Is it really likely that the US will see another tyrant in power?", 
   {}, 
   232191, 
   null, 
   1159971720.0
  ], 
  [
   233676, 
   null, 
   "georged", 
   "What actually backs up the assertion that arming of the Jews, Gypsies, homosexuals and handicapped of 1930's Germany, would have made any difference to the final outcome? I've always wondered. They were facing police, the SS and, ultimately, the most advanced, well equipped and well-trained army in Europe. They wouldn't have had a cat's chance and the first time a band of Jews (e.g.) had killed police or army it would've justified Hitler's actions to every non-Jewish member of the populace.\n \n The idea that arming the populace is a sure-fire way of preventing tyrannical government is spurious on at least two counts. Firstly, isn't it far more likely that you'll have a civil war rather than a revolution (cf Iraq circa 1991)? \n \n Secondly, your trust in the mechanisms of democracy and the 'spreading out' of the power (particularly in the federal systems of the US) seems rather thin. Is it really likely that the US will see another tyrant in power?\n\n \n Before your last sentence question can be answered we need to get rid of the current tyrant.", 
   {}, 
   233662, 
   null, 
   1159976400.0
  ], 
  [
   233690, 
   null, 
   "daewoo", 
   "What actually backs up the assertion that arming of the Jews, Gypsies, homosexuals and handicapped of 1930's Germany, would have made any difference to the final outcome? I've always wondered. They were facing police, the SS and, ultimately, the most advanced, well equipped and well-trained army in Europe. They wouldn't have had a cat's chance and the first time a band of Jews (e.g.) had killed police or army it would've justified Hitler's actions to every non-Jewish member of the populace.\n\n \n The Iraqi insurgents are facing the most powerful military the world has ever known, and by all accounts are winning. In vietnam a bunch of vietnamese peasants beat back the best army the world has ever known. It is impossibel to say for sure what would have happened had the German people had firearms to fight back with. At the very least, they woudl have had a much better chance and likely could have made things a LOT easier for Allied forces though guerilla actions and sabotage.\n \n \nThe idea that arming the populace is a sure-fire way of preventing tyrannical government is spurious on at least two counts. Firstly, isn't it far more likely that you'll have a civil war rather than a revolution (cf Iraq circa 1991)? \n\n \n Personally, I don't think that arming the populace is any kind of gaurantee against a tyrannical government unless the population is vigilant and willing to take up arms. \n \n \nSecondly, your trust in the mechanisms of democracy and the 'spreading out' of the power (particularly in the federal systems of the US) seems rather thin. Is it really likely that the US will see another tyrant in power?\n\n \n It is inevitable. Every government in the history of the world has eventually turned tyrannical. That is the danger that comes with government, and the reason that the guys who wrote our constitution sought to strictly limit the power of our government and gave us the second ammendment as a safeguard if we needed it.", 
   {}, 
   233662, 
   null, 
   1159988760.0
  ], 
  [
   233704, 
   null, 
   "Bryan", 
   "Hitler's view concerning the current issue on this thread:\n \n \"The most foolish mistake we could possibly make would be to allow the subject races to possess arms. History shows that all conquerors who have allowed their subject races to carry arms have prepared their own downfall by so doing. Indeed, I would go so far as to say that the supply of arms to the underdogs is a sine qua non for the overthrow of any sovereignty. So let's not have any native militia or native police. German troops alone will bear the sole responsibility for the maintenance of law and order throughout the occupied Russian territories, and a system of military strong-points must be evolved to cover the entire occupied country.\" Adolf Hitler, dinner talk on April 11, 1942, quoted in Hitler's Table Talk 1941-44: His Private Conversations, Second Edition (1973), Pg. 425-426.", 
   {
    "post_info": {
     "post_title": "Hitler's opinion...."
    }, 
    "unicode_changes_made": true
   }, 
   233690, 
   null, 
   1159990920.0
  ], 
  [
   233758, 
   null, 
   "Shooterandproud", 
   "What actually backs up the assertion that arming of the Jews, Gypsies, homosexuals and handicapped of 1930's Germany, would have made any difference to the final outcome? I've always wondered. They were facing police, the SS and, ultimately, the most advanced, well equipped and well-trained army in Europe. They wouldn't have had a cat's chance and the first time a band of Jews (e.g.) had killed police or army it would've justified Hitler's actions to every non-Jewish member of the populace.\n \n The idea that arming the populace is a sure-fire way of preventing tyrannical government is spurious on at least two counts. Firstly, isn't it far more likely that you'll have a civil war rather than a revolution (cf Iraq circa 1991)? \n \n Secondly, your trust in the mechanisms of democracy and the 'spreading out' of the power (particularly in the federal systems of the US) seems rather thin. Is it really likely that the US will see another tyrant in power?\n\n \n **Cough Cough**\n \n Not really.\n \n You are right, but disarming the people is a surefire way to skyrocket violent crime, and it would be easy to overthrow the people.\n \n Its in our freaken constitution. And statistics dont lie, wherever there is less gun control, there is less crime.", 
   {}, 
   233662, 
   null, 
   1160018460.0
  ], 
  [
   233766, 
   null, 
   "georged", 
   "**Cough Cough**\n \n Not really.\n \n You are right, but disarming the people is a surefire way to skyrocket violent crime, and it would be easy to overthrow the people.\n \n Its in our freaken constitution. And statistics dont lie, wherever there is less gun control, there is less crime.\n\n \n I think the simple fact of the US being a culture that has always generally had the civil right to own firearms is being ignored. Regulation of firearms other than automatic weapons in the US is a recent social change, still unaccepted by a large portion of gun owners. Elimination of the civil right to own guns in the US will require a few more decades of positive societal progress (difficult when having the highest per-capita rate of incarceration in the developed world) or local/federal administration attempting to remove certain civil rights for purposes of control. \n \n I don't know the date England banned personal ownership of unregulated firearms, but that might give some clue as to how long the process took under (at that time) a less democratic country where aristocracy did rule when compared to the US. I discount Australia's recent change in gun ownership laws as a comparison to the US due to population differences and their ability to control population concentrations.", 
   {}, 
   233758, 
   null, 
   1160021460.0
  ], 
  [
   233770, 
   null, 
   "daewoo", 
   "I think the simple fact of the US being a culture that has always generally had the civil right to own firearms is being ignored. Regulation of firearms other than automatic weapons in the US is a recent social change, still unaccepted by a large portion of gun owners. Elimination of the civil right to own guns in the US will require a few more decades of positive societal progress (difficult when having the highest per-capita rate of incarceration in the developed world) or local/federal administration attempting to remove certain civil rights for purposes of control. \n \n I don't know the date England banned personal ownership of unregulated firearms, but that might give some clue as to how long the process took under (at that time) a less democratic country where aristocracy did rule when compared to the US. I discount Australia's recent change in gun ownership laws as a comparison to the US due to population differences and their ability to control population concentrations.\n\n \n The problem, IMO, is that neither side in our two sided political system wishes to allow the citizenry firearms. In the scheme of things, havign citizens running around with weapons when you are trying to grab power just does not work out well. Look at .50 rifles. The dems wanted to ban them, claiming it was becuase they could be used by terrorists. The republicans got intot he act when it became apparent that they could blow through an armoured limo like it is not even there. Even politicians had trouble picking up the \".50 rifle as a terrorist tool\" argument, but both the dems and the republicans have kind of rallied behind the \"oh my god these could be used to kill people in armoured limos...AKA US\" line of thought. \n \n Bush said he would sign the AWB to renew it if it reached his desk. It did not. What DID reach his desk was several measures by the ATF that are FAR more restrictive. They banned parts kits, something clinton never managed to get legislative support for, Bush did with an executive order. Another ATF ruling made reactive trigger assemblies illegal, something else that Clinton tried to pass and never managed.", 
   {}, 
   233766, 
   null, 
   1160022600.0
  ], 
  [
   233782, 
   null, 
   "Shooterandproud", 
   "I think the simple fact of the US being a culture that has always generally had the civil right to own firearms is being ignored. Regulation of firearms other than automatic weapons in the US is a recent social change, still unaccepted by a large portion of gun owners. Elimination of the civil right to own guns in the US will require a few more decades of positive societal progress (difficult when having the highest per-capita rate of incarceration in the developed world) or local/federal administration attempting to remove certain civil rights for purposes of control. \n \n I don't know the date England banned personal ownership of unregulated firearms, but that might give some clue as to how long the process took under (at that time) a less democratic country where aristocracy did rule when compared to the US. I discount Australia's recent change in gun ownership laws as a comparison to the US due to population differences and their ability to control population concentrations.\n\n \n \n Thats a scary though. My opinion? That trying to regulate guns in any way will cause mass chaos. I know many people that, if anyone tried to confiscate their gun under a new bill, they would resist with force. There are plenty more of those out there. This is a direct violation of our liberties, and the constitution. Gun control is a huge threat to a free society, and i really hope that your post is not true. But sadly, there is a chance of that happening.", 
   {}, 
   233766, 
   null, 
   1160025360.0
  ], 
  [
   233786, 
   null, 
   "daewoo", 
   "Thats a scary though. My opinion? That trying to regulate guns in any way will cause mass chaos. I know many people that, if anyone tried to confiscate their gun under a new bill, they would resist with force. There are plenty more of those out there. This is a direct violation of our liberties, and the constitution. Gun control is a huge threat to a free society, and i really hope that your post is not true. But sadly, there is a chance of that happening.\n\n \n \n Riiiigggghhhttt. Kind of like weavers neiborghs and his militant group that vowed to stick together against the feds if they ever came for one of them. Then the neiborghs and militant group stood on the road holding signs....in a designated protest zone....while th feds blew away his wife and son. \n \n Those guys woudl meekly hand over their guns. 99.95% of them are all show and no go. When somebody DOES actually strike back like weaver did, or like McVeigh did, the strutting, anti government loudmouths scamble to hide and try to distance themselves from it. Lots of big talk, much of it stupid, but no action.", 
   {}, 
   233782, 
   null, 
   1160027880.0
  ], 
  [
   233789, 
   null, 
   "Count Otto", 
   "You are right, but disarming the people is a surefire way to skyrocket violent crime,\n\n \n No, it isn't. This is pure speculation. I can't think of a country where the experiment has been done. Here in the UK for instance, the ban on handguns was not comparable to the US. Gun ownership was very rare anyway and people simply did not walk around with guns (that was illegal of course). Unless a burglar was robbing a farmhouse they would likely not expect a gun to be present.\n \n Also look at Japan. The most draconian gun control in the democratic world. Low crime rates. Conversely, look at Switzerland. Ownership of assault rifles is totally legal - very low crime rate (very draconian legal system too). Look at Afghanistan - ready-formed, heavily-armed militias abound - permanent state of civil war since as long as anyone can remember. Could it be that these things are cultural I wonder? In fact, could it be that comparing crime stats across different countries is a waste of time?\n \n \nand it would be easy to overthrow the people.\n\n \n For who to overthrow the people? Can you really see the US army doing this? Who would give the order? Could there really be another 'burning of the Reichstag'? \n \n \nIts in our freaken constitution.\n\n \n This seems to be the crux of the matter. But why? Were the writers of the constitution infallible? Could they see into the future? Besides, \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed\" - why should there be any regulations on what you can own? A main battle tank perhaps? You're going to need that when the armoured columns start pouring into town. An ICBM perhaps? No government's going to mess with you when you have nuclear capabilities.\n \n \nAnd statistics dont lie,\n\n \n Lies, damned lies and statistics? \n \n \nwherever there is less gun control, there is less crime.\n\n \n Clearly not true (cf Japan).\n \n Notwithstanding what I've already said about comparing stats across cultural boundaries, the US has had between 4 and 10 times the murder rate of the UK in the last 2 decades. It has had about 150 times the gun murder rate.", 
   {}, 
   233758, 
   null, 
   1160050500.0
  ], 
  [
   233818, 
   null, 
   "Bryan", 
   "I'd like to address a few points Count Otto makes. I agree completely with his comment that cross-national gun control comparisons are generally worthless. In my opinion, there are no evil little voices calling from the gun cabinet to plague American homeowners. England and the Netherlands have not avoided these sinister voices advocating gun violence by restricting guns. The people of Switzerland are not collectively so hard of hearing that they have proven immune to the subliminal demands of their guns to be loaded and unleashed on the innocent. I believe that cross-national differences have far more to do with culture than with the availability of guns.\n \n I have some experience in dealing with violent crime, and in my opinion we do not have a gun violence problem in America, we have a violence problem in general. We glorify violence in America, and we teach our young that violence is an acceptable method of resolving conflicts. Violent crime springs from a variety of motives, be it anger, hatred, envy, revenge, etc. The presence of the weapon does not give rise to the motive to use it for criminal ends. \n \n As for why we have a RKBA, I would answer by saying I believe that the RKBA is a fundamental right of citizenship, and that it is further linked to the natural right of self defense. I can't state this position any better than Andrew Fletcher did long ago: \n \n \"And I cannot see, why arms should be denied to any man who is not a slave, since they are the only true badges of liberty. . . .The possession of arms is the distinction between a freeman and a slave. He who has nothing, and belongs to another, must be defended by him, and needs no arms: but he who thinks he is his own master, and has anything he may call his own, ought to have arms to defend himself and what he possesses, or else he lives precariously and at discretion. And though for a while those who have the sword in their power abstain from doing him injury; yet, by degrees, he will be awed into submission to every arbitrary command.\" Andrew Fletcher, Political Works, pp. 35 and 221 (1749).\n \n I also believe that the fundamental purpose of our criminal justice system in America is to punish the guilty without harming the innocent. I believe gun control is at odds with this principle. It seeks to punish the vast majority of the innocent out of fear of what a tiny minority might do in the future. I see it as a statement from my government that I am less a citizen and more a subject--that my government has in its wisdom decided that I can no longer be trusted with the tools to defend myself and my family from either individual or state sponsored oppression. \n \n Could there be another burning of the Reichstag-another tyrant who seeks to take advantage of an unarmed populace to consolidate power, abrogate civil liberties, and then eliminate portions of society he dislikes? It is an interesting question Count Otto proposes. In answer, I believe that the victims of Central American government-sponsored death squads would say yes. I believe that the victims lying in the killing fields of Cambodia would agree. I believe that the victims lying in mass graves in Bosnia would agree. And I also would agree. Perhaps my life experiences have led me to be too cynical, but I do not believe that we in America have evolved beyond the petty lusts for power and dominion over our fellow man that have led to so much misery for unarmed innocents in the past. \n \n Now could it be that my founding fathers were fallible? I cannot deny that possibility. But I believe that my Bill of Rights is the greatest declaration of individual freedoms that has ever been put to paper, and I believe these rights represent a healthy respect for the temptation man has to misuse his ability to rule others. My founding fathers entered into the covenant we call my Constitution for the express purpose of safeguarding my liberties. They could not see into the future any more than I can, but I believe they were fully aware that any government they founded had the ability to encroach upon those liberties. I believe they enshrined the several rights we see in the Bill of Rights to ensure that I possessed the means of defending my rights to life, liberty, and the pursuit of happiness. As a citizen who enjoys the protections my constitution affords, I believe that the maintenance of that constitution lies in my own hands and is my responsibility. The RKBA is merely one method my founders included to ensure that I would be able to keep a good grip on the liberties they sought to bequeath to me. I do believe that an individual RKBA does offer a strong moral check on the temptations of tyrants. Is it certain that an armed populace could successfully resist a tyrant? I pray my country never has to answer this question. But I absolutely agree with the belief that without arms to defend ourselves it is certain we would prove incapable of throwing off the yoke of a tyrant:\n \n \"Is it necessary for your liberty, that you should abandon those great rights by the adoption of this system?. . . Will the abandonment of your most sacred rights tend to the security of your liberty?. . . .I am fearful I have lived long enough to become an old fashioned fellow: Perhaps an invincible attachment to the dearest rights of man, may, in these refined enlightened days, be deemed old fashioned: If so, I am contented to be so. . . . Guard with jealous attention the public liberty. Suspect everyone who approaches that jewel. Unfortunately, nothing will preserve it, but downright force: Whenever you give up that force, you are inevitably ruined. . . .\n \n My great objection to this Government is, that it does not leave us the means of defending our rights; or, of waging war against tyrants. . . .\n \n The Honorable Gentleman who presides, told us, that to prevent abuses in our Government, we will assemble in Convention, recall our delegated powers, and punish our servants for abusing the trust reposed in them. Oh, Sir, we should have fine times indeed, if to punish tyrants, it were only sufficient to assemble the people. Your arms wherewith you could defend yourselves, are gone. . . . Did you ever read of any revolution in any nation, brought about by the punishment of those in power, inflicted by those who had no power at all? You read of a riot act in a country which is called one of the freest in the world, where a few neighbors cannot assemble without the risk of being shot by hired soldiery, the engines of despotism. We may see such an act in America. A standing army we shall have also, to execute the execrable commands of tyranny: And how are you to punish them? Will you order them to be punished? Who shall obey these orders? Will your Mace-bearer be a match for a disciplined regiment? In what situation are we to be? . . . .What resistance could be made? The attempt would be madness.\" Patrick Henry, (anti-federalist arguing against adoption of a federal constitution without a bill of rights) Speeches of June 5 and 7, 1788, before the Virginia Ratifying Convention, reprinted in The Anti-Federalist Papers and the Constitutional Convention Debates, pages 199-216, Mentor Books, 1986, edited by Ralph Ketchum.\n \n Finally, Count Otto asks whether the RKBA should be construed to be absolute. I say no. I tend to get in trouble sometimes from the more extreme gun rights supporters for saying this, but I say the right can be subject to limitation. The issue for me is not whether any gun control can exist, but where to strike the proper balance between public safety and respecting a fundamental individual right.\n \n --- \n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and \n consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921.\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Supreme Court Justice Louis Brandeis, Olmstead v. United States, 277 U.S. 438, 485 (1928) (dissenting opinion).", 
   {
    "unicode_changes_made": true
   }, 
   233789, 
   null, 
   1160069700.0
  ], 
  [
   233903, 
   null, 
   "Baltidog", 
   "Shooterandproud those jokes were so bad, that I think you made me \"ANTI\".emoticon_xkill \n Family members being raped jokes have always be a real hoot.\n Ya'll pro-gun folks sure talk a lot about rape? \n \n I maybe a little ignorant but I don't have clue what you are talking about here:\n \nFemale: You must be compensating for something...\n Me: No, I assure you, my barrel is not ported.\n\n ported?\n \n FYI, I am against gun-control laws. I don't like handguns but since when was me not liking something have anything do with morality or law. It's just my opinion. I believe handguns are unsafe. I believe that person is more likely to kill someone they like or themselves with their handgun then they are to kill someone they hate. I personally think that people should have shotguns, rifles of all types, RPGs, SAMs, trebuchets, blow-darts and sonic death rays since with these you are more likely to kill your foe then your friends or raped family members. I think we should not have tanks since they mess up the roads, but trailer mounted artillary is coolemoticon_xgood \n \n This one's not bad:\n \nThem: \"Why do you even need a gun?\"\n \n Me(said with serious expression): \"How else am I supposed to fight off the zombies\nI with you brother.:) God damn zombies.", 
   {}, 
   233818, 
   null, 
   1160108100.0
  ], 
  [
   233908, 
   null, 
   "Ruefield", 
   "Here is something that it seems not many people think about; several times in the original post, the prevention of rape was called on as a positive for gun ownership, however does anyone actually know how many rapes were prevented because of a gun? very little to none! in most cases either a woman does not have a gun or is assulted before her gun can be drawn... also the reason why guns are viewed as such of a pro-crime agent is because in cases of suddened rage an armed perpatrator can kill another person in the blink of an eye, bat of an eyelash situation whereas if given time to chill their anger, they would not have done such a thing. MOST GUN RALATED DEATHS ARE NOT CAUSED BY A PSYCHOTIC KILLED, instead, it is the average person that had been going through a tough period in his/her life and could possible worked through it if catalyst of a gun had not been present to end both the life of their victum, and their life as an everyday person", 
   {}, 
   233903, 
   null, 
   1160110320.0
  ], 
  [
   233913, 
   null, 
   "Shooterandproud", 
   "No, it isn't. This is pure speculation. I can't think of a country where the experiment has been done. Here in the UK for instance, the ban on handguns was not comparable to the US. Gun ownership was very rare anyway and people simply did not walk around with guns (that was illegal of course). Unless a burglar was robbing a farmhouse they would likely not expect a gun to be present.\n \n Also look at Japan. The most draconian gun control in the democratic world. Low crime rates. Conversely, look at Switzerland. Ownership of assault rifles is totally legal - very low crime rate (very draconian legal system too). Look at Afghanistan - ready-formed, heavily-armed militias abound - permanent state of civil war since as long as anyone can remember. Could it be that these things are cultural I wonder? In fact, could it be that comparing crime stats across different countries is a waste of time?\n \n \n \n For who to overthrow the people? Can you really see the US army doing this? Who would give the order? Could there really be another 'burning of the Reichstag'? \n \n \n \n This seems to be the crux of the matter. But why? Were the writers of the constitution infallible? Could they see into the future? Besides, \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed\" - why should there be any regulations on what you can own? A main battle tank perhaps? You're going to need that when the armoured columns start pouring into town. An ICBM perhaps? No government's going to mess with you when you have nuclear capabilities.\n \n \n \n Lies, damned lies and statistics? \n \n \n \n Clearly not true (cf Japan).\n \n Notwithstanding what I've already said about comparing stats across cultural boundaries, the US has had between 4 and 10 times the murder rate of the UK in the last 2 decades. It has had about 150 times the gun murder rate.\n\n \n You completely miss the point. Look at Canada, look at switzerland, look at virginia. Now, look at California (LA), look at New York. Thats all speculation. Mine is too, but it can work both ways.", 
   {}, 
   233789, 
   null, 
   1160112060.0
  ], 
  [
   233914, 
   null, 
   "Shooterandproud", 
   "Shooterandproud those jokes were so bad, that I think you made me \"ANTI\".emoticon_xkill \n Family members being raped jokes have always be a real hoot.\n Ya'll pro-gun folks sure talk a lot about rape? \n \n I maybe a little ignorant but I don't have clue what you are talking about here:\n \n ported?\n \n FYI, I am against gun-control laws. I don't like handguns but since when was me not liking something have anything do with morality or law. It's just my opinion. I believe handguns are unsafe. I believe that person is more likely to kill someone they like or themselves with their handgun then they are to kill someone they hate. I personally think that people should have shotguns, rifles of all types, RPGs, SAMs, trebuchets, blow-darts and sonic death rays since with these you are more likely to kill your foe then your friends or raped family members. I think we should not have tanks since they mess up the roads, but trailer mounted artillary is coolemoticon_xgood \n \n This one's not bad:\n I with you brother.:) God damn zombies.\n\n \n The reason we make rape jokes, is because to me, theres nothing better than caping a rapist or sexual preditor in the pubes. Thats just my opinion.\n \n And zombies are a big threat to america. We must be armed and ready for the next uprising, or we may all turn into zombies.", 
   {}, 
   233903, 
   null, 
   1160112420.0
  ], 
  [
   233924, 
   null, 
   "Baltidog", 
   "The reason we make rape jokes, is because to me, theres nothing better than caping a rapist or sexual preditor in the pubes. Thats just my opinion.\n\n Caping a rapist in the pubes? Like maneuvering by means of a cape? Now I'm realling confused. I can think of a lot of things a lot better then manipulated some creeps genitels with my cape. Do you really wear a cape?emoticon_wow", 
   {}, 
   233914, 
   null, 
   1160116620.0
  ], 
  [
   233925, 
   null, 
   "Count Otto", 
   "You completely miss the point. Look at Canada, look at switzerland, look at virginia. Now, look at California (LA), look at New York. Thats all speculation. Mine is too, but it can work both ways.\n\n \n Yes, but all I'm trying to show is that there's no evidence to back up a lot of the claims that are made with regard to guns being a preventative measure of any worth. It seems like the real reason people want to keep them is because the Constitution says so. The Constitution has taken on a pseudo-religious aspect.\n \n The funny thing is, if the Constitution had been written 100 years earlier, it would probably imply the right to bear swords rather than guns. I wonder if people would still be walking the streets of the US with a sabre strapped to their waist just because they could?\n \n I agree with the previous poster who said that the culture of violence is to blame. We have one here in the UK too (though it has more to do with getting drunk and starting fights).", 
   {}, 
   233913, 
   null, 
   1160131800.0
  ], 
  [
   233934, 
   null, 
   "emclean", 
   "MOST GUN RALATED DEATHS ARE NOT CAUSED BY A PSYCHOTIC KILLED, instead, it is the average person that had been going through a tough period in his/her life and could possible worked through it if catalyst of a gun had not been present to end both the life of their victum, and their life as an everyday person\n\n and you have what evadance to back this up?\n \n do you know, most violent crime dose not involve a firearm? 7.2% of violent crime involves a firearm. in most types of violent crime, no weapon is used.\n http://www.albany.edu/sourcebook/pdf/t317.pdf\n \n \nYes, but all I'm trying to show is that there's no evidence to back up a lot of the claims that are made with regard to guns being a preventative measure of any worth.\n\n would interviews with convicted felons count as evidance, according to interviews, they are more worried about encountering an armed victome than they are LEO's. \n \n \nIt seems like the real reason people want to keep them is because the Constitution says so. \n\n no, it is because the corts tell us the police have no responsibility to protect us, that they are there to protect society. so the responsibility falls to me.", 
   {}, 
   233925, 
   null, 
   1160144100.0
  ], 
  [
   233937, 
   null, 
   "Count Otto", 
   "would interviews with convicted felons count as evidance, according to interviews, they are more worried about encountering an armed victome than they are LEO's.\n\n \n Not really, no. Firstly, these are criminals - pretty much the definition of dishonesty. Secondly, \"more worried\"? These are people who went ahead and did it anyway (i.e. convicted). Thirdly, you'd need a pretty exhaustive study to conclude as you do - you'd need to speak to people who actually were put off by the threat of guns too. \n \n \n \nno, it is because the corts tell us the police have no responsibility to protect us, that they are there to protect society. so the responsibility falls to me.\n\n \n What's the difference between you and society? I can't see how allowing vigilante justice is protecting society anyway. Furthermore, if society is such that one must live in so much fear as to need a gun, I'd suggest that it is a society that needs careful inspection.", 
   {}, 
   233934, 
   null, 
   1160146080.0
  ], 
  [
   233975, 
   null, 
   "emclean", 
   "What's the difference between you and society?\n\n i am a single person, society is all of us. \n i do not know if this is true in the UK, but if some one is killed, and the LEO's could have prevented it, but did not, they are not liabul.this was reafermed last year by the SCOTUS. two kids were kidnaped by there father, who had a court order not to see the kids, the mouther told the cops he had taken them, but the imforation was not acted opon for a few days. when it was the kids were found dead, killed that morning. the departmrnt was found not to be at any fault for the death of those kids. \n \n \nI can't see how allowing vigilante justice is protecting society anyway. \n\n i am not protecting society, that is what the cops are doing by crusing around. it is not vigilanty justice to protect your self. it is my right, \"Section 32. The people shall have a right to bear arms, for the defense of themselves and the State.\"\n \n \nFurthermore, if society is such that one must live in so much fear as to need a gun, I'd suggest that it is a society that needs careful inspection.\n\n i do not live in fear, i know i have the tools and training to deal with another who would want to take life, or health from me or my famliy. i would agree that the society need to take a long hard look at what is the root couse of the violance, but it is easer to blame the tool, and to try to ban it. then we can sit back and wonder why it has not changed. \n in America we can not ask too many questions about violent crime, or we will be called raciset, as it is a minorty who is convicted for the majorty of it.", 
   {}, 
   233937, 
   null, 
   1160161500.0
  ], 
  [
   234036, 
   null, 
   "Shooterandproud", 
   "Caping a rapist in the pubes? Like maneuvering by means of a cape? Now I'm realling confused. I can think of a lot of things a lot better then manipulated some creeps genitels with my cape. Do you really wear a cape?emoticon_wow\n\n \n Forgot, people here dont understand slang. \"Cap\" as in \"shoot\".", 
   {}, 
   233924, 
   null, 
   1160188140.0
  ], 
  [
   234037, 
   null, 
   "Shooterandproud", 
   "Yes, but all I'm trying to show is that there's no evidence to back up a lot of the claims that are made with regard to guns being a preventative measure of any worth. It seems like the real reason people want to keep them is because the Constitution says so. The Constitution has taken on a pseudo-religious aspect.\n \n The funny thing is, if the Constitution had been written 100 years earlier, it would probably imply the right to bear swords rather than guns. I wonder if people would still be walking the streets of the US with a sabre strapped to their waist just because they could?\n \n I agree with the previous poster who said that the culture of violence is to blame. We have one here in the UK too (though it has more to do with getting drunk and starting fights).\n\n \n Yes i do agree with the violence problem in the US. I just dont think a gun control law is the magic fix.", 
   {}, 
   233925, 
   null, 
   1160188200.0
  ], 
  [
   234039, 
   null, 
   "Shooterandproud", 
   "Not really, no. Firstly, these are criminals - pretty much the definition of dishonesty. Secondly, \"more worried\"? These are people who went ahead and did it anyway (i.e. convicted). Thirdly, you'd need a pretty exhaustive study to conclude as you do - you'd need to speak to people who actually were put off by the threat of guns too. \n \n \n \n \n What's the difference between you and society? I can't see how allowing vigilante justice is protecting society anyway. Furthermore, if society is such that one must live in so much fear as to need a gun, I'd suggest that it is a society that needs careful inspection.\n\n \n We most likely dont need a gun, but there may be an event when a gun can save your life. Lets make up some scenarios. Lets say theres an armed gunaman inside of your office building shooting everyone in sight. You are hiding behind a desk, and will probably be shot later. What thought goes through your head. Is it \"We need more gun control!\" or is it \"Gee, i wish I had a gun!\". Most likely the latter, because gun control wont save your life at that moment. Nothing will stop criminals from aquiring guns.\n \n Lets make another scenario. A madman on the street takes a knife out and starts killing people. He sees you and starts running towards you. \n \n With gun control laws: He runs up to you and slits your throat, you die on the spot.\n \n Without gun control: You pull out your carry peice and fire a warning shot... into his head... before he hurts anybody.\n \n Lets make another scenario:\n \n With gun control: A thug with a baseball bat breaks into your house and knocks you over the head. You wake up to find yourself at gun point only to find 3 other thugs raping your 13 year old daughter. They shoot you when they're done and you are rushed to the ER, you die later.\n \n Without gun control: A thug with a baseball bat breaks into your house with a baseball bat. You see him and quickly grab your S&W 66 and blast him and his buddies to high hell. You or your family were not hurt.\n \n I could go on and on, but i think you get the point. We most likely will never need a gun, but for scenarios that we do, its always good to have them around.", 
   {}, 
   233937, 
   null, 
   1160188800.0
  ], 
  [
   234058, 
   null, 
   "Baltidog", 
   "Forgot, people here dont understand slang. \"Cap\" as in \"shoot\".\n\n Oh you mean capping. I thought you might have a Bolero fetish.\n \n \nLets make another scenario:\n \n With gun control: A thug with a baseball bat breaks into your house and knocks you over the head. You wake up to find yourself at gun point only to find 3 other thugs raping your 13 year old daughter. They shoot you when they're done and you are rushed to the ER, you die later.\n\n Always with the raping. I'm worried about you dude. It's OK to talk about it. Or do you mean rapping? Are you afraid that someone is gonna bust ya wit some ill rhymes? \n Also I am bit confused about how someone could be held at gun point by a baseball bat. I am sorry I am not down with gun lingo. emoticon_confused", 
   {}, 
   234036, 
   null, 
   1160195400.0
  ], 
  [
   234065, 
   null, 
   "Shooterandproud", 
   "Oh you mean capping. I thought you might have a Bolero fetish.\n \n \n Always with the raping. I'm worried about you dude. It's OK to talk about it. Or do you mean rapping? Are you afraid that someone is gonna bust ya wit some ill rhymes? \n Also I am bit confused about how someone could be held at gun point by a baseball bat. I am sorry I am not down with gun lingo. emoticon_confused\n\n \n \n You think its funny to personally attack me? This happened to my cousin, and something similar happened to my uncle. The reason is, its not uncommon. And its not my problem that you dont really know slang, i dont really care. You should really shut up and go back to grade school, because you're really p1ssing me off with your immature comments.\n \n I have no problem with a bit of humor once in awhile, but when you make fun of whats happened to my family, or attempt to personally attack me for any reason that you like, it crosses the line, and its really immature.", 
   {}, 
   234058, 
   null, 
   1160205420.0
  ], 
  [
   234069, 
   null, 
   "daewoo", 
   "Finally, Count Otto asks whether the RKBA should be construed to be absolute. I say no. I tend to get in trouble sometimes from the more extreme gun rights supporters for saying this, but I say the right can be subject to limitation. The issue for me is not whether any gun control can exist, but where to strike the proper balance between public safety and respecting a fundamental individual right.\n\n \n This is, IMO, the only real question. The Second Ammendment has been treated as gutless for so long, though, that we have a long ways to go repealing current gun control laws before we even need to start considering whether we have reached any kind of balance. \n \n When you talk gun control, there tends to be a lot of emotional statements made that are frankly nonsensical. I can not even count the number of times that I have heard gun control advocates shoot back \"So it should be ok to have an abrams tank or a fighter plane in your driveway\" or \"so it is OK if somebody wants to carry around a flamethrower\" or \"so everybody should have a tactical nuclear weapon\". \n \n In truth, common sense takes care of most of these things right up front. For example, there are currently no federal laws that would prohibit you from owning an abrams tank, or a fighter plane. The gun on the tank would have to be registered as a destructive device, but if you are paying $20 million for the tank, the $200 for a tax stamp should not be an issue. Missiles on the plane...same story. You can own them (if you can find somebody willing to sell them to you), and at $10-$60K a pop, the $200 tax stamp is nothing to worry about. Flamethrowers are completely unregulated.\n \n We do not see a lot of privatly owned battle tanks, fighter jets, or flamethrowers. Why? Because they are expensive and it does not make sense for an individual to own one.\n \n IMO, even the question of nukes is not problematic as long as you apply some common sense. The militia was a defensive organization, and a reasonable assesment of the second ammednemnt would lead pretty much any sane person to recognize that the arms protected there are defensive arms. Nuclear weapons are not defensive arms. End of argument.\n \n This is, IMO, academic in any event, because the RKBA has been viewed as an ugly stepchild for too long, and there is, IMO, virtually no hope of taking back ground on that one short of an armed conflict. It has been years since there has been any real balancing of public safety against the RKBA. Crime utilizing illgeally owned machine guns is virtually non existant and has been for years. That did not stop them from outlawing the transfer of new machine guns to civilians. Absolutly no public safety component there. Just a plain, relatively meaningless restriction of our rights. Brady bill...same way. Worthless when it comes to fighting crime, as our law enforcement experts said it would be. No crime control or public safety angle there at all, simply a restriction on a right. \n \n IANAL, so maybe I am wrong here, Bryan, but it seems to me that at one point, the courts actually required a clear and compelling threat to public safety in order to curtail a right in the name of public safety. Whatever happened to that? It seems like anymore, a clear and compelling threat, or even an argument for a clear and compelling threat, is not required, all they need is some nutballs completely unbacked and nonsensical hairbrained theory.", 
   {}, 
   233818, 
   null, 
   1160208900.0
  ], 
  [
   234084, 
   null, 
   "Baltidog", 
   "You think its funny to personally attack me? This happened to my cousin, and something similar happened to my uncle. The reason is, its not uncommon. And its not my problem that you dont really know slang, i dont really care. You should really shut up and go back to grade school, because you're really p1ssing me off with your immature comments.\n \n I have no problem with a bit of humor once in awhile, but when you make fun of whats happened to my family, or attempt to personally attack me for any reason that you like, it crosses the line, and its really immature.\nHey, I am not the one who was posting the rape jokes. And I was certainly not the one posting your personal tradjeties in the \"Funniest Comebacks\" thread. You certainly did not say that it was a painful family event, you said it was just \"another scenario\". \n How am I personaly attacking you? You are certainly attacking me with zingers like \"immature\" and \"go back to grade school\". \n \n \n The funniest thing about these gun-lovers is they go on and on about how sacred the 2nd Amendment is, but they sure don't believe in everyones 1st Amendment rights. It's the 1st Amendment for a reason.", 
   {}, 
   234065, 
   null, 
   1160242740.0
  ], 
  [
   234088, 
   null, 
   "Shooterandproud", 
   "Hey, I am not the one who was posting the rape jokes. And I was certainly not the one posting your personal tradjeties in the \"Funniest Comebacks\" thread. You certainly did not say that it was a painful family event, you said it was just \"another scenario\". \n How am I personaly attacking you? You are certainly attacking me with zingers like \"immature\" and \"go back to grade school\". \n \n \n The funniest thing about these gun-lovers is they go on and on about how sacred the 2nd Amendment is, but they sure don't believe in everyones 1st Amendment rights. It's the 1st Amendment for a reason.\n\n \n I completely respect your opinion. What i dont respect is you attempting to paint me as someone who is obsessed with rape and such, then you personally attack me. The only reason i posted that is because of disrespect and personal attacks coming from you, so maybe you wouldnt have something to laugh about.\n \n And im sorry for posting those attacks, but its a bit annoying when someone really IS acting immature, and making everything a joke. If you would like to state your opinion or debate me, feel free. Just dont turn everything into a \"ZOMg me made a rape joke!!! Gasp!!\". Im all for humor once in awhile, but i cant stand people who criticize me for my jokes, and then tell me not to make them in the first place. It was supposed to be a bit of humor, but obviously you are not mature enough to handle it.\n \n Also let me add, i believe in the first amendmant as much as the second, i just dont appreciate people who try to get into a p1ssing war with another person.", 
   {}, 
   234084, 
   null, 
   1160246040.0
  ], 
  [
   234117, 
   null, 
   "Bryan", 
   "Some good points, Daewoo. Let me give my opinion on the two topics addressed-the non-absolute nature of the RKBA, and the test used for challenging an infringement on the right. \n \n First, I do not accept that the words \"shall not be infringed\" mean that the RKBA is absolute. The absolute argument is really a gun control argument. The horror scenario of their stereotypical NRA Bubba owning a tank or a nuke is used as justification for a demand that the right be distorted into a collective right and not viewed as individual. In my opinion the argument is as disingenuous as it is unrealistic, and it hides the reality of 200+ years of constitutional interpretation. \n \n No right is absolute. Consider, for example, the equally unqualified language of the 1st. amendment: \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\" These fundamental rights are also stated in absolute terms. Yet Congress can pass laws regulating libel, slander, false advertising, incitement to riots, etc. And I doubt that the unqualified \"free exercise\" of religion clause would permit me to commit human sacrifice at dawn to appease Zeus and avoid a charge of murder. For an example of how SCOTUS has treated the absolutist argument as applied to the 1st. amendment, see the case is Konigsberg v. States Bar, 366 U.S. 36, 56 (1961), which discussed at length the \"unqualified\" expression of the right to freedom of speech. Interestingly enough, it also compares that language to the \"absolute\" language of the 2nd. Amendment and it also cites Miller. [In particular, look at footnote 10]:\n \n \"At the outset we reject the view that freedom of speech and association ( N. A. A. C. P. v. Alabama, 357 U.S. 449, 460 ), as protected by the First and Fourteenth Amendments, are \"absolutes,\" not only in the undoubted sense that where the constitutional protection exists it must prevail, but also in the sense that the scope of that protection must be gathered solely from a literal reading of the First Amendment. [FOOTNOTE 10] Throughout its history this Court has consistently recognized at least two ways in which constitutionally protected freedom of speech is narrower than an unlimited license to talk. On the one hand, certain forms of speech, or speech in certain contexts, has been considered outside the scope of constitutional protection. [FOOTNOTE 11] See, e. g., Schenck v. United States, 249 U.S. 47; Chaplinsky v. New Hampshire, 315 U.S. 568; Dennis v. United States, 341 U.S. 494; Beauharnais v. Illinois, 343 U.S. 250; Yates v. United States, 354 U.S. 298; Roth v. United States, 354 U.S. 476.\"\n \n Here are the footnotes:\n \n [FOOTNOTE 10] \"That view, which of course cannot be reconciled with the law relating to libel, slander, misrepresentation, obscenity, perjury, false advertising, solicitation of crime, complicity by encouragement, conspiracy, and the like, is said to be compelled by the fact that the commands of the First Amendment are stated in unqualified terms: \"Congress shall make no law . . . abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble . . . .\" But as Mr. Justice Holmes once said: \"[T]he provisions of the Constitution are not mathematical formulas having their essence in their form; they are organic living institutions transplanted from English soil. Their significance is vital not formal; it is to be gathered not simply by taking the words and a dictionary, but by considering their origin and the line of their growth.\" Gompers v. United States, 233 U.S. 604, 610. In this connection also compare the equally unqualified command of the Second Amendment: \"the right of the people to keep and bear arms shall not be infringed.\" And see United States v. Miller, 307 U.S. 174.\"\n \n [FOOTNOTE 11] \"That the First Amendment immunity for speech, press and assembly has to be reconciled with valid but conflicting governmental interests was clear to Holmes, J. (\"I do not doubt for a moment that by the same reasoning that would justify punishing persuasion to murder, the United States constitutionally may punish speech that produces or is intended to produce a clear and imminent danger that it will bring about forthwith certain substantive evils that the United States constitutionally may seek to prevent.\" Abrams v. United States, 250 U.S. 616, 627); to Brandeis, J. (\"But, although the rights of free speech and assembly are fundamental, they are not in their nature absolute.\" Whitney v. California, 274 U.S. 357, 373); and to Hughes, C. J. (\"[T]he protection [of free speech] even as to previous restraint is not absolutely unlimited.\" Near v. Minnesota, 283 U.S. 697, 716.)\"\n \n In short, I do not believe in, and I do not ask for, treatment of the 2nd. amendment RKBA as an absolute right. I merely ask that the right receive the same equal protection SCOTUS gives our other fundamental liberties. It is time to let the ugly red headed step child of the BoR out of the basement and honestly acknowledge it for what it is-a fundamental individual right.\n \n Regarding the test to be used to challenge a law infringing the RKBA, it is important to understand that there is more than one test used for determining whether a particular right has been infringed, and which test is used varies depending on the nature of the right in question. Our legal system follows an Orwellian concept that all rights are equal, but some are more equal than others. For example, some ordinary rights are judged using a \"rational relationship test,\" which in a nutshell holds that the right may be infringed so long as the infringement has a rational relation to a legitimate government interest. It is a tenuous protection at best. And this is where you will see the battle in the future in SCOTUS. The first issue is whether the right is individual or not, which historically, legally, and logically is an easy question. But to fully preserve this right I believe SCOUTS must also recognize the right to be \"fundamental.\" \n \n These special rights are called \"fundamental rights.\" The nature of a \"fundamental\" right was explained in the landmark 1964 voting rights case of Reynolds v. Sims [a \"one man, one vote\" principle case]. In that case, the right to vote was deemed fundamental because the free exercise of it was deemed to be \"preservative\" of other rights:\n \n \"Undoubtedly, the right of suffrage is a fundamental matter in a free and democratic society. Especially since the right to exercise the franchise in a free and unimpaired manner is preservative of other basic civil and political rights, any alleged infringement of the right of citizens to vote must be carefully and meticulously scrutinized. Almost a century ago, in Yick Wo v. Hopkins, 118 U.S. 356, the Court referred to \"the political franchise of voting\" as \"a fundamental political right, because preservative of all rights.\" 118 U.S., at 370.\" Reynolds v. Sims, 377 U.S. 533, 561-562 (1964)\n \n Additionally, in the more recent case of Lawrence v. Texas, the Court gave a description of the historical nature of \"fundamental\" rights: \n \n \"rights which are \"'deeply rooted in this Nation's history and tradition,'\" ibid. See Reno v. Flores, 507 U.S. 292, 303 (1993) (fundamental liberty interests must be \"so rooted in the traditions and conscience of our people as to be ranked as fundamental\" (internal quotation marks and citations omitted)); United States v. Salerno, 481 U.S. 739, 751 (1987) (same). See also Michael H. v. Gerald D., 491 U.S. 110, 122 (1989) (\"[W]e have insisted not merely that the interest denominated as a 'liberty' be 'fundamental' . . . but also that it be an interest traditionally protected by our society\"); Moore v. East Cleveland, 431 U.S. 494, 503 (1977) (plurality opinion); Meyer v. Nebraska, 262 U.S. 390, 399 (1923) (Fourteenth Amendment protects \"those privileges long recognized at common law as essential to the orderly pursuit of happiness by free men.\" (emphasis added)). Lawrence v. Texas, 539 U.S. 558, 593 (2003) [this case invalidated a Texas law that made it a crime for consenting adults to engage in homosexual conduct in the privacy of their home, where they were embarrassingly caught \"in the act\" by officers entering their home on a complaint of, ironically for us, a weapons disturbance]\n \n SCOTUS has repeatedly said that the expressed rights contained in the BoR are fundamental rights. SCOTUS has also deemed other unenumerated rights fundamental, like abortion and, as seen above, the right to vote. I believe that the RKBA is also a fundamental right, although SCOTUS has not had the chance to address this issue, I believe that when the case finally comes to them the justices will recognize the fundamental nature of the RKBA because it is, like the other rights of that status: historically rooted in our society, it is expressly stated in the Constitution, and by its nature it is \"preservative of other rights.\" \n \n Such rights that are deemed \"fundamental\" receive extra protection from infringement. For each claim of infringement on a fundamental right, the test which the government must pass to sustain the law is one of \"strict scrutiny.\" Under this test, the state must first show that a legitimate and \"compelling\" state interest exists for the particular infringement of the right. It must then show that the infringement is \"necessary\" to accomplish that compelling interest. Finally, it must show that the infringement was \"narrowly\" and \"precisely\" drawn [that is, no more restrictive than necessary to achieve the \"compelling\" interest.] In my opinion this should be the test applied to any law which infringes on the RKBA. \n \n ---\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, New haven, 1921.\n \n \"The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy.\" Justice Scalia, DICKERSON v. UNITED STATES, 530 U.S. ___ 995525, Slip opinion (Scalia's dissent) p.12 (June 26, 2000).\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Supreme Court Justice Louis Brandeis, Olmstead v. United States, 277 U.S. 438, 485 (1928).", 
   {
    "unicode_changes_made": true
   }, 
   234088, 
   null, 
   1160281860.0
  ], 
  [
   234125, 
   null, 
   "daewoo", 
   "In short, I do not believe in, and I do not ask for, treatment of the 2nd. amendment RKBA as an absolute right. I merely ask that the right receive the same equal protection SCOTUS gives our other fundamental liberties. It is time to let the ugly red headed step child of the BoR out of the basement and honestly acknowledge it for what it is-a fundamental individual right.\n \n Regarding the test to be used to challenge a law infringing the RKBA, it is important to understand that there is more than one test used for determining whether a particular right has been infringed, and which test is used varies depending on the nature of the right in question. Our legal system follows an Orwellian concept that all rights are equal, but some are more equal than others. For example, some ordinary rights are judged using a \"rational relationship test,\" which in a nutshell holds that the right may be infringed so long as the infringement has a rational relation to a legitimate government interest. It is a tenuous protection at best. And this is where you will see the battle in the future in SCOTUS. The first issue is whether the right is individual or not, which historically, legally, and logically is an easy question. But to fully preserve this right I believe SCOUTS must also recognize the right to be \"fundamental.\" \n \n These special rights are called \"fundamental rights.\" The nature of a \"fundamental\" right was explained in the landmark 1964 voting rights case of Reynolds v. Sims [a \"one man, one vote\" principle case]. In that case, the right to vote was deemed fundamental because the free exercise of it was deemed to be \"preservative\" of other rights:\n \n Additionally, in the more recent case of Lawrence v. Texas, the Court gave a description of the historical nature of \"fundamental\" rights: \n \n \n SCOTUS has repeatedly said that the expressed rights contained in the BoR are fundamental rights. SCOTUS has also deemed other unenumerated rights fundamental, like abortion and, as seen above, the right to vote. I believe that the RKBA is also a fundamental right, although SCOTUS has not had the chance to address this issue, I believe that when the case finally comes to them the justices will recognize the fundamental nature of the RKBA because it is, like the other rights of that status: historically rooted in our society, it is expressly stated in the Constitution, and by its nature it is \"preservative of other rights.\" \n \n Such rights that are deemed \"fundamental\" receive extra protection from infringement. For each claim of infringement on a fundamental right, the test which the government must pass to sustain the law is one of \"strict scrutiny.\" Under this test, the state must first show that a legitimate and \"compelling\" state interest exists for the particular infringement of the right. It must then show that the infringement is \"necessary\" to accomplish that compelling interest. Finally, it must show that the infringement was \"narrowly\" and \"precisely\" drawn [that is, no more restrictive than necessary to achieve the \"compelling\" interest.] In my opinion this should be the test applied to any law which infringes on the RKBA. \n\n \n First, I edited your post because I basically agree with it and could think of nothing I could possibly say that would. I really enjoy reading your posts as they tend to be logic driven and not the page of emotional drivel that often comes up when discussing the RKBA. \n \n It seems that the above creates something of a catch 22 when used in relation to the RKBA. It seems like many people, including our government, have made a defacto argument that the legitimate and compelling state interest in the control and (in some cases banning) of firearms is essentially the governments need or desire to consolidate power, whether it is the power to control the population with minimal chance of resistance or the power inherent in being the designated provider of personal defense, which is a little ironic since any suggestion that the government should be held liable for failing to provide those defenseive services are met with extreme resistance by the government. \n \n Personally, I have very little confidence in the courts when it comes to the RKBA. When it somes to the supreme court, thomas seems to me to be the only real friend to RKBA advocates on the panel. Scalito has in the past given lkip service, but despite his professed aversion to stare decisis, he also says he believes that sweeping changes should be avoided. There are an awful lot of lower court cases that find the second ammendment is a collective right, and a recognition of it as an individual, much less a fundamental, right would certainly constitute a sweeping change. Alito seems to be in love with authority. \n \n It seems to me that is why a lot of second ammendment cases never go far. It is not that there is any real controversey as to how the RKBA should be construed. It is fairly clear that it was essentially meant to be the same as otehr rights laid out int he bill of rights. The pro gun seems afraid that if they really push and get it in front of the supreme court that the result will be the same as it has been in so many lower courts....BS, nonsensical justifications for the removal of a fundamental right. \n \n Your quotes below kind of touch on this\n \n \n\"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, New haven, 1921.\n \n \"The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy.\" Justice Scalia, DICKERSON v. UNITED STATES, 530 U.S. ___ 995525, Slip opinion (Scalia's dissent) p.12 (June 26, 2000).\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Supreme Court Justice Louis Brandeis, Olmstead v. United States, 277 U.S. 438, 485 (1928).\n\n \n It seems to me that our legal system has failed the above test pretty dramatically. We have too many illogical, nonsensical rulings that were made not because they were appropriate, but because judges did not have the strength of character to allow obviously guilty defendants, ro defendants that they found personally distasteful, to go free. So, they willfully misinterpret the bill of rights in order to keep a guilty man, or a distasteful one, locked up, and then they have set a precedent that essentially forces all future defendants to live with the case law that they have set for a scumbag.", 
   {
    "unicode_changes_made": true
   }, 
   234117, 
   null, 
   1160286840.0
  ], 
  [
   234137, 
   null, 
   "Shooterandproud", 
   "Some good points, Daewoo. Let me give my opinion on the two topics addressed-the non-absolute nature of the RKBA, and the test used for challenging an infringement on the right. \n \n First, I do not accept that the words \"shall not be infringed\" mean that the RKBA is absolute. The absolute argument is really a gun control argument. The horror scenario of their stereotypical NRA Bubba owning a tank or a nuke is used as justification for a demand that the right be distorted into a collective right and not viewed as individual. In my opinion the argument is as disingenuous as it is unrealistic, and it hides the reality of 200+ years of constitutional interpretation. \n \n No right is absolute. Consider, for example, the equally unqualified language of the 1st. amendment: \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\" These fundamental rights are also stated in absolute terms. Yet Congress can pass laws regulating libel, slander, false advertising, incitement to riots, etc. And I doubt that the unqualified \"free exercise\" of religion clause would permit me to commit human sacrifice at dawn to appease Zeus and avoid a charge of murder. For an example of how SCOTUS has treated the absolutist argument as applied to the 1st. amendment, see the case is Konigsberg v. States Bar, 366 U.S. 36, 56 (1961), which discussed at length the \"unqualified\" expression of the right to freedom of speech. Interestingly enough, it also compares that language to the \"absolute\" language of the 2nd. Amendment and it also cites Miller. [In particular, look at footnote 10]:\n \n \"At the outset we reject the view that freedom of speech and association ( N. A. A. C. P. v. Alabama, 357 U.S. 449, 460 ), as protected by the First and Fourteenth Amendments, are \"absolutes,\" not only in the undoubted sense that where the constitutional protection exists it must prevail, but also in the sense that the scope of that protection must be gathered solely from a literal reading of the First Amendment. [FOOTNOTE 10] Throughout its history this Court has consistently recognized at least two ways in which constitutionally protected freedom of speech is narrower than an unlimited license to talk. On the one hand, certain forms of speech, or speech in certain contexts, has been considered outside the scope of constitutional protection. [FOOTNOTE 11] See, e. g., Schenck v. United States, 249 U.S. 47; Chaplinsky v. New Hampshire, 315 U.S. 568; Dennis v. United States, 341 U.S. 494; Beauharnais v. Illinois, 343 U.S. 250; Yates v. United States, 354 U.S. 298; Roth v. United States, 354 U.S. 476.\"\n \n Here are the footnotes:\n \n [FOOTNOTE 10] \"That view, which of course cannot be reconciled with the law relating to libel, slander, misrepresentation, obscenity, perjury, false advertising, solicitation of crime, complicity by encouragement, conspiracy, and the like, is said to be compelled by the fact that the commands of the First Amendment are stated in unqualified terms: \"Congress shall make no law . . . abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble . . . .\" But as Mr. Justice Holmes once said: \"[T]he provisions of the Constitution are not mathematical formulas having their essence in their form; they are organic living institutions transplanted from English soil. Their significance is vital not formal; it is to be gathered not simply by taking the words and a dictionary, but by considering their origin and the line of their growth.\" Gompers v. United States, 233 U.S. 604, 610. In this connection also compare the equally unqualified command of the Second Amendment: \"the right of the people to keep and bear arms shall not be infringed.\" And see United States v. Miller, 307 U.S. 174.\"\n \n [FOOTNOTE 11] \"That the First Amendment immunity for speech, press and assembly has to be reconciled with valid but conflicting governmental interests was clear to Holmes, J. (\"I do not doubt for a moment that by the same reasoning that would justify punishing persuasion to murder, the United States constitutionally may punish speech that produces or is intended to produce a clear and imminent danger that it will bring about forthwith certain substantive evils that the United States constitutionally may seek to prevent.\" Abrams v. United States, 250 U.S. 616, 627); to Brandeis, J. (\"But, although the rights of free speech and assembly are fundamental, they are not in their nature absolute.\" Whitney v. California, 274 U.S. 357, 373); and to Hughes, C. J. (\"[T]he protection [of free speech] even as to previous restraint is not absolutely unlimited.\" Near v. Minnesota, 283 U.S. 697, 716.)\"\n \n In short, I do not believe in, and I do not ask for, treatment of the 2nd. amendment RKBA as an absolute right. I merely ask that the right receive the same equal protection SCOTUS gives our other fundamental liberties. It is time to let the ugly red headed step child of the BoR out of the basement and honestly acknowledge it for what it is-a fundamental individual right.\n \n Regarding the test to be used to challenge a law infringing the RKBA, it is important to understand that there is more than one test used for determining whether a particular right has been infringed, and which test is used varies depending on the nature of the right in question. Our legal system follows an Orwellian concept that all rights are equal, but some are more equal than others. For example, some ordinary rights are judged using a \"rational relationship test,\" which in a nutshell holds that the right may be infringed so long as the infringement has a rational relation to a legitimate government interest. It is a tenuous protection at best. And this is where you will see the battle in the future in SCOTUS. The first issue is whether the right is individual or not, which historically, legally, and logically is an easy question. But to fully preserve this right I believe SCOUTS must also recognize the right to be \"fundamental.\" \n \n These special rights are called \"fundamental rights.\" The nature of a \"fundamental\" right was explained in the landmark 1964 voting rights case of Reynolds v. Sims [a \"one man, one vote\" principle case]. In that case, the right to vote was deemed fundamental because the free exercise of it was deemed to be \"preservative\" of other rights:\n \n \"Undoubtedly, the right of suffrage is a fundamental matter in a free and democratic society. Especially since the right to exercise the franchise in a free and unimpaired manner is preservative of other basic civil and political rights, any alleged infringement of the right of citizens to vote must be carefully and meticulously scrutinized. Almost a century ago, in Yick Wo v. Hopkins, 118 U.S. 356, the Court referred to \"the political franchise of voting\" as \"a fundamental political right, because preservative of all rights.\" 118 U.S., at 370.\" Reynolds v. Sims, 377 U.S. 533, 561-562 (1964)\n \n Additionally, in the more recent case of Lawrence v. Texas, the Court gave a description of the historical nature of \"fundamental\" rights: \n \n \"rights which are \"'deeply rooted in this Nation's history and tradition,'\" ibid. See Reno v. Flores, 507 U.S. 292, 303 (1993) (fundamental liberty interests must be \"so rooted in the traditions and conscience of our people as to be ranked as fundamental\" (internal quotation marks and citations omitted)); United States v. Salerno, 481 U.S. 739, 751 (1987) (same). See also Michael H. v. Gerald D., 491 U.S. 110, 122 (1989) (\"[W]e have insisted not merely that the interest denominated as a 'liberty' be 'fundamental' . . . but also that it be an interest traditionally protected by our society\"); Moore v. East Cleveland, 431 U.S. 494, 503 (1977) (plurality opinion); Meyer v. Nebraska, 262 U.S. 390, 399 (1923) (Fourteenth Amendment protects \"those privileges long recognized at common law as essential to the orderly pursuit of happiness by free men.\" (emphasis added)). Lawrence v. Texas, 539 U.S. 558, 593 (2003) [this case invalidated a Texas law that made it a crime for consenting adults to engage in homosexual conduct in the privacy of their home, where they were embarrassingly caught \"in the act\" by officers entering their home on a complaint of, ironically for us, a weapons disturbance]\n \n SCOTUS has repeatedly said that the expressed rights contained in the BoR are fundamental rights. SCOTUS has also deemed other unenumerated rights fundamental, like abortion and, as seen above, the right to vote. I believe that the RKBA is also a fundamental right, although SCOTUS has not had the chance to address this issue, I believe that when the case finally comes to them the justices will recognize the fundamental nature of the RKBA because it is, like the other rights of that status: historically rooted in our society, it is expressly stated in the Constitution, and by its nature it is \"preservative of other rights.\" \n \n Such rights that are deemed \"fundamental\" receive extra protection from infringement. For each claim of infringement on a fundamental right, the test which the government must pass to sustain the law is one of \"strict scrutiny.\" Under this test, the state must first show that a legitimate and \"compelling\" state interest exists for the particular infringement of the right. It must then show that the infringement is \"necessary\" to accomplish that compelling interest. Finally, it must show that the infringement was \"narrowly\" and \"precisely\" drawn [that is, no more restrictive than necessary to achieve the \"compelling\" interest.] In my opinion this should be the test applied to any law which infringes on the RKBA. \n \n ---\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, New haven, 1921.\n \n \"The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy.\" Justice Scalia, DICKERSON v. UNITED STATES, 530 U.S. ___ 995525, Slip opinion (Scalia's dissent) p.12 (June 26, 2000).\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Supreme Court Justice Louis Brandeis, Olmstead v. United States, 277 U.S. 438, 485 (1928).\n\n I agree for the most part. I still think that that last guy's post (forgot his name, the one who mencioned that we have a violence problem in the US) hit the nail on the head, but props to you for brining this thread back on topic and writing something actually intelligent.", 
   {
    "unicode_changes_made": true
   }, 
   234117, 
   null, 
   1160291820.0
  ], 
  [
   234139, 
   null, 
   "Crunker", 
   "Blaming guns for violence is like blaming spoons for obesity.", 
   {}, 
   233913, 
   null, 
   1160295960.0
  ], 
  [
   234262, 
   null, 
   "Count Otto", 
   " When you talk gun control, there tends to be a lot of emotional statements made that are frankly nonsensical. I can not even count the number of times that I have heard gun control advocates shoot back \"So it should be ok to have an abrams tank or a fighter plane in your driveway\" or \"so it is OK if somebody wants to carry around a flamethrower\" or \"so everybody should have a tactical nuclear weapon\".\n\n \n But it's neither nonsensical or emotional. If, as is claimed, the right to bear arms is a preventative measure against the government (and by extension the armed forces), then the militias need to be suitably armed to combat a high-tech foe. When the 2nd amendment was written that would only have required a horse and a musket. These days you'd need a bit more than a hunting rifle I should imagine.\n \n I'm not just talking about the right itself, but how people are preparing themselves for the eventuality. The right to own Stinger missiles may exist but does anyone do it? Would it be considered the act of a normal citizen?", 
   {}, 
   234069, 
   null, 
   1160409660.0
  ], 
  [
   234295, 
   null, 
   "emclean", 
   "If, as is claimed, the right to bear arms is a preventative measure against the government (and by extension the armed forces), then the militias need to be suitably armed to combat a high-tech foe. When the 2nd amendment was written that would only have required a horse and a musket. These days you'd need a bit more than a hunting rifle I should imagine.\n \n\n why? the militias would fight using the same tactics they have from the beginning of our country. you attack them where they are weak, not where they are strong. these tatics have been used for as long as there have been unequal forces.\n \n \nI'm not just talking about the right itself, \n\n yes you are, you are talking about wanting a justification of the right.\n \n \nThe right to own Stinger missiles may exist but does anyone do it? Would it be considered the act of a normal citizen?\n\n IMO it would be something the organized militia would have, considering the added issees of storing high explosives, and the solid fuel.", 
   {}, 
   234262, 
   null, 
   1160431380.0
  ], 
  [
   234296, 
   null, 
   "daewoo", 
   "But it's neither nonsensical or emotional. If, as is claimed, the right to bear arms is a preventative measure against the government (and by extension the armed forces), then the militias need to be suitably armed to combat a high-tech foe. When the 2nd amendment was written that would only have required a horse and a musket. These days you'd need a bit more than a hunting rifle I should imagine.\n \n I'm not just talking about the right itself, but how people are preparing themselves for the eventuality. The right to own Stinger missiles may exist but does anyone do it? Would it be considered the act of a normal citizen?\n\n \n No, and that is my point. There is no law prohibiting you from owning a stinger missile, provided that you pay the $200 tax to register it as a destructive device. It is just not something that people do.", 
   {}, 
   234262, 
   null, 
   1160431800.0
  ], 
  [
   234315, 
   null, 
   "Baltidog", 
   "I completely respect your opinion. What i dont respect is you attempting to paint me as someone who is obsessed with rape and such, then you personally attack me. The only reason i posted that is because of disrespect and personal attacks coming from you, so maybe you wouldnt have something to laugh about.\n \n And im sorry for posting those attacks, but its a bit annoying when someone really IS acting immature, and making everything a joke. If you would like to state your opinion or debate me, feel free. Just dont turn everything into a \"ZOMg me made a rape joke!!! Gasp!!\". Im all for humor once in awhile, but i cant stand people who criticize me for my jokes, and then tell me not to make them in the first place. It was supposed to be a bit of humor, but obviously you are not mature enough to handle it.\n \n Also let me add, i believe in the first amendmant as much as the second, i just dont appreciate people who try to get into a p1ssing war with another person.\n\n I thought funny comebacks were the correct response to funny comebacks in a funny comeback thread on a debate forum. \n I did not tell you not to post jokes. Yes I did critic the jokes you posted, but that is not the same as tell you not to post them. My opinion of the jokes is only my opinion of the jokes and not of you as an person. \n Maybe I did paint you as someone who is obsessed with rape. But you mention rape quite a few times without my prompting. You had four rape jokes in your post that started the thread and then later a scenario with the rape of a child. Now don't get me wrong, I like a good rape joke as much as the next guy, but it better be damn funny to out weigh the negative emotions surrounding the word \"rape\". Using \"rape\" in your joke just sets the bar that much higher. \n I have one last rape related question: How is a gun any better in preventing rape then a knife or a sword?", 
   {}, 
   234088, 
   null, 
   1160445000.0
  ], 
  [
   234336, 
   null, 
   "Shooterandproud", 
   "I thought funny comebacks were the correct response to funny comebacks in a funny comeback thread on a debate forum. \n I did not tell you not to post jokes. Yes I did critic the jokes you posted, but that is not the same as tell you not to post them. My opinion of the jokes is only my opinion of the jokes and not of you as an person. \n Maybe I did paint you as someone who is obsessed with rape. But you mention rape quite a few times without my prompting. You had four rape jokes in your post that started the thread and then later a scenario with the rape of a child. Now don't get me wrong, I like a good rape joke as much as the next guy, but it better be damn funny to out weigh the negative emotions surrounding the word \"rape\". Using \"rape\" in your joke just sets the bar that much higher. \n I have one last rape related question: How is a gun any better in preventing rape then a knife or a sword?\n\n \n Ive counted very little rape jokes, and only posted about the subject twice.\n \n The thing that im getting at is, its a big problem, something that less gun control can solve.\n \n And to answer your last question. Lets think this way:\n \n Rapist is twice your size, he has a knife. You have a knife too...\n \n YOU LOSE.\n \n Swords are illegal to carry at all.\n \n Now, lets make it this way:\n \n Rapist has knife, you have gun. You unload your magazine into his head.\n \n YOU WIN!!!\n \n See what im getting at? What i am saying is, that more CCW can reduce rape greatly, and its not really a matter of critisizing me for the number of jokes and matters i have posted.\n \n Because im debating gun control, does that make me obsessed with guns? Maybe, but there is still a chance i am not. If im debating rape statistics with gun statistics, then i most likely am not obsessed, just debating. Its just another thing to debate, not something that you try to paint someone as \"obsessed\" with.\n \n Another analogy: Just because someone is in the poliece debartment, doesnt make them obsessed with crime. \n \n And also, just for the record, those arent my jokes.", 
   {}, 
   234315, 
   null, 
   1160448900.0
  ], 
  [
   234356, 
   null, 
   "Baltidog", 
   "\n And to answer your last question. Lets think this way:\n \n Rapist is twice your size, he has a knife. You have a knife too...\n \n YOU LOSE.\n\n Since when was body size of importance in a knife fight. Don't forget that some knives can be thrown. \n \n \n\n Swords are illegal to carry at all.\n \n\n They are? And we are talking about gun-control? Have you guys already surrendered on the swords? Clearly the 2nd Amendment includes swords.\n Also statistics show that no sword-wearing people where raped in the last decade in the USofA. \n Swords are better then guns because of key design flaw found in all firearms. That is all firearms run out of ammo. If the number of rapist exceeds the number of loaded rounds then victim would be in trouble. With a gun you have to save one round for ones self, but with a sword there is always a fall back option.\n \n \n \n\n Now, lets make it this way:\n \n Rapist has knife, you have gun. You unload your magazine into his head.\n \n YOU WIN!!!\n\n Maybe. Would not a rapist sneak up on you from behind? Wouldn't a rapist with a plan have a knive to your throat before you could say, \"I've got a gun, please don't rape me\". \n \n \n\n See what im getting at? What i am saying is, that more CCW can reduce rape greatly, and its not really a matter of critisizing me for the number of jokes and matters i have posted.\n\n Please tell me what CCW is. \n \n \n \n\n Because im debating gun control, does that make me obsessed with guns? Maybe, but there is still a chance i am not. If im debating rape statistics with gun statistics, then i most likely am not obsessed, just debating. Its just another thing to debate, not something that you try to paint someone as \"obsessed\" with.\n \n Another analogy: Just because someone is in the poliece debartment, doesnt make them obsessed with crime. \n\n We'll if the cops name was Officer LawEnforcer N. Proud it might be fair to assume that he was obessed with law enforcement. But I guess I was out of line when I wrote this:\n \nAlways with the raping. I'm worried about you dude. It's OK to talk about it.\n I am sorry I went for the laugh at your expence. \n \n \n\n And also, just for the record, those arent my jokes.\n\n That's good to know. I think I would have responded differently had I known.", 
   {}, 
   234336, 
   null, 
   1160455740.0
  ], 
  [
   234364, 
   null, 
   "zachvac", 
   "Since when was body size of importance in a knife fight. Don't forget that some knives can be thrown. \n \n\n Can you throw a knife accurately? I sure can't. Guns are pretty simple.\n \n \n\n Maybe. Would not a rapist sneak up on you from behind? Wouldn't a rapist with a plan have a knive to your throat before you could say, \"I've got a gun, please don't rape me\". \n \n\n It's possible, but if you have a gun on you it's that much easier to defend yourself if and when you do hear them coming up behind you. Also the risk is much higher for them so they may decide not to do it.\n \n \n\n Please tell me what CCW is. \n \n\n Not sure exactly what the W is for, maybe weapons? But I think CC is concealed carry.", 
   {}, 
   234356, 
   null, 
   1160457540.0
  ], 
  [
   234368, 
   null, 
   "Shooterandproud", 
   "Since when was body size of importance in a knife fight. Don't forget that some knives can be thrown. \n \n \n They are? And we are talking about gun-control? Have you guys already surrendered on the swords? Clearly the 2nd Amendment includes swords.\n Also statistics show that no sword-wearing people where raped in the last decade in the USofA. \n Swords are better then guns because of key design flaw found in all firearms. That is all firearms run out of ammo. If the number of rapist exceeds the number of loaded rounds then victim would be in trouble. With a gun you have to save one round for ones self, but with a sword there is always a fall back option.\n \n And about throwing knives, you cant carry those in a lot of places either, and they are horribly innacurate, dangerous, and you must be highly skilled to control them properly.\n \n \n \n Maybe. Would not a rapist sneak up on you from behind? Wouldn't a rapist with a plan have a knive to your throat before you could say, \"I've got a gun, please don't rape me\". \n \n \n Please tell me what CCW is. \n \n \n \n We'll if the cops name was Officer LawEnforcer N. Proud it might be fair to assume that he was obessed with law enforcement. But I guess I was out of line when I wrote this:\n I am sorry I went for the laugh at your expence. \n \n \n That's good to know. I think I would have responded differently had I known.\n\n \n If you dont know what CCW is, and if you dont know that swords or large knives are illegal to carry in many places, then you shouldn't be on this forum in the first place. Chances are, a gun will save you from a rapist/attacker more than a knife or sword will. I own a sword, but where i live (kalifornia), it is illegal to carry a blade exceeding 3 inches.\n \n And how can someone help what their name was? Unless he changed it to that.", 
   {}, 
   234356, 
   null, 
   1160458440.0
  ], 
  [
   234375, 
   null, 
   "Baltidog", 
   "Can you throw a knife accurately? I sure can't. Guns are pretty simple.\n \n\n As accurately as a handgun.\n \n \nIf you dont know what CCW is, and if you dont know that swords or large knives are illegal to carry in many places, then you shouldn't be on this forum in the first place. \n\n I didn't see the test on the way in. It's not like I know anyone who was ever arrested for a having a sword. I am very sorry that I don't know my states current pointy object laws, but jousting in the state sport so at least we are allowed lances. OK so I didn't know what CCW stands for. And I don't support those laws. Those laws make it so only the cerain people are allow to carry certain weapons. \n \n \n I never would have thought that America was such an unfree place that they had already crimialized the long pointy stick. Damn it, ya'll 2nd Amendment defenders have been doing a lousy job if swords are already illegal. Just keep voting Republican ya'll and soon enough we be left with is just these crappy handguns. Sure most Dems might get us there quicker but they are both heading in the same destination. To claim that we need guns for protection from rouge attackers is absurd. It is absurd because to do so, is to say that we need a reason to have a weapon. You should not give any reason. I don't need a reason to be free or to be alive or to speak. You don't need a reason to deny troops quarter at your house. Why then give reasons for weapon ownership?", 
   {}, 
   234364, 
   null, 
   1160464320.0
  ], 
  [
   234380, 
   null, 
   "Count Otto", 
   "No, and that is my point. There is no law prohibiting you from owning a stinger missile, provided that you pay the $200 tax to register it as a destructive device. It is just not something that people do.\n\n \n And that is my point. It's not about the right - it's about the fact that people aren't actually preparing for the eventuality of fighting their government at all. They're hiding behind that excuse in order to justify the ownership of guns (regardless of whether justification is needed or not for now).\n \n Let's examine the reply another poster gave me: \n \n \nwhy? the militias would fight using the same tactics they have from the beginning of our country. you attack them where they are weak, not where they are strong. these tatics have been used for as long as there have been unequal forces\n\n \n Fair enough - good tactical sense. However, examining any recent parallel example: Afghanistan, Vietnam, maybe even Iraq - the capability to take out armour is critical. It's a different game now than it was in the 18th century.", 
   {}, 
   234296, 
   null, 
   1160480760.0
  ], 
  [
   234387, 
   null, 
   "emclean", 
   "Don't forget that some knives can be thrown. \n\n but real life, unlike the movies, it is not an effective combat use. throwing knives has 2 tricks to be able to stick the blade. \n 1. do it the same every time\n 2. do it from the right distance to have the point come around into the target.\n also the weight of the knife has to be distributed right.\n try it some time.\n \n \nSwords are better then guns because of key design flaw found in all firearms\n\n once again try it some time, effectivly using a sword is harder than it looks on TV.\n \n \nMaybe. Would not a rapist sneak up on you from behind? Wouldn't a rapist with a plan have a knive to your throat before you could say, \"I've got a gun, please don't rape me\". \n\n then you just put the gun in his face and shoot. put it low through the mouth and you can sever the spinal cord before he can respond.\n so how often dose this happen? the last reported rape in my town teh rapist followed her home, and forced his way in, she would have had time to engage the atacker if she had the means and mind set.\n \n \n \n \nAnd that is my point. It's not about the right - it's about the fact that people aren't actually preparing for the eventuality of fighting their government at all. They're hiding behind that excuse in order to justify the ownership of guns (regardless of whether justification is needed or not for now).\n \n so we can only use the free press to keep am eye on the goverment (what it was included for) and the right to free exercice of religion to prevent a therocracy? is free speach just so the politishinc cant punish us for speeking badly of them, so this forum is not protected?\n \n \nAfghanistan, Vietnam, maybe even Iraq - the capability to take out armour is critical.\n\n you do not need to fight armour directly (most people consiter a MBT to be a strong weapon) you go for the supply lines. just like was done in Afghanistan, and Iraq. remember Jessica Lynch, from the 507 Maintenance Co?", 
   {}, 
   234380, 
   null, 
   1160491980.0
  ], 
  [
   234394, 
   null, 
   "Count Otto", 
   "so we can only use the free press to keep am eye on the goverment (what it was included for) and the right to free exercice of religion to prevent a therocracy? is free speach just so the politishinc cant punish us for speeking badly of them, so this forum is not protected?\n\n \n Excuse me? Did you actually intend for this to be an answer to me? Only it doesn't resemble any point I was making. \n \n I'm not advocating the banning of guns - I couldn't care less if you want to arm yourselves - I'm just outlining what I consider the fallacy of the 2nd amendment defence.\n \n \nyou do not need to fight armour directly (most people consiter a MBT to be a strong weapon) you go for the supply lines. just like was done in Afghanistan, and Iraq.\n\n \n RPG's are standard insurgency weapons in Iraq (and were in Afghanistan, Soviet era). The Mujahideen would've made little impact on the Soviet occupation with just handguns. Iraqi insurgents, of course, seem to have taken the suicide car bomb to heart. I'm presuming this wouldn't be a popular choice in a US revolution.\n \n \nremember Jessica Lynch, from the 507 Maintenance Co?\n\n \n No.", 
   {}, 
   234387, 
   null, 
   1160495400.0
  ], 
  [
   234417, 
   null, 
   "emclean", 
   "I'm not advocating the banning of guns - I couldn't care less if you want to arm yourselves - I'm just outlining what I consider the fallacy of the 2nd amendment defence.\n\n just expanding your logic to the first amendment, and your fallcy of the right to free speach.\n \n \nRPG's are standard insurgency weapons in Iraq (and were in Afghanistan, Soviet era). \n\n true, but you are forgeting that they were not just sitting around in '79, they were captired from the russans and used aganst them. \n you are baseing you argument on the assumetion of the citizens fighting a regular military. why do you assume that the citizens would not be able to quickly acquire military equipment? \n also what dose it have to do with a right? (or are you still having problems that a right dose not need any reason to be exercised) what dose the abilty to beat an army have to do with my right to defend my self?", 
   {}, 
   234394, 
   null, 
   1160512620.0
  ], 
  [
   234446, 
   null, 
   "daewoo", 
   "And that is my point. It's not about the right - it's about the fact that people aren't actually preparing for the eventuality of fighting their government at all. They're hiding behind that excuse in order to justify the ownership of guns (regardless of whether justification is needed or not for now).\n\n \n That is the advantage of fighting a civil war (from an insurgency standpoint). You don't have to be able to shoot down planes. You destroy them on the ground. We STILL don't have air combat bases in Iraq for just this reason. A plane flying overhead is hard to destroy. A plane sitting on a runway is MUCH easier to destroy. You can (literally) do it with a single rifle. If you can get close enough to touch it, you can do it with a match.\n \n Personally, I think that it is a good thing that large numbers of Americans are not actively preparing and planning to overthrow the governmnet. However, the ability IS there, and personally I think it is a good idea to keep it there. \n \n \nFair enough - good tactical sense. However, examining any recent parallel example: Afghanistan, Vietnam, maybe even Iraq - the capability to take out armour is critical. It's a different game now than it was in the 18th century.\n\n \n Thosse same wars also taught us that armor is of limited usefullness. It was nearly worthless in vietnam because terrain and vegitation limited their mobility. In afghanistan, the afghans ambushed soviet transports and convoys, and stole their heavy weapons, which they later used to blow up the soviet armor. In Iraq, we have found that armor is about as worthless as teats on a boar in an urban warfare environment with civlians running around. \n \n It is certainly important to be able to take out armor, but there are ways around that. By choosing your terrain and using it to your advantage, you can neutralize the effectiveness of armor. Additionally, the use of armor requires extensive support and supply lines (an abrams tank burns something like 9 gallons per mile). In an insurgency or civil war, it would be nearly impossible to keep armored divisions supplied.", 
   {}, 
   234380, 
   null, 
   1160525640.0
  ], 
  [
   234467, 
   null, 
   "Shooterandproud", 
   "As accurately as a handgun.\n \n \n I didn't see the test on the way in. It's not like I know anyone who was ever arrested for a having a sword. I am very sorry that I don't know my states current pointy object laws, but jousting in the state sport so at least we are allowed lances. OK so I didn't know what CCW stands for. And I don't support those laws. Those laws make it so only the cerain people are allow to carry certain weapons. \n \n \n I never would have thought that America was such an unfree place that they had already crimialized the long pointy stick. Damn it, ya'll 2nd Amendment defenders have been doing a lousy job if swords are already illegal. Just keep voting Republican ya'll and soon enough we be left with is just these crappy handguns. Sure most Dems might get us there quicker but they are both heading in the same destination. To claim that we need guns for protection from rouge attackers is absurd. It is absurd because to do so, is to say that we need a reason to have a weapon. You should not give any reason. I don't need a reason to be free or to be alive or to speak. You don't need a reason to deny troops quarter at your house. Why then give reasons for weapon ownership?\n\n \n My point exactly. At least one of them.", 
   {}, 
   234375, 
   null, 
   1160536680.0
  ], 
  [
   234488, 
   null, 
   "Count Otto", 
   "just expanding your logic to the first amendment, and your fallcy of the right to free speach.\n\n \n I'm not sure that you are, but I don't understand your point. Could you expand on it?\n \n \ntrue, but you are forgeting that they were not just sitting around in '79, they were captired from the russans and used aganst them.\n\n \n No. Most of them were supplied by Pakistan via the CIA. Assault rifles were just sitting around. It's considered a rite of passage thing when a boy gets his first AK47.\n \n \nyou are baseing you argument on the assumetion of the citizens fighting a regular military. why do you assume that the citizens would not be able to quickly acquire military equipment?\n\n \n Scavenging military equipment is unlikely to be an effective way to win a war - even one of attrition (cf the various Indian wars waged against Native Americans). Vietnam - armed by China; Afghanistan - armed by Pakistan and US...\n \n \nalso what dose it have to do with a right? (or are you still having problems that a right dose not need any reason to be exercised) what dose the abilty to beat an army have to do with my right to defend my self?\n\n \n It has everything to with a right! The 2nd amendment! And that has nothing to do with defending yourself. It has to do with defending your country against your government.", 
   {}, 
   234417, 
   null, 
   1160569440.0
  ], 
  [
   234497, 
   null, 
   "emclean", 
   "I'm not sure that you are, but I don't understand your point. Could you expand on it?\n\n that you can invent situatinons where the right sounds like it should no longer apply.\n \n \nAssault rifles were just sitting around. It's considered a rite of passage thing when a boy gets his first AK47.\n\n and there are places in the US where it is a right of passage to get your first hunting rifle. witch do you think would be better suted to fighting a unconventinal war?\n \n \n It has to do with defending your country against your government.\n \n\n where do you get the idea that the 2nd amendment is ONLY about defending aganst our goverment? \n the 2nd amendment reads \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\" federal code defines the militia as \"The militia of the United States consists of all able-bodied males at least 17 years of age and, except as provided in section 313 of title 32, under 45 years of age who are, or who have made a declaration of intention to become, citizens of the United States and of female citizens of the United States who are members of the National Guard.\n (b) The classes of the militia are - \n (1) the organized militia, which consists of the National Guard\n and the Naval Militia; and\n (2) the unorganized militia, which consists of the members of\n the militia who are not members of the National Guard or the\n Naval Militia.\"\n http://uscode.house.gov/download/pls/10C13.txt\n no where in law is the purpose of any of the bill of rights spelled out.\n \n \n section 32 of my state constution recognizes my right to self defence.", 
   {}, 
   234488, 
   null, 
   1160578020.0
  ], 
  [
   234515, 
   null, 
   "Count Otto", 
   "that you can invent situatinons where the right sounds like it should no longer apply.\n\n \n Different class of thing all together. Using my freedom of speech to deny my freedom of speech is clearly self-defeating. Even if it weren't, the 2nd amendment appears to be couched as much as a duty as a right.\n \n \n \nand there are places in the US where it is a right of passage to get your first hunting rifle. witch do you think would be better suted to fighting a unconventinal war?\n\n \n Probably the AK all things considered.\n \n \n \nwhere do you get the idea that the 2nd amendment is ONLY about defending aganst our goverment?\n \n \n I would find it difficult to take seriously any claim that the security of the US is under any danger from an invasion by foreign conventional forces. Having said that, I find it pretty far out that people believe they would ever have to combat their own government using conventional force (also cf the previous poster who talks about the Constitution of Virginia). \n \n It all just sounds like a feeble excuse. If people want guns just because they want guns, then just come out and say it.", 
   {}, 
   234497, 
   null, 
   1160586660.0
  ], 
  [
   234563, 
   null, 
   "emclean", 
   "Different class of thing all together.\n\n why should one right be treated diffrently for the others?\n \n \nUsing my freedom of speech to deny my freedom of speech is clearly self-defeating.\n\n what about using you freedom of speech to deny others rights?\n \n \nthe 2nd amendment appears to be couched as much as a duty as a right.\n\n i can only speek for myself, maybe you should ask them about it. \n \n \nProbably the AK all things considered.\n\n i would think a persision rifle with good optics (like with most hunting rifles) would be more useful than an assault rifle (and more so than am in accurit semi-auto rifle). it would alow one to fire and hit from distances beyond what the soldiers could effectivly engage them. \n \n \nI would find it difficult to take seriously any claim that the security of the US is under any danger from an invasion by foreign conventional forces.\n\n today i would agree, but we do not know what tomorow (or 10 years from now) will bring. in the last 20 years the world opition of the US has gone down, and i have seen little in that time to convence me the trend will reverce itself. \n \n \nIt all just sounds like a feeble excuse.\n\n i think i have explaned why i think that it is hard for you to understand our reactions to attacks on out rights. (post #22 http://www.4forums.com/political/showthread.php?t=7109&page=2)\n \n \nIf people want guns just because they want guns, then just come out and say it.\n\n i want a motorcycle because it is fun to ride, i want a convertabul, becouse i want one. i want a gun because itcan keep my famliy safe from some one who want to do harm, or to deprive me of the things i have worked hard for.", 
   {}, 
   234515, 
   null, 
   1160601840.0
  ], 
  [
   234607, 
   null, 
   "Jeffersonian", 
   "Here is my favorite come back to anti-gunners.\n \n Please dont shoot me.\n \n #1:\n \"Barbara Graham breaks seven different gun-control laws\"\n http://www.tincher.to/mmmcharge.htm\n \n #2:\n \"Feinstein herself is hypocritical for making such proposals despite having had a concealed carry permit\" - http://en.wikipedia.org/wiki/Diane_Feinstein\n \n #3\n \"I can't describe how I felt when I picked up that rifle, loaded it into my little car and drove home.\" - http://www.tincher.to/brady.htm\n \n #4:\n Anti-gun Senator Chuck Schumer.\n http://www.ocshooters.com/Gen/politics/img/upchuckshooting.jpg", 
   {
    "post_info": {
     "post_title": "My Fav Come Back"
    }
   }, 
   234563, 
   null, 
   1160627640.0
  ], 
  [
   234621, 
   null, 
   "Count Otto", 
   "why should one right be treated diffrently for the others?\n\n \n Because everything should be examined in the context of today. Once upon a time, the white man had the right to keep slaves. Feudal lords had the right to the virginity of every young girl in their fiefdom. The monarchs of Europe had the divine right to do anything they wanted.\n \n \nwhat about using you freedom of speech to deny others rights?\n\n \n I'm only using it to examine the basis of other 'rights'. What makes them 'rights'? \n \n \ni would think a persision rifle with good optics (like with most hunting rifles) would be more useful than an assault rifle (and more so than am in accurit semi-auto rifle). it would alow one to fire and hit from distances beyond what the soldiers could effectivly engage them.\n\n \n And yet every guerilla army of the recent past has gone for the assault rifle for its versatility. \n \n \ntoday i would agree, but we do not know what tomorow (or 10 years from now) will bring. in the last 20 years the world opition of the US has gone down, and i have seen little in that time to convence me the trend will reverce itself.\n\n \n Opinion of the US hasn't gone down in the last 20 years. For right or (more probably) wrong, it has never been that high. Read Orwell's 'Notes On Nationalism' from the '50's. \n \n \n \ni think i have explaned why i think that it is hard for you to understand our reactions to attacks on out rights.\n\n \n More than that. I find it hard to understand why you consider it a right at all. I also find it hard to reconcile - for instance - the US stance on North Korea having a nuke, if they consider the right to protection so sacred.\n \n \ni want a motorcycle because it is fun to ride, i want a convertabul, becouse i want one. i want a gun because itcan keep my famliy safe from some one who want to do harm, or to deprive me of the things i have worked hard for.\n\n \n I don't get this comparison at all. I think it's a cultural thing. It's a tired argument to say that bikes and cars aren't designed to kill (though they can) but the point is irrelevant to my argument anyway so I'll leave it be.", 
   {
    "double posts": [
     234622
    ]
   }, 
   234563, 
   null, 
   1160652180.0
  ], 
  [
   234632, 
   null, 
   "emclean", 
   "What makes them 'rights'? \n\n the US constitution, and in my case the Indiana constitution.\n \n \nI find it hard to understand why you consider it a right at all.\n\n you do not think defending your self is a right?\n \n \nI don't get this comparison at all. \n\n maybe i picked a bad exanple, i want a bike as a toy. a gun is a tool.", 
   {}, 
   234621, 
   null, 
   1160665320.0
  ], 
  [
   234638, 
   null, 
   "Count Otto", 
   "the US constitution, and in my case the Indiana constitution.\n\n \n This is getting a bit circular. I'm trying to establish why they should've been rights in the first place...which you slightly answer here:\n \n \nyou do not think defending your self is a right?\n\n \n But why should guns be the answer to this. Maybe it's easier for someone to defend themself, but then again, it's easier for someone to kill them too. What kind of trade-off is it? Why not pepper spray, or CS or tazers?\n \n \nmaybe i picked a bad exanple, i want a bike as a toy. a gun is a tool.\n\n \n This is arbitrary. To a courier a bike is a tool. To a target shooter a gun is a toy.", 
   {}, 
   234632, 
   null, 
   1160669040.0
  ], 
  [
   234645, 
   null, 
   "emclean", 
   "I'm trying to establish why they should've been rights in the first place...\n\n we have reached an inpass. i am looking at what is, you are asking why are. \n \n i do not know how to explain why they are right, to me is it a question like why do you love your wife. \n \n as for why to use a gun to defend your self, it is the best tool for the job. like all tools they can be used for evil ends, but that is the fault of the user.", 
   {}, 
   234638, 
   null, 
   1160675160.0
  ], 
  [
   234718, 
   null, 
   "Shooterandproud", 
   "This is getting a bit circular. I'm trying to establish why they should've been rights in the first place...which you slightly answer here:\n \n \n \n But why should guns be the answer to this. Maybe it's easier for someone to defend themself, but then again, it's easier for someone to kill them too. What kind of trade-off is it? Why not pepper spray, or CS or tazers?\n \n \n \n This is arbitrary. To a courier a bike is a tool. To a target shooter a gun is a toy.\n\n \n You mean a TASER, not a tazer. And have you ever tried defending yourself from an armed robber with pepper spray? How about trying to disperce a gang that is beating and mugging you, do you think a taser will do the job?", 
   {}, 
   234638, 
   null, 
   1160721960.0
  ], 
  [
   234723, 
   null, 
   "Count Otto", 
   "And have you ever tried defending yourself from an armed robber with pepper spray?\n\n \n In most cases outside my own home I'd say it's better not to try and defend yourself against an armed robber. Producing a gun is more likely to make him defend himself. Inside my own home I'd rely on whatever came to hand. I have a machete for camping, a spear that was a souvenir from Africa and a speargun for fishing. \n \n Mostly I'm just happy to live in a society where I'm not constantly fearful of that happening though. \n \n \nHow about trying to disperce a gang that is beating and mugging you, do you think a taser will do the job?\n\n \n Would a gun? Would I have time to get it out? Might the gang be armed too?", 
   {}, 
   234718, 
   null, 
   1160737080.0
  ], 
  [
   234815, 
   null, 
   "Baltidog", 
   "Wow this thread has really turned into a real debate on the effectiveness of different weapons on a range of different attackers. The only real solution is M.A.D. That is you must deploy the strongest weapons to threaten your attackers in order to prevent them from using weapons upon you. \n Anything short of maximun person protection is grossly negligent. I recommend 2 bodygaurds, one of which should be a robot or a least a cyborg. That should be good for now, but that will soon be outclassed by my cybernetic attack insects. If you thought sharks with lasers was bad XXX, wait until you see bees with lasers and poisonous metal stingers and little speakers that can play the Flight of the Bumble Bee as performed by Black Sabbath. \n Guns? What do you think this is the 19th century? This is 21st and you at least need a fixed wing drone gun platform.", 
   {}, 
   234723, 
   null, 
   1160803440.0
  ], 
  [
   234855, 
   null, 
   "Shooterandproud", 
   "Wow this thread has really turned into a real debate on the effectiveness of different weapons on a range of different attackers. The only real solution is M.A.D. That is you must deploy the strongest weapons to threaten your attackers in order to prevent them from using weapons upon you. \n Anything short of maximun person protection is grossly negligent. I recommend 2 bodygaurds, one of which should be a robot or a least a cyborg. That should be good for now, but that will soon be outclassed by my cybernetic attack insects. If you thought sharks with lasers was bad XXX, wait until you see bees with lasers and poisonous metal stingers and little speakers that can play the Flight of the Bumble Bee as performed by Black Sabbath. \n Guns? What do you think this is the 19th century? This is 21st and you at least need a fixed wing drone gun platform.\n\n \n Pfft, we have super powers now, and we can fly. Cyborgs are obsolete.", 
   {}, 
   234815, 
   null, 
   1160856960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Funniest comebacks for ANTIs.", 
  "url": "http://www.4forums.com/political/gun-control-debates/8935-funniest-comebacks-antis.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 8935, 
  "discussion_files": [
   [
    "9885.html", 
    "http://www.4forums.com/political/gun-control-debates/8935-funniest-comebacks-antis-print.html"
   ], 
   [
    "9886.html", 
    "http://www.4forums.com/political/gun-control-debates/8935-funniest-comebacks-antis-5-print.html"
   ], 
   [
    "9887.html", 
    "http://www.4forums.com/political/gun-control-debates/8935-funniest-comebacks-antis-4-print.html"
   ], 
   [
    "9888.html", 
    "http://www.4forums.com/political/gun-control-debates/8935-funniest-comebacks-antis-3-print.html"
   ], 
   [
    "9889.html", 
    "http://www.4forums.com/political/gun-control-debates/8935-funniest-comebacks-antis-2-print.html"
   ]
  ], 
  "identifier": 8935
 }
]