[
 [
  [
   233123, 
   null, 
   "Matthew S", 
   "Libby Post is one of my favorite editoralists. What she has to say is very profound. THis time she is writing about the US joining and supporting Iran.\n http://www.365gay.com/opinion/Libby/Libby.htm\n \n A quote from the artical\n \nEarlier in the year, the United States joined with some of the most repressive governments&#8212;China, Iran, Cameroon and Columbia--to deny two international LGBT groups non-governmental organization (NGO) observer status at the United Nations.\n \n Yes, you heard that right&#8212; Iran. We may demonize that country publicly but when it comes to privacy issues, George is a political whore. He&#8217;ll become political bedfellows with anyone&#8212;an individual, an organization, or in this case a country he considers our sworn enemy&#8212;to further his radical Christian right crusade against the LGBT community.\n\n \n I bet she right in that it is not only Geaorge Bush that supports Iran but many conservatives and Republicans.", 
   {
    "post_info": {
     "post_title": "Watching Out For Human Rights"
    }
   }, 
   null, 
   null, 
   1159617300.0
  ], 
  [
   233130, 
   null, 
   "thelmoose", 
   "That's pretty amazing, the article goes on to say\n \n \nBarney Frank, the openly gay Congressman from Massachusetts, took U.S. Secretary of State Condoleeza Rice to task for her role in the groups' rejection. In a letter addressed to Rice, he wrote \"I was deeply troubled to learn that the U.S. Government, presumably at your direction, sided with some of the most undemocratic, anti-human rights regimes in the world in voting against consultative status for two international organizations, solely on the grounds that they represent gay and lesbian people. I had hopes for better from you.\"\n \n In response to Frank and outcry from various LGBT and human rights groups, the State Department attempted to defend its action by saying that concern over potential support for pedophilias was behind the U.S. vote to exclude the gay rights groups.\n\n \n What could possibly be the rationale for such an action? Any guesses?", 
   {
    "unicode_changes_made": true
   }, 
   233123, 
   null, 
   1159633140.0
  ], 
  [
   233149, 
   null, 
   "jyoshu", 
   "The odd thing to me though is that they are using the fact it was the same vote as Iran as some key point here. Does it really matter what other nations did on this? I don't see how that is a relevant point. If GLBT groups have an issue here, they should take issue with the vote, not because some other countries happen to vote the same way. There may be times we may indeed vote the same as Iran on a given issue--it doesn't have any merit that we happen to have. It's funny to me that the fact he happened to voted in a same way as Iran on a given issue makes him \"political bedfellows.\" Get real. It's not like he and Iran were on the phone planning this or something.", 
   {}, 
   233130, 
   null, 
   1159663560.0
  ], 
  [
   233153, 
   null, 
   "Matthew S", 
   "The odd thing to me though is that they are using the fact it was the same vote as Iran as some key point here. Does it really matter what other nations did on this? I don't see how that is a relevant point. If GLBT groups have an issue here, they should take issue with the vote, not because some other countries happen to vote the same way. There may be times we may indeed vote the same as Iran on a given issue--it doesn't have any merit that we happen to have. It's funny to me that the fact he happened to voted in a same way as Iran on a given issue makes him \"political bedfellows.\" Get real. It's not like he and Iran were on the phone planning this or something.\n\n \n \n \n Anti gay christian Fanaticism or anti gay muslim Fanaticism. What is the difference? Both groups hate gay people and have killed gay people either in the present or past.", 
   {}, 
   233149, 
   null, 
   1159673760.0
  ], 
  [
   233218, 
   null, 
   "foundit66", 
   "I am frequently amazed at how the United States claims to be a leader of the \"free\" world...\n \n ... yet more and more, we are behind on modern rights acknowledgements and advances in society.\n \n Here we are, fighting over whether torture should be legal or whether or not the Geneva Conventions apply, ...\n \n ... or more topically, what civil rights should be recognized for gays.\n \n \"Leader\" of the 'free' world???\n There are quite a few titles we could probably claim, but that one just isn't one of them anymore...", 
   {}, 
   233153, 
   null, 
   1159736520.0
  ], 
  [
   233221, 
   null, 
   "jyoshu", 
   "I am frequently amazed at how the United States claims to be a leader of the \"free\" world...\n \n ... yet more and more, we are behind on modern rights acknowledgements and advances in society.\n\n \n That depends, of course, on whether or not a given issue is truly an example of an \"advancement\" or not. Certainly it's often a matter of opinion. Believe it or not there could be cases where \"progressivism\" can go TOO far, IMO.", 
   {}, 
   233218, 
   null, 
   1159737960.0
  ], 
  [
   233227, 
   null, 
   "thelmoose", 
   "The odd thing to me though is that they are using the fact it was the same vote as Iran as some key point here. Does it really matter what other nations did on this? I don't see how that is a relevant point. If GLBT groups have an issue here, they should take issue with the vote, not because some other countries happen to vote the same way. There may be times we may indeed vote the same as Iran on a given issue--it doesn't have any merit that we happen to have. It's funny to me that the fact he happened to voted in a same way as Iran on a given issue makes him \"political bedfellows.\" Get real. It's not like he and Iran were on the phone planning this or something.\n\n \n The GLBT groups did take issue with the vote.\n \n The point of describing that group of countries was that there were the only countries that opposed the service organizations. If the US, Iran, China, Columbia and everyone else were voting similarly, that would be different and I would agree with you. It is notable that the US joined this select group of repressive countries in excluding the NGO's for no other reason than there were LGBT organizations.", 
   {}, 
   233149, 
   null, 
   1159741740.0
  ], 
  [
   233228, 
   null, 
   "foundit66", 
   "That depends, of course, on whether or not a given issue is truly an example of an \"advancement\" or not. Certainly it's often a matter of opinion. Believe it or not there could be cases where \"progressivism\" can go TOO far, IMO.\n\n \n \"whether or not a given issue is truly an example of an \"advancement\" or not\"?\n \n I guess you have the Iran, and China, and Cambodia certainly putting up their disapproval of these \"advancements\".\n \n But the countries that are typically at the fore-front of \"advancements\", are the countries that are supporting gay civil rights...\n \n But as far as \"advancements\", where are we Jyoshu?\n Gays in the military?\n Gay adoption?\n Gay marriage, or gay civil unions?\n \n The only thing you seem opposed to is the \"gay marriage\" issue, while you support the government giving what you classify as the PRIMARY PURPOSE of governmental recognition of gay marriage, the gay marriage benefits, assigned to gays under a different name...", 
   {}, 
   233221, 
   null, 
   1159742220.0
  ], 
  [
   233235, 
   null, 
   "jyoshu", 
   "The only thing you seem opposed to is the \"gay marriage\" issue, while you support the government giving what you classify as the PRIMARY PURPOSE of governmental recognition of gay marriage, the gay marriage benefits, assigned to gays under a different name...\n\n \n Wow, you actually didn't misrepresent me this time.", 
   {}, 
   233228, 
   null, 
   1159744920.0
  ], 
  [
   233239, 
   null, 
   "foundit66", 
   "Wow, you actually didn't misrepresent me this time.\n\n \n Where do I misrepresent you?\n And is this an obvious attempt by you to side-track the subject, to remark and complain about me?", 
   {}, 
   233235, 
   null, 
   1159745580.0
  ], 
  [
   233254, 
   null, 
   "Steeeeve", 
   "Where do I misrepresent you?\n And is this an obvious attempt by you to side-track the subject, to remark and complain about me?\n\n \n I think his point was that you can't say those things are advancements and that it is a matter of opinion. Perhaps Europe, etc are going in the wrong direction or backwards...all depends on how you look at it.", 
   {}, 
   233239, 
   null, 
   1159750560.0
  ], 
  [
   233288, 
   null, 
   "foundit66", 
   "I think his point was that you can't say those things are advancements and that it is a matter of opinion. Perhaps Europe, etc are going in the wrong direction or backwards...all depends on how you look at it.\n\n \n No. His \"point\" that I responded to there was that he was claiming that I usually misrepresented him.\n I asked a simple question. One I really don't expect an answer to...\n Not because it was rhetorical, but rather because it was of the type that I typically don't get any real answer from either of you...\n \n I'll ask it again.\n Jyoshu, where do I misrepresent you???", 
   {}, 
   233254, 
   null, 
   1159760520.0
  ], 
  [
   233302, 
   null, 
   "joebrummer", 
   "Sounds like this should be a private conversation between you two, as it is not on topic and only applies to the two of you!", 
   {}, 
   233288, 
   null, 
   1159763580.0
  ], 
  [
   233318, 
   null, 
   "Steeeeve", 
   "Sounds like this should be a private conversation between you two, as it is not on topic and only applies to the two of you!\n\n \n Joebrummer...bringing common sense back to the forums since..well...today. Welcome back from your 1-2 month break", 
   {}, 
   233302, 
   null, 
   1159766460.0
  ], 
  [
   233328, 
   null, 
   "Matthew S", 
   "I think his point was that you can't say those things are advancements and that it is a matter of opinion. Perhaps Europe, etc are going in the wrong direction or backwards...all depends on how you look at it.\n\n \n So equality and non discrimination is going in the wrong direction? So gay people should remain second classs citizens?\n \n BTW when was the last time the US voted on the same side as Iran?", 
   {}, 
   233254, 
   null, 
   1159781580.0
  ], 
  [
   233338, 
   null, 
   "Steeeeve", 
   "So equality and non discrimination is going in the wrong direction? So gay people should remain second classs citizens?\n \n BTW when was the last time the US voted on the same side as Iran?\n\n \n Perhaps you should quote Jyoshu's post.... I was merly trying to clarify what he said...or what I thought he was saying.", 
   {}, 
   233328, 
   null, 
   1159805220.0
  ], 
  [
   233344, 
   null, 
   "foundit66", 
   "So equality and non discrimination is going in the wrong direction? So gay people should remain second classs citizens?\n BTW when was the last time the US voted on the same side as Iran?\n\n \n One thing that I have noted is how people can often agree or disagree out of both sides of their mouth.\n \n A neo-con can openly condemn a communist as being crazy and philosophical immoral, ...\n ...but if the communist claims that communism has ties to the ACLU, then that statement is openly embraced as true.\n (Which is kind of funny considering the ACLU's history of sweeping out communism...)\n \n An anti-gay person can condemn the claims of a pedophile who says that he \"loves\" kids, and that he is being unjustly discriminated against, ...\n ... but if that pedophile claims a connection to gay rights, the claim is embraced as true.\n \n Here, we have a group of people who are habitually backwards on civil rights, on multiple issues.\n But when it comes to gay rights, THEY supposedly have it right while the rest of the world, which typically leads the way on civil rights, have it wrong???\n \n Are civil rights just a \"majority\" issue whereby a majority decide whose rights and what rights are protected?\n Or are they more fundamental concepts, whereby protection and recognition doesn't depend upon who is in power, but rather on reasoning through the issue and making arguments that don't depend upon prejudice?", 
   {}, 
   233328, 
   null, 
   1159809720.0
  ], 
  [
   233346, 
   null, 
   "jyoshu", 
   "One thing that I have noted is how people can often agree or disagree out of both sides of their mouth.\n \n A neo-con can openly condemn a communist as being crazy and philosophical immoral, ...\n ...but if the communist claims that communism has ties to the ACLU, then that statement is openly embraced as true.\n (Which is kind of funny considering the ACLU's history of sweeping out communism...)\n \n An anti-gay person can condemn the claims of a pedophile who says that he \"loves\" kids, and that he is being unjustly discriminated against, ...\n ... but if that pedophile claims a connection to gay rights, the claim is embraced as true.\n \n \n\n \n That's because people don't normally all fall a certain way on every issue. People, organizations, and countries often are multi-faceted regarding their stances on issues. Take pro-life democrats for instance. Why would you not expect a pro-life conservative to agree with a pro-life dem on the issue of abortion? That's not talking out of both sides of their mouth, it's agreeing where there's agreement, and disagreeing where there's disagreement, and I think that's what happens more often. Perhaps you'll back up your claim here and show examples of what you're talking about<b></b>: \"if that pedophile claims a connection to gay rights, the claim is embraced as true\" and \"if the communist claims that communism has ties to the ACLU, then that statement is openly embraced as true.\" Or is this a case of generalization on your part?", 
   {}, 
   233344, 
   null, 
   1159810620.0
  ], 
  [
   233348, 
   null, 
   "jyoshu", 
   "So equality and non discrimination is going in the wrong direction? So gay people should remain second classs citizens?\n \n BTW when was the last time the US voted on the same side as Iran?\n\n \n I'm saying this stance on gay marriage isn't necessarily an example of progressivism--of course you think it is, but many don't think so. Many think it's a step in the wrong direction, and just because it's Iran that voted this way doesn't reflect on the merits of the issue. Believe it or not, white anglo saxon European and North American nations can be wrong sometimes, and ME theocracies might not be wrong on every issue. The best we can say is that gay marriage being an example of progress is a matter of opinion.", 
   {}, 
   233328, 
   null, 
   1159810860.0
  ], 
  [
   233362, 
   null, 
   "robbie0517", 
   "I'm saying this stance on gay marriage isn't necessarily an example of progressivism--of course you think it is, but many don't think so. Many think it's a step in the wrong direction, and just because it's Iran that voted this way doesn't reflect on the merits of the issue. Believe it or not, white anglo saxon European and North American nations can be wrong sometimes, and ME theocracies might not be wrong on every issue. The best we can say is that gay marriage being an example of progress is a matter of opinion.\n\n \n This was a vote on consultative status for two international organizations, not a vote on gay marriage.", 
   {}, 
   233348, 
   null, 
   1159813200.0
  ], 
  [
   233363, 
   null, 
   "Steeeeve", 
   "Do you know of a list of groups that are allowed in?", 
   {}, 
   233362, 
   null, 
   1159813320.0
  ], 
  [
   233367, 
   null, 
   "foundit66", 
   "That's because people don't normally all fall a certain way on every issue. People, organizations, and countries often are multi-faceted regarding their stances on issues. Take pro-life democrats for instance. Why would you not expect a pro-life conservative to agree with a pro-life dem on the issue of abortion? That's not talking out of both sides of their mouth, it's agreeing where there's agreement, and disagreeing where there's disagreement, and I think that's what happens more often.\n\n You give an example that is quite frankly not a true analogy. Pro-abortion and anti-abortion (let's cut the XXXX of the names) often differ on one key issue. The presence of \"life\". There is plenty of overlap on their stances, and the extremes wanting NO form of abortion and wanting ALL forms of abortion allowed are a fairly rare minority.\n If you could show me an example of somebody who wants NO form of abortion agreeing with somebody who wants ALL forms of abortion legal, ON THE ISSUE of abortion, then THAT would be something...\n \n I specifically chose my examples with care.\n Neo-cons and \"communists\".\n Anti-gay and \"pedophiles\".\n \n Areas where there is typically a UNILATERAL and UNEQUIVOCABLE condemnation of the group, but then there is a ray of false sunlight that they agree on.\n \n Likewise for this issue. How many times have we shown a spotlight on these countries for civil rights violations?\n And now we are suddenly agreeing with them?\n \n You may want to gloss over the significance of that, but it IS significant.\n \n \n \nPerhaps you'll back up your claim here and show examples of what you're talking about<b></b>: \"if that pedophile claims a connection to gay rights, the claim is embraced as true\" and \"if the communist claims that communism has ties to the ACLU, then that statement is openly embraced as true.\" Or is this a case of generalization on your part?\n\n 1) I wasn't generalizing. I am talking about specific posters and what I have seen them say. I do not claim that all \"anti-gay\" or all \"neo-cons\" act that way.\n 2) I don't keep records on these posts. I can only tell you what I have seen.\n I have seen anti-gay people claim that pedophilia and gay rights issues are linked. I've seen them use pedophile's statements as supposed proof of that link.\n I have also seen neo-cons accuse the ACLU of being linked to communism, and attempt to prove that claim by quoting a communist.\n \n Are you claiming that my stated experiences are false?\n I truly don't understand the importance of documenting these experiences, that I suspect a variety of posters on these message boards have witnessed for themselves...", 
   {}, 
   233346, 
   null, 
   1159813740.0
  ], 
  [
   233370, 
   null, 
   "Steeeeve", 
   "Do you know of a list of groups that are allowed in?\n\n \n nevermind...there is a huge list of them on the UNs website", 
   {}, 
   233363, 
   null, 
   1159813920.0
  ], 
  [
   233374, 
   null, 
   "foundit66", 
   "This was a vote on consultative status for two international organizations, not a vote on gay marriage.\n\n \n That's an incredibly important point.\n This wasn't about whether or not John and Larry can get married.\n This was on whether or not a group should just be EXCLUDED.\n As the article put it... \"denied entrance to United Nations gatherings.\"\n \n This wasn't an issue of giving gays a \"vote\" at the U.N. table.\n This wasn't an issue of getting the U.N. to say gays should have marriage.\n \n This was an issue of allowing a gay group to provide input to the U.N.\n It would be more comparable to saying that a gay person would be rejected from a job than it would be \"gay marriage approval\"...", 
   {}, 
   233362, 
   null, 
   1159814160.0
  ], 
  [
   233385, 
   null, 
   "foundit66", 
   "Feh. I wanted to add something to the previous post, but the \"Edit\" command seems to be stalling on me...\n -----------------------------\n \n This was an issue of allowing a gay group to provide input to the U.N. One of many...\n \"After all, there are 634 NGOs affiliated with ECOSOC. We're talking about groups like the Humane Society, American Jewish Congress and Greenpeace as well as such groups as Feminists for Life of America and the National Right to Life Education Trust Fund. A lesbian and gay NGO voice would give some balance to the right-wing hyperbole.\"\n \n It would be more comparable to saying that a gay person would be rejected from a job than it would be \"gay marriage approval\"...\n It's an issue of saying that a gay group CANNOT have input on civil rights issues of the U.N.\n \n So the question comes down to this. In a world where some countries KILL people for engaging in gay sex, where is the logic in prohibiting a gay group from input into U.N. civil rights issues?", 
   {
    "unicode_changes_made": true
   }, 
   233374, 
   null, 
   1159815480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Watching Out For Human Rights", 
  "url": "http://www.4forums.com/political/gay-rights-debates/8972-watching-out-human-rights.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 8972, 
  "discussion_files": [
   [
    "24726.html", 
    "http://www.4forums.com/political/gay-rights-debates/8972-watching-out-human-rights-print.html"
   ], 
   [
    "24727.html", 
    "http://www.4forums.com/political/gay-rights-debates/8972-watching-out-human-rights-2-print.html"
   ]
  ], 
  "identifier": 8972
 }
]