[
 [
  [
   233151, 
   null, 
   "Dono", 
   "My son inherited the motor gene from me so I was not surprised that he called and said he had just picked up a motorcycle for my 6-year old grandson. It is really a nice little machine, a 50cc Yamaha with auto trans and shaft drive. My son's house is on an acre so there is lots of yard for him to ride on and he is only allowed on it with Dad present. He looks like a little space man scooting around the yard with that full-face helmet on. I got on and took it for a spin and it had no problem hauling my big butt around the yard. The throttle can be adjusted to limit the speed, but that option probably won't be used much. I was around 11 when I got my first motor vehicle, a Whizzer motorbike.", 
   {
    "post_info": {
     "post_title": "First Motorcycle"
    }
   }, 
   null, 
   null, 
   1159666140.0
  ], 
  [
   233156, 
   null, 
   "zachvac", 
   "My son inherited the motor gene from me so I was not surprised that he called and said he had just picked up a motorcycle for my 6-year old grandson. It is really a nice little machine, a 50cc Yamaha with auto trans and shaft drive. My son's house is on an acre so there is lots of yard for him to ride on and he is only allowed on it with Dad present. He looks like a little space man scooting around the yard with that full-face helmet on. I got on and took it for a spin and it had no problem hauling my big butt around the yard. The throttle can be adjusted to limit the speed, but that option probably won't be used much. I was around 11 when I got my first motor vehicle, a Whizzer motorbike.\n\n \n A motorcycle? Around a yard of 1 acre? Isn't a motorcycle like a thing you drive on a normal road? Are you talking about an ATV or a real motorcycle?", 
   {}, 
   233151, 
   null, 
   1159676220.0
  ], 
  [
   233182, 
   null, 
   "georged", 
   "A motorcycle? Around a yard of 1 acre? Isn't a motorcycle like a thing you drive on a normal road? Are you talking about an ATV or a real motorcycle?\n\n \n At age 6 keeping motorcycle riders off normal roads is prudent parenting.", 
   {}, 
   233156, 
   null, 
   1159721520.0
  ], 
  [
   233183, 
   null, 
   "zachvac", 
   "At age 6 keeping motorcycle riders off normal roads is prudent parenting.\n\n \n I just didn't realize it was possible to ride a motorcycle in a yard. I agree with you there though :)", 
   {}, 
   233182, 
   null, 
   1159721700.0
  ], 
  [
   233259, 
   null, 
   "Dono", 
   "A motorcycle? Around a yard of 1 acre? Isn't a motorcycle like a thing you drive on a normal road? Are you talking about an ATV or a real motorcycle?\n\n This is a real motorcycle though very small. He has an ATV, but it is a small replica with an electric motor (only for the yard). When they are at the ranch, he often sits in front of his dad on the real ATV, operates the throttle and steers.", 
   {}, 
   233156, 
   null, 
   1159752540.0
  ], 
  [
   233401, 
   null, 
   "Waxy", 
   "I started out a little Honda Z50, like a million other kids. Riding around in the yard and hills around our cottage.\n \n Went from there to various other 80cc bikes my dad would collect and restore. I had a real nice Suzuki 80 for a while.\n \n I bought a 1986 Yamaha DT200 when I was 14. I worked like a dog all year to save up $1600 for that thing. I put almost 25,000 kms (15,000 miles) on that bike before I sold it when I was 17 to buy a truck. There wasn't a back road, trail, or secret entrance within 20 miles of the cottage I didn't know like the back of my hand.\n \n I went without a bike until '01, bought snowmobiles instead. I bought my current bike, an '01 Suzuki DRZ400E that spring. I put some turn signals and a horn on it and got a license plate. I ride it whenever I get the chance, even to work, but I dont get out nearly as much as I'd like to.\n \n I miss the freedom I had roaming around on a bike back then......\n \n Waxy", 
   {}, 
   233259, 
   null, 
   1159819980.0
  ], 
  [
   233481, 
   null, 
   "zachvac", 
   "I started out a little Honda Z50, like a million other kids. Riding around in the yard and hills around our cottage.\n \n Went from there to various other 80cc bikes my dad would collect and restore. I had a real nice Suzuki 80 for a while.\n \n I bought a 1986 Yamaha DT200 when I was 14. I worked like a dog all year to save up $1600 for that thing. I put almost 25,000 kms (15,000 miles) on that bike before I sold it when I was 17 to buy a truck. There wasn't a back road, trail, or secret entrance within 20 miles of the cottage I didn't know like the back of my hand.\n \n I went without a bike until '01, bought snowmobiles instead. I bought my current bike, an '01 Suzuki DRZ400E that spring. I put some turn signals and a horn on it and got a license plate. I ride it whenever I get the chance, even to work, but I dont get out nearly as much as I'd like to.\n \n I miss the freedom I had roaming around on a bike back then......\n \n Waxy\n\n \n Wow, I live on 2 acres, but my parents would never dream of letting me on a motorcycle this close to DC with all the traffic.", 
   {}, 
   233401, 
   null, 
   1159854600.0
  ], 
  [
   233520, 
   null, 
   "Waxy", 
   "Wow, I live on 2 acres, but my parents would never dream of letting me on a motorcycle this close to DC with all the traffic.\n\n \n Why would you be riding in traffic?\n \n You can ride a dirt bike on 2 acres for hours. You can ride a Honda 50 on 2 acres for a lifetime.\n \n You realize that motorbikes don't have to ridden on streets right?\n \n Waxy\n \n P.S. I have gotten a few tickets for riding without a license (had to push my bike home once while the cop followed in his car, I'll never forgive that @#$%#), and a few tickets for operating an unregistered vehicle on public roads. No big deal. That's the beauty of living in a small town.", 
   {}, 
   233481, 
   null, 
   1159901520.0
  ], 
  [
   233527, 
   null, 
   "sinjin", 
   "If you want to be on regular streets speeding while underage might I recommend a go-cart.\n \n Btw my first bike was an Italian made Harley-Davidson single cylinder four-stroke 350cc street bike at 15 yrs. of age. Lucky to be alive I am.", 
   {}, 
   233520, 
   null, 
   1159905480.0
  ], 
  [
   241412, 
   null, 
   "jim's trucking", 
   "... I was around 11 when I got my first motor vehicle, a Whizzer motorbike.\nDid you have the full size model or the little one that actually looked like a motorcycle? My brother got one for Christmas in the mid '50s. It was a full size bicycle with a Whizzer motor just like the smaller version. I rode it more than he did...all over town, the country roads and the back yard.", 
   {}, 
   233151, 
   null, 
   1164825300.0
  ], 
  [
   241455, 
   null, 
   "Master_Shake", 
   "At age 6 keeping motorcycle riders off normal roads is prudent parenting.\n\n lol, I would say so emoticon_xhoho", 
   {}, 
   233182, 
   null, 
   1164839760.0
  ], 
  [
   241478, 
   null, 
   "Dono", 
   "Well it was bound to happen. My son took the little 50cc Yamaha to the ranch where my grandson would have some trails to try out. When they arrived, my son's partner was there with a 50cc Kawasaki he had bought for his son, Soon the two grown men were racing around a wheat field on the tiny machines. As they made the last turn the Kawa went down and my son passed for the win. You would have thought from the laughing and boasting that he had won the Indy 500.", 
   {}, 
   241455, 
   null, 
   1164849780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  First Motorcycle", 
  "url": "http://www.4forums.com/political/technology/8975-first-motorcycle.html", 
  "breadcrumbs": [
   "Technology"
  ], 
  "id_number": 8975, 
  "discussion_files": [
   [
    "23993.html", 
    "http://www.4forums.com/political/technology/8975-first-motorcycle-print.html"
   ]
  ], 
  "identifier": 8975
 }
]