[
 [
  [
   233173, 
   null, 
   "supersport", 
   "Towards a Newer Synthesis of Evolutionary Theory\n \n When a new professional sports team is formed or a new Stadium is built, the owners of the team often asks the surrounding community for name suggestions. \n \n Well...maybe the scientific community can do the same thing. Since neo-darwinism is officially dead -- as proven by this link from The Computational and Analytical Molecular Evolution Laboratory -- then maybe they can hold a world-wide raffle with fun prizes for the person who submits the coolest name for the new, \"yet-to-be-named\" theory. \n \n \n http://www.molevol.org/camel/projects/synthesis/\n \n \n \"Why not neo-Darwinism\"?\n \n \"Evolutionary biology is in a state of transition, based on a new perception of how the process of variation influences evolutionary change. Evolutionary biologists who understand something of this new view (and not all of them do, yet) disagree among themselves over whether it still should be called \"Darwinism\". Clearly any new view of evolution will still invoke natural selection in populations, yet just as clearly, it would contradict fundamental propositions of the Darwinism of the 19th century as well as the neo-Darwinism of the mid-20th century....\"\n \n \"....Superficially, at least, it appears that several fundamentally different views of evolution are competing or co-existing in different fields: an \"evo-devo\" view, a \"molecular\" view, a \"classical\" view, maybe even a \"systems\" view or an \"a-life\" view. Some authorities tell us that molecular evolution is different from non-molecular evolution. What is the unified theory that provides for both? Familiar icons of neo-Darwinism still write books proclaiming the sufficiency of neo-Darwinism to accomodate new data on molecular evolution and development. Meanwhile, \"evo-devo\" enthusiasts proclaim a new view that addresses problems \"not seen as being soluble by population genetics\" (Gilbert, et al., 1996). If population genetics does not provide a unified mathematical framework for addressing evolutionary causes, what body of theory does?\" \n \n \"The view argued here is that these apparent differences are real, and that the contemporary discord in evolutionary theory hearkens back to the earlier dispute over mutation and the role of variation in evolution.\" \n \n \n \"To the early neo-Darwinians, the notion that the direction of evolution would be influenced by \"internal\" factors such as mutation and development seemed not merely wrong, but unscientific.\"\n \n Now isn't that ironic?????? ...and you guys still believe it! \n \n \n \"Thus, while there are clearly common threads linking past and present thought in evolutionary biology, the evolutionary theory of today is not that of Darwin, nor even that of Darwin's mid-20th-century successors. This yet-to-be-named new view, with its empirical emphasis on rates and patterns of divergence, and its reliance on, not only natural selection, but also mutation biases and developmental constraints as causes of non-randomness in evolution, has already enjoyed considerable success.\"\n \n http://www.molevol.org/camel/\n \n \n Neo-darwinism is indeed dead. There is no merging it with evo-devo. You cannot base a whole theory on the assumption that only populations evolve, yet then admit that individuals evolve too.....this destroys the whole foundation that neo-darwinism was built on. \n \n You might as well get used to it. This is not going away. \n \n The whole neo-darwin fairlytale is over. You evolutionists have fallen for the biggest hoax ever told......Charles Darwin, Richard Dawkins, Ernst Mayr, and all the other so-called scientific geniuses will go down as a group of mildly entertaining fiction writers who dreamed-up and promoted a nonsensical, failed hypothesis. All their books should be rounded up and burned in a giant sacrificial bonfire!\n __________________\n Our standard expectation of evolution -- slow, steady, gradual improvement, hence change, through time -- is indeed a myth. Niles Eldredge", 
   {
    "post_info": {
     "post_title": "Towards a Newer Synthesis of Evolutionary Theory"
    }
   }, 
   null, 
   null, 
   1159716840.0
  ], 
  [
   233176, 
   null, 
   "Collin", 
   "Time to ban this clown. emoticon_xhoho", 
   {}, 
   233173, 
   null, 
   1159719720.0
  ], 
  [
   233177, 
   null, 
   "supersport", 
   "Time to ban this clown. emoticon_xhoho\n\n \n lol! cat got your tongue? ...you can't debate the facts so what you want to do is get rid of the fact-bringer! Neodarwism has HAD IT! \n \n what do you think of this statement, colleen?\n \n Is mutation a \"random\" process with no predictable influence on evolution? Though textbooks depict mutation this way, researchers today know that mutation is non-uniform (e.g., bubble plot of a model of nucleotide mutation based on data from Hwang and Green), and that simple biases like transition:\n \n http://www.molevol.org/camel/\n \n by the way...since you're calling for my banning I'm going to post another thread-starter just for you....", 
   {}, 
   233176, 
   null, 
   1159719900.0
  ], 
  [
   233181, 
   null, 
   "Collin", 
   "lol! cat got your tongue? you can't debate the facts so what you want to do is get rid of the fact-bringer! Neodarwinism has HAD IT!\n\n \n That's exactly it. It's not as though we can effortlessly rebuttle every single one of your posts as we've done in the past. It's not as though we're tired of your absence when it's your turn to defend your position. Oh no, it's only because the cat's got my tongue.", 
   {
    "unicode_changes_made": true
   }, 
   233177, 
   null, 
   1159721160.0
  ], 
  [
   233185, 
   null, 
   "supersport", 
   "That's exactly it. It's not as though we can effortlessly rebuttle every single one of your posts as we've done in the past. It's not as though we're tired of your absence when it's your turn to defend your position. Oh no, it's only because the cat's got my tongue.\n\n \n yea you've rebuttled every one of my posts with rhetoric. How do you explain how The Computational and Analytical Molecular Evolution Laboratory is calling for a new synthesis based on \"biased\" mutations?????? \n \n let's hear it.", 
   {}, 
   233181, 
   null, 
   1159722360.0
  ], 
  [
   233192, 
   null, 
   "pandion", 
   "yea you've rebuttled...\nDo you mean that he has \"rebutted\" your posts? There is no such word as \"rebuttled\" or \"rebuttle\". Such illiterate use of English makes you look foolish. The past participle of the verb \"rebut\" is \"rebutted.\" The arguments that rebut an assertion are \"rebuttal.\"\n \n...every one of my posts with rhetoric.\nTrue. He has rebutted every one of your posts with effective use of language. How nice of you to admit that. Considering that your posts are nothing but assertions of Lamarckism, they are quite easy to rebut.\n \n Are you sure you said what you wanted to say?\n \nHow do you explain how The Computational and Analytical Molecular Evolution Laboratory is calling for a new synthesis based on \"biased\" mutations??????\nPlease define what you mean by \"synthesis\", \"mutation\", \"bias.\" Please give detailed sources (peer reviewed) for any evidence of mutational bias. Please show that what you are asserting is the correct interpretation of the data (give the data). In other words, please show why your claim that evolution is biased by mutations is correct, and that the site that you cite is incorrect, i.e., evolution is biased by mutations. I suspect that you are unable to discern the difference.", 
   {}, 
   233185, 
   null, 
   1159724220.0
  ], 
  [
   233198, 
   null, 
   "Shooterandproud", 
   "Time to ban this clown. emoticon_xhoho\n\n \n Amen.emoticon_xgood", 
   {}, 
   233176, 
   null, 
   1159729020.0
  ], 
  [
   233251, 
   null, 
   "Hi_Its_Me", 
   "In response to supersport's link: scientists frequently debate aspects of evolution (gradualism vs. punctuated equlibrium, for example), but none debate that evolution has happened, is happening, or that it will continue. \n Also, about Darwin's \"conflict\" with modern evolutionary theory: Darwin didn't have all of the information, so his theory was revised as more information was found. However, he did get the basic idea right: natural selection.\n \n I don't think that supersport will be banned. He is making an argument, and his posts aren't quite spam (he would have been banned a while ago, otherwise). However, he will not be able to successfully claim that he was banned for telling the truth, either.", 
   {}, 
   233173, 
   null, 
   1159750020.0
  ], 
  [
   233291, 
   null, 
   "Collin", 
   "He's spamming by refusing to participate in a discussion he trolled into existence.", 
   {}, 
   233251, 
   null, 
   1159761480.0
  ], 
  [
   233301, 
   null, 
   "trebor", 
   "In response to supersport's link: scientists frequently debate aspects of evolution (gradualism vs. punctuated equlibrium, for example), but none debate that evolution has happened, is happening, or that it will continue. \n Also, about Darwin's \"conflict\" with modern evolutionary theory: Darwin didn't have all of the information, so his theory was revised as more information was found. However, he did get the basic idea right: natural selection.\n \n I don't think that supersport will be banned. He is making an argument, and his posts aren't quite spam (he would have been banned a while ago, otherwise). However, he will not be able to successfully claim that he was banned for telling the truth, either.\n\n \n \n \n That would be true if he did not keep on opening up thread after thread after thread of the same subject. He makes 2 or 3 posts, then runs away to open up another thread.", 
   {}, 
   233251, 
   null, 
   1159763340.0
  ], 
  [
   233309, 
   null, 
   "Shooterandproud", 
   "That would be true if he did not keep on opening up thread after thread after thread of the same subject. He makes 2 or 3 posts, then runs away to open up another thread.\n\n \n Yes, i agree with you.", 
   {}, 
   233301, 
   null, 
   1159765620.0
  ], 
  [
   233717, 
   null, 
   "supersport", 
   "I'm just waiting for a logical arguement to debate against. I haven't heard one yet. Neo-darwinism is more than just gasping for air -- it's stone-cold dead.", 
   {}, 
   233309, 
   null, 
   1160000880.0
  ], 
  [
   233718, 
   null, 
   "supersport", 
   "Back in the mits of time there was a giant stagnant Swamp -- evolutionits call it paradise -- it was a magical place where the unthinkable happened. Out of the murky water crawled millions of cute little sweaty swamp creatures. It was a vast array of truly bizzare animals with parts from many different creatures all hodgepodged into one. One of which turned out to be a grunting, long-haired primate. Through a freak twist of the swamp's evolutionary nature, these chest-beating primates began breeding with anything and everything that remotely looked like them. It didn't matter where they spread their seed as long as it ended up in a creature that didn't put up too much resistance.\n \n It really was a beautiful existence. Some lived in trees, some felt safer near the murky water's edge where they emerged from. But deep within the moss-covered thicket, surrounded by strange and unnatrual creatures, Man was being shaped and formed from a beautiful collage of multi-colored DNA and diversified primate semon. Through a bizzare and adultrous twist of fate, several different \"families\" of primates evolved....some of which preferred to continue dwelling near the swamp -- but some of the \"brighter\" creatures thought it would be a good idea to venture off into uncharted territory. Eventually they unwittingly decided to form colonies and start reading, writing, praying, hoping, believing, marrying, and loving. Of course this would mean leaving their \"cousins\" behind -- who could do none of this -- back in the thicket where the insects swarmed above the murkey waters of the magical swampy paradise.\n \n But little did our little miracle know how SPECIAL he was! Not only was he part primate, but he was part BUG, PLANT, ALGAE, MOLD and SLIME as well! In fact, there were all kinds of wonderful creatures in his family tree, including rat-type rodents and various other recently-emerged unidentified stinking swamp creatures. Eventually he figured it would be easier to walk upright and shrink his fingers since he no longer needed to swing from trees ....he also saw no more use for his body hair, so he decided to ditch that as well so his relatives wouldn't have to continually pick things off him. Yes, our little guy sure has come a long way!....and he certainly should be proud of his long, distinguished, multi-cultrual heritage! S", 
   {
    "post_info": {
     "post_title": "The Story of Swamp Man"
    }
   }, 
   233717, 
   null, 
   1160001540.0
  ], 
  [
   233732, 
   null, 
   "Hi_Its_Me", 
   "I'm just waiting for a logical arguement to debate against. I haven't heard one yet. Neo-darwinism is more than just gasping for air -- it's stone-cold dead.\n\n Well, you wouldn't find a logical argument if you only read your own posts, now would you?\n To find a logical argument to debate against, I would recommend 4forums.com in the creation vs. evolution section. Of course, only creationists have the honor of debating against logical arguments.\n Also, denying that our arguments are logical does nothing. Please attempt to refute them. We refute yours, even though we see no logic.\n Finally, Darwin's Theory of Evolution by Natural Selection is not a theory in crisis in any way. Get over it.\n \nBack in the mits of time there was a giant stagnant Swamp -- evolutionits call it paradise --\n\n \"Evolutionits\" do not exist, and even \"evolutionists\" are non-existant. Please use the correct terms.\n By the way, you appear to be confusing eden with primordial soup, making this post a strawman. Biologists do not claim that a swamp produced life; they believe that life appeared first in a body of warm water. See abiogenesis before claiming that anything \"magical\" had to happen.\n \n it was a magical place where the unthinkable happened. Out of the murky water crawled millions of cute little sweaty swamp creatures.\n\n Using inaccurate adjectives such as \"cute\" and \"sweaty\" just shows that you don't know what you are talking about. Also, it does nothing to dispute the fact that this post is a strawman. One of the first land animals was a fishlike animal, not small or cute.\n \nIt was a vast array of truly bizzare animals with parts from many different creatures all hodgepodged into one.\n\n Obviously based on a misunderstanding of evolution. Alternatively, a lie. In either case, you got it wrong. \"Parts\" implies that they were grafted onto each other, rather than evolving, and how you phrased it indicates that you think that they didn't spread out. Finally, you make it sound like this was a very fast process. Evolution is not a very fast process.\n \nOne of which turned out to be a grunting, long-haired primate. \n\n More like one group. Also, they weren't \"grunting, long-haired primates\" until long after life had emerged from the ocean.\n \nThrough a freak twist of the swamp's evolutionary nature, these chest-beating primates began breeding with anything and everything that remotely looked like them.\n\n Not a freak twist. That is a common practice among many forms of life. Look it up.\n \nIt didn't matter where they spread their seed as long as it ended up in a creature that didn't put up too much resistance.\n\n Not true- organisms usually only attempt to breed with orgainsms that they can reproduce with. Again, look it up.\n \nIt really was a beautiful existence. Some lived in trees, some felt safer near the murky water's edge where they emerged from.\n\n That happened slowly, and \"feeling safer\" made little difference to the survival of a species. Please attempt to understand what you are saying.\n \nBut deep within the moss-covered thicket, surrounded by strange and unnatrual [sic] creatures, Man was being shaped and formed from a beautiful collage of multi-colored DNA and diversified primate semon. \n\n Wow. Are you trying to advertise that you don't understand evolution? You certainly are succeeding. Homo sapiens was not formed in a thicket- the savannah of Africa was the point where our species evolved most. Think about it. Everyone who can have a lawn has a lawn. It's in our genes. Also, tests have shown that the most preferred habitat for people is a savannah.\n \nThrough a bizzare and adultrous twist of fate, several different \"families\" of primates evolved....some of which preferred to continue dwelling near the swamp -- but some of the \"brighter\" creatures thought it would be a good idea to venture off into uncharted territory.\n\n Speciation occurs because organisms are seperated, but not because organisms \"decide\" to seperate themselves. Evolution is not based on the decisions of organisms; it is based on successful reproduction.\n \nEventually they unwittingly decided to form colonies and start reading, writing, praying, hoping, believing, marrying, and loving. \n\n \"Unwittingly decided\"? Please make up your mind.\n Also, talk.origins already has explanations for religion, language, art, etc.\n \nOf course this would mean leaving their \"cousins\" behind -- who could do none of this -- back in the thicket where the insects swarmed above the murkey waters of the magical swampy paradise.\n\n Do you realize that the \"swamp\" you are talking about has to refer to everywhere life existed? This specifically means the biosphere, and in lay terminology, the surface of the planet earth.\n \nBut little did our little miracle know how SPECIAL he was! Not only was he part primate, but he was part BUG, PLANT, ALGAE, MOLD and SLIME as well! \n\n Ok... Is this an attempt to state the facts, or are you trying (unsuccesfully) to make evolution sound rediculous?\n \nIn fact, there were all kinds of wonderful creatures in his family tree, including rat-type rodents and various other recently-emerged unidentified stinking swamp creatures. \n\n If you go back far enough, you find connections to other organisms... What is your point?\n Also, \"recently-emerged\" is the least accurate thing you have said on this forum (I believe).\n \nEventually he figured it would be easier to walk upright and shrink his fingers since he no longer needed to swing from trees ....he also saw no more use for his body hair, so he decided to ditch that as well so his relatives wouldn't have to continually pick things off him. \n\n There are no decisions involved in natural selection. Try to understand what you are talking about.\n \nYes, our little guy sure has come a long way!....and he certainly should be proud of his long, distinguished, multi-cultrual [sic] heritage! S\n\n A lame attempt at a strawman. It is too obviously wrong, and it doesn't provide much of an argument.", 
   {}, 
   233717, 
   null, 
   1160008440.0
  ], 
  [
   233812, 
   null, 
   "chaoticgnome", 
   "I was feeling a little masochistic and actually delved into the links supersport gave. The Computational and Analytical Molecular Evolution Lab is a group of hacks, for the most part. I'm an undergraduate senior in Chemistry and I do a lot of biochemistry work as well, and I've never heard of the journals these people are getting printed in. Also, the website contained this little gem of information.\n \n \nSometimes one hears the claim that, in science, \"theory\" refers to hypotheses that have been repeatedly confirmed and that are widely accepted by the scientific community, but (not to put too fine a point on it) this is a ridiculous position. One only hears of this interpretation of \"theory\" in discussions of evolution, because it arises from the ulterior motive of a definition of \"theory\" to defend Darwinism as a \"theory\". In general, this dubious and transparent attempt to associate \"theory\" with Truth ignores the well established double duty of \"theory\" for both abstract and concrete senses, as well as the subtle and often imperceptible difference in usage between \"theory\" (theory_C) and \"hypothesis\" (the latter of which doesn't work well in arguments with creationists, who have their own ulterior motives for interpreting \"hypothesis\" as \"guess\").\n\n \n They claim the scientific definition of theory is an attempt by evolutionists to spin the arguement. This ignores the fact that Atomic theory is a theory in exactly the same way evolution is. So not only are supersport's posts vapid and trite, but he links to hacks trying to pose as scientists.\n \n Giveaway: I've never heard a proper scientist ever use the word neo-darwinism. Why? Because that word is meaningless. Who the hell cares what darwin said about evolution? I care about as much as I care what Aristotle said about motion. We've moved on, that's how science works. We don't talk about neo-Newtonian physics becasue that phrase is just as nonesensical.", 
   {}, 
   233732, 
   null, 
   1160068080.0
  ], 
  [
   233845, 
   null, 
   "pandion", 
   "I've never heard a proper scientist ever use the word neo-darwinism.\nI have.\n \nWhy? Because that word is meaningless.\nNo, it's not. Neo-Darwinism is also known as the modern synthesis. It is the synthesis of Darwin's theories with genetics and population genetics. Darwin was unaware of the source of the variation that he saw in populations. In the 1930s and 1940s it was realized that genetics and mutations provided that variation.\n \nWho the hell cares what darwin said about evolution?\nMost biologists do for the simple fact that Darwin was correct on all major points. He was right about evolution proper, gradualism (although amended), speciation, common descent, and natural selection. What Darwin said is significant for historical reasons because it forms the basis of all of evolutionary biology. Evolutionary biology is still Darwinian.\n \nI care about as much as I care what Aristotle said about motion. We've moved on, that's how science works. We don't talk about neo-Newtonian physics becasue that phrase is just as nonesensical.\nOK. But creationists use the term neo-Darwinism because they know about as much about as you seem to.", 
   {}, 
   233812, 
   null, 
   1160083740.0
  ], 
  [
   233989, 
   null, 
   "chaoticgnome", 
   "Ouch \n \n Goes to show what hyperbole gets you on this forum. I wonder if keyboard in mouth is an adequate metaphor. It's good to know that stupid posts will be called out no matter what side they lie on.\n \n I've honestly never heard biologists refer to modern evolutionary theory as Neo-Darwinism. Of course modern theories are synthesized into Darwin's original theory, but I've never heard biology or biochemistry professors use that particular terminology. Perhaps it varies from University to University. I'll take your word for it.\n \n Darwin's work is of course important, but I was (quite poorly I see) simply trying to make the point that whatever faults that were present in Darwin's theory do not invalidate evolution. The other blatant example I often hear from creationists is that Darwin recanted his theories on his deathbed, which, even if true, wouldn't have mattered for the theory itself. I've always felt the term Neo-Darwinism puts too much emphasis on the man rather than the theory, allowing his character and actions to become an issue. \n \n The term also makes it seem as though very little progress has been made. Neo is not a term that stricly implies progress, but often refers to a new way to look at the same information. Neo-cons are still essentially conservative but have new opinions on how to best put forward conservative issues. Neo-Confucianism was a strategy to apply the original confucian teachings with a metaphysical system added on to compete with Taoists. With such subtexts, the term Neo-Darwinism gives the theory bad connotations.\n \n Ironically though, you first claim that Neo-Darwinism is a legitamate term used by scientists, then at the end of your post, claim creationsist use the term because they are ignorant. \n \n Little wars over such words can be important foundations for the overall debate, and while Darwin's work is important and should be revered, just as Newton's work is, we must put more emphasis on the theory in its modern state than we should on the man who first put the theory forward.", 
   {}, 
   233845, 
   null, 
   1160165400.0
  ], 
  [
   234005, 
   null, 
   "pandion", 
   "Well, it's not used much, but I was responding to your statement that you had never heard a proper scientist use the term. It might be mentioned in a biology course or two, but the real mention comes in the first days of a course on evolution while the history of evolutionary thought is being covered. Technically, Darwinism was composed of 5 separate theories: 1) non-constancy of species, 2) common descent, 3) gradualness, 4) population speciation, and 5) natural selection. Some anti-Darwinisn theories were neo-Lamarckism, orthogenesis, and mutationism (based on Mendelian genetics). It was the modern synthesis (neo-Darwinism) that did away with them all. Ernst Mayr was of the opinion that should just be called Darwinism anyway, since the adoption of the synthesis made other theories obsolete. It makes Darwin's work all that much more impressive when you are aware of what was known when he developed his theories.\n \n By the way, Hook 'em Horns! You will find me in front of my HDTV tomorrow at 2:30 for the Red River Shootout.\n \n \nOuch The other blatant example I often hear from creationists is that Darwin recanted his theories on his deathbed, which, even if true, wouldn't have mattered for the theory itself.\nTrue and especially silly when one considers that his daughter, Henrietta, and son Sir Francis Darwin, F.R.S. were both present during his last days and at his deathbed. Neither of them, when questioned knew who Lady Hope was. Sir Francis stated at one time that his father most certainly did not recant his theories.\n \nThe term also makes it seem as though very little progress has been made.\nThat could be, today. But at one time it indicated that progress was being made. You don't actually here the modern synthesis talked about all that much any more. In fact, not even punk eek is much debated.\n \nIronically though, you first claim that Neo-Darwinism is a legitamate term used by scientists, then at the end of your post, claim creationsist use the term because they are ignorant.\nRight. Few of them know what it is. Sometimes a creationist will talk about Darwinism, sometimes about neo-Darwinism, sometimes \"the evolution\" or \"the evolution theory,\" and sometimes \"evolutionism.\" They can't explain the meaning of any of it, much less evolutionary theory.\n \nLittle wars over such words can be important foundations for the overall debate, and while Darwin's work is important and should be revered, just as Newton's work is, we must put more emphasis on the theory in its modern state than we should on the man who first put the theory forward.\nActually, you are quite correct. In fact, reading Darwin's books is seldom required for degrees in biology. Mostly one studies about Darwin and what he said, how he was right and additions and corrections to the original theory.\n \n By the way, as of 2:30 tomorrow I'll be in front of my HDTV for the Red River Shootout. Hook 'em Horns!", 
   {}, 
   233989, 
   null, 
   1160170560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Towards a Newer Synthesis of Evolutionary Theory", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8977-towards-newer-synthesis-evolutionary-theory.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 8977, 
  "discussion_files": [
   [
    "11259.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8977-towards-newer-synthesis-evolutionary-theory-print.html"
   ], 
   [
    "11260.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8977-towards-newer-synthesis-evolutionary-theory-2-print.html"
   ]
  ], 
  "identifier": 8977
 }
]