[
 [
  [
   233178, 
   null, 
   "supersport", 
   "Evolution is able to be disproven in so many ways....here's a simple, lethal disproof:\n \n Ever since Darwin came along, evolutionists have claimed that the human race is evolving. We supposedly evolved from simplistic monkeys to what we are today. They think we all built up from one-celled organisms to the physiological works of art that we are today. But I suggest just the opposite is actually happening.\n \n Just like individuals age over time, so does our species. We are not evolving, but devolving. Our world is rolling downhill like a giant bolder rolling down a mountainside.\n \n Humans have an average life expectancy of 70-75 years...with a maximum of around 120. But what happens if a man marries his first cousin? It has been shown that life expectancy of such offspring diminishes by 10 years. This is because of the large number of genetic mistakes that happen within the genome - which essentially ages the individual. \n \n To me, inbreeding is seems to foreshadow where we are headed in society. We are going downhill genetically. This is true for individuals and this is true for the population. And the reason for this is because humans are consistently deteriorating and degenerating from the high rate of mutations.\n \n If you think about it, every phsyical cause or mechanism of evoution is either conservative or degnerating. First you have natural selection - which is essentially a weeding out process. Then you have mutations, which are all either neutral or deleterious. Thus, to go from the simple to the complex is not only unlikely - it's impossible. Indeed, all we see in this world is extinction. There are no new forms of life emerging. We are all headed downhill. This contradicts the basic dogma of evolutionists. Life is not gaining complexity or creating new information....it's in a state of rapid decay and decline. \n \n And it's happening quickly! Ever notice how many people are on Depression drugs nowdays? You think this is an accident? We know that the environement (ie..what one eats, the air one breathes) can turn genes on or off....and we know our diets are getting worse and our air and water is getting more polluted. We also know through epigenetics that diseases run in families and are inherited. Thus, there is no other way to go than down. This is why many kids nowdays are born with Adhd or childhood depression. In my opinion it's the result of our previous generations' declining quality of diet. It's a result of Dr. Pepper, Cheetos, microwave popcorn, macaroni and cheese, hot dogs, pretzels, gum drops, high fructose corn syrup, flavors, colorings, transfats etc etc etc....... And it's getting worse fast...genetic damage is accumulating in society. The medical establishment is not doing us any favors, either, by merely treating the symptoms.\n \n Evolutionists like to think that Selection can reverse the effects of biological decay. They've argued this for decades. But since selection works on the level of the whole organism, it cannot stop the loss of information due to mutation. It's like trying to fix a broken-down tv set with a hammer. How can you attempt to explain the appearance of something by the dissapearance of others? There are millions of cars on the road - and many of them will die and/or become unusable. Does this explain the origin of cars or make cars new or better?\n \n Besides that, selection on the individual level is completely random and thus impotent. Every human I know is able to breed. And thus, breeding becomes more of a random lottery than something that's based on genetic superiority or fitness. This flies in the face of evolutionists' thinking. (Does anyone know of someone who is unable to breed?)\n \n Some evolutionists try to claim that life can indeed climb upward by saying that the organism can draw energy from its environment - which would enable it to defy the downhill slide of degneration. But the problem is that Neo-darwinists claim that DNA is in complete isolation and goes on its merry way, regardless of any pressures and effects of the environment. Thus, they cannot claim this.\n \n Anyone who looks at this situation logically should realize that at sometime in the past there must have been a time when there was less genetic damage in the genome. - and thus, longer lives. Can anyone think of time that this may have happened? I can! The Bible reports there was a time in the history of humans that lifespans were incredibly long. According to Genesis people lived to over 900 years old. \n \n I believe God created Adam genetically superior - yet after sin entered the world - and after his offspring began inbreeding with close relatives, the long march of unending genetic degeneration via mutations started occuring. (check this decay curve out!)\n \n http://www.biblestudy.org/basicart/longpatr.html\n \n Afterwards, due to a diet of breads, deserts, cooked foods, sweets and toxicity, humans have been degenerating ever since. There is no way to stop this. Our species is dying. Information is weaking....genomes are decaying. If it were not for the internal mechanisms we have in our bodies for controlling the frequency of mutations, extinction of the human race would come quickly.\n \n But this fact of degeneration is quite lethal to evolutionists. Not only does it make their wild ideas for the origin/evolution of life improbable - it makes them IMPOSSIBLE.\n \n Common sense says that if we are all on a downhill slide that mutation/selection - being the conservative/degenerative devicees that they are -- could have never have explained the origin of anything. Our genomes could not have arisen spontaneously. Instead, our genomes were designed by a designer.\n \n Evolutionists claim we came from the inferior to become more complex....but it's just the opposite - we started out more complex and are becoming inferior.\n \n If you think I'm nuts, then check this site out....(this is fascinating! -- and DEADLY to evolutionists.)\n \n http://www.aramaicpeshitta.com/Cool/evolution.htm\n \n It destroys the theory of evolution. Plain and simple\n __________________\n Our standard expectation of evolution -- slow, steady, gradual improvement, hence change, through time -- is indeed a myth. Niles Eldredge", 
   {
    "post_info": {
     "post_title": "Simple disproof for Evolution"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1159720500.0
  ], 
  [
   233186, 
   null, 
   "pandion", 
   "[snip] of unsupported, rambling assertion.\nNothing but unfounded assertion. No evidence at all. Just wishing and hoping. If it were not so pathetic it would be funny.", 
   {}, 
   233178, 
   null, 
   1159722600.0
  ], 
  [
   233195, 
   null, 
   "johnhanks", 
   "\n If you think I'm nuts, then check this site out....(this is fascinating! -- and DEADLY to evolutionists.)\n \n http://www.aramaicpeshitta.com/Cool/evolution.htm\n \n It destroys the theory of evolution. Plain and simple\n\n I checked it out. It's the feeblest site you've linked to yet.\n \nBut on the general relation of Mendelism to Evolution I have come to a very definite conclusion ... the essence of Mendelian characters is their rigidity. They are transmitted without variation, and therefore, except by the rarest of accidents, can never become adapted to ever varying conditions. \n\n In other words, the author seems to think that because Mendel didn't know about genes mutating, we must continue to believe they don't.\n \n Complete and utter nonsense from beginning to end.", 
   {
    "unicode_changes_made": true
   }, 
   233178, 
   null, 
   1159726320.0
  ], 
  [
   233196, 
   null, 
   "Shooterandproud", 
   "Its also crazy how badly Creationism can be disproved. Way more so than evolution. Its funny how creationists try to disprove Evolution, yet they never try to prove creationism.", 
   {}, 
   233195, 
   null, 
   1159728240.0
  ], 
  [
   233197, 
   null, 
   "trebor", 
   "\n \n http://www.aramaicpeshitta.com/Cool/evolution.htm\n \n It destroys the theory of evolution. Plain and simple\n __________________\n Our standard expectation of evolution -- slow, steady, gradual improvement, hence change, through time -- is indeed a myth. Niles Eldredge\n\n \n \n Tell me, how does a link to a religious nut who thinks the New Testament was first written in Aremic , despite tons of evidence to the contrary, have anything to do with refuting the scientific theory of evolution?", 
   {}, 
   233178, 
   null, 
   1159728240.0
  ], 
  [
   233244, 
   null, 
   "Hi_Its_Me", 
   "Evolution is able to be disproven in so many ways....here's a simple, lethal disproof:\n \n Ever since Darwin came along, evolutionists have claimed that the human race is evolving. We supposedly evolved from simplistic monkeys to what we are today. They think we all built up from one-celled organisms to the physiological works of art that we are today. But I suggest just the opposite is actually happening.\n\n Ok, now show your evidence. If you have any, that is.\n \nJust like individuals age over time, so does our species. We are not evolving, but devolving. Our world is rolling downhill like a giant bolder rolling down a mountainside.\n\n Standard 2LOT argument? Find some evidence that isn't just hypotheses.\n \nHumans have an average life expectancy of 70-75 years...with a maximum of around 120. But what happens if a man marries his first cousin? It has been shown that life expectancy of such offspring diminishes by 10 years. This is because of the large number of genetic mistakes that happen within the genome - which essentially ages the individual.\n\n How about the individual's offspring? Is a \"subtract 10 years\" gene encoded in the genome just because of one marriage?\n Still no evidence.\n \nTo me, inbreeding is seems to foreshadow where we are headed in society.\n\n Evidence? I didn't think so.\n \nWe are going downhill genetically. This is true for individuals and this is true for the population. And the reason for this is because humans are consistently deteriorating and degenerating from the high rate of mutations.\n\n Helpful mutations\n \nIf you think about it, every phsyical cause or mechanism of evoution is either conservative or degnerating [sic]. First you have natural selection - which is essentially a weeding out process.\n\n It is both conservative and helpful, depending on the situation. An explanation is available upon request.\n \nThen you have mutations, which are all either neutral or deleterious.\n\n Or helpful.\n \nThus, to go from the simple to the complex is not only unlikely - it's impossible.\n\n So the impossible has happened? Actually, I think it is possible. Look it up if you don't think so.\n \nIndeed, all we see in this world is extinction.\n\n And speciation, and television programs... The list is longer than that.\n \nThere are no new forms of life emerging.\n\n Wrong.\n \nWe are all headed downhill. This contradicts the basic dogma of evolutionists. Life is not gaining complexity or creating new information....it's in a state of rapid decay and decline.\n\n See above.\n \nAnd it's happening quickly! Ever notice how many people are on Depression drugs nowdays? You think this is an accident? We know that the environement (ie..what one eats, the air one breathes) can turn genes on or off....and we know our diets are getting worse and our air and water is getting more polluted. We also know through epigenetics that diseases run in families and are inherited. Thus, there is no other way to go than down.\n\n This is where natural selection occurs: people who can better survive diseases survive more (obviously, I hope). Also, until recently, the average life expectancy was getting higher. At the time of the pharoahs, 30-40 years was normal. How is 70 or more less than 40?\n \nThis is why many kids nowdays are born with Adhd or childhood depression. In my opinion it's the result of our previous generations' declining quality of diet.\n\n Better is worse? See above.\n \nIt's a result of Dr. Pepper, Cheetos, microwave popcorn, macaroni and cheese, hot dogs, pretzels, gum drops, high fructose corn syrup, flavors, colorings, transfats etc etc etc....... And it's getting worse fast...genetic damage is accumulating in society. The medical establishment is not doing us any favors, either, by merely treating the symptoms.\n\n Also, the world has ended and you are just in denial.\n We don't need random assertions, so support your claims!\n \nEvolutionists like to think that Selection can reverse the effects of biological decay. They've argued this for decades.\n\n True.\n \nBut since selection works on the level of the whole organism, it cannot stop the loss of information due to mutation. It's like trying to fix a broken-down tv set with a hammer.\n\n A broken-down tv set is not a valid parallel. It doesn't reproduce, and there is only one of it. Life, on the other hand, does reproduce (at least some organisms do).\n It would be interesting for someone to make a counter displaying the number of times natural selection needs to be explained to creationists.\n Actually, that would be easy: infinity. They just don't get it.\n \nHow can you attempt to explain the appearance of something by the dissapearance of others?\n\n Natural Selection (plus genetic variation).\n \nThere are millions of cars on the road - and many of them will die and/or become unusable. Does this explain the origin of cars or make cars new or better?\n\n No- cars don't reproduce. If you think they do (I wouldn't be surprised at this point), go away. Alternatively, do some research (not that you would pick the second option).\n \nBesides that, selection on the individual level is completely random and thus impotent.\n\n No- things that are less adapted reproduce less.\n \nEvery human I know is able to breed.\n\n How about people who don't live in a well-developed country? They can't get treatment for all of their diseases.\n \nAnd thus, breeding becomes more of a random lottery than something that's based on genetic superiority or fitness. This flies in the face of evolutionists' thinking. (Does anyone know of someone who is unable to breed?)\n\n People who are sterile can't breed.\n \nSome evolutionists try to claim that life can indeed climb upward by saying that the organism can draw energy from its environment - which would enable it to defy the downhill slide of degneration.\n\n Yes, you are talking about the 2LOT. Not the standard definition either, but the argument that \"order can't arise from disorder\".\n Actually, which part of the 2LOT are you talking about? Your argument isn't coherent.\n \nBut the problem is that Neo-darwinists claim that DNA is in complete isolation and goes on its merry way, regardless of any pressures and effects of the environment. Thus, they cannot claim this.\n\n You are very confused. In particular, you are confused about the 2LOT and evolution (and science, too).\n \nAnyone who looks at this situation logically should realize that at sometime in the past there must have been a time when there was less genetic damage in the genome. - and thus, longer lives. Can anyone think of time that this may have happened? I can! The Bible reports there was a time in the history of humans that lifespans were incredibly long. According to Genesis people lived to over 900 years old.\n\n According to Genesis? Why are you trying to present that as scientific evidence? Should I present The DaVinci Code as scientific evidence? How about Darwin's On the Origin of the Species?\n \nI believe God created Adam genetically superior - yet after sin entered the world - and after his offspring began inbreeding with close relatives, the long march of unending genetic degeneration via mutations started occuring. (check this decay curve out!)\n \n http://www.biblestudy.org/basicart/longpatr.html\n\n Personally, I believe that god doesn't exist, and I have a link, too!\n By the way, sorry for all the links, but I have found that since creationism has been so well refuted elsewhere, I don't have to do too much work. It also helps that I'm presenting evidence, right?\n \nAfterwards, due to a diet of breads, deserts, cooked foods, sweets and toxicity, humans have been degenerating ever since. There is no way to stop this. Our species is dying. Information is weaking....genomes are decaying. If it were not for the internal mechanisms we have in our bodies for controlling the frequency of mutations, extinction of the human race would come quickly.\n\n More assertions. Look at the \"helpful mutations\" link.\n \nBut this fact of degeneration is quite lethal to evolutionists. Not only does it make their wild ideas for the origin/evolution of life improbable - it makes them IMPOSSIBLE.\n\n Well, the degeneration point is weak, and you should know that the \"origin\" angle is also quite weak.\n \nCommon sense says that if we are all on a downhill slide that mutation/selection - being the conservative/degenerative devicees that they are -- could have never have explained the origin of anything. Our genomes could not have arisen spontaneously. Instead, our genomes were designed by a designer.\n\n You believe two things that are incorrect: that you have refuted evolutionary theory, and that we will now accept intellegent design because of your attempt.\n \nEvolutionists claim we came from the inferior to become more complex....but it's just the opposite - we started out more complex and are becoming inferior.\n\n Another unfounded assertion.\n \nIf you think I'm nuts, then check this site out....(this is fascinating! -- and DEADLY to evolutionists.)\n \n http://www.aramaicpeshitta.com/Cool/evolution.htm\n \n It destroys the theory of evolution. Plain and simple\n\n Because no new information is added to the genome? Well, it's wrong, but interesting.\n It didn't change whether I thought you were nuts.\n \nOur standard expectation of evolution -- slow, steady, gradual improvement, hence change, through time -- is indeed a myth. Niles Eldredge\n\n I googled your signature, and I found this just before your quote mine: \"Some of the most mythic of scientific notions lie in the realm of evolutionary biology. Evolution - the proposition that all organisms are related - is as highly verified a thesis as can be found in science. Subjected to close scrutiny from all angles for over a century now, evolution emerges as the only naturalistic explanation we have of the twin patterns of similarity and diversity that pervade all life. The basic notion that life has evolved is as certain as the existence of gravity or the idea that the earth is spheroidal. We call such highly verified notions \"facts\" when they consistently escape all attempts to prove them false. Evolution is no myth.\"\n \n Finally, please present evidence.", 
   {
    "unicode_changes_made": true
   }, 
   233178, 
   null, 
   1159746480.0
  ], 
  [
   233257, 
   null, 
   "pandion", 
   "I was busy earlier and didn't have time to give more than a short laugh at supersnort's post. Hi_its_me has now done such a nice job in responding that there is little else to say, so I'll just make a couple of comments.\n \nWe supposedly evolved from simplistic monkeys to what we are today.\nEither a gross misunderstanding or a gross misrepresentation of evolutionary theory.\n \nWe are not evolving, but devolving.\nMore misunderstanding of evolutionary theory. This implies that evolution is some kind of progress. That idea is the reason that Darwin objected to the use of the word \"evolution\" in reference to his theory. Evolution is genetic change in populations over time.\n \nOur world is rolling downhill like a giant bolder [sic] rolling down a mountainside.\nTerrible analogy. Thermodynamics is not like a boulder rolling down a mountain.\n \nBut what happens if a man marries his first cousin? It has been shown that life expectancy of such offspring diminishes by 10 years.\nWhere has this been shown? Darwin did marry his first cousin and his offspring didn't seem the worse for wear. Two of his sons were knighted (Sir George Darwin, F.R.S., and Sir Francis Darwin, F.R.S.) and they lived to be 67 and 77, quite respectable ages for their time. Sir George was a mathematician and astronomer and Sir Francis was botanist. Notice that both were fellows of the Royal Society, a distinction achieved by only the most respected of scientists.\n \n Additionally, supersnort doesn't seem to be aware that all of our domestic animals were produced by inbreeding. That's why they are called \"pure breed\" or \"thoroughbred\".\n \n And then there is the case of the Hawaiian royal family. When Europeans first got to Hawaii they found that the royal family was easily recognized because they were taller and more robust than other Hawaiians. The reason was that royals always married royals and that children with any imperfections were killed at birth.\n \n Doesn't speak too well for your \"hypothesis.\"\n \nFirst you have natural selection - which is essentially a weeding out process.\nNo. Differential reproductive success.\n \nThen you have mutations, which are all either neutral or deleterious.\nWrong again. Some are beneficial. Is this another failure to grasp the basics or another misrepresentation?\n \nLife is not gaining complexity or creating new information....\nPlease define complexity. Please define information. Both definitions should be relevant to biology. \n \nIt's a result of Dr. Pepper, Cheetos, microwave popcorn, macaroni and cheese, hot dogs, pretzels, gum drops, high fructose corn syrup, flavors, colorings, transfats etc etc etc.......\nMake up your mind. Is it because of diet or is it because of evolution. It would be nice if you pick a horse and ride it.\n \nThere are millions of cars on the road - and many of them will die and/or become unusable. Does this explain the origin of cars or make cars new or better?\nCars don't breed. Or didn't you know that?\n \nBesides that, selection on the individual level is completely random...\nActually, it's not. Mutations are random. Selection is differential reproductive success.\n \n...breeding becomes more of a random lottery than something that's based on genetic superiority or fitness. This flies in the face of evolutionists' thinking.\nActually quite incorrect. One of the signs that evolution by means of natural selection is occurring is when changes in genetic makeup takes place in randomly mating populations. It seems that you have been influenced by Hitler and his breeding programs.\n \nSome evolutionists try to claim that life can indeed climb upward by saying that the organism can draw energy from its environment - which would enable it to defy the downhill slide of degneration [sic].\nPlease define \"climb upward\" and \"downhill slide\" in biologically meaningful terms. Please define \"degeneration.\"\n \nBut the problem is that Neo-darwinists claim that DNA is in complete isolation and goes on its merry way, regardless of any pressures and effects of the environment.\nMisunderstanding or misrepresentation? Biologists and geneticists do not claim that DNA is isolated from the environment. We are well aware that the environment can cause mutations under many conditions (cosmic radiation, x-ray, etc.). What is denied is that mutations are environmentally directed - in other words, exposure to cosmic radiation will not cause a mutation that will make the organism resistant to cosmic radiation. The mutations will be random.\n \n On the other hand, natural selection IS, by definition, the response of populations to their environment. The environment has been shown to have effects on DNA, i.e., the genome of the population.\n \nThe Bible reports there was a time in the history of humans that lifespans were incredibly long. According to Genesis people lived to over 900 years old.\nHow is mythology relevant?\n \nI believe God created Adam genetically superior\nYet more mythology. Do you have any evidence for your assertions?\n \nIf you think I'm nuts, then check this site out....(this is fascinating! -- and DEADLY to evolutionists.)\nSince you bring it up, I do think that you are a nut. But your site is even nuttier. Not one shred of evidence that I found - just assertion. Moreover, the author doesn't seem to know the difference between an hypothesis and a theory.\n \nOur standard expectation of evolution -- slow, steady, gradual improvement, hence change, through time -- is indeed a myth. Niles Eldredge\nOut of context, and therefore misunderstood, quote.", 
   {
    "unicode_changes_made": true
   }, 
   233178, 
   null, 
   1159752000.0
  ], 
  [
   233263, 
   null, 
   "supersport", 
   "you guys are a riot...all that nonsense and you cannot disprove that life is devolving -- which was the point of the whole post. Even talkorigins admits that most every mutation is a destructive thing. By the way, just because mutations are helpful does not mean they are destructive to the genome. see epistasis.\n \n and Hi it's me....I find it truly hilarious that you are asking for any evidence -- since you can show NOTHING!\n \n http://www.harvardmagazine.com/on-line/0103109.html\n \n A genome, the complete collection of an organism's genes, is plastic, Hofmann contends. The environment-even social and cultural contexts-can switch genes on and off\n \n This link just showed more evidence for my theory than you could ever show for yours.\n \n You've got nothin'!!!", 
   {
    "unicode_changes_made": true
   }, 
   233257, 
   null, 
   1159753800.0
  ], 
  [
   233274, 
   null, 
   "Hi_Its_Me", 
   "you guys are a riot...all that nonsense and you cannot disprove that life is devolving -- which was the point of the whole post.\n\n In this case, I will present the Theory of Evolution by Natural Selection as evidence that life is evolving. As the evidence has been shown to support it, you are the person who should be presenting evidence. Currently, your assertion that organisms are \"devolving\" because of mutations has been shown to be faulty.\n \nEven talkorigins admits that most every mutation is a destructive thing.\n\n Those are removed from the gene pool by natural selection. The other mutations stay in the pool.\n Pandion: we are making progress- he admits that mutations can be helpful.\n \nBy the way, just because mutations are helpful does not mean they are destructive to the genome. see epistasis.\n\n I agree. Did you mean that?\n \nand Hi it's me....I find it truly hilarious that you are asking for any evidence -- since you can show NOTHING!\n\n What do you want evidence for? Helpful mutations? The theory that life evolves? I believe that I have provided enough evidence.\n \nhttp://www.harvardmagazine.com/on-line/0103109.html\n \n A genome, the complete collection of an organism's genes, is plastic, Hofmann contends. The environment-even social and cultural contexts-can switch genes on and off\n \n This link just showed more evidence for my theory than you could ever show for yours.\n \n You've got nothin'!!!\n\n We accept plasticity, but we do not accept that plasticity can account for what has been attributed to mutations and natural selection. It has only been observed to change minor phenotypes (shell thickness, type of bee).\n By the way, you have contended before that plasticity can cause a fish to change in response to predators (which benefits the fish). Now, you are trying to say that life doesn't evolve or change in any beneficial way.\n \n Cite your sources and make up your mind!", 
   {
    "unicode_changes_made": true
   }, 
   233263, 
   null, 
   1159756500.0
  ], 
  [
   233322, 
   null, 
   "electrolyte", 
   "It would be nice if you pick a horse and ride it.\n\n He's doing his best Jesus impression; remember when Jesus rode into Jerusalem on the backs of two asses?", 
   {}, 
   233257, 
   null, 
   1159767960.0
  ], 
  [
   233457, 
   null, 
   "pandion", 
   "He's doing his best Jesus impression; remember when Jesus rode into Jerusalem on the backs of two asses?\nThat reminds me of the discussion I got into on a \"christian\" board when I referred to a particular pompous XXX as a pompous XXX. I was banned for a week for using profane language. Pointing out that an XXX is an animal and that my remark made sense only in that light was fruitless. My answer was to demand that they ban some versions of the Bible because they told of how Abraham tied his XXX to a tree and Jesus sat on his XXX in Jerusalem. Didn't phase them. They also ignored without comment references to Judge Roy Moore's monumental erection in the rotunda of the Alabama Supreme Court building. Yanking fundy chains can be so much fun sometimes.", 
   {}, 
   233322, 
   null, 
   1159839540.0
  ], 
  [
   233622, 
   null, 
   "Hi_Its_Me", 
   "That reminds me of the discussion I got into on a \"christian\" board when I referred to a particular pompous XXX as a pompous XXX. I was banned for a week for using profane language. Pointing out that an XXX is an animal and that my remark made sense only in that light was fruitless. My answer was to demand that they ban some versions of the Bible because they told of how Abraham tied his XXX to a tree and Jesus sat on his XXX in Jerusalem. Didn't phase them. They also ignored without comment references to Judge Roy Moore's monumental erection in the rotunda of the Alabama Supreme Court building.\n\n That is what supersport is hoping to do... However, assuming that you are correct in your interpretation, he has no chance of doing it so well.\n \nYanking fundy chains can be so much fun sometimes.\n\n Quite true. This is pretty funny.", 
   {}, 
   233457, 
   null, 
   1159935000.0
  ], 
  [
   233664, 
   null, 
   "pandion", 
   "...you cannot disprove that life is devolving...\nA nonsensical concept. Genetic change is genetic change. Evolutionary theory doesn't contain any concept of progress. Only scientific illiterate creationists try to insist that it does.", 
   {}, 
   233263, 
   null, 
   1159971900.0
  ], 
  [
   233684, 
   null, 
   "Master_Shake", 
   "I can't believe that SS is still at this ;)", 
   {}, 
   233664, 
   null, 
   1159981440.0
  ], 
  [
   233706, 
   null, 
   "DrNo", 
   "Supersport, do you believe in a Creator that purposely doomed human beings to inevitable genetic destruction? After all, if what you claim is true, human beings have no choice but to \"devolve.\"", 
   {}, 
   233684, 
   null, 
   1159991520.0
  ], 
  [
   233720, 
   null, 
   "supersport", 
   "Supersport, do you believe in a Creator that purposely doomed human beings to inevitable genetic destruction? After all, if what you claim is true, human beings have no choice but to \"devolve.\"\n\n \n Yea...I'd say we're on a downhill slide. Do you agree with TalkOrigins that most mutations (like 99%) lose information, lose specificity? Mutations are destructive entities. They demolish and break down what was there. Granted some of these may be beneficial but ulitmately the gene has lost information. And since selection works on the level of the whole organism, it cannot stop the loss of information on the molecular level. Not only that, but natural selection has an I.Q. of exactly zero -- as do random mutations -- so I believe the only way for the genome to go is downward. And if the only way for the genome to go is downward, then common sense says that neodarwinism is wrong. It's not just unlikely...it's not just improbably -- it's dead wrong and the whole hypothesis must be rejected.", 
   {}, 
   233706, 
   null, 
   1160002260.0
  ], 
  [
   233723, 
   null, 
   "electrolyte", 
   "Granted some of these may be beneficial but ulitmately the gene has lost information.\n\n Define information in a biologically meaningful way.\n \n You won't, because as soon as you pick one, we'll refute the claim.", 
   {}, 
   233720, 
   null, 
   1160003940.0
  ], 
  [
   233736, 
   null, 
   "trebor", 
   "Yea...I'd say we're on a downhill slide. Do you agree with TalkOrigins that most mutations (like 99%) lose information, lose specificity? Mutations are destructive entities. They demolish and break down what was there. Granted some of these may be beneficial but ulitmately the gene has lost information. And since selection works on the level of the whole organism, it cannot stop the loss of information on the molecular level. Not only that, but natural selection has an I.Q. of exactly zero -- as do random mutations -- so I believe the only way for the genome to go is downward. And if the only way for the genome to go is downward, then common sense says that neodarwinism is wrong. It's not just unlikely...it's not just improbably -- it's dead wrong and the whole hypothesis must be rejected.\n\n \n \n No. THat is not true at all. Talkorgins says no such thing. Maybe I am wrong, but let's see you link to a page on talkorgins that says that... that isn't a list of 'this is a fundy claim', and refutes it that is.", 
   {}, 
   233720, 
   null, 
   1160012280.0
  ], 
  [
   233741, 
   null, 
   "pandion", 
   "Yea...I'd say we're on a downhill slide.\nPlease define \"downhill\" and \"slide\" in a meaningful way in the context of evolutionary biology.\n \nDo you agree with TalkOrigins that most mutations (like 99%) lose information, lose specificity?\nWhere at talk origins does it say that? Please define \"information\" and \"specificity\" in a meaningful way in the context of evolutionary biology. In fact, please define mutation - oh, never mind. I'll do it for you. A mutation is an alteration of genetic material that gives rise to a new allele or haplotype. Please explain how a mutation in a single organism that creates a new allele or haplotype that did not previously exist in the genome of the population is a loss of information.\n \nMutations are destructive entities. They demolish and break down what was there.\nNonsense. They change what was there in a single organism in the population.\n \nGranted some of these may be beneficial but ulitmately the gene has lost information. And since selection works on the level of the whole organism, it cannot stop the loss of information on the molecular level.\nAnd since you admit that some mutations may be beneficial, you have admitted that evolution is possible. So now you are declaring that a beneficial mutation is a loss of information. Besides, even if it is true that selection works at the level of the organism, evolution works at the level of the population. However, Dawkins would disagree with you since his concept of the selfish gene is about selection working at the level of the gene.\n \n Now, explain the following to me. Suppose that in a large population a single point mutation occurs in a single gene in a single individual. Suppose that it creates an allele of a gene that does not exist in the genome of the population. The result would be an allele that doesn't exist in that population. How is that a decrease in information? Now suppose that for some reason, that single individual does not survive to reproduce. The result would be to return the genome to the previous state. So, by your logic, the following has happened. A mutation that created a new allele has caused a loss of information in the genome. Then when the organism dies without reproducing, the loss of that allele is an increase in information. Can you elaborate on that for me so that I can understand. Don't forget to define information first.\n \nNot only that, but natural selection has an I.Q. of exactly zero\nKinda like some creationists?\n \n-- as do random mutations -- so I believe the only way for the genome to go is downward.\nWho cares what you believe. What does IQ have to do with changes in the allele frequency of a population over time?\n \nAnd if the only way for the genome to go is downward, then common sense says that neodarwinism is wrong. It's not just unlikely...it's not just improbably -- it's dead wrong and the whole hypothesis must be rejected.\nand common sense says that if you are wrong, then your whole bunch a babble is nonsense. You have made assertions without support. Not one bit of evidence in support of anything you have said.", 
   {}, 
   233720, 
   null, 
   1160014440.0
  ], 
  [
   233742, 
   null, 
   "pandion", 
   "My bet is that SS cannot and will not support his assertion that Talk Origins says that 99% of mutations are harmful. He will just start another thread and post more of his simpleton claims without supporting a single one.", 
   {
    "post_info": {
     "post_title": "Dollars to donuts..."
    }
   }, 
   233741, 
   null, 
   1160014560.0
  ], 
  [
   233757, 
   null, 
   "Hi_Its_Me", 
   "Yea...I'd say we're on a downhill slide. Do you agree with TalkOrigins that most mutations (like 99%) lose information, lose specificity?\n\n No. If it says that, I would have to say that it is wrong. \n If a mutation occurs, and it causes an organism to lose \"information\" (I interpreted that as a shortened DNA sequence), and this change is not beneficial, the new organism will die. The population will be largely unaffected, because one organism died and a harmful mutation died with it.\n A helpful mutation, however, whether it \"adds\" or \"subtracts\" \"information,\" will probably survive. A \"downward slide\" is very unlikely if it requires less adapted organisms to survive.\n \nMutations are destructive entities. They demolish and break down what was there. \n\n So all mutations take random chunks out of a DNA sequence? Actually, they simply change one or two neucleotides.\n \nGranted some of these may be beneficial but ulitmately the gene has lost information. \n\n A change is not the same as a deletion.\n \nAnd since selection works on the level of the whole organism, it cannot stop the loss of information on the molecular level. \n\n \"Information\" is not being lost anyway, but if one organism had molecules with less \"information\", and this was harmful, it would die and the loss of \"information\" would be lost.\n \nNot only that, but natural selection has an I.Q. of exactly zero -- as do random mutations -- so I believe the only way for the genome to go is downward. \n\n I believe that you should not apply a human statistical value to inanimate objects or processes (such as gravity). If I stated that because gravity had no IQ, would that mean that objects fall upwards or sideways? No.\n Natural selection is a well-defined process that states, in essence, that organisms that are better adapted to reproduce will reproduce more. This will cause an increase in the population of better adapted organisms.\n \nAnd if the only way for the genome to go is downward, then common sense says that neodarwinism is wrong. It's not just unlikely...it's not just improbably -- it's dead wrong and the whole hypothesis must be rejected.\n\n So we don't know if common sense says that \"neodarwinism\" is wrong. This is because the only way for the genome to \"go\" is not downward. Simple logic.\n \n Well, we have advanced a few steps towards the number of times natural selection must be explained to creationists (infinity).", 
   {}, 
   233720, 
   null, 
   1160018400.0
  ], 
  [
   234188, 
   null, 
   "obvious_child", 
   "My bet is that SS cannot and will not support his assertion that Talk Origins says that 99% of mutations are harmful. He will just start another thread and post more of his simpleton claims without supporting a single one.\n\n \n Well yes. SS cannot argue a honest point much less a scientific one. He'll just load another round into his shotgun. Furthermore we all know he can't defend his own beliefs. I;d ask him to post on the flood but I know he won't.", 
   {}, 
   233742, 
   null, 
   1160345700.0
  ], 
  [
   236409, 
   null, 
   "SLP", 
   "It is amazing, Supertroll - \n \n I have seen this exact, same post - from you , of course - on at least 3 other forums!\n \n Trying to spread the filth, are we?", 
   {}, 
   233178, 
   null, 
   1161735000.0
  ], 
  [
   236413, 
   null, 
   "SLP", 
   "Yea...I'd say we're on a downhill slide. Do you agree with TalkOrigins that most mutations (like 99%) lose information, lose specificity?\n\n \n I already asked you on CF (and got no answer, of course), but please define \"information\" and \"specificity\" for us - then of course cite TO on where it was written that 99% of mutations \"lose information, lose specificty\".\n \n \n You see, supertroll, you might be able to get away with making XXXX up on creationist forums - heck, most of the creationists posting in such places will do the same AND believe anything another creationist writes no matter what - but please do not expect ALL people to be ignornat, gullible rubes.", 
   {}, 
   233720, 
   null, 
   1161735240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Simple disproof for Evolution", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8978-simple-disproof-evolution.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 8978, 
  "discussion_files": [
   [
    "10845.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8978-simple-disproof-evolution-print.html"
   ], 
   [
    "10846.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8978-simple-disproof-evolution-2-print.html"
   ]
  ], 
  "identifier": 8978
 }
]