[
 [
  [
   233340, 
   null, 
   "hero of the day", 
   "Mikheil Saakashvili is trying to draw Poland into solving his problems with Russia. It's well-known that spy scandal he has held phone conversations with presidents of Lithuania, Poland and Ukraine in hope to get their support. And he has got this support. I guess this means Poles may be sent to that Georgia as kind of peacekeepers. Our guys will die not only in Iraq and Afghanistan but in Caucasus too. \n But in the Caucasus it's going to be really tough. This crazy man Saakashvili will draw us into one more war. Sorry, USA will draw us because of it's well-known that Georgia is the most pro-American country which blindly follows US' order. Moreover I'm sure that Saakashvili's attempt to unleash the war in Caucasus was dictated by Washington. Look, we sent our troops to Iraq and Afghanistan but Americans are forcing us to take part in Caucasus war!\n I think that Lech Kaczynski don't know what it's look like to fight against mountaineers. Not only that they are trying to take prisoner for ransom and malicious insults but they will sneer at dead body of war prisoners for a long time. And we will know about it war begins. I hope we have a time to stop it or refuse from participation. Unless it's late we must distance ourself from Saakashvili.", 
   {
    "post_info": {
     "post_title": "Mikheil Saakashvili is trying to draw Poland into solving his problems with Russia"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1159805940.0
  ], 
  [
   233944, 
   null, 
   "Meteor", 
   "Georgia is losing $ milliards as a result of conflict with Russia provoked by Saakashvili. I think that USA which is trying to lead us by democratic way accounts for our problems greatly and have to offset all disadvantages for Georgian people.\n Thanks to Georgian officials policy simple citizens can't leave to Russia in search of a job. Unfortunately I think that Russia's sanctions are clear and warrantable. But our officials are continuing to hold this unprofitable politic line instead of fix situation; I'm sure that Russia will help us; look, we are brotherhood nations! \n During last year we lost the market of our vine, mineral water and fruits. In addition to it as a result of Saakshvili's policy in Russia stopped to close eyes at the facts of breaking the law by Georgian businessmen. We are losing our return because of Saakashvili and his team who listening US advisers! One says that Saakashvili and his followers are getting wages from USA but I can't to feed my family because of I have got money from relatives who worked in Russia. It's well-known that it's too hard to find job in Tbilisi. But now we lost it income as a result of Saakashvili's position! Who will help us? Our government? Never! Americans who pushed Saakashvili here have to pay for our hard fate! It's clear that during Saakshvili's ruling Georgia didn't get something better - problems only! It will be better to organize new nettle revolution and kick Saakashvili and his pilferers out with shame from Georgia!", 
   {
    "unicode_changes_made": true
   }, 
   233340, 
   null, 
   1160149800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mikheil Saakashvili is trying to draw Poland into solving his problems with Russia", 
  "url": "http://www.4forums.com/political/current-events-debates/8983-mikheil-saakashvili-trying-draw-poland-into-solving-his-problems-russia.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 8983, 
  "discussion_files": [
   [
    "22866.html", 
    "http://www.4forums.com/political/current-events-debates/8983-mikheil-saakashvili-trying-draw-poland-into-solving-his-problems-russia-print.html"
   ]
  ], 
  "identifier": 8983
 }
]