[
 [
  [
   11, 
   null, 
   "admin", 
   "Do you believe Legalized Abortion has lowered the Crime Rate ?\n \n http://www.youdebate.com/DEBATES/abortion_crime.HTM", 
   {
    "post_info": {
     "post_title": "Abortion and Crime"
    }
   }, 
   null, 
   null, 
   1043620920.0
  ], 
  [
   208, 
   null, 
   "ghettocracka", 
   "i dont see the link between the two", 
   {}, 
   11, 
   null, 
   1043876880.0
  ], 
  [
   242, 
   null, 
   "thistownwilleat", 
   "Killing 200,00 children a year certainly reduces crime. Most assuredly some would be criminals, but some would most assuredly be genius, presidents, doctors, inventors, missionaries, Martin Luther King's and Mother Teresa's.", 
   {}, 
   11, 
   null, 
   1043898660.0
  ], 
  [
   566, 
   null, 
   "Parcum", 
   "Oh yeah, the crime has lowered... why? Because 1.2 million of murders commited every year are not considered \"crime\".", 
   {}, 
   11, 
   null, 
   1044179820.0
  ], 
  [
   3020, 
   null, 
   "Crim", 
   "We don't need any more Mother Teresas.", 
   {}, 
   11, 
   null, 
   1046057220.0
  ], 
  [
   3045, 
   null, 
   "thistownwilleat", 
   "Why not?", 
   {}, 
   11, 
   null, 
   1046062620.0
  ], 
  [
   3049, 
   null, 
   "Crim", 
   "I don't find Mother Teresa to be a particularly impressive individual.", 
   {}, 
   11, 
   null, 
   1046063100.0
  ], 
  [
   3050, 
   null, 
   "sarablaze", 
   "There are murders linked to not having abortions. An old roommate of mine lost her 17 year old daughter that way. She was messing around with her boss, who was 31, and she got pregnant. She did not want to get an abortion, so he killed her in a horrifying way. Actually, I also use to know someone who had a 15 year old daughter that got killed for the same reason. Any way, I think that was what they were reffering to.", 
   {}, 
   11, 
   null, 
   1046063220.0
  ], 
  [
   3063, 
   null, 
   "Calligirl", 
   "If abortion was made illegal, it would definitely raise the crime rate. Abortion would finally be considered murder.\n \n Crim:\n Giving food and medical care to the poor, hungry, and the needy. Changing people's lives. Mother Theresa wasn't very impressive was she?", 
   {}, 
   11, 
   null, 
   1046064840.0
  ], 
  [
   3067, 
   null, 
   "Crim", 
   "Yeah, the worst medical care possible. Despite recieving millions in donations, Mother Teresa put no money into her facilities. She refused to give patients pain medication because she felt suffering led the people to god. She hated birth control despite living in a country where overpopulation was a huge problem.\n \n Sorry, but forcing suffering for your religion doesn't impress me.", 
   {}, 
   11, 
   null, 
   1046065200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Abortion and Crime", 
  "url": "http://www.4forums.com/political/abortion-debates/9-abortion-crime.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9, 
  "discussion_files": [
   [
    "6088.html", 
    "http://www.4forums.com/political/abortion-debates/9-abortion-crime-print.html"
   ]
  ], 
  "identifier": 9
 }
]