[
 [
  [
   234525, 
   null, 
   "foundit66", 
   "A Florida woman has been awarded $11.3 million in a defamation lawsuit against a Louisiana woman who posted messages on the Internet accusing her of being a \"crook,\" a \"con artist\" and a \"fraud.\"\n Legal analysts say the Sept. 19 award by a jury in Broward County, Fla. - first reported Friday by the Daily Business Review - represents the largest such judgment over postings on an Internet blog or message board. Lyrissa Lidsky, a University of Florida law professor who specializes in free-speech issues, calls the award \"astonishing.\"\n \n Lidsky says the case could represent a coming trend in court fights over online messages because the woman who won the damage award, Sue Scheff of Weston, Fla., pursued the case even though she knew the defendant, Carey Bock of Mandeville, La., has no hope of paying such an award. Bock, who had to leave her home for several months because of Hurricane Katrina, couldn't afford an attorney and didn't show up for the trial.\n \n \"What's interesting about this case is that (Scheff) was so vested in being vindicated, she was willing to pay court costs,\" Lidsky says. \"They knew before trial that the defendant couldn't pay, so what's the point in going to the jury?\"\n \n Scheff says she wanted to make a point to those who unfairly criticize others on the Internet. \"I'm sure (Bock) doesn't have $1 million, let alone $11 million, but the message is strong and clear,\" Scheff says. \"People are using the Internet to destroy people they don't like, and you can't do that.\"\n \n The dispute between the two women arose after Bock asked Scheff for help in withdrawing Bock's twin sons from a boarding school in Costa Rica. Bock had disagreed with her ex-husband over how to deal with the boys' behavior problems. Against Bock's wishes, he had sent the boys to the boarding school.\n \n Scheff, who operates a referral service called Parents Universal Resource Experts, says she referred Bock to a consultant who helped Bock retrieve her sons. Afterward, Bock became critical of Scheff and posted negative messages about her on the Internet site Fornits.com, where parents with children in boarding schools for troubled teens confer with one another.\n \n In 2003, Scheff sued Bock for defamation. Bock hired a lawyer, but he left the case when she no longer could afford to pay him.\n \n When Katrina hit in August 2005, Bock's house was flooded and she moved temporarily to Texas before returning to Louisiana last June. Court papers that Scheff and her attorney David H. Pollack mailed to Bock were returned to Pollack's office in Miami.\n \n After Bock didn't offer a defense, a Broward Circuit Court judge found in favor of Scheff. A jury then heard Scheff's arguments about damages. Pollack did not seek a specific amount for the harm he says Scheff's business suffered.\n \n \"Even with no opposing counsel and no defendant there, $11 million is a huge amount,\" says Pollack, adding that Scheff is considering whether to try to collect any money from Bock. \"The jury determined this was a significant enough issue. It's not just somebody's feelings are hurt; it's somebody's reputation is ruined.\"\n \n Bock says that when she moved back to her repaired house over the summer, she knew the trial was approaching but did not know the date. She says she doesn't have the money to pay the judgment or hire a lawyer to appeal it. She adds that if the goal of Scheff's lawsuit was to stifle what Bock says online, it worked. \n \n \"I don't feel like I can express my opinions,\" Bock says. \"Only one side of the story was told in court. Nobody heard my side.\"\n \n http://www.usatoday.com/news/nation/2006-10-10-internet-defamation-case_x.htm\n \n \n I post this here because of its potential first amendment ramifications...", 
   {
    "post_info": {
     "post_title": "$11.3M over defamatory Internet posts"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1160590380.0
  ], 
  [
   234530, 
   null, 
   "foundit66", 
   "Rafe Banks, a lawyer in Georgia, got involved in a nasty dispute with a client over how to defend him on a drunken-driving charge. The client, David Milum, fired Banks and demanded that the lawyer refund a $3,000 fee. Banks refused.\n Milum eventually was acquitted. Ordinarily, that might have been the last Banks ever heard about his former client. But then Milum started a blog.\n \n In May 2004, Banks was stunned to learn that Milum's blog was accusing the lawyer of bribing judges on behalf of drug dealers. At the end of one posting, Milum wrote: \"Rafe, don't you wish you had given back my $3,000 retainer?\" \n \n Banks, saying the postings were false, sued Milum. And last January, Milum became the first blogger in the USA to lose a libel suit, according to the Media Law Resource Center in New York, which tracks litigation involving bloggers. Milum was ordered to pay Banks $50,000.\n \n .....\n \n The legal battles over blogging and message board postings are unfolding on several fronts:\n \n \u0095 In Washington, D.C., former U.S. Senate aide Jessica Cutler was sued for invasion of privacy by Robert Steinbuch, also a former Senate aide, after Cutler posted a blog in 2004 describing their sexual escapades. The blog, titled Washingtonienne, was viewed widely after it was cited by a Washington gossip website called Wonkette. In July, Steinbuch added Wonkette to the lawsuit.\n \n \u0095 Todd Hollis, a criminal defense lawyer in Pittsburgh, has filed a libel suit against a website called DontDateHimGirl.com, which includes message boards in which women gossip about men they supposedly dated. One posting on the site accused Hollis of having herpes. Another said he had infected a woman he once dated with a sexually transmitted disease. Yet another said he was gay. Hollis, 38, who says the accusations are false, is suing the site's operator, Tasha Joseph, and the posters of the messages.\n \n \u0095 Anna Draker, a high school assistant principal in San Antonio, filed a defamation and negligence lawsuit against two students and their parents after a hoax page bearing her name, photo and several lewd comments and graphics appeared on MySpace.com, the popular social networking website.\n \n The suit alleges that the students - one of whom had been disciplined by Draker - created the page to get revenge, and that it was designed to \"injure Ms. Draker's reputation, expose her to public hatred ... and cause her harm.\" The suit also alleges that the youths' parents were grossly negligent in supervising them.\n \n \u0095 Ligonier Ministries, a religious broadcaster and publisher in Lake Mary, Fla., has taken the unusual step of asking a judge to pre-emptively silence a blogger to try to prevent him from criticizing the ministries. Judges historically have refused to place such limits on traditional publishers.\n \n The lawsuit cites postings on a blog by Frank Vance that described Ligonier president Timothy Dick as \"a shark\" and as coming from a \"family of nincompoops.\" The suit says the entries are false and have damaged Dick's reputation.\n \n Robert Cox, founder and president of the Media Bloggers Association, which has 1,000 members, says the recent wave of lawsuits means that bloggers should bone up on libel law. \"It hasn't happened yet, but soon, there will be a blogger who is successfully sued and who loses his home,\" he says. \"That will be the shot heard round the blogosphere.\"\n \n ....\n \n The blogosphere also is the Internet's Wild West, a rapidly expanding frontier town with no sheriff. It's a place where both truth and \"truthiness\" thrive, to use the satirical word coined by comedian Stephen Colbert as a jab at politicians for whom facts don't matter.\n \n Nearly two blogs are created every second, according to Technorati, a San Francisco firm that tracks more than 53 million blogs. Besides forming online communities in which people share ideas, news and gossip and debate issues of the day, blogs empower character assassins and mischief makers.\n \n Small disputes now can lead to huge embarrassment, thanks to websites such as bitterwaitress.com, which purports to identify restaurant patrons who leave miserly tips. DontDateHimGirl.com includes postings that have identified men as pedophiles, rapists and diseased, without verification the postings are true.\n \n \"People take advantage of the anonymity to say things in public they would never say to anyone face-to-face,\" Cox says. \"That's where you get these horrible comments. This is standard operating procedure.\"\n \n Even so, Cox thinks the chief danger in legal disputes over what's said on the Internet is the potential chilling effect it could have on free speech. Many lawsuits against bloggers, he says, are filed merely to silence critics. In those cases, he encourages bloggers to fight back.\n \n Last April, Cox orchestrated an effective counterattack on behalf of a blogger in Maine who was sued by a New York ad agency for $1 million. Lance Dutson, a website designer, had been blogging for two years when he posted several essays accusing Maine's Department of Tourism of wasting taxpayers' money. Among other things, he posted a draft of a tourism ad that mistakenly had contained a toll-free number to a phone-sex line. \n \n Warren Kremer Paino Advertising, which produced the tourism campaign, said in its suit that Dutson made defamatory statements \"designed to blacken WKPA's reputation (and) expose WKPA to public contempt and ridicule.\" \n \n Dutson's criticisms paled to those directed at WKPA after word of the lawsuit spread through the blogosphere. Bloggers rushed to defend Dutson, and several lawyers volunteered to represent him. The media picked up the story and cast it as David vs. Goliath. Eight days after filing the suit, WKPA dropped it without comment.\n \n \"We're not here to play nice with somebody who is trying to suppress the speech of one of my members,\" Cox says.\n \n ....\n \n A key principle that courts use in determining whether someone has been libeled is what damage the offending article did to that person's reputation in his or her community. \n \n Susan Crawford, a professor at Cardoza Law School in New York who specializes in media and Internet issues, says the ease with which false postings can be corrected instantly, among other things, will force judges to reconsider how to measure the damage that is done to a plaintiff's reputation.\n \n \"Libel law depends on having a reputation in a particular town that's damaged,\" she says. \"Do you have an online reputation? What's your community that hears about the damage to your online reputation? Who should be sued? The original poster? Or someone like the Wonkette, for making something really famous? The causes of action won't go away. But judges will be skeptical that a single, four-line (posting in a) blog has actually damaged anyone.\"\n \n Greg Herbert, an Orlando lawyer who represented Dutson, disagrees. The principles of libel law aren't going to change, he says. However, some judges \"might not think a blogger is entitled to the same sort of free speech protection others are. A lot of judges still don't know what a blog is, and they think the Internet is a dark and nefarious place where all kinds of evil deeds occur.\"\n \n Judges have indicated that they will give wide latitude to the type of speech being posted on the Internet. They usually have cited the 1996 Communications Decency Act, which protects website owners from being held liable for postings by others. On the other hand, under that statute, individuals who post messages are responsible for their content and can be sued for libel. That applies whether they are posting on their own website or on others' message boards.\n \n ....\n \n Hollis' lawsuit against DontDateHimGirl.com could reveal how far courts are willing to go to protect website owners from third-party comments. His suit claims the site is not the equivalent of an Internet provider such as AOL or Yahoo, and that because Joseph edits the site, she should be liable for its contents.\n \n Hollis has sued Joseph, a Miami publicist and former Miami Herald columnist, as well as seven women who posted the messages about him. Three are named in the suit; four are anonymous.\n \n Joseph's attorney, Lida Rodriguez-Taseff, says Joseph does not edit postings, except to remove information such as Social Security numbers and addresses.\n \n \"If a court were to find that the Communications Decency Act doesn't apply to Tasha, no website would be safe,\" Rodriguez-Taseff says, adding that if courts start to hold website owners liable for the content of third-party postings, \"the only people who would be able to provide forums (would be) wealthy people. ... It would be like making the coffee shop owner responsible for what people say in his coffee shop. What this case would say is that providers of forums in the Internet would have an obligation to determine truth or falsity of posts.\"\n \n A hearing is scheduled Oct. 19.\n \n \"The Internet has a great number of valuable tools with which people can do great things,\" Hollis says.\n \n But he says he's disturbed by how such false personal information can spread so freely across the web. \"Even if I had herpes, which I don't, even if I was gay, which I'm not, would I want to have a conversation about those things with an anonymous individual over a global platform? It's utterly ridiculous.\"\n \n Even if he wins in court, Hollis says, he loses.\n \n \"Those postings are going to be out there forever,\" he says. \"Whenever anybody Googles my name, up comes a billion sites. I will forever have to explain to someone that I do not have herpes.\"\n \n Basic defense for libel: The truth \n \n In Cumming, Ga., about 40 miles northeast of Atlanta, David Milum, 58, is still blogging. He is appealing the $50,000 judgment against him.\n \n Milum says he considers himself a muckraker and exposer of corruption in local officials. In the recent libel trial, his attorney, Jeff Butler, described his client as a \"rabble-rouser\" whose inspiration was \"public service.\"\n \n Milum lost in court because he could not meet the basic defense for libel claims: He could not prove that his allegations that Banks was involved in bribery and corruption were true. \n \n Now Milum is facing another libel suit - this one seeking $2 million - over his claims about the alleged misdeeds of a local government employee.\n \n \"I have a very wonderful wife,\" Milum says. \"And you can imagine how wonderful she has to be to put up with this.\"\n \n http://www.usatoday.com/tech/news/2006-10-02-bloggers-courts_x.htm", 
   {
    "unicode_changes_made": true
   }, 
   234525, 
   null, 
   1160591040.0
  ], 
  [
   234532, 
   null, 
   "Steeeeve", 
   "Interesting. I would like to read the actual case if you can find it but it seems this is a rather odd case. Normally defamation is not enforcable if it is an opinion. If this person was just posting on a blog then you would assume that is just an opinion as must are. Here is a good look at our common law of defamation.\n \n http://www.eff.org/bloggers/lg/faq-defamation.php", 
   {}, 
   234530, 
   null, 
   1160591760.0
  ], 
  [
   234551, 
   null, 
   "foundit66", 
   "Interesting. I would like to read the actual case if you can find it but it seems this is a rather odd case. Normally defamation is not enforcable if it is an opinion. If this person was just posting on a blog then you would assume that is just an opinion as must are. Here is a good look at our common law of defamation.\n http://www.eff.org/bloggers/lg/faq-defamation.php\n\n \n I can't help but wonder how much of the First Post's decision was based on the fact that the defendant never showed up.", 
   {}, 
   234532, 
   null, 
   1160596260.0
  ], 
  [
   234558, 
   null, 
   "Steeeeve", 
   "I can't help but wonder how much of the First Post's decision was based on the fact that the defendant never showed up.\n\n \n Yeah, i thought about that. My guess is that this will be reversed in a higher court. Whata joke", 
   {}, 
   234551, 
   null, 
   1160599560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  $11.3M over defamatory Internet posts", 
  "url": "http://www.4forums.com/political/civil-rights-debates/9025-11-3m-over-defamatory-internet-posts.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 9025, 
  "discussion_files": [
   [
    "1875.html", 
    "http://www.4forums.com/political/civil-rights-debates/9025-11-3m-over-defamatory-internet-posts-print.html"
   ]
  ], 
  "identifier": 9025
 }
]