[
 [
  [
   234528, 
   null, 
   "Steeeeve", 
   "This is really a two point post...I first want to point out that our news agencies stink (if you were still in the dark about this). This story came from Foxnews and was not found anywhere on CNN.com (at the time I wrote this atleast) but was on MSNBC.com. Likewise CNN reported an Iraqi death toll of 600,000+ and it is not found on either foxnews or msnbc. Both are good stories and one is pro-bush and one is anti-bush (i guess you could say). The media is lame.\n \n http://www.foxnews.com/story/0,2933,219745,00.html\n \n Anyway, the real story is about the deficit. It was \"cut in half\" this year from the previous number of huge deficits but the question is did the Bush tax policies actually help the economy. I personally think not going into debt so much is a good policy but you can read the article and give your opinion.\n \n http://www.foxnews.com/story/0,2933,219745,00.html\n \n Thoughts?", 
   {
    "post_info": {
     "post_title": "Tax Cuts lowering the Deficit?"
    }
   }, 
   null, 
   null, 
   1160590800.0
  ], 
  [
   234560, 
   null, 
   "daewoo", 
   "This is really a two point post...I first want to point out that our news agencies stink (if you were still in the dark about this). This story came from Foxnews and was not found anywhere on CNN.com (at the time I wrote this atleast) but was on MSNBC.com. Likewise CNN reported an Iraqi death toll of 600,000+ and it is not found on either foxnews or msnbc. Both are good stories and one is pro-bush and one is anti-bush (i guess you could say). The media is lame.\n \n http://www.foxnews.com/story/0,2933,219745,00.html\n \n Anyway, the real story is about the deficit. It was \"cut in half\" this year from the previous number of huge deficits but the question is did the Bush tax policies actually help the economy. I personally think not going into debt so much is a good policy but you can read the article and give your opinion.\n \n http://www.foxnews.com/story/0,2933,219745,00.html\n \n Thoughts?\n\n \n First, both of the links you posted are the same.\n \n Second, the deficit was \"cut in half\" from an imaginary number that nobody believed anyway. Originally the Bushies projected a $500 billion + deficit for 2001. There was NO CHANCE that it was going to hit that number, but they used it anyway, then claimed that they were going to cut it in half in X number of years.\n \n So, they have cut an imaginary bunch of BS in half. Yippee.", 
   {}, 
   234528, 
   null, 
   1160600160.0
  ], 
  [
   234561, 
   null, 
   "Steeeeve", 
   "First, both of the links you posted are the same.\n \n yeah, I know. i just didn't bother to delete the other one :)\n \n \n\n Second, the deficit was \"cut in half\" from an imaginary number that nobody believed anyway. Originally the Bushies projected a $500 billion + deficit for 2001. There was NO CHANCE that it was going to hit that number, but they used it anyway, then claimed that they were going to cut it in half in X number of years.\n \n So, they have cut an imaginary bunch of BS in half. Yippee.\n\n \n Yeah, i know...but even if you did \"cut a deficit\"...big deal, you still have one. Not having tax cuts coulda done the same thing :)", 
   {}, 
   234560, 
   null, 
   1160601060.0
  ], 
  [
   234570, 
   null, 
   "lord tammerlain", 
   "If taxes are high enough to prevent or slow economic activity then a tax cut will spur economic growth and lower the deficit over the long term.\n \n If taxes are already relatively low, and the tax cut not that dramatic, then no tax cuts will not spur economic activity and lower the deficit over the long term", 
   {}, 
   234561, 
   null, 
   1160603940.0
  ], 
  [
   234689, 
   null, 
   "obvious_child", 
   "Possible. I don't really understand how that would work. The tax cuts were paid for by debt financing at the same time as exorbiant federal spending (which leads to the question: what got us out of the recession, tax cuts or goverment spending? I've never gotten a answer out of supporters of reagonomics and I doubt I ever will). The GAO I recall computed the 2003 tax cuts to make up 35% of the deficit. It is likely that the later tax cuts had at least some of the same effect. Probably not as much given that the deficit has become more and more off budget war spending (hardly accurate or even valid accounting by the bush adminstration). \n \n As Daewoo said, the numbers are imaginary. The Bush adminstration has for the past 5 years inflated numbers to make it look like they were doing a better job with the finances then they really were. It's a pyschological term called anchoring, people hear that the defict is predicted to be X by the adminstration when they know full well it's going to be Y. They then report Y in relation to X later and take credit for it. It's dishonest but typical Bush adminstration behavior. \n \n The fundemental argument of supply side isn't flawed. It's just like Communism, great on paper, terrible in reality.", 
   {}, 
   234528, 
   null, 
   1160704260.0
  ], 
  [
   239646, 
   null, 
   "wvpeach1963", 
   "obvious child , good point , communism and socialism sound great till somebody finds a way to take the money and run.\n \n \n Its a simple fact and the people with all the money know it .\n \n That what we have is life boat economics in this country.\n \n Since world war 2 CEO's have been raping he companies in pursuit of the ever higher quaterly profit return. Why not ? Thier million dollar bonus's are tied in to that profit statement.\n \n They know they should spend money on R&D, on infrastructure of the company, yet heaven forbid because they might miss that next bonus if they are not wringing every last dime of profit out of the rag.\n \n Its a simple concept as they blunder american corporations the life boat becomes too full , so over go the middle managment first. They know too much .\n \n The boat gets a little lower in the water and they throw out the workers and insist if the rest want to stay in the boat they better work harder and dare not question the elite.\n \n But never fear evil always devours itself, and evil is indeed about to do itself in in this country.\n \n Unfortunately the rest of us will suffer right along with those that deserve it.\n \n Ah well I can smile through my pain.", 
   {}, 
   234689, 
   null, 
   1163487540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tax Cuts lowering the Deficit?", 
  "url": "http://www.4forums.com/political/current-events-debates/9026-tax-cuts-lowering-deficit.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 9026, 
  "discussion_files": [
   [
    "4418.html", 
    "http://www.4forums.com/political/current-events-debates/9026-tax-cuts-lowering-deficit-print.html"
   ]
  ], 
  "identifier": 9026
 }
]