[
 [
  [
   235081, 
   null, 
   "Matthew S", 
   "Romney got on his soap box this past sunday.\n http://www.365gay.com/Newscon06/10/101506libsun.htm\n He just doesn't get it. He is a bigot and a homophobe.\n \n\n \"Here in Massachusetts, activist judges struck a blow to the foundation of civilization - the family,\" the Republican governor and likely presidential candidate said to an applauding crowd of about 1,000 people, some of whom responded \"Amen.\"\n\n So because the law was gender nutral in Mass the judge was activist in upholding the rights of Mass citizens?\n \n \n\"What (the judges) ignored is that marriage is not primarily about adults, marriage is about the nurturing and development of children ... every child deserves a mother and a father,\" he said.\n\n \n This is why 70 year olds can get married so they can have lots of children?\n \n \n Then we have Tony Perkins from the Family Research Council\n \n\"When we look at what has happened with same-sex marriage, as it began in this state and threatens to spread across the country, we've seen in its wake the loss of religious freedoms and the ability to speak out based upon one's moral convictions,\"\n\n What about the religious freedom of gay people and those religions that embrace same sex marriage? It is Tony Perkins and his nutjob organization that is a threat to the freedoms of gay people.\n \n Why don't these people understand that marriage is about the two people involved in the marraige and the legal protections for that couple?\n \n I would say that Romney, Perkins and that parker guy believe that their religious freedom is more important then the freedoms of gay people. They want to keep us as second class citizens and continue to preach their hatfilled message.", 
   {
    "post_info": {
     "post_title": "Romney is a hatefilled bigot"
    }
   }, 
   null, 
   null, 
   1161004140.0
  ], 
  [
   235133, 
   null, 
   "Kronus", 
   "\n \"What (the judges) ignored is that marriage is not primarily about adults, marriage is about the nurturing and development of children ... every child deserves a mother and a father,\" he said.\n\n \n\n This is why 70 year olds can get married so they can have lots of children?\n \n\n \n I think you're missing the more important refutation here. Gays are going to have families even if they aren't married. They're doing it already, even in states where there's no chance of getting married. \"Kids deserve a mom and dad\" might be a point to raise in adoption debates, or if you wanted to start passing out pregnancy licenses, but it is utterly irrelevant to the point of gay marriage, because getting married and having kids are two totally different things. Gays will have families regardless of their marital status, so denying them the benefits of marriage won't prevent gay families, it will only hurt them.", 
   {}, 
   235081, 
   null, 
   1161024900.0
  ], 
  [
   235141, 
   null, 
   "thelmoose", 
   "I think you're missing the more important refutation here. Gays are going to have families even if they aren't married. They're doing it already, even in states where there's no chance of getting married. \"Kids deserve a mom and dad\" might be a point to raise in adoption debates, or if you wanted to start passing out pregnancy licenses, but it is utterly irrelevant to the point of gay marriage, because getting married and having kids are two totally different things. Gays will have families regardless of their marital status, so denying them the benefits of marriage won't prevent gay families, it will only hurt them.\n\n \n Yes. The point that \nmarriage is about the nurturing and development of children ... \n should be countered that this is an argument FOR not against gay marriage.\n \n There are hundreds of thousands of children out there with same sex parents. Those kids need the advantages of having their parents married. It is for precisely this reason that the American Academy of Pediatrics came out strongly in favor of same-sex marriage this past summer.", 
   {}, 
   235133, 
   null, 
   1161027780.0
  ], 
  [
   235324, 
   null, 
   "Easyrider", 
   "\n \n There are hundreds of thousands of children out there with same sex parents. Those kids need the advantages of having their parents married. It is for precisely this reason that the American Academy of Pediatrics came out strongly in favor of same-sex marriage this past summer.\n\n \n Well, the problem with that, Moose, is that gay marriage is just institutionalized sin. No decent, God-fearing society should even entertain that kind of abomination. And fortunately, most people in America don't want it, in spite of what the spiritually-challenged American Academy of Pediatrics thinks.", 
   {}, 
   235141, 
   null, 
   1161143520.0
  ], 
  [
   235345, 
   null, 
   "thelmoose", 
   "Well, the problem with that, Moose, is that gay marriage is just institutionalized sin. No decent, God-fearing society should even entertain that kind of abomination. And fortunately, most people in America don't want it, in spite of what the spiritually-challenged American Academy of Pediatrics thinks.\n\n \n Tell me what you know about the spirituality of that medical organization. Please, I want to know that. Their pronouncement was one of dispassionate science.\n \n There is no such thing as sin, institutionalized or otherwise. Do you wish to punish innocent children because of your rigid, unfeeling and irrelevant orthodoxy?", 
   {}, 
   235324, 
   null, 
   1161148020.0
  ], 
  [
   235602, 
   null, 
   "Matthew S", 
   "Well, the problem with that, Moose, is that gay marriage is just institutionalized sin. No decent, God-fearing society should even entertain that kind of abomination. And fortunately, most people in America don't want it, in spite of what the spiritually-challenged American Academy of Pediatrics thinks.\n\n \n You just don't get it do you. What gives you and your bunch the right to dictate to me and my people what type of family structure we should have. I am legally forced to accept, and pay taxes to support, your family structure and so help me God you will be legally forced to accept mine one day. \n \n Remember no religion is better then the christian right brand of religion. Better to burn in hell then to spend one moment in heaven if there is even one evangelical christian facist there.", 
   {}, 
   235324, 
   null, 
   1161298140.0
  ], 
  [
   235606, 
   null, 
   "jitobear", 
   "Tell me what you know about the spirituality of that medical organization. Please, I want to know that. Their pronouncement was one of dispassionate science.\n \n There is no such thing as sin, institutionalized or otherwise. Do you wish to punish innocent children because of your rigid, unfeeling and irrelevant orthodoxy?\n\n \n Easy doesn't care about children. He just want his brownie points in heaven. (But of course children with gay parents should go to hell - and he is gonna eat popcorn and watch it all!)", 
   {}, 
   235345, 
   null, 
   1161298740.0
  ], 
  [
   235614, 
   null, 
   "tonybrown74", 
   "Well, the problem with that, Moose, is that gay marriage is just institutionalized sin. No decent, God-fearing society should even entertain that kind of abomination. And fortunately, most people in America don't want it, in spite of what the spiritually-challenged American Academy of Pediatrics thinks.\n\n \n Institutionalized sin???\n \n LOL!!!\n \n So is capitalism. I bet you don't hear those preachers talking about the sin of profiteering, now do you?", 
   {}, 
   235324, 
   null, 
   1161301080.0
  ], 
  [
   235637, 
   null, 
   "Baltidog", 
   "Next Romney will attempt to close the public school system by call \"gay schooling\". And then he will ban wine, by rebranding it \"gay juice\". And after that he will seek to prevent people from fishing buy labeling it \"homo hunting\".", 
   {}, 
   235614, 
   null, 
   1161313800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Romney is a hatefilled bigot", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9039-romney-hatefilled-bigot.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9039, 
  "discussion_files": [
   [
    "23784.html", 
    "http://www.4forums.com/political/gay-rights-debates/9039-romney-hatefilled-bigot-print.html"
   ]
  ], 
  "identifier": 9039
 }
]