[
 [
  [
   235216, 
   null, 
   "obvious_child", 
   "To be considered a atheist, you must have a disbelief in the existance of a diety yes? \n \n Therefore everyone who believes in some form of diety or dieties is not a atheist. \n \n Marc9000, however, said \"One Jewish + Mormon group, yes\" when asked if he considered them atheists. \n \n Therefore, correct me if I'm wrong here, to consider the Jewish and mormon groups to be atheists, their respective \"Gods\" can't be a God as that would be theism and therefore not atheism. \n \n Doesn't that mean then, that the Christian and Jewish Gods are not in fact Gods for one jewish and mormon group to be considered atheist?", 
   {
    "post_info": {
     "post_title": "so help me out here, correct my logic please"
    }
   }, 
   null, 
   null, 
   1161063360.0
  ], 
  [
   235321, 
   null, 
   "Hi_Its_Me", 
   "Your link missed... the relevant entry is this:\n \nand it was another Jewish + Mormon group that sued Texas for much of the same.\n \n So do you consider Jews and Mormons to be atheists?\n\n One Jewish + Mormon group, yes. They don't represent all Mormons and Jews.\n\n \n I don't think marc will actually respond to your post. If he does, he will have to admit that he made a mistake. I don't know of many times that has happened...", 
   {}, 
   235216, 
   null, 
   1161142680.0
  ], 
  [
   235333, 
   null, 
   "electrolyte", 
   "I don't think marc will actually respond to your post. If he does, he will have to admit that he made a mistake. I don't know of many times that has happened...\n\n How many times he's made a mistake, or how many times he's admitted he's made a mistake? The two are vastly different...", 
   {}, 
   235321, 
   null, 
   1161144240.0
  ], 
  [
   235515, 
   null, 
   "marc9000", 
   "Your link missed... the relevant entry is this:\n \n \n I don't think marc will actually respond to your post. If he does, he will have to admit that he made a mistake. I don't know of many times that has happened...\n\n \n I did in that thread, a little over one hour before you made this post. Now we'll see if you admit your mistake, while I wait for obvious_child to admit his mistake of accusing me of calling luscaspa an atheist in a thread that ended about a week before lucaspa even joined this forum. \n \n I love this place!!", 
   {}, 
   235321, 
   null, 
   1161229560.0
  ], 
  [
   235518, 
   null, 
   "Hi_Its_Me", 
   "I did in that thread, a little over one hour before you made this post. Now we'll see if you admit your mistake, while I wait for obvious_child to admit his mistake of accusing me of calling luscaspa an atheist in a thread that ended about a week before lucaspa even joined this forum. \n \n I love this place!!\n\n Ok, I will admit that I have not been reading your posts that do not involve me. I think you said something about not answering questions directed at others, right? Are you now saying, \"read all of my posts, anyway\"?\n \n Actually, the reason I didn't read it is I was occupied elsewhere. I have time constraints too, what with debating with lucaspa all the time.", 
   {}, 
   235515, 
   null, 
   1161231660.0
  ], 
  [
   235536, 
   null, 
   "obvious_child", 
   "I did in that thread, a little over one hour before you made this post. Now we'll see if you admit your mistake, while I wait for obvious_child to admit his mistake of accusing me of calling luscaspa an atheist in a thread that ended about a week before lucaspa even joined this forum. \n \n I love this place!!\n\n \n Alright, you didn't call lucaspa a atheist. However, you will that is without question.\n \n Btw, you still have yet to reply to my debate challenge regarding atheism.", 
   {}, 
   235515, 
   null, 
   1161251040.0
  ], 
  [
   235554, 
   null, 
   "electrolyte", 
   "I think you said something about not answering questions directed at others, right? Are you now saying, \"read all of my posts, anyway\"?\n\n Exactly. Under the forum rules of King marc9000, as long as his response is not directed specifically toward you, you are supposed to read it, but you are forbidden to respond to it. Can you imagine how hard it must be to post the same balderdash time and time again when the people who've corrected you on the very same points the first thousand or so times are allowed to remind you and your intended target how wrong you are?", 
   {}, 
   235518, 
   null, 
   1161265740.0
  ], 
  [
   235893, 
   null, 
   "marc9000", 
   "Ok, I will admit that I have not been reading your posts that do not involve me. I think you said something about not answering questions directed at others, right? Are you now saying, \"read all of my posts, anyway\"? \n\n \n Well, I'll forgive you. emoticon_xangel But if you're going to make comments about my willingness to post in another thread, shouldn't you read that thread first? Shouldn't you read my posts in that case? It did involve you because you referred to it. \n \n \nActually, the reason I didn't read it is I was occupied elsewhere. I have time constraints too, what with debating with lucaspa all the time.\n\n \n Your mistake was referring to it without reading it. But as I said, forgiven.", 
   {}, 
   235518, 
   null, 
   1161484380.0
  ], 
  [
   235896, 
   null, 
   "marc9000", 
   "Alright, you didn't call lucaspa a atheist. However, you will that is without question. \n\n \n I don't think so. I don't think our discussions will come to that. They seem to be winding down, in fact, as have all my discussions with theistic evolutionists.\n \n \nBtw, you still have yet to reply to my debate challenge regarding atheism.\n\n \n That makes us even on not replying to each other's debate challanges. I've already answered why in post #37 in your \"evolution - atheistic\" thread. Why do you keep bringing it up?", 
   {}, 
   235536, 
   null, 
   1161485160.0
  ], 
  [
   235903, 
   null, 
   "obvious_child", 
   "I don't think so. I don't think our discussions will come to that. They seem to be winding down, in fact, as have all my discussions with theistic evolutionists.\n\n \n Do you even read before you post? How can you be a theistic evolutionist and a atheist at the same time? \n \n Do you even know what theism is? \n \n \nThat makes us even on not replying to each other's debate challanges. I've already answered why in post #37 in your \"evolution - atheistic\" thread. Why do you keep bringing it up?\n\n \n Wrong. Your resolution was nonsense. Even bilsco agreed to that. Plus your allergic reaction to use predefined terms specifically out of dictionary more or less made everyone figure out what you were trying to do (massive dishonesty). \n \n I however had defined the terms as well as have a clear resolution without any ambiguity. You just failed to post merely because if you argued you'd have to admit that evolution can't be atheistic due to the millions of believers you couldn't call atheists after you lost the debate.\n \n Bull****. The entire definition is revelant to what we are talking about. Your resolution was dealing with related, not of actuality. \n \n Do you really think you're fooling anyone here?", 
   {}, 
   235896, 
   null, 
   1161490740.0
  ], 
  [
   236028, 
   null, 
   "marc9000", 
   "Do you even read before you post? How can you be a theistic evolutionist and a atheist at the same time? \n \n Do you even know what theism is? \n\n \n If you weren't so blind with rage you wouldn't be missing the entire point of my posts. You can be a theistic evolutionist and an atheist at the same time if you're actually an atheist, and PRETEND to be a theistic evolutionist. That way you can further the atheist cause in schools and politics, and when questioned, you say \"but I believe in God darn it, so I CAN'T POSSIBLY be interested in an atheist agenda. It's kind of like wearing the uniform of the enemy during a war, winning their confidence, and doing things right in front of their faces to help the enemy. This method works very well in winning a war, if the enemy whose uniform you're wearing is too stupid to see you for who you really are. \n \n \n \n \nWrong. Your resolution was nonsense. Even bilsco agreed to that. Plus your allergic reaction to use predefined terms specifically out of dictionary more or less made everyone figure out what you were trying to do (massive dishonesty). \n\n \n \"Everyone\"? Did everyone send you PM's and tell you that? :) \n \n \nI however had defined the terms as well as have a clear resolution without any ambiguity. You just failed to post merely because if you argued you'd have to admit that evolution can't be atheistic due to the millions of believers you couldn't call atheists after you lost the debate.\n\n \n See above, there are many indications that the U.S. has many atheists who wear the Christian uniform. \n \n \nBull****. The entire definition is revelant to what we are talking about. Your resolution was dealing with related, not of actuality. \n\n \n Evolution deals with purposelessness, atheism deals with purposelessness. They're birds of a feather, and you know it. Evolution is BY FAR the most commonly used tool of atheism. \n \n \n \nDo you really think you're fooling anyone here?\n\n \n LOL", 
   {}, 
   235903, 
   null, 
   1161570240.0
  ], 
  [
   236040, 
   null, 
   "Collin", 
   "Evolution deals with purposelessness, atheism deals with purposelessness.\n\n \n Underlined portion is a lie on Marc's part. He's well aware that's not the case. He's very much aware that an omnipotent being--considering it's omnipotent--can easily do something purposefully while making it appear to be done without purpose.", 
   {}, 
   236028, 
   null, 
   1161572520.0
  ], 
  [
   236067, 
   null, 
   "obvious_child", 
   "You can be a theistic evolutionist and an atheist at the same time if you're actually an atheist, and PRETEND to be a theistic evolutionist.\n\n \n Alright. That doesn't deal with the millions who aren't pretending, which included before he died, Pope John Paul II. Now if you'd like to call catholicism atheistic while believing the same God you do, please do so. \n \n \nThat way you can further the atheist cause in schools and politics, and when questioned, you say \"but I believe in God darn it, so I CAN'T POSSIBLY be interested in an atheist agenda. It's kind of like wearing the uniform of the enemy during a war, winning their confidence, and doing things right in front of their faces to help the enemy. This method works very well in winning a war, if the enemy whose uniform you're wearing is too stupid to see you for who you really are.\n\n \n What is the atheist cause? So a jew who objects to the Christian doctrine in a public school is supporting atheism? Or a christian who objects to mandatory Koran reading is furthering atheism? Where do you get your crack rock? \n \n \n\"Everyone\"? Did everyone send you PM's and tell you that? :) \n \n\n \n Actually yes. \n \n \nSee above, there are many indications that the U.S. has many atheists who wear the Christian uniform.\n\n \n And there are many people like you who fallaciously wear the christian uniform. It's clear why you won't accept my challenge: key word: honesty. \n \n \nEvolution deals with purposelessness, atheism deals with purposelessness. They're birds of a feather, and you know it. Evolution is BY FAR the most commonly used tool of atheism. \n\n \n Sure it is. And you'll fail to prove this when challenged. \n \n Btw, can you define atheism for me?", 
   {}, 
   236028, 
   null, 
   1161579840.0
  ], 
  [
   236092, 
   null, 
   "electrolyte", 
   "Evolution deals with purposelessness, atheism deals with purposelessness.\n\n Underlined portion is a lie on Marc's part. He's well aware that's not the case. He's very much aware that an omnipotent being--considering it's omnipotent--can easily do something purposefully while making it appear to be done without purpose.\n\n The non-underlined portion is a lie on marc's part, too.\n \n Of course, if we use the ridiculous idea of \"deals with\" to link ideas...\n Christianity deals with punishment, torture deals with punishment. Therefore Christianity and torture are birds of a feather...", 
   {}, 
   236067, 
   null, 
   1161588900.0
  ], 
  [
   236096, 
   null, 
   "electrolyte", 
   "If you weren't so blind with rage you wouldn't be missing the entire point of my posts. You can be a theistic evolutionist and an atheist at the same time if you're actually an atheist, and PRETEND to be a theistic evolutionist.\n\n In other words, marc assigns the label of \"conspiratorial liar\" to everyone who doesn't agree with him. marc feels that there's a massive conspiracy that involves people acting very contrarily to their alleged beliefs all for the sake or maintaining the secrecy of the anti-marc sentiment.\n \n Note that these are symptoms of clinical paranoia.", 
   {}, 
   236028, 
   null, 
   1161589560.0
  ], 
  [
   236108, 
   null, 
   "T.Q", 
   "I think it's pretty obvious to all that Marc goes above and beyond the usual creationist ignorance, and well into the realm of actual mental illness. \n \n As is clear to everyone here (and yes Marc, they all PM'ed me), if you disagree with Marc, you're an atheist. Luscapa disagrees with Marc, so he's part of the EAC, even though he currently is scrapping it out with 3 or 4 other \"atheists\" on many topics. Apparently the EAC needs to start disciplining members a little better. I'll have to bring that up at the next meeting. Marc disagrees with Kenneth Miller, so he's an atheist liar. The names slip my mind at the moment, but there have been 2-3 other theistic evolutionists here who have tried to speak with Marc, and Marc has called them atheist liars as well.\n \n Guys, as amusing as it is watching Marc fumble around, I think it's time to ignore him. When he basically says that he's the only true christian on the planet, he's too far gone to deal with.\n \n Oh, and Marc, why do you think you make us angry or \"full of rage\"? Is that your goal as a christian? Is that how you know you're doing a good job? Do you get a better seat in heaven if you #### off x number of people first?\n \n Myself, you haven't come close to angering me. Amazing me, yes. There's been quite a few of your posts I've had to get friends and family to read, just so I could see the look on their faces. Usually it's shock, with quite a bit of amusement. Then, when I tell them that you're serious, then comes the disgust, with a little pity on the side. See, they, like me, don't understand how someone can see it as a virtue to lie. They don't understand how you could be so proud of your ignorance, and be so arrogant as to tell anyone and everyone you disagree with that they aren't true christians, and are only atheist double agents, that only you, and those like you have the right to call yourselves christians.\n \n I'm going to go out on a limb and guess you haven't angered anyone else here much either. Your willful ignorance, your arrogance, and your complete and utter lack of knowledge probably upset them, just as they do me. However, we don't get angry because you have us on the defensive, we get upset because we can't believe that anyone could be so downright despicable and call themselves a man of god.", 
   {}, 
   236096, 
   null, 
   1161604080.0
  ], 
  [
   236119, 
   null, 
   "lucaspa", 
   "I don't think so. I don't think our discussions will come to that. They seem to be winding down, in fact, as have all my discussions with theistic evolutionists.\n\n \n If they are winding down, that's because you are no longer responding. Is that what happens with your other discussions with theistic evolutionists? You simply give up?", 
   {}, 
   235896, 
   null, 
   1161610380.0
  ], 
  [
   236120, 
   null, 
   "lucaspa", 
   "If you weren't so blind with rage you wouldn't be missing the entire point of my posts. You can be a theistic evolutionist and an atheist at the same time if you're actually an atheist, and PRETEND to be a theistic evolutionist. That way you can further the atheist cause in schools and politics, and when questioned, you say \"but I believe in God darn it, so I CAN'T POSSIBLY be interested in an atheist agenda. It's kind of like wearing the uniform of the enemy during a war, winning their confidence, and doing things right in front of their faces to help the enemy.\n\n \n You mean like pretending to be a Christian but actually worshipping a literal interpretation of the Bible? Of pretending to be a Christian but furthering atheism by insisting that creationism is true?\n \n You see, Marc, two can play at the \"pretend\" game.\n \n Now, exactly what do you mean by \"atheist cause in schools and politics\".\n \n IMO, the only way you would do this is to insist that schools and politics favor atheism by saying \"God does not exist\". \n \n In terms of evolution/creationism, this would mean having evolution taught as atheism in public schools. Where is this being done? Please document this and let me know so I can inform NCSE and we can get the situation corrected. Evolution, like all science, should be taught as agnostic. That means teaching evolution as neutral in regards to atheism and theism. You can believe in God and accept evolution. You can also believe God does not exist and accept evolution.\n \n But you cannot believe in a god of a literal inerrant Bible and accept evolution. However, as a Christian I don't have any problem with that. After all, if your god is a literal inerrant Bible you are worshipping a false idol.", 
   {}, 
   236028, 
   null, 
   1161610800.0
  ], 
  [
   236249, 
   null, 
   "marc9000", 
   "I think it's pretty obvious to all that Marc goes above and beyond the usual creationist ignorance, and well into the realm of actual mental illness. \n \n As is clear to everyone here (and yes Marc, they all PM'ed me), if you disagree with Marc, you're an atheist. Luscapa disagrees with Marc, so he's part of the EAC, even though he currently is scrapping it out with 3 or 4 other \"atheists\" on many topics. Apparently the EAC needs to start disciplining members a little better. I'll have to bring that up at the next meeting. Marc disagrees with Kenneth Miller, so he's an atheist liar. The names slip my mind at the moment, but there have been 2-3 other theistic evolutionists here who have tried to speak with Marc, and Marc has called them atheist liars as well. \n\n \n Copy/paste where I called them atheist liars, strawman builder. If you can't, it will be clear just who the liar is. \n \n \nGuys, as amusing as it is watching Marc fumble around, I think it's time to ignore him. When he basically says that he's the only true christian on the planet, he's too far gone to deal with.\n\n \n Reference? \n \n \n \nOh, and Marc, why do you think you make us angry or \"full of rage\"? Is that your goal as a christian? Is that how you know you're doing a good job? Do you get a better seat in heaven if you #### off x number of people first? \n\n \n It's not my goal, and it's not me who is doing it, only my patience and persistance. You and about 15 others here are so used to bullying decent people out of here before they can make their points, I suppose my persistance would be frustrating for you. \n \n \nMyself, you haven't come close to angering me. Amazing me, yes. There's been quite a few of your posts I've had to get friends and family to read, just so I could see the look on their faces. Usually it's shock, with quite a bit of amusement. Then, when I tell them that you're serious, then comes the disgust, with a little pity on the side. See, they, like me, don't understand how someone can see it as a virtue to lie. They don't understand how you could be so proud of your ignorance, and be so arrogant as to tell anyone and everyone you disagree with that they aren't true christians, and are only atheist double agents, that only you, and those like you have the right to call yourselves christians. \n\n \n So you have to tell them that I'm serious? Your friends and family are that daft? Why don't you tell them that conservative Christian talk radio is financially thriving, while Air America radio recently filed for chapter 11 bankrupcy. I'm sure that will be a tremendous \"shock\" for them too. Just how out of touch are they with the political/religious beliefs in the U.S. today?\n \n \nI'm going to go out on a limb and guess you haven't angered anyone else here much either. Your willful ignorance, your arrogance, and your complete and utter lack of knowledge probably upset them, just as they do me. However, we don't get angry because you have us on the defensive, we get upset because we can't believe that anyone could be so downright despicable and call themselves a man of god.\n\n \n Sweet, nice Christians who abandon debates don't get much attention. I may be wrong, but it's my guess that Ann Coulter's books outsell other books written by sweet, nice Christians who are nervous about offending people.", 
   {}, 
   236108, 
   null, 
   1161654840.0
  ], 
  [
   236250, 
   null, 
   "marc9000", 
   "If they are winding down, that's because you are no longer responding. \n\n \n YOU ARE THE ONE WHO QUIT RESPONDING TO THEM, AND YOU KNOW IT. \n \n \nIs that what happens with your other discussions with theistic evolutionists? You simply give up?\n\n \n They were the one's that gave up, EVERY TIME.", 
   {}, 
   236119, 
   null, 
   1161655020.0
  ], 
  [
   236252, 
   null, 
   "marc9000", 
   "You mean like pretending to be a Christian but actually worshipping a literal interpretation of the Bible? Of pretending to be a Christian but furthering atheism by insisting that creationism is true?\n \n You see, Marc, two can play at the \"pretend\" game.\n \n Now, exactly what do you mean by \"atheist cause in schools and politics\".\n \n IMO, the only way you would do this is to insist that schools and politics favor atheism by saying \"God does not exist\". \n \n In terms of evolution/creationism, this would mean having evolution taught as atheism in public schools. Where is this being done? Please document this and let me know so I can inform NCSE and we can get the situation corrected. Evolution, like all science, should be taught as agnostic. That means teaching evolution as neutral in regards to atheism and theism. You can believe in God and accept evolution. You can also believe God does not exist and accept evolution.\n \n But you cannot believe in a god of a literal inerrant Bible and accept evolution. However, as a Christian I don't have any problem with that. After all, if your god is a literal inerrant Bible you are worshipping a false idol.\n\n \n So you're a Christian, and you've said before that Jesus lives. I still don't know if you believe in Satan, the great deceiver. I still don't know if you believe in the trinity. NO, not electrolyte, collin, and T.Q. - I'm referring to the Father, Son, and Holy Spirit. \n \n I can't discuss these things with you until you clarify your position.", 
   {}, 
   236120, 
   null, 
   1161655380.0
  ], 
  [
   236258, 
   null, 
   "T.Q", 
   "Copy/paste where I called them atheist liars, strawman builder. If you can't, it will be clear just who the liar is.\n\n Do you see quotes around those words? You haven't used those words, but it's quite easy to see by your words that you consider them such.\n \n \nReference?\n\n Again, it's quite clear what you believe based on your words.\n \n \n \nIt's not my goal, and it's not me who is doing it, only my patience and persistance. You and about 15 others here are so used to bullying decent people out of here before they can make their points, I suppose my persistance would be frustrating for you.\n\n As I've said, you don't anger us Marc. If that's what's keeping you going, sorry.\n \n \n \nSo you have to tell them that I'm serious? Your friends and family are that daft? Why don't you tell them that conservative Christian talk radio is financially thriving, while Air America radio recently filed for chapter 11 bankrupcy.\n\n But Marc, how could that be? I'm sure I saw you state somewhere in a post that all media in America is liberal. If what you said then is true, how is it that Air America filed Chapter 11, but Fox \"news\", Rush Limbaugh, Ann Coulter, etc. are all thriving?\n \n \n I'm sure that will be a tremendous \"shock\" for them too. Just how out of touch are they with the political/religious beliefs in the U.S. today?\n\n Marc, pull out your map of the US and point out Saskatoon, Saskatchewan to me. Believe it or not, the US is not the center of the world.\n \n \nSweet, nice Christians who abandon debates don't get much attention. I may be wrong, but it's my guess that Ann Coulter's books outsell other books written by sweet, nice Christians who are nervous about offending people.\n\n Nice to see you've allied yourself with Ann Coulter. Let's look at some of her greatest hits:\n \n \"Without affirmative action, African-American Rep. Maxine Waters (D-CA): couldn't get a job \"that didn't involve wearing a paper hat\" \n \n \"When we were fighting communism, OK, they had mass murderers and gulags, but they were white men and they were sane. Now we're up against absolutely insane savages.\" \n ---<Ok, so she's racist. Got it. Are you?\n \n \"We should invade their countries, kill their leaders and convert them to Christianity. We weren't punctilious about locating and punishing only Hitler and his top officers. We carpet-bombed German cities; we killed civilians. That's war. And this is war.\" \n ---<She thinks Christians should kill all who disagree and convert the survivors? Do you?\n \n \"[Canadians] better hope the United States does not roll over one night and crush them. They are lucky we allow them to exist on the same continent.\" \n ---<She thinks we Canadians are lower than Americans, and survive by the US's whims. Do you agree?\n \n \"Being nice to people is, in fact, one of the incidental tenets of Christianity (as opposed to other religions whose tenets are more along the lines of 'kill everyone who doesn't smell bad and doesn't answer to the name Mohammed')\". \n \n ---<So that whole \"love\" thing that Christ was preaching wasn't really the point. What was the main point of Christ's teachings Marc?\n \n \"The ethic of conservation is the explicit abnegation of man's dominion over the Earth. The lower species are here for our use. God said so: Go forth, be fruitful, multiply, and rape the planet--it's yours. That's our job: drilling, mining and stripping. Sweaters are the anti-Biblical view. Big gas-guzzling cars with phones and CD players and wet bars -- that's the Biblical view.\" \n \n \"God gave us the earth. We have dominion over the plants, the animals, the trees. God said, 'Earth is yours. Take it. Rape it. It's yours.'\" \n ---<Do you agree Marc? Is the planet that god provided here to be used and abused? \"Raped\", as she says? Did god mean that we should utterly despoil his creation?\n \n \"They're [Democrats] always accusing us of repressing their speech. I say let's do it. Let's repress them. Frankly, I'm not a big fan of the First Amendment.\" \n ---<How bout it Marc? Would you like it if the governing party could decide what was right to say, and what was illegal?\n \n VESTER: \"You say you'd rather not talk to liberals at all?\" \n COULTER: \"I think a baseball bat is the most effective way these days.\" \n \n \"My only regret with Timothy McVeigh is he did not go to the New York Times building.\" \n (re: the above)\n \"Of course I regret it. I should have added 'after everyone had left the building except the editors and the reporters.'\" \n \n ---<So we see she's all for murder and abuse, as long as it's people that disagree with her. Do you agree Marc?\n \n Yep, that's some Christian woman there Marc...", 
   {
    "unicode_changes_made": true
   }, 
   236249, 
   null, 
   1161658500.0
  ], 
  [
   236269, 
   null, 
   "obvious_child", 
   "T.Q\n \n You're forgetting a great one.\n \n Coulter on her website wrote that the Foley E-mails to minor pages were just \"overly friendly.\"\n \n So Marc9000 agrees with someone who calls sexual predation of homosexual minors by politicans to be \"overly friendly.\"\n \n It doesn't get better then that. \n \n Marc9000 is allied with a sexual pervert of the worst kind\\\n \n Btw, Marc9000, I see you've failed to define atheism", 
   {}, 
   236258, 
   null, 
   1161664140.0
  ], 
  [
   236272, 
   null, 
   "T.Q", 
   "Thanks obvious_child, I completely forgot about that one. So Marc, I'm pretty sure I remember you going off on Clinton for his Oval Office escapade with an intern. Do you agree with Coulter? Do you think it's ok for a man in his 50's to make sexual advances to minors, as long as he's a Republican? Is it only Dems who are held to a higher moral standard?", 
   {}, 
   236269, 
   null, 
   1161664680.0
  ], 
  [
   236442, 
   null, 
   "marc9000", 
   "Do you see quotes around those words? You haven't used those words, but it's quite easy to see by your words that you consider them such. \n\n \n You're right, I haven't used those words, I've used logic and revelant questioning of them in several rounds of back and fourth discussion to expose their gaps and 180's in their logic. What \"you see\" in what I \"consider\" is really not my problem.\n \n \n \nAs I've said, you don't anger us Marc. If that's what's keeping you going, sorry. \n\n \n I don't anger you, but I \"upset\" you? You show my posts to your friends and family, \"everyone\" else here PM's you to tell how wrong I am - don't these things take time and effort? Does being \"upset\" justify all this action, or could it be anger?\n \n \n \nBut Marc, how could that be? I'm sure I saw you state somewhere in a post that all media in America is liberal. \n\n \n There you go again. \n \n \n If what you said then is true, how is it that Air America filed Chapter 11, but Fox \"news\", Rush Limbaugh, Ann Coulter, etc. are all thriving? \n\n \n To understand what's going on, you'd have to be able to separate the different kinds of \"media\". There is the kind that claim to be neutral, unbiased reporters - The NY Times, CNN, ABC, NBC, and yes, Fox news. They are different from the Limbaugh, Coulter, Air America kind. That's the kind that freely admits that they begin with a bias towards one side - that they are at least somewhat in the entertainment business. They all do have one basic thing in common however, they seek attention, and profit. \n \n But somewhere, bright and early every morning, what will and will not become news for that day has to originate at one point somewhere, for all the rest to take off running with, and that point is one of the oldest, biggest, eastern most U.S. cities, the city of New York, at it's biggest paper, the New York Times. That's how the news starts off with a left wing slant, and since its bias doesn't represent the views of mainstream America, there is a market for the entertainment media sources that analyze it and counter it, sources like Limbaugh, Coulter, etc. Few people listen to Air America because they can hear most of it on CNN - NBC. Limbaugh and Coulter say things that don't make it to CNN - NBC. \n \n \n \nMarc, pull out your map of the US and point out Saskatoon, Saskatchewan to me. Believe it or not, the US is not the center of the world.\n\n \n But if your friends and family are going to express shock, amusement, disgust and pity over the opinions of ONE American, wouldn't it make sense for them to get some basic information on the opinions of ALL Americans before condemning just one? Would they express shock, amusement, disgust and pity if they knew that in about one month, Americans are going to take a Thursday off and give thanks to their Creator?\n \n Before I form an opinion about ONE non U.S. resident's political or religious opinion of HIS country, I'm going to inform myself about the basics of what's going on in his country before I express shock, amusement, disgust, and outrage about his comments. I guess I'm different than you and your friends and relatives. Yet you've called ME arrogant? \n \n \n \n \nNice to see you've allied yourself with Ann Coulter. Let's look at some of her greatest hits: \n\n \n Her worldview and mine are almost competely identical, yes. I can't identify everything that the cherry pickers attribute to her with a certain context, but I'll do my best;\n \n \n\"Without affirmative action, African-American Rep. Maxine Waters (D-CA): couldn't get a job \"that didn't involve wearing a paper hat\" \n \n \"When we were fighting communism, OK, they had mass murderers and gulags, but they were white men and they were sane. Now we're up against absolutely insane savages.\" \n ---<Ok, so she's racist. Got it. Are you? \n\n \n Racism goes both ways. Perhaps she was countering it. Do racists like Malcolm X, Louis Farradhan, Sister Souljah, and countless others always get a free pass? On the sane white men one, she sees a difference between our conflicts of the past and today's terrorism. So do I.\n \n \n\"We should invade their countries, kill their leaders and convert them to Christianity. We weren't punctilious about locating and punishing only Hitler and his top officers. We carpet-bombed German cities; we killed civilians. That's war. And this is war.\" \n ---<She thinks Christians should kill all who disagree and convert the survivors? Do you? \n\n \n She didn't say \"all who disagree\". She said we should fight wars the same today as in the past, nothing more. \n \n \n\"[Canadians] better hope the United States does not roll over one night and crush them. They are lucky we allow them to exist on the same continent.\" \n ---<She thinks we Canadians are lower than Americans, and survive by the US's whims. Do you agree? \n\n \n She didn't use the word \"lower\". Canada, like America, has a certain (small) percentage of 'blame America first' mentality. I have heard that Canada's military is smaller than the police force of New York. I believe that Canada is well covered by the U.S. military umbrella, and it saves them untold bundles of money and intelligence. I think a certain percentage of them don't appreciate it, and those are the ones Coulter was referring to. \n \n \n\"Being nice to people is, in fact, one of the incidental tenets of Christianity (as opposed to other religions whose tenets are more along the lines of 'kill everyone who doesn't smell bad and doesn't answer to the name Mohammed')\". \n \n ---<So that whole \"love\" thing that Christ was preaching wasn't really the point. What was the main point of Christ's teachings Marc? \n\n \n She just said being nice to people (love) IS THE POINT - that the religions that are hostile to Christianity don't do it. \n \n \n\"The ethic of conservation is the explicit abnegation of man's dominion over the Earth. The lower species are here for our use. God said so: Go forth, be fruitful, multiply, and rape the planet--it's yours. That's our job: drilling, mining and stripping. Sweaters are the anti-Biblical view. Big gas-guzzling cars with phones and CD players and wet bars -- that's the Biblical view.\" \n \n \"God gave us the earth. We have dominion over the plants, the animals, the trees. God said, 'Earth is yours. Take it. Rape it. It's yours.'\" \n ---<Do you agree Marc? Is the planet that god provided here to be used and abused? \"Raped\", as she says? Did god mean that we should utterly despoil his creation? \n\n \n Not much question that she's responding to charges and attacks by environmentalists. Charges that only an elite few environmentalists are qualified to define exactly what \"conservation\" and \"dominion\" mean. Claims that to save an endangered species of fly, a badly needed hospital can't be built. \n \n There are only two ways to determine what they mean - let the people decide on an individual basis, or let the government decide, on whatever basis the government chooses. Her word \"rape\" is a strong word - it's made to get a point across. \n \n \n \n \n\"They're [Democrats] always accusing us of repressing their speech. I say let's do it. Let's repress them. Frankly, I'm not a big fan of the First Amendment.\" \n ---<How bout it Marc? Would you like it if the governing party could decide what was right to say, and what was illegal? \n\n \n That's an expression of outrage at anti-American speech. My guess is that she believes that the U.S. founders couldn't have imagined today's hatred of this country from within. I agree. \n \n \nVESTER: \"You say you'd rather not talk to liberals at all?\" \n COULTER: \"I think a baseball bat is the most effective way these days.\" \n\n \n Maybe she's been reading here, noting the liberals I've been talking too. :p \n \n \n\"My only regret with Timothy McVeigh is he did not go to the New York Times building.\" \n (re: the above)\n \"Of course I regret it. I should have added 'after everyone had left the building except the editors and the reporters.'\" \n \n ---<So we see she's all for murder and abuse, as long as it's people that disagree with her. Do you agree Marc? \n\n \n She didn't say she's for murder and abuse of just anyone who disagrees with her, maybe just for those who she believes would murder and abuse her, the editors and reporters of the New York Times. \n \n \nYep, that's some Christian woman there Marc...\n\n \n She really is. On two recent early morning talk segments on a local Christian radio station, she's been talking with James Dobson, a well known, soft spoken Christian man. He of course takes some exception to her bluntness, but admires her and mostly agrees with her. \n \n Here are a few snips from a Charlotte Allen interview;\n \n \n \nQ)You say you're a Christian. Do you think Jesus would want you to be nicer to your political opponents? \n \n A)Who knows? Maybe He'll say I was too tough or maybe He'll chastise me for not being tough enough on those who hate Him. Ask the money-changers in the temple how \"nice\" Jesus was. Maybe He'll say I needed more jokes or fewer adjectives. I'll just apologize for not getting it right and thank him for dying for my sins. \n \n Q)What does it mean to be a good Christian, and do you consider yourself to be a good Christian? \n \n A)To believe with all your heart at every moment that God loved a wretch like you so much that he sent his only son to die for your sins. Most of the time, I'm an extraordinarily good Christian. \n \n Q)Do you attend church frequently? Do you pray, and whom and what do you pray for? \n \n A)Yes and yes. I pretend to attend a giant church in New York City, where I pray for the souls of people who claim I've never been there. I pray for mercy and divine protection from God's enemies. When I'm in a jaunty mood, I pray for Him to smite liberals. \n \n Q)What's your favorite Bible verse, if you have one (besides \"By their fruits you shall know them\")?\n \n A)I don't have a favorite, they're all pretty good. Among some I like are: \n \n \"So do not be afraid of them. There is nothing concealed that will not be disclosed, or hidden that will not be made known. What I tell you in the dark, speak in the daylight; what is whispered in your ear, proclaim from the roofs. Do not be afraid of those who kill the body but cannot kill the soul. Rather, be afraid of the One who can destroy both soul and body in hell.\" (Matthew 10: 26-28) \n\n \n I've quickly glanced over your grand total of 54 posts over 2 years and 4 months. About 90% of them seem to serve little purpose other than to personally attack another poster here. As a suggestion, you could maybe lessen your troll factor some if you'd try this - rather than parrotting some cherry picked, out of context Ann Coulter quotes, try reading one of her entire books - her latest \"Godless\" would probably be the best choice as it is most relevant to what has been going on here lately. Then do the same thing that I did with Kenneth Miller's book, find some complete areas of it that you don't understand or agree with, and start a thread on it, and we'll discuss it. \n \n I'll hold my breath.", 
   {
    "unicode_changes_made": true
   }, 
   236258, 
   null, 
   1161749100.0
  ], 
  [
   236443, 
   null, 
   "Hi_Its_Me", 
   "I don't anger you, but I \"upset\" you? You show my posts to your friends and family, \"everyone\" else here PM's you to tell how wrong I am - don't these things take time and effort? Does being \"upset\" justify all this action, or could it be anger?\n\n My guess was that the PMing was a joke. Not only that, but you missed it.\n Of course, I could ask if you yourself were upset, but you wouldn't answer according to your logic...\n \nWould they express shock, amusement, disgust and pity if they knew that in about one month, Americans are going to take a Thursday off and give thanks to their Creator?\n\n Not all. I know I won't.\n I will observe the holiday, but I will not do it for religious reasons. I imagine that applies to many other Americans, too.\n \n I also think that his point was your arguments were of poor quality (to use a euphemism). This didn't have to do with your beliefs; it had to do with your ability to support them. Of course, I can't be sure of this, but I think I got it right...\n \nThat's an expression of outrage at anti-American speech. My guess is that she believes that the U.S. founders couldn't have imagined today's hatred of this country from within. I agree. \n\n The point of \"freedom of speech\" is to allow people to make negative comments about the country. The point? Avoiding a \"control freak\" government.\n \nMaybe she's been reading here, noting the liberals I've been talking too. :p \n\n And would you attack us with a baseball bat rather than argue? I thought you said something about persistance?", 
   {}, 
   236442, 
   null, 
   1161750240.0
  ], 
  [
   236446, 
   null, 
   "T.Q", 
   "You're right, I haven't used those words, I've used logic and revelant questioning of them in several rounds of back and fourth discussion to expose their gaps and 180's in their logic. What \"you see\" in what I \"consider\" is really not my problem.\n\n Anyone else want to weigh in with their opinions here? What's the rest of the boards opinion? Am I wrong in inferring that Marc accused Kenneth Miller of being an atheist shill? Did I dream up the idea that Marc denies there is such a thing as a theistic evolutionist? \n \n \nDoes being \"upset\" justify all this action, or could it be anger?\n\n Actually, it's amusement more than anything.\n \n \nBut somewhere, bright and early every morning, what will and will not become news for that day has to originate at one point somewhere, for all the rest to take off running with, and that point is one of the oldest, biggest, eastern most U.S. cities, the city of New York, at it's biggest paper, the New York Times.\n\n The New York Times is the source for all news for every media outlet in the US?\n \n \nFew people listen to Air America because they can hear most of it on CNN - NBC. Limbaugh and Coulter say things that don't make it to CNN - NBC\n\n Using this logic, shouldn't Fox news have failed as well? Fox/Coulter/Limbaugh all have the same approach (vilification and vitrolic), so shouldn't one or the other be out of business as well?\n \n \nBut if your friends and family are going to express shock, amusement, disgust and pity over the opinions of ONE American, wouldn't it make sense for them to get some basic information on the opinions of ALL Americans before condemning just one?\n\n Marc, if you're views are the same as the majority of Americans, then it really is no wonder the US' global image has fallen so far.\n \n \n Yet you've called ME arrogant?\n\n Yep, and I stand by that statement.\n \n \nHer worldview and mine are almost competely identical, yes.\n\n My opinion of you has officially sunk as low as it can go.\n \n \n I can't identify everything that the cherry pickers attribute to her with a certain context, but I'll do my best;\n\n Oh, cherry pickers, is it? When someone threatens those who hold opposing views with violence and death, I think they've lost any right to lay claim to being a Christian.\n \n \nDo racists like Malcolm X, Louis Farradhan, Sister Souljah, and countless others always get a free pass?\n\n I thought we were going to look at context? You're comparing a rich white woman who was educated at an Ivy League university to Malcom X?\n \n \nOn the sane white men one, she sees a difference between our conflicts of the past and today's terrorism. So do I.\n\n So, in your mind, it's alright to paint an entire race as \"absolutely insane savages\"?\n \n \nShe didn't say \"all who disagree\".\n\n It was implied.\n \n \n She said we should fight wars the same today as in the past, nothing more.\n\n So according to you, WW II was a religous war? \n \n \nShe didn't use the word \"lower\".\n\n Implied\n \n \n I think a certain percentage of them don't appreciate it, and those are the ones Coulter was referring to.\n\n Oh, so threatening a peaceful nation is just her way of showing she cares?\n \n \nBeing nice to people is, in fact, one of the incidental tenets of Christianity\n\n Let's look at the thesauras entry for incidental, shall we?\n \n Roget's New Millennium&#8482; Thesaurus - Cite This Source\n Main Entry: incidental\n Part of Speech: adjective\n Definition: related\n Synonyms: accidental, accompanying, adventitious, ancillary, attendant, by-the-way*, casual, chance, circumstantial, coincidental, concomitant, concurrent, contingent, contributing, contributory, fluke*, fortuitous, irregular, minor, nonessential, occasional, odd, random, secondary, subordinate, subsidiary\n\n So she's saying that being nice to people is an accidental, casual, circumstantion, or secondary tenet of Christianity. You agree with that assessment Marc? I guess you do. You already said that you agree with her on pretty much everything. So what is the primary tenet of christianity if it's not kindness and love?\n \n \nNot much question that she's responding to charges and attacks by environmentalists.\n\n What exactly do \"charges and attacks by environmentalists\" consist of?\n \n \nCharges that only an elite few environmentalists are qualified to define exactly what \"conservation\" and \"dominion\" mean.\n\n Ah, here we see another example of Marc's inferiority complex at work. You don't like the idea that there are people who are more educated and better able to speak on a subject than you, do you Marc? Who else would be better qualified to speak on a subject that someone who has spent the majority of their life studying that subject?\n \n \nClaims that to save an endangered species of fly, a badly needed hospital can't be built.\n\n Or that we can't drill for oil in a nature preserve, or clear cut a forest, or strip mine a plain, right Marc? After all, what use are all these bugs and trees and animals, right?\n \n \nThat's an expression of outrage at anti-American speech. My guess is that she believes that the U.S. founders couldn't have imagined today's hatred of this country from within. I agree.\n\n Right, because that whole pesky freedom of speech thing in the constitution was only meant to apply to happy thoughts.\n \n \nMaybe she's been reading here, noting the liberals I've been talking too.\n\n At least you don't even attempt to defend this remark. By the way, why is liberal a dirty word to you guys?\n \n \nShe didn't say she's for murder and abuse of just anyone who disagrees with her, maybe just for those who she believes would murder and abuse her, the editors and reporters of the New York Times.\n\n Marc, do you know the meaning of the word \"libel\". I'd say stating that the editors and reporters of the NYT would find your proposal that they are planning the murder and torture of a woman to be libel.\n \n Never mind the fact that your response has absolutely nothing to do with the context of the quote. Remember, you were going to put these quotes in context for us here.\n \nshe's been talking with James Dobson, a well known, soft spoken Christian man.\n\n Ah, Dobson, let's see here...\n \n \n\"In World War II, the Nazis experimented on human beings in horrible ways in the concentration camps, and I imagine, if you wanted to take the time to read about it, there would have been some discoveries there that benefited mankind... You know, if you take a utilitarian approach, that if something results in good, then it is good. But that's obviously not true. We condemn what the Nazis did because there are some things that we always could do but we haven't done, because science always has to be guided by ethics and by morality. And you remove ethics and morality, and you get what happened in Nazi Germany.\"\n\n Yes, because stem cell research is definitely on a level with the Nazi atrocities, and the comparison of stem cell researchers to Nazi's is definitely valid.\n \n and about the Foley scandal:\n \nWe condemn the Foley affair categorically, and we also believe that what Mr. Clinton did was one of the most embarrassing and wicked things ever done by a president in power. Let me remind you, sir, that it was not just James Dobson who found the Lewinsky affair reprehensible. More than 140 newspapers called for Clinton's resignation. But the president didn't do what Mr. Foley has done in leaving. He stayed in office, and he lied to the grand jury to obscure the facts. As it turns out, Mr. Foley has had illicit sex with no one that we know of, and the whole thing turned out to be what some people are now saying was a -- sort of a joke by the boy and some of the other pages.\n\n Yeah, those pesky teenage boys, always playing pranks on their elders. \n How is Clinton getting a BJ from an intern worse than a Congressman trying to solicit sex from underage boys? Please, make the equation for me.\n \n \n\"Homosexuals are not monogamous. They want to destroy the institution of marriage. It will destroy marriage. It will destroy the Earth.\"\n\n No hyperbole here. Everyone knows homos are sex fiends out to destroy the world.\n \n \n\"Christians have made arguments on both sides of this question. I certainly believe that God is displeased with America for its pride and arrogance, for killing 40 million unborn babies, for the universality of profanity and for other forms of immorality. However, rather than trying to forge a direct cause-and-effect relationship between the terrorist attacks and America&#8217;s abandonment of biblical principles, which I think is wrong, we need to accept the truth that this nation will suffer in many ways for departing from the principles of righteousness. \"The wages of sin is death,\" as it says in Romans 6, both for individuals and for entire cultures.\n\n Yep, couldn't be foreign policy, it's all because Americans don't go to church enough.\n \n \nI've quickly glanced over your grand total of 54 posts over 2 years and 4 months.\n\n Quality, not quantity my man.\n \n \nAbout 90% of them seem to serve little purpose other than to personally attack another poster here.\n\n Did you show your work when you did your calculations?\n \n \nAs a suggestion, you could maybe lessen your troll factor some if you'd try this\n\n Ooo, this'll be good...\n \n \nrather than parrotting some cherry picked, out of context Ann Coulter quotes, try reading one of her entire books\n\n I've struggled through her articles and watched interviews with her. There's only so much hatred and ignorance a man can stomach, and reading one of her books definitely passes that threshold.\n \n \nher latest \"Godless\" would probably be the best choice as it is most relevant to what has been going on here lately.\n\n Yeah, I've read excerpts. See the above \"hatred and ignorance\" line.\n \n \nThen do the same thing that I did with Kenneth Miller's book\n\n Completely miss the point and misrepresent it? Well, I'll give it a shot...\n \n \nfind some complete areas of it that you don't understand\n\n Doubtful.\n \n \nor agree with\n\n I've seen quite a bit of her work, so I can tell you how much I agree with. Seems Ann admits she knows nothing about science, so when it came time in her book to tear down evolution, she went to the \"experts\":\n \n\"I couldn't have written about evolution without the generous tutoring of Michael Behe, David Berlinski, and William Dembski&#8230;\n\n \n By the way, here's a few threads for you to look at Marc:\n http://www.talkreason.org/articles/coulter1.cfm\n http://www.talkreason.org/articles/coulter2.cfm\n http://www.talkreason.org/articles/coulter3.cfm\n \n Or did they \"cherry-pick\" poor Ann too?\n \n \nI'll hold my breath.\n\n OK, have fun\n \n \nMy guess was that the PMing was a joke. Not only that, but you missed it. Of course, I could ask if you yourself were upset, but you wouldn't answer according to your logic...\n\n DING! That man gets a cee-gar!\n \n \nI also think that his point was your arguments were of poor quality (to use a euphemism). This didn't have to do with your beliefs; it had to do with your ability to support them. Of course, I can't be sure of this, but I think I got it right...\n Quote:\n\n \n And another one!", 
   {}, 
   236443, 
   null, 
   1161757980.0
  ], 
  [
   236568, 
   null, 
   "marc9000", 
   "Anyone else want to weigh in with their opinions here? What's the rest of the boards opinion? Am I wrong in inferring that Marc accused Kenneth Miller of being an atheist shill? \n\n \n Well, I don't know that I've \"accused\" him, but I suspect it. The responses to my thread about him have done nothing to change my mind. I thought by now that someone would have taken the initiative to copy a complete thought/paragraph from the book and challange me with it. No one has however. There is more to the book I want to explore. I'll wait a while longer for tempers to cool. emoticon_xangel \n \n \n Did I dream up the idea that Marc denies there is such a thing as a theistic evolutionist? \n\n \n Seems that I haven't found one yet who is willing to discuss the basics of Christianity with me. It could happen however, and maybe I'll change my mind. \n \n \n \nActually, it's amusement more than anything. \n\n \n Amusement / upset - do you confuse those words often?\n \n \n \nThe New York Times is the source for all news for every media outlet in the US? \n\n \n For basic national and international news, yes. \n \n \n \nUsing this logic, shouldn't Fox news have failed as well? Fox/Coulter/Limbaugh all have the same approach (vilification and vitrolic), so shouldn't one or the other be out of business as well? \n\n \n Fox is not the same as talk radio or opinion writers. They claim, and report news as a source of factual information, to the same extent as CNN, ABC, NBC etc. They're slanted to the right to a comparable degree as all the others are slanted to the left. Fox anchors have opinions to the same degree as the others. Katie Couric is an NBC anchor - here is one of her quotes;\n \n \n\"To quote my daughter, who made us the boss of them?\"\n\n \n Her daughter undoubtedly gets a heavy dose of liberalism around the house, doesn't she? Fox news anchors are no more biased than that. Here's a little information about CNN for you too. \n \n \nThat video was given to CNN by terrorists in order to demoralize the American people about the hopelessness of Iraq just before midterm elections. And CNN did exactly what the terrorists wanted, and CNN knows it. \n\n \n http://www.townhall.com/Columnists/BrentBozellIII/2006/10/25/cnn,_stenographer_to_terror\n \n \n \nMarc, if you're views are the same as the majority of Americans, then it really is no wonder the US' global image has fallen so far. \n\n \n \"Fallen so far\" - as reported by CNN?\n \n \n \nYep, and I stand by that statement. \n\n \n Even after I clearly showed one example of how you and your friends a family are MORE arrogant. Must be an evolutionist trait. \n \n \n \nOh, cherry pickers, is it? When someone threatens those who hold opposing views with violence and death, I think they've lost any right to lay claim to being a Christian. \n\n \n Non Christians often seem to assume the knowledge of being able to judge someone else's status as a Christian. Again, must be an evolutionist trait. \n \n \n \nThe white man is our mortal enemy, and we cannot accept him. I will fight to see that vicious beast go down into the late of fire prepared for him from the beginning, that he never rise again to give any innocent black man, woman or child the hell that he has delighted in pouring on us for 400 years -- Louis Farrakhan, City College audience in New York \n \n I mean, if black people kill black people every day, why not have a week and kill white people? You understand what I'm saying? In other words, white people, this government and that mayor were well aware of the fact that black people were dying every day in Los Angeles under gang violence. So if you're a gang member and you would normally be killing somebody, why not kill a white person? Do you think that somebody thinks that white people are better, or above dying, when they would kill their own kind? -- Sister Souljah In A Washington Post Interview, 1992 \n\n \n I guess the disadvantage of being a Christian is that when you respond to hate in a similar way, you're branded as non Christian, but when you're Mr. Farrakhan or Ms. Souljah, your belief system isn't questioned.\n \n \n \nI thought we were going to look at context? You're comparing a rich white woman who was educated at an Ivy League university to Malcom X? \n\n \n What do their backgrounds have to do with it? What matters is what they say, and how much press it gets. \n \n \n \nSo, in your mind, it's alright to paint an entire race as \"absolutely insane savages\"? \n\n \n Not an entire race (still another strawman) she was referring to terrroists. \n \n \n \nSo according to you, WW II was a religous war? \n\n \n War is war, when people are being threatened or killed. What are we supposed to do, be kinder and gentler to the enemy when they claim to be representing their religion? \n \n \n \nOh, so threatening a peaceful nation is just her way of showing she cares? \n\n \n Yes, to alert them to the few in their midst that may not have their countries' best interests at heart. \n \n \n \n \n \nLet's look at the thesauras entry for incidental, shall we?\n \n So she's saying that being nice to people is an accidental, casual, circumstantion, or secondary tenet of Christianity. You agree with that assessment Marc? I guess you do. You already said that you agree with her on pretty much everything. So what is the primary tenet of christianity if it's not kindness and love? \n\n \n I recognize her sarcasm. When she said it was \"incidental\", she was being sarcastic about just how primary it actually is. I'm sure she didn't expect her enemies to understand that, and I'll bet she doesn't care. I don't either. \n \n \n \nWhat exactly do \"charges and attacks by environmentalists\" consist of? \n\n \n The U.S EPA is a multi billion dollar bureaucracy. It and countless \"non profit\" environmental organizations are heavily involved in private property usage, and industrial decisions that have dramatic effect on the U.S. economy, and personal liberty of its citizens. Almost all of it without a formal voice of the people. \n \n \n \nAh, here we see another example of Marc's inferiority complex at work. You don't like the idea that there are people who are more educated and better able to speak on a subject than you, do you Marc? \n\n \n I don't mind them speaking on it. But I do mind them ramming it down the throats of the U.S. citizenry, in violation of the U.S. Constitution. You see, the words \"better educated and better able to speak\" don't appear there. \n \n \n Who else would be better qualified to speak on a subject that someone who has spent the majority of their life studying that subject? \n\n \n The people who own the property that's involved in the subject, that's who, not those who may seek personal gain in controlling someone else's property. Private citizens who are seeking life, liberty, and persuit of happiness are the qualified ones. \n \n \n \nOr that we can't drill for oil in a nature preserve, or clear cut a forest, or strip mine a plain, right Marc? After all, what use are all these bugs and trees and animals, right? \n\n \n Exactly right. If there's a question, nothing but the proper political process should determine it. \n \n \n \nRight, because that whole pesky freedom of speech thing in the constitution was only meant to apply to happy thoughts. \n\n \n There is a difference between Americans speaking against leadership, and Americans speaking against America. \n \n \n \nAt least you don't even attempt to defend this remark. By the way, why is liberal a dirty word to you guys? \n\n \n Thomas Sowell can say it better than me;\n \n \nIncreasing numbers of people seem to think that it is \"name-calling\" if you refer to someone as a liberal. There are no inherently negative connotations to the word \"liberal.\" If it has acquired negative overtones, that is because of what liberals have done and the consequences that have followed. \n\n \n By the way, Sowell is a black man, and he also said this, in the very next paragraph;\n \n \nDorothy Parker's sharp-witted writings used to cut through a lot of nonsense. Ann Coulter is the Dorothy Parker of our time -- an industrial strength Dorothy Parker. \n\n \n http://www.townhall.com/columnists/column.aspx?UrlTitle=random_thoughts&ns=ThomasSowell&dt=08/29/2006&page=2\n \n \n \n \nMarc, do you know the meaning of the word \"libel\". I'd say stating that the editors and reporters of the NYT would find your proposal that they are planning the murder and torture of a woman to be libel. \n\n \n You think they are going to sue me? emoticon_cry \n \n \nYeah, those pesky teenage boys, always playing pranks on their elders. \n How is Clinton getting a BJ from an intern worse than a Congressman trying to solicit sex from underage boys? Please, make the equation for me. \n\n \n Not a problem. Clinton's BJ was WORLD NEWS, and national news for many days, overshadowing most other news. School children all across the country were thinking about it and joking about it. A serious backwards step in morality. The Foley episode didn't compare, but don't get me wrong, I could cheerfully smack that idiot Foley with a baseball bat. \n \n \n \n \nQuality, not quantity my man. \n\n \n Personal attacks are quality? Must be that evolutionist thing again. \n \n \n \nDid you show your work when you did your calculations?\n\n \n Not worth taking the time. Anyone can see it who cares to look. \n \n \n \nI've struggled through her articles and watched interviews with her. There's only so much hatred and ignorance a man can stomach, and reading one of her books definitely passes that threshold. \n\n \n Well I read Kenneth Miller's book and felt as least somewhat the same way. Does this mean Christians are more tolerant and willing to learn than are evolutionists? \n \n \n \n \nI've seen quite a bit of her work, so I can tell you how much I agree with. Seems Ann admits she knows nothing about science, so when it came time in her book to tear down evolution, she went to the \"experts\": \n\n \n So if she wouldn't have gone to experts, you would have said that was all right? :p Actually, she knew she needed the scientific experts for some things, and realizing that science isn't the only source of knowledge, used it and other sources to take an overall look at \"The Scientific Method of Stoning and Burning. (chapter 10) \n \n \n \nBy the way, here's a few threads for you to look at Marc:\n http://www.talkreason.org/articles/coulter1.cfm\n http://www.talkreason.org/articles/coulter2.cfm\n http://www.talkreason.org/articles/coulter3.cfm\n \n Or did they \"cherry-pick\" poor Ann too? \n\n \n A lot of time and recources are spent trying to tear her down. Not surprising. \n \n \n \nI also think that his point was your arguments were of poor quality (to use a euphemism). This didn't have to do with your beliefs; it had to do with your ability to support them. Of course, I can't be sure of this, but I think I got it right...\n\n \n That's gotta be it! He doesn't have a bit of trouble with my beliefs, only my ability to convey them in a quality way!! :xbanghead :)", 
   {}, 
   236446, 
   null, 
   1161830880.0
  ], 
  [
   236586, 
   null, 
   "T.Q", 
   "Well, I don't know that I've \"accused\" him, but I suspect it.\n\n Even when you admit I'm right, you have to try and spin it, don't you?\n \n \nThe responses to my thread about him have done nothing to change my mind.\n\n If the man's own words don't convince you, what possible hope could someone else have? Marc, take a step back and just listen to yourself for a second. See if you can pick up on the inanity.\n \n \nSeems that I haven't found one yet who is willing to discuss the basics of Christianity with me. It could happen however, and maybe I'll change my mind. \n\n Oh, you've found a few. Problem is, you refuse to listen to them. \n \n \nAmusement / upset - do you confuse those words often?\n\n No, can't say as I do. How bout yourself? Seems I have you pretty steamed though. After all, you're taking all this time and effort to respond to me. By your own standards, that means I've upset you. Then there's the fact you were \"yelling\" at Lucapsa in this thread a couple days ago. I'd say if anyone's temper needs to cool off Marc, it would be yours.\n \n \nFor basic national and international news, yes.\n\n Source?\n \n \nFox is not the same as talk radio or opinion writers.\n\n It's not the same as a news agency, that's for sure.\n \n [snip random quote that serves no purpose]\n \n \nHer daughter undoubtedly gets a heavy dose of liberalism around the house, doesn't she? Fox news anchors are no more biased than that.\n\n While I'll agree with you that Fox anchors and a small child are roughly equivalent when it comes to journalistic skills, what the hell was your point here?\n \n \nHere's a little information about CNN for you too.\n\n OH MY GOD! You're so right! How could CNN, a news agency, report the news!?!?! What the hell were they thinking!?!?\n \n Oh, and in the article, they are insurgents, not terrorists. Even Bush now admits that there were no terrorists in Iraq (well, before the US invaded anyways). \n I see why you like the site Marc. It seems right up your alley. I really liked the article where they accused Michael J. Fox of faking the symptoms of his incurable, fatal disease to get some sympathy votes for a candidate who supports stem cell research that may have the hope of a cure for him. Classy all the way.\n \n \n\"Fallen so far\" - as reported by CNN?\n\n You really are quite clueless as to what goes on outside your little bubble, aren't you?\n \n \nEven after I clearly showed one example of how you and your friends a family are MORE arrogant. Must be an evolutionist trait. \n\n I think you're using a different definition of arrogant that I am.\n \n \nNon Christians often seem to assume the knowledge of being able to judge someone else's status as a Christian. Again, must be an evolutionist trait. \n\n Hey, if you want to claim her as a kindred spirit, be my guest. Please tell me how I'm wrong though. If someone threatens death and violence to any and all who disagree with them, would you consider them a good christian? No waffling now Marc, yes or no? Really, if my understanding of christianity is that bad, then my apologies.\n \n \nI guess the disadvantage of being a Christian is that when you respond to hate in a similar way, you're branded as non Christian, but when you're Mr. Farrakhan or Ms. Souljah, your belief system isn't questioned.\n\n I definitely won't attempt to defend those quotes, as hate and threats of violence solve nothing. Hey, lookie there, I proved my point.\n \n \nWhat do their backgrounds have to do with it? What matters is what they say, and how much press it gets.\n\n .... \n Uh, I'm pretty much stunned by this one\n ...\n Wow...\n \n \nNot an entire race (still another strawman) she was referring to terrroists. \n\n Tsk Marc. I thought we were looking at context here.\n \n \nWar is war, when people are being threatened or killed. What are we supposed to do, be kinder and gentler to the enemy when they claim to be representing their religion? \n\n You didn't answer my question. Not surprising, since you missed the point. Yes, the US is at war. The US was at war in Germany. However the US, in WW II, did not \"..invade their countries, kill their leaders and convert them to Christianity\". Context Marc. You told me you were going to look at it...\n \n \nYes, to alert them to the few in their midst that may not have their countries' best interests at heart. \n\n Wow...\n \n \nThe U.S EPA is a multi billion dollar bureaucracy.\n\n But, that's what you wanted, isn't it? From your last post:\n \n \nThere are only two ways to determine what they mean - let the people decide on an individual basis, or let the government decide, on whatever basis the government chooses.\n\n Like, I don't know, setting up an agency specifically devoted to environmental issues maybe?\n \n [snip] ranting about conspiracy theories[/snip]\n \n \n \nI don't mind them speaking on it. But I do mind them ramming it down the throats of the U.S. citizenry, in violation of the U.S. Constitution. You see, the words \"better educated and better able to speak\" don't appear there. \n\n Marc, If your drains are stopped up and your house is flooding with sewage, do you call a neighbourhood prayer meeting, or do you call a plumber?\n \n \nThe people who own the property that's involved in the subject, that's who\n\n Uh huh, with you so far...\n \n \nnot those who may seek personal gain\n\n Ooo, and you lost me again.\n \n \nPrivate citizens who are seeking life, liberty, and persuit of happiness are the qualified ones. \n \n Exactly right. If there's a question, nothing but the proper political process should determine it. \n \n\n I really don't have time to give a basic ecology lesson, so you'll just have to trust me on this Marc: Species are interdependant. If a species environment is altered/destroyed, the species can/will die. If one species dies, many other species die, like dominoes.\n \n \nThere is a difference between Americans speaking against leadership, and Americans speaking against America. \n\n Exactly, yet somehow neo-cons have erased that difference, and call questioning the actions of the government treason.\n \n \nThomas Sowell can say it better than me;\n\n Ok, what have liberals done, and what are the consequences? Nice generalization- \"Sure, we use liberal as an insult, but it's only because you're a liberal\"\n \n \nBy the way, Sowell is a black man\n\n And?\n \n \nand he also said this, in the very next paragraph;\n \n \n \n http://www.townhall.com/columnists/column.aspx?UrlTitle=random_thoughts&ns=ThomasSowell&dt=08/29/2006&page=2\n\n And?\n \n \nYou think they are going to sue me? emoticon_cry \n\n Did you catch a glimpse of my point as it went flying overhead?\n \n \nNot a problem. Clinton's BJ was WORLD NEWS, and national news for many days, overshadowing most other news. School children all across the country were thinking about it and joking about it. A serious backwards step in morality. The Foley episode didn't compare, but don't get me wrong, I could cheerfully smack that idiot Foley with a baseball bat. \n\n Oh, so it was a matter of coverage! And who were the ones constantly bringing it up to the public? Which political party was the one who spent tens of millions of dollars investigating Clinton's infidelity? Why, it was the same party that covered for Foley for five years! There is no comparison Marc, and you know it.\n \n \nPersonal attacks are quality? Must be that evolutionist thing again.\n\n Yeah, you know us evolutionists. It's in the EAC charter we have to read before we get our secret decoder rings.\n \n \nNot worth taking the time. Anyone can see it who cares to look.\n\n If calling a spade a spade is insulting, you're right, I have no defense.\n \n \nWell I read Kenneth Miller's book and felt as least somewhat the same way.\n\n Really? So Miller also condones the death and torture of those he disagrees with? Does he also plagarize and use secondary sources with incomplete referencing?\n \n \nDoes this mean Christians are more tolerant and willing to learn than are evolutionists?\n\n Nope, just means I have morals.\n \n Oh ho! You almost snuck that one by me! Didn't catch it until I was re-reading my post. Nice try on sneaking in the \"Christian/Evolutionists\" false dichotomy there. Should I even bother explaining again that Evolution is a secular theory, just like gravity, atomic theory, electricity, aerodynamics, etc, etc? Remember, there are many theistic evolutionists, and just because you call them liars doesn't make it any less true.\n \n \nSo if she wouldn't have gone to experts, you would have said that was all right?\n\n I know nothing about many subjects. That would be why I don't speak on them. All these low flying points going overhead must be playing hell with air traffic in your area Marc.\n \n \nActually, she knew she needed the scientific experts for some things\n\n So she talked to those three?\n \n \nand realizing that science isn't the only source of knowledge\n\n Well, if she wanted non scientific knowledge about the theory of evolution, I guess she went to the right guys after all.\n \n \n \nA lot of time and recources are spent trying to tear her down. Not surprising. \n\n You creationists kill me, you really do. It's hilarious the contortions present in your mind. If no one had critically reviewed the work and pointed out the flaws, you'd declare she was right. If someone takes the time and energy to go over her work and point out the (many) errors, you declare it's because she's right.\n \n \nThat's gotta be it! He doesn't have a bit of trouble with my beliefs, only my ability to convey them in a quality way!! :xbanghead :)\n\n Are you \"full of rage\" Marc? A little upset maybe?", 
   {}, 
   236568, 
   null, 
   1161844620.0
  ], 
  [
   236687, 
   null, 
   "Hi_Its_Me", 
   "Yeah, you know us evolutionists. It's in the EAC charter we have to read before we get our secret decoder rings.\n\n I would avoid saying things like that. Marc will probably take it seriously. He does need all he can get, right?", 
   {}, 
   236586, 
   null, 
   1161903780.0
  ], 
  [
   236691, 
   null, 
   "T.Q", 
   "I would avoid saying things like that. Marc will probably take it seriously. He does need all he can get, right?\n\n \n Good point", 
   {}, 
   236687, 
   null, 
   1161905040.0
  ], 
  [
   236814, 
   null, 
   "electrolyte", 
   "I would avoid saying things like that. Marc will probably take it seriously. He does need all he can get, right?\n\n Quit kidding yourselves. Do you perform CPR on corpses at the morgue? marc went down the path of believing in the EAC a long, long time ago.", 
   {}, 
   236687, 
   null, 
   1161972720.0
  ], 
  [
   236816, 
   null, 
   "electrolyte", 
   "Well, I don't know that I've \"accused\" him, but I suspect it. The responses to my thread about him have done nothing to change my mind. I thought by now that someone would have taken the initiative to copy a complete thought/paragraph from the book and challange me with it. No one has however.\n\n marc's selective amnesia strikes again, with double duty in only his opening paragraph.\n \n For marc to claim that he doesn't know whether he's accused Miller of being a phony only tells us that either marc's selective amnesia is incredibly effective or marc doesn't understand the drivel he posts. Logically, it could be both.\n I challenged marc's labeling Miller as a \"phony\" months -- yes, months ago. Before marc even read Miller's book. marc was forced into this position by his insistence that there are no bona fide theistic evolutionists. This claim has of course repeatedly morphed between theistic evolutionists and Christian evolutionists, but either one disproves his claim that evolution is necessarily atheistic. However, admitting this mistake might crumble marc's holier-than-thou worldview, so I expect him to defend his incompetence until he dies.\n \n Regarding Miller's book, I completed a handful of quotes that marc dishonestly abbreviated and explained the meaning of several pages. Just because I chose not to transcribe four or five solid pages doesn't mean that I haven't challenged marc's comprehension. Despite the thread that marc supposedly started for intelligent discourse, marc's claims have simply reverted back to that which started the ball rolling all these months ago: \"Miller is a phony.\" He has as little evidence for this claim now as he did then. ... but since when does marc care about evidence?", 
   {}, 
   236687, 
   null, 
   1161973500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  so help me out here, correct my logic please", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9046-so-help-me-out-here-correct-my-logic-please.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9046, 
  "discussion_files": [
   [
    "25182.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9046-so-help-me-out-here-correct-my-logic-please-print.html"
   ], 
   [
    "25183.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9046-so-help-me-out-here-correct-my-logic-please-3-print.html"
   ], 
   [
    "25184.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9046-so-help-me-out-here-correct-my-logic-please-2-print.html"
   ]
  ], 
  "identifier": 9046
 }
]