[
 [
  [
   13594, 
   null, 
   "rapture", 
   "Everbody has their own ideal so what's yours\n \n \n \n \n \n \n \n \n Devils unspeakable void of logic and heart\n Evil unbelievable \n Depths not dreamable\n Torment and Agony\n Darkness inconcievable\n Prison inescapable \n The outer darkness\n In the range of mercy? I say not", 
   {
    "post_info": {
     "post_title": "What is Hell?"
    }
   }, 
   null, 
   null, 
   1061769480.0
  ], 
  [
   13642, 
   null, 
   "oshi", 
   "this is probably a well known theory but its one that i agree with.\n people have the power to create hell or heaven as they see it. we are here in heaven or hell, it just depends what we make of it. the dream (reality as we know it) we are living is our creation. its our perseption of reality and we can mold it to be how we wish it to be. we have power to create hell or heaven. we just have to realize we have this power. we make agreements with ourselves throughtout our life. its not our choice to be what religion we are or to believe what we believe, we agree to it all. when we do things people want us to do, we are rewarded, if we do something bad we are punished. we do not want to be punished therefore we mold ourselves to fit the image they have for us. we pretend to be what we are not to please others. we pretend to be what we are not for fear of being rejected. that fear of being rejected becomes a fear of not being good enough. eventully we become someone we are not, a copy of the beliefs around us. this is not good for people, it creates delima in the mind. when we do bad things we punish ourselves, and everytime we think of of what we did we punish ourselves again. that doesnt seem fair. our judge creates a book of laws that we must follow or we will punish ourselves for breaking a law. if we can see its our agreements which rule our life, and we dont like the dream of our life, we need to change the agreements. we can make hell or heaven, i think.", 
   {}, 
   13594, 
   null, 
   1061872860.0
  ], 
  [
   13645, 
   null, 
   "AMD4EVER", 
   "I see what your getting at oshi but don't you think that we need people to conform to a certain way of living in order to have a heaven on earth? If we were all to take our childhood beliefs and let them become our adulthood beliefs, which I suppose would happen if others didn't expect us to change, then we would all be a bunch of selfish spoiled brats who always want to get our way because we all believe the world revolves around us. Now obviously there are people like this right now and do you believe they are truely happy?\n \n Now the Buddist, scientists say they have found sufficient evidence to show that dedicated Buddists are constantly happier than the average person. They spend their lives trying to achieve this goal and I suppose if you try to do anything psychological to yourself for a long enough period of time, you will eventually achieve it. If we had a society that truely believed everyone should search out and find happiness and we removed a lot of the stressful things in this world, we would have something similar to the Buddists and perhaps people would be happier. So perhaps this is exactly what you were talking about in your post when you said we can make our reality whatever we want it to be.\n \n But I can't help but wonder, what would we be giving up in return to have a society like this one? Consider how far we have come as a species because we are always pushing ourselves to achieve the next level of development even if it means self-sacrafic. We can now fight disease, travel by airplane, feed billions of people, fly into outerspace, and do many other amazing things because we haven't settled for simply being happy with what we have in front of us. Maybe one day we will create an artificial way to be eternally happy, perhaps within our life times.\n \n Perhaps I'm just a person who gladly accepts the world as I see it today because society has gradually pushed this idea into my head. Maybe if I was to live my life in order to achieve happiness I wouldn't like the idea of the current society I'm in. But then comes another interesting development in this search for happiness. Wouldn't you agree that ignorance is bliss?", 
   {}, 
   13642, 
   null, 
   1061913420.0
  ], 
  [
   13648, 
   null, 
   "rapture", 
   "I see what your getting at oshi but don't you think that we need people to conform to a certain way of living in order to have a heaven on earth?\n \n \n What are the odds of that", 
   {}, 
   13645, 
   null, 
   1061920380.0
  ], 
  [
   13649, 
   null, 
   "rapture", 
   " fear of being rejected.\n\n \n \n \n If I'm rejected by this world I will rejoice. I never did feel home here. \n \n Out of all the planets/ galaxys/ and times why this one? Questions best left to God", 
   {}, 
   13648, 
   null, 
   1061920800.0
  ], 
  [
   13652, 
   null, 
   "AMD4EVER", 
   "I see what your getting at oshi but don't you think that we need people to conform to a certain way of living in order to have a heaven on earth?\n \n \n What are the odds of that\n\n \n What is heaven then? Heaven is simply a place of happiness and no regrets. Like I said in my post, Buddists strive to achieve that and perhaps they even do achieve that. So if individually we can find or own way to make heaven out of our lives on earth then it is possible for a society to do the same although it will be far more complex.", 
   {}, 
   13648, 
   null, 
   1061927760.0
  ], 
  [
   13678, 
   null, 
   "Chobo Char", 
   "I really find that the scriptures are way to vague on the subject of hell...\n \n These days, hell is more like Mr. Boogieman that tries scare people into going to church.", 
   {}, 
   13652, 
   null, 
   1061950860.0
  ], 
  [
   13686, 
   null, 
   "oshi", 
   "i agree with you mostly\n hell is a state of mind, if we want to bad enough, i think we can change how we feel without changing the rest of the world. different things make different people happy. people should accept the world and its people. but, as a high school student, i see people will never accept others and i hope 'the real world' is a little less ridiculous.\n ingnorance is bliss, i agree. but i'm not too fond of being dumb.", 
   {}, 
   13645, 
   null, 
   1061961420.0
  ], 
  [
   13729, 
   null, 
   "rapture", 
   "These days, hell is more like Mr. Boogieman that tries scare people into going to church\n \n Think of that paraphilic satanic priest killed in prison? Do you think he is in bliss? \n \n \n Any space/time/ or dimension Lucifer doesn't have control of has got to be heaven. I can't think such into existence", 
   {}, 
   13686, 
   null, 
   1062025380.0
  ], 
  [
   14906, 
   null, 
   "rapture", 
   "The evil upon Earth is a foreshadow of a far more fiendish existence. Evil that can't be understood by the human mind.\n \n Earth is not as wicked as it gets, the depths are deeper, much deeper, not a speck of love/logic, not one speck.", 
   {}, 
   13729, 
   null, 
   1063325640.0
  ], 
  [
   14925, 
   null, 
   "gilligan8503", 
   "according to the bible, hell is the absence of god. if this is so, and turns out to be true, i'll be fine, because i've been living that way for years now. :)", 
   {}, 
   14906, 
   null, 
   1063330980.0
  ], 
  [
   14930, 
   null, 
   "epaphras_faith", 
   "according to the bible, hell is the absence of god. if this is so, and turns out to be true, i'll be fine, because i've been living that way for years now. :)\n\n \n You are correct......almost. Hell is not just the absence of God, it is eternal separation from Him, according to the Bible that is. The word eternal is important. The question then becomes, do you (or anyone) believe that your being is eternal or strictly temporal?", 
   {}, 
   14925, 
   null, 
   1063331700.0
  ], 
  [
   14935, 
   null, 
   "AMD4EVER", 
   "You are correct......almost. Hell is not just the absence of God, it is eternal separation from Him, according to the Bible that is. The word eternal is important. The question then becomes, do you (or anyone) believe that your being is eternal or strictly temporal?\n\n \n A thought struck me when reading this. Isn't God everywhere? How can Hell exist if Hell is the absence of God?", 
   {}, 
   14930, 
   null, 
   1063332780.0
  ], 
  [
   14995, 
   null, 
   "epaphras_faith", 
   "A thought struck me when reading this. Isn't God everywhere? How can Hell exist if Hell is the absence of God?\n\n \n Again, not absence but eternal separation. It is a relational word not locational. Plus eternity as a locality, I would venture to say, is significantly different from what we temporally think of as a locality.", 
   {}, 
   14935, 
   null, 
   1063389180.0
  ], 
  [
   15043, 
   null, 
   "Carman", 
   "Hell is the small town where I live..... ha", 
   {}, 
   14995, 
   null, 
   1063429800.0
  ], 
  [
   16194, 
   null, 
   "rapture", 
   "Satan and his minions have full control over the host and rightfully so. Satan will never give one anything without something in return, and all you have is a soul, anyways, sometimes I believe if humans wasn't around to torture the Lost angels would rip each other apart. Now that's entertainment\n \n \n \n The question then becomes, do you (or anyone) believe that your being is eternal or strictly temporal?\n \n \n I believe it can be eternal if God don't toss me to Satan. I don't believe Hell is eternal. I would still feel uneasy knowing Lucifer is living, even if he is burning. God promised he would destroy him and God can't lie. I pray to be a fortified witness to Satan's destruction( A battle worth attending)I feel like I've been waiting for ions", 
   {}, 
   15043, 
   null, 
   1064008380.0
  ], 
  [
   16195, 
   null, 
   "epaphras_faith", 
   "Satan and his minions have full control over the host and rightfully so. Satan will never give one anything without something in return, and all you have is a soul, anyways, sometimes I believe if humans wasn't around to torture the Lost angels would rip each other apart. Now that's entertainment\n \n \n \n The question then becomes, do you (or anyone) believe that your being is eternal or strictly temporal?\n \n \n I believe it can be eternal if God don't toss me to Satan. I don't believe Hell is eternal. I would still feel uneasy knowing Lucifer is living, even if he is burning. God promised he would destroy him and God can't lie. I pray to be a fortified witness to Satan's destruction( A battle worth attending)I feel like I've been waiting for ions\n\n \n It is my understanding that we are eternal beings. Satan's destruction comes after the battle. The battle occurs, Satan is defeated, judgement happens and Satan is tossed to the lake of fire. There is a period somewhere where he is chained for 1000 years and then loosed again. When that is I have no idea.!", 
   {}, 
   16194, 
   null, 
   1064008800.0
  ], 
  [
   16199, 
   null, 
   "sundowner", 
   "Rapture...getting back to your question of the PEDOPHILE, (not paraphilic or whatever you called it) according to you christians, if he accepts god as his savior who died for his sins, then he is sitting with god on a bench by a lake sipping coolaid and dreaming about the next little boy who walks by. i'm sorry, i find the whole heaven / hell thing a little hokey. GOD LOVES YOU SO MUCH, THAT HE WILL SEND YOU TO A PLACE OF ETERNAL FIRE AND TORTURE IF YOU DON'T BELIEVE THAT HIS SON WHO WAS BORN OF A VIRGIN GAVE HIS LIFE TO ATONE FOR YOUR SINS. YOU ARE GOING TO BURN FOREVER AND EVER IN DARKNESS WITH DEVILS, DEMONS, AND PROBABLY BEEGEE'S MUSIC ON THE LOUDSPEAKER BECAUSE YOU CHOSE TO FIND THIS SCENARIO A LITTLE FAR FETCHED...BUT GOD LOVES YOU!", 
   {}, 
   16195, 
   null, 
   1064009340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is Hell?", 
  "url": "http://www.4forums.com/political/religion-debates/905-what-hell.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 905, 
  "discussion_files": [
   [
    "1638.html", 
    "http://www.4forums.com/political/religion-debates/905-what-hell-print.html"
   ], 
   [
    "1639.html", 
    "http://www.4forums.com/political/religion-debates/905-what-hell-2-print.html"
   ]
  ], 
  "identifier": 905
 }
]