[
 [
  [
   235697, 
   null, 
   "lucaspa", 
   "There are several threads on the board equating evolution and atheism. The actual relationship of evolution and atheism is much more complicated than that.\n \n The old top-down philosophy of the 18th and early 19th century had deity on top. Deity made intelligence, which made Design, below Design was Order and below Order was Chaos. In 1802 Paley wrote his famous Natural History: Significantly the subtitle was or, Evidences of the Existence and Attributes of the Deity, Collected from the Appearances of Nature. In this Paley gave the Argument from Design as proof of the existence of deity. The Argument from Design is that you can't have the design in biological organisms without a Designer. At the time, this argument for the designs in organisms was unanswerable. No one knew of any other way to get design except have an intelligece make it. Their experience of design was, of course, human manufacturing. So, since humans made tools for purposes, since living organisms had leaves to catch sunlight, flowers to attract insects, fins for swimming, eyes for seeing, thumbs for using tools, etc. all of these were designs. Since the only known means to get design was to have an intelligence make it, and humans did not make plants and animals, therefore there was God to make plants and animals. \n \n The Argument from Design was so potent that David Hume, as staunch an atheist as ever lived, had conceded this 20 years earlier in his Dialogues Concerning Natural Religion. Hume was able to logically demolish all the other logical \"proofs\" for the existence of deity, but he had to cave in the face of the Argument from Design. Hume tried to qualify his surrender by calling the intelligence \"Mind\", but the use of the capital gave it away. No one knew another Mind capable of the designs in plants and animals except God.\n \n So, Hume's atheism not only was faith, but it was an irrational faith. That is, Hume held his atheism despite evidence to the contrary. Up until 1858, atheism was an irrational faith. Then along comes Darwin and Wallace and they discover an unintelligent process -- natural selection -- that gives the design in biological organisms. Suddenly the Argument from Design as \"proof\" of deity disappears. So, for the first time, atheists have an answer to the Argument from Design. Dawkins makes his famous statement \"Although atheism might have been logically tenable before Darwin, Darwin made it possible to be an intellectually fulfilled atheist.\" Richard Dawkins, The Blind Watchmaker, pg 6. http://www.cis.org.uk/articles/evolution_relig_signif/alexander_01.htm Of course, Dawkins is wrong about the \"logically tenable\" part. Atheism was not logically tenable before Darwin. Atheism had to be held dogmatically in the face of contrary evidence.\n \n Does evolution falsify a Creator? Of course not. Darwin realized this. Even Phillip Johnson realizes this: \"The blind watchmaker thesis makes it possible to be an intellectually fulfilled atheist by supplying the necessary creation story. It does not make it obligatory to be an atheist, because one can imagine a creator who works through natural selection.\" Phillip Johnson Reason in the Balance, pg. 73 \n \n Instead, what natural selection does is remove a \"proof\" of the existence of God. Theists can no longer \"prove\" God exists by appealing to the Argument from Design. The proximate cause for the designs in plants and animals is natural selection. \n \n Now we can understand the continued insistence by creationists that \"natural selection can't account for ....\" argument. It is an attempt to restore the old Argument from Design and take away the intellectual prop for atheism. If natural selection cannot, for instance, make IC structures, then the only other explanation we know of for design is manufacture by an intelligent entity, i.e. God.\n \n However, that isn't necessary to be a theist. Theism can no longer \"prove\" the existence of God by the Argument from Design, but then evolution does not disprove the existence of God, either. Atheism remains a faith even with natural selection in place. It is just that now atheism is a rational faith.", 
   {
    "post_info": {
     "post_title": "Evolution and atheism"
    }
   }, 
   null, 
   null, 
   1161358800.0
  ], 
  [
   235720, 
   null, 
   "Kronus", 
   "An interesting analysis, but I don't agree with you on one point. You say:\n \n \"So, Hume's atheism not only was faith, but it was an irrational faith. That is, Hume held his atheism despite evidence to the contrary.\"\n \n I would maintain that there wasn't any evidence God creating life even before Darwin. All you had was an explanation for observations. The observation is \"there is \"design\" (complexity?) in organisms\". The question is how that could happen. The deists may supply the answer \"God\", and even supply an argument, but that's not the same as having evidence for their answer. Until Darwin there was no evidence to support any claim, so the only honest answer would be \"I don't know\". Hume's disagreement with a claim that wasn't supported by evidence can hardly be called irrational.", 
   {}, 
   235697, 
   null, 
   1161367860.0
  ], 
  [
   235781, 
   null, 
   "electrolyte", 
   "An interesting analysis, but I don't agree with you on one point. You say:\n \n \"So, Hume's atheism not only was faith, but it was an irrational faith. That is, Hume held his atheism despite evidence to the contrary.\"\n \n I would maintain that there wasn't any evidence God creating life even before Darwin. All you had was an explanation for observations. The observation is \"there is \"design\" (complexity?) in organisms\". The question is how that could happen. The deists may supply the answer \"God\", and even supply an argument, but that's not the same as having evidence for their answer. Until Darwin there was no evidence to support any claim, so the only honest answer would be \"I don't know\". Hume's disagreement with a claim that wasn't supported by evidence can hardly be called irrational.\n\n I'm with Kronus. This is just a God of the Gaps argument: \"I don't know how this 'complexity' arose, therefore I know how this complexity arose.\"\n \n Then there's the classic \"if complexity can only be created by the complex, who created the complex creator?\" refutation, which only leads to special pleading.\n \n Another counter (simplified for this brief post) to the teleological argument is that we know not what a God's creations look like unless either we assume we know what God's creations would look like, or God does have creations to use as comparison. This exposes the argument as circular.\n \n To realize how much the teleological argument has done a one-eighty, think back to how Paley insisted that a watch on a desert island is a sure sign of a creator. Now consider the ID movement... Common sense tells me I can see the difference between a watch and the forest in which it was found. An IDist tells me I can't.", 
   {}, 
   235720, 
   null, 
   1161390540.0
  ], 
  [
   235849, 
   null, 
   "lucaspa", 
   "An interesting analysis, but I don't agree with you on one point. You say:\n \n \"So, Hume's atheism not only was faith, but it was an irrational faith. That is, Hume held his atheism despite evidence to the contrary.\"\n \n I would maintain that there wasn't any evidence God creating life even before Darwin. All you had was an explanation for observations. The observation is \"there is \"design\" (complexity?) in organisms\". The question is how that could happen. The deists may supply the answer \"God\", and even supply an argument, but that's not the same as having evidence for their answer.\n\n \n The \"evidence for the answer\" is the original evidence! As you say, the observation was designs in plants and animals. How do you get design? The only valid hypothesis was \"plants and animals were manufactured\". IOW, there was a Designer. Now, the attributes of that Designer were such that the only possible entity that could fulfill them was deity. Deity was the only entity with the power and knowledge necessary to manufacture plants and animals. \n \n What Hume could do was argue against specific versions of deity -- such as Yhwh or even the particular doctrines of Anglicanism. But Hume could not argue against deity itself. Giving it the name \"Mind\" may have salved his pride, but a rose by any other name ... To be an atheist means believing that no deity exists -- of whatever version. \n \n But for atheists pre-Darwin, that meant flying in the face of the evidence: the necessity of deity to manufacture in living organisms. Denying the evidence, and the inevitable conclusions from the evidence, is irrational, is it not?", 
   {}, 
   235720, 
   null, 
   1161447420.0
  ], 
  [
   235854, 
   null, 
   "trebor", 
   "The \"evidence for the answer\" is the original evidence! As you say, the observation was designs in plants and animals. How do you get design? The only valid hypothesis was \"plants and animals were manufactured\". IOW, there was a Designer. Now, the attributes of that Designer were such that the only possible entity that could fulfill them was deity. Deity was the only entity with the power and knowledge necessary to manufacture plants and animals. \n \n What Hume could do was argue against specific versions of deity -- such as Yhwh or even the particular doctrines of Anglicanism. But Hume could not argue against deity itself. Giving it the name \"Mind\" may have salved his pride, but a rose by any other name ... To be an atheist means believing that no deity exists -- of whatever version. \n \n But for atheists pre-Darwin, that meant flying in the face of the evidence: the necessity of deity to manufacture in living organisms. Denying the evidence, and the inevitable conclusions from the evidence, is irrational, is it not?\n\n \n Except, of course, that is ignoring the appearnce of design caused by small variations , and the filter of natural selection. Your assumptions are your conclusions.", 
   {}, 
   235849, 
   null, 
   1161449160.0
  ], 
  [
   235867, 
   null, 
   "electrolyte", 
   "The \"evidence for the answer\" is the original evidence! As you say, the observation was designs in plants and animals. How do you get design? The only valid hypothesis was \"plants and animals were manufactured\". IOW, there was a Designer. Now, the attributes of that Designer were such that the only possible entity that could fulfill them was deity. Deity was the only entity with the power and knowledge necessary to manufacture plants and animals.\n\n So you're just ignoring the counters I provided above? Do you think they are irrational? How are they any more irrational than basing an argument on the premise that \"something is designed\" when you have no basis for concluding that something is designed?", 
   {}, 
   235849, 
   null, 
   1161472080.0
  ], 
  [
   235913, 
   null, 
   "lucaspa", 
   "This is just a God of the Gaps argument: \"I don't know how this 'complexity' arose, therefore I know how this complexity arose.\"\n\n \n Not quite. It was more of an analogy argument: I know intelligent humans make complexity, therefore the complexity in plants and animals arose by an even greater intelligence -- God.\"\n \n Notice that this is the same type of analogical argument Galileo had used: \"I see that moons orbit Jupiter, therefore planets orbit the sun.\"\n \n Obviously an analogical argument has weaknesses. \n \n Within ID NOW we have god-of-the-gaps: \"I don't know how natural selection could have given rise to this particular trait/organ, therefore God must have done it.\"\n \n \nThen there's the classic \"if complexity can only be created by the complex, who created the complex creator?\" refutation, which only leads to special pleading.\n\n \n That's not a refutation. Science works in layers of questions. Answer one question and 3 or 4 more pop up out of the answer. But you can't use an unanswered question that pops up to deny the answer to the previous question. If you allow this as a \"refutation\", then all of science stops. For instance, when Darwin proposed natural selection as the answer to the question: \"how did the designs in plants and animals come to be?\", he proposed variation as part of the answer. But then the question would be: where does variation come from? No answer. What's worse, he proposed heredity as a means of preserving favorable variations. But how was heredity supposed to do this? In the theory of heredity accepted at the time -- blended characteristics -- natural selection doesn't work! The most cogent criticisms of Darwin came from Fleeming Jenson and others pointing this out. So, if we apply your criteria, then scientist should have discarded evolution.\n \n In another example, back to working with BMP. When Urist first proposed that the bone inducting substance was a protein, the next question was: how does it work? No one had the answer. In fact, we STILL don't have the final answer. Does that stop BMP from inducing ectopic bone? Of course not.\n \n So, if you ask the question: where did the designs in plants and animals come from? Or even the question: where did the universe come from? and you answer it by: God manufactured plants and animals or God created the universe, THEN you get to ask the next question: How did God get to be complex? or Where did God come from? But not having the answer to that doesn't negate the first answer.\n \n When Dawkins used the question about complexity in The Blind Watchmaker, he did so with a very specific creationist argument: complexity cannot arise by chance. If that specific argument is used, then and only then does the question: how did God get to be complex? become valid. \n \n \nAnother counter (simplified for this brief post) to the teleological argument is that we know not what a God's creations look like unless either we assume we know what God's creations would look like, or God does have creations to use as comparison. \n\n \n emoticon_confused Let's use the Argument from Design, because evolution also has teleology. As you stated it, this makes no sense. They were deducing that plants and animals are manufactured artifacts. We do the same. We deduced that certain rocks were actually manufactured by H. habilis even tho we had never seen tools like that before. We are going to be able to deduce that artifacts made by sentient aliens are artifacts even tho we are not assuming what these creations look like or have creations to use as comparisons.\n \n \n Paley insisted that a watch on a desert island is a sure sign of a creator. Now consider the ID movement... Common sense tells me I can see the difference between a watch and the forest in which it was found. An IDist tells me I can't.\n\n \n Actually it was a watch on the heath. Yes, you can see the difference, but what is that difference? If you haven't identified it then you are as clueless as IDers are in how we detect manufactured artifacts.\n \n However, IDers have given you a clue. They just ignore it themselves. This is from Behe's Darwin's Black Box:\n \n \"For a simple artificial object such as a steel rod, the context is often important in concluding design. If you saw the rod outside a steel plant, you would infer design. Suppose however, that you traveled in a rocket ship to a barren alien planet that had never been explored. If you saw dozens of cylindrical steel rods lying on the side of a volcano, you would need more information before you could be sure that alien geological processes -- natural for the planet -- had not produced the rods.\" Michael Behe, Darwin's Black Box, pp 195-196", 
   {}, 
   235781, 
   null, 
   1161496560.0
  ], 
  [
   235915, 
   null, 
   "lucaspa", 
   "So you're just ignoring the counters I provided above? Do you think they are irrational? \n\n \n Easy, electrolyte. I hadn't gotten to your post yet. I was only dealing with Kronos' post. I dealt with your arguments later.\n \n \n How are they any more irrational than basing an argument on the premise that \"something is designed\" when you have no basis for concluding that something is designed?\n\n \n I already told you the basis scientists had for concluding design. In fact, we STILL consider that plants and animals are designed! We just say now \"they were designed by natural selection.\"\n \n You have fallen into the same trap as the IDers. When we say \"designed\" there is an unspoken prepositional phrase -- \"by an intelligent entity\". What is really meant by \"designed\" -- in both Paley and IDers -- is that plants and animals are manufactured. Just like the watch was manufactured.\n \n Now, anthropology, archeology, and forensics are constantly deciding that entities are manufactured by an intelligent entity -- humans in this case. Are you trying to tell me that anthropologists have no basis for looking at a stone and concluding it was manufactured -- designed -- as a tool? I would hope not.\n \n It's obvious that plants and animals have designs. They have organs and traits that serve a purpose and were \"made\" for that purpose. The question is: how? How did that design come about? Before Darwin, the only valid answer to those questions was: the designs were made by an intelligent entity. The only known entity capable of doing the job was God.\n \n What Darwin discovered was an unintelligent process -- natural or Darwinian selection -- to give design. Natural selection is an algorithm -- follow the steps and design is guaranteed. This, of course, knocked the bottom out of the Argument from Design. Now there was another entity -- natural selection -- capable of producing the designs seen in living organisms. Therefore, since there were 2 valid ways of getting those designs, no one could say that the Argument from Design was \"proof\" of the existence of God.", 
   {}, 
   235867, 
   null, 
   1161497100.0
  ], 
  [
   235916, 
   null, 
   "lucaspa", 
   "Except, of course, that is ignoring the appearnce of design caused by small variations , and the filter of natural selection. Your assumptions are your conclusions.\n\n \n No, trebor, I'm not ignoring natural selection. I am saying that, before natural selection was found, the Argument from Design was valid. Go back and read the OP. Oh hell, you missed it the first time, why would I think you would find it this time. Here:\n \n \"Then along comes Darwin and Wallace and they discover an unintelligent process -- natural selection -- that gives the design in biological organisms. Suddenly the Argument from Design as \"proof\" of deity disappears.\"", 
   {}, 
   235854, 
   null, 
   1161497280.0
  ], 
  [
   235967, 
   null, 
   "trebor", 
   "No, trebor, I'm not ignoring natural selection. I am saying that, before natural selection was found, the Argument from Design was valid. Go back and read the OP. Oh hell, you missed it the first time, why would I think you would find it this time. Here:\n \n \"Then along comes Darwin and Wallace and they discover an unintelligent process -- natural selection -- that gives the design in biological organisms. Suddenly the Argument from Design as \"proof\" of deity disappears.\"\n\n \n I think you are just trying to make excuses. ID has been proven, in the court of law, to be pure religion. \n \n You see, ID is nothing but 'I don't understand how it could happen, therefore god did it.'.", 
   {}, 
   235916, 
   null, 
   1161537060.0
  ], 
  [
   235968, 
   null, 
   "electrolyte", 
   "It was more of an analogy argument: I know intelligent humans make complexity, therefore the complexity in plants and animals arose by an even greater intelligence -- God.\"\n\n How are you defining complexity? How did you determine that plants and animals contain complexity?\n Why can you conclude that intelligence is the only possible cause of that \"complexity\"? Why can you conclude anything at all about the intelligence allegedly responsible for making plants and animals?\n \n \nThat's not a refutation. Science works in layers of questions. Answer one question and 3 or 4 more pop up out of the answer. But you can't use an unanswered question that pops up to deny the answer to the previous question.\n\n It certainly is a refutation, because the resolution ignores its own implications. It is one thing to say, \"Ah, we've figured out that electrons diffract! ... But we don't know exactly why.\" It is certainly another to proclaim, \"Complexity comes only from other, greater complexity.\" Really, it's the \"first mover\" argument: the \"first complexity\" gets a free pass. But this means that complexity can (and has) not come from other, greater complexity, which is contrary to the universal proclamation.\n \n \nSo, if you ask the question: where did the designs in plants and animals come from? Or even the question: where did the universe come from? and you answer it by: God manufactured plants and animals or God created the universe, THEN you get to ask the next question: How did God get to be complex? or Where did God come from? But not having the answer to that doesn't negate the first answer.\n\n You seem to be mixing #1 with #2 here. Fair enough. But you're still committing the same faux pas. If your argument is based on a universal concept, you cannot selectively apply that concept. If your concept is not universal, why must we apply it where you want to apply it (i.e. how can we be sure that your application of it is valid)? Notice I am not arguing that an unknown cause negates a position, I am objecting to your -- so far -- absent explanation of \"complexity\" or \"design,\" absent explanation of why you must associate \"design\" with intelligence, and selective application/special pleading.\n \n \nLet's use the Argument from Design, because evolution also has teleology.\n\n Evolution has a purpose?\n \n \nThey were deducing that plants and animals are manufactured artifacts. We do the same. We deduced that certain rocks were actually manufactured by H. habilis even tho we had never seen tools like that before. We are going to be able to deduce that artifacts made by sentient aliens are artifacts even tho we are not assuming what these creations look like or have creations to use as comparisons.\n\n Not only do we know what simple tools manufactured by humans look like, but we know what tools manufactured by early humans looked like. (They didn't make the rocks, they shaped the rocks.) These certainly have purpose. How, I ask, can it be deduced that plants and animals are manufactured or have purpose?\n \n \nYes, you can see the difference, but what is that difference?\n\n You mean other than the fact that Mr. Pocketwatch and Mrs. Pocketwatch don't meet up for a night of whoopee and end up with little baby pocketwatches some time later? How about<b></b>: I know that humans manufacture pocketwatches.\n \n \n \n \nI already told you the basis scientists had for concluding design. In fact, we STILL consider that plants and animals are designed! We just say now \"they were designed by natural selection.\"\n\n Then you admit that \"design\" is not necessarily a result of intelligence, which is precisely my objection: Your argument assumes that this is the case when, quite clearly, the assumption is invalid.\n \n \nYou have fallen into the same trap as the IDers. When we say \"designed\" there is an unspoken prepositional phrase -- \"by an intelligent entity\". What is really meant by \"designed\" -- in both Paley and IDers -- is that plants and animals are manufactured. Just like the watch was manufactured.\n\n But not all \"designs\" are manufactured. Take the repetitive ridges of sand on a beach. They are created by the motion of the water. Shall I remind you of the humorous story about the \"image of Jesus\" that attracted much attention, yet turned out to be a coincidence of shadows? This is why I insist upon your defining the terms you're using.\n \n \nNow, anthropology, archeology, and forensics are constantly deciding that entities are manufactured by an intelligent entity -- humans in this case. Are you trying to tell me that anthropologists have no basis for looking at a stone and concluding it was manufactured -- designed -- as a tool? I would hope not.\n\n But you know that this is not what I was saying: We have a basis for comparison.\n \n \nIt's obvious that plants and animals have designs.\n\n It's obvious that plants and animals have zipnats. I mean, duh. Everyone knows that. And no, I won't tell you what zipnats are, so just acknowledge that I'm right so I can go off raving about zipnats and the conclusions we can draw from them.\n \n \nThe only known entity capable of doing the job was God.\n\n God is a \"known\" entity now? Isn't that what was trying to be proved? And you're still saying there's no circularity involved? You're ridiculous.\n This is clearly God of the Gaps. \"We don't know of any other way it could happen, therefore Goddidit.\"\n \n \nWhat Darwin discovered was an unintelligent process -- natural or Darwinian selection -- to give design. Natural selection is an algorithm -- follow the steps and design is guaranteed. This, of course, knocked the bottom out of the Argument from Design. Now there was another entity -- natural selection -- capable of producing the designs seen in living organisms.\n\n Which only supports my point that the conclusion that only God could be responsible for this \"design\" is invalid.", 
   {}, 
   235915, 
   null, 
   1161537060.0
  ], 
  [
   235973, 
   null, 
   "Kronus", 
   "You turn away for a sec and off things go!\n \n Lucaspa, if I'm following you correctly what you're saying is that, before Darwin, there was only one explanation for why organisms look designed, and so not believing that explanation was irrational. I don't see how that follows. Even if you don't have a better answer, you can still think that someone else's argument is wrong, and have valid reasons for doing so. Plants and animals are complicated, sure, but that's the only bit of evidence that there's a \"designer\", and it's not very strong evidence at that. The case for a Creator is weak, and so even when that was the only game in town, you could still choose to not play. Remember, \"I don't know\" is also a valid answer, and in fact before Darwin that was the correct answer. \"Design\" was never really valid, it was just all they had.", 
   {}, 
   235968, 
   null, 
   1161538680.0
  ], 
  [
   236123, 
   null, 
   "lucaspa", 
   "I think you are just trying to make excuses. ID has been proven, in the court of law, to be pure religion. \n\n \n And since when do we let courts of law decide what is science and what is not? Since when do we let lawyers decide?\n \n When I say that ID is a falsified scientific theory, I am making a much stronger argument and statement than saying \"ID is religion\". Saying something is religion says nothing about its truth value. All it says it is not science. But there are truths outside of science; science is not the only repository of truth. To believe science is the only repository of truth is to adhere to the religion of scientism, and that only pits one religion against another. Instead, I am saying ID is out and out WRONG!\n \n \nYou see, ID is nothing but 'I don't understand how it could happen, therefore god did it.'.\n\n \n I agree that modern ID is based on god-of-the-gaps theology. However, why is that the case? Because there is natural selection to provide a material cause for the designs in living organisms. So now IDers try to find gaps in natural selection and insert God into those gaps.\n \n However, before 1858, when natural selection was unknown, that wasn't the case. Instead, the analogy worked: the only hypothesis that explained design was manufacture by an intelligence. Since living organisms have designs, they must have been manufactured.\n \n Note the past tense I am using. That was the case then, when Special Creation was the accepted scientific theory. Darwin's discovery of natural selection and subsequent demonstration of natural selection changed all that. \n \n If you want more detailed discussion of this, I refer you to Chapter 1 of Daniel Dennett's Darwin's Dangerous Idea.", 
   {}, 
   235967, 
   null, 
   1161611340.0
  ], 
  [
   236124, 
   null, 
   "lucaspa", 
   "You turn away for a sec and off things go!\n \n Lucaspa, if I'm following you correctly what you're saying is that, before Darwin, there was only one explanation for why organisms look designed, and so not believing that explanation was irrational. I don't see how that follows. Even if you don't have a better answer, you can still think that someone else's argument is wrong, and have valid reasons for doing so. \n\n \n When we have only one hypothesis that the data supports, don't we consider it irrational not to (provisionally) accept that hypothesis.\n \n Look, I often run up against the argument by creationists \"Scientific theories have been shown to be wrong in the past. Someday data will show evolution to be wrong.\" I view that as an irrational position. What's your opinion of it?\n \n As I said, Hume was able to have valid logical reasons to doubt or even refute the other logical \"proofs\" of deity. But he had no valid reason for saying the Argument from Design was wrong. He realized this and admitted to a \"Mind\" to create living organisms. I suggest you look at his Dialogues Concerning Natural Theology.\n \n \nPlants and animals are complicated, sure, but that's the only bit of evidence that there's a \"designer\", and it's not very strong evidence at that. \n\n \n It's not that they are complicated. It's that organisms have both simple and complex traits that serve specific functions. Those traits are there to do jobs for the organism. What's more, there was no known process in the environment that would produce the designs .\n \n That's the key to how we decide something is an artifact. A rock inside a broken window is simple. Now, if the house was adjacent to a rockslide or there had been a tornado nearby, you would conclude that the scenario was not manufactured. But if it happened in my living room (I live on flat ground where rocks are not on the surface) and there was no storm, then the conclusion is that the broken window and rock was manufactured by someone throwing a rock thru the window. \n \n In the absence of natural selection, the case for a Creator is very strong. So strong that even Hume couldn't get around it. In fact, without natural selection, the Argument from Design works as \"proof\" of deity.\n \n However, since natural selection is true, NOW the Argument from Design doesn't work at all. \n \n \n Remember, \"I don't know\" is also a valid answer, and in fact before Darwin that was the correct answer. \"Design\" was never really valid, it was just all they had.\n\n \n All our theories are \"just all they had\". That is, we accept scientific theories as provisionally true because we haven't got any other valid alternatives. That was exactly the case before 1858.\n \n \"I don't know\" works when you have no data. That's a correct answer to \"What caused the Big Bang?\" But they had data: the designs in living organisms. And the only valid hypothesis at the time was manufacture by an intelligent entity. \n \n What you are doing is retrodicting current knowledge into the past. You can't do that. \n \n Another analogy: before the discovery of DNA and especially the triple helix, the theory that proteins were the hereditary material was valid. After all, when you isolate the nucleus, it is overwhelmingly protein. The DNA is a \"contaminant\". \n \n Theories are valid unless and until new data comes along. We don't answer \"I don't know\" when we have data. Instead, we realize that all our \"I know\" are tentative and can be changed with further data.", 
   {}, 
   235973, 
   null, 
   1161612300.0
  ], 
  [
   236132, 
   null, 
   "trebor", 
   "And since when do we let courts of law decide what is science and what is not? Since when do we let lawyers decide?\n \n When I say that ID is a falsified scientific theory, I am making a much stronger argument and statement than saying \"ID is religion\". Saying something is religion says nothing about its truth value. All it says it is not science. But there are truths outside of science; science is not the only repository of truth. To believe science is the only repository of truth is to adhere to the religion of scientism, and that only pits one religion against another. Instead, I am saying ID is out and out WRONG!\n \n \n \n I agree that modern ID is based on god-of-the-gaps theology. However, why is that the case? Because there is natural selection to provide a material cause for the designs in living organisms. So now IDers try to find gaps in natural selection and insert God into those gaps.\n \n However, before 1858, when natural selection was unknown, that wasn't the case. Instead, the analogy worked: the only hypothesis that explained design was manufacture by an intelligence. Since living organisms have designs, they must have been manufactured.\n \n Note the past tense I am using. That was the case then, when Special Creation was the accepted scientific theory. Darwin's discovery of natural selection and subsequent demonstration of natural selection changed all that. \n \n If you want more detailed discussion of this, I refer you to Chapter 1 of Daniel Dennett's Darwin's Dangerous Idea.\n\n \n \n When people are trying to shove religion down others throats in school , and try to disguise it as science, that is how.\n \n ID is not science. It makes no predicitions. Despite yoru claims, those 'tests' won't disprove ID at all. It won't prove it either. It can not be falsified.\n \n It has no explanatory powers. It's basic premise is 'Oh, things are too complex, so \"GOD DID IT\"", 
   {}, 
   236123, 
   null, 
   1161615180.0
  ], 
  [
   236148, 
   null, 
   "lucaspa", 
   "How are you defining complexity? How did you determine that plants and animals contain complexity?\n Why can you conclude that intelligence is the only possible cause of that \"complexity\"? Why can you conclude anything at all about the intelligence allegedly responsible for making plants and animals?\n\n \n First, let's drop the \"you\". I realize that I confused the issue by giving the argument of pre-Darwin scientists in the first person \"I\", but I was having them speak, not me. If you are speaking of arguments for Special Creation and ID, please use \"they\" instead of \"you\".\n \n Second, I misspoke and should have said \"designs\", not complexity. The analogical argument used was really \"Humans make designs, some of which are very complex. Plants and animals have designs, and they are even more complex than human designs. Therefore the designer must be more intelligent than humans -- God\". \n \n Now, \"complexity\" is a term, like intelligence and species, that has no precise definition but which we have an intuitive feel. A clock is more complex than a hammer. Part of the intuition is having more parts. Part is in increased number of functions. For instance, hammers can't reproduce, but living organisms can. Therefore, in the analogical argument, living organisms would be more complex than human designs, because they as a group can do something that human designs, as a group, cannot do: self-replicate. At the time -- pre-1858. Now, of course, humans make some self-replicating machines.\n \n \nIt certainly is a refutation, because the resolution ignores its own implications. It is one thing to say, \"Ah, we've figured out that electrons diffract! ... But we don't know exactly why.\" It is certainly another to proclaim, \"Complexity comes only from other, greater complexity.\"\n\n \n First, that claim of complexity from gerater complexity was not made. Certainly none of my recreations of pre-Darwin scientists says that. So where did you pull this from? As I said, if the claim is \"complexity cannot arise by chance\", THEN and only then is the question \"what is the origin of God\" valid. \n \n However, if the statement is simply \"God made living organisms\" then it's not a problem. It is arguable that some human constructions are just as \"complex\" as humans themselves. The Internet comes to mind.\n \n \n \nBut you're still committing the same faux pas. If your argument is based on a universal concept, you cannot selectively apply that concept.\n\n \n You missed the point. Your error is trying to use an unaswered question in the next layer to invalidate an answer in the layer above it. IF we had indisputable data that God created the universe, then the next question would be \"What is the origin of God?\" The answer would be \"I don't know\" until some data was available. But answering \"I don't know\" still wouldn't contradict the (hypothetical) data that God created the universe and, therefore, exists.\n \n \nI am objecting to your -- so far -- absent explanation of \"complexity\" or \"design,\" absent explanation of why you must associate \"design\" with intelligence, and selective application/special pleading.\n\n \n The reason they associated design with intelligence was because there was no other hypothesis to explain design. IOW, they did have data that designs were made by intelligence. And that was the only hypothesis. When faced with data for which there is only one hypothesis to explain it, even today we still go with that hypothesis until and unless we find more data or another valid hypothesis.\n \n \n Evolution has a purpose?\n\n \n I said \"teleology\". If you look at Aristotle and his 4 causes, teleology is the last of those. Aristotle used the chameleon changing color as his example. For his teleological cause, Aristotle stated that the chameleon changed color to escape detection by predators.\n \n Now, isn't that what natural selection preserved variations to do? So, yes, natural selection has a short term purpose. To fit the population to the environment. It picks the individuals with the best available designs for that particular environment. So there is a short-term purpose. Often that purpose is not realized and species go extinct. \n \n So far, we haven't found that natural selection can plan ahead long-term. Evolution may have a long-term purpose but, if so, that purpose would have to be imposed by an outside source. \n \n \nNot only do we know what simple tools manufactured by humans look like, but we know what tools manufactured by early humans looked like. (They didn't make the rocks, they shaped the rocks.) \n\n \n At the discovery of the first tools, we didn't. Humans hadn't made those tools for over a million years. So, what was observed was rocks that had different shapes. So, how did the anthropologists conclude the rocks were manufactured objects? Your comparison to human tools doesn't work there. \n \n \nHow, I ask, can it be deduced that plants and animals are manufactured or have purpose?\n\n \n Oh please. THINK! Eyes are for collecting light and forming images of objects. Ears are for detecting sound waves. Limbs are for locomotion. Teeth are for tearing or masticating food. Chloroplasts have the purpose of converting sunlight and CO2 to glucose. \n \n As an evolutionist, don't run away from design. Darwin didn't. Just say that the designs are due to natural selection.\n \n \nYou mean other than the fact that Mr. Pocketwatch and Mrs. Pocketwatch don't meet up for a night of whoopee and end up with little baby pocketwatches some time later? How about<b></b>: I know that humans manufacture pocketwatches.\n\n \n Not good enough. It's not a universal criteria to detect manufactured artifacts. What do you do when you encounter something not manufactured by humans? How do you tell it is manufactured?\n \n \nThen you admit that \"design\" is not necessarily a result of intelligence, which is precisely my objection: Your argument assumes that this is the case when, quite clearly, the assumption is invalid.\n\n \n Reading comprehension is a problem for you, isn't it? Look at the OP again. I am giving a summary of other people's arguments. At a time when natural selection was unknown! We are looking at then and now. The situation changed in 1858.\n \n Try to follow this: Before 1858 natural selection was unknown. Based on the data available then, the only valid hypothesis to explain designs in plants and animals was that it was manufactured by an intelligent entity. Darwin knew this. His notebooks are full of references to the necessity of finding an alternative mechanism to account for design. And he found one: Darwinian selection. Once that was found, then manufacture by an intelligent entity ceased to be the only hypothesis to explain the designs in living organisms. Darwinian selection operating in nature would also produce those designs. Thus, the Argument from Design is no longer valid.\n \n Now, what about that paragraph do you not understand?\n \n \nBut not all \"designs\" are manufactured. Take the repetitive ridges of sand on a beach. They are created by the motion of the water. Shall I remind you of the humorous story about the \"image of Jesus\" that attracted much attention, yet turned out to be a coincidence of shadows? \n\n \n Are these designs? Or regularities or shapes? What \"function\" do either of these serve?\n \n \"5 a : an underlying scheme that governs functioning, developing, or unfolding \"\n \n \nBut you know that this is not what I was saying: We have a basis for comparison.\n\n \n Not always. In forensics people are constantly coming up with new ways to murder. So sometimes there isn't a comparison between a designed death and one that isn't. I already pointed out that we didn't have a comparison for the first stone tools -- they hadn't been made in over a million years. People had gone on to make different tools and discontinued that line.\n \n SETI is looking for design in radio signals. I doubt the aliens are going to have \"Car Talk\" in their radio signals. So we have to detect designed radio signals without having comparisons. It is possible. But if you are limiting your argument to simply \"comparisons\", then you are avoiding universal criteria and also engaging in special pleading: excluding anything other than human designs from being designed. That's an insufficient argument to defeat ID.\n \n \nIt's obvious that plants and animals have zipnats. I mean, duh. Everyone knows that. \n\n \n LOL! Nice semantic duck. If plants and animals don't have designs, how is it that we use reverse engineering to figure out what the trait/organ is for?\n \n Again, don't run away from design. Darwin didn't. You can meet the Argument from Design head on. Anything else is simply going to get you in trouble.\n \n \n God is a \"known\" entity now? Isn't that what was trying to be proved?\n\n \n LOL! again with the semantics. My apologies. I was speaking colloquially and thought you were interested in discussing ideas, not simply scoring debating pionts. My mistake. I should have been warned when you misinterpreted the \"I\" when I was putting words in the mouths of pre-Darwin scientists.\n \n Since \"known\" bothers you, let me rephrase: \"God was the only entity either known or hypothesized capable of making the designs seen in plants and animals.\" Obviously, humans were known, but they were not capable of this type of construction\n \n \n You're ridiculous.\n\n Ad hominem and therefore to be ignored as irrelevant. \n \n \nThis is clearly God of the Gaps. \"We don't know of any other way it could happen, therefore Goddidit.\"\n\n \n That's the theological problem with ID. But we aren't talking theology here. We're talking science. In science, if you have only one hypothesis or hypothetical entity that fits the data, then you (provisionally) accept that hypothesis. To reject it because the entity isn't one that you want to believe in is ...\n \n \n Which only supports my point that the conclusion that only God could be responsible for this \"design\" is invalid.[/QUOTE]", 
   {}, 
   235968, 
   null, 
   1161618180.0
  ], 
  [
   236150, 
   null, 
   "lucaspa", 
   "Which only supports my point that the conclusion that only God could be responsible for this \"design\" is invalid.\n\n \n I also made that point in the OP. \n \n \"Up until 1858, atheism was an irrational faith. Then along comes Darwin and Wallace and they discover an unintelligent process -- natural selection -- that gives the design in biological organisms. Suddenly the Argument from Design as \"proof\" of deity disappears. So, for the first time, atheists have an answer to the Argument from Design.\"\n \n \"Instead, what natural selection does is remove a \"proof\" of the existence of God. Theists can no longer \"prove\" God exists by appealing to the Argument from Design. The proximate cause for the designs in plants and animals is natural selection. \"\n \n Note to self: the next time I have a discussion with Electrolyte, make sure he actually read and understood the post he is responding to. He had given overwhelming evidence that he does not do this and runs after strawmen and imaginary positions.", 
   {}, 
   235968, 
   null, 
   1161618720.0
  ], 
  [
   236151, 
   null, 
   "Kronus", 
   "When we have only one hypothesis that the data supports, don't we consider it irrational not to (provisionally) accept that hypothesis.\n \n All our theories are \"just all they had\". That is, we accept scientific theories as provisionally true because we haven't got any other valid alternatives. That was exactly the case before 1858.\n \n\n \n I think these two lines show what the problem is. We don't accept a hypothesis just because it's the only one we have. We accept it because it explains the evidence in a logical, reasonable manner. If an idea is contrary to reason or not supported by logic, it's proper to disregard it. \n \n It's been a long time since I\"ve read any Hume, so I don't know what his specific problem was with refuting the desgin argument, but it seems that he didn't accept \"and then a miracle occurred\" as a logically useful statement. You might not be able to prove that a miracle didn't happen, but without evidence there's no reason to believe that one did occur either. And if he had refuted all other arguments regarding the existence of God, it seems to me quite rational to say that, even if he can't come up with another answer himself, \"God did it\" probably wasn't the answer to the design question either. Put another way, if God is supposed to have qualities A-Z, and you can prove that he doesn't have qualities A-Y, then it's not going out on a limb to not believe that he doesn't have Z either.", 
   {}, 
   236124, 
   null, 
   1161619260.0
  ], 
  [
   236159, 
   null, 
   "lucaspa", 
   "When people are trying to shove religion down others throats in school , and try to disguise it as science, that is how.\n\n \n How what? We should still have never let the lawyers decide what science is. What we got from that is very dangerous to science.\n \n \n ID is not science. It makes no predicitions. Despite yoru claims, those 'tests' won't disprove ID at all. It won't prove it either. It can not be falsified.\n\n \n Parts of ID do indeed make predictions. Behe in IC made the prediction that no IC structure can be made by natural selection. That prediction has been disproved.\n \n Dembski made the claim that only intelligence can produce CSI. That one has also been disproved. \n \n Actually, both were disproved long before Behe or Dembski made the claim.\n \n What you are confusing is the difference between the idea being falsified and the proponents of the idea admitting it is falsified. We don't need their agreement to falsification.\n \n \nIt has no explanatory powers. It's basic premise is 'Oh, things are too complex, so \"GOD DID IT\"\n\n \n That's not quite right. After all, theistic evolution also says \"God did it\", doesn't it? And evolution certainly does NOT say \"God did not do it.\"\n \n Saying \"God did it\" doesn't tell you anything and it is not the totality of ID. ID proposes a specific mechanism of how \"God did it\". It is the mechanism that gets falsified.\n \n Now, if you object to \"God did it\" by any mechanism, then you too are now pushing a religion.", 
   {}, 
   236132, 
   null, 
   1161624120.0
  ], 
  [
   236162, 
   null, 
   "trebor", 
   "How what? We should still have never let the lawyers decide what science is. What we got from that is very dangerous to science.\n \n\n You let scientists do that. As a whole, scientists reject ID as being science. You might have some flakes out there, but until they can get actual evdience, they are in the 'far out' minority.\n \n \n\n Parts of ID do indeed make predictions. Behe in IC made the prediction that no IC structure can be made by natural selection. That prediction has been disproved.\n \n\n \n Quite, but it didn't disprove Intelligent Design. People who push intelligent design can make ALL sort of predictions, yet, no predicition, if proven false, will disprove ID.\n \n \n\n Dembski made the claim that only intelligence can produce CSI. That one has also been disproved. \n \n Actually, both were disproved long before Behe or Dembski made the claim.\n \n What you are confusing is the difference between the idea being falsified and the proponents of the idea admitting it is falsified. We don't need their agreement to falsification.\n \n\n \n None of these predictions falsify the concept of ID, because ID can not be falsified. Some claims might be made that get falsified for I.D... but the concept can not be falsified in and of itself. \n \n It provides no mechanisms for it working. It provides no answers. It makes some outragous claims, which are also untestable.\n \n Except for untestable claims, the rest of \"Intelligent Design\" are attacks on evolution, which usually are things that are currently unknown, (see, we don't know, therefore an intelligent designer), or things that are based on out \n misunderstood concepts, out of context quotes, or obsolete science.", 
   {}, 
   236159, 
   null, 
   1161627360.0
  ], 
  [
   236194, 
   null, 
   "lucaspa", 
   "I think these two lines show what the problem is. We don't accept a hypothesis just because it's the only one we have. We accept it because it explains the evidence in a logical, reasonable manner. If an idea is contrary to reason or not supported by logic, it's proper to disregard it. \n\n \n 1. Remember that Argument from Design was the only hypothesis that fit the data. You keep leaving that last bit out and pretending there was no other hypothesis. You could construct all kinds of wild hypotheses, but none of them fit the data. \n \n So, yes, deity manufactured living organisms explained \"the evidence in a logical, reasonable manner\". \n \n 2. The only reason we reject hypotheses is because of data. Absolutely not because it is \"contrary to reason\". One reason is because then you are on the slippery slope of intellectual dishonesty of deciding to dismiss evidence solely because it is contrary to And yes, we accept a hypothesis because it is the only one we have that fits the data. Do it all the time. What do you think we are doing with evolution right now? It is the only hypothesis that we have.\n \n \n It's been a long time since I\"ve read any Hume, so I don't know what his specific problem was with refuting the desgin argument, but it seems that he didn't accept \"and then a miracle occurred\" as a logically useful statement. \n\n \n Hume shows the slippery slope when it comes to miracles.\n The essay \"An Enquiry Concerning Human Understanding\".\n \n \"no testimony is sufficient to establish a miracle, unless the testimony be of such a kind, that its falsehood would be more miraculous than the fact which it endeavors to establish ... When anyone tells me that he saw a dead man restored to life, I immediately consider with myself whether it be more probable that this person should either deceive or be deceived, or what the fact which he realtes should really have happened. I weigh the one miracle against the other, and according to the superiority which I discover, I pronounce my decision, and always reject the greater miracle. If the falsehood of his testimony would be more miraculus than the event which he relates, then, and not thill then, can he pretend to command my belief or opinion.\"\n \n However, later in the same essay Hume discusses what to do when there are several witnesses. He discusses 3 examples where the witnesses are numerous, educated, arguably objective (even opposed to the idea of miracles), and of known integrity. Nevertheless, Hume concludes: \"Where shall we find such a number of circumstances, agreeing to the corroboration of one fact [miracle]? And what have we to oppose to such\n a cloud of witnesses, but the absolute impossibility or miraculous nature of the events which they relate? And this surely, in the eyes of all reasonable people, will alone be regarded as sufficient refutation.\"\n \n This is where, I submit, Hume goees into intellectual dishonesty. No matter the number of witnesses, miracles can't happen because they are inherently impossible. Since impossible, they can't happen and so we can disbelieve the witnesses. IMHO, Hume's objectivity is replaced by dogmatism.\n \n \nYou might not be able to prove that a miracle didn't happen, but without evidence there's no reason to believe that one did occur either.\n\n \n On the level of science, there are several things wrong with this statement. \n \n 1. The \"miracles\" referred to by ID are going to leave evidence we would find today. Remember, this isn't so much miracle as material mechanism. ID says that organisms are manufactured. \"Miracle\" is simply the method of manufacture. But we don't need to know the method of manufacture to conclude that things are, or are not, manufactured artifacts. Opponents of ID get so hung up because IDers use \"God\" that they stop looking at what ID really says and how science applies. \n \n 2. That \"evidence for\" derives from a discredited and refuted philosophy of science called Logical Positivism. I'm at least glad you didn't use it for theory evaluation. You used the word \"believe\". The point is that, from the POV of science, there is also no reason to DISbelieve the event happened. You need falsifying evidence to do that. Whatever is not falsified in science stays on the table as possibly valid.\n \n \n And if he had refuted all other arguments regarding the existence of God, it seems to me quite rational to say that, even if he can't come up with another answer himself, \"God did it\" probably wasn't the answer to the design question either.\n\n \n Sure it was. Because you don't lump claims or evidence together. You take them separately. For instance, even tho there is lots of evidence that refutes a world-wide Flood, you still don't reject flood as an explanation for formation of parts of the Grand Canyon. \n \n From the data available to Hume at the time, \"God manufactured plants and animals\" was the answer to the design question.\n \n BTW, \"God did it\" doesn't necessarily tell you anything. The question always is \"How did God do it.\" As I say, you get hung up on the word \"God\" and then don't look for the actual meaning.\n \n \nPut another way, if God is supposed to have qualities A-Z, and you can prove that he doesn't have qualities A-Y, then it's not going out on a limb to not believe that he doesn't have Z either.\n\n \n Yes, it is. And, ironically, it is Hume himself that showed how likely the limb is to collapse on you. What you have stated is induction. And it was Hume that showed that induction is an invalid path to knowledge and certainty. :)", 
   {}, 
   236151, 
   null, 
   1161636660.0
  ], 
  [
   236196, 
   null, 
   "lucaspa", 
   "You let scientists do that. As a whole, scientists reject ID as being science. You might have some flakes out there, but until they can get actual evdience, they are in the 'far out' minority.\n\n \n No, no. You don't get it. ID is rejected because it is a falsified scientific theory. In order to reject something as \"science\", you have to have a demarcation criteria of what is science and what is not. There is no such demarcation criteria that works.\n \n The reason we have the argument that creationism/ID is not science is because of the lawyers. Back in 1981 when the lawyers were preparing their case against YEC in MacLean vs Arkansas, they needed a legalreason to keep creationism out of class. What they decided to do was declare that creationism was religion not science. And so they had to get expert testimony from philosophers of science to make up criteria for science that would let evolution be science but not creationism. They got Michael Ruse. And this is what Ruse said later about the process:\n \n \"The case, as put to the expert witnesses for the ACLU, was that the Arkansas law had to be shown to be promoting the teaching of religion in state-supported schools. To this end, it had to be shown that Creation-science is not truly science, but religion. Again and again, Novik [the lawyer] insisted that it would not be enough to show that Creation-science is bad science. ... Hence, my criteria of demarcation had to separate science from religion. ...Who is to be responsible for the strategy in a law case, and what obligations fall on the expert witness -- in this case the academic as expert witness? In particular, does the academic ... have particular responsibility for the strategy, and must he/she therefore share the praise or blame for strategy (or outcome)? ... let the lawyers get on with their job of finding and arguing the law, and let the rest of us -- plaintiffs, defendents, witnesses and others -- sit back, out of their way. This attitude applies particularly [emphasis in original] if you have an interest, like a moral interest, in the outcome. In short, if you are an expert witness ... then you should follow the law as it is taught to you. This is your job. This is your obligation. And, it could well be self-defeating if you do otherwise.\" Michael Ruse, The academic as expert witness, in But Is It Science? edited by Michael Ruse, 1996, pg 389-390 \n \n Basically, this comes down to \"the lawyers made me do it\". This was in response to criticism from Laudan, Quinn, and others about the demarcation criteria Ruse used. They were terrible. I strongly disagree with Ruse. If you are talking about science, then you present science accurately and let the legal chips fall where they may.\n \n As it turns out, there is a perfectly good way to exclude creationism/ID from public school classrooms while treating them as what they are: falsified scientific theories. Quinn did that using symbolic logic. We can go into that method in detail if you want. Unfortunately, the ACLU lawyers in MacLean vs Arkansas did not see it.\n \n Once the precedent was established, the lawyers were forced to continue with it in the recent Dover case. Thus the error of not viewing creationism/ID as a falsified scientific theory has persisted.\n \n \n Quite, but it didn't disprove Intelligent Design. People who push intelligent design can make ALL sort of predictions, yet, no predicition, if proven false, will disprove ID.\n\n \n See what you've done? You've equated \"people who push intelligent design\" and ID. Ideas are independent of the people who advocate them. You are saying that becaause the people who push ID don't admit that ID is disproven, then ID is not disproven. That's not true. ID is either proven or disproven no matter what the people pushing ID think. It's not in their power to keep ID from being disproven just because they put their fingers in their hears and yell \"I can't hear you\". We don't need acquiescence of the people involved.\n \n \nNone of these predictions falsify the concept of ID, because ID can not be falsified. Some claims might be made that get falsified for I.D... but the concept can not be falsified in and of itself.\n\n \n Please define \"the concept of ID\". If all the claims are tested and falsified, what then is left? \n \n \nIt makes some outragous claims, which are also untestable.\n\n \n I have already shown claims that are testable. Not only testable, but tested and shown to be false. So why do you persist with this mantra of \"untestable\" in face of data that the claims are testable?\n \n \n the rest of \"Intelligent Design\" are attacks on evolution,\n\n \n That's true, but irrelevant to evaluating the accuracy of ID. It tells us something of the mentality of IDers, but nothing about the accuracy of ID.\n \n You see, declaring ID as \"not science\" doesn't tell you anything about whether ID is true and accurate! All you did was say it's not science. But things don't have to be science to be true. For instance, the statement \"onside kicks are not usually fumbled\" is not science. No one is going to include football as a subdiscipline of science. But are you going to deny that the statement is true?\n \n Here, you need to read this. What Laudan said regarding YECs is just as applicable to IDers. Just substitute \"IDers\" where Laudan uses the word \"creationists\":\n \n \"There is a more interesting-if equally significant confusion running through much of Ruse's discussion, a confusion revealing a further failure to come to terms with the case I was propounding in \"Science at the Bar.\" I refer to his (and Overton's) continual slide between assessing doctrines and assessing those who hold the doctrines. Ruse reminds us (and this loomed large in the McLean opinion as well) that many advocates of creation-science tend to be dogmatic, slow to learn from experience, and willing to resort to all manner of ad hoc strategies so as to hold onto their beliefs in the face of counter evidence. For the sake of argument, let all that be granted; let us assume that the creationists exhibit precisely those traits of intellectual dishonesty which the friends of science scrupulously and unerringly avoid. Ruse believes (and Judge Overton appears to concur) that, if we once establish these traits to be true of creationists, then we can conclude that Creationism is untestable and unfalsifiable (and \"therefore unscientific\").\n This just will not do. Knowing something about the idiosyncratic mindset of various creationists may have a bearing on certain practical issues (such as \"Would you want your daughter to marry one?\"). But we learned a long time ago that there is a difference between ad hominem and ad argumentum. Creationists make assertions about the world. Once made, those assertions take on a life of their own. Because they do, we can assess the merits or demerits of creationist theory without having to speculate about the unsavoriness of the mental habits of creationists. What we do, of course, is to examine the empirical evidence relevant to the creationist claims about earth history. If those claims are discredited by the available evidence (and by \"discredited\" I mean impugned by the use of rules of reasoning which legal and philosophical experts on the nature of evidence have articulated), then Creationism can safely be put on the scrap heap of unjustified theories.\"\n Larry Laudan, \"More on Creationism\", Chapter 24 in But Is It Science? Edited by M Ruse pp 363-366", 
   {}, 
   236162, 
   null, 
   1161637920.0
  ], 
  [
   236205, 
   null, 
   "Hi_Its_Me", 
   "That's the key to how we decide something is an artifact. A rock inside a broken window is simple. Now, if the house was adjacent to a rockslide or there had been a tornado nearby, you would conclude that the scenario was not manufactured. But if it happened in my living room (I live on flat ground where rocks are not on the surface) and there was no storm, then the conclusion is that the broken window and rock was manufactured by someone throwing a rock thru the window.\n\n I know this is very off topic, but I just want to point out that that is a use of Occam's Razor (whether you realized it at the time or not). After all, there are alternatives- the rock could have been a meteorite, for example.", 
   {}, 
   236124, 
   null, 
   1161639720.0
  ], 
  [
   236278, 
   null, 
   "electrolyte", 
   "I've got a response started, but I can't complete it because I can't decipher your post. You repeatedly refer to design, complexity, intelligence, purpose, etc., but you give no meaningful definitions or explanations of the terms. I'm finding it terribly difficult to compose a response to the vague notions you're repeatedly floating around. Please explain what you mean by each term.\n \n You call the zipnats bit semantic ducking, yet here I am making a post specifically to ask you to not be an evasive candyass. Guess somebody can't take a hint.\n \n I will, however, respond to your final remark at this point:\n \nThat's the theological problem with ID. But we aren't talking theology here. We're talking science.\n\n We're talking philosophy. We're not talking ID per se. We're not even really talking science.\n \n Oh, and I'll also remind lucaspa that -- contrary to his ranting -- he is defending the argument from design as valid before Darwin's findings.", 
   {}, 
   236148, 
   null, 
   1161668760.0
  ], 
  [
   236374, 
   null, 
   "Jim Colyer", 
   "To set evolution against creation is like trying to split a hair.", 
   {}, 
   235697, 
   null, 
   1161721680.0
  ], 
  [
   236402, 
   null, 
   "Collin", 
   "To set evolution against creation is like trying to split a hair.\n\n \n ?? Explain. There are an abundance of ways that can be both true and false.", 
   {}, 
   236374, 
   null, 
   1161733200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution and atheism", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9058-evolution-atheism.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9058, 
  "discussion_files": [
   [
    "20816.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9058-evolution-atheism-print.html"
   ], 
   [
    "20817.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9058-evolution-atheism-2-print.html"
   ]
  ], 
  "identifier": 9058
 }
]