[
 [
  [
   235756, 
   null, 
   "Jo Bennett", 
   "Now, I know this piece is propaganda, but I'm curious as to how much of it is true. I know I'd have trouble if I needed photo ID to vote in this country, it seems absurd to demand that you have to have formal ID in order to exercise your basic rights.\n \n http://www.guardian.co.uk/usa/story/0,,1927554,00.html", 
   {
    "post_info": {
     "post_title": "Are the Republicans trying to rig the mid terms?"
    }
   }, 
   null, 
   null, 
   1161382920.0
  ], 
  [
   235775, 
   null, 
   "Phunting", 
   "Well personally I think asking for ID is a totally reasonable idea. Especially in this country following the recent electoral fraud allegations. It is currently laughably easy to forge someone's vote, and I don't see attempts to curtail this as some sinister right wing conspiracy.\n \n This does strike me as typical of the kind of XXXX the Grauniad regularly whines on about.", 
   {}, 
   235756, 
   null, 
   1161387780.0
  ], 
  [
   235777, 
   null, 
   "Jo Bennett", 
   "But why should people have to learn to drive, a pretty expensive exercise, in order to vote? I was recently required to present ID bearing my name, signature and photograph. Fortunately as a student my NUS Extra card carries those details, but if I wasn't I would have had to fork out £80 I do not have for a passport. Few of the problems in Britain have involved people voting at the polling booth but postal ballots. ID is only a reasonable demand if everyone has ID or can obtain it easily for free.", 
   {}, 
   235775, 
   null, 
   1161388860.0
  ], 
  [
   235779, 
   null, 
   "Rovdak", 
   "I have to show a Government-approved photo ID when voting, the cheapest is the NIK, a \u008030 or so photo ID that I can use as legal ID in the EU as well as Norway and Iceland (I have a passport myself). To me it makes sense, I have to confirm my identity as citizen eligible to vote.", 
   {}, 
   235777, 
   null, 
   1161390120.0
  ], 
  [
   235780, 
   null, 
   "Big_Bear_Scot", 
   "Well personally I think asking for ID is a totally reasonable idea. Especially in this country following the recent electoral fraud allegations. It is currently laughably easy to forge someone's vote, and I don't see attempts to curtail this as some sinister right wing conspiracy.\n \n This does strike me as typical of the kind of XXXX the Grauniad regularly whines on about.\n\n \n I agree with Jo, this measure targets the poor who tend to vote for the Democrats. These people can not afford to drive so they don't need a driving license and they can not afford Holidays abroad so they can't/don't have a passport. \n \n It would be different if picture ID was free, then I would have no problem with these measures.", 
   {}, 
   235775, 
   null, 
   1161390240.0
  ], 
  [
   235819, 
   null, 
   "Winston Smith", 
   "a credit card or utilities bills, such as telephone or electriciy are accepted, but the de facto ID card is the driver's licence\n \n Also in Australia voting is compulsory as it ought to be in the USA. The Reps would hate it, for there are more poor people than rich in this world and that includes the USA", 
   {
    "post_info": {
     "post_title": "in Australia"
    }
   }, 
   235780, 
   null, 
   1161438780.0
  ], 
  [
   235823, 
   null, 
   "Matthew S", 
   "Why not they have rigged the last 3", 
   {}, 
   235756, 
   null, 
   1161440940.0
  ], 
  [
   235824, 
   null, 
   "Matthew S", 
   "\n \n Also in Australia voting is compulsory as it ought to be in the USA. The Reps would hate it, for there are more poor people than rich in this world and that includes the USA\n\n \n Compulsory voting is the last thing the republican party wants. They are not a populace party with a popularist message. Compulsory voting favors the more liberal parties. Democrats allways win in a large turn out setting.", 
   {}, 
   235819, 
   null, 
   1161441240.0
  ], 
  [
   235826, 
   null, 
   "gamehuis", 
   "1) Photo ID is IMO necessary to identify the voter. How else are you going to prevent people from cheating while voting? Utility bills etc. are just way too easy to fake.\n \n 2) The Republicans don't need to rig the elections this way because they can just \"Diebold\" it. \n \n 3) It doesn't matter whether the Democrats or the Republicans win. Both parties will continue to do their utmost best to screw over the American people. The only difference between the 2 parties is that the Dems are \"tax-and-spend\" and the Repubs are \"borrow-and-spend\".", 
   {}, 
   235756, 
   null, 
   1161442440.0
  ], 
  [
   235914, 
   null, 
   "zachvac", 
   "Compulsory voting is the last thing the republican party wants. They are not a populace party with a popularist message. Compulsory voting favors the more liberal parties. Democrats allways win in a large turn out setting.\n\n \n Sorry, no. The more voters equals the worst tactics to win elections. When there are uninformed voters they may vote based on the name, whether they like one more or have heard one more on TV. That's not what we want.", 
   {}, 
   235824, 
   null, 
   1161496800.0
  ], 
  [
   235940, 
   null, 
   "Rovdak", 
   "2) The Republicans don't need to rig the elections this way because they can just \"Diebold\" it.\n\n \n Hehe, you had me wondering what you were talking about 'till I googled it. And yeah, most electronically-voting nations probably would do well to expand on \"Diebold-protection\", and we would do well not placing ourselves above inviting foreign observers during GEs too imo.", 
   {}, 
   235826, 
   null, 
   1161527580.0
  ], 
  [
   235960, 
   null, 
   "Phunting", 
   "Also in Australia voting is compulsory as it ought to be in the USA. The Reps would hate it, for there are more poor people than rich in this world and that includes the USA\nThe Australian system is a hangover from the days where you didn't have a large enough population to ensure viable elections without ensuring 100% turnout. It's not the case anymore and is pretty much irrelevant in today's society. If people don't want to vote they shouldn't be forced to.\n \n Anyway it hardly creates a bastion of liberalism, or is John Howard not PM?!\n \n \nCompulsory voting is the last thing the republican party wants.\nCompulsory voting should be the last thing anyone wants. Why on earth would people want to move politics even further towards the populist? It's bad enough as it is...\n \n Back on topic, I think most people could quite easily obtain one. Just looking through my own IDs I've got at least 4 items that would probably be accepted. Can people really not come up with one? I notice the Grauniad doesn't actually name what would be acceptable as ID, just says \"the only photo ID commonly available is a driving licence\". \n \n And anyway I don't buy it that the rich vote Republican, poor vote Democrat as seems to be implied. A huge base of right wing support over here comes from the lower classes, I'm sure the same is true in the US.", 
   {}, 
   235819, 
   null, 
   1161534000.0
  ], 
  [
   235976, 
   null, 
   "Jo Bennett", 
   "If you look at the split in the UK though, it is the urban poor who are most strongly labour supporting, and the rural wealthy who are most strongly tory. The split is partly geographical as well as class, but those who live in urban areas are also less likely to be able to drive, as in urban areas it is an unnecessary luxury whereas in rural areas it is pretty much essential. The two compunded together mean that supporters of the right are more likely to have driving licences.", 
   {}, 
   235960, 
   null, 
   1161539400.0
  ], 
  [
   235977, 
   null, 
   "Phunting", 
   "Very very broadly speaking, yes. But this is making huge generalizations. You could also say, in America especially, that it is the 'liberals' who are far more likely to travel outside their country and therefore have passports whereas the right are more inclined to stay within the US.\n \n In the end I just think it's a pointless pop at Republicans for installing a fairly sensible safeguard.", 
   {}, 
   235976, 
   null, 
   1161542580.0
  ], 
  [
   235984, 
   null, 
   "daewoo", 
   "3) It doesn't matter whether the Democrats or the Republicans win. Both parties will continue to do their utmost best to screw over the American people. The only difference between the 2 parties is that the Dems are \"tax-and-spend\" and the Repubs are \"borrow-and-spend\".\n\n \n IMO, this is the real issue. \n \n It has reached the point that both parties are essentially special interest whores whose primary MO seems to be figuring out new and exciting ways to screw the majority of the country for the benifit of a few. Even when they come up with something that is seemingly benificial to the \"little man\", it usually turns out to be just a new way to cloak a total and absolute screwing of the little guy for the benifit of a few (think \"prescription drug bill\" here).", 
   {}, 
   235826, 
   null, 
   1161544620.0
  ], 
  [
   235988, 
   null, 
   "Phunting", 
   "Err well yeah. You almost sound surprised? Welcome to human existance...", 
   {}, 
   235984, 
   null, 
   1161546480.0
  ], 
  [
   236015, 
   null, 
   "mae", 
   "a credit card or utilities bills, such as telephone or electriciy are accepted, but the de facto ID card is the driver's licence\n \n Also in Australia voting is compulsory as it ought to be in the USA. The Reps would hate it, for there are more poor people than rich in this world and that includes the USA\n\n \n Making anything compulsory is an infringement of rights. In no democractic country is voting compulsory.", 
   {}, 
   235819, 
   null, 
   1161561960.0
  ], 
  [
   236019, 
   null, 
   "Phunting", 
   "Well, there are plenty of democracies where it is, but I guess you mean it shouldn't be...", 
   {}, 
   236015, 
   null, 
   1161563460.0
  ], 
  [
   236020, 
   null, 
   "jitobear", 
   "Is Minnesota the only state where the DMV issues official state identification cards that do not come with driving priveleges? They are about $20.", 
   {}, 
   236019, 
   null, 
   1161563700.0
  ], 
  [
   236034, 
   null, 
   "Winston Smith", 
   "Making anything compulsory is an infringement of rights. In no democractic country is voting compulsory.\n\n \n Australia is not a democracy???? emoticon_wow", 
   {
    "post_info": {
     "post_title": "news to me"
    }
   }, 
   236015, 
   null, 
   1161571740.0
  ], 
  [
   236037, 
   null, 
   "Winston Smith", 
   "Well, there are plenty of democracies where it is, but I guess you mean it shouldn't be...\n\n \n she rarely know what she means herself.\n \n I was apalled when I came to Australia that voting was compulsory. But now I have come around, specially when observing how undemocratic the electoral process is otherwise, such as in the USA. If taken to an extreme and it can happen, for if the numbers of those taking part dwindle to almost nothing is that society would have to abandon the democratic system and find another form of selecting its leaders? What about King George W. Bush??? Just joking.\n \n question for mae: is voting compulsory in Canada, England????", 
   {
    "post_info": {
     "post_title": "on mae"
    }
   }, 
   236019, 
   null, 
   1161572160.0
  ], 
  [
   236085, 
   null, 
   "daewoo", 
   "Is Minnesota the only state where the DMV issues official state identification cards that do not come with driving priveleges? They are about $20.\n\n \n In kansas you can get a state ID card for $18 if you can \"demonstrate a need for one\". If not, you have to get a DL.", 
   {}, 
   236020, 
   null, 
   1161587280.0
  ], 
  [
   236090, 
   null, 
   "college_girl", 
   "I worked as a voter registration officer for an election in Canada, and while virtually everyone had standard identification such as driver's licenses, we accepted pretty much anything people could come up with to prove their identity, no picture necessary.\n \n I was told to err on the side of letting anyone who wants to vote, vote. I only turned one person away because he literally could not produce anything at all with his name on it.", 
   {}, 
   236085, 
   null, 
   1161588180.0
  ], 
  [
   236109, 
   null, 
   "Winston Smith", 
   "I worked as a voter registration officer for an election in Canada, and while virtually everyone had standard identification such as driver's licenses, we accepted pretty much anything people could come up with to prove their identity, no picture necessary.\n \n I was told to err on the side of letting anyone who wants to vote, vote. I only turned one person away because he literally could not produce anything at all with his name on it.\n\n \n They do not ask for any id. you just go to the electoral table, and they look you up, once your name is found they cross it out and you cast your vote. We are not a police state. However in order to register in the electoral rol you must prove who you are. Many people do not enrol in the electoral roll as this automatically also means enrolment for jury duty service", 
   {
    "post_info": {
     "post_title": "In Australia"
    }
   }, 
   236090, 
   null, 
   1161606840.0
  ], 
  [
   236208, 
   null, 
   "epaphras_faith", 
   "In Arizona, which has just had the supreme court remove an injunction on voter initiated and voter approved law for requiring id to vote, you can obtain a state issued photo id for $4.00.\n \n That is state issued. It costs next to nothing. The other requirements per the AZ website:\n \n \nFor Duplicate Driver License or Identification Card you will need your name, date of birth, and license number. If you do not know your license number, you will need your name, date of birth, social security number, street address, eye color and zip code. \n\n \n Arizona has one of the worst problems with illegal aliens in the US. What is the problem with asking people to be US citizens in order to vote in a US election. I am certain the french would have a fit if I tried to vote in one of their elections.\n \n In arizona the requirement is an official ID, a ssn, or an affidavit of citizenships.\n \n EF", 
   {}, 
   236109, 
   null, 
   1161641520.0
  ], 
  [
   236214, 
   null, 
   "Phunting", 
   "But now I have come around, specially when observing how undemocratic the electoral process is otherwise, such as in the USA. If taken to an extreme and it can happen, for if the numbers of those taking part dwindle to almost nothing is that society would have to abandon the democratic system and find another form of selecting its leaders?\nWhen? None of our societies are really in a state where we have so few people voting to make workable system. It just means people actually interested in politics and who understand things vote. I know enough people who \"don't do politics\", to them a vote would be a random tick in a box, or worse nothing more than a Big Brother popularity contest, which it nearly is anyway. Voter apathy is imho brilliant, it allows politics to actually try and be about politics.\n \n How is forcing someone to vote, and therefore not allowing them to \"protest\" by not voting, more democratic than actually allowing people to choose what to do?\n \n \nquestion for mae: is voting compulsory in Canada, England????\nWell if you don't mind, I'll answer for her. No, it isn't in either of them. The only first world countries to have it (I think) are Belgium, Switzerland, Austria, Greece, Singapore, Luxembourg and Cyprus.", 
   {
    "unicode_changes_made": true
   }, 
   236037, 
   null, 
   1161647400.0
  ], 
  [
   236229, 
   null, 
   "mae", 
   "When? None of our societies are really in a state where we have so few people voting to make workable system. It just means people actually interested in politics and who understand things vote. I know enough people who \"don't do politics\", to them a vote would be a random tick in a box, or worse nothing more than a Big Brother popularity contest, which it nearly is anyway. Voter apathy is imho brilliant, it allows politics to actually try and be about politics.\n \n How is forcing someone to vote, and therefore not allowing them to \"protest\" by not voting, more democratic than actually allowing people to choose what to do?\n \n Well if you don't mind, I'll answer for her. No, it isn't in either of them. The only first world countries to have it (I think) are Belgium, Switzerland, Austria, Greece, Singapore, Luxembourg and Cyprus.\n\n \n \n \n If anyone made voting compulsory in Canada, there would be a revolt......people hate to be told what to do. I can just imagine some provinces such as Alberto threatening to leave the union.......some MP from the Western provinces would say something like... \"who the hell do those pip squeak liberals think they are ...God ? telling people what to do, hell, I am personallly going to punch them.\"", 
   {
    "unicode_changes_made": true
   }, 
   236214, 
   null, 
   1161651180.0
  ], 
  [
   236232, 
   null, 
   "Winston Smith", 
   "When? None of our societies are really in a state where we have so few people voting to make workable system. It just means people actually interested in politics and who understand things vote. I know enough people who \"don't do politics\", to them a vote would be a random tick in a box, or worse nothing more than a Big Brother popularity contest, which it nearly is anyway. Voter apathy is imho brilliant, it allows politics to actually try and be about politics.\n \n How is forcing someone to vote, and therefore not allowing them to \"protest\" by not voting, more democratic than actually allowing people to choose what to do?\n\n \n First by having everybody's opinition taken into account it legtimizes the process. \n Second: you can choose to vote blank, and you can even write on the voting paper whatever you wish\n Third: it prevents dirty tricks as those being tried by the Republicans in the USA, commnenting on them originated this thread", 
   {
    "unicode_changes_made": true
   }, 
   236214, 
   null, 
   1161652140.0
  ], 
  [
   236248, 
   null, 
   "Phunting", 
   "I'm not convinced by the 'legitimizing'. Everyone has the right and ample opportunity to vote. If they don't want to for whatever reason that's their own decision. \n \n Ok, well at least you have this. I thought you had to vote for a choice on the ballot.\n \n Firstly, I still don't see the Reps playing any dirty tricks by doing this. And secondly compulsory voting in no way limits the problems of electoral fraud.", 
   {}, 
   236232, 
   null, 
   1161654480.0
  ], 
  [
   236257, 
   null, 
   "Winston Smith", 
   "Let me tell you this:\n I live in a suburb who is extremely conservative as most middle class suburbs are.\n Now, I always vote for the Greens so my vote is always wasted, even when the Greens give their preferences to Labor; therefore my vote does not make any difference in the ourcome of the election at all. So why should I care to walk to the nearby school and cast my vote on a Saturday?\n \n If I were a down under neo-con it would be the same as one vote more or one vote less for the conservative coalition would not affect the outcome either.\n \n My vote is a protest vote. You would not believe how upset the burghers are on Sunday when they discover that amid them are a few entrenched: tree hugging hippies, socialists, marxists, republicans (as opposed to monarchists) in their leafy garden suburb. If they knew I am one of those they would probably torch my house with me in it.", 
   {}, 
   236248, 
   null, 
   1161657900.0
  ], 
  [
   236295, 
   null, 
   "gamehuis", 
   "Australia is not a democracy???? emoticon_wow\n\n Technically speaking, no country on Earth is a democracy. They're either constitutional republics, monarchies, parliamentary dictatorships etc.\n \n Always makes me chuckle when one of those talking heads gets on TV and talks about our 'democratic values' when we actually have none.", 
   {}, 
   236034, 
   null, 
   1161685620.0
  ], 
  [
   236412, 
   null, 
   "Phunting", 
   "Technically speaking, no country on Earth is a democracy. They're either constitutional republics, monarchies, parliamentary dictatorships etc.\n \n Always makes me chuckle when one of those talking heads gets on TV and talks about our 'democratic values' when we actually have none.\nWell, you're really getting into semantics here. Sure, we're not a direct democracy, but we still live in a democtatic system, ie power derived from the masses.", 
   {}, 
   236295, 
   null, 
   1161735180.0
  ], 
  [
   236417, 
   null, 
   "zachvac", 
   "Technically speaking, no country on Earth is a democracy. They're either constitutional republics, monarchies, parliamentary dictatorships etc.\n \n Always makes me chuckle when one of those talking heads gets on TV and talks about our 'democratic values' when we actually have none.\n\n \n Not sure about Australia, but the United States is a Representative Democratic Republic. It is a Democracy, because the citizens vote. It is a representative democracy, because they vote on people to represent them. But the United States IS indeed a Democracy. Not a direct Democracy, but a democracy nontheless.", 
   {}, 
   236295, 
   null, 
   1161736560.0
  ], 
  [
   236418, 
   null, 
   "Phunting", 
   "Oz, like us here in Blighty, is a Representative Democracy and a Constitutional Monarchy...", 
   {}, 
   236417, 
   null, 
   1161737580.0
  ], 
  [
   236460, 
   null, 
   "gamehuis", 
   "Not sure about Australia, but the United States is a Representative Democratic Republic. It is a Democracy, because the citizens vote. It is a representative democracy, because they vote on people to represent them. But the United States IS indeed a Democracy. Not a direct Democracy, but a democracy nontheless.\n\n Please show me in the Constitution of the US where the word democracy is mentioned.\n \n I'll help you out: it's not there. You know why? That's because your founding fathers didn't like democracy at all. A true democracy would be nothing more than mob rule and the founding fathers knew that and created the constitutional republic which you now live in.\n \n Just because you vote doesn't mean you live in a democracy. Hell, they vote in China, does that mean that China is a democracy?", 
   {}, 
   236417, 
   null, 
   1161787980.0
  ], 
  [
   236461, 
   null, 
   "gamehuis", 
   "Well, you're really getting into semantics here. Sure, we're not a direct democracy, but we still live in a democtatic system, ie power derived from the masses.\n\n And when a couple of years ago the masses in England protested against the war in Iraq (millions of them), what did your 'representative' government do? They took the power that is apparently derived from the masses and invaded anyway eventhough the majority of people didn't want that.", 
   {}, 
   236412, 
   null, 
   1161788280.0
  ], 
  [
   236534, 
   null, 
   "zachvac", 
   "And when a couple of years ago the masses in England protested against the war in Iraq (millions of them), what did your 'representative' government do? They took the power that is apparently derived from the masses and invaded anyway eventhough the majority of people didn't want that.\n\n \n Whether you agree with what they did or not (I don't) they were our ELECTED representatives.", 
   {}, 
   236461, 
   null, 
   1161818520.0
  ], 
  [
   236535, 
   null, 
   "zachvac", 
   "Please show me in the Constitution of the US where the word democracy is mentioned.\n \n I'll help you out: it's not there. You know why? That's because your founding fathers didn't like democracy at all. A true democracy would be nothing more than mob rule and the founding fathers knew that and created the constitutional republic which you now live in.\n \n Just because you vote doesn't mean you live in a democracy. Hell, they vote in China, does that mean that China is a democracy?\n\n \n Definitions of democracy:\n \n From wordnet.princeton.edu (found through google define)\n \"\n # the political orientation of those who favor government by the people or by their elected representatives\n # a political system in which the supreme power lies in a body of citizens who can elect people to represent them\n # majority rule: the doctrine that the numerical majority of an organized group can make decisions binding on the whole group \n \"\n \n from wikipedia\n \"\n The term democracy indicates a form of government where all the state's decisions are exercised directly or indirectly by a majority of its citizenry through a fair elective process. When these factors are met a government can be classified as such. This can apply to a multitude of government systems as these concepts transcend and often occur concomitantly with other types. \n \"\n \n Although the Constitution doesn't mention the term democracy, several times it mentions votes, such as 2/3, majority, etc. Representatives are (or are supposed to be) restricted to the powers set out by the Constitution. But they are elected representatives thus the United States IS a Democracy.", 
   {}, 
   236460, 
   null, 
   1161818760.0
  ], 
  [
   236749, 
   null, 
   "Winston Smith", 
   "Oz, like us here in Blighty, is a Representative Democracy and a Constitutional Monarchy...\n\n \n the opposite of democracy", 
   {
    "post_info": {
     "post_title": "monarchy"
    }
   }, 
   236418, 
   null, 
   1161958020.0
  ], 
  [
   236768, 
   null, 
   "Yossarian", 
   "All of this will be so much simpler once we're all tagged with the Mark of the Beast. No more photo ID's, checkpoints, or red-tape. Just a quick scan of your forehead or hand and voila! You're done!\n Not only that, but with the mind-scan technology currently being developed by Disney, in conjunction with Karl Rove, you won't even have to show up at your local polling place. Your brain will be scanned as you sleep, or drive to work, or slander an entire race/group/ethnicity, and the appropriate vote teased out of it's matrix.\n And don't worry about silly things like voting for the \"wrong\" candidate. The Disney Votrix 6000 will have the ability to not only extract your wishes, but determine what's ultimately best for the country and cast your vote accordingly.\n However, moustaches will no longer be permitted.\n \n Seriously, tho: we're a Representative Republic. Forget about the Constitution, zachvac. In 1787 25% of the country were slaves. 51% were women. Perhaps 1 million Natives still lived (tho likely a lot less by then). None of them could, or were intended by the \"founders\" to be allowed to (ever) vote. That's quite a small \"democracy\", eh?\n \n And forget the idea that voting is your best way to influence things. Take a hint, perhaps, from the guy who said: \"\"I... am now quite certain that the crimes of this guilty land will never be purged away but with blood. I had, as I now think, vainly flattered myself that without very much bloodshed it might be done.\"\n Dynamic personalities such as his are what has driven each major change in our society. Without charismatic individuals willing to stand, speak and often die for their beliefs, votes count for absolutely nothing.", 
   {}, 
   235984, 
   null, 
   1161962940.0
  ], 
  [
   236830, 
   null, 
   "Phunting", 
   "the opposite of democracy\nAbsolute monarchy maybe, but of course Constitutional Monarchy is compatible with democracy. Or did you not just make a post saying \"Australia is not a democracy???? emoticon_wow \"", 
   {}, 
   236749, 
   null, 
   1161978120.0
  ], 
  [
   236837, 
   null, 
   "Phunting", 
   "And when a couple of years ago the masses in England protested against the war in Iraq (millions of them), what did your 'representative' government do? They took the power that is apparently derived from the masses and invaded anyway eventhough the majority of people didn't want that.\nAnd when 'my' representative government did this, what did the electorate do? Voted them straight back into power. If, like so many claim, the 'entire country' was against Iraq this would never have happened. In the end people accepted the decision. \n \n And exactly what zachvac says. Just because a million or however many people disagree with something, that doesn't mean that the entire country feels the same way. And it certainly doesn't mean that the government should just do what they say just because there are x amount of them. That's really not how the system works.", 
   {}, 
   236461, 
   null, 
   1161978660.0
  ], 
  [
   236846, 
   null, 
   "Jo Bennett", 
   "The reason the government was re-elected was that the main opposition also supported the war, and given a choice between XXXX foreign policy and ok domestic policy; and XXXX foreign AND XXXX domestic policy, people chose the former. It's also worth noting that the last general election saw the lowest proportion of the vote going to labour and the tories combined for decades, possibly since the liberal were last in power.", 
   {}, 
   236837, 
   null, 
   1161980460.0
  ], 
  [
   236851, 
   null, 
   "Phunting", 
   "The reason the government was re-elected was that the main opposition also supported the war, and given a choice between XXXX foreign policy and ok domestic policy; and XXXX foreign AND XXXX domestic policy, people chose the former. It's also worth noting that the last general election saw the lowest proportion of the vote going to labour and the tories combined for decades, possibly since the liberal were last in power.\nI don't doubt it. All I'm saying is that we (as a population) accepted it. But I do believe it demostrated that 'the majority' weren't as totally opposed as many would claim.", 
   {}, 
   236846, 
   null, 
   1161980940.0
  ], 
  [
   236860, 
   null, 
   "Jo Bennett", 
   "It's certainly true that the Iraq war wasn't the only issue people used to decide how to vote, but I'm not sure what you mean by people \"accepted\" the decision. There hasn't been armed rebellion against the government, but that doesn't mean that people though invading iraq was a good idea.", 
   {}, 
   236851, 
   null, 
   1161983040.0
  ], 
  [
   236941, 
   null, 
   "JPSartre12", 
   "Compulsory voting is the last thing the republican party wants. They are not a populace party with a popularist message. Compulsory voting favors the more liberal parties. Democrats allways win in a large turn out setting.\n\n \n George Bush won in 2004 with the highest vote total in US history, so your basic premise is false. Nice try, though. See the doorman for your consolation prize. :)", 
   {}, 
   235824, 
   null, 
   1162015440.0
  ], 
  [
   236942, 
   null, 
   "Phunting", 
   "It's certainly true that the Iraq war wasn't the only issue people used to decide how to vote, but I'm not sure what you mean by people \"accepted\" the decision. There hasn't been armed rebellion against the government, but that doesn't mean that people though invading iraq was a good idea.\nSimply that people must generally have agreed with it, or not disagreed with it enough to vote them out. Hence acceptance.", 
   {}, 
   236860, 
   null, 
   1162015620.0
  ], 
  [
   236965, 
   null, 
   "Winston Smith", 
   "Absolute monarchy maybe, but of course Constitutional Monarchy is compatible with democracy. Or did you not just make a post saying \"Australia is not a democracy???? emoticon_wow \"\n\n \n You are quoting the wrong person. Australia is a democracy and a colony", 
   {
    "post_info": {
     "post_title": "what?"
    }
   }, 
   236830, 
   null, 
   1162039800.0
  ], 
  [
   236989, 
   null, 
   "Phunting", 
   "You are quoting the wrong person. Australia is a democracy and a colony\nAustralia is a democracy, an ex-colony and a constitutional monarchy. I promise you...", 
   {}, 
   236965, 
   null, 
   1162052820.0
  ], 
  [
   236994, 
   null, 
   "Matthew S", 
   "George Bush won in 2004 with the highest vote total in US history, so your basic premise is false. Nice try, though. See the doorman for your consolation prize. :)\n\n \n THis is true but more people voted against Bush then have ever voted for any president in the history of the US.", 
   {}, 
   236941, 
   null, 
   1162054500.0
  ], 
  [
   237043, 
   null, 
   "JPSartre12", 
   "THis is true but more people voted against Bush then have ever voted for any president in the history of the US.\n\n \n And how would you spin the fact that he was also the first president in 16 years to get a majority of the votes? emoticon_rolleyes", 
   {}, 
   236994, 
   null, 
   1162070640.0
  ], 
  [
   237045, 
   null, 
   "Jo Bennett", 
   "And how would you spin the fact that he was also the first president in 16 years to get a majority of the votes? emoticon_rolleyes\n\n \n Surely that's easily spun by the fact that 3rd party candidates were forced out of the race, and voters who might have supported them stayed at home instead, meaning the vote for the two main parties combined was proportionately higher than at previous elections.", 
   {}, 
   237043, 
   null, 
   1162071120.0
  ], 
  [
   237110, 
   null, 
   "Steeeeve", 
   "Surely that's easily spun by the fact that 3rd party candidates were forced out of the race, and voters who might have supported them stayed at home instead, meaning the vote for the two main parties combined was proportionately higher than at previous elections.\n\n \n atleast you admit this is spin....", 
   {}, 
   237045, 
   null, 
   1162082880.0
  ], 
  [
   237124, 
   null, 
   "Winston Smith", 
   "Australia is a democracy, an ex-colony and a constitutional monarchy. I promise you...\n\n \n Australia is still under the final control of the British Crown. We need independance", 
   {
    "post_info": {
     "post_title": "?"
    }
   }, 
   236989, 
   null, 
   1162087200.0
  ], 
  [
   237125, 
   null, 
   "Winston Smith", 
   "THis is true but more people voted against Bush then have ever voted for any president in the history of the US.\n\n \n Don't worry democratic systems are self correcting. Bush and Co. are on the way out", 
   {
    "post_info": {
     "post_title": "midterm elections"
    }
   }, 
   236994, 
   null, 
   1162087320.0
  ], 
  [
   237127, 
   null, 
   "JPSartre12", 
   "Surely that's easily spun by the fact that 3rd party candidates were forced out of the race, and voters who might have supported them stayed at home instead, meaning the vote for the two main parties combined was proportionately higher than at previous elections.\n\n \n That would be one spin attempt easily rebuked.\n \n http://www.uselectionatlas.org/RESULTS/", 
   {}, 
   237045, 
   null, 
   1162087440.0
  ], 
  [
   237139, 
   null, 
   "Phunting", 
   "Australia is still under the final control of the British Crown. We need independance\nSigh, I came accross this attitude so many times when I lived there. You have the Queen as your symbolic head of state. The Crown doesn't control you , and you have independance. Just like Canada, Jamaica and countless others...", 
   {}, 
   237124, 
   null, 
   1162089300.0
  ], 
  [
   237179, 
   null, 
   "Winston Smith", 
   "it is not just symbolic. The Governor General can dismiss the Prime Minister and Gough Whitlam was dismissed. \n It is patronising to have a Queen ruling us. We are not Canadians who are used to be an appendix of the USA so being a colony is nothing abnormal for them; but we are different. I had to swear allegiance to a far away Queen when I became naturalised. How come? I chose to live in Australia not the UK", 
   {
    "post_info": {
     "post_title": "sigh!"
    }
   }, 
   237139, 
   null, 
   1162108620.0
  ], 
  [
   237186, 
   null, 
   "Jo Bennett", 
   "That would be one spin attempt easily rebuked.\n \n http://www.uselectionatlas.org/RESULTS/\n\n \n As far as I can see your link backs me up.emoticon_confused", 
   {}, 
   237127, 
   null, 
   1162122600.0
  ], 
  [
   237221, 
   null, 
   "Phunting", 
   "it is not just symbolic. The Governor General can dismiss the Prime Minister and Gough Whitlam was dismissed. \n It is patronising to have a Queen ruling us. We are not Canadians who are used to be an appendix of the USA so being a colony is nothing abnormal for them; but we are different. I had to swear allegiance to a far away Queen when I became naturalised. How come? I chose to live in Australia not the UK\nWhitlam was handled badly, the Queen herself didn't want or know that the GG was going to do that. Interesting though that the public voted in the opposition afterwards though...\n \n I can't see that ever happening again, the Queen is now just a symbol. We share a closer history, society and culture with the Ozzies than anyone else. Just because 100 of the past 1600 years of shared history has been in a different location doesn't mean that we are so vastly different. You have full independence and autonomy, the world recognizes you as your own nation. You also have a symbol of your nations history and who you actually are. So to paraphrase the tourist commission's ad: what are you bloody winging about?\n \n So it's patronizing for Australians to have the Queen but not Canadians? emoticon_confused", 
   {}, 
   237179, 
   null, 
   1162146660.0
  ], 
  [
   237240, 
   null, 
   "JPSartre12", 
   "As far as I can see your link backs me up.emoticon_confused\n\n \n How's that? The last election had the highest turnout ever? emoticon_confused", 
   {}, 
   237186, 
   null, 
   1162154820.0
  ], 
  [
   237241, 
   null, 
   "Jo Bennett", 
   "but the proportion of the vote going to 3rd party candidates is very low, that's how Bush gets over 50%.", 
   {}, 
   237240, 
   null, 
   1162154940.0
  ], 
  [
   237242, 
   null, 
   "JPSartre12", 
   "it is not just symbolic. The Governor General can dismiss the Prime Minister and Gough Whitlam was dismissed. \n It is patronising to have a Queen ruling us. We are not Canadians who are used to be an appendix of the USA so being a colony is nothing abnormal for them; but we are different. I had to swear allegiance to a far away Queen when I became naturalised. How come? I chose to live in Australia not the UK\n\n \n Ouch! I don't think that you'll get many Canadians, or Americans for that matter, to agree with you on that one. emoticon_xdonno", 
   {}, 
   237179, 
   null, 
   1162154940.0
  ], 
  [
   237248, 
   null, 
   "zachvac", 
   "but the proportion of the vote going to 3rd party candidates is very low, that's how Bush gets over 50%.\n\n \n Isn't that common sense? If Bush got over 50%, and it was a close race, then obviously there were less votes for 3rd parties. I would probably say that was because many voters who typically vote for a 3rd party voted Republican or Democrat because they were so afraid of the other side getting elected. In other words they played right into the major parties' hands.", 
   {}, 
   237241, 
   null, 
   1162157940.0
  ], 
  [
   237275, 
   null, 
   "Winston Smith", 
   "To us specially those of non British origin, the Queen is a meaningless symbol of faded British Imperialism. Distance and ethnic and cultural diversity make a difference. Canada is compared to Australia practically next to the British Isles, and also Canada is just dwarfed economically by its southern neigbour on which its livelyhood depends. So Canadians have developed a psychology of cultural and economic dependance\n \n Australia on the other hand is a power of its own down under and the logical final step would be to cut the umbilical cord to Great Britain.\n \n Nowadays on the rare occasions the royals fly south at our expense, very few people go to the airport to wave the Union Jack to them.\n \n It is time to say finally we are our own sovereign nation.\n \n British tourists are always welcome of course.", 
   {
    "post_info": {
     "post_title": "Royalty"
    }
   }, 
   237221, 
   null, 
   1162171320.0
  ], 
  [
   237277, 
   null, 
   "Winston Smith", 
   "Ouch! I don't think that you'll get many Canadians, or Americans for that matter, to agree with you on that one. emoticon_xdonno\n\n \n tough! but true", 
   {}, 
   237242, 
   null, 
   1162171380.0
  ], 
  [
   237409, 
   null, 
   "JPSartre12", 
   "but the proportion of the vote going to 3rd party candidates is very low, that's how Bush gets over 50%.\n\n \n More Ralph Nader votes would have resulted in Kerry getting a smaller vote total. No Conservative or Republican of any ilk would ever vote for that clown. :xcensored", 
   {}, 
   237241, 
   null, 
   1162257300.0
  ], 
  [
   237605, 
   null, 
   "Jo Bennett", 
   "Not necessarily, more votes for Nader could have had no effect on Kerry, but pushed the total vote up overall. My reckoning is that the high profile of the election, and the bitterness of the contest, pushed up turnout among the apathetic centre, but democratic attempts to keep Nader and others off the ballot put off left wing voters from voting at all, if the third party candidates had been on the ballot then more people would have voted, forcing both Bush and Kerry's shares of the vote down.\n \n Now how's that for spin? ;)", 
   {}, 
   237409, 
   null, 
   1162408860.0
  ], 
  [
   237624, 
   null, 
   "JPSartre12", 
   "Not necessarily, more votes for Nader could have had no effect on Kerry, but pushed the total vote up overall. My reckoning is that the high profile of the election, and the bitterness of the contest, pushed up turnout among the apathetic centre, but democratic attempts to keep Nader and others off the ballot put off left wing voters from voting at all, if the third party candidates had been on the ballot then more people would have voted, forcing both Bush and Kerry's shares of the vote down.\n \n Now how's that for spin? ;)\n\n \n Very dizzying. emoticon_wow \n Nader was on the ballot, so was the Libertarian candidate, IIRC.", 
   {}, 
   237605, 
   null, 
   1162417380.0
  ], 
  [
   237639, 
   null, 
   "Jo Bennett", 
   "Very dizzying. emoticon_wow \n Nader was on the ballot, so was the Libertarian candidate, IIRC.\n\n \n not everywhere though, certainly in fewer states than in the previous election. The dems went to great lengths to keep him off (and the republicans to great lengths to get him on).", 
   {}, 
   237624, 
   null, 
   1162426560.0
  ], 
  [
   240991, 
   null, 
   "GreenMtnBoy", 
   "Nader was on the ballot, so was the Libertarian candidate, IIRC.\n\n \n YRW. Nader was Green in 2000 and independent in 2004.", 
   {}, 
   237624, 
   null, 
   1164494040.0
  ], 
  [
   242755, 
   null, 
   "gman", 
   "In answer to the thread question \"Are the Repbulicans trying to rig the mid terms?\" \n The elections are over. The Democrats have retaken the house and senate. \n I have yet to hear one accusation of voter fraud. Not one case. \n But, the Republicans did rig the election. They conducted themselves as guttless wonders. They worked 2 days a week. They spent money as though they were Democrats. They did not police themselves as they would expect the rest of the world to do. They did not stand tall and support the president as they should have. They were mice hoping to not #### off the left as they know that doing that makes the leftwing media turn on them. Which to righteous men should be a badge of honor. Cowards who conduct themselves by not ####### people off go home, as they should.", 
   {}, 
   240991, 
   null, 
   1165766460.0
  ], 
  [
   242763, 
   null, 
   "JPSartre12", 
   "In answer to the thread question \"Are the Repbulicans trying to rig the mid terms?\" \n The elections are over. The Democrats have retaken the house and senate. \n I have yet to hear one accusation of voter fraud. Not one case. \n But, the Republicans did rig the election. They conducted themselves as guttless wonders. They worked 2 days a week. They spent money as though they were Democrats. They did not police themselves as they would expect the rest of the world to do. They did not stand tall and support the president as they should have. They were mice hoping to not #### off the left as they know that doing that makes the leftwing media turn on them. Which to righteous men should be a badge of honor. Cowards who conduct themselves by not ####### people off go home, as they should.\n\n \n No argument here. emoticon_xgood", 
   {}, 
   242755, 
   null, 
   1165770780.0
  ], 
  [
   242767, 
   null, 
   "daewoo", 
   "In answer to the thread question \"Are the Repbulicans trying to rig the mid terms?\" \n The elections are over. The Democrats have retaken the house and senate. \n I have yet to hear one accusation of voter fraud. Not one case. \n But, the Republicans did rig the election. They conducted themselves as guttless wonders. They worked 2 days a week. They spent money as though they were Democrats. They did not police themselves as they would expect the rest of the world to do. They did not stand tall and support the president as they should have. They were mice hoping to not #### off the left as they know that doing that makes the leftwing media turn on them. Which to righteous men should be a badge of honor. Cowards who conduct themselves by not ####### people off go home, as they should.\n\n \n \n I will certainly agree that the republicans sunk themselves. The idea that \"not standing up and supporting the presisdent\" had much to do with their loss is ignoring an awful lot of what went on, though. \n \n It was the republicans rubber stamping that XXXXXX policies for so many years that cost them the elections. They supported his idiotic Iraq fantasies, his assinine spending policies, and his absolutly tyrannical view on the constitution. Then, a few months before the elections, they finally look around and realize that Stalin was more popular with people he had stuck in death camps than George Buus was with the american people, so they try to shift course. After YEARS of rubber stamping everything the guy gave them and defending every moronic statement that came out of the guys mouth, they realize the guy is an idiot and if they want to get re-elected, they had better try to distance themselves from his stupidity.\n \n So, after sucking the guys nads for years, they finally jump up and say \"we don't REALLY agree with him\".\n \n Now, I will be the first to admit that the american people are a bunch of apathetic, gullible fools. Even the American public is not quite that stupid. \n \n The republicans lost because they did a crappy job. They led the country off in the wrong direction, cost us trillions, and made us less safe, despite mounting a serious offensive against the bill of rights, which was supposed to protect us. \n \n Hopefully, the republicans will pull their heads out of their butts and try to get back to actual conservative values. Then maybe they can get back into power. While watching them pick on gay people, strip civil rights, and blow money like drunken sailors in a whore house was interesting, it got old pretty quick.", 
   {}, 
   242755, 
   null, 
   1165774140.0
  ], 
  [
   242852, 
   null, 
   "gman", 
   "Number 1. define how Americans are less safe. What event occurred after Sep. 11 that would prove that. \n What economic event suggest that Bush had an adverse effect on Society.\n Deficit? America functioned with a massive deficit from the 40's to the 90's. Nobody noticed. \n If your comparison of Bush's popularity to Stalin's after throwing Russians into death camps holds any truth, it would define the American people as the XXXXXX. \n But, they are not much different than any other nation of fools, who's been led around by the nose by the media. \n If Bush's war on terror does not go forward. If American's do not continue the war on Iraqi soil, it will come home. Then, you can whine about how safe you are. \n Speaking of whining, what civil right have you lost? Please don't dig into your imagination. What can you not do now that you did before America was attacked? \n Next, please give a clue as to what a leftist leadership will do that will bring safety and prosperity to you.", 
   {}, 
   242767, 
   null, 
   1165824120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are the Republicans trying to rig the mid terms?", 
  "url": "http://www.4forums.com/political/civil-rights-debates/9059-republicans-trying-rig-mid-terms.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 9059, 
  "discussion_files": [
   [
    "4486.html", 
    "http://www.4forums.com/political/civil-rights-debates/9059-republicans-trying-rig-mid-terms-print.html"
   ], 
   [
    "4487.html", 
    "http://www.4forums.com/political/civil-rights-debates/9059-republicans-trying-rig-mid-terms-5-print.html"
   ], 
   [
    "4488.html", 
    "http://www.4forums.com/political/civil-rights-debates/9059-republicans-trying-rig-mid-terms-4-print.html"
   ], 
   [
    "4489.html", 
    "http://www.4forums.com/political/civil-rights-debates/9059-republicans-trying-rig-mid-terms-3-print.html"
   ], 
   [
    "4490.html", 
    "http://www.4forums.com/political/civil-rights-debates/9059-republicans-trying-rig-mid-terms-2-print.html"
   ]
  ], 
  "identifier": 9059
 }
]