[
 [
  [
   235892, 
   null, 
   "supersport", 
   "I believe the theory of evolution is much like a fiction book -- a giant made-up bed-time story - from beginning to end. Yet it's a story that appears in textbooks, schools, universities, and on front pages of newspapers. It's given legitimacy by a group of pagan elitists...and it has the authority of science backing it up. But this authority is not backed on mountains of actual evidence or indesputable facts, but on a body of wild assertions, conveluted theories and varying opinions. I believe one of the scientific community's main jobs is not to uncover the truth about the origins of our world, but rather, not to expose or contradict what the fiction writers have previously dreamed up. Have you ever noticed that you NEVER see an article on the front page - or on any page - of the newspaper that sheds a bad light on the theory of evolution? Never. It's always a favorable story. Is this an accident?\n \n And see, the elitists truly are geniuses. It's an evil type of genius, but genius none-the-less. They have figured out that much of the population - whether religious or not - would much rather believe in something as opposed to know something.....and this is why they are able to get away with constructing a giant mountain of conveluted madness: It's something a certain segment of the population can stick their nose in, learn from, and fall in love with. And see these guys know that it's not necessary to construct a theory based on actual facts or real evidence, because people aren't enamored with things that are known. People are enamored with mystery, intrigue, and speculation. They fall in love, not with known answers, but with the persuit of answers. And once people fall in love with the persuit - absolutely nothing can change their mind - because instead of being intellectual, the theory of evolution soon becomes emotional, almost spiritual. Of course, the Theory of Evolution will always be nothing but a persuit - because there are no real answers. But this is why evolutionists find it difficult to believe in God, because to believe in God would be to discontinue looking for answers - Because, in reality, God IS the answer. But this is not something they're not willing to do.\n \n \n But evolutionists are just as religious as Christians: they have their own unseen miracles - (random mutations)....their own clergy (scientists)...their own Bible (The Origin of Species)....and their own god (Natural Selection).\n \n And see, evolutionists have a whole heirarchy set up. A family tree of sorts. This is in place so that anyone who has a problem believing that life or conscousness is anything but a cosmic accident can have a place to reassure himself.\n \n At the top of this hiearchy are the scientists themselves. These are the white-coat-wearing untouchables of society. Absolutely no criticism can be directed to this group of individuals. Criticism must be screened, and they must be given upmost respect at all times, because after all, it's they who tell us who we are, where we came, and where we're going. They're also able to concoct a wide variety of toxic potions that will mask any physical symptom we might have. Of course, this potion might destroy our liver or kidneys in the process of ridding our toenail fungus, but what-the-heck.\n \n Next on the totem pole are the fiction writers who take the work of the scientists, twist it around and tell us \"little folks\" what it means. Examples would be Richard Dawkins, Stephen Jay Gould, and Ernst Mayr. Ultimately, their main goal is to make up stories of how pathetic, yet equally worthless we all are. And their real talent is telling these stories in such a way that we feel good about emerging from lower forms of animals such as worms and viruses.\n \n Next we have College Professors, Phds and various Educators. These people are in charge of keeping Bible talk out of the classroom. Their job is also to brainwash our children that its ok if they want to grow up to be a transexual prostitute, but it's not ok if they voice a negative opinion about shacking up in the same tent as their gay Boy Scout leader. \n \n Next we have the Media. The media's job is to act as a propaganda machine and shine a good light on the theory of evolution. They present evolution as \"science\" and \"truth\" to the unsuspecting. They play a huge role in molding society's thinking patterns. They aim to shape not only personal beliefs, but social behaviors and political opinions as well. The media is the glue that keeps this whole thing together. Without the constant drumbeats of the media, the theory of evolution would quickly collapse. No anti-evolution story is ever allowed to be broadcast on TV or printed in newspapers or magazines. They have constructed an intellectual moat around themselves which disallows any contradictory evidence to flow in or out.\n \n Finally we have us little people. Well, not everyone's little.....just us toothless wingnuts south of the mason-dixon line who go to work every day, support our families, don't do drugs, don't cheat on our wives, pay the taxes, defend our country, and worship our Creator. We're the people who keep this darn country afloat. Yet WE are the people who evidently have everything wrong. We're the people who are too dumb to realize that we emerged from from an ameba via mutations - regardless of the fact that mutations are highly detrimental. We're too stupid to realize that the human genome, with over 2 billion base pairs and 400 bazillion ciruits in the brain could come together by chance mutation. We're too pathetic to realize that we evolved via chance from a good-for-nothing pack of stinking low-life monkeys. And you know why it is that we're dumb??? Because the intellectual elites TELL us we're too dumb.....They talk to us like children.\n \n Have you ever noticed in scientific papers, they always talk about themselves as \"we?\" It's like a cult. \"We know this.\" \"We know that.\" \"We're learning.\" \"We've known for a long time.\" Who exactly is this \"We\"? -- the dude doing the research and the pet mouse in his pocket? It's like an exclusive group - and we dumb hicks aren't invited to join because we're too stupid to understand the intracies of science.\n \n And just in case some dumb hick gets a wild hair and decides he wants to revolt, the elitists make up all kinds of unnecessarily confusing, goofball made-up terms to try and confuse us. Here are a few examples\n \n Phenotypic plasticity\n Adaptive radiation\n Extended phenotype\n Phyleticism\n Isolating mechanism\n Polymorphism\n Phenetic discontinuity\n Dichopatric speciation\n Sexual dimorphism\n Saltationism\n \n What the heck kind of nonsense is that? emoticon_confused \n \n See what their game is, is they overwhelm the average guy who may be skeptical about evolution. They attempt to confuse and disorient him with their ocean of conveluted, highly pliable definitions and theories. That way, if he revolts, those in authority can sneer down at him and call him an idiot because he just doesn't understand! But is it any wonder that he doesn't understand? Satan is the master deceiver. He is the master at confusing people and disorienting them. That's what we're seeing here. Confusing people is not an accident -- it's the WHOLE DAD-GUM PLAN!!! emoticon_confused :xbanghead emoticon_confusedemoticon_xdonno emoticon_wow emoticon_confused", 
   {
    "post_info": {
     "post_title": "Elitists, Pagans, Goofballs and Wingnuts"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1161483420.0
  ], 
  [
   235899, 
   null, 
   "Collin", 
   "I believe the theory of evolution is much like a fiction book -- a giant made-up bed-time story - from beginning to end. Yet it's a story that appears in textbooks, schools, universities, and on front pages of newspapers.\n\n \n Go figure.", 
   {
    "unicode_changes_made": true
   }, 
   235892, 
   null, 
   1161486900.0
  ], 
  [
   235901, 
   null, 
   "marc9000", 
   "\n But evolutionists are just as religious as Christians: they have their own unseen miracles - (random mutations)....their own clergy (scientists)...their own Bible (The Origin of Species)....and their own god (Natural Selection). \n\n \n Well said. \n \n With this religion, the gap is very wide between the \"average guy\" and \"authority\", because their clergy is more involved in politics than the clergy of Christianity, or the Creator himself. It fits with more Democrats being evolutionists, and more Democrats favoring bigger domestic government.", 
   {
    "unicode_changes_made": true
   }, 
   235892, 
   null, 
   1161489600.0
  ], 
  [
   235902, 
   null, 
   "electrolyte", 
   "You gotta love when they open themselves up to such ridicule:\n \nAnd just in case some dumb hick gets a wild hair and decides he wants to revolt, the elitists make up all kinds of unnecessarily confusing, goofball made-up terms to try and confuse us. Here are a few examples\n \n Phenotypic plasticity\n Adaptive radiation\n Extended phenotype\n Phyleticism\n Isolating mechanism\n Polymorphism\n Phenetic discontinuity\n Dichopatric speciation\n Sexual dimorphism\n Saltationism\n \n What the heck kind of nonsense is that? emoticon_confused \n \n See what their game is, is they overwhelm the average guy who may be skeptical about evolution. They attempt to confuse and disorient him with their ocean of conveluted, highly pliable definitions and theories. That way, if he revolts, those in authority can sneer down at him and call him an idiot because he just doesn't understand! But is it any wonder that he doesn't understand? Satan is the master deceiver. He is the master at confusing people and disorienting them. That's what we're seeing here. Confusing people is not an accident -- it's the WHOLE DAD-GUM PLAN!!! emoticon_confused :xbanghead emoticon_confusedemoticon_xdonno emoticon_wow emoticon_confused\n\n \n See, what their game is, is they overwhelm the average person with terminology. Here are some examples that aren't even related to biology:\n keto-enol tautomerization\n autoionization\n correlation spectroscopy\n thermodynamic instability\n zwitterionic moieties\n condensation polymerization\n disproportionation reaction\n carbocation hyperconjugation\n Obviously, proponents of modern chemistry are pulling the wool over our eyes. For crying out loud, they pronounce u-n-i-o-n-i-z-e-d with four syllables! And as if we didn't already have doubts, what happens when we ask these so-called chemistry scientists, or \"chemists,\" to observe the simple particles upon which their \"theories\" are based? They can't even come up with anything that makes sense! No, all they can do is pull this stupid stuff about probabilistic wavefunctions and diffraction patterns and math too complex for even fancy computers... and something about a cat. Pfft.", 
   {
    "unicode_changes_made": true
   }, 
   235892, 
   null, 
   1161490380.0
  ], 
  [
   235906, 
   null, 
   "electrolyte", 
   "With this religion, the gap is very wide between the \"average guy\" and \"authority\", because their clergy is more involved in politics than the clergy of Christianity, or the Creator himself.\n\n So Darwin (the naturalist) didn't care at all about science or nature and was instead all about politics and destroying his own religion, huh?\n \n \nIt fits with more Democrats being evolutionists, and more Democrats favoring bigger domestic government.\n\n More belligerent ranting, I see. All Democrats have secretly joined forces with the EAC, right? Funny how the side baselessly accusing \"evolutionists\" of reckless politicking is.. well, recklessly politicking.", 
   {}, 
   235901, 
   null, 
   1161491280.0
  ], 
  [
   235933, 
   null, 
   "johnhanks", 
   "We're too stupid to realize that the human genome, with over 2 billion base pairs and 400 bazillion ciruits in the brain could come together by chance mutation.\n\n This could be supersport's most insightful post yet. OK, he still doesn't understand that 'chance mutation' alone doesn't drive evolution; but the above suggests he's beginning to realise why he doesn't understand.", 
   {
    "unicode_changes_made": true
   }, 
   235892, 
   null, 
   1161510600.0
  ], 
  [
   236024, 
   null, 
   "Hi_Its_Me", 
   "But evolutionists are just as religious as Christians: they have their own unseen miracles - (random mutations)....their own clergy (scientists)...their own Bible (The Origin of Species)....and their own god (Natural Selection).\n\n Well said. \n \n With this religion, the gap is very wide between the \"average guy\" and \"authority\", because their clergy is more involved in politics than the clergy of Christianity, or the Creator himself. It fits with more Democrats being evolutionists, and more Democrats favoring bigger domestic government.\n\n Attention everyone! Marc9000 has declared his belief that NO ONE on 4forums.com is an atheist!\n \n \n By the way, thank you for posting.", 
   {
    "unicode_changes_made": true
   }, 
   235892, 
   null, 
   1161567240.0
  ], 
  [
   236052, 
   null, 
   "lucaspa", 
   "I believe the theory of evolution is much like a fiction book -- a giant made-up bed-time story - from beginning to end.\n\n \n That's your problem. Any other subjects on which you are delusional?\n \n \nIt's given legitimacy by a group of pagan elitists...and it has the authority of science backing it up. But this authority is not backed on mountains of actual evidence or indesputable facts, but on a body of wild assertions, conveluted theories and varying opinions.\n\n \n You've never read Origin of Species, have you? Because that book is chock full of evidence and indisputable (not \"indesputable\") facts that support the theory. You could also go to PubMed and enter \"evolution\" as the search term. This is a MEDICAL database only going back to 1965. Paleontology journals are not included. Yet it has over 200,000 articles on evolution.\n \n Look, I can't help it that you are ignorant of the evidence supporting evolution and refuting creationism. All I can say is that the Argument from Ignorance is not an acceptable argument. The data is there. If you are interested, I'll help lead you to some of it. Of course, that would destroy your delusions. Are you ready for that?\n \n \n I believe one of the scientific community's main jobs is not to uncover the truth about the origins of our world, but rather, not to expose or contradict what the fiction writers have previously dreamed up. Have you ever noticed that you NEVER see an article on the front page - or on any page - of the newspaper that sheds a bad light on the theory of evolution? Never. It's always a favorable story. Is this an accident?\n\n \n LOL! Any part of evolution that can be argued is argued. Look at the uproar in science over Punctuated Equilibrium. Look at the uproar within science of epigenetics. Lynn Margulis, Niles Eldredge and Stephen Jay Gould are famous because they challenged parts of the Modern Synthesis. The only reason they didn't challenge the core statements of evolution is because they could not, not because they would not.\n \n \nOf course, the Theory of Evolution will always be nothing but a persuit - because there are no real answers. But this is why evolutionists find it difficult to believe in God, because to believe in God would be to discontinue looking for answers - Because, in reality, God IS the answer. But this is not something they're not willing to do.\n\n \n Again, I will note that at least half the evolutionary biologists in history have been theists and believed in God. Darwin and the other Christian scientists of his time believed they were looking for how God created. What you need to do is tell us why God could not have created by evolution and why you think accepting evolution means denying God. As I've said elsewhere, rejecting evolution is actually the real denial of God. After all, in the transitional individuals in our own evolutionary history, it is like God yelling \"I did it be evolution!\"\n \n \nThey're also able to concoct a wide variety of toxic potions that will mask any physical symptom we might have. Of course, this potion might destroy our liver or kidneys in the process of ridding our toenail fungus, but what-the-heck.\n\n \n Are you equating the pharmacologists who work for pharmaceutical companies for ALL of science? This is improper syndecdoche, if you didn't know.\n \n The rest of the post evidences an increasing dissociation with reality.\n \n \n ameba via mutations - regardless of the fact that mutations are highly detrimental. We're too stupid to realize that the human genome, with over 2 billion base pairs and 400 bazillion ciruits in the brain could come together by chance mutation.\n\n \n You forgot selection. Selection is the opposite of chance. \n \n \nThey talk to us like children.\n\n \n You are not spoken to like children. You just behave like children when you stick your fingers in your ears and yell \"I can't hear you\" when you are told truths you don't want to hear.\n \n \nHave you ever noticed in scientific papers, they always talk about themselves as \"we?\" \n\n \n It used to be that scientific papers were written in passive voice: \"it has been shown that ...\" \"it is known that ...\" The personal was taken out of it. However, the publishers of those scientific paper noticed that it took a lot more letters to talk in passive voice than active voice. When each letter cost 10 cents or more, it added up in the course of a year to tens of thousands of dollars for passive voice. So authors have been told to use active voice. And now you think it is a cult. That's too funny.\n \n \n Here are a few examples\n \n Phenotypic plasticity\n Adaptive radiation\n Extended phenotype\n Phyleticism\n Isolating mechanism\n Polymorphism\n Phenetic discontinuity\n Dichopatric speciation\n Sexual dimorphism\n Saltationism\n \n What the heck kind of nonsense is that? \n\n \n No more nonsense than \"salvation\", \"grace\", \"transubstantiationism\", etc. The real words have precise definitions. Unfortunately, you seem to have made up a couple of fake ones there. Learn the terms. It's not as tho they are kept secret. \n \n I'll be happy to discuss any of those terms in detail with you. Start a thread called \"confusing terms in evolution\" and we'll go thru them one by one. I'm certainly not trying to overwhelm or confuse you. I simply don't want to talk down to you. So I may err on the side of talking over you. But you can always ask me questions until you understand. In fact, I insist that you do.\n \n \n Satan is the master deceiver. \n\n \n In your belief system, Satan is. Which is why you should consider that Satan is behind creationism.", 
   {
    "unicode_changes_made": true
   }, 
   235892, 
   null, 
   1161574380.0
  ], 
  [
   236056, 
   null, 
   "lucaspa", 
   "Well said. \n \n With this religion, the gap is very wide between the \"average guy\" and \"authority\", because their clergy is more involved in politics than the clergy of Christianity, or the Creator himself. It fits with more Democrats being evolutionists, and more Democrats favoring bigger domestic government.\n\n \n Marc, you really need to look at some history. Remember, it was Fundamentalists -- working thru politics -- that got evolution barred from public schools back at the turn of the century. They got into politics and persuaded state legislators to ennact laws. Evolutionists didn't do this. Instead they went thru the courts.\n \n Then, in Kansas in 1998, Fundies got organized again and voted in a creationist state school board. The evolutionists reacted to this political move. And then, after a new school board was elected in 2000, the evolutionists stopped. The creationists stayed organized and elected another pro-creationism school board in 2004.\n \n The Discovery Institute has published the Wedge Strategy. This is purely political. No science involved and tells people how to sneak creationist candidates into school boards and other public offices.\n \n Marc, have you ever heard of the psychological term \"projection\"? It is when a person takes a trait in themselves that they don't like or know is wrong and say other people are doing that. This post was pure projection of the faults of creationists onto evolutionists. Evolution works out in science. Creationists don't do science but engage in politics. What you are unhappy about is that the facts and evidence of science wins against the political chicanery of creationists.", 
   {}, 
   235901, 
   null, 
   1161574920.0
  ], 
  [
   236255, 
   null, 
   "marc9000", 
   "Marc, you really need to look at some history. Remember, it was Fundamentalists -- working thru politics -- that got evolution barred from public schools back at the turn of the century. They got into politics and persuaded state legislators to ennact laws. Evolutionists didn't do this. Instead they went thru the courts. \n\n \n It has gone full circle, I agree that \"fundamentalists\" may have gone too far at the turn of the century. But maybe not - not enough was known then about evolution for it to be much more than an avenue for immorality. You know - no purpose, no morals. We're seeing a lot of that today. \n \n \"Persuading legislators\" is a lot more in keeping with the Constitution than going through the courts. Courts are deciding social issues now far more than they did in the past. \n \n \nThen, in Kansas in 1998, Fundies got organized again and voted in a creationist state school board. The evolutionists reacted to this political move. And then, after a new school board was elected in 2000, the evolutionists stopped. The creationists stayed organized and elected another pro-creationism school board in 2004. \n\n \n Evolutionists stopped? Or re-organized?\n \n \nThe Discovery Institute has published the Wedge Strategy. This is purely political. No science involved and tells people how to sneak creationist candidates into school boards and other public offices. \n\n \n The Wedge Strategy was a reaction to the increasingly popular idea that science supports the unscientific philosophy of naturalism. \n \n \nMarc, have you ever heard of the psychological term \"projection\"? It is when a person takes a trait in themselves that they don't like or know is wrong and say other people are doing that. \n\n \n It can go both ways, can't it? Would you say that several posters personally insulting one poster could be one of the best indicators of exactly who is doing it? \n \n \n This post was pure projection of the faults of creationists onto evolutionists. Evolution works out in science. Creationists don't do science but engage in politics. \n\n \n So you're saying evolution never enters politics, and Creationists never consider science? \n \n \n What you are unhappy about is that the facts and evidence of science wins against the political chicanery of creationists.\n\n \n I'm unhappy that more and more politicians and school children seem to think that science is the only source of knowledge.", 
   {}, 
   236056, 
   null, 
   1161656880.0
  ], 
  [
   236286, 
   null, 
   "obvious_child", 
   "and more Democrats favoring bigger domestic government.\n\n \n And where has Marc9000 been in the past oh 30 years?\n \n Do we need to remind him of the size of the gov't under Reagan? or how about Bush Sr, or Bush Jr? \n \n Ah yes, so a party that supports the intervention of the federal government in the personal disputes of a family is not favoring bigger domestic government? \n \n That crack rock has to be strong stuff.", 
   {}, 
   235901, 
   null, 
   1161676740.0
  ], 
  [
   236288, 
   null, 
   "Jo Bennett", 
   "What puzzles me is why bring Pagans into this? Which particular pagans are we talking about here? The Pagans I know have about as much diversity of belief about this as Christians do.", 
   {}, 
   236286, 
   null, 
   1161682260.0
  ], 
  [
   236531, 
   null, 
   "supersport", 
   " That's your problem. Any other subjects on which you are delusional?\n \n probably....I think anyone who kills an unborn child with a knife to the head is a murderer. Does that make me delsional?\n \n \n You've never read Origin of Species, have you? \n \n No....are you kidding? That would take me all year.\n \n \n \n You forgot selection. Selection is the opposite of chance. \n \n Not if variation is directed it's not.\n \n You are not spoken to like children. You just behave like children when you stick your fingers in your ears and yell \"I can't hear you\" when you are told truths you don't want to hear.\n \n anyone who speaks out against neo-darwinism is ridiculed...surely you don't deny that.\n \n \n I'll be happy to discuss any of those terms in detail with you. Start a thread called \"confusing terms in evolution\" and we'll go thru them one by one. I'm certainly not trying to overwhelm or confuse you. I simply don't want to talk down to you. So I may err on the side of talking over you. But you can always ask me questions until you understand. In fact, I insist that you do.\n \n I'm a simple dude....I like keeping things easy to understand. Evolutionists on the otherhand, thrive on conveluted definitions that are changeable at any time for any reason.\n \n Take care, S", 
   {}, 
   236052, 
   null, 
   1161817560.0
  ], 
  [
   236541, 
   null, 
   "Collin", 
   "No....are you kidding? That would take me all year.\n\n \n This is true. You're a terrible reader, and there's a vast amount of testable evidence in Origin of Species that refutes your idea of Lamarckism. Not only would it be very challenging for you, but you really don't want to know about the ToE and how backward your thinking is.", 
   {}, 
   236531, 
   null, 
   1161819540.0
  ], 
  [
   236552, 
   null, 
   "Hi_Its_Me", 
   "That's your problem. Any other subjects on which you are delusional?\n \n probably....I think anyone who kills an unborn child with a knife to the head is a murderer. Does that make me delsional?\n\n No, it doesn't make you \"delsional\" or delusional. However, it is not really related...\n \n Thinking that On the Origin of the Species is a \"bedtime story\" does. If you haven't noticed, there is an abundance of evidence in support of the ToE, and there is certainly enough to show that it is not a \"bedtime story.\"\n \n Also, could you at least mention who you are quoting? It took a little time to find the context you took that quote out of.", 
   {}, 
   236531, 
   null, 
   1161823140.0
  ], 
  [
   236557, 
   null, 
   "Shooterandproud", 
   "Whats going on?\n \n Everyone posting on this thread fails to see that it is pure humor. Nobody is so delusional as that. Supersport is mocking crazy creationist zealots.", 
   {}, 
   236552, 
   null, 
   1161825180.0
  ], 
  [
   236558, 
   null, 
   "Shooterandproud", 
   " That's your problem. Any other subjects on which you are delusional?\n \n probably....I think anyone who kills an unborn child with a knife to the head is a murderer. Does that make me delsional?\n \n \n You've never read Origin of Species, have you? \n \n No....are you kidding? That would take me all year.\n \n \n \n You forgot selection. Selection is the opposite of chance. \n \n Not if variation is directed it's not.\n \n You are not spoken to like children. You just behave like children when you stick your fingers in your ears and yell \"I can't hear you\" when you are told truths you don't want to hear.\n \n anyone who speaks out against neo-darwinism is ridiculed...surely you don't deny that.\n \n \n I'll be happy to discuss any of those terms in detail with you. Start a thread called \"confusing terms in evolution\" and we'll go thru them one by one. I'm certainly not trying to overwhelm or confuse you. I simply don't want to talk down to you. So I may err on the side of talking over you. But you can always ask me questions until you understand. In fact, I insist that you do.\n \n I'm a simple dude....I like keeping things easy to understand. Evolutionists on the otherhand, thrive on conveluted definitions that are changeable at any time for any reason.\n \n Take care, S\n\n \n Im afraid to debate you on the grounds of a mental disability, or heavy controlled substance abuse. Until i can get verification that you are in your right mind, i am in no position to debate you.", 
   {}, 
   236531, 
   null, 
   1161825540.0
  ], 
  [
   236559, 
   null, 
   "Shooterandproud", 
   "That's your problem. Any other subjects on which you are delusional?\n \n probably....I think anyone who kills an unborn child with a knife to the head is a murderer. Does that make me delsional?\n \n\n \n And for the record, i think anyone that tries to take away a women's right to her own body is a sexist and has no respect for human life, or has any concious about the woman at stake here. You care merely about a couple of cells and not about the real humans, nor do you care about society. It seems to me you are only trying to earn yourself brownie points in heavan. I am not influenced by that, im going to have my own opinions, and speak about what i feel is right instead of some christian god telling me what to do.", 
   {}, 
   236558, 
   null, 
   1161825780.0
  ], 
  [
   236564, 
   null, 
   "Belfrey", 
   "What puzzles me is why bring Pagans into this? Which particular pagans are we talking about here? The Pagans I know have about as much diversity of belief about this as Christians do.\n\n \n He probably means \"heathens.\"\n \n You know those non-fundamentalists, they all look alike!", 
   {}, 
   236288, 
   null, 
   1161827160.0
  ], 
  [
   236579, 
   null, 
   "supersport", 
   "No, it doesn't make you \"delsional\" or delusional. However, it is not really related...\n \n Thinking that On the Origin of the Species is a \"bedtime story\" does. If you haven't noticed, there is an abundance of evidence in support of the ToE, and there is certainly enough to show that it is not a \"bedtime story.\"\n \n Also, could you at least mention who you are quoting? It took a little time to find the context you took that quote out of.\n\n \n which quote are you referring to?", 
   {}, 
   236552, 
   null, 
   1161839100.0
  ], 
  [
   236580, 
   null, 
   "supersport", 
   "Im afraid to debate you on the grounds of a mental disability, or heavy controlled substance abuse. Until i can get verification that you are in your right mind, i am in no position to debate you.\n\n \n smart move...I do have psychotic tendencies. But that doesn't make your theory truth.", 
   {}, 
   236558, 
   null, 
   1161839160.0
  ], 
  [
   236583, 
   null, 
   "obvious_child", 
   "smart move...I do have psychotic tendencies. But that doesn't make your theory truth.\n\n \n Hey sport, if you believe that evolution is so wrong and creation so right, why it is you can't defend your belief on the flood thread?", 
   {}, 
   236580, 
   null, 
   1161841620.0
  ], 
  [
   236595, 
   null, 
   "Jo Bennett", 
   "He probably means \"heathens.\"\n \n You know those non-fundamentalists, they all look alike!\n\n \n I think he doesn't really know what he means, I don't think all heathens follow a particular set of beliefs, though I don't know as many as I do pagans.", 
   {}, 
   236564, 
   null, 
   1161860460.0
  ], 
  [
   236624, 
   null, 
   "GazzaElliott", 
   "I'd suggest that rather than 'heathens' he actually means 'heretics' (as in those who seek to corrupt people from his view of the true faith). I imagine he'd also support the creation of the Evangelical Inquisition. No-one expects the Inquisition!", 
   {}, 
   236595, 
   null, 
   1161877020.0
  ], 
  [
   236636, 
   null, 
   "Jo Bennett", 
   "only believers (or at least members of a particular faith) can be heretics from it, so that's not quite right either. Maybe infidel is the word he's after?", 
   {}, 
   236624, 
   null, 
   1161880800.0
  ], 
  [
   236688, 
   null, 
   "Hi_Its_Me", 
   "Which quote are you referring to?\n \n I would appreciate it if you at least name the person you are replying to. It took me a while to find the quote because of other posts since then.", 
   {}, 
   236579, 
   null, 
   1161904020.0
  ], 
  [
   236697, 
   null, 
   "Shooterandproud", 
   "smart move...I do have psychotic tendencies. But that doesn't make your theory truth.\n\n \n Fine, i believe you. I will not ask you to post proof because i dont want to sound like a stalker.emoticon_xgood", 
   {}, 
   236580, 
   null, 
   1161910500.0
  ], 
  [
   237968, 
   null, 
   "supersport", 
   "Hey sport, if you believe that evolution is so wrong and creation so right, why it is you can't defend your belief on the flood thread?\n\n \n I could care less about proving the flood. All I care about is disproving your crackpot, unsuported theory.", 
   {}, 
   236583, 
   null, 
   1162622700.0
  ], 
  [
   237974, 
   null, 
   "electrolyte", 
   "All I care about is disproving your crackpot, unsuported theory.\n\n Well that's obvious. Certainly nobody thought you cared about truth.", 
   {}, 
   237968, 
   null, 
   1162626000.0
  ], 
  [
   237977, 
   null, 
   "supersport", 
   "Well that's obvious. Certainly nobody thought you cared about truth.\n\n \n No I care about it...but since creation was not a scientific event, it cannot be proven scientifically. As far as the flood goes, I am not a geologist nor an archeologist, thus, I am not able to attempt to prove it.", 
   {}, 
   237974, 
   null, 
   1162626660.0
  ], 
  [
   237990, 
   null, 
   "Rovdak", 
   "I think he doesn't really know what he means, I don't think all heathens follow a particular set of beliefs, though I don't know as many as I do pagans.\n\n \n People who follow Pagan faiths with a Nordic Slant sometimes specifically refer to themselves as heathens iirc.", 
   {}, 
   236595, 
   null, 
   1162648800.0
  ], 
  [
   237993, 
   null, 
   "Jo Bennett", 
   "That's what I thought.", 
   {}, 
   237990, 
   null, 
   1162650660.0
  ], 
  [
   237996, 
   null, 
   "trebor", 
   "I could care less about proving the flood. All I care about is disproving your crackpot, unsuported theory.\n\n \n What theory is that?? You see, evolution is mainstream, and it is very supported. Using out of context quotes from articles, misunderstanding other articles, and using crackpot sources yourself is not 'disproving' evolution at all.\n \n It is just demonstrating to the world that you are a crackpot.", 
   {}, 
   237968, 
   null, 
   1162652580.0
  ], 
  [
   238009, 
   null, 
   "Rovdak", 
   "That's what I thought.\n\n \n I guess the details are mostly irrelevant in the minds of evangelicals though, us being apostates, perhaps that was what he meant.", 
   {}, 
   237993, 
   null, 
   1162657800.0
  ], 
  [
   238039, 
   null, 
   "electrolyte", 
   "No I care about it...\n\n No, you don't. You just told us that all you care about is disproving evolutionary theory (even though your representation of it is nothing like what evolutionary theory actually is). Even if you hadn't belied your intent with that \"slip of the tongue,\" we can tell that much from the fact that you repeatedly post absolute rubbish, misrepresented quotes, and inaccurate descriptions of evolutionary theory.", 
   {}, 
   237977, 
   null, 
   1162668060.0
  ], 
  [
   238183, 
   null, 
   "supersport", 
   "No, you don't. You just told us that all you care about is disproving evolutionary theory (even though your representation of it is nothing like what evolutionary theory actually is). Even if you hadn't belied your intent with that \"slip of the tongue,\" we can tell that much from the fact that you repeatedly post absolute rubbish, misrepresented quotes, and inaccurate descriptions of evolutionary theory.\n\n \n I know it's sometimes hard for you evolutionists to follow along...but I do care about creation but there is no way I can prove it scientifically....thus I have no motivation to attempt to prove it in that way.\n \n The creation of the world was not a scientific event...it was a spiritual event...which is why you cannot explain it scientifically either.", 
   {}, 
   238039, 
   null, 
   1162755360.0
  ], 
  [
   238187, 
   null, 
   "electrolyte", 
   "I know it's sometimes hard for you evolutionists to follow along...\n\n Hey, you're the one saying things and then taking them back. You can't even keep up with your own statements.\n \n \nbut I do care about creation\n\n Then you lied.\n \n \nbut there is no way I can prove it scientifically....\n\n Of course you can't, and for the same reason you can't prove that 2+2=5: it isn't true.\n \n \nthus I have no motivation to attempt to prove it in that way.\n\n Yet here you are repeatedly posting all sorts of nonsense about evolution. But you have no motivation, huh?\n \n \nThe creation of the world was not a scientific event...it was a spiritual event...\n\n Only in your delusional worldview. See below.\n \n \nwhich is why you cannot explain it scientifically either.\n\n I have supporting evidence. You have nothing but special pleading and supposed miracles.", 
   {}, 
   238183, 
   null, 
   1162756740.0
  ], 
  [
   238193, 
   null, 
   "Hi_Its_Me", 
   "I know it's sometimes hard for you evolutionists to follow along...but I do care about creation but there is no way I can prove it scientifically....thus I have no motivation to attempt to prove it in that way.\n\n Ok... so do you actually expect to convince us of the bible's accuracy?\n Or are you just attempting to show that \"evolution is wrong,\" causing us to believe the bible unconditionally?\n \nThe creation of the world was not a scientific event...it was a spiritual event...which is why you cannot explain it scientifically either.\n\n Aside from the Big Bang, observations of planets forming, and a bunch of other evidence, I suppose we can't explain it.\n Considering the evidence, however, why do you say that?", 
   {}, 
   238183, 
   null, 
   1162757460.0
  ], 
  [
   238203, 
   null, 
   "Collin", 
   "Supertroll admits that life and the creation of the world are, according to his religion, unscientific events that must be explained spiritually. That's fine. The hypocrisy starts when he attempts to disprove a scientific claim. If his beliefs are indeed spiritual, it shouldn't matter how much scientific evidence weighs in against it.", 
   {}, 
   238193, 
   null, 
   1162763280.0
  ], 
  [
   238274, 
   null, 
   "supersport", 
   "Supertroll admits that life and the creation of the world are, according to his religion, unscientific events that must be explained spiritually. That's fine. The hypocrisy starts when he attempts to disprove a scientific claim. If his beliefs are indeed spiritual, it shouldn't matter how much scientific evidence weighs in against it.\n\n \n \n \n Nothing is more humorous than when an evolutionist pokes fun at creationists or IDists for not putting forth a scientific theory to explain life. \n \n First of all, life is not scientific -- life is spirtual. Contrary to what evolutionists say, what makes us human is not the shape of our jaw bone or the size of our heads. Life is something that controls and manipulates the matter it occupies. Thus, those who claim to be able to describe life scientifically are kidding themselves because life is more than material -- it's metaphysical, which by defintion is in conflict with science. Science is the study of the material world.\n \n So when evolutionists scoff at Creationists for not putting forth a scientific theory for life, I believe they are asking us to play a game, which includes defining life according to a flawed premise. \n \n But what's truly laughable about all this is that the \"science\" evolutionists put forth is not science at all. Like I said, \"science\" is (or should be) the study of the material world. But what the world's evolutionists have forced down our kids' throats is not science. Instead it's long list of \"what ifs,\" \"probablys,\" \"maybes,\" and \"more-than-likelys.\" What they're attempting to sell the unsuspecting public is not to be found in nature -- it's found in their books. \n \n And their so-called evidence is NEVER visible. Never. For example, every creature on earth is said to have evolved from a common ancestor. Thus there must, be thousands and thousands of common ancestors that link each creature to the next. For example, lions and tigers must have a common ancestor....man and ape must have a common ancestor...squirrels and skunks must have a common ancestor...bats and whales must have a common ancestor. Of course none of these common ancestors have been found -- or will ever be found -- but we're just supposed to take their word for it because they know more than us. But the reality is, this is not science -- this is nothing but brain-rotting blind faith in a morally bankrupt theory.\n \n But the fairytale doesn't stop there. Evolutionists have made a living the past 75 years on the Big Joke that is the unseen beneficial random mutation. I honestly believe this is the most ridiculous aspect of the whole theory. The notion that a once-in-a-multi-million chance mutation can be beneficial and spread throughout a population via sexual reproduction is truly outrageous -- especially when you consider that populations are often separated by hundreds or thousands of miles and mutations are 99% destructive and/or deadly. Not only that, but a grand total of only 4,000 hominid bones have been dug up...(this includes humans, australopithecus, Neanderthals, Homo erectus, etc) Thus, there simply is not enough of a population for the likely occurrence of beneficial random mutations. Of course cumulative selection of thousands of such mutations has never -- and will never -- be witnessed.\n \n And the fairytale continues. THE most crucial aspect to the whole evolutionary farce is natural selection. This, as well, has never been documented, studied or witnessed. As far as I know there have never been controlled experiments on animals in an attempt to prove this concept. Once again, we are supposed to fall in love with the theory -- not any actual evidence.\n \n So there's the backbone to evolutionary theory -- and there is no real science to it -- it's all nothing but a wild fairytale....a fairytale dreamed up by a select few who have no intention of actually studying the material world -- as real science requires. Instead, their only intention is to give atheists around the world a vessel to latch on to so they can justify their own existence without having to acknowledge the truth of the Almighty Creator.", 
   {}, 
   238203, 
   null, 
   1162793520.0
  ], 
  [
   238291, 
   null, 
   "electrolyte", 
   "Evolutionists have made a living the past 75 years on the Big Joke that is the unseen beneficial random mutation. I honestly believe this is the most ridiculous aspect of the whole theory.\n\n Rather than spend any significant amount of time responding to your baloney, I'll just remind the readers that you've been shown plenty of examples of beneficial mutations, especially on IIDB. So it turns out that this \"most ridiculous aspect of the whole theory,\" as you call it, isn't the slightest bit ridiculous. Gee, what does that say about your doubts of admittedly-more-plausible occurrences?\n \n \nTHE most crucial aspect to the whole evolutionary farce is natural selection. This, as well, has never been documented, studied or witnessed.\n\n This, simply put, is a lie. The book that started the evolution revolution was full of precisely what supersport says doesn't exist.\n \n It must be hard to pull off such blatantly willful ignorance of the facts. You truly have a gift, supersport.", 
   {}, 
   238274, 
   null, 
   1162798260.0
  ], 
  [
   238349, 
   null, 
   "supersport", 
   "Rather than spend any significant amount of time responding to your baloney, I'll just remind the readers that you've been shown plenty of examples of beneficial mutations, especially on IIDB. So it turns out that this \"most ridiculous aspect of the whole theory,\" as you call it, isn't the slightest bit ridiculous. Gee, what does that say about your doubts of admittedly-more-plausible occurrences?\n \n No I haven't. your theory requires the existence of thousands/mabye millions of beneficial random mutations that can contribute to cumulative selection. Now put your money where your mouth is and tell me ONE.\n \n Originally Posted by supersport \n THE most crucial aspect to the whole evolutionary farce is natural selection. This, as well, has never been documented, studied or witnessed.\n \n \n This, simply put, is a lie. \n \n Please give me a link that shows how natural selection was proven in animals via controlled experiments.\n \n \"Without natural selection there is no evolution.\" Richard Dawkins", 
   {}, 
   238291, 
   null, 
   1162841160.0
  ], 
  [
   238428, 
   null, 
   "Hi_Its_Me", 
   "First, welcome back, supersport. Are you going to go into hiding and write a new thread again after we refute your post five times?\n \nNothing is more humorous than when an evolutionist pokes fun at creationists or IDists for not putting forth a scientific theory to explain life. \n\n Only if they are a comedian, too. Dave Barry would probably do well.\n \nFirst of all, life is not scientific -- life is spirtual. \n\n Really? So we cannot observe life, test reactions of living things, or declare somebody to be alive/dead?\n \n Or are you just saying, \"Science, back off religion's territory\"?\n \n If that is it, consider this quote from johnhanks:\"It has more to do I think with staking out a territory whose integrity they see as fundamental to their worldview, and declaring that science has no business trampling on it. Unfortunately for them, the territory they've chosen is very much science's business.\"\nContrary to what evolutionists say, what makes us human is not the shape of our jaw bone or the size of our heads. Life is something that controls and manipulates the matter it occupies. \n\n I would ask for evidence, except that I know you are simply stating your interpretation of the universe. Note that it is not necessarily true.\n \nThus, those who claim to be able to describe life scientifically are kidding themselves because life is more than material -- it's metaphysical, which by defintion is in conflict with science. Science is the study of the material world.\n\n And it can and has studied life before. We have come up with cures for many diseases, including the ever-mutating flu. This is done using the ToE.\n \nSo when evolutionists scoff at Creationists for not putting forth a scientific theory for life, I believe they are asking us to play a game, which includes defining life according to a flawed premise. \n\n Science? If you think that science is flawed, why don't you argue that the earth is flat and that the sun orbits it?\n You have shown that you believe that those are based on a flawed premise.\n \nBut what's truly laughable about all this is that the \"science\" evolutionists put forth is not science at all. Like I said, \"science\" is (or should be) the study of the material world. But what the world's evolutionists have forced down our kids' throats is not science. Instead it's long list of \"what ifs,\" \"probablys,\" \"maybes,\" and \"more-than-likelys.\" What they're attempting to sell the unsuspecting public is not to be found in nature -- it's found in their books. \n\n And the evidence for the books that they are selling is found in nature.\n \nAnd their so-called evidence is NEVER visible. Never. \n\n This one will be fun:\n http://earth.unh.edu/esci402/docs/embryology.jpg\n http://www.gutenberg.org/files/16136/16136-h/images/g09.jpg\n http://www.pbs.org/wgbh/evolution/library/01/1/l_011_01.html\n http://anthro.palomar.edu/evolve/evolve_3.htm\n http://www.gate.net/~rwms/EvoMutations.html#mutations\n http://www.talkorigins.org/faqs/evolution-research.html\n \n All from the first page of Google (and the image search).\n \nFor example, every creature on earth is said to have evolved from a common ancestor. Thus there must, be thousands and thousands of common ancestors that link each creature to the next. For example, lions and tigers must have a common ancestor....man and ape must have a common ancestor...squirrels and skunks must have a common ancestor...bats and whales must have a common ancestor. Of course none of these common ancestors have been found -- or will ever be found -- but we're just supposed to take their word for it because they know more than us. \n\n Really? Did you do research, or are you using you standard procedure: \"assertion = true\"?\n \nBut the reality is, this is not science -- this is nothing but brain-rotting blind faith in a morally bankrupt theory.\n\n The Theory is based on evidence, such as the fossil record and DNA. Any \"faith\" is in those facts, rather than the conclusions. The conclusions logically follow from the facts.\n Finally, saying \"morally bankrupt\" does nothing. It does not remove the evidence, and it is otherwise unconvincing.\n \nBut the fairytale doesn't stop there. Evolutionists have made a living the past 75 years on the Big Joke that is the unseen beneficial random mutation. \n\n You will be seeing this site a bunch; I can tell. This will be true especially if you keep posting that (false) assertion.\n \nI honestly believe this is the most ridiculous aspect of the whole theory. The notion that a once-in-a-multi-million chance mutation can be beneficial and spread throughout a population via sexual reproduction is truly outrageous -- \n\n You yourself posted evidence that mutation rates increase under pressure, so the chance does not have to be 1/1,000,000 or something.\n Try this: think of your previous posts and do not post information that is refuted by those posts.emoticon_xgood\n \nespecially when you consider that populations are often separated by hundreds or thousands of miles and mutations are 99% destructive and/or deadly. \n\n You have stated that talk.origins claims that. To the best of my knowledge, you have not posted where that claim is made.\n Whether or not it is true, it is irrelevant, but I won't get into detail until you cite your source. That might mean never, considering what you post...\n \nNot only that, but a grand total of only 4,000 hominid bones have been dug up...(this includes humans, australopithecus, Neanderthals, Homo erectus, etc) Thus, there simply is not enough of a population for the likely occurrence of beneficial random mutations. \n\n You may not realize this, but fossils are rare. Scarcity of fossils does not mean that a population was small.\n \nOf course cumulative selection of thousands of such mutations has never -- and will never -- be witnessed.\n\n I hope you realize how wrong you are. Oh, wait- I should know you well enough by now to realize that the answer is no.\n http://justbetweenstrangers.blogspot.com/2005/07/natural-selection-in-action.html\n \nAnd the fairytale continues. \n\n Creationism? Unfortunately, yes.\n \nTHE most crucial aspect to the whole evolutionary farce is natural selection. This, as well, has never been documented, studied or witnessed. \n\n Another one you will be seeing a bunch until you notice the evidence:\n http://justbetweenstrangers.blogspot.com/2005/07/natural-selection-in-action.html\n \nAs far as I know there have never been controlled experiments on animals in an attempt to prove this concept. \n\n As far as I know, there have. As one example, take breeding.\n \nOnce again, we are supposed to fall in love with the theory -- not any actual evidence.\n\n Interesting terminology. No matter how you interpret that, it is wrong. There is plenty of evidence, and \"love\" is not an issue.\n \nSo there's the backbone to evolutionary theory -- and there is no real science to it -- it's all nothing but a wild fairytale....a fairytale dreamed up by a select few who have no intention of actually studying the material world -- as real science requires. \n\n The material world has been studied, and it supports the ToE. Stop ignoring the evidence; it does not go away. Why don't you realize that?\n \nInstead, their only intention is to give atheists around the world a vessel to latch on to so they can justify their own existence[...]\n\n I don't think I have to justify my own existence unless that is required for me to continue to exist.\n As for my worldview, I think it is quite fine. Besides the ToE, there are numerous arguments refuting the fundamentalist position. If you want to get into that, make your next thread cover it. That will at least be relevant.\n \n[...]without having to acknowledge the truth of the Almighty Creator.\n\n Truth?\n Out of curiosity, which Creator are you talking about? The one described by the Gospel? The one described by your gospel?\n Also, why should I believe one and not another?\n \nNo I haven't. your theory requires the existence of thousands/mabye millions of beneficial random mutations that can contribute to cumulative selection. Now put your money where your mouth is and tell me ONE.\n\n Here are ten. Will that work or do you want exactly one? I may have trouble finding a website which lists that few.:)\n \nOriginally Posted by supersport \n THE most crucial aspect to the whole evolutionary farce is natural selection. This, as well, has never been documented, studied or witnessed.\n \n \n This, simply put, is a lie. \n \n Please give me a link that shows how natural selection was proven in animals via controlled experiments.\n\n If you want the words \"controlled experiment\" on the page, that will not stop the evidence. Of course, there is also breeding.\n \n\"Without natural selection there is no evolution.\" Richard Dawkins\n\n Actually false. Even though natural selection makes sense, falsifying it would not remove the fossil record and the obvious evidence that life evolves.\n \n By the way, I remember that you endorsed natural selection. From here:\n \nThe REAL survival of the fittest happens between different populations of animals. This is where the competition really occurs. This is why natural selection -- the ability to go on to breed -- on the level of the population is actually non-random.\n [...]\n This is despite the fact that there are real variations between species that make a real difference in fitness. \n [...]\n Here's an example of how NS is nonrandom on the populational level: When i was a kid back in the 70s we used to have lots of big red ants around our house. They made these big, huge mounds, and these big red ants ruled our neighborhood and city. However, back in the 80s we were invaded by fire ants -- which are smaller, yet more agressive ants. Nowdays, there are no more big red ants. Instead, all we have are fire ants. Where are the big red ants? I don't know -- I never see them anymore. The fire ants obviously ran them off or killed them. This is a perfect example of real life nonrandom natural selection in action.\n\n Even though you made a number of mistakes, you got the basics right and provided a good example.\n \n Again, think of your previous posts before posting.", 
   {}, 
   238349, 
   null, 
   1162860000.0
  ], 
  [
   238481, 
   null, 
   "supersport", 
   " First, welcome back, supersport. Are you going to go into hiding and write a new thread again after we refute your post five times?\n \n Thank you..it's always nice to receive a warm welcome. :)\n \n \n \n Really? So we cannot observe life, test reactions of living things, or declare somebody to be alive/dead?\n \n No....what I'm saying is you cannot measure life....to which you cannot refute.\n \n \n \n I would ask for evidence, except that I know you are simply stating your interpretation of the universe. Note that it is not necessarily true.\n \n In otherwords..you have no answer.\n \n And it can and has studied life before. We have come up with cures for many diseases, including the ever-mutating flu. This is done using the ToE.\n \n Name me ONE degenerative disease that has been cured -- EVER. Just ONE.\n \n So when evolutionists scoff at Creationists for not putting forth a scientific theory for life, I believe they are asking us to play a game, which includes defining life according to a flawed premise\n \n Science? If you think that science is flawed, why don't you argue that the earth is flat and that the sun orbits it?\n You have shown that you believe that those are based on a flawed premise.\n \n You call that a comeback? Your theory is just that -- a theory. You've got nothing.\n \n But what's truly laughable about all this is that the \"science\" evolutionists put forth is not science at all. Like I said, \"science\" is (or should be) the study of the material world. But what the world's evolutionists have forced down our kids' throats is not science. Instead it's long list of \"what ifs,\" \"probablys,\" \"maybes,\" and \"more-than-likelys.\" What they're attempting to sell the unsuspecting public is not to be found in nature -- it's found in their books. \n \n And the evidence for the books that they are selling is found in nature.\n \n yea...I know -- the evidence is always somewhere else...somewhere we can't see it. You've got nothing.\n \n This one will be fun:\n http://earth.unh.edu/esci402/docs/embryology.jpg\n http://www.gutenberg.org/files/16136/16136-h/images/g09.jpg\n http://www.pbs.org/wgbh/evolution/library/01/1/l_011_01.html\n http://anthro.palomar.edu/evolve/evolve_3.htm\n http://www.gate.net/~rwms/EvoMutations.html#mutations\n http://www.talkorigins.org/faqs/evolution-research.html\n \n I don't have time to go through these now..I'll come back to them.\n \n \n \n The Theory is based on evidence, such as the fossil record and DNA. Any \"faith\" is in those facts, rather than the conclusions. The conclusions logically follow from the facts.\n \n It's based on no evidence...the only evidence that DNA a provides you is a big, fat nothing. DNA is way too complex to have ever formed by chance. You've got nothing again.\n \n \n You will be seeing this site a bunch; I can tell. This will be true especially if you keep posting that (false) assertion.\n \n Too bad none of these (even if they are true) are not what I asked for. I asked for mutations that have proven to lead to cumulative selection. Due to epistasis, ALL mutations are deleterious, regardless of any benefit...this is because all mutations negatively effect surrounding nucleotides -- which negatively influences the \"fitness\" of the organism. I ask again -- show me any mutation that has proven to lead to a successful cumulative selection.\n \n \n \n You yourself posted evidence that mutation rates increase under pressure, so the chance does not have to be 1/1,000,000 or something.\n Try this: think of your previous posts and do not post information that is refuted by those posts.emoticon_xgood\n \n You don't know what it is.....it's like I've been saying -- you are spouting nothing but conjecture and made-up, fairytale science.\n \n \n You may not realize this, but fossils are rare. Scarcity of fossils does not mean that a population was small.\n \n lol! What else are you going to say? Once again -- your \"evidence\" is somewhere else --anywhere we can't see it. You lose on this one.\n \n I hope you realize how wrong you are. Oh, wait- I should know you well enough by now to realize that the answer is no.\n http://justbetweenstrangers.blogspot.com/2005/07/natural-selection-in-action.html\n \n too bad for you that is an example of species selection, you goofball -- you've just proven my point...that selection on the level of the species in non-random....to which evolutionists deny species selection even exists! lol -- you just stuck your foot into your mouth.......... For you to prove selection, you would have to prove it on the level of the organism -- that one organism within a population varies genetically enough to go on to breed while another does not. Nice try...you've got nothing.\n .\n \n Another one you will be seeing a bunch until you notice the evidence:\n http://justbetweenstrangers.blogspot.com/2005/07/natural-selection-in-action.html\n \n species selection.\n \n \n \n The material world has been studied, and it supports the ToE. Stop ignoring the evidence; it does not go away. Why don't you realize that?\n \n You have presented no evidence....you really should stop patting yourself on the back so much -- your \"refutes\" are quite weak.", 
   {}, 
   238428, 
   null, 
   1162882140.0
  ], 
  [
   238521, 
   null, 
   "Hi_Its_Me", 
   " First, welcome back, supersport. Are you going to go into hiding and write a new thread again after we refute your post five times?\n \n Thank you..it's always nice to receive a warm welcome. :)\n \n Warm?\n \nReally? So we cannot observe life, test reactions of living things, or declare somebody to be alive/dead?\n \n No....what I'm saying is you cannot measure life....to which you cannot refute.\n \n Define \"measure,\" and I will either refute it or show that it is irrelevant.\n \nI would ask for evidence, except that I know you are simply stating your interpretation of the universe. Note that it is not necessarily true.\n \n In otherwords..you have no answer.\n \n In that case, I will ask for evidence.\n You said,\"Contrary to what evolutionists say, what makes us human is not the shape of our jaw bone or the size of our heads. Life is something that controls and manipulates the matter it occupies.\"Can you back that statement up?\n \nAnd it can and has studied life before. We have come up with cures for many diseases, including the ever-mutating flu. This is done using the ToE.\n \n Name me ONE degenerative disease that has been cured -- EVER. Just ONE.\n \n Polio.\n \nSo when evolutionists scoff at Creationists for not putting forth a scientific theory for life, I believe they are asking us to play a game, which includes defining life according to a flawed premise\n \n Science? If you think that science is flawed, why don't you argue that the earth is flat and that the sun orbits it?\n You have shown that you believe that those are based on a flawed premise.\n \n You call that a comeback? Your theory is just that -- a theory. \n \n A scientific theory, that is. Ok, so I don't believe it is any better supported than the theory that bacteria and viruses cause disease...\n \nYou've got nothing.\n \n How many times have we heard that one?\n Actually, how many times have we refuted that one?\n \nBut what's truly laughable about all this is that the \"science\" evolutionists put forth is not science at all. Like I said, \"science\" is (or should be) the study of the material world. But what the world's evolutionists have forced down our kids' throats is not science. Instead it's long list of \"what ifs,\" \"probablys,\" \"maybes,\" and \"more-than-likelys.\" What they're attempting to sell the unsuspecting public is not to be found in nature -- it's found in their books. \n \n And the evidence for the books that they are selling is found in nature.\n \n yea...I know -- the evidence is always somewhere else...somewhere we can't see it. \n \n http://earth.unh.edu/esci402/docs/embryology.jpg\n Can you see that?\n \nYou've got nothing.\n \n 2 times...\n \nThis one will be fun:\n http://earth.unh.edu/esci402/docs/embryology.jpg\n http://www.gutenberg.org/files/16136/16136-h/images/g09.jpg\n http://www.pbs.org/wgbh/evolution/library/01/1/l_011_01.html\n http://anthro.palomar.edu/evolve/evolve_3.htm\n http://www.gate.net/~rwms/EvoMutations.html#mutations\n http://www.talkorigins.org/faqs/evolution-research.html\n \n I don't have time to go through these now..I'll come back to them.\n \n I will hold you to that. Also note that \"you've got nothing\" just went down the drain.\n \nThe Theory is based on evidence, such as the fossil record and DNA. Any \"faith\" is in those facts, rather than the conclusions. The conclusions logically follow from the facts.\n \n It's based on no evidence...the only evidence that DNA a provides you is a big, fat nothing. DNA is way too complex to have ever formed by chance. You've got nothing again.\n \n And how many times do I have to show you that you are wrong before you notice? ~Infinity?\n \nYou will be seeing this site a bunch; I can tell. This will be true especially if you keep posting that (false) assertion.\n \n Too bad none of these (even if they are true) are not what I asked for. I asked for mutations that have proven to lead to cumulative selection. Due to epistasis, ALL mutations are deleterious, regardless of any benefit...\n \n First: so they are all what you asked for? (\"...none of these are not...\")\n \n Second:\n Definition of epistasis: \"An interaction between nonallelic genes, especially an interaction in which one gene suppresses the expression of another.\"\n How does that indicate that mutations are deleterious (assuming that means that they remove neucleotides)?\n \n Actually, considering the various types of mutations, isn't it odd that the most common type of mutation is a point mutation, not a deletion? Also note that additions are about as common as deletions, and that that catagory is only one out of the ten types of mutation.\n \nthis is because all mutations negatively effect surrounding nucleotides -- which negatively influences the \"fitness\" of the organism. I ask again -- show me any mutation that has proven to lead to a successful cumulative selection.\n \n I don't have enough time now; I will find it later.\n \nYou yourself posted evidence that mutation rates increase under pressure, so the chance does not have to be 1/1,000,000 or something.\n Try this: think of your previous posts and do not post information that is refuted by those posts.emoticon_xgood\n \n You don't know what it is.....it's like I've been saying -- you are spouting nothing but conjecture and made-up, fairytale science.\n \n You are spouting nothing but conjecture and made-up assertions.\n And, no, I won't play guessing games about what \"it\" is. Explain that yourself.\n \nYou may not realize this, but fossils are rare. Scarcity of fossils does not mean that a population was small.\n \n lol! What else are you going to say? Once again -- your \"evidence\" is somewhere else --anywhere we can't see it. You lose on this one.\n \n All I did was show that a low number of fossils are to be expected. Even if your statistics are right (remember, 35% of statistics are made up), it does not indicate a small population in the past.\n Also note that beneficial mutations could happen in a small population and spread throughout it.\n \nI hope you realize how wrong you are. Oh, wait- I should know you well enough by now to realize that the answer is no.\n http://justbetweenstrangers.blogspot.com/2005/07/natural-selection-in-action.html\n \n too bad for you that is an example of species selection, you goofball -- you've just proven my point...that selection on the level of the species in non-random....to which evolutionists deny species selection even exists! lol -- you just stuck your foot into your mouth.......... For you to prove selection, you would have to prove it on the level of the organism -- that one organism within a population varies genetically enough to go on to breed while another does not. \n \n I am impressed that supersport is able to misinterpret the page that much. Here's the relevant text:\"Pressure on Asian elephant populations from poachers looking for ivory is starting to affect the species in a striking way: once-rare tuskless elephants are becoming more prevalent in China. If most of the tusked ones get killed, the ones that are left, however unusual or poorly adapted, will be the ones that survive.\"This is clearly natural selection within a species, considering that the tuskless elephants can breed with elephants with tusks. Not the highlighted words. Also, supersport appears not to notice that some organisms in the population varied genetically (they had no tusks), and that this obviously made a difference in their ability to breed.\n \n I am also surprised that supersport believes that \"evolutionists deny species selection even exists.\" Group selection has been documented, and selection between species has been observed.\n \nNice try...you've got nothing.\n\n 3 times...\n \nAnother one you will be seeing a bunch until you notice the evidence:\n http://justbetweenstrangers.blogspot.com/2005/07/natural-selection-in-action.html\n \n species selection.\n\n Selection within a species, to be precise. Anyway, why do you keep saying that biologists deny selection between groups?\n Actually, ignore that. I don't mind you posting evidence against yourself.\n \nThe material world has been studied, and it supports the ToE. Stop ignoring the evidence; it does not go away. Why don't you realize that?\n \n You have presented no evidence....you really should stop patting yourself on the back so much -- your \"refutes\" are quite weak.\n\n http://earth.unh.edu/esci402/docs/embryology.jpg\n http://www.gutenberg.org/files/16136/16136-h/images/g09.jpg\n http://www.pbs.org/wgbh/evolution/library/01/1/l_011_01.html\n http://anthro.palomar.edu/evolve/evolve_3.htm\n http://www.gate.net/~rwms/EvoMutations.html#mutations\n http://www.talkorigins.org/faqs/evolution-research.html\n No evidence?\n Oh, wait: you mean that you just haven't noticed the evidence?", 
   {}, 
   238481, 
   null, 
   1162922400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Elitists, Pagans, Goofballs and Wingnuts", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9064-elitists-pagans-goofballs-wingnuts.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9064, 
  "discussion_files": [
   [
    "26831.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9064-elitists-pagans-goofballs-wingnuts-print.html"
   ], 
   [
    "26832.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9064-elitists-pagans-goofballs-wingnuts-3-print.html"
   ], 
   [
    "26833.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9064-elitists-pagans-goofballs-wingnuts-2-print.html"
   ]
  ], 
  "identifier": 9064
 }
]