[
 [
  [
   236645, 
   null, 
   "simone", 
   "http://www.nytimes.com/2006/10/26/opinion/26thu4.html\n \n October 26, 2006\n Editorial Observer\n The Supreme Court's Crusade: Fairness for the Powerful \n By ADAM COHEN\n When Jesse Williams died of lung cancer, his widow sued Philip Morris, claiming it misled him about the danger of smoking. A jury agreed, awarding her $79.5 million in punitive damages. The Oregon Supreme Court affirmed the award, calling Philip Morris's decades of deception \"extraordinarily reprehensible.\"\n \n The United States Supreme Court is hearing arguments in the case next week, and the broader business community has joined Philip Morris in asking the court to sharply reduce the damages. They are relying on a controversial line of recent cases in which the court struck down punitive damages awards that it deemed \"excessive.\"\n \n The Philip Morris case will tell us a lot about the John Roberts court, which may be the most pro-business court in decades. It is a test of whether the court will abandon its conservative principles to be activist and \"rights-making\" when the party that needs help is a large corporation. It will also reveal whether the court will continue on its current disturbing path of giving corporations more protection from excessive punishment than it gives to people.\n \n The court began its punitive damages crusade in 1996, in the case of a man who sued BMW for failing to tell him that the new car he bought had been damaged and repainted. The man won $4,000 in compensatory damages and $2 million in punitive damages. The Supreme Court set aside the punitive damages award as so \"grossly excessive\" that it violated due process, but the court declined to lay out any clear standards for when an award was too high.\n \n In 2003, in a fraud case against State Farm Insurance by a policyholder, the court struck down $145 million in punitive damages. It held that the award was excessive since compensatory damages were only $1 million. That 145-to-1 ratio was unacceptable. Due process generally required, the court held, a \"single-digit ratio\" between punitive and compensatory damages.\n \n These rulings are remarkably \"activist\" by all the traditional measures. They take a vaguely worded constitutional guarantee - that no one shall be deprived of property without \"due process of law\" - and translate it into a right that is not at all apparent from the words' plain meaning. They attempt to turn the guarantee into a precise mathematical formula. And they substitute the judges' worldview for that of elected officials. If Oregonians believe punitive damages are too high, their legislature can impose a legal cap.\n \n These activist decisions, which give corporations valuable constitutional privileges, relied on the votes of conservative justices, who are supposedly skeptical of \"judge-made\" rights. Justices Sandra Day O'Connor and Anthony Kennedy provided key votes for BMW. Justice Kennedy wrote the State Farm \"single-digit ratio\" opinion, and Justice O'Connor and former Chief Justice William Rehnquist joined it. \n \n The contrast with the court's decisions on punishment of human wrongdoers is stark. In 2003, the court considered the sad case of Leandro Andrade, a father of three who was given a minimum of 50 years in prison under California's tough \"three strikes\" sentencing law, for shoplifting $153.53 worth of videotapes from Kmart. He argued that his prison term violated the Eighth Amendment. The Supreme Court - in a majority joined by Justices O'Connor and Kennedy and Chief Justice Rehnquist - could find nothing excessive in the punishment. \n \n Based on the Constitution's words, Mr. Andrade certainly had a stronger case than BMW or State Farm. The Eighth Amendment expressly bars \"cruel and unusual punishments,\" which might reasonably be interpreted to cover imprisoning a man from age 37 to 87 for stealing $153.53. The companies claimed only that the punitive damages awards violated their \"due process\" rights, a far greater textual stretch.\n \n On the issue of what is \"excessive\" punishment, Mr. Andrade's claim is also stronger. It is hard to see how it is excessive to make Philip Morris, whose market capitalization is $166 billion, pay a mere $79.5 million for \"extraordinarily reprehensive\" and lethal conduct, but not excessive to make Mr. Andrade spend what is likely to be the entire second half of his life in prison for a petty theft.\n \n The question of whether there should be constitutional limits on punitive damages has proved difficult to resolve, and it has caused divisions in both the court's liberal and conservative blocs. (It is one of the very few issues in which John Paul Stevens votes with corporations and Antonin Scalia votes against them.) Whatever the court decides, it should develop a constitutional theory of excessive punishment that covers human and corporate wrongdoers equally, as the Duke Law School Professor Erwin Chemerinsky and others have urged. \n \n The current doctrines make no sense, least of all by the standards of conservative constitutional interpretation. Conservatives like to talk about the \"framers' intent.\" The framers were deeply concerned about excessive punishment, and set forth their views on it in the Eighth Amendment. They would be perplexed that the high court they created believes their Constitution permits a father to remain in jail for 50 years for petty theft, but does not tolerate taking a fraction of the wealth from a company that kills people.", 
   {
    "post_info": {
     "post_title": "The Troubling Morality of the  Rightwing U.S. Supreme Court"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1161883380.0
  ], 
  [
   236689, 
   null, 
   "epaphras_faith", 
   "Once again Simone posts an article with her venom and does not provide any analysis. I thought I would try something similar. I have posted three articles on three of the cases cited in this article. After reading them you will note that they show clear misleading attempts on the part of Cohen. He may not exactly mistate the facts, but he leaves out a tremendous amount of the context.\n \n Further He claims the supreme court and in particular Justice Oconner to be \" conservative\" given the long history of Sandra O Conner in the court, we might consider otherwise. Looking at the facts in the cases one might not consider the court so activist but rather a reaction to otherwise activist courts where damages are so far beyond reason that they cost the average citizen far more in insurance costs (who can say that the cost of insurance has not gone up ridiculously). It is due to these incredibly high damages imposed that costs have soared for the average citizen.\n \n What was the effect of imposing ridiculously high damages on the Tobacco companies. NOt that they did not deserve to be hit where it hurts, but it did not hurt them. Anybody know the NEW cost of cigarettes lately? Guess what folks. You cost business and insurance more money it gets passed on to us the consumer. So with that, please read the below articles.\n \n EF\n \n Lets look at these individually. The explanations below are lengthy but they counter the conclusions brought by the liberal rag commentator education law attorney Adam Cohen.\n \n \nPunitive Damages After BMW of North America, Inc. v. Gore\n \n \n By Evan M. Tager of Mayer, Brown, Rowe & Maw LLP \n \n [Evan M. Tager is a partner in the Washington, D.C. office of Mayer, Brown & Platt. He regularly represents businesses, including insurers, involved in punitive damages litigation. Along with his partner, Andrew L. Frey, who argued the case, Mr. Tager represented BMW in BMW of North America, Inc. v. Gore.] \n \n Potentially one of the most significant cases in recent years for the insurance industry, BMW of North America, Inc. v. Gore,(1) had nothing to do with insurance. In BMW, the Supreme Court - for the first time ever - found that a punitive damages award was so excessive as to violate the Due Process Clause of the Fourteenth Amendment to the U.S. Constitution. In this article, I will briefly describe the background of the case, discuss the significant features of the Court's opinion, and provide some thoughts on what the case portends for punitive damages cases in the insurance context. \n \n The Case of The $2 Million Paint Job\n \n The case arose out of BMW's sale of a new BMW 535i to Dr. Ira Gore without disclosing that it had refinished some of the surfaces of the car at its vehicle preparation center before shipping the car to the dealer. In not disclosing the refinishing, BMW followed its standard disclosure policy, which provided that repairs costing less than 3% of the vehicle's suggested retail price would be considered insufficiently material to necessitate disclosure. BMW had selected the 3% threshold in 1983 after reviewing the various state disclosure statutes then in existence and concluding that a 3% trigger comported with the strictest of those statutes. \n \n Dr. Gore happily drove his car for nine months without noticing anything wrong with the finish. When he took the car to a detailer to make it look \"snazzier,\" however, the detailer detected signs of refinishing. After the detailer referred him to a lawyer, Dr. Gore filed suit in Alabama state court. Based on the testimony of Dr. Gore's \"expert\" (a disgruntled former BMW dealer) that even perfect, factory-quality refinishing diminishes the value of a car by 10% of its purchase price, the jury awarded Dr. Gore $4,000 in compensatory damages. And because Dr. Gore's counsel had identified approximately 1,000 other vehicles that BMW had sold throughout the country without disclosure of refinishing, he asked for, and the jury awarded, $4,000 per car in punitive damages, for a total of $4,000,000. \n ....\n The Supreme Court Decision\n \n The Supreme Court began its analysis by making clear that \"when [a punitive damages] award can fairly be characterized as 'grossly excessive' in relation to [the State's legitimate interests in retribution and deterrence] * * * it enter[s] the zone of arbitrariness that violates the Due Process Clause of the Fourteenth Amendment.\"(2) The Court next held that the State's legitimate interests end at its borders: \"[P]rinciples of state sovereignty and comity\" embodied in the Constitution dictate that \"Alabama does not have the power * * * to punish BMW for conduct that was lawful where it occurred and that had no impact on Alabama or its residents. Nor may Alabama impose sanctions on BMW in order to deter conduct that is lawful in other jurisdictions.\" (3) (Because Dr. Gore had introduced no evidence that BMW's 3% threshold was unlawful elsewhere in the country and because BMW had submitted evidence that its conduct, in fact, was lawful in many other states, the Court did not decide \"whether one State may properly attempt to change a tortfeasor's unlawful conduct in another State.\"(4)) \n \n Having concluded that the Alabama jury had no right to attempt to force BMW to change its policy nationwide, the Supreme Court turned to determining whether the $2 million award was excessive in relationship to Alabama's legitimate interests in regulating BMW's conduct in Alabama. The Court conceptualized the inquiry as involving a question of foreseeability, stating: \"Elementary notions of fairness enshrined in our constitutional jurisprudence dictate that a person receive fair notice not only of the conduct that will subject him to punishment but also of the severity of the penalty that a State may impose.\"(5) The Court then identified three \"guideposts\" as being particularly useful for evaluating whether a defendant could be said to have adequate notice of the magnitude of the jury-imposed penalties that might be assessed against it: (1) the degree of reprehensibility of the conduct; (2) the ratio of punitive damages to the actual or potential harm to the plaintiff; and (3) the civil penalties authorized or imposed for comparable misconduct.(6) Applying these three yardsticks, the Supreme Court concluded that the $2 million punishment did not pass constitutional muster.(7)\n \n ....\n \n Finally, one court - the Alabama Supreme Court - itself has been markedly inconsistent in its response to large punitive awards after BMW. In its first two cases involving multi-million dollar punitive awards, it dramatically reduced the punitive damages.(18) More recently, however, it ordered far less substantial remittiturs in two cases that had been vacated and remanded by the Supreme Court for further consideration in light of BMW.(19)\n \n Insurers have experienced mixed results in the post-BMW era. In at least four cases insurers have achieved substantial remittiturs. Two were first-party bad-faith cases arising out of the handling of uninsured/underinsured motorist claims. In one, a federal district court reduced a $600,000 punitive award against the insurer to $135,000, which was between three and four times the compensatory damages awarded for the plaintiff's tort claims.(20) In the other, the court cut a $5.5 million punitive award to $35,000.(21) The third case involved claims of fraud in the sale of mobile home owner's coverage. Finding minimal reprehensibility, the Alabama Supreme Court reduced a combined punitive award of $15 million to $348,000.(22) Finally, an Alabama trial judge reduced a $5 million punitive award that was 50,000 times the compensatory damages to $37,500 in a case involving an agent's allegedly fraudulent failure to disclose certain information when a policyholder surrendered his policy.(23)\n \n In other cases, insurers have fared less well. For example, one of the first post-BMW cases involved both alleged fraud in the marketing of a health insurance policy and alleged bad-faith denial of a claim on the basis of a pre-existing condition. Finding the fraud in particular to be reprehensible, the Idaho Supreme Court affirmed a remitted punitive award of $3.2 million, which was 26 times the compensatory damages and 5% of the insurer's annual profit.(24) A more recent California case involved a commercial surety held to have refused its obligation on a bond in bad faith. Despite finding that the insurer's conduct was \"an isolated incident,\" the California Court of Appeal upheld $15 million of the jury's $28 million punishment, presumably because the compensatory damages were large ($3.1 million).(25) In another bad faith case involving an insurer's rescission of a policy on an allegedly pretextual basis, the North Dakota Supreme Court upheld a $2.5 million punitive award, which was five times the compensatory damages, without giving any serious analysis of the BMW factors.(26)\n \n ....\n BMW was not about the constitutional limitations on the imposition of liability for punitive damages. Nevertheless, the Court stated without hesitation that \"[e]lementary notions of fairness enshrined in our constitutional jurisprudence dictate that a person receive fair notice not only of the conduct that will subject him to punishment but also of the severity of the penalty that a State may impose.\"(29) In other words, the Court premised its conclusion that notice is key to the excessiveness inquiry on what it regarded to be the settled proposition that punishment may not be imposed at all in the absence of fair notice that the conduct is punishable. \n \n ....\n Extraterritorial Punishment\n \n On the important subject of extraterritorial punishment i.e., the imposition of punitive damages by a jury in one state to punish for conduct occurring in other states BMW both made important progress and left open some complex questions. \n \n Let's start with the progress. Under BMW, it is now clear that a single jury in a single state may not seek to punish the full course of a defendant's conduct nationwide (or worldwide) absent proof that the conduct is universally wrongful. This limitation on extraterritorial punishment is a highly significant development. Many large punitive damages awards have been the result of invitations by the plaintiffs' lawyers to impose punishment for conduct occurring in other states. For example, in cases alleging fraud in the sale of insurance, plaintiffs routinely urge juries to remove the nationwide premiums or net revenues from the sale of the particular insurance product at issue.(31)\n \n Similarly, with increasing regularity, plaintiffs in bad-faith cases have adduced evidence of the insurer's conduct throughout the country and then asked the jury to punish the insurer enough to make it alter its practices everywhere. BMW equips insurers with strong arguments that these methods of jacking up the punitive award are not permissible (at least in the absence of a showing that the defendant's conduct would be unlawful throughout the country, an issue I will turn to momentarily). \n \n BMW was an easy case for application of the constitutional prohibition against extraterritorial punishment. After all, given the formula urged by Dr. Gore's counsel ($4,000 x 1,000 cars), it was undeniable that the jury had directly punished BMW for transactions having no connection to Alabama. Moreover, because many states had statutes permitting nondisclosure of repairs costing less than 3% of the suggested retail price, it also was clear that BMW's conduct was not universally unlawful. But most cases in which evidence of out-of-state conduct is admitted lack one or both of these characteristics. Such cases will be a key battleground in the years to come and could well give rise to the Supreme Court's next punitive damages case. \n \n I believe that there are strong arguments for extending BMW's limitation on extraterritorial punishment beyond the somewhat unique facts of that case. First, even when the verdict is not the product of a formula, it often should be possible to discern from the closing arguments and the amount of the punitive damages whether the jury has done more than simply consider extraterritorial conduct as an aggravating factor and instead directly punished that conduct. For example, in one insurance bad-faith case reported in this publication, the plaintiffs put on a massive amount of evidence of out-of-state conduct and referred to that evidence in arguing for a large punitive award. The jury responded by awarding an astounding $145 million (far more even than the high end of the range suggested by the plaintiffs' lawyer) although there was comparatively little evidence of misconduct in the forum state.(32) It is thus readily apparent from the nature of the evidence admitted, the summation, and the amount of the award that the jury was imposing punishment for out-of-state conduct. In these circumstances, the mere fact that the plaintiffs' counsel refrained from proposing a formula should not immunize the punitive award from scrutiny under the principles limiting extraterritorial punishment. \n \n Second, as to the question expressly reserved in BMW, I believe that there is a powerful argument that arrogating to a single jury in a single state the power to punish a defendant for its unlawful conduct in other states violates the constitution every bit as much as does allowing the jury to punish the defendant's lawful conduct in other states. To begin with, the forum state cannot apply its own punitive damages law to impose nationwide punishment simply because the plaintiff has shown that the conduct is tortious everywhere. Rather, at a bare minimum, the principles of comity and sovereignty underlying BMW strongly suggest the conclusion that, if nationwide punishment is to be exacted, the punitive damages laws of each state must be applied.(33) These laws vary dramatically and accordingly could dictate a far different overall punishment than would application of only the law of the forum state. For example, several states do not permit punitive damages at all in common-law cases.(34) Others limit punitive damages to the amount (if any) needed to ensure that the plaintiff has been made whole.(35) Still other states limit punitive damages to cases in which the conduct borders on the criminal.(36)\n \n The requirement that the law of 51 jurisdictions be applied in order for there to be a nationwide punishment should be fatal to most efforts to exact such punishment. I am not aware of any states that permit a jury to be instructed on the law of states having no connection to the underlying cause of action. Moreover, even if a state's courts had such authority, it is questionable whether it would be practical to instruct a jury on the punitive damages law of 51 different jurisdictions. And even if a state court were willing to take on this manageability problem, there remains a strong argument that allowing a single jury in a single case to impose nationwide punishment violates the comity and sovereignty principles announced in BMW. One federal appellate court already has so concluded.(37)\n \n The Reprehensibility Factor\n \n As indicated above, the Court's discussion of the reprehensibility factor serves a substantial didactic function. Unlike most courts to address this factor, the Court did not merely state the self-evident proposition that more reprehensible conduct warrants greater punishment than less reprehensible conduct. Rather, as one district court has termed it, the Court announced a \"hierarchy of reprehensibility.\"(38) For example, it drew a distinction between conduct causing \"purely economic harm\" and conduct involving personal injury or \"indifference to or reckless disregard for the health and safety of others.\"(39) Within the category of torts causing only economic harm, the Court indicated that conduct is more reprehensible if it is done \"intentionally through affirmative acts of misconduct\" and/or if it is aimed at a \"financially vulnerable\" victim.(40) The Court further announced that an omission of material facts is less serious than a \"deliberate false statement, particularly when there is a good-faith basis for believing that no duty to disclose exists.\"(41) Finally, the Court indicated that conduct is more reprehensible and might warrant a higher punishment if there is evidence that the defendant is a \"recidivist\" i.e., that the defendant \"repeatedly engaged in prohibited conduct while knowing or suspecting that it was unlawful.\"(42)\n \n ....\n \n Ratio\n \n The Court's discussion of ratios in BMW also holds promise for bringing some restraint to the punitive damages area. The Court endorsed the principle that punitive damages must bear a \"reasonable relationship\" to compensatory damages and specifically equated that requirement with the double, treble and quadruple damages remedies that prevailed under early English law and that remain a hallmark of federal remedial statues.(44) Although it eschewed a \"simple mathematical formula\" for all cases, the Court identified only a few circumstances as grounds for departure from low multiples: (1) when \"a particularly egregious act has resulted in only a small amount of economic damages,\" as in the case of a failed attempt; (2) when the \"injury is hard to detect,\" as when misconduct or its effects are subtle or concealed; and (3) when \"the monetary value of noneconomic harm might have been difficult to determine,\" prompting concern that the plaintiff will not be made whole.(45)\n \n I believe it fairly inferable from this discussion that the Court regards relatively low ratios as the benchmark and that substantial departures from that benchmark warrant closer consideration.(46) Indeed, numerous federal courts that have reviewed a large punitive award in the wake of BMW have interpreted the case in that way.(47) The Tenth Circuit has gone so far as to hold that \"in economic injury cases if the damages are significant and the injury not hard to detect, the ratio of the punitive damages to the harm generally cannot exceed a ten to one ratio.\"(48) That court has further emphasized that \"even a 10:1 ratio will be unconstitutionally excessive in a broad range of cases\" in which the degree of reprehensibility is not high.(49) The state courts, by contrast, have generally been willing to countenance higher ratios than their federal counterparts.(50)\n \n Because insurance cases often involve disproportionate ratios, I regard the Court's discussion of ratios and the subsequent actions of the federal courts to be an unambiguously favorable development for the insurance industry. Particularly when the insurer defendant has succeeded in fending off large non-economic damages, there should be excellent chances of obtaining a substantial reduction of a punitive award that is disproportionate to the plaintiff's loss.(51)\n \n Nor would I be particularly pessimistic in cases in which there has been a large award of non-economic damages. In addition to the possibility of securing a remittitur of that award,(52) there are good arguments that the fact that the ratio of punitive to compensatory damages is modest does not immunize a punitive award from constitutional review. As a New Jersey appellate court recently observed in holding an $8 million punishment to be grossly excessive, the obligation to pay substantial compensatory damages could itself satisfy the state's interest in deterrence.(53) Accordingly, when the compensatory damages are high and the degree of reprehensibility is low, even a 1:1 ratio could be unconstitutionally excessive. As one federal court of appeals recently explained, \"[t]he Supreme Court's opinion seems to ask for the least punishment that will change future behavior.\"(54) On the basis of that very rationale, a district court recently ordered a $150,000 punitive award that was slightly less than the compensatory damages reduced to $17,500.(55)\n \n Legislatively Established Penalties\n \n Finally, in recognizing the relevance of legislatively established civil and criminal penalties for comparable misconduct, the Court has provided an objective benchmark against which to measure punitive awards. It makes little sense that unelected juries, which entirely lack expertise in the setting of punishment, are given no clear framework for the punishment-setting exercise, and are not accountable for the consequences of their actions, should be permitted to impose punishments that are dozens or even hundreds of times the amounts determined to be appropriate by legislatures. As a result of the Court's recognition of this principle, defendants should now be entitled to an instruction that the jury may consider legislatively established and/or administratively imposed fines and civil penalties as a benchmark. In addition, where there is a gross disparity with statutory penalties, reviewing courts will be obliged to give weight to this factor in the excessiveness calculus. \n \n This factor should be especially helpful to insurers confronted with large punitive awards. Two courts have indicated that the most closely analogous fine for insurer misconduct is the penalty prescribed for violations of the state's unfair practices statute.(56) In most states, that amount is quite modest compared to the kinds of punitive damages awards that insurers often face. Indeed, the highest penalty of which I am aware is $25,000.(57)\n \n Corporate Financial Condition\n \n As a practical matter, the principal explanation for the frequently gigantic size of punitive verdicts returned against large corporations, including insurers, is the use of the defendant's financial data to set the punishment. The BMW opinion does not directly address the propriety of this practice. Nevertheless, given the fact that Dr. Gore sought to defend the punitive damages by reference to BMW's financial wherewithal,(58) the Court's failure to list BMW's finances as one of the \"guideposts\" is meaningful. It suggests, at a minimum, that the fact that a defendant is wealthy cannot save an otherwise excessive punishment. Several courts, including the Alabama Supreme Court in the BMW remand, already have reached just that conclusion.(59) Whether corporate net worth should have any continuing role at all remains an open question, but insurers should be heartened by the Court's refusal to allow BMW's size to immunize the exaction against it. \n \n ....\n Conclusion\n \n Although not involving an insurer, BMW has to be regarded as a highly beneficial development for an industry that has been besieged by eye-popping punitive damages awards. The overall message that the opinion conveys and the specific criteria it announced should be helpful to insurers in securing reductions of the grotesquely disproportionate jury-imposed punishments that have plagued them in the last decade. \n \n Copyright ) 1999 Mayer, Brown & Platt\n \n \n\n \n Now on to the state farm case.\n \n \nUtah Court Reduces $145 million Punitive Damage Awardin Campbell v. State Farm on Remand from United StatesSupreme Court, But Says It Retained Discretion toApprove Nine-to-One Ratio\n \n \n By Nixon Peabody LLP \n \n The Utah Supreme Court has reduced a $145 million punitive damage award to $9 million one year after the United States Supreme Court ruled that the award originally approved by the Utah court violated the Constitution's due process clause. The Utah court stated in Campbell v. State Farm Mutual Insurance Co., 2004 UT 34 (April 23, 2004), however, that it retained the discretion to approve a 9-to-1 punitive-to-compensatory damage award, the maximum allowable without a presumption of excessiveness under the U.S. Supreme Court's ruling. The U.S. Supreme Court had reversed the original $145 million punitive damage award against State Farm, stating that it violated due process because the defendant's conduct did not justify punitive damages that were 145 times greater than the compensatory damages of $1 million. \n \n The Campbell case stemmed from an automobile accident involving Mr. Campbell, which resulted in one death and another person's permanent disability. When Mr. Campbell was sued, he tendered the lawsuit to his insurer, State Farm. Although there was significant evidence that Mr. Campbell was responsible for the accident, and a high probability of an excess verdict, State Farm refused to settle the claim for its $50,000 policy limits. A jury subsequently returned a judgment of $185,849 against Campbell. State Farm refused to appeal the verdict, but ultimately did pay the entire amount of the judgment against Campbell. In subsequent bad faith litigation against State Farm, the Campbells argued that State Farm's refusal to settle was part of a nationwide effort to reduce claims payments. The jury awarded $2.6 million in compensatory damages for emotional distress and $145 million in punitive damages. The trial judge reduced the compensatory damages award to $1 million and the punitive damages award to $25 million. The Utah Supreme Court subsequently reinstated the $145 million punitive damages award, relying largely upon evidence concerning State Farm's business practices in numerous states over a twenty-year period, and State Farm's \"massive wealth.\" \n \n On appeal, the U.S. Supreme Court reversed the award on the ground that it was grossly excessive and violated due process. Although the Court refrained from imposing a \"bright line\" rule on the permissible amount of punitive damages, it cautioned in its decision that where the ratio between the punitive damages and the compensatory damages is in excess of nine to one, there is a \"presumption\" that the punitive damage award is excessive. The Court further stated that, based on prior decisions, punitive damage awards of more than four times more than the compensatory damages might be close to the line of constitutional impropriety. The Court remanded the case to the Utah Supreme Court to recalculate the punitive damage award under the principles articulated in its decision. The U.S. Supreme Court had said that the case \"would likely justify\" a punitive damage award of only $1 million, a one-to-one ratio. \n \n On remand, the Utah court stated that it took \"seriously\" the Supreme Court's directive to resolve the punitive damage issue under the High Court's principles. It also stated, however, that \"[b]y assigning us the duty to resolve the issue of punitive damages by fixing an award, the Supreme Court signaled its intention to vest in us some discretion to exercise our independent judgment to reach a reasonable and proportionate award.\" \"The Supreme Court declined . . . to fix a substitute award, choosing instead to entrust to our judgment the calculation of a punitive damage award, which both achieves the legitimate objectives of punitive damages and meets the demands of due process.\" Exercising its discretion, the Utah court found \"the blameworthiness of State Farm's behavior . . . to be several degrees more offensive than the Supreme Court's less than condemnatory view that State Farm's behavior 'merits no praise,' and was egregious enough to warrant an award nine times the amount of the compensatory damages.\" \n \n The Utah court noted that it was mindful of the Supreme Court's criticism of it for reinstating the $145 million award in part based on evidence of State Farm's \"nationwide policies rather than for the conduct directed toward the Campbell's\" in Utah only. The Supreme Court had made clear in State Farm that only conduct which took place within Utah's borders and was directed at the Campbells could be properly weighed in fixing a punitive damage award. The Utah court reasoned that its approval of a nine-to-one punitiveto- compensatory damage ratio was justified because of the unique \"gravity of harm\" an insurer may potentially inflict on its insured. Noting that insurance is purchased to ameliorate the anxiety caused by uncertainty and risk, misconduct such as that exhibited by State Farm \"is likely to cause injury more closely akin to physical assault or trauma than to mere economic loss.\" The court stated that State Farm needlessly subjected the Campbells to the \"risks and rigors of a trial\" which State Farm should have known the Campbells would lose, and when it became apparent that the Campbells would in fact lose, State Farm \"withdrew its expressions of assurance and told the Campbells to place a 'for sale' sign on their house.\" \"These acts,\" the court wrote, \"for which State Farm has not voiced so much as a whisper of apology or remorse, caused the Campbells profound noneconomic injury.\" \n \n The Utah Supreme Court's decision is a mixed bag. The court boldly stated its discretion to approve a maximum nine-to-one punitive-to-compensatory damage award ratio in contradiction of the U.S. Supreme Court's suggested one-to-one ratio, but did so only after reciting the unique facts of State Farm's particularly egregious conduct. While future courts may be emboldened by the decision to sustain punitive damage awards in amounts just under the Supreme Court's threshold of presumptive excessiveness, there is room to argue for lower awards on the ground that the facts of State Farm are unique and distinguishable. \n \n \n\n Lastly, lets consider the repeat offender. We need to remember that this man was not just sentenced for 150 dollars of video tapes. But also for his priors. The point of the laws was to eliminate repeat offendors or at least give the state a method for dealing with it.\n \n \n \nSENTENCING REPEAT OFFENDERS:\n \"Three Strikes\" Laws Lead to Injustice, But What Is the Best Alternative?\n By BARTON ARONSON \n ---- \n Thursday, Nov. 21, 2002\n \n Last month, the Supreme Court heard oral argument in the case of Lockyer v. Andrade, in which an offender has challenged California's notorious \"three strikes law\" as unconstitutional. The \"three strikes\" law is the nation's most severe sentencing statute. It is being challenged as imposing \"cruel and unusual punishment\" in violation of the Eighth Amendment. As always, the policy issues are more interesting than the legal arguments.\n \n The case arose when Leandro Andrade was sentenced to two consecutive twenty-five year terms of imprisonment, without possibility of parole for stealing $150 worth of videotapes from two stores. No wonder Andrade's case was chosen by opponents of the law to test its constitutionality. \n \n Andrade had prior convictions: three burglaries from the early 1980's. As a result, under California law, prosecutors had a choice whether to charge him with misdemeanors, which would have resulted in a one-year jail sentence, or felonies, \"petty thefts with a prior.\"\n \n Last week, however, brought a case that seemed to suggest that California's laws may not be too extreme after all. On Friday, a California judge imposed a similar sentence on Ronald Herrera, who had tried to make off with $11 worth of goods from a minimart. \n \n Andrade is no choirboy, but Herrera is positively devilish. In the early seventies, he broke into the home of a woman and raped her. Then he raped her fifteen-year-old daughter. Then he escaped from the Oxnard jail and made his way to Virginia. While there, he pulled off a string of armed minimart robberies; during one, he shot a police officer. After he was released from prison in Virginia, he was returned to California to serve the remainder of his time. He was released a few years before his current troubles.\n \n What do Andrade's and Herrera's cases say about how we should sentence our repeat offenders - especially when they commit relatively petty crimes? \n \n Sentencing: The Basics\n \n Gilbert and Sullivan's Mikado, a mythical Japanese jurist, stated the first principle of sentencing: \"to make the punishment fit the crime.\" In legalese, we call this proportionality. It is a concept that forms part of the jurisprudence of the Eighth Amendment. \n \n Murderers serve longer sentences than thieves, because murder is universally regarded as worse than stealing. And if thievery were generally punished as harshly as murder, a proportionality issue would arise. \n \n Column continues below &#8595; Ads by Google \n \n America's Secret Oil Find\n Learn How Colorado is Sitting on More Oil Than the Middle East\n www.DailyWealth.com/Oil_Report \n Commodities Trading\n Futures Trading on some the worlds Major Exchanges. Free Membership\n www.SaxoBank.com \n The Billionaires' Secret\n Investment Vehicle of the Wealthy Free Book Understanding Hedge Funds\n Hedge-Fund-Investing.com \n iPath ETNs from Barclays\n Index-linked notes providing the advantages of being exchange traded\n www.iPathETN.com \n Emini Direct Futures\n Trade Grains, Meats, Bonds, Softs Currencies, metals, indexes-$3/rate\n www.eminidirect.com \n \n \n \n \n But proportionality is only the first principle of sentencing. The second focuses on the criminal, not the crime. All things being equal, when someone is convicted of robbery, he will be punished more harshly if he has a history of prior crime. \n \n That, in itself, is not an issue, constitutional or otherwise: All courts recognize, and the Supreme Court has repeatedly ruled, that states and judges have greater flexibility in sentencing recidivists than they do in sentencing first time offenders.\n \n Indeterminate and Guideline Sentencing\n \n The first and most common is for the legislature to set a range - say, zero to ten years for robbery - and leave it up to the judge to decide where, within the range, a defendant will actually be sentenced. In making this decision, the judge will consider a host of factors, including the defendant's history of criminality.\n \n The federal government has, since the mid-1980s, done something different. There, judges are bound by the Federal Sentencing Guidelines, a complex set of rules that cabin the judge's discretion. The guidelines try to account with precision for the actual crime the defendant committed (called the offense level) and his criminal history. \n \n Under the Sentencing Guidelines, your offense level goes up if, for instance, you used a gun. Your criminal history 'score' goes up if you previously committed a crime and served time. As these levels and scores increase, so does your sentence, in tightly defined increments. \n \n Consider, for example, two convicts. One is a unarmed robber with no record. The other is a second-time armed robber. The former will have both a lower offense level and a lower criminal history score, and thus will receive a correspondingly lower sentence.\n \n Mandatory Minimums, Including The Three Strikes Law\n \n Grafted awkwardly onto both of these systems are so-called mandatory minimums, of which the California three strikes law is an example. Mandatory minimums require a judge to impose no less than a specific sentence, irrespective of what any other part of the criminal code says about a specific crime. They are the trump cards of the statutory system, which no other statute can beat. \n \n In the 1970s, most sentences were \"indeterminate\" - say, five to fifteen years - and the inmate's actual release date was determined by a parole board. But penological developments, along with public alarm over rising crime, especially the inner city crack wars of the mid-1980s, fostered more structured sentencing regimes. Besides, getting tough turns out to be easy: criminals are not exactly an influential constituency. \n \n The wave crested, unsurprisingly, in California. Passed as a ballot initiative in 1994, the three strikes law provides that anyone who has committed two prior \"serious\" or \"violent\" felonies, and then commits any third felony, will be sentenced to at least twenty-five years without possibility of parole. (Note that the third strike need not itself be serious or violent - leading to the Andrade and Herrera cases of long sentences triggered by minor third crimes.) \n \n Prosecutors have sometimes gotten around the law by simply refusing to offer evidence of the prior felonies, if such evidence would lead to a sentence they believed would be too harsh. Nevertheless, there is no question that California's prison population has grown as a direct result of the new law.\n \n Both Andrade and Herrera are, as a result of the three strikes law, subject to much longer sentences that the petty theft statutes provide. But they are not remotely comparable men: one is a small-time criminal with a couple of old burglaries; the other is a predator, with a history of violence, sexual assaults, and armed offenses, and seems incapable of living alongside the rest of us without breaking the law.\n \n What's needed here is a sense of proportion for both the criminal and the crime. Herrera has proven himself to be far more dangerous than Andrade. He has also, unlike Andrade, proven to be incorrigible. \n \n Herrera has forced us, again and again, to go through the time, trouble, and expense of telling him that he has to live by our rules, or face consequences. He apparently doesn't care. The price of his criminal history is a heightened obligation to lead a blameless life. Civilized society is a bargain; if you break it too many times, we have the right to say you've simply opted out.\n \n So how can Herrera and Andrade each be treated fairly? The answer may lie in expanding the sentencing range for even petty crimes. But sentencing at the higher end of the range should be tethered to the particulars of a defendant's criminal history, rather than being subject to a judge's free-floating discretion. The federal guidelines' incremental approach to the role of criminal history in sentencing should be the model. \n \n Here's how it would work: Suppose the sentencing range for petty theft went to, say, ten years. The court would not have the power to impose a sentence like that on a first or even a second-time offender. But the flip side is that the court would be required to sentence someone like Herrera at the top of the range. No court should have the power to give a man like Herrera a break.\n \n Such a system would properly account for Herrera's history of lawlessness by recognizing that as your criminal record grows, it should play a correspondingly larger role in your sentencing, even for petty crimes. Still, the differences between Herrera and Andrade are real, in a way the three strikes law ignores. An approach that is tied more closely to a defendant's actual criminal history, rather than one that - like California's - makes a vast leap from a few petty crimes to life in prison, would be more just than the current options.\n \n None of these approaches is perfect. The Federal Sentencing Guidelines themselves have come in for an enormous amount of criticism, some of it just. But it is easy to forget the shocking disparities in federal sentences that prompted the Guidelines - and indeed, the shocking disparities than we still tolerate every day in most state courthouses. Paying greater attention to making the punishment fit not just the crime, but the criminal, is a good place to start. \n \n \n", 
   {
    "unicode_changes_made": true
   }, 
   236645, 
   null, 
   1161904620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Troubling Morality of the  Rightwing U.S. Supreme Court", 
  "url": "http://www.4forums.com/political/politics-debates/9087-troubling-morality-rightwing-u-s-supreme-court.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9087, 
  "discussion_files": [
   [
    "5921.html", 
    "http://www.4forums.com/political/politics-debates/9087-troubling-morality-rightwing-u-s-supreme-court-print.html"
   ]
  ], 
  "identifier": 9087
 }
]