[
 [
  [
   236900, 
   null, 
   "obvious_child", 
   "You make thread after thread after thread of badly argued, fact-free claims aganist evolution and run away once you meet resistance. I believe you have stated that creationism is correct. Why it is you cannot defend your own beliefs? The literal flood thread is still there and not a single creationists has posted\n \n Are we to assume that you admit your belief in creationism is wrong?", 
   {
    "post_info": {
     "post_title": "supersport, why is it that you cannot defend your own beliefs?"
    }
   }, 
   null, 
   null, 
   1161996840.0
  ], 
  [
   236912, 
   null, 
   "Shooterandproud", 
   "You make thread after thread after thread of badly argued, fact-free claims aganist evolution and run away once you meet resistance. I believe you have stated that creationism is correct. Why it is you cannot defend your own beliefs? The literal flood thread is still there and not a single creationists has posted\n \n Are we to assume that you admit your belief in creationism is wrong?\n\n \n Agreed. Im still waiting to see some proof. The least he could've done is posted some creationist propoganda.", 
   {}, 
   236900, 
   null, 
   1161998820.0
  ], 
  [
   236926, 
   null, 
   "Hi_Its_Me", 
   "You make thread after thread after thread of badly argued, fact-free claims aganist evolution and run away once you meet resistance. I believe you have stated that creationism is correct. Why it is you cannot defend your own beliefs? The literal flood thread is still there and not a single creationists has posted\n \n Are we to assume that you admit your belief in creationism is wrong?\n\n I have pointed out that he is trying his best to find information that supports his hypothesis.\n \n Of course, his failure to find any would indicate that it isn't there...", 
   {}, 
   236900, 
   null, 
   1162007220.0
  ], 
  [
   236936, 
   null, 
   "supersport", 
   "You make thread after thread after thread of badly argued, fact-free claims aganist evolution and run away once you meet resistance. I believe you have stated that creationism is correct. Why it is you cannot defend your own beliefs? The literal flood thread is still there and not a single creationists has posted\n \n Are we to assume that you admit your belief in creationism is wrong?\n\n \n Since when have you seem me post a thread trying to prove creationism? I believe that it happened but I certainly cannot prove it. First of all, life itself is not scientifically provable. You have no idea what causes a person to be \"alive.\" Thus, to try to prove it scientifically is fruitless. Anyone who thinks they can is fooling themselves. Our existence is made possible by a spirtitual act....and I believe in mind over matter, not matter over mind. God's mind, just by his thoughts created all matter. You evolutionists are deluding yourselves if you think you'll ever know the origin of DNA or anything else. Scientists like to make people think that they have all the answers because they are able to observe things...ie genetics....but if anyone thought about it just for a second they would realize that there's a difference in observing or understanding something and actually creating it. There was an origin of this information from somewhere. unfortunately for you evoltuionists, natural selection and random mutations both are braindead and both have an IQ of zero -- same as the evolutionists who believe in them. Debate that, city slicker.", 
   {}, 
   236900, 
   null, 
   1162012260.0
  ], 
  [
   237024, 
   null, 
   "obvious_child", 
   "I believe that it happened but I certainly cannot prove it.\n\n \n At least you admit your belief has no merit. It's kind of sad how you blame others though. \n \n \nFirst of all, life itself is not scientifically provable\n\n \n ....okay. That's pretty insane. But sure. \n \n \nYou have no idea what causes a person to be \"alive.\"\n\n \n Energy, specifically chemical energy being transfered and used up by organic processes. \n \n \nThus, to try to prove it scientifically is fruitless.\n \n \n Read above. \n \n Anyone who thinks they can't is fooling themselves.\n \n \nbut if anyone thought about it just for a second they would realize that there's a difference in observing or understanding something and actually creating it.\n\n \n Observing is the step to understanding, which is the step of creation. Give it time. You seem to be under the insane logic that everything that can be known is known and everything that can be invented is invented. Guess who thinks like that: The French Government. \n \n \nThere was an origin of this information from somewhere. unfortunately for you evoltuionists, natural selection and random mutations both are braindead and both have an IQ of zero\n\n \n Again, back to my point about blaming. You do realize you have yet to refute anyone and you have cowardly fled virtually every thread you have made once you enounter resistance? Silence on a rebuttle is a admission of defeat, therefore given your omnious silence, you have admitted your claims are wrong.\n \n But explain this to me, if evolution is false, why should anyone believe creationism to be correct as you yourself have stated you cannot prove it?\n \n What makes your belief any more valid then a belief that the universe was sneezed into existance by the one who will bring the great hankerchief and wet noodle?", 
   {}, 
   236936, 
   null, 
   1162066980.0
  ], 
  [
   237084, 
   null, 
   "Hi_Its_Me", 
   "Since when have you seen me post a thread trying to prove creationism? \n\n Never. You have also never tried to disprove evolution: you post threads attempting to present a new ToE.\n \nI believe that it happened but I certainly cannot prove it. \n\n The question is: can you support it?\n \nFirst of all, life itself is not scientifically provable. You have no idea what causes a person to be \"alive.\" Thus, to try to prove it scientifically is fruitless. \n\n This is getting fun. Here we go:\n Saying that people can't prove (the existance of) life is correct. Of course, by that logic, we can't prove that the laws of physics exist even though we observe them all the time. The same applies to the existance of other stars, the theory that bacteria and viruses cause disease, and, of course, the existance of a god. Not only that, but you can't be sure that you are even on 4forums debating; you might be drugged or in a VR machine.\n \n If you consider that sort of logic to be relevant, go away now.\n \nAnyone who thinks they can is fooling themselves. Our existence is made possible by a spirtitual act....and I believe in mind over matter, not matter over mind.\n\n Getting back to the point that you make claims and don't support them...\n \nGod's mind, just by his thoughts created all matter.\n\n And, if he is perfect, and perfection cannot arise spontaneously, did he create himself with his own thoughts?\n \n Alternatively, did he come into existance at the beginning of time?\n In that case, what created time and God?\n \n Otherwise, if God and time have gone back forever, why did he wait forever before creating the earth?\n \nYou evolutionists are deluding yourselves if you think you'll ever know the origin of DNA or anything else.\n\n Really? Can you support your point?\n \nScientists like to make people think that they have all the answers because they are able to observe things...ie genetics....but if anyone thought about it just for a second they would realize that there's a difference in observing or understanding something and actually creating it.\n\n So? Scientists don't need to create gravity for people to accept it.\n This reminds me of an AiG page that said that everyone has the same facts and that people just interpret them differently. Even though it is titled, \"Creation: where's the proof?\", it does not provide any. Instead, it says something about interpreting evidence and then expects the reader to interpret the evidence according to a literal interpretation of the christian bible.\n \nThere was an origin of this information from somewhere. unfortunately for you evoltuionists, natural selection and random mutations both are braindead and both have an IQ of zero -- \n\n As is gravity, so objects obviously cannot fall...\n \nsame as the evolutionists who believe in them. \n\n Or, in the spirit of providing no actual argument, \"same as the creationists who debate them.\"\n \nDebate that, city slicker.\n\n Done.", 
   {}, 
   236936, 
   null, 
   1162076400.0
  ], 
  [
   237307, 
   null, 
   "supersport", 
   "This is getting fun. Here we go:\n Saying that people can't prove (the existance of) life is correct.\n \n checkmate.\n \n  Of course, by that logic, we can't prove that the laws of physics exist even though we observe them all the time. The same applies to the existance of other stars, the theory that bacteria and viruses cause disease, and, of course, the existance of a god. Not only that, but you can't be sure that you are even on 4forums debating; you might be drugged or in a VR machine.\n \n no, my logic has nothing to do with the above paragraph.\n \n Getting back to the point that you make claims and don't support them...\n \n Oh, but it's not just me -- you cannot support your claim of neo-darwinism either. Go ahead, try. Care to prove random muations? Care to prove cumulative selection? Care to prove natural selection in animals? lol........you make fun of me, but you are in the same boat. These guys don't like it either:\n \n \n http://www.molevol.org/camel/projects/synthesis/\n \n And, if he is perfect, and perfection cannot arise spontaneously, did he create himself with his own thoughts?\n \n His thoughts are different than out thoughts. If you read the Bible you would know that.\n \n Alternatively, did he come into existance at the beginning of time?\n In that case, what created time and God?\n \n I believe life is like a book. God created/wrote the book...and thus he lives outside of the book.....thus he lives outside of time.\n \n Otherwise, if God and time have gone back forever, why did he wait forever before creating the earth?\n \n Good question....maybe someday we will get to find out. I'm betting we will learn lots of answers someday.", 
   {}, 
   237084, 
   null, 
   1162185600.0
  ], 
  [
   237308, 
   null, 
   "Collin", 
   "Note Super Troll's total evasion of the points about the ToG.", 
   {}, 
   237307, 
   null, 
   1162186020.0
  ], 
  [
   237309, 
   null, 
   "obvious_child", 
   "Note Super Troll's total evasion of the points about the ToG.\n\n \n You have to realize he's admitted he cannot prove his belief. \n \n Yet somehow he thinks that refuting evolution will do that. If A is wrong, B is correct! Nevermind X^13a is indeed the truth.", 
   {}, 
   237308, 
   null, 
   1162190640.0
  ], 
  [
   237386, 
   null, 
   "SLP", 
   " There was an origin of this information from somewhere.\n\n What information? Please provide a definition of information as it pertains to biology.\n unfortunately for you evoltuionists, natural selection and random mutations both are braindead and both have an IQ of zero -- same as the evolutionists who believe in them. Debate that, city slicker.\n\n \n When you get out of 8th grade, perhaps you write things that will not sound so ridiculous.", 
   {}, 
   236936, 
   null, 
   1162247040.0
  ], 
  [
   237393, 
   null, 
   "Hi_Its_Me", 
   "This is getting fun. Here we go:\n Saying that people can't prove (the existance of) life is correct.\n \n checkmate.\n\n In my favor? It is true that people cannot prove anything, but we can be almost certain. We cannot reach that level of certainty about God.\n \n Of course, by that logic, we can't prove that the laws of physics exist even though we observe them all the time. The same applies to the existance of other stars, the theory that bacteria and viruses cause disease, and, of course, the existance of a god. Not only that, but you can't be sure that you are even on 4forums debating; you might be drugged or in a VR machine.\n \n no, my logic has nothing to do with the above paragraph.\n\n Yes, but by that logic (mine), that is true. Don't attempt to accept my first statement without accepting my second. They use the same logic.\n \nGetting back to the point that you make claims and don't support them...\n \n Oh, but it's not just me -- you cannot support your claim of neo-darwinism either. Go ahead, try. Care to prove random muations? Care to prove cumulative selection? Care to prove natural selection in animals? lol........you make fun of me, but you are in the same boat.\n\n We can support our claims. We cannot prove our claims. You cannot do either for your claims. See 4forums.com for a plethora of examples.\n \nAnd, if he is perfect, and perfection cannot arise spontaneously, did he create himself with his own thoughts?\n \n His thoughts are different than out thoughts. If you read the Bible you would know that.\n\n The point is, did he create himself?\n His and \"out\" thoughts don't matter.\n \nAlternatively, did he come into existance at the beginning of time?\n In that case, what created time and God?\n \n I believe life is like a book. God created/wrote the book...and thus he lives outside of the book.....thus he lives outside of time.\n\n Ok, except then he is not following us through time, and you cannot expect him to respond to prayers or something like that.\n \nOtherwise, if God and time have gone back forever, why did he wait forever before creating the earth?\n \n Good question....maybe someday we will get to find out. I'm betting we will learn lots of answers someday.\n\n Getting back to the point that you make claims and don't support them...", 
   {}, 
   237307, 
   null, 
   1162251240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  supersport, why is it that you cannot defend your own beliefs?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9097-supersport-why-you-cannot-defend-your-own-beliefs.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9097, 
  "discussion_files": [
   [
    "7429.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9097-supersport-why-you-cannot-defend-your-own-beliefs-print.html"
   ]
  ], 
  "identifier": 9097
 }
]