[
 [
  [
   237587, 
   null, 
   "simone", 
   "http://www.nytimes.com/2006/11/01/opinion/01martin.html\n \n November 1, 2006\n Op-Ed Contributor\n Saints That Weren't \n By JAMES MARTIN\n EVEN though today is All Saints' Day, most Americans probably don't know the name of the newest American saint. Or that, like several saints, she was mistreated by the church that she served so faithfully.\n \n Last month, Pope Benedict XVI declared Mother Théodore Guérin, who lived and worked in rural Indiana in the mid-1800's, a saint. She is therefore worthy of \"public veneration\" by Catholics worldwide. Mother Guérin founded the Sisters of Providence of St. Mary-of-the-Woods and started several schools and a college in the region. \n \n You would think that this would have won her favor from the local bishop. You would be wrong.\n \n At the time, the idea of an independent woman deciding where and when to open schools offended Célestine de la Hailandière, the Catholic bishop of Vincennes, Ind. In 1844, when Mother Guérin was away from her convent raising money, the bishop ordered her congregation to elect a new superior, in a bid to eject her from the very order of nuns that she had founded. \n \n The independent-minded sisters simply re-elected Mother Guérin. Infuriated, Bishop Hailandière told the future saint that she was forbidden from setting foot in her own convent, since he, the bishop, considered himself its sole proprietor.\n \n Three years later, Bishop Hailandière demanded that Mother Guérin resign. When she refused, the bishop told her congregation that she was no longer superior, that she was ordered to leave Indiana, and that she was forbidden from communicating with her sisters. Her sisters replied that they were not willing to obey a dictator. The situation worsened until, just a few weeks later, Bishop Hailandière was suddenly replaced by the Vatican. From then on, the Sisters of Providence flourished. Today its 465 members work in 10 states, the District of Columbia, China and Taiwan.\n \n Many people think of the saints as docile, but Mother Guérin is not the only saint to have found herself at odds with local bishops, church officials or even the Vatican. Joan of Arc was burned at the stake at the behest of church officials. The writings of the great theologian Thomas Aquinas came under suspicion during his lifetime in the 13th century. And Ignatius Loyola, the founder of the Jesuits, was jailed during the Spanish Inquisition over complaints about his ideas on prayer. \n \n Somewhat more recently, in 1871, Mother Mary MacKillop was excommunicated - the church's severest punishment - four years after founding a religious order for women in Australia. One biographer wrote that the bishops of the day were intimidated by Mary's \"independent spirit and steely character.\" In 1995, Mary MacKillop was beatified, the final step before canonization, by Pope John Paul II. \n \n The church's long history of \"faithful dissent\" offers both hope and perspective to Catholics in our time. It echoes the call of the Second Vatican Council, which, in 1964, declared that expressing opinions \"on matters concerning the good of the church\" is sometimes an obligation for the faithful. \n \n But, as some saints knew firsthand, a sincere intention is no guarantee that everybody in the church will listen - even today. Members of Voice of the Faithful, the lay organization founded in response to the sexual abuse scandals, are sometimes barred from meeting in Catholic parishes. Local chapters often gather in nearby Protestant church halls. Who knows which future saints are lurking there? \n \n All Saints' Day is a good time to remember that while most saints led lives of quiet service, some led the life of the noisy prophet, speaking the truth to power - even when that power was within the church. \n \n Today the Catholic Church rightly honors all of its saints, even those it once mistreated, silenced or excommunicated. That includes Mother Théodore Guérin. It makes you wonder what Bishop Hailandière thinks from his post in heaven - or wherever he is today.\n \n James Martin, a Jesuit priest, is the author of \"My Life With the Saints.\"", 
   {
    "post_info": {
     "post_title": "An Uppity Woman Is Made a Saint"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1162397160.0
  ], 
  [
   237645, 
   null, 
   "maximus", 
   "You still have a chance simone! Simply profess your allegiance to the Pope and the Church!", 
   {}, 
   237587, 
   null, 
   1162427880.0
  ], 
  [
   237650, 
   null, 
   "sinjin", 
   "Maybe she's just waiting for a female Pope?emoticon_xangel", 
   {}, 
   237645, 
   null, 
   1162429500.0
  ], 
  [
   237682, 
   null, 
   "Matthew S", 
   "Maybe she's just waiting for a female Pope?emoticon_xangel\n\n \n Well if the Pope Benedict is a bottom then we are part way there.", 
   {}, 
   237650, 
   null, 
   1162441440.0
  ], 
  [
   237737, 
   null, 
   "simone", 
   "You still have a chance simone! Simply profess your allegiance to the Pope and the Church!\nPope Hans Kung? I'd be delighted, Maximus.", 
   {}, 
   237645, 
   null, 
   1162495080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  An Uppity Woman Is Made a Saint", 
  "url": "http://www.4forums.com/political/religion-debates/9114-uppity-woman-made-saint.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9114, 
  "discussion_files": [
   [
    "12880.html", 
    "http://www.4forums.com/political/religion-debates/9114-uppity-woman-made-saint-print.html"
   ]
  ], 
  "identifier": 9114
 }
]