[
 [
  [
   237644, 
   null, 
   "billsco", 
   "Has anyone downloaded the new IE 7 yet? If so, how's it working for you? Would you recommend it?", 
   {
    "post_info": {
     "post_title": "Internet Explorer 7"
    }
   }, 
   null, 
   null, 
   1162427580.0
  ], 
  [
   237729, 
   null, 
   "daewoo", 
   "Has anyone downloaded the new IE 7 yet? If so, how's it working for you? Would you recommend it?\n\n \n I did, and it did not exactly blow my skirt up. The download and installation went perfectly. Browsed the web for about 15 minutes and it crashed. Did that about 4 times, so I uninstalled it. \n \n As far as I could tell, the only useful additions were tabbed browsing and a pop up blocker (that did not work well). Go to www.crazybrowser.com and download crazybrowser. It is a set of extensions of rinternet explorer that gives you tabbed browsing and a useful pop up blocker.\n \n I would wait a few months before installing IE 7. Let other people be the beta testers.", 
   {}, 
   237644, 
   null, 
   1162489860.0
  ], 
  [
   237762, 
   null, 
   "billsco", 
   "All right, I appreciate the information.", 
   {}, 
   237729, 
   null, 
   1162558560.0
  ], 
  [
   237797, 
   null, 
   "Steeeeve", 
   "Mozilla Firefox is where it is at", 
   {}, 
   237762, 
   null, 
   1162528500.0
  ], 
  [
   237802, 
   null, 
   "zachvac", 
   "Mozilla Firefox is where it is at\n\n \n yep, using IE is asking for trouble. Firefox is free and it's been the best browser I've seen so far. I've been happy since I've been using it (about a year or so).", 
   {}, 
   237797, 
   null, 
   1162533600.0
  ], 
  [
   237822, 
   null, 
   "georged", 
   "Has anyone downloaded the new IE 7 yet? If so, how's it working for you? Would you recommend it?\n\n \n I used a couple of the beta releases, downloaded the first release and one patch, no problems, no crashes, I'd recommend it. Two machines, Pentium 4s at 3.6Ghz, one machine Pentium 2 core 3.6Ghzs all with 2G of memory, XP Pro and stand-alone video cards.\n \n Formerly ran Firefox but it isn't access compatible with my IP surveillance software.", 
   {}, 
   237644, 
   null, 
   1162572420.0
  ], 
  [
   237906, 
   null, 
   "Rekhyt2238", 
   "I have to agree with everyone that has reccomended firefox. Daewoo mentioned that tabs and a popup blocker were the only useful additions...Well if I've heard correctly, firefox has had both for quite some time.", 
   {}, 
   237822, 
   null, 
   1162604820.0
  ], 
  [
   239705, 
   null, 
   "Eleph~ant~", 
   "I have to agree with everyone that has reccomended firefox. Daewoo mentioned that tabs and a popup blocker were the only useful additions...Well if I've heard correctly, firefox has had both for quite some time.\n \n IE the best browser", 
   {}, 
   237906, 
   null, 
   1163526600.0
  ], 
  [
   240124, 
   null, 
   "Rekhyt2238", 
   "Would you like to support that Eleph~ant~?", 
   {}, 
   239705, 
   null, 
   1163731020.0
  ], 
  [
   241150, 
   null, 
   "Missouri Mule", 
   "I've used them all and was a beta tester for IE7, but I'm using Opera right now. It has its advantages. I used Firefox for a long time but I think IE7 has essentially caught up with it for ease of use. They all have thier plusses and minuses. I'm curious about Vista if its worth all the hype. Anyone have any thoughts on that situation?", 
   {}, 
   240124, 
   null, 
   1164654120.0
  ], 
  [
   241152, 
   null, 
   "Jo Bennett", 
   "The guy who runs the computer shop at the top of my road has been running an early version of vista, his verdict so far is that it runs better than XP, the machine he's running it on had serious issues with XP but runs vista very nicely. Make of that what you will. Personally I'd give the same advice I'd give with IE 7: if you can, wait until they've patched the major security holes in it and get it when it's on service pack 1 at the earliest.", 
   {}, 
   241150, 
   null, 
   1164654780.0
  ], 
  [
   241154, 
   null, 
   "Missouri Mule", 
   "The guy who runs the computer shop at the top of my road has been running an early version of vista, his verdict so far is that it runs better than XP, the machine he's running it on had serious issues with XP but runs vista very nicely. Make of that what you will. Personally I'd give the same advice I'd give with IE 7: if you can, wait until they've patched the major security holes in it and get it when it's on service pack 1 at the earliest.\n\n \n That's good to know, but I've never really had much trouble with security issues. I did, however, have a major problem with \"phishing\" which required some drastic action to stop that business and the spam was getting out of control. I wound up dumping all of my e-mail addresses and passwords and started anew. \n \n I'm just wondering what Vista will really do for me. XP has been stable for the most part; practially aways, in fact. I also never have locking up my computer as was normal for Windows 98. Most of the machines now being trotted out are said to be \"Vista Capable\" or words to that effect and usually a free copy of Vista when it is finally released. But the technology expert over at the WSJ says to wait until it actually is released and installed as his experience there was some difficulty in installing it. When I purchased my two Dells, all the software was installed and it was 10 minutes from unpacking to working on the computers. I HATE with a purple passion installing software; especially operating systems. That's why I keep an extra \"mirror\" hard drive secreted away in the event my hard drive goes belly up. I just stick in the spare and I'm good to go.", 
   {}, 
   241152, 
   null, 
   1164655740.0
  ], 
  [
   241183, 
   null, 
   "Big_Bear_Scot", 
   "I am running Vista on one of my work machines for research purposes into the latest version of Direct3D. \n \n I have to say I was initially impressed, but that new graphical flashiness soon wears off. It is not massive improvement over Windows XP(like Microsoft promised) sure the windows effects are nice but do you really need transparent windows and the like.\n \n I would say that unless you have a pressing need to upgrade(you want to play Vista only games) then I would stick with XP for now.", 
   {}, 
   241154, 
   null, 
   1164670140.0
  ], 
  [
   241188, 
   null, 
   "Missouri Mule", 
   "I am running Vista on one of my work machines for research purposes into the latest version of Direct3D. \n \n I have to say I was initially impressed, but that new graphical flashiness soon wears off. It is not massive improvement over Windows XP(like Microsoft promised) sure the windows effects are nice but do you really need transparent windows and the like.\n \n I would say that unless you have a pressing need to upgrade(you want to play Vista only games) then I would stick with XP for now.\n\n \n Thanks. I think I will pass for now and let the dust settle for a while.", 
   {}, 
   241183, 
   null, 
   1164675420.0
  ], 
  [
   241266, 
   null, 
   "georged", 
   "I am running Vista on one of my work machines for research purposes into the latest version of Direct3D. \n \n I have to say I was initially impressed, but that new graphical flashiness soon wears off. It is not massive improvement over Windows XP(like Microsoft promised) sure the windows effects are nice but do you really need transparent windows and the like.\n \n I would say that unless you have a pressing need to upgrade(you want to play Vista only games) then I would stick with XP for now.\n\n \n Does it load any faster than XP?", 
   {}, 
   241183, 
   null, 
   1164732480.0
  ], 
  [
   241277, 
   null, 
   "Big_Bear_Scot", 
   "Does it load any faster than XP?\n\n \n Well it really depends, I would have to compare clean install of XP with the clean install of Vista. \n \n But from my experience of Vista it does seem to load up faster, it also has a nice feature that when you shutdown Vista goes into a low power mode. When you then switch on it boots up really quickly and shows the log in screen(very like the hibernate feature in XP but about 100% faster).\n \n On the general performance of Operating System, I would it seems slightly faster than XP. I believe this is becasue the drawing of windows is handled by the graphics card which frees up the CPU to do more work.", 
   {}, 
   241266, 
   null, 
   1164735240.0
  ], 
  [
   241280, 
   null, 
   "georged", 
   "Well it really depends, I would have to compare clean install of XP with the clean install of Vista. \n \n But from my experience of Vista it does seem to load up faster, it also has a nice feature that when you shutdown Vista goes into a low power mode. When you then switch on it boots up really quickly and shows the log in screen(very like the hibernate feature in XP but about 100% faster).\n \n On the general performance of Operating System, I would it seems slightly faster than XP. I believe this is becasue the drawing of windows is handled by the graphics card which frees up the CPU to do more work.\n\n \n Like the difference between identical CPUs/memory in an XP machine running onboard graphics and the same configuration using a stand-alone graphics card with adequate memory?", 
   {}, 
   241277, 
   null, 
   1164737340.0
  ], 
  [
   241283, 
   null, 
   "daewoo", 
   "Well it really depends, I would have to compare clean install of XP with the clean install of Vista. \n \n But from my experience of Vista it does seem to load up faster, it also has a nice feature that when you shutdown Vista goes into a low power mode. When you then switch on it boots up really quickly and shows the log in screen(very like the hibernate feature in XP but about 100% faster).\n \n On the general performance of Operating System, I would it seems slightly faster than XP. I believe this is becasue the drawing of windows is handled by the graphics card which frees up the CPU to do more work.\n\n \n As I understand it, the speed boost you get using vista startup is the fact that it never really shuts down...it pretty much hibernates...and that when it hibernates, it only stores the portion of RAM that is active, not the entire contents of your ram, which includes \"saving\" a lot of empty space. \n \n On embedded systems it is not uncommon to use HORM, which allows the use of the same hibernate file multiple times (instead of writing a new one each time you shut down...so the system boots to exactly the same place every time). The trick is to start XP with 256mb of ram and then activate HORM and hibernate. Then, replace the 256 MB of ram with a gig or 2 or whatever you feel you need. When windows \"wakes\" up, it still only reads the 256mb hibernate file, so it boots MUCH faster.\n \n I have a computer attached to my entertainment center...a media machine. It is only 1 GHZ (a mini ITX) running windows XP embedded and media engine as a front end. I booted it with 128 MB of ram to establish my hibernate file, then upgraded it to 1 gb to actually run. It goes from cold to menu in under 7 seconds.", 
   {}, 
   241277, 
   null, 
   1164738420.0
  ], 
  [
   394614, 
   null, 
   "The Smart One", 
   "Has anyone downloaded the new IE 7 yet? If so, how's it working for you? Would you recommend it?\n\n \n Get mozilla firefox. internet explorer 7 crashes.", 
   {}, 
   237644, 
   null, 
   1268625480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Internet Explorer 7", 
  "url": "http://www.4forums.com/political/computers/9117-internet-explorer-7-a.html", 
  "breadcrumbs": [
   "Computers"
  ], 
  "id_number": 9117, 
  "discussion_files": [
   [
    "13241.html", 
    "http://www.4forums.com/political/computers/9117-internet-explorer-7-a-print.html"
   ], 
   [
    "13242.html", 
    "http://www.4forums.com/political/computers/9117-internet-explorer-7-a-2-print.html"
   ]
  ], 
  "identifier": 9117
 }
]