[
 [
  [
   238137, 
   null, 
   "INRI", 
   "ROME (CNS) -- Believing that each person is created in the image of God, the Catholic Church hopes all people will come to know the Gospel, but its primary approach to other religions and cultures must be one of tolerance and openness, Pope Benedict XVI said.\n \n During a meeting at his summer villa in Castel Gandolfo, south of Rome, Pope Benedict welcomed Hans-Henning Horstmann as Germany's new ambassador to the Vatican.\n \n Faith, the pope told him, increases people's commitment to the common good, which is marked by defending the life and dignity of all people, including those of other faiths and cultures.\n \n \"The church does not impose itself,\" the pope said. \"It does not force anyone to accept the Gospel message because faith in Jesus Christ, whom the church proclaims, can only happen in freedom. For this reason, encounters with others must be marked by tolerance and cultural openness.\"\n \n However, Pope Benedict said, tolerance, respect and openness \"must never be confused with indifference, which is the opposite of the deep Christian interest in human beings and their good.\"\n \n \"True tolerance presupposes respect for the other, for the human being, who was created by God and whose existence was willed by God,\" the pope said.\n \n The Christian faith motivates Catholics to defend the \"dignity, integrity and freedom\" of each person, Pope Benedict said, and to work with all people of good will in defending others.\n \n The good of humanity is what leads the church to defend traditional marriage and family life, he said, and to oppose abortion, including cases in which a baby may be severely handicapped, because every human life \"has value for God.\"\n \n Pope Benedict also asked the German government to defend the life and freedom of those requesting exile in Germany because of political or religious persecution in their homelands.\n \n The pope's remarks about tolerance were given special attention due to continuing discussion about his comments on Islam during a Sept. 12 speech at the University of Regensburg in Germany.\n \n Pope Benedict met with ambassadors from predominantly Muslim countries and with representatives of Italy's Muslim community, expressing his deep respect for Muslims, pledging to continue dialogue and encouraging joint Christian-Muslim efforts to curb violence.\n \n But the foreign ministers of the Organization of the Islamic Conference asked the pope \"to retract or redress\" the remarks he had made in Germany.\n \n The foreign ministers of the organization representing 57 nations from around the world said the pope's remarks \"reflect (a) lack of correct information about the holy Quran, the Prophet (Mohammed) and the Islamic faith, at the time when the Muslim world was expecting from His Holiness, the new pope, to continue the promotion of the cordial ties which prevailed with his predecessors and with the Vatican\" for decades.\n \n They also expressed concern that the pope's remarks might \"engender a situation of tension between the Muslim world and the Vatican, to the detriment of the real interests of the two parties.\"", 
   {
    "post_info": {
     "post_title": "Pope: Christians Must be Tolerent and Open to Beliefs of Others."
    }
   }, 
   null, 
   null, 
   1162730220.0
  ], 
  [
   238154, 
   null, 
   "johnhanks", 
   "ROME (CNS) -- Believing that each person is created in the image of God, the Catholic Church hopes all people will come to know the Gospel, but its primary approach to other religions and cultures must be one of tolerance and openness, Pope Benedict XVI said.\"\n\n That's a message some Catholics seem to find hard to take on board.\n \nIn scenes reminiscent of medieval witchhunts, Catholic pilgrims in Glastonbury have attacked pagans and threatened to \"cleanse\" them from the town. Local pagans were pelted with salt and branded witches who \"would burn in hell\" during a procession organised by Youth 2000, a conservative Catholic lay group. The Magick Box, a pagan shop on the route of the march, was also singled out and attacked.\n", 
   {}, 
   238137, 
   null, 
   1162747500.0
  ], 
  [
   238178, 
   null, 
   "INRI", 
   "Yes well again the media is not really a friend of the Catholic Church. I know a few people who have Gone on this march in the past. I know about youth 2000 as well. They are nice people and it is Good group.\n \n The parade is done as a peaceful exposition of the blessed sacrament, in the past the parade has been verbally and physically attacked, last year one paticular person I know was dragged from the parade and beaten. Those on the parade have had to endure being spit at, eggs hurled at them attempts to desacrate the host. It certainly not inconceivable that the pagan community in glastonberry plannted a few pagans in the youth 2000 procedings, which would explain the \"Family\" who were \"destructive\" and swore at the Christians.", 
   {}, 
   238154, 
   null, 
   1162753680.0
  ], 
  [
   238201, 
   null, 
   "thelmoose", 
   "Yes well again the media is not really a friend of the Catholic Church. I know a few people who have Gone on this march in the past. I know about youth 2000 as well. They are nice people and it is Good group.\n \n The parade is done as a peaceful exposition of the blessed sacrament, in the past the parade has been verbally and physically attacked, last year one paticular person I know was dragged from the parade and beaten. Those on the parade have had to endure being spit at, eggs hurled at them attempts to desacrate the host. It certainly not inconceivable that the pagan community in glastonberry plannted a few pagans in the youth 2000 procedings, which would explain the \"Family\" who were \"destructive\" and swore at the Christians.\n\n \n Ah, how the mind of the faithful works!\n \n I think you're right, it was probably the work of a secret conspiracy of \"pagans\" who infiltrated the march to inflict bodily harm upon and destroy the property of their own kind. \n That's a very logical explanation you came up with.", 
   {}, 
   238178, 
   null, 
   1162761240.0
  ], 
  [
   238204, 
   null, 
   "INRI", 
   "Ah, how the mind of the faithful works!\n \n I think you're right, it was probably the work of a secret conspiracy of \"pagans\" who infiltrated the march to inflict bodily harm upon and destroy the property of their own kind. \n That's a very logical explanation you came up with.\n\n \n It is not a march- It is a Parade\n \n 2nd there was no bodilly harm, no physical violence and no property destroyed.\n \n The Artical is writen in order to make you believe their was physical violence and property destroyed.... read it again it is a clever use of the english language.\n \n Supposedly Salt was thrown and Insults hurled - That is about it.\n \n But still acting in such a way is uncatholic but the report is writen in a biased way.\n \n Look at the way it is reported...it is a \"March\" imediatly you think of Armies and Battle etc.... its not a March it is a Parade, a celabration of Faith....not a protest.\n \n \n \n \n \n The pagans have long since campaigned to have the event banned. by pretending to be Catholics on the parade they could act in a way that discredited the event and put pressure on event organisers to cancel it and town officals to ban it.", 
   {}, 
   238201, 
   null, 
   1162764060.0
  ], 
  [
   238208, 
   null, 
   "Matthew S", 
   "ROME (CNS) -- \n \"True tolerance presupposes respect for the other, for the human being, who was created by God and whose existence was willed by God,\" the pope said.\n \n \n\n \n WOW he should take his own advice when it comes to the secular rights of gay people and their families. Pope Benedict the hypocrite", 
   {}, 
   238137, 
   null, 
   1162767600.0
  ], 
  [
   238292, 
   null, 
   "johnhanks", 
   "Look at the way it is reported...it is a \"March\" imediatly you think of Armies and Battle etc.... its not a March it is a Parade, a celabration of Faith....not a protest.\n\n Your words from post #3:\n \nI know a few people who have Gone on this march...\n\n http://www.4forums.com/political/showthread.php?p=238178#post238178", 
   {}, 
   238204, 
   null, 
   1162801800.0
  ], 
  [
   239634, 
   null, 
   "wvpeach1963", 
   "Wow it sounds like Pope benedict actually understands what it means to be a christian.\n \n Well said, I'll pay more attention to him in the future when he speaks.", 
   {}, 
   238292, 
   null, 
   1163484600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Pope: Christians Must be Tolerent and Open to Beliefs of Others.", 
  "url": "http://www.4forums.com/political/religion-debates/9145-pope-christians-must-tolerent-open-beliefs-others.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9145, 
  "discussion_files": [
   [
    "3637.html", 
    "http://www.4forums.com/political/religion-debates/9145-pope-christians-must-tolerent-open-beliefs-others-print.html"
   ]
  ], 
  "identifier": 9145
 }
]