[
 [
  [
   238230, 
   null, 
   "trebor", 
   "from http://www.nbc13.com/family/10210202/detail.html\n \n \n\n Americans are often thought of as people who believe in God.\n \n But results of a new Harris Poll show that may be changing.\n \n The poll found that 42 percent of all U.S. adults said they are not \"absolutely certain\" there is a God, including 15 percent who are \"somewhat certain,\" 11 percent who think there is probably no God and 16 percent who are not sure.\n \n Not everyone who described themselves as Christian or Jewish said that they believed in God. Only 76 percent of Protestants, 64 percent of Catholics, and 30 percent of Jews said they are \"absolutely certain\" there is a God. However, most Christians who described themselves as \"born-again\" (93 percent) said they are absolutely certain there is a God.\n \n Differences Between Demographic Groups\n \n Demographic groups that are more likely to say they are absolutely certain that there is a God include:\n \n *\n * People in all age groups 40 and over compared to people in age groups under 40\n * Women (62 percent) slightly more than men (54 percent)\n * Blacks (71 percent) compared to Hispanics (61 percent) and whites (57 percent)\n * Republicans (73 percent) more than Democrats (54 percent) or Independents (51 percent)\n People with no college education (62 percent) or who have some college education (57 percent) compared to college graduates (50 percent) and those with post-graduate degrees (53 percent)\n \n About 35 percent of all adults polled said that they attend religious services at least once a month, including 26 percent who said they attend every week or more often than that.\n \n Nearly half of all adults polled (46 percent) said they attend services a few times a year or less frequently, while 18 percent said the never attend religious services.\n \n Those who said they attend religious services once a month or more included 48 percent of Protestants, 46 percent of Catholics, and 12 percent of Jews. However, more than two-thirds (68 percent) of born-again Christians attend Church once a month or more.\n \n Is God Male Or Female?\n \n The public is almost equally divided between those who think of God as male (36 percent) and \"neither male nor female\" (37 percent), with 10 percent saying \"both male and female.\" Only 1 percent thinks of God as a female.\n \n Does God Have A Human Form?\n \n Much of the public (41 percent) thinks of God as \"a spirit or power that can take on human form but is not inherently human,\" according to the survey. But 27 percent think of God as a \"spirit or power that does not take on human form,\" while 9 percent of adults think of God as being \"like a human being with a face, body, arms, legs, eyes, etc.\"\n \n Does God Control Events On Earth?\n \n Only 29 percent of those polled said they believe God \"controls what happens on Earth.\" Of those believers, 57 percent were born-again Christians. And 44 percent of respondents said they believe that God \"observes but does not control what happens on Earth.\"\n \n Do We Worship The Same God?\n \n Poll results show that about 51 percent of all adults, including a majority of Catholics (63 percent), believe that Jews, Christians and Muslims all worship the same God. One-third (32 percent) said they believe they do not and 16 percent are not sure. On this question, as on the others, the views of born-again Christians are different -- a 54 percent majority believes they do not worship the same God and only 34 percent believe they do.\n \n Are Believers Declining?\n \n Three years ago, in an identical survey, 79 percent of adults said they believed in God and 66 percent said they were absolutely certain that there is a God. In this new survey, those numbers declined to 73 percent and 58 percent respectively.\n \n Why The Changes?\n \n There are some important differences between telephone polling and those conducted online, as this survey was. Several surveys find that people are more likely to admit potentially embarrassing beliefs of behaviors when answering online surveys than to admit these behaviors when talking to an actual interviewer on the phone.\n \n According to Harris, people are three times more likely to say that their sexual orientation is gay, lesbian or bi-sexual online than over the phone. Researchers called this unwillingness to give honest answers to some questions in telephone surveys a social desirability bias.\n \n This distinction between online and telephone polls may explain why more people said they are not absolutely certain there is a God than have given similar replies in other surveys conducted by telephone.\n \n The Harris Poll was conducted online by Harris Interactive between Oct. 4 and 10 with a nationwide sample of 2,010 U.S. adults.\n \n", 
   {
    "post_info": {
     "post_title": "Religious belief on decline in America."
    }
   }, 
   null, 
   null, 
   1162774920.0
  ], 
  [
   238242, 
   null, 
   "doG", 
   "This country just might make it after all emoticon_xangel", 
   {}, 
   238230, 
   null, 
   1162779600.0
  ], 
  [
   238244, 
   null, 
   "Easyrider", 
   "\"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\" - 2 Timothy 4:3\n \n This too was foretold....", 
   {}, 
   238242, 
   null, 
   1162780320.0
  ], 
  [
   238248, 
   null, 
   "Matthew S", 
   "Good we are on our way to becoming a trully secular nation.", 
   {}, 
   238244, 
   null, 
   1162780920.0
  ], 
  [
   238249, 
   null, 
   "Hi_Its_Me", 
   "\"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\" - 2 Timothy 4:3\n \n This too was foretold....\n\n And we are supposed to accept the bible as evidence that the bible is accurate?\n \n Also, as to the various predictions that the bible makes, some don't come true, and you can say that they will come true later. Those that do come true are pointed to as evidence for the bible. So, all you have to do is wait for more predictions to come true for more \"evidence.\"\n It just isn't too convincing when you consider it carefully...", 
   {}, 
   238244, 
   null, 
   1162780920.0
  ], 
  [
   238295, 
   null, 
   "Jo Bennett", 
   "\"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\" - 2 Timothy 4:3\n \n This too was foretold....\n\n \n Isn't that what happened when the evangelicals abandoned the historic church and wandered off to make up their own teachings, twisting the words of the Bible to help them do it?", 
   {}, 
   238244, 
   null, 
   1162807920.0
  ], 
  [
   238317, 
   null, 
   "trebor", 
   "Isn't that what happened when the evangelicals abandoned the historic church and wandered off to make up their own teachings, twisting the words of the Bible to help them do it?\n\n \n \n Actually, that happened when the Christians diefied Jesus, and abandoned the true worship of God. .. (from another perspective).\n \n Or, it could be when the pheoncian gods were abandoned, and this 'monotheism' came about.\n \n Or, it could be when the nature gods were abandoned, and the phoenica religion \n arose.", 
   {}, 
   238295, 
   null, 
   1162825260.0
  ], 
  [
   238406, 
   null, 
   "Easyrider", 
   "Isn't that what happened when the evangelicals abandoned the historic church and wandered off to make up their own teachings, twisting the words of the Bible to help them do it?\n\n \n It's what happens when liberals and anyone abandons or twists the Word of God.", 
   {}, 
   238295, 
   null, 
   1162856040.0
  ], 
  [
   238423, 
   null, 
   "Matthew S", 
   "It's what happens when liberals and anyone abandons or twists the Word of God.\n\n \n You still don't get it do you? The bible is not imprortant and has no place in society.", 
   {}, 
   238406, 
   null, 
   1162859220.0
  ], 
  [
   238442, 
   null, 
   "Easyrider", 
   "You still don't get it do you? The bible is not imprortant and has no place in society.\n\n \n Thankfully the radical left doesn't have the moxy or the muscle to enforce something like this.", 
   {}, 
   238423, 
   null, 
   1162861680.0
  ], 
  [
   238450, 
   null, 
   "Matthew S", 
   "Thankfully the radical left doesn't have the moxy or the muscle to enforce something like this.\n\n \n See you don't understand there is nothing wrong with the bible but it needs to remain in its place. It must stay in a church and out of the law and the public square. You must not believe in religious freedom. By keeping all religion out of the public square and the law christianity is protected. Do you want sharia law placed into the law you have to live under? Do you want your children to pray to statan? Do you want to be forced to celebrate wiccan holidays or religious practices or pray to wiccan Gods in your home? If you do not want these things then you had better not wish to have christianity and evangelical christian beliefs and parctices made law, blurring the line between church and state. For today the majority maybe christian but tomorrrow it might be another religion in the majority.", 
   {}, 
   238442, 
   null, 
   1162864620.0
  ], 
  [
   238452, 
   null, 
   "thelmoose", 
   "See you don't understand there is nothing wrong with the bible but it needs to remain in its place. It must stay in a church and out of the law and the public square. \n\n \n There is plenty wrong with the Bible if it is viewed as anything greater than some quaint literature of antiquity that describes the lore and mythology of a primitive people.", 
   {}, 
   238450, 
   null, 
   1162865220.0
  ], 
  [
   238456, 
   null, 
   "jyoshu", 
   "Isn't that what happened when the evangelicals abandoned the historic church and wandered off to make up their own teachings, twisting the words of the Bible to help them do it?\n\n \n Or maybe Henry the VIIIth? emoticon_xangel", 
   {}, 
   238295, 
   null, 
   1162866240.0
  ], 
  [
   238500, 
   null, 
   "peteratwar", 
   "There is plenty wrong with the Bible if it is viewed as anything greater than some quaint literature of antiquity that describes the lore and mythology of a primitive people.\n\n \n There is plenty wrong if that is the best way people can view it.\n \n People have hardly developed that much sice except in a material way.\n \n There are many hundreds of thousands of people who walk the earth today wha are just as or even more primitive than those in the Bible", 
   {}, 
   238452, 
   null, 
   1162905780.0
  ], 
  [
   238502, 
   null, 
   "Matthew S", 
   "There is plenty wrong with the Bible if it is viewed as anything greater than some quaint literature of antiquity that describes the lore and mythology of a primitive people.\n\n \n Which is another reason it has no place in society and the public square. What EZ doesn't understand and I bet he would hate is a nation that based it's laws on say the koran or the Bhagavad Gita. He would hate it if he had to live under a system of laws that that forced him to do something against his religious belief.", 
   {}, 
   238452, 
   null, 
   1162909380.0
  ], 
  [
   238508, 
   null, 
   "peteratwar", 
   "Which is another reason it has no place in society and the public square. What EZ doesn't understand and I bet he would hate is a nation that based it's laws on say the koran or the Bhagavad Gita. He would hate it if he had to live under a system of laws that that forced him to do something against his religious belief.\n\n \n Try Saudi Arabia re Sharia Law etc. Any Nation is entitled to live under whatever Code of Law it wishes to.\n \n Any religious book is entitled to be read and studied wherever the individual so wishes. Frankly to say a book like the Bible has no place in society is rather pathetic in the extreme", 
   {}, 
   238502, 
   null, 
   1162914660.0
  ], 
  [
   238525, 
   null, 
   "thelmoose", 
   "\n \n There are many hundreds of thousands of people who walk the earth today wha are just as or even more primitive than those in the Bible\n\n \n Is that an endorsement or a condemnation of the Bible?", 
   {}, 
   238500, 
   null, 
   1162923060.0
  ], 
  [
   238528, 
   null, 
   "Matthew S", 
   "Try Saudi Arabia re Sharia Law etc. Any Nation is entitled to live under whatever Code of Law it wishes to.\n \n Any religious book is entitled to be read and studied wherever the individual so wishes. Frankly to say a book like the Bible has no place in society is rather pathetic in the extreme\n\n \n And I would agree with you I am not or never have been for the banning of books. The bible has no in society if it is going to be used to make laws, justify injustices, and take presidence over all other religious books, or the right of those not wishing to believe. The bible is best when left in its proper place a christian church and a christian home.", 
   {}, 
   238508, 
   null, 
   1162923600.0
  ], 
  [
   238530, 
   null, 
   "peteratwar", 
   "Is that an endorsement or a condemnation of the Bible?\n\n \n Neither. It isn't the total truth, especially as a historical record, but contains many truths which are still valid today as they ever were", 
   {}, 
   238525, 
   null, 
   1162924140.0
  ], 
  [
   238541, 
   null, 
   "thelmoose", 
   "Neither. It isn't the total truth, especially as a historical record, but contains many truths which are still valid today as they ever were\n\n \n Maybe there are some truths, just not that god myth stuff, that's made up.", 
   {}, 
   238530, 
   null, 
   1162926120.0
  ], 
  [
   238551, 
   null, 
   "Big Orn", 
   "\"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\" - 2 Timothy 4:3\n \n This too was foretold....\n\n True.\n \n Got to wonder how long it will take to replace sound doctrine with \"what folks want to hear\"? Not long I expect.\n \n And about polls....well, you know...emoticon_rolleyes", 
   {}, 
   238244, 
   null, 
   1162928220.0
  ], 
  [
   238665, 
   null, 
   "peteratwar", 
   "Maybe there are some truths, just not that god myth stuff, that's made up.\n\n \n You are perfectly entitled to believe what you will, as are the many millions who do indeed believe in God/Jehovah/Allah etc", 
   {}, 
   238541, 
   null, 
   1162980420.0
  ], 
  [
   238673, 
   null, 
   "Matthew S", 
   "You are perfectly entitled to believe what you will, as are the many millions who do indeed believe in God/Jehovah/Allah etc\n\n \n \n Except the followers of God/Jehovah/Allah ect will not stop until everyone is forced through the law to believe as they do. While they scream that their religious freedom is under attack they will do anything they can to distroy a non believers right not to believe.", 
   {}, 
   238665, 
   null, 
   1162991760.0
  ], 
  [
   238678, 
   null, 
   "peteratwar", 
   "Except the followers of God/Jehovah/Allah ect will not stop until everyone is forced through the law to believe as they do. While they scream that their religious freedom is under attack they will do anything they can to distroy a non believers right not to believe.\n\n \n You are getting far too hysterical over this. I have lived in Saudi Arabia, have had extensive dealings with Jews and am a Christian. I have never found anyone who does not respect another's right to believe what they want. They may not agree with that person but acknowledge there right to believe or indeed not believe in whatever they want.\n \n There are of course fanatics on all sides (would be strange if there weren't given the range of humanity) but the vast majority agree it is up to you. It is the good old silent majority which many so-called clever people affect to despise but who in a silent way are saying 'A plague on all your houses let us live and let live'", 
   {}, 
   238673, 
   null, 
   1162993920.0
  ], 
  [
   238686, 
   null, 
   "thelmoose", 
   "You are perfectly entitled to believe what you will, as are the many millions who do indeed believe in God/Jehovah/Allah etc\n\n The ubiquity of a belief has no bearing on the likelihood of its truth.", 
   {}, 
   238665, 
   null, 
   1163003160.0
  ], 
  [
   238688, 
   null, 
   "peteratwar", 
   "Given the nature of the belief, it is only something we can be certain of after we die. No-one has come back to tell us save one and that was 2000 years ago!\n \n Put it this way if you believe then once you are dead, it doesn't matter either way. If you are a non-believer and find out that it was after all true that there is a God etc, then you may be in trouble!", 
   {}, 
   238686, 
   null, 
   1163004240.0
  ], 
  [
   238691, 
   null, 
   "trebor", 
   "Given the nature of the belief, it is only something we can be certain of after we die. No-one has come back to tell us save one and that was 2000 years ago!\n \n Put it this way if you believe then once you are dead, it doesn't matter either way. If you are a non-believer and find out that it was after all true that there is a God etc, then you may be in trouble!\n\n \n \n And then again, the 'non-believer' might be in better shape that someone that actively believed in the wrong god.", 
   {}, 
   238688, 
   null, 
   1163004960.0
  ], 
  [
   238709, 
   null, 
   "thelmoose", 
   "Given the nature of the belief, it is only something we can be certain of after we die. No-one has come back to tell us save one and that was 2000 years ago!\n \n Put it this way if you believe then once you are dead, it doesn't matter either way. If you are a non-believer and find out that it was after all true that there is a God etc, then you may be in trouble!\n\n \n Why do believers always have this thinly veiled threat? You'd better believe or else you'll get yours. Could it be the \"nature of the belief\", to use your words? When you have beliefs of the nature of \"promise 'em heaven and scare 'em with hell,\" you tend to not examine the \"nature\" of the belief at all. You want to believe it because you are afraid if you don't, the worst will happen. \n \n Once we are dead, we are in no position to find out anything.", 
   {}, 
   238688, 
   null, 
   1163008680.0
  ], 
  [
   238712, 
   null, 
   "peteratwar", 
   "Why do believers always have this thinly veiled threat? You'd better believe or else you'll get yours. Could it be the \"nature of the belief\", to use your words? When you have beliefs of the nature of \"promise 'em heaven and scare 'em with hell,\" you tend to not examine the \"nature\" of the belief at all. You want to believe it because you are afraid if you don't, the worst will happen. \n \n Once we are dead, we are in no position to find out anything.\n\n \n As I said you are entitled to your opinion/belief just as I am. I make no threats and I am far from believing the threats uttered by the Clergy over the centuries. Heaven or Hell is up to the Good Lord himself and no other being. We do what we do on Earth and are free to choose what we do. We may have to answer for it in the long run but on the other hand it may be part of a grand design to train us as we go down the path of developing as humans where the future of humanity is being developed in a global sense with the antics of individuals contributing to growth (hopefully) as the majority are tempered to develop and move onto greater things.", 
   {}, 
   238709, 
   null, 
   1163009220.0
  ], 
  [
   238716, 
   null, 
   "sinjin", 
   "Put it this way if you believe then once you are dead, it doesn't matter either way. If you are a non-believer and find out that it was after all true that there is a God etc, then you may be in trouble!\nPascal's wager. Old and tired.", 
   {}, 
   238688, 
   null, 
   1163009820.0
  ], 
  [
   238734, 
   null, 
   "thelmoose", 
   "As I said you are entitled to your opinion/belief just as I am. I make no threats and I am far from believing the threats uttered by the Clergy over the centuries. Heaven or Hell is up to the Good Lord himself and no other being. We do what we do on Earth and are free to choose what we do. We may have to answer for it in the long run but on the other hand it may be part of a grand design to train us as we go down the path of developing as humans where the future of humanity is being developed in a global sense with the antics of individuals contributing to growth (hopefully) as the majority are tempered to develop and move onto greater things.\n\n \n You mentioned on a previous post, \"Given the nature of the belief, it is only something we can be certain of after we die\". It is that statement I was trying to address.\n \n You really haven't commented on the nature of that belief at all, but merely the content and its popularity. The content of the belief is this: I believe in God and he wants me to be good. If I am good, I will go to heaven after I die, and if not, it's hell for me. You mentioned also that a lot of people believe in a god. \n \n I submit that those statements are irrelevant to the veracity of the belief. If you want to talk about the \"nature\" of the belief, then you need to ask yourself why you believe that these things are true. The nature of that belief is fundamentally different from every other belief you have about anything. Why should that be so? \n \n That's the point I was trying to make. Neither the ostensible consequences of disbelief nor its prevalence have any impact on the probability that it is true.", 
   {}, 
   238712, 
   null, 
   1163015580.0
  ], 
  [
   238747, 
   null, 
   "Hi_Its_Me", 
   "Pascal's wager. Old and tired.\n\n It actually wasn't even intended as evidence for a deity. Pascal himself realized that he couldn't logically present it that way.", 
   {}, 
   238716, 
   null, 
   1163025780.0
  ], 
  [
   239414, 
   null, 
   "Shooterandproud", 
   "Glad america is finally coming to its senses.", 
   {}, 
   238502, 
   null, 
   1163376600.0
  ], 
  [
   239415, 
   null, 
   "Shooterandproud", 
   "It's what happens when liberals and anyone abandons or twists the Word of God.\n\n \n No, its what happens when conservatives corrupt the bible.", 
   {}, 
   238406, 
   null, 
   1163376720.0
  ], 
  [
   239448, 
   null, 
   "obvious_child", 
   "No, its what happens when conservatives corrupt the bible.\n\n \n Conservative? Maybe.\n \n This is what happens when evanglical fundemnetalist abandon the morals, values and ethics of the Bible to focus solely on Genesis and Anti-gay Crusades. \n \n It bothers me somewhat that man of these evanglical fundemnetalist are hugely rich, contridictory to several direct phrases about heaven and wealth and at least one high profile one who recently resigned engaged in drug fuel gay sex while condemning it in public. \n \n Hypocrites. If Jesus does exist, he should return and beat all of these hypocrites with a fish the size of a whale shark.", 
   {}, 
   239415, 
   null, 
   1163386680.0
  ], 
  [
   239454, 
   null, 
   "Matthew S", 
   "Conservative? Maybe.\n \n This is what happens when evanglical fundemnetalist abandon the morals, values and ethics of the Bible to focus solely on Genesis and Anti-gay Crusades. \n \n It bothers me somewhat that man of these evanglical fundemnetalist are hugely rich, contridictory to several direct phrases about heaven and wealth and at least one high profile one who recently resigned engaged in drug fuel gay sex while condemning it in public. \n \n Hypocrites. If Jesus does exist, he should return and beat all of these hypocrites with a fish the size of a whale shark.\n\n \n \n This or this or this", 
   {}, 
   239448, 
   null, 
   1163387640.0
  ], 
  [
   239536, 
   null, 
   "obvious_child", 
   "This or this or this\n\n \n \n Land over baptist is a parody.", 
   {}, 
   239454, 
   null, 
   1163453280.0
  ], 
  [
   239554, 
   null, 
   "Easyrider", 
   "Conservative? Maybe.\n \n This is what happens when evanglical fundemnetalist abandon the morals, values and ethics of the Bible to focus solely on Genesis and Anti-gay Crusades. \n \n It bothers me somewhat that man(y) of these evanglical fundemnetalist are hugely rich, contridictory to several direct phrases about heaven and wealth and at least one high profile one who recently resigned engaged in drug fuel gay sex while condemning it in public. \n \n Hypocrites. If Jesus does exist, he should return and beat all of these hypocrites with a fish the size of a whale shark.\n\n \n Are you saying there's no moderate 'Christian' hypocrites, or even liberal 'Christian' hypocrites? Or for that matter no non-Christian atheist or agnostic hypocrites?", 
   {}, 
   239448, 
   null, 
   1163461500.0
  ], 
  [
   239595, 
   null, 
   "Shooterandproud", 
   "Are you saying there's no moderate 'Christian' hypocrites, or even liberal 'Christian' hypocrites? Or for that matter no non-Christian atheist or agnostic hypocrites?\n\n \n Nope. Most liberal christians have their heads on straight. Its the conservative christians that are the big problem. I think we should put all christian fundamentalists in zoos. I mean, we imprison muslim fundys, why not christian? They do more damage that the Muslim ones.", 
   {}, 
   239554, 
   null, 
   1163469000.0
  ], 
  [
   239601, 
   null, 
   "obvious_child", 
   "Are you saying there's no moderate 'Christian' hypocrites, or even liberal 'Christian' hypocrites? Or for that matter no non-Christian atheist or agnostic hypocrites?\n\n \n No, merely that they aren't betraying the teachings of Christ in such a completely unforgivable fashion. \n \n I don't see why Jesus would beat non-Christian atheist or agnostic hypocrites with a fish though.", 
   {}, 
   239554, 
   null, 
   1163470440.0
  ], 
  [
   239622, 
   null, 
   "jyoshu", 
   "Nope. Most liberal christians have their heads on straight. Its the conservative christians that are the big problem. I think we should put all christian fundamentalists in zoos. I mean, we imprison muslim fundys, why not christian? They do more damage that the Muslim ones.\n\n \n Shooter, I have to admit, I find you a walking contradiction sometimes. You are VERY pro-gun and anti-gun control, from what I've seen here. It seems to be your pet issue. But you champion the sort of people that tend to want to ban guns and go to great lengths to disagree with those who tend to be pro-gun (conservatives). I guess I've just never seen a self-described liberal who was so conservative in his main issue. emoticon_frazzled Didn't mean to get off topic here, but it's something I've been meaning to bring up. I mean, if it weren't for conservatives, you probably wouldn't be ABLE to own a gun at all.", 
   {}, 
   239595, 
   null, 
   1163479140.0
  ], 
  [
   239627, 
   null, 
   "Shooterandproud", 
   "Shooter, I have to admit, I find you a walking contradiction sometimes.\n\n \n Funny you say that...\n \n \nYou are VERY pro-gun and anti-gun control,\n\n \n For good reasons of emoticon_xangel.\n \n \nfrom what I've seen here. It seems to be your pet issue.\n\n \n I am strong on that issue. I have many facts to back me up, and its really the initial reason I came here.\n \n \nBut you champion the sort of people that tend to want to ban guns and go to great lengths to disagree with those who tend to be pro-gun (conservatives).\n\n \n And you dont know how much I hate that. I'm really not for Handpicking certain rights as the liberals do, but im not for getting rid of practically all of our rights as the conservatives do. I find anti-gun liberals contradicting themselves. How can they protect so many rights, and care about the smaller people, yet be so anti-gun? Im not only for gun control debates, you know. You could kind of call me a liberal with a gun emoticon_xgood.\n \n \nI guess I've just never seen a self-described liberal who was so conservative in his main issue.\n\n \n I havent either. Thats why my life really sucks. Who to vote for (when I'm older)? The ones that I mostly agree with, and only disagree on one issue, but that issue is a very important issue. Or, the ones who's guts I hate, but still support my main issue? I don't view being Pro-2A as conservative, I take a more libertarian stance to it.\n \n There once was a time when liberals like Thomas Jefferson and Patrick Henry stressed the importance of gun rights. Now, I don't know where liberals are heading to.\n \n \nDidn't mean to get off topic here, but it's something I've been meaning to bring up.\n\n \n No problem.\n \n \nI mean, if it weren't for conservatives, you probably wouldn't be ABLE to own a gun at all.\n\n \n Im too young to own a gun, but I see your point. In a sense, I need the conservatives no matter how much I hate them. You don't know how much I wish the dems and liberals endorsed gun rights :xcensored :xbanghead.", 
   {}, 
   239622, 
   null, 
   1163481000.0
  ], 
  [
   239628, 
   null, 
   "Easyrider", 
   "No, merely that they aren't betraying the teachings of Christ in such a completely unforgivable fashion. \n\n \n A sin is a sin, and there's only one that's unforgiveable, which is blasphemy against the Holy Spirit. Hypocrisy by Fundy's, moderates, or liberals is still a betrayal of Christ's teachings.", 
   {}, 
   239601, 
   null, 
   1163481900.0
  ], 
  [
   239669, 
   null, 
   "trebor", 
   "A sin is a sin, and there's only one that's unforgiveable, which is blasphemy against the Holy Spirit. Hypocrisy by Fundy's, moderates, or liberals is still a betrayal of Christ's teachings.\n\n \n Then why do you betray 'Christ Teachings' so much if it is a sin?", 
   {}, 
   239628, 
   null, 
   1163516940.0
  ], 
  [
   239743, 
   null, 
   "jitobear", 
   "People like EASYRIDER are the reason that religion is on the decline in this American's life.", 
   {}, 
   239669, 
   null, 
   1163535540.0
  ], 
  [
   239785, 
   null, 
   "Easyrider", 
   "People like EASYRIDER are the reason that religion is on the decline in this American's life.\n\n \n Tell it to your pet squid.\n \n FYI, the liberal churches are the ones losing the most parishioners.", 
   {}, 
   239743, 
   null, 
   1163550420.0
  ], 
  [
   239801, 
   null, 
   "Matthew S", 
   "Tell it to your pet squid.\n \n FYI, the liberal churches are the ones losing the most parishioners.\n\n \n Sadly you are right. As the fundies gain more people their brainwashing and corruption of the nation continues.", 
   {}, 
   239785, 
   null, 
   1163557680.0
  ], 
  [
   239804, 
   null, 
   "INRI", 
   "Sadly you are right. As the fundies gain more people their brainwashing and corruption of the nation continues.\n\n \n Its not because of brianwashing or corruption but basic understanding of scripture...~It is common sense the protestant faith would produce all sorts of diverse churches from the extreemly liberal to the extremely facist - the doctrines of sola fide...faith alone and sola scriptura...scriptrue alone make it possible for any belief to be accepted as Christian. \n \n The reason why the more liberal Churches are in decline is because they have blatantly disregarded the true teaching of the bible, thus the influx towards the more facist extreme but given time that too will be exposed as disregarding the true teaching of the bible by killing homosexuals or something.\n \n The true way is not in liberal or extreme right wing christianity but in orthodox christianity as taught by both the orthodox faith and catholic faith.", 
   {}, 
   239801, 
   null, 
   1163558640.0
  ], 
  [
   239815, 
   null, 
   "jitobear", 
   "Tell it to your pet squid.\n\n \n Are you projecting again? I don't keep pet squid.\n \n \nFYI, the liberal churches are the ones losing the most parishioners.\n\n \n I don't care.", 
   {}, 
   239785, 
   null, 
   1163566680.0
  ], 
  [
   239823, 
   null, 
   "Matthew S", 
   "Its not because of brianwashing or corruption but basic understanding of scripture...~It is common sense the protestant faith would produce all sorts of diverse churches from the extreemly liberal to the extremely facist - the doctrines of sola fide...faith alone and sola scriptura...scriptrue alone make it possible for any belief to be accepted as Christian. \n \n The reason why the more liberal Churches are in decline is because they have blatantly disregarded the true teaching of the bible, thus the influx towards the more facist extreme but given time that too will be exposed as disregarding the true teaching of the bible by killing homosexuals or something.\n \n The true way is not in liberal or extreme right wing christianity but in orthodox christianity as taught by both the orthodox faith and catholic faith.\n\n \n \n Yet consevative christianity and fundmentalism is corrupting the nation. It is better that no religion exist then their religion.", 
   {}, 
   239804, 
   null, 
   1163569080.0
  ], 
  [
   239836, 
   null, 
   "peteratwar", 
   "Yet consevative christianity and fundmentalism is corrupting the nation. It is better that no religion exist then their religion.\n\n \n Yet their view is that the liberal side is corrupting the nation", 
   {}, 
   239823, 
   null, 
   1163588580.0
  ], 
  [
   239839, 
   null, 
   "Matthew S", 
   "Yet their view is that the liberal side is corrupting the nation\n\n \n Let's see \n \n Liberal side= love, compasion, and acceptance\n \n Conservative side = hate, fear, oppression, and exclusion.\n \n Yes the conservative side would feel that way. When you preach fear and oppesssion that is all you know.", 
   {}, 
   239836, 
   null, 
   1163601300.0
  ], 
  [
   239896, 
   null, 
   "obvious_child", 
   "Its not because of brianwashing or corruption but basic understanding of scripture...~It is common sense the protestant faith would produce all sorts of diverse churches from the extreemly liberal to the extremely facist - the doctrines of sola fide...faith alone and sola scriptura...scriptrue alone make it possible for any belief to be accepted as Christian. \n \n The reason why the more liberal Churches are in decline is because they have blatantly disregarded the true teaching of the bible, thus the influx towards the more facist extreme but given time that too will be exposed as disregarding the true teaching of the bible by killing homosexuals or something.\n \n The true way is not in liberal or extreme right wing christianity but in orthodox christianity as taught by both the orthodox faith and catholic faith.\n\n \n I don't buy that at all. Some of the most conservative evangelical megachurches in the South are preaching the God of Wealth idea. That God wants you to be wealthy. Many Liberal protestant groups are rightfully calling that heresey. It it sad that they are doing to Christanity what the Catholics did: Warp it to suit their secular needs.\n \n More liberal Churchs focus on the morals and values of the bible, not the literal interpretation of the Bible as most conservative evangelical churchs do. Perhaps THAT is why they are losing ground. \n \n How do you make any belief acceptable if the sole grounds for it are in scripture?", 
   {}, 
   239804, 
   null, 
   1163620020.0
  ], 
  [
   239898, 
   null, 
   "obvious_child", 
   "Then why do you betray 'Christ Teachings' so much if it is a sin?\n\n \n You forget. Easyrider isn't a Christian. He's here to make Christians look bad. It is sometimes amusing that anti-christian trolls and the most fascistly fanatical of the belief are sometimes unable to be told apart.", 
   {}, 
   239669, 
   null, 
   1163620080.0
  ], 
  [
   239917, 
   null, 
   "DrNo", 
   "Let's see \n \n Liberal side= love, compasion, and acceptance\n \n Conservative side = hate, fear, oppression, and exclusion.\n \n Yes the conservative side would feel that way. When you preach fear and oppesssion that is all you know.\n\n \n LOL, what a load of XXXX this is. All this does is show your own bias. Since when does religion have anything to do with conservative or liberal? Last time I checked, those were political and social viewpoints, not religious. Besides, it sounds like you hate and fear conservatism and wish people with conservative views to be oppressed and excluded. Lumping all conservatives into a single negative description is no better than if I said all homosexuals are pedophiles. Liberals only seem to believe in compassion and acceptance so long as you believe the same things they do. You don't seem very accepting of people with another point of view.", 
   {}, 
   239839, 
   null, 
   1163625720.0
  ], 
  [
   239940, 
   null, 
   "Easyrider", 
   "You forget. Easyrider isn't a Christian. He's here to make Christians look bad. It is sometimes amusing that anti-christian trolls and the most fascistly fanatical of the belief are sometimes unable to be told apart.\n\n \n <flush<\n \n That's about all that one deserves.", 
   {}, 
   239898, 
   null, 
   1163634300.0
  ], 
  [
   239969, 
   null, 
   "obvious_child", 
   "<flush<\n \n That's about all that one deserves.\n\n \n And exactly what you'd expect from a troll.", 
   {}, 
   239940, 
   null, 
   1163649840.0
  ], 
  [
   239974, 
   null, 
   "Hi_Its_Me", 
   "And exactly what you'd expect from a troll.\n\n Or a devout christian, I suppose...\n \n Maybe if you gave some links to fairly clear-cut betrayals of \"Christ teachings,\" you would be able to make your point.", 
   {}, 
   239969, 
   null, 
   1163651700.0
  ], 
  [
   239994, 
   null, 
   "obvious_child", 
   "Or a devout christian, I suppose...\n \n Maybe if you gave some links to fairly clear-cut betrayals of \"Christ teachings,\" you would be able to make your point.\n\n \n How about lying, fabrication and fraud?\n \n http://4forums.com/political/showthread.php?t=8981&page=11\n \n to page \n \n http://4forums.com/political/showthread.php?t=8981&page=16\n \n Last time I checked, Jesus didn't preach that his followers should be some of the most dishonest people living on the planet. \n \n I truly believe that the more you talk about Christ, the less you have to act like him.", 
   {}, 
   239974, 
   null, 
   1163659320.0
  ], 
  [
   240029, 
   null, 
   "Matthew S", 
   "LOL, what a load of XXXX this is. All this does is show your own bias. Since when does religion have anything to do with conservative or liberal? Last time I checked, those were political and social viewpoints, not religious. Besides, it sounds like you hate and fear conservatism and wish people with conservative views to be oppressed and excluded. Lumping all conservatives into a single negative description is no better than if I said all homosexuals are pedophiles. Liberals only seem to believe in compassion and acceptance so long as you believe the same things they do. You don't seem very accepting of people with another point of view.\n\n \n There are liberal and conservative branches in all faiths.\n \n The UCC would be considered liberal and the southern baptists would be considered conservative.\n \n Yes I have a bias. I have attended both liberal and conservative churches. The conservative ones preach hate, fear, oppression, and exclusion. The liberal ones preach love, compassion, and acceptance.\n \n The conservative ones brainwash people with fear to get them to attend.\n \n It is petty hard to accept people with the point of view that I as a gay man should not exist. Better no religion then the anti gay hate that is spewed by 80% of the churches in the US.", 
   {}, 
   239917, 
   null, 
   1163692980.0
  ], 
  [
   240111, 
   null, 
   "Easyrider", 
   "How about lying, fabrication and fraud?\n \n http://4forums.com/political/showthread.php?t=8981&page=11\n \n to page \n \n http://4forums.com/political/showthread.php?t=8981&page=16\n \n Last time I checked, Jesus didn't preach that his followers should be some of the most dishonest people living on the planet. \n \n I truly believe that the more you talk about Christ, the less you have to act like him.\n\n \n Once again you strike out with your worthless, knee-jerk accusations. Have some more Kool Aid, Obvious Child!", 
   {}, 
   239994, 
   null, 
   1163722080.0
  ], 
  [
   240121, 
   null, 
   "obvious_child", 
   "Once again you strike out with your worthless, knee-jerk accusations. Have some more Kool Aid, Obvious Child!\n\n \n Jesus would be ashamed of you. \n \n Your mantra should be \"the more you talk about Christ, the less you have to act like him.\"", 
   {}, 
   240111, 
   null, 
   1163730780.0
  ], 
  [
   240142, 
   null, 
   "Easyrider", 
   "Jesus would be ashamed of you. \n\n \n Since you don't know the divine Jesus, and have rejected him as your Lord and Savior for the remission of your sins, and since you don't have the first clue about who he really is and what he's all about, then you have zero credibility with your obstreperous little rant. \n \n I John 2:22", 
   {}, 
   240121, 
   null, 
   1163735340.0
  ], 
  [
   240172, 
   null, 
   "obvious_child", 
   "Since you don't know the divine Jesus, and have rejected him as your Lord and Savior for the remission of your sins, and since you don't have the first clue about who he really is and what he's all about, then you have zero credibility with your obstreperous little rant. \n \n I John 2:22\n\n \n Since you don't know the divine Jesus, and have rejected him as your Lord and Savior for the remission of your sins, and since you don't have the first clue about who he really is and what he's all about, then you have zero credibility with your obstreperous little rant. \n \n (I didn't even need to change a single word there to turn it around on you)", 
   {}, 
   240142, 
   null, 
   1163747580.0
  ], 
  [
   240241, 
   null, 
   "Easyrider", 
   "Since you don't know the divine Jesus, and have rejected him as your Lord and Savior for the remission of your sins, and since you don't have the first clue about who he really is and what he's all about, then you have zero credibility with your obstreperous little rant. \n \n (I didn't even need to change a single word there to turn it around on you)\n\n \n Yeah, but your turnabout is fallacious, mine wasn't.", 
   {}, 
   240172, 
   null, 
   1163806500.0
  ], 
  [
   240253, 
   null, 
   "obvious_child", 
   "Yeah, but your turnabout is fallacious, mine wasn't.\n\n \n Fallacious in that....\n \n I never claimed I knew the Divine Jesus, merely that you didn't, which is pretty evident in your constant love of the dishonest.", 
   {}, 
   240241, 
   null, 
   1163818560.0
  ], 
  [
   240870, 
   null, 
   "peteratwar", 
   "Is there a thread devoted to peoples rantings and casting of insults to each other ?", 
   {}, 
   240253, 
   null, 
   1164375480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religious belief on decline in America.", 
  "url": "http://www.4forums.com/political/religion-debates/9147-religious-belief-decline-america.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9147, 
  "discussion_files": [
   [
    "613.html", 
    "http://www.4forums.com/political/religion-debates/9147-religious-belief-decline-america-print.html"
   ], 
   [
    "614.html", 
    "http://www.4forums.com/political/religion-debates/9147-religious-belief-decline-america-5-print.html"
   ], 
   [
    "615.html", 
    "http://www.4forums.com/political/religion-debates/9147-religious-belief-decline-america-4-print.html"
   ], 
   [
    "616.html", 
    "http://www.4forums.com/political/religion-debates/9147-religious-belief-decline-america-3-print.html"
   ], 
   [
    "617.html", 
    "http://www.4forums.com/political/religion-debates/9147-religious-belief-decline-america-2-print.html"
   ]
  ], 
  "identifier": 9147
 }
]