[
 [
  [
   238663, 
   null, 
   "VTCruiser", 
   "how did the moon, sun, earth, and stars come into existence??\n \n What brought you into existence?? Where does your next breath come from?\n \n what is the point of life if all you do is live then die??", 
   {
    "post_info": {
     "post_title": "answer these questions"
    }
   }, 
   null, 
   null, 
   1162978320.0
  ], 
  [
   238666, 
   null, 
   "peteratwar", 
   "Bang ?\n \n Do you mean as a personality otherwise you need a biology lesson:) \n If you do then good question scientists would point to combination of cells energy etc combined with genetic traits and environment\n \n Depends on what you believe. Could be assumed that your life is in some small way advancing the evolution of the human race othewrs could say life is a necessary childhood before you move onto something greater. Your belief", 
   {}, 
   238663, 
   null, 
   1162980780.0
  ], 
  [
   238668, 
   null, 
   "Demon38", 
   "how did the moon, sun, earth, and stars come into existence??\n\n \n The stars? Condesed out of hydrogen. The earth and moon, accretion from matter from earlier stars.\n \n \nWhat brought you into existence?? \n\n \n My parents.\n \n \nWhere does your next breath come from?\n\n \n My lungs.\n \n \nwhat is the point of life if all you do is live then die??\n\n \n Whatever I want it to be.", 
   {}, 
   238666, 
   null, 
   1162985040.0
  ], 
  [
   238698, 
   null, 
   "Kronus", 
   "I'll second Demon on all his answers.", 
   {}, 
   238668, 
   null, 
   1163006640.0
  ], 
  [
   238711, 
   null, 
   "sinjin", 
   "To the physics question: Big Bada Boom!\n \n To the philosophy question: I still enjoy Christmas even though there's really no \"Sandy Claws\".", 
   {}, 
   238698, 
   null, 
   1163008920.0
  ], 
  [
   238723, 
   null, 
   "peteratwar", 
   "To the physics question: Big Bada Boom!\n \n To the philosophy question: I still enjoy Christmas even though there's really no \"Sandy Claws\".\n\n \n Santa Claus is understood to be based on an actual historical character:)", 
   {}, 
   238711, 
   null, 
   1163011320.0
  ], 
  [
   238728, 
   null, 
   "sinjin", 
   "Santa Claus is understood to be based on an actual historical character:)\nI've heard the same thing about Jesus.emoticon_xangel", 
   {}, 
   238723, 
   null, 
   1163014620.0
  ], 
  [
   238735, 
   null, 
   "Iuris", 
   "Science recognizes that the beginning of the universe is not fully understood. Possibly, it is natural that realities, like our universe, come into being spontaneously. Possibly, a divine act is the starting point (which of course answers no questions, as then, we have to expand the concept of reality and arrive to the question of the origin of god). Either way, after point zero, we have a progressively clearer pisture of how things went. Specific way things go: matter comes into being with point zero. After the explosive impetus of point zero ceases to be dominant, gravity attracts matter in the form of protons (hydrogen) together, forming into clouds, then balls of gas (stars). Due to gravity, the compressed gas begins to undergo nuclear fusion, where protons and neutrons fuse together into larger and larger atoms (other elements). Eventually, either the star becomes a black hole or it explodes. If it explodes, gravity eventually once again begins to gather together the heavier elements. However, these are too heavy to begin fusion, so they cool down into colder stellar bodies - planets and moons. Exact patterns are most different.\n \n Matter is essentially in a state of chaos. Everything gets destroyed with time, as things cool down, reform or are absorbed into others (mountains emerge from planetary interiors, decay with erosion, crumble into dust, become desert, get covered by water, are reabsorbed into the planetary core,......). Eventually, however, a single simple pattern, or process, is formed by chance that actually replicates itself, at least in the general concept. Imagine it like a sort of fire. No will, no intelligence, just a process that ever changes (as different things combust), but is in essence the same.\n \n It is the first life, and simply replicating itself assures that it survives. As it expands, small changes begin to accumulate, leading to ever greater complexity as specialized patterns begin to get better at replicating themselves than others. Eventually, the process of becoming more complex results in complex life forms, such as myself.\n \n Following from this, I am a manifestation of that process myself, the details of which I think I need not elaborate upon. A process ongoing, I would point out. Part of that process is the extraction of energy from the accumulated stores in the environment, mine being combining food and oxygen from air to generate energy to continue the process itself. \n \n I have no inherent purpose myself, however, life defines its own purpose: to continue itself. As long as the cycle continues, the process of life continues and only changes. If it stops, it stops.\n \n There is no real point in existing. But there is also no point in not being.\n \n Life is, as it is, temporary. It works by feeding on stores of energy available in the environment. Either life will stop when those are exhausted, or it will find a way to defeat enthropy. If there is a purpose of life, that would be it.\n \n Perhaps, a way would be to recreate the start of the universe.\n \n \n \n As for the inner message of those question: there are counter questions you have probably never asked yourself. How did God come into being? What is god really like, and why is he/she/it like that? What is the purpose of God? Why should God matter to us?", 
   {}, 
   238723, 
   null, 
   1163015700.0
  ], 
  [
   238831, 
   null, 
   "VTCruiser", 
   "Science recognizes that the beginning of the universe is not fully understood. Possibly, it is natural that realities, like our universe, come into being spontaneously. Possibly, a divine act is the starting point (which of course answers no questions, as then, we have to expand the concept of reality and arrive to the question of the origin of god). Either way, after point zero, we have a progressively clearer pisture of how things went. Specific way things go: matter comes into being with point zero. After the explosive impetus of point zero ceases to be dominant, gravity attracts matter in the form of protons (hydrogen) together, forming into clouds, then balls of gas (stars). Due to gravity, the compressed gas begins to undergo nuclear fusion, where protons and neutrons fuse together into larger and larger atoms (other elements). Eventually, either the star becomes a black hole or it explodes. If it explodes, gravity eventually once again begins to gather together the heavier elements. However, these are too heavy to begin fusion, so they cool down into colder stellar bodies - planets and moons. Exact patterns are most different.\n \n Matter is essentially in a state of chaos. Everything gets destroyed with time, as things cool down, reform or are absorbed into others (mountains emerge from planetary interiors, decay with erosion, crumble into dust, become desert, get covered by water, are reabsorbed into the planetary core,......). Eventually, however, a single simple pattern, or process, is formed by chance that actually replicates itself, at least in the general concept. Imagine it like a sort of fire. No will, no intelligence, just a process that ever changes (as different things combust), but is in essence the same.\n \n It is the first life, and simply replicating itself assures that it survives. As it expands, small changes begin to accumulate, leading to ever greater complexity as specialized patterns begin to get better at replicating themselves than others. Eventually, the process of becoming more complex results in complex life forms, such as myself.\n \n Following from this, I am a manifestation of that process myself, the details of which I think I need not elaborate upon. A process ongoing, I would point out. Part of that process is the extraction of energy from the accumulated stores in the environment, mine being combining food and oxygen from air to generate energy to continue the process itself. \n \n I have no inherent purpose myself, however, life defines its own purpose: to continue itself. As long as the cycle continues, the process of life continues and only changes. If it stops, it stops.\n \n There is no real point in existing. But there is also no point in not being.\n \n Life is, as it is, temporary. It works by feeding on stores of energy available in the environment. Either life will stop when those are exhausted, or it will find a way to defeat enthropy. If there is a purpose of life, that would be it.\n \n Perhaps, a way would be to recreate the start of the universe.\n \n \n \n As for the inner message of those question: there are counter questions you have probably never asked yourself. How did God come into being? What is god really like, and why is he/she/it like that? What is the purpose of God? Why should God matter to us?\n\n \n \n If God had an origin, then that origin would be God.... which means you would have to find that origin.\n \n so its safe to say that God has no origin...", 
   {}, 
   238735, 
   null, 
   1163091720.0
  ], 
  [
   238836, 
   null, 
   "simone", 
   "how did the moon, sun, earth, and stars come into existence??\n \n What brought you into existence?? Where does your next breath come from?\n \n what is the point of life if all you do is live then die??\nBig Bang.\n \n Once upon a time I was the gleam in my father's eye. He found my mother to be a very attractive woman, besides he was married to her--Voila! Here I am.\n \n The point of life is to study hard to create meaning in your life, to discover the difference between good and evil, to live a good life.", 
   {}, 
   238663, 
   null, 
   1163092500.0
  ], 
  [
   238841, 
   null, 
   "trebor", 
   "If God had an origin, then that origin would be God.... which means you would have to find that origin.\n \n so its safe to say that God has no origin...\n\n \n In other words, you are using the logical fallacy of 'Special Pleading'. You are providing an exception to the rule to prove the exception to the rule.", 
   {}, 
   238831, 
   null, 
   1163093760.0
  ], 
  [
   238842, 
   null, 
   "supersport", 
   "Big Bang.\n \n How does nothing explode?", 
   {}, 
   238841, 
   null, 
   1163094480.0
  ], 
  [
   238843, 
   null, 
   "trebor", 
   "Big Bang.\n \n How does nothing explode?\n\n \n \n Who said there was nothing? WHo said there was an 'explosian'?\n \n The so called 'Big Bang' was an expansion from a singualarity.\n \n I", 
   {}, 
   238842, 
   null, 
   1163095020.0
  ], 
  [
   238853, 
   null, 
   "obvious_child", 
   "In other words, you are using the logical fallacy of 'Special Pleading'. You are providing an exception to the rule to prove the exception to the rule.\n\n \n did you expect a creationists to understand logic?\n \n If God must exist because things need a origin, and if God doesn't need a origin it pains me that creationists can't understand the problem with that argument.", 
   {}, 
   238841, 
   null, 
   1163100360.0
  ], 
  [
   238862, 
   null, 
   "supersport", 
   "Who said there was nothing? WHo said there was an 'explosian'?\n \n The so called 'Big Bang' was an expansion from a singualarity.\n \n I\n\n \n Well personally I don't believe in the Big Bang.....but I guess many people do...and the words \"big\" and \"bang\" elude to a large explosion....no?", 
   {}, 
   238843, 
   null, 
   1163105520.0
  ], 
  [
   238867, 
   null, 
   "sinjin", 
   "Well personally I don't believe in the Big Bang.....but I guess many people do...and the words \"big\" and \"bang\" elude to a large explosion....no?\n\n http://science.hq.nasa.gov/universe/science/bang.html\n \n \"The Big Bang was not an explosion as the name suggests. The name \"Big Bang\" originated as sarcastic description by a scientific critic. It's somewhat unfortunate that this name stuck, since it is misleading. Try not to imagine a bunch of flaming debris whizzing out into the surrounding space. There couldn't be any debris because there was no such thing as matter - just energy. Later, as the universe cooled, some energy became matter. \n \n Moreover, before the Big Bang, there was no surrounding space. The Big Bang created space. Since then, space itself has been expanding.\"", 
   {
    "unicode_changes_made": true
   }, 
   238862, 
   null, 
   1163106840.0
  ], 
  [
   238869, 
   null, 
   "pandion", 
   "If God had an origin, then that origin would be God.... which means you would have to find that origin.\n \n so its safe to say that God has no origin...\nMuch safer to say that there is no god.", 
   {}, 
   238831, 
   null, 
   1163107380.0
  ], 
  [
   238875, 
   null, 
   "obvious_child", 
   "Much safer to say that there is no god.\n\n \n \"Safer?\"\n \n Not sure about that. More consistent, logical and reasonable, yes.", 
   {}, 
   238869, 
   null, 
   1163111460.0
  ], 
  [
   238890, 
   null, 
   "trebor", 
   "Well personally I don't believe in the Big Bang.....but I guess many people do...and the words \"big\" and \"bang\" elude to a large explosion....no?\n\n \n That 'term' was made popular by the press, and was originally given to the phenemona by Fred Hoyle, who was being sarcastic, since he believed in a static universe.\n \n As far as you believing in things or not, you reject a lot of things without looking at any evidence, and don't even understand your own cut/pastes. Why should I expect you to understand the evidence that lead people to come up with theory?\n \n You see, unlike your viewpoint, the various cosmological theories are based on evidence, and predicting what will be found.", 
   {}, 
   238862, 
   null, 
   1163114700.0
  ], 
  [
   238896, 
   null, 
   "electrolyte", 
   "Well personally I don't believe in the Big Bang.....but I guess many people do...and the words \"big\" and \"bang\" elude to a large explosion....no?\n\n (Elude: no. Allude? Perhaps.)\n \n Translation:\n \"I have no idea what the Big Bang really is, nor am I familiar with any of the evidence that supports it. Nevertheless, I proclaim that the Big Bang is stupid and I therefore refuse to believe in it.\"\n \n This is, of course, fitting, because we've already established that supersport's view of evolutionary theory is:\n \"I have no idea what evolution really is, nor am I familiar with any of the evidence that supports it. Nevertheless, I proclaim that evolutionary theory is stupid and I therefore refuse to believe in it.\"", 
   {}, 
   238862, 
   null, 
   1163118300.0
  ], 
  [
   238937, 
   null, 
   "VTCruiser", 
   "Much safer to say that there is no god.\n\n \n then why are you alive?", 
   {}, 
   238869, 
   null, 
   1163141340.0
  ], 
  [
   238947, 
   null, 
   "electrolyte", 
   "then why are you alive?\n\n To annoy people like you, of course.", 
   {}, 
   238937, 
   null, 
   1163144220.0
  ], 
  [
   238951, 
   null, 
   "obvious_child", 
   "then why are you alive?\n\n \n I find it sad that you derive all of the value in your life from God.", 
   {}, 
   238937, 
   null, 
   1163149080.0
  ], 
  [
   238965, 
   null, 
   "Adept", 
   "then why are you alive?\n\n \n Why not? It's fun.", 
   {}, 
   238937, 
   null, 
   1163170860.0
  ], 
  [
   238970, 
   null, 
   "trebor", 
   "then why are you alive?\n\n \n \n Obviously, since he said there is no god, and he is alive, then your thesis that a god is needed to be alive has been falisfied.", 
   {}, 
   238937, 
   null, 
   1163174460.0
  ], 
  [
   238978, 
   null, 
   "Iuris", 
   "You know, I'm always amazed these guys still haven't found out that the \"big bang\" is extremely similar to \"Let there be light\"...", 
   {}, 
   238970, 
   null, 
   1163179620.0
  ], 
  [
   238994, 
   null, 
   "pandion", 
   "You know, I'm always amazed these guys still haven't found out that the \"big bang\" is extremely similar to \"Let there be light\"...\nReally? How is that? Does that include quarks, leptons, and the strong, weak, and electromagnetic forces?", 
   {}, 
   238978, 
   null, 
   1163182620.0
  ], 
  [
   238995, 
   null, 
   "pandion", 
   "\"Safer?\"\n \n Not sure about that. More consistent, logical and reasonable, yes.\nYes. I was echoing VTCruiser's use of the word \"safe.\" I presumed that by \"safe\" he meant logically consistent and reasonable. Of course it isn't. What he is doing is trying to avoid an infinite regression of creators by declaring one of them eternal. Not very logical, expecially since the \"creator\" is an assumption in the first place.", 
   {}, 
   238875, 
   null, 
   1163183100.0
  ], 
  [
   238996, 
   null, 
   "pandion", 
   "then why are you alive?\nBecause I managed to survive my teen years and college without killing myself by any of my stupid stunts.\n \n Other than that, I don't see any connection of your attempt to avoid the infinite regression of creators to your question. Can you explain?", 
   {}, 
   238937, 
   null, 
   1163183400.0
  ], 
  [
   239045, 
   null, 
   "Hi_Its_Me", 
   "then why are you alive?\n\n There have already been many funny responses to this, and I can't come up with anything as good offhand. Good job to everyone else.\n \n \n \n I will give you a more accurate answer.\n \n There are two competing explanations for the existance of life: abiogenesis and religion. One has evidence and the other has faith. (If I ask supersport to say which is which, he will get it wrong.)\n Theism has no evidence outside of its claims (my signature), and abiogenesis is backed up by a combination of evidence, approximate age of life on earth (i.e. more evidence), and Occam's Razor.\n Here's a more detailed explanation:\n \n \n Abiogenesis is a process by which life is thought to have originated from nonliving chemicals. A simplified description (refrencing this page) is:\n Simple chemicals formed polymers, some of which became replicating polymers. These were stable, so once they were formed, they did not break apart like most formations in a randomly moving group of objects.\n These replicating polymers went through other steps and eventually formed a very simple lifeform.\n \n Evidence for abiogenesis includes the successful formation of amino acids under laboratory conditions and the evidence for a common origin of life.\n \n \n \n On the other hand, religion (fundamentalism, in particular) claims that a deity created all life on earth as is. It does not consider the posibility that life might not require a deity. It is assumed that because life exists (and is \"perfect\"), a deity must have created it.\n \n Fundamentalism does not take into account evidence such as the fossil record, the age of stars, or the processes which could easily explain the existance of things without assuming the existance and action of a deity.\n \n Evidence for fundamentalism includes the logical fallacy featured in my signature.", 
   {}, 
   238937, 
   null, 
   1163200740.0
  ], 
  [
   239255, 
   null, 
   "obvious_child", 
   "how did the moon, sun, earth, and stars come into existence??\n \n What brought you into existence?? Where does your next breath come from?\n \n what is the point of life if all you do is live then die??\n\n \n Only the naive think that the experienced can't see a God of the Gaps argument from a thousand miles.", 
   {}, 
   238663, 
   null, 
   1163314320.0
  ], 
  [
   239261, 
   null, 
   "VTCruiser", 
   "did you expect a creationists to understand logic?\n \n If God must exist because things need a origin, and if God doesn't need a origin it pains me that creationists can't understand the problem with that argument.\n\n \n God doesnt need things to exist, He creaed cause He wanted to.", 
   {}, 
   238853, 
   null, 
   1163315760.0
  ], 
  [
   239262, 
   null, 
   "VTCruiser", 
   "Yes. I was echoing VTCruiser's use of the word \"safe.\" I presumed that by \"safe\" he meant logically consistent and reasonable. Of course it isn't. What he is doing is trying to avoid an infinite regression of creators by declaring one of them eternal. Not very logical, expecially since the \"creator\" is an assumption in the first place.\n\n \n all you can do is believe in an assumption yourself... i believe in the truth which is what the Bible said what happened at the beginning.", 
   {}, 
   238995, 
   null, 
   1163315940.0
  ], 
  [
   239263, 
   null, 
   "VTCruiser", 
   "Only the naive think that the experienced can't see a God of the Gaps argument from a thousand miles.\n\n \n only the naive trust in their own wisdom that they create themselves.", 
   {}, 
   239255, 
   null, 
   1163316060.0
  ], 
  [
   239265, 
   null, 
   "electrolyte", 
   "did you expect a creationists to understand logic?\n \n If God must exist because things need a origin, and if God doesn't need a origin it pains me that creationists can't understand the problem with that argument.\nGod doesnt need things to exist, He creaed cause He wanted to.\n\n I'll say it for you, obvious_child: QED.", 
   {}, 
   239261, 
   null, 
   1163316840.0
  ], 
  [
   239269, 
   null, 
   "pandion", 
   "all you can do is believe in an assumption yourself... i believe in the truth which is what the Bible said what happened at the beginning.\nActually, I assume very little. On the other hand, you assume that you know the \"truth\" and you assume that the Bible tells you that truth. Sadly, what you see as truth is just the mythology of bronze age, nomadic herdsmen. Good for you.", 
   {}, 
   239262, 
   null, 
   1163325300.0
  ], 
  [
   239302, 
   null, 
   "trebor", 
   "all you can do is believe in an assumption yourself... i believe in the truth which is what the Bible said what happened at the beginning.\n\n \n \n That is, of course, despite all the evidence against it happening that way.\n \n I am partial to Brahma planting a seed in the womb of the water, myself.", 
   {}, 
   239262, 
   null, 
   1163351520.0
  ], 
  [
   239332, 
   null, 
   "VTCruiser", 
   "Actually, I assume very little. On the other hand, you assume that you know the \"truth\" and you assume that the Bible tells you that truth. Sadly, what you see as truth is just the mythology of bronze age, nomadic herdsmen. Good for you.\n\n \n think about this... you have a bellybutton. What does that mean.. you were connected to your mother. She had a belly button,, she was connected to her mother... and it goes on and on.. There has to be a starting point.. humans have not existed forever. so tell me how that happened.", 
   {}, 
   239269, 
   null, 
   1163356800.0
  ], 
  [
   239336, 
   null, 
   "Hi_Its_Me", 
   "think about this... you have a bellybutton. What does that mean.. you were connected to your mother. She had a belly button,, she was connected to her mother... and it goes on and on.. There has to be a starting point.. humans have not existed forever. so tell me how that happened.\n\n That is fairly adequately explained by the fossil record (whether or not the current ToE is taken into account).\n \n Whether or not natural selection was involved, there is plenty of evidence of evolution in some form going back a few billion years and originating with prokaryotic lifeforms. God is not the only explanation.", 
   {}, 
   239332, 
   null, 
   1163357040.0
  ], 
  [
   239360, 
   null, 
   "Collin", 
   "Notice that reptiles and amphibians, the ascendants of mammals, do not have belly buttons. Shocking? emoticon_xdonno No.", 
   {}, 
   239336, 
   null, 
   1163359200.0
  ], 
  [
   239365, 
   null, 
   "VTCruiser", 
   "That is fairly adequately explained by the fossil record (whether or not the current ToE is taken into account).\n \n Whether or not natural selection was involved, there is plenty of evidence of evolution in some form going back a few billion years and originating with prokaryotic lifeforms. God is not the only explanation.\n\n \n why is the scientific community moving away from this theory of evolution then?", 
   {}, 
   239336, 
   null, 
   1163360220.0
  ], 
  [
   239366, 
   null, 
   "VTCruiser", 
   "Notice that reptiles and amphibians, the ascendants of mammals, do not have belly buttons. Shocking? emoticon_xdonno No.\n\n \n chickens dont either... what is your point? Everything has to have a beginning point that someone decided to create. Tell me something that has happened that wasnt a result of someone creating it.", 
   {}, 
   239360, 
   null, 
   1163360400.0
  ], 
  [
   239370, 
   null, 
   "trebor", 
   "why is the scientific community moving away from this theory of evolution then?\n\n \n It isn't. That is just a lie some creationsist made up. The TOE is as strong as ever.", 
   {}, 
   239365, 
   null, 
   1163362140.0
  ], 
  [
   239379, 
   null, 
   "Hi_Its_Me", 
   "why is the scientific community moving away from this theory of evolution then?\n\n He aims, fires,emoticon_xkill misses the point entirely, and hits a passing strawman!\n \n \n I was saying that it was useless to attack Darwin or natural selection because the fossil record (and other sources) still unanimously point to the same descent from prokaryotic organisms. I was not saying that the ToE was invalid or even that it was in doubt.\n \n \nchickens dont either... what is your point? Everything has to have a beginning point that someone decided to create. Tell me something that has happened that wasnt a result of someone creating it.\n\n How about some clouds?\n Check out the whole page; it will be worth it.", 
   {}, 
   239365, 
   null, 
   1163368260.0
  ], 
  [
   239398, 
   null, 
   "obvious_child", 
   "God doesnt need things to exist, He creaed cause He wanted to.\n\n \n You really have no idea what a argument is?\n \n I do find it amusing you will lose every argument you get into with your significent other.", 
   {}, 
   239261, 
   null, 
   1163372880.0
  ], 
  [
   239399, 
   null, 
   "obvious_child", 
   "why is the scientific community moving away from this theory of evolution then?\n\n \n $2 billion dollars says you cannot prove this. \n \n http://www.talkorigins.org/indexcc/CA/CA111.html\n \n And you're wrong. \n \n The Steve List alone proves you're full of ****.", 
   {}, 
   239365, 
   null, 
   1163372940.0
  ], 
  [
   239853, 
   null, 
   "Ripskar", 
   "think about this... you have a bellybutton. What does that mean.. you were connected to your mother. She had a belly button,, she was connected to her mother... and it goes on and on.. There has to be a starting point.. humans have not existed forever. so tell me how that happened.\n\n \n The belly button is the remnant of the umbilical cord and as such is only found on mammals which use this method of developing their offspring.\n Duck Billed Platypus, Kangaroos and Koalas do not.\n However Chimps do demonstrating yet another aspect of our relationship to them.", 
   {}, 
   239332, 
   null, 
   1163606580.0
  ], 
  [
   239863, 
   null, 
   "Peeling", 
   "chickens dont either... what is your point? Everything has to have a beginning point that someone decided to create. Tell me something that has happened that wasnt a result of someone creating it.\n\n \n Well, according to you, god. :)", 
   {}, 
   239366, 
   null, 
   1163607660.0
  ], 
  [
   243156, 
   null, 
   "evolutions_fake", 
   "If God had an origin, then that origin would be God.... which means you would have to find that origin.\n \n so its safe to say that God has no origin...\n\n \n \n Thats right, God is actualy made up of immense energy (spirit force), and we all know that life wouldn't exist without energy (the E=mc² equation; Matter can be converted to energy and the other way too). God used his dynamic energy to create matter (earth, stars etc). \n \n God had no beginning, (just like there is no beginning or end to space, and there is no beggining or end to matter), he has just been in existance and will be forever. It is beyond our comprehension to understand.\n \n Refference:\n \n The Bible\n \n John 4:24 (God is a spirit)\n \n 1Timothy 1:17 (God lives forever)\n Psalm 90:2 (God has lived from time indefinite)\n Revelation 22:13 (God is the Alpha and the Omega, the first and the last, the beginning and the end)\n \n Isaiah 40:26 (Due to the abundance of Gods dynamic energy, he also being vigorous in power, everything exists, nothing is missing)", 
   {
    "post_info": {
     "post_title": "God The Source Of All Energy"
    }
   }, 
   238831, 
   null, 
   1166026020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  answer these questions", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9163-answer-these-questions.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9163, 
  "discussion_files": [
   [
    "16131.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9163-answer-these-questions-print.html"
   ], 
   [
    "16132.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9163-answer-these-questions-4-print.html"
   ], 
   [
    "16133.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9163-answer-these-questions-3-print.html"
   ], 
   [
    "16134.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9163-answer-these-questions-2-print.html"
   ]
  ], 
  "identifier": 9163
 }
]