[
 [
  [
   238942, 
   null, 
   "VTCruiser", 
   "how can family values shift in a nation withint 10 years?? 10 years ago america would have never thought they wouldve needed to put Marriage Ammendments on the ballot let alone have less than 60% of the people actually vote for it. ITs sad to see a nation degrade exponentially fast and not to mention the people's consciences getting seared at the same time.\n \n Its kinda like the germans after slow and steady progress of the nazi party changed the whole nation's perspective on the jews. people that were against the nazi party 5 years prior found themselves turning jews into concentration camps. i see a similar progression beginning in america to the point that this comment itself will be bashed by those on here whose conscience has been seared to the point that they think 2 men being married is ok. If everyone in the world was gay, the human race would become extinct.\n Edit/Delete Message Reply With Quote", 
   {
    "post_info": {
     "post_title": "Moral Degradation/Family Values degrading exponentially fast."
    }
   }, 
   null, 
   null, 
   1163142540.0
  ], 
  [
   238948, 
   null, 
   "jitobear", 
   "how can family values shift in a nation withint 10 years?? 10 years ago america would have never thought they wouldve needed to put Marriage Ammendments on the ballot let alone have less than 60% of the people actually vote for it. ITs sad to see a nation degrade exponentially fast and not to mention the people's consciences getting seared at the same time.\n \n Its kinda like the germans after slow and steady progress of the nazi party changed the whole nation's perspective on the jews. people that were against the nazi party 5 years prior found themselves turning jews into concentration camps. i see a similar progression beginning in america to the point that this comment itself will be bashed by those on here whose conscience has been seared to the point that they think 2 men being married is ok. If everyone in the world was gay, the human race would become extinct.\n Edit/Delete Message Reply With Quote\n\n \n Nobody is advocating that everyone be gay - only that there is fairness and equality for those who are. (And no saying they can marry someone they can't love or are attracted to is not fair or equal.)\n \n And it's rather interesting that you compare those who seek equality with an oppresor like the Nazi party. Just who is trying to hurt who in the gay marriage issue????\n \n You also seem to know very little about the history of anti-semitism in Germany.\n \n You can keep your \"family values\" away from me and my family. We don't include hate in our moral compass.", 
   {}, 
   238942, 
   null, 
   1163144460.0
  ], 
  [
   238949, 
   null, 
   "Matthew S", 
   "how can family values shift in a nation withint 10 years?? 10 years ago america would have never thought they wouldve needed to put Marriage Ammendments on the ballot let alone have less than 60% of the people actually vote for it. ITs sad to see a nation degrade exponentially fast and not to mention the people's consciences getting seared at the same time.\n \n Its kinda like the germans after slow and steady progress of the nazi party changed the whole nation's perspective on the jews. people that were against the nazi party 5 years prior found themselves turning jews into concentration camps. i see a similar progression beginning in america to the point that this comment itself will be bashed by those on here whose conscience has been seared to the point that they think 2 men being married is ok. If everyone in the world was gay, the human race would become extinct.\n Edit/Delete Message Reply With Quote\n\n \n \n \n So gay people, in your opinion, have no right to form the families of their choice? So you are defending the continued oppression of gay people?We are sick of conservative family types. We are tired of the closet. The phrase \"we are mad as hell and we are not going to take it any more\" applies. I see in your response the comming of the camps to lock and exterminate gay people. It is that type of thought, that jews were subhuman, that led to the final solution. As it is here with conservatives and religious right nuts, who believe gay people are sub human sickos in need of curing or killing.", 
   {}, 
   238942, 
   null, 
   1163148660.0
  ], 
  [
   238956, 
   null, 
   "gamehuis", 
   "If there actually was a separation of church and state in the US, gay marriage would not be a problem.\n \n The church is a 'private club' and as such can deny marrying someone if it's against their 'club rules', but the state should not recognise a marriage in church as legally binding. Only a marriage performed by a representative of the state should be recognised by the state.", 
   {}, 
   238949, 
   null, 
   1163158920.0
  ], 
  [
   238962, 
   null, 
   "Kronus", 
   "\n Its kinda like the germans after slow and steady progress of the nazi party changed the whole nation's perspective on the jews.\n\n \n And Godwin in one! VT loses.\n \n Sorry, but those are the rules...", 
   {}, 
   238942, 
   null, 
   1163168880.0
  ], 
  [
   238964, 
   null, 
   "Adept", 
   "family values\n\n \n Please give some examples of family values.\n \n Please explain why you think those examples are important and valuable.\n \n \nto see a nation degrade\n\n \n Please clarify what you mean here. To degrade, something must go from a higher state to a lower state. Please explain what higher state has been lost, and how it was higher, and what lower state we are heading to, and how that is lower.\n \n \nIf everyone in the world was gay, the human race would become extinct.\n\n \n Relevance?", 
   {}, 
   238942, 
   null, 
   1163170260.0
  ], 
  [
   239062, 
   null, 
   "joebrummer", 
   "While your scare tactics have been noted, I will only address the reality of what you have said.\n \n 10 years ago people were talking about same sex marriage, America has not degraded as you say, it is only your perception. I respect that is how you see it, but it is not reality.\n \n 10 years ago people were not talking about protecting marriage because they were too busy assuming that gays and lesbians were some hidden population like rats living in sewer. Americans have learned that gays and lesbians are not rats in a sewer, but their friends, family and neighbors. It change many minds to discover we are pretty much like the rest of you.\n \n I will agree this is just like the Germans, there is a slow movement out there to have gays and lesbians declared \"killable\". It starts the same as it did against the Jews, display gays as \"after the children\" or \"destroying society\". They same claims that were made by Hitler. \n \n Also the same as Hitler would be the claims that we are \"all\" diseased, living the \"same deathstyle\". Yes, You would be correct in saying this is a slow movement like the Nazi's but the victims are not who you think. The victims are gays and lesbians.\n \n The only solution to this problem will be standing up to them, nonviolently, relentlessly bringing the truth to vicitms of misinformation like you!", 
   {}, 
   238964, 
   null, 
   1163210220.0
  ], 
  [
   239109, 
   null, 
   "JakeCJB", 
   "Look at what happened in Canada...\n \n http://www.youtube.com/watch?v=nvl8PAzt194", 
   {}, 
   239062, 
   null, 
   1163231640.0
  ], 
  [
   239122, 
   null, 
   "jitobear", 
   "Look at what happened in Canada...\n \n http://www.youtube.com/watch?v=nvl8PAzt194\n\n \n Damn! Does this mean I should cancel my trip to Toronto in February. Heaven forbid I may have sex with a chicken, too!", 
   {}, 
   239109, 
   null, 
   1163260260.0
  ], 
  [
   239124, 
   null, 
   "Matthew S", 
   "Look at what happened in Canada...\n \n http://www.youtube.com/watch?v=nvl8PAzt194\n\n \n I just fell off my chair laughing.", 
   {}, 
   239109, 
   null, 
   1163262360.0
  ], 
  [
   239248, 
   null, 
   "VTCruiser", 
   "Nobody is advocating that everyone be gay - only that there is fairness and equality for those who are. (And no saying they can marry someone they can't love or are attracted to is not fair or equal.)\n \n And it's rather interesting that you compare those who seek equality with an oppresor like the Nazi party. Just who is trying to hurt who in the gay marriage issue????\n \n You also seem to know very little about the history of anti-semitism in Germany.\n \n You can keep your \"family values\" away from me and my family. We don't include hate in our moral compass.\n\n \n oh please dont give me that XXXX... its so great that you can try to turn that whole statement and point at me being at fault but that in and of itself shows you are at fault because you think that without your way the world would cease. Honestly, the world has lived without gay marriage its whole existence.... so why implement it now?? SHouldnt that say something about the human race when it steeps so low to want to call homosexuals married couples?", 
   {}, 
   238948, 
   null, 
   1163313000.0
  ], 
  [
   239249, 
   null, 
   "VTCruiser", 
   "So gay people, in your opinion, have no right to form the families of their choice? So you are defending the continued oppression of gay people?We are sick of conservative family types. We are tired of the closet. The phrase \"we are mad as hell and we are not going to take it any more\" applies. I see in your response the comming of the camps to lock and exterminate gay people. It is that type of thought, that jews were subhuman, that led to the final solution. As it is here with conservatives and religious right nuts, who believe gay people are sub human sickos in need of curing or killing.\n\n \n gay people cant have gay families because gay sex doesnt produce a kid... thats how family is started and thats how it keeps going.. nuff said..", 
   {}, 
   238949, 
   null, 
   1163313120.0
  ], 
  [
   239250, 
   null, 
   "VTCruiser", 
   "While your scare tactics have been noted, I will only address the reality of what you have said.\n \n 10 years ago people were talking about same sex marriage, America has not degraded as you say, it is only your perception. I respect that is how you see it, but it is not reality.\n \n 10 years ago people were not talking about protecting marriage because they were too busy assuming that gays and lesbians were some hidden population like rats living in sewer. Americans have learned that gays and lesbians are not rats in a sewer, but their friends, family and neighbors. It change many minds to discover we are pretty much like the rest of you.\n \n I will agree this is just like the Germans, there is a slow movement out there to have gays and lesbians declared \"killable\". It starts the same as it did against the Jews, display gays as \"after the children\" or \"destroying society\". They same claims that were made by Hitler. \n \n Also the same as Hitler would be the claims that we are \"all\" diseased, living the \"same deathstyle\". Yes, You would be correct in saying this is a slow movement like the Nazi's but the victims are not who you think. The victims are gays and lesbians.\n \n The only solution to this problem will be standing up to them, nonviolently, relentlessly bringing the truth to vicitms of misinformation like you!\n\n \n \n \n i will say that the only reason gay people are gay is because they go against whats right in their mind. Once they cross the line there aint no going back. its kinda like there is a law that says that it is unlawful to murder someone... If a nation doesnt deal with that it becomes the norm. take for instance abortion... Why is it legal that we are allowed to kill our own kids?? Wouldnt we have less of a problem if families were still together and husbands actually stuck to their wives instead of committing adultery?? if kids were actually obedient to their parents (mom and dad, not dad and dad) in a whole nation, wouldnt that be more beneficial to the whole to have a new generation grow into a caring family oriented one??? The reason we are dealing with homosexuals is because people who are tempted by it dont have the resolve to go against it. So heres to say that anyone can be a homosexual... you, and me... but the thing about it is... which is right? What keeps me from falling into that trap?? well, for one thing, it is the Gospel of God which frees us from lawlesness (which includes homosexuality, murder, anger, etc... read Romans 1:18-32 if you are interested in knowing what lawlessness truly is)", 
   {}, 
   239062, 
   null, 
   1163313840.0
  ], 
  [
   239274, 
   null, 
   "Matthew S", 
   "gay people cant have gay families because gay sex doesnt produce a kid... thats how family is started and thats how it keeps going.. nuff said..\n\n \n This is just your opinion. In my perfect world all men would be gay and all women lesbians. The lesbians would have the children and raise the girls and the men would raise the boys.", 
   {}, 
   239249, 
   null, 
   1163337660.0
  ], 
  [
   239276, 
   null, 
   "Matthew S", 
   "i will say that the only reason gay people are gay is because they go against whats right in their mind. Once they cross the line there aint no going back. its kinda like there is a law that says that it is unlawful to murder someone... If a nation doesnt deal with that it becomes the norm. take for instance abortion... Why is it legal that we are allowed to kill our own kids?? Wouldnt we have less of a problem if families were still together and husbands actually stuck to their wives instead of committing adultery?? if kids were actually obedient to their parents (mom and dad, not dad and dad) in a whole nation, wouldnt that be more beneficial to the whole to have a new generation grow into a caring family oriented one??? The reason we are dealing with homosexuals is because people who are tempted by it dont have the resolve to go against it. So heres to say that anyone can be a homosexual... you, and me... but the thing about it is... which is right? What keeps me from falling into that trap?? well, for one thing, it is the Gospel of God which frees us from lawlesness (which includes homosexuality, murder, anger, etc... read Romans 1:18-32 if you are interested in knowing what lawlessness truly is)\n\n \n \n Once again just your opinion. The bible is irrelivant in a secular society and Paul has nothing to say to me. Paul was a rabid mysongistic homophobe who did not know or meet Jesus. The christain reigion is Jesus based and not Paul based.", 
   {}, 
   239250, 
   null, 
   1163338200.0
  ], 
  [
   239281, 
   null, 
   "Adept", 
   "VTCruiser: Perhaps you could address the questions I asked you? I know I have no hope of changing your bigoted little mind, but perhaps your answers will be enough to convince neutral readers that your position is completely baseless.", 
   {}, 
   239276, 
   null, 
   1163340900.0
  ], 
  [
   239284, 
   null, 
   "jitobear", 
   "oh please dont give me that XXXX... its so great that you can try to turn that whole statement and point at me being at fault but that in and of itself shows you are at fault because you think that without your way the world would cease. \n \n \n I am not the one advocating that the world will cease - you did that. You know the whole \"if everyone were gay we wouldn't reproduce\" argument (becuse onviously gay is contagious - I mean I have close friends and family who are gay for the last 30 years - since I was about 7 or 8 years old - I am just waiting for it to happen to me - hasn't yet...) And you are ignoring the fact that lots of gay people have children - even biological ones. Justine, in this forum, for starters has a biological teen-age son who sounds like swell kid. My son (another swell kid), has an adopted gay dad - best man I have ever known. GREAT dad. \n \n \nHonestly, the world has lived without gay marriage its whole existence.... so why implement it now?? \n\n \n The world has also lived most of existence without cars, the computer in front of you, Levis jeans and Nike tennies - let's ban those, too.\n \n \nShouldnt that say something about the human race when it steeps so low to want to call homosexuals married couples?\n\n \n The stoop is when you want your personal bigotry justified and codified into law. It is also unspeakably cowardly.\n \n \ni will say that the only reason gay people are gay is because they go against whats right in their mind. \n\n \n I love how homophobic heterosexuals have some much intimate knowledge about why people are gay. \n \n \nOnce they cross the line there aint no going back. its kinda like there is a law that says that it is unlawful to murder someone... If a nation doesnt deal with that it becomes the norm.\n\n \n There are no more or less homosexuals than there ever were - they just don't hide anymore.\n \n \ntake for instance abortion... Why is it legal that we are allowed to kill our own kids?? Wouldnt we have less of a problem if families were still together and husbands actually stuck to their wives instead of committing adultery?? if kids were actually obedient to their parents (mom and dad, not dad and dad) in a whole nation, wouldnt that be more beneficial to the whole to have a new generation grow into a caring family oriented one??? \n\n \n How about a world of loving, open-hearted people who formed their own emotional bonds and who could live without the fear of hate and prejudice?\n \n \nThe reason we are dealing with homosexuals is because people who are tempted by it dont have the resolve to go against it. \n\n \n And those who attempt your resolve or curing or denial gernally end up miserable and suicidal.\n \n And does anyone else find the bolded a little bit 3rd Reichish? What exactly do you mean by \"dealing with homosexuals\" - what is implied here? What are you suggesting? \n \n \nSo heres to say that anyone can be a homosexual... you, and me... but the thing about it is... which is right? What keeps me from falling into that trap??\n\n \n It's not a trap - but what keeps you from being homosexual? I am going to go out on a limb here, but maybe the fact that you are STRAIGHT??? \n \n \nwell, for one thing, it is the Gospel of God which frees us from lawlesness (which includes homosexuality, murder, anger, etc... read Romans 1:18-32 if you are interested in knowing what lawlessness truly is)\n\n \n bla bla bla Welcome to America where I don't even have to pretend I give a damn about your Bible.\n \n \n Adept - I am pretty sure the already know.", 
   {}, 
   239248, 
   null, 
   1163345700.0
  ], 
  [
   239306, 
   null, 
   "VTCruiser", 
   "This is just your opinion. In my perfect world all men would be gay and all women lesbians. The lesbians would have the children and raise the girls and the men would raise the boys.\n\n \n if the whole world was gay, then how would it continue to exist if you cant produce children?", 
   {}, 
   239274, 
   null, 
   1163352480.0
  ], 
  [
   239307, 
   null, 
   "VTCruiser", 
   "Once again just your opinion. The bible is irrelivant in a secular society and Paul has nothing to say to me. Paul was a rabid mysongistic homophobe who did not know or meet Jesus. The christain reigion is Jesus based and not Paul based.\n\n \n you cant discredit something youve never read... countless times in Acts Paul describes seeing Jesus on the road to damascus... So He did meet Jesus, and all of HIs writings point to Jesus.", 
   {}, 
   239276, 
   null, 
   1163352660.0
  ], 
  [
   239310, 
   null, 
   "Adept", 
   "And still no answer.\n \n I am Joe's complete lack of surprise.\n \n Please address my points.\n \n \n Originally Posted by VTCruiser\n family values\n \n Please give some examples of family values.\n \n Please explain why you think those examples are important and valuable.\n \n Originally Posted by VTCruiser\n to see a nation degrade\n \n Please clarify what you mean here. To degrade, something must go from a higher state to a lower state. Please explain what higher state has been lost, and how it was higher, and what lower state we are heading to, and how that is lower.\n \n Originally Posted by VTCruiser\n If everyone in the world was gay, the human race would become extinct.\n \n Relevance?", 
   {}, 
   239307, 
   null, 
   1163353680.0
  ], 
  [
   239312, 
   null, 
   "VTCruiser", 
   "And still no answer.\n \n I am Joe's complete lack of surprise.\n \n Please address my points.\n \n \n Originally Posted by VTCruiser\n family values\n \n Please give some examples of family values.\n \n Please explain why you think those examples are important and valuable.\n \n Originally Posted by VTCruiser\n to see a nation degrade\n \n Please clarify what you mean here. To degrade, something must go from a higher state to a lower state. Please explain what higher state has been lost, and how it was higher, and what lower state we are heading to, and how that is lower.\n \n Originally Posted by VTCruiser\n If everyone in the world was gay, the human race would become extinct.\n \n Relevance?\n\n \n \n \n Family Values = 1 Dad, 1 Mom, kids\n the family never seperates and walks out life together.\n That is love... when people can love in the midst of trials and testings.\n \n \n America has the highest divorce rate in the world and thats why we are seeing such a degradation i believe. When people dont have 2 parents (mom and dad) growing up that can produce a lot of problems in terms of being offended deep in the heart producing a desire to rebel against what is right. For one instance, we wouldnt be struggling with homosexuality as a nation if families actually lived the way families should..\n \n thats like, half of what i would say because i dont have time to write you a novel.", 
   {}, 
   239310, 
   null, 
   1163354100.0
  ], 
  [
   239314, 
   null, 
   "VTCruiser", 
   "\n Originally Posted by VTCruiser\n If everyone in the world was gay, the human race would become extinct.\n \n Relevance?\n\n \n \n \n\n Originally Posted by Matthew S View Post\n This is just your opinion. In my perfect world all men would be gay and all women lesbians. The lesbians would have the children and raise the girls and the men would raise the boys.\n\n \n that is the relevance.... this guy thinks the world should all be gay. but if he was totally right then that would mean there would be no more humans after that generation because no babies can be formed as a result of gay sex... thats just point blank.", 
   {}, 
   239310, 
   null, 
   1163354400.0
  ], 
  [
   239316, 
   null, 
   "Adept", 
   "Family Values = 1 Dad, 1 Mom, kids\n\n \n Actually, no. Thats a list of family members\n \n \nthe family never seperates and walks out life together.\n\n \n Commitment?\n \n \nlove... when people can love in the midst of trials and testings.\n\n \n Dedication.\n \n Can you think of any more?\n \n \nAmerica has the highest divorce rate in the world and thats why we are seeing such a degradation i believe.\n\n \n Can you define what you mean by Degradation?\n \n \nWhen people dont have 2 parents (mom and dad) growing up that can produce a lot of problems in terms of being offended deep in the heart producing a desire to rebel against what is right.\n\n \n I agree that a stable and loving home is important for kids.\n \n Can you explain how the gender of the parents is relevant?\n \n Can you explain what is 'right'? And why?\n \n \nFor one instance, we wouldnt be struggling with homosexuality\n\n \n Why struggle?\n \n \nif families actually lived the way families should.\n\n \n If one was to suppose that were true, one would expect to see a large proportion of children from broken homes growing up to be gay. Can you show me any reliable studies that indicate this?\n \n \nthat is the relevance.... this guy thinks the world should all be gay. but if he was totally right then that would mean there would be no more humans after that generation because no babies can be formed as a result of gay sex... thats just point blank.\n\n \n Two points:\n \n 1 - Not all couples have children, or are even capable of having children.\n \n 2 - IVF treatments, surrogacy and sperm banks allow gay couples to create their own children.\n \n 3 - You believe that one of the reasons homosexuality is wrong is that the couples cannot naturally produce children.\n \n 4 - Therefore, you must also (logically) believe that all childless relationships are wrong, and should be illegal.\n \n 5 - Since gay couples can still produce children, you must (logically) be in favour of gay marriage in that regard, and oppose the marriage of (for example) women past the age of menopause, or infertile men.", 
   {}, 
   239312, 
   null, 
   1163354580.0
  ], 
  [
   239319, 
   null, 
   "VTCruiser", 
   "\n \n bla bla bla Welcome to America where I don't even have to pretend I give a damn about your Bible. \n\n \n \n Welcome to America where democracy only works when the people are opposing lawlessness and sin... since the 1950s there has been an exponential progression to kick God out of the land. Since that has happened, we now call killing babies lawful, divorce is all over the place, kids are shooting other kids in school, men are having \"sex\" with men, and the list goes on.\n \n dont be surprised that what you think is wrong now might not be wrong in 10 years and before you know it you will agree with it.\n \n That to me seems like a stupid way to live life.... without something firm to believe in and actually sticking to it when everyone else is moving along with the culture.", 
   {}, 
   239284, 
   null, 
   1163355180.0
  ], 
  [
   239322, 
   null, 
   "VTCruiser", 
   "by the way, 97% of all jewish marriages (people who obviously appose homosexuality) stay together their whole life. that should say something about what they believe to be right and wrong.", 
   {}, 
   239319, 
   null, 
   1163355540.0
  ], 
  [
   239324, 
   null, 
   "Adept", 
   "by the way, 97% of all jewish marriages (people who obviously appose homosexuality) stay together their whole life. that should say something about what they believe to be right and wrong.\n\n \n Source please?", 
   {}, 
   239322, 
   null, 
   1163355780.0
  ], 
  [
   239373, 
   null, 
   "jitobear", 
   "Welcome to America where democracy only works when the people are opposing lawlessness and sin... since the 1950s there has been an exponential progression to kick God out of the land. \n\n \n Actually it started when they wrote the consitution - you can practice your religion, but you can't make me do it or even give a flying monkeys XXX about it. \n \n \nSince that has happened, we now call killing babies lawful,\n \n \n Abortion happened looooong before Roe vs Wade.\n \n \ndivorce is all over the place, \n\n \n best thing that ever happened to my marriage - wished it had happened ten years sooner than it did to my parents' marriage - nothing like living in a war zone I tell ya\n \n \nkids are shooting other kids in school\n\n \n definately a problem - religion is not the reason tho. It has more to do with self esteem issues, bullying, belittling and degrading people - HEY - kind of like you do to homosexuals.\n \n \nmen are having \"sex\" with men, and the list goes on.\n\n \n This did not start after 1950 either. Go take a history class.\n \n \ndont be surprised that what you think is wrong now might not be wrong in 10 years and before you know it you will agree with it.\n\n \n Kind of how 10 years ago most people would never have agreed that it was OK for the government to infringe on privacy, blow off the rulings of the Geneva convention, or blatantly ignore the constitution and bill of rights - but now they willfully buy into Bush's fear-mongering and buy into it? You mean kind of like that?\n \n \nThat to me seems like a stupid way to live life.... without something firm to believe in and actually sticking to it when everyone else is moving along with the culture.\n\n \n FALLACY ALERT: Not believing what you believe does not mean the individual doesn't believe in anything at all.", 
   {}, 
   239319, 
   null, 
   1163364540.0
  ], 
  [
   239390, 
   null, 
   "Shooterandproud", 
   "Guys, don't rag on him. He is just ignorant, they were saying the exact same thing about black people 50 years ago. It'll pass.", 
   {}, 
   239276, 
   null, 
   1163371860.0
  ], 
  [
   239422, 
   null, 
   "gaetano", 
   "by the way, 97% of all jewish marriages (people who obviously appose homosexuality) stay together their whole life. that should say something about what they believe to be right and wrong.\n\n \n \n \n \n \n \n \n They believe Judaism to be right, do you? Are you willing to convert to Judaism in order to be a part of a 97% lifetime marriage statistic? If your staistic of 97% has any validity there would have to be a correlation between marital longevity and relgious belief, which does not recognize Jesus as Lord and/or Messiah. That is right for Jewish people, but wrong for Christians. So there we have it in a nutshell. Right and wrong are interchangeable depending upon your religious beliefs. Therefore the only things that are morally and/or ethically \"right\" in a diversified world is tolerance and respect. Those two things in my opinion are the Gods that no one single group or nation has ever been able to make a commitment to, or have complete or utter faith in. Why? Because it requires true love and constant sacrifice from all of us in order to make it work. It means giving far beyond what is suggested or recommended through religious dogma. It means believeing that we are bound to one another by the \"human condition\", as oppossed to believing we are unique, special, or \"right\" because of national origin, race, sexual orientation, or religious beliefs.", 
   {}, 
   239322, 
   null, 
   1163377440.0
  ], 
  [
   239431, 
   null, 
   "Matthew S", 
   "that is the relevance.... this guy thinks the world should all be gay. but if he was totally right then that would mean there would be no more humans after that generation because no babies can be formed as a result of gay sex... thats just point blank.\n\n \n What part of a lesbian and a gay man getting together through atificial insemenation do you not understand? The male couple would raise the males the females would raise the females.", 
   {}, 
   239314, 
   null, 
   1163379900.0
  ], 
  [
   239629, 
   null, 
   "Shooterandproud", 
   "by the way, 97% of all jewish marriages (people who obviously appose homosexuality) stay together their whole life. that should say something about what they believe to be right and wrong.\n\n \n So just because they got a good marrige they are all of a sudden infallible?!?!?", 
   {}, 
   239322, 
   null, 
   1163482200.0
  ], 
  [
   239673, 
   null, 
   "Matthew S", 
   "Better no family values then republican, conservative, family values.\n Better no religion then religious right christianity, or fundementalism.\n Better anarchy then slavery.\n Better free for all then oppression.", 
   {}, 
   238942, 
   null, 
   1163518140.0
  ], 
  [
   239681, 
   null, 
   "georged", 
   "Guys, don't rag on him. He is just ignorant, they were saying the exact same thing about black people 50 years ago. It'll pass.\n\n \n He's about the sixth person on this forum I've heard drone on with the same words, same scripture quotes instead of answers and same desire to return to the US 1950s Ozzie & Harriet facade. Must be somebody out there providing forum scripts.", 
   {}, 
   239390, 
   null, 
   1163521320.0
  ], 
  [
   240168, 
   null, 
   "pappillion001", 
   "you cant discredit something youve never read... countless times in Acts Paul describes seeing Jesus on the road to damascus... So He did meet Jesus, and all of HIs writings point to Jesus.\n\n \n I have read the Bible. I wouldn't say countless times Paul saw Jesus. Actually he didn't see Jesus, He saw a light, but not Jesus. \n \n No one person has done more to change the laws given by God than Paul. Jesus never said half the changes that came about as a result of Paul's efforts. For someone whose profession was to persucute Christians I think he did a pretty good job. \n \n But your more interested in being right than relly caring about facts. Homosexuality has been around before Moses. Somehow it survived the Flood and every other disaster God has rained down on them and anybody within a planets distance. \n \n Your argument has no thought behind it. Makes no sense in the world most of us live in. Why don't you go sit down on your porch, ponder about life the universe all things living and have a coke and a smile or keep getting your kicks out of going out of your way to pis& on someone else's rainbowemoticon_xbye emoticon_xgood", 
   {}, 
   239307, 
   null, 
   1163744940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Moral Degradation/Family Values degrading exponentially fast.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9171-moral-degradation-family-values-degrading-exponentially-fast.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9171, 
  "discussion_files": [
   [
    "14761.html", 
    "http://www.4forums.com/political/gay-rights-debates/9171-moral-degradation-family-values-degrading-exponentially-fast-print.html"
   ], 
   [
    "14762.html", 
    "http://www.4forums.com/political/gay-rights-debates/9171-moral-degradation-family-values-degrading-exponentially-fast-3-print.html"
   ], 
   [
    "14763.html", 
    "http://www.4forums.com/political/gay-rights-debates/9171-moral-degradation-family-values-degrading-exponentially-fast-2-print.html"
   ]
  ], 
  "identifier": 9171
 }
]