[
 [
  [
   239116, 
   null, 
   "johnhanks", 
   "I refer to a study entitled \"Cross-National Correlations of Quantifiable Societal Health with Popular Religiosity and Secularism in the Prosperous Democracies,\" carried out by Gregory S. Paul and published in the Journal of Religion and Society, as quoted in Skeptic magazine.\n \n In brief, the research finds positive correlation between national religiosity and incidence of homicide, teenage pregnancy and abortion (see attached graphs). Percentage of population accepting the theory of evolution shows a negative correlation with homicide rate (the others aren't graphed, but would also show negative correlation.)\n \n We are all well aware that correlation isn't causation, and I don't think the author or anyone else is claiming that high levels of religiosity necessarily cause social dysfunction. It may be that inherently dysfunctional societies are more driven to religiosity; it may be that both are manifestations of some deeper aspect of the society's structure. Either way, what this and similar studies do achieve is to pull the rug from under evangelical christians' railing against the evils of secularism and the awful consequences of teaching children about evolution. As the Skeptic article concludes,\n \nWhat we can be clear about from this study is that highly religious societies can be dysfunctional, whereas by comparison secular societies in which evolution is largely accepted display real social cohesion and societal well-being.\n", 
   {
    "post_info": {
     "attachments": 3, 
     "post_title": "Positive correlation between religiosity and social dysfunction"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1163256660.0
  ], 
  [
   239126, 
   null, 
   "simone", 
   "Too cool, JH! Bravo!!!! emoticon_xhoho", 
   {}, 
   239116, 
   null, 
   1163264760.0
  ], 
  [
   239138, 
   null, 
   "jyoshu", 
   "Either way, what this and similar studies do achieve is to pull the rug from under evangelical christians' railing against the evils of secularism and the awful consequences of teaching children about evolution. As the Skeptic article concludes,\n\n \n The funny thing about this is that I don't think I've EVER heard anyone claim that teaching children about or adhering to evolution would cause someone to be dysfunctional! I'd love to see some examples of that claim.\n \n I think this article misses the big picture about religion. In these societies that are \"dysfunctional\", they are probably more religious because religion has been turned to in that society to help deal with the disfunctionality. And John did bring up the possibilty that \"It may be that inherently dysfunctional societies are more driven to religiosity\", to his credit. \n \n Furthermore, other huge problems here include the fact that they left out some very key issues in terms \"dysfunctions\" such as divorce rates, obesity, overall health, poverty/standard of living, among many others. (And that doesn't even include issues that religion sometimes views as dysfunctional such as homosexuality.) So it's not like their findings are comprehensive enough to prove anything. Religiosity was defined as \"biblical literalism, frequency of prayer and service attendance, as well as absolute belief in a creator in terms of ardency, conservatism, and activities.\" I'd be curious as to why they chose THAT as their defining factors for religiosity--which should be much broader is scope.\n \n But hey, the article certainly got Simone's make-religion-look-bad seal of approval! emoticon_xgood emoticon_xangel", 
   {}, 
   239116, 
   null, 
   1163271660.0
  ], 
  [
   239140, 
   null, 
   "simone", 
   "Well! If religionists would behave themselves and not act so perverted, I would not have one word to say.\n \n Clean thy own houses first before thou snoopeth into the houses of others.", 
   {}, 
   239138, 
   null, 
   1163272740.0
  ], 
  [
   239146, 
   null, 
   "trebor", 
   "The funny thing about this is that I don't think I've EVER heard anyone claim that teaching children about or adhering to evolution would cause someone to be dysfunctional! I'd love to see some examples of that claim.\n \n \n\n \n How about claims that evolution is evil, because 'accepting evolution is rejecting god'??", 
   {}, 
   239138, 
   null, 
   1163274960.0
  ], 
  [
   239147, 
   null, 
   "electrolyte", 
   "This study created some hubbub here in a previous thread.", 
   {}, 
   239140, 
   null, 
   1163275320.0
  ], 
  [
   239148, 
   null, 
   "jyoshu", 
   "How about claims that evolution is evil, because 'accepting evolution is rejecting god'??\n\n \n Well sure, there are religious people that don't believe evolution is right (though I don't know that I've ever heard anyone use the term \"evil\" in regards to it). But John's statement was \"what this and similar studies do achieve is to pull the rug from under evangelical christians' railing against ... the awful consequences of teaching children about evolution.\"", 
   {}, 
   239146, 
   null, 
   1163277000.0
  ], 
  [
   239152, 
   null, 
   "electrolyte", 
   "The funny thing about this is that I don't think I've EVER heard anyone claim that teaching children about or adhering to evolution would cause someone to be dysfunctional! I'd love to see some examples of that claim.\n\n Well, it depends what you mean by \"dysfunctional,\" but if you're adhering to what Paul's study means, try a search for posts by marc9000 in the evolution forum...", 
   {}, 
   239138, 
   null, 
   1163279100.0
  ], 
  [
   239160, 
   null, 
   "Ripskar", 
   "Well sure, there are religious people that don't believe evolution is right (though I don't know that I've ever heard anyone use the term \"evil\" in regards to it).\n\n \n Marc9000 has in the CvsE forum. Of course how much weight you give to his ravings is entirely your own decision.", 
   {}, 
   239148, 
   null, 
   1163288340.0
  ], 
  [
   239173, 
   null, 
   "trebor", 
   "Well sure, there are religious people that don't believe evolution is right (though I don't know that I've ever heard anyone use the term \"evil\" in regards to it). But John's statement was \"what this and similar studies do achieve is to pull the rug from under evangelical christians' railing against ... the awful consequences of teaching children about evolution.\"\n\n \n Well , Marc has in the evolution/creation, and for your purusal, I have the following link\n \n http://www.jesus-is-savior.com/Family/public_schools_are_evil.htm", 
   {}, 
   239148, 
   null, 
   1163294760.0
  ], 
  [
   239234, 
   null, 
   "Hi_Its_Me", 
   "Well , Marc has in the evolution/creation, and for your purusal, I have the following link\n \n http://www.jesus-is-savior.com/Family/public_schools_are_evil.htm\n\n Fun site. I found a, well, interesting (funny) set of articles on it...\n Taking a look at the top few links, I found stuff like, \"Evolution makes no sense at all. I just don't see how any intelligent person could believe such nonsense. I mean, have you ever seen an ape that could be taught to do algebra? No!\n [...]\n Where are all those half man/half ape fossils which should be abundant in the earth's soil layers? They don't exist.\n [...]\n Notice that I didn't call them \"scientists\" because there is NOTHING scientific about evolution.\n [...]\n Do you realize that evolutionists CANNOT display even ONE single proof of evolution...NOT ONE!\"Note the willful ignorance of the facts.\n \n \n Another one I found says:\"I frequently receive e-mails from evolutionists who accuse me of being ignorant of science. The absurdity of their accusations rests in the FACT that evolution is NOT based upon science, but rather upon unproven speculations.\n [...]\n Evolution is a THEORY, not science. The reason why evolution is only a theory is simply because no one can prove that it ever happened.\n [...]\n The evolutionists teach that a giraffe has a long neck because it \"evolved\" over millions of years as a result of the animal trying to reach the food high up in the trees with it's mouth. Evolutionists teach that the animal's neck grew as a means of survival.\n [...]\n Why would only the giraffe have had a need to reach the trees for food? This question alone nullifies the entire idea of the survival of the fittest.\n [...]\n Evolution CANNOT be repeated, CANNOT be tested, CANNOT be observed, Cannot be studied...it is NOT science.\n \n [and here comes the best part]\n \n God's creation is able to be studied, it is science.\"Note the strawman (Lamarckism), the misinterpretation of the term, \"scientific theory,\" and the claim that the ToE lacks evidence.\n \n \n Finally, I found one which made a big mistake:\"I challenge you to do a web search under \"evolution proof\" and see what comes up.\"\n Some sites on Google:\n http://www.mala.bc.ca/~johnstoi/essays/courtenay1.htm\n http://www.talkorigins.org/indexcc/CA/CA202.html\n http://news.nationalgeographic.com/news/2006/03/0308_060308_evolution.html\n \n I might, for fun, just take random articles from this site and refute them.\n Can anyone think of a good place to post such refutations?", 
   {}, 
   239173, 
   null, 
   1163309760.0
  ], 
  [
   239272, 
   null, 
   "johnhanks", 
   "The funny thing about this is that I don't think I've EVER heard anyone claim that teaching children about or adhering to evolution would cause someone to be dysfunctional! I'd love to see some examples of that claim.\n\n I've seen it quite often: most recently a quote from a woman who didn't want medical students taught evolutionary theory, as she 'didn't want her life in the hands of someone who thought she was descended from a monkey'. \n Sometimes the claim is toned down a bit. This is from AIG:\n \nThe charge is that we are claiming evolution causes immoral behaviour, holocausts, and the like. Is this AiG's stance? Do we think evolution causes such things? Not directly; sin is of course responsible. But evolutionary thought permeating a culture will inevitably lead to a magnification of the effects of sin in one form or another. For one thing, it weakens the shared cultural restraints that arise out of a commonly adhered-to basis for morality...\n All this does not deny the possibility of moral behaviour by evolutionists or amoral behaviour by Christians. But because amorality is logically consistent with evolution, and inconsistent with biblical Christianity, an evolutionary worldview gives a much more fertile ground for the exhibition of the sin nature in all its aspects.\n\n My emphasis, of course; but the bolded statement is precisely the kind of claim that Paul's study contradicts.\n \n The Home School Legal defence Association pulls its punches rather less:\n \nParents, if you want your children to behave like animals, put them in a school system that teaches them evolution. Right and wrong will confuse them for a while, but eventually, when they have had time to let it sink in-maybe when they are teaching biology at the University of New Mexico-they will realize that all value judgments are indefensible and all behavior has its roots in our animal \"foreparents.\" Rape is simply an evolutionary force telling a man he needs to reproduce.\n If, however, you want your children to believe that rape, racism and murder are always wrong-even when committed on a high school campus-keep them away from schools that teach evolution, lest they follow this theory to its logical anti-social conclusion.\n\n Rape seems to be the offence which evolution's opponents most frequently accuse it of promoting. Paul's study does not include incidence of rape, and comparative statistics are hard to find. Japan, however, which has the lowest level of belief in god and the highest acceptance of evolution, has an unusually low incidence of rape (2.4 per 100,000, compared to 34.5 per 100,000 in the U.S.).\n http://www.sexwork.com/coalition/lesscrime.html", 
   {
    "unicode_changes_made": true
   }, 
   239138, 
   null, 
   1163329680.0
  ], 
  [
   239275, 
   null, 
   "Bradamante", 
   "This study created some hubbub here in a previous thread.\n\n \n I was part of that other thread. It seems worth noting again that the author of this study, Gregory S. Paul, is a \" freelance paleontologist, author and illustrator\"\n http://en.wikipedia.org/wiki/Gregory_S._Paul\n \n Only this time round it's JohnHanks pretending to have discovered this study - he took part in that other debate too, which he gives no reference to in this.", 
   {}, 
   239147, 
   null, 
   1163338140.0
  ], 
  [
   239323, 
   null, 
   "electrolyte", 
   "It seems worth noting again that the author of this study, Gregory S. Paul, is a \" freelance paleontologist, author and illustrator\"\n\n Note all you want. This claim had the rug pulled out from under it repeatedly in the other thread.", 
   {}, 
   239275, 
   null, 
   1163355780.0
  ], 
  [
   239483, 
   null, 
   "johnhanks", 
   "I was part of that other thread. It seems worth noting again that the author of this study, Gregory S. Paul, is a \" freelance paleontologist, author and illustrator\"\n http://en.wikipedia.org/wiki/Gregory_S._Paul\n \n Only this time round it's JohnHanks pretending to have discovered this study - he took part in that other debate too, which he gives no reference to in this.\n\n No pretence involved. What I now realise was the same study as the subject of my OP formed only one component of the thread electrolyte referred to, and it was not a component I got involved in: if you look back, you will see the debate about Paul's study was mainly between you and electrolyte, with thelmoose, georged and EF contributing. I paid it only passing attention at the time, which is why when I came across the Skeptic article cited above I failed to notice it was ground already well trodden on this forum.\n \n As to your slur on my honesty, I can't imagine what (apart from egg on my face) you think I could hope to gain by 'pretending to have discovered' the research.\n \n To everyone else here, apologies for generating a red herring. Must try harder.", 
   {}, 
   239275, 
   null, 
   1163393460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Positive correlation between religiosity and social dysfunction", 
  "url": "http://www.4forums.com/political/religion-debates/9176-positive-correlation-between-religiosity-social-dysfunction.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9176, 
  "discussion_files": [
   [
    "2364.html", 
    "http://www.4forums.com/political/religion-debates/9176-positive-correlation-between-religiosity-social-dysfunction-print.html"
   ]
  ], 
  "identifier": 9176
 }
]