[
 [
  [
   239654, 
   null, 
   "VTCruiser", 
   "the child in the womb feels pain..\n \n when you put the needle up there to try to give the child anestesia in the womb, the child moves away to not get stuck by the needle. Its because it feels pain.. this is after 18 weeks.\n \n this is a child in the womb..", 
   {
    "post_info": {
     "post_title": "pain"
    }
   }, 
   null, 
   null, 
   1163490360.0
  ], 
  [
   239660, 
   null, 
   "Adept", 
   "the child in the womb feels pain..\n \n when you put the needle up there to try to give the child anestesia in the womb, the child moves away to not get stuck by the needle. Its because it feels pain.. this is after 18 weeks.\n \n this is a child in the womb..\n\n \n So what?\n \n Why should the woman be forced to care for this child against her will?", 
   {}, 
   239654, 
   null, 
   1163491980.0
  ], 
  [
   239706, 
   null, 
   "sinjin", 
   "the child in the womb feels pain..\n \n when you put the needle up there to try to give the child anestesia in the womb, the child moves away to not get stuck by the needle. Its because it feels pain.. this is after 18 weeks.\n \n this is a child in the womb..\nThe woman drinks fruit juice and the baby moves like crazy.\n \n This is a dancer in the womb...", 
   {}, 
   239654, 
   null, 
   1163526780.0
  ], 
  [
   239778, 
   null, 
   "sodapop", 
   "just because a baby (if that) feels a small amount of pain for a short second should that mean that a woman who has been raped or somthing should be forced to have the baby?", 
   {
    "post_info": {
     "post_title": "i agree"
    }
   }, 
   239654, 
   null, 
   1163548380.0
  ], 
  [
   239872, 
   null, 
   "jim's trucking", 
   "the child in the womb feels pain..\n \n when you put the needle up there to try to give the child anestesia in the womb, the child moves away to not get stuck by the needle. Its because it feels pain.. this is after 18 weeks.\n \n this is a child in the womb..\n\n \n the cricket in the pliers feels pain...\n When you start to squeeze a cricket with a pair of pliers, it starts to wiggle and tries to get away so as not to get crushed by the pliers. Is it because the cricket feels pain?", 
   {
    "post_info": {
     "post_title": "the cricket in the pliers feels pain..."
    }
   }, 
   239654, 
   null, 
   1163612160.0
  ], 
  [
   239881, 
   null, 
   "wvpeach1963", 
   "all lving flesh feels pain, even bacteria will move away from being proded under a microscope.\n \n Its the soul thats important.", 
   {}, 
   239872, 
   null, 
   1163616720.0
  ], 
  [
   239885, 
   null, 
   "jim's trucking", 
   "all lving flesh feels pain, even bacteria will move away from being proded under a microscope.\n \n Its the soul thats important.\nWrong again. A nervous system is required in order to feel pain. Many species of living-flesh animals have no nervous system and cannot feel pain of any description...crickets included.\n \n I do not know at what point the nervous system in a fetus is developed enough to transmit pain signals.", 
   {}, 
   239881, 
   null, 
   1163617680.0
  ], 
  [
   247850, 
   null, 
   "paw_x", 
   "the child in the womb feels pain..\n \n when you put the needle up there to try to give the child anestesia in the womb, the child moves away to not get stuck by the needle. Its because it feels pain.. this is after 18 weeks.\n \n this is a child in the womb..\n\n \n The VAST majority of abortions are performed within the first trimester. When they are performed in the second trimester it's a serious procedure for the mother to go through, and is something she obviously wouldn't go into lightly. Her reasons for choosing an abortion as late as that would have to far outweigh anything else, and she would need consent from two doctors to go ahead with it. Basically what I'm trying to say is something like the foetus being developed enough to feel pain would not change the mind of a woman who had just found out she was pregnant and she'd been raped, or was going through something you can't understand. For an abortion that late she'd have to deliver the foetus anyway, which is traumatising enough. ", 
   {}, 
   239654, 
   null, 
   1169243760.0
  ], 
  [
   248228, 
   null, 
   "gman", 
   "This thread has established the cold disregard for undeserved pain and death inflicted upon what would be a child created by the irresponsible acts of humans. \n In the name of caring for the rights of humans. Which exposes the argument of \"in the name of someone's rights\" a sham. As rights of only one of two are being considered.", 
   {}, 
   247850, 
   null, 
   1169589420.0
  ], 
  [
   248310, 
   null, 
   "Another opinion", 
   "the child in the womb feels pain..\n \n when you put the needle up there to try to give the child anestesia in the womb, the child moves away to not get stuck by the needle. Its because it feels pain.. this is after 18 weeks.\n \n this is a child in the womb..\n\n Most scientists agree that there needs to be a sufficiently developed cerebral cortex in order for pain to be registered as such. The cerebral cortex is not sufficiently developed enough in the fetus to feel pain until roughly the start of the third trimester. Otherwise, the movements of an early fetus or embryo away from a stimulus are simply reflex action. Those of you who might have disected a frog in biology class in High School might have experienced it yourself when seeing the leg of a newly dead frog move under stimulus. For the novice, it may appear to be a reaction to a felt pain but it is not.\n \n Here is one link to a comprehensive study on fetal pain made by the American Medical Association:\n http://jama.ama-assn.org/cgi/content/short/294/8/947", 
   {}, 
   239654, 
   null, 
   1169658360.0
  ], 
  [
   248385, 
   null, 
   "Shooterandproud", 
   "the cricket in the pliers feels pain...\n When you start to squeeze a cricket with a pair of pliers, it starts to wiggle and tries to get away so as not to get crushed by the pliers. Is it because the cricket feels pain?\n\n \n If you feed me a lot of caffinated coffee i start to wiggle and squirm too. I'm not really in any pain.", 
   {}, 
   239872, 
   null, 
   1169707260.0
  ], 
  [
   248386, 
   null, 
   "Shooterandproud", 
   "This thread has established the cold disregard for undeserved pain and death inflicted upon what would be a child created by the irresponsible acts of humans. \n In the name of caring for the rights of humans. Which exposes the argument of \"in the name of someone's rights\" a sham. As rights of only one of two are being considered.\n\n \n What about the pain and death inflicted upon the innocent women and girls forced to give birth? Have you no regard for them?", 
   {}, 
   248228, 
   null, 
   1169707440.0
  ], 
  [
   248418, 
   null, 
   "jitobear", 
   "As rights of only one of two are being considered.\n\n \n When the needs of the two are in conflict this is unavoidable.", 
   {}, 
   248228, 
   null, 
   1169755200.0
  ], 
  [
   249437, 
   null, 
   "debategirl", 
   "When the needs of the two are in conflict this is unavoidable.\n\n \n It is so the womans decision. If the baby is in the womb they haven't experience life, so how can they miss it. And if they are a so called \"soul\" then they will come out somewhere else.", 
   {}, 
   248418, 
   null, 
   1170481380.0
  ], 
  [
   249468, 
   null, 
   "jitobear", 
   "It is so the womans decision. If the baby is in the womb they haven't experience life, so how can they miss it. And if they are a so called \"soul\" then they will come out somewhere else.\n\n \n I am pro-choice. I am just saying that in the case of pregnancy, when the needs of the mother and fetus are in conflice it is unavoidable that only one the two can be considered/prevail. \n \n Plus, technically, a fetus has no legal rights in and of itself - but that's a legal argument.", 
   {}, 
   249437, 
   null, 
   1170530160.0
  ], 
  [
   249480, 
   null, 
   "maximus", 
   "Most scientists agree that there needs to be a sufficiently developed cerebral cortex in order for pain to be registered as such. The cerebral cortex is not sufficiently developed enough in the fetus to feel pain until roughly the start of the third trimester. Otherwise, the movements of an early fetus or embryo away from a stimulus are simply reflex action. Those of you who might have disected a frog in biology class in High School might have experienced it yourself when seeing the leg of a newly dead frog move under stimulus. For the novice, it may appear to be a reaction to a felt pain but it is not.\n \n Here is one link to a comprehensive study on fetal pain made by the American Medical Association:\n http://jama.ama-assn.org/cgi/content/short/294/8/947\n\n \n GULLIBLE TREATMENT OF TRUMPED UP \"STUDY\" ON FETAL PAIN ISSUE SHOULD EMBARRASS J.A.M.A. AND SOME JOURNALISTS\n \n This memo offers a number of points of information regarding the article \"Fetal Pain: A Systematic Multidisciplinary Review of the Evidence,\" published in the August 24 edition of the Journal of the American Medical Association (JAMA). Any of the material below, if not otherwise attributed, can be attributed to NRLC Legislative Director Douglas Johnson (Legfederal@aol.com), who prepared this memorandum.\n \n See this here: \n http://www.nrlc.org/abortion/Fetal_P...uttalJAMA.html\n \n The following excerpt is from:\n http://abort73.com/HTML/I-A-2a-pain.html\n \n \"Sir Albert Lilley, widely considered the \"Father of Fetology\", and unabashedly pro-life (as anyone with his vast knowledge of fetal development should be) makes some remarkable statements about fetal pain in an interview he conducted for the book The Tiniest Humans.\n \n Question: In the case of an 8- to-10-week fetus, if you apply pressure will it tend to try to get out of the way?\n \n Answer: Normally it would be extremely difficult, apart from putting a foreign instrument or needle into the uterus to apply pressure, but with a fetus at that maturity you have a very small fetus in a larger capsule of fluid. However, as the famous work of Dr. Davenport Hooker shows, in his many thousands of feet of film, babies at this maturity are responsive to touch.\n \n The fetus also responds violently to painful stimuli-needle puncture and injection of cold or of hypertonic solutions- stimuli which you and I find painful, children will tell you are painful, and the neonate, to judge from his responses, finds painful.\n ---\n I have been told by advocates of abortion that we have no proof that the fetus actually feels pain. Strictly, they are quite correct. Pain is a peculiarly personal and subjective experience and there is no biochemical or physiological test we can do to tell that anyone is in pain - a phenomenon which makes it very easy to bear other people's pain stoically, which is an important point for obstetricians to remember. By the same token we lack any proof that animals feel pain. However, to judge from their responses, it seems charitable to assume they do. Were this not so there would be no point in having an organization like the Society for Prevention of Cruelty to Animals, and I for one would be unhappy to think we would withhold from the human fetus a charitable consideration we were prepared to extend to animals.\n \n Question: The question, then, of pain felt by the fetus - it is your personal opinion, I gather from what you say in your paper, that in effect the fetus does feel pain?\n \n Answer: I can only say that the fetus responds violently to stimuli that you and I would find painful. Bertrand Russell once remarked that a fisherman had told him that fish had neither sense or sensation, but how he knew that the fisherman would not tell him.\"\n \n The following excerpt is from:\n http://www.theinterim.com/2000/nov/21fetalpain.html\n \n \"Dr. Glover's research in the area of fetal pain is hardly groundbreaking. Sir Albert W. Liley, the pre-eminent fetologist from New Zealand, had no doubt, on the basis of objective evidence, that the fetus has a capacity to feel pain. In 1963, Dr. Liley, the founder of fetology, developed the first surgical technique for administering intrauterine blood transfusions to the fetus. According to Liley, the fetus feels pain as early as three months. In offering instructions for carrying out the surgical technique of fetal blood transfusions, he advised his colleagues to take into serious consideration this fact of fetal pain. During the actual surgical procedure, the child must be sedated and given pain-relieving medication. Dr. Margaret Liley, wife and assistant to her husband, and a distinguished fetologist and pediatrician in her own right, remarks in her well-known book, Modern Motherhood: \n When doctors first began invading the sanctuary of the womb, they did not know that the unborn baby would react to pain in the same fashion as a child would. But they soon learned that he would. By no means a 'vegetable' as he has so often been pictured, the unborn knows perfectly well when he has been hurt, and he will protest it just as violently as would a baby in a crib. \n \n In referring to aborting a 12-week-old fetus by dilatation and curettage, (in which the neck of the womb is dilated and the fetus removed in pieces after the womb has been scraped by a sharp instrument called a curette), Dr. Eugene Diamond stated in 1971: \"When this procedure is done, there is little doubt that the fetus, in fact, feels what is done to it.\" In a comprehensive treatment of fetal pain, published in 1985 in the New England Journal of Medicine, Dr. K. Annand, a Harvard physiologist, stated that the fetus first perceives pain as early as 12 weeks. \n \n In a May 1975 piece in Atlantic, Willard Gaylin and Marc Lappe argue for fetal experimentation, which they contend is far less traumatic for the unborn than certain forms of abortion. If society allows a child in the womb to be subjected to \"unimaginable acts of violence,\" they write, such as \"dismemberment, salt-induced osmotic shock, or surgical extirpation,\" how can it balk at fetal experimentation, most forms of which are incomparably more benign. \n \n Fetal pain, of course, is a matter of fact, not ideology. Science, of course, should be based on fact, not political correctness. We live in a Therapeutic Culture in which popping pills has become a national pastime. We are only too sensitive about pain, inconvenience, and possibly offending someone. Yet our own ultra-sensitivity to pain does not, in general, extend to the unborn. Are we inconsistent in our war against pain? Is there a blatant contradiction that runs through the very heart of our Therapeutic Culture? \n \n The answer to this apparent dilemma lies in the fact that there are different levels of pain. Pain exists on a spiritual as well as on a physical level. Of the two, as many psychologists and psychiatrists have averred, the spiritual kind is more difficult to bear. The difference between the two is akin to the difference between pain and suffering. The suffering in one's soul that can arise from humiliation, guilt, despair, and terror, are formidable. An athlete would rather risk breaking his neck driving for a fly ball than feel the humiliation of being called a wimp. A soldier would rather risk injury and even death, than suffer the shame of dishonor. A Christian would rather mortify himself than experience the disgrace that comes with mortal sin. Defeat, dishonor, disgrace, as a rule, are far more devastating than physical pain. \n There is a pain that goes with being egregiously wrong (shame) or being recklessly immoral (disgrace) or being purposely obtuse (humiliation) that is more acute than physical pain. Our Therapeutic Culture is not inconsistent. Those who promote abortion want to spare themselves the pain that goes with suffering shame, disgrace, and humiliation. Because of that, they are willing to deny the pain that the aborted baby feels. To acknowledge what abortion really means is too painful for them. They would rather retreat into the presumed security of their comforting ideology. \n \n Pain and birth go together in a mysterious way, like death and life, fall and redemption. The birth of a child or the rebirth of an adult requires a certain amount of pain. Birth and redemption both demand pain. Abortion was instituted in an attempt to avoid pain. But it has magnified the very thing it had sought to reduce. We are drowning in a sea of tranquilizers while we increase our suffering. We thought we could eliminate physical suffering, but brought about spiritual torment. The abortion issue, like an ellipse, has two foci: one is the birth of the child (which is accompanied by pain); the other, the rebirth of the pro-abortionist (which is accompanied by suffering). Part of the painful truth about the abortion issue is that it includes both the unborn and the unrepentant.\" \n Dr. DeMarco is a professor of philosophy\n at St. Jerome's University in Waterloo, Ont.", 
   {
    "unicode_changes_made": true
   }, 
   248310, 
   null, 
   1170552600.0
  ], 
  [
   249483, 
   null, 
   "thelmoose", 
   "GULLIBLE TREATMENT OF TRUMPED UP \"STUDY\" ON FETAL PAIN ISSUE SHOULD EMBARRASS J.A.M.A. AND SOME JOURNALISTS\n \n This memo offers a number of points of information regarding the article \"Fetal Pain: A Systematic Multidisciplinary Review of the Evidence,\" published in the August 24 edition of the Journal of the American Medical Association (JAMA). Any of the material below, if not otherwise attributed, can be attributed to NRLC Legislative Director Douglas Johnson (Legfederal@aol.com), who prepared this memorandum.\n \n See this here: \n http://www.nrlc.org/abortion/Fetal_P...uttalJAMA.html\n \n The following excerpt is from:\n http://abort73.com/HTML/I-A-2a-pain.html\n \n \"Sir Albert Lilley, widely considered the \"Father of Fetology\", and unabashedly pro-life (as anyone with his vast knowledge of fetal development should be) makes some remarkable statements about fetal pain in an interview he conducted for the book The Tiniest Humans.\n \n \n \n ...\n \n Dr. DeMarco is a professor of philosophy\n at St. Jerome's University in Waterloo, Ont.\n\n \n YOu should be ashamed of yourself, these are lies.\n \n 1. Why did you refer to the JAMA article as \"trumped up\" and put \"study\" in quotes? It was a systematic review. Look up what that means. You are showing your ignorance. \n 2. This hilariously named \"Father of Fetology\" is \"unabashedly pro-life (as anyone with his vast knowledge of fetal development should be)\". A scientist should neither take a pro life or choice point of view when conducting research. That is unethical science to start from a personal point of view.\n Who is this nimwit anyway? What is the nrlc? Who the hell is \"NRLC Legislative Director Douglas Johnson\"? \n 3. \"Dr. DeMarco is a professor of philosophy\". Good source.\n 4. YOu have shown no science in this post. Point to a single study or published paper. You are quoting a \"memorandum\".\n 5. Point to a specific part of the JAMA review that you take issue with. A systematic review is a disciplined review of the literature about a single topic. One of this paper's strength is it discussed neuroanatomy. The thalamus is the part of the brain that you have to have to be able to appreciate any sensation. That is not even formed until near the 30th week.\n 6. I get so ###### off at nimrods like you who know nothing of the topic, don't even read the paper under discussion, probably don't even understand the topic and find some preacher man to spout about science about which he had no qualifications. Find some science to back up your opinions. Posts like yours are shameful. You either know its pure XXXX and are dishonest enough to post such bull or you are too ignorant of the topic to know better.", 
   {}, 
   249480, 
   null, 
   1170553800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  pain", 
  "url": "http://www.4forums.com/political/abortion-debates/9192-pain.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9192, 
  "discussion_files": [
   [
    "26819.html", 
    "http://www.4forums.com/political/abortion-debates/9192-pain-print.html"
   ], 
   [
    "26820.html", 
    "http://www.4forums.com/political/abortion-debates/9192-pain-2-print.html"
   ]
  ], 
  "identifier": 9192
 }
]