[
 [
  [
   240327, 
   null, 
   "simone", 
   "George W. Bush has just made a stealth appointment of Dr. Eric Keroack as head of the federal Office of Population Affairs, which oversees the government's reproductive health efforts and has a budget of $283 million. Keroack, an obstetrician and gynecologist, was previously medical director of a Boston group that opposes premarital sex, abortion and contraception. \n \n This is another case of Bush installing his religious ideology in place of science and medicine. \n \n http://www.upi.com/HealthBusiness/view.php?StoryID=20061117-074039-9953r \n \nAn estimated 120 million couples worldwide who want contraceptives do not have access to them, and 80 million women have unintended pregnancies. More than half a million women die as a result of complications in pregnancy and childbirth every year, more than half of which end in abortion. Of those abortions, 19 million are unsafe and 68,000 women are killed or disabled as a result, the report says. Men and women also suffer from significant rates of sexually transmitted infections other than HIV -- those most of those diseases are preventable and curable.\n \n \n Of course, this means that women will be forced to have more babies than they can afford to care for, both in terms of economics, nurturance, the assurance of a stable family life which can teach ethical and moral values to young persons. This then means that many children will be born into conditions of poverty and want, in an environment devoid of the values of society--and these children will then be ideal for impressing into military service, as anti-social agents of warfare. \n \n After all, Bush glories in being the \"war\" president, even though he has never served as a soldier in actual warfare. He has an unholy disdain for most of humanity and views most human beings as a commodity to serve as slaves to his economic policies, as soldiers who will die or be bloodied in his wars. A flood of children in poverty who have not had the stability of a decent family life to protect them, to teach them values, will serve him well.", 
   {
    "post_info": {
     "post_title": "Forced Pregnancy and Cannon Fodder"
    }
   }, 
   null, 
   null, 
   1163883600.0
  ], 
  [
   242688, 
   null, 
   "Shooterandproud", 
   "George W. Bush has just made a stealth appointment of Dr. Eric Keroack as head of the federal Office of Population Affairs, which oversees the government's reproductive health efforts and has a budget of $283 million. Keroack, an obstetrician and gynecologist, was previously medical director of a Boston group that opposes premarital sex, abortion and contraception. \n \n This is another case of Bush installing his religious ideology in place of science and medicine. \n \n http://www.upi.com/HealthBusiness/view.php?StoryID=20061117-074039-9953r \n \n \n Of course, this means that women will be forced to have more babies than they can afford to care for, both in terms of economics, nurturance, the assurance of a stable family life which can teach ethical and moral values to young persons. This then means that many children will be born into conditions of poverty and want, in an environment devoid of the values of society--and these children will then be ideal for impressing into military service, as anti-social agents of warfare. \n \n After all, Bush glories in being the \"war\" president, even though he has never served as a soldier in actual warfare. He has an unholy disdain for most of humanity and views most human beings as a commodity to serve as slaves to his economic policies, as soldiers who will die or be bloodied in his wars. A flood of children in poverty who have not had the stability of a decent family life to protect them, to teach them values, will serve him well.\n\n \n \n +1 Here. I'm surprised no one has responded.", 
   {}, 
   240327, 
   null, 
   1165690920.0
  ], 
  [
   245277, 
   null, 
   "Protege", 
   "I'll take the bait...\n \n Bush is a centrist, make no doubt about it. Let me qualify: I'm not a Bush fan. For those thinking that Mr. Bush has been pushing Christianity, one need only to visit some of the various pro-life sites on the internet to see what the pro-life community thinks of him as any sort of \"ally\". \n \n I can't put links in yet...arg...\n \n So he put in a pro-life guy, and since the press didn't report it, he \"snuck\" him in? Whatever!", 
   {}, 
   242688, 
   null, 
   1167474420.0
  ], 
  [
   245278, 
   null, 
   "electrolyte", 
   "Bush is a centrist, make no doubt about it. Let me qualify: I'm not a Bush fan. For those thinking that Mr. Bush has been pushing Christianity, one need only to visit some of the various pro-life sites on the internet to see what the pro-life community thinks of him as any sort of \"ally\".\n\n Gee, here's a bit from freerepublic.com trying to sway people to vote for Bush because of his strong anti-choice-- er, I mean, pro-life stance and actions. (Now, I'll grant that not every item on the list is specifically pro-abortion, but most are, and that's the gist of the post. Also, I don't claim extensive knowledge of the subject; this came up on a quick and dirty Google search. Frankly, I found his theatrics regarding the embryonic stem cell research bill telling enough.)", 
   {}, 
   245277, 
   null, 
   1167475440.0
  ], 
  [
   245281, 
   null, 
   "Protege", 
   "Perhaps I'm armchair governing, but...\n \n If Mr. Bush was truly interested in a pro-life agenda, there is much more he could have done. I believe that he has done some token pro-life actions in order to appease the right, but I do not believe he has ever had a strong pro-life agenda at the top of his presidency. Since 9/11, his agenda has been one thing, and one thing alone: FIGHT TERRORISM! Is there any other topic that is addressed when he is on television more than this? \n Bush allowed RU 486 to be approved by the FDA and chose not to get involved.\n Bush also says he supports abortion \"in case of incest or rape\". While this thread does not go into whether or not abortion is ok in those instances, many pro lifers believe that abortion is always wrong, regardless of the reason for pregnancy (if somebody wants to debate this, fine, but let's open another thread).\n There has been plenty of back and forth in the last 30 years since Roe v Wade in our government, but we have not seen in Bush a president whose actions show that he views stopping abortion as a main priority. Pro lifers, however, will contend that the 1.5 million children killed by abortions every year are the number one concern in our nation. That's certainly a number far greater than those lost in Iraq and Afghanistan (sp), God rest their souls.", 
   {}, 
   245278, 
   null, 
   1167487860.0
  ], 
  [
   245289, 
   null, 
   "simone", 
   "Fighting terrorism is not on Bush's agenda.\n \n If he were truly fighting terrorism he would not have abandoned the fight against terrorism in Afghanistan. He would not have invaded Iraq, which had absolutely nothing at all to do with the attacks on my nation on September 11, 2001, in order to get Saddam Hussein hanged because \"Saddam tried to kill my daddy.\"\n \n He would not have allowed Osama bin Laden, Terrorist-in-Chief, to very easily escape at Tora Bora.\n \n If he were truly fighting terrorism he would not have opened up the borders of Iraq to every terrorist on earth in order to get some terrorist training at the expense of the lives and bodies of our American boys and girls.\n \n He would not have destroyed Iraq and, in so doing, destroyed the shaky stability of the Middle East.\n \n I cannot think of one thing that Bush has done to combat terrorism.", 
   {}, 
   245281, 
   null, 
   1167502440.0
  ], 
  [
   245293, 
   null, 
   "electrolyte", 
   "Bush allowed RU 486 to be approved by the FDA and chose not to get involved.\n\n Right from the list: BUSH RESTRICTS RU-486 FUNDING AND CLOSES WHITE HOUSE FEMINIST OFFICE\n \n \nBush also says he supports abortion \"in case of incest or rape\".\n\n He learned that from his daddy. His daddy is anti-choice, too, but when posed the theoretical of his daughter getting pregnant by rape, he made an exception.", 
   {}, 
   245281, 
   null, 
   1167506520.0
  ], 
  [
   245423, 
   null, 
   "Shooterandproud", 
   "What in the hells bells? How did this get so off topic?", 
   {}, 
   245293, 
   null, 
   1167680940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Forced Pregnancy and Cannon Fodder", 
  "url": "http://www.4forums.com/political/abortion-debates/9210-forced-pregnancy-cannon-fodder.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9210, 
  "discussion_files": [
   [
    "17136.html", 
    "http://www.4forums.com/political/abortion-debates/9210-forced-pregnancy-cannon-fodder-print.html"
   ]
  ], 
  "identifier": 9210
 }
]