[
 [
  [
   240336, 
   null, 
   "chloe", 
   "The conversation has often been focused on if the fetus is a person and if the fetus has inherent value.\n \n \n What about the mother?\n Is the mother a person and does she have inherent value? Why or why not?", 
   {
    "post_info": {
     "post_title": "a point too often passed over"
    }
   }, 
   null, 
   null, 
   1163889240.0
  ], 
  [
   240337, 
   null, 
   "Rekhyt2238", 
   "The conversation has often been focused on if the fetus is a person and if the fetus has inherent value.\n\n \n Yes, that is generally the main debate, because the fetus has not done anything to deserve to get aborted.\n \n \nWhat about the mother?\n Is the mother a person and does she have inherent value? Why or why not?\n \n\n \n Yes, she does. But, she has had sex, and thus as a consequence, should carry the baby. Then if she does not want the baby, she should put it up for adoption. So it can go to a family who desperately wants a baby.", 
   {}, 
   240336, 
   null, 
   1163894280.0
  ], 
  [
   240338, 
   null, 
   "Shooterandproud", 
   "Yes, that is generally the main debate, because the fetus has not done anything to deserve to get aborted.\n\n \n And the mother has not done anything to be forced to give birth.\n \n \n \n \nYes, she does. But, she has had sex, and thus as a consequence, should carry the baby. Then if she does not want the baby, she should put it up for adoption. So it can go to a family who desperately wants a baby.\n\n \n So sex is only a privelage for those who can phisically give birth? Abortion is not Black and White as you are trying to paint it to be. It's much more complicated. Having a baby, even giving it up, causes a lot of emotional and phisical pain, and most people just cant have babys. They cannot care for it, and they cannot bear to be thinking that their child is out there somewhere. As I have said before, this is much more complicated than you think. Abortion should always be availible in the first and maybe second trimester, so that women wont have to live the rest of their life in fear and abstinence because they cannot support a baby.\n \n This is an interesting article:\n \n http://www.msnbc.msn.com/id/15173072/site/newsweek/\n \n I would suggest reading it, just to get a better Idea of our position.", 
   {}, 
   240337, 
   null, 
   1163895120.0
  ], 
  [
   240341, 
   null, 
   "chloe", 
   "And the mother has not done anything to be forced to give birth.\n \n \n \n \n \n So sex is only a privelage for those who can phisically give birth? Abortion is not Black and White as you are trying to paint it to be. It's much more complicated. Having a baby, even giving it up, causes a lot of emotional and phisical pain, and most people just cant have babys. They cannot care for it, and they cannot bear to be thinking that their child is out there somewhere. As I have said before, this is much more complicated than you think. Abortion should always be availible in the first and maybe second trimester, so that women wont have to live the rest of their life in fear and abstinence because they cannot support a baby.\n \n This is an interesting article:\n \n http://www.msnbc.msn.com/id/15173072/site/newsweek/\n \n I would suggest reading it, just to get a better Idea of our position.\n\n \n lets stay on the topic. what do you think of the original questions?", 
   {}, 
   240338, 
   null, 
   1163895600.0
  ], 
  [
   240343, 
   null, 
   "chloe", 
   "Yes, she does. \n\n Why do you think she does?", 
   {}, 
   240337, 
   null, 
   1163895720.0
  ], 
  [
   240344, 
   null, 
   "Shooterandproud", 
   "lets stay on the topic. what do you think of the original questions?\n\n \n Im not responding to your origional post, im respondind to rekhyt's.", 
   {}, 
   240341, 
   null, 
   1163895780.0
  ], 
  [
   240345, 
   null, 
   "chloe", 
   "Im not responding to your origional post, im respondind to rekhyt's.\n\n what do you think of the original questions of this thread?", 
   {}, 
   240344, 
   null, 
   1163895840.0
  ], 
  [
   240357, 
   null, 
   "Rekhyt2238", 
   "Why do you think she does?\n\n \n Why do I think that she has inherent value? Because she's a person. \n \n \nAnd the mother has not done anything to be forced to give birth.\n\n \n Since when is having sex not doing anything? Sex is something, therefore having sex, is doing something.\n \n \nSo sex is only a privelage for those who can phisically give birth? Abortion is not Black and White as you are trying to paint it to be. It's much more complicated.\n\n \n In other threads, I've said that it isn't black and white. For those who can not physically give birth(those who it would kill or seriously hurt), I support abortion for. \n \n \nHaving a baby, even giving it up, causes a lot of emotional and phisical pain, \n\n \n And you think that killing your baby doesn't cause any emotional and/or physical pain?", 
   {}, 
   240343, 
   null, 
   1163904900.0
  ], 
  [
   240358, 
   null, 
   "jitobear", 
   "The conversation has often been focused on if the fetus is a person and if the fetus has inherent value.\n \n \n What about the mother?\n Is the mother a person and does she have inherent value? Why or why not?\n\n \n Everything has inherent value. That is not the crux of this debate. People aren't having abortions because they don't see the value in a fetus. Pregnancy is a unique circumstance for humanity. If the mother's and fetus' needs are in conflict - only one can, for lack of a better word, \"win\".\n \n Working on addressing women's needs/issues rather than trivailizing them will do worlds more to curb abortin than criminalization.", 
   {}, 
   240336, 
   null, 
   1163905140.0
  ], 
  [
   240413, 
   null, 
   "Shooterandproud", 
   "Why do I think that she has inherent value? Because she's a person.\n\n \n Glad you figured that part out.\n \n \n \n \nSince when is having sex not doing anything? Sex is something, therefore having sex, is doing something.\n\n \n Sex is a norman part of a healthy relationship.\n \n \n \n \nIn other threads, I've said that it isn't black and white. For those who can not physically give birth(those who it would kill or seriously hurt), I support abortion for.\n\n \n What about those who cannot emotionally or financially support a Baby. What if I told you you were pregnant right now (lets just assume you're a girl), and that abortion was illegal. It would suck, your future would be ruined, and you probably wouldn't be able to lead a normal life again. You have no Idea what women go through when they're pregnant.\n \n \n \n \nAnd you think that killing your baby doesn't cause any emotional and/or physical pain?\n\n \n \n Much less so if any. There is no post-abortive psycosis, or whatever.", 
   {}, 
   240357, 
   null, 
   1163965020.0
  ], 
  [
   240419, 
   null, 
   "Rekhyt2238", 
   "Sex is a norman part of a healthy relationship.\n\n \n Yes, but it also has consequences. \n \n \nWhat about those who cannot emotionally or financially support a Baby.\n\n \n I don't know, you may not have heard of this new thing, it's called adoption.\n \n \nWhat if I told you you were pregnant right now (lets just assume you're a girl), and that abortion was illegal. It would suck, your future would be ruined, and you probably wouldn't be able to lead a normal life again. You have no Idea what women go through when they're pregnant.\n\n \n Right now, you are assuming. And, as I told georged in another thread a minute ago, don't assume, as you make an XXX out of u and me. So, back to what you said, how do you know that I don't have a 16 year old pregnant sister/friend/other? You said it would suck. Yes, it would suck a little bit, but I decided to have sex, fully knowing the consequences, and now I would have to deal with it. Actually yes, I could live a normal life. I could continue to go to school, give birth to the baby, and then give the baby up for adoption. It would be hard, yes, but possible.\n \n \nMuch less so if any. There is no post-abortive psycosis, or whatever.\n\n \n I'm sorry, I was refering to those selective people who have a conseince.", 
   {}, 
   240413, 
   null, 
   1163965860.0
  ], 
  [
   240423, 
   null, 
   "georged", 
   " You said it would suck. Yes, it would suck a little bit, but I decided to have sex, fully knowing the consequences, and now I would have to deal with it. Actually yes, I could live a normal life. I could continue to go to school, give birth to the baby, and then give the baby up for adoption. It would be hard, yes, but possible.\n \n\n \n Public agency adoptions account for more than half of all adoptions. That's taxpayer dollars.", 
   {}, 
   240419, 
   null, 
   1163967120.0
  ], 
  [
   240424, 
   null, 
   "Rekhyt2238", 
   "Public agency adoptions account for more than half of all adoptions. That's taxpayer dollars.\n\n \n ANd your point is what?", 
   {}, 
   240423, 
   null, 
   1163967300.0
  ], 
  [
   240426, 
   null, 
   "georged", 
   "ANd your point is what?\n\n \n Why should I pay for your lack of responsibility in raising a child when prevention or abortion are available?", 
   {}, 
   240424, 
   null, 
   1163967660.0
  ], 
  [
   240429, 
   null, 
   "Shooterandproud", 
   "Yes, but it also has consequences.\n\n \n No, thats what we have abortion for.\n \n \n \n \nI don't know, you may not have heard of this new thing, it's called adoption.\n\n \n Most women can't handle adoption, next...\n \n \n \n \nRight now, you are assuming. And, as I told georged in another thread a minute ago, don't assume, as you make an XXX out of u and me. So, back to what you said, how do you know that I don't have a 16 year old pregnant sister/friend/other? You said it would suck. Yes, it would suck a little bit, but I decided to have sex, fully knowing the consequences, and now I would have to deal with it. Actually yes, I could live a normal life. I could continue to go to school, give birth to the baby, and then give the baby up for adoption. It would be hard, yes, but possible.\n\n \n You are painting this as such a black and white issue. You cant just not have sex. You cant just put the baby up for adoption. Many women can become emotionally unstable and maybe even hurt someone else or themselves after giving birth. Its not black and white. Abortion is the only option for most women, and taking that option away would not only be morally wrong, it would be downwright primitive. We dont need extra babys. Unwanted children means poverty and crime, we don't need all of these unwanted children. What would be the point of having them? There are waay too many children no one gives a XXXX about in this world.\n \n Have you read that article that I posted yet? I think you might find it interesting.\n \n \n \n \nI'm sorry, I was refering to those selective people who have a conseince.\n\n \n \n After having a baby, most people arent worrying about their conscience. Even when they're pregnant, they whole lifestyle is in danger. Most women cant have a baby because they cannot emotionally and financially support it, therefore most of them must have an abortion, and many of them feel sad about that. As I said before, READ THAT ARTICLE!", 
   {}, 
   240419, 
   null, 
   1163968200.0
  ], 
  [
   240430, 
   null, 
   "Rekhyt2238", 
   "Why should I pay for your lack of responsibility in raising a child when prevention or abortion are available?\n\n \n And the government doesn't pay for abortions?", 
   {}, 
   240426, 
   null, 
   1163968380.0
  ], 
  [
   240431, 
   null, 
   "Shooterandproud", 
   "Why should I pay for your lack of responsibility in raising a child when prevention or abortion are available?\n\n \n 60% of children in the foster care system and adoptive care go homeless after turning 18. Many of them become criminals. Now we have wasted our taxpayers money, and have criminals running around our street. Not to mencion the many women who's lives would be ruined because of being forced to give birth. Simply because you want to earn brownie points in heavan is not a good reason for criminalizing abortion, because of its huge negative impact on society.\n \n \"If your morals or your religion are getting in the way of your politics, you're not helping anyone.We don't have civil rights so we can be politically correct. We have civil rights so we can be different and offensive.\"- madmike, 2/18/04", 
   {}, 
   240426, 
   null, 
   1163968440.0
  ], 
  [
   240432, 
   null, 
   "Rekhyt2238", 
   "Your statistics are useless as they don't concern babies. As babies don't go to foster care. There are people on one to two/three year WAITING lists to adopt a baby. Also, I don't understand why killing your baby would cause less emotional pain, as opposed to giveing it to a loving family.\n \n \nYou cant just not have sex. \n\n \n Why? Are we that much of animals, that we can't control ourselves? Is it physically impossible to be celibate?", 
   {}, 
   240431, 
   null, 
   1163968860.0
  ], 
  [
   240435, 
   null, 
   "Shooterandproud", 
   "Your statistics are useless as they don't concern babies. As babies don't go to foster care. There are people on one to two/three year WAITING lists to adopt a baby. Also, I don't understand why killing your baby would cause less emotional pain, as opposed to giveing it to a loving family.\n\n \n Frankly, im not concerned with a fetus at the moment. Im concerned with the living human being, who feels pain and sorrow, who's life you are about to throw away if you criminalize abortion. You still havent answered my question, why do we need all of these extra unwanted babys?\n \n And I also refer you to the quote I posted before.\n \n \n \n \nWhy? Are we that much of animals, that we can't control ourselves? Is it physically impossible to be celibate?\n\n \n Have you had sex before? I havent, but it is foolish of you to make these assumptions. Sex is part of a healthy relationship and life, and no one will live in abstinence just because they have a chance of having a baby. That's what abortion is for.\n \n I refer you to my signature, why do you feel that the government should seize women's reproductive rights and take away their personal choice and freedom?", 
   {}, 
   240432, 
   null, 
   1163969760.0
  ], 
  [
   240437, 
   null, 
   "jitobear", 
   "I don't know, you may not have heard of this new thing, it's called adoption.\n\n \n What about those who can not emotionally, physically or financially support a PREGNANCY? \n \n \nWhy? Are we that much of animals, that we can't control ourselves? Is it physically impossible to be celibate?\n\n \n No, but it's damned hard and quite unhealthy. I believe celibacy is partly to blame for the sex scandals within the Catholic church.", 
   {}, 
   240419, 
   null, 
   1163971200.0
  ], 
  [
   240444, 
   null, 
   "Rekhyt2238", 
   "Frankly, im not concerned with a fetus at the moment. \n\n \n Well that's your problem, because I am.\n \n \nYou still havent answered my question, why do we need all of these extra unwanted babys?\n\n \n So just because they're unwanted, doesn't mean that they don't deserve to live? What if one of those aborted babies, may have been the person who discovered the cure for cancer? Have you ever thought of that?", 
   {}, 
   240437, 
   null, 
   1163972760.0
  ], 
  [
   240445, 
   null, 
   "wvpeach1963", 
   "The conversation has often been focused on if the fetus is a person and if the fetus has inherent value.\n \n \n What about the mother?\n Is the mother a person and does she have inherent value? Why or why not?\n\n \n Chloe '\n \n Don't take this the wrong way but your original question is pointless.\n certainly a mother a live woman has value and is a person.\n \n I doubt you would find anybody in the whole big wide world to differ with that fact that a live woman has value . So the question is pointless.\n \n However I firmly believe that we are talking only about lumps of flesh when we speak of abortion or embryos tossed in garbage cans at fertility clinics.\n \n God gives the soul at the moment of birth just as he takes it back to himself at the moment of death. There is no logical arguement that proves otherwise.\n \n The soul is the important part , not the flesh , however you look at it.\n \n Live women have souls , unlike fetus's in utero . So certainly the live woman has value as I do not believe a lump of flesh as yet without a soul does.", 
   {}, 
   240336, 
   null, 
   1163972820.0
  ], 
  [
   240449, 
   null, 
   "Rekhyt2238", 
   "God gives the soul at the moment of birth just as he takes it back to himself at the moment of death. There is no logical arguement that proves otherwise.\n\n \n Logically, that contradicts itself. As religion is based on faith, rather than logic. So, logically how do you know that a fetus or even a zygote for that matter, does not have a soul?", 
   {}, 
   240445, 
   null, 
   1163973420.0
  ], 
  [
   240462, 
   null, 
   "chloe", 
   "The conversation has often been focused on if the fetus is a person and if the fetus has inherent value.\n \n \n What about the mother?\n Is the mother a person and does she have inherent value? Why or why not?\n\n \n Where are the pro choice people? What is their position on this? Can they say that women have inherent value and worth and what is their reasoning? Are women inherently more valuable than plants and animals and what is the reasoning behind your answer?", 
   {}, 
   240336, 
   null, 
   1163981700.0
  ], 
  [
   240464, 
   null, 
   "Rekhyt2238", 
   "Where are the pro choice people? What is their position on this? Can they say that women have inherent value and worth and what is their reasoning? Are women inherently more valuable than plants and animals and what is the reasoning behind your answer?\n\n \n I don't know why you're asking this, as I think we all agree that the woman does have inherent value. The woman does have more value than a plant or animal. The only person that may disagree with you would be Sadam Huesien, and others like him.", 
   {}, 
   240462, 
   null, 
   1163983380.0
  ], 
  [
   240468, 
   null, 
   "Shooterandproud", 
   "Well that's your problem, because I am.\n\n \n \"If your morals or your religion are getting in the way of your politics, you're not helping anyone.We don't have civil rights so we can be politically correct. We have civil rights so we can be different and offensive.\"- madmike, 2/18/04 \n \n \nSo just because they're unwanted, doesn't mean that they don't deserve to live? What if one of those aborted babies, may have been the person who discovered the cure for cancer? Have you ever thought of that?\n\n \n What if the woman who was forced to have babys discovered the cure for cancer, but couldn't pursue her dreams because she had to care for her children. They don't deserve to live if they are living inside of another, sucking up all of their resources, and causing them emotional pain and suffering. Actually, Its up to the mother.\n \n The mother knows the circumstances best, you do not. Therefore, she must make the descision for the child, not you, not the government.", 
   {}, 
   240444, 
   null, 
   1163985840.0
  ], 
  [
   240469, 
   null, 
   "Shooterandproud", 
   "Chloe '\n \n Don't take this the wrong way but your original question is pointless.\n certainly a mother a live woman has value and is a person.\n \n I doubt you would find anybody in the whole big wide world to differ with that fact that a live woman has value . So the question is pointless.\n \n However I firmly believe that we are talking only about lumps of flesh when we speak of abortion or embryos tossed in garbage cans at fertility clinics.\n \n God gives the soul at the moment of birth just as he takes it back to himself at the moment of death. There is no logical arguement that proves otherwise.\n \n The soul is the important part , not the flesh , however you look at it.\n \n Live women have souls , unlike fetus's in utero . So certainly the live woman has value as I do not believe a lump of flesh as yet without a soul does.\n\n \n O my god. Are you religious and pro-choice? Wow, maybe you aren't on drugs after all...", 
   {}, 
   240445, 
   null, 
   1163985900.0
  ], 
  [
   240470, 
   null, 
   "Shooterandproud", 
   "Logically, that contradicts itself. As religion is based on faith, rather than logic. So, logically how do you know that a fetus or even a zygote for that matter, does not have a soul?\n\n \n Tell me the last time you had a casual conversation with a fetus.", 
   {}, 
   240449, 
   null, 
   1163986020.0
  ], 
  [
   240472, 
   null, 
   "Shooterandproud", 
   "Where are the pro choice people? What is their position on this? Can they say that women have inherent value and worth and what is their reasoning? Are women inherently more valuable than plants and animals and what is the reasoning behind your answer?\n\n \n Well, we really don't know. However we do know that the woman has self conscious, and feels pain. Something the fetus lacks. She also can interact with other human beings, and develop relationships and attachments. Another thing the fetus lacks. Phisically, she is larger and much more capable than the fetus, and has a formed brain. Another thing the fetus lacks.\n \n In conclusion, we really don't know. But, we do know that the woman can do, feel, and become more than a fetus is.", 
   {}, 
   240462, 
   null, 
   1163986200.0
  ], 
  [
   240477, 
   null, 
   "Rekhyt2238", 
   "Tell me the last time you had a casual conversation with a fetus.\n\n \n So because you can't have a casual conversation with a fetus, it does not have a soul? By that same logic, a newborn baby would also not have a soul.\n \n \nand feels pain. Something the fetus lacks.\n\n \n Do you know for a fact, that a fetus can not feel pain?\n \n \nPhisically, she is larger and much more capable than the fetus,\n\n \n So, because she's bigger, she can kill the fetus off? That is generally the idea the school yard bully has.\n \n \n\n \"If your morals or your religion are getting in the way of your politics, you're not helping anyone.We don't have civil rights so we can be politically correct. We have civil rights so we can be different and offensive.\"- madmike, 2/18/04\n\n \n My morals are not effecting this any more than they are when I say the murdering of innocent people(non-fetus people, that is) should be illegal.", 
   {}, 
   240470, 
   null, 
   1163988060.0
  ], 
  [
   240484, 
   null, 
   "zachvac", 
   "\n Have you had sex before? I havent, but it is foolish of you to make these assumptions. Sex is part of a healthy relationship and life, and no one will live in abstinence just because they have a chance of having a baby. That's what abortion is for.\n \n\n \n No it's not. That's what protection and birth control are for. Abortion is necessary in certain circumstances, but it should NOT be used as a method of birth control.", 
   {}, 
   240435, 
   null, 
   1163993520.0
  ], 
  [
   240485, 
   null, 
   "zachvac", 
   "\n What if one of those aborted babies, may have been the person who discovered the cure for cancer? Have you ever thought of that?\n\n \n You better start having sex now, or else the start of what could be the person to cure cancer could have just not been born because of your abstinence.", 
   {}, 
   240444, 
   null, 
   1163993580.0
  ], 
  [
   240493, 
   null, 
   "Shooterandproud", 
   "No it's not. That's what protection and birth control are for. Abortion is necessary in certain circumstances, but it should NOT be used as a method of birth control.\n\n \n Of course not, but birth control isnt 100% effective.", 
   {}, 
   240484, 
   null, 
   1164007740.0
  ], 
  [
   240494, 
   null, 
   "Shooterandproud", 
   "So because you can't have a casual conversation with a fetus, it does not have a soul? By that same logic, a newborn baby would also not have a soul.\n\n \n At least a newborn can actually feel pain, make noise, and moove effectively.\n \n \n \n \nDo you know for a fact, that a fetus can not feel pain?\n\n \n In the early stages it cannot, but im not for late term abortion.\n \n \n \n \nSo, because she's bigger, she can kill the fetus off? That is generally the idea the school yard bully has.\n\n \n Tell me, are the kids being bullied a hunk of tissue living inside of the bully's stomach?\n \n \n \n \nMy morals are not effecting this any more than they are when I say the murdering of innocent people(non-fetus people, that is) should be illegal.\n\n \n The murder of innocent people (non embryo) is against the constitution. Laws are to benifit society and uphold the constitution, not go deep into morals, which is exactly what you're doing.\n \n Why arent you going on an ant's rights crusade. Many more ants than fetuses are killed every day, and ants are fully formed living creatures. They feel pain, and they can interact. Why aren't you for illegalizing ant squishing or bug extermination? Why aren't the pro-life zealots running around yelling \"theres a genocide going on!!! stop the murder!! criminalize ant squshing! ants are people too!\". And furthermore, why aren't you people against the death penalty? The DP murderes fully formed humans, with lives and emotions.", 
   {}, 
   240477, 
   null, 
   1164008280.0
  ], 
  [
   240507, 
   null, 
   "jyoshu", 
   "In the early stages it cannot, but im not for late term abortion.\n\n \n So you're for making late term abortion illegal?", 
   {}, 
   240494, 
   null, 
   1164042360.0
  ], 
  [
   240517, 
   null, 
   "DrNo", 
   "What if the woman who was forced to have babys discovered the cure for cancer, but couldn't pursue her dreams because she had to care for her children.\n\n \n I have to ask: What if the fetus that you aborted would have grown into a person that discovered a cure for cancer?", 
   {}, 
   240468, 
   null, 
   1164048000.0
  ], 
  [
   240531, 
   null, 
   "sinjin", 
   "I have to ask: What if the fetus that you aborted would have grown into a person that discovered a cure for cancer?\nI guess someone else will have to find the cure to cancer. What if it was a mass murderer that was aborted?", 
   {}, 
   240517, 
   null, 
   1164058620.0
  ], 
  [
   240539, 
   null, 
   "chloe", 
   "The conversation has often been focused on if the fetus is a person and if the fetus has inherent value.\n \n \n What about the mother?\n Is the mother a person and does she have inherent value? Why or why not?\n\n \n \n Where are the pro choice people? What is their position on this? Can they say that women have inherent value and worth and what is their reasoning? Are women inherently more valuable than plants and animals and what is the reasoning behind your answer?", 
   {}, 
   240336, 
   null, 
   1164065520.0
  ], 
  [
   240550, 
   null, 
   "DrNo", 
   "I guess someone else will have to find the cure to cancer. What if it was a mass murderer that was aborted?\n\n \n There are a million \"what ifs\" you could use to fill in this argument for both sides. That is my point. It is a useless argument; equally useless for either side.", 
   {}, 
   240531, 
   null, 
   1164071340.0
  ], 
  [
   240584, 
   null, 
   "Tastyfish", 
   "Where are the pro choice people? What is their position on this? Can they say that women have inherent value and worth and what is their reasoning? Are women inherently more valuable than plants and animals and what is the reasoning behind your answer?\n\n \n Just for you then ;)\n \n I'm not really sure why you would say its a point overlooked though, its pretty much the point of the pro-choice movement more or less. We don't think a fetus has a negative value and that its best to be rid of as many as possible, its just that they don't have the same value as the well being of the woman.\n \n That said I probably wouldn't use terms like 'inherent value' as I don't belieive in that sort of thing. I think that in the context of our society and the rules that allow us to live the lives we more or less want then we need to recognise other people's rights regardless of gender. Its a lot more important to me for a woman to be able to have an abortion than it is for a fetus not to be able to be aborted as the former will have consquences for me but the latter won't (or at least greatly reduced and less definite ones).\n \n Its more or less what seperates them from plants and animals (though its a bit wierd one this last point and I'm a massive hypocrite when its comes to this).", 
   {}, 
   240539, 
   null, 
   1164112920.0
  ], 
  [
   240670, 
   null, 
   "Shooterandproud", 
   "So you're for making late term abortion illegal?\n\n \n Yes, I am.", 
   {}, 
   240507, 
   null, 
   1164157740.0
  ], 
  [
   240671, 
   null, 
   "Shooterandproud", 
   "I have to ask: What if the fetus that you aborted would have grown into a person that discovered a cure for cancer?\n\n \n It can go both ways, so that argument is moot.", 
   {}, 
   240517, 
   null, 
   1164157860.0
  ], 
  [
   240672, 
   null, 
   "Rekhyt2238", 
   "There are a million \"what ifs\" you could use to fill in this argument for both sides. That is my point. It is a useless argument; equally useless for either side.\n\n \n \nIt can go both ways, so that argument is moot.\n\n \n We've already established this Shooter, so I declare your post moot.", 
   {}, 
   240550, 
   null, 
   1164158220.0
  ], 
  [
   240676, 
   null, 
   "Shooterandproud", 
   "We've already established this Shooter, so I declare your post moot.\n\n \n Good, now are you going to reply to tastyfish's post or what?", 
   {}, 
   240672, 
   null, 
   1164158760.0
  ], 
  [
   240677, 
   null, 
   "Rekhyt2238", 
   "Shooter, I don't see what there is to reply to. Tastyfish is of the opinion that the womans' rights are more important than the fetus. It is an opinion, therefore nothing to reply to.", 
   {}, 
   240676, 
   null, 
   1164159420.0
  ], 
  [
   240682, 
   null, 
   "Shooterandproud", 
   "Shooter, I don't see what there is to reply to. Tastyfish is of the opinion that the womans' rights are more important than the fetus. It is an opinion, therefore nothing to reply to.\n\n \n So, you have nothing to counter his post?", 
   {}, 
   240677, 
   null, 
   1164164220.0
  ], 
  [
   240683, 
   null, 
   "Rekhyt2238", 
   "No, as, like I said, it is an opinion. Nothing to refute, except with another opinion.", 
   {}, 
   240682, 
   null, 
   1164164520.0
  ], 
  [
   240690, 
   null, 
   "Adept", 
   "No, as, like I said, it is an opinion. Nothing to refute, except with another opinion.\n\n \n One could always try and figure out who has the most logically consistent and rational opinion...", 
   {}, 
   240683, 
   null, 
   1164168240.0
  ], 
  [
   240692, 
   null, 
   "Rekhyt2238", 
   "One could always try and figure out who has the most logically consistent and rational opinion...\n\n \n To tell you the truth, I really don't agree with that. As, I believe that my opinion is the best, just as he does. If other people want to debate on them, that is fine.", 
   {}, 
   240690, 
   null, 
   1164170940.0
  ], 
  [
   240694, 
   null, 
   "chloe", 
   "Just for you then ;)\n That said I probably wouldn't use terms like 'inherent value' as I don't belieive in that sort of thing. \n\n \n We should all agree that there either is such a thing or there isn't. Many on the prolife side believe there is. Many on the prochoice side believe there is not.\n \n Many (if not the majority) prochoice people do not believe in the inherent dignity of women and therefore trivialize them by not acknowledging that they have more inherent value than plants, animals, and dust. It does not surprise me that these same individuals argue that the fetus (a smaller, less developed, dependent human) does not have any inherent value or worth. Yet it is quite strange that they would argue against infanticide, as if all of a sudden because the fetus starts breathing oxygen in a different way than it did 2 seconds before means that it has an \"inherent value\" that they don't even believe in. Ironic.\n \n Yet, is it not ironic that these same individuals will lash out and say that the prolife person is trivializing the lives of millions of women. It may be true that some prolifers do, but i would argue that they are not truly pro life. The pro life position says that human beings have inherent dignity and worth and not only pay the lipservice to this but walk out this belief.\n \n How can the pro choice argument based on this empty perspective have any credibility in this discussion if it denies that human beings have an inherent dignity and worth that distinguishes them from plants and animals. Isn't the idea of rights based on the idea that people are deserving of those rights because they have inherent value?\n \n Where is the logic in saying that women are not inherently worth more than a whale, but they are inherently more valuable than a fetus who in two seconds will become a \"person\".\n \n Thanks for commenting Tastyfish. I am not trying to bash you here, but instead trying to make a point about the prochoice position.", 
   {}, 
   240584, 
   null, 
   1164173820.0
  ], 
  [
   240695, 
   null, 
   "Rekhyt2238", 
   "Chloe, I agree with you here, and think that you have some good points.", 
   {}, 
   240694, 
   null, 
   1164174120.0
  ], 
  [
   240698, 
   null, 
   "Shooterandproud", 
   "We should all agree that there either is such a thing or there isn't. Many on the prolife side believe there is. Many on the prochoice side believe there is not.\n\n \n Inaccurate and bias statement.\n \n \nMany (if not the majority) prochoice people do not believe in the inherent dignity of women and therefore trivialize them by not acknowledging that they have more inherent value than plants, animals, and dust.\n\n \n What? You mean the pro life side right? The pro life side believes that the government should be in charge of women's fetuses, and not the women themselevs.\n \n \nIt does not surprise me that these same individuals argue that the fetus (a smaller, less developed, dependent human)\n\n \n My fingernail can be considered a smaller, less developed human. The question is not whether it's human, its whether it is a person. And whether it should have power over a woman's choice.\n \n \n \ndoes not have any inherent value or worth.\n\n \n You can wiggle and squirm, and manipulate all you want. But nothing will change the facts. We do not like abortion, and we do think the fetus has much value. But, we do not think the fetus is a powerful enough human being to override a womans right over her own body.\n \n \nis quite strange that they would argue against infanticide, as if all of a sudden because the fetus starts breathing oxygen in a different way than it did 2 seconds before means that it has an \"inherent value\"\n\n \n Then it develops a human characteristic. Before that, it was merely a hunk of flesh inside of someone's stomach. The pro life side believes that the government should legislate all women's personal lives and choices, and that the women cannot make descisions for themselves. I find your position quite sexist.\n \n \n \n \nYet, is it not ironic that these same individuals will lash out and say that the prolife person is trivializing the lives of millions of women. It may be true that some prolifers do, but i would argue that they are not truly pro life.\n\n \n \n The true pro-life side is that women should not make the descision to have an aboriton or not. The government should, and the women should not have a right to her own body, even though she is a living breathing human being, and the fetus is not.\n \n \nThe pro life position says that human beings have inherent dignity and worth and not only pay the lipservice to this but walk out this belief.\n\n \n How ironic that their position specifically states that the government should have power over a woman's body. In my opinion, the pro lifers dont give squat about the fetus or the woman, and are only trying to earn themselves brownie points in heavan.\n \n \nHow can the pro choice argument based on this empty perspective have any credibility in this discussion if it denies that human beings have an inherent dignity and worth that distinguishes them from plants and animals.\n\n \n Human beings or humans? My hair is human, my skin is human, my fingernails are human. However, a human being is one who has conscious, can interact with others, can feel pain, and can think and has a brain. In the early stages, a fetus is merely a hunk of flesh.\n \n \n \n \nIsn't the idea of rights based on the idea that people are deserving of those rights because they have inherent value?\n\n \n Not at all. It is to benifit living humans and society. We don't know squat about inherit value, but we can take measures to ensure that our generation and society are safe, peaceful, and to minimize pain an suffering.\n \n \n \nWhere is the logic in saying that women are not inherently worth more than a whale, but they are inherently more valuable than a fetus who in two seconds will become a \"person\".\n\n \n Like i said before, we don't know squat about value. However, we do know that the woman has conscious, and can feel pain. Making that woman suffer because of something in her stomach would be illogical. We don't know anything about humans, but we can take measures to make sure that humans are living happily. The constitution states \n \n \"We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.\"\n \n The pro life side says that pregnant women should be forced to give birth. That is defonitaly not ensuring domestic tranquility and establishing justice. It seems completely unfair. Also, millions more unwanted children mean more crime and poverty. Which is not good for society and is not upholding the constitution. It does not benifit our country either with all of these unwanted children and criminals running around, therefore it would be illogical to conclude that the pro-life side is better for our country. We have way too many kids no one gives a XXXX about, why must we need more? It would also be illogical to presume that the fetus is a person. The defonition of a person is:\n \n per·son Listen: [ pûrsn ]\n n. \n \n The living body of a human: searched the prisoner's person. \n \n A human or organization with legal rights and duties.\n \n The composite of characteristics that make up an individual personality; the self. \n \n Christianity Any of the three separate individualities of the Father, Son, and Holy Spirit, as distinguished from the essence of the Godhead that unites them. \n \n A living human. Often used in combination: chairperson; spokesperson; salesperson. \n \n \n Obviously, none of these fits a fetus or embryo. The pro life position fails to take into account the rest of society, that we would be overpopulated over abortion criminalization. Crime will rise, taxes will rise to pay for the welfare of the homesless, and we will be one step closer to an overpopulated society. 6 billion is enough, we don't need any more.", 
   {}, 
   240694, 
   null, 
   1164176760.0
  ], 
  [
   240699, 
   null, 
   "Rekhyt2238", 
   "and are only trying to earn themselves brownie points in heavan.\n \n\n \n And you are only trying to earn yourself brownie points in hell.", 
   {}, 
   240698, 
   null, 
   1164177180.0
  ], 
  [
   240727, 
   null, 
   "thelmoose", 
   "We should all agree that there either is such a thing or there isn't. Many on the prolife side believe there is. Many on the prochoice side believe there is not.\n \n Many (if not the majority) prochoice people do not believe in the inherent dignity of women and therefore trivialize them by not acknowledging that they have more inherent value than plants, animals, and dust. It does not surprise me that these same individuals argue that the fetus (a smaller, less developed, dependent human) does not have any inherent value or worth. Yet it is quite strange that they would argue against infanticide, as if all of a sudden because the fetus starts breathing oxygen in a different way than it did 2 seconds before means that it has an \"inherent value\" that they don't even believe in. Ironic.\n \n Yet, is it not ironic that these same individuals will lash out and say that the prolife person is trivializing the lives of millions of women. It may be true that some prolifers do, but i would argue that they are not truly pro life. The pro life position says that human beings have inherent dignity and worth and not only pay the lipservice to this but walk out this belief.\n \n How can the pro choice argument based on this empty perspective have any credibility in this discussion if it denies that human beings have an inherent dignity and worth that distinguishes them from plants and animals. Isn't the idea of rights based on the idea that people are deserving of those rights because they have inherent value?\n \n Where is the logic in saying that women are not inherently worth more than a whale, but they are inherently more valuable than a fetus who in two seconds will become a \"person\".\n \n Thanks for commenting Tastyfish. I am not trying to bash you here, but instead trying to make a point about the prochoice position.\n\n \n Correct me if I am wrong, Chloe, but this is what I gather is your argument:\n \n 1. Human beings have \"inherent value\" and that value is relatively greater than other animals, plants or inanimate things. \n \n 2. Fetuses also have \"inherent value\" equal to other humans.\n \n 3. Secular humanists or pro-choice proponents or whatever label to brand us, disagree with that and don't think humans and fetuses have this \"inherent value.\"\n \n Am I right so far?\n \n What is this \"inherent value\" of which you speak. I think that phrase might be an oxymoron. If the value is inherent, then what does it matter what others think? Value is by definition a relative term. Are you saying that pro-choice people value humanity less than pro-lifers? Because that statement, on the whole, is decidely not true. \n \n You have these pat little phrases that are all cute and all, but I think you need to examine these words. \n \n I do not believe in god (a better description, I think, than calling me secular) and I believe it should remain legal for a women to have an abortion. \n \n I still am quite capable to assign immense value to humanity and I do. In some circumstances I think the place humans in a superior positon to animals. I believe murdering humans is wrong, but I eat meat. I still think animals deserve to be protected and the animal kingdom is a wondrous and beautiful thing to behold. I do not think abortion is murder. I think the condition and welfare of the mother outweighs that of the fetus. It is really that simple.\n \n You have to consider the possibility of assiging relative value based on context and careful consideration.", 
   {}, 
   240694, 
   null, 
   1164224580.0
  ], 
  [
   240736, 
   null, 
   "Rekhyt2238", 
   "I do not believe in god (a better description, I think, than calling me secular) and I believe it should remain legal for a women to have an abortion.\n\n \n Then what do you believe happens to the souls of the fetuses that are murdered? You can't use the argument that god gives the soul at the time of birth just as he takes it away at death, because you don't believe in a god.", 
   {}, 
   240727, 
   null, 
   1164230580.0
  ], 
  [
   240738, 
   null, 
   "thelmoose", 
   "Then what do you believe happens to the souls of the fetuses that are murdered? You can't use the argument that god gives the soul at the time of birth just as he takes it away at death, because you don't believe in a god.\n\n \n \n I don't and wouldn't use that silly argument.\n If there is no god stuff, what would be the point of a soul?\n I don't believe in God or souls or heaven or hell or any of that christian myth. I also do not think that aborting a fetus is murder, either.\n \n What's your point?", 
   {}, 
   240736, 
   null, 
   1164232740.0
  ], 
  [
   240740, 
   null, 
   "Rekhyt2238", 
   "Ok, change soul to: Life-force, spirit, or whatever-the-hell-gives-us-life. What happens to it then? Does that person just never get to live?", 
   {}, 
   240738, 
   null, 
   1164236880.0
  ], 
  [
   240741, 
   null, 
   "thelmoose", 
   "Ok, change soul to: Life-force, spirit, or whatever-the-hell-gives-us-life. What happens to it then? Does that person just never get to live?\n\n \n \n There is nothing more than our corporeal existence. The fetus (which is not a person, by the way) is living tissue. There are lots of living things, none of which have souls, or life-forces or whatever, because those things don't exist. There is nothing outside of biology that \"gives us life\" or gives life to anything else. Living things are simply alive. If you want to debate the definition of life, that's another can of worms. \n \n Again, what point are you trying to make?", 
   {}, 
   240740, 
   null, 
   1164237660.0
  ], 
  [
   240744, 
   null, 
   "jitobear", 
   "Chloe I responded quite some back. This woman does not feel trivialized be being granted the right to choose.\n \n Stop stereotyping those who are pro-choice because they did not wish to respond to this thread - which had a pretty obvious agenda. I saw immediately that you would reach the conclusion that you did.", 
   {}, 
   240741, 
   null, 
   1164246120.0
  ], 
  [
   240745, 
   null, 
   "Shooterandproud", 
   "And you are only trying to earn yourself brownie points in hell.\n\n \n Actually, you're the one who's gonna end up in hell for devaluing and discriminating against women.\n \n \n Funny, they were saying the same thing about abolitionists centuries ago...", 
   {}, 
   240699, 
   null, 
   1164246240.0
  ], 
  [
   240746, 
   null, 
   "Shooterandproud", 
   "Then what do you believe happens to the souls of the fetuses that are murdered? You can't use the argument that god gives the soul at the time of birth just as he takes it away at death, because you don't believe in a god.\n\n \n Fetuses don't have souls. They are not human beings yet, they don't talk, they don't walk, they don't feel, and they dont even look remotely like humans. They look more like frogs.", 
   {}, 
   240736, 
   null, 
   1164246360.0
  ], 
  [
   240755, 
   null, 
   "chloe", 
   "\n My fingernail can be considered a smaller, less developed human...\n \n We don't know squat about inherit value...\n \n Like i said before, we don't know squat about value...\n \n We don't know anything about humans...\n \n\n \n Humans have inherent value and dignity.\n \n \n\n If the value is inherent, then what does it matter what others think? Value is by definition a relative term. Are you saying that pro-choice people value humanity less than pro-lifers? Because that statement, on the whole, is decidely not true. \n \n \n I still am quite capable to assign immense value to humanity and I do. In some circumstances I think the place humans in a superior positon to animals. \n\n \n \n It doesn't matter how many would tell you that you are not worth more than dirt, the truth is you are worth something and an inherent have value. \n \n However, according to those who disregard this inherent value, a person's value is based on another's opinion. All the \"people\" with all the power get to decide who has value. That is elitist and depressing. If there is a room filled with people, and half the room says bill is valuable but the other half says he is not, is he inherently valuable or not? Can the pro choice position answer this question. \n \n If you do not acknowledge that women have inherent value, you say that nothing distinguishes them from plants and animals. What a trivialization of the lives of millions of women.", 
   {}, 
   240727, 
   null, 
   1164256440.0
  ], 
  [
   240758, 
   null, 
   "Rekhyt2238", 
   "There is nothing more than our corporeal existence. The fetus (which is not a person, by the way) is living tissue. There are lots of living things, none of which have souls, or life-forces or whatever, because those things don't exist. There is nothing outside of biology that \"gives us life\" or gives life to anything else. Living things are simply alive. If you want to debate the definition of life, that's another can of worms. \n \n Again, what point are you trying to make?\n\n \n If we don't have a soul, or whatever you want to call it, then how are we so much more civilized and advanced than animals?", 
   {}, 
   240741, 
   null, 
   1164257700.0
  ], 
  [
   240760, 
   null, 
   "Rekhyt2238", 
   "Actually, you're the one who's gonna end up in hell for devaluing and discriminating against women.\n\n \n Well then you're gonna end up right there next to me for discriminating/killing fetus's.\n \n \nFetuses don't have souls.\n\n \n And you know this how? Do you know for a fact that fetus's, or even zygote's for that matter, don't have souls?", 
   {}, 
   240745, 
   null, 
   1164257880.0
  ], 
  [
   240774, 
   null, 
   "thelmoose", 
   " Humans have inherent value and dignity. \n\n OK. OK. Is anyone saying we have no value?\n You need to look up the word \"inherent\"\n \n \n \n \n It doesn't matter how many would tell you that you are not worth more than dirt, the truth is you are worth something and an inherent have value. \n \n\n Stop it. No one has said anything about humans and dirt. You keep repeating the same phrases. You are not listening. You are behaving as though you don't really have any original ideas, such that you cannot respond to the questions put to you. \n \n \n \n However, according to those who disregard this inherent value, a person's value is based on another's opinion. All the \"people\" with all the power get to decide who has value. That is elitist and depressing. If there is a room filled with people, and half the room says bill is valuable but the other half says he is not, is he inherently valuable or not? Can the pro choice position answer this question. \n \n\n What are you talking about?\n And please leave poor Bill out of this, whoever he is.\n \n \n \n \n If you do not acknowledge that women have inherent value, you say that nothing distinguishes them from plants and animals. What a trivialization of the lives of millions of women. \n\n \n Has anyone said this?\n Is this what you learn in home schooling?", 
   {}, 
   240755, 
   null, 
   1164300720.0
  ], 
  [
   240775, 
   null, 
   "thelmoose", 
   "If we don't have a soul, or whatever you want to call it, then how are we so much more civilized and advanced than animals?\n\n \n I don't want to call it anything as there is no such thing.\n \n Everyone knows that we are more civilized and advanced than animals because we have learned proper table manners and that it is important to promptly write thank you notes.", 
   {}, 
   240758, 
   null, 
   1164300960.0
  ], 
  [
   240788, 
   null, 
   "simone", 
   "Arghhh! Thelmooose! Why did you have to say that? My table manners are atrocious and, as for writing thank you notes promptly, argghhhh! Must I now be relegated to the realm of the beasts?", 
   {}, 
   240775, 
   null, 
   1164303060.0
  ], 
  [
   240801, 
   null, 
   "georged", 
   "Arghhh! Thelmooose! Why did you have to say that? My table manners are atrocious and, as for writing thank you notes promptly, argghhhh! Must I now be relegated to the realm of the beasts?\n\n \n Trading dinner invitations for Purina Chow is a personal choice.", 
   {}, 
   240788, 
   null, 
   1164305220.0
  ], 
  [
   240824, 
   null, 
   "Shooterandproud", 
   "Humans have inherent value and dignity.\n\n \n We don't know that. You can't back that up can you?\n \n \n \n \n It doesn't matter how many would tell you that you are not worth more than dirt, the truth is you are worth something and an inherent have value.[/quote]\n \n There is no truth in that. Stop trying to make it look like this \"inherit value\" is a fact. Its not, its just a weird hypothesis of yours and has not been proven. \n \n \nHowever, according to those who disregard this inherent value, a person's value is based on another's opinion. All the \"people\" with all the power get to decide who has value.\n\n \n You mean the people with power decides who to treat better and who not to?\n \n \nThat is elitist and depressing. If there is a room filled with people, and half the room says bill is valuable but the other half says he is not, is he inherently valuable or not?\n\n \n Lets just assume this value exists. The value would be based on feeling and consciousness. We as people have consciousness and feelings, not to mencion we feel pain. Fetuses do not, therefore we cannot associate this much \"value\" to fetuses as we do humans. Its not elitist, its just life. Deal with it.\n \n \nCan the pro choice position answer this question.\n\n \n Thats not the question. The question is, can the pro-life opinion answer this question? The pro lifers are risking women's health and well-being for an unproven \"value\" hypothesis that just might exist.\n \n \nIf you do not acknowledge that women have inherent value, you say that nothing distinguishes them from plants and animals. What a trivialization of the lives of millions of women.\n\n \n We don't know if women have any more value than plants. We do know that woman have consciousness, feel pain, and have real feelings. Plants do not, fetuses do not, therefore their needs must be regarded over the fetuses. A fetus can not make a descision, but the mother can. Therefore, we should leave it up to the mother to make the descision for her and her fetus, because she knows her circumstances best. You do not, the government does not, I do not.", 
   {}, 
   240755, 
   null, 
   1164312960.0
  ], 
  [
   240825, 
   null, 
   "Shooterandproud", 
   "If we don't have a soul, or whatever you want to call it, then how are we so much more civilized and advanced than animals?\n\n \n Starts with an E, ends with an N. I'll give you a hint, religious zealots are too ignorant to believe in it.", 
   {}, 
   240758, 
   null, 
   1164313080.0
  ], 
  [
   240826, 
   null, 
   "Shooterandproud", 
   "Well then you're gonna end up right there next to me for discriminating/killing fetus's.\n\n \n How do we know that fetuses are worth any more than ants? God has not said anything on this matter.\n \n \n \n \nAnd you know this how? Do you know for a fact that fetus's, or even zygote's for that matter, don't have souls?\n\n \n I anyone does have a soul, I would think it would be a living, breathing human. One who has feelings, and consciousness, and free will, as God has said. Not a hunk of flesh inside of a woman's stomach.", 
   {}, 
   240760, 
   null, 
   1164313140.0
  ], 
  [
   240842, 
   null, 
   "Tastyfish", 
   "We should all agree that there either is such a thing or there isn't. Many on the prolife side believe there is. Many on the prochoice side believe there is not. \n \n I sort of agree with you here, but I think its probably not quite so split down those lines. The majority of people who don't believe in them are probably pro-choice but I would guess that most people (at least in the US) do believe regardless of whose line they fall on.\n \n\n Many (if not the majority) prochoice people do not believe in the inherent dignity of women and therefore trivialize them by not acknowledging that they have more inherent value than plants, animals, and dust. It does not surprise me that these same individuals argue that the fetus (a smaller, less developed, dependent human) does not have any inherent value or worth. Yet it is quite strange that they would argue against infanticide, as if all of a sudden because the fetus starts breathing oxygen in a different way than it did 2 seconds before means that it has an \"inherent value\" that they don't even believe in. Ironic. \n\n I don't think many people would really fall in the camp that a woman has no inherent value but a fetus/child does. Its more that value doesn't exist as an abstract concept but instead its a measure of something's worth to someone else. Just because I don't think a woman has more value than a plant or so because of some ethereal inherent value, doesn't mean I think women are worthless - to me it seems that the woman is worth more than the plant in the traditional meaning of the word. I believe there is a reason that women and everyone else should be valued rather than it just being some property of the label 'woman'.\n \n\n Yet, is it not ironic that these same individuals will lash out and say that the prolife person is trivializing the lives of millions of women. It may be true that some prolifers do, but i would argue that they are not truly pro life. The pro life position says that human beings have inherent dignity and worth and not only pay the lipservice to this but walk out this belief.\n If you look at the reasons why we think women have value, then the reason for the lashing out becomes clear - if you don't believe that there is some constant value of a person regardless of their condition, then by forcing a pregnancy on them you are making them less important. If we value the ability to choose and determine our own lives, then by removing some of that you are reducing the overall worth of our lives. To pick a pretty extreme example, its similar to how someone suffering from an incurable medical condition might find their quality of life so low its not worth living.\n \n\n How can the pro choice argument based on this empty perspective have any credibility in this discussion if it denies that human beings have an inherent dignity and worth that distinguishes them from plants and animals. Isn't the idea of rights based on the idea that people are deserving of those rights because they have inherent value?\n Its actually you who is saying here that there is no difference between people and plants - I'm saying that the differences in value exist due to the differences between the two, rather than the only thing adding value to a person is some ethereal quality that can't be described. This is the important point to consider regarding the two points of view.\n \n\n Where is the logic in saying that women are not inherently worth more than a whale, but they are inherently more valuable than a fetus who in two seconds will become a \"person\".\n \n I value intelligence and a mind, as well as not suffering, as three of the most important things there are (their value stems originally from what I am willing to tolerate being done to me more or less). There is a ton of additional things that I think are important, and some of these apply to whales but more apply to women. Some properties that whales and women have in common are not found in a fetus (or at least an early one) and so I don't think a fetus is as important as a woman or a whale.", 
   {}, 
   240694, 
   null, 
   1164327240.0
  ], 
  [
   240845, 
   null, 
   "JPSartre12", 
   "The conversation has often been focused on if the fetus is a person and if the fetus has inherent value.\n \n \n What about the mother? \n \n Is the mother a person and does she have inherent value? Why or why not?\n\n All innocent people, born and unborn have inherent value.", 
   {}, 
   240336, 
   null, 
   1164331020.0
  ], 
  [
   240848, 
   null, 
   "Tastyfish", 
   "All innocent people, born and unborn have inherent value.\n\n \n Surely if they can lose that value though (with loss of innocence) its not actually inherent though. \n \n Thats before we even get to defining innocence as well, I don't see how you can apply that term to an embryo and have it actually mean something. Though that said, defining innocence is easier said than done (an absence of sin or ability to do 'bad things')", 
   {}, 
   240845, 
   null, 
   1164334740.0
  ], 
  [
   240851, 
   null, 
   "JPSartre12", 
   "Surely if they can lose that value though (with loss of innocence) its not actually inherent though. \n\n Good point. oor choice of words on my part. \n \n\n Thats before we even get to defining innocence as well, I don't see how you can apply that term to an embryo and have it actually mean something. Though that said, defining innocence is easier said than done (an absence of sin or ability to do 'bad things')\n\n I'd define innocence as the absence of guilt. emoticon_xgood", 
   {}, 
   240848, 
   null, 
   1164338880.0
  ], 
  [
   240856, 
   null, 
   "Tastyfish", 
   "Surely its the absence of guilt in something capable of generating it though, otherwise we've got plants and rocks in it as well (plus psychopathic serial killers - rare contenders for the innocent title). However in that case then the Embryo is not going to count for the same reasons physiologically similar things don't count", 
   {}, 
   240851, 
   null, 
   1164343740.0
  ], 
  [
   240862, 
   null, 
   "JPSartre12", 
   "Surely its the absence of guilt in something capable of generating it though, otherwise we've got plants and rocks in it as well (plus psychopathic serial killers - rare contenders for the innocent title). However in that case then the Embryo is not going to count for the same reasons physiologically similar things don't count\n\n \n I was thinking more in terms of murderers, you know, serious guilt. Everyone has some level of guilt but only a few deserver to die because of it.", 
   {}, 
   240856, 
   null, 
   1164353400.0
  ], 
  [
   240864, 
   null, 
   "Shooterandproud", 
   "I was thinking more in terms of murderers, you know, serious guilt. Everyone has some level of guilt but only a few deserver to die because of it.\n\n \n \n And who decides that?", 
   {}, 
   240862, 
   null, 
   1164356640.0
  ], 
  [
   240884, 
   null, 
   "Tastyfish", 
   "I was thinking more in terms of murderers, you know, serious guilt. Everyone has some level of guilt but only a few deserver to die because of it.\n\n But the very worst of the serial killers are the ones who don't feel empathy and have no conscience, thus they don't feel guilty for what they have done and might only consider it bad because they are aware that others do.\n \n Isn't a feeling of guilt an indication that they are sorry for what they have done as well? I'd still be worried more about the ones who didn't feel particularly guilty.", 
   {}, 
   240862, 
   null, 
   1164390960.0
  ], 
  [
   240886, 
   null, 
   "JPSartre12", 
   "But the very worst of the serial killers are the ones who don't feel empathy and have no conscience, thus they don't feel guilty for what they have done and might only consider it bad because they are aware that others do.\n \n Isn't a feeling of guilt an indication that they are sorry for what they have done as well? I'd still be worried more about the ones who didn't feel particularly guilty.\n\n \n I wasn't talking about their perception of guilt. I was speaking about their actual guilt of heinous crimes.", 
   {}, 
   240884, 
   null, 
   1164393780.0
  ], 
  [
   240887, 
   null, 
   "JPSartre12", 
   "And who decides that?\n\n \n A jury of their peers.", 
   {}, 
   240864, 
   null, 
   1164393840.0
  ], 
  [
   240890, 
   null, 
   "Tastyfish", 
   "I wasn't talking about their perception of guilt. I was speaking about their actual guilt of heinous crimes.\n\n \n Fair enough, I was going to say something about that but didn't want to make yet another langauge point (English really is awful for this sort of thing).\n \n You've still not addressed the issue that surely the ability to commit heinous crimes is required to actually be innocent in some way, unless 'innocence' isn't actually the issue here at all.", 
   {}, 
   240886, 
   null, 
   1164394320.0
  ], 
  [
   240895, 
   null, 
   "Shooterandproud", 
   "A jury of their peers.\n\n \n No, not in terms of punishment. I mean who decides what is wrong and what is right in the long run? God? We may have different preceptions of what is guilty and what is not. Im just saying, that something that you think is guilt may not be.", 
   {}, 
   240887, 
   null, 
   1164397020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  a point too often passed over", 
  "url": "http://www.4forums.com/political/abortion-debates/9211-point-too-often-passed-over.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9211, 
  "discussion_files": [
   [
    "18686.html", 
    "http://www.4forums.com/political/abortion-debates/9211-point-too-often-passed-over-print.html"
   ], 
   [
    "18687.html", 
    "http://www.4forums.com/political/abortion-debates/9211-point-too-often-passed-over-6-print.html"
   ], 
   [
    "18688.html", 
    "http://www.4forums.com/political/abortion-debates/9211-point-too-often-passed-over-4-print.html"
   ], 
   [
    "18689.html", 
    "http://www.4forums.com/political/abortion-debates/9211-point-too-often-passed-over-5-print.html"
   ], 
   [
    "18690.html", 
    "http://www.4forums.com/political/abortion-debates/9211-point-too-often-passed-over-3-print.html"
   ], 
   [
    "18691.html", 
    "http://www.4forums.com/political/abortion-debates/9211-point-too-often-passed-over-2-print.html"
   ]
  ], 
  "identifier": 9211
 }
]