[
 [
  [
   240581, 
   null, 
   "Liminus", 
   "Well hi there! It has been four months since my last confession...\n \n I have been without personal internet access over the summer, but having recently availed myself of several hundred pounds worth of awesome processing power I feel the need to once again make myself heard ...\n \n There is little anyone can do to argue against the credibility of the Stern report, my question is what are the views on how to tackle the problems?\n \n Here is a brief rundown of the basics of the report:\n \n \n\n \n \n 12.15pm\n Stern report: the key points\n \n \n Hilary Osborne\n Monday October 30, 2006\n Guardian Unlimited\n \n The dangers\n \n · All countries will be affected by climate change, but the poorest countries will suffer earliest and most.\n \n · Average temperatures could rise by 5C from pre-industrial levels if climate change goes unchecked.\n \n · Warming of 3 or 4C will result in many millions more people being flooded. By the middle of the century 200 million may be permanently displaced due to rising sea levels, heavier floods and drought.\n \n · Warming of 4C or more is likely to seriously affect global food production.\n \n Article continues\n · Warming of 2C could leave 15-40% species facing extinction.\n \n · Before the industrial revolution level of greenhouse gases in the atmosphere was 280 parts per million (ppm) CO2 equivalent (CO2e); the current level is 430ppm CO2e. The level should be limited to 450-550ppm CO2.\n \n · Anything higher would substantially increase risks of very harmful impacts. Anything lower would impose very high adjustment costs in the near term and might not even be feasible.\n \n · Deforestation is responsible for more emissions than the transport sector.\n \n · Climate change is the greatest and widest-ranging market failure ever seen.\n \n Recommended actions\n \n · Three elements of policy are required for an effective response: carbon pricing, technology policy and energy efficiency.\n \n · Carbon pricing, through taxation, emissions trading or regulation, will show people the full social costs of their actions. The aim should be a global carbon price across countries and sectors.\n \n · Emissions trading schemes, like that operating across the EU, should be expanded and linked.\n \n · Technology policy should drive the large-scale development and use of a range of low-carbon and high-efficiency products.\n \n · Globally, support for energy research and development should at least double; support for the deployment of low-carbon technologies should be increased my up to five times.\n \n · International product standards could be introduced.\n \n · Large-scale international pilot programmes to explore the best ways to curb deforestation should be started very quickly.\n \n · Climate change should be fully integrated into development policy, and rich countries should honour pledges to increase support through overseas development assistance.\n \n · International funding should support improved regional information on climate change impacts.\n \n · International funding should go into researching new crop varieties that will be more resilient to drought and flood.\n \n Economic impacts\n \n · The benefits of strong, early action considerably outweigh the costs.\n \n · Unabated climate change could cost the world at least 5% of GDP each year; if more dramatic predictions come to pass, the cost could be more than 20% of GDP.\n \n · The cost of reducing emissions could be limited to around 1% of global GDP; people could be charged more for carbon-intensive goods.\n \n · Each tonne of CO2 we emit causes damages worth at least $85, but emissions can be cut at a cost of less than $25 a tonne.\n \n · Shifting the world onto a low-carbon path could eventually benefit the economy by $2.5 trillion a year.\n \n · By 2050, markets for low-carbon technologies could be worth at least $500bn.\n \n · What we do now can have only a limited effect on the climate over the next 40 or 50 years, but what we do in the next 10-20 years can have a profound effect on the climate in the second half of this century.\n\n \n The Stern Report:\n http://www.hm-treasury.gov.uk/Independent_Reviews/stern_review_economics_climate_change/sternreview_index.cfm", 
   {
    "post_info": {
     "post_title": "The Stern Report"
    }
   }, 
   null, 
   null, 
   1164097260.0
  ], 
  [
   241934, 
   null, 
   "JPSartre12", 
   "Well hi there! It has been four months since my last confession...\n \n I have been without personal internet access over the summer, but having recently availed myself of several hundred pounds worth of awesome processing power I feel the need to once again make myself heard ...\n \n There is little anyone can do to argue against the credibility of the Stern report, my question is what are the views on how to tackle the problems?\n \n \n\n \n Same old BS, this time in green. I'm still not buying it.\n \n \n\n The Stern review's cornerstone argument for immediate and strong action now is based on the suggestion that doing nothing about climate change costs 20% of GDP now, and doing something only costs 1%. However, this argument hinges on three very problematic assumptions. \n First, it assumes that if we act, we will not still have to pay. But this is not so--Mr. Stern actually tells us that his solution is \"already associated with significant risks.\" Second, it requires the cost of action to be as cheap as he tells us--and on this front his numbers are at best overly optimistic. Third, and most importantly, it requires the cost of doing nothing to be a realistic assumption: But the 20% of GDP figure is inflated by an unrealistically pessimistic vision of the 22nd century, and by an extreme and unrealistically low discount rate. According to the background numbers in Mr. Stern's own report, climate change will cost us 0% now and 3% of GDP in 2100, a much more informative number than the 20% now and forever.\n \n In other words: Given reasonable inputs, most cost-benefit models show that dramatic and early carbon reductions cost more than the good they do. Mr. Stern's attempt to challenge that understanding is based on a chain of unlikely assumptions.\n \n Moreover, there is a fourth major problem in Mr. Stern's argument that has received very little attention. It seems naive to believe that the world's 192 nations can flawlessly implement Mr. Stern's multitrillion-dollar, century-long policy proposal. Will nobody try to avoid its obligations? Why would China and India even participate? And even if China got on board, would it be able to implement the policies? In 2002, China decided to cut sulfur dioxide (SO2) emissions by 10%--they are now 27% higher despite SO2 being nationally a much bigger health and environmental problem than climate change.\n http://www.opinionjournal.com/extra/?id=110009182\n \n", 
   {}, 
   240581, 
   null, 
   1165110540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Stern Report", 
  "url": "http://www.4forums.com/political/environmental-debates/9216-stern-report.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 9216, 
  "discussion_files": [
   [
    "20594.html", 
    "http://www.4forums.com/political/environmental-debates/9216-stern-report-print.html"
   ]
  ], 
  "identifier": 9216
 }
]