[
 [
  [
   240945, 
   null, 
   "dani6nv", 
   "Lost in confusion and total self bliss\n I've found the relation between 'dream' and wish\n A dream is a fantasy lived only while asleep\n But a wish has a compass vast, far and deep.\n \n A dream can bring true the wish never thought\n As your mind wanders aimlessly and feelings are sought.\n But a wish is a simple momentous undertaking\n A grasping of things while still in the making.\n \n Now my understanding of wish and of dreams\n Have broadened my scope - or so it would seem\n But still I'm confused and nothing is clear\n Because you are a wish yet a dream so dear.\n \n With the breath of each day, I wish for your sight\n Visions of loveliness turned to dreams in the night\n You've become such a fantasy with realistic tones\n I long for your love and time spent alone\n \n Sadly enough my dreams cause confusion\n For all the purpose are meager illusion\n And though the dawn of each day may be cheerful to sight\n I fear the darkness and my continuing fight.\n \n For now it's a war - a battle within\n A dreadful nightmare which rationality must win\n What should I do? Where shall I begin?\n Should I ask for your love or remain 'a dear friend'?\n \n In my dreams you're my lover and my world is complete\n But in life your a martyr to hope so elite\n I've grown to know you and care with a passion\n But fear lies within 'mutual' attraction.\n \n If I am to approach you with some indication\n Would I strengthen our friendship or cause detonation?\n This is the confusion, the struggle, the fight,\n Until I'm am sure you'll remain a dream in the night", 
   {
    "post_info": {
     "post_title": "A Dream In The Night"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1164436560.0
  ], 
  [
   240981, 
   null, 
   "Rekhyt2238", 
   "Very nice...Poetry really isn't my thing, but I quite enjoyed this.", 
   {}, 
   240945, 
   null, 
   1164486780.0
  ], 
  [
   240989, 
   null, 
   "Shooterandproud", 
   "Very nice...Poetry really isn't my thing, but I quite enjoyed this.\n\n \n Yes, i agree. Very creative.", 
   {}, 
   240981, 
   null, 
   1164491940.0
  ], 
  [
   249092, 
   null, 
   "SpicyGirl", 
   "I love it!! Very meaningful!!", 
   {}, 
   240989, 
   null, 
   1170296520.0
  ], 
  [
   256185, 
   null, 
   "Zardoz", 
   "Hunh, this forum has a poetry section...\n \n As to the poem, I will say it is remarkably beautiful and well constructed. If original, worth marketing, if not...shame on you. ;)\n \n Brought a tear to my callous eyes it did.", 
   {}, 
   249092, 
   null, 
   1175306820.0
  ], 
  [
   256568, 
   null, 
   "Dono", 
   "You took a Little license with some of the rhyming, but all in all, very good.", 
   {}, 
   256185, 
   null, 
   1175578560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Dream In The Night", 
  "url": "http://www.4forums.com/political/writings/9229-dream-night.html", 
  "breadcrumbs": [
   "Writings"
  ], 
  "id_number": 9229, 
  "discussion_files": [
   [
    "13490.html", 
    "http://www.4forums.com/political/writings/9229-dream-night-print.html"
   ]
  ], 
  "identifier": 9229
 }
]