[
 [
  [
   241086, 
   null, 
   "unlawflcombatnt", 
   "November 20th's report on the economy, the Leading Indicator index, was touted as still further evidence of how \"strong\" our economy is. \n \n The Leading Indicator report, considered a broad overview of the direction of our economy, was reported as increasing + 0.2%, slightly below the expected +0.3% predicted. A review of how today's total was calculated, however, reveals much cause for concern. Many important indexes declined. Many of the positives were only weakly positive. Manufacturers' new orders for non-defense capital goods declined 7% over the last month, for an annualized rate of decline of -84%. Building Permits declined 6.3% over the last month alone, and have and have declined 22% since April. Though Manufacturers' New Orders for Consumer Goods increased slightly (+0.4%), they are still 2% below August levels, and 4% below June's level. Even the big \"gainers\" are of dubious benefit. One big gainer was Stock Prices, which added +0.13% to the total index. Another gainer was the index of Consumer Expectations, which was +0.19. (Indicating media spin about the economy has been very successful.) The Average Workweek increased from 41.1 hours in August to 41.2 hours in October. This added +0.06 to the total. However, the Average Workweek was less than it was in August, July, and June, and the same as it was in May and April. Another very dubious positive. \n \n The biggest gainer, however, was the increase in M2 money supply of 1.2% over the last month. This added a total of +0.43 points to the total +0.2 number. Had the money supply increase been 0, Leading Indicators would have shown a net change of -0.23%. Had the increase in money supply been the same as the previous month's +0.2%, the total Leading Indicator Index would have been -0.03%. Making the M2 number still more dubious is the fact that it is not an actual \"recorded\" statistic. It's an \"imputed\" statistic, meaning it is an estimate (quesstimate?) Meanwhile, the indicator considered most predictive of the health of the economy, the interest rate spread, was -0.52%.\n \n Below is a copy of November 20th's Leading Indicator report from the Conference Board.\n \n http://i27.photobucket.com/albums/c190/unlawflcombatnt/11-20-06grphLdngIndicConfBrd-XX.gif\n \n The Conference Board's Leading Indicator report can be found at:\n http://www.conference-board.org/pdf_free/economics/bci/lei1106.pdf\n \n \n Though this month's reading is touted as being \"positive,\" a closer review indicates how spurious and artificial this increase is. Many of us cannot understand how an increase in the M2 money supply can be considered a positive. Stripping out the money supply increase alone would make Leading Indicators negative for October. Furthermore, is it really a \"positive\" for the money supply to increase at a 14.4% annualized rate in one month? Are we now considering inflation a positive indicator?\n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary\n \n _________________\n The economy needs balance between the \"means of production\" & \"means of consumption.\"", 
   {
    "post_info": {
     "post_title": "Economy: The Leading Indicators Farce"
    }
   }, 
   null, 
   null, 
   1164589440.0
  ], 
  [
   241236, 
   null, 
   "GreenMtnBoy", 
   "Many of the positives were only weakly positive. Manufacturers' new orders for non-defense capital goods declined 7% over the last month, for an annualized rate of decline of -84%. \n\n \n This is incorrect. Twelve months of 7% loss is not 84%. You got that by 7x12. The correct method is 0.93^12, which is a loss of 58%. This doesn't even touch the fact that you can't extrapolate one month into a year. Analysts compare a month to the same month in previous years.", 
   {}, 
   241086, 
   null, 
   1164705660.0
  ], 
  [
   241238, 
   null, 
   "unlawflcombatnt", 
   "This is incorrect. Twelve months of 7% loss is not 84%. You got that by 7x12. The correct method is 0.93^12, which is a loss of 58%. This doesn't even touch the fact that you can't extrapolate one month into a year. Analysts compare a month to the same month in previous years.\n\n \n Yes, 84% is correct. That's exactly how it's done when the information is \"positive,\" because I've gone through their calculations a couple of hundred times. And, yes, analysts certainly do make annualized extrapolations, but apparently it's only acceptable when it's positive. They did it every month for several years with housing, among other stats. \n \n According to you, it's suddenly not acceptable to apply an annualized rate to a 1-month change, simply because it's negative.\n \n Talk about unmitigated Corporatocratic Right-Wing spin. \n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary\n \n _________________\n The economy needs balance between the \"means of production\" & \"means of consumption.\"", 
   {
    "post_info": {
     "post_title": "Yes, it IS correct"
    }
   }, 
   241236, 
   null, 
   1164708900.0
  ], 
  [
   241259, 
   null, 
   "georged", 
   "This is incorrect. Twelve months of 7% loss is not 84%. You got that by 7x12. The correct method is 0.93^12, which is a loss of 58%. This doesn't even touch the fact that you can't extrapolate one month into a year. Analysts compare a month to the same month in previous years.\n\n \n One major difference between government/tame (house) economists and business is you can't run a business on same month comparisons. While that's a handy number for evaluation of marketing programs and other internal strategies, YTD versus forecast and prior YTD provide graphic trend. The US public would more than likely panic if their talking heads ever provided them with valid YTD numbers of anything.", 
   {}, 
   241236, 
   null, 
   1164730860.0
  ], 
  [
   242155, 
   null, 
   "unlawflcombatnt", 
   "The US public would more than likely panic if their talking heads ever provided them with valid YTD numbers of anything.\n\n \n Exactly. Public mis-conception of our economy is exactly what the main stream media's financial analysts want, because they want to keep consumers spending, and not worrying about tomorrow. \n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary\n \n _________________\n The economy needs balance between the \"means of production\" & \"means of consumption.\"", 
   {
    "post_info": {
     "post_title": "Yes"
    }
   }, 
   241259, 
   null, 
   1165275540.0
  ], 
  [
   242167, 
   null, 
   "Missouri Mule", 
   "I see. More tinfoil scaremongering. If I had a dollar for every time I have seen this kind of stuff I'd be a billionaire.", 
   {}, 
   242155, 
   null, 
   1165283520.0
  ], 
  [
   242195, 
   null, 
   "unlawflcombatnt", 
   "I see. More tinfoil scaremongering. If I had a dollar for every time I have seen this kind of stuff I'd be a billionaire.\n\n \n Hmmm. If you'd seen it that many times, you might start wondering if it isn't true, wouldn't you?\n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary\n \n _________________\n The economy needs balance between the \"means of production\" & \"means of consumption.\"", 
   {
    "post_info": {
     "post_title": "Billionaire"
    }
   }, 
   242167, 
   null, 
   1165295820.0
  ], 
  [
   242200, 
   null, 
   "Missouri Mule", 
   "Hmmm. If you'd seen it that many times, you might start wondering if it isn't true, wouldn't you?\n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary\n \n _________________\n The economy needs balance between the \"means of production\" & \"means of consumption.\"\n\n \n I guarantee you that there is a plethora of information about everything that is designed to scare the gullible and earn a fortune for the charlatans who ply their trade. And it's not just economics. It's in the field of medicine. It's everywhere you or anyone cares to look. These bloggers and self-styled experts who promise the moon but deliver nothing are laughing all the way to the bank. Even the experts; and I mean the real experts, don't agree on how the economy is going to go. Sometimes they are right but just as often they are wrong. We have experienced unprecedented prosperity that we could only have dreamed of before. And it can roughly be dated from the time that President Reagan took over from the nincompoop Carter who didn't know his tailpipe from a hole in the ground. Just like FDR before him, the truth was that the only thing we have to fear is fear itself. If we continue with this silliness of denigrating the economy someday it will be proven correct. Even a broken clock is right twice a day. But free market economies have yet to repeal the business cycles although we have tried very hard. We may yet have a hard landing and some hard times but it won't be because of of the shysters and con artists who find another sucker to believe that \"revealed truth\" is just around the corner. \n \n All a person has to do is to look at the actual statistics. Read the CIA reports of every country in the world and ask yourself where you want to live. It will be the United States of America.", 
   {}, 
   242195, 
   null, 
   1165302660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Economy: The Leading Indicators Farce", 
  "url": "http://www.4forums.com/political/economics-debates/9237-economy-leading-indicators-farce.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 9237, 
  "discussion_files": [
   [
    "10594.html", 
    "http://www.4forums.com/political/economics-debates/9237-economy-leading-indicators-farce-print.html"
   ]
  ], 
  "identifier": 9237
 }
]