[
 [
  [
   241264, 
   null, 
   "simone", 
   "I am so angry! We are immersed in a horrific quagmire in Iraq because a bunch of wilfully stupid religious XXXXXX elected George Walker Bush as our president.\n \n I will never be able to forive them.\n \n Some Six Hundred Sixty-Five Thousand Dead Iraqi civilians, men, women and chilldren!\n \n Nearly Three Thousand Dead American Soldiers!\n \n Tens of Thousands of Wounded and Disabled Americans?\n \n Billions of Dollars Each Week into the Toilet because of this wilfully blind religiosity!\n \n You will never be forgiven for your enormous evils.", 
   {
    "post_info": {
     "post_title": "The Wilful Blindness of Religion"
    }
   }, 
   null, 
   null, 
   1164731700.0
  ], 
  [
   241306, 
   null, 
   "Easyrider", 
   "Translation: Simone wants Saddam, the Butcher of Baghdad, back in power to murder, gas, rape, and pillage some more.", 
   {}, 
   241264, 
   null, 
   1164756480.0
  ], 
  [
   241308, 
   null, 
   "RoyLennigan", 
   "Translation: Simone wants Saddam, the Butcher of Baghdad, back in power to murder, gas, rape, and pillage some more.\n\n \n right... sure firgured that one out. i'm glad you were there to read through the lines and get it right. emoticon_rolleyes\n \n but just because americans don't know what they want and so they constantly feel like they need to screw around with the lives of others in the 'pursuit of happiness' doesn't necessarily mean they're \"willfully stupid religious XXXXXX.\" its not their fault they don't know any better. its the fault of everyone who cut back on education taxes in favor of defense spending and drug wars. its the fault of everyone who is afraid of change. its the fault of everyone who just turned their heads so they didn't have to see anyone get shot.\n \n at least when you have a dictator like saddam you know who the badguy is.", 
   {}, 
   241306, 
   null, 
   1164756840.0
  ], 
  [
   241319, 
   null, 
   "Matthew S", 
   "Translation: Simone wants Saddam, the Butcher of Baghdad, back in power to murder, gas, rape, and pillage some more.\n\n \n And there is a difference between that and what is happening now?", 
   {}, 
   241306, 
   null, 
   1164771540.0
  ], 
  [
   241337, 
   null, 
   "Easyrider", 
   "That's two more votes for going back to the Butcher of Baghdad. Maybe a chant or two now would be appropos?\n \n For the record, we're trying to establish a peaceful democracy in Iraq. It's the radical Muslim butchers who are screwing everything up. But the liberal left, for some reason, never wants to talk about them being the bad guys, and they have no credible alternative for dealing with them, except for their usual cut and run and let evil Iran and Al Queda take over Iraq so we have an even bloodier mess to look forward to one day. That's how far from reality their thinking is.", 
   {}, 
   241319, 
   null, 
   1164778500.0
  ], 
  [
   241387, 
   null, 
   "simone", 
   "Translation: Simone wants Saddam, the Butcher of Baghdad, back in power to murder, gas, rape, and pillage some more.\nHmmm, the preceding sounds very like the ravings of a brain-dead zealot.\n \n To set the record straight, I have always considered Saddam Hussein to be a murderous thug. However, he was NEVER MY MURDEROUS thug.\n \n I did not install him in power. I would have looked at his record of murderous thuggery and been adamantly opposed to installing him as the leader of Iraq, but American Republicans felt otherwise. They loved their dear little murderously thuggish Saddam Hussein. They loved their sweet little Butcher of Baghdad. It's all the Republican way, you know!\n \n Studying a wee bit of actual history never hurts, ya know.\n \n But, when Creationists have the hideously idiotic view that God created the universe 1,000 years after the Sumerians invented glue, what can you possibly expect?", 
   {}, 
   241306, 
   null, 
   1164819840.0
  ], 
  [
   241405, 
   null, 
   "Matthew S", 
   "That's two more votes for going back to the Butcher of Baghdad. Maybe a chant or two now would be appropos?\n \n For the record, we're trying to establish a peaceful democracy in Iraq. It's the radical Muslim butchers who are screwing everything up. But the liberal left, for some reason, never wants to talk about them being the bad guys, and they have no credible alternative for dealing with them, except for their usual cut and run and let evil Iran and Al Queda take over Iraq so we have an even bloodier mess to look forward to one day. That's how far from reality their thinking is.\n\n Sadam supressed religious fundamentalism. He was a secular leader. I can see why you, as a fundmentalist, would not like that.\n The people in Iraq don't want a peaceful democracy. They want a fundmentalist islamic state that forces religious dogma and law upon peoples lives. If it where a fundamentalist christian state you would feel very much at home.", 
   {}, 
   241337, 
   null, 
   1164823620.0
  ], 
  [
   241446, 
   null, 
   "unkerpaulie", 
   "Translation: Simone wants Saddam, the Butcher of Baghdad, back in power to murder, gas, rape, and pillage some more.\n\n we are murdering iraqis at a faster rate than saddam, and its costing us billions of dollars. all we are doing is taking over from where saddam left off. he was actually better for the iraqi people than we are. the statistics should clearly tell you that\n \n the reason you cant see the obvious is right there in the title of the thread: religious blindness. you believe saddam is evil based on what bush said based on the doctored intel he coerced out of his intel sources. you arent looking at the facts, only at the hype. facts dont appeal to you, only emotional manipulation. this is what all religion is founded upon: discard facts, make desicions based on emotional influence", 
   {}, 
   241306, 
   null, 
   1164836100.0
  ], 
  [
   241449, 
   null, 
   "unkerpaulie", 
   "For the record, we're trying to establish a peaceful democracy in Iraq. It's the radical Muslim butchers who are screwing everything up. But the liberal left, for some reason, never wants to talk about them being the bad guys, and they have no credible alternative for dealing with them, except for their usual cut and run and let evil Iran and Al Queda take over Iraq so we have an even bloodier mess to look forward to one day. That's how far from reality their thinking is.\n\n again, let me show the difference between emotional opinion and fact. you believe that we are trying to establish a peaceful democracy in iraq. you believe that we're supposed to be in iraq because you believe that saddam was an eminent threat to the US and the world. you believe that al qaeda and iran were on the verge of taking over iraq. you believe all of this based on absolutely no facts.\n \n the fact is that we are killing more iraqi people faster than saddam did during his 30 year reign. the fact is that iraq and al qaeda were never allies. the fact is that saddam was by no means a threat to anybody. the fact is that bin laden is at large and relatively little is being done to pursue him. the fact is that of all the middle east countries that could be a source of terrorism, iraq is one of the least capable. \n \n open your eyes, easyrider", 
   {}, 
   241337, 
   null, 
   1164836940.0
  ], 
  [
   241467, 
   null, 
   "jyoshu", 
   "I am so angry! We are immersed in a horrific quagmire in Iraq because a bunch of wilfully stupid religious XXXXXX elected George Walker Bush as our president.\n \n I will never be able to forive them.\n \n Some Six Hundred Sixty-Five Thousand Dead Iraqi civilians, men, women and chilldren!\n\n \n Wait a minute! It was around 500,000 (an already unfounded #) according to your post a couple of days ago in the politics forum. \n \n Where's your inside source that says it went up 165,000 in 2 days? \n \n Admit it ... You're just making this up as you go along, aren't you? emoticon_xgood", 
   {}, 
   241264, 
   null, 
   1164844080.0
  ], 
  [
   241469, 
   null, 
   "Easyrider", 
   " again, let me show the difference between emotional opinion and fact. you believe that we are trying to establish a peaceful democracy in iraq. you believe that we're supposed to be in iraq because you believe that saddam was an eminent threat to the US and the world. you believe that al qaeda and iran were on the verge of taking over iraq. you believe all of this based on absolutely no facts.\n\n \n So now you want to add Iran, whose President has publicly stated he wants to destroy Israel, and whom many believe to be working day and night to acquire nukes, to evil Saddam, who already invaded Kuwait and butchered and raped innocent Kuwaiti's? What planet do you live on to where you think these people posed no threat to anyone? What do you and Simone, etc., need, another 9/11 or worse to wake you up again?\n \n \n the fact is that we are killing more iraqi people faster than saddam did during his 30 year reign.\n\n \n I believe we're doing our best to target the bad guys, not innocent Iraqis as you try to lump them all in together.\n \n \n the fact is that iraq and al qaeda were never allies. the fact is that saddam was by no means a threat to anybody. the fact is that bin laden is at large and relatively little is being done to pursue him. the fact is that of all the middle east countries that could be a source of terrorism, iraq is one of the least capable. \n \n open your eyes, easyrider\n\n \n Open your own eyes, sport. \n \n Actually, there were many Saddam / Al Queda connections, as Stephen Hayes and Thomas Joscelyn, writing in the Weekly Standard, spell out under the headline \"The Mother of All Connections.\" Since the fall of Saddam, the U.S. has had extraordinary access to documents of the former Baathist regime, and is still sifting through millions of them. Messrs. Hayes and Joscelyn take some of what is already available, combined with other reports, documentation and details, some from before the overthrow of Saddam, some after. For page after page, they list connections--with names, dates and details such as the longstanding relationship between Osama bin Laden's top deputy, Ayman al-Zawahiri, and Saddam's regime. \n \n Messrs. Hayes and Joscelyn raise, with good reason, the question of why Saddam gave haven to Abdul Rahman Yasin, one of the men who in 1993 helped make the bomb that ripped through the parking garage of the World Trade Center. They detail a contact between Iraqi intelligence and several of the Sept. 11 hijackers in Malaysia, the year before al Qaeda destroyed the twin towers. They recount the intersection of Iraqi and al Qaeda business interests in Sudan, via, among other things, an Oil for Food contract negotiated by Saddam's regime with the al-Shifa facility that President Clinton targeted for a missile attack following the African embassy bombings because of its apparent connection to al Qaeda. And there is plenty more.\n \n http://www.opinionjournal.com/columnists/cRosett/?id=110006953\n \n Even Hillary Clinton acknowledged the Saddam-Al Qaeda connection in her speech announcing support for the authorization of the use of force against Iraq in 2002. She said, \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capabilities, and his nuclear program. He has also given aid, comfort and sanctuary to terrorists, including Al Qaeda members.\"\n \n Of course then you have the Answar Al-Islam Al Queda terrorist camp on Iraq soil that Saddam conveniently turned a blind eye towards.", 
   {}, 
   241449, 
   null, 
   1164844620.0
  ], 
  [
   241477, 
   null, 
   "simone", 
   "Wait a minute! It was around 500,000 (an already unfounded #) according to your post a couple of days ago in the politics forum. \n \n Where's your inside source that says it went up 165,000 in 2 days? \n \n Admit it ... You're just making this up as you go along, aren't you? emoticon_xgood\nUm, before you expire in a fit of hysteria, you must certainly be aware that there are all sorts of stats on how many Iraqi civilians were slaughtered as a result of the American invasion and occupation of Iraq. Now, if you like you can certainly stick to your biased stats but according to the highly respected British medical journal, The Lancet:\n \n http://librarypulse.blogspot.com/2006/10/665000-iraqi-deaths-blamed-on-war.html\n \n 665,000 Iraqi deaths since 2003 have been directly caused by the war. That 's in addition to the 1,751 Americans killed and 20,468 wounded. Check out the report.\n \n http://i.a.cnn.net/cnn/2006/images/10/11/human.cost.of.war.pdf", 
   {}, 
   241467, 
   null, 
   1164849180.0
  ], 
  [
   241489, 
   null, 
   "obvious_child", 
   "Anyone who thinks that Democracy will work in the Middle East, particulary on a rapid time frame and without the basic insitutions, values and foundations is a idiot. It pains me that Bush gave in and appeased the Kurds and Shiites. He should have just kept with the Dictator idea. We'd be long gone by now. \n \n Iraq needs a strong Murbark-like dictator to put the boot down on anyone who rebels. If the Shiites and Sunnis wish to behave like animals, we should treat them like animals. Secret police, death squads, torture, the works. \n \n We should have never invaded in first place. And I remember, it was YOU EASYRIDER who fled like a coward on a debate over the threat that Iraq posed. You won't even defend your belief that Iraq was a threat yet you parrot the line over and over again.", 
   {}, 
   241477, 
   null, 
   1164853380.0
  ], 
  [
   241490, 
   null, 
   "obvious_child", 
   "Actually, there were many Saddam / Al Queda connections, as Stephen Hayes and Thomas Joscelyn, writing in the Weekly Standard, spell out under the headline \"The Mother of All Connections.\" Since the fall of Saddam, the U.S. has had extraordinary access to documents of the former Baathist regime, and is still sifting through millions of them. Messrs. Hayes and Joscelyn take some of what is already available, combined with other reports, documentation and details, some from before the overthrow of Saddam, some after. For page after page, they list connections--with names, dates and details such as the longstanding relationship between Osama bin Laden's top deputy, Ayman al-Zawahiri, and Saddam's regime.\n\n \n We already went over that\n \n You're just parroting the same lines. Typical creationist tactic.\n \n Do you have anything NEW that HASN'T been REFUTED?\n \n Hillary Clinton is a hack. \n \n \nOf course then you have the Answar Al-Islam Al Queda terrorist camp on Iraq soil that Saddam conveniently turned a blind eye towards.\n\n \n Kind of hard to influence a area that is essentially autonoumous now isn't it?\n \n Let's also forget that the camp that we found outside of Baghad, the one with the Jet liner was a anti-terrorist training camp used in the 80s to train aganist the numerous Iranian backed hijackings of Iraqi airliners.", 
   {}, 
   241469, 
   null, 
   1164853740.0
  ], 
  [
   241500, 
   null, 
   "trebor", 
   "Um, before you expire in a fit of hysteria, you must certainly be aware that there are all sorts of stats on how many Iraqi civilians were slaughtered as a result of the American invasion and occupation of Iraq. Now, if you like you can certainly stick to your biased stats but according to the highly respected British medical journal, The Lancet:\n \n http://librarypulse.blogspot.com/2006/10/665000-iraqi-deaths-blamed-on-war.html\n \n 665,000 Iraqi deaths since 2003 have been directly caused by the war. That 's in addition to the 1,751 Americans killed and 20,468 wounded. Check out the report.\n \n http://i.a.cnn.net/cnn/2006/images/10/11/human.cost.of.war.pdf\n\n \n That is just one groups estimate.. and I am not sure their methodology was good. On the other hand, the total announced by the Iraqi Health minister was an estimate of 150,000, which , although it is less than 1/4th of the estimate of the British Journal, still is a very large number.", 
   {}, 
   241477, 
   null, 
   1164858300.0
  ], 
  [
   241508, 
   null, 
   "bmittking", 
   "we are murdering iraqis at a faster rate than saddam, and its costing us billions of dollars. all we are doing is taking over from where saddam left off. he was actually better for the iraqi people than we are. the statistics should clearly tell you that\n\n \n But Easyrider doesn't look at statistics. According to him and President Bush and most of the right-wing nut jobs, all factual information has a liberal bias and is false. They prefer just to listen to the extremely one-sided bible of the Crusaders, Inquisitions, and Pogroms, and the even more one-sided \"facts\" coming from the mouth of the Baron of Bullcrap, a.k.a. President Dubya", 
   {}, 
   241446, 
   null, 
   1164859620.0
  ], 
  [
   241510, 
   null, 
   "Shooterandproud", 
   "Translation: Simone wants Saddam, the Butcher of Baghdad, back in power to murder, gas, rape, and pillage some more.\n\n \n Translation: Muslims are worth nothing. Christianity is superior, therefore they are worth nothing. Let the US come in and kill them, ruin their cities, and take their oil.", 
   {}, 
   241306, 
   null, 
   1164860100.0
  ], 
  [
   241511, 
   null, 
   "bmittking", 
   "We already went over that\n \n You're just parroting the same lines. Typical creationist tactic.\n\n \n You can't really blame him. There are only so many semi-credible lies that the religious right can churn out.", 
   {}, 
   241490, 
   null, 
   1164860160.0
  ], 
  [
   241514, 
   null, 
   "bmittking", 
   "I am so angry! We are immersed in a horrific quagmire in Iraq because a bunch of wilfully stupid religious XXXXXX elected George Walker Bush as our president.\n\n \n Technically, the willfully stupid religious XXXXXX were outnumbered by the dems in 2000, but the reps do have all the money and  are given the advantage from the electoral votes.\n \n http://www.fec.gov/pubrec/2000presgeresults.htm\n These are the actual government records, and you can clearly see that Gore had a half a million vote lead on Bush with the popular vote.", 
   {}, 
   241264, 
   null, 
   1164860280.0
  ], 
  [
   241515, 
   null, 
   "Shooterandproud", 
   "That's two more votes for going back to the Butcher of Baghdad. Maybe a chant or two now would be appropos?\n\n \n And heres one vote for killing them all and taking their oil.\n \n \n \nFor the record, we're trying to establish a peaceful democracy in Iraq.\n\n \n Billions of dollars and millions of innocent lives is not what I call a \"peaceful democracy\".\n \n \n \nIt's the radical Muslim butchers who are screwing everything up.\n\n \n Classic christian cheap tactic. Blame the muslims.\n \n \nBut the liberal left, for some reason, never wants to talk about them being the bad guys,\n\n \n They are not dangerous and no threat to us. This administration is ruling in fear, nothing more. To me, were fighting the wrong terrorists.\n \n \n \nand they have no credible alternative for dealing with them, except for their usual cut and run and let evil Iran and Al Queda take over\n\n \n Al queda is extremely weak, and can do not much harm. Of course, now they can since we just inspired millions more to join. But before we went in there and screwed them, it wasn't too bad.\n \n \n \nIraq so we have an even bloodier mess to look forward to one day. That's how far from reality their thinking is.\n\n \n On the contrary. The radical right thinks that these people are actually a threat, and that we should kill them all. If we try to take any action, they will just grow. We are now passing things like the patriot and military comissions act, which are slowly taking away our constitutional rights. They are not a threat, they are just a bunch of rag, tag muslims with AKs, nothing more. Just because osama caused 9/11, doesn't mean that there will be anymore. If we start to try to fix it ourselves, we will make the situation even worse. Look whats happening now. I think bush owes a public apologly for what he's done.", 
   {}, 
   241337, 
   null, 
   1164860460.0
  ], 
  [
   241526, 
   null, 
   "DrNo", 
   "Religion is a terrific tool to control people. Regardless of the intention of the creation of religion, it is certainly used as a tool for control these days because people follow it so blindly. The worst part is religion convinces people to believe in things that can't be explained or proven, and then it claims this is a desirable trait by calling it \"strength\" and \"faith.\" We are in the middle of a holy war, the last two main religions battling for supremacy. It is the nature of everything to evolve into a singularity. Our destiny is one world government, which means one world religion. That means one religion is going to win, and one religion is going to lose. You can join the fray or sit out until it sweeps you in, but everybody's inclusion is inevitable.", 
   {}, 
   241515, 
   null, 
   1164862620.0
  ], 
  [
   241549, 
   null, 
   "peteratwar", 
   "Religion is a terrific tool to control people. Regardless of the intention of the creation of religion, it is certainly used as a tool for control these days because people follow it so blindly. The worst part is religion convinces people to believe in things that can't be explained or proven, and then it claims this is a desirable trait by calling it \"strength\" and \"faith.\" We are in the middle of a holy war, the last two main religions battling for supremacy. It is the nature of everything to evolve into a singularity. Our destiny is one world government, which means one world religion. That means one religion is going to win, and one religion is going to lose. You can join the fray or sit out until it sweeps you in, but everybody's inclusion is inevitable.\n\n \n \n Far too simplistic. There are at least 2 other major religions out there. There are few countries where religion rules. We are not in the middle of any Holy War as far as I am aware. Don't believe in any evolution to singularity. A world government may be an ideal, certainly won't mean one religion. If we reach a world government we will be much more mature than that. Religion hopefully will be up to the individual.", 
   {}, 
   241526, 
   null, 
   1164882600.0
  ], 
  [
   241553, 
   null, 
   "DrNo", 
   "Far too simplistic. There are at least 2 other major religions out there. There are few countries where religion rules. We are not in the middle of any Holy War as far as I am aware. Don't believe in any evolution to singularity. A world government may be an ideal, certainly won't mean one religion. If we reach a world government we will be much more mature than that. Religion hopefully will be up to the individual.\n\n \n Perhaps I have oversimplified the situation, but I still believe in singularity. It may well be that such a singularity is impossible. I'm not sure. As long as humans perceive the world to be made up of more than one group of people, I feel there will always be conflict between those groups. But, as you said, if we ever reach the point where we recognize the need to come together as one world, it would almost have to include religious tolerance. Either that, or religion would almost completely fade away to the point where nobody really cared about it anymore. I just don't see that happening anytime soon. I really enjoyed reading your perspective on the topic.", 
   {}, 
   241549, 
   null, 
   1164900540.0
  ], 
  [
   241570, 
   null, 
   "unkerpaulie", 
   "So now you want to add Iran, whose President has publicly stated he wants to destroy Israel, and whom many believe to be working day and night to acquire nukes, to evil Saddam, who already invaded Kuwait and butchered and raped innocent Kuwaiti's? What planet do you live on to where you think these people posed no threat to anyone? What do you and Simone, etc., need, another 9/11 or worse to wake you up again?\n\n funny you mention 9/11. please explain how the 9/11 attacks led to the invasion of iraq and deposition of saddam, and the disregard for bin laden. please explain how, though we know that there are more active al qaeda members in saudi arabia, jordan, sudan, omar, yemen and syria, than in iiraq, we disregarded those countries and went into iraq\n \n \nI believe we're doing our best to target the bad guys, not innocent Iraqis as you try to lump them all in together.\n\n no surprise here. your arguments all consist of beliefs based on absolutely no facts, and i'm not talking about just this topic. youre not in iraq, yet you hold on to the unfounded and counterintuitive belief that the majority of the 600k+ dead iraqis were bad guys?\n \n \nOpen your own eyes, sport. \n \n Actually, there were many Saddam / Al Queda connections, as Stephen Hayes and Thomas Joscelyn, writing in the Weekly Standard, spell out under the headline \"The Mother of All Connections.\" Since the fall of Saddam, the U.S. has had extraordinary access to documents of the former Baathist regime, and is still sifting through millions of them. Messrs. Hayes and Joscelyn take some of what is already available, combined with other reports, documentation and details, some from before the overthrow of Saddam, some after. For page after page, they list connections--with names, dates and details such as the longstanding relationship between Osama bin Laden's top deputy, Ayman al-Zawahiri, and Saddam's regime. \n \n Messrs. Hayes and Joscelyn raise, with good reason, the question of why Saddam gave haven to Abdul Rahman Yasin, one of the men who in 1993 helped make the bomb that ripped through the parking garage of the World Trade Center. They detail a contact between Iraqi intelligence and several of the Sept. 11 hijackers in Malaysia, the year before al Qaeda destroyed the twin towers. They recount the intersection of Iraqi and al Qaeda business interests in Sudan, via, among other things, an Oil for Food contract negotiated by Saddam's regime with the al-Shifa facility that President Clinton targeted for a missile attack following the African embassy bombings because of its apparent connection to al Qaeda. And there is plenty more.\n \n http://www.opinionjournal.com/columnists/cRosett/?id=110006953\n \n Even Hillary Clinton acknowledged the Saddam-Al Qaeda connection in her speech announcing support for the authorization of the use of force against Iraq in 2002. She said, \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capabilities, and his nuclear program. He has also given aid, comfort and sanctuary to terrorists, including Al Qaeda members.\"\n \n Of course then you have the Answar Al-Islam Al Queda terrorist camp on Iraq soil that Saddam conveniently turned a blind eye towards.\n\n this has already been addressed. the fact is that while we say we can justify the invasion of iraq because there was 1 al qaeda camp there, you seem blind to the fact that in many other countries there are dozens of al qaeda camps still operational today, not to mention hundreds of sleeper and covert cells all over the world. so if we need to spend 1 billion dollars, 5 years and about 200,000 soldiers to eliminate 1 al qaeda camp, at this rate when will we eliminate al qaeda?", 
   {}, 
   241508, 
   null, 
   1164911040.0
  ], 
  [
   241595, 
   null, 
   "Easyrider", 
   " But Easyrider doesn't look at statistics. According to him and President Bush and most of the right-wing nut jobs, all factual information has a liberal bias and is false.\n\n \n That's just a nutty, incorrect, and self-serving argument on your part. \n \n \n They prefer just to listen to the extremely one-sided bible of the Crusaders, Inquisitions, and Pogroms, and the even more one-sided \"facts\" coming from the mouth of the Baron of Bullcrap, a.k.a. President Dubya\n\n \n I think you've been sipping a little too much of that Michael Moore Kool Aid, sport.", 
   {}, 
   241508, 
   null, 
   1164919020.0
  ], 
  [
   241597, 
   null, 
   "Easyrider", 
   " funny you mention 9/11. please explain how the 9/11 attacks led to the invasion of iraq and deposition of saddam, and the disregard for bin laden. please explain how, though we know that there are more active al qaeda members in saudi arabia, jordan, sudan, omar, yemen and syria, than in iiraq, we disregarded those countries and went into iraq\n\n \n Ask your liberal buddies. The following (as well as various intelligence agencies around the world at that time) also believed Saddam had WMD's and was a danger to the world:\n \n \"One way or the other, we are determined to deny Iraq the capacity to \n develop weapons of mass destruction and the missiles to deliver them. That \n is our bottom line.\" President Clinton, Feb. 4, 1998\n \n \"If Saddam rejects peace and we have to use force, our purpose is clear. We \n want to seriously diminish the threat posed by Iraq's weapons of mass \n destruction program.\" President Clinton, Feb. 17, 1998\n \n \"Iraq is a long way from USA, but what happens there matters a great deal \n here. For the risks that the leaders of a rogue state will use nuclear, \n chemical or biological weapons against us or our allies is the greatest \n security threat we face.\" Madeline Albright, Feb 18, 1998\n \n \"He will use those weapons of mass destruction again, as he has ten times \n since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998\n \n \"We urge you, after consulting with Congress, and consistent with the \n U.S.Constitution and Laws, to take necessary actions (including, if \n appropriate, air and missile strikes on suspect Iraqi sites), to respond \n effectively to the threat posed by Iraq's refusal to end its weapons of mass \n destruction programs.\" Letter to President Clinton, signed by senators Carl \n Levin, Tom Daschle, John Kerry, and others, Oct. 9, 1998\n \n \"Saddam Hussein has been engaged in the development of weapons of mass \n destruction technology which is a threat to countries in the region, and he \n has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998\n \n \"Hussein has ... chosen to spend his money on building weapons of mass \n destruction and palaces for his cronies.\" Madeline Albright, Clinton \n Secretary of State, Nov. 10, 1999\n \n \"There is no doubt that ... Saddam Hussein has invigorated his weapons \n programs. Reports indicate that biological, chemical and nuclear programs \n continue apace and may be back to pre-Gulf War status. In addition, Saddam \n continues to redefine delivery systems, and is doubtless using the cover of \n an illicit missile program to develop longer-range missiles that will \n threaten the United States and our allies.\" Letter to President Bush, Signed \n by Sen. Bob Graham (D, FL,) and others, December 5, 2001\n \n \"We begin with the common belief that Saddam Hussein is a tyrant and a \n threat to the peace and stability of the region. He has ignored the mandate \n of the United Nations and is building weapons of mass destruction and the \n means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002\n \n \"We know that he has stored secret supplies of biological and chemical \n weapons throughout his country.\" Al Gore, Sept. 23, 2002\n \n \"Iraq's search for weapons of mass destruction has proven impossible to \n deter and we should assume that it will continue for as long as Saddam is in \n power.\" Al Gore, Sept. 23, 2002\n \n \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002\n \n \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002\n \n \"I will be voting to give the President of the United States the authority \n to use force -- if necessary -- to disarm Saddam Hussein because I believe \n that a deadly arsenal of weapons of mass destruction in his hands, is a real \n and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002\n \n \"There is unmistakable evidence that Saddam Hussein is working aggressively \n to develop nuclear weapons and will likely have nuclear weapons within the \n next five years ..... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct. 10, 2002\n \n \"He has systematically violated, over the course of the past 11 years, every \n significant UN resolution that has demanded that he disarm and destroy his \n chemical and biological weapons, and any nuclear capacity. This he has \n refused to do.\" Rep. Henry Waxman (D, CA), Oct. 10, 2002\n \n \"In the four years since the inspectors left, intelligence reports show that \n Saddam Hussein has worked to rebuild his chemical and biological weapons \n stock, his missile delivery capability and his nuclear program. He has also \n given aid, comfort, and sanctuary to terrorists, including al Qaeda members. \n It is clear, however, that if left unchecked, Saddam Hussein will continue \n to increase his capacity to wage biological and chemical warfare, and will \n keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct. \n 10, 2002\n \n \"We are in possession of what I think to be compelling evidence that Saddam \n Hussein has, and has had for a number of years, a developing capacity for \n the production and storage of weapons of mass destruction.\" Sen. Bob Graham \n (D, FL), Dec. 8, 2002\n \n \"Without question, we need to disarm Saddam Hussein. He is a brutal, \n murderous dictator, leading an oppressive regime. He presents a particularly \n grievous threat because he is so consistently prone to miscalculation ... \n And now he is miscalculating America's response to his continued deceit and \n his consistent grasp for weapons of mass destruction. So the threat of \n Saddam Hussein with weapons of mass destruction is real .....\" Sen. John F. \n Kerry (D, MA), Jan.23.2003\n \n \nyoure not in iraq, yet you hold on to the unfounded and counterintuitive belief that the majority of the 600k+ dead iraqis were bad guys?\n\n \n First, that 600K figure is horse dung and has been roundly discredited. Second, where's your proof we are intentionally targeting innocent Iraqi's?\n \n \n the fact is that while we say we can justify the invasion of iraq because there was 1 al qaeda camp there, you seem blind to the fact that in many other countries there are dozens of al qaeda camps still operational today, not to mention hundreds of sleeper and covert cells all over the world. so if we need to spend 1 billion dollars, 5 years and about 200,000 soldiers to eliminate 1 al qaeda camp, at this rate when will we eliminate al qaeda?\n\n \n Wait a second. You said there were no Al Queda connections in Iraq. Now you're admitting there were? Maybe you're making progress!", 
   {}, 
   241570, 
   null, 
   1164919560.0
  ], 
  [
   241599, 
   null, 
   "trebor", 
   "Ask your liberal buddies. The following (as well as various intelligence agencies around the world at that time) also believed Saddam had WMD's and was a danger to the world:\n \n <snipped quote mining<\n !\n\n \n http://www.snopes.com/politics/war/wmdquotes.asp\n \n \n Context means everything.. something you have not yet learned.", 
   {}, 
   241597, 
   null, 
   1164919860.0
  ], 
  [
   241601, 
   null, 
   "Easyrider", 
   "The quotes speak for themselves, Trebor. Obviously you're still in denial.", 
   {}, 
   241599, 
   null, 
   1164920160.0
  ], 
  [
   241615, 
   null, 
   "unkerpaulie", 
   "Ask your liberal buddies. The following (as well as various intelligence agencies around the world at that time) also believed Saddam had WMD's and was a danger to the world:\n \n <snip<\n\n stay focused. i asked you why we arent tracking down bin laden in response to 9/11. i asked you why we arent addressing the dozens of other al qaeda camps in other countries run by muslims. youre not even close to answering the question\n \n \nFirst, that 600K figure is horse dung and has been roundly discredited. Second, where's your proof we are intentionally targeting innocent Iraqi's?\n\n horse dung based on what? your belief that the figure is wrong doesnt make it wrong. where are your facts? and when did i say that we are intentionally targeting innocent iraqis. whether we are targeting them intentionally or not, we are killing lots of innocent iraqis. those are the facts.\n \n \nWait a second. You said there were no Al Queda connections in Iraq. Now you're admitting there were? Maybe you're making progress!\n\n why havent we put troops in the other countries where we know al qaeda has camps? do you really think that iraq was such a significant center of al qaeda that invading iraq would really affect al qaeda in any way?", 
   {}, 
   241597, 
   null, 
   1164923580.0
  ], 
  [
   241618, 
   null, 
   "obvious_child", 
   "The quotes speak for themselves, Trebor. Obviously you're still in denial.\n\n \n The quotes were from people who were using the war to score political points and agencies who were fed information that was blantantly false from a few number of highly red flagged sources.\n \n You're parroting the same **** over and over again\n \n Argument Via Ad Naseum does not equate to credibility", 
   {}, 
   241601, 
   null, 
   1164924720.0
  ], 
  [
   241624, 
   null, 
   "Big_Bear_Scot", 
   "FAO EZ\n \n http://www.thememoryhole.org/war/powell-no-wmd.htm\n \n Every time you post up the same out of context quotes I will do the same.", 
   {}, 
   241618, 
   null, 
   1164926640.0
  ], 
  [
   241644, 
   null, 
   "obvious_child", 
   "Secretary Powell: The sanctions, as they are called, have succeeded over the last 10 years, not in deterring him from moving in that direction, but from actually being able to move in that direction. The Iraqi regime militarily remains fairly weak. It doesn't have the capacity it had 10 or 12 years ago. It has been contained. And even though we have no doubt in our mind that the Iraqi regime is pursuing programs to develop weapons of mass destruction -- chemical, biological and nuclear -- I think the best intelligence estimates suggest that they have not been terribly successful. There's no question that they have some stockpiles of some of these sorts of weapons still under their control, but they have not been able to break out, they have not been able to come out with the capacity to deliver these kinds of systems or to actually have these kinds of systems that is much beyond where they were 10 years ago.\n\n \n So no viable weapon delivery systems, no successful weapons programs, fundementally weak military...let's see what else there is.\n \n \nBut in terms of Saddam Hussein being there, let's remember that his country is divided, in effect. He does not control the northern part of his country. We are able to keep arms from him. His military forces have not been rebuilt.\n\n \n So weak military, and contrary to EZ's bull****, the northern regions where the terrorist group was operating was not under his control!\n \n Feel Free to call Rice a liar.", 
   {}, 
   241624, 
   null, 
   1164933720.0
  ], 
  [
   241656, 
   null, 
   "bmittking", 
   "That's just a nutty, incorrect, and self-serving argument on your part. \n\n \n Come on EZ! Even President Bush, one of the most important and influential people in the world, admits that he doesn't pay attention to polls!", 
   {}, 
   241595, 
   null, 
   1164941820.0
  ], 
  [
   241659, 
   null, 
   "obvious_child", 
   "I find it amusing that EZ has responded to everyone who has replied to him except me. \n \n Ignoring me doesn't make you any less wrong", 
   {}, 
   241618, 
   null, 
   1164942840.0
  ], 
  [
   241663, 
   null, 
   "bmittking", 
   "I find it amusing that EZ has responded to everyone who has replied to him except me. \n \n Ignoring me doesn't make you any less wrong\n\n \n He probably thinks you're using too much factual information.", 
   {}, 
   241659, 
   null, 
   1164944040.0
  ], 
  [
   241664, 
   null, 
   "electrolyte", 
   "I find it amusing that EZ has responded to everyone who has replied to him except me. \n \n Ignoring me doesn't make you any less wrong\n\n That's just what he does, obvious_child. He literally has me on ignore, for crying out loud.", 
   {}, 
   241659, 
   null, 
   1164944040.0
  ], 
  [
   241669, 
   null, 
   "Easyrider", 
   "I find it amusing that EZ has responded to everyone who has replied to him except me. \n \n Ignoring me doesn't make you any less wrong\n\n \n Unable to refute why so many of your fellow liberal politicians claimed Saddam was a threat and had WMD's? LOL!!\n \n You and your like-minded naysayers are full of revisionist folly, as usual.", 
   {}, 
   241659, 
   null, 
   1164946320.0
  ], 
  [
   241670, 
   null, 
   "Easyrider", 
   "Come on EZ! Even President Bush, one of the most important and influential people in the world, admits that he doesn't pay attention to polls!\n\n \n And that's bad? As opposed to someone like Bill Clinton who always put his finger to the wind to find out what might be right or wrong, because he's otherwise clueless?", 
   {}, 
   241656, 
   null, 
   1164946500.0
  ], 
  [
   241671, 
   null, 
   "Easyrider", 
   " So no viable weapon delivery systems, no successful weapons programs, fundementally weak military...\n\n \n 20-20 hindsight must be real refreshing for you. Unless you're about five years old you would have remembered there were massive differences of opinions - in various intelligence agencies; in Democratic party circles, and amongst other prominent government officials concerning all that.\n \n \n So weak military, and contrary to EZ's bull****, the northern regions where the terrorist group was operating was not under his control!\n \n\n \n That's a riot. You trying to tell me Saddam couldn't have gone into that Al Queda camp and kicked butt if he wanted? LOL!! The \"bull*** is yours if you're that naive and gullible.", 
   {}, 
   241644, 
   null, 
   1164946800.0
  ], 
  [
   241672, 
   null, 
   "Easyrider", 
   " FAO EZ\n \n http://www.thememoryhole.org/war/powell-no-wmd.htm\n\n \n Let's take a look:\n \n In February 2003, Powell said: \"We know that Saddam Hussein is determined to keep his weapons of mass destruction, is determined to make more.\"\n \n But two years earlier, Powell said just the opposite. The occasion was a press conference on 24 February 2001 during Powell's visit to Cairo, Egypt. Answering a question about the US-led sanctions against Iraq, the Secretary of State said:\n \n We had a good discussion, the Foreign Minister and I and the President and I, had a good discussion about the nature of the sanctions -- the fact that the sanctions exist -- not for the purpose of hurting the Iraqi people, but for the purpose of keeping in check Saddam Hussein's ambitions toward developing weapons of mass destruction. We should constantly be reviewing our policies, constantly be looking at those sanctions to make sure that they are directed toward that purpose. That purpose is every bit as important now as it was ten years ago when we began it. And frankly they have worked. He has not developed any significant capability with respect to weapons of mass destruction. He is unable to project conventional power against his neighbors. So in effect, our policies have strengthened the security of the neighbors of Iraq... (end of quotes)\n \n Well this is real refreshing - TWO YEARS EARLIER he said something different. WHOOPEE! A number of years ago scores of liberal Democrats said something different than what they're saying today. Where's those admissions / links?\n \n You always ignore what various intelligence agencies, etc., report during two additional years? \n \n \n Every time you post up the same out of context quotes I will do the same.\n\n \n Nothing out of context in mine. Yours are an embarrassment to critical thinking, though. Just more Monday Morning quarterbacking on your parts.\n \n You people also conveniently forget all the numerous U.N. Resolutions Saddam violated, which was also a reason given by Bush for taking Saddam out. Did that one disappear from your memories too?", 
   {}, 
   241624, 
   null, 
   1164947520.0
  ], 
  [
   241675, 
   null, 
   "electrolyte", 
   "Come on EZ! Even President Bush, one of the most important and influential people in the world, admits that he doesn't pay attention to polls!\n\n And that's bad? As opposed to someone like Bill Clinton who always put his finger to the wind to find out what might be right or wrong, because he's otherwise clueless?\n\n So when a Democrat sees what the will of the people is, it's because he's wishy-washy. However, when a Democrat does something other than the will of the people, EZ is infuriated by said Democrat's alleged disregard for democracy. When a Republican goes against the will of the people, however (a la Bush's stem cell research veto), EZ thinks that the public is a bunch of XXXXXX and that Bush has the power and authority to overrule.\n \n To quote Adam Savage, EZ's worldview seems to be: \"I reject your reality and substitute my own!\" I guess this explains the vomitus that is EZ's posts; he's spinning so wildly, he's throwing up.", 
   {}, 
   241670, 
   null, 
   1164948300.0
  ], 
  [
   241677, 
   null, 
   "Shooterandproud", 
   "That's just a nutty, incorrect, and self-serving argument on your part.\n\n \n There he goes again.\n \n \n \n \nI think you've been sipping a little too much of that Michael Moore Kool Aid, sport.\n\n \n And again...", 
   {}, 
   241595, 
   null, 
   1164951300.0
  ], 
  [
   241678, 
   null, 
   "Shooterandproud", 
   "Ask your liberal buddies. The following (as well as various intelligence agencies around the world at that time) also believed Saddam had WMD's and was a danger to the world:\n \n \"One way or the other, we are determined to deny Iraq the capacity to \n develop weapons of mass destruction and the missiles to deliver them. That \n is our bottom line.\" President Clinton, Feb. 4, 1998\n \n \"If Saddam rejects peace and we have to use force, our purpose is clear. We \n want to seriously diminish the threat posed by Iraq's weapons of mass \n destruction program.\" President Clinton, Feb. 17, 1998\n \n \"Iraq is a long way from USA, but what happens there matters a great deal \n here. For the risks that the leaders of a rogue state will use nuclear, \n chemical or biological weapons against us or our allies is the greatest \n security threat we face.\" Madeline Albright, Feb 18, 1998\n \n \"He will use those weapons of mass destruction again, as he has ten times \n since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998\n \n \"We urge you, after consulting with Congress, and consistent with the \n U.S.Constitution and Laws, to take necessary actions (including, if \n appropriate, air and missile strikes on suspect Iraqi sites), to respond \n effectively to the threat posed by Iraq's refusal to end its weapons of mass \n destruction programs.\" Letter to President Clinton, signed by senators Carl \n Levin, Tom Daschle, John Kerry, and others, Oct. 9, 1998\n \n \"Saddam Hussein has been engaged in the development of weapons of mass \n destruction technology which is a threat to countries in the region, and he \n has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998\n \n \"Hussein has ... chosen to spend his money on building weapons of mass \n destruction and palaces for his cronies.\" Madeline Albright, Clinton \n Secretary of State, Nov. 10, 1999\n \n \"There is no doubt that ... Saddam Hussein has invigorated his weapons \n programs. Reports indicate that biological, chemical and nuclear programs \n continue apace and may be back to pre-Gulf War status. In addition, Saddam \n continues to redefine delivery systems, and is doubtless using the cover of \n an illicit missile program to develop longer-range missiles that will \n threaten the United States and our allies.\" Letter to President Bush, Signed \n by Sen. Bob Graham (D, FL,) and others, December 5, 2001\n \n \"We begin with the common belief that Saddam Hussein is a tyrant and a \n threat to the peace and stability of the region. He has ignored the mandate \n of the United Nations and is building weapons of mass destruction and the \n means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002\n \n \"We know that he has stored secret supplies of biological and chemical \n weapons throughout his country.\" Al Gore, Sept. 23, 2002\n \n \"Iraq's search for weapons of mass destruction has proven impossible to \n deter and we should assume that it will continue for as long as Saddam is in \n power.\" Al Gore, Sept. 23, 2002\n \n \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002\n \n \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002\n \n \"I will be voting to give the President of the United States the authority \n to use force -- if necessary -- to disarm Saddam Hussein because I believe \n that a deadly arsenal of weapons of mass destruction in his hands, is a real \n and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002\n \n \"There is unmistakable evidence that Saddam Hussein is working aggressively \n to develop nuclear weapons and will likely have nuclear weapons within the \n next five years ..... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct. 10, 2002\n \n \"He has systematically violated, over the course of the past 11 years, every \n significant UN resolution that has demanded that he disarm and destroy his \n chemical and biological weapons, and any nuclear capacity. This he has \n refused to do.\" Rep. Henry Waxman (D, CA), Oct. 10, 2002\n \n \"In the four years since the inspectors left, intelligence reports show that \n Saddam Hussein has worked to rebuild his chemical and biological weapons \n stock, his missile delivery capability and his nuclear program. He has also \n given aid, comfort, and sanctuary to terrorists, including al Qaeda members. \n It is clear, however, that if left unchecked, Saddam Hussein will continue \n to increase his capacity to wage biological and chemical warfare, and will \n keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct. \n 10, 2002\n \n \"We are in possession of what I think to be compelling evidence that Saddam \n Hussein has, and has had for a number of years, a developing capacity for \n the production and storage of weapons of mass destruction.\" Sen. Bob Graham \n (D, FL), Dec. 8, 2002\n \n \"Without question, we need to disarm Saddam Hussein. He is a brutal, \n murderous dictator, leading an oppressive regime. He presents a particularly \n grievous threat because he is so consistently prone to miscalculation ... \n And now he is miscalculating America's response to his continued deceit and \n his consistent grasp for weapons of mass destruction. So the threat of \n Saddam Hussein with weapons of mass destruction is real .....\" Sen. John F. \n Kerry (D, MA), Jan.23.2003\n\n \n If that is so true, then where are the freaken weapons already?\n \n \n \n \nFirst, that 600K figure is horse dung and has been roundly discredited. Second, where's your proof we are intentionally targeting innocent Iraqi's?\n\n \n It is not horse dung and a completely legit statistic. It doesn't matter who we are targeting or how we killed them, the fact is, WE KILLED THEM. Nothing more, don't try to cover this mess up with fancy words.\n \n \n \n \n \n \nWait a second. You said there were no Al Queda connections in Iraq. Now you're admitting there were? Maybe you're making progress!\n\n \n Iraq had no connection to 9/11, and had no WMDs. There are over 600K dead over there and more dying. We've lost over 3k american troops. Iraq is a complete mess and on the verge of a civil war. Al queda has grown much stronger since we invaded. How can you call any of this progress? Tell me, have we made ANY progress?", 
   {}, 
   241597, 
   null, 
   1164951480.0
  ], 
  [
   241680, 
   null, 
   "Shooterandproud", 
   "Unable to refute why so many of your fellow liberal politicians claimed Saddam was a threat and had WMD's? LOL!!\n \n You and your like-minded naysayers are full of revisionist folly, as usual.\n\n \n I ask this again. Where the heck are the WMD's? Can't answer that can you?", 
   {}, 
   241669, 
   null, 
   1164951720.0
  ], 
  [
   241681, 
   null, 
   "Shooterandproud", 
   "And that's bad? As opposed to someone like Bill Clinton who always put his finger to the wind to find out what might be right or wrong, because he's otherwise clueless?\n\n \n Lol, at least Cliton's IQ was over 83.", 
   {}, 
   241670, 
   null, 
   1164951840.0
  ], 
  [
   241682, 
   null, 
   "Shooterandproud", 
   "20-20 hindsight must be real refreshing for you. Unless you're about five years old you would have remembered there were massive differences of opinions - in various intelligence agencies; in Democratic party circles, and amongst other prominent government officials concerning all that.\n\n \n So you admit it. It was not fact.\n \n \n \n \nThat's a riot. You trying to tell me Saddam couldn't have gone into that Al Queda camp and kicked butt if he wanted? LOL!! The \"bull*** is yours if you're that naive and gullible.\n\n \n Yet you have no way to refute it or prove it wrong? All you do is call him names and call it BS. Well, lets see your base Mr. WMD.", 
   {}, 
   241671, 
   null, 
   1164951900.0
  ], 
  [
   241683, 
   null, 
   "Shooterandproud", 
   "Let's take a look:\n \n In February 2003, Powell said: \"We know that Saddam Hussein is determined to keep his weapons of mass destruction, is determined to make more.\"\n\n \n Colin Powell is about as credible as Bush himself. I've heard more truth come out of a dog's mouth.\n \n \nBut two years earlier, Powell said just the opposite. The occasion was a press conference on 24 February 2001 during Powell's visit to Cairo, Egypt. Answering a question about the US-led sanctions against Iraq, the Secretary of State said:\n \n We had a good discussion, the Foreign Minister and I and the President and I, had a good discussion about the nature of the sanctions -- the fact that the sanctions exist -- not for the purpose of hurting the Iraqi people, but for the purpose of keeping in check Saddam Hussein's ambitions toward developing weapons of mass destruction. We should constantly be reviewing our policies, constantly be looking at those sanctions to make sure that they are directed toward that purpose. That purpose is every bit as important now as it was ten years ago when we began it. And frankly they have worked. He has not developed any significant capability with respect to weapons of mass destruction. He is unable to project conventional power against his neighbors. So in effect, our policies have strengthened the security of the neighbors of Iraq... (end of quotes)\n\n \n \n I refer you to my sig. Just because someone says its true, doesn't necessarily make it so.\n \n \n \nWell this is real refreshing - TWO YEARS EARLIER he said something different. WHOOPEE! A number of years ago scores of liberal Democrats said something different than what they're saying today. Where's those admissions / links?\n\n \n Omg, Conservativism must be a mental disorder.\n \n \n \nYou always ignore what various intelligence agencies, etc., report during two additional years?\n\n \n \n INTELLIGENT AGENCYS?! Such as? Didn't think so.\n \n \n \n \nNothing out of context in mine. Yours are an embarrassment to critical thinking, though. Just more Monday Morning quarterbacking on your parts.\n\n \n So far you have proven nothing he's said wrong. Nice try though.\n \n \n \n \nYou people also conveniently forget all the numerous U.N. Resolutions Saddam violated,\n\n \n Do you know how many U.N violations Isreal violates? Does that mean we should go to war with Israel?\n \n \n \nwhich was also a reason given by Bush for taking Saddam out. Did that one disappear from your memories too?\n\n \n Should we take the Israeli prime minister out too? Trust me, he'll dance around this one. This'll be funny.", 
   {}, 
   241672, 
   null, 
   1164952140.0
  ], 
  [
   241684, 
   null, 
   "obvious_child", 
   "Unable to refute why so many of your fellow liberal politicians claimed Saddam was a threat and had WMD's? LOL!!\n\n \n Quite typical. When a republican runs into a conservative, they attempt to label them as a liberal. The funny thing is, the republican (ez here) is far more liberal in most aspects. Instead of dealing with the statements i have given (which include calling Hillary a HACK), he attempts to label me as a liberal. He also deliberately ignores that I've on numerous occasions here derided fiscal liberal policy, liberal gov't and on occasion, social liberalism. I've criticized the republican heavily on their fiscal and gov't liberalism. Instead of dealing with the statement i HAVE given, EZ, fabricates attitudes and beliefs I do not have.\n \n Typical Dishonest, FRAUDLENT and Completely UNCHRISTIAN like. Far from Christ you have fallen. \n \n Does it make you feel good that you betray the teachings of Christ every day here?\n \n \n20-20 hindsight must be real refreshing for you. Unless you're about five years old you would have remembered there were massive differences of opinions - in various intelligence agencies; in Democratic party circles, and amongst other prominent government officials concerning all that.\n\n \n The democrats are scum. But you'll ignore that as it is easier for you to pretend I'm a liberal rather then admit I'm far more conservative then you will ever be. There was a huge amount of differences because groups understood that intel was comming from a poor source. \n \n Again trying to label me anything other then a Conservative won't work here. \n \n \nThat's a riot. You trying to tell me Saddam couldn't have gone into that Al Queda camp and kicked butt if he wanted? LOL!! The \"bull*** is yours if you're that naive and gullible.\n\n \n have you forgotten your own words? you said that Saddam turned a blind eye to that camp. He couldn't have done anything as the area as stated by Rice was not under his control.\n \n Lying is hardly a Christian trait now is it?", 
   {}, 
   241669, 
   null, 
   1164952860.0
  ], 
  [
   241752, 
   null, 
   "bmittking", 
   "Since when has \"Liberal\" become an insult? Right now a better insult would be calling someone a conservative.", 
   {}, 
   241684, 
   null, 
   1164994800.0
  ], 
  [
   241754, 
   null, 
   "trebor", 
   "Since when has \"Liberal\" become an insult? Right now a better insult would be calling someone a conservative.\n\n \n It is regarded as an insult by the moronic conservatives, and they use it as such.\n \n Like 'tax and spend' liberal.\n \n WHich is opposed by the current 'borrow and spend' republican.", 
   {}, 
   241752, 
   null, 
   1164994980.0
  ], 
  [
   241776, 
   null, 
   "obvious_child", 
   "It is regarded as an insult by the moronic conservatives, and they use it as such.\n\n \n Not even that. Most people who use it have no understanding of what Conservative is. Conservatives realize that their belief system is essentially classical liberalism. It's a catch phrase for the intellectual deficient.\n \n \nLike 'tax and spend' liberal.\n \n WHich is opposed by the current 'borrow and spend' republican.\n\n \n Which is ironic given that tax and spend is more conservative then borrow and spend. Supply side economics is hugely neoliberal fiscal policy where matching a dollar of tax to a dollar of spending is essentially balancing the books.", 
   {}, 
   241754, 
   null, 
   1165002540.0
  ], 
  [
   241791, 
   null, 
   "trebor", 
   "Not even that. Most people who use it have no understanding of what Conservative is. Conservatives realize that their belief system is essentially classical liberalism. It's a catch phrase for the intellectual deficient.\n \n \n \n Which is ironic given that tax and spend is more conservative then borrow and spend. Supply side economics is hugely neoliberal fiscal policy where matching a dollar of tax to a dollar of spending is essentially balancing the books.\n\n \n In many respects, the current crowd of republican is more liberal than the democrats.\n \n And, I put in a modifier to the term 'conservative'. I put in the adjective 'moronic'.. These are the followers of Rush Limbaugh, and Anne Coulter who repeat things without knowledge.", 
   {}, 
   241776, 
   null, 
   1165010280.0
  ], 
  [
   241794, 
   null, 
   "obvious_child", 
   "In many respects, the current crowd of republican is more liberal than the democrats.\n\n \n No disagreement there. It is amusing though to bring that up and watch EZ and Jim's trucking run away. They bash liberalism yet endorse a party that has embraced it. \n \n \nAnd, I put in a modifier to the term 'conservative'. I put in the adjective 'moronic'.. These are the followers of Rush Limbaugh, and Anne Coulter who repeat things without knowledge.\n\n \n I'm not sure how you can be conservative and support either of those two nutjobs. Savage I can understand, but Coulter and Rush are just talking heads who don't even understand the basics of conservatism beyond extreme social authoritarianism.", 
   {}, 
   241791, 
   null, 
   1165011240.0
  ], 
  [
   241801, 
   null, 
   "jyoshu", 
   "Not even that. Most people who use it have no understanding of what Conservative is. Conservatives realize that their belief system is essentially classical liberalism. It's a catch phrase for the intellectual deficient.\n\n \n Would that more modern liberals realized theirs isn't classical liberalism.", 
   {}, 
   241776, 
   null, 
   1165018980.0
  ], 
  [
   241818, 
   null, 
   "Shooterandproud", 
   "Would that more modern liberals realized theirs isn't classical liberalism.\n\n \n Ok? Whats your point?", 
   {}, 
   241801, 
   null, 
   1165032480.0
  ], 
  [
   241819, 
   null, 
   "Shooterandproud", 
   "No disagreement there. It is amusing though to bring that up and watch EZ and Jim's trucking run away. They bash liberalism yet endorse a party that has embraced it. \n \n \n \n I'm not sure how you can be conservative and support either of those two nutjobs. Savage I can understand, but Coulter and Rush are just talking heads who don't even understand the basics of conservatism beyond extreme social authoritarianism.\n\n \n Conservativism is a mental disorder.", 
   {}, 
   241794, 
   null, 
   1165032600.0
  ], 
  [
   241842, 
   null, 
   "obvious_child", 
   "Conservativism is a mental disorder.\n\n \n The 'conservatism' practiced by republicans I'd partially agree with as a disorder. Actual conservatism is not. However, the number of actual conservatives is relatively low and their ideas and beliefs have been rejected by people like EZ.", 
   {}, 
   241819, 
   null, 
   1165043580.0
  ], 
  [
   241846, 
   null, 
   "Shooterandproud", 
   "The 'conservatism' practiced by republicans I'd partially agree with as a disorder. Actual conservatism is not. However, the number of actual conservatives is relatively low and their ideas and beliefs have been rejected by people like EZ.\n\n \n I haven't the slightest clue what conservatism or liberalism means anymore. The \"neo-cons\" most likely have something wrong with them. I don't even know what a real conservative is anymore.", 
   {}, 
   241842, 
   null, 
   1165045620.0
  ], 
  [
   241861, 
   null, 
   "Easyrider", 
   " No disagreement there. It is amusing though to bring that up and watch EZ and Jim's trucking run away. They bash liberalism yet endorse a party that has embraced it. \n\n \n Everytime you open that grocery hole of yours more folly pops out. You don't know what I've embraced or not as far as recent elections. And FYI, anything that looks or smells like your vaunted liberalism is worth casting into the sewer, whatever political label they wear.", 
   {}, 
   241794, 
   null, 
   1165067280.0
  ], 
  [
   241875, 
   null, 
   "simone", 
   "Fiscal responsiility. Something that Bush and his thugs do not understand.", 
   {}, 
   241861, 
   null, 
   1165080120.0
  ], 
  [
   241878, 
   null, 
   "georged", 
   "Fiscal responsiility. Something that Bush and his thugs do not understand.\n\n \n Sure they do, as long as it's self-serving and not applied to their government activities.", 
   {}, 
   241875, 
   null, 
   1165080840.0
  ], 
  [
   241920, 
   null, 
   "obvious_child", 
   "Everytime you open that grocery hole of yours more folly pops out.\n\n \n [b]Considering you have no idea what conservatism or liberalism and you've ignored virtually everything I have said, it's no wonder you're the laughing stock here.['b]\n \n \nYou don't know what I've embraced or not as far as recent elections. And FYI, anything that looks or smells like your vaunted liberalism is worth casting into the sewer, whatever political label they wear.\n\n \n so you agree that Republicans should be evicted from Congress due to their rampant liberalism?\n \n (doubtfull as Ez's a huge hypocrite who betrays the word of Christ in every action he does)", 
   {}, 
   241861, 
   null, 
   1165098360.0
  ], 
  [
   242153, 
   null, 
   "Easyrider", 
   " Considering you have no idea what conservatism or liberalism and you've ignored virtually everything I have said, it's no wonder you're the laughing stock here.\n\n \n <chuckle<\n \n More bull. But what makes you think I want to be revered by you and your flaming liberals? \n \n \nso you agree that Republicans should be evicted from Congress due to their rampant liberalism?\n\n \n You don't listen very well, do you? I basically said anything that smacks of today's PC liberalism should be erradicated from Congress.\n \n \n(doubtfull as Ez's a huge hypocrite who betrays the word of Christ in every action he does)\n\n \n I John 2:22", 
   {}, 
   241920, 
   null, 
   1165275360.0
  ], 
  [
   242162, 
   null, 
   "Matthew S", 
   "<chuckle<\n \n \n You don't listen very well, do you? I basically said anything that smacks of today's PC liberalism should be erradicated from Congress.\n \n \n \n I John 2:22\n\n \n What does \"Then said they unto him, Who art Thou? that we may give an answer to them that sent us. What sayest thou of thyself? got to do with anything. \n \n I prefer KJV Luke 11:41", 
   {}, 
   242153, 
   null, 
   1165280580.0
  ], 
  [
   242210, 
   null, 
   "obvious_child", 
   "More bull. But what makes you think I want to be revered by you and your flaming liberals?\n\n \n How is that even relevant to what I stated?\n \n You obviously have no idea what liberalism nor conservatism are. \n \n And I see you failed to even stay on topic.\n \n \nYou don't listen very well, do you? I basically said anything that smacks of today's PC liberalism should be erradicated from Congress.\n\n \n And you're a liar\n \n \nAnd FYI, anything that looks or smells like your vaunted liberalism is worth casting into the sewer, whatever political label they wear. \n\n \n Do you forget your own words? The fact that you keep calling me a liberal shows just how much you know. \n \n Quoting scripture you have abandoned is hardly a good way of defending yourself.\n \n So back to my question: you agree that Republicans should be evicted from Congress due to their rampant liberalism?\n \n I'm still waiting for a reply to Post 48", 
   {}, 
   242153, 
   null, 
   1165311300.0
  ], 
  [
   242287, 
   null, 
   "Easyrider", 
   "Obvious Child - \n \n You err greatly because you haven't yet come to the realization that \"liberal and conservative\" is not just a political label - it also has to deal with liberal and conservative views on the Bible / Christ. You are a liberal, you just don't know it yet. And an unsaved one from all indications that I can see. \n \n Once you come to the realization that you are utterly in the dark with your failed theology and world view, then you can take the next step towards enlightenment. Until then you're lost and little more than a clanging cymbal in the grand scheme of things.", 
   {}, 
   242210, 
   null, 
   1165361880.0
  ], 
  [
   242289, 
   null, 
   "obvious_child", 
   " \n \n You err greatly because you haven't yet come to the realization that \"liberal and conservative\" is not just a political label - it also has to deal with liberal and conservative views on the Bible / Christ. You are a liberal, you just don't know it yet. And an unsaved one from all indications that I can see.\n\n \n And you're wrong as usual. \n \n I'm not a Christian. Therefore I cannot be a liberal Christian. Also, your religion is hardly proved (or any for that matter) and your view of Christanity is quite wrong. No one is saved. Only through God's grace can anyone be allowed into Heaven. You cannot save yourself, nor can you earn it, it is freely given by God. You don't even understand your own religion. Well, unless you're a Calvanist, but doubtful given that you think you can gain salvation.\n \n But you still fail to understand the basic differences between liberal and conservative. If you understood them (which you clearly don't given your several posts on avoidance on proving that you do), you'd agree that the republicans should have been evicted because of their liberalism.\n \n Avoiding a direct challenge multiple times shows that you know you don't have the knowledge and that the claims agnaist you are true. \n \n \nOnce you come to the realization that you are utterly in the dark with your failed theology and world view, then you can take the next step towards enlightenment. Until then you're lost and little more than a clanging cymbal in the grand scheme of things.\n\n \n That's ironic given how your view of Christanity is wrong.\n \n Still no reply to post 48\n \n Do you accept that you are a coward?", 
   {}, 
   242287, 
   null, 
   1165362240.0
  ], 
  [
   242293, 
   null, 
   "Matthew S", 
   "Obvious Child - \n \n You err greatly because you haven't yet come to the realization that \"liberal and conservative\" is not just a political label - it also has to deal with liberal and conservative views on the Bible / Christ. You are a liberal, you just don't know it yet. And an unsaved one from all indications that I can see. \n \n Once you come to the realization that you are utterly in the dark with your failed theology and world view, then you can take the next step towards enlightenment. Until then you're lost and little more than a clanging cymbal in the grand scheme of things.\n\n \n If it weren't for liberals there would be no United States. If it weren't for the liberal Martin Luther there would be no protestants and you would be bowing to the pope.\n \n If only conservatives existed humans would have died out. It is liberal and liberal values that move humanity forward.", 
   {}, 
   242287, 
   null, 
   1165363680.0
  ], 
  [
   242308, 
   null, 
   "DrNo", 
   "Here's a curveball for everyone. I'm an agnostic conservative. Figure that one out. Oh, and I think the Republicans and Democrats are simply two corn kernals in the same pile of fecal matter. Republicans today are an embarassment to any real conservatives. They have expanded government power rather than reducing it, and they spend money as if their ability to breathe is directly related to how much they spend. No real conservative would agree to the Patriot Act either. Oh, and since Matthew has posted here, I'll add: A REAL conservative would not support a federal ban on gay marriage either. It's none of the government's business if gays want to get married. We have enough problems in this world without having to worry about people who love each other.", 
   {}, 
   242293, 
   null, 
   1165370220.0
  ], 
  [
   242311, 
   null, 
   "bmittking", 
   "Obvious Child - \n \n You err greatly because you haven't yet come to the realization that \"liberal and conservative\" is not just a political label - it also has to deal with liberal and conservative views on the Bible / Christ. You are a liberal, you just don't know it yet. And an unsaved one from all indications that I can see. \n \n Once you come to the realization that you are utterly in the dark with your failed theology and world view, then you can take the next step towards enlightenment. Until then you're lost and little more than a clanging cymbal in the grand scheme of things.\n\n \n Yes, Obvious. The first step to enlightenment is admitting that you have a clue as to what's actually going on in the world. You become oblivious to logic around the seventh step, I think.", 
   {}, 
   242287, 
   null, 
   1165371120.0
  ], 
  [
   242312, 
   null, 
   "obvious_child", 
   "Here's a curveball for everyone.\n\n \n Not as much as you think. emoticon_xhoho \n \n \nI'm an agnostic conservative. Figure that one out.\n\n \n I'm a deistic conservative who largely views the world secularly.\n \n \nOh, and I think the Republicans and Democrats are simply two corn kernals in the same pile of fecal matter.\n\n \n That's kinder then what I'd say. \n \n \nRepublicans today are an embarassment to any real conservatives. They have expanded government power rather than reducing it, and they spend money as if their ability to breathe is directly related to how much they spend. No real conservative would agree to the Patriot Act either. Oh, and since Matthew has posted here, I'll add: A REAL conservative would not support a federal ban on gay marriage either. It's none of the government's business if gays want to get married. We have enough problems in this world without having to worry about people who love each other.\n\n \n And do you know what happens when a republican reads this? \n \n They call you a liberal. Because to them, liberals have fiscal restraint, favor small gov't, favor market forces, and favor less legislation.\n \n Furthermore, no conservative would have supported the intervention of the federal gov't into the private dispute of Terri Schavio.", 
   {}, 
   242308, 
   null, 
   1165371300.0
  ], 
  [
   242402, 
   null, 
   "Easyrider", 
   " And you're wrong as usual. \n \n I'm not a Christian. Therefore I cannot be a liberal Christian.\n\n \n You have liberal views about Christianity, so therefore you are a liberal, IMO.\n \n \n Also, your religion is hardly proved (or any for that matter) and your view of Christanity is quite wrong. No one is saved. Only through God's grace can anyone be allowed into Heaven. You cannot save yourself, nor can you earn it, it is freely given by God. You don't even understand your own religion.\n\n \n You conveniently left out the part where salvation is found in no one else except Christ (Acts 4:12, etc.). Typical. And Christ is real. You'll kneel before him on Judgment Day to give an account for all this Christ-denial nonsense you're spreading.\n \n \n But you still fail to understand the basic differences between liberal and conservative. If you understood them (which you clearly don't given your several posts on avoidance on proving that you do), you'd agree that the republicans should have been evicted because of their liberalism.\n\n \n I'm a Conservative Independent, Sport. Like I basically said, if it looks like a liberal duck, walks like a liberal duck, etc., then I'm not voting for it. \n \n \n \n Still no reply to post 48\n \n Do you accept that you are a coward?\n\n \n You assume I want to spend more than 5 minutes feeding your folly. Go climb a tree.", 
   {}, 
   242289, 
   null, 
   1165448160.0
  ], 
  [
   242407, 
   null, 
   "obvious_child", 
   "You have liberal views about Christianity, so therefore you are a liberal, IMO.\n\n \n No, I take my views on Christanity from the beginning, not what Christanity is thought to be today. Your opinion is garbage.\n Anyone who disagrees with you is a liberal regardless of their political beliefs. I bet you have no idea who Augustine was. \n \n \nYou conveniently left out the part where salvation is found in no one else except Christ (Acts 4:12, etc.). Typical.\n\n \n Hello. Christ is God and only God grants salvation. You clearly stated that one can earn salvation, that is fundmentally false.\n \n You don't even understand your own religion. How amusing. \n \n \nAnd Christ is real. You'll kneel before him on Judgment Day to give an account for all this Christ-denial nonsense you're spreading.\n\n \n Sure he is. But you forget that he works for the Flying Spagetti Monster. Your constant denial of Christ's Lord will earn you a eternity of wet noodle lashings.\n \n You won't accept that belief, why should I accept yours? The whole argument/logic thing is new to you isn't it? \n \n \nI'm a Conservative Independent, Sport. Like I basically said, if it looks like a liberal duck, walks like a liberal duck, etc., then I'm not voting for it.\n\n \n Then why can't you answer my simple question?\n \n You don't know what Conservative nor Liberal man. this is what, the 4th time you've deliberatley avoided answering the question. \n \n \nYou assume I want to spend more than 5 minutes feeding your folly. Go climb a tree.\n\n \n So you have nothing as usual I take it.\n \n Please tell me how I'm a liberal when I called the democrats SCUM, said that Hillary is a HACK, derided fiscal liberal policy, liberal gov't and on occasion, social liberalism and support capitalism. \n \n Is easier for you to pretend I'm a liberal rather then admit I'm far more conservative then you will ever be. Willfull blindess.\n \n And you're still a liar. \n \n Avoiding a direct challenge multiple times shows that you know you don't have the knowledge and that the claims agnaist you are true.\n \n Does it make you feel good that you betray the teachings of Christ every day here?", 
   {}, 
   242402, 
   null, 
   1165454340.0
  ], 
  [
   242414, 
   null, 
   "Easyrider", 
   " No, I take my views on Christanity from the beginning, not what Christanity is thought to be today. Your opinion is garbage.\n\n \n Your conclusion is garbage.\n \n \nHello. Christ is God and only God grants salvation. You clearly stated that one can earn salvation, that is fundmentally false.\n\n \n Wrong. I never said that you can earn your salvation. You just lied again, unless you can link me to that supposed statement.\n \n \nYou don't even understand your own religion. How amusing.\n\n \n I understand it a whole lot better than you do. If you did understand it you wouldn't be steeped in these windjamming fallacies. \n \n \n Please tell me how I'm a liberal when I called the democrats SCUM, said that Hillary is a HACK, derided fiscal liberal policy, liberal gov't and on occasion, social liberalism and support capitalism.\n\n \n You're a classic, Christ-denying liberal - taking liberties with God's Word and denying the reality of Christ.\n \n \nAnd you're still a liar.\n\n \n \"Who is the liar? It is the person who denies the Jesus is the Christ. Such a person is an antichrist.\" - I John 2:22\n \n Since you deny Jesus is the Christ what then what are the two things that makes you?\n \n \nDoes it make you feel good that you betray the teachings of Christ every day here?\n\n \n More hubris from left field. Even God and the prophets and disciples rebuked the stiff-necked crowd.\n \n Now go and learn what this means:\n \n \"He who has the son has life. He who does not have the son does not have everlasting life but the wrath of God abides on him.\" - John 3:36\n \n Better get your asbestos undies out, sport (as if that will help you). Or repent and receive Christ as your Lord and Savior for the remission of your sins. Otherwise you're going to be in deep sneakers.", 
   {}, 
   242407, 
   null, 
   1165458600.0
  ], 
  [
   242416, 
   null, 
   "Big_Bear_Scot", 
   "You're a classic, Christ-denying liberal - taking liberties with God's Word and denying the reality of Christ.\n\n \n So if you don't believe in Jesus you are a liberal ? What about those with liberal views that believe Jesus is their Saviour ?\n \n \n\n Better get your asbestos undies out, sport (as if that will help you). Or repent and receive Christ as your Lord and Savior for the remission of your sins. Otherwise you're going to be in deep sneakers.\n\n \n Do you realise that the threat of hell does not scare the unbeliever ? It is like me saying to you that unless you believe in Zeus you are going to Hades.", 
   {}, 
   242414, 
   null, 
   1165459380.0
  ], 
  [
   242418, 
   null, 
   "Easyrider", 
   " So if you don't believe in Jesus you are a liberal ? What about those with liberal views that believe Jesus is their Saviour ?\n\n \n Believing in Jesus as divine Lord and Savior is not in itself a liberal view.\n \n \n Do you realise that the threat of hell does not scare the unbeliever ? \n\n \n Yes. But hell is real regardless of whether they believe it or not.", 
   {}, 
   242416, 
   null, 
   1165459980.0
  ], 
  [
   242419, 
   null, 
   "Big_Bear_Scot", 
   "Believing in Jesus as divine Lord and Savior is not in itself a liberal view.\n\n \n It is not a conservative view either , you get Christians of all persuasions from Right Wing Evangelicals to Radical Christian Anarchists and every thing in between. I don't see how you can paint some one as a liberal or a conservative because of their views on Christianity.\n \n \n\n Yes. But hell is real regardless of whether they believe it or not.\n\n \n So is Hades, I can play the same game. \n \n Even if it is real the threat of hell to a non-believer is useless especially in the context of a debate. I don't see how it can change the opinion of obvious_child or anyone else on this board who is not a believer.", 
   {}, 
   242418, 
   null, 
   1165460460.0
  ], 
  [
   242420, 
   null, 
   "Easyrider", 
   " It is not a conservative view either , you get Christians of all persuasions from Right Wing Evangelicals to Radical Christian Anarchists and every thing in between. I don't see how you can paint some one as a liberal or a conservative because of their views on Christianity.\n\n \n I've yet to see a theological liberal who is Biblically-based. Their Jesus is usually some kind of mere mortal or simple philosopher. They normally are ok with gay marriage, abortion, everyone goes to heaven, and all that. If they were Biblically-based they would then be a Biblically-based Christian. \n \n \nEven if it is real the threat of hell to a non-believer is useless especially in the context of a debate. I don't see how it can change the opinion of obvious_child or anyone else on this board who is not a believer.\n\n \n Jesus told them the truth too, and I'm sure there was a pack of Obvious Children out there who were in denial. But at least they can't say they weren't warned.", 
   {}, 
   242419, 
   null, 
   1165460820.0
  ], 
  [
   242422, 
   null, 
   "Big_Bear_Scot", 
   "I've yet to see a theological liberal who is Biblically-based. Their Jesus is usually some kind of mere mortal or simple philosopher. They normally are ok with gay marriage, abortion, everyone goes to heaven, and all that. If they were Biblically-based they would then be a Biblically-based Christian.\n\n \n I'll take one of the examples I posted above 'Anarchist Christians'. \n \n They base their belief that the only authority is God(Luke 4:5-8) and they oppose any state control(or state rulers). They believe that their version of Christianity is based on the Bible, just like yours. \n Also you have to remember that not all branches of Christianity believe that you have to base your faith on the Bible(Quakers for example).\n \n \nJesus told them the truth too, and I'm sure there was a pack of Obvious Children out there who were in denial. But at least they can't say they weren't warned.\n\n \n I am just saying it adds nothing to the debate. That is probably my last word on the subject, I find it quite tiresome to be honest with you, just put yourself in a non-believers shoes for two seconds, and understand that it doesn't work as a debating tactic.", 
   {}, 
   242420, 
   null, 
   1165461780.0
  ], 
  [
   242432, 
   null, 
   "Easyrider", 
   " I'll take one of the examples I posted above 'Anarchist Christians'. \n \n They base their belief that the only authority is God(Luke 4:5-8) and they oppose any state control(or state rulers). They believe that their version of Christianity is based on the Bible, just like yours.\n\n \n Then they err Biblically because it's clear in scripture that God often installed kings and rulers, and established nations. \n \n \n Also you have to remember that not all branches of Christianity believe that you have to base your faith on the Bible(Quakers for example).\n\n \n There's plenty of sects out there who believe in all sorts of things. No doubt about that.\n \n \n I am just saying it adds nothing to the debate. That is probably my last word on the subject, I find it quite tiresome to be honest with you, just put yourself in a non-believers shoes for two seconds, and understand that it doesn't work as a debating tactic.\n\n \n I think it does sometimes. The seeds are planted and no mere mortal can say yea or nay as to whether they might someday bring fruition.", 
   {}, 
   242422, 
   null, 
   1165463700.0
  ], 
  [
   242446, 
   null, 
   "Shooterandproud", 
   "There's plenty of sects out there who believe in all sorts of things. No doubt about that.\n\n \n Then how are you different from any of those sects?\n \n \n \n \n \nI think it does sometimes. The seeds are planted and no mere mortal can say yea or nay as to whether they might someday bring fruition.\n\n \n That can go both ways. Who are you to say yea?", 
   {}, 
   242432, 
   null, 
   1165469760.0
  ], 
  [
   242452, 
   null, 
   "obvious_child", 
   "Your conclusion is garbage.\n\n \n Funny how you don't even understand your religion yet say that. \n \n \nWrong. I never said that you can earn your salvation. You just lied again, unless you can link me to that supposed statement.\n\n \n \nAnd an unsaved one from all indications that I can see.\n\n \n You're a liar. You that I was unsaved. As no one knows who is saved or not saved as Salvation is granted through Grace and Grace alone, you obviously believe that one can earn salvation through their behavior and beliefs. YOU'RE A LIAR. The only way you're not a liar is if you're God which is not likely. \n \n \nI understand it a whole lot better than you do. If you did understand it you wouldn't be steeped in these windjamming fallacies.\n\n \n Point out a single fallacy. I'd love to see proof of nothing. Furthermore, you believe that one can earn salvation as stated in your own posts. \n \n \nYou're a classic, Christ-denying liberal - taking liberties with God's Word and denying the reality of Christ.\n\n \n Amusing given that my statement wasn't about religion.\n \n But at least you did provide more evidence that you think that liberalism is conservatism. When a republican meets a conservative, they call them a liberal and hopes no one else knows what the terms actually mean.\n \n \n\"Who is the liar? It is the person who denies the Jesus is the Christ. Such a person is an antichrist.\" - I John 2:22\n\n \n Funny you say that. Bill 2:67 says that those who preach false religions as the truth are doing the work of absolute evil. Guess you're evil!\n \n You won't accept that belief, why should I accept yours? The whole argument/logic thing is new to you isn't it? \n \n \nSince you deny Jesus is the Christ what then what are the two things that makes you?\n\n \n Not a christian which is hardly a bad thing. At least I don't go around pretending to be a christian and then acting in ways that would make Christ cry. \n \n Scripture from a book I do not accept does nothing. You refuse to accept the Flying Spagetti Monster as the true religion! You will suffer eternally for your heresey.\n \n Furthermore, there is nothing in the bible that says non-believers go to Hell.\n \n Seriously do you know anything about Christanity?\n \n I see this is the 5th time you've refused to answer the simple question.\n \n Please tell me how I'm a liberal when I called the democrats SCUM, said that Hillary is a HACK, derided fiscal liberal policy, liberal gov't and on occasion, social liberalism and support capitalism. \n \n Is easier for you to pretend I'm a liberal rather then admit I'm far more conservative then you will ever be. Willfull blindess.", 
   {}, 
   242414, 
   null, 
   1165470780.0
  ], 
  [
   242453, 
   null, 
   "bmittking", 
   "The book of life is kept in G-d's private library. Who are you to gaze upon its contents? Who are you to do G-d's judging for him? Only the almighty himself will decide who is worthy.", 
   {}, 
   242452, 
   null, 
   1165471500.0
  ], 
  [
   242462, 
   null, 
   "obvious_child", 
   "The book of life is kept in G-d's private library. Who are you to gaze upon its contents? Who are you to do G-d's judging for him? Only the almighty himself will decide who is worthy.\n\n \n Therefore EZ just commited Blasphemy if he makes judgements upon who is saved and who is not. \n \n I'm starting to think that EZ isn't a Christian is merely out to make the religion look bad.", 
   {}, 
   242453, 
   null, 
   1165486380.0
  ], 
  [
   242465, 
   null, 
   "Matthew S", 
   "Believing in Jesus as divine Lord and Savior is not in itself a liberal view.\n \n \n \n Yes. But hell is real regardless of whether they believe it or not.\n\n \n You still don't get it do you. To you it is real to the non believer it isa fantasy made up to scare people out of their money.", 
   {}, 
   242418, 
   null, 
   1165500360.0
  ], 
  [
   242479, 
   null, 
   "bmittking", 
   "Therefore EZ just commited Blasphemy if he makes judgements upon who is saved and who is not.\n\n \n He takes after Jesus, the Pope, and the ministers from Colorado.", 
   {}, 
   242462, 
   null, 
   1165513140.0
  ], 
  [
   242481, 
   null, 
   "Kronus", 
   "\n I'm starting to think that EZ isn't a Christian is merely out to make the religion look bad.\n\n \n I've long maintained that EZ has pushed more people away from Jesus than anyone else on this forum. No logical, atheistic argument against religion could turn people away as effectively as EZ's horrid \"pro-religion\" stance.", 
   {}, 
   242462, 
   null, 
   1165513860.0
  ], 
  [
   242484, 
   null, 
   "Judeau", 
   "I am so angry! We are immersed in a horrific quagmire in Iraq because a bunch of wilfully stupid religious XXXXXX elected George Walker Bush as our president.\n \n I will never be able to forive them.\n \n Some Six Hundred Sixty-Five Thousand Dead Iraqi civilians, men, women and chilldren!\n \n Nearly Three Thousand Dead American Soldiers!\n \n Tens of Thousands of Wounded and Disabled Americans?\n \n Billions of Dollars Each Week into the Toilet because of this wilfully blind religiosity!\n \n You will never be forgiven for your enormous evils.\n\n \n Sorry to revive the beginning of this thread as it has evolved in a new direction but I just had to say this. Does anyone here know how the Lancet got its results?!? Hahahaha. They took a cross section of a small group to get these results. You cannot take this as fact. Bush has stated that an estimated 30,000 have died. 2 other respected statistics groups have estimated between 42,000 to 47,000. And the Lancet says 655,000. Ahahaha! Your telling me you think more have died in Iraq in the last couple of years than all the victims in Darfur?!? (I believe the number where GENOCIDE is happening is around 600,000). Ok, but I just have to ask people to not just post numbers that are grossly inaccurate like that. It is obvious propoganda. Now please, continue your discussions.", 
   {}, 
   241264, 
   null, 
   1165515180.0
  ], 
  [
   242486, 
   null, 
   "Kronus", 
   " Bush has stated that an estimated 30,000 have died.\n \n Ok, but I just have to ask people to not just post numbers that are grossly inaccurate like that. It is obvious propoganda. \n\n \n How about you practice what you preach?", 
   {}, 
   242484, 
   null, 
   1165515900.0
  ], 
  [
   242488, 
   null, 
   "Judeau", 
   "How about you practice what you preach?\n\n \n I was just stating facts that showed all the others figures were in a completely different arena than the Lancet's figures. Bush's estimates are among the lowest I will disclaim so that it is not taken as propaganda. I wanted to give several examples of sources that were well below the 655,000 number to illustrate my point. Bush's was just one that I knew so I wrote it.", 
   {}, 
   242486, 
   null, 
   1165516500.0
  ], 
  [
   242490, 
   null, 
   "georged", 
   "I was just stating facts that showed all the others figures were in a completely different arena than the Lancet's figures. Bush's estimates are among the lowest I will disclaim so that it is not taken as propaganda. I wanted to give several examples of sources that were well below the 655,000 number to illustrate my point. Bush's was just one that I knew so I wrote it.\n\n \n \n From the recent Iraq Study Report:\n \n ~On page 94 of its report, the Iraq Study Group found that there had been \"significant under-reporting of the violence in Iraq.\" The reason, the group said, was because the tracking system was designed in a way that minimized the deaths of Iraqis.\n \n \"The standard for recording attacks acts as a filter to keep events out of reports and databases,\" the report said. \"A murder of an Iraqi is not necessarily counted as an attack. If we cannot determine the source of a sectarian attack, that assault does not make it into the database.~", 
   {
    "unicode_changes_made": true
   }, 
   242488, 
   null, 
   1165516920.0
  ], 
  [
   242492, 
   null, 
   "johnhanks", 
   "[Believing in Jesus as divine Lord and Savior] is not a conservative view either...\n\n ... but professing belief in the literal truth of the bible (Genesis 1.1, the flood, exodus etc) usually is.\n \n The reason is very simple: right-wing conservatives want to see social inequalities perpetuated, and quoting carefully selected bible verses as literal unalterable truth provides them with ostensibly unchallengeable justification for this position.", 
   {}, 
   242419, 
   null, 
   1165518360.0
  ], 
  [
   242496, 
   null, 
   "Judeau", 
   "From the recent Iraq Study Report:\n \n ~On page 94 of its report, the Iraq Study Group found that there had been \"significant under-reporting of the violence in Iraq.\" The reason, the group said, was because the tracking system was designed in a way that minimized the deaths of Iraqis.\n \n \"The standard for recording attacks acts as a filter to keep events out of reports and databases,\" the report said. \"A murder of an Iraqi is not necessarily counted as an attack. If we cannot determine the source of a sectarian attack, that assault does not make it into the database.~\n\n \n Are just pointing out facts or are you trying to prove that this journal (and no other reputable source that I've found) that says there have been almost 55,000 more deaths in Iraq than in Darfur is correct? Maybe these other sources are underestimating but by 610,000-625,000 deaths?!? No way, no how. You could tack on 200,000 to any other study if it made you feel like it justified the numbers and not even come close to half of what the Lancet reported. Here is my statement: The Lancet is wrong by the longest shot.", 
   {
    "unicode_changes_made": true
   }, 
   242490, 
   null, 
   1165519740.0
  ], 
  [
   242500, 
   null, 
   "jyoshu", 
   "Are just pointing out facts or are you trying to prove that this journal (and no other reputable source that I've found) that says there have been almost 55,000 more deaths in Iraq than in Darfur is correct?\n\n \n He prefers whatever report will indicate the most deaths--it tells him what he wants to hear in that it would most validate his anti-war and anti-administration view. Never mind that the 600,000+ report has been heavily discredited, and that he's been reminded of that fact at least twice that I know of by others. If a report came out with a million deaths, there is no doubt in my mind that the poster you are interacting with would immediate seize on it.", 
   {}, 
   242496, 
   null, 
   1165520160.0
  ], 
  [
   242509, 
   null, 
   "trebor", 
   "He prefers whatever report will indicate the most deaths--it tells him what he wants to hear in that it would most validate his anti-war and anti-administration view. Never mind that the 600,000+ report has been heavily discredited, and that he's been reminded of that fact at least twice that I know of by others. If a report came out with a million deaths, there is no doubt in my mind that the poster you are interacting with would immediate seize on it.\n\n \n The iraqi goverment says over 200,000. I suspect that more in line. \n \n Still, 200,000 people is a hell of a lot of people dying from violence.", 
   {}, 
   242500, 
   null, 
   1165521900.0
  ], 
  [
   242523, 
   null, 
   "jyoshu", 
   "Still, 200,000 people is a hell of a lot of people dying from violence.\n\n \n I agree, and any number is too much. Nevertheless there's no need to inflate the numbers or use exagerrating or poorly-derived-result sources. The numbers are bad enough without even having to do that.", 
   {}, 
   242509, 
   null, 
   1165525440.0
  ], 
  [
   242525, 
   null, 
   "thelmoose", 
   "Sorry to revive the beginning of this thread as it has evolved in a new direction but I just had to say this. Does anyone here know how the Lancet got its results?!? Hahahaha. They took a cross section of a small group to get these results. You cannot take this as fact. Bush has stated that an estimated 30,000 have died. 2 other respected statistics groups have estimated between 42,000 to 47,000. And the Lancet says 655,000. Ahahaha! Your telling me you think more have died in Iraq in the last couple of years than all the victims in Darfur?!? (I believe the number where GENOCIDE is happening is around 600,000). Ok, but I just have to ask people to not just post numbers that are grossly inaccurate like that. It is obvious propoganda. Now please, continue your discussions.\n\n \n I would like you to answer these questions:\n 1. You call the information in the Lancet propaganda. What would be the incentive for this peer-reviewed journal to publish propaganda?\n 2. Why do you think the Bush administration's data are more reliable?\n 3. You question the methodology of the Lancet research. What are your specific reasons you think this well-accepted method is not appropriate?\n \n You will, of course, need to read the article before you answer #3. \n Here is the reference:\n The Lancet Volume 368, Issue 9545 , 21 October 2006-27 October 2006, Pages 1421-1428\n \n It can be located online here.\n \n I will supply a portion of the article: \nHere is the abstract:\n \n Background\n An excess mortality of nearly 100 000 deaths was reported in Iraq for the period March, 2003-September, 2004, attributed to the invasion of Iraq. Our aim was to update this estimate.\n \n Methods\n Between May and July, 2006, we did a national cross-sectional cluster sample survey of mortality in Iraq. 50 clusters were randomly selected from 16 Governorates, with every cluster consisting of 40 households. Information on deaths from these households was gathered.\n \n Findings\n Three misattributed clusters were excluded from the final analysis; data from 1849 households that contained 12 801 individuals in 47 clusters was gathered. 1474 births and 629 deaths were reported during the observation period. Pre-invasion mortality rates were 5.5 per 1000 people per year (95% CI 4.3-7.1), compared with 13.3 per 1000 people per year (10.9-16.1) in the 40 months post-invasion. We estimate that as of July, 2006, there have been 654 965 (392 979-942 636) excess Iraqi deaths as a consequence of the war, which corresponds to 2.5% of the population in the study area. Of post-invasion deaths, 601 027 (426 369-793 663) were due to violence, the most common cause being gunfire.\n \n Interpretation\n The number of people dying in Iraq has continued to escalate. The proportion of deaths ascribed to coalition forces has diminished in 2006, although the actual numbers have increased every year. Gunfire remains the most common cause of death, although deaths from car bombing have increased. \n \n \n From the Discussion section:\n \n Our estimate of excess deaths is far higher than those reported in Iraq through passive surveillance measures. This discrepancy is not unexpected. Data from passive surveillance are rarely complete, even in stable circumstances, and are even less complete during conflict, when access is restricted and fatal events could be intentionally hidden. Aside from Bosnia, we can find no conflict situation where passive surveillance recorded more than 20% of the deaths measured by population-based methods. In several outbreaks, disease and death recorded by facility-based methods underestimated events by a factor of ten or more when compared with population-based estimates. Between 1960 and 1990, newspaper accounts of political deaths in Guatemala correctly reported over 50% of deaths in years of low violence but less than 5% in years of highest violence. Nevertheless, surveillance tallies are important in monitoring trends over time and in the provision of individual data, and these data track closely with our own findings.\n \n\n \n You really don't know what you are talking about.", 
   {
    "unicode_changes_made": true
   }, 
   242484, 
   null, 
   1165525680.0
  ], 
  [
   242532, 
   null, 
   "Judeau", 
   "Ya know what, fine. There were 655,000 deaths in Iraq since we arrived. How could I have been so mistaken? That number makes so much more sense now that I read the entire journal. Sorry, I was mistaken. There have been more deaths in Iraq than in Darfur. Infallible that test was. Almost 900 people a day have been killed since we first got there according to the results.", 
   {}, 
   242525, 
   null, 
   1165526700.0
  ], 
  [
   242549, 
   null, 
   "thelmoose", 
   "Ya know what, fine. There were 655,000 deaths in Iraq since we arrived. How could I have been so mistaken? That number makes so much more sense now that I read the entire journal. Sorry, I was mistaken. There have been more deaths in Iraq than in Darfur. Infallible that test was. Almost 900 people a day have been killed since we first got there according to the results.\n\n \n You sound sarcastic.\n The second to last sentence sounds Yoda-like. (Unconvinced you seem.)\n How could you be so mistaken indeed. You still did not answer any of the 3 questions I put to you in the last post.\n \n If you disagree with this, then produce some evidence to substantiate your claim. \n If you agree with this, then you may recognize the gravity of the situation in Iraq. If the numbers are worse than Darfur, which you referred to as genocide, then you must see the equally tragic disaster occurring in Iraq that the US had hand in.\n \n I personally would have no way to estimate the number of casualties occurring. Therefore I would rely on someone else to measure it. The measurement may be wrong. It is up to me to weigh the pros and cons of the authors' argument before deciding what to believe. However, just not liking the results does not constitute a valid reason for dismissing them.", 
   {}, 
   242532, 
   null, 
   1165533360.0
  ], 
  [
   242563, 
   null, 
   "Judeau", 
   "Earlier in the thread if you read I mentioned other studies that I have seen that gave results of number of deaths in Iraq since we (the US) entered. Bush's was only one of the 3. Bush said 30,000. The other independent studies that I have forgotten their names gave figures that were 42,000 and 47,000. But I swear I saw those figures. I saw these figures in a local publication about 2 months ago and have since forgotten the names of the organizations that gave those results but I remember the numbers. (It would take far too long to find the publication and then find where they got their info) Someone else on this thread mentioned an Iraqi study that shows 200,000 have died. Now this is four separate studies that show the number is nowhere near 655,000. \n \n It may not be propoganda in itself, but I do believe that being four studies to one, people who reference the Lancet and only the Lancet (because I've not heard of anyone putting out a legitimate study that yields the same numbers) are using it for propoganda. They may be right and you can believe them if you want but I will not believe after seeing four different figures that all show dramatically lower numbers than the Lancet that the number is 655,000 or anywhere near it.", 
   {}, 
   242549, 
   null, 
   1165537260.0
  ], 
  [
   242565, 
   null, 
   "thelmoose", 
   "Earlier in the thread if you read I mentioned other studies that I have seen that gave results of number of deaths in Iraq since we (the US) entered. Bush's was only one of the 3. Bush said 30,000. The other independent studies that I have forgotten their names gave figures that were 42,000 and 47,000. But I swear I saw those figures. I saw these figures in a local publication about 2 months ago and have since forgotten the names of the organizations that gave those results but I remember the numbers. (It would take far too long to find the publication and then find where they got their info) Someone else on this thread mentioned an Iraqi study that shows 200,000 have died. Now this is four separate studies that show the number is nowhere near 655,000. \n \n It may not be propoganda in itself, but I do believe that being four studies to one, people who reference the Lancet and only the Lancet (because I've not heard of anyone putting out a legitimate study that yields the same numbers) are using it for propoganda. They may be right and you can believe them if you want but I will not believe after seeing four different figures that all show dramatically lower numbers than the Lancet that the number is 655,000 or anywhere near it.\n\n \n When faced with whom to believe out of conflicting sources of information, I always try to think about the cause of or motivation behind the discrepancy. These information sources have greatly disparate results. Why would that be? It could be an error due to human oversight, technical flaws or the incorrect methodology. It could be deception or wishful thinking. \n \n You mention propaganda yet again. I ask you yet again, what would be the motivation for an amazingly respected journal like the UK's Lancet for promoting propaganda? A medical journal's primary reason for being is the promotion of health. Peer review is an effective way of reviewing methodology and The Lancet is no slouch at this. This was written by public health experts, not by journalists or an administration that is reeling from its terrible public image.\n \n The Bush administration and those other sources whom you can't remember (hence would be unable to decide anything about their veracity) versus cold science.\n \n At least in the latter, you are able to study the methods whereby they arrived at these conclusions. I ask you again to explain what specific fault you find. \n \n The article gave a perfectly plausible reason for the discrepancy. \"Passive surveillance\" is typically only \"5-20%\" of the numbers achieved by the method that was used. And they gave a pretty convincing arguement why their method is superior to the other. \n \n You have yet to provide any object criteria except \"three beats one\". But are you comparing apples to apples?\n \n Or do you prefer to continue to believe what you want to be true? I want the lower number to be true, of course, but I fear the higher number is tragically much more accurate.", 
   {}, 
   242563, 
   null, 
   1165540500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Wilful Blindness of Religion", 
  "url": "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9243, 
  "discussion_files": [
   [
    "32528.html", 
    "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion-print.html"
   ], 
   [
    "32529.html", 
    "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion-7-print.html"
   ], 
   [
    "32530.html", 
    "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion-5-print.html"
   ], 
   [
    "32531.html", 
    "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion-4-print.html"
   ], 
   [
    "32532.html", 
    "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion-6-print.html"
   ], 
   [
    "32533.html", 
    "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion-3-print.html"
   ], 
   [
    "32534.html", 
    "http://www.4forums.com/political/religion-debates/9243-wilful-blindness-religion-2-print.html"
   ]
  ], 
  "identifier": 9243
 }
]