[
 [
  [
   14098, 
   null, 
   "prometheus", 
   "Atoms are atracted to each other in terms of charge. Negative and positve. It seems to me if RNA is to match up to a strand of DNA it would need to be atracted to it in terms of chage. The copy would be opisite interms of charge. This is what I mean interms of oppisites. The universe acts in a state of balance. Evolution consists of a balance between compitition and cooperation. You can see these to seperate states of interation are not physical properties but methods of interaction. It is true to say they are oppisties. The DNA does not make ammino acids the RNA does. So is it true the RNA has an oppistie charge to the DNA it matches up against. This RNA is not a copy of DNA but reflects it in terms of charge. When I say oppisite I mean charge.", 
   {
    "post_info": {
     "post_title": "Rna"
    }
   }, 
   null, 
   null, 
   1062519060.0
  ], 
  [
   14122, 
   null, 
   "lurch", 
   "Atoms are atracted to each other in terms of charge. Negative and positve.\n\n Atoms are neutral. Ions have charge.\n \nIt seems to me if RNA is to match up to a strand of DNA it would need to be atracted to it in terms of chage. The copy would be opisite interms of charge.\n\n DNA and RNA aren't atoms and therefore they are not ions. Both are essentially large molecules. While it is possible to have charged molecules, that isn't the case here. The bases of the two chains of the double helix are joined by hydrogen bonds. These bonds are separated when the chromosome reproduces and when it makes mRNA. It isn't really a positive or negative charge that causes the bases to form the mRNA to attach to the DNA but the open bonds. Only one of the bases fit.\n \n And the RNA doesn't really \"attach itself\" to the DNA. The bases do in the specified sequence and then the pentose and the phosphate forms the backbone of the chain and the DNA has been transcribed into RNA, mRNA to be specific.\n \nThe copy would be opisite interms of charge. This is what I mean interms of oppisites.\n\n There is no sense of \"opposite\" between DNA and RNA.\n \nThe universe acts in a state of balance.\n\n I don't know what that means.\n [quote]Evolution consists of a balance between compitition and cooperation.\n No it doesn't. Evolution is a change in the frequency in alleles in a population over time. That change is caused by the action of several mechanisms.\n \nYou can see these to seperate states of interation are not physical properties but methods of interaction. It is true to say they are oppisties.\n\n No. The mechanisms of natural selection are quite physical. Mutations are a variety of types of change in the makeup of the genome, point mutations, crossover, inversions, insertions, deletions, duplications. Gene flow involves the movement of individuals or groups of individuals into the gene pool of a new population. Recombination is the process that takes place as reproductive cells (gametes) are formed. Genetic drift is the chance increase of decrease of a particular gene in a population. Sexual selection causes changes in allele frequencies according to what the opposite sex prefers. And finally, there is natural selection. Natural selection is essentially differential reproductive success. In other words, those organisms that possess characteristics that give them an advantage in their environment will tend to be more successful in producing offspring.\n \nThe DNA does not make ammino acids the RNA does.\n\n Neither makes amino acids. There are processes that may build amino acids in some cases, and those processes may have an enzyme associated with them, but the enzyme is a protein.\n \nSo is it true the RNA has an oppistie charge to the DNA it matches up against.\n\n Nope. No charges involved. Neither DNA nor RNA has a charge.\n \nThis RNA is not a copy of DNA but reflects it in terms of charge. When I say oppisite I mean charge.\n\n Nope. It reflects the DNA in terms of the sequence of nucleotides in the strand. It reflects the sequence of the 3 nucleotide codon that encodes a specific amino acid in a specified sequence that makes up a protein. No charge and no opposite.\n \n Isn't it strange that you have accused me of being a reductionist while you try to reduce complex biological processes to a matter of electrical charge where no charge is involved. You really can't get more reductionist than that.", 
   {}, 
   14098, 
   null, 
   1062533460.0
  ], 
  [
   14206, 
   null, 
   "prometheus", 
   "Thank you for your information you make things much clearer than the text books which assume your knowledge of complex chemical termanology and functions. I must admit I am looking for a patern which creates order from chaos. How about this: If the DNA sequence is ACAGT, a messenger RNA with the sequence UGUCA will be formed from it. The information transferred by DNA is important in its sequence through the way the four bases are linked together in diferent orders. The order is the same in the RNA messanger except all of the bases are oppisite. The base of the DNA is not the code which creates the order of ammino acids but the oppisite of the DNA code is the real code which is required to make ammino acids. DNA is only good as it is the exact oppisite of the code which is required.", 
   {}, 
   14122, 
   null, 
   1062577500.0
  ], 
  [
   14223, 
   null, 
   "prometheus", 
   "For every action there is an equal and oppisite reaction", 
   {}, 
   14206, 
   null, 
   1062610260.0
  ], 
  [
   14240, 
   null, 
   "Karl", 
   "For every action there is an equal and oppisite reaction\n\n \n An induced current flows in a direction to create a magnetic field which will counteract the change in magnetic flux.", 
   {}, 
   14223, 
   null, 
   1062619260.0
  ], 
  [
   14254, 
   null, 
   "lurch", 
   "Thank you for your information you make things much clearer than the text books which assume your knowledge of complex chemical termanology and functions.\n\n Yes. The text books assume that you have had the background before this type of information is presented. All I did is hit the high points in a simple way. The process is fairly complex.\n \nI must admit I am looking for a patern which creates order from chaos. How about this: If the DNA sequence is ACAGT, a messenger RNA with the sequence UGUCA will be formed from it. The information transferred by DNA is important in its sequence through the way the four bases are linked together in diferent orders. The order is the same in the RNA messanger except all of the bases are oppisite. The base of the DNA is not the code which creates the order of ammino acids but the oppisite of the DNA code is the real code which is required to make ammino acids. DNA is only good as it is the exact oppisite of the code which is required.\n\n Except that the tRNA aligns with the mRNA and the tRNA would have the same sequence as the DNA. In your example that would be ACAGU.\n \n Each group of 3 bases encodes an amino acid. 4 bases in groups of three make a possible 64 codons that encode 21 possible amino acids. So you can see that an amino acid usually has more than one code.\n \n Here is an explanation of how it works. http://psyche.uthct.edu/shaun/SBlack/geneticd.html", 
   {}, 
   14240, 
   null, 
   1062628740.0
  ], 
  [
   14332, 
   null, 
   "prometheus", 
   "I could not find your site but must admit I would not understand it anyway. Biology is very complex like maths I find complexity boring. I love physics. The example I used was word for word from my encarta premium software. It was explaining the coding of mRNA of the DNA and from what I understand the bases pair up like opposites. The mRNA is not DNA in that the information is recorded like a mirror with the bases being opposite. The explanation was clear and simple and as you are well aware I can not engage you in biology your knowledge is far more complete. All I can say is the interperation you claim is wrong was directly taken from Encarta in the introduction of DNA. This is the 2003 update. If you have a problem with the interpratation I can post the Quote with in the context of the hole explanation and you may point out were my interperation is wrong. The coding quote was word for word. I may be wrong. However you have seen the patern I have shown in Taoism and it is universal. I do believe it explains what our physicists do not the big bang. If I am correct it diserves further investigation.\n \n Were I am wrong it should be pointed out. I do want your feed back as I was hesitent in posting the pattern with in moleculer biology as it is the only science I did not study at school. I hope you forgive my ignorance and keep an open mind. I have done a lot of research into astrophysics and find Taoism explains reality quite well.", 
   {}, 
   14254, 
   null, 
   1062698280.0
  ], 
  [
   14336, 
   null, 
   "lurch", 
   "I could not find your site but must admit I would not understand it anyway.\n\n Strange. It was just a link. All you had to do was to click on it. Maybe the site was down.\n \nBiology is very complex like maths I find complexity boring. I love physics.\n\n How do you do physics without math?\n \nThe example I used was word for word from my encarta premium software. It was explaining the coding of mRNA of the DNA and from what I understand the bases pair up like opposites.\n\n Funny, it doesn't look like it was \"word for word\" but never mind. The idea I was trying to get across to you is that it doesn't work on the basis of \"opposites.\" Adenine is not the opposite of guanine. They are both purines and many purines are possible. It's just that only adenine and guanine are the only purines found in DNA. If you want to think of them as opposites because there are only two, ok but it isn't opposite in the sense that up is opposite to down or hot opposite to cold. What happens to the \"opposite\" idea when you consider the pyrimidines, thymine, cytosine and uarcil? Are both thymine and uracil the opposite of cytosine? Then what does opposite mean?\n \nThe mRNA is not DNA in that the information is recorded like a mirror with the bases being opposite. The explanation was clear and simple and as you are well aware I can not engage you in biology your knowledge is far more complete. All I can say is the interperation you claim is wrong was directly taken from Encarta in the introduction of DNA. This is the 2003 update. If you have a problem with the interpratation I can post the Quote with in the context of the hole explanation and you may point out were my interperation is wrong. The coding quote was word for word. I may be wrong. However you have seen the patern I have shown in Taoism and it is universal.\n\n Well, too bad you didn't read the web site I linked. I went farther than you. Now I'll go into more detail.\n \n DNA is a double chain of deoxyribonucleic acid. One chain is known as the coding (or sense) strand and the other is known as the template (or antisense) strand. Molecular biologists use the coding strand to designate codon sequences. so here is a double strand of DNA right from that web page.\n \n (5' -< 3') ATGGAATTCTCGCTC\n (3' <- 5') TACCTTAAGAGCGAG\n \n The upper strand is the coding strand and the bottom is the template with the corresponding (or opposite, since you want to call it that) base. This segment represents a sequence of 5 amino acids that would make up part of a protein.\n \n Now, the mRNA is formed on the template so that the mRNA carries the same sequence as the coding strand.\n \n (5' -< 3') AUGGAAUUCUCGCUC\n \n The sequence is the same as the coding strand because biologists chose to call the top strand the coding strand because that is the sequence that is reproduced in the mRNA. The transfer RNA (tRNA), carrying an attached amino acid then aligns with the mRNA - a sequence of (3' -< 5') UAC carries the amino acid methionine, and so on down the line so that each of the 64 possible combinations of 3 bases indicates start, stop, or one of 21 amino acids. So the DNA code ATG encodes methionine and uses the mRNA AUG to build the sequence in the ribosome.\n \n If you see oposites in there, that's fine. Whatever you want to do or need to do in your own head is your business. It isn't mystical or a matter of opposite charges.\n \nI do believe it explains what our physicists do not the big bang. If I am correct it diserves further investigation.\n\n Maybe it does but I can't imagine why physicists haven't found it all that useful.\n \nWere I am wrong it should be pointed out.\n\n I did so.\n \nI do want your feed back as I was hesitent in posting the pattern with in moleculer biology as it is the only science I did not study at school. I hope you forgive my ignorance and keep an open mind. I have done a lot of research into astrophysics and find Taoism explains reality quite well.\n\n I don't know since I haven't found Taoism mentioned in many science books and I have always found that math did a better job of explaining astrophysics.", 
   {}, 
   14332, 
   null, 
   1062705360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rna", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/927-rna.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 927, 
  "discussion_files": [
   [
    "627.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/927-rna-print.html"
   ]
  ], 
  "identifier": 927
 }
]