[
 [
  [
   14109, 
   null, 
   "So Heaven Dies?", 
   "Do you think boxing is too brutal?\n \n Would you want your kids to watch a sport with so much violence?\n \n Do you think these sports should be shown on Tv? ", 
   {
    "post_info": {
     "post_title": "Violence in Sport"
    }
   }, 
   null, 
   null, 
   1062526920.0
  ], 
  [
   14118, 
   null, 
   "Crim", 
   "No, I think boxing is too boring.", 
   {}, 
   14109, 
   null, 
   1062529920.0
  ], 
  [
   14120, 
   null, 
   "AMD4EVER", 
   "No, I think boxing is too boring.\n\n \n I'll agree with that!\n \n Also I want to point out that violence isn't always a bad thing. Boxing is mindless fighting in my view, but it is still important for children to learn to fight so perhaps boxing is a valuable skill to teach anyways. It is the same with most other sports. They teach strength, endurance, toughness, dicipline, rules, and honor. I would encourage all our youth to enroll in karate at least once in their life to get a lesson in all these skills.\n \n Now if you were to debate movies and television violence, you would get a different response. But as far as sports go, I'd say they promote what is good about humanity as it is all done in fairness and with great dedication and incredible skills.", 
   {}, 
   14118, 
   null, 
   1062530460.0
  ], 
  [
   14126, 
   null, 
   "fallingupwards", 
   "violence isn't always a bad thing\n\n \n Hmmm are you sure about that? I'm not sure that I can agree that violence can be good.\n \n \nit is still important for children to learn to fight\n\n \n Yeah so we can raise children who think violence and war is the only answer to solving problems.", 
   {}, 
   14120, 
   null, 
   1062539040.0
  ], 
  [
   14130, 
   null, 
   "AMD4EVER", 
   "Yeah so we can raise children who think violence and war is the only answer to solving problems.\n\n \n I'm not a psychologist but are you sure that someone who is involved with sports or the martial arts is going to be prone to thinking more about violence and war than those who are not? Don't you also have to exercise control and discipline in these types of activities and don't they also give you more self confidence and respect which I would think will steer you away from self destructive acts such as violence against others.\n \n My guess is those who have a lot more time on their hands and less respect for themselves are the ones who will use violence to injure and commit crimes. I know back in High School the ones who played sports may have had the bigger egos which has its own negative side effects, but they were not the ones that trashed the cars in the parking lot or broke the windows or ended up as pot heads.\n \n But if you think sports is bad for our youth since it is too violent, what is your suggestion to make our children grow up and not think of violence and war?", 
   {}, 
   14126, 
   null, 
   1062539760.0
  ], 
  [
   14137, 
   null, 
   "fallingupwards", 
   "I'm not a psychologist but are you sure that someone who is involved with sports or the martial arts is going to be prone to thinking more about violence and war than those who are not?\n\n \n No not necessarily, but if we teach our kids violence like you suggested then yes they will be more prone to violence (obviously if thats what we teach them) and war.", 
   {}, 
   14130, 
   null, 
   1062541200.0
  ], 
  [
   14140, 
   null, 
   "AMD4EVER", 
   "No not necessarily, but if we teach our kids violence like you suggested then yes they will be more prone to violence (obviously if thats what we teach them) and war.\n\n \n So how is that not necessarily true if in the next part of your sentence you said that teaching violence will cause more violence and obviously you have already linked violent sports to violence?\n \n What I think is true is that if children are prepared to defend themselves from violence then they will be less likely to be violent. It generally will take violence or at least the threat of violence to defend against violence and that requires teachings in violence.\n \n My younger brother was probably the shortest kid in his class but from this he spawned a real tough guy image and was sort of a bully at school. However his image was soon changed after joining martial arts. He learned how to fight and in turn quit fighting. This is the type of teachings I was talking about in my original post. If you teach someone to be tough, respectful, and skilled in a physical way, then they will be less likely to be violent although they will learn all these things in a violent setting.", 
   {}, 
   14137, 
   null, 
   1062542160.0
  ], 
  [
   14149, 
   null, 
   "fallingupwards", 
   "So how is that not necessarily true if in the next part of your sentence you said that teaching violence will cause more violence and obviously you have already linked violent sports to violence.\n\n \n Well when you purposely teach violence to a kid, chances are the kid is going to be more violent. In boxing, the teaching of violence is not as direct, so it can have different consequences for different people", 
   {}, 
   14140, 
   null, 
   1062552180.0
  ], 
  [
   14150, 
   null, 
   "Crim", 
   "There's a difference between teaching people how to defend themselves and teaching people to be aggressors.", 
   {}, 
   14149, 
   null, 
   1062552300.0
  ], 
  [
   14158, 
   null, 
   "fallingupwards", 
   "There's a difference between teaching people how to defend themselves and teaching people to be aggressors.\n\n \n There are sooooo many other things that children should be taught, than \"learning how to fight\". Teaching that \"violence is not a bad thing\", as was suggested, is not the message that needs to be taught.", 
   {}, 
   14150, 
   null, 
   1062554400.0
  ], 
  [
   14161, 
   null, 
   "AMD4EVER", 
   "There are sooooo many other things that children should be taught, than \"learning how to fight\". Teaching that \"violence is not a bad thing\", as was suggested, is not the message that needs to be taught.\n\n \n First off I never said that we should teach that violence is not a bad thing. I said that it isn't always a bad thing. The original post was making it clear that violence in boxing was bad. I then suggested that not all violence was bad including that which is taught in boxing. So if your refering to me suggesting that we should preach violence your misquoting me.\n \n Learning how to fight isn't a top priority but the lessons that come with it make it more attractive. You may preach general education taught in our school system and I do as well, but I think it doesn't hurt to teach our children the lessons that come with taking something like martial arts or by joining a sports team.", 
   {}, 
   14158, 
   null, 
   1062555300.0
  ], 
  [
   18057, 
   null, 
   "afrsmile", 
   "it depends on what sport or mix of sports you teach them.\n i do a mix of self defence and kick boxing, most of the moves taught can only be used i ur being attack, from hair being pulled to being threatened with a knife. the kick boxing is really relaxing and relieves stress and frustration. so insted of taking out your anger on someone u can take it out on a punch bag emoticon_xkill", 
   {}, 
   14161, 
   null, 
   1065194820.0
  ], 
  [
   18358, 
   null, 
   "AMD4EVER", 
   "it depends on what sport or mix of sports you teach them.\n i do a mix of self defence and kick boxing, most of the moves taught can only be used i ur being attack, from hair being pulled to being threatened with a knife. the kick boxing is really relaxing and relieves stress and frustration. so insted of taking out your anger on someone u can take it out on a punch bag emoticon_xkill\n\n \n Exactly! Violence in those sports is beneficial as it teaches real world skills, is good for exercise and discipline, and it is fun.", 
   {}, 
   18057, 
   null, 
   1065479220.0
  ], 
  [
   25573, 
   null, 
   "Toxey", 
   "Exactly! Violence in those sports is beneficial as it teaches real world skills, is good for exercise and discipline, and it is fun.\n\n I agree 100%", 
   {}, 
   18358, 
   null, 
   1070601780.0
  ], 
  [
   37883, 
   null, 
   "Adept", 
   "I think we need to start quantifying our terms here. Violence is a very large 'catch all' phrase that covers a wide range of things. In some cases it is good, in others bad.\n \n If someone comes at you with a tire iron in a fit of road rage, then you must defend yourself. Some times it is simply not possible, nor is it the correct thing to do to simply take the pacifistic option. Remember, all it takes for the triumph of evil is for good men to do nothing.\n \n However, often times aggresive violence is wrong and detrimental. \n \n There is a very large difference, and simply saying 'Teaching children violence will beget more violence' is incorrect.\n \n With regards to fighting and martial arts. I am something of a reasonably knowledgable individual with regards to the martial arts. I have a black belt in Tae Kwon Do, I also study Ju Jitsu, Jeet Kune Do and regular western boxing. I would hapily let my children watch boxing on the telly, and I fully intend to begin instructing them in the martial arts from their sixth birthday onwards. Most people start fights because they think they have to prove something. They have to prove to themselves that they are 'hard' enough, or tough enough, or they want to prove to their friends how tough they are. A martial artist, as a general rule, has nothing to prove in this regard. He is supremely confident in his own skills, and has a very good knowledge of his abilities, strenghs and weaknesses. He doesnt have to prove to himself, or anyone else how hard he is. He already knows.", 
   {}, 
   25573, 
   null, 
   1078409340.0
  ], 
  [
   38266, 
   null, 
   "Tastyfish", 
   "Violence should be taught as always bad, just sometimes unfortunatly nessesary. \n Seen quite a variety of opinons in relation to kickboxing when me and a group of friends started at Uni, between seeing it as purely exercise to those who really looked forward to be able to fight someone to releive stress and work their agression out. Though the latter group has tended to quit more than the former or those in the middle (see it more as like fencying without the sword as it si played in semicontact, the idea is to do the techniques right and land the blows, rather than trying to see how hard you can punch)", 
   {}, 
   37883, 
   null, 
   1078498500.0
  ], 
  [
   45480, 
   null, 
   "sinjin", 
   "I think we need to start quantifying our terms here. Violence is a very large 'catch all' phrase that covers a wide range of things. In some cases it is good, in others bad.\n \n If someone comes at you with a tire iron in a fit of road rage, then you must defend yourself. Some times it is simply not possible, nor is it the correct thing to do to simply take the pacifistic option. Remember, all it takes for the triumph of evil is for good men to do nothing.\n \n However, often times aggresive violence is wrong and detrimental. \n \n There is a very large difference, and simply saying 'Teaching children violence will beget more violence' is incorrect.\n \n With regards to fighting and martial arts. I am something of a reasonably knowledgable individual with regards to the martial arts. I have a black belt in Tae Kwon Do, I also study Ju Jitsu, Jeet Kune Do and regular western boxing. I would hapily let my children watch boxing on the telly, and I fully intend to begin instructing them in the martial arts from their sixth birthday onwards. Most people start fights because they think they have to prove something. They have to prove to themselves that they are 'hard' enough, or tough enough, or they want to prove to their friends how tough they are. A martial artist, as a general rule, has nothing to prove in this regard. He is supremely confident in his own skills, and has a very good knowledge of his abilities, strenghs and weaknesses. He doesnt have to prove to himself, or anyone else how hard he is. He already knows.\n\n \n emoticon_xgood \n \n I like boxing as well as Sumo and \"ultimate\" fighting etc.\n \n Training in the martial arts discourages brawling.\n \n \"violence never solved anything\" is false in the extreme.", 
   {}, 
   37883, 
   null, 
   1082740320.0
  ], 
  [
   45882, 
   null, 
   "Haulingboat", 
   "Sinjin, I agree. Thru out history the most popular sports have invovled violence to some degree. We can't harbor our children from the world. They are destin to encounter violence of one sort or another at some point in their life.", 
   {}, 
   45480, 
   null, 
   1083008280.0
  ], 
  [
   45883, 
   null, 
   "Waxy", 
   "I'm not sure when physical competition became violence. emoticon_confused \n \n Physical competition is as natural as eating and sleeping, and IMHO, is an essential part of becoming a healthy, well adjusted person.\n \n I've played just about every sport that is considered \"violent\" and I consider them FUN. Does that make me a violent person?\n \n I'm not a big boxing fan, I find it rather boring actually (especially lately), but I definately don't see it as \"violence\". \n \n Violence, IMHO, has become a way overused term, and has lost its true meaning.\n \n Waxy", 
   {}, 
   45882, 
   null, 
   1083009300.0
  ], 
  [
   46449, 
   null, 
   "Maineiac", 
   "I would think that any full contact sport would be a little difficult without some sort of aggresive behavior.I believe it falls back to the theory of teacing our kids right from wrong.Children need to be taught that boxing ,for instance,is entertainment,with rules that protect the participants,and that it is done in a controled situation,not something they should practice on the neighbors kid.Another example is NASCAR.They need to be taught that racing is done in a controled enviroment,with all of the proper safety equipment,not something they should be doing on a Saturday night around the local McDonalds parking lot.Their can be a lot said for teaching your kids to have a little common sense.IMO.", 
   {}, 
   37883, 
   null, 
   1083178680.0
  ], 
  [
   46870, 
   null, 
   "billsco", 
   "I was in a restaurant last night that had kick boxing on. My eye kept getting drawn to it. The fight was called after one opponent was beaten to his knees and then (accidently) kicked hard in the face. I wish I hadn't seen that. There is zero value in that.", 
   {}, 
   46449, 
   null, 
   1083345600.0
  ], 
  [
   47938, 
   null, 
   "Relient Halo", 
   "Violence like many things, has it's ups and downs (like it or not). Violence is part of sports, and is a positive way of channeling negative emotions that could cause far more damage than a broken nose if released in the wrong aspects of life. There's nothing wrong with being a little aggressive, a tad competitive, because of all things (especially with men) it's only natural. Should kickboxing, boxing be on TV? Well, that's personal opinion, and if it offends you then don't watch it, plain and simple. I personally don't enjoy watching boxing matches, not because I have a problem with violence, just doesn't interest me to much.\n \n \nThere are sooooo many other things that children should be taught, than \"learning how to fight\". Teaching that \"violence is not a bad thing\", as was suggested, is not the message that needs to be taught.\n\n \n And in the area of our kids, I agree that children do need to learn how to fight. Not to be the aggressor mind you, but to be able to defend themselves when need be. It's naive and irresponsible to say we shouldn't teach this, because it has no place in the world. You can believe in a utopian society where everything is soved by a debate and the winner is the man with the more convincing rhetoric, but that's a lie. There is always going to be someone out there who will take through war and conquest, and in that instance, if future generations don't understand the importance of \"violence\" in the world and that you MUST fight back and never give in. Teach our children not to hit back? I'm sure this is something the bullies endorse.", 
   {}, 
   14158, 
   null, 
   1083794040.0
  ], 
  [
   57050, 
   null, 
   "bmans301bIMBACK", 
   "I was in a restaurant last night that had kick boxing on. My eye kept getting drawn to it. The fight was called after one opponent was beaten to his knees and then (accidently) kicked hard in the face. I wish I hadn't seen that. There is zero value in that.\n\n \n \n That is the nature of the sport. If you don't like it, don't watch it.", 
   {}, 
   46870, 
   null, 
   1089310380.0
  ], 
  [
   104746, 
   null, 
   "DanPla234", 
   "I don't see the issue with violence in boxing. they use padded gloves, which i know doesn't help entirely, but once one of the fighters is unable to defend himself it is over. Also, about it being shown on TV. Most of the fight advertisements I see are for pay per view. Granted some fights are on HBO or ESPN, but a majority of them are on PPV, so if you don't want to watch it, don't order it. maybe someone can explain what is so bad about boxing, because I don't see an issue.", 
   {}, 
   57050, 
   null, 
   1112808840.0
  ], 
  [
   104966, 
   null, 
   "zachvac", 
   "There is a difference between fighting to hurt your opponent and fighting to win in a battle of physical strength, speed, reactions, and intelligence. One of the best sports to watch is real wrestling. With all the fake stuff on TV, normal wrestling gets passed by. All of them have to be in really good shape, have to have strength everywhere (not just upper-body or lower-body), have to be quick on their feet, have to be able to get leverage on their opponent, etc.\n \n In terms of martial arts, obviously everyone saying it promotes violence has never taken one. I haven't either but I have many friends who do. They learn respect for the art, always bowing to the instructor, they learn discipline, and they learn that respect for the martial art includes only using it for self-defense. Most karate teachers teach that kids should hope to never have to use the skills they learn outside the classroom. They are taught that they should only use them when necessary. They learn discipline, respect, and they get in really good shape. Hardly what I would call promoting violence.", 
   {}, 
   104746, 
   null, 
   1112842140.0
  ], 
  [
   105033, 
   null, 
   "WhiteFalcon", 
   "I'm not sure when physical competition became violence. emoticon_confused \n \n Physical competition is as natural as eating and sleeping, and IMHO, is an essential part of becoming a healthy, well adjusted person.\n \n I've played just about every sport that is considered \"violent\" and I consider them FUN. Does that make me a violent person?\n \n I'm not a big boxing fan, I find it rather boring actually (especially lately), but I definately don't see it as \"violence\". \n \n Violence, IMHO, has become a way overused term, and has lost its true meaning.\n \n Waxy\n\n \n This is a very good point. I believe you all are confusing actuall \"violence\" with physical competition. \n There is a mind set that is different when it becomes \"violence\". \n I think what needs to be done is to see what people think violence really means to them.", 
   {}, 
   45883, 
   null, 
   1112855460.0
  ], 
  [
   105331, 
   null, 
   "georged", 
   "This is a very good point. I believe you all are confusing actuall \"violence\" with physical competition. \n There is a mind set that is different when it becomes \"violence\". \n I think what needs to be done is to see what people think violence really means to them.\n\n \n Would Roman era competition between large, carnivorous animals and humans be defined as physical competition or violence? Is there a real difference between that and humans competing with each other in a manner short of intended death? As one who enjoys a good boxing or kick boxing bout and other one-on-one competition but not team spectator sports, I'm not attempting to present leading questions, as I think there's no difference other than general society's personal fears of death.", 
   {}, 
   105033, 
   null, 
   1112928960.0
  ], 
  [
   105374, 
   null, 
   "zachvac", 
   "Would Roman era competition between large, carnivorous animals and humans be defined as physical competition or violence? Is there a real difference between that and humans competing with each other in a manner short of intended death? As one who enjoys a good boxing or kick boxing bout and other one-on-one competition but not team spectator sports, I'm not attempting to present leading questions, as I think there's no difference other than general society's personal fears of death.\n\n \n \n But you are not fighting to kill, you are fighting to win. It's the same in all organized sports, in football you tackle each other but not to hurt each other only to win the game, they all shake hands and are friends after the game (well, most of them anyways). It isn't the violence aspect that is fun, it's the testing of your physical limitations and stretching them as far as they go.", 
   {}, 
   105331, 
   null, 
   1112939340.0
  ], 
  [
   105420, 
   null, 
   "georged", 
   "But you are not fighting to kill, you are fighting to win. It's the same in all organized sports, in football you tackle each other but not to hurt each other only to win the game, they all shake hands and are friends after the game (well, most of them anyways). It isn't the violence aspect that is fun, it's the testing of your physical limitations and stretching them as far as they go.\n\n \n At the amateur level, yes. Professional football is an entirely different matter. Talk to a pro football player about the level of intent as it relates to violence. Or a pro boxer.", 
   {}, 
   105374, 
   null, 
   1112972460.0
  ], 
  [
   105499, 
   null, 
   "Waxy", 
   "At the amateur level, yes. Professional football is an entirely different matter. Talk to a pro football player about the level of intent as it relates to violence. Or a pro boxer.\n\n \n I disagree George.\n \n You want to win the physical battle, and punish them physically, but intentionally hurting the opponent is never the goal, with the exception of the very few.\n \n No professional athlete wants to end another athlete's career. There is tremendous respect amongs the VAST majority of professional athletes when it comes to fair play and injuries. \n \n It's an unwritten code.\n \n Waxy", 
   {}, 
   105420, 
   null, 
   1112989260.0
  ], 
  [
   105522, 
   null, 
   "georged", 
   "I disagree George.\n \n You want to win the physical battle, and punish them physically, but intentionally hurting the opponent is never the goal, with the exception of the very few.\n \n No professional athlete wants to end another athlete's career. There is tremendous respect amongs the VAST majority of professional athletes when it comes to fair play and injuries. \n \n It's an unwritten code.\n \n Waxy\n\n \n Here's what Deacon Jones answered when asked who was the toughest offensive lineman he ever faced:\n \n Jones: One of them wouldn't do against me. You should be asking me who were the toughest \"two\" linemen or what was the toughest combination or the toughest team -- because you'd definitely have to bring more than one when you come at me. If you just bring one, I'm going to kill somebody.\n \n I met Jones, long ago when interested in football, and others who played during his era. If you don't think violence with intent to do bodily harm was the object, putting a quarterback out for at least the game, you've missed an experience in talking to warrior types. It was similar in meeting and talking with a Marine recon lifer or Navy seal who had spent weeks behind enemy lines and eager for the next tour. \n \n Jones and others from his era believe the game has gotten soft, with all focus and strategy now on offensive scoring versus 'down in the dirt' where injuries bench what are now extremely high priced thoroughbreds. I lost interest in the game when it softened up. Things do change and I accept your opinion that fair play is now a driving force in spectator sports.", 
   {}, 
   105499, 
   null, 
   1112991180.0
  ], 
  [
   105600, 
   null, 
   "Waxy", 
   "Here's what Deacon Jones answered when asked who was the toughest offensive lineman he ever faced:\n \n Jones: One of them wouldn't do against me. You should be asking me who were the toughest \"two\" linemen or what was the toughest combination or the toughest team -- because you'd definitely have to bring more than one when you come at me. If you just bring one, I'm going to kill somebody.\n \n I met Jones, long ago when interested in football, and others who played during his era. If you don't think violence with intent to do bodily harm was the object, putting a quarterback out for at least the game, you've missed an experience in talking to warrior types. It was similar in meeting and talking with a Marine recon lifer or Navy seal who had spent weeks behind enemy lines and eager for the next tour. \n \n Jones and others from his era believe the game has gotten soft, with all focus and strategy now on offensive scoring versus 'down in the dirt' where injuries bench what are now extremely high priced thoroughbreds. I lost interest in the game when it softened up. Things do change and I accept your opinion that fair play is now a driving force in spectator sports.\n\n \n There's always exceptions to the rule, I could list several playing today with the same mindset as Jones. I do agree that today's NFL is a different game. It's far more controlled, and not nearly as \"dirty\" as it once was.\n \n The respect has little to do with fair play, IMHO, and far more to do with respecting each other's livelihoods. They all know that they have limited careers in which to make their money for life. No one wants their career taken by injury, so the unwritten rule is there as much to protect your own career as for the sake of the other guys career.\n \n Wanting to knock the starting QB out of the game, and wanting to end his career are very different things.\n \n Waxy", 
   {}, 
   105522, 
   null, 
   1113005820.0
  ], 
  [
   105803, 
   null, 
   "zachvac", 
   "At the amateur level, yes. Professional football is an entirely different matter. Talk to a pro football player about the level of intent as it relates to violence. Or a pro boxer.\n\n \n well I don't know much about pro boxing but I do know that if you see a sack or a hit right before the throw, usually if they can the person will help the other team's QB up. They were trying to hit them hard so they didn't get the pass off, but they weren't actually trying to hurt them.", 
   {}, 
   105420, 
   null, 
   1113088560.0
  ], 
  [
   119991, 
   null, 
   "Adept", 
   "If you don't think violence with intent to do bodily harm was the object, putting a quarterback out for at least the game, you've missed an experience in talking to warrior types. It was similar in meeting and talking with a Marine recon lifer or Navy seal who had spent weeks behind enemy lines and eager for the next tour.\n\n \n Oh dear.\n \n Not knowing anything about American Football, I'm prepared to give you the benefit of the doubt.\n \n However, even 'back in the day', aiming to seriously injure or kill someone was never the (common) goal in competitive sports, even combat sports. Even in the no rules events held by the Gracies in Brazil, there were very few seriously debilitating permanent injuries inflicted, and no deaths at all. And for the time, they were the best of the best, bar none.", 
   {}, 
   105522, 
   null, 
   1115732760.0
  ], 
  [
   120405, 
   null, 
   "zachvac", 
   "Here's what Deacon Jones answered when asked who was the toughest offensive lineman he ever faced:\n \n Jones: One of them wouldn't do against me. You should be asking me who were the toughest \"two\" linemen or what was the toughest combination or the toughest team -- because you'd definitely have to bring more than one when you come at me. If you just bring one, I'm going to kill somebody.\n \n\n Do you really think he meant kill? The object of the game is physical. While he sounds a bit egotistical, I don't think he was talking of violence in actually trying to hurt them because he wanted them to feel pain.\n \n \n\n I met Jones, long ago when interested in football, and others who played during his era. If you don't think violence with intent to do bodily harm was the object, putting a quarterback out for at least the game, you've missed an experience in talking to warrior types. It was similar in meeting and talking with a Marine recon lifer or Navy seal who had spent weeks behind enemy lines and eager for the next tour. \n \n\n Of course you want to hit the QB but this isn't for harm. The more he gets hit right after a throw the more rattled he will be and he will just plain get worn out. What would be trying to do harm would be after the whistle or at least a considerable amount of time just going up and plowing the QB. This is a penalty and if you did it on purpose you will most likely get ejected. The main reason they even would do this is because they get embarassed or frustrated and let their emotions get the best of them, not to actually cause bodily harm.\n \n \n\n Jones and others from his era believe the game has gotten soft, with all focus and strategy now on offensive scoring versus 'down in the dirt' where injuries bench what are now extremely high priced thoroughbreds. I lost interest in the game when it softened up. Things do change and I accept your opinion that fair play is now a driving force in spectator sports.\n\n I do enjoy the strategy part of the game as well but the contact also makes it fun. At school we play tackle football just for fun and no one really aims to hurt anyone. I guess there may be some pros who try to hurt other people not just trying to win the game but it seems most people are only trying to win and the reason it has penalties is to protect the actual safety of the players.", 
   {}, 
   105522, 
   null, 
   1115785020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Violence in Sport", 
  "url": "http://www.4forums.com/political/entertainment-debates/928-violence-sport.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 928, 
  "discussion_files": [
   [
    "5620.html", 
    "http://www.4forums.com/political/entertainment-debates/928-violence-sport-print.html"
   ], 
   [
    "5621.html", 
    "http://www.4forums.com/political/entertainment-debates/928-violence-sport-3-print.html"
   ], 
   [
    "5622.html", 
    "http://www.4forums.com/political/entertainment-debates/928-violence-sport-2-print.html"
   ]
  ], 
  "identifier": 928
 }
]