[
 [
  [
   242158, 
   null, 
   "Jo Bennett", 
   "Hugo Chavez has won a resounding victory, which even his opponents are admitting is legitimate this time, in the recent Venezuelan presidential election. Anyone want to place bets on how long before US politicians are accusing him of being a dictator again?", 
   {
    "post_info": {
     "post_title": "Chavez wins a 3rd term"
    }
   }, 
   null, 
   null, 
   1165276380.0
  ], 
  [
   242166, 
   null, 
   "Missouri Mule", 
   "Hugo Chavez has won a resounding victory, which even his opponents are admitting is legitimate this time, in the recent Venezuelan presidential election. Anyone want to place bets on how long before US politicians are accusing him of being a dictator again?\n\n \n He IS a dictator. He openly declared himself to be committed to socialism which is exactly what Castro did. That's tantamount to being a communist one party dictatorship.\n \n He is closing down opposing newspapers and news outlets, etc. It will only be matter of time before he moves Iranian missiles and soon to be nuclear warheads onto his soil just like Castro did. He has now become a member in good standing among the Axis of Evil. Just like we said he would. His goons have openly murdered people on the streets of Caracas. He is a despicable piece of human debris. Just like Castro.", 
   {}, 
   242158, 
   null, 
   1165283340.0
  ], 
  [
   242168, 
   null, 
   "Jo Bennett", 
   "socialsm =/= dictatorship, whatever Joe McCarthy might say. The opposition still owns the majority of the Venezuelan media. I'd like to see the evidence that Chavez has had people murdered as well, or indeed that he has any hostile intentions towards his neighbours or the US. How is it that an election that even the defeated candidate conceeds was free and fair happen in a dictatorship? What planet are you from?", 
   {}, 
   242166, 
   null, 
   1165283700.0
  ], 
  [
   242190, 
   null, 
   "Missouri Mule", 
   "socialsm =/= dictatorship, whatever Joe McCarthy might say. The opposition still owns the majority of the Venezuelan media. I'd like to see the evidence that Chavez has had people murdered as well, or indeed that he has any hostile intentions towards his neighbours or the US. How is it that an election that even the defeated candidate conceeds was free and fair happen in a dictatorship? What planet are you from?\n\n \n You should read the news. His goons gunned down innocent citizens and it was well documented and written about. Reading the \"Communist Manifesto\" is not the place I go to get my news.", 
   {}, 
   242168, 
   null, 
   1165292640.0
  ], 
  [
   242209, 
   null, 
   "Liminus", 
   "Once again you make extreme claims without any support. It surely would not be difficult (if it were true) to link to some reports of \"goons gunning down innocent citizens\". \n \n I have a lot of sympathy for Chavez' cause and hope he remains as idealistic as he claims he will. At the same time I am wary that his government will become corrupt and he will refuse to step down when the time comes.\n \n Here are links to several major news sources covering the recent elections:\n \n  Runaway victory for Chavez (Independent, UK)\n \n Chavez taunts US 'devil' after landslide reelection (Times, UK)\n \n Re - Election Win Emboldens Chavez Agenda (NY Times)\n \n Chavez storms to re-election victory (Reuters)\n \n Hugo Chavez Triumphantly Re-Elected With More Than 60% Of Vote (Le Monde, France)\n \n Chavez Re-Elected in Venezuela (Al-Jazeera)\n \n Not one of these reports covering the election makes any mention of Chavez using goons to gun down civilians. If he had done so at any point during his time in office, it would undoubtedly be mentioned in these reports.\n \n I also searched the Human Rights Watch website http://www.hrw.org\n \n and Amnesty International http://www.amnesty.org/\n \n and the Red Cross http://www.redcross.org/\n \n none of which back up your claim.\n \n All these reports and sites do mention, as I fear, that Chavez is seeking to change the constitution to delimit presidential terms, but there is not even a mention of even unsubstantiated reports of the type you claim, let alone documented ones.", 
   {}, 
   242190, 
   null, 
   1165310400.0
  ], 
  [
   242253, 
   null, 
   "Missouri Mule", 
   "Once again you make extreme claims without any support. It surely would not be difficult (if it were true) to link to some reports of \"goons gunning down innocent citizens\". \n \n I have a lot of sympathy for Chavez' cause and hope he remains as idealistic as he claims he will. At the same time I am wary that his government will become corrupt and he will refuse to step down when the time comes.\n \n Here are links to several major news sources covering the recent elections:\n \n  Runaway victory for Chavez (Independent, UK)\n \n Chavez taunts US 'devil' after landslide reelection (Times, UK)\n \n Re - Election Win Emboldens Chavez Agenda (NY Times)\n \n Chavez storms to re-election victory (Reuters)\n \n Hugo Chavez Triumphantly Re-Elected With More Than 60% Of Vote (Le Monde, France)\n \n Chavez Re-Elected in Venezuela (Al-Jazeera)\n \n Not one of these reports covering the election makes any mention of Chavez using goons to gun down civilians. If he had done so at any point during his time in office, it would undoubtedly be mentioned in these reports.\n \n I also searched the Human Rights Watch website http://www.hrw.org\n \n and Amnesty International http://www.amnesty.org/\n \n and the Red Cross http://www.redcross.org/\n \n none of which back up your claim.\n \n All these reports and sites do mention, as I fear, that Chavez is seeking to change the constitution to delimit presidential terms, but there is not even a mention of even unsubstantiated reports of the type you claim, let alone documented ones.\n\n \n You didn't check far enough. \n \n CARACAS DISPATCH\n \n The Price of Dissent in Venezuela \n Hugo Ch&#225;vez's thugs celebrate their \"victory\" by shooting my mother. \n \n BY THOR L. HALVORSSEN \n Thursday, August 19, 2004 12:01 a.m. EDT \n \n CARACAS, Venezuela--On Monday afternoon, dozens of people assembled in the Altamira Plaza, a public square in a residential neighborhood here that has come to symbolize nonviolent dissent in Venezuela. The crowd was there to question the accuracy of the results that announced a triumph for President Hugo Ch&#225;vez in Sunday's recall referendum. \n \n Within one hour of the gathering, just over 100 of Lt. Col. Ch&#225;vez's supporters, many of them brandishing his trademark army parachutist beret, began moving down the main avenue towards the crowd in the square. Encouraged by their leader's victory, this bully-boy group had been marching through opposition neighborhoods all day. They were led by men on motorcycles with two-way radios. From afar they began to taunt the crowd in the square, chanting, \"We own this country now,\" and ordering the people in the opposition crowd to return to their homes. All of this was transmitted live by the local news station. The Ch&#225;vez group threw bottles and rocks at the crowd. Moments later a young woman in the square screamed for the crowd to get down as three of the men with walkie-talkies, wearing red T-shirts with the insignia of the government-funded \"Bolivarian Circle,\" revealed their firearms. They began shooting indiscriminately into the multitude.\n \n A 61-year-old grandmother was shot in the back as she ran for cover. The bullet ripped through her aorta, kidney and stomach. She later bled to death in the emergency room.\n ...\n \n (Snip)\n \n http://www.opinionjournal.com/extra/?id=110005494\n \n Chavez is a communist dictator who will duly take Venezuela down the toilet. Just give him time. Meanwhile we will likely see Iranian missiles and nuclear warheads stationed down there just like Castro did in the 60's. All of these thugs are the same. They create a boogieman (the United States) to constantly rail against to prop up their regimes. The Iranians, the North Koreans, the Cubans, now the buffoonish dictator Chavez will do the same. It's all in the playbook for how dictators to run their despotic regimes. Blame some outside force to legitimize their crackdowns on their own populations. It'll happen in due course. Wait and see.", 
   {}, 
   242209, 
   null, 
   1165344960.0
  ], 
  [
   242258, 
   null, 
   "Steeeeve", 
   "Chavez is a communist dictator who will duly take Venezuela down the toilet. Just give him time. Meanwhile we will likely see Iranian missiles and nuclear warheads stationed down there just like Castro did in the 60's. All of these thugs are the same. They create a boogieman (the United States) to constantly rail against to prop up their regimes. The Iranians, the North Koreans, the Cubans, now the buffoonish dictator Chavez will do the same. It's all in the playbook for how dictators to run their despotic regimes. Blame some outside force to legitimize their crackdowns on their own populations. It'll happen in due course. Wait and see.\n I actually agree with the boogieman comment. Sadly the tactic works. Another sad fact is the US does it too but we do it within the limits of our constitution (as in not to become a dictator). \n \n Chavez probably will try to become like Sadaam where you have \"elections\" but sadly the opposing party never exists and unlimited terms will happen. \n \n At very best, one should be insanly cautious about this guy.", 
   {}, 
   242253, 
   null, 
   1165348020.0
  ], 
  [
   242268, 
   null, 
   "Missouri Mule", 
   "I actually agree with the boogieman comment. Sadly the tactic works. Another sad fact is the US does it too but we do it within the limits of our constitution (as in not to become a dictator). \n \n Chavez probably will try to become like Sadaam where you have \"elections\" but sadly the opposing party never exists and unlimited terms will happen. \n \n At very best, one should be insanly cautious about this guy.\n\n \n How have we done it? Can you be more specific? If you are going to harken back to the days of Joe McCarthy, that won't work. I lived through those times and am not an apologist for \"Tailgunner Joe.\" But if we discount the threat of the Soviet Union and today's contemporary Nazis we are cruising for a bruising. They mean to kill us; every one of us, if they have a chance to impose their will on the entire world. Most people don't know this but Hitler had a sequel to Mein Kampf where he stated specifically that the U.S. was the ultimate impediment to his 1000 year Reich and we would have to be destroyed or conquered. \n \n Chavez wouldn't be such a big problem but the fact is that he is sitting on top of almost 80 billion barrels of crude and he is emulating Castro and aligning himself with Iran, North Korea and all the thugs of the world. Does this bode well? I hardly think so. He is a Castro with oil; albeit with an IQ of an imbecile. Castro is/was a psychopath. Chavez is a thug and a stupid one at that. I don't know which is more dangerous. Castro nearly succeeded in blowing up the world in 1962. I wonder what we will do this time if Iran (as I expect) stations their nuclear missiles and warheads in Venenzuela to protect against a \"U.S. Invasion.\" These are extraordinarily dangerous times where the suvivors may be living in caves and envying the dead. The \"Doomsday Clock\" is moving ever steadily toward midnight.", 
   {}, 
   242258, 
   null, 
   1165353000.0
  ], 
  [
   291852, 
   null, 
   "PoliticalRef", 
   "Really? Is there any question that he is a dictator?", 
   {
    "post_info": {
     "post_title": "Are you serious?"
    }
   }, 
   242158, 
   null, 
   1196317920.0
  ], 
  [
   291873, 
   null, 
   "Jo Bennett", 
   "Really? Is there any question that he is a dictator?\n\n \n Dictators generally don't bother with a referendum when they want to change the constitution, nor do international monitors, including former US presidents, judge elections to be free and fair in a dictatorship. Not wanting term limits is not a sign of dictatorships. We don't have them in the UK and, though the similarities end here, Thatcher said she wanted to \"go on and on\", rather like Chavez.", 
   {}, 
   291852, 
   null, 
   1196321760.0
  ], 
  [
   292366, 
   null, 
   "Jo Bennett", 
   "Looks like the Venezuelan's rejected the constitutional ammendments, and Chavez has accepted the result, and called on his supporters not to make it a point of conflict. Some dictator...", 
   {}, 
   291873, 
   null, 
   1196668620.0
  ], 
  [
   292384, 
   null, 
   "peteratwar", 
   "Unless he acts like the EU commission who say they accept a referendum then demands the country holds another one until the 'right' result comes in.", 
   {}, 
   292366, 
   null, 
   1196701200.0
  ], 
  [
   293432, 
   null, 
   "Matthew S", 
   "Hugo Chavez has won a resounding victory, which even his opponents are admitting is legitimate this time, in the recent Venezuelan presidential election. Anyone want to place bets on how long before US politicians are accusing him of being a dictator again?\n\n \n Did they ever stop calling him a dictator? Good for Chavez he has done many good things for his people.", 
   {}, 
   242158, 
   null, 
   1197386580.0
  ], 
  [
   293448, 
   null, 
   "Iuris", 
   "My opinion of Chavez:\n \n Loudmouth populist (which is a popular voter choice these days, see, well, half of the world), who has taken the resources of his state and put them to work for every citizen, not just the select rich elite.\n \n We could use more of that in the poorer areas of the world. Much better than the classical dictator that just enriches his close elite.", 
   {}, 
   293432, 
   null, 
   1197390900.0
  ], 
  [
   293467, 
   null, 
   "Matthew S", 
   "My opinion of Chavez:\n \n Loudmouth populist (which is a popular voter choice these days, see, well, half of the world), who has taken the resources of his state and put them to work for every citizen, not just the select rich elite.\n \n We could use more of that in the poorer areas of the world. Much better than the classical dictator that just enriches his close elite.\n\n \n We could use more of that in the USA. \n We need higher taxes on busisness, universal socialized medical care system, government funded college, a reduced military, rent controls, homes for the homeless, and a feed the poor and hungry program.", 
   {}, 
   293448, 
   null, 
   1197393480.0
  ], 
  [
   294855, 
   null, 
   "Bassman", 
   "We could use more of that in the USA. \n We need higher taxes on busisness, universal socialized medical care system, government funded college, a reduced military, rent controls, homes for the homeless, and a feed the poor and hungry program.\nKnow what you get? Unsustainable big government!! Just like New York State.", 
   {}, 
   293467, 
   null, 
   1198402260.0
  ], 
  [
   294857, 
   null, 
   "Matthew S", 
   "Know what you get? Unsustainable big government!! Just like New York State.\n\n \n NO you nationalize the oil companies and that supplies the money. In fact you nationalize all companies that won't put people and the enviornment before profit.", 
   {}, 
   294855, 
   null, 
   1198413360.0
  ], 
  [
   294873, 
   null, 
   "Bassman", 
   "NO you nationalize the oil companies and that supplies the money. In fact you nationalize all companies that won't put people and the enviornment before profit.\nUmm Matty, remember our enemy during the Cold War? They did just that and guess what happened. It took 70 years but the old Soviet Union collapsed. You cannot sustain any society without the private sector!", 
   {}, 
   294857, 
   null, 
   1198426800.0
  ], 
  [
   295067, 
   null, 
   "Matthew S", 
   "Umm Matty, remember our enemy during the Cold War? They did just that and guess what happened. It took 70 years but the old Soviet Union collapsed. You cannot sustain any society without the private sector!\n\n \n Who said anything about getting rid of the private sector. However if they won't put peoples welfare and the enviornment above profits then they need to be nationalized.", 
   {}, 
   294873, 
   null, 
   1198616220.0
  ], 
  [
   295358, 
   null, 
   "Bassman", 
   "Who said anything about getting rid of the private sector. However if they won't put peoples welfare and the enviornment above profits then they need to be nationalized.\nYou did, Matthew. And BTW, busineses do not, I repeat, DO NOT exist to be social welfare entities, as you want. They exist to make money, period! end of story.", 
   {}, 
   295067, 
   null, 
   1198903320.0
  ], 
  [
   295378, 
   null, 
   "Jo Bennett", 
   "You did, Matthew. And BTW, busineses do not, I repeat, DO NOT exist to be social welfare entities, as you want. They exist to make money, period! end of story.\n\n \n Just because they don't currently doesn't mean they can't or haven't in the past. Many 19th century companies, albeit under the influence of tory paternalist philosophies, went to great efforts to ensure the wellbeing of their workers, thinking particularly here of Joseph and Seebohm Rowntree, Titus Salt and Cadbury. There are also a fair number of cooperatively run businesses in the UK that have strict ethical trading policies, e.g. co-op bank will not invest in certain companies for ethical and environmental reasons. Co-operative Wholesale Society is one of the largest suppliers of fair trade products at comparable prices to regular products (i.e. they eat the difference in cost).", 
   {}, 
   295358, 
   null, 
   1198930920.0
  ], 
  [
   295467, 
   null, 
   "E Mutz", 
   "Who said anything about getting rid of the private sector. However if they won't put peoples welfare and the enviornment above profits then they need to be nationalized.\n\n \n Out of curiosity do you have a savings account? Yes? Imagine that. So do you accept just enough salary to pay your bills or do you retain a surplus in the form of savings once you have paid your rent, groceries et al. What??? You consciously and willingly keep more money than you need??? What gall! What greed! Oh the humanity!!\n \n If sir, you are not giving away your last red cent above your OWN needs to feed the po' or save the Earth, how then can you call for the corporate body to do so? Should YOU be nationalized? Should YOU be compelled to surrender your profit to solve those ills you have cited? \n \n Of course not.\n \n It would appear that you are only generous with other people's money.\n \n Greedy Rabbit, Socialism is for Kids!", 
   {
    "unicode_changes_made": true
   }, 
   295067, 
   null, 
   1198988880.0
  ], 
  [
   295474, 
   null, 
   "Bassman", 
   "Once again, Mutzie, you hit one out of the park!!", 
   {}, 
   295467, 
   null, 
   1198998300.0
  ], 
  [
   295476, 
   null, 
   "Jo Bennett", 
   "Except that I would imagine that Matthew, like most decent people, recognises that he has a social responsibility beyond simply making money. You are claiming that corporations should have no such responsibility. No-one is suggesting (at the moment) that corporation can't make money, only that making money should not be their only priority, because it is detrimental to society for that to be the case.", 
   {}, 
   295474, 
   null, 
   1199012940.0
  ], 
  [
   295479, 
   null, 
   "E Mutz", 
   "Except that I would imagine that Matthew, like most decent people, recognises that he has a social responsibility beyond simply making money. \n\n \n And I am sure that Matthew exercises that social responsibility by obeying society's laws, petting homeless dogs, etc. But no one is suggesting that the gubment tell Matthew in the form of increased taxation that he is not a decent custodian of social mores. Matthew on the other hand is deciding for all of us that Company X is not a good corporate citizen and thus must foist over more of its revenue in the form of taxes. \n \n \nYou are claiming that corporations should have no such responsibility. \n\n \n No, I am claiming that it is not your responsibility to determine the level of another person's or company's generosity.\n \n \n \nNo-one is suggesting (at the moment) that corporation can't make money, only that making money should not be their only priority, because it is detrimental to society for that to be the case.\n\n \n Translation: Its OK to keep your money (for the moment) if, like Matthew, you moralize moralize moralize.", 
   {}, 
   295476, 
   null, 
   1199016480.0
  ], 
  [
   295552, 
   null, 
   "Bassman", 
   "The problem here is that Socialism (and by extension American Liberalism and the Left), think that corperations, the \"rich\" (translation: small business owners and anyone earning more than $50K USD) need to pony up more of their hard-earned to fund inefficient, bureacrat-laden, and corrupt guvvment agencies, all because they \"care about the children\" or some other blather like that. Now, I'm not saying that charity should be thrown out the window, but charity by government edict is Socialism...no, Communism pure and simple!", 
   {}, 
   295479, 
   null, 
   1199045400.0
  ], 
  [
   295558, 
   null, 
   "Bassman", 
   "Just because they don't currently doesn't mean they can't or haven't in the past. Many 19th century companies, albeit under the influence of tory paternalist philosophies, went to great efforts to ensure the wellbeing of their workers, thinking particularly here of Joseph and Seebohm Rowntree, Titus Salt and Cadbury. There are also a fair number of cooperatively run businesses in the UK that have strict ethical trading policies, e.g. co-op bank will not invest in certain companies for ethical and environmental reasons. Co-operative Wholesale Society is one of the largest suppliers of fair trade products at comparable prices to regular products (i.e. they eat the difference in cost).\nI wonder how many of those are propped up by the British government?? Again, the private sector suffers because of governmental involvement.", 
   {}, 
   295378, 
   null, 
   1199048580.0
  ], 
  [
   295562, 
   null, 
   "Jo Bennett", 
   "None of them. (I wrote a longer explanation but it got eaten) When the government gets into business it tends to choose conventional capitalist models, as with the privatisation of the rail network and utilities.", 
   {}, 
   295558, 
   null, 
   1199050560.0
  ], 
  [
   295594, 
   null, 
   "Bassman", 
   "None of them. (I wrote a longer explanation but it got eaten) When the government gets into business it tends to choose conventional capitalist models, as with the privatisation of the rail network and utilities.\nThat may or may not work where cradle-to-grave socialism has been the norm of the day (but for how much longer) Here in this country, if you don't have a thriving private sector, depsite the government, then you ask for problems.", 
   {}, 
   295562, 
   null, 
   1199067120.0
  ], 
  [
   295606, 
   null, 
   "Penfold", 
   "That may or may not work where cradle-to-grave socialism has been the norm of the day (but for how much longer) Here in this country, if you don't have a thriving private sector, depsite the government, then you ask for problems.\n\n \n How would you know?", 
   {}, 
   295594, 
   null, 
   1199069340.0
  ], 
  [
   295613, 
   null, 
   "Bassman", 
   "How would you know?\nOne shining example of Liberalism run amok is New York State. Since I live here, I know about the economic morass that was created by Liberal politicians who, while with \"good\" intentions (and I use \"good\" rather loosely), created a state with:\n \n 1) The highest tax burden out of all 50 states\n \n 2) The lowest PRIVATE SECTOR business and job growth out of all 50 states and yet...\n \n we have the creme'-de-la-creme' of social-welfare programs in the country!", 
   {}, 
   295606, 
   null, 
   1199070060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Chavez wins a 3rd term", 
  "url": "http://www.4forums.com/political/news-forum/9281-chavez-wins-3rd-term.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 9281, 
  "discussion_files": [
   [
    "15163.html", 
    "http://www.4forums.com/political/news-forum/9281-chavez-wins-3rd-term-print.html"
   ], 
   [
    "15164.html", 
    "http://www.4forums.com/political/news-forum/9281-chavez-wins-3rd-term-3-print.html"
   ], 
   [
    "15165.html", 
    "http://www.4forums.com/political/news-forum/9281-chavez-wins-3rd-term-2-print.html"
   ]
  ], 
  "identifier": 9281
 }
]