[
 [
  [
   243128, 
   null, 
   "unlawflcombatnt", 
   "On Friday, December 8th, the House of Representatives passed H.R. 6406, by a vote of 212-184 This bill allows for \"normalization\" of trade with Vietnam.\n \n This new \"permanent normalization of trade relations\" (PNTR) with Vietnam is the first step in opening up their labor market to exploitation by Corporate America and to the outsourcing of American jobs to Vietnam. \n \n What are the relative \"benefits\" to the United States? It allegedly opens up the Vietnamese \"consumer\" market to American goods. However, the benefit of such market opening is minuscule. The exchange traded value of Vietnam's entire GDP is only $43 billion. (See Vietnam: CIA assessment ) This is approximately 3/100ths of a percent of U.S. GDP. To put it another way, if Vietnam's entire GDP was spent on American imports, it would raise U.S. GDP .03%. So a U.S. GDP growth of 2.20% would rise to 2.23%. Again, this is assuming ALL of Vietnam's GDP was spent on American goods, which is certainly not going to happen. Vietnam's Exchange Rate per capita GDP is only $521/year. {Vietnam's Purchasing Power Parity (PPP) per capita GDP is listed as $2800. By converting this to an exchange rate value this becomes a per capita income of only $521/year. It's the Exchange Rate income that is important here, because this measures the ability to purchase American imports.} Given these numbers it's very unlikely that we can sell significant U.S production to Vietnamese consumers. \n \n What's the downside? Vietnam has a labor force of 43 million workers. Once Vietnam is opened up to investment by Corporate America, this could become a virtual addition of 43 million workers to America's 152 million participating labor force. If Corporate America replaced 43 million American workers ( averaging $17/hour ) with 43 million Vietnamese workers, it would reduce American labor & consumer income by $1.52 trillion.\n \n (43 million X $17/hr. X 8 hrs./day X 365 days/yr. X 5 days/wk divided by 7 days/week = $1.52 trillion. )\n \n This would also reduce American consumer spending power by $1.52 trillion dollars. A decline in consumer spending by that $1.52 trillion, subtracted directly from our $13 trillion GDP, would amount to a direct decline in our GDP of almost 12%. (Applying any multiplier would drop our GDP far more than 12%) Of course, we could \"gain\" that whopping 0.03% in GDP from selling our exports to Vietnam. \n \n These are theoretical calculations only, designed to show the magnitude of relative benefits vs. costs to Americans from \"normalization\" of trade with Vietnam. While Corporate America is not likely to hire all 43 million Vietnamese workers, it's clear that the potential loss to our economy is much greater than the potential gain. We'll gain an almost non-existent consumer market from Vietnam, while adding a virtual 43 million workers to America's labor pool. And the direct loss of jobs is only the measurable effect. The decline in American wages from the supply & demand effect of competition with another 43 million impoverished workers hasn't been calculated. Clearly this would decrease American wages and labor income MUCH more than just $1.52 trillion. \n \n To the majority of Americans, permanent normalization of trade with Vietnam is exclusively negative. Once again, it'll put American workers (and their wages) in direct competition with impoverished 3rd world workers. \n \n Clearly the goal here is not to open up the Vietnamese consumer market to American goods. The goal is to open up the Vietnamese labor market to American Multinational Corporations. The true goal is to replace even more American workers with easily exploitable semi-slave laborers of another impoverished country. It'll be another disaster for American workers, and another windfall profit gain for rich Globalist Corporations.\n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary\n \n _________________\n The economy needs balance between the \"means of production\" & \"means of consumption.\"", 
   {
    "post_info": {
     "post_title": "Outsourcing Bonanza: Vietnamese Trade Normalization"
    }
   }, 
   null, 
   null, 
   1165984140.0
  ], 
  [
   243157, 
   null, 
   "georged", 
   "While I do understand a protectionist viewpoint with regard to patriotic emotion, a noble but fruitless endeavor, I fail to comprehend condemnation of capitalistic practices in a global society based on emotion. \n \n Primarily due to the extreme prosperity enjoyed by the US in post ww2 trade and domestic expansion, when virtually the rest of the worlds' manufacturing capability was destroyed, the US had no industrial competition. Absolute US industrial dominance allowed Americans to achieve a standard of living unparalleled by any other country. With domestic and foreign markets absorbing full industrial production and demand increasing as other nations began to reacquire financial health, US wage and benefit demands, from janitor to CEO, were accepted without question as were profits and capital ROI. \n \n By the 1970s it became apparent the US was reaching a point where global manufacturing competition was becoming a factor to be considered in future planning. Taiwan and Hong Kong were already capitalizing on low cost labor, facilities and government support in China, Singapore and other Asian countries while Japan was beginning to follow their lead. In the late 1970s Paul Volcker made his famous statement that Americans were eventually going to have to learn to live on less. \n \n In the 1980s no change had been made to US industrial production costs with regard to labor or facilities to plan for what would become intense global competition within a decade. But one important factor did change, the American public and government discovered credit as an alternative to traditional economic expansion by transfer of wealth. Wages continued to escalate as did public and personal debt. \n \n Over the next decade US industry began to fail in the face of foreign competition while we became a debtor nation amassing a sea of public and personal debt to maintain our standard of living. By the end of the 1990s our GDP was dominated by transactional debt, with US companies producing higher ROI from financing their products than selling them. The .com fiasco followed by the housing bubble and complete government fiscal irresponsibility in the new century graphically displayed US dependency on transactional debt to maintain a cooked GDP promoting consumer confidence.\n \n Enough of the declining empire recap. What responsible company, US domiciled or other, wouldn't use a $30k Indian engineer versus one in the US demanding $90k or a Vietnamese assembler for $3/day versus $16/hr in the US? Why is there even any question about why US jobs are being outsourced? Patriotic emotion aside, the US had no qualms about dominating markets against no competition but when the tables are turned we find nothing but excuses and groundless blame of others to vent a frustration of no longer being king of the hill. \n \n I'd think the new NAFTA superhighway will generate some real isolationist protest. The eminent domain issues alone will dwarf the Vietnam trade agreement.", 
   {}, 
   243128, 
   null, 
   1166026380.0
  ], 
  [
   243246, 
   null, 
   "unlawflcombatnt", 
   "I agree with much of what you said regarding debt financing of consumer spending being a big problem.\n \n However in answer to your question, \"What responsible company, US domiciled or other, wouldn't use a $30k Indian engineer versus one in the US demanding $90k or a Vietnamese assembler for $3/day versus $16/hr in the US? \", I'd say any company concerned with the welfare of its own workers and the United States as a whole, rather than simply increasing their bottom line at the expense of the nation as a whole. \n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary", 
   {
    "post_info": {
     "post_title": "Outsourcing Bonanza: Vietnam Trade Normalization"
    }
   }, 
   243157, 
   null, 
   1166057040.0
  ], 
  [
   243251, 
   null, 
   "georged", 
   "I agree with much of what you said regarding debt financing of consumer spending being a big problem.\n \n However in answer to your question, \"What responsible company, US domiciled or other, wouldn't use a $30k Indian engineer versus one in the US demanding $90k or a Vietnamese assembler for $3/day versus $16/hr in the US? \", I'd say any company concerned with the welfare of its own workers and the United States as a whole, rather than simply increasing their bottom line at the expense of the nation as a whole. \n \n unlawflcombatnt\n \n Economic Populist Forum\n \n EconomicPopulistCommentary\n\n \n That's a very cavalier opinion. I agree that ideally the US should come first, but isolationism simply doesn't work when all nations are dependent on positive transfer of wealth for economic growth. The US is no longer an agrarian society and simply put its standard of living for the general population must be lowered to make ends meet. If US business entities don't use internal cost of capital based on operating costs comparable to their global competition, they're doomed to failure.", 
   {}, 
   243246, 
   null, 
   1166058180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Outsourcing Bonanza: Vietnamese Trade Normalization", 
  "url": "http://www.4forums.com/political/politics-debates/9306-outsourcing-bonanza-vietnamese-trade-normalization.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9306, 
  "discussion_files": [
   [
    "1696.html", 
    "http://www.4forums.com/political/politics-debates/9306-outsourcing-bonanza-vietnamese-trade-normalization-print.html"
   ]
  ], 
  "identifier": 9306
 }
]