[
 [
  [
   243286, 
   null, 
   "PatJones", 
   "Dear 4FORUMS readers\n I watched a movie four months ago called Supersize me. They did a little segment on schools. Now, I want to elaborate and maybe offer some conclusions.\n Schools today serve reprocessed food with so many calories in it. Some top a thousand. Now, this is not healthy. Some schools like mine, have a snack bar and instead of buying a school lunch, they buy pizza, mozzarella sticks, fries, and ice cream for lunch because they don't like beef stroganoff, or hotdogs. This is truly unhealthy/ America is becoming a fat country. Kids eat unhealthy at school, god knows even at home, and some families eat out Mcdonalds or whatever every night. This is totally nasty.\n I beleive that schools need to start making healthier choices. My school took away the pop and candy machines and replaced them with machines that have powerade, water, and juice boxes. Instead of candy, they got corn nuts, peanuts, fat free potato chips, crackers, and sugar free gum. This was a big blow to our city's schools. Kids were angry for a while, but, they got over it.\n What are some alternatives we could do as far as school lunches? Should we allow our kids to eat the above every day for lunch? Should we allow kids to make unhealthy choices and ruin their lives? \n -Chris", 
   {
    "post_info": {
     "post_title": "School Health"
    }
   }, 
   null, 
   null, 
   1166074740.0
  ], 
  [
   243404, 
   null, 
   "its_just_me", 
   "Dear 4FORUMS readers\n I watched a movie four months ago called Supersize me. They did a little segment on schools. Now, I want to elaborate and maybe offer some conclusions.\n Schools today serve reprocessed food with so many calories in it. Some top a thousand. Now, this is not healthy. Some schools like mine, have a snack bar and instead of buying a school lunch, they buy pizza, mozzarella sticks, fries, and ice cream for lunch because they don't like beef stroganoff, or hotdogs. This is truly unhealthy/ America is becoming a fat country. Kids eat unhealthy at school, god knows even at home, and some families eat out Mcdonalds or whatever every night. This is totally nasty.\n I beleive that schools need to start making healthier choices. My school took away the pop and candy machines and replaced them with machines that have powerade, water, and juice boxes. Instead of candy, they got corn nuts, peanuts, fat free potato chips, crackers, and sugar free gum. This was a big blow to our city's schools. Kids were angry for a while, but, they got over it.\n What are some alternatives we could do as far as school lunches? Should we allow our kids to eat the above every day for lunch? Should we allow kids to make unhealthy choices and ruin their lives? \n -Chris\n\n \n In Britain the Government has made it that all schools must serve healthy foods to the children. This only took one man to change this (Jamie Oliver a famous chef on British T.V), he encouraged one school to eat healthily and moved on from school to school and eventually tackled the government. Now the schools serve healthy lunches and their vending machines are full of nuts, dried fruit and sugar-free organic chocolate and no fizzy drinks are allowed, just fruit juices, milk etc. I also watched \"Supersize me\" and felt sick at what junk food was doing to todays society.", 
   {}, 
   243286, 
   null, 
   1166136180.0
  ], 
  [
   249107, 
   null, 
   "Shooterandproud", 
   "I've read Fast food nation,Diet for a new America, and Lick the Sugar Habit. I have long advocated the use of healthier foods in schools. It wouldn't cost anyone a dime, because the Organic and healthy foods are the same price as the junk foods. I've also seen \"Super size Me\".", 
   {}, 
   243404, 
   null, 
   1170303300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  School Health", 
  "url": "http://www.4forums.com/political/education-debates/9313-school-health.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 9313, 
  "discussion_files": [
   [
    "18627.html", 
    "http://www.4forums.com/political/education-debates/9313-school-health-print.html"
   ]
  ], 
  "identifier": 9313
 }
]