[
 [
  [
   243299, 
   null, 
   "robbie0517", 
   "Recently, I've seen a few broadcasts in which Christians claim that homosexuality is a sin because it says so in the Bible. So let's see what the Bible says.\n \n \n Do not eat pork. [\"Hey! I thought this was about homosexuals!?\" It is. Later.] \n \n \n \n Leviticus 11:4-7 - \"But you shall not eat...the pig, which does indeed have hoofs and is cloven-footed, but does not chew the cud.\"\n Isaiah 65:2-4 - \"I have stretched out my hands all the day to a rebellious people, Who...provoke me continually...Eating swine's flesh.... These things enkindle my wrath, a fire that burns all the day.\"\n Isaiah 66:17 - \"...they who eat swine's flesh, loathsome things and mice, shall all perish with their deeds and their thoughts, says the Lord.\"\n \n \n Do you eat pork? If so, sounds like you'll burn in Hell.\n \n \n And what does the Bible say about homosexual activity?\n \n \n \n Leviticus 18:22 - \"You shall not lie with a male as with a woman; such a thing is an abomination.\"\n Leviticus 20:13 - \"If a man lies with a male as with a woman, both of them shall be put to death...\"\n Romans 1:23-27 - \"...they...exchanged the glory of the immortal God for the likeness of an image of mortal man...Therefore, God handed them over to degrading passions. Their females exchanged natural relations for unnatural, and the males likewise gave up natural relations with females...\"1\n 1 Corinthians 6:9-10 - \"...neither fornicators nor idolaters nor adulterers nor boy prostitutes nor sodmoites...will inherit the kingdom of God.\"\n \n \n [One note: I don't think there's any particular reference to homosexuality in the Gospels. I wonder why?]\n \n \n Well, at least the first two sound pretty clear. Just as clear as the prohibition against eating pork. What else does the Bible say? I ran across many interesting passages while researching this; here's a few:\n \n \n Leviticus 20:9 - \"Anyone who curses his father or mother shall be put to death.\" I don't know exactly what is meant by curse, but if everybody who cursed their parents as we normally think of it were put to death, we wouldn't have to be concerned about overpopulation.\n \n \n Leviticus 20:10 - \"If a man commits adultery with his neighbor's wife, both the adulterer and the adulteress shall be put to death.\" Today, adultery is not punishable by death; only the most extreme religious sect would think this was a good idea; we consider it barbaric. Does that mean that Christians must revert to this behavior? I don't think so. What does Jesus have to say?\n \n \n In John 8:4-7, it says, \"They said to him [Jesus], 'Teacher, this woman was caught in the act of adultery...Moses commanded us to stone such women'...[He] said to them, 'Let the one among you who is without sin cast the first stone.'\" So here Jesus is saying to disregard the law of Moses. In other cases, he says to follow it, and in others he says that it's insufficient and we have to do better. What can we conclude from this? It seems that we have to continually examine the situation and try to do what's right. Very ambiguous; I suppose God not only gave us commandments, He gave us a brain to figure out what they really mean.\n \n \n Leviticus 19:19 - \"...do not breed any of your domestic animals with others of a different species; do not sow a field of yours with two different kinds of seed; and do not put on a garment woven with two different kinds of thread.\" How many farms grow one crop? (If they do, it's for economic reasons, I'm sure of that.) How many of us wear clothes with one kind of thread? \n \n \n The bottom line is, nobody completely lives up to what's in the Bible if for no other reason than it is simply not possible. A truly literal interpretation of the Old Testament will condemn everyone to Hell. Even just following some of the things that Jesus said to do will send you to Hell, because they contradict the Old Testament. So using the Bible as a reason to condemn homosexuality is, at best, picking and choosing what you prefer. At worst it's trying to twist the word of God to support personal hatreds and prejudices. Remember the two great commandments: \"You shall love the Lord, your God, with all your heart, with all your soul, and with all your mind...The second is like it: You shall love your neighbor as yourself.\" (Matthew 22:37-39) If you eat pork, would you want somebody yelling, \"God hates pig-eaters! Burn in Hell!\"? I doubt it. Yet that's exactly what homosexuals hear from \"Christians\".\n \n \n 1 This passage fascinates me. It seems to be saying that God forced people to give in to their passions. What happened to free will? And if sin is willful disobedience against God, is what happened a sin?", 
   {
    "post_info": {
     "post_title": "So what does the Bible say?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1166107620.0
  ], 
  [
   243300, 
   null, 
   "robbie0517", 
   "I don't understand that if God gave us the ability to use our brains to figure out what is right. Why can't some understand that causing human suffering by comdeming gays is immoral?", 
   {}, 
   243299, 
   null, 
   1166107740.0
  ], 
  [
   243485, 
   null, 
   "its_just_me", 
   "robbie O517 i'm very sorry but what you have said is silly, first of all there is no hell it does not say in the bible that there is an actual place called hell where the devil lives it only means it metaphorically. Thats where people get it wrong it has a whole otehr meaning.\n \n If you don't get the fact that when the bible says that no man shall lie with another man like they would with a women and no women shall lie with another women like they would with a man means that basically homosexuality is forbidden by God than you need glasses.\n \n I am far from homophobic, infact i know a few gay and lesbian and bisexual people and don't see them differently from anyone else apart from the fact that their brain tells them to like the same sex because of the chemicals going wrong. However i do think it is sinful but that is my opinion and everyone hahs their own opinion.\n \n :)", 
   {
    "post_info": {
     "post_title": "What??"
    }
   }, 
   243300, 
   null, 
   1166199600.0
  ], 
  [
   243491, 
   null, 
   "Kronus", 
   "\n If you don't get the fact that when the bible says that no man shall lie with another man like they would with a women and no women shall lie with another women like they would with a man means that basically homosexuality is forbidden by God than you need glasses.\n\n You kinda missed his point there. He's not trying to say that the Bible doesn't say \"don't be gay\". He's showing that it also say don't eat pork, don't wear poly-cotton shirts, don't do lots of things that your average Christian does all the time. He's pointing out that \"The Bible says...\" isn't a good argument against homosexuality because there's lots in their that people ignore. You can't insist that others follow the letter of the Bible if you don't follow it yourself, and essentially no one does.\n \n \n\n However i do think it is sinful but that is my opinion and everyone hahs their own opinion.\n\n Do you think wearing poly-cotton shirts is a sin? If not, why not, given that the Bible tells you not to do it?", 
   {}, 
   243485, 
   null, 
   1166201400.0
  ], 
  [
   243572, 
   null, 
   "its_just_me", 
   "Recently, I've seen a few broadcasts in which Christians claim that homosexuality is a sin because it says so in the Bible. So let's see what the Bible says.\n \n \n Do not eat pork. [\"Hey! I thought this was about homosexuals!?\" It is. Later.] \n \n \n \n Leviticus 11:4-7 - \"But you shall not eat...the pig, which does indeed have hoofs and is cloven-footed, but does not chew the cud.\"\n Isaiah 65:2-4 - \"I have stretched out my hands all the day to a rebellious people, Who...provoke me continually...Eating swine's flesh.... These things enkindle my wrath, a fire that burns all the day.\"\n Isaiah 66:17 - \"...they who eat swine's flesh, loathsome things and mice, shall all perish with their deeds and their thoughts, says the Lord.\"\n \n \n Do you eat pork? If so, sounds like you'll burn in Hell.\n \n \n And what does the Bible say about homosexual activity?\n \n \n \n Leviticus 18:22 - \"You shall not lie with a male as with a woman; such a thing is an abomination.\"\n Leviticus 20:13 - \"If a man lies with a male as with a woman, both of them shall be put to death...\"\n Romans 1:23-27 - \"...they...exchanged the glory of the immortal God for the likeness of an image of mortal man...Therefore, God handed them over to degrading passions. Their females exchanged natural relations for unnatural, and the males likewise gave up natural relations with females...\"1\n 1 Corinthians 6:9-10 - \"...neither fornicators nor idolaters nor adulterers nor boy prostitutes nor sodmoites...will inherit the kingdom of God.\"\n \n \n [One note: I don't think there's any particular reference to homosexuality in the Gospels. I wonder why?]\n \n \n Well, at least the first two sound pretty clear. Just as clear as the prohibition against eating pork. What else does the Bible say? I ran across many interesting passages while researching this; here's a few:\n \n \n Leviticus 20:9 - \"Anyone who curses his father or mother shall be put to death.\" I don't know exactly what is meant by curse, but if everybody who cursed their parents as we normally think of it were put to death, we wouldn't have to be concerned about overpopulation.\n \n \n Leviticus 20:10 - \"If a man commits adultery with his neighbor's wife, both the adulterer and the adulteress shall be put to death.\" Today, adultery is not punishable by death; only the most extreme religious sect would think this was a good idea; we consider it barbaric. Does that mean that Christians must revert to this behavior? I don't think so. What does Jesus have to say?\n \n \n In John 8:4-7, it says, \"They said to him [Jesus], 'Teacher, this woman was caught in the act of adultery...Moses commanded us to stone such women'...[He] said to them, 'Let the one among you who is without sin cast the first stone.'\" So here Jesus is saying to disregard the law of Moses. In other cases, he says to follow it, and in others he says that it's insufficient and we have to do better. What can we conclude from this? It seems that we have to continually examine the situation and try to do what's right. Very ambiguous; I suppose God not only gave us commandments, He gave us a brain to figure out what they really mean.\n \n \n Leviticus 19:19 - \"...do not breed any of your domestic animals with others of a different species; do not sow a field of yours with two different kinds of seed; and do not put on a garment woven with two different kinds of thread.\" How many farms grow one crop? (If they do, it's for economic reasons, I'm sure of that.) How many of us wear clothes with one kind of thread? \n \n \n The bottom line is, nobody completely lives up to what's in the Bible if for no other reason than it is simply not possible. A truly literal interpretation of the Old Testament will condemn everyone to Hell. Even just following some of the things that Jesus said to do will send you to Hell, because they contradict the Old Testament. So using the Bible as a reason to condemn homosexuality is, at best, picking and choosing what you prefer. At worst it's trying to twist the word of God to support personal hatreds and prejudices. Remember the two great commandments: \"You shall love the Lord, your God, with all your heart, with all your soul, and with all your mind...The second is like it: You shall love your neighbor as yourself.\" (Matthew 22:37-39) If you eat pork, would you want somebody yelling, \"God hates pig-eaters! Burn in Hell!\"? I doubt it. Yet that's exactly what homosexuals hear from \"Christians\".\n \n \n 1 This passage fascinates me. It seems to be saying that God forced people to give in to their passions. What happened to free will? And if sin is willful disobedience against God, is what happened a sin?\n\n \n \n Ok, let me get rid of the confusion here. I have studied the bible very deeply and understand it well. Firstly and most importantly, you must learn that yes, the Old Testament (Leviticus etc) does differ from the New Testament (John etc). This actually caused quite a lot of controversy between the early Christians just after Jesus died. You see, many people that were being taught the Christian faith at the time were Jewish, and the Jews followed the Old Testament \"to the letter\". One of the main concerns that the Jews had was with circumcision. Circumcision was compulsary according to the old law (Old Testament). The early Christians however, didn't follow that law since it was \"old\". This caused outrage and confusion so much so that it had to be addressed. One of the main leaders of the Christian faith after Jesus died was the apostle Paul, he was the spokesman at the meeting that was held about this issue. The apostle Paul proved that the Christians were not under obligation by the old law, but now the new law set down by Jesus (and therefore Christians no longer needed to get circumcised). Moses was the main spokesman of the old law, and Jesus was the spokesman of the new law (both spoke inspired by God). The main issues of the old law (e.g. the ten comandments) still needed to be abided by, but not the petite little things (e.g. not eating pork etc). There still was lots of stuborn Jews who didn't listen and only wanted to follow the old testament, this is why we see even up to our day, people in the far east (Jews etc) still follow these silly laws that Jesus more or less discarded.\n \n Obviously you're going to want refferences, well, here are some, but you need to read the whole of the greek scriptures (new testament) to get everything in context:\n \n Hebrews (8:6-12) Says (all translations will be the same by the way):\n \"Now Jesus has obtained a more excellent public service, so that he is also the mediator of a correspondingly better covenant, which has been legally established upon better promises. For if that first covenant had been faultless, no place would have been sought for a second; for he does find fault with the people when he says: '\"Look! There are days coming,\" says Jehovah, \"and I will conclude with the house of Israel and with the house of Judah a new covenant; not according to the covenant that I made with their forefathers in the day of my taking hold of their hand to bring them forth out of the land of Egypt, because they did not continue in my covenant, so that I stopped caring for them,\" says Jehovah.' '\"For this is the covenant that I shall covenant with the house of Israel after those days,\" says Jehovah.'\" \n \n Heb. 9:14, 15 says: \"How much more will the blood of the Christ, who through an everlasting spirit offered himself without blemish to God, cleanse our consciences from dead works that we may render sacred service to the living God? So that is why he is a mediator of a new covenant.\"\n \n There are many more examples from the bible that states the old testament is no longer the law now. If you want more then please ask. \n \n Finally, to answere the main question of this thread:\n \n We especially know what God wants of us (today) when the same issue is metioned in both testaments. Take for example the homosexual issue, it is mentioned in the new testament too (Romans 1:24-27 - 24#Therefore God, in keeping with the desires of their hearts, gave them up to uncleanness, that their bodies might be dishonored among them, 25#even those who exchanged the truth of God for the lie and venerated and rendered sacred service to the creation rather than the One who created, who is blessed forever. Amen. 26#That is why God gave them up to disgraceful sexual appetites, for both their females changed the natural use of themselves into one contrary to nature; 27#and likewise even the males left the natural use of the female and became violently inflamed in their lust toward one another, males with males, working what is obscene and receiving in themselves the full recompense, which was due for their error).\n \n Which plain and simply means that according to the bible (and therefore God, some believe) homosexuality isn't acceptable. \n \n The End", 
   {
    "unicode_changes_made": true
   }, 
   243299, 
   null, 
   1166218200.0
  ], 
  [
   243576, 
   null, 
   "Kronus", 
   "The apostle Paul proved that the Christians were not under obligation by the old law,\n\n Proved? I know Paul said that Christians didn't have to follow the old laws, mostly because he knew that they would get no converts in Greece or Rome if people were expected to get circumsized or have to follow the dietary laws. But proved that they could throw out the OT? How did you come to that conclusion? I read your quotes, but you must see that simply because Paul asserts it, doesn't make it so, right?\n \n \n\n Which plain and simply means that according to the bible (and therefore God, some believe) homosexuality isn't acceptable. \n \n\n So you ignore the OT, and embrace everything in the NT? Does that include everything Paul says about women? That they should be subservient to their men, not speak out in church, never enter a church without a hat? Do you truly follow everything that Paul says?\n \n And as an aside:\n \"Hebrews (8:6-12) Says (all translations will be the same by the way):\"\n All translations will be the same?! Of course they aren't! Unless you misspoke there I have to wonder how much studying you've really done.\n \n And also:\n \"You see, many people that were being taught the Christian faith at the time were Jewish,\"\n You have that backwards. The early Christians were all Jews, it was a Jewish sect. The people being taught, the converts of Paul's time, weren't Jews, that was the problem. It was because they wouldn't accept the food laws and circumsisions that Paul pushed to do away with them, to make the religion more acceptable to the masses.\n \n I think you need to go study some more, perhaps with a more open mind? One that's seeking truth, and not just seeking to reinforce ideas already held?", 
   {}, 
   243572, 
   null, 
   1166219580.0
  ], 
  [
   243577, 
   null, 
   "thelmoose", 
   " \n There still was lots of stuborn Jews who didn't listen and only wanted to follow the old testament, this is why we see even up to our day, people in the far east (Jews etc) still follow these silly laws that Jesus more or less discarded. \n\n My goodness. This is a telling statement.", 
   {}, 
   243576, 
   null, 
   1166220000.0
  ], 
  [
   243581, 
   null, 
   "Kronus", 
   "My goodness. This is a telling statement.\n\n Ooh, I'd missed that one. Yeah, it kinda is telling, isn't it? Not to mention inaccurate; Jesus followed the laws, he didn't discard them at all. That was all Paul's doing.", 
   {}, 
   243577, 
   null, 
   1166221560.0
  ], 
  [
   243586, 
   null, 
   "thelmoose", 
   " robbie O517 i'm very sorry but what you have said is silly, first of all there is no hell it does not say in the bible that there is an actual place called hell where the devil lives it only means it metaphorically. Thats where people get it wrong it has a whole otehr meaning.\n \n If you don't get the fact that when the bible says that no man shall lie with another man like they would with a women and no women shall lie with another women like they would with a man means that basically homosexuality is forbidden by God than you need glasses.\n \n\n How is it you know when to know if things should be understood metaphorically and when they should be taken literally?\n \n \n \n\n I am far from homophobic, infact i know a few gay and lesbian and bisexual people and don't see them differently from anyone else apart from the fact that their brain tells them to like the same sex because of the chemicals going wrong. However i do think it is sinful but that is my opinion and everyone hahs their own opinion.\n\n \n You don't see gay people as different except for that pesky brain disorder. \n Your determination that \"chemicals are going wrong\" is not, I think, founded in fact. To use your words, that's silly. I would bet none of these gay people are your friends.", 
   {}, 
   243485, 
   null, 
   1166222340.0
  ], 
  [
   243607, 
   null, 
   "its_just_me", 
   "Proved? I know Paul said that Christians didn't have to follow the old laws, mostly because he knew that they would get no converts in Greece or Rome if people were expected to get circumsized or have to follow the dietary laws. But proved that they could throw out the OT? How did you come to that conclusion? I read your quotes, but you must see that simply because Paul asserts it, doesn't make it so, right?\n \n \n So you ignore the OT, and embrace everything in the NT? Does that include everything Paul says about women? That they should be subservient to their men, not speak out in church, never enter a church without a hat? Do you truly follow everything that Paul says?\n \n And as an aside:\n \"Hebrews (8:6-12) Says (all translations will be the same by the way):\"\n All translations will be the same?! Of course they aren't! Unless you misspoke there I have to wonder how much studying you've really done.\n \n And also:\n \"You see, many people that were being taught the Christian faith at the time were Jewish,\"\n You have that backwards. The early Christians were all Jews, it was a Jewish sect. The people being taught, the converts of Paul's time, weren't Jews, that was the problem. It was because they wouldn't accept the food laws and circumsisions that Paul pushed to do away with them, to make the religion more acceptable to the masses.\n \n I think you need to go study some more, perhaps with a more open mind? One that's seeking truth, and not just seeking to reinforce ideas already held?\n\n \n \n Actually, the quotes I made weren't from the apostle Paul, there are more writers of the greek scriptures than him.\n \n Did you think I said that the OT is negligible? Sorry, I meant that the Law covenant is obsolete (Ephesians 2:15; Hebrews 8:13). The law covenant (e.g. getting circumsized etc) was negligible. And it wasn't just the apostle Paul that said that. Also, not even Paul himself said that the OT was rubbish, he encoraged Jesus followers to learn from the examples from the stories of the OT (1#Corinthians 10:11). We can get encouragement from the Psalmist, learn about honesty, jealousy, and other matters of human relations in the book of Proverbs (none of these books were about the law). I simply mean that the law is now obsolete. Obviously you get a good idea of what God wants through reading the law, but we are under no obligation by it anymore.\n \n Both testaments have the same theme (OT referrs to the promised seed, i.e. Jesus, and the NT Gods kingdom via this promised seed) but Christians focus on the NT, as it has the new law.\n \n I'm not just taking the word of the apostle Paul, plenty of the NT bible writers back up what I say. I'm not waisting my time looking them all up because you should know this if you studied the bible.\n \n When I said that all translations will be the same, you are taking me too literally (you can't study the bible doing this), I meant that they all mean the same thing. They have the same meaning, just a different way of describing. If you are still puzzled at that look at the bible writers Mathew, Luke and John (Jesus deciples), they all eyewitnessed the same events of Jesus but all have a different way of telling the story...but it's still the same story.\n \n So what are you saying? That because the apostle Paul and his followers (now Christian) wanted the Romans etc to become Christian, he knew he'd have to abolish circumsisions etc? How silly is that?! The apostle Paul was arguing with the JEWS (wannabe Christians) because it was their tradition to get circumsised. Converting the surrounding Roman nation etc was a harder task than just abolishing circumsisions (\"to make them happy\"), the Romans were proud and worshiped pagon gods, everything was for caesar and their man made gods.\n \n Yes, most of the early christians were previously jews, but to become a Christian they were required to follow the new law and abolish their old one (circumsisions etc). Do you think that all the Jews suddenly became followers of Jesus? It was the Jewish leaders that brought Jesus to the Romans to be killed! Many Jews carried on thier Jewish ways, many didnt listen to Jesus followers who were few to start with. The deciples of Jesus had to preach to their OWN people (i.e. other Jews).\n \n I think you need to study more, honestly. I did the study first, that's what shaped my opinion, not the other way around.", 
   {}, 
   243576, 
   null, 
   1166226840.0
  ], 
  [
   243698, 
   null, 
   "its_just_me", 
   "Just another note, I'm not anti-gay. For one thing, I'm more in touch with my feminine side than most guys are. My best friend was my sister while growing up, I relate more to my mother than I can with my father. I can talk for Britain with females, but I have little in common with males (football, cars etc). I bodybuild, I like to look after my apperance etc (don't mean to sound vain though). I used to be acused of being gay at school, so I know what ridicule is like. And finally, and most importantly, my brother's gay! I haven't forsaken him however. Before you say I must be hiding something here, I am engaged to a woman and have never had homosexual tendancies.\n \n Do you think that I'm trying to ban gays or something? Because I seem to remember the title of this thread being \"what does the bible say?\" Since I have studied the bible (and if I were to be biased, it would be on the homosexual side) I am simply putting across the TRUTH. I'm not trying to find loop-holes in the bible, just conveying it as it is.\n \n I am sorry for disapointing you all about what the bible teaches. To tell you the truth, like the first post said, the churches do pick and choose what they want from the bible (except that being gay isn't acceptable). Take for example, getting involved with politics, wars and even Christmas (which isn't Christian, it's half pagan and isn't even mentioned in the bible) etc. Wars, politics etc are what the churches get involved with and this was STRICTLY forbidden by Jesus HIMSELF! (e.g. he said be no part of this world, and love your enemy etc).", 
   {}, 
   243607, 
   null, 
   1166274480.0
  ], 
  [
   243706, 
   null, 
   "thelmoose", 
   " Just another note, I'm not anti-gay. For one thing, I'm more in touch with my feminine side than most guys are. My best friend was my sister while growing up, I relate more to my mother than I can with my father. I can talk for Britain with females, but I have little in common with males (football, cars etc). I bodybuild, I like to look after my apperance etc (don't mean to sound vain though). I used to be acused of being gay at school, so I know what ridicule is like. And finally, and most importantly, my brother's gay! I haven't forsaken him however. Before you say I must be hiding something here, I am engaged to a woman and have never had homosexual tendancies. \n\n \n \n What does being in touch with your feminine side, relating well with women, and caring for your personal appearance have to do with being gay?\n \n \n Do you think that I'm trying to ban gays or something? Because I seem to remember the title of this thread being \"what does the bible say?\" Since I have studied the bible (and if I were to be biased, it would be on the homosexual side) I am simply putting across the TRUTH. I'm not trying to find loop-holes in the bible, just conveying it as it is. \n\n \n \n I am glad you are so certain you know about TRUTH (all caps, yet). Have you studied secular accounts of biblical history, esp. the first couple centuries CE? The NT stories are more than a little inconsistent with the TRUTH. \n \n \n \n I am sorry for disapointing you all about what the bible teaches. To tell you the truth, like the first post said, the churches do pick and choose what they want from the bible (except that being gay isn't acceptable). Take for example, getting involved with politics, wars and even Christmas (which isn't Christian, it's half pagan and isn't even mentioned in the bible) etc. Wars, politics etc are what the churches get involved with and this was STRICTLY forbidden by Jesus HIMSELF! (e.g. he said be no part of this world, and love your enemy etc). \n\n \n I didn't think Jesus strictly forbade anything.", 
   {}, 
   243698, 
   null, 
   1166284260.0
  ], 
  [
   243707, 
   null, 
   "gaetano", 
   "Actually, the quotes I made weren't from the apostle Paul, there are more writers of the greek scriptures than him.\n \n Did you think I said that the OT is negligible? Sorry, I meant that the Law covenant is obsolete (Ephesians 2:15; Hebrews 8:13). The law covenant (e.g. getting circumsized etc) was negligible. And it wasn't just the apostle Paul that said that. Also, not even Paul himself said that the OT was rubbish, he encoraged Jesus followers to learn from the examples from the stories of the OT (1#Corinthians 10:11). We can get encouragement from the Psalmist, learn about honesty, jealousy, and other matters of human relations in the book of Proverbs (none of these books were about the law). I simply mean that the law is now obsolete. Obviously you get a good idea of what God wants through reading the law, but we are under no obligation by it anymore.\n \n Both testaments have the same theme (OT referrs to the promised seed, i.e. Jesus, and the NT Gods kingdom via this promised seed) but Christians focus on the NT, as it has the new law.\n \n I'm not just taking the word of the apostle Paul, plenty of the NT bible writers back up what I say. I'm not waisting my time looking them all up because you should know this if you studied the bible.\n \n When I said that all translations will be the same, you are taking me too literally (you can't study the bible doing this), I meant that they all mean the same thing. They have the same meaning, just a different way of describing. If you are still puzzled at that look at the bible writers Mathew, Luke and John (Jesus deciples), they all eyewitnessed the same events of Jesus but all have a different way of telling the story...but it's still the same story.\n \n So what are you saying? That because the apostle Paul and his followers (now Christian) wanted the Romans etc to become Christian, he knew he'd have to abolish circumsisions etc? How silly is that?! The apostle Paul was arguing with the JEWS (wannabe Christians) because it was their tradition to get circumsised. Converting the surrounding Roman nation etc was a harder task than just abolishing circumsisions (\"to make them happy\"), the Romans were proud and worshiped pagon gods, everything was for caesar and their man made gods.\n \n Yes, most of the early christians were previously jews, but to become a Christian they were required to follow the new law and abolish their old one (circumsisions etc). Do you think that all the Jews suddenly became followers of Jesus? It was the Jewish leaders that brought Jesus to the Romans to be killed! Many Jews carried on thier Jewish ways, many didnt listen to Jesus followers who were few to start with. The deciples of Jesus had to preach to their OWN people (i.e. other Jews).\n \n I think you need to study more, honestly. I did the study first, that's what shaped my opinion, not the other way around.\n\n \n \n \n \n \n \n \n [/QUOTE] Gaetano\n Christianity is at best an unauthorized sequel to Judaism. If you had researched before you believed, you would know that Jesus does not fulfill the qualifications for \"Messiah\" that appear in Jewish scripture. The chosen people have chosen not to believe based on their own scripture. What part of their own scripture convinced you that Jesus is the son of God and the Messiah? If you find that information, please inform your local Rabbi and educate him. Withholding such information would be downright anti-semitic.", 
   {}, 
   243607, 
   null, 
   1166284440.0
  ], 
  [
   243991, 
   null, 
   "thinking_person", 
   "What does being in touch with your feminine side, relating well with women, and caring for your personal appearance have to do with being gay?.\n\n \n Here's another example political correctness gone mad. Ok, maybe I am being a bit sterio typical here but you've got to admit it, most gay men are like that.\n \n \nI am glad you are so certain you know about TRUTH (all caps, yet). Have you studied secular accounts of biblical history, esp. the first couple centuries CE? The NT stories are more than a little inconsistent with the TRUTH.\n\n \n Yes...I simply have, in much depth. So where are these inconsistancies (or contradictions as some people say)? Please provided examples, which I shall refute.\n \n \nI didn't think Jesus strictly forbade anything.\n\n \n I'm glad you used the word \"think\" instead of know, because you dont know and are simply wrong. Of course Jesus strictly forbade things! He didn't use the word forbid, but he didn't approve of plenty of things (in other words, he forbided his deciples to do whatever it was he didn't approve of).\n \n Matthew 5:21, 22 (Jesus says here that yes, the old law says not to murder, but equaly important is not to be wrathfull towards your brother)\n \n Matthew 5:27, 28 (Jesus says here that yes, the old law says not to commit adultery, but equaly important is when you're married not to look at another woman with passion)\n \n Mattew 6:7 (Jesus said when praying, do not say the same thing over and over again)\n \n There are many more examples (of what Jesus disapproved of) from other bible writers too, but that could fill another thread.", 
   {}, 
   243706, 
   null, 
   1166474460.0
  ], 
  [
   243996, 
   null, 
   "ShadowPikachu", 
   "\n I'm glad you used the word \"think\" instead of know, because you dont know and are simply wrong. Of course Jesus strictly forbade things! He didn't use the word forbid, but he didn't approve of plenty of things (in other words, he forbided his deciples to do whatever it was he didn't approve of).\n \n Matthew 5:21, 22 (Jesus says here that yes, the old law says not to murder, but equaly important is not to be wrathfull towards your brother)\n \n Matthew 5:27, 28 (Jesus says here that yes, the old law says not to commit adultery, but equaly important is when you're married not to look at another woman with passion)\n \n Mattew 6:7 (Jesus said when praying, do not say the same thing over and over again)\n \n There are many more examples (of what Jesus disapproved of) from other bible writers too, but that could fill another thread.\n\n \n So in other words you just said that you are wrong, he didn't condemn either of the first two examples, he just expanded on something the old laws said. That is not condemning, it is complementing the laws, making them cover more.", 
   {}, 
   243991, 
   null, 
   1166475480.0
  ], 
  [
   244009, 
   null, 
   "thinking_person", 
   "\n Christianity is at best an unauthorized sequel to Judaism. If you had researched before you believed, you would know that Jesus does not fulfill the qualifications for \"Messiah\" that appear in Jewish scripture. The chosen people have chosen not to believe based on their own scripture. What part of their own scripture convinced you that Jesus is the son of God and the Messiah? If you find that information, please inform your local Rabbi and educate him. Withholding such information would be downright anti-semitic.\n\n \n Well, this post should be in a different thread but I'll try to explain as best as I can using \"your scriptures\" (i.e. the old testament) to prove that Jesus qualified for messiah:\n \n Firstly though I'd like to say that Jesus could turn water into wine. He could stop the wind and calm the waves and walk on water. He could feed thousands with a few loaves and fishes. He could cure cripples, cleanse lepers, make the blind see and the deaf hear. He could even raise the dead to life.\n \n But he could not convert the Jewish nation.\n \n He did not expect to. He knew that Isaiah had foretold that he would be \"for a stone of stumbling and for a rock of offence to both the houses of Israel.\" God's word had to come true. Jesus expected rejection and persecution and death (from the Jews) - Isaiah 8:14\n \n Although Jesus didn't convert the WHOLE nation, he did convert thousands and thousands of Jews (some of which were formerly scribes and priests and Pharisees...you know, even Jewish religious teachers like Rabbi's).\n \n The Jewish nature today hasn't changed much from what it was like back then. And in some ways, I don't blame them. After all, the Jews were persecuted by the so-called \"Christians\" (Roman Catholic) in the middle ages. There's no wander the Jews don't feel inclined to listen to Christians when they were treated so cruelly by them (Catholics). I don't blame Jews today for despising Jesus when they feel his \"leaders\" persecuted them.\n \n These religious murders (of Jews etc) the Catholics did in the middle ages is despicable and totally misrepresents what being a Christian is. If Jesus was still a man on earth at the time he would have been furious and disowned the Catholics. Simply put, Jesus was a Jew and he showed love towards them, he has been grossly misrepresented (even today).\n \n However, back in Jesus day (even without the persecution) a lot of Jews didn't accept Jesus as the messiah. This is because at that time the Jews were under Roman domination. They anticipated a Messiah that would come as a great military figure to smash Roman power and break them free. However, Jesus did not measure up to these expectations, these hopes. They were disappointed in him, plus his talk of submissiveness under Rome displeased them. He exposed the hypocrisy of Jewish religious leaders, which firstly irritated them and finally enraged them to the point of demanding his death.\n \n The Jews expected the messiah to come in an amazing showy display and become their earthly king with his earthly kingdom, based on scriptures like Daniel 7:13, 14 (\"I saw in the night visions, and behold, with the clouds of heaven there came one like a son of man, and he came to the Ancient of Days and was presented before him. And to him was given dominion and glory and kingdom, that all peoples, nations, and languages should serve him; his dominion is an everlasting dominion, which shall not pass away, and his kingdom one that shall not be destroyed\"). But what they didn't realize was that the Messiah was foretold to come twice. once as a sacrifice to die for obedient men, and then as a reigning king over an everlasting government. The Jews expected Jesus to come in the clouds of heaven and set up an earthly government. But, Jesus was foretold to come in a very modest way (riding on the foal of an XXX). If you read the 53rd chapter of Isaiah you'll see it ties in perfectly to Jesus. Here are some clips from that chapter: \n \n \"He had no form or comeliness that we should look at him, and no beauty that we should desire him\" (Jesus just looked like all the other Jews)\n \n \"He was despised, and we esteemed him not.\" (Jesus wasn't accepted by the Jewish religious leaders)\n \n \"when he makes himself an offering for sin\" (Jesus died for mankind)\n \n \"Therefore I will divide him a portion with the great, and he shall divide the spoil with the strong; because he poured out his soul to death, and was numbered with the transgressors; yet he bore the sin of many, and made intercession for the transgressors.\" (Jesus was put to death along with other sinners and yet he made it possible for us to be forgiven)\n \n \n \n Jesus also fulfilled the prophesy at Zechariah 9:9 (Jesus came...humble and riding on an XXX, on a colt the foal of an XXX) - Matthew 21:7-9\n \n So at first Jesus the messiah came to earth, and made a sacrificial death for mankind (as foretold by Isaiah and Daniel) . The second coming of Jesus the messiah (as foretold by scripture like Daniel 7:13, 14 which the Jews thought of as the first coming) is when Jesus was set up as ruler in HEAVEN by God. Jesus second coming is when he has his heavenly government set up. The Jews were looking for the wrong signs. The Jews looked for the wrong coming.\n \n The messiah was to first come to earth to teach people about Gods kingdom and to die for mankind's sin, which is what Jesus did.\n \n Ps, could you pass this info on to your Rabbi because I don't know of any local ones here, thanks", 
   {
    "unicode_changes_made": true
   }, 
   243707, 
   null, 
   1166479740.0
  ], 
  [
   244011, 
   null, 
   "thinking_person", 
   "So in other words you just said that you are wrong, he didn't condemn either of the first two examples, he just expanded on something the old laws said. That is not condemning, it is complementing the laws, making them cover more.\n\n \n ...and? yeah he expanded on it, added what God would want us to do, these are actions that we must do to be followers of Christ, they aren't to be just glanced at and think \"oh, well, they're just a few additions, I might do them, or I might not\". No matter what you want to call them or how you look at them, these aditions to the law are still what Jesus / God wants us to do. To do the contrary to these additions would be what Jesus (and therefore God) forbids.", 
   {}, 
   243996, 
   null, 
   1166480340.0
  ], 
  [
   244021, 
   null, 
   "thelmoose", 
   " Here's another example political correctness gone mad. Ok, maybe I am being a bit sterio typical here but you've got to admit it, most gay men are like that. \n\n \n Wasn't talking to you, but we were talking about something different. The other guy claimed that these qualities somehow prevented him from being a homophobe.\n \n Nothing has \"gone mad\" - being a tad dramatic, aren't we? Eschewing PC is still no reason to espouse stereotypes. And you sound like you don't know that many gay guys.\n \n \n \n \n Yes...I simply have, in much depth. So where are these inconsistancies (or contradictions as some people say)? Please provided examples, which I shall refute. \n\n \n Rigid certitude is pretty dangerous stuff, ya know.\n \n Well, for starters, the stories of the Nativity and the Cricifixion couldn't possibly have happened. Sure, if Jesus existed as a single person, he was born. But having him born in Bethlehem makes no sense. There are major inconsistencies about the date of birth, the census, Herod, the baby slaughter, etc. Why no one heard about the latter is odd. Why would the Romans ask people to travel to an ancestral home? There is no record that they had such a practice. The story was invented decades later to shoehorn the post-Jesus christian interpretation of the prophecies.\n \n Regarding the death, having Jewish priests assemble for such a thing on Passover is unthinkable. Pilate deferring to the priests or the crowd would never happen. There is no known custom a letting a prisioner go on occasion. Perhaps Jesus was crucified, though, the Romans had no compunction about doing that for minor offenses.\n \n Then are physical impossibilites like wandering stars, virgin births, walking on water, rising from the dead... These are problematic if you acknowledge that pesky little concept called reality. \n \n Could you pick a less apt nickname?\n \n \n \n I'm glad you used the word \"think\" instead of know, because you dont know and are simply wrong. Of course Jesus strictly forbade things! He didn't use the word forbid, but he didn't approve of plenty of things (in other words, he forbided his deciples to do whatever it was he didn't approve of).\n \n Matthew 5:21, 22 (Jesus says here that yes, the old law says not to murder, but equaly important is not to be wrathfull towards your brother)\n \n Matthew 5:27, 28 (Jesus says here that yes, the old law says not to commit adultery, but equaly important is when you're married not to look at another woman with passion)\n \n Mattew 6:7 (Jesus said when praying, do not say the same thing over and over again)\n \n There are many more examples (of what Jesus disapproved of) from other bible writers too, but that could fill another thread. \n\n \n Don't see any strict forbidding here.", 
   {}, 
   243991, 
   null, 
   1166483820.0
  ], 
  [
   244026, 
   null, 
   "thinking_person", 
   "Thelmoose:\n \n Why, why why? Examples? Give people a reason to believe you. I can't refute just claims you picked out a hat. Where did you get the info from, where's the references that made you come to those conclusions? It's just my word against yours otherwise.\n \n Jesus wasn't born on Christmas day (as the churches believe), but the bible didn't give an exact date (it's the churches that made that up). Christmas is even tied in with pagan ideas, so don't assume that because the churches think so, that's what it says in the bible.\n \n Regarding the subject of impossibilities, have you ever heard of the word miracle? You know, they're mentioned quite a lot in the bible in case you haven't noticed. A miracle is something that can't be explained.\n \n Ps, my nickname is quite appropriate thank you.", 
   {}, 
   244021, 
   null, 
   1166486280.0
  ], 
  [
   244033, 
   null, 
   "thelmoose", 
   "Thelmoose:\n \n Why, why why? Examples? Give people a reason to believe you. I can't refute just claims you picked out a hat. Where did you get the info from, where's the references that made you come to those conclusions? It's just my word against yours otherwise.\n \n Jesus wasn't born on Christmas day (as the churches believe), but the bible didn't give an exact date (it's the churches that made that up). Christmas is even tied in with pagan ideas, so don't assume that because the churches think so, that's what it says in the bible.\n \n Regarding the subject of impossibilities, have you ever heard of the word miracle? You know, they're mentioned quite a lot in the bible in case you haven't noticed. A miracle is something that can't be explained.\n \n Ps, my nickname is quite appropriate thank you.\n\n \n You asked for examples, I gave them to you. I say they never happened, for the reasons I stated. What do you mean my word against yours? I am not making first-hand observations here.\n \n I really don't want to provide references. So you win. It's clear this is a non-agreement waiting to happen. At least answer the few questions I posed. Do you look to extra-biblical references for your evidence? The life of Jesus is barely (if at all) described by any contemporaneous secular historian. The gospels were written by unknown prosletizers. Paul was an unhinged fanatic who did what he had to do to gain followers. If you have any shred of evidence for any of those events, I am all ears. You proclaimed you would \"refute\" any examples I raised. \n \n I am giving up without a fight if you explain the physical impossibilities with miracles. Do you actually think if something is mentioned in the bible, that has any credibility? Please. \"A miracle is something that can't be explained.\" So are lies, nonsense and fraudulence. Isn't that a bit overly convenient, and non-thinking way to explain anything you want to, no matter how preposterous? It is clear your view on reality differs from mine. I simply don't understand how people can abdicate reason for a book of folkore.\n \n Who are you trying to convince with your nickname other than yourself?", 
   {}, 
   244026, 
   null, 
   1166489340.0
  ], 
  [
   244104, 
   null, 
   "thinking_person", 
   "You asked for examples, I gave them to you. I say they never happened, for the reasons I stated. What do you mean my word against yours? I am not making first-hand observations here.\n \n I really don't want to provide references. So you win. It's clear this is a non-agreement waiting to happen. At least answer the few questions I posed. Do you look to extra-biblical references for your evidence? The life of Jesus is barely (if at all) described by any contemporaneous secular historian. The gospels were written by unknown proselytizers. Paul was an unhinged fanatic who did what he had to do to gain followers. If you have any shred of evidence for any of those events, I am all ears. You proclaimed you would \"refute\" any examples I raised. \n \n I am giving up without a fight if you explain the physical impossibilities with miracles. Do you actually think if something is mentioned in the bible, that has any credibility? Please. \"A miracle is something that can't be explained.\" So are lies, nonsense and fraudulence. Isn't that a bit overly convenient, and non-thinking way to explain anything you want to, no matter how preposterous? It is clear your view on reality differs from mine. I simply don't understand how people can abdicate reason for a book of folkore.\n \n Who are you trying to convince with your nickname other than yourself?\n\n \n You are more or less saying that religious people are stupid because you need to have faith to believe anything in the bible. So if you don't want to say why / where you came up with your conclusions, WHAT do you base your opinion on? Faith?\n \n One thing that should be noted is that you clearly haven't studied the gospels themselves, so how can you argue against something you apparently know very little about? Just reading certain claims from skeptics doesn't make you an expert. The fact that you THINK there are inconsistencies in the gospels just goes to prove the fact that you haven't studied them (there are that many misconceptions in your claims). \n \n Anyway, that aside, I don't want to sound stubborn here and make you feel like you can't win (because of my miracle claim; things you need more faith for), so lets look at the gospels without the supernatural stuff...from a purely historical point of view.\n \n \n Just as a side note, many historians use the bible as a reference when on their expeditions. Support for the \"Jesus-myth\" comes not from historians, but usually from writers operating far out of their field. In spite of the fact that historians are unanimous that the \"Jesus-myth\" is incorrect, it continues to be argued on a popular level as though it were absolutely proven. There is however, no proof that Jesus did not exist.\n \n Skeptics would then say something along the lines of:\n \n \"Just because a consensus of historians say that the Jesus-myth is wrong does not mean that it is wrong. The historians could be wrong. They could also be biased; a scholarly consensus does not constitute evidence for the existence of Jesus.\"\n \n As silly as this may sound, it is actually the core of many arguments made in favor of the \"Jesus-myth\"! Behind every historian there is a conspiracy, a bias, or some gross error of judgment - and sometimes even the ancient historians are in on the conspiracy, too! (yeah, right, just like you saw on the \"Da Vinci Code\" movie). Of course, it is quite possible that all of the professional historians (even those with no religious interest!) are biased or wrong, while proponents of the \"Jesus-myth\" are the objective ones. And yes, a consensus does not equal evidence. But a consensus on any historical question is usually based on evidence which is analyzed by those who are recognized as authoritative in their field, and therefore may be taken at their word. If this were not the case, why should there be any criteria for someone being a historian at all? Why should we not just pick someone at random off the street and let him/her compose an official history of 20th-century America for the Smithsonian archives?\n \n \n G. A. Wells (who disbelieves Jesus) attempts to explain why Pilate was chosen as the person who authorized the death of his fictional Jesus, Wells says that he was selected because he was \"particularly detested by the Jews, and is indeed the only one of the prefects who governed Judea between AD 6 and 41 who attracted sufficient attention to be discussed by the two principal Jewish writers of the first century,\" Philo and Josephus. [Hoff.JesH, 39-40] In other words, Pilate was chosen because he seemed like he would do something like the Gospels describe! If anything, this is better evidence, rather, that the Gospel writers knew what they were talking about, because they knew the history.\n \n Quite simply, you would have to ignore a great deal of evidence, and treat what evidence is left most unfairly, in order to deny that Jesus existed. Greco-Roman historian Michael Grant, indicates that there is more evidence for the existence of Jesus than there is for a large number of famous pagan personages - yet no one would dare to argue their non-existence.\n \n None of these scholars are friends of fundamentalism or evangelical Christianity. Contrary to the \"Jesus-myth\" believers, they make their statements based on evidence, not ideology. Conspiracy and bias exist only in their own imagination.\n \n \n Here are some quotes from a hardened skeptic and an Emeritus Professor of History, Morton Smith [Hoff.JesH, 47-8] . Of Wells' work, this historian and SKEPTIC of orthodox Christianity wrote:\n \n \"I don't think the arguments in (Wells') book deserve detailed refutation.\" \n \n \"...he argues mainly from silence.\" \n \n \"...many (of his arguments) are incorrect, far too many to discuss in this space.\" \n \n \"(Wells) presents us with a piece of private mythology that I find incredible beyond anything in the Gospels.\" \n \n \n \n \n \n \n Now I understand that you (thelmoose) believe that Jesus may have existed as a man in history, but that he didn't do or teach anything that the gospels say he did. That there is no historical evidence of what this so called great man did. Well, let's look outside the gospels again to see why no historian documented Jesus' teachings etc. Firstly, we have very little information from first-century sources to begin with. Not much has survived the test of time from A.D. 1 to today.\n \n Secondly, here are a few quotes from non Christian sources (Meier [Meie.MarJ, 7-9] and Harris [Harr.3Cruc, 24-27]):\n [*]As far as the historians of the day were concerned, he was just a \"blip\" on the screen. Jesus was not considered to be historically significant by historians of his time. He did not address the Roman Senate, or write extensive Greek philosophical treatises; He never traveled outside of the regions of Palestine, and was not a member of any known political party. It is only because Christians later made Jesus a \"celebrity\" that He became known. Sanders, comparing Jesus to Alexander, notes that the latter \"so greatly altered the political situation in a large part of the world that the main outline of his public life is very well known indeed. Jesus did not change the social, political and economic circumstances in Palestine (Note: It was left for His followers to do that!) ..the superiority of evidence for Jesus is seen when we ask what he thought.\" [Sand.HistF, 3] Harris adds that \"Roman writers could hardly be expected to have foreseen the subsequent influence of Christianity on the Roman Empire and therefore to have carefully documented\" Christian origins. How were they to know that this minor Nazarene prophet would cause such a fuss?Jesus was executed as a criminal, providing him with the ultimate marginality. This was one reason why historians would have ignored Jesus. He suffered the ultimate humiliation, both in the eyes of Jews (Deut. 21:23 - Anyone hung on a tree is cursed!) and the Romans (He died the death of slaves and rebels.). On the other hand, Jesus was a minimal threat compared to other proclaimed \"Messiahs\" of the time. Rome had to call out troops to quell the disturbances caused by the unnamed Egyptian referenced in the Book of Acts [Sand.HistF, 51] . In contrast, no troops were required to suppress Jesus' followers. To the Romans, the primary gatekeepers of written history at the time, Jesus during His own life would have been no different than thousands of other everyday criminals that were crucified. Jesus marginalized himself by being occupied as an itinerant preacher. Of course, there was no Palestine News Network, and even if there had been one, there were no televisions to broadcast it. Jesus never used the established \"news organs\" of the day to spread His message. He traveled about the countryside, avoiding for the most part (and with the exception of Jerusalem) the major urban centers of the day. How would we regard someone who preached only in sites like, say, Hahira, Georgia? Jesus' teachings did not always jibe with, and were sometimes offensive to, the established religious order of the day. It has been said that if Jesus appeared on the news today, it would be as a troublemaker. He certainly did not make many friends as a preacher. Jesus lived an offensive lifestyle and alienated many people. He associated with the despised and rejected: Tax collectors, prostitutes, and the band of fishermen He had as disciples. Jesus was a poor, rural person in a land run by wealthy urbanites. Yes, class discrimination was alive and well in the first century also! \n \n So why do people refute what the 4 writers of the gospels say? On what grounds do they base their argument? \n \n Here's a quote from Harris [Harr.3Cruc, 25]:\n [*]Behind the call for additional non-Christian witnesses to the existence of Jesus is the refusal to accept the testimony of the four writers we do have. Should we reject the four because they are not forty? The silence of the imaginary majority cannot overthrow the clear testimony of the few. This demand for other witnesses reminds me of the anecdote about a man accused of theft. At his trial the prosecuting attorney brought forward four witnesses who saw him commit the crime, while the defense attorney introduced as evidence fourteen persons who did not see him do it. Needless to say, the man was found guilty!\n \n \n \n As regards Jesus not being born in Bethlehem, the Nativity and Crucifixion not happening, what do you base this on? \n \n \n So Paul was just a fanatic who wanted to convert people into Christians at whatever cost? Once again, where is your proof? Did you know that at one point, the apostle Paul used to be a severe apposer of the Christians, he used to kill them! But of course, you should know that if you actually read the gospels. It wasn't just the apostle Paul who preached about Jesus, have you heard of Matthew, Luke, Mark and John? You know, just the main writers of the gospels, who existed before Paul.\n \n \n \nWho are you trying to convince with your nickname other than yourself?\n\n \n So you think that a non-thinking person would be able to come up with answers like these?", 
   {}, 
   244033, 
   null, 
   1166546220.0
  ], 
  [
   244136, 
   null, 
   "ShadowPikachu", 
   "\n One thing that should be noted is that you clearly haven't studied the gospels themselves, so how can you argue against something you apparently know very little about? Just reading certain claims from skeptics doesn't make you an expert. The fact that you THINK there are inconsistencies in the gospels just goes to prove the fact that you haven't studied them (there are that many misconceptions in your claims). \n\n \n Where do you pull this from? From what I've seen from thelmoose, he/she certainly seems to have at least read the bible. Nothing in his/her questions/criticisms were wrong. \n thelmoose noted several things that ARE in the gospels: virgin births, walking on water, rising from the dead, etc. as well as les miraculous inconsistencies: a census that has no record, somehow the people going to their ancestral home (something that has NEVER been recorded in actual census records), Jewish priests would never gather for such a thing before passover(crucifiction), no known custom for letting a prisoner go, etc.\n \n All of these things ARE in the bible, so for you to claim these aren't inconsistencies and that thelmoose is \"arguing from ignorance\" makes you look rather dumb, because thelmoose is rather acurate here.\n \n \nOf course, it is quite possible that all of the professional historians (even those with no religious interest!) are biased or wrong, while proponents of the \"Jesus-myth\" are the objective ones.\n\n \n ROFL!!! I actually came close to falling out of my seat when I read this one. Boy, you must be a natural comedian!! emoticon_rolleyes", 
   {}, 
   244104, 
   null, 
   1166554020.0
  ], 
  [
   244144, 
   null, 
   "thinking_person", 
   "It is quite possible to know about<b></b>: \n\"virgin births, walking on water, rising from the dead, etc...\"\nwithout having read the whole of the greek scriptures (you get taught about that at school). Why don't you let him answer my replies? What makes you (an evolutionist) think you know anything about this subject? Dont just stick up for him/her just because you disagree with me on other matters; speak up and debate when you know about the subject.", 
   {}, 
   244136, 
   null, 
   1166556000.0
  ], 
  [
   244146, 
   null, 
   "ShadowPikachu", 
   "It is quite possible to know about<b></b>: without having read the whole of the greek scriptures (you get taught about that at school).\n \n Really, you can be taught that in public school (if thelmoose went to publicschool)? What about that whole \"seperation of church and state\"? As for me, I went to a private christian school from kindergarten to twelfth grade with daily devotions and a class called Bible History every Monday and Wednesday, so I know what I'm talking about. \n \n \nWhy don't you let him answer my replies? What makes you (an evolutionist) think you know anything about this subject? Dont just stick up for him/her just because you disagree with me on other matters; speak up and debate when you know about the subject.\n\n \n emoticon_confused Where did you get that I'm an evolutionist. As far as I can recall I have never stated my beliefs as to evolution. You happen to be partially right, however, as I am more of an Intelligent Design person who beleives god created the world several billion years ago and his marvelous invention of evolution eventually led to humans (this doesn't contradict the Genesis account which in fact seems to follow closely to the progression of evolution - although I don't think Intelligent Design should be taught in public school because it has religious basis, which shouldn't be taught there unless it is in a religion class). But I'm curious as to where you got this from.\n \n As to sticking up for him because I disagree with you on other things, don't flatter yorself.\n \n I happen to know quite a bit on the subject, as I stated before I went to a Christian school (still am a christian by the way) and we leared about the bible every day through morning and afternoon devotions as well as our Monday and Wednesday Bible History class.\n \n So don't tell me when and when not to debate when you know nothing about what I know.\n \n \n I am also curious why when you thought I was an evolutionsist it automatically meant I knew nothing about the bible. I know several evolutionists who don't beleive in god who have read the bible and know more than most christians do.\n \n \nWhy don't you let him answer my replies?\n\n What, I can't comment on someone's post? WTF? The point of a discussion and debate forum is to discuss and debate, so don't be telling me what I can or can't post about. thelmoose can answer whenever he/she wants, it doesn't mean I am forbidden from posting. emoticon_rolleyes", 
   {}, 
   244144, 
   null, 
   1166557680.0
  ], 
  [
   244154, 
   null, 
   "thinking_person", 
   "Ok, keep ur hair on.emoticon_xangel I stand corrected on some points (about you being Christian etc). What type of Christian are you? It is pretty logical to assume that you are an evolutionist when you've posted plenty replies in the evolution forum supporting the theory. I merely said what a lot of evolutionists say in their threads, i.e. only speak up if you know biology etc.\n \n Just saying that you went to a religious school etc doesn't mean you know the truth personally...how do I know you didn't fell asleep during these meetings? (LOL) I know plenty religious people who can't even back up their beliefs, or like you said, who know less about the bible than some secular people.\n \n Being an evolutionist usually means that you've studied in that area, rather than the Greek scriptures. Of course you can study both, but that's the exception not the norm.\n \n No offence but if you were a Christian, why aren't you preaching, rather than supporting someone who believes the bible to be inaccurate or inconsistent?", 
   {}, 
   244146, 
   null, 
   1166560020.0
  ], 
  [
   244156, 
   null, 
   "thelmoose", 
   "You are more or less saying that religious people are stupid because you need to have faith to believe anything in the bible. So if you don't want to say why / where you came up with your conclusions, WHAT do you base your opinion on? Faith?\n \n ...\n \n So you think that a non-thinking person would be able to come up with answers like these?\n\n \n Wow. A little full of ourselves aren't we. The reason I questioned your moniker was I thought it a little odd. Is the best you can describe yourself a thinking person? What is the alternative, a non-thinking person? It is like describing oneself as a \"breathing person\". It seems that thinking in itself is no enormous achievement, but I stand corrected based upon your responses.\n \n I haven't studied the gospels, but I am not speaking from utter ignorance.\n I didn't say all religious people are stupid, I said I cannot comprehend how one abandons reason to be certain that supernatural occurrences must have truly happened just because the bible tells me so. Please explain to me the thought processes behind such a belief?\n \n First, the assertions I put forth were based upon the bible. I was commenting upon how illogical they were. \n \n A single example. Why would anyone have a census that recommends a primitive people go to an ancestral home to be counted? What if you had several ancestral homes. Isn't the point of a census to find out how many people you have?\n \n You seem to make a disctinction between \"historians\" and the writers of the New Testament. I would agree. But I don't understand, \n \"Behind every historian there is a conspiracy, a bias, or some gross error of judgment - and sometimes even the ancient historians are in on the conspiracy, too!\"\n \n What conspiracy?? \n When there is a difference of opinion in the assertions of an authority, I often try to consider motivations or incentives. What is motivation of academic historians to be part of a \"conspiracy\". Conspiracy to do what? Why do you concluse they are all guilty of gross error?\n \n On the other hand do you see any reason for bending the facts by someone who is promoting this new faith for the benefit of attracting new members? Maybe the writers of the synoptic Gospels were trying to be as accurate as they could. Maybe they were not scholars trying to be objective. No one knows. Back to our example, only Matthew and Luke mention the Nativity and they have contradictions. \n \n Your logic eludes me. You say, \n \n \"Just because a consensus of historians say that the Jesus-myth is wrong does not mean that it is wrong. The historians could be wrong. They could also be biased; a scholarly consensus does not constitute evidence for the existence of Jesus.\"\n \n I don't think there is a consensus in either side of this debate, but isn't a consenus of scholars worth something? You put stock in the subjective words of people who want to believe, rather than scholar who have no stake in either point of view.\n \n You point about choosing Pilate as the villain of the Crucifixion is exactly my point. You seem to miss the conclusion of your own evidence.\n \n You say \"there is more evidence for the existence of Jesus than there is for a large number of famous pagan personages\". What personages would those be? Do you mean the mythical ones?\n \n You posted a bunch about why Jesus may have not been noticed by historians of the day. Those may be valid, but that is not evidence that he existed. \n \n I have not provided any references. Some of which I said were not statements of fact, they were refernces to the bible, and questions about those. Where I did make some ostensible factual statements, I have based them on things I have read and I am not willing to dig them up.\n I fully admit this is not a valid way to win a debate and I retract all of them. \n \n A question. What does your annotation of your references mean, like [Hoff.JesH, 47-8]? \n \n Well, I'm done. Post back if you want.", 
   {}, 
   244104, 
   null, 
   1166560860.0
  ], 
  [
   244159, 
   null, 
   "ShadowPikachu", 
   "Ok, keep ur hair on.emoticon_xangel I stand corrected on some points (about you being Christian etc). What type of Christian are you? It is pretty logical to assume that you are an evolutionist when you've posted plenty replies in the evolution forum supporting the theory. I merely said what a lot of evolutionists say in their threads, i.e. only speak up if you know biology etc.\n\n \n First of all, I worship as a member of the Wisconsin Evangelical Lutheran Church (WELS). I call bull$hit on your next statement, as I have only made two posts in the evolution forum: Hm, doesn't seem funny to me. I don't see how it would be funny to any anti-evolutionist. It makes the priest and the biologist look rather dense, the priest saying it is a miracle. The only one that comes out of the joke looking remotely smart is the Humanist, because he would be the one that was right and Whatever you say, Supersport. Neither of those in any way support evolution so I say you are full of it, especally when you claim I've posted \"plenty of claims supporting the theory\". Do some research before claiming such a thing, especially when I can easily prove you wrong. Don't beleive me? Check my posting history: those two posts will be on the first two pages of the history, and you will not find any more.\n \n \n \nJust saying that you went to a religious school etc doesn't mean you know the truth personally...how do I know you didn't fell asleep during these meetings? (LOL) I know plenty religious people who can't even back up their beliefs, or like you said, who know less about the bible than some secular people.\n \n Being an evolutionist usually means that you've studied in that area, rather than the Greek scriptures. Of course you can study both, but that's the exception not the norm.\n \n \n\n \n Who said anything about meetings? These were CLASSES. Classes with ten people at the most in them, and an average of five per grade (Rather small school, to this day it still only has about seventy total students in Kindergarten through Twelfth grade overall, my smallest class was in fifth grade when there were just two of us). Not much chance of falling asleep there, especially when I was a straight A student every singly year (Boy, that weighted 4.0 was great for getting into college).\n \n I think you are being rather stereotypical here with the evolutionist statement.\n \n As I said, I have studied both rather thoroughly and know many others who have as well (I'm in my fourth year of college and this Spring I'll be graduating with a Bachelor's in Geology so I had to learn quite a bit about it.) Through studying both, I was led to beleive in Intelligent design, but now I think we're getting off-topic.\n \n \n No offence but if you were a Christian, why aren't you preaching, rather than supporting someone who believes the bible to be inaccurate or inconsistent?\n\n \n emoticon_confused You see, I know that even the original version of the Bible was written by men, who, although they were inspired by God, are still fallible. Added to that fallibility is the fact that the Bible has been translated to other languages dozens of times before it got to the present day english, leaving room for many translation errors as well as politically influenced mistranslations of certain parts. I don't delude myself into beleiving the Bible is error free (my own personal one has spelling errors: her instead of he as well as Jehus instead of Jesus).", 
   {}, 
   244154, 
   null, 
   1166562180.0
  ], 
  [
   244182, 
   null, 
   "MrWriteLA", 
   "Excuse me, but I thought this was the Gay Rights board, not the Let's Prove Ancient Superstitions board.", 
   {}, 
   244159, 
   null, 
   1166570460.0
  ], 
  [
   244198, 
   null, 
   "thinking_person", 
   "Excuse me, but I thought this was the Gay Rights board, not the Let's Prove Ancient Superstitions board.\n\n \n Oh yeah, I forgot lol", 
   {}, 
   244182, 
   null, 
   1166576580.0
  ], 
  [
   244202, 
   null, 
   "sinjin", 
   "Oh yeah, I forgot lol\nWhat were you thinking?emoticon_xangel", 
   {}, 
   244198, 
   null, 
   1166578200.0
  ], 
  [
   244230, 
   null, 
   "dislexia", 
   "DO NOT MAKE FUN OF THE BIBLE LIKE THAT! emoticon_mad \n The bible says that MARIGE IS BETWEEN A MAN AND A WOMEN If this is not upheald then humanity will ceas to exist.emoticon_cry \n You may have the freedom of speach but that is offensive and freedom of speach does not mean that you are suposted to make fun of the Bible and its fowlowers. emoticon_cry \n If I do not convince you, God will when you die. (hopefully that will not be for a long time because God loves you and he put you hear for a reason) emoticon_xangel", 
   {
    "post_info": {
     "post_title": "Stop"
    }
   }, 
   243299, 
   null, 
   1166593380.0
  ], 
  [
   244236, 
   null, 
   "ShadowPikachu", 
   "DO NOT MAKE FUN OF THE BIBLE LIKE THAT! emoticon_mad \n \n \n Stop the yelling. It doesn't make a point, it just makes you annoying. No one is making fun of the bible here. \n \n \nThe bible says that MARIGE IS BETWEEN A MAN AND A WOMEN< If this is not upheald then humanity will ceas to exist.emoticon_cry \n You may have the freedom of speach but that is offensive and freedom of speach does not mean that you are suposted to make fun of the Bible and its fowlowers. emoticon_cry \n If I do not convince you, God will when you die. (hopefully that will not be for a long time because God loves you and he put you hear for a reason) emoticon_xangel\n\n \n Are you serious? You are saying if we allow gay marriage, humanity will cease to exist? LOLOLOLOLOLOL!! emoticon_rolleyes Well, I guess we are not humanity then and we don't exist, because same-sex marriage is allowed in the state of Massachusetts as well as in Belgium, Canada, the Netherlands, South Africa, and Spain. Your little fear-mongering tactics won't work here.\n \n By the way, marriage is not an original Christian construct. Christians adopted it from ceremonies performed by pagan peoples. These pagan ceremonies in fact allowed both hetero AND same sex couples to marry.\n \n All I see in your post is that you beleive that people in this thread are making fun of the bible and its followers, and you are whining about it like a two-year-old.\n \n Who was this post even meant for?emoticon_confused", 
   {}, 
   244230, 
   null, 
   1166594460.0
  ], 
  [
   244285, 
   null, 
   "Matthew S", 
   "DO NOT MAKE FUN OF THE BIBLE LIKE THAT! emoticon_mad \n The bible says that MARIGE IS BETWEEN A MAN AND A WOMEN< If this is not upheald then humanity will ceas to exist.emoticon_cry \n You may have the freedom of speach but that is offensive and freedom of speach does not mean that you are suposted to make fun of the Bible and its fowlowers. emoticon_cry \n If I do not convince you, God will when you die. (hopefully that will not be for a long time because God loves you and he put you hear for a reason) emoticon_xangel\n\n \n I have news for you\n \n 1 that no where in the bible does it say MARRIGE IS BETWEEN A MAN AND A WOMEN would you please let us know were it says that because I trully can not find it. Besides even if it says that the Bible has and should have no existance or bearing for the non christian or non believer or in the law that effects the latter two groups.\n \n 2 that the majority of marriages were polygamous. Abraham, Jacob, David who had a husband as well as several wives, and Solomon are some examples of the traditional biblical marriages.\n \n 3 Gay people are already getting married, we have and will continue to have wedding cerimonies and there is not a thing you can do about that. All your side has done is temporarily stopped us from getting pieces of paper issued by the state. NO ONE CAN STOP OUR WEDDINGS AND UNIONS FROM OCCURING", 
   {}, 
   244230, 
   null, 
   1166619240.0
  ], 
  [
   244292, 
   null, 
   "thinking_person", 
   "What were you thinking?emoticon_xangel\n\n \n I don't really know, I was off in a world of my own...you know, the type where you think everyone's firing at you! emoticon_xkill emoticon_xangel LOL", 
   {}, 
   244202, 
   null, 
   1166625780.0
  ], 
  [
   244296, 
   null, 
   "thinking_person", 
   "Ok, all this big writing is hurting my eyes. \n \n Well (although I appreciate \"dislexia\" defending me), that is taking it a bit too far (\"that humanity wouldn't exist\") after all, not everyone is gay. \n \n The bible doesn't say specifically that gay marriage isn't allowed, it does however say that gay sex is not acceptable to be a worshiper of God (Leviticus 18:22 \"You must not lie down with a male the same as you lie down with a woman. It is a detestable thing.\"). People may argue that Christians only need to follow Christ to be his followers, but as Jesus himself said: Gods word (i.e. the bible) is truth - (John 17:17) so Jesus endorses the bible.", 
   {
    "unicode_changes_made": true
   }, 
   244292, 
   null, 
   1166627160.0
  ], 
  [
   244300, 
   null, 
   "gaetano", 
   "[QUOTE=thinking_person;244296]Ok, all this big writing is hurting my eyes. \n \n Well (although I appreciate \"dislexia\" defending me), that is taking it a bit too far (\"that humanity wouldn't exist\") after all, not everyone is gay. \n \n The bible doesn't say specifically that gay marriage isn't allowed, it does however say that gay sex is not acceptable to be a worshiper of God (Leviticus 18:22 \"You must not lie down with a male the same as you lie down with a woman. It is a detestable thing.\"). \n \n \n \n \n [QUOTE]Gaetano\n Not nearly as detestable as judging other people based on what you perceive to be the word of the one true God.\n (Leviticus 18:22 \"You must not lie down with a male the same as you lie down with a woman. It is a detestable thing.\"). This command is obviously not directed at homosexuals, for they know not how to lie down with a woman, nor do they care how one lies down with a woman. Only kidding, but seriously, why do you feel that other peoples lives should follow the laws from a book you've read?", 
   {
    "unicode_changes_made": true
   }, 
   244296, 
   null, 
   1166630220.0
  ], 
  [
   244321, 
   null, 
   "thinking_person", 
   "\n Not nearly as detestable as judging other people based on what you perceive to be the word of the one true God.\n (Leviticus 18:22 \"You must not lie down with a male the same as you lie down with a woman. It is a detestable thing.\"). This command is obviously not directed at homosexuals, for they know not how to lie down with a woman, nor do they care how one lies down with a woman. Only kidding, but seriously, why do you feel that other peoples lives should follow the laws from a book you've read?\n\n \n I don't like to push my beliefs on anyone, but if they ask for it (like this thread does) then I freely give it. I don't think that I have the right to say what the bible says to non-religious people. Even if a gay was to show interest in my religion (which plenty have), showing them how \"it's not acceptable to have sex with the same sex in this religion\" isn't the best approach! LOL. That's downright tactless, and wouldn't attract anyone to the religion. My approach, (and other Christians should do this too), is to try and understand (like Jesus did) and interest/teach people the other valuable sides of the bibles teachings first.\n \n Ps, not making fun or anything but when you press the quotation button, you have to paste the desired quote in between the quote start ([QUOTE) and the quote end ([/QUOTE])", 
   {
    "unicode_changes_made": true
   }, 
   244300, 
   null, 
   1166635440.0
  ], 
  [
   244350, 
   null, 
   "MrWriteLA", 
   "http://www.counterbias.com/818.html\n \n Galileo and Gays: Credibility Lost, Yet Again\n \n \"When religion loses its credibility\" was the title of a USA Today article by Christian writer Oliver Thomas. The article's lead posed the question: \"Galileo was persecuted for revealing what we now know to be the truth regarding Earth's place in our solar system. Today, the issue is homosexuality, and the persecution is not of one man but of millions. Will Christian leaders once again be on the wrong side of history?\"\n \n Mr. Thomas rephrased and answered the question:\n What if Christian leaders are wrong about homosexuality? I suppose, much as a newspaper maintains its credibility by setting the record straight, church leaders would need to do the same:\n \n Correction: Despite what you might have read, heard or been taught throughout your churchgoing life, homosexuality is, in fact, determined at birth and is not to be condemned by God's followers. \n \n Based on a few recent headlines, we won't be seeing that admission anytime soon. ...\n \n Religion's only real commodity, after all, is its moral authority. Lose that, and we lose our credibility. Lose credibility, and we might as well close up shop.\n \n It's happened to Christianity before, most famously when we dug in our heels over Galileo's challenge to the biblical view that the Earth, rather than the sun, was at the center of our solar system. ...\n \n This time, Christianity is in danger of squandering its moral authority by continuing its pattern of discrimination against gays and lesbians in the face of mounting scientific evidence that sexual orientation has little or nothing to do with choice. To the contrary, whether sexual orientation arises as a result of the mother's hormones or the child's brain structure or DNA, it is almost certainly an accident of birth. The point is this: Without choice, there can be no moral culpability.\n The hateful antigay politics of the radical Christian Right have alienated a lot of people of genuine faith, and for good reason. As C. S. Lewis warned, Christians who uses their faith as a means to a political end corrupt their faith. \n \n A post-election survey of evangelicals conducted by Beliefnet and summarized in their article \"Evangelicals Sour on Politics\" documented that \"40.2 percent of the evangelicals surveyed favored the idea of Christians taking a 'fast' from politics.\" The survey also revealed that nearly 60 percent of non-evangelicals have a more negative view of Jesus because of Christian political involvement. And chief among that \"political involvement\" is the vile - and distinctly unChristian - campaign against gay and lesbian Americans, their children and families.\n \n The American public is turning - slowly but surely - against hate-mongers who advocate discrimination in the name of religion. A recent Opinion Dynamics/Fox News poll documented that \"60 percent of Americans favored some form of legal recognition for gay unions, 30 percent favored gay marriage, and 30 percent favored civil unions.\" This should not be surprising. Throughout American history, civil equality has inevitably trumped bigotry and discrimination, even when the bigotry and discrimination had the stamp of approval from some \"Christian\" leaders as in the days of slavery and legal racial discrimination.\n \n When the poll was reported in a propaganda organ of James Dobson and his perversely named \"Focus on the Family,\" the usual spin was applied by a Dobsonian acolyte: \"Jim Pfaff, cofounder of Colorado Family Action, said the survey was reported with bias. 'It says here that 30 percent of people want to allow same-sex couples to get legally married,' he told Family News in Focus, 'but it doesn't talk about the fact that 70 percent don't.'\"\n \n Of course Mr. Pfaff conveniently forgot to mention the additional 30 percent of respondents that supported civil unions for gay and lesbian couples, something Colorado Family Action and Focus on the Family vehemently oppose despite the fact that legally recognized civil unions would benefit not only gay and lesbian Americans, but their children and their families. Hypocrisy, the desire to demean others, and dogmatic sophistry always go hand-in-hand-in-hand as was so well illustrated in an article that appeared in another Dobson-FOF publication.\n \n \"Pro-Gay Theology: 'Jesus Said Nothing About Homosexuality'\" was penned by Joe Dallas, founder of Genesis Counseling and one of the founding forces of the \"ex-gay\" sham. Not surprisingly, Dobson's Focus on the Family runs its own \"ex-gay\" program.\n \n At least part of the article's title was accurate: Jesus said nothing about homosexuality. But Mr. Dallas mastered the art of sophistry in his apologia for antigay dogma.\n \n Already distressed by reality - \"a recent poll showed 66 percent (two-thirds) of Americans no longer believe there is such a thing as 'absolute truth.' More disturbing, though, was the fact that 53 percent of those not believing in absolute truth identified themselves as born-again Christians; 75 percent of whom were mainline Protestants\" - Mr. Dallas directed his sophism at gay Christians:\n Invariably, when the \"gay Christian\" movement is represented, someone in their group will hold up a sign saying, \"WHAT JESUS SAID ABOUT HOMOSEXUALITY: ________________.\" The idea, of course, is that if Jesus did not specifically forbid a behavior, then the behavior must not have been important to Him. Stretching the point further, this argument assumes if Jesus was not manifestly concerned about something, neither should we.\n Troy Perry (along with most gay Christian leaders) makes much of this argument based on silence: \"As for the question, 'What did Jesus say about homosexuality?', the answer is simple. Jesus said nothing. Not one thing. Nothing! Jesus was more interested in love.\" [Troy Perry, Don't Be Afraid Anymore (New York: St. Martin's Press, 1990), p. 40.] \n \n To refute Troy Perry and like-minded Christians, Mr. Dallas offered four \"reasons\" why a theology based on love and inclusion should be replaced by the dogma of hate and exclusion. His first \"reason\" addressed the fact that Jesus said nothing about homosexuality:\n the argument assumes the gospels are more authoritative than the rest of the books in the Bible. The idea of a subject being unimportant just because it was not mentioned by Jesus is foreign to the gospel writers themselves. At no point did Matthew, Mark, Luke or John say their books should be elevated above the Torah or, for that matter, any writings yet to come. In other words, the gospels - and the teachings they contain - are not more important than the rest of the Bible. All Scripture is given by inspiration of God. The same Spirit inspiring the authors of the gospels also inspired the men who wrote the rest of the Bible.\n If all that's so, then why isn't Mr. Dallas campaigning to have those who wear clothing made of two different threads stoned to death as demanded in Leviticus, or to have non-virgin brides stoned to death as demanded in Deuteronomy? And for \"God's\" sake, why isn't he campaigning to repeal the 19th Amendment to the U.S. Constitution so as to fulfill St. Paul's edict in First Timothy to \"suffer not a woman to teach, nor to usurp authority over the man, but to be in silence\"?\n \n His second \"reason\" was equally self-serving and suffered from the same convoluted sophistry: \"Not only are the gospels no more authoritative than the rest of Scripture, they are not comprehensive either. That is, they do not provide all we need to know by way of doctrine and practical instruction. Some of the Bible's most important teachings, in fact, do not appear in the gospels. ...\"\n \n Indeed, the \"gospels\" were cobbled together decades, sometimes centuries after Jesus' death. The resulting texts were then either sanctioned or shunned by men whose sole purpose was to create a religion and its dogma that would control people and have them do and believe as they were told to by the hierarchy of the institution.\n \n Spirituality is intrapersonal. For most it's a personally liberating and uplifting experience, an encouragement to grow and evolve to more conscious perceptions. But when personal spirituality is organized into a religion, an institution is produced and as all institutions it produces a hierarchy who produce dogma that often has little to do with spirituality and everything to do with maintaining social and political control.\n \n The third \"reason\" Mr. Dallas offered was of a kind: \"The gospels do not profess to be a complete account of Jesus' life or teachings. Whole sections of His early years are omitted; much of what He did and said remains unknown\" [italics added].\n \n It's historical fact that the \"gospels\" and other \"sacred texts\" were sanitized (if not completely excluded) by early Church fathers before what we now call \"the Bible\" was canonized. For example, all references to or mention of Jesus' sexuality were expunged. Any references to possible siblings were also deleted. But such information remains extant in \"unapproved\" texts such as the Gospel of Thomas, written by a man some believe was Jesus' sibling, as well as in other so-called \"gnostic texts.\" Alas, such records just didn't fit the official dogma \"The Church\" wanted and needed to create for its own social and political purposes.\n \n The fourth \"reason\" Mr. Dallas offers begs the question of civil equality for gay and lesbian American citizens and diverts attention to procreation: \"Jesus referred in the most specific of terms to God's created intent for human sexuality: 'But at the beginning of creation God 'made them male and female. For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.' So they are no longer two, but one. Therefore what God has joined together, let man not separate' (Mark 10:6-9).\"\n \n There's that pesky biblical interdiction against divorce again. If he were true to his espoused beliefs, Mr. Dallas would be campaigning to have divorce made illegal. Despite that glaring inconsistency, surely even Mr. Dallas would acknowledge that people - including devout Christians - have sex for pleasure with no intent to procreate. And just as surely that pleasure was also part of \"God's created intent for human sexuality\" otherwise why would Divinity have made sex so pleasurable, not to mention making it one of humans' most basic, fundamental instincts? To suggest the pleasures of sex were a divine test of faith conjures a rather mean-spirited \"God\" who enjoys torturing his creations.\n \n Mr. Dallas and those who share his anti-human, anti-pleasure views on sexuality might want to read Vatsyayana's Kamasutram (aka \"Kama Sutra\"). But then again, they'd probably view such a work as anti-Christian hedonism, so perhaps they should just stick to reading the Wife of Bath's prologue in The Canterbury Tales. She addressed their concerns most astutely and from a Christian perspective.\n \n Instead of concocting sophomoric, self-contradictory arguments to support discrimination and propagate hate, James Dobson, Jim Pfaff, Joe Dallas and the rest of the dour dogmatists of the Christian Right might want to join the twenty-first century and embrace its diverse human community instead of trying to factionalize it to enhance their own power and profit.", 
   {
    "post_info": {
     "post_title": "An excellent article"
    }, 
    "unicode_changes_made": true
   }, 
   244321, 
   null, 
   1166641380.0
  ], 
  [
   244531, 
   null, 
   "robbie0517", 
   "The Bible is all here say isn't it? How can anyone interpret here say as absolute truth?", 
   {}, 
   244350, 
   null, 
   1166721180.0
  ], 
  [
   244535, 
   null, 
   "peteratwar", 
   "The Bible is all here say isn't it? How can anyone interpret here say as absolute truth?\n\n \n Well one postulate that much of the historical data may be heresay. However much of it quite likely has a kernel of truth in it.\n \n The teachings of the Bible on the other hand are much less likely to be so but are in fact reliant on the memories of those who wrote them down or dictated them to scribes. Then again you get the translation problems of exact nuances of meaning. Many of these rely on the translator's understanding of the complexities of the language. Try the Chinese Whispers game.\n \n However one had to remember that those scribes of old were doing their best to put across teachings and concepts. Many of these hold good today.\n \n All you have to do is ponder on them and think. The Lord gave you a brain and you are entitled to use it and come to your own conclusions.", 
   {}, 
   244531, 
   null, 
   1166722320.0
  ], 
  [
   244699, 
   null, 
   "thinking_person", 
   "Well one postulate that much of the historical data may be heresay. However much of it quite likely has a kernel of truth in it.\n \n The teachings of the Bible on the other hand are much less likely to be so but are in fact reliant on the memories of those who wrote them down or dictated them to scribes. Then again you get the translation problems of exact nuances of meaning. Many of these rely on the translator's understanding of the complexities of the language. Try the Chinese Whispers game.\n \n However one had to remember that those scribes of old were doing their best to put across teachings and concepts. Many of these hold good today.\n \n All you have to do is ponder on them and think. The Lord gave you a brain and you are entitled to use it and come to your own conclusions.\n\n \n \n I agree. As regards the Chinese Whisperers reference, it is amazing to see (almost miraculous) though that the bible hasn't changed much at all, only spelling mistakes and a few misinterpretations of words, but the general context is still there. Historians have used things like the Dead Sea Scrolls to prove this.", 
   {}, 
   244535, 
   null, 
   1166824320.0
  ], 
  [
   244729, 
   null, 
   "Shooterandproud", 
   "Keep in mind that everyone was saying the same thing about blacks 50 years ago. The anti-gay nazis will realize the error of their ways in a matter of decades, just like they did for blacks.", 
   {}, 
   243485, 
   null, 
   1166839140.0
  ], 
  [
   244731, 
   null, 
   "thinking_person", 
   "They said the same thing about blacks 50 years ago.\n\n \n What exactly are you refering to?", 
   {}, 
   244729, 
   null, 
   1166839560.0
  ], 
  [
   244737, 
   null, 
   "georged", 
   "Keep in mind that everyone was saying the same thing about blacks 50 years ago. The anti-gay nazis will realize the error of their ways in a matter of decades, just like they did for blacks.\n\n \n It took force for segregationists to see the error of their ways, including armed federal troops. \n \n Unless DOJ steps in due to discrimination as they did during the civil rights movement, full US acceptance of gays won't begin until Christianity declines as the dominant US belief system. Some states are legislating approval of civil unions between gays to avoid discrimination lawsuits but that won't matter to many states who fought or supported the civil war on the losing side. Considering the current composition of SCOTUS, whether or not they'd even consider hearing a gay rights discrimination plea would be a good question.", 
   {}, 
   244729, 
   null, 
   1166844600.0
  ], 
  [
   244739, 
   null, 
   "Shooterandproud", 
   "What exactly are you refering to?\n\n \n Discrimination against both.", 
   {}, 
   244731, 
   null, 
   1166845140.0
  ], 
  [
   244740, 
   null, 
   "Shooterandproud", 
   "And dislexia, the bible is not what you think it is. Its not the sugar and spice book you've been spoon fed since you were little. It is a nasty book, full of awful things. It is defonitaly not a book i would want to live by.", 
   {}, 
   244739, 
   null, 
   1166845200.0
  ], 
  [
   244749, 
   null, 
   "dislexia", 
   "I know that some people sin in the bible, most of the people in it did, (they are only human) But you need to admit, the ten comandments are good rules to live by, not suggestions. \n \n But, if we want to debate the Good Book (the Bible) in ways irelevant to the topic, we should probobly start a new debate or find a bible debate page that already exists.", 
   {
    "post_info": {
     "post_title": "Bible"
    }
   }, 
   244740, 
   null, 
   1166851860.0
  ], 
  [
   244763, 
   null, 
   "thinking_person", 
   "Discrimination against both.\n\n \n This is another example of the churches mis-using the bible. No-where does the bible contradict what Galileo was trying to prove, and no-where in the bible does it discriminate against black people, quite the oposite actually.\n \n For example:\n \n Romans 12:17, 18 - ...be peaceable with ALL men.\n \n Leviticus 19:33, 34 - And in case an alien (foreigner) resident resides with you as an alien in YOUR land, YOU must not mistreat him. The alien resident who resides as an alien with YOU should become to YOU like a native of YOURS; and you must love him as yourself, for YOU became alien residents in the land of Egypt. I am Jehovah YOUR God.\n \n This would prove even more so for whites going into a black dominated country, how much more would we have to be accepting/understanding of their way of life, skin color etc if we were the \"aliens\"?", 
   {}, 
   244739, 
   null, 
   1166879340.0
  ], 
  [
   244764, 
   null, 
   "robbie0517", 
   " The Lord gave you a brain and you are entitled to use it and come to your own conclusions.\n\n \n Exactly my point in post #2. Thank you for reinforcing it. If all would use their common sense, the world would be a better place.", 
   {}, 
   244535, 
   null, 
   1166880360.0
  ], 
  [
   244766, 
   null, 
   "ShadowPikachu", 
   "This is another example of the churches mis-using the bible. No-where does the bible contradict what Galileo was trying to prove, and no-where in the bible does it discriminate against black people, quite the oposite actually.\n \n For example:\n \n Romans 12:17, 18 - ...be peaceable with ALL men.\n \n Leviticus 19:33, 34 - And in case an alien (foreigner) resident resides with you as an alien in YOUR land, YOU must not mistreat him. The alien resident who resides as an alien with YOU should become to YOU like a native of YOURS; and you must love him as yourself, for YOU became alien residents in the land of Egypt. I am Jehovah YOUR God.\n \n This would prove even more so for whites going into a black dominated country, how much more would we have to be accepting/understanding of their way of life, skin color etc if we were the \"aliens\"?\n\n Hmm, with those verses, I don't see why most \"christians\" have a problem with accepting same-sex marriage. It says right there \"you must love him as yourself\" ans \"be peaceable with ALL men\". Don't see what the big deal is. \n \n And No, you are wrong about the Galileo. The church used certain verses of the bible (don't know them offhand) to support their heliocentric view, and their opposition to Galileo.", 
   {}, 
   244763, 
   null, 
   1166885880.0
  ], 
  [
   244768, 
   null, 
   "ShadowPikachu", 
   "This is another example of the churches mis-using the bible. No-where does the bible contradict what Galileo was trying to prove, and no-where in the bible does it discriminate against black people, quite the oposite actually.\n \n For example:\n \n Romans 12:17, 18 - ...be peaceable with ALL men.\n \n Leviticus 19:33, 34 - And in case an alien (foreigner) resident resides with you as an alien in YOUR land, YOU must not mistreat him. The alien resident who resides as an alien with YOU should become to YOU like a native of YOURS; and you must love him as yourself, for YOU became alien residents in the land of Egypt. I am Jehovah YOUR God.\n \n This would prove even more so for whites going into a black dominated country, how much more would we have to be accepting/understanding of their way of life, skin color etc if we were the \"aliens\"?\n\n Hmm, with those verses, which technically could apply to gays, I don't see why most \"christians\" have a problem with accepting same-sex marriage. It says right there \"you must love him as yourself\" ans \"be peaceable with ALL men\". Don't see what the big deal is. \n \n And No, you are wrong about the Galileo. The church used certain verses of the bible (don't know them offhand) to support their heliocentric view, and their opposition to Galileo.", 
   {}, 
   244763, 
   null, 
   1166886060.0
  ], 
  [
   244775, 
   null, 
   "MrWriteLA", 
   "The church used certain verses of the bible (don't know them offhand) to support their heliocentric view, and their opposition to Galileo.\nI think you mean \"terracentric,\" but you're quite right. Only recently did the church apologize for it's persecution of Galileo. If they admitted it, I kinda think it really happened.", 
   {}, 
   244768, 
   null, 
   1166893980.0
  ], 
  [
   244783, 
   null, 
   "thelmoose", 
   "Kill Your Neighbors \n \n \nThen Moses stood in the gate of the camp, and said, Who is on the LORD's side? let him come unto me. And all the sons of Levi gathered themselves together unto him. \n \n And he said unto them, Thus saith the LORD God of Israel, Put every man his sword by his side, and go in and out from gate to gate throughout the camp, and slay every man his brother, and every man his companion, and every man his neighbour. \n \n And the children of Levi did according to the word of Moses: and there fell of the people that day about three thousand men. \n \n For Moses had said, Consecrate yourselves today to the LORD, even every man upon his son, and upon his brother; that he may bestow upon you a blessing this day.\n \n (Exodus 32:26-29 )\n", 
   {}, 
   244775, 
   null, 
   1166898000.0
  ], 
  [
   244813, 
   null, 
   "Shooterandproud", 
   "I know that some people sin in the bible, most of the people in it did, (they are only human) But you need to admit, the ten comandments are good rules to live by, not suggestions.\n\n \n Lets review:\n \n Thou shalt have no other god: This seems very tyrannical, as it implies that we have no freedom of opinion. It makes it seem that God gave us free will, but when we excersize that right he punishes us. This is not a commandment in which I want to live by.\n \n Thou shalt not make unto thee any graven image: Don't really know what this means\n \n Thou shalt not take the Lords name in vain: See commandment 1.\n \n Remember the Sabbath: Yea right, like that exists anymore.\n \n Honor thy mother and father: Good commandment\n \n Though shalt not kill: This can be a very flimsy commandment. Does though shalt not kill mean that hunting is a no-no? Does it mean that bug squishing is a no-no? Under circumstances, killing is sometimes necessary.\n \n Though shalt not commit adultry: Pretty good for the most part, although it still implies that a wife is a husband's property.\n \n Though shalt not steal: Good for the most part, but stealing is necessary under circumstances though.\n \n Though shalt not lie: Lying is ok under circumstances\n \n Though shalt not covet: doesn't this mean stealing?\n \n \n \n \nBut, if we want to debate the Good Book (the Bible) in ways irelevant to the topic, we should probobly start a new debate or find a bible debate page that already exists.\n\n \n I agree.", 
   {}, 
   244749, 
   null, 
   1166946420.0
  ], 
  [
   244814, 
   null, 
   "Shooterandproud", 
   "This is another example of the churches mis-using the bible. No-where does the bible contradict what Galileo was trying to prove, and no-where in the bible does it discriminate against black people, quite the oposite actually.\n \n For example:\n \n Romans 12:17, 18 - ...be peaceable with ALL men.\n \n Leviticus 19:33, 34 - And in case an alien (foreigner) resident resides with you as an alien in YOUR land, YOU must not mistreat him. The alien resident who resides as an alien with YOU should become to YOU like a native of YOURS; and you must love him as yourself, for YOU became alien residents in the land of Egypt. I am Jehovah YOUR God.\n \n This would prove even more so for whites going into a black dominated country, how much more would we have to be accepting/understanding of their way of life, skin color etc if we were the \"aliens\"?\n\n \n Then the same should apply for gays, am I not correct?", 
   {}, 
   244763, 
   null, 
   1166946660.0
  ], 
  [
   244821, 
   null, 
   "Matthew S", 
   "Hmm, with those verses, I don't see why most \"christians\" have a problem with accepting same-sex marriage. It says right there \"you must love him as yourself\" ans \"be peaceable with ALL men\". Don't see what the big deal is. \n \n \n\n \n I have argued this myself KJV mark 12:31 Jesus says \"Thou shalt love thy neighbor as thyself. There is none other commandment greater then these\"\n \n I read this to mean that if a christian fights gay rights or gay marriage they must want gay people to fight their rights and their marriages. \n \n Now as has been answered to me that they are actually loving gay people as themselves because gay people are sick and God tells that that gayness is a sin and gay people are going to hell. They themselves would want someone to help them if they were sick and they are trying to keep gay people from going to hell. So by opposing gay rights and marriage they are actually loving their gay neighbor as themselves because they would not want to go to hell and they would want someone to help them if they were sick. \n \n If you come at the scripture with the mindset that being gay and having gay sex if a gift from God; that celebrating and showing joy in his great gift then you see how deluded these christians are and how hatefilled they can be. To try and deny someone their God given gift. Not only deny but take away, through shock treatment or prayer therapy, the joyous gift that has been given us. That is hell worthy and a violation of Jesus greatest 2 commandments from KJV Mark 12:30-31. If they trully loved God with their heart, mind, and soul they would not be trying to take his gifts away from their gay brothers and by trying to take Gods gifts from their gay brothers that shows how selfish and hateful they can be and they would not want thier God given gifts taken away ffrom them.", 
   {}, 
   244766, 
   null, 
   1166964960.0
  ], 
  [
   244864, 
   null, 
   "thinking_person", 
   "Then the same should apply for gays, am I not correct?\n\n \n Yeah, you are to be peacable with them etc, it's just that Christians aren't to APPROVE of them lying with other men (they should like them as a person, just not the sinful act)...not that that should cause arguments or anything, it's not very Christian to just speak your mind telling people how \"bad\" they're being. It's the same with any other thing that the bible teaches is wrong, it's not the Christian's job to judge, it's their job to preach and teach - tactfully. I totally don't agree with the Catholic Pope, who's actually just homaphobic (and uses the scriptures to vent out his opinion). There are plenty of people out there \"sinning\", you know, having sex before marriage etc, because we are imperfect, but it's not the job of preist etc to just shout out about them. People change if they have a good reason to, if they want to become Christian, they will. Jesus and the early Christians knew this, they preached and if no-one listened they moved on, they didn't chastise anyone (unless they were being hypocritical, which allot of the religious leaders were like then and today).", 
   {}, 
   244814, 
   null, 
   1167008040.0
  ], 
  [
   244867, 
   null, 
   "Shooterandproud", 
   "Yeah, you are to be peacable with them etc, it's just that Christians aren't to APPROVE of them lying with other men (they should like them as a person, just not the sinful act)\n\n \n I would agree although I fail to see which \"sinful act\" you're referring to, as nothing about being gay or gay acts are sinful, unless they harm another.\n \n \n \n \n \n \n \n...not that that should cause arguments or anything, it's not very Christian to just speak your mind telling people how \"bad\" they're being. It's the same with any other thing that the bible teaches is wrong, it's not the Christian's job to judge, it's their job to preach and teach - tactfully.\n\n \n Then how come there are still pro-lifers out there, how come there are still anti-gay lobbyists, how come there are still anti-sodomy laws? Thats not very christian.\n \n \n \n \n \n \n \n \n \n \nI totally don't agree with the Catholic Pope, who's actually just homaphobic (and uses the scriptures to vent out his opinion).\n\n \n The catholic pope's IQ is lower than 91.\n \n \n \n \n \nThere are plenty of people out there \"sinning\", you know, having sex before marriage etc,\n\n \n I still see no sinful act in this.\n \n \n \n \n \n \nbecause we are imperfect, but it's not the job of preist etc to just shout out about them. People change if they have a good reason to, if they want to become Christian, they will. Jesus and the early Christians knew this, they preached and if no-one listened they moved on, they didn't chastise anyone (unless they were being hypocritical, which allot of the religious leaders were like then and today).\n\n \n Now there, i can agree.", 
   {}, 
   244864, 
   null, 
   1167021300.0
  ], 
  [
   244893, 
   null, 
   "JakeCJB", 
   "Yeah, you are to be peacable with them etc, it's just that Christians aren't to APPROVE of them lying with other men (they should like them as a person, just not the sinful act)...\n\n \n I am so sick of hearing this as a gay person. I am the person I am, because I am being gay. One cannot say he or she hates it when I am being who I am, but does not hate me. Being gay is about a lot more than lying with someone of the same sex, by the way. It's every way of being that makes one different from a straight person.", 
   {}, 
   244864, 
   null, 
   1167109320.0
  ], 
  [
   244928, 
   null, 
   "Matthew S", 
   "I am so sick of hearing this as a gay person. I am the person I am, because I am being gay. One cannot say he or she hates it when I am being who I am, but does not hate me. Being gay is about a lot more than lying with someone of the same sex, by the way. It's every way of being that makes one different from a straight person.\n\n \n I agree they will either accept me and all of me or they don't accept me at all. \n \n My gayness is not something I can lay aside.", 
   {}, 
   244893, 
   null, 
   1167185280.0
  ], 
  [
   244980, 
   null, 
   "thinking_person", 
   "I agree they will either accept me and all of me or they don't accept me at all. \n \n My gayness is not something I can lay aside.\n\n \n Well, I can't say for sure why the act of having sex with the same sex is condemned in the bible, only God knows. My brother is gay, but even that doesn't clear up confusions in my head. I gues you have to be gay to understand and know to what extent the bible will impact your life. But if you have no interest in the bible it's understandable that many gays protest about it.\n \n Like I have said before, I have sinned plenty (for which I have been sorry for), but this doesn't mean that you are going to be rejected by God, he is also merciful and understands our weaknesses. God will aprove of you provided that your heart is in the right place. Your heart is in the right place if you constantly seek His will and don't constantly sin without repentance.\n \n Like I keep stressing, the fact that there are so many intollerant Christians around just proves that they aren't following EVERYTHING in the bible and what Jesus taught. They are hypocrates just as Jesus said in his time.\n \n It's not like gays are the only ones who have it difficult, life is hard for everyone. Some Christians decide to stay single because they can't find a suitable mate (one that lives up to bible standards), people like these have it hard too. Those who live by bible know of, and reap the benifits. They follow it and make personal sacrifices for good reason.", 
   {}, 
   244928, 
   null, 
   1167251520.0
  ], 
  [
   245001, 
   null, 
   "JimStPete", 
   "Well, I can't say for sure why the act of having sex with the same sex is condemned in the bible, only God knows. My brother is gay, but even that doesn't clear up confusions in my head. I gues you have to be gay to understand and know to what extent the bible will impact your life. But if you have no interest in the bible it's understandable that many gays protest about it.\n \n Like I have said before, I have sinned plenty (for which I have been sorry for), but this doesn't mean that you are going to be rejected by God, he is also merciful and understands our weaknesses. God will aprove of you provided that your heart is in the right place. Your heart is in the right place if you constantly seek His will and don't constantly sin without repentance.\n \n Like I keep stressing, the fact that there are so many intollerant Christians around just proves that they aren't following EVERYTHING in the bible and what Jesus taught. They are hypocrates just as Jesus said in his time.\n \n It's not like gays are the only ones who have it difficult, life is hard for everyone. Some Christians decide to stay single because they can't find a suitable mate (one that lives up to bible standards), people like these have it hard too. Those who live by bible know of, and reap the benifits. They follow it and make personal sacrifices for good reason.\n\n \n \n Thinking Person, I have to say you have a very gentle approach to talking about your religion on this thread (regarding gay people). I appreciate the way you say you don't understand why god made gay sex an abomination but he did. Your approach on this is kind, and you don't do the condemning yourself, you leave that to god.\n \n I'm gay and still in a 27 year relationship with my partner. Raised Catholic. I went to religious instruction classes every Saturday morning for 3 hours from Kindergarten through 5th grade. I never learned anything from those classes. I also went through the 'born again' session for a couple hours and learned more in that two hours then I did in all those years of religious instruction classes.\n \n After many years of going back and forth on this topic in my mind, I simply decided there is nothing in religion for me but psychological torture and condemnation so I simply turned away from religion all together. Then I was condemned for Idolatry for turning away so once again, nothing but condemnation from religion. I don't know how some gay people can be religious but it's their life. If they want to spend their life flogging themselves and hating themselves, that's their business, but it's just not good for me. To me religion is like having parents that abuse you, insult you, and put you down. Those types of parents are bad for you and you need to push them out of your life for your own psychological good. You appreciate that they gave birth to you and raised you, but you do not owe them enough to stay and take the abuse. (abuse is not love)\n \n I also appreciate your concern for your brother (not judging, just concern). If you're not gay, you'll never understand why people are gay, it just happens. Nothing will change it no matter what the ex-gay people say. I hope your brother can at least accept who he is and make peace with himself. If celebacy makes him happy, then good for him. As long as you and your family love him he is in good hands.", 
   {}, 
   244980, 
   null, 
   1167254880.0
  ], 
  [
   245013, 
   null, 
   "Matthew S", 
   "Well, I can't say for sure why the act of having sex with the same sex is condemned in the bible, only God knows. My brother is gay, but even that doesn't clear up confusions in my head. I gues you have to be gay to understand and know to what extent the bible will impact your life. But if you have no interest in the bible it's understandable that many gays protest about it.\n \n Like I have said before, I have sinned plenty (for which I have been sorry for), but this doesn't mean that you are going to be rejected by God, he is also merciful and understands our weaknesses. God will aprove of you provided that your heart is in the right place. Your heart is in the right place if you constantly seek His will and don't constantly sin without repentance.\n \n Like I keep stressing, the fact that there are so many intollerant Christians around just proves that they aren't following EVERYTHING in the bible and what Jesus taught. They are hypocrates just as Jesus said in his time.\n \n It's not like gays are the only ones who have it difficult, life is hard for everyone. Some Christians decide to stay single because they can't find a suitable mate (one that lives up to bible standards), people like these have it hard too. Those who live by bible know of, and reap the benifits. They follow it and make personal sacrifices for good reason.\n\n \n \n \n The point is that the Bible has no relevance then grims fairy tales in a secular society. No religious book should be used to make or justify laws. Bottom line who cares what the bible says I don't burn it, rip it up, or flush it down the toilet. It has no meaning in a secular society.", 
   {}, 
   244980, 
   null, 
   1167265320.0
  ], 
  [
   245025, 
   null, 
   "Easyrider", 
   "The point is that the Bible has no relevance then grims fairy tales in a secular society. No religious book should be used to make or justify laws. Bottom line who cares what the bible says I don't burn it, rip it up, or flush it down the toilet. It has no meaning in a secular society.\n\n \n I think the real \"Grim's Fairy Tale\" is your statement that the Bible (and God) have no relevance in today's society. The vast majority of Americans would disagree with you on that.", 
   {}, 
   245013, 
   null, 
   1167272040.0
  ], 
  [
   245030, 
   null, 
   "JakeCJB", 
   "The Bible says so. That's really not good enough for thinking human beings. We should consider the impact on individuals and on social groups. Other sources of knowledge besides the Bible must be used.\n \n The Bible says a slave must always obey his master. We know today this is wrong. The writers of the Bible didn't understand issues of freedom and equality, and were not familiar with Constitutional democracy. They didn't understand science or gender equality. They did not understand sexual orientation as we do today, having gained knowledge especially over the last many decades, from sources outside of the Bible and religion.", 
   {}, 
   245025, 
   null, 
   1167275820.0
  ], 
  [
   245031, 
   null, 
   "georged", 
   "The Bible says so. That's really not good enough for thinking human beings. We should consider the impact on individuals and on social groups. Other sources of knowledge besides the Bible must be used.\n \n The Bible says a slave must always obey his master. We know today this is wrong. The writers of the Bible didn't understand issues of freedom and equality, and were not familiar with Constitutional democracy. They didn't understand science or gender equality. They did not understand sexual orientation as we do today, having gained knowledge especially over the last many decades, from sources outside of the Bible and religion.\n\n \n Well put. Lack of consideration for societal change has long been one of my my primary disagreements with belief systems based on a fixed oracle interpreted during ancient history and adhered to in contemporary times. One needs an era of ruthless leadership seeking nothing but personal wealth and periodic disasters like widespread famine to relate with antiquated, printed oracle worship.", 
   {}, 
   245030, 
   null, 
   1167277740.0
  ], 
  [
   245073, 
   null, 
   "jitobear", 
   "The point is that the Bible has no relevance then grims fairy tales in a secular society. No religious book should be used to make or justify laws. Bottom line who cares what the bible says I don't burn it, rip it up, or flush it down the toilet. It has no meaning in a secular society.\n\n \n \nI think the real \"Grim's Fairy Tale\" is your statement that the Bible (and God) have no relevance in today's society. The vast majority of Americans would disagree with you on that.\n\n \n You are both right. The Bible certainly has relevance for many people in many societies. It, however, has no place being the basis for laws in a secular government. Laws in this country have to have a better reason than \"it will make the Christians happy\" or else we travel the road to facist theocracy.", 
   {}, 
   245025, 
   null, 
   1167323220.0
  ], 
  [
   245112, 
   null, 
   "thinking_person", 
   "Oh dear, you people (Matthew etc) clearly don't understand the fundamental values of the bible. The bible doesn't condone cruel slavery, neither does it encourage in-equality, quite the opposite actually. If you quote scriptures on the contrary, you are taking them out of context. You can make any book say what you want by taking it out of context.\n \n The Bible states that \"man has dominated man to his injury.\" (Ecclesiastes 8:9) This is perhaps nowhere more evident than in the oppressive forms of slavery that have been devised by man. God is not indifferent to the suffering that slavery has wrought.\n \n For example, consider a situation that developed with the Israelites. The Bible tells us that the Egyptians \"kept making their life bitter with hard slavery at clay mortar and bricks and with every form of slavery in the field, yes, every form of slavery of theirs in which they used them as slaves under tyranny.\" The Israelites \"continued to sigh because of the slavery and to cry out in complaint, and their cry for help kept going up to the true God.\" Was God indifferent to their plight? On the contrary, \"God heard their groaning and God remembered his covenant with Abraham, Isaac and Jacob.\" Furthermore, God told his people: \"I shall certainly bring you out from under the burdens of the Egyptians and deliver you from their slavery.\"-Exodus 1:14; 2:23, 24; 6:6-8.\n \n Clearly, God did not approve of 'man dominating man' through abusive slavery. But did not God later allow slavery among his people? Yes, he did. However, the slavery that existed in Israel was vastly different from the tyrannical forms of slavery that have existed throughout history.\n \n God's Law stated that kidnapping and selling a human was punishable by death. Furthermore, Jehovah provided guidelines to protect slaves. For example, a slave who was maimed by his master would be set free. If a slave died because his master beat him, the master could be punished with death. Women captives could become slaves, or they could be taken as wives. But they were not to be used for mere sexual gratification. The gist of the Law must have led righthearted Israelites to treat slaves with respect and kindness, as if these were hired laborers.-Exodus 20:10; 21:12, 16, 26, 27; Leviticus 22:10, 11; Deuteronomy 21:10-14.\n \n Some Jews voluntarily became slaves to their fellow Jews in order to repay debts. This practice protected people from starvation and actually allowed many to recover from poverty. Furthermore, at key junctures in the Jewish calendar, slaves were to be released if they so desired. (Exodus 21:2; Leviticus 25:10; Deuteronomy 15:12).\n \n Slavery was part of the economic system of the Roman Empire, under which first-century Christians lived. Hence, some Christians were slaves, and others had slaves. (1#Corinthians 7:21, 22) But does this mean that disciples of Jesus were abusive slave owners? Not at all! Regardless of what Roman law permitted, we can be confident that Christians did not mistreat those under their authority. The apostle Paul even encouraged Philemon to treat his slave Onesimus, who had become a Christian, as \"a brother.\"-Philemon 10-17.\n \n The Bible gives no indication that the enslavement of humans by other humans was part of God's original purpose for mankind. Furthermore, no Bible prophecies allude to humans owning fellow humans through slavery in God's new world. Rather, in that coming Paradise, righteous ones \"will actually sit, each one under his vine and under his fig tree, and there will be no one making them tremble.\"-Micah 4:4.\n \n Clearly, the Bible does not condone the ill-treatment of others in any form. On the contrary, it encourages respect and equality among men. (Acts 10:34, 35) It exhorts humans to treat others the way that they would like to be treated. (Luke 6:31) Moreover, the Bible encourages Christians humbly to view others as superior, regardless of their social standing. (Philippians 2:3) These principles are totally incongruous with abusive forms of slavery practiced by many nations, especially in recent centuries.\n \n Would you consider yourself a slave today? After all, most people are working for the \"big man\".\n \n \n \n \n Do you think that there would have been any world wars if everyone actaully DID what the bible teaches? When I say DO what the bible teaches I dont just mean claim to be a Christian (like Catholics did in the middle ages, where they would murder people!).\n \n Yes the bible does just say to do something, or don't do something. Are you saying that we should get an explantion as to why Murder, Stealing etc is condemned in the bible? We as thinking human beings have the ability to work that out for ourselves and realise the benefits of the bible.\n \n Sometimes we don't know why we should or shouldn't do something. Did you know why touching the cooker was wrong when you was 3? Do you always know what's best for you? Take for example Adultary (e.g. cheating on your wife/husband, running off with someone new etc). As regards the partner who has desires to do this, he/she may not think of why exactly he/she shouldn't do it, or may even think that life with the new partner will be better. You've probably heard of (or experienced) all the heartache and suffering adultary causes, and yet the bible (God's word) clearly condemns this because God knows what's best for us. There are thousands of principles in the bible that are beneficial to everyone.\n \n What JakeCJB said here:\n \nThe Bible says so. That's really not good enough for thinking human beings.\n\n reminds me of what happened in the begining with Adam and Eve. Our first parents were given a test of loyalty from God. When they disobeyed Him it was like them saying \"we don't need you, we can live on our own perfectly fine\". Well, that's exactly what God allowed to happen...He more or less said, \"fine, if you think you can cope without me then go ahead, I will not intervene with human affairs anymore\". God did however leave us with the bible as guidance, which is up to us if we chose to live by it or not. And what has happened in a world without God? Chaos, simply chaos. Man cannot rule man without major problems. If you think that the world is getting better then you need to open your eyes.\n \n \n As regards democracy, you've got to be kidding if you think that \"the people get to say\" how the government rules...yeah maybe ones in high places etc. You honestly think that Bush and Blair do what the people want? (hmmm, wars in Iraq come in to mind here). Apart from people still not being satisfied with the govenrment, the government has no real control over the nations. Crime hasn't plummitted down since democracy was heavily promoted. Yeah the world is much better now that we have democracy (not).\n \n The bible promotes theocracy (take for example the ten commandments), since God made us He knows best. Now if we all lived by bible standards the world would be perfect. It wouldn't be the criminals that get prefferential treatment, it would be the righteous. In the bible everyone has rights, or free will, but if you abuse this then that's it, justice is served through God. There's no letting murderers etc off just with a slap on the wrist.\n \n The bible doesn't promote in-equality with woman. \n Take for example:\n Matthew 7:12 (\"All things, therefore, that YOU want men to do to YOU, YOU also must likewise do to them; this, in fact, is what the Law and the Prophets mean). The bible says He/Man, but it just as well reffers to woman. There are plenty books noadays that don't always say he/she, but it still reffers to all humans as \"he/men\".\n The Bible makes a similar point in a different way: \"Your beauty should not be dependent on an elaborate coiffure, or on the wearing of jewelry or fine clothes, but on the inner personality-the unfading loveliness of a calm and gentle spirit, a thing very precious in the eyes of God.\" And just as we should not judge a book by its cover, so we should not judge people by their gender.-1#Peter 3:3,#4.\n \n The fact that a lot of men abuse their role as a husband isn't the bible's fault. No-where in the bible does it say that woman should do all the housework while their men should watch football and drink LOL. Men are to share in domestic chores as in line with the apostle Peter's counsel to husbands to dwell with their wives#\"according to knowledge.\" (1#Peter 3:7) Among other things, this means that the husband should not simply be an impersonal, insensitive roommate or house partner. He should respect his wife's intelligence and experience. He should also understand her needs as a woman, wife, and mother. This involves more than the need for a breadwinner to bring home a paycheck; many working wives also do that. He has to understand her physical, emotional, psychological, sexual, and, above all, spiritual needs.\n \n The bible encourages husbands to treat/love their wife as they do themselves (Ephesians 5:33). This means that men are to put themselves in their wives position and see how he would feel.\n \n There is no in-equality here in the bible, unlike nowadays. If a so called Christian guy is abusing his woman in whatever way, it is his problem, not the bible's.", 
   {
    "unicode_changes_made": true
   }, 
   245030, 
   null, 
   1167343080.0
  ], 
  [
   245130, 
   null, 
   "Easyrider", 
   "Jake CJB wrote: The Bible says so. That's really not good enough for thinking human beings.\n \n Translation: 60-70% of Americans aren't \"thinking human beings.\" \n \n Which is ridiculous....", 
   {}, 
   245112, 
   null, 
   1167357420.0
  ], 
  [
   245133, 
   null, 
   "Matthew S", 
   "Jake CJB wrote: The Bible says so. That's really not good enough for thinking human beings.\n \n Translation: 60-70% of Americans aren't \"thinking human beings.\" \n \n Which is ridiculous....\n\n \n So what if 60-70% of americans were muslim or wiccan?", 
   {}, 
   245130, 
   null, 
   1167358020.0
  ], 
  [
   245138, 
   null, 
   "JakeCJB", 
   "Jake CJB wrote: The Bible says so. That's really not good enough for thinking human beings.\n \n Translation: 60-70% of Americans aren't \"thinking human beings.\" \n \n Which is ridiculous....\n\n \n The majority isn't always right. That is a fallacy of logic. The majority once believed the sun revolved around the earth, backed up by religion. They were of course, wrong. Do 60-70% of Americans really believe everything the Bible says is literally correct and cannot be questioned?", 
   {}, 
   245130, 
   null, 
   1167359280.0
  ], 
  [
   245140, 
   null, 
   "JakeCJB", 
   "The Bible states that \"man has dominated man to his injury.\" (Ecclesiastes 8:9) This is perhaps nowhere more evident than in the oppressive forms of slavery that have been devised by man. God is not indifferent to the suffering that slavery has wrought.\n\n \n \nClearly, God did not approve of 'man dominating man' through abusive slavery. But did not God later allow slavery among his people? Yes, he did. However, the slavery that existed in Israel was vastly different from the tyrannical forms of slavery that have existed throughout history.\n\n \n QUOTE=thinking_person]For example, a slave who was maimed by his master would be set free. If a slave died because his master beat him, the master could be punished with death.[/QUOTE]\n \n This was only if the slave died immediately under the master's hand. The master would not be punished if it took the slave a day or two to die as a result of injuries however-- \n \n \"And if a man smite his servant, or his maid, with a rod, and he die under his hand; he shall be surely punished. Notwithstanding, if he continue a day or two, he shall not be punished: for he is his money\" (Exodus 21:20-21).\n \n This doesn't sound like such a great situation, even by the general standards of inferior treatment of slaves.\n \n \nSome Jews voluntarily became slaves to their fellow Jews in order to repay debts. This practice protected people from starvation and actually allowed many to recover from poverty.\n\n \n That's not really a justification. I suppose starving may be worse than picking cotton in the old South. However, the fact that worse things could happen to a person, does not mean the person is being treated justly. It only shows how low the slave's expectations in life are made.\n \n \nYes the bible does just say to do something, or don't do something. Are you saying that we should get an explantion as to why Murder, Stealing etc is condemned in the bible? We as thinking human beings have the ability to work that out for ourselves and realise the benefits of the bible.\n\n \n Yes, we as human being have the ability to reason, and thus to determine which parts of the Bible are worth following and which are not.", 
   {
    "unicode_changes_made": true
   }, 
   245112, 
   null, 
   1167361080.0
  ], 
  [
   245148, 
   null, 
   "JakeCJB", 
   "Do you think that there would have been any world wars if everyone actaully DID what the bible teaches? When I say DO what the bible teaches I dont just mean claim to be a Christian (like Catholics did in the middle ages, where they would murder people!).\n\n \n Yes, many believe their religion is the best, and the others are not as good.\n \n \nreminds me of what happened in the begining with Adam and Eve. Our first parents were given a test of loyalty from God. When they disobeyed Him it was like them saying \"we don't need you, we can live on our own perfectly fine\". Well, that's exactly what God allowed to happen...He more or less said, \"fine, if you think you can cope without me then go ahead, I will not intervene with human affairs anymore\". God did however leave us with the bible as guidance, which is up to us if we chose to live by it or not. And what has happened in a world without God? Chaos, simply chaos. Man cannot rule man without major problems. If you think that the world is getting better then you need to open your eyes.\n\n \n I'm sorry, but there is no real point here. It's just platitudes and a sermon. The world has become worse since we were thrown out of a mythical paradise? Come on now. The Bible is not, and should never be, the only source for knowledge. God, and the self-appointed elite who claim to speak for that God which may or may not exist, cannot be the only source. Humankind is capable of its own inquiry.\n \n \nAs regards democracy, you've got to be kidding if you think that \"the people get to say\" how the government rules...yeah maybe ones in high places etc. You honestly think that Bush and Blair do what the people want? (hmmm, wars in Iraq come in to mind here). Apart from people still not being satisfied with the govenrment, the government has no real control over the nations. Crime hasn't plummitted down since democracy was heavily promoted. Yeah the world is much better now that we have democracy (not).\n \n The bible promotes theocracy (take for example the ten commandments), since God made us He knows best. Now if we all lived by bible standards the world would be perfect. It wouldn't be the criminals that get prefferential treatment, it would be the righteous. In the bible everyone has rights, or free will, but if you abuse this then that's it, justice is served through God. There's no letting murderers etc off just with a slap on the wrist.\n\n \n Are you saying you would perfer to live in a theocracy? What happens if I do not share your religion, and do not agree to live by its rules?\n \n \nThe bible doesn't promote in-equality with woman.\n\n \n \"I will greatly increase your pains in childbearing; with pain you will give birth to children. Your desire shall be for your husband, and he shall rule over you.\" (Genesis 3:16) \n \n \"If, however, the charge is not true and no proof of the girls virginity can be found, she shall be brought to the door of her fathers house and there the men of the town shall stone her to death.\" (Deut. 22:20-21) \n \n The Lord said to Moses, \"Now kill all the boys. And kill every woman who has slept with a man, but save for yourselves every girl who has never slept with a man.\" (Num. 31:17) \n \n \"Wives, submit yourselves unto your husbands, as unto the Lord...Therefore as the church is subject unto Christ, so let the wives be to their own husbands in everything.\" (Eph. 5:22-24) \n \n \"Women should remain silent in churches. They are not allowed to speak; but must be in submission as the Law says.\" (I Cor. 14:34-35) \n \n \"A woman should learn in quietness and full submission. I do not permit a woman to teach or to have authority over a man; she must be silent. For Adam was formed first, then Eve. And Adam was not the one deceived; it was the woman who was deceived and became a sinner.\" (I Tim. 2:11-14) \n \n \"The head of every man is Christ, and the head of every woman is man.\" (I Cor. 11:3) \n \n \"For man did not come from woman, but woman from man. Neither was man created for woman, but woman for man.\" (I Cor. 11:8-9)", 
   {}, 
   245112, 
   null, 
   1167365820.0
  ], 
  [
   245169, 
   null, 
   "Easyrider", 
   " The majority isn't always right. That is a fallacy of logic.\n\n \n Many times the majority is right. The fallacy is not recognizing that.\n \n \n The majority once believed the sun revolved around the earth, backed up by religion. They were of course, wrong.\n\n \n Well, the Bible doesn't teach that. But a lot of secularists thought the same thing at one time. So what?\n \n \n \n Do 60-70% of Americans really believe everything the Bible says is literally correct and cannot be questioned?\n\n \n I doubt it. By the same token it appears the majority of Americans don't want gay marriage either. Even a number of gays and non-religious folks don't think it's right.", 
   {}, 
   245138, 
   null, 
   1167405660.0
  ], 
  [
   245176, 
   null, 
   "JakeCJB", 
   "Many times the majority is right. The fallacy is not recognizing that.\n\n \n I didn't say that the majority is never right. I said the majority is not always right. To say the majority believes something is not an argument.\n \n \nWell, the Bible doesn't teach that. But a lot of secularists thought the same thing at one time. So what?\n\n \n The Bible and religious authority have made mistakes, and can't give one all the correct knowledge on every topic. To say the Bible or religion says so is circular. It begs other questions, and is not the end of debate.\n \n \"To assert that the earth revolves around the sun is as erroneous as to claim that Jesus was not born of a virgin.\" - Cardinal Bellarmine (1615, during the trial of Galileo).\n \n \nI doubt it. By the same token it appears the majority of Americans don't want gay marriage either. Even a number of gays and non-religious folks don't think it's right.\n\n \n Those numbers keep changing. You are repeating the same fallacious argument. The fact that the majority wishes to exclude gays from marriage does not make it right.\n \n Marriage is an important social institution, having tangible and intangible benefits. Gays should have the same opportunity and choice to be a part of it. Otherwise, gays are excluded. Now, if you have an argument as to why gays should be so excluded, from marriage, I'd like to hear it.", 
   {
    "unicode_changes_made": true
   }, 
   245169, 
   null, 
   1167410040.0
  ], 
  [
   245182, 
   null, 
   "Matthew S", 
   "Many times the majority is right. The fallacy is not recognizing that.\n \n\n \n The majority may sometimes be right but they are never just. Is it justified to deny me the same rights as others because of other peoples beliefs when those beliefs do harm and hurt my family?\n \n \n\n Well, the Bible doesn't teach that. But a lot of secularists thought the same thing at one time. So what?\n\n \n Tell it to poor Giordano Bruno\n Who was burned at the stake by the church for this belief. Here are some of his charges.\n \n \nThe numerous charges against Bruno, based on some of his books as well as on witness accounts, included blasphemy, immoral conduct, and heresy in matters of dogmatic theology, and involved some of the basic doctrines of his philosophy and cosmology. Luigi Firpo lists them as follows [2]:\n Holding opinions contrary to the Catholic Faith and speaking against it and its ministers.\n Holding erroneous opinions about the Trinity, about Christ's divinity and Incarnation.\n Holding erroneoeus opinions about Christ.\n Holding erroneous opinions about Transubstantiation and Mass.\n Claiming the existence of a plurality of worlds and their eternity.\n Believing in metempsychosis and in the transmigration of the human soul into brutes.\n Dealing in magics and divination.\n Denying the Virginity of Mary.\n\n Fist time I have heard the Pope called a secularist Pope Clement VIII \n The Pope expressed himself in favor of a guilty verdict.\n \n\n \n Is this what you want witch, and heretic burnings? This is what you get when you mix religion and government. Of course then again you believe this should be a christian nation and in christian nation all of us secularists would meet poor Giordanos fate for being \"christ deniers\" and heretics.\n \nA month or so later he was brought to the Campo de' Fiori, a central Roman market square, his tongue in a gag, tied to a pole naked and burned at the stake, on February 17, 1600.\n\n \n \n\n I doubt it. By the same token it appears the majority of Americans don't want gay marriage either. Even a number of gays and non-religious folks don't think it's right.\n\n \n For the record I would not mind them doing away with all marriage licenses. That way all people would be equal but as long as the state offers a piece of paper to heteros they must also offer it to gay people. Either equal marriage for all or no marriage for anyone.", 
   {}, 
   245169, 
   null, 
   1167413760.0
  ], 
  [
   245204, 
   null, 
   "thinking_person", 
   "Hi, I just wanted to put to bed the accusations that the bible is unscientific. Here I found a religious article that addresses most issues raised. Sorry I couldn't link it, just had to paste the lot:\n \n Science: Has It Proved the Bible Wrong?\n \n In 1613 the Italian scientist Galileo published a work known as \"Letters on Sunspots.\" In it, he presented evidence that the earth rotates around the sun, rather than the sun around the earth. By so doing, he set in motion a series of events that finally brought him before the Roman Catholic Inquisition under \"vehement suspicion of heresy.\" Eventually, he was forced to \"recant.\" Why was the idea that the earth moves around the sun viewed as heresy? Because Galileo's accusers claimed that it was contrary to what the Bible says.\n \n IT IS widely held today that the Bible is unscientific, and some point to Galileo's experiences to prove it. But is this the case? When answering that question, we have to remember that the Bible is a book of prophecy, history, prayer, law, counsel, and knowledge about God. It does not claim to be a scientific textbook. Nevertheless, when the Bible does touch on scientific matters, what it says is completely accurate.\n \n Our Planet Earth\n \n 2 Consider, for example, what the Bible says about our planet, the earth. In the book of Job, we read: \"[God] is stretching out the north over the empty place, hanging the earth upon nothing.\" (Job 26:7) Compare this with Isaiah's statement, when he says: \"There is One who is dwelling above the circle of the earth.\" (Isaiah 40:22) The picture conveyed of a round earth 'hanging upon nothing' in \"the empty place\" reminds us strongly of the photographs taken by astronauts of the sphere of the earth floating in empty space.\n \n 3 Consider, too, the earth's amazing water cycle. Here is how Compton's Encyclopedia describes what happens: \"Water .#.#. evaporates from the surface of the oceans into the atmosphere .#.#. Steadily moving air currents in the earth's atmosphere carry the moist air inland. When the air cools, the vapor condenses to form water droplets. These are seen most commonly as clouds. Often the droplets come together to form raindrops. If the atmosphere is cold enough, snowflakes form instead of raindrops. In either case, water that has traveled from an ocean hundreds or even thousands of miles away falls to the earth's surface. There it gathers into streams or soaks into the ground and begins its journey back to the sea.\"1\n \n 4 This remarkable process, which makes life on dry land possible, was well described about 3,000 years ago in simple, straightforward terms in the Bible: \"All streams run into the sea, yet the sea never overflows; back to the place from which the streams ran they return to run again.\"-Ecclesiastes 1:7, The New English Bible.\n \n 5 Perhaps even more remarkable is the Bible's insight into the history of mountains. Here is what a textbook on geology says: \"From Pre-Cambrian times down to the present, the perpetual process of building and destroying mountains has continued. .#.#. Not only have mountains originated from the bottom of vanished seas, but they have often been submerged long after their formation, and then re-elevated.\"2 Compare this with the poetic language of the psalmist: \"With a watery deep just like a garment you covered [the earth]. The waters were standing above the very mountains. Mountains proceeded to ascend, valley plains proceeded to descend-to the place that you have founded for them.\"-Psalm 104:6,#8.\n \n \"In the Beginning\"\n \n 6 The very first verse of the Bible states: \"In the beginning God created the heavens and the earth.\" (Genesis 1:1) Observations have led scientists to theorize that the material universe did indeed have a beginning. It has not existed for all time. Astronomer Robert Jastrow, an agnostic in religious matters, wrote: \"The details differ, but the essential elements in the astronomical and biblical accounts of Genesis are the same: the chain of events leading to man commenced suddenly and sharply at a definite moment in time, in a flash of light and energy.\"3\n \n 7 True, many scientists, while believing that the universe had a beginning, do not accept the statement that \"God created.\" Nevertheless, some now admit that it is difficult to ignore the evidence of some kind of intelligence behind everything. Physics professor Freeman Dyson comments: \"The more I examine the universe and study the details of its architecture, the more evidence I find that the universe in some sense must have known that we were coming.\"\n \n 8 Dyson goes on to admit: \"Being a scientist, trained in the habits of thought and language of the twentieth century rather than the eighteenth, I do not claim that the architecture of the universe proves the existence of God. I claim only that the architecture of the universe is consistent with the hypothesis that mind plays an essential role in its functioning.\"4 His comment certainly betrays the skeptical attitude of our time. But putting that skepticism aside, one notes there is a remarkable harmony between modern science and the Bible's statement that \"in the beginning God created the heavens and the earth.\"-Genesis 1:1.\n \n Health and Sanitation\n \n 9 Consider the Bible's coverage of another field: health and sanitation. If an Israelite had a skin blemish suspected of being leprosy, he was put in isolation. \"All the days that the plague is in him he will be unclean. He is unclean. He should dwell isolated. Outside the camp is his dwelling place.\" (Leviticus 13:46) Even infected garments were burned. (Leviticus 13:52) In those days, this was an effective way of preventing the spread of the infection.\n \n 10 Another important law had to do with the disposal of human excrement, which had to be buried outside the camp. (Deuteronomy 23:12,#13) This law no doubt saved Israel from many sicknesses. Even today, severe health problems are caused in some lands by the improper disposal of human wastes. If people in those lands would only follow the law written down thousands of years ago in the Bible, they would be much healthier.\n \n 11 The Bible's high standard of hygiene even involved mental health. A Bible proverb said: \"A calm heart is the life of the fleshly organism, but jealousy is rottenness to the bones.\" (Proverbs 14:30) In recent years, medical research has demonstrated that our physical health is indeed affected by our mental attitude. For example, Doctor C.#B.#Thomas of Johns Hopkins University studied more than a thousand graduates over a period of 16 years, matching their psychological characteristics with their vulnerability to diseases. One thing she noted: The graduates most vulnerable to disease were those who were angrier and more anxious under stress.5\n \n What Does the Bible Say?\n \n 12 If the Bible is so accurate in scientific fields, why did the Catholic Church say that Galileo's teaching that the earth moved around the sun was unscriptural? Because of the way the authorities interpreted certain Bible verses.6 Were they correct? Let us read two of the passages they quoted and see.\n \n 13 One passage says: \"The sun rises, the sun sets; then to its place it speeds and there it rises.\" (Ecclesiastes 1:5, The Jerusalem Bible) According to the Church's argument, expressions such as \"the sun rises\" and \"the sun sets\" mean that the sun, not the earth, is moving. But even today we say that the sun rises and sets, and most of us know that it is the earth that moves, not the sun. When we use expressions like these, we are merely describing the apparent motion of the sun as it appears to a human observer. The Bible writer was doing exactly the same.\n \n 14 The other passage says: \"You fixed the earth on its foundations, unshakeable for ever and ever.\" (Psalm 104:5, The Jerusalem Bible) This was interpreted to mean that after its creation the earth could never move. In fact, though, the verse stresses the permanence of the earth, not its immobility. The earth will never be 'shaken' out of existence, or destroyed, as other Bible verses confirm. (Psalm 37:29; Ecclesiastes 1:4) This scripture, too, has nothing to do with the relative motion of the earth and the sun. In Galileo's time, it was the Church, not the Bible, that hindered free scientific discussion.\n \n Evolution and Creation\n \n 15 There is, however, an area where many would say that modern science and the Bible are hopelessly at odds. Most scientists believe the theory of evolution, which teaches that all living things evolved from a simple form of life that came into existence millions of years ago. The Bible, on the other hand, teaches that each major group of living things was specially created and reproduces only \"according to its kind.\" Man, it says, was created \"out of dust from the ground.\" (Genesis 1:21; 2:7) Is this a glaring scientific error in the Bible? Before deciding, let us look more closely at what science knows, as opposed to what it theorizes.\n \n 16 The theory of evolution was popularized during the last century by Charles Darwin. When he was on the Galápagos Islands in the Pacific, Darwin was strongly impressed by the different species of finches on the different islands, which, he deduced, must all have descended from just one ancestral species. Partly because of this observation, he promoted the theory that all living things come from one original, simple form. The driving force behind the evolution of higher creatures from lower, he asserted, was natural selection, the survival of the fittest. Thanks to evolution, he claimed, land animals developed from fish, birds from reptiles, and so forth.\n \n 17 As a matter of fact, what Darwin observed in those isolated islands was not out of harmony with the Bible, which allows for variation within a major living kind. All the races of mankind, for example, came from just one original human pair. (Genesis 2:7, 22-24) So it is nothing strange that those different species of finches would spring from a common ancestral species. But they did remain finches. They did not evolve into hawks or eagles.\n \n 18 Neither the various species of finches nor anything else Darwin saw proved that all living things, whether they be sharks or sea gulls, elephants or earthworms, have a common ancestor. Nevertheless, many scientists assert that evolution is no longer just a theory but that it is a fact. Others, while recognizing the theory's problems, say that they believe it anyway. It is popular to do so. We, however, need to know whether evolution has been proved to such an extent that the Bible must be wrong.\n \n Is It Proved?\n \n 19 How can the theory of evolution be tested? The most obvious way is to examine the fossil record to see if a gradual change from one kind to another really happened. Did it? No, as a number of scientists honestly admit. One, Francis Hitching, writes: \"When you look for links between major groups of animals, they simply aren't there.\"7 So obvious is this lack of evidence in the fossil record that evolutionists have come up with alternatives to Darwin's theory of gradual change. The truth is, though, that the sudden appearance of animal kinds in the fossil record supports special creation much more than it does evolution.\n \n 20 Moreover, Hitching shows that living creatures are programmed to reproduce themselves exactly rather than evolve into something else. He says: \"Living cells duplicate themselves with near-total fidelity. The degree of error is so tiny that no man-made machine can approach it. There are also built-in constraints. Plants reach a certain size and refuse to grow any larger. Fruit flies refuse to become anything but fruit flies under any circumstances yet devised.\"8 Mutations induced by scientists in fruit flies over many decades failed to force these to evolve into something else.\n \n The Origin of Life\n \n 21 Another thorny question that evolutionists have failed to answer is: What was the origin of life? How did the first simple form of life-from which we are all supposed to have descended-come into existence? Centuries ago, this would not have appeared to be a problem. Most people then thought that flies could develop from decaying meat and that a pile of old rags could spontaneously produce mice. But, more than a hundred years ago, the French chemist Louis Pasteur clearly demonstrated that life can come only from preexisting life.\n \n 22 So how do evolutionists explain the source of life? According to the most popular theory, a chance combination of chemicals and energy sparked a spontaneous generation of life millions of years ago. What about the principle that Pasteur proved? The World Book Encyclopedia explains: \"Pasteur showed that life cannot arise spontaneously under the chemical and physical conditions present on the earth today. Billions of years ago, however, the chemical and physical conditions on the earth were far different\"!9\n \n 23 Even under far different conditions, though, there is a huge gap between nonliving matter and the simplest living thing. Michael Denton, in his book Evolution: A Theory in Crisis, says: \"Between a living cell and the most highly ordered non-biological system, such as a crystal or a snowflake, there is a chasm as vast and absolute as it is possible to conceive.\"10 The idea that nonliving material could come to life by some haphazard chance is so remote as to be impossible. The Bible's explanation, that 'life came from life' in that life was created by God, is convincingly in harmony with the facts.\n \n Why Not Creation\n \n 24 Despite the problems inherent in the theory of evolution, belief in creation is viewed today as unscientific, even eccentric. Why is this? Why does even an authority such as Francis Hitching, who honestly points up the weaknesses of evolution, reject the idea of creation?11 Michael Denton explains that evolution, with all its failings, will continue to be taught because theories related to creation \"invoke frankly supernatural causes.\"12 In other words, the fact that creation involves a Creator makes it unacceptable. Surely, this is the same kind of circular reasoning that we met up with in the case of miracles: Miracles are impossible because they are miraculous!\n \n 25 Besides, the theory of evolution itself is deeply suspect from a scientific viewpoint. Michael Denton goes on to say: \"Being basically a theory of historical reconstruction, [Darwin's theory of evolution] is impossible to verify by experiment or direct observation as is normal in science. .#.#. Moreover, the theory of evolution deals with a series of unique events, the origin of life, the origin of intelligence and so on. Unique events are unrepeatable and cannot be subjected to any sort of experimental investigation.\"13 The truth is that the theory of evolution, despite its#popularity, is full of gaps and problems. It gives no#good reason to reject the Bible's account of the origin of life. The first chapter of Genesis provides a completely reasonable account of how these \"unrepeatable\" \"unique events\" came about during creative 'days' that stretched through millenniums of time.\n \n What About the Flood?\n \n 26 Many point to another supposed contradiction between the Bible and modern science. In the book of Genesis, we read that thousands of years ago the wickedness of men was so great that God determined to destroy them. However, he instructed the righteous man Noah to build a large wooden vessel, an ark. Then God brought a flood upon mankind. Only Noah and his family survived, together with representatives of all the animal species. The Flood was so great that \"all the tall mountains that were under the whole heavens came to be covered.\"-Genesis 7:19.\n \n 27 Where did all the water come from to cover the whole earth? The Bible itself answers. Early in the creation process, when the expanse of the atmosphere began to take shape, there came to be \"waters .#.#. beneath the expanse\" and \"waters .#.#. above the expanse.\" (Genesis 1:7; 2#Peter 3:5) When the Flood came, the Bible says: \"The floodgates of the heavens were opened.\" (Genesis 7:11) Evidently, the \"waters .#.#. above the expanse\" fell and provided much of the water for the inundation.\n \n 28 Modern textbooks are inclined to discount a universal flood. So we have to ask: Is the Flood just a myth, or did it really happen? Before answering that, we should note that later worshipers of Jehovah accepted the Flood as genuine history; they did not regard it as a myth. Isaiah, Jesus, Paul, and Peter were among those who referred to it as something that really happened. (Isaiah 54:9; Matthew 24:37-39; Hebrews 11:7; 1#Peter 3:20,#21; 2#Peter 2:5; 3:5-7) But there are questions that have to be answered about this universal Deluge.\n \n The Floodwaters\n \n 29 First, is not the idea of the whole earth's being flooded too farfetched? Not really. Indeed, to some extent the earth is still flooded. Seventy percent of it is covered by water and only 30 percent is dry land. Moreover, 75 percent of the earth's fresh water is locked up in glaciers and polar ice caps. If all this ice were to melt, the sea level would rise much higher. Cities like New York and Tokyo would disappear.\n \n 30 Further, The New Encyclopædia Britannica says: \"The average depth of all the seas has been estimated at 3,790 metres (12,430 feet), a figure considerably larger than that of the average elevation of the land above the sea level, which is 840 metres (2,760 feet). If the average depth is multiplied by its respective surface area, the volume of the World Ocean is 11 times the volume of the land above sea level.\"14 So, if everything were leveled out-if the mountains were flattened and the deep sea basins filled in-the sea would cover the whole earth to a depth of thousands of meters.\n \n 31 For the Flood to have happened, the pre-Flood sea basins would have to have been shallower, and the mountains lower than they are now. Is this possible? Well, one textbook says: \"Where the mountains of the world now tower to dizzy heights, oceans and plains once, millions of years ago, stretched out in flat monotony. .#.#. The movements of the continental plates cause the land both to rear up to heights where only the hardiest of animals and plants can survive and, at the other extreme, to plunge and lie in hidden splendor deep beneath the surface of the sea.\"15 Since the mountains and sea basins rise and fall, it is apparent that at one time the mountains were not as high as they are now and the great sea basins were not as deep.\n \n 32 What happened to the floodwaters after the Flood? They must have drained into the sea basins. How? Scientists believe that the continents rest on huge plates. Movement of these plates can cause changes in the level of the earth's surface. In some places today, there are great underwater abysses more than six miles [more than 10#km] deep at the plate boundaries.16 It is quite likely that-perhaps triggered by the Flood itself-the plates moved, the sea bottom sank, and the great trenches opened, allowing the water to drain off the land.\n \n Traces of the Flood?\n \n 33 If we grant that a great flood could have happened, why have scientists found no trace of it? Perhaps they have, but they interpret the evidence some other way. For example, orthodox science teaches that the surface of the earth has been shaped in many places by powerful glaciers during a series of ice ages. But apparent evidence of glacial activity can sometimes be the result of water action. Very likely, then, some of the evidence for the Flood is being misread as evidence of an ice age.\n \n 34 Similar mistakes have been made. Concerning the time when scientists were developing their theory of ice ages, we read: \"They were finding ice ages at every stage of the geologic history, in keeping with the philosophy of uniformity. Careful reexamination of the evidence in recent years, however, has rejected many of these ice ages; formations once identified as glacial moraines have been reinterpreted as beds laid down by mudflows, submarine landslides and turbidity currents: avalanches of turbid water that carry silt, sand and gravel out over the deep-ocean floor.\"18\n \n 35 Another evidence for the Flood appears to exist in the fossil record. At one time, according to this record, great saber-toothed tigers stalked their prey in Europe, horses larger than any now living roamed North America, and mammoths foraged in Siberia. Then, all around the world, species of mammals became extinct. At the same time, there was a sudden change of climate. Tens of thousands of mammoths were killed and quick-frozen in Siberia. Alfred Wallace, the well-known contemporary of Charles Darwin, considered that such a widespread destruction must have been caused by some exceptional worldwide event.19 Many have argued that this event was the Flood.\n \n 36 An editorial in the magazine Biblical Archaeologist observed: \"It is important to remember that the story of a great flood is one of the most widespread traditions in human culture .#.#. Nevertheless behind the oldest traditions found in Near Eastern sources, there may well be an actual flood of gigantic proportions dating from one of the pluvial periods .#.#. many thousands of years ago.\"20 The pluvial#periods#were times when the surface of the earth was much wetter than now. Freshwater lakes around the world were much larger. It is theorized that the wetness#was caused by heavy rains associated with the end of the ice ages. But some have suggested that on one occasion the extreme wetness of the earth's surface was a result of the Flood.\n \n Mankind Did Not Forget\n \n 37 Geology professor John McCampbell once wrote: \"The essential differences between Biblical catastrophism [the Flood] and evolutionary uniformitarianism are not over the factual data of geology but over the interpretations of those data. The interpretation preferred will depend largely upon the background and presuppositions of the individual student.\"21\n \n 38 That the Flood did happen is seen in the fact that mankind never forgot it. All around the world, in locations as far apart as Alaska and the South Sea Islands, there are ancient stories about it. Native, pre-Columbian civilizations of America, as well as Aborigines of Australia, all have stories about the Flood. While some of the accounts differ in detail, the basic fact that the earth was flooded and only a few humans were saved in a man-made vessel comes through in nearly all versions. The only explanation for such a widespread acceptance is that the Flood was a historical event.\n \n 39 Thus, in essential features the Bible is in harmony with modern science. Where there is a conflict between the two, the scientists' evidence is questionable. Where they agree, the Bible is often so accurate that we have to believe it got its information from a superhuman intelligence. Indeed, the Bible's agreement with proved science provides further evidence that it is God's word, not man's.", 
   {
    "unicode_changes_made": true
   }, 
   245182, 
   null, 
   1167428280.0
  ], 
  [
   245212, 
   null, 
   "thinking_person", 
   "May I just add that Christianity and politics should never get mixed. Did you see Jesus arguing against the polititions of his time? No, but he did say to \"pay caesars things back to caesars, but Gods thing to God\". In other words, we are under submition by the governement, but also to God...we shouldn't rule the government like the Catholics did in the middle ages. \n \n Even if the majority of a country is Christian, this doesn't mean that the whole country are under obligation to do what they beleive. If gays want their rights, they can have them; but it would be againsts a churches beliefs for the couple to get married at the church. Only when it involves Christians going agaisnt their beleifs are they obligated to put their foot down.\n \n Also, reffering to a previous post, what I said was thay if we all FOLLOWED the bible there would be no wars etc. I didn't say anything about religions based on anything else. You said that people argue over which \"faith\" is correct and this is what causes war. Once again, even if people were to actually FOLLOW their beleif system (whatever religion), there wouldn't be so much hatred etc. Take for example the 9/11, are you saying that the Qur'&#257;n (Koran) condones what the terrorists did? No of course not. This is yet again another example of where people screw up their beleifs to condone their actions.\n \n The problem lies not in the beleif system, but how people convey it. It isn't something that should be faught over, but maybe reasoned in a civilised way if desired.", 
   {}, 
   245204, 
   null, 
   1167431280.0
  ], 
  [
   245219, 
   null, 
   "IceWind", 
   "Try as you may, there is nothing in the bible that speaks of actual homosexuality. The bible was written by men with an agenda. The Jesus Christ that the christians believe in said nothing about homosexuals. The only reference to homosexuality in the NT was by Paul. Last I heard, he was not God. Also last I heard, the new covenant replaced the covenant of the OT. Therefore, we no longer have to circumsize our children. Women no longer are considered unclean after childbirth and we no longer have to sacrifice animals.", 
   {}, 
   245212, 
   null, 
   1167433260.0
  ], 
  [
   245224, 
   null, 
   "thinking_person", 
   "Try as you may, there is nothing in the bible that speaks of actual homosexuality. The bible was written by men with an agenda. The Jesus Christ that the christians believe in said nothing about homosexuals. The only reference to homosexuality in the NT was by Paul. Last I heard, he was not God. Also last I heard, the new covenant replaced the covenant of the OT. Therefore, we no longer have to circumsize our children. Women no longer are considered unclean after childbirth and we no longer have to sacrifice animals.\n\n \n With that reasoning why beleive ANYTHING in the bible? If Jesus didn't repeat absolutely everything in the bible then why beleive it? If you don't beleive it all was inspired by God then why beleive any of it? Jesus quoted from the bible but he couldn't rephrase EVERYTHING just so that Christians would beleive it. Jesus did however condone the bible.", 
   {}, 
   245219, 
   null, 
   1167433800.0
  ], 
  [
   245226, 
   null, 
   "IceWind", 
   "With that reasoning why beleive ANYTHING in the bible? If Jesus didn't repeat absolutely everything in the bible then why beleive it? If you don't beleive it all was inspired by God then why beleive any of it? Jesus quoted from the bible but he couldn't rephrase EVERYTHING just so that Christians would beleive it. Jesus did however condone the bible.\n\n \n He also condoned love and acceptance.\n \n It isn't about believing the exact words of the bible. It's about understanding the parables spoken. \n \n Also, what homosexual means today is not what it meant then. Many parts of the bible have gotten lost in translation.\n \n Jesus also said that with his blood, a new covenant was born. So who gets to pick and choose which rules we do and do not follow?", 
   {}, 
   245224, 
   null, 
   1167434400.0
  ], 
  [
   245239, 
   null, 
   "thinking_person", 
   "He also condoned love and acceptance.\n \n It isn't about believing the exact words of the bible. It's about understanding the parables spoken. \n \n Also, what homosexual means today is not what it meant then. Many parts of the bible have gotten lost in translation.\n \n Jesus also said that with his blood, a new covenant was born. So who gets to pick and choose which rules we do and do not follow?\n\n \n We do not have to follow the \"Old Law Covenant\" from the OT, that's all we \"dismiss\". The OT isn't just full of the Law Covenant.\n \n Jesus used illustrations to make his point clearer to grasp, not so that we could dismiss the exact words. However, you are right in that Jesus never reffered to gays, the opportunity didn't arise.\n \n Many parts of the bible have been mis-interpretted but the general message is still there. How could you mis-interpret the same message more than once, especially when both are written at completely different centuries and actually DESCRIBES the act of gays (e.g. men laying with men), and not just homosexuality. To get one word wrong in an interpretation like that wouldn't completely change the meaning of the sentence...or maybe the interpretation should be:\n \n \"man should not lay with another [goat] the same way he lays with a woman\". LOL\n \n No matter how many excuses are made, the bible in the end doesn't condone homosexuality. As I've said though in other posts, this doesn't mean however that we should be judgers, and I don't have anything against gays.\n \n \n Ps, I'm interested to know what gays were like back then that's different to now? How is the meaning different to now?", 
   {}, 
   245226, 
   null, 
   1167435540.0
  ], 
  [
   245246, 
   null, 
   "thinking_person", 
   "\n \"I will greatly increase your pains in childbearing; with pain you will give birth to children. Your desire shall be for your husband, and he shall rule over you.\" (Genesis 3:16) \n \n \"If, however, the charge is not true and no proof of the girls virginity can be found, she shall be brought to the door of her fathers house and there the men of the town shall stone her to death.\" (Deut. 22:20-21) \n \n The Lord said to Moses, \"Now kill all the boys. And kill every woman who has slept with a man, but save for yourselves every girl who has never slept with a man.\" (Num. 31:17) \n \n \"Wives, submit yourselves unto your husbands, as unto the Lord...Therefore as the church is subject unto Christ, so let the wives be to their own husbands in everything.\" (Eph. 5:22-24) \n \n \"Women should remain silent in churches. They are not allowed to speak; but must be in submission as the Law says.\" (I Cor. 14:34-35) \n \n \"A woman should learn in quietness and full submission. I do not permit a woman to teach or to have authority over a man; she must be silent. For Adam was formed first, then Eve. And Adam was not the one deceived; it was the woman who was deceived and became a sinner.\" (I Tim. 2:11-14) \n \n \"The head of every man is Christ, and the head of every woman is man.\" (I Cor. 11:3) \n \n \"For man did not come from woman, but woman from man. Neither was man created for woman, but woman for man.\" (I Cor. 11:8-9)\n\n \n These scriptures are either advice for peaceful family unity and some are descriptions of what the imperfection of mankind has lead to. Plus, many of the scriptures you quoted are from the OT, much of which was replaced by Jesus ministry. Simply put:\n \n Genesis 2:18 records the Creator's purpose: \"It is not good for the man to continue by himself. I am going to make a helper for him, as a complement of him.\" So men and women would each possess qualities that would complement each other. They were not made to be rivals of each other. Each would be more suited to a particular, complementary role.\n \n And the \"discovery\" that women are not clones of men-that women are indeed 'different from men,' that women 'bear the children'-is that really new? Again, the Bible made clear from the outset that God created them different, \"male and female he created them,\" and that the woman was specially designed to bear offspring.-Genesis 1:27,#28; 2:21-23.\n \n But different does not mean inferior. There is no justification for treating womankind in a demeaning way. She is \"from man,\" and so in the Christian congregation, the husband loves his wife \"as he does himself.\" In that atmosphere she finds respect, love, and a sense of security.-Ephesians 5:28-33; 1#Timothy 5:2,#3.\n \n Men and women are different, but they are not competitors. One complements the other; one completes the other. In God's marriage arrangement, the two become one. Millions of true Christian women today are finding the real liberation in filling their role described in the Bible.\n \n \n The husband is assigned the responsibility of being the loving head of the family, and the wife is to be a complement, a helpmate. Note this balanced advice: \"Wives, be subject-be submissive and adapt yourselves-to your own husbands as a service to the Lord. For the husband is head of the wife as Christ is the Head of the church .#.#. Husbands, love your wives, as Christ loved the church and gave Himself up for her .#.#. He who loves his own wife loves himself. For no man ever hated his own flesh, but nourishes and carefully protects and cherishes it.\"-Eph. 5:22-29, The Amplified New Testament.", 
   {
    "unicode_changes_made": true
   }, 
   245148, 
   null, 
   1167436860.0
  ], 
  [
   245271, 
   null, 
   "JakeCJB", 
   "These scriptures are either advice for peaceful family unity and some are descriptions of what the imperfection of mankind has lead to. Plus, many of the scriptures you quoted are from the OT, much of which was replaced by Jesus ministry. Simply put:\n \n Genesis 2:18 records the Creator's purpose: \"It is not good for the man to continue by himself. I am going to make a helper for him, as a complement of him.\" So men and women would each possess qualities that would complement each other. They were not made to be rivals of each other. Each would be more suited to a particular, complementary role.\n \n And the \"discovery\" that women are not clones of men-that women are indeed 'different from men,' that women 'bear the children'-is that really new? Again, the Bible made clear from the outset that God created them different, \"male and female he created them,\" and that the woman was specially designed to bear offspring.-Genesis 1:27,#28; 2:21-23.\n \n But different does not mean inferior. There is no justification for treating womankind in a demeaning way. She is \"from man,\" and so in the Christian congregation, the husband loves his wife \"as he does himself.\" In that atmosphere she finds respect, love, and a sense of security.-Ephesians 5:28-33; 1#Timothy 5:2,#3.\n \n Men and women are different, but they are not competitors. One complements the other; one completes the other. In God's marriage arrangement, the two become one. Millions of true Christian women today are finding the real liberation in filling their role described in the Bible.\n \n \n The husband is assigned the responsibility of being the loving head of the family, and the wife is to be a complement, a helpmate. Note this balanced advice: \"Wives, be subject-be submissive and adapt yourselves-to your own husbands as a service to the Lord. For the husband is head of the wife as Christ is the Head of the church .#.#. Husbands, love your wives, as Christ loved the church and gave Himself up for her .#.#. He who loves his own wife loves himself. For no man ever hated his own flesh, but nourishes and carefully protects and cherishes it.\"-Eph. 5:22-29, The Amplified New Testament.\n\n \n Wow. Do you really believe this is what women in 2006(not1956) want? Women want to be subject and submissive to husbands and to men, to be men's little helpers? Men are at the head, and women are down below? I don't believe this is what women want, unless the U.S. or U.S Christians are more socially backward and patriarchal than I imagine. Such a regime gives women less freedom to choose their own roles in society, aside from their prescribed duties to their husbands. It's also patronizing towards women.", 
   {
    "unicode_changes_made": true
   }, 
   245246, 
   null, 
   1167452820.0
  ], 
  [
   245273, 
   null, 
   "JakeCJB", 
   "We do not have to follow the \"Old Law Covenant\" from the OT, that's all we \"dismiss\". The OT isn't just full of the Law Covenant.\n \n Jesus used illustrations to make his point clearer to grasp, not so that we could dismiss the exact words. However, you are right in that Jesus never reffered to gays, the opportunity didn't arise.\n \n Many parts of the bible have been mis-interpretted but the general message is still there. How could you mis-interpret the same message more than once, especially when both are written at completely different centuries and actually DESCRIBES the act of gays (e.g. men laying with men), and not just homosexuality. To get one word wrong in an interpretation like that wouldn't completely change the meaning of the sentence...or maybe the interpretation should be:\n \n \"man should not lay with another [goat] the same way he lays with a woman\". LOL\n \n No matter how many excuses are made, the bible in the end doesn't condone homosexuality. As I've said though in other posts, this doesn't mean however that we should be judgers, and I don't have anything against gays.\n\n \n That's what is being done, judgment. Describing same-sex acts, is not necessarily decribing homosexuality. The same-sex acts condemned are in the context of idolatry, prostitution or rape. Such actions with different sex partners would also be condemned, but that would not be a condemnation of heterosexuality itself, nor of all heterosexual acts.\n \n \"A man should not lie with a man as he lies with a woman\".\n \n The verse you quote is from the OT, which I thought you said Christians do not have to follow, unless I misunderstood. It is heterosexist to believe that verse applies to gay men. Gay men do not lie with a woman. I can say for certain, as a gay man, that I have not lay with a man as I do with a woman. It shows a complete lack of understanding of homosexuality on the part of the writers if they meant it to apply to men who define themselves as gay and act accordingly. \n \n At any rate, I don't see people observing many of the other OT rules which tell men not to trim their hair, and not to wear clothing made of two different materials.", 
   {}, 
   245239, 
   null, 
   1167457860.0
  ], 
  [
   245280, 
   null, 
   "thinking_person", 
   "Wow. Do you really believe this is what women in 2006(not1956) want? Women want to be subject and submissive to husbands and to men, to be men's little helpers? Men are at the head, and women are down below? I don't believe this is what women want, unless the U.S. or U.S Christians are more socially backward and patriarchal than I imagine. Such a regime gives women less freedom to choose their own roles in society, aside from their prescribed duties to their husbands. It's also patronizing towards women.\n\n \n I can tell you one thing, that families were more of a unit back in 1956 than they are now! Devorce rates etc have sored since then, and families are broken up which in the long run leads to poor family life for the kids...then increased crime rates etc and the list goes on. So yeah, I don't think that the bibles advice is merely old fashioned rubbish.\n \n So you would rather the society where woman are given more responsibility, therefore more stress??? Look around you, I don't think woman appreciate being full time mothers and career obsessed...it's either one or the other. You can't both be concentrating on a career. If the mother for example has a better job than the husband, then maybe it would be wiser for her to work and he do the housework, childcare etc. But in the end, families where the husband takes his responsibiliy seriously (being the head) are the strongest ones. If the husband is a \"wet blanket\" and takes a back seat, the kids are generaly unruley. Psycologists know that families where there are two parents (and the father takes on his responsibility) are stronger and the kids grow up emotionaly stable.", 
   {}, 
   245271, 
   null, 
   1167483840.0
  ], 
  [
   245299, 
   null, 
   "jyoshu", 
   "Wow. Do you really believe this is what women in 2006(not1956) want? Women want to be subject and submissive to husbands and to men, to be men's little helpers? Men are at the head, and women are down below? I don't believe this is what women want, unless the U.S. or U.S Christians are more socially backward and patriarchal than I imagine. Such a regime gives women less freedom to choose their own roles in society, aside from their prescribed duties to their husbands. It's also patronizing towards women.\n\n \n That's not what it said. At least be honest in your portrayal--it said nothing about women being \"mens little helpers.\" In fact, it goes on to say that men are to love their wives as Christ loved the church. Considering He lived and died for the church's behalf, I'd say that's pretty demanding of men, wouldn't you?\n \n The problem is that people like yourself, who like to automatically find fault in scriptures without reading between the lines automatically assume that the passage is some statement about the worth of women. It is not. It is a picture of servanthood with both the husband and the wife. \n \n It funny because most of the time the only people that don't understand this passage and think that it's about subjecting women to men are people who oppose Christians for anything they can--everyone I know that's Christian and lives this passage understands that's not what it's about. In fact they treat their wives BETTER than most people I know of who think of the passage the wrong way, so the joke's on you.", 
   {}, 
   245271, 
   null, 
   1167518280.0
  ], 
  [
   245308, 
   null, 
   "thinking_person", 
   "That's not what it said. At least be honest in your portrayal--it said nothing about women being \"mens little helpers.\" In fact, it goes on to say that men are to love their wives as Christ loved the church. Considering He lived and died for the church's behalf, I'd say that's pretty demanding of men, wouldn't you?\n \n The problem is that people like yourself, who like to automatically find fault in scriptures without reading between the lines automatically assume that the passage is some statement about the worth of women. It is not. It is a picture of servanthood with both the husband and the wife. \n \n It funny because most of the time the only people that don't understand this passage and think that it's about subjecting women to men are people who oppose Christians for anything they can--everyone I know that's Christian and lives this passage understands that's not what it's about. In fact they treat their wives BETTER than most people I know of who think of the passage the wrong way, so the joke's on you.\n\n \n Couldn't have said it better myself.\n \n The husband and wife role in the bible is no way demeaning to woman.\n \n When you consider what a \"helper\" is, would you say that the helper has is a lesser role in the big picture? If a contractor has his workers, and one of the workers needs a \"helper\", is the helper considered lower than the other worker?\n If you were doing a job, and you were given a helper, would you consider that person to be lower than you?\n \n The bible says that woman is a compliment of man, not his shadow/slave etc. If it weren't for woman, men would be very miserable, as God knew.", 
   {}, 
   245299, 
   null, 
   1167526500.0
  ], 
  [
   245315, 
   null, 
   "Phunting", 
   "I do wonder some times if people have even read the Bible. I don't see why you are fudging what it says and trying to twist it into C21st morality. At least be honest enough to admit it advocates the oppression of women. \n \n In the line \"I will greatly increase your pains in childbearing; with pain you will give birth to children. Your desire shall be for your husband, and he shall rule over you.\" (Genesis 3:16) You totally ignore the second part of the verse, just stating \"And the \"discovery\" that women are not clones of men... that women 'bear the children'-is that really new?\" Why do you ignore the part where it explicitly says the man rules over the woman?\n \n I'd like to add another quote to the list:\n \n \n22:28 If a man find a damsel that is a virgin, which is not betrothed, and lay hold on her, and lie with her, and they be found\n 22:29 Then the man that lay with her shall give unto the damsel's father fifty shekels of silver, and she shall be his wife; because he hath humbled her, he may not put her away all his days.\n\n \n How do you for instance justify rape and effective slavery? Still in no way demeaning to woman eh? \n \n The Bible is filled with such instances. It is nothing more than an excuse for men to oppress and bully women throughout the centuries...", 
   {
    "unicode_changes_made": true
   }, 
   245308, 
   null, 
   1167528900.0
  ], 
  [
   245316, 
   null, 
   "thinking_person", 
   "Just to reiterate on my last posts: I don't want to sound like a typical sexist male. I grew up with my sister being my \"role model\" and best friend. No-one (epsecially my fiancee) sees me as being sexist.\n \n My view of what the perfect role is this (based on the bible):\n \n When man and woman get married they become \"one flesh\". This is a two way system. Just about all relationships have a leader. A good leader is one who loves his wife and family and puts thier needs ahead of his own. He should earn his respect from his wife by his actions, and only by his behavir will he get respect from his wife. He should be like a \"rock\", someone to look up to. He should always concider the emotional needs of his wife, and the wife should always provide support for him.\n \n When it comes to making decisions it is a shared responsibilty. If the husband loves the wife then he does everything to please her and he listens, and vice versa. When it comes to important decisions like career matters for example, the wife has every right to choose what she wants to do as long as it's in harmony with the family (same applies to men also). The woman has every right to have a career...but more often than not this interferes with family life and should therefore be put on the \"back burner\". Although, if the woman is earning more than the man then they may decide that it's best if she became the \"breadwinner\"...provided the man can swallow his pride LOL; Humbleness in the bible is a virtue!\n \n In the end, if the husband does what is biblically required of him, then the wifes role becomes easy.", 
   {}, 
   245308, 
   null, 
   1167529860.0
  ], 
  [
   245319, 
   null, 
   "jyoshu", 
   "I do wonder some times if people have even read the Bible. I don't see why you are fudging what it says and trying to twist it into C21st morality. At least be honest enough to admit it advocates the oppression of women. \n \n In the line \"I will greatly increase your pains in childbearing; with pain you will give birth to children. Your desire shall be for your husband, and he shall rule over you.\" (Genesis 3:16) You totally ignore the second part of the verse, just stating \"And the \"discovery\" that women are not clones of men... that women 'bear the children'-is that really new?\" Why do you ignore the part where it explicitly says the man rules over the woman?\n\n \n I think this is another case where there is a stark difference between the old and new testaments. There are many such differences: in the OT they couldn't even eat pork. You are using an OT passage to condemn a NT way of thinking. So I do wonder if you've even read the Bible--otherwise you'd know the difference.\n \n \nI'd like to add another quote to the list:\n \"22:28 If a man find a damsel that is a virgin, which is not betrothed, and lay hold on her, and lie with her, and they be found\n 22:29 Then the man that lay with her shall give unto the damsel's father fifty shekels of silver, and she shall be his wife; because he hath humbled her, he may not put her away all his days.\"\n \n How do you for instance justify rape and effective slavery? Still in no way demeaning to woman eh? \n\n \n Yet again, this is a case where you're looking at this passage in 21st century eyes. it's not about rape and and effective slavery at all--in your rush to find fault with anything-Christian, you completely missed the lastpart of the verse: \"and shall not put her away.\" This passage is there to protect the women that this happens to.\n \n This whole thing reminds me of the Promise Keepers conventions a few years ago where liberal and feminist groups were up in arms thinking it was a bunch of men talking about making their wives obey or something. Funny how they got really quiet all of a sudden when they found out the conventions were actually about men loving and serving their wives, as the NT passage actually means. You never hear feminist groups even mention the Promise Keepers anymore.", 
   {
    "unicode_changes_made": true
   }, 
   245315, 
   null, 
   1167532200.0
  ], 
  [
   245330, 
   null, 
   "JakeCJB", 
   "That's not what it said. At least be honest in your portrayal--it said nothing about women being \"mens little helpers.\" In fact, it goes on to say that men are to love their wives as Christ loved the church. Considering He lived and died for the church's behalf, I'd say that's pretty demanding of men, wouldn't you?\n\n \n No, love is not demanding of men. It would be much more demanding to say men must be women's helpers.\n \n \nThe problem is that people like yourself, who like to automatically find fault in scriptures without reading between the lines automatically assume that the passage is some statement about the worth of women. It is not. It is a picture of servanthood with both the husband and the wife.\n\n \n It treats women as though they are unworthy of certain roles. Men are free to choose a greater variety of roles. Why are women to be submissive? Women can be the authority just as well as men. \n \n \nIt funny because most of the time the only people that don't understand this passage and think that it's about subjecting women to men are people who oppose Christians for anything they can--everyone I know that's Christian and lives this passage understands that's not what it's about. In fact they treat their wives BETTER than most people I know of who think of the passage the wrong way, so the joke's on you.\n\n \n What is it really about, then? No need for a punch line, I know plenty of Christian households where the women and men are equal.", 
   {}, 
   245299, 
   null, 
   1167536820.0
  ], 
  [
   245331, 
   null, 
   "Phunting", 
   "I think this is another case where there is a stark difference between the old and new testaments. There are many such differences: in the OT they couldn't even eat pork. You are using an OT passage to condemn a NT way of thinking. So I do wonder if you've even read the Bible--otherwise you'd know the difference.\nIndeed and:\n \n \nWe do not have to follow the \"Old Law Covenant\" from the OT, that's all we \"dismiss\". The OT isn't just full of the Law Covenant.\nIt seems that Christians have the handy clause of being able to dismiss anything they don't like as 'OT' and not applicable in the NT. And yet at the same time they get to keep anything in the OT they do like (such as excuse to oppress homosexuals) and say 'oh yeah we don't dismiss that bit, it's just the other bits we dismiss. \n \n Perhaps I am just being stupid, but I really don't see it. I have read the Bible, but I don't claim too in-depth knowledge. Where is it made clear which bits of the OT are irrelevant and which aren't? If, as I suspect, there is nothing and it's pretty much down to the individual's choice then you have no grounds to claim that my use of that OT passage isn't relevant to NT thinking.\n \n \nYet again, this is a case where you're looking at this passage in 21st century eyes. it's not about rape and and effective slavery at all--in your rush to find fault with anything-Christian, you completely missed the lastpart of the verse: \"and shall not put her away.\" This passage is there to protect the women that this happens to.\nHmm, and what does that mean exactly? I took it to mean that he can't divorce her afterwards. That's hardly protecting women. Even if it doesn't mean that, the passage still states if you rape an unattached woman you should pay her father and marry her. At no point are the woman's rights/ desires even considered. That is not respecting/ loving women...\n \n I assure you I do not have the desire to find fault with 'anything Christian', far from it. In fact I've defended you and Christianity on several occasions. I have no problem in Christianity itself, I just wish it could be honest about it's origins. The Bible is a book that condones horrific behaviour repeatedly. Christians who recognize that, who admit it is a product of it's time and written by fallible man, but still believe the underlying ethos is correct I can understand. It's those who try and twist it, try and justify it's atrocities and claim it isn't saying what it blatantly is that annoy me.\n \n Either renounce the specifics and support the theme, or embrace the lot and join the Klan. Just stop pretending it says something it blatantly doesn't.", 
   {
    "unicode_changes_made": true
   }, 
   245319, 
   null, 
   1167537000.0
  ], 
  [
   245332, 
   null, 
   "jyoshu", 
   "No, love is not demanding of men. It would be much more demanding to say men must be women's helpers.\n\n \n Any man who truly loves his wife certainly WOULD be demanding of himself for her sake.\n \n \nIt treats women as though they are unworthy of certain roles. Men are free to choose a greater variety of roles. Why are women to be submissive? Women can be the authority just as well as men.\n \n \n It's not a matter of unworthiness. People in Biblical times were a lot less intimidated and troubled by the idea of people assuming roles. And you are just flat out wrong about the submissiveness thing; the passage indicates submission on the part of both if you read it in it's entirety rather than just getting hung up on the women part. That's part of what love is--submitting to one another.\n \n \nWhat is it really about, then? No need for a punch line, I know plenty of Christian households where the women and men are equal.\n\n \n Of course you do, because that doesn't go against the passage. The passage is not about inequality to begin with. It's YOUR view of the passage thats wrong, rather than the views by Christian households you refer to.", 
   {}, 
   245330, 
   null, 
   1167537600.0
  ], 
  [
   245333, 
   null, 
   "jyoshu", 
   "It seems that Christians have the handy clause of being able to dismiss anything they don't like as 'OT' and not applicable in the NT. And yet at the same time they get to keep anything in the OT they do like . . . \n\n \n Yes, that's the come-to-be-expected stock answer people sometimes give when the differences are pointed out. But whether you agree or not, the differences are there. \n \n \nPerhaps I am just being stupid, but I really don't see it. I have read the Bible, but I don't claim too in-depth knowledge. Where is it made clear which bits of the OT are irrelevant and which aren't? If, as I suspect, there is nothing and it's pretty much down to the individual's choice then you have no grounds to claim that my use of that OT passage isn't relevant to NT thinking.\n\n \n It's not up to \"individual choice\", but rather it comes down to Jesus' command of loving God and loving people as the two greatest commandments. It is more loving toward other people to not mistreat and subject women to men, so that's not a Christian thing to do. It's why adulterers aren't stoned, and it's one reason why we don't require people to not eat pork when they want it.\n \n \nHmm, and what does that mean exactly? I took it to mean that he can't divorce her afterwards. That's hardly protecting women.\n\n \n It most certainly IS protecting women in the patriarchal society that it was where women had NO protections beforehand, and where the divorcing husband could take everything she had and then make her lose the livlihood and protection of a husband in that society. That's what you don't seem to get here--you're using a passage that was GIVING women rights and protections to exemplify taking them away!\n \n \nEven if it doesn't mean that, the passage still states if you rape an unattached woman you should pay her father and marry her. At no point are the woman's rights/ desires even considered. That is not respecting/ loving women...\n\n \n Goodness! You really need to read these passages in the culture they were written! Do you not realize that the passage is essentially forcing the rapist to provide lifelong financial support to the women raped when no other man would have her after that?\n \n \nI assure you I do not have the desire to find fault with 'anything Christian', far from it. In fact I've defended you and Christianity on several occasions. I have no problem in Christianity itself, I just wish it could be honest about it's origins. The Bible is a book that condones horrific behaviour repeatedly. Christians who recognize that, who admit it is a product of it's time and written by fallible man, but still believe the underlying ethos is correct I can understand. It's those who try and twist it, try and justify it's atrocities and claim it isn't saying what it blatantly is that annoy me.\n\n \n I can agree that its underlying ethos is the important that, but not that it condones horrific behaviors repeatedly; I think an honest reading of the Bible wholistically shows quite the opposite. But I apologize for indicating you were out to find fault with anything-Christian. I just get sensitive about this because so many people here tend to not treat Christianity fairly, IMO.", 
   {
    "unicode_changes_made": true
   }, 
   245331, 
   null, 
   1167538440.0
  ], 
  [
   245334, 
   null, 
   "robbie0517", 
   "Any man who truly loves his wife certainly WOULD be demanding of himself for her sake.\n \n \n \n It's not a matter of unworthiness. People in Biblical times were a lot less intimidated and troubled by the idea of people assuming roles..\n\n \n People in Biblical times were like this or that. Are you saying that as time goes things evolve? Even things the Bible says? Wonder why we can explain why many things in the Bible are different today, but same sex relations can't evolve one bit from the Bible. \n Anti-Gay hate mongers first, Bible cherry pickers second. \n \n Also, after reading much of this thread, could Jesus not write for himself?", 
   {}, 
   245332, 
   null, 
   1167538560.0
  ], 
  [
   245337, 
   null, 
   "Phunting", 
   "It's not up to \"individual choice\", but rather it comes down to Jesus' command of loving God and loving people as the two greatest commandments. It is more loving toward other people to not mistreat and subject women to men, so that's not a Christian thing to do. It's why adulterers aren't stoned, and it's one reason why we don't require people to not eat pork when they want it.\nFine. Apart from the whole homosexuality thing. But that's not really an answer now is it? \n \n If it's not up to individual's choice where is it explicitly spelt out which bits are no longer relevant? Why is it correct to leave in the OT Leviticus aspects but dissmiss the OT Deuteronomy? Both are about the rights of individuals? Where is the distinction?", 
   {}, 
   245333, 
   null, 
   1167538800.0
  ], 
  [
   245338, 
   null, 
   "jyoshu", 
   "People in Biblical times were like this or that. Are you saying that as time goes things evolve? Even things the Bible says? Wonder why we can explain why many things in the Bible are different today, but same sex relations can't evolve one bit from the Bible. \n\n \n I don't know of anyone who has \"evolved\" into wanting homosexual relations since Biblical times. Do you? The issue of homosexual relations (which is an issue of a sexual behavior) is much different than something like the evolving roles of women in culture and society!\n \n \nAlso, after reading much of this thread, could Jesus not write for himself?\n\n \n Good question; how about you also ask those who claim Jesus would be in favor of same-sex marriage ...", 
   {}, 
   245334, 
   null, 
   1167538920.0
  ], 
  [
   245339, 
   null, 
   "jyoshu", 
   "Fine. Apart from the whole homosexuality thing. But that's not really an answer now is it? \n\n \n \"Apart from the whole homosexuality thing\"? Homosexuals are no longer stoned either (in Christian societies). In fact the behavior has basically no legal consequences anymore. How the heck is that not change?\n \n \nIf it's not up to individual's choice where is it explicitly spelt out which bits are no longer relevant? Why is it correct to leave in the OT Leviticus aspects but dissmiss the OT Deuteronomy? Both are about the rights of individuals? Where is the distinction?\n\n \n Could you be more specific in what passages you're talking about?", 
   {}, 
   245337, 
   null, 
   1167539100.0
  ], 
  [
   245343, 
   null, 
   "JakeCJB", 
   "Any man who truly loves his wife certainly WOULD be demanding of himself for her sake.\n\n \n You are dodging the issue. Why are women the helpers to men, but men not helpers to women? It's quite different to say love and to submit yourself as a helper. \n \n \nIt's not a matter of unworthiness. People in Biblical times were a lot less intimidated and troubled by the idea of people assuming roles.\n\n \n Another dodge. That was people then. People today clearly do not desire to limit women's roles. Thank Goddess. When women were deemed unfit for esteemed leadership or authority roles over the males, because they were women, the women were being told they were less than in this society. To suggest they were not being told they were unworthy or less than men is naieve.\n \n \nAnd you are just flat out wrong about the submissiveness thing; the passage indicates submission on the part of both if you read it in it's entirety rather than just getting hung up on the women part. That's part of what love is--submitting to one another.\n\n \n Where does it say men and women are to be equally submissive to one another? Where does it say men are to submit to women?\n \n \nOf course you do, because that doesn't go against the passage. The passage is not about inequality to begin with. It's YOUR view of the passage thats wrong, rather than the views by Christian households you refer to.\n\n \n No. Those households have the modern interpretation.", 
   {}, 
   245332, 
   null, 
   1167542940.0
  ], 
  [
   245347, 
   null, 
   "JakeCJB", 
   "I don't know of anyone who has \"evolved\" into wanting homosexual relations since Biblical times. Do you? The issue of homosexual relations (which is an issue of a sexual behavior) is much different than something like the evolving roles of women in culture and society!\n\n \n As though the issue of homosexuality is that limited, I think not. Some of the same themes are involved, such as expected or prescribed gender roles within a patriarchal system.", 
   {}, 
   245338, 
   null, 
   1167543720.0
  ], 
  [
   245364, 
   null, 
   "Phunting", 
   "\"Apart from the whole homosexuality thing\"? Homosexuals are no longer stoned either (in Christian societies). In fact the behavior has basically no legal consequences anymore. How the heck is that not change?\nIndeed, I don't deny that. But you state:\n \n \nIt is more loving toward other people to not mistreat and subject women to men.\nYet there are many who advocate mistreating homosexuals and subjecting them to oppressive laws.\n \n \n \nCould you be more specific in what passages you're talking about?\nOk, sure. In fact I'll keep things simple and take two extracts from the Bible using almost the same language from the same book:\n \n \n11:10 And all that have not fins and scales in the seas, and in the rivers, of all that move in the waters, and of any living thing which is in the waters, they shall be an abomination unto you: \n 11:11 They shall be even an abomination unto you; ye shall not eat of their flesh, but ye shall have their carcases in abomination. \n \n 18:22 Thou shalt not lie with mankind, as with womankind: it is abomination.\nSo on the one hand we are told that eating oyster or lobster is an abomination. Something that I think most Christians would dismiss. Then just a few chapters later it is stated that homosexuality is an abomination, a line that is quoted countless times to 'prove' God's dislike of them. So why can the one be dismissed and not the other?", 
   {}, 
   245339, 
   null, 
   1167575760.0
  ], 
  [
   245365, 
   null, 
   "thinking_person", 
   "In answer to question of which parts of the Old Testament do we accept:\n \n The New Testament does indicate that the Law covenant, a contract God made with ancient Israel, is obsolete and hence not binding on Christians. \n \n Hebrews 8:13 - In his saying \"a new [covenant]\" he has made the former one obsolete. Now that which is made obsolete and growing old is near to vanishing away.\n \n This Law covenant is included in the Old Testament. But there is much more to the Old Testament than the Law covenant.\n \n But can the difference between the Old Testament and the New Testament be reconciled? Let me illustrate: A father may discipline his two sons differently because each child has a distinct personality (Israeal & C.E. Christians). Similarly, the tone of Jehovah's counsel in the Old Testament to Israel, a nation of people dedicated to him by birth, would differ from the tone of the counsel found in the New Testament to the Christian congregation, a group of people devoted to him by choice.\n \n A close examination of the Bible shows that these two sections are not contradictory, but, rather, they complement each other. Both parts are needed for 'the man of God to be fully competent.'-2#Timothy 3:16,#17.\n \n For example, does the Old Testament actually allow for the taking of personal vengeance whereas the New Testament condemns this? Not at all. Both recommend love of one's enemies, pointing out that vengeance is reserved for God. (Compare Deuteronomy 32:35,#41 and Proverbs 25:21,#22 with Romans 12:17-21.) In fact, when the Old Testament speaks of 'eye for eye and tooth for tooth,' it is not discussing personal retaliation but, rather, fair compensation as imposed by a duly authorized court of law.-Exodus 21:1, 22-25.\n \n We can look at the Old Testament (even the old law) to see what God is like.", 
   {
    "unicode_changes_made": true
   }, 
   245364, 
   null, 
   1167580080.0
  ], 
  [
   245368, 
   null, 
   "thinking_person", 
   "As regards the gay issue, yes it is condemned in the Old Law (\"You must not lie down with a male the same as you lie down with a woman. It is a detestable thing.\" - Lev. 18:22) of which Christians no longer need to follow, however, it is also mentioned in the New Testament (New Law):\n \n \"What! Do YOU not know that unrighteous persons will not inherit God's kingdom? Do not be misled. Neither fornicators, nor idolaters, nor adulterers, nor men kept for unnatural purposes, nor men who lie with men, nor thieves, nor greedy persons, nor drunkards, nor revilers, nor extortioners will inherit God's kingdom.\" - 1#Cor. 6:9, 10\n \n \"Therefore God, in keeping with the desires of their hearts, gave them up to uncleanness, that their bodies might be dishonored among them, even those who exchanged the truth of God for the lie and venerated and rendered sacred service to the creation rather than the One who created, who is blessed forever. Amen. That is why God gave them up to disgraceful sexual appetites, for both their females changed the natural use of themselves into one contrary to nature;#and likewise even the males left the natural use of the female and became violently inflamed in their lust toward one another, males with males, working what is obscene and receiving in themselves the full recompense, which was due for their error.\" - Romans 1:24-27\n \n \n As we have seen from the last scripture quoted here, there are people today (e.g. gay preists) who claim to serve God but are actually insulting him;\n \n \"...gave them up to uncleanness, that their bodies might be dishonored among them, even those who exchanged the truth of God for the lie...\"\n \n Although it does sound like I am judging here, I'm not, I'm simply trying to put the truth in the bible across since it has been distorted by many. Here's some more interesting scriptures from the book of Romans (Romans 2:3-16):\n \n \"But do you have this idea, O man, while you judge those who practice such things and yet you do them, that you will escape the judgment of God? Or do you despise the riches of his kindness and forbearance and long-suffering, because you do not know that the kindly [quality] of God is trying to lead you to repentance? But according to your hardness and unrepentant heart you are storing up wrath for yourself on the day of wrath and of the revealing of God's righteous judgment.#And he will render to each one according to his works: everlasting life to those who are seeking glory and honor and incorruptibleness by endurance in work that is good; however, for those who are contentious and who disobey the truth but obey unrighteousness there will be wrath and anger, tribulation and distress, upon the soul of every man who works what is injurious, of the Jew first and also of the Greek; but glory and honor and peace for everyone who works what is good, for the Jew first and also for the Greek. For there is no partiality with God.\n \n For instance, all those who sinned without law will also perish without law; but all those who sinned under law will be judged by law. For the hearers of law are not the ones righteous before God, but the doers of law will be declared righteous. For whenever people of the nations that do not have law do by nature the things of the law, these people, although not having law, are a law to themselves. They are the very ones who demonstrate the matter of the law to be written in their hearts, while their conscience is bearing witness with them and, between their own thoughts, they are being accused or even excused. This will be in the day when God through Christ Jesus judges the secret things of mankind, according to the good news I declare.\"\n \n \n Here again we have the example of people preaching (e.g. Preists) but actually doing the opposite;\n \n \"But do you have this idea, O man, while you judge those who practice such things and yet you do them, that you will escape the judgment of God?\"\n \n \n We also see that God is trying to lead people to change, but many stubornly refuse to and even turn their back on God;\n \n \"...Or do you despise the riches of his kindness and forbearance and long-suffering, because you do not know that the kindly [quality] of God is trying to lead you to repentance? But according to your hardness and unrepentant heart you are storing up wrath for yourself on the day of wrath and of the revealing of God's righteous judgment.\"\n \n Also, the people that know the law (e.g. Christians) are going to be severely judged as to righteousness, compared to those who do not know the law:\n \n \n \"...all those who sinned under law will be judged by law.\"\n \n The last part of my quoted scripture reminds me of the world as it is today, people blindly debating on everything without any kind of guidance (biblical law):\n \n \"...these people, although not having law, are a law to themselves. They are the very ones who demonstrate the matter of the law to be written in their hearts, while their conscience is bearing witness with them and, between their own thoughts, they are being accused or even excused.", 
   {
    "unicode_changes_made": true
   }, 
   245365, 
   null, 
   1167582660.0
  ], 
  [
   245376, 
   null, 
   "Phunting", 
   "Goodness! You really need to read these passages in the culture they were written!\nOh I do! And that's really my point: that the Bible is a product of a far less enlightened period. In the end the points I've brought up are not really to berate Christianity, but show that it contains some pretty unsavory stuff due to the culture it was written in. Therefore one must acknowledge that aspects of it are just incompatible with C21st life, such as it's stance on homosexuality. Why are people happy to dismiss it's casual regard of rape as a product of the time but not it's regard for homosexuality?\n \n \n \nI can agree that its underlying ethos is the important that, but not that it condones horrific behaviors repeatedly; I think an honest reading of the Bible wholistically shows quite the opposite.\nWell, your opinion. I disagree. Personally I don't find the Bible to contain holistically anything. It contains some very good, enlightened elements but also some deeply disturbing ones.\n \n \nBut I apologize for indicating you were out to find fault with anything-Christian. I just get sensitive about this because so many people here tend to not treat Christianity fairly, IMO.\nNo worries, and I agree with you. As much as I have large problems with much of what Christianity has to say, I do agree that it is often treated unfairly here...", 
   {}, 
   245333, 
   null, 
   1167589440.0
  ], 
  [
   245390, 
   null, 
   "JakeCJB", 
   "As regards the gay issue, yes it is condemned in the Old Law (\"You must not lie down with a male the same as you lie down with a woman. It is a detestable thing.\" - Lev. 18:22) of which Christians no longer need to follow, however, it is also mentioned in the New Testament (New Law):\n \n \"What! Do YOU not know that unrighteous persons will not inherit God's kingdom? Do not be misled. Neither fornicators, nor idolaters, nor adulterers, nor men kept for unnatural purposes, nor men who lie with men, nor thieves, nor greedy persons, nor drunkards, nor revilers, nor extortioners will inherit God's kingdom.\" - 1#Cor. 6:9, 10\n\n \n This was referring to adolescent male prostitutes.\n \n \n\"Therefore God, in keeping with the desires of their hearts, gave them up to uncleanness, that their bodies might be dishonored among them, even those who exchanged the truth of God for the lie and venerated and rendered sacred service to the creation rather than the One who created, who is blessed forever. Amen. That is why God gave them up to disgraceful sexual appetites, for both their females changed the natural use of themselves into one contrary to nature;#and likewise even the males left the natural use of the female and became violently inflamed in their lust toward one another, males with males, working what is obscene and receiving in themselves the full recompense, which was due for their error.\" - Romans 1:24-27\n\n \n These were heterosexuals who went against their personal natures. Those of us who are gay, do not go against our nature when we are gay. \n \n \nAs we have seen from the last scripture quoted here, there are people today (e.g. gay preists) who claim to serve God but are actually insulting him;\n\n \n Why should gays want anything to do with a God who thinks it is an insult to that God to be gay?\n \n \n\"But do you have this idea, O man, while you judge those who practice such things and yet you do them, that you will escape the judgment of God? Or do you despise the riches of his kindness and forbearance and long-suffering, because you do not know that the kindly [quality] of God is trying to lead you to repentance? But according to your hardness and unrepentant heart you are storing up wrath for yourself on the day of wrath and of the revealing of God's righteous judgment.#And he will render to each one according to his works: everlasting life to those who are seeking glory and honor and incorruptibleness by endurance in work that is good; however, for those who are contentious and who disobey the truth but obey unrighteousness there will be wrath and anger, tribulation and distress, upon the soul of every man who works what is injurious, of the Jew first and also of the Greek; but glory and honor and peace for everyone who works what is good, for the Jew first and also for the Greek. For there is no partiality with God.\n \n For instance, all those who sinned without law will also perish without law; but all those who sinned under law will be judged by law. For the hearers of law are not the ones righteous before God, but the doers of law will be declared righteous. For whenever people of the nations that do not have law do by nature the things of the law, these people, although not having law, are a law to themselves. They are the very ones who demonstrate the matter of the law to be written in their hearts, while their conscience is bearing witness with them and, between their own thoughts, they are being accused or even excused. This will be in the day when God through Christ Jesus judges the secret things of mankind, according to the good news I declare.\"\n \n \n Here again we have the example of people preaching (e.g. Preists) but actually doing the opposite;\n \n \"But do you have this idea, O man, while you judge those who practice such things and yet you do them, that you will escape the judgment of God?\"\n \n \n We also see that God is trying to lead people to change, but many stubornly refuse to and even turn their back on God;\n \n \"...Or do you despise the riches of his kindness and forbearance and long-suffering, because you do not know that the kindly [quality] of God is trying to lead you to repentance? But according to your hardness and unrepentant heart you are storing up wrath for yourself on the day of wrath and of the revealing of God's righteous judgment.\"\n \n Also, the people that know the law (e.g. Christians) are going to be severely judged as to righteousness, compared to those who do not know the law:\n \n \n \"...all those who sinned under law will be judged by law.\"\n \n The last part of my quoted scripture reminds me of the world as it is today, people blindly debating on everything without any kind of guidance (biblical law):\n \n \"...these people, although not having law, are a law to themselves. They are the very ones who demonstrate the matter of the law to be written in their hearts, while their conscience is bearing witness with them and, between their own thoughts, they are being accused or even excused.\n\n \n The message here is to put on blinders and obey the master without any thought to one's own happiness. Keep your religion, and your eternal kingdom. I reject it completely. No thank you.", 
   {
    "unicode_changes_made": true
   }, 
   245368, 
   null, 
   1167607200.0
  ], 
  [
   245431, 
   null, 
   "robbie0517", 
   "I don't know of anyone who has \"evolved\" into wanting homosexual relations since Biblical times. Do you? The issue of homosexual relations (which is an issue of a sexual behavior) is much different than something like the evolving roles of women in culture and society!\n\n \n So you and/or others just simply put weight on one concept in the bible over another. How convienient. Sure helps to support anyones negative views of homosexuals. Any thinking person can surely see that the homosexuality issue hasn't been discarded or evolved due to overwhelming bias towards homosexuals. No problems with hatless ladies in church these days afterall.", 
   {}, 
   245338, 
   null, 
   1167684180.0
  ], 
  [
   245443, 
   null, 
   "jyoshu", 
   "So you and/or others just simply put weight on one concept in the bible over another. How convienient. Sure helps to support anyones negative views of homosexuals. Any thinking person can surely see that the homosexuality issue hasn't been discarded or evolved due to overwhelming bias towards homosexuals. No problems with hatless ladies in church these days afterall.\n\n \n Lots of churches still have their women wearing hats. \n \n I love the way an issue so benign as wearing hats is compared to sexual behavior, of which brings about a higher percentage of HIV cases than any other group.", 
   {}, 
   245431, 
   null, 
   1167690960.0
  ], 
  [
   245444, 
   null, 
   "JakeCJB", 
   "Lots of churches still have their women wearing hats. \n \n I love the way an issue so benign as wearing hats is compared to sexual behavior, of which brings about a higher percentage of HIV cases than any other group.\n\n \n Yes, sexual behaviour does bring about a great percentage of HIV cases. Oh, I think you meant to say gay sexual behaviour, which encompasses a wide range of sexual behaviours also done by straights, causes more HIV. You don't like gay behaviour, however clearly are ok with telling lies.\n \n And I'm sorry, but what does HIV have to do with the issue? Are you suggesting people who get this disease or any other disease, are bad people to whom society should give fewer rights and less acceptance? Is it just the gays with HIV who should be looked upon with suspicion?", 
   {}, 
   245443, 
   null, 
   1167691380.0
  ], 
  [
   245446, 
   null, 
   "jyoshu", 
   "Yes, sexual behaviour does bring about a great percentage of HIV cases. Oh, I think you meant to say gay sexual behaviour, xwhich encompasses a wide range of sexual behaviours also done by straights, causes more HIV. You don't like gay behaviour, however clearly are ok with telling lies.\n\n \n As you well know, I was referring to a given sexual behavior here--homosexual relations. THAT'S the one that brings about the highest percentage of HIV cases in it's exposure group (men who have sex with men). It's not a lie at all--you should view the statistics sometime.\n \n \nAnd I'm sorry, but what does HIV have to do with the issue?\n\n \n I guess the concept of harm as a criteria for opposing a given behavior is lost on you.", 
   {}, 
   245444, 
   null, 
   1167691980.0
  ], 
  [
   245448, 
   null, 
   "JakeCJB", 
   "As you well know, I was referring to a given sexual behavior here--homosexual relations. THAT'S the one that brings about the highest percentage of HIV cases in it's exposure group (men who have sex with men). It's not a lie at all--you should view the statistics sometime.\n\n \n It is dependent on many variables as you know. Men who have sex with men are not necessarily gay either. MSM are the highest group in some countries. In others, the ones with the highest percentages, it is spread mostly through heterosexual relations.\n \n \nI guess the concept of harm as a criteria for opposing a given behavior is lost on you.\n\n \n By that logic one should oppose heterosexual behaviour in Sub-saharan Africa. One should oppose heterosexual behaviour in the town where I live(mostly hetero cases). People should have more homosexual relations and less heterosexual relations in these areas. What a nonsense criteria for opposing certain behaviours, as the statistics change from place to place, and involve other variables. This is a such a weak pathetic argument. It's just anti-gay propaganda. People are not going to stop having sex because of disease. Both sex and disease are a part of life and always have been.", 
   {}, 
   245446, 
   null, 
   1167692700.0
  ], 
  [
   245450, 
   null, 
   "gaetano", 
   "Lots of churches still have their women wearing hats. \n \n I love the way an issue so benign as wearing hats is compared to sexual behavior, of which brings about a higher percentage of HIV cases than any other group.\n\n \n \n \n \n \n \n Gaetano:\n HIV has nothing to do with biblical taboos on homosexuality. In fact no reason is given at all, except that god doesn't approve. That doesn't amount to much in the real world. That's a reason only if you believe. Sin is sin as we are constantly reminded by the members of your movement. Why are you trying to put sexual behavior over being just plain obnocious and arrogant. And hIV is transferred through blood to semen contact, which can occur during anal sex. Homosexuals do not automatically engage in anal sex, despite what you may have heard. Lesbians have the lowest rate of STD's of any group. If disease enters into your arguement, perhaps you should be encouraging lesbian behavior.", 
   {}, 
   245443, 
   null, 
   1167695940.0
  ], 
  [
   245455, 
   null, 
   "ShadowPikachu", 
   "I think you mean \"terracentric,\" but you're quite right. Only recently did the church apologize for it's persecution of Galileo. If they admitted it, I kinda think it really happened.\n\n \n LOL! Yeah that's what I meant, I was in a hurry and got the words mixed.", 
   {}, 
   244775, 
   null, 
   1167703680.0
  ], 
  [
   245462, 
   null, 
   "jyoshu", 
   "It is dependent on many variables as you know. Men who have sex with men are not necessarily gay either. MSM are the highest group in some countries. In others, the ones with the highest percentages, it is spread mostly through heterosexual relations.\n\n \n Oh please. Men having sex with men though they aren't gay? Are you out of your mind? If that happens, it's so rare that it's insignificant for the sake of this discussion. And we're talking about the U.S. here, not other countries.\n \n \nBy that logic one should oppose heterosexual behaviour in Sub-saharan Africa. \n\n \n I certainly WOULD oppose heterosexual behavior in places where HIV was out of control among the heterosexual populace!\n \n \nThis is a such a weak pathetic argument. It's just anti-gay propaganda. People are not going to stop having sex because of disease. Both sex and disease are a part of life and always have been.\n\n \n Saying \"it's going to happen anyway\" is a cop out, and shows an unwillingness on your part to face a deadly problem. Well, then it will continue to be a major life-threatening problem in the gay male population. You don't want HIV and you're gay? Don't sleep around with a bunch of partners having gay sex. It's not rocket science. Oh, and actually admitting the problem in the gay population would be a good start as well.", 
   {}, 
   245448, 
   null, 
   1167706200.0
  ], 
  [
   245463, 
   null, 
   "ShadowPikachu", 
   "These scriptures are either advice for peaceful family unity and some are descriptions of what the imperfection of mankind has lead to. \n\n \n Are you seriously suggesting that these scriptures are advice for peaceful family unity? Did you even read them? I don't think that stoning a woman to death if she is not a virgin, telling women to submit to their husbands and be submissive in church and not speak, is in any way \"peaceful\".", 
   {}, 
   245246, 
   null, 
   1167707160.0
  ], 
  [
   245469, 
   null, 
   "ShadowPikachu", 
   "Oh please. Men having sex with men though they aren't gay? Are you out of your mind? If that happens, it's so rare that it's insignificant for the sake of this discussion. And we're talking about the U.S. here, not other countries.\n \n \n \n I certainly WOULD oppose heterosexual behavior in places where HIV was out of control among the heterosexual populace!\n \n \n \n Saying \"it's going to happen anyway\" is a cop out, and shows an unwillingness on your part to face a deadly problem. Well, then it will continue to be a major life-threatening problem in the gay male population. You don't want HIV and you're gay? Don't sleep around with a bunch of partners having gay sex. It's not rocket science. Oh, and actually admitting the problem in the gay population would be a good start as well.\n\n \n Hm, apparently you have never heard of this thing called bisexuality. That would be this case that you claim does not exist: the male is not gay, as he has attractions to both men AND women.\n \n I also don't see where we are talking about just the US. The title and first post of the thread certainly do not make it just a discussion about the US, and from what I have read, it is only you that is imposing this restriction now that Africa has been brought up.\n \n As was said before by others, by your criteria, heterosexual activities should not be accepted, because they are the leading carriers of HIV in the world. All of this is besides the fact that you ignore which is that lesbians have the lowest HIV/AIDS (I think most other STDs as well) rate out of anyone, so I guess we should just all become lesbians. emoticon_rolleyes", 
   {}, 
   245462, 
   null, 
   1167711240.0
  ], 
  [
   245489, 
   null, 
   "JakeCJB", 
   "Oh please. Men having sex with men though they aren't gay? Are you out of your mind? If that happens, it's so rare that it's insignificant for the sake of this discussion.\n\n \n Certainly there are many men who do not identify as gay, and who merely see themselves as having sex with a man. However, for the purpose of this discussion, it would indeed probably be best to say an MSM is homosexual or gay activity. WSW is also gay activity, and it has the lowest statistics. \n \n \nAnd we're talking about the U.S. here, not other countries.\n\n \n HIV did not originate in the U.S., and it is everywhere. It knows no international borderlines. Therefore, I don't see the purpose of limiting the discussion to the U.S.\n \n \nI certainly WOULD oppose heterosexual behavior in places where HIV was out of control among the heterosexual populace!\n\n \n It's a very unrealistic expectation, as it would be among the gay population in the U.S. Not everyone is opposed to having a happy healthy sex life. Long-term repression also has its problems. We are discussing individuals here, and it cannot be assumed the person is engaging in high risk activities because he or she belongs to the group with the highest statistical numbers. \n \n \nSaying \"it's going to happen anyway\" is a cop out, and shows an unwillingness on your part to face a deadly problem. Well, then it will continue to be a major life-threatening problem in the gay male population. You don't want HIV and you're gay? Don't sleep around with a bunch of partners having gay sex. It's not rocket science. Oh, and actually admitting the problem in the gay population would be a good start as well.\n\n \n It's a fact of life that this virus happened. Naturally it spread before anyone knew what it was or preventive measures. The virus is a natural living thing trying to survive. It does not care if you are gay or straight, or how gay or straight your sexual activities are.\n \n Your advice of not sleeping around with a lot of partners, or sticking with one partner, is good advice. These are choices to reduce one's risk. There are others like using a condom for penetrative and oral sex. Abstaining from sex, if you belong to the group of persons with the highest statistics is not the only option.\n \n I don't like being prejudged as to my sexual activities and regarding what risks I may or may not be taking and which disease I may or may not have, simply because I identify as a gay man who does gay things. Yes, there is a problem in the gay community as a whole with HIV in the U.S. and other places. It may not be because gay men are less responsible than straights. Gay men mostly have sex with other gay men. It had to start in one community or the other. More can always be done. Don't act as though you care so much about the gay community, when you want to prejudge and exclude us, or have totally unrealistic expectations(abstinance for all gays in the U.S.) How are you helping us to stop HIV?", 
   {}, 
   245462, 
   null, 
   1167725280.0
  ], 
  [
   245552, 
   null, 
   "Phunting", 
   "I love the way an issue so benign as wearing hats is compared to sexual behavior, of which brings about a higher percentage of HIV cases than any other group.\nWhat!? \n \n Sir, I find it disgraceful that an issue that affects such a small proportion of the population as HIV should be compared to as fundamental a flaw in today's society as hat wearing. The lack of proper headgear in today's society strikes at the very heart of what this country is based on. Not only is it bad enough that they abolished the requirement for top hats to be worn in the Commons, but I wind myself and my trilby in the minority walking through the once great streets of London. Jyoshu, I find your post emblematic of the problem we face; proper headgear is not a matter of frivolity but intrinsic to life in any self-respecting society.\n \n \n http://www.thechap.net/protests.html", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   245443, 
   null, 
   1167772380.0
  ], 
  [
   245556, 
   null, 
   "thinking_person", 
   "I think I shall stop with the posts on this thread now, I'm not giving up or anything, but it's silly. The gay community are welcome to their lifestyle, and it's not up to us to judge. I was simply conveying what the bible says and some people have to find fault. I understand the message being frustrating to gays, but so are most other \"rules\" in the law of the bible to the majority of the nation (e.g. sex before marriage, not getting drunk etc)...much \"rules\" of which people think are impossible to follow...but that's what separates the true Christians from the fake. \n \n Much of the bible is about going against our imperfect \"fleshly desires\" to prove our loyalty to God; if a person finds himself doing something that to him seems un-resistible, and yet is sinning, he should try to fight his desires. The apostle Paul had issues with his fleshly desires: When he wished to do what is right and in harmony with God's good law, he did not find the ability to do it perfectly and all the time. The sin that dwelt in his flesh took over control and prevented him from carrying out his wish. In heart and mind he was in harmony with God's law, so that with his mind he was a slave of God's law. But his flesh did not always agree with his mind, and he therefore had to fight against serving sin's law within his flesh. \n \n Paul fought his flesh and did his best according to the law. If the apostle Paul, who was a really strong Christian, had to plummet his body and do what his mind wanted (rather than his heart) with great difficulty, how much more so do we \"normal humans\" have to do so? We have to deaden our body parts too.\n \n \n Here's what the apostle Paul had to say:\n \n \n Col. 3:5, 6 - Deaden, therefore, YOUR body members that are upon the earth as respects fornication, uncleanness, sexual appetite, hurtful desire, and covetousness, which is idolatry. On account of those things the wrath of God is coming.\n \n Romans 7:21-25 - I find, then, this law in my case: that when I wish to do what is right, what is bad is present with me. I really delight in the law of God according to the man I am within, but I behold in my members another law warring against the law of my mind and leading me captive to sin's law that is in my members. Miserable man that I am! Who will rescue me from the body undergoing this death? Thanks to God through Jesus Christ our Lord! So, then, with [my] mind I myself am a slave to God's law, but with [my] flesh to sin's law.\n \n 1 Corinthians 9:27 - ...I pummel my body and lead it as a slave, that, after I have preached to others, I myself should not become disapproved somehow.\n \n \n Who knows what inspired Paul to say the above??? All we know however is that he too had sinful desires that he had to suppress.", 
   {
    "unicode_changes_made": true
   }, 
   245552, 
   null, 
   1167776760.0
  ], 
  [
   245557, 
   null, 
   "jyoshu", 
   "What!? \n \n Sir, I find it disgraceful that an issue that affects such a small proportion of the population as HIV should be compared to as fundamental a flaw in today's society as hat wearing.\n\n \n Huh?? I didn't say anything about a \"fundamental flaw.\" I'm talking about behavior.\n \n And when did HIV become a matter that effects such a \"small proportion\"? Does it really matter how small? 1 is too many.\n \n Funny site though. I liked it.\n \n \nIt's a very unrealistic expectation, as it would be among the gay population in the U.S. Not everyone is opposed to having a happy healthy sex life. Long-term repression also has its problems. We are discussing individuals here, and it cannot be assumed the person is engaging in high risk activities because he or she belongs to the group with the highest statistical numbers.\n\n \n If a group of teenagers plays in the street regularly, and every now and then one gets hit by a car, do you only suggest stop-gap preventive measures like reflective clothing or keeping a look out for cars? No ... you tell them to stop playing in the street, for cryin' out loud. Why the heck should we not promote a departure from promiscuity when safe-sex education among gay men doesn't seem to be working too well?\n \n \nYes, there is a problem in the gay community as a whole with HIV in the U.S. and other places. It may not be because gay men are less responsible than straights. \n\n \n Oh I think there certainly are other reasons--one being that the type of sexual activity that men do (more so that opposite couples for certain) lends itself more to problems. The human body just didn't evolve to have sex in that way--it's a departure from the way we've biologically evolved to do it.", 
   {}, 
   245552, 
   null, 
   1167777000.0
  ], 
  [
   245615, 
   null, 
   "JakeCJB", 
   "If a group of teenagers plays in the street regularly, and every now and then one gets hit by a car, do you only suggest stop-gap preventive measures like reflective clothing or keeping a look out for cars? No ... you tell them to stop playing in the street, for cryin' out loud. Why the heck should we not promote a departure from promiscuity when safe-sex education among gay men doesn't seem to be working too well?\n\n \n It may be working well, but it is not perfect. Numbers of new infections decreased dramatically in the 1990s when safer-sex was promoted. How do you know being against promosicuity will work any better? Marriage would seem to do that anyway, but you are against that for gay men.\n \n \nOh I think there certainly are other reasons--one being that the type of sexual activity that men do (more so that opposite couples for certain) lends itself more to problems. The human body just didn't evolve to have sex in that way--it's a departure from the way we've biologically evolved to do it.\n\n \n \n Lol, who says we are not evolved to do it that way? The anus, the mouth, the penis, the hands, all our body parts, humans have discovered have multiple functions. The anus is a sex organ. It is extremely rich in sensitive nerve endings, and gives access to the prostate gland on the male. Having the prostate stimulated is sexually pleasurable for many men. Oral sex, or better yet handjobs seem to lend themselves to the least problems. Your point is? We are not evolved to practice any type of birth control or disease prevention. Women's bodies evolved to have as many different offspring by as many different men as possible, without marriage or monogamy, without kids necessarily knowing whom their biological father was. Hetero men are designed to be have sex with women at all times.", 
   {}, 
   245557, 
   null, 
   1167792420.0
  ], 
  [
   245780, 
   null, 
   "thelmoose", 
   "Oh please. Men having sex with men though they aren't gay? Are you out of your mind? If that happens, it's so rare that it's insignificant for the sake of this discussion. And we're talking about the U.S. here, not other countries.\n\n \n Discordance between Sexual Behavior and Self-Reported Sexual Identity: A Population-Based Survey of New York City Men \n \n Annals of Internal Medicine\n 19 September 2006 | Volume 145 Issue 6 | Pages 416-425\n \n \n Background: Persons reporting sexual identity that is discordant with their sexual behavior may engage in riskier sexual behaviors than those with concordant identity and behavior. The former group could play an important role in the spread of sexually transmitted diseases. \n \n Objective: To describe discordance between self-described sexual identity and behavior among men who have sex with men and associations between identity-behavior and risk behaviors. \n \n Design: Cross-sectional, random digit-dialed telephone survey of health status and risk behaviors. \n \n Setting: New York City. \n \n Participants: Population-based sample of 4193 men. \n \n Measurements: Concurrent measures of sexual identity and sexual behaviors, including number and sex of sex partners, condom use during last sexual encounter, and recent testing for HIV infection. Sex partner information was ascertained in a separate section from sexual identity; all participants were asked about the number of male sex partners and then were asked about the number of female sex partners in the past year. \n \n Results: Of New York City men reporting a sexual identity, 12% reported sex with other men. Men who had sex with men exclusively but self-identified as heterosexual were more likely than their gay-identified counterparts to belong to minority racial or ethnic groups, be foreign-born, have lower education and income levels, and be married. These men were more likely than gay-identified men who have sex with men to report having only 1 sexual partner in the previous year. However, they were less likely to have been tested for HIV infection during that time (adjusted prevalence ratio, 0.6 [95% CI, 0.4 to 0.9]) and less likely to have used condoms during their last sexual encounter (adjusted prevalence ratio, 0.5 [CI, 0.3 to 1.0]). \n \n Limitations: The survey did not sample groups that cannot be reached by using residential telephone services. \n \n Conclusions: Many New York City men who have sex with men do not identify as gay. Medical providers cannot rely on patients' self-reported identities to appropriately assess risk for HIV infection and sexually transmitted diseases; they must inquire about behavior. Public health prevention messages should target risky sexual activities rather than a person's sexual identity. \n \n Context:Self-identification of sexual orientation may not accurately reflect actual sexual practices.\n \n Contribution:These investigators performed a population-based health survey of men living in New York City and found that almost 10% who self-identified as straight had at least 1 sexual encounter with another man during the previous year. These men were less likely than self-identified gay men to have been tested for HIV infection or to have used a condom during their most recent sexual encounter.\n \n Implications:Physicians cannot rely on self-identification of sexual orientation to assess the likelihood of risky behavior. They must ask specific questions about sexual practices.", 
   {
    "unicode_changes_made": true
   }, 
   245462, 
   null, 
   1167880740.0
  ], 
  [
   245835, 
   null, 
   "jyoshu", 
   "Contribution:These investigators performed a population-based health survey of men living in New York City and found that almost 10% who self-identified as straight had at least 1 sexual encounter with another man during the previous year. These men were less likely than self-identified gay men to have been tested for HIV infection or to have used a condom during their most recent sexual encounter.\n \n Implications:Physicians cannot rely on self-identification of sexual orientation to assess the likelihood of risky behavior. They must ask specific questions about sexual practices.\n\n \n Either that study is flawed or this is just an example of bisexuality, which is just a state of being somewhat gay and straight. No truly straight male would have sex with another male. But I doubt 10% would be bi-sexual (it doesn't jibe with other studies) so I suspect it's flawed.", 
   {}, 
   245780, 
   null, 
   1167927600.0
  ], 
  [
   245839, 
   null, 
   "jitobear", 
   "Either that study is flawed or this is just an example of bisexuality, which is just a state of being somewhat gay and straight. No truly straight male would have sex with another male. But I doubt 10% would be bi-sexual (it doesn't jibe with other studies) so I suspect it's flawed.\n\n \n I think you are missing the point. I think the study is saying that it is quite likely that these men are gay or bi but being dishonest with themselves and others based on that fact (saying they are straight). That dishonestly leads to secretive, risky behaviors Where those who are honest about their sexuality know what they want, make no apologies for it and are more likely to engage in sexual activity responsibly.", 
   {}, 
   245835, 
   null, 
   1167928440.0
  ], 
  [
   245848, 
   null, 
   "Phazed", 
   "Whatever the situation is now, I think that if homosexuality was completely accepted and treated the same as heterosexuality there would be no difference between hetero and homo sexual safety. Sexual orientation would not affect safe-sex if the playing field became level(if it is indeed different at this time). So stop preventing the advancement of safe-sex and human progress by baring homosexual rights.", 
   {}, 
   245839, 
   null, 
   1167931740.0
  ], 
  [
   245853, 
   null, 
   "thelmoose", 
   "Either that study is flawed or this is just an example of bisexuality, which is just a state of being somewhat gay and straight. No truly straight male would have sex with another male. But I doubt 10% would be bi-sexual (it doesn't jibe with other studies) so I suspect it's flawed.\n\n \n As Jito said, you missed the point of the study and her post states it quite well. I just want to speak to a habit to people (you especially) who claim that a study must be flawed because they don't like the results. Read the study, review the methods - that's how you judge a study. It's only one study, after all, looking at <4000 men in NYC. The numbers may or may not generalize to other populations. \n \n Using your emotions rather than your brain, you jumped to a conclusion that this well designed and clean study is flawed. And for the same reason you missed the point of its conclusions as well.", 
   {}, 
   245835, 
   null, 
   1167932160.0
  ], 
  [
   245858, 
   null, 
   "ShadowPikachu", 
   "Either that study is flawed or this is just an example of bisexuality, which is just a state of being somewhat gay and straight. No truly straight male would have sex with another male. But I doubt 10% would be bi-sexual (it doesn't jibe with other studies) so I suspect it's flawed.\n\n WOW, you totally missed the point of the study and its conclusions. Did you even read it through, or did you just attack it because of what it seemed to say?", 
   {}, 
   245835, 
   null, 
   1167933120.0
  ], 
  [
   245878, 
   null, 
   "jyoshu", 
   "I think you are missing the point. I think the study is saying that it is quite likely that these men are gay or bi but being dishonest with themselves and others based on that fact (saying they are straight). That dishonestly leads to secretive, risky behaviors Where those who are honest about their sexuality know what they want, make no apologies for it and are more likely to engage in sexual activity responsibly.\n\n \n Then that only supports my point that a straight person is not going to be sleeping with same-sex partners. His post didn't address what we were talking about. A gay or bi man being dishonest with himself is not straight! I didn't miss the point--the point missed the debate.", 
   {}, 
   245839, 
   null, 
   1167936900.0
  ], 
  [
   245882, 
   null, 
   "ShadowPikachu", 
   "Then that only supports my point that a straight person is not going to be sleeping with same-sex partners. His post didn't address what we were talking about. A gay or bi man being dishonest with himself is not straight! I didn't miss the point--the point missed the debate.\n\n No, you said that men who have sex with men have to be gay. This study, plus some other posts showed that you are wrong.", 
   {}, 
   245878, 
   null, 
   1167937800.0
  ], 
  [
   245884, 
   null, 
   "jyoshu", 
   "No, you said that men who have sex with men have to be gay. \n\n \n Er, no I didn't say that. Please just be honest.", 
   {}, 
   245882, 
   null, 
   1167937860.0
  ], 
  [
   245889, 
   null, 
   "ShadowPikachu", 
   "Er, no I didn't say that. Please just be honest.\n\n \n Ah, well then, I guess that this post must be a figment of our imaginations:\n \nOh please. Men having sex with men though they aren't gay? Are you out of your mind? \n \n \n\n \n emoticon_rolleyesemoticon_xdonno emoticon_xdonno", 
   {}, 
   245884, 
   null, 
   1167938760.0
  ], 
  [
   245902, 
   null, 
   "jyoshu", 
   "Ah, well then, I guess that this post must be a figment of our imaginations\n\n \n Where does it say they have to be gay?", 
   {}, 
   245889, 
   null, 
   1167942480.0
  ], 
  [
   245915, 
   null, 
   "ShadowPikachu", 
   "Where does it say they have to be gay?\n\n \n Wow, Are you blind or something?", 
   {}, 
   245902, 
   null, 
   1167946200.0
  ], 
  [
   245922, 
   null, 
   "jyoshu", 
   "Wow, Are you blind or something?\n\n \n If you have an argument to make, then lay it out and make it, otherwise I'm assuming you just can't. I didn't say that if they have sex with men they HAVE to be gay.", 
   {}, 
   245915, 
   null, 
   1167947040.0
  ], 
  [
   245925, 
   null, 
   "ShadowPikachu", 
   "If you have an argument to make, then lay it out and make it, otherwise I'm assuming you just can't. I didn't say that if they have sex with men they HAVE to be gay.\n\n \n So you didn't ask that question which is just another way of wording it? As for an argument, it has already been made, but you seem to just go to your tactics of diversion whenever someone posts their argument.", 
   {}, 
   245922, 
   null, 
   1167947520.0
  ], 
  [
   245929, 
   null, 
   "jyoshu", 
   "So you didn't ask that question which is just another way of wording it?\n\n \n Alright ... I'll concede that I worded the original statement poorly--the idea I was trying to get across was that if they are straight, they aren't going to be having sex with men. Don't ignore the second part of my statement that such cases would be rare enough as to not be significant for the sake of the discussion. Bisexuals would be only a fraction of men who have sex with men; in our society most of them would just be gay.", 
   {}, 
   245925, 
   null, 
   1167948000.0
  ], 
  [
   245930, 
   null, 
   "ShadowPikachu", 
   "Alright ... I'll concede that I worded the original statement poorly--the idea I was trying to get across was that if they are straight, they aren't going to be having sex with men. Don't ignore the second part of my statement that such cases would be rare enough as to not be significant for the sake of the discussion. Bisexuals would be only a fraction of men who have sex with men; in our society most of them would just be gay.\n\n \n Thank you for conceding. I was beginning to get rather aggravated with your posts.", 
   {}, 
   245929, 
   null, 
   1167948120.0
  ], 
  [
   245934, 
   null, 
   "jyoshu", 
   "Thank you for conceding. I was beginning to get rather aggravated with your posts.\n\n \n There's no need to take these forums so personally, and let it make you mad. This is just an online discussion site, for goodness' sake! \n \n Oh, and you don't just have to be Kronos' parrot next door in the other thread ... it's ok to argue for yourself ... emoticon_xangel emoticon_xangel emoticon_xangel", 
   {}, 
   245930, 
   null, 
   1167948720.0
  ], 
  [
   245942, 
   null, 
   "ShadowPikachu", 
   "There's no need to take these forums so personally, and let it make you mad. This is just an online discussion site, for goodness' sake! \n \n Oh, and you don't just have to be Kronos' parrot next door in the other thread ... it's ok to argue for yourself ... emoticon_xangel emoticon_xangel emoticon_xangel\n\n \n Ah, so now I'm not allowed to state my agreement with a person I agree with? Sounds rather ridiculous to me. Really, Jyoshu, I have 23 posts on that thread, and because one or two are there agreeing with someone, I'm their parrot? emoticon_rolleyesemoticon_rolleyes:xbanghead Puh-lease.\n \n By the way, by your standards you are peteratwar's parrot, as in that same thread you agreed with him.", 
   {}, 
   245934, 
   null, 
   1167949320.0
  ], 
  [
   246631, 
   null, 
   "seefwjo", 
   "Islam came and the foundations of people's lives according to the equal love of good. Any religion will not pass on this simple but the Islamic religion. We ask God to guide everyone", 
   {}, 
   245176, 
   null, 
   1168453920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  So what does the Bible say?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9315, 
  "discussion_files": [
   [
    "3490.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-print.html"
   ], 
   [
    "3491.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-10-print.html"
   ], 
   [
    "3492.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-8-print.html"
   ], 
   [
    "3493.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-6-print.html"
   ], 
   [
    "3494.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-4-print.html"
   ], 
   [
    "3495.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-5-print.html"
   ], 
   [
    "3496.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-7-print.html"
   ], 
   [
    "3497.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-9-print.html"
   ], 
   [
    "3498.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-3-print.html"
   ], 
   [
    "3499.html", 
    "http://www.4forums.com/political/gay-rights-debates/9315-so-what-does-bible-say-2-print.html"
   ]
  ], 
  "identifier": 9315
 }
]