[
 [
  [
   243704, 
   null, 
   "its_just_me", 
   "If you had the choice would you breast feed your child or bottle feed?\n \n A few years ago my answer would be bottle because i was bottlefed and most of my firneds were too so i didn't know much about breastfeeding. But now that i have studied childcare and know the benefits of breastfeeding i will be breastfeeding my children without a doubt.\n \n Facts about breastfeeding\n * It's cheaper than bottle feeding\n * You don't need to sterilise anything\n * You're breast is ready all the time so yu don't have to make up any bottles\n * The milk is at perfect temperature\n * The baby is getting anti bodies and all the nutrients it needs from the breast milk.\n * Some say it also helps develop your childs concentration skills etc.\n \n Soa s you can see there are a lot of benefits to breatfeeding but also you've got to remember that if you choose breatfeeding you should express milk into a few bottles so that you husband/ partner can feed the baby too because feeding is at the top of the list for bonding.", 
   {
    "post_info": {
     "post_title": "Breast or not?"
    }
   }, 
   null, 
   null, 
   1166277420.0
  ], 
  [
   243705, 
   null, 
   "gamehuis", 
   "In would always choose breastfeeding for the reasons that you have just mentioned.", 
   {}, 
   243704, 
   null, 
   1166280360.0
  ], 
  [
   243723, 
   null, 
   "its_just_me", 
   "In would always choose breastfeeding for the reasons that you have just mentioned.\n\n \n I am very happy that you would make that choice and thank you for reading my infromation\n :)", 
   {}, 
   243705, 
   null, 
   1166297700.0
  ], 
  [
   243751, 
   null, 
   "jitobear", 
   "I did both. I breast fed for about six weeks when I could. However I was finishing up college and working at the same time so he had to be bottle fed some of the time. I also only had one breast that produced milk - and it dried up after two months so I did not get to breast feed long. However - even being able to for a short time is beneficial.\n \n In the end it would have to depend on the circumstances.", 
   {}, 
   243723, 
   null, 
   1166317140.0
  ], 
  [
   243773, 
   null, 
   "GreenMtnBoy", 
   "Just as long as you keep in mind there are things that should prevent you from doing so. Things like medications, fluid borne viruses, etc. I would be sure your healthy and are able to breast feed without putting the child at risk. You should also be ready for other people to be uncomfortable with it, and know your rights.", 
   {}, 
   243751, 
   null, 
   1166325360.0
  ], 
  [
   243819, 
   null, 
   "Jo Bennett", 
   "thing is, you're pretty likely to transfer any bugs you're carrying into bottled milk when you prepare it. Breast milk at least carries anti-bodies which boost the baby's immune system.", 
   {}, 
   243773, 
   null, 
   1166356440.0
  ], 
  [
   243850, 
   null, 
   "its_just_me", 
   "I did both. I breast fed for about six weeks when I could. However I was finishing up college and working at the same time so he had to be bottle fed some of the time. I also only had one breast that produced milk - and it dried up after two months so I did not get to breast feed long. However - even being able to for a short time is beneficial.\n \n In the end it would have to depend on the circumstances.\n\n \n Thats good that you started to breastfeed and sometimes we have no choice but to bottlefeed too, it's a shame that you're breast dried up a lot of women i've spoken to have had this problem.\n \n I'm glad you saw it as beneficial though.", 
   {}, 
   243751, 
   null, 
   1166392200.0
  ], 
  [
   243852, 
   null, 
   "its_just_me", 
   "Just as long as you keep in mind there are things that should prevent you from doing so. Things like medications, fluid borne viruses, etc. I would be sure your healthy and are able to breast feed without putting the child at risk. You should also be ready for other people to be uncomfortable with it, and know your rights.\n\n \n I totally agree, some women just can't breastfeed because their breast won't produce milk and we do have to watch what medication we take when breastfeeding, you should always ask you're doctor about any medication while breastfeeding. You don't actually have to be really healthy to breastfeed because you're body will produce healthy milk whether you eat healthily or exercise or not but it is a good idea to be healthy anyway so you have plenty of energy to feed the baby. I also agree that you should be ready for some people being uncomfortable but it passes and people get used to it and so do you, definatly check you're rights though.", 
   {}, 
   243773, 
   null, 
   1166392560.0
  ], 
  [
   243853, 
   null, 
   "its_just_me", 
   "thing is, you're pretty likely to transfer any bugs you're carrying into bottled milk when you prepare it. Breast milk at least carries anti-bodies which boost the baby's immune system.\n\n \n I agree 100%!! emoticon_xgood", 
   {}, 
   243819, 
   null, 
   1166392620.0
  ], 
  [
   246530, 
   null, 
   "Anastasia", 
   "My oldest was bottle fed (he would not latch)\n Second- breast fed for about 3 months\n Third- 9 month old daughter is still breast feeding :)\n She has never had a bottle, she refuses but we have been able to give her a sippy cup but only juice now.\n I feel really strongly about breast feeding now, and It really is best for the baby.", 
   {}, 
   243853, 
   null, 
   1168378260.0
  ], 
  [
   246531, 
   null, 
   "Anastasia", 
   "Also it is no easy task at first, it takes a good month or two to get it happening. But once your over the hurdle it is a piece of cake.", 
   {}, 
   246530, 
   null, 
   1168378320.0
  ], 
  [
   247564, 
   null, 
   "Sigma", 
   "How long should one breastfeed? As long as the child will take it?", 
   {}, 
   246531, 
   null, 
   1169069220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Breast or not?", 
  "url": "http://www.4forums.com/political/parenting/9333-breast-not.html", 
  "breadcrumbs": [
   "Parenting"
  ], 
  "id_number": 9333, 
  "discussion_files": [
   [
    "1848.html", 
    "http://www.4forums.com/political/parenting/9333-breast-not-print.html"
   ]
  ], 
  "identifier": 9333
 }
]