[
 [
  [
   14499, 
   null, 
   "prometheus", 
   "It is illeagle for Australia to declare War on any nation. Queen Elizebeth the Second is the Head of State of Both Canada and Australia and Her Royal Hyness and her predessors exorsised exsecutive command of both mylitary forces. This is why it is imposible for England to be at war with out Canada and Australia.\n \n Empiral ineptiude in the governace of empirial forces was not new to WWII however the shear scale of executive folly greatly embitered Australia and Canada. Australia put a leftist politian in comand during WWII for this reason. John Curtin spearheaded a change in defence policy which stands to this day. He initiated a more independant role with in the Empire for the Australian forces in the defence of Australia. Australian forces were redirected from other theaters of war to the pasific against the will of both Churchil and Rosevelt. This new form of undeclared independance survives to this day and is manifest in Australias main Alliance the ANZUS treaty.\n \n John Curtin was well aware both the US and England were willing to sacrifice Australia in the intrest of containing Hitler at all cost. He knew this because he was told this. John Curtin rebeled against the autority of both the US and England as the leading partners of the War.\n \n The greatest misconception today is that Australia was saved in the battle for Guada Canale. This is a Majior misconseption. Guada Canale is part of the Solomon Island Group which runs West of PNG. PNG sits directly north of Queens Land and is no more than 500ks of shore. The Solomons were the back door to the east coast, PNG was the front door.\n \n General Macauther was willing to defend Australia on the Australian continent. This is why US marines were being used only to defend naval assets. It was the Australian troops that started the forward push in Borneo and PNG. Australian Iregulas halted the Japanese Land invasion in PNG on the Kacoda Track. The japanese were moped up by Australian regulars who had returned in time from the African Theatre against the wishes of both the US and UK. The defeat of the Japanese by the australians in PNG was the first reversal of the Japanese forces on land and signaled a changeing tide in the war. Darwin was being bombed at the time and naval forces were opperating of our coast. My Nanna told me her father saw a Zero scouting in Geralton which is not that far north. The germans also seem to have been assisting with the distuction of the HMAS Sydney by the rader Cormaront. The north of Australia was being evacuated and prepared for defence. \n \n If the Japanese had taken Port Morsby (PNG) It is almost certain Australia would have been taken. Naval Power was becoming subserviant to air power and this is why territorial expansion was so important to the Japanses. The loss of Australia as an Allied base would have changed the dynamics of the Pasific Theatre greatly.\n \n The Australian forces suffered greatly not because of our enimies but because of huge blunders by thier british commanders. The Fall of Hong Kong and Singipore were said to have ended the British Empire. Our troups were left exposed on Asian Islands with little or no Allied Sea or Air power. They had no choice but to surrender to the full might of the Japanese Empire. Australian Ground forces can not defend themselves against Pearl Harbour style attacks. It is only when Australia took charge of its own forces did we begin to taste victory. The battle for the Cacoda Track has become legend to the young of this country. We shall never forget the hard lessons learnt. People such as I boast proadly that we had a Grandfather that fought on the Cacoda Track.", 
   {
    "post_info": {
     "post_title": "The Australian perspective in WWII"
    }
   }, 
   null, 
   null, 
   1062851520.0
  ], 
  [
   15582, 
   null, 
   "montalban", 
   "I'd like to suggest a few things...\n a) a point, most of your readers aren't Australians and would probably like to know why you posted this.\n b) you use a spell-checker Cacoda? Kakoda!, pasific? Pacific!\n c) you re-title your post \"An Australian Perspective...\" as you don't speak for me!\n d) facts... The Queen is the nominal head of Australia's Armed Forces only!\n Britain can make war on us, if they chose... they have waged war against other servants of the king/queen... have you never heard of the American Revolutionary War?\n The German vessel and raider HSK Kormoran (not rader Cormaront) did sink HMAS Sydney - you suggest this was only a possibility (\"may have...\")\n \"Australian Ground forces can not defend themselves against Pearl Harbour style attacks\" (Pearl Harbor - it's an American place-name). I've no idea what this means anyway, you've shown no proof \n \n The 'push' in Borneo and PNG? PNG happened in 1942. Borneo, I believe in 1944-45, and only after the USA had begun clearing up other areas", 
   {}, 
   14499, 
   null, 
   1063717200.0
  ], 
  [
   15589, 
   null, 
   "prometheus", 
   "I'd like to suggest a few things...\n a) a point, most of your readers aren't Australians and would probably like to know why you posted this.\n b) you use a spell-checker Cacoda? Kakoda!, pasific? Pacific!\n c) you re-title your post \"An Australian Perspective...\" as you don't speak for me!\n d) facts... The Queen is the nominal head of Australia's Armed Forces only!\n Britain can make war on us, if they chose... they have waged war against other servants of the king/queen... have you never heard of the American Revolutionary War?\n The German vessel and raider HSK Kormoran (not rader Cormaront) did sink HMAS Sydney - you suggest this was only a possibility (\"may have...\")\n \"Australian Ground forces can not defend themselves against Pearl Harbour style attacks\" (Pearl Harbor - it's an American place-name). I've no idea what this means anyway, you've shown no proof \n \n The 'push' in Borneo and PNG? PNG happened in 1942. Borneo, I believe in 1944-45, and only after the USA had begun clearing up other areas\n\n \n a) Why is a question. The question is the answer.\n b) Every thing in the universe is relative to the observer. To me my spelling is rite. If I thought my spelling was incorcect I would not spell this way.\n c) You have proven your capability to speak for yourself. So do so. I do not and have not claimed to speak for you. I believe my portrail of the Spirit of Australian Indipendance during war time is acurate. If not so please counter. To me you just seem like a nusance. I and others think of Sydney as part of the US any way.\n d) Until they change the constitution The Queen is the Head of State. We are a constitutional Monarchy not a Nominal Democracy.\n e) You missed my biggest stuff up. The Solomons run East not west of Papua. I did not research this as I was not expecting to be graded. I am simply trying to give and idea to thoes in the US how australia has evolved nationaly post 39.\n f) Most Australians think of Sydney Siders as Arogant and ergo non Australian. It seems you have proven them corect. No wonder I do not speek for you.", 
   {}, 
   15582, 
   null, 
   1063719420.0
  ], 
  [
   15658, 
   null, 
   "montalban", 
   "a) Why is a question. The question is the answer.\n b) Every thing in the universe is relative to the observer. To me my spelling is rite. If I thought my spelling was incorcect I would not spell this way.\n c) You have proven your capability to speak for yourself. So do so. I do not and have not claimed to speak for you. I believe my portrail of the Spirit of Australian Indipendance during war time is acurate. If not so please counter. To me you just seem like a nusance. I and others think of Sydney as part of the US any way.\n d) Until they change the constitution The Queen is the Head of State. We are a constitutional Monarchy not a Nominal Democracy.\n e) You missed my biggest stuff up. The Solomons run East not west of Papua. I did not research this as I was not expecting to be graded. I am simply trying to give and idea to thoes in the US how australia has evolved nationaly post 39.\n f) Most Australians think of Sydney Siders as Arogant and ergo non Australian. It seems you have proven them corect. No wonder I do not speek for you.\n\n \n a) Doesn't make sense\n b) Relativism - you might want to provide some proof of this stance\n c) You titled your post \"THE\" Australian Perspective, suggesting only one, therefore you have assumed to speak for me\n d) I never claimed otherwise. She is not in ACTUAL charge of the defence forces, as you claimed. She is nominally in charge - or rather the constitution names the Governor General in charge.\n e) Ah, here you explain a) Your idea was to give a tract on how Australia's foreign relations developed. I didn't see that.\n f) If I am arrogant because I don't want you speaking for me, (remember this is what you arrogantly assumed to do), then yes I am. If I am arrogant because I correct you, so be it. What does that make you?\n \n By the way the reference to Sydneysiders is such a generalisation. Within Sydney, I am a 'Westie', quite looked down upon by 'Scegs' so again, an arrogant generalisation!", 
   {}, 
   15589, 
   null, 
   1063762680.0
  ], 
  [
   15780, 
   null, 
   "prometheus", 
   "Australia was founded as a convict setlement. The colinies were built by slave labour. The early setlers were not inspired to come to this desilate land by its fertility, they were escaping british empiralism. This vast continent proved ample distance from the centre of the empire.\n \n We slaves have never been free as we have always been ruled by a forien queen. Her Majysties troops were used to put down an armed group of victorian subjects. Forien troops were used to spill the blood of australian men. Ned Kelly was suported by the people who had had enouph of British Justice. It is this same spirt that made australian troops so distrepectful of britsh mylitary at Golipoli.\n \n Australians are not stupid. We know the politicians and Lawyers of this nation are corupt. They have sold our great nation for trinckets and boubals. Our PM is a spineless fool as australian policy is dictated from forien boardrooms. Our manufactruing sectors have been exported and the youth are told to sell mobile phones. You know your city culture is corupt and decident and yet you play the sunny side liberal. City coruption has sold this great nation to the enemy. Thoes who support the statis quoe are complicit in the rape of this great nation. Our nations gold has been sold and the guns of law abiding citizens have been taken of us.\n \n Our future has been sold out and it should be obvious to you just by looking around that the youth are XXXXXX. Names Dates and other quames should have no bearing on the fact that Australian are rebelious slaves.", 
   {}, 
   15658, 
   null, 
   1063823400.0
  ], 
  [
   15812, 
   null, 
   "montalban", 
   "Australia was founded as a convict setlement. The colinies were built by slave labour. The early setlers were not inspired to come to this desilate land by its fertility, they were escaping british empiralism. This vast continent proved ample distance from the centre of the empire.\n \n We slaves have never been free as we have always been ruled by a forien queen. Her Majysties troops were used to put down an armed group of victorian subjects. Forien troops were used to spill the blood of australian men. Ned Kelly was suported by the people who had had enouph of British Justice. It is this same spirt that made australian troops so distrepectful of britsh mylitary at Golipoli.\n \n Australians are not stupid. We know the politicians and Lawyers of this nation are corupt. They have sold our great nation for trinckets and boubals. Our PM is a spineless fool as australian policy is dictated from forien boardrooms. Our manufactruing sectors have been exported and the youth are told to sell mobile phones. You know your city culture is corupt and decident and yet you play the sunny side liberal. City coruption has sold this great nation to the enemy. Thoes who support the statis quoe are complicit in the rape of this great nation. Our nations gold has been sold and the guns of law abiding citizens have been taken of us.\n \n Our future has been sold out and it should be obvious to you just by looking around that the youth are XXXXXX. Names Dates and other quames should have no bearing on the fact that Australian are rebelious slaves.\n\n \n Ah, see, now I was wrong. I thought you were just after a history of Australian foreign relations post WWII, now you've gone for an entire history of Australia back to 1788.\n \n The rebellious convict tag doesn't sit well with me (hence your definitive history isn't all inclusive). I can trace my family roots (on my mum's side) back to the 1840s. They were free settlers, farmers. So, I guess they were hoping for fertile land! My father was born in Clay City, Clay County Indiana, but I don't know he had a 'convict' past.\n \n What about the first Australians? The indegenous Australia.\n What about the countless millions that came after WWII. Are they 'rebellious slaves'?\n \n \"Ned Kelly was suported by the people who had had enouph of British Justice.\"\n \n Hmmm? That's why we're still chained to the monarchy? You are arguing two different tracts here, that we are both rebellious slaves, and that we are still fettered to the chains. Obviously this suggests that as rebels we're not very good.", 
   {}, 
   15780, 
   null, 
   1063850880.0
  ], 
  [
   15962, 
   null, 
   "prometheus", 
   "One can only define the australian culture by looking at the relationship between England and her Irish subjucts. The Irish had very little inluence on british politics and yet the english felt the need to invade and persicute the Irish population in there homeland. Australia is a hybrid culture yet the old story of empirial dominance remains. One can not understand Australia unless one looks to its origins as a slave nation. You are quick to declare your free born status yet you neglect the early infrastructure of this nation that your great ansesters would have relied on inorder to maintain the degree of civilisation they were so use to.\n \n You speek of Aboriginals. These are the same people who were at the hostile end of a government sponsered policiy of genocide. The surivivers of Dogs Guns and small pox were left exposed to our new poicy of intergration whos spear head was the rape of aborigional women and the theft of the half cast ofspring. As a full blood Irish man I take no pride in these actions. Yet your love of empire sugests some sought of revelry in these events. I dont think you had any real point by mentioning the aborigional persons of this land. They suffered the same fate as the Irish men and women in there homeland from the Anglosaxon Barbarian Empire.\n \n I know my history also and my people built this land 150 years ago. They were escaping persacution in there own land Irland. Non of my ansesters were convicts yet I do not forget all colonial ifrastructure was built by slaves. The Eurica stockade and the uprising at Glen Rowin were two events that changed the course of Australian History. The British realised they could not rule Irish subjects in this land as they did in our Homelands. The freedoms you enjoy today are owed to our Irish forfathers. The point I was makeing is when we elect a PM like John Curitn our Reblion is complete. We become free.\n \n You are obviously an inteligent person. You clame not to have a privilaged background. I ask simply that you think like an Austalian. Name any war that Australias best interest would not have been best served by being nutral. Our leaders tell us compition is for the best and take down our trade bariers. You must have seen the rampent degration and criminal eliment developing in the youth and yet you deniy any conection. House prices are beyond the reach of any young man and secure empoyment is limited to thoes who can aford higher education. There are still many out of work and yet we let over 100 000 people into the country every year. You yourself are under the stictess of warter ristricitons and yet our northen rivers are allowed to flow freely into the ocean. If you devide the worth of our natural resources amongst all people here every man woman and child would be worth at least 1 million dollars and yet people are starving. Any one who suggests we are free is deluded. Intoxicated by there trinkets and bawbales. Sorry mate but step outside of sydney and you will see reality. Sydney is corupt and decident and colapsing under the wieght of universal criminal activiy. You may be able to smerk with your names and dates now but just wait until the housing buble bursts. When the realistate market colapses there will be nothing left to suport your corrupt city culture. You do not need to read my words you will see it for your self. Money rules sydneymorality and spirituality are long gone.\n So enjoy your decident city while it still stands.\n \n The truth is the people of the country will rebild the cities as we always do. Wealth comes from the Gold and Wheat of the land not by sellingmobile phones and used cars. While all of the young people are on drugs you my friend can not hope for a good future in the big city. Do not bother me with your names or your dates time shall be our judge.", 
   {}, 
   14499, 
   null, 
   1063905540.0
  ], 
  [
   16023, 
   null, 
   "montalban", 
   "I know my history also and my people built this land 150 years ago. They were escaping persacution in there own land Irland. Non of my ansesters were convicts yet I do not forget all colonial ifrastructure was built by slaves. The Eurica stockade and the uprising at Glen Rowin were two events that changed the course of Australian History. The British realised they could not rule Irish subjects in this land as they did in our Homelands. The freedoms you enjoy today are owed to our Irish forfathers. The point I was makeing is when we elect a PM like John Curitn our Reblion is complete. We become free.\n\n \n What about Scullin? He appointed the first Australian born Governor General, Sir Isaac Isaacs, who was also Jewish. He did so by presenting the king with a list of candidates containing only one name... thus taking away from the monarch a choice... effectively showing that the appointment of Governor General, whilst vested in the monarch is a mere formality.\n \n (Scullin aslo established the Arnhem Land area as a reserve for Aborigines)\n \n \n \nYou are obviously an inteligent person. You clame not to have a privilaged background. I ask simply that you think like an Austalian. Name any war that Australias best interest would not have been best served by being nutral. \n\n \n Where we would be best served by being neurtral...? I don't know what the point is.\n \n \n Our leaders tell us compition is for the best and take down our trade bariers. You must have seen the rampent degration and criminal eliment developing in the youth and yet you deniy any conection. House prices are beyond the reach of any young man and secure empoyment is limited to thoes who can aford higher education. There are still many out of work and yet we let over 100 000 people into the country every year. You yourself are under the stictess of warter ristricitons and yet our northen rivers are allowed to flow freely into the ocean. If you devide the worth of our natural resources amongst all people here every man woman and child would be worth at least 1 million dollars and yet people are starving. Any one who suggests we are free is deluded. Intoxicated by there trinkets and bawbales. Sorry mate but step outside of sydney and you will see reality. Sydney is corupt and decident and colapsing under the wieght of universal criminal activiy. You may be able to smerk with your names and dates now but just wait until the housing buble bursts. When the realistate market colapses there will be nothing left to suport your corrupt city culture. You do not need to read my words you will see it for your self. Money rules sydneymorality and spirituality are long gone.\n So enjoy your decident city while it still stands.\n\n \n As I said in previous e-mail, my folk were farmers. They settled in and around Ballarat, so I know about the Eureka Stockade rebellion you spoke of.\n \n To say all Sydneysiders are deccadent is a rather pompous proclaimation to make. My late grand-mother was a worker, a barmaid! My grand-father painted lines down the roads for the Department of Main Roads (DMR - as it was then called). You have some sort of idea of a rural essentialism, that all good folk are in the country, and visa versa. Most of my relatives are still in the country, from the MIS area of far-western Victoria, to Wagga Wagga, NSW.\n \n I've met a tonne of good city folk. Anytime country folk here in Australia are in need, it is city folk who open up their wallets.\n \n \n \nThe truth is the people of the country will rebild the cities as we always do. Wealth comes from the Gold and Wheat of the land not by sellingmobile phones and used cars. While all of the young people are on drugs you my friend can not hope for a good future in the big city. Do not bother me with your names or your dates time shall be our judge.\n\n \n Anyway, most people live in towns, even those in the country. So, where would you classify a place like Gosford on the NSW central coast... it is not 'in' Sydney, but is close enough by CityRail to commute. Or maybe, the people there are only half evil?\n \n On a less serious note, the way you write reminds me of this passage...\n \n Aoccdrnig to rscheearch at an Elingsh uinervtisy, it deosn't mttaer in waht oredr the ltteers in a wrod are, the olny iprmoetnt tihng is taht frist and lsat ltteer are in the rghit pclae. The rset can be a toatl mses and you can sitll raed it wouthit a porbelm. Tihs is bcuseae we do not raed ervey\n lteter by it slef but the wrod as a wlohe. Ceehiro \n That'll fcuk the splelchekcer", 
   {}, 
   15962, 
   null, 
   1063941240.0
  ], 
  [
   16157, 
   null, 
   "prometheus", 
   "The British Empire was a name used to discribe the worlds biggest group of Gang Bangers. Drug dealers, Pirates and weapons Dealers. The British in there dealings with the world were a gang of cut throughts and thugs.\n \n You still have not denied that city cultrure is pradominately decident and corrupt. You still have not denied Australias wealth is generated by the working class in the country. You have not denied the wieght of so called democracy alows oversized cities to steal the natural wealth of the country and spend our nations wealth on trinkets and baubles. You have not denied that our politicians and lawyers are corupt.\n \n 2 Billion dollars is taken from the people of country western australia and never returned. This is theft. Instead of reinvesting in the infrastructure of the country which generates this wealth you brain deads spend our national wealth on trinckets and Baubales. Your are a fool if you think I would pay half a million dollars to live in your nieghbourhood. The people of Sydney are intoxicated by the illusion of there own wealth. The Greed Corutption Crime and Decidence will all colapse like a pack of cards when interest rates hit 10% Interest rates will hit 10% with in two years not because me and my mates have found more gold for you guys to steal of us but because you deluded fools think your houses are worth millions of dollars. The housing sectors of Melbourne and Sydney are driving national inflationary growth.\n \n You obviously do not understand our empirial masters control our munitary policy. They are going to jack up interest rates like they did in the 80s to stop wages growth so the workers won't eat into there corparate profits. This will cause the largest Depression in australian history. When people can not afford the interest repayments on thier million dolar properties people will stop paying such rediculous prices for houses. House holds will lose there home equity overnight and banks will foreclose. There is no realistic way Australia can export enough goods on the growning intrest of our national Debt. Our Masters know this. They know what is coming. We are going to witness Universal Bankrupsy very shortly. This will cause spiraling Deflation. You will be left with your trinkets and baubles but nobody will wont them becuase they are worthless. Mindless consumorism creates universal slavery. \n \n You proudly declare your asociation with balerat. It is good to see you think of your sufering bretheren from your comfortable suberb. I live in the Highest Exporting Region in Australia and people here think for the work they do they are being riped of by lawyers and politicans in the big cities. Overt theft of course is just Tax if you live in a nominal Democracy. It is Overt theft if you live in a constitutional Monarchy. We do not have a say in who is our head of state this is because we are slaves who are held in the highest contempt. Marched of to wars overseas just to make a buck for Her Majisty and Friends.\n \n Hop in your car and drive down to Kings Cross and there you will see the next generation learning to live as animals. Sydney has been devided up into seperate and non intergrationist Cultural Groups. This is no mistake these ethnic onclaves were created with state monies. The only thing that unites sydney is its universal love of money. Country people are united in our hatred of the Corupt Decidence enspired Greed coming out of Sydney Melbourne and Canberra. The Commonwealth of Australia is a Joke legalised theft with no representation. We create the wealth you steal it then waste it and treat us like fools. We will not be held in such contempt. You sir are arogent. You are also Ignorant to what is happening around you. I have been to the big cities and have seen the walls you people build around your nice new suberbs, this is becuase there are Ghetos springing up everywhere. You must be old. You must have seen how things have changed for the worse. Yet you want to believe what ray martin tells you. You have no real idea what is going on. This is because you have never thought for yourself. The best you can do is mock my spelling. As you can see clearly I write not like yourself to sound smart but because I understand what is happening and can see we are all in trouble. Dear sir when it does hit you I am afraid for you it will be to late. This is because you and your friends have your heads in the sand. There are many of us here in the country who have no debt. Yet we live in modest houses and drive simple cars. Some of us have also made provisions for tough times. Your great Commonwealth Government will not help you sir for they are your enemy. Our masters treat us with contempt and with people like you around it is easy to see why.", 
   {}, 
   14499, 
   null, 
   1063984380.0
  ], 
  [
   16357, 
   null, 
   "montalban", 
   "Stone the crows, mate! You've got to learn to get a grip and stop acting like a real dag.\n \n But cop this...!\n Quote\" I live in the Highest Exporting Region in Australia blah blah\"\n \n Cane toad? Half your luck! All that hard yakka, you must be happy as larry earnin' a real motza; but something's not the full quid!\n \n I'm not trying to XXXX in your pocket or have a blue with a real true blue dinky-di, but mate, you're a dead-set ear-basher! And ya driving me aggro spitting the dummy over Sydney!\n \n Sydney; she'll be apples. Never mind the pollies! You might want to drop by for a gander, suss it out; sittin' on the beach with ya stubbie and a sanger, soakin' up the rays. Whatya reckon? Rock on up, ya won't end up a gum-tree. Or, ya might wanna check out the Westies; but get yaself a pair of uggies and some flannels first.\n \n \n hooroo and avagoodweegend!\n emoticon_xgood", 
   {}, 
   16157, 
   null, 
   1064066880.0
  ], 
  [
   17619, 
   null, 
   "prometheus", 
   "Stone the crows, mate! You've got to learn to get a grip and stop acting like a real dag.\n \n But cop this...!\n Quote\" I live in the Highest Exporting Region in Australia blah blah\"\n \n Cane toad? Half your luck! All that hard yakka, you must be happy as larry earnin' a real motza; but something's not the full quid!\n \n I'm not trying to XXXX in your pocket or have a blue with a real true blue dinky-di, but mate, you're a dead-set ear-basher! And ya driving me aggro spitting the dummy over Sydney!\n \n Sydney; she'll be apples. Never mind the pollies! You might want to drop by for a gander, suss it out; sittin' on the beach with ya stubbie and a sanger, soakin' up the rays. Whatya reckon? Rock on up, ya won't end up a gum-tree. Or, ya might wanna check out the Westies; but get yaself a pair of uggies and some flannels first.\n \n \n hooroo and avagoodweegend!\n emoticon_xgood\n\n \n \n \n \n \n Fact is mate I live in The goldfields. We have a tradition of saying things as we see them. I have spent large parts of my life underground and in the deserts of this great nation. You may not accept my ability to spell is suficent however your discorse with me leaves me open to the concept that I may not just be speaking for myself.\n \n \n So you and your friends have your fun. If ever you feel you need to fix this great country of ours turn of your TV and start talking to your countrymen. \n \n There is one thing I hope I have shown you. That is even though on this side of the blue mountains even though some of us cant spell we still have brains and we think for our selves. If you came out here you might see we run this great country quite well. No glass towers out here. You need us and we need you. So after you ve had your fun bring your bat and ball back and mabe just mabe if you talk to us like we have a brain we might be able to come up with a national agenda.\n \n Fact is we need one. I have found gold. Its out there. So there is no reason for us to fight like childeren. Build a bridge and mabe this country can show the rest of the world it is the greatest nation on earth", 
   {}, 
   16357, 
   null, 
   1064692680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Australian perspective in WWII", 
  "url": "http://www.4forums.com/political/history-debates/935-australian-perspective-wwii.html", 
  "breadcrumbs": [
   "History"
  ], 
  "id_number": 935, 
  "discussion_files": [
   [
    "8825.html", 
    "http://www.4forums.com/political/history-debates/935-australian-perspective-wwii-print.html"
   ]
  ], 
  "identifier": 935
 }
]