[
 [
  [
   244277, 
   null, 
   "snakespit", 
   "I'm sure that the majority of you have heard about the 3 climbers got stranded on Mt. Hood in OR. Sadly, 1 of the climbers has already been recovered dead, and at last check they have still not found the other 2. It is almost a certainty that the remaining 2 missing climbers are dead and burried in the snow somewhere on the mountain. Brutal weather combined with the vast and often dangerous landscape have combined to make rescue difficult at best, with the very real possibility that the remaining climbers will not be found until spring. Apparently the climber who has already been found dead, Kelly James of Dallas, became injured near the summit of the mountain, and was unable to descend, forcing his fellow climbers to seek help. Nothing has been heard from the other 2 climbers for 11 days. Quite obviously, this has become a recovery effort rather than a rescue effort. \n \n So I was watching Bill O'reilly the other night, and he was interviewing a \"climbing ranger\" from the Mt. Hood area. Bill's basic premiss was that the government should take steps to close the mountain to climbing in the winter months, when the avalanche danger and the danger posed by unpredicatable and often brutal weather was the worst. The ranger attempted to point out to Bill that \"closing\" the mountain down would require more resources than are presently available, and considerably more resources than one would think. Essentially, the mountain cannot be \"closed\" with any effective authority. \n \n Now I certainly feel sympathy for the families of these 3 climbers, and I never like to hear stories of people being killed in this manner. However, I am an avid backpacker and mountaineer, and I understand the drive and ambition to challenge ones self as these 3 men did. Government intrusion into when and where I may backpack or climb seems to me like one more step towards eroding my freedoms and liberties. I always understand the risks when going into the wilderness, as I am sure these 3 experienced climbers did as well. I also go into the wilderness with the attitude that self rescue is the only rescue I should count on in the event of an emergency. I think this attitude is shared by most experienced climbers and backpackers. \n \n This is where it gets interesting for me though. I did understand O'reillys' point that such rescue operations are inherently dangerous, and place the rescuers are a much greater risk of themselves becoming victims. Professionally, I am a paramedic. I assume a certain risk each and every day that I go to work, and I accept that risk. However, as a professional rescuer, it is also my responsibility to follow a protocol of safety; myself, my partner, my team, the bystanders, the victim...in that order. I agree with Bill in the respect that sending rescue teams onto the mountain in dangerous severe weather with a high risk of avalanche has crossed the limits of common sense. I do not however find this cause for government regulation of when and where people should have access to recreation, regardless of the personal danger that the people place themselves in. \n \n My solution to this is simple. During the most dangerous times of the year, make it known to anyone who wants to climb or recreate at places such as Mt. Hood (proven dangerous or hostile climates) that their safety cannot be assured, and that rescue will not be made available by goverment funding. I agree that anytime a reasonable rescue can be made safely that it should be done, but make it clear that we will not spend taxpayer funds to place rescuers in harms way when the risk is too great. We already do this in some respect at public beaches, where they simply place signs saying that there is no lifeguard on duty, swim at your own risk. \n \n Any thoughts on this?", 
   {
    "post_info": {
     "post_title": "Mt. Hood and the loss of comon sense."
    }
   }, 
   null, 
   null, 
   1166607900.0
  ], 
  [
   244278, 
   null, 
   "peteratwar", 
   "Quite agree. People must be responsible for their own actions. If warnings are put up and people ignore them, then they are on their own.", 
   {}, 
   244277, 
   null, 
   1166612520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mt. Hood and the loss of comon sense.", 
  "url": "http://www.4forums.com/political/current-events-debates/9354-mt-hood-loss-comon-sense.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 9354, 
  "discussion_files": [
   [
    "5691.html", 
    "http://www.4forums.com/political/current-events-debates/9354-mt-hood-loss-comon-sense-print.html"
   ]
  ], 
  "identifier": 9354
 }
]