[
 [
  [
   244823, 
   null, 
   "Matthew S", 
   "I say the police did nothing wrong here and should not have payed these bigots any money.\n \n http://www.lep.co.uk/ViewArticle2.aspx?SectionID=73&ArticleID=1943991\n \n They only got the same treatment they and their fellow chistians wish on gay people all the time.", 
   {
    "post_info": {
     "post_title": "THe police did nothing wrong"
    }
   }, 
   null, 
   null, 
   1166969340.0
  ], 
  [
   244953, 
   null, 
   "Steeeeve", 
   "Are you an expert on EU law? If not then all you can say is that in your perfect world they should have gotten nothing.", 
   {}, 
   244823, 
   null, 
   1167242280.0
  ], 
  [
   244959, 
   null, 
   "foundit66", 
   "Joe and Helen Roberts, of Blakiston Street, Fleetwood, were reported to the police by a Wyre Council official after Mr Roberts said he was offended by the authority's promotion of homosexual rights.\n\n \"offended\"?\n Boo-fricken-hoo.\n \n \n \nThe couple had campaigned for Wyre Council to promote Christianity as well as distributing leaflets about gay rights.\n\n Anybody else notice the disparency here?\n We're talking about leaflets promoting gay RIGHTS (a group that is typically discriminated against), and the comparative response is to promote CHRISTIANITY itself.\n I realize some on the right can't get the difference, but there is a analogical difference between promoting gay RIGHTS and Christianity.\n A more accurate analogy would be to promote Christian RIGHTS along with gay RIGHTS, but since Christians (the group) aren't being discriminated against (from what we see in the story), the whole thing is an absurd request.\n \n \n \nBut the council refused the request on the grounds it would offend the gay community - so Mr Roberts lodged the complaint.\n\n Interesting.\n Evidently \"offending\" may have a bigger play in their legalities than it does in the U.S.\n I would have refused on different grounds, as discussed above.\n \n \n \nTwo police officers went to the Roberts' home and grilled them about their beliefs for more than an hour.\n Officers brought no charges, but the Roberts took action on the grounds that their rights to freedom of speech and freedom of religion under the European Convention on Human Rights had been breached.\n Now the case has been settled after Wyre Council and Lancashire Constabulary apologised to the couple. They were paid legal costs and £10,000 which will be donated to charity.\n\n Contrary to Matthew's march to an antagonistic approach which mirrors the anti-gay approach of some, I see this as clearly wrong.\n A simple \"No\" is all that was warranted.\n \n On some level, this approach gave them a spotlight which they could use. A simple \"no\" would be just that, giving them no more energy to garner their attention.\n Instead of simply saying \"No\", now the issue has been escalated with the anti-gay side being given more ammo and more attention. More sympathy can be garnered for this couple.\n But of course, some like Matthew focus SOLELY on how their efforts will clash with the purely anti-gay, ignoring the folks who are watching both sides getting dirty by wrestling in the mud.\n \n On another level, this couple had a right to speak their mind, and the response was totally unjustified. So what if they requested Christianity be promoted. Freedom of speech?", 
   {}, 
   244953, 
   null, 
   1167245100.0
  ], 
  [
   245072, 
   null, 
   "jitobear", 
   "Looks like a whole round of stupid. I have no sympathy for folks not ponying up and \"promoting Christianity\", but the police action was out of line.", 
   {}, 
   244959, 
   null, 
   1167322920.0
  ], 
  [
   245102, 
   null, 
   "Matthew S", 
   "Looks like a whole round of stupid. I have no sympathy for folks not ponying up and \"promoting Christianity\", but the police action was out of line.\n\n \n I don't agree they got exactly the treatment from the police that they want the police to do to gay people.", 
   {}, 
   245072, 
   null, 
   1167337200.0
  ], 
  [
   245110, 
   null, 
   "Phunting", 
   "I don't agree they got exactly the treatment from the police that they want the police to do to gay people.\nSo therefore if there was someone who states that they think the police should execute all homosexuals, it would be perfectly justified for the police to execute them instead because they would get \"exactly the treatment from the police that they want the police to do to gay people\"?", 
   {}, 
   245102, 
   null, 
   1167341940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  THe police did nothing wrong", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9369-police-did-nothing-wrong.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9369, 
  "discussion_files": [
   [
    "29077.html", 
    "http://www.4forums.com/political/gay-rights-debates/9369-police-did-nothing-wrong-print.html"
   ]
  ], 
  "identifier": 9369
 }
]