[
 [
  [
   245015, 
   null, 
   "Jim Colyer", 
   "Ford was the oldest president even though both he and Ronald Reagan made it to 93. Reagan was born February 6, 1911 and died June 5, 2004. Ford was born July 14, 1913 and died December 26, 2006. \n \n Ford was 46 days older than Reagan. \n \n US Presidents http://jimcolyer.com/papers/entry?id=50", 
   {
    "post_info": {
     "post_title": "Gerald Ford oldest president"
    }
   }, 
   null, 
   null, 
   1167266220.0
  ], 
  [
   245035, 
   null, 
   "Baron", 
   "I believe Jim Colyer's curt note was the only comment in this forum about the death of a human being who was one of the presidents of this country. That silence speaks volumes.\n \n Gerald Ford was a decent man, and I would like to express my heartfelt sympathy and condolences to his family.", 
   {}, 
   245015, 
   null, 
   1167281820.0
  ], 
  [
   245068, 
   null, 
   "jitobear", 
   "Ford is the first preseident I remember. Nixon was president when I was born, but I didn't know the president from Mickey Mouse until I was in about kindergarden. I remember seeing Ford on the cover of Time Magazine and I think I likely asked my mother who he was.", 
   {}, 
   245035, 
   null, 
   1167322380.0
  ], 
  [
   245091, 
   null, 
   "georged", 
   "Ford's comments on current administration invading Iraq, taken in 2004 and not to be released until after his death, are interesting. Both Cheney and Rummy served in Ford's administration.", 
   {}, 
   245068, 
   null, 
   1167332340.0
  ], 
  [
   245221, 
   null, 
   "IceWind", 
   "I was saddened to hear of this loss. He was a good man.", 
   {}, 
   245091, 
   null, 
   1167433320.0
  ], 
  [
   245399, 
   null, 
   "mae", 
   "I believe Jim Colyer's curt note was the only comment in this forum about the death of a human being who was one of the presidents of this country. That silence speaks volumes.\n \n Gerald Ford was a decent man, and I would like to express my heartfelt sympathy and condolences to his family.\n\n \n \n Exactly Baron, He was a good person and even though he only served for a little more than 2 years, he was a breath of fresh air after the watergate scandals. \n \n Even though he was widely criticised for pardoning Nixon, he spared the country a nightmare. It took guts to pardon Nixon at a time when Nixon was viewed as the devil incarnate by so many.", 
   {}, 
   245035, 
   null, 
   1167621780.0
  ], 
  [
   245404, 
   null, 
   "JPSartre12", 
   "Exactly Baron, He was a good person and even though he only served for a little more than 2 years, he was a breath of fresh air after the watergate scandals. \n \n Even though he was widely criticised for pardoning Nixon, he spared the country a nightmare. It took guts to pardon Nixon at a time when Nixon was viewed as the devil incarnate by so many.\n\n \n Agreed. But I have to admit that Saturday Night Live ruined my ability to think of Ford as anything other than a clumsy president with a poor golf swing. :)", 
   {}, 
   245399, 
   null, 
   1167625380.0
  ], 
  [
   245407, 
   null, 
   "mae", 
   "Agreed. But I have to admit that Saturday Night Live ruined my ability to think of Ford as anything other than a clumsy president with a poor golf swing. :)\n\n \n \n I saw some re-runs of Saturday Night Live and you are right, Ford was mercilessly pilloried as a klutz. \n \n Ford's clumsiness was rather surprising considering the fact that he was good athelete in his younger days. \n \n But all in all, he was what the country needed after the tumultuous watergate years...normalcy. He was the right man for the right time.", 
   {}, 
   245404, 
   null, 
   1167627300.0
  ], 
  [
   246125, 
   null, 
   "JPSartre12", 
   "I saw some re-runs of Saturday Night Live and you are right, Ford was mercilessly pilloried as a klutz. \n \n Ford's clumsiness was rather surprising considering the fact that he was good athelete in his younger days. \n \n But all in all, he was what the country needed after the tumultuous watergate years...normalcy. He was the right man for the right time.\n\n \n In reality, Ford was probably the most athletic president ever. He could have gone on to play in the NFL, but chose law school instead. It was said that, even in his later years, he was a good skier.", 
   {}, 
   245407, 
   null, 
   1168047660.0
  ], 
  [
   246152, 
   null, 
   "mae", 
   "In reality, Ford was probably the most athletic president ever. He could have gone on to play in the NFL, but chose law school instead. It was said that, even in his later years, he was a good skier.\n\n \n \n The NFL ? Wow, I didn't realize he was that good ! \n But you are probably right, he was a damn good athlete and the fact that he lived up to the ripe old age of 93 says it all. \n \n I remember seeing him at Reagan's funeral and was amazed at the way he walked in steadily...and this when he was in his 90's.", 
   {}, 
   246125, 
   null, 
   1168057740.0
  ], 
  [
   247945, 
   null, 
   "gman", 
   "A gifted athlete, Gerald Ford played center for the University of Michigan football team. He was a member of the University's national championship football teams in 1932 and 1933, and was voted the team's most valuable player in 1934. On January 1, 1935, he played in the annual East-West College All-Star game in San Francisco. In August 1935, he played center on the college team that lost to the Chicago Bears, 5 to 0, in the 1935 All-Star Football Game.\n He was the only player to tackle the Heisman Trophy winner behind the line of scrimmage in the first season of the awarding of the Heisman Trophy. \n \n Both the Detroit Lions and the Green Bay Packers offered Ford a contract to play professional football, but Ford had decided to pursue a law career and declined both offers. He did, however, accept a position as assistant varsity football coach and coach of the boxing team at Yale University, where he hoped to attend law school. He resigned that job upon being admitted to the Yale Law School in 1938.", 
   {}, 
   246152, 
   null, 
   1169350320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gerald Ford oldest president", 
  "url": "http://www.4forums.com/political/current-events-debates/9378-gerald-ford-oldest-president.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 9378, 
  "discussion_files": [
   [
    "26168.html", 
    "http://www.4forums.com/political/current-events-debates/9378-gerald-ford-oldest-president-print.html"
   ]
  ], 
  "identifier": 9378
 }
]