[
 [
  [
   245426, 
   null, 
   "Shooterandproud", 
   "I've been thinking of the reasons people go pro-choice or pro-life, and to me it seems that the pro-choice stance has overwhelming proof on their side. Lets take a look:\n \n \n Reasons for Pro-life:\n \n 1)Protecting the \"innocent\" baby or embryo or whatever\n \n 2)Earining brownie points in heavan\n \n I can't think of anymore, please post and i'll add to the list.\n \n Reasons for pro-choice:\n \n 1)This is a woman's body, not yours, not mine, and certainly not the governments.\n \n 2)An embryo can not make a decision, but a mother knows her circumstances best, therefore she should choose for the both.\n \n 3)An Embryo is not a sentient life form, and does not posses self awareness or consciousness, or to quote Another Opinion: \"Mentally exist\". \n \n 4)The only thing an embryo and humans have in common is a strand of DNA.\n \n 5)Abortion has some positive effects on society, as in the book Freakonomics by um... forgot the guy, Steve something, the author cites that the legalization of abortions caused a rapid decrease in crime, which makes sense if you think about it. Unwanted children are 10X more likely to become criminals.\n \n 6)And embryo does not have a 100% possiblilty of growing into a human being. 20% of pregnancies end in a miscarrige.\n \n 7)Birth control is not 100% effective. As I have said before, my friend's mom had her sister on the pill. Even though this makes up a small percentage of abortion, it still makes up some percentage, which is reason enough.\n \n 8)Being forced to carry through and unwanted pregnancy can have devastating effects on a women, namely financially and emotionally.\n \n \n In conclusion, I quote Mr. Richard C. Carrier:\n \n \"First, abortion is a notable benefit to society. The harm to a society that is caused by an excess of unchecked population growth is severe and well-documented. The ability of societies to check population growth without legalizing abortion has proven nearly non-existent: there are few countries in which abortion is outlawed or stigmatized that are not suffering harshly from overcrowding, with all the attendant economic, criminal, or political troubles. In contrast, most nations that allow the procedure are maintaining stable populations with nearly zero growth, and exhibiting more or less general prosperity. From a purely pragmatic perspective aimed at the interests of the commonwealth, abortion is at best a great benefit to mankind and at worst a necessary evil. And for women who regard zero growth as a moral imperative, abortion can even be a moral necessity from their point of view--although this would be better called a matter of principle, so as to distinguish this personal belief from the morally universal.\n \n Second, abortion is a significant benefit for the individual woman. The risks of death or permanent disability certainly must be greater for a woman who carries a fetus to term and bears a child, prematurely or not, than for a woman who aborts before the third trimester of her pregnancy. And the social and economic ruin that can ensue from an untimely motherhood is a serious harm as well, and although this could be alleviated by recourse to adoption, free medical care for pregnant women, and public welfare for women unable to work as a consequence of their pregnancy, these solutions are not as simple as they sound, and are not so universally available as people might think (even the United States, among the wealthiest of nations, has no such welfare system in place, not to mention a very poor excuse for a medicare system, and there is no desirable option for orphans in nations like India or Chad). Moreover, the potential physical harm from bearing a child simply cannot be alleviated. Abortion thus supplies some benefit for many women.\n \n \n An act that causes no involuntary harm and produces some benefits for individuals and society in general should never be outlawed. This is based on the principle that laws should only exist to preserve and protect the liberty of individuals and, when no liberty is at stake either way, to increase the general welfare of all citizens. Whether that principle is misinformed remains to be seen. But from the above analysis, there appears no way in which outlawing abortion would even indirectly preserve or protect the liberty of any individual, or provide any general benefit to the citizen body without uneccessarily depriving individuals of their liberty.\"", 
   {
    "post_info": {
     "post_title": "Why Pro-life?"
    }
   }, 
   null, 
   null, 
   1167681960.0
  ], 
  [
   245432, 
   null, 
   "dislexia", 
   "Other reasons for pro life\n \n You do not know who you are aborting, they could be a future presidant or a nobel peace prize winner.\n \n In many states, if a mother can't or won't raise her child, she can drop them of at her local fier station (and hospital) with no questions asked. \n \n You would be destroying whole generations to come. (that baby leads to more babys....)\n \n Babys are the outcome of sex, If you don't want a baby, don't have sex!!!!!! \n \n If the case is rape, well, give the baby to adoption and insted of founding abortion, help fight rapeists with organisations like \"just yell fire\". \n \n Abortion leads to cancer", 
   {
    "post_info": {
     "post_title": "more pro life reasons"
    }
   }, 
   245426, 
   null, 
   1167684660.0
  ], 
  [
   245438, 
   null, 
   "DrNo", 
   "The basis of the pro-choice argument appears to be that more developed human beings have superior rights. Life begins at conception, and I really don't understand how any being with intelligence can think differently. I'm not the one making hypothetical \"talking flower pot\" scenarios to illustrate my point, because my point of view makes the most logical sense without having to rationalize anything.", 
   {}, 
   245432, 
   null, 
   1167689880.0
  ], 
  [
   245476, 
   null, 
   "ShadowPikachu", 
   "Other reasons for pro life\n \n You do not know who you are aborting, they could be a future presidant or a nobel peace prize winner.\n\n \n You could also be aborting a future Hitler, Castro, Stalin, or Mao? What if they were the next Timothy McVeigh. As you can see, this argument is fallacious and can be used for either side of the issue.\n \n \n\n You would be destroying whole generations to come. (that baby leads to more babys....)\n So, if there was a way to know that that baby would be infertile it would be alright in your view to abort?\n \n \nAbortion leads to cancer\n\n This is a very controversial issue that you are stating here as a fact. At best, it is just a scientific hypothesis, and no conclusive scientific findings have been made on this issue. It is rather dishonest of you to state it as a fact when it is anything but.", 
   {}, 
   245432, 
   null, 
   1167713760.0
  ], 
  [
   245487, 
   null, 
   "Shooterandproud", 
   "Other reasons for pro life\n \n You do not know who you are aborting, they could be a future presidant or a nobel peace prize winner.\n\n \n That is extremely flawed logic. What if one of those eggs is a nobel peace prize winner? Should we force all women to fertilize their eggs? Should everyone be forced to have sex 24/7 because the people may be someone?\n \n \n \n \n \n \nIn many states, if a mother can't or won't raise her child, she can drop them of at her local fier station (and hospital) with no questions asked.\n\n \n I would've added this, but this can have devastating emotional effects, knowing your child is out there somewhere.\n \n \n \n \n \n \nYou would be destroying whole generations to come. (that baby leads to more babys....)\n\n \n That is good. We need population control, as overpopulation is a problem to come.\n \n \nBabys are the outcome of sex, If you don't want a baby, don't have sex!!!!!!\n\n \n I only wish it were so simple.\n \n \n \n \nIf the case is rape, well, give the baby to adoption and insted of founding abortion, help fight rapeists with organisations like \"just yell fire\".\n\n \n Abortion is always ok in rape or incest hands down. A woman should not have to pay for the crinimality of the rapist.\n \n \n \n \nAbortion leads to cancer\n\n \n Will post if you back this up.", 
   {}, 
   245432, 
   null, 
   1167723660.0
  ], 
  [
   245488, 
   null, 
   "Shooterandproud", 
   "The basis of the pro-choice argument appears to be that more developed human beings have superior rights. Life begins at conception, and I really don't understand how any being with intelligence can think differently.\n\n \n \n I don't understand how people think a zygote deserves the same rights as human being, thus harming human beings. Human beings, or personhood, begins at first sign of intelligence or self awareness. There is no basis for rights without that, as it is what makes humans unique. We don't give animals the same rights as humans and animals DO have intelligence. In fact, hunting is legal, and animals do posses intellgence. So, why should something that possesses NO intelligence have more rights than lives that do?\n \n \n \n \n \n \nI'm not the one making hypothetical \"talking flower pot\" scenarios to illustrate my point, because my point of view makes the most logical sense without having to rationalize anything.\n\n \n I beg to differ. I still fail to see any logic or reasoning in your argument. Embryos are not human beings. They do not posses intelligence, heck, they don't even posses limbs. They are really only a clump of floating flesh living parasitically off of its host: the woman. The only think that it and a human have in common is a strand of dna, nothing more. I don't see how anyone with considerable intelligence can consider it a human.", 
   {}, 
   245438, 
   null, 
   1167724020.0
  ], 
  [
   245510, 
   null, 
   "gman", 
   "I've been thinking of the reasons people go pro-choice or pro-life, and to me it seems that the pro-choice stance has overwhelming proof on their side. \n\n \n \n Did your thought process ever include the question: What choice does the \"victim\" have? Does the instinct to survive exist in the helpless? The being that is totally dependent on the being that brought about it's existence becoming a victim of that being entrusted with it's safe keeping? \n \n The act of giving thought as to how to excuse the act of betraying the most basic trust a being can bring upon themselves through lack of forethought and disregard for sacred life should be quite embarrassing.", 
   {}, 
   245426, 
   null, 
   1167760080.0
  ], 
  [
   245515, 
   null, 
   "ShadowPikachu", 
   "Did your thought process ever include the question: What choice does the \"victim\" have? \n\n \n It has no choice whatsoever as it cannot make a choice. You see, most abortions occur early, before a brain is even developed. Without the awareness that develops after a brain is formed and the onnections in the neurons begin to be made, the foetus cannot make any sort of choice as it is not mentally existant, and your question is fundamentally flawed.", 
   {}, 
   245510, 
   null, 
   1167763380.0
  ], 
  [
   245532, 
   null, 
   "simone", 
   "Women are human beings with rights and should be treated as such, rather than as breeding machines.", 
   {}, 
   245515, 
   null, 
   1167766980.0
  ], 
  [
   245534, 
   null, 
   "Shooterandproud", 
   "Did your thought process ever include the question: What choice does the \"victim\" have? Does the instinct to survive exist in the helpless? The being that is totally dependent on the being that brought about it's existence becoming a victim of that being entrusted with it's safe keeping\n\n \n You mean like a tapeworm? Should removing tapeworms be illegal too?\n \n \n \n \n \n \n \nThe act of giving thought as to how to excuse the act of betraying the most basic trust a being can bring upon themselves through lack of forethought and disregard for sacred life should be quite embarrassing.\n\n \n I don't follow you here. Can you back up your little sacred \"trust\" theory? There is no trust between an embryo and a woman. An embryo cannot feel trust, it cannot even feel itself. Its really only a hunk of cells, and saying that it trusts the woman is like me saying that the flowers in my garden trust me to water them. And, at what point does a life become \"sacred\". I'm sure you've weeded your garden, is that an embarrasing disregard for sacred life? Is hunting an embarrassing disregard for sacred life? By your logic, i can call almost anything a \"sacred life\".", 
   {}, 
   245510, 
   null, 
   1167767100.0
  ], 
  [
   245538, 
   null, 
   "Shooterandproud", 
   "Women are human beings with rights and should be treated as such, rather than as breeding machines.\n\n \n I agree, women are not child bearing cubicles thats only function in life is to have babys. What trouble's me is that, if men had to go through what women did in pregnancy, the pro-life movement would be totally non-existant. Men are really not capable of being pro-life without being a hypocryte, as they have not experienced pregnancy. Why that is not true of the pro-choice side, is that we let the women choose, and she can choose both ways if she wishes. The pro-life movement involves force and blatant disregard for rights of the women, to the point of violation, yet the men have almost no knowledge of what it is like to get pregnant or have babies. Many pro-life men do know what raising a child is like, but they do not know what raising a child is like when you are a 14 year old girl with three kids already and no money. Yes, not all abortions go this way, but some do, and thats the point. You don't know every women's circumstances, and until you do, you are in no position to force her to abide by your morals, and thus harming her.", 
   {}, 
   245532, 
   null, 
   1167767460.0
  ], 
  [
   245796, 
   null, 
   "ShadowPikachu", 
   "I agree, women are not child bearing cubicles thats only function in life is to have babys. What trouble's me is that, if men had to go through what women did in pregnancy, the pro-life movement would be totally non-existant. Men are really not capable of being pro-life without being a hypocryte, as they have not experienced pregnancy. Why that is not true of the pro-choice side, is that we let the women choose, and she can choose both ways if she wishes. The pro-life movement involves force and blatant disregard for rights of the women, to the point of violation, yet the men have almost no knowledge of what it is like to get pregnant or have babies. Many pro-life men do know what raising a child is like, but they do not know what raising a child is like when you are a 14 year old girl with three kids already and no money. Yes, not all abortions go this way, but some do, and thats the point. You don't know every women's circumstances, and until you do, you are in no position to force her to abide by your morals, and thus harming her.\n\n \n Exactly. I think I heard that men make up over 70% of anti-choicers. Just look at how many that is, and yet, not a single one of them will ever become pregnant. You are definately right that if men could become pregnant, there would be virtually no anti-choice movement in existence (maybe a few small pockets here and there, but no organized movement), and no large argument over abortion. Instead, we get stuck with a bunch of people who for the most part never have to worry about becoming pregnant, trying to make choices and decisions for women who should be able to make those decisions for themselves.", 
   {}, 
   245538, 
   null, 
   1167889560.0
  ], 
  [
   246307, 
   null, 
   "jyoshu", 
   "Exactly. I think I heard that men make up over 70% of anti-choicers. Just look at how many that is, and yet, not a single one of them will ever become pregnant. You are definately right that if men could become pregnant, there would be virtually no anti-choice movement in existence (maybe a few small pockets here and there, but no organized movement), and no large argument over abortion. Instead, we get stuck with a bunch of people who for the most part never have to worry about becoming pregnant, trying to make choices and decisions for women who should be able to make those decisions for themselves.\n\n \n You'd definitely have at least one \"anti-choicer\" in the world if all men got pregnent too: my wife. She's had pregnancies and she's a lot more pro-life than most men you'll ever meet, including me.\n \n I also kindly ask that you please stick to the standard terms for people with this issue: 'pro-life' and 'pro-choice'. Rather than things like \"anti-choice\" or \"anti-life.\" Theres really no need for it--it only serves to aggravate people when you do that. (If I call you \"anti-life\" instead of \"pro-choice\", you probably wouldn't like that, I suspect!) And surely you aren't just out to aggravate people.", 
   {}, 
   245796, 
   null, 
   1168205100.0
  ], 
  [
   246316, 
   null, 
   "ShadowPikachu", 
   "You'd definitely have at least one \"anti-choicer\" in the world if all men got pregnent too: my wife. She's had pregnancies and she's a lot more pro-life than most men you'll ever meet, including me.\n \n I also kindly ask that you please stick to the standard terms for people with this issue: 'pro-life' and 'pro-choice'. Rather than things like \"anti-choice\" or \"anti-life.\" Theres really no need for it--it only serves to aggravate people when you do that. (If I call you \"anti-life\" instead of \"pro-choice\", you probably wouldn't like that, I suspect!) And surely you aren't just out to aggravate people.\n\n \n Well, if you had taken the care to actually read my post, I did not say there would be no anti-choicers. I said there would be only small pockets of them here an there. I would think that was obvious if the men make up a little of 70%, but apparently not.\n \n As to the second part of your post, I'll kindly say that I can use whatever term I please. If you don't like it, don't read it. I certainly would not care if you called me anti-life, because I'd know it was false as I am supporting abortions of foetuses, not living human beings (except of course my support of partial birth abortions in cases where a women might die or be severely harmed if it goes through). On the other hand, I can accurately say anti-choice, as you and your ilk want to take away the choice of an abortion from a woman. See the difference?", 
   {}, 
   246307, 
   null, 
   1168213680.0
  ], 
  [
   246324, 
   null, 
   "jyoshu", 
   "As to the second part of your post, I'll kindly say that I can use whatever term I please. If you don't like it, don't read it. I certainly would not care if you called me anti-life, because I'd know it was false as I am supporting abortions of foetuses, not living human beings (except of course my support of partial birth abortions in cases where a women might die or be severely harmed if it goes through). On the other hand, I can accurately say anti-choice, as you and your ilk want to take away the choice of an abortion from a woman. See the difference?\n\n \n Nope, sorry, you are indeed anti-life, because you are for killing the unborn, which is human life. You see? It is just as accurate to call you anti-life as it is for you to call pro-lifers anti-choice.\n \n The best way to approach it, IMO, is to use terms that don't intentionally make the other side out to look bad--it is also accurate to say that prolifers are pro-life, because they are against killing human life. Just as it is also accurate to call an anti-lifer \"pro-choice\"--they are indeed for freedom of choice to destroy human life. I believe constructive dialogue is best rather than intentionally using terms you know will put people off. Don't you agree?\n \n And really, there's no need to so easily getr defensive every time someone disagrees with you on something here. There's nothing wrong with saying \"ok, I'll consider that.\" No one said you had to stop calling people anti-choice. But know that if you use terms like that, you're more likely to have the same tactics used against you and someone may call you an 'anti-lifer'--they'd be completely justified in doing so. So I merely suggest not using a tactic at all and use constructive terminolgy that you know won't aggravate others. Can't you agree that's the better way?", 
   {}, 
   246316, 
   null, 
   1168220700.0
  ], 
  [
   246327, 
   null, 
   "Shooterandproud", 
   "You'd definitely have at least one \"anti-choicer\" in the world if all men got pregnent too: my wife. She's had pregnancies and she's a lot more pro-life than most men you'll ever meet, including me.\n \n I also kindly ask that you please stick to the standard terms for people with this issue: 'pro-life' and 'pro-choice'. Rather than things like \"anti-choice\" or \"anti-life.\" Theres really no need for it--it only serves to aggravate people when you do that. (If I call you \"anti-life\" instead of \"pro-choice\", you probably wouldn't like that, I suspect!) And surely you aren't just out to aggravate people.\n\n \n First of all, we didn't say that there would be no pro-lifers, we'd just say that there wouldn't be many. Kind of like the Nazis. Second, it would not be accurate to call us \"anti-life\" because we are not advocating the abortion of every fetus. However, it would be accurate to call you \"anti-choice\" because you do advocate force of the carrying out of unplanned pregnancies.", 
   {}, 
   246307, 
   null, 
   1168223580.0
  ], 
  [
   246330, 
   null, 
   "Shooterandproud", 
   "Nope, sorry, you are indeed anti-life, because you are for killing the unborn,\n\n \n Actually, we are not. We wouldn't care if a woman aborted or not, its her choice. We don't want the embryo to be aborted, however the anti-choicers do want her to carry through with an unplanned pregnancy.\n \n \n \n \n \n \nwhich is human life.\n\n \n My kidney is human life. Please be more descriptive.\n \n \n \n \nYou see? It is just as accurate to call you anti-life as it is for you to call pro-lifers anti-choice.\n\n \n Nope, sorry. You have the disadvantage here.\n \n \n \n \n \n \nThe best way to approach it, IMO, is to use terms that don't intentionally make the other side out to look bad\n\n \n I agree, however anti-choice is a 100% accurate way to describe pro-lifers, but anti-life is an inaccurate way to describe pro-choicers.\n \n \n \n \n \n--it is also accurate to say that prolifers are pro-life,\n\n \n Actually, thats not always so. Whether the embryo is an intelligent life form is still under debate, but I guess you can call them pro-life since scientifically it is made of organic material.\n \n \n \n \n \nbecause they are against killing human life.\n\n \n Not so. Well, sort of. My fingernail is human life, and i've seen pro-lifers cut their fingernails, so i really don't think thats accurate.\n \n \n \n \n \n \nJust as it is also accurate to call an anti-lifer \"pro-choice\"--\n\n \n Actually, it would be accurate to call an anti-lifer \"pro-abortion\", because an anti-lifer would advocate the abortion of every embryo.\n \n \n \n \n \n \nthey are indeed for freedom of choice to destroy human life.\n\n \n Pro-lifers destroy human life all of the time, they cut their nails, donate blood, trim their hair, however if an embryo is an intelligent life is still under debate, therefore it would be inaccurate to call any pro-choicer a \"murderer\" etc. However, what is not under dispute is that pro-choicers advocate choice and civil rights for women, even pro-lifers agree with that part, therefore we are surely pro-choice. However, \"anti-choice\" actually can describe you more accurately that \"pro-life\", because \"pro-life\" is still under dispute, but \"anti-choice\" is a known fact, inflammatory connotations aside. \n \n \n \n \n \nI believe constructive dialogue is best rather than intentionally using terms you know will put people off. Don't you agree?\n\n \n I do, however don't get that mixed up with trying to credit non-factual inflammatory remarks with factual ones.\n \n \n \n \n \nAnd really, there's no need to so easily getr defensive every time someone disagrees with you on something here. There's nothing wrong with saying \"ok, I'll consider that.\"\n\n \n Its not the fact that people disagree that sometimes can bother me, it is their ignorance to science or facts, and blindness by religion that can sometimes hit a nerve. Keep in mind that we have all considered out positions very carefully.\n \n \n \n \n \nNo one said you had to stop calling people anti-choice. But know that if you use terms like that, you're more likely to have the same tactics used against you and someone may call you an 'anti-lifer'\n\n \n I agree that we shouldn't be using those terms, but \"anti-lifer\" is just an inaccurate description, that carries no weight, unlike \"anti-choicer\".\n \n \n \n \n \n--they'd be completely justified in doing so. So I merely suggest not using a tactic at all and use constructive terminolgy that you know won't aggravate others. Can't you agree that's the better way?\n\n \n Agreed, we're just saying that \"anti-life\" makes no sense and is a completely false statement.", 
   {}, 
   246324, 
   null, 
   1168225380.0
  ], 
  [
   246357, 
   null, 
   "ShadowPikachu", 
   "Nope, sorry, you are indeed anti-life, because you are for killing the unborn, which is human life. You see? It is just as accurate to call you anti-life as it is for you to call pro-lifers anti-choice.\n \n The best way to approach it, IMO, is to use terms that don't intentionally make the other side out to look bad--it is also accurate to say that prolifers are pro-life, because they are against killing human life. Just as it is also accurate to call an anti-lifer \"pro-choice\"--they are indeed for freedom of choice to destroy human life. I believe constructive dialogue is best rather than intentionally using terms you know will put people off. Don't you agree?\n \n And really, there's no need to so easily getr defensive every time someone disagrees with you on something here. There's nothing wrong with saying \"ok, I'll consider that.\" No one said you had to stop calling people anti-choice. But know that if you use terms like that, you're more likely to have the same tactics used against you and someone may call you an 'anti-lifer'--they'd be completely justified in doing so. So I merely suggest not using a tactic at all and use constructive terminolgy that you know won't aggravate others. Can't you agree that's the better way?\n\n \n Nope, sorry, I'm not for killing the unborn. I'm for allowing women to have the option of terminating the development of a foetus, which is not a living human (once again, I support actually aborting a developed baby if the woman's life or health is at risk) So, it is not accurate to call me prolife.\n \n The way I see it, the medical requirement for death is when there is no brain activity. Therefore, the medical requirement for life would be when there IS brain activity (around the third trimester or so if I recall correctly). Although there is no OFFICIAL definition made yet, I have total faith that it will be defined in the next decade or so just like that. It is really the only logical definition (otherwise we might say a person is not dead until all of the cells in their body have died/decayed).\n \n However, your movement IS trying to take away that choice from the woman to have an abortion, hence anti-choice being accurate.\n \n Oh, and, even if your definition was correct (which I have proven it is not), it would still be inaccurate, as we are not making people have abortions, merely making sure they have a choice.", 
   {}, 
   246324, 
   null, 
   1168239960.0
  ], 
  [
   246380, 
   null, 
   "jyoshu", 
   "Nope, sorry, I'm not for killing the unborn. I'm for allowing women to have the option of terminating the development of a foetus, which is not a living human (once again, I support actually aborting a developed baby if the woman's life or health is at risk) So, it is not accurate to call me prolife.\n\n \n Then to some extent, you are for killing the unborn. You can't have one without the other. Better to swallow that and go on, rather than trying to convince yourself otherwise. If you really believe in your cause, they you shouldn't be taking a statement like \"anti-lifer\" in a negative way to begin with.\n \n \nThe way I see it, the medical requirement for death is when there is no brain activity. Therefore, the medical requirement for life would be when there IS brain activity (around the third trimester or so if I recall correctly).\n\n \n Brain activity as defined how? Certainly there is brain activity much earlier than the the 3rd trimester in terms of involuntary control of things like heart rate and synapses firing. My preferred way to think of it is viability outside the womb. At what point are premature babies viable? To me that's when the line should be drawn; What you call a fetus is in fact a premature baby.\n \n \nHowever, your movement IS trying to take away that choice from the woman to have an abortion, hence anti-choice being accurate.\n\n \n Just as your movement is for destroying unborn life in some situations. Still fits--it's IS 'anti-life.'\n \n \nOh, and, even if your definition was correct (which I have proven it is not), it would still be inaccurate, as we are not making people have abortions, merely making sure they have a choice.\n\n \n Well you're certainly making it to where a lot of unborn babies will have to die rather than even factoring their viability and potential life ahead into the equation..", 
   {}, 
   246357, 
   null, 
   1168272840.0
  ], 
  [
   246384, 
   null, 
   "ShadowPikachu", 
   "Then to some extent, you are for killing the unborn. You can't have one without the other. Better to swallow that and go on, rather than trying to convince yourself otherwise. If you really believe in your cause, they you shouldn't be taking a statement like \"anti-lifer\" in a negative way to begin with.\n \n \n \n Brain activity as defined how? Certainly there is brain activity much earlier than the the 3rd trimester in terms of involuntary control of things like heart rate and synapses firing. My preferred way to think of it is viability outside the womb. At what point are premature babies viable? To me that's when the line should be drawn; What you call a fetus is in fact a premature baby.\n \n \n \n Just as your movement is for destroying unborn life in some situations. Still fits--it's IS 'anti-life.'\n \n \n \n Well you're certainly making it to where a lot of unborn babies will have to die rather than even factoring their viability and potential life ahead into the equation..\n\n \n Well I guess you are right in a way. I would not care if you called me \"partially anti-life\". That would not bother me as it would be easy for me to say exactly how I am that (if the woman's life or health is in jeopardy). I'd have no problem with that, so go ahead, I would accept that use. That means, however, by your argument you are accepting the use of the term anti-choice (to describe those who want to ban abortions)\n \n And no, in the other cases it has nothing to do with unborn babies, it has to do with undeveloped foetuses that are not even alive or aware yet (mentally aware - as I know you will be nitpicky about awareness, and yes, it can be determined by brain activity).\n \n And as to your brain activity part, well, viability outside the womb usually includes brain activity, so it seems like YOUR definition would be a later term than mine.", 
   {}, 
   246380, 
   null, 
   1168277880.0
  ], 
  [
   246402, 
   null, 
   "Bell", 
   "I've been thinking of the reasons people go pro-choice or pro-life, and to me it seems that the pro-choice stance has overwhelming proof on their side. Lets take a look:\n \n \n Reasons for Pro-life:\n \n 1)Protecting the \"innocent\" baby or embryo or whatever\n \n 2)Earining brownie points in heavan\n \n I can't think of anymore, please post and i'll add to the list.\n \n Reasons for pro-choice:\n \n 1)This is a woman's body, not yours, not mine, and certainly not the governments.\n \n 2)An embryo can not make a decision, but a mother knows her circumstances best, therefore she should choose for the both.\n \n 3)An Embryo is not a sentient life form, and does not posses self awareness or consciousness, or to quote Another Opinion: \"Mentally exist\". \n \n 4)The only thing an embryo and humans have in common is a strand of DNA.\n \n 5)Abortion has some positive effects on society, as in the book Freakonomics by um... forgot the guy, Steve something, the author cites that the legalization of abortions caused a rapid decrease in crime, which makes sense if you think about it. Unwanted children are 10X more likely to become criminals.\n \n 6)And embryo does not have a 100% possiblilty of growing into a human being. 20% of pregnancies end in a miscarrige.\n \n 7)Birth control is not 100% effective. As I have said before, my friend's mom had her sister on the pill. Even though this makes up a small percentage of abortion, it still makes up some percentage, which is reason enough.\n \n 8)Being forced to carry through and unwanted pregnancy can have devastating effects on a women, namely financially and emotionally.\n \n \n \n\n \n Here is another perspective for the prolife argument, from feministsforlife.org: \"Feminists for Life of America recognizes that abortion is a reflection that our society has failed to meet the needs of women.\" Also, \"[We] believe no woman should be forced to choose between pursuing her education and career plans and ...her child\".\n \n I absolutely agree with these tenants, however I find it mildly ironic that a feminist organization wants to tell me what to do with my uterus. Plus, 'should be' reasoning isn't realistic.", 
   {}, 
   245426, 
   null, 
   1168287840.0
  ], 
  [
   246419, 
   null, 
   "Steeeeve", 
   "I'm for allowing women to have the option of terminating the development of a foetus, which is not a living human (once again, I support actually aborting a developed baby if the woman's life or health is at risk)\n\n Emphasis mine\n \n You realize the fetus (or foetus) is a living human, right? And by living human I mean the noun sense of the word since Shooter loves playing tense games.\n \n http://dictionary.reference.com/browse/human%20being\n \n The fetus qualifies the criteria", 
   {}, 
   246357, 
   null, 
   1168294020.0
  ], 
  [
   246420, 
   null, 
   "ShadowPikachu", 
   "Emphasis mine\n \n You realize the fetus (or foetus) is a living human, right? And by living human I mean the noun sense of the word since Shooter loves playing tense games.\n \n http://dictionary.reference.com/browse/human%20being\n \n The fetus qualifies the criteria\n\n \n No it does not. It is made up of living human cells, yes, but it of itself is not yet living or even having a chance of living outside the womb.", 
   {}, 
   246419, 
   null, 
   1168294260.0
  ], 
  [
   246482, 
   null, 
   "dislexia", 
   "No it does not. It is made up of living human cells, yes, but it of itself is not yet living or even having a chance of living outside the womb.\n\n \n It is to a liveing human. \n How can you say that you were once just a cluster of human cells.....\n How can you say that about anyone........\n The choice is not \"To or not to give birth, The question is to, or not to have sex\n Babys are the outcome of sex, if you do not want a baby, dont start the process to get one.....", 
   {}, 
   246420, 
   null, 
   1168326600.0
  ], 
  [
   246483, 
   null, 
   "dislexia", 
   "Well I guess you are right in a way. I would not care if you called me \"partially anti-life\". That would not bother me as it would be easy for me to say exactly how I am that (if the woman's life or health is in jeopardy). I'd have no problem with that, so go ahead, I would accept that use. That means, however, by your argument you are accepting the use of the term anti-choice (to describe those who want to ban abortions)\n \n And no, in the other cases it has nothing to do with unborn babies, it has to do with undeveloped foetuses that are not even alive or aware yet (mentally aware - as I know you will be nitpicky about awareness, and yes, it can be determined by brain activity).\n \n And as to your brain activity part, well, viability outside the womb usually includes brain activity, so it seems like YOUR definition would be a later term than mine.\n\n \n actualy they are not saying that they are anti-choice (in my opinion and understanding of these posts)\n Instead, I think that the \"Choice\" should be made by simply not haveing sex, or haveing sex (depending on if or if not you want a kid)", 
   {}, 
   246384, 
   null, 
   1168327260.0
  ], 
  [
   246486, 
   null, 
   "ShadowPikachu", 
   "It is to a liveing human. \n How can you say that you were once just a cluster of human cells.....\n How can you say that about anyone........\n The choice is not \"To or not to give birth, The question is to, or not to have sex\n Babys are the outcome of sex, if you do not want a baby, dont start the process to get one.....\n\n \n I can very easily say that about myself and about anyone, because it is the truth whether you like it or not.", 
   {}, 
   246482, 
   null, 
   1168327860.0
  ], 
  [
   246487, 
   null, 
   "ShadowPikachu", 
   "actualy they are not saying that they are anti-choice (in my opinion and understanding of these posts)\n Instead, I think that the \"Choice\" should be made by simply not haveing sex, or haveing sex (depending on if or if not you want a kid)\n\n \n Unfortunately, abortion has to do with what can happen after sex, so it is two different things. Pro-choice and anti-choice involves whether or not abortion should be allowed You see, the anti-choice refers to them wanting to deny women the choice of an abortion. Abstinence from sex is a whole other issue, one that is not the topic of this thread and will not be discussed here (if you want to discuss it, start a new thread, don't hijack this one), and that is all I'm planning on saying on the issue.", 
   {}, 
   246483, 
   null, 
   1168328100.0
  ], 
  [
   246551, 
   null, 
   "Shooterandproud", 
   "It is to a liveing human. \n How can you say that you were once just a cluster of human cells.....\n How can you say that about anyone........\n\n \n Well, because it kind of is. Its really only a floating watersack living parasitically off of a woman's body. I see no reason why it should be equated to a human.\n \n \n \n \n \nThe choice is not \"To or not to give birth, The question is to, or not to have sex\n Babys are the outcome of sex, if you do not want a baby, dont start the process to get one.....\n\n \n Its a bit late for that now, and many people aren't properly educated.", 
   {}, 
   246482, 
   null, 
   1168392240.0
  ], 
  [
   246585, 
   null, 
   "Steeeeve", 
   "No it does not. It is made up of living human cells, yes, but it of itself is not yet living or even having a chance of living outside the womb.\n\n You are made up of living human cells....believe it or not.\n \n The definition is as follows: a member of the species Homo sapiens.\n \n The fetus is a member of the species Homo sapiens no matter how many times you cover your ears and close your eyes and stomp your feet and say \"no its not\"", 
   {}, 
   246420, 
   null, 
   1168405260.0
  ], 
  [
   246586, 
   null, 
   "Steeeeve", 
   "Well, because it kind of is. Its really only a floating watersack living parasitically off of a woman's body. I see no reason why it should be equated to a human.\n \n because it is a human.... What species do you think the fetus is?\n \n \n\n Its a bit late for that now, and many people aren't properly educated.\nLike the ones that can't understand how a fetus is a human?", 
   {}, 
   246551, 
   null, 
   1168405500.0
  ], 
  [
   246588, 
   null, 
   "Shooterandproud", 
   "You are made up of living human cells....believe it or not.\n\n \n Yup. However, I am a clump of human cells with intelligence.\n \n \n \n \n \n \nThe definition is as follows: a member of the species Homo sapiens.\n\n \n How do you define \"member\"? Is my sperm a member? Technically,\n \n \n \n \n \n \nThe fetus is a member of the species Homo sapiens no matter how many times you cover your ears and close your eyes and stomp your feet and say \"no its not\"\n\n \n \n So is my sperm no matter how much you close your eyes and say \"no its not\", but masturbation isn't murder is it?", 
   {}, 
   246585, 
   null, 
   1168405920.0
  ], 
  [
   246604, 
   null, 
   "ShadowPikachu", 
   "You are made up of living human cells....believe it or not.\n \n The definition is as follows: a member of the species Homo sapiens.\n \n The fetus is a member of the species Homo sapiens no matter how many times you cover your ears and close your eyes and stomp your feet and say \"no its not\"\n\n \n Yes, I am made of living human cells. So is my kidney, so is my gallbladder, so is my appendix, so are my tonsils, my colon, etc., etc. The difference is that I have this thing called \"intelligence\" and this other thing called \"mental activity and awareness\". A foetus (unless late term when it is a baby) is just like the kidney, gallbladder, appendix, in that it doesn't have the \"intelligence\" and \"mental activity and awareness\".\n \n Otherwise, by your definition, it is a murder everytime a male masturbates as sperm are made of living human cells. Boy, my fiance sure was a murderer before he met me:) . And wow, we women are murdering every time we have our period. Guess we should be in a state of perpetual pregnancy to please youemoticon_xdonno emoticon_rolleyes:xbanghead", 
   {}, 
   246585, 
   null, 
   1168417200.0
  ], 
  [
   246614, 
   null, 
   "Steeeeve", 
   "Yes, I am made of living human cells. So is my kidney, so is my gallbladder, so is my appendix, so are my tonsils, my colon, etc., etc. The difference is that I have this thing called \"intelligence\" and this other thing called \"mental activity and awareness\". \n and? There are a large number of differences from a 1 day old baby and a 80yr old man.\n \n\n A foetus (unless late term when it is a baby) is just like the kidney, gallbladder, appendix, in that it doesn't have the \"intelligence\" and \"mental activity and awareness\".\nand?\n \n \n\n Otherwise, by your definition, it is a murder everytime a male masturbates as sperm are made of living human cells. Boy, my fiance sure was a murderer before he met me:) . And wow, we women are murdering every time we have our period. Guess we should be in a state of perpetual pregnancy to please youemoticon_xdonno emoticon_rolleyes:xbanghead\nIt isn't my definition..it is the definition. A sperm is not a member of the species homo sapien. This is basic biology.\n \n Sorry but you don't get to define words how you see fit.", 
   {}, 
   246604, 
   null, 
   1168449480.0
  ], 
  [
   246616, 
   null, 
   "Steeeeve", 
   "Yup. However, I am a clump of human cells with intelligence.\n And I am a clump of human cell with shoes on...what is your point?\n \n \nHow do you define \"member\"? Is my sperm a member? Technically,\n\n \n no. You seem to refuse the idea that \"human\" as a noun is used to describe a human being meaning the entity as a whole and not the individual cells that make it up. I am sorry you don't understand this but the word means what it means.\n \n I find it odd that you even care what you call a fetus anyway.\n \n \nSo is my sperm no matter how much you close your eyes and say \"no its not\", but masturbation isn't murder is it?\nYour sperm is a human now? You should invest in a biology book.", 
   {}, 
   246588, 
   null, 
   1168449720.0
  ], 
  [
   246618, 
   null, 
   "Another opinion", 
   "Steeeeve, dislexia, Shooterandproud, and ShadowPikachu:\n The four of you seem to be engaged in yet another unresolveable battle of semantics - in this case about the definition of the term \"a human\". The trouble is that there are really TWO definitions of the term \"a human\" - the official definition and the common-use definition.\n \n One can legitimately argue, as Steeeeve does, that the official definition of a human as a \"member of the species homo sapien\" would only require a complete set of human DNA and the beginning of the growth process - so a zygote would then qualify under the official definition.\n \n However, nearly all uses of the term \"a human\" in common discussion are on topics other than abortion, where \"a human\" is discusses as a born human and, at the very least, the assumption is made that the being in question possesses a mental existence. At least I assume that when I hear the term \"a human\" and I know that this is a very common assumption - as demonstrated by the frequent disputes about the use of this term. Therefore, the term \"a human\" automatically generates a certain amount of sympathy because of these unofficial conotations of mental existence that are added to the definition. \n \n Steeeeve: I know you might feel justified in using the term \"a human\" and trying to force pro-choice people to admit to discriminating against humans since you stand firm on the official definition. However, you have to admit that it is somewhat disingenuous of you to ignore the fact that this term has many unofficial conotations attached to it that do not apply to a zygote or embryo - mental existence being one of them. Since words, after all, are used for COMMUNICATION, the use of the word \"a human\" in this way is a purposeful distortion of the message. Can't you try to find some term that you can all agree on?\n \n Shooterandproud and ShadowPikachu: Since the official definition of \"a human\" probably does include a zygote, Steeeeve is technically right, but I fully sympathize with you that the term \"a human\" is loaded with meanings that are attached to it due to its common use. Since there exists this difference between common use and official definition, wouldn't it be better for you as well to find some term that you and Steeeeve (and other pro-life proponents) could agree on?", 
   {}, 
   246586, 
   null, 
   1168450080.0
  ], 
  [
   246629, 
   null, 
   "Steeeeve", 
   "Steeeeve, dislexia, Shooterandproud, and ShadowPikachu:\n The four of you seem to be engaged in yet another unresolveable battle of semantics - in this case about the definition of the term \"a human\". The trouble is that there are really TWO definitions of the term \"a human\" - the official definition and the common-use definition.\n yeah, its annoying but I hate improper word use \n \n \nHowever, nearly all uses of the term \"a human\" in common discussion are on topics other than abortion, where \"a human\" is discusses as a born human and, at the very least, the assumption is made that the being in question possesses a mental existence. At least I assume that when I hear the term \"a human\" and I know that this is a very common assumption - as demonstrated by the frequent disputes about the use of this term. Therefore, the term \"a human\" automatically generates a certain amount of sympathy because of these unofficial conotations of mental existence that are added to the definition. \nI don't know that this is true. When I hear human I think of a scientific term for a certain king of being (unless otherwise stated). I'd venture a guess that prior to the abortion debate \"human\" could be applied to an unborn and no one thought anything of it.\n \n \n\n Steeeeve: I know you might feel justified in using the term \"a human\" and trying to force pro-choice people to admit to discriminating against humans since you stand firm on the official definition. However, you have to admit that it is somewhat disingenuous of you to ignore the fact that this term has many unofficial conotations attached to it that do not apply to a zygote or embryo - mental existence being one of them. Since words, after all, are used for COMMUNICATION, the use of the word \"a human\" in this way is a purposeful distortion of the message. Can't you try to find some term that you can all agree on?\nwell, for communication to work you have to use the same meaning for words. I choose to use the dictionary as that is our English language and human is what it is and we shouldn't change the definition just to make us feel better about abortion...that's just stupid. I disagree that mental existence applies to the term human there is nothing to support that it did. I suppose it could mean \"has mental existence\" though just like the word \"baby\" can mean newborn or a fetus.\n \n As for saying that you \"discriminate\" against humans...this is just a fact pro-choice folks are going to have to admit. I don't say this is a bad thing as I too support some form of \"discrimination\" based on certain criteria. What I don't discriminate on is develop and size and pro-choice has to. A point in development will always be arbitrary and has no better reasoning than any other point someone might say which I feel is a dangerous precedent.", 
   {}, 
   246618, 
   null, 
   1168453500.0
  ], 
  [
   246642, 
   null, 
   "Another opinion", 
   "well, for communication to work you have to use the same meaning for words. I choose to use the dictionary as that is our English language and human is what it is and we shouldn't change the definition just to make us feel better about abortion...that's just stupid. I disagree that mental existence applies to the term human there is nothing to support that it did. I suppose it could mean \"has mental existence\" though just like the word \"baby\" can mean newborn or a fetus.\n\n Yes, for cummunication to work, we do have to use the same meaning for words. However, we have to be very careful in using a word such as \"a human\" since it carries so much extra emotional baggage that is not part of its dry, official, scientific definition. If the official definition does not match the common use definition, then there is an obvious problem with that word that causes it to be so useless in discussions on the abortion topic. \n \n I can assure you that there are very many people who do not view a zygote or early embryo as \"a human\" unless you educate them on the official definition. I was surprised when I first recently read that official definition of \"a human\" since I always had equated the term \"a human\" with \"a person\". I am obviously far from being alone in this view. Even if people were all informed of the official definition of \"a human\", it would be very difficult to just drop the connotations that go along with the term \"a human\" - we are not robots that can automatically change definitions. If your purpose is communication and not distortion then use a term that we can all agree on that carries no unofficial unrelated emotional baggage.\n \nAs for saying that you \"discriminate\" against humans...this is just a fact pro-choice folks are going to have to admit. I don't say this is a bad thing as I too support some form of \"discrimination\" based on certain criteria. What I don't discriminate on is develop and size and pro-choice has to. A point in development will always be arbitrary and has no better reasoning than any other point someone might say which I feel is a dangerous precedent.\n\n When you say a sentence \"I discriminate against certain humans\" that means one thing to you and another thing to many other people - there is miscommunication going on and I think you know this. To me, hearing that someone \"discriminates against certain humans\" automatically conjures up images of race and sex discrimination since I automatically equate \"a human\" with \"a person\" and I don't like the thought of discriminating unjustly against people because I have empathy and sympathy with people and since I wouldn't want to be discriminated against either. However, I have little problem \"discriminating\" against human life forms with no mental existence (as are zygotes and embryos) just as you have no problem \"discriminating\" against human life in the form of unfertilized eggs.\n \n I very much hesitate in saying that \"I discriminate against certain humans\" since some (who only think of the official definition) will read it one way but others read it as \"I discriminate against certain people\" and I don't want that message to be carried. Why not use a term that causes no confusion?\n -------\n Just to add to the confusion about the noun \"human\", several sources quote two definitions for human:\n hu&#183;man \n 1. A member of the genus Homo and especially of the species H. sapiens. \n 2. A person: the extraordinary humans who explored Antarctica. \n \n These include: http://www.answers.com/topic/human-1, http://www.bartleby.com/61/78/H0317800.html (from the American Heritage Dictionary of the English Language), etc. Most on-line dictionaries defined human (noun) as human being, which doesn't help. Anyway, even the dictionaries aren't sticking to one definition so how can you expect this word to carry a fixed meaning in these discussions.", 
   {}, 
   246629, 
   null, 
   1168456980.0
  ], 
  [
   246651, 
   null, 
   "ShadowPikachu", 
   "and? There are a large number of differences from a 1 day old baby and a 80yr old man.\n Not in the fact that they both have mental existance while a zygote and foetus do not.\n \nand?\n\n So, by the definition you seem to be going by, according to your responses, of a foetus being made of living human cells and thus it is a human, I'm pointing out that all of my organs are made of living human cells, so they should be considered human according to what you seem to be expressing. \n \n\n It isn't my definition..it is the definition. A sperm is not a member of the species homo sapien. This is basic biology.\n \n Sorry but you don't get to define words how you see fit.\n\n \n I know a sperm is not one, but again, going with what you are pushing, it would have to be included as one. (By the way, at what point of development do you consider it a human if you don't consider sperm a human by your standards? Just trying to find out how you stand.)\n \n Oh, and I'm not going to bother to continue arguing semantics, as another_opinion said, it's a waste of time to argue over dictionary definitions as there are \"official\" (also changeable) definitions and every-day definitions. It is the everyday that really matters when addressing people. I think that in the years to come, that \"official\" definition that you seem to hold so dear (which is in fact quite vague) will become much better defined. Here's an essay I found relating to that definition: http://home.att.net/~star_child/essay7.html\n \n I found it quite fascinating, and if things continue as they are with artificial intelligence, that definition might change sooner than you like. I'm not supplying it as any sort of \"proof\" or anything, but it really interested me.", 
   {}, 
   246614, 
   null, 
   1168461720.0
  ], 
  [
   246652, 
   null, 
   "ShadowPikachu", 
   "When you say a sentence \"I discriminate against certain humans\" that means one thing to you and another thing to many other people - there is miscommunication going on and I think you know this. To me, hearing that someone \"discriminates against certain humans\" automatically conjures up images of race and sex discrimination since I automatically equate \"a human\" with \"a person\" and I don't like the thought of discriminating unjustly against people because I have empathy and sympathy with people and since I wouldn't want to be discriminated against either. However, I have little problem \"discriminating\" against human life forms with no mental existence (as are zygotes and embryos) just as you have no problem \"discriminating\" against human life in the form of unfertilized eggs.\n \n I very much hesitate in saying that \"I discriminate against certain humans\" since some (who only think of the official definition) will read it one way but others read it as \"I discriminate against certain people\" and I don't want that message to be carried. Why not use a term that causes no confusion?\n -------\n Just to add to the confusion about the noun \"human\", several sources quote two definitions for human:\n hu·man \n 1. A member of the genus Homo and especially of the species H. sapiens. \n 2. A person: the extraordinary humans who explored Antarctica. \n \n These include: http://www.answers.com/topic/human-1, http://www.bartleby.com/61/78/H0317800.html (from the American Heritage Dictionary of the English Language), etc. Most on-line dictionaries defined human (noun) as human being, which doesn't help. Anyway, even the dictionaries aren't sticking to one definition so how can you expect this word to carry a fixed meaning in these discussions.\n\n \n Yes, he does know the definition is different to many people than the \"official\" definition, and he and other anti-abortionists use it quite deliberately and insidiously.", 
   {}, 
   246642, 
   null, 
   1168461840.0
  ], 
  [
   246653, 
   null, 
   "Steeeeve", 
   "I can assure you that there are very many people who do not view a zygote or early embryo as \"a human\" unless you educate them on the official definition. I was surprised when I first recently read that official definition of \"a human\" since I always had equated the term \"a human\" with \"a person\". I am obviously far from being alone in this view. Even if people were all informed of the official definition of \"a human\", it would be very difficult to just drop the connotations that go along with the term \"a human\" - we are not robots that can automatically change definitions. If your purpose is communication and not distortion then use a term that we can all agree on that carries no unofficial unrelated emotional baggage.\n Well what others carry as emotional baggage is of no concern to me. We have a dictionary and those that choose to use it will have the upper hand in a debate. \n \n Oddly enough, the word \"person\" also doesn't have to presuppose a mental existence. Person is often used (and thus is the first definition) as an informal way to say human being.\n \n \nWhen you say a sentence \"I discriminate against certain humans\" that means one thing to you and another thing to many other people - there is miscommunication going on and I think you know this. To me, hearing that someone \"discriminates against certain humans\" automatically conjures up images of race and sex discrimination since I automatically equate \"a human\" with \"a person\" and I don't like the thought of discriminating unjustly against people because I have empathy and sympathy with people and since I wouldn't want to be discriminated against either. However, I have little problem \"discriminating\" against human life forms with no mental existence (as are zygotes and embryos) just as you have no problem \"discriminating\" against human life in the form of unfertilized eggs.\nYet an unfertilized egg is not a human life by anyones definition. Either way, I fully admit that I discriminate anyway...why people get offended by that is beyond me\n \n \n \nI very much hesitate in saying that \"I discriminate against certain humans\" since some (who only think of the official definition) will read it one way but others read it as \"I discriminate against certain people\" and I don't want that message to be carried. Why not use a term that causes no confusion?\n -------\n Just to add to the confusion about the noun \"human\", several sources quote two definitions for human:\n hu&#183;man \n 1. A member of the genus Homo and especially of the species H. sapiens. \n 2. A person: the extraordinary humans who explored Antarctica. \n \n These include: http://www.answers.com/topic/human-1, http://www.bartleby.com/61/78/H0317800.html (from the American Heritage Dictionary of the English Language), etc. Most on-line dictionaries defined human (noun) as human being, which doesn't help. Anyway, even the dictionaries aren't sticking to one definition so how can you expect this word to carry a fixed meaning in these discussions.\nWell many words have many meanings but dictionaries are listed in most common usage downward meaning number 1 is the most common meaning of the word. There should also be no question to what I mean by the word \"human\" as we have discussed it in great length. \n \n I guess I don't see the need for me to change my vocabulary to fit the needs of people who choose not to accept the definitions given by English dictionaries.", 
   {}, 
   246642, 
   null, 
   1168461840.0
  ], 
  [
   246655, 
   null, 
   "ShadowPikachu", 
   "\n Well many words have many meanings but dictionaries are listed in most common usage downward meaning number 1 is the most common meaning of the word. There should also be no question to what I mean by the word \"human\" as we have discussed it in great length. \n \n I guess I don't see the need for me to change my vocabulary to fit the needs of people who choose not to accept the definitions given by English dictionaries.\n\n \n That might be the most common usage, but that usage is rather vague and left up to interpretation, which is why most others don't view it the same as you. I really think that the dictionary should be more specific and less vague on their definitions.", 
   {}, 
   246653, 
   null, 
   1168461960.0
  ], 
  [
   246656, 
   null, 
   "Steeeeve", 
   "Not in the fact that they both have mental existance while a zygote and foetus do not.\n ok? and?\n \n \nSo, by the definition you seem to be going by, according to your responses, of a foetus being made of living human cells and thus it is a human, I'm pointing out that all of my organs are made of living human cells, so they should be considered human according to what you seem to be expressing. \n \n well of the above are considered human..but I said a human or \"human being\". Once again paying attention to word tense means a lot. The noun human can refer to a fetus (much like baby can too) but not to an organ.\n \n \nI know a sperm is not one, but again, going with what you are pushing, it would have to be included as one. (By the way, at what point of development do you consider it a human if you don't consider sperm a human by your standards? Just trying to find out how you stand.)\nNo a sperm doesn't meet my definition. Furthermore, I don't use development a standard classifying what is or isn't human. \n \n \n\n Oh, and I'm not going to bother to continue arguing semantics, as another_opinion said, it's a waste of time to argue over dictionary definitions as there are \"official\" (also changeable) definitions and every-day definitions. It is the everyday that really matters when addressing people. I think that in the years to come, that \"official\" definition that you seem to hold so dear (which is in fact quite vague) will become much better defined. Here's an essay I found relating to that definition: http://home.att.net/~star_child/essay7.html\n \n I found it quite fascinating, and if things continue as they are with artificial intelligence, that definition might change sooner than you like. I'm not supplying it as any sort of \"proof\" or anything, but it really interested me.\nI don't hold on to the definition other than to use it in a proper fashion. Words are always changing meaning (take the word \"gay\" for example) and I will use the most current form of the word. It makes no difference to me whether you call a fetus a goat or a bus or a human but at the very least make sure the word you are using is the proper sense of the word.", 
   {}, 
   246651, 
   null, 
   1168462320.0
  ], 
  [
   246658, 
   null, 
   "Steeeeve", 
   "That might be the most common usage, but that usage is rather vague and left up to interpretation, which is why most others don't view it the same as you. I really think that the dictionary should be more specific and less vague on their definitions.\n\n \n How can you get anymore specific then \"member of the species Homo Sapien\"?", 
   {}, 
   246655, 
   null, 
   1168462380.0
  ], 
  [
   246660, 
   null, 
   "Another opinion", 
   "Well what others carry as emotional baggage is of no concern to me. We have a dictionary and those that choose to use it will have the upper hand in a debate.\n \n Oddly enough, the word \"person\" also doesn't have to presuppose a mental existence. Person is often used (and thus is the first definition) as an informal way to say human being.\n \n Well many words have many meanings but dictionaries are listed in most common usage downward meaning number 1 is the most common meaning of the word. There should also be no question to what I mean by the word \"human\" as we have discussed it in great length. \n \n I guess I don't see the need for me to change my vocabulary to fit the needs of people who choose not to accept the definitions given by English dictionaries.\n\n Look, even the dictionaries show that there are two possible definitions. I may know which definition you have in mind but readers of a thread with our discussion might not, so I will not say \"I discriminate against certain humans\" without it being clear what is meant. With multiple possible definitions, it is not clear what is meant. Shouldn't it be obvious that, in communication, it is not only important what a person meant to say but it is important how they said it so that it would be properly understood. Saying that a person discriminates against humans is insufficient and confusing if you are not clear which of the two definitions you are using.\n \n By the way, the term \"person\" also has multiple meanings (again from the American Heritage Dictionary of the English Language via answers.com ):\n per·son (noun) \n \n 1. A living human. Often used in combination: chairperson; spokesperson; salesperson.\n 2. An individual of specified character: a person of importance.\n 3. The composite of characteristics that make up an individual personality; the self.\n ... and a few others that are less relevant...\n \n Anyway, the second and third definitions clearly imply mental existence. The first definition is unclear but, given the examples that they give, they seem to imply a mental existence as well.\n \n Bottom line, communication, to be effective, needs to be CLEAR and MUTUALLY understood (in this case by not only debaters but potential readers).", 
   {}, 
   246653, 
   null, 
   1168462800.0
  ], 
  [
   246665, 
   null, 
   "Steeeeve", 
   "Look, even the dictionaries show that there are two possible definitions. I may know which definition you have in mind but readers of a thread with our discussion might not, so I will not say \"I discriminate against certain humans\" without it being clear what is meant. With multiple possible definitions, it is not clear what is meant. Shouldn't it be obvious that, in communication, it is not only important what a person meant to say but it is important how they said it so that it would be properly understood. Saying that a person discriminates against humans is insufficient and confusing if you are not clear which of the two definitions you are using.\n \n By the way, the term \"person\" also has multiple meanings (again from the American Heritage Dictionary of the English Language via answers.com ):\n per·son (noun) \n \n 1. A living human. Often used in combination: chairperson; spokesperson; salesperson.\n 2. An individual of specified character: a person of importance.\n 3. The composite of characteristics that make up an individual personality; the self.\n ... and a few others that are less relevant...\n \n Anyway, the second and third definitions clearly imply mental existence. The first definition is unclear but, given the examples that they give, they seem to imply a mental existence as well.\n \n Bottom line, communication, to be effective, needs to be CLEAR and MUTUALLY understood (in this case by not only debaters but potential readers).\n\n Every word has multiply definitions including the word \"definition\" (http://dictionary.reference.com/browse/definition). The ability to understand what a word means in context is something learned (hopefully). If I say \"the definition of the word desk is...\" I don't mean the sharpness of the word desk. Likewise when I say \"the fetus is a human\" you can gather that 1) I an using it as a noun and 2) the context of the word in order to choose the appropriate definition. It should be noted that human never has \"mental existence\" in the definition.\n \n Person goes the same way. To say \"you are a person\" you take the noun and view the context. The context rules out definitions 2 and 3 and thus we are left with 1 (the main entry) as the definition for that word.\n \n I know this conversation sounds petty but it is rather frustrating that people are manipulating words to support a cause and then claiming to not understand a basic language structure. If you want to say the fetus isn't worthy of life then so be it but don't start justifying this claim but changing the definitions of words such as \"person\" and \"human\"...that is just stupid", 
   {}, 
   246660, 
   null, 
   1168468320.0
  ], 
  [
   246674, 
   null, 
   "Another opinion", 
   "Every word has multiply definitions including the word \"definition\" (http://dictionary.reference.com/browse/definition). The ability to understand what a word means in context is something learned (hopefully). If I say \"the definition of the word desk is...\" I don't mean the sharpness of the word desk. Likewise when I say \"the fetus is a human\" you can gather that 1) I an using it as a noun and 2) the context of the word in order to choose the appropriate definition. It should be noted that human never has \"mental existence\" in the definition.\n \n Person goes the same way. To say \"you are a person\" you take the noun and view the context. The context rules out definitions 2 and 3 and thus we are left with 1 (the main entry) as the definition for that word.\n \n I know this conversation sounds petty but it is rather frustrating that people are manipulating words to support a cause and then claiming to not understand a basic language structure. If you want to say the fetus isn't worthy of life then so be it but don't start justifying this claim but changing the definitions of words such as \"person\" and \"human\"...that is just stupid\n\n You are the one saying that only one definition is valid in a particular context - that is an unjustified claim. The statement \"I discriminate against certain humans\" could work just as well for either definition: \"I discriminate against certain members of the species homo sapien\" or \"I discriminate against certain people\". The context does not always specify which definition is used, as in the example I just gave. \n \n Similarly, your statement \"you are a person\" can also work with multiple definitions of \"person\". It can mean \"you are a living human\" or \"you are an individual of specified character\" - ex. 'you are an stuborn individual :) \". \n \n In the context of our discussions, you have been clear enough about which definition you are using that I know which definition YOU use. If the only two people who would ever see my statement \"I discriminate against certain humans\" were you and I, then I would not be concerned since we both know what is meant. However, in a forum such as this, other people (i.e. readers) also would see that statement and might misconstrue that to mean \"I discriminate against certain people\" since they would not know that it was the first definition of \"member of species homo sapien\" that was meant. THAT is what I am trying to avoid. I am trying to avoid having others jump to the wrong conclusion due to lack of clearly defined terms.\n \n ----------------\n \n Either way, I suspect that your main goal in trying to convince pro-choice proponents of stating \"I discriminate against certain humans\" is that you equate discrimination based on mental existence with all other forms of discrimination (sex, race, etc.). So, let's address that question directly instead of dancing around the issue. \n \n I disagree that those types of discriminations are equivalent due to the main reason that I, personally, and I believe many if not most others are against discrimination based on sex and race. I am against discrimination based on sex and race because I myself would not like to be discriminated against for something that is not within my control and for something for which there is no reason to discriminate. Such a type of discrimination against me would cause me suffering and, using my general moral approach of empathy and trying to treat others as I would have myself be treated, I generally denounce discrimination against certain people based on aspects of themselves that they cannot control and for which there is no justifiable reason to discriminate. (This is as opposed to discrimination against people based on their actions - ex. crimes - being permissible, as well as discrimination against people based on their inability to control their actions - ex. limiting the rights of children - being permissible.). Discrimination against human life forms with no mental existence is irrelevant to my moral stance of empathy and \"do unto others\" since there is no \"somebody\" there with which to empathize and no \"other\" who I would be treating as myself.", 
   {}, 
   246665, 
   null, 
   1168472640.0
  ], 
  [
   246685, 
   null, 
   "ShadowPikachu", 
   "Every word has multiply definitions including the word \"definition\" (http://dictionary.reference.com/browse/definition). The ability to understand what a word means in context is something learned (hopefully). If I say \"the definition of the word desk is...\" I don't mean the sharpness of the word desk. Likewise when I say \"the fetus is a human\" you can gather that 1) I an using it as a noun and 2) the context of the word in order to choose the appropriate definition. It should be noted that human never has \"mental existence\" in the definition.\n \n Person goes the same way. To say \"you are a person\" you take the noun and view the context. The context rules out definitions 2 and 3 and thus we are left with 1 (the main entry) as the definition for that word.\n \n I know this conversation sounds petty but it is rather frustrating that people are manipulating words to support a cause and then claiming to not understand a basic language structure. If you want to say the fetus isn't worthy of life then so be it but don't start justifying this claim but changing the definitions of words such as \"person\" and \"human\"...that is just stupid\n\n \n This is my last post on this thread because I don't care to get into little debates over semantics, as it is a waste of my time and never would be resolved. I don't really care what you decide to call a human. I will call a human whatever I like whether you complain or not, and in fact I'm willing to bet most americans would say the same.\n \n \nHow can you get anymore specific then \"member of the species Homo Sapien\"?\n\n \n Very easily. For instance, would you give somone who has died all of the same rights as a living mentally existant human being? Of course not! And yet, they are still members of the species Homo Sapien, so by not giving them the same rights, that would be discrimination by your standards. See how the definition here is too vague? (On second thought, you probably wouldn't admit it if you did because you seem rather obsessed with the \"official definition\" emoticon_rolleyes ). \n \n If you look at the second and third listings in the definition another_opinion was talking about, you can see it clearly implies mental existence. Just because one definition is at the top doesn't mean it is more commonly used, it just means they had to write them out in a list. A foetus cannot be worthy of life as it does not mentally (and in many other ways) live.\n \n \n Discrimination against a life form that is made of human cells yet is without mental existence does not provide a sense of empathy, and that is why you try to get us to give the appearance of a mental existence, which I for one will never do.", 
   {}, 
   246665, 
   null, 
   1168482360.0
  ], 
  [
   246694, 
   null, 
   "Shooterandproud", 
   "and? There are a large number of differences from a 1 day old baby and a 80yr old man.\n and?\n\n \n And what? What more is there to say?\n \n \n \n \n \nIt isn't my definition..it is the definition. A sperm is not a member of the species homo sapien. This is basic biology.\n \n Sorry but you don't get to define words how you see fit.\n\n \n \n Biology 101, steeeve. A sperm is a member of the homo sapien species.", 
   {}, 
   246614, 
   null, 
   1168489860.0
  ], 
  [
   246699, 
   null, 
   "Shooterandproud", 
   "And I am a clump of human cell with shoes on...what is your point?\n\n \n My point is, an embryo has neither intelligence nor shoes.\n \n \n \n \n \nno. You seem to refuse the idea that \"human\" as a noun is used to describe a human being meaning the entity as a whole and not the individual cells that make it up. I am sorry you don't understand this but the word means what it means.\n\n \n Then whats your usage? \"Human\" as an adjective mean any oraganic matter that contains human DNA. \"Human\" as a noun means any independent living being or entity, as in Human being.\n \n \n \n \n \nI find it odd that you even care what you call a fetus anyway.\n\n \n Where did you get that piece of information? Who told you I cared?\n \n \n \n \nYour sperm is a human now? You should invest in a biology book.\n\n \n By your standards, yes. It is just as human as an embryo, and to call it otherwise would be discrimination.", 
   {}, 
   246616, 
   null, 
   1168493040.0
  ], 
  [
   246701, 
   null, 
   "Shooterandproud", 
   "Steeeeve, dislexia, Shooterandproud, and ShadowPikachu:\n The four of you seem to be engaged in yet another unresolveable battle of semantics - in this case about the definition of the term \"a human\". The trouble is that there are really TWO definitions of the term \"a human\" - the official definition and the common-use definition.\n \n One can legitimately argue, as Steeeeve does, that the official definition of a human as a \"member of the species homo sapien\" would only require a complete set of human DNA and the beginning of the growth process - so a zygote would then qualify under the official definition.\n \n However, nearly all uses of the term \"a human\" in common discussion are on topics other than abortion, where \"a human\" is discusses as a born human and, at the very least, the assumption is made that the being in question possesses a mental existence. At least I assume that when I hear the term \"a human\" and I know that this is a very common assumption - as demonstrated by the frequent disputes about the use of this term. Therefore, the term \"a human\" automatically generates a certain amount of sympathy because of these unofficial conotations of mental existence that are added to the definition. \n \n Steeeeve: I know you might feel justified in using the term \"a human\" and trying to force pro-choice people to admit to discriminating against humans since you stand firm on the official definition. However, you have to admit that it is somewhat disingenuous of you to ignore the fact that this term has many unofficial conotations attached to it that do not apply to a zygote or embryo - mental existence being one of them. Since words, after all, are used for COMMUNICATION, the use of the word \"a human\" in this way is a purposeful distortion of the message. Can't you try to find some term that you can all agree on?\n \n Shooterandproud and ShadowPikachu: Since the official definition of \"a human\" probably does include a zygote, Steeeeve is technically right, but I fully sympathize with you that the term \"a human\" is loaded with meanings that are attached to it due to its common use. Since there exists this difference between common use and official definition, wouldn't it be better for you as well to find some term that you and Steeeeve (and other pro-life proponents) could agree on?\n\n \n Thanks, but to clear some things up, I am not disputing the scientific status of the embryo. The debate is whether or not it possesses intelligence. If it does, then it deserves rights just like any other human. If it doesn't, then it doesn't deserve rights. We are trying to establish whether its a being or not, because if it is not a being or \"person\", as in possessing intelligence, then there is no reason why it should overpower a being who does.", 
   {}, 
   246618, 
   null, 
   1168493340.0
  ], 
  [
   246703, 
   null, 
   "Shooterandproud", 
   "How can you get anymore specific then \"member of the species Homo Sapien\"?\n\n \n And give me one good reason why an embryo is part of that species?\n \n \n \n And if I'm not mistaken, the defonition of \"discriminate\" is:\n \n # To make distinctions on the basis of class or category without regard to individual merit; show preference or prejudice: was accused of discriminating against women; discriminated in favor of his cronies. \n \n \n So, in essance, this would not apply to embryos since they have no individual merit, or class.", 
   {}, 
   246658, 
   null, 
   1168495200.0
  ], 
  [
   246728, 
   null, 
   "Steeeeve", 
   "You are the one saying that only one definition is valid in a particular context - that is an unjustified claim. The statement \"I discriminate against certain humans\" could work just as well for either definition: \"I discriminate against certain members of the species homo sapien\" or \"I discriminate against certain people\". The context does not always specify which definition is used, as in the example I just gave. \n \n Similarly, your statement \"you are a person\" can also work with multiple definitions of \"person\". It can mean \"you are a living human\" or \"you are an individual of specified character\" - ex. 'you are an stuborn individual :) \". \n I'd have to say that if you got \"I am a person\" to mean \"individual of specified character\" then there is never hope for any communication. Like you said, you would say \"you are a stubborn person\"..not \"you are a person\" and then say \"what! that clearly means you are a stubborn person\". Seriously, context is not hard to figure out.\n \n \nIn the context of our discussions, you have been clear enough about which definition you are using that I know which definition YOU use. If the only two people who would ever see my statement \"I discriminate against certain humans\" were you and I, then I would not be concerned since we both know what is meant. However, in a forum such as this, other people (i.e. readers) also would see that statement and might misconstrue that to mean \"I discriminate against certain people\" since they would not know that it was the first definition of \"member of species homo sapien\" that was meant. THAT is what I am trying to avoid. I am trying to avoid having others jump to the wrong conclusion due to lack of clearly defined terms.\n You shouldn't worry about other people that read our back and forth conversation :p They will miss context no matter what as they don't read the entire conversation normally.\n \n\n Either way, I suspect that your main goal in trying to convince pro-choice proponents of stating \"I discriminate against certain humans\" is that you equate discrimination based on mental existence with all other forms of discrimination (sex, race, etc.). So, let's address that question directly instead of dancing around the issue. \nActually I just find it funny that people can't admit to discriminating...we all do it including me. The fact that some don't admit to it is amusing and brings up questions about whether they feel it is wrong or not deep inside. \n \n\n I disagree that those types of discriminations are equivalent due to the main reason that I, personally, and I believe many if not most others are against discrimination based on sex and race. I am against discrimination based on sex and race because I myself would not like to be discriminated against for something that is not within my control and for something for which there is no reason to discriminate.\n I believe we can discriminate based on sex...probably very rarely race. Men and Women are different and that requires discrimination sometimes. Take the draft for example or just simply segregation of bathrooms. Race would be a hard one but if you support affirmative action you are for discrimination.\n \n \nSuch a type of discrimination against me would cause me suffering and, using my general moral approach of empathy and trying to treat others as I would have myself be treated, I generally denounce discrimination against certain people based on aspects of themselves that they cannot control and for which there is no justifiable reason to discriminate.\nThis is off topic but if you had the same approach (treat others as you wish to be treated) then if you would not want to be aborted then wouldn't it be logical to treat others the same way?\n \n \nDiscrimination against human life forms with no mental existence is irrelevant to my moral stance of empathy and \"do unto others\" since there is no \"somebody\" there with which to empathize and no \"other\" who I would be treating as myself.\nWell, I still don't get the mental existence thing...it isn't unique to humans and it certainly leaves things open for picking a different point of development for obtaining rights.", 
   {}, 
   246674, 
   null, 
   1168536780.0
  ], 
  [
   246731, 
   null, 
   "Steeeeve", 
   "This is my last post on this thread because I don't care to get into little debates over semantics, as it is a waste of my time and never would be resolved. I don't really care what you decide to call a human. I will call a human whatever I like whether you complain or not, and in fact I'm willing to bet most americans would say the same.\nemoticon_cry \n \n \nVery easily. For instance, would you give somone who has died all of the same rights as a living mentally existant human being? Of course not! And yet, they are still members of the species Homo Sapien, so by not giving them the same rights, that would be discrimination by your standards. See how the definition here is too vague? (On second thought, you probably wouldn't admit it if you did because you seem rather obsessed with the \"official definition\" emoticon_rolleyes ). \nI get the idea that our English classes are failing on every level. For one, it is hard to be a member of something when you are dead. Secondly, the definition is what it is. Are you proposing that we just each find our own definition for every word and go with it? If the answer is yes then I must admit that I don't understand your post as I have not learned the ancient ShadowPikachu language.\n \n \nIf you look at the second and third listings in the definition another_opinion was talking about, you can see it clearly implies mental existence. Just because one definition is at the top doesn't mean it is more commonly used, it just means they had to write them out in a list. A foetus cannot be worthy of life as it does not mentally (and in many other ways) live.\nMy cat mentally lives...she must be a human :)\n \n Anyway, they don't imply mental existence. There is no way to assume mental existence is a requirement out of any of those. This one fails due to fallacy.\n \n \nDiscrimination against a life form that is made of human cells yet is without mental existence does not provide a sense of empathy, and that is why you try to get us to give the appearance of a mental existence, which I for one will never do.\nhaha, I never claimed to give the appearance of mental existence. I clearly admit that it does not exist for the embryo and most of the life of the fetus. I just happen to think that mental existence doesn't matter.", 
   {}, 
   246685, 
   null, 
   1168537320.0
  ], 
  [
   246735, 
   null, 
   "Steeeeve", 
   "My point is, an embryo has neither intelligence nor shoes.\n yeah, that's true. I like my new shoes by the way.\n \n\n Then whats your usage? \"Human\" as an adjective mean any oraganic matter that contains human DNA. \"Human\" as a noun means any independent living being or entity, as in Human being.\nthe noun. saying \" I am a human\" makes human the noun in that sentence. Saying \"I have a human hair on me\" makes human the adjective. I just point out that saying the embryo is not A HUMAN BEING is false and we shouldn't change the definition just to make people feel better about abortion. \n \n \nWhere did you get that piece of information? Who told you I cared?\nYou are still debating it... If you didn't care then you would have simply said \"ok call it a human....a fetus is a human that has no intelligence (or whatever) and thus does not have rights\"\n \n \n\n By your standards, yes. It is just as human as an embryo, and to call it otherwise would be discrimination.\nthere you go with the adjective noun switch again.", 
   {}, 
   246699, 
   null, 
   1168537620.0
  ], 
  [
   246738, 
   null, 
   "Steeeeve", 
   "And give me one good reason why an embryo is part of that species?\n\n Well for one...you admit to it: \"I am not disputing the scientific status of the embryo\"\n \n \n\n And if I'm not mistaken, the defonition of \"discriminate\" is:\n \n # To make distinctions on the basis of class or category without regard to individual merit; show preference or prejudice: was accused of discriminating against women; discriminated in favor of his cronies. \n \n \n So, in essance, this would not apply to embryos since they have no individual merit, or class.\nIsn't that begging the question? An Individual is a human being. The fetus or embryo is a human being", 
   {}, 
   246703, 
   null, 
   1168537800.0
  ], 
  [
   246741, 
   null, 
   "ShadowPikachu", 
   "\n My cat mentally lives...she must be a human :)\n\n \n Oh good Lord!!emoticon_xdonno :xbanghead :xbanghead I was going to stop posting at that last post, but when I saw something this retarted, I had to reply. Is your cat made up of living human cells with a human brain and a mental existene? Thought not. That's what we're talking about here, and you're just fighting against a strawman you built. There, I had my say, goodbye, have fun with the neverending semantics argument, I wash my hands of this thread *shakes dust from sandals* .", 
   {}, 
   246731, 
   null, 
   1168538520.0
  ], 
  [
   246743, 
   null, 
   "Steeeeve", 
   "Oh good Lord!!emoticon_xdonno :xbanghead :xbanghead I was going to stop posting at that last post, but when I saw something this retarted, I had to reply. Is your cat made up of living human cells with a human brain and a mental existene? Thought not. That's what we're talking about here, and you're just fighting against a strawman you built. There, I had my say, goodbye, have fun with the neverending semantics argument, I wash my hands of this thread *shakes dust from sandals* .\n\n So this time you are really serious about leaving emoticon_rolleyes \n \n So now mental existence isn't good enough (as it is not unique which was my point) but human cells is important and something of a human brain. Well what importance are human cells and a human brain? It seems the idea of a human having importance is not just limited to me...you just happen to add another criteria at the end that you feel is important as well.", 
   {}, 
   246741, 
   null, 
   1168539240.0
  ], 
  [
   246745, 
   null, 
   "jyoshu", 
   "So now mental existence isn't good enough (as it is not unique which was my point) but human cells is important and something of a human brain. Well what importance are human cells and a human brain? It seems the idea of a human having importance is not just limited to me...you just happen to add another criteria at the end that you feel is important as well.\n\n \n Is Shadow trying to 'move the goal posts' again?", 
   {}, 
   246743, 
   null, 
   1168539420.0
  ], 
  [
   246749, 
   null, 
   "Steeeeve", 
   "Is Shadow trying to 'move the goal posts' again?\n\n \n yeah, but at least another opinion is trying to hold him back :p", 
   {}, 
   246745, 
   null, 
   1168539840.0
  ], 
  [
   246754, 
   null, 
   "Another opinion", 
   " You shouldn't worry about other people that read our back and forth conversation :p They will miss context no matter what as they don't read the entire conversation normally.\n\n I am concerned how others read our discussion because of the nature of forums themselves. I myself will occasionally read other people's discussions in a wide range of topics in this forum to get a feel for the arguements presented on both sides, even if I don't participate in those discussions. It helps when those debaters have the general readers in mind as well when they have these discussions. Similarly, I also try to keep the general reader in mind when I have debates with you and others. These are not private messages or e-mails, these are forum debates which are, by their nature, public.\n \nActually I just find it funny that people can't admit to discriminating...we all do it including me. The fact that some don't admit to it is amusing and brings up questions about whether they feel it is wrong or not deep inside. \n\n We all discriminate in one way or another to varying degrees but the word \"discriminate\" carries a negative conotation so we admit to it carefully and when it is truly applicable. Do I discriminate against a shirt because I choose to throw it away? Do I discriminate against an egg or sperm when I choose to use contraception? I would say that, in both those situations, \"discrimination\" is not an accurate word to use since, as Shooterandproud noted, the definition of \"discriminate\" is \"To make distinctions on the basis of class or category without regard to individual merit; show preference or prejudice: was accused of discriminating against women; discriminated in favor of his cronies\". \"Individual merit\" as I understand it refers to mentally existing beings, not to objects - a shirt doesn't have a high individual merit by being well-made. You can discriminate against mentally existing beings (that can have individual merit). It is irrelevant to talk about \"discrimination\" against objects since objects cannot have such individual merit, in my understanding. \n \n But here, we would be launching into semantics again. Bottom line is that pro-choice supporters don't want to give the wrong impression in what they say because of your insistence on using a specific word definition. Ask them if they discriminate against criminals, and I am sure most would say yes because that is an accurate statement. They just don't want to make inacurate statements.\n \n I believe we can discriminate based on sex...probably very rarely race. Men and Women are different and that requires discrimination sometimes. Take the draft for example or just simply segregation of bathrooms. Race would be a hard one but if you support affirmative action you are for discrimination.\n \n\n Discrimination usually involves keeping individuals of a specific group away from something they want because of irrational reasons. If women started clamering to get drafted, then the draft laws might need to be re-examined. I have often been surprised why men don't complain more about women not being draftable. Anyway, the issue of discrimination comes up when there is a differential treatment of a group that is resented by that group. We do treat various groups in various ways but, where laws are concerned, we generally try to give rather good reasons for different treatment - not arbitrary ones based on incorrect steriotypes.\n \nThis is off topic but if you had the same approach (treat others as you wish to be treated) then if you would not want to be aborted then wouldn't it be logical to treat others the same way?\n\n Morality has to be self-consistent. I would not have wanted to be aborted, but (in applying that general rule) that would mean that each pregnancy would have to be forced to term - that is a balance where I would favor freedom of body. I would not have wanted to have my conception stopped with contraception, but that would mean that I would have a general law forcing no contraception - I choose freedom of using contraception. There are many things that came together to facilitate my coming into being, I am glad that they happened but I cannot EXPECT that they HAD TO happen. \n \nWell, I still don't get the mental existence thing...it isn't unique to humans and it certainly leaves things open for picking a different point of development for obtaining rights.\n\n Yes, it isn't unique to humans and I, personally, support some level of animal rights. I openly acknowledge that I discriminate in favor of humans over animals - I am biased toward my own species. I do not have full logical reasons why a severally mentally deteriorated human should be treated better than a highly mentally developed ape, but I haven't had to defend these choices yet, so I let the illogic stand for now.", 
   {}, 
   246728, 
   null, 
   1168540740.0
  ], 
  [
   246755, 
   null, 
   "Sigma", 
   "\n I get the idea that our English classes are failing on every level. For one, it is hard to be a member of something when you are dead. Secondly, the definition is what it is.\n\n \n The definition makes no distinction between those alive and those dead. Were a dictionary definition used, it would be difficult to deny the dead equal protection based on your reasoning. The dictionary definition also does not make a distinction based on the number of chromosomes. A sperm is human in the same way the fetus is human: they both contain human DNA.\n \n However, this is all moot. The dictionary definition has no authority over how we use words. It simply records how words are generally used. In a philosophical debate such as this, shadings of meaning are used constantly that you will not find in any dictionary. It is up to the participants to agree to use a word in a certain way to avoid confusion between them. A philosophical argument is to argue concepts, not semantics.\n \n \nMy cat mentally lives...she must be a human :)\n\n \n Non-human animals are usually not considered to posess consciousness as we know it. However, we can make the distinction that your cat does not have a unique human consciousness.", 
   {}, 
   246731, 
   null, 
   1168541100.0
  ], 
  [
   246757, 
   null, 
   "jyoshu", 
   "I would not have wanted to be aborted, but (in applying that general rule) that would mean that each pregnancy would have to be forced to term - that is a balance where I would favor freedom of body. \n\n \n Forgive me for taking one part of your post only, but this struck me.\n \n You're statement is that 'it would mean pregnancy would be forced to come to term.' Pregnancy is, by default, going to come to term. It's the natural progression of things. What is being forced is the termination of the pregnancy by the mother. That's a change from the natural progression of things to an un-natural event, caused by external intervention. \n \n I think viewing this only from the standpoint of women being forced to do something is too limited a way of viewing the situation. It should never be taken into account without also taking into account that the fetus is being forced to die, and therefore prevented from growing up and living it's life. Abortion should never be viewed in terms apart from it's moral and philosophical implications, IMO.", 
   {}, 
   246754, 
   null, 
   1168541340.0
  ], 
  [
   246758, 
   null, 
   "Steeeeve", 
   "The definition makes no distinction between those alive and those dead. Were a dictionary definition used, it would be difficult to deny the dead equal protection based on your reasoning. The dictionary definition also does not make a distinction based on the number of chromosomes. A sperm is human in the same way the fetus is human: they both contain human DNA.\n \n However, this is all moot. The dictionary definition has no authority over how we use words. It simply records how words are generally used. In a philosophical debate such as this, shadings of meaning are used constantly that you will not find in any dictionary. It is up to the participants to agree to use a word in a certain way to avoid confusion between them. A philosophical argument is to argue concepts, not semantics.\n \n you can't join in so late :p \n \n This is simple biology...member of the species homo sapien doesn't mean a sperm cell, never has never will. It is moot but at the same time aggravating that people claim the fetus is a \"human\" and thus this justifies abortion. I believe to you this doesn't even matter.\n \n \n\n Non-human animals are usually not considered to posess consciousness as we know it. However, we can make the distinction that your cat does not have a unique human consciousness.\nyet there is the word \"human\" agian...what makes human so important? (note: I agree that human is important).", 
   {}, 
   246755, 
   null, 
   1168541580.0
  ], 
  [
   246760, 
   null, 
   "Steeeeve", 
   "Morality has to be self-consistent. I would not have wanted to be aborted, but (in applying that general rule) that would mean that each pregnancy would have to be forced to term - that is a balance where I would favor freedom of body. I would not have wanted to have my conception stopped with contraception, but that would mean that I would have a general law forcing no contraception - I choose freedom of using contraception. There are many things that came together to facilitate my coming into being, I am glad that they happened but I cannot EXPECT that they HAD TO happen.\nThat's fine...I was referring more in a general sense and not just you. For example if one placed a higher value on all human life (ie including embryo and fetus) then the want of the person carrying to term to do something they don't want to do then wouldn't the logical outcome be to be against abortion?\n \n \nYes, it isn't unique to humans and I, personally, support some level of animal rights. I openly acknowledge that I discriminate in favor of humans over animals - I am biased toward my own species. I do not have full logical reasons why a severally mentally deteriorated human should be treated better than a highly mentally developed ape, but I haven't had to defend these choices yet, so I let the illogic stand for now.\nYet you naturally think the mentally challenged person deserves the rights. That is the aspect of human nature that makes me believe mental existence is really a naturally valued item.", 
   {}, 
   246754, 
   null, 
   1168542120.0
  ], 
  [
   246769, 
   null, 
   "Another opinion", 
   "Forgive me for taking one part of your post only, but this struck me.\n \n You're statement is that 'it would mean pregnancy would be forced to come to term.' Pregnancy is, by default, going to come to term. It's the natural progression of things. What is being forced is the termination of the pregnancy by the mother. That's a change from the natural progression of things to an un-natural event, caused by external intervention. \n \n I think viewing this only from the standpoint of women being forced to do something is too limited a way of viewing the situation. It should never be taken into account without also taking into account that the fetus is being forced to die, and therefore prevented from growing up and living it's life. Abortion should never be viewed in terms apart from it's moral and philosophical implications, IMO.\n\n Why is \"natural\" considered automatically superior? We have changed our lives in very unnatural ways all the time, with no complaint from others. When our lives are artificially sustained by external blood transfusions, or machines that otherwise keep us alive, that is \"un-natural\". Does that make it bad? If we were to say that artificial interference in the natural progression of things is bad, then a tremendous amount of people would die by being denied artificial help. Whether or not something is \"natural\" is irrelevant - the relevant thing is the ethics and morality behind it, and the reasons behind those ethical or moral views.\n \n As for the fetus, I don't see much of a difference between a fetus prior to mental existence being killed and an unfertilized egg being killed except for the state of its *potential* for becoming a person (a fetus probably will become a person, whereas an unfertilized egg might). I personally find such potential important but MUCH less important than the rights of an existing person - i.e. the mother.", 
   {}, 
   246757, 
   null, 
   1168545360.0
  ], 
  [
   246776, 
   null, 
   "Another opinion", 
   "That's fine...I was referring more in a general sense and not just you. For example if one placed a higher value on all human life (ie including embryo and fetus) then the want of the person carrying to term to do something they don't want to do then wouldn't the logical outcome be to be against abortion?\n\n Yes, if you place a higher value on all human life than on the wants of the person carrying to term, then you would be against abortion. But what is the logical reason for placing that higher value on ALL human life in the first place? That is where the unsupported proclamation happens.\n \nYet you naturally think the mentally challenged person deserves the rights. That is the aspect of human nature that makes me believe mental existence is really a naturally valued item.\n\n I think that any being with a mental existence deserves rights - animals as well. I suppose that part of the reason that I don't automatically give equal rights to animals is that they are not part of the moral consensus. Morality is often a type of deal one makes with others - I will treat you well and you treat me well. Our moral stances are most challenged when we are in an environment where there is no moral consensus. Ex. Do we treat others well who treat us very badly? There is no way to make a moral consensus with animals. Many animals have shown codes of behavior toward others of the same or other species in dominant or submissive behavior, etc. but these do not seem to be based on any rational analysis.", 
   {}, 
   246760, 
   null, 
   1168546380.0
  ], 
  [
   246778, 
   null, 
   "Sigma", 
   "\n This is simple biology...member of the species homo sapien doesn't mean a sperm cell, never has never will.\n\n \n You cannot deny, however, that sperm is human for the same reason the fetus is human: both contain human DNA. The dictionary definition would then cover both.\n \n \nyet there is the word \"human\" agian...what makes human so important? (note: I agree that human is important).\n\n \n As opposed to non-human animals, such as your cat. Consciousness is generally considered unique to humans, but since you insist that your cat posesses this feature, human consciousness can still be distinguished.", 
   {}, 
   246758, 
   null, 
   1168546500.0
  ], 
  [
   246804, 
   null, 
   "Steeeeve", 
   "You cannot deny, however, that sperm is human for the same reason the fetus is human: both contain human DNA. The dictionary definition would then cover both.\n no one doubts the adjective sense of the word ;)\n \n \nAs opposed to non-human animals, such as your cat. Consciousness is generally considered unique to humans, but since you insist that your cat posesses this feature, human consciousness can still be distinguished.\n\n and what is special about the human aspect? That was my question.", 
   {}, 
   246778, 
   null, 
   1168553700.0
  ], 
  [
   246805, 
   null, 
   "Steeeeve", 
   "Yes, if you place a higher value on all human life than on the wants of the person carrying to term, then you would be against abortion. But what is the logical reason for placing that higher value on ALL human life in the first place? That is where the unsupported proclamation happens.\n It is as unsupported as any proclamation you make regarding when value begins. That was my point last time we discussed this and it is still my point. \n \n \nI think that any being with a mental existence deserves rights - animals as well. I suppose that part of the reason that I don't automatically give equal rights to animals is that they are not part of the moral consensus. Morality is often a type of deal one makes with others - I will treat you well and you treat me well. Our moral stances are most challenged when we are in an environment where there is no moral consensus. Ex. Do we treat others well who treat us very badly? There is no way to make a moral consensus with animals. Many animals have shown codes of behavior toward others of the same or other species in dominant or submissive behavior, etc. but these do not seem to be based on any rational analysis.\nthere should have been a \"not\" in the thing you quoted from me :p", 
   {}, 
   246776, 
   null, 
   1168553880.0
  ], 
  [
   246829, 
   null, 
   "Sigma", 
   "no one doubts the adjective sense of the word ;)\n\n \n I see. And what makes something human in the noun sense of the word different from the adjective sense? Could it be that, ultimately, we're \"characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools\" like the dictionary tells us? Wouldn't that imply a mental existence to be a member?\n \n \nand what is special about the human aspect? That was my question.\n\n \n Special? In what way did I say it was \"special\"? Do you mean, what is different from a human consciousness than the animal consciousness? I have not asserted animal consciousness exists; you have.", 
   {}, 
   246804, 
   null, 
   1168561920.0
  ], 
  [
   246897, 
   null, 
   "Steeeeve", 
   "I see. And what makes something human in the noun sense of the word different from the adjective sense? Could it be that, ultimately, we're \"characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools\" like the dictionary tells us? Wouldn't that imply a mental existence to be a member?\n no. But the noun sense of the word says \"member of species homo sapien\" ...not having a brain capacity of 1400cc.\n \n \nSpecial? In what way did I say it was \"special\"? Do you mean, what is different from a human consciousness than the animal consciousness? I have not asserted animal consciousness exists; you have.\nok, well if it does exist then does this change the way we deal with animals? If not then what is so special about a human as opposed to other animals that makes our consciousness worthy of value.", 
   {}, 
   246829, 
   null, 
   1168630320.0
  ], 
  [
   246905, 
   null, 
   "Sigma", 
   "no. But the noun sense of the word says \"member of species homo sapien\" ...not having a brain capacity of 1400cc.\n\n \n By definition a member of the species homo sapien is characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools.\n \n Wouldn't you agree, then, that the definition implies a mental existence to be a member of our species?\n \n \nok, well if it does exist then does this change the way we deal with animals? If not then what is so special about a human as opposed to other animals that makes our consciousness worthy of value.\n\n \n We're determining when to place moral value on a human, not an animal. It is generally accepted that the nexus of self requires greater brain capacity than other animals are capable of.\n \n Please make your point instead of asking questions. Your questions make no sense.", 
   {}, 
   246897, 
   null, 
   1168632480.0
  ], 
  [
   246954, 
   null, 
   "Steeeeve", 
   "By definition a member of the species homo sapien is characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools.\n \n Wouldn't you agree, then, that the definition implies a mental existence to be a member of our species?\n An interesting definition I admit but every other definition there does not have the definition as so. Besides, a new-born is classified as in the species homo sapien and yet its brain is only 386cc or so. Any biology book also states that every living organism is classified in a species. Where would the fetus go if not human?\n \n So no, I do not agree that mental existence is required.\n \n \nWe're determining when to place moral value on a human, not an animal. It is generally accepted that the nexus of self requires greater brain capacity than other animals are capable of.\n \n Please make your point instead of asking questions. Your questions make no sense.\nthey certainly make sense. I ask why does being human matter? You seem to think that you have to be 1) human and 2) conscious in order to have moral value. I am asking why the human criteria exists.", 
   {}, 
   246905, 
   null, 
   1168642620.0
  ], 
  [
   246993, 
   null, 
   "Sigma", 
   "Any biology book also states that every living organism is classified in a species. Where would the fetus go if not human?\n\n \n Well, what is the dictionary criteria for being a human? It appears to be that humans are characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools.\n \n Therefore any who do not fall under this definition cannot be human. Would you agree? How else could the fetus be human if not by this dictionary definition?\n \n \nSo no, I do not agree that mental existence is required.\n\n \n So, you're pulling definitions out of your XXX now? I don't care what you agree with the definition or not. I asked if you agreed that this definition seems to imply a mental existence.\n \n \nthey certainly make sense. I ask why does being human matter? You seem to think that you have to be 1) human and 2) conscious in order to have moral value. I am asking why the human criteria exists.\n\n \n If we want to assess the moral weight of something that is human, then being human would be part of the criteria, yes? If we are asessing the moral weight of cats, the fact that it is a cat would be part of the criteria. If we are just asessing what has moral weight in general, then consciousness with no reference to species would be the criteria. \n \n What is your point?", 
   {}, 
   246954, 
   null, 
   1168654500.0
  ], 
  [
   247029, 
   null, 
   "Steeeeve", 
   "Well, what is the dictionary criteria for being a human? It appears to be that humans are characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools.\n \n Therefore any who do not fall under this definition cannot be human. Would you agree? How else could the fetus be human if not by this dictionary definition?\n by the other 5 or so definitions. Either way, Sapien should be the word you look up as Homo Sapien is two words...but since we have 5 other definitions (this includes my at home websters) then I'll take the 5 over the 1. So I guess I disagree.\n \n \nSo, you're pulling definitions out of your XXX now? I don't care what you agree with the definition or not. I asked if you agreed that this definition seems to imply a mental existence.\nDid you look at your own link? 5 other definitions (sources) saying the exact same thing...not one of them says anything about brain mass. \n \n \nIf we want to assess the moral weight of something that is human, then being human would be part of the criteria, yes? If we are asessing the moral weight of cats, the fact that it is a cat would be part of the criteria. If we are just asessing what has moral weight in general, then consciousness with no reference to species would be the criteria. \n \n What is your point?\nI feel like you aren't answering my question. I am weighing the moral value of a human verus a cast or other animal. Why would the charateristic \"human\" be more valuable than say a cat...assuming they both have consciousness?", 
   {}, 
   246993, 
   null, 
   1168706820.0
  ], 
  [
   247270, 
   null, 
   "Sigma", 
   "by the other 5 or so definitions. Either way, Sapien should be the word you look up as Homo Sapien is two words...but since we have 5 other definitions (this includes my at home websters) then I'll take the 5 over the 1. So I guess I disagree.\n\n \n I looked up Homo Sapien, which is the species we belong to. Do I have to repeat myself, Steve? Read it again: I don't care whether you agree with the definition or not. I asked if you agreed that this definition seems to imply a mental existence\n \n \nDid you look at your own link? 5 other definitions (sources) saying the exact same thing...not one of them says anything about brain mass\n\n \n lol! Ok, lets look at those other definitions.\n \n First one: The modern species of humans. How does one determine if the fetus is of the modern species of humans?\n \n Second one: The biological classification of modern humans. How does one determine if the fetus is a modern human?\n \n Third one: the only surviving hominid; species to which modern man belongs. How do we determine this, Steve?\n \n The only definition that mentions any sort of criteria was the one I quoted. Wouldn't you agree the definition I quoted implies a mental existence, Steve? Let's look at it again, Steve. It says that humans are characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools.\n \n \nI feel like you aren't answering my question. I am weighing the moral value of a human verus a cast or other animal. Why would the charateristic \"human\" be more valuable than say a cat...assuming they both have consciousness?\n\n \n You feel this way because you aren't coming to your point. I am answering as best I can. I did not say that human animals are intrinsically more valuable than a cat. We are weighing the moral value of a human, though, which is why it is part of the criteria.\n \n Or are you trying to draw the discussion off-topic?", 
   {}, 
   247029, 
   null, 
   1168882860.0
  ], 
  [
   247301, 
   null, 
   "Steeeeve", 
   "I looked up Homo Sapien, which is the species we belong to. Do I have to repeat myself, Steve? Read it again: I don't care whether you agree with the definition or not. I asked if you agreed that this definition seems to imply a mental existence\n I disagree that certain definition implies mental existence. \n \n \n\n lol! Ok, lets look at those other definitions.\n \n First one: The modern species of humans. How does one determine if the fetus is of the modern species of humans?\n \n Second one: The biological classification of modern humans. How does one determine if the fetus is a modern human?\n \n Third one: the only surviving hominid; species to which modern man belongs. How do we determine this, Steve?\nYou determine this by taking a biology class :xbanghead \n \n \nThe only definition that mentions any sort of criteria was the one I quoted. Wouldn't you agree the definition I quoted implies a mental existence, Steve? Let's look at it again, Steve. It says that humans are characterized by a brain capacity averaging 1400 cc (85 cubic in.) and by dependence upon language and the creation and utilization of complex tools.\nYeah, I'd say it implies more of a full development than \"mental existence\".\n \n \n \n\n You feel this way because you aren't coming to your point. I am answering as best I can. I did not say that human animals are intrinsically more valuable than a cat. We are weighing the moral value of a human, though, which is why it is part of the criteria.\n \n Or are you trying to draw the discussion off-topic?\nNo we are not weighing that...I made the question not you. We are weighing the moral value of a human over a cat. What makes the human have more value than a cat....what about a monkey that has more \"intelligence\" than some humans? You seem to just not want to answer!", 
   {}, 
   247270, 
   null, 
   1168897020.0
  ], 
  [
   247322, 
   null, 
   "Sigma", 
   "I disagree that certain definition implies mental existence.\n\n \n What the heck is \"certain definition\"? Do you agree or disagree that the definition I quoted implies a mental existence?\n \n \nYou determine this by taking a biology class :xbanghead\n\n \n Oh? Are you trying to tell me that the dictionary definition cannot tell us what it is to be human?! You can't be serious! The dictionary definition knows all and tells all! You must be wrong.\n \n So what is the criteria, then? What makes us 'a human' as opposed to 'human'.\n \n \nYeah, I'd say it implies more of a full development than \"mental existence\".\n\n \n Oh, so only fully developed... things... are human if they fit that criteria? What are they before they are fully developed?\n \n \nNo we are not weighing that...I made the question not you. We are weighing the moral value of a human over a cat. What makes the human have more value than a cat....what about a monkey that has more \"intelligence\" than some humans? You seem to just not want to answer!\n\n \n This question is off-topic, then. Make a new thread about what makes humans of more moral worth than animals to various posters.", 
   {}, 
   247301, 
   null, 
   1168901400.0
  ], 
  [
   247330, 
   null, 
   "procrastinating", 
   "Other reasons for pro life\n \n You do not know who you are aborting, they could be a future presidant or a nobel peace prize winner.\n \n In many states, if a mother can't or won't raise her child, she can drop them of at her local fier station (and hospital) with no questions asked. \n \n You would be destroying whole generations to come. (that baby leads to more babys....)\n \n Babys are the outcome of sex, If you don't want a baby, don't have sex!!!!!! \n \n If the case is rape, well, give the baby to adoption and insted of founding abortion, help fight rapeists with organisations like \"just yell fire\". \n \n Abortion leads to cancer\n\n \n \n We can abort a future president? the president has been the leading cause of 72nd to 168th \"trimester\" abortions.\n \n Drop it at a fire station? it goes to a foster home, where the chances of a child being abused or molested are exponentialy higher.\n \n You would be destroying future generations to come? The people that survive already do that, we don't need more to add to that: CIA, NAZI party, other imperialists.\n \n Don't have sex? don't eat, don't sleep, don't groom yourself. Sex is a natural human instinct, and the only true reason for human existence.\n \n Just yell fire? The amount of rapists is the result of an overcrowded and averly frustated society which has not taken advantage of abortion enough.\n \n Abortion leads to cancer? So do Mouthwashes, feminine products, the sun, color cosmetics, cellular telephones, toothpastes, bubble baths, shampoos, microwaves, lye, MSG, mineral oil, talc, whole milk, oscar meyer hot dogs, computer radiation (uh oh), nuclear power plants, some carpets, Zodiac flea collars, and hundreds of chemicals.", 
   {
    "post_info": {
     "post_title": "?!?!?!??!"
    }
   }, 
   245432, 
   null, 
   1168903140.0
  ], 
  [
   247338, 
   null, 
   "Steeeeve", 
   "What the heck is \"certain definition\"? Do you agree or disagree that the definition I quoted implies a mental existence?\n Disagree. I stated that. The \"certain definition\" was the one you quoted.\n \n \n\n Oh? Are you trying to tell me that the dictionary definition cannot tell us what it is to be human?! You can't be serious! The dictionary definition knows all and tells all! You must be wrong.\n \n So what is the criteria, then? What makes us 'a human' as opposed to 'human'.\nAre you suggesting the dictionary is meaningless? If you want to try and define every word in every definition then you could come to the conclusion that nothing is defined. You asked questions that were not related to definition as it assumes some level of knowledge (ie not questioning every word in the definition).\n \n The criteria for the word human is set up in the dictionary as that is what they are there for. I don't claim you have to put any moral significance on this.\n \n \n\n Oh, so only fully developed... things... are human if they fit that criteria? What are they before they are fully developed?\nI said the definition you selectivily chose implies a fully developed body. This contradicts the other 5 definitions in the same link you gave me so I reject the definition you gave. It beats me what dictionary.com (the source of that definition) thinks 2yr olds are.\n \n \n\n This question is off-topic, then. Make a new thread about what makes humans of more moral worth than animals to various posters.\nIt is right on topic. Why can't you answer? The discussion we were having was about consciousness and that being the deciding factor for moral value. I said that my cat has consciousness and then you said my cat was not human. My question is why should \"human\" matter?", 
   {}, 
   247322, 
   null, 
   1168906320.0
  ], 
  [
   247349, 
   null, 
   "Sigma", 
   "Disagree. I stated that. The \"certain definition\" was the one you quoted.\n\n \n I see. On what basis do you disagree that dependence upon language and the creation and utilization of complex tools implies a mental existence?\n \n \nAre you suggesting the dictionary is meaningless? If you want to try and define every word in every definition then you could come to the conclusion that nothing is defined. You asked questions that were not related to definition as it assumes some level of knowledge (ie not questioning every word in the definition).\n\n \n I see. You are then claiming the dictionary does not provide a criteria for being human, and instead assumes we know this criteria? What is the criteria then, according to Steve?\n \n \nI said the definition you selectivily chose implies a fully developed body. This contradicts the other 5 definitions in the same link you gave me so I reject the definition you gave. It beats me what dictionary.com (the source of that definition) thinks 2yr olds are.\n\n \n Contradicts in what way? I see no contradiction. The other definitions provide no criteria, while the one I quoted did. Yet it is unacceptable to you for some reason you have not supplied.\n \n \nIt is right on topic. Why can't you answer? The discussion we were having was about consciousness and that being the deciding factor for moral value. I said that my cat has consciousness and then you said my cat was not human. My question is why should \"human\" matter?\n\n \n The deciding factor for moral value... in humans. Whether it applies to non-human animals or not would be the subject for another thread.", 
   {}, 
   247338, 
   null, 
   1168910100.0
  ], 
  [
   247418, 
   null, 
   "Steeeeve", 
   "I see. On what basis do you disagree that dependence upon language and the creation and utilization of complex tools implies a mental existence?\nThat is more developmental than mental existence. You could certainly have mental existence and not have language or utilization of complex tools.\n \n \nI see. You are then claiming the dictionary does not provide a criteria for being human, and instead assumes we know this criteria? What is the criteria then, according to Steve?\nActually I am claiming the dictionary defines human. How scientific classification works is not the purpose of the dictionary.\n \n Seems you are claiming the dictionary can't tell us anything. I don't even know what you are typing to me! emoticon_rolleyes \n \n \nContradicts in what way? I see no contradiction. The other definitions provide no criteria, while the one I quoted did. Yet it is unacceptable to you for some reason you have not supplied.\n Well, ignoring the fact that you chose \"homo sapiens\" as opposed to one homo sapien (a group instead of individual) the other 4 or 5 definitions provide a definition. You seem to want the dictionary to be more than it is...I can't help you there. The only point I make is that a human embryo qualifies under the definition of human or human being. Obviously those two nouns describe something and an embryo is part of what they describe.\n \n \nThe deciding factor for moral value... in humans. Whether it applies to non-human animals or not would be the subject for another thread.\nSo you don't want to answer or what? I made the question...you refuse to answer eventhough I have answered all your questions. Very classy.", 
   {}, 
   247349, 
   null, 
   1168966800.0
  ], 
  [
   247426, 
   null, 
   "ShadowPikachu", 
   "Well, I had decided not to post on this thread and only read it, but I could not contain myself over the last few posts. Steeeeve, who just a few pages back acted like the dictionary definition was the be-all end-all thing, is now trying to squirm wildly when a dictionary definition is not one that he would like. ROFLMAO!! emoticon_wow \n \n A few posts up he says this:\n \nI said the definition you selectivily chose implies a fully developed body. This contradicts the other 5 definitions in the same link you gave me so I reject the definition you gave. It beats me what dictionary.com (the source of that definition) thinks 2yr olds are.\n \n\n \n pretty much ridiculing the definition by dictionary.com, when a few pages ago he says this:\n \n \nEmphasis mine\n \n You realize the fetus (or foetus) is a living human, right? And by living human I mean the noun sense of the word since Shooter loves playing tense games.\n \n http://dictionary.reference.com/browse/human%20being\n \n The fetus qualifies the criteria\n\n \n and then the next several posts acted like the definition there was a holy command or something. Can't have it both ways Steeeeve.", 
   {}, 
   247418, 
   null, 
   1168970520.0
  ], 
  [
   247427, 
   null, 
   "ShadowPikachu", 
   " Well, ignoring the fact that you chose \"homo sapiens\" as opposed to one homo sapien (a group instead of individual) the other 4 or 5 definitions provide a definition. You seem to want the dictionary to be more than it is...I can't help you there. The only point I make is that a human embryo qualifies under the definition of human or human being. Obviously those two nouns describe something and an embryo is part of what they describe.\n \n\n Funny, I thought a few pages back you said:\n \nHow can you get anymore specific then \"member of the species Homo Sapien\"?\n\n \n \n Plus, YOU are the one who claims it is homo sapien, when the definition you gave from dictionary.com says homo sapiens. Now you are trying to claim that he looked up the wrong word, when he looked up the exact right word. What you are doing now, as out friend Jyoshu would say, is moving the goalposts. Having fun squirming now that the definition doesn't suit you, Steeeeve?", 
   {}, 
   247418, 
   null, 
   1168971060.0
  ], 
  [
   247437, 
   null, 
   "thelmoose", 
   "\n Well, ignoring the fact that you chose \"homo sapiens\" as opposed to one homo sapien (a group instead of individual)...\n \n\n \n The name of our species is Homo sapiens. There is an \"s\" on the end. There is no \"sapien\". The word refers to the name of the species; it is not plural. \n \n Sheesh! It is amazing how these arguments degrade like this.", 
   {}, 
   247427, 
   null, 
   1168980600.0
  ], 
  [
   247446, 
   null, 
   "Sigma", 
   "Actually I am claiming the dictionary defines human. How scientific classification works is not the purpose of the dictionary.\n\n \n Yes. Scientific classification is not the purpose of the dictionary. The dictionary's sole purpose is recording how people generally use terms. It has no objective validity and no use beyond informing us how people generally use terms.\n \n \nYou seem to want the dictionary to be more than it is...I can't help you there. The only point I make is that a human embryo qualifies under the definition of human or human being.\n\n \n The only way this has any validity in this debate is if the question is: \"What is the dictionary definition\". The dictionary has no use in this debate beyond that. That is not the question here. The question here is: \"Does the fetus qualify conceptually under the philosophical umbrella of 'human being' or 'person'?\" That is a question the dictionary can never answer.\n \n \nSo you don't want to answer or what? I made the question...you refuse to answer eventhough I have answered all your questions. Very classy.\n\n \n I've never considered it important to this debate. If you wish to discuss this, I'd be happy to contribute in a new thread.", 
   {}, 
   247418, 
   null, 
   1168986420.0
  ], 
  [
   247519, 
   null, 
   "Steeeeve", 
   "The name of our species is Homo sapiens. There is an \"s\" on the end. There is no \"sapien\". The word refers to the name of the species; it is not plural. \n My mistake...not sure what I was thinking there.", 
   {}, 
   247437, 
   null, 
   1169053440.0
  ], 
  [
   247520, 
   null, 
   "Steeeeve", 
   "Yes. Scientific classification is not the purpose of the dictionary. The dictionary's sole purpose is recording how people generally use terms. It has no objective validity and no use beyond informing us how people generally use terms.\n and no one claimed otherwise.\n \n \n\n The only way this has any validity in this debate is if the question is: \"What is the dictionary definition\". The dictionary has no use in this debate beyond that. That is not the question here. The question here is: \"Does the fetus qualify conceptually under the philosophical umbrella of 'human being' or 'person'?\" That is a question the dictionary can never answer.\nThat is not the question. Philosophy doesn't define terms. The questions is \"Does the fetus qualify as morally valuable\". The fact that the fetus is a human is rather irrelevant but don't go around saying \"it isn't a human therefore ok\" because 1) it in fact is a human and 2) this doesn't prove or disprove anything.\n \n \nI've never considered it important to this debate. If you wish to discuss this, I'd be happy to contribute in a new thread.\nI feel it is very important as I don't say which characteristics are important to give it moral value I just say being a human gives you moral value in and of its self. I'll consider starting a new thread since you feel it is irrelevant to this one (although I disagree with this)", 
   {}, 
   247446, 
   null, 
   1169053800.0
  ], 
  [
   247522, 
   null, 
   "Steeeeve", 
   "Well, I had decided not to post on this thread and only read it, but I could not contain myself over the last few posts. Steeeeve, who just a few pages back acted like the dictionary definition was the be-all end-all thing, is now trying to squirm wildly when a dictionary definition is not one that he would like. ROFLMAO!! emoticon_wow \n \n A few posts up he says this:\n \n pretty much ridiculing the definition by dictionary.com, when a few pages ago he says this:\n \n and then the next several posts acted like the definition there was a holy command or something. Can't have it both ways Steeeeve.\n\n I was ridiculing dictionary.com's definition...but you fail to realize that dictionary.com gives many sources (one being its own). Dictionary.com's own definition doesn't make much sense and certainly doesn't imply a mental existense. It also contradicts the other 4 or 5 definitions provided by dictionary.com. I choose to go with the 4. With \"human being\" they all seem to be the same.\n \n Nice try though.", 
   {}, 
   247426, 
   null, 
   1169054040.0
  ], 
  [
   247524, 
   null, 
   "Steeeeve", 
   "Funny, I thought a few pages back you said:\n \nI fail to see your point here. You can't get any more specific then \"member of homo sapien\" in a dictionary. As I said, the dictionary is what it is...", 
   {}, 
   247427, 
   null, 
   1169054280.0
  ], 
  [
   247530, 
   null, 
   "ShadowPikachu", 
   "I fail to see your point here. You can't get any more specific then \"member of homo sapien\" in a dictionary. As I said, the dictionary is what it is...\n\n \n You are denying the definition of homo sapiens, which you said yourself was the definition of human. Now that a definition is there that you disagree with, suddenly now the dictionary is \"flawed\" or whatever you are trying to say, when before you were chanting on and on about how people had to use the definition of the dictionary. Stop your squirming.", 
   {}, 
   247524, 
   null, 
   1169054760.0
  ], 
  [
   247533, 
   null, 
   "Steeeeve", 
   "You are denying the definition of homo sapiens, which you said yourself was the definition of human. Now that a definition is there that you disagree with, suddenly now the dictionary is \"flawed\" or whatever you are trying to say, when before you were chanting on and on about how people had to use the definition of the dictionary. Stop your squirming.\n No, I disagree that one definition (out of the 5 or so) is accurate as it contradicts the other 4 sources. Even you should be able to understand that concept. If you feel that the dictionary.com source definition is the correct one then by all means use that one but tell me what classification a 1yr old would fall under.", 
   {}, 
   247530, 
   null, 
   1169054940.0
  ], 
  [
   247549, 
   null, 
   "ShadowPikachu", 
   "No, I disagree that one definition (out of the 5 or so) is accurate as it contradicts the other 4 sources. Even you should be able to understand that concept. If you feel that the dictionary.com source definition is the correct one then by all means use that one but tell me what classification a 1yr old would fall under.\n\n \n Good Lord, I never thought I'd see the day!!emoticon_wow Steeeeve has finally realised that the dictionary is limited and is not the be-all end-all for this debate, and it is really your views on a definition that matter, not a definition found in a dictionary. That's what we were trying to show you, but you were so stubborn it took a definition that contradicted your views to make you realize it.", 
   {}, 
   247533, 
   null, 
   1169064240.0
  ], 
  [
   247552, 
   null, 
   "Steeeeve", 
   "Good Lord, I never thought I'd see the day!!emoticon_wow Steeeeve has finally realised that the dictionary is limited and is not the be-all end-all for this debate, and it is really your views on a definition that matter, not a definition found in a dictionary. That's what we were trying to show you, but you were so stubborn it took a definition that contradicted your views to make you realize it.\n\n \n As I recall this started from you incorrectly saying the fetus was not a human when infact the fetus is a human. Seems odd that you try to justify abortion by claiming a different species.\n \n I haven't changed anything I stated other than the \"homo sapiens\" comment I made earlier..odd fellow you are.", 
   {}, 
   247549, 
   null, 
   1169064480.0
  ], 
  [
   247561, 
   null, 
   "Sigma", 
   "and no one claimed otherwise.\n\n \n Then you really cannot claim the dictionary tells us who is or is not human, because the dictionary does not determine ones species. If you wish to claim the dictionary can tell us the criteria for being human then you would have to tell me on what basis you contend that dependence upon language and the creation and utilization of complex tools does not imply a mental existence.\n \n \nThat is not the question. Philosophy doesn't define terms.\n\n \n We define terms for use in philosophy. And that is indeed the question since it is assumed that those who qualify as a 'person' or 'human being' is worthy of moral consideration.\n \n \nThe fact that the fetus is a human is rather irrelevant but don't go around saying \"it isn't a human therefore ok\" because 1) it in fact is a human and 2) this doesn't prove or disprove anything.\n\n \n But is is philosophically human? What does it mean to be human? That is a question the dictionary cannot answer.\n \n Hell, the dictionary cannot even tell us whether it is scientifically human.\n \n \nI feel it is very important as I don't say which characteristics are important to give it moral value I just say being a human gives you moral value in and of its self.\n\n \n Your original statement was that mental existence made your cat human. Mental existence may give your cat moral value, but it cannot make it human. However, we are only discussing the moral value in humans. Your point here is off-topic.\n \n \nI'll consider starting a new thread since you feel it is irrelevant to this one (although I disagree with this)\n\n \n I cannot see any point in this one.", 
   {}, 
   247520, 
   null, 
   1169068680.0
  ], 
  [
   247562, 
   null, 
   "Sigma", 
   "No, I disagree that one definition (out of the 5 or so) is accurate as it contradicts the other 4 sources\n\n \n Show the contradiction. I contend there is none. The one I quoted was the only definition that provided a criteria.", 
   {}, 
   247533, 
   null, 
   1169068920.0
  ], 
  [
   247576, 
   null, 
   "ShadowPikachu", 
   "Show the contradiction. I contend there is none. The one I quoted was the only definition that provided a criteria.\n\n \n Exactly. There ARE no contradictions. The one you quoted is just more detailed in providing a criteria, while the others are more vague. The only contradiction here is Steeeeve now trying to deny a definition, when before he treated them like his Bible.", 
   {}, 
   247562, 
   null, 
   1169072220.0
  ], 
  [
   247595, 
   null, 
   "Steeeeve", 
   "Then you really cannot claim the dictionary tells us who is or is not human, because the dictionary does not determine ones species.\n Yet it defines words... so it does tell us what entities we call a human.\n \n\n If you wish to claim the dictionary can tell us the criteria for being human then you would have to tell me on what basis you contend that dependence upon language and the creation and utilization of complex tools does not imply a mental existence.\nbecause it implies a level of development. You can have mental existence without having a language or ability to utilize complex tools. I claim that the dictionary tells us what we call certain things (atleast for nouns). Take the noun \"cheese\" for example. The definition does tell us how it has to be made but it does say qualify what \"cheese\" is and the certain things that fall under the definition of \"cheese\". Blue cheese is a cheese.\n \nWe define terms for use in philosophy. And that is indeed the question since it is assumed that those who qualify as a 'person' or 'human being' is worthy of moral consideration.\nWhat? You develop a different language for philosophy? Sounds like a way to justify something as opposed to make a real argument. I've never heard of creating words for use in philosophy....but whatever works for you I suppose, just let me know when you are using this \"language\" as opposed to English.\n \n \n\n But is is philosophically human? What does it mean to be human? That is a question the dictionary cannot answer.\nWhat a dumb idea. Who thinks that way and who cares? the question is about moral value not how we define \"human\" in a new language called \"Philosophical English\". \n \n \nYour original statement was that mental existence made your cat human. Mental existence may give your cat moral value, but it cannot make it human. However, we are only discussing the moral value in humans. Your point here is off-topic.\nNo, that is not what my statement was. My statement was \"my cat has mental existence\"...If I implied my cat is human then I misspoke. My question was regards to what makes a \"human\" (in the English meaning of the word) significant. If \"mental existence\" is the test then species shouldn't matter....right?", 
   {}, 
   247561, 
   null, 
   1169076420.0
  ], 
  [
   247597, 
   null, 
   "Steeeeve", 
   "Show the contradiction. I contend there is none. The one I quoted was the only definition that provided a criteria.\n\n \n They all provided a criteria...we are going in circles. Like I stated before, you seem to want to procedure to make cheese when the dictionary just defines what cheese is.\n \n So you don't want to call a fetus or embryo a human (for whatever reason) so what do you propose the species is of an embryo or fetus? Furthermore, what is a human?..enlighten me with your definition.", 
   {}, 
   247562, 
   null, 
   1169076660.0
  ], 
  [
   247618, 
   null, 
   "Sigma", 
   "Yet it defines words... so it does tell us what entities we call a human.\n\n \n It is a recording of how people generally use those words. It is an authority on nothing but how people generally use words. \n \n As you yourself admit, the dictionary definitions do not necessarily have any scientific validity. Trying to claim something about the fetus' status within a species because of the dictionary is laughable. That is not the purpose of the dictionary.\n \n You want to say the fetus is human, but you do not come up with any criteria to objectively determine if this is so.\n \n \nbecause it implies a level of development. You can have mental existence without having a language or ability to utilize complex tools.\n\n \n The question is, though, whether one can use language, have an ability to utilize complex tools without a mental existence.\n \n \nI claim that the dictionary tells us what we call certain things (atleast for nouns).\n\n \n No, it doesn't. It doesn't tell us what we call things. It tells us what those things are generally called, but it has no authority over what we call things.\n \n \nTake the noun \"cheese\" for example.\n\n \n Apples and oranges, really. Let's take something living, like a dog. Dictionary says: Canis familiaris, which is (probably) the domesticated decendent of a wolf. How do we determine if something is decended from a wolf, Steve?\n \n \nWhat? You develop a different language for philosophy?\n\n \n Only you, Steve, would think that a different defintion would suddenly make a new language. We use different definitions for even common words than what any dictionary might put out to satisfy shadings of meaning that may be necessary for a certain discussion.\n \n \nWhat a dumb idea. Who thinks that way and who cares? the question is about moral value not how we define \"human\" in a new language called \"Philosophical English\".\n\n \n It is assumed that we morally value those that we philosophically consider a 'person' or 'human being'. The question is whether the fetus would fall under these umbrellas. \n \n \nNo, that is not what my statement was. My statement was \"my cat has mental existence\"...If I implied my cat is human then I misspoke. My question was regards to what makes a \"human\" (in the English meaning of the word) significant. If \"mental existence\" is the test then species shouldn't matter....right?\n\n \n lol. Your statement was: My cat mentally lives...she must be a human.\n \n In regards to your question: The reason that human is significant in this discussion is that we are determing the moral value of something human.\n \n If you want to know why something human is morally more significant than animals (if they are), then start another thread.", 
   {}, 
   247595, 
   null, 
   1169086680.0
  ], 
  [
   247620, 
   null, 
   "Sigma", 
   "They all provided a criteria...we are going in circles.\n\n \n No, they didn't. Lay out the contradiction you see.\n \n \nLike I stated before, you seem to want to procedure to make cheese when the dictionary just defines what cheese is.\n\n \n Or: I'm looking at why something is called cheese to determine if something is cheese. I need objective criteria, Steve.\n \n \nSo you don't want to call a fetus or embryo a human (for whatever reason) so what do you propose the species is of an embryo or fetus?\n\n \n I don't believe I ever said anything even similar to this. I'm just trying to find what objective criteria you are using to determine that the fetus is 'a human' in the noun sense of the word, since you don't want to accept the dictionary criteria.\n \n \nFurthermore, what is a human?..enlighten me with your definition.\n\n \n Oh, so now personal definitions are valid to you?", 
   {}, 
   247597, 
   null, 
   1169087040.0
  ], 
  [
   247627, 
   null, 
   "Shooterandproud", 
   "because it implies a level of development. You can have mental existence without having a language or ability to utilize complex tools. I claim that the dictionary tells us what we call certain things (atleast for nouns). Take the noun \"cheese\" for example. The definition does tell us how it has to be made but it does say qualify what \"cheese\" is and the certain things that fall under the definition of \"cheese\". Blue cheese is a cheese.\n\n \n But milk is not a cheese. Just because it has the chance to become cheese, does not make milk cheese. Same goes with an embryo and a human.", 
   {}, 
   247620, 
   null, 
   1169089500.0
  ], 
  [
   247629, 
   null, 
   "Shooterandproud", 
   "No, they didn't. Lay out the contradiction you see.\n \n \n \n Or: I'm looking at why something is called cheese to determine if something is cheese. I need objective criteria, Steve.\n \n \n \n I don't believe I ever said anything even similar to this. I'm just trying to find what objective criteria you are using to determine that the fetus is 'a human' in the noun sense of the word, since you don't want to accept the dictionary criteria.\n \n \n \n Oh, so now personal definitions are valid to you?\n\n \n Steeve, if my kidney isn't a human then what species is it?", 
   {}, 
   247620, 
   null, 
   1169089620.0
  ], 
  [
   247635, 
   null, 
   "Steeeeve", 
   "No, they didn't. Lay out the contradiction you see.\n \n Is it not obvious? No has a certian level of development as the point where other definitions of homo sapiens suggest the modern human or \"the only surviving hominid\". The procedures for classifying are not in the dictionary..thus a biology book is what you need.\n \n \n\n Or: I'm looking at why something is called cheese to determine if something is cheese. I need objective criteria, Steve.\nWhy is it called cheese? Because it is \"a solid food prepared from the pressed curd of milk \". Why is a fetus a human because \"it belongs to the species homo sapiens\". \n \n You have this idea of a new language for philosophy and I simply reject that. In the cheese example you would take \"milk\" and find a definition on that and then dig down some more until it makes no sense. Whatever happened to being reasonable? \n \n \nI don't believe I ever said anything even similar to this. I'm just trying to find what objective criteria you are using to determine that the fetus is 'a human' in the noun sense of the word, since you don't want to accept the dictionary criteria.\nIrrelevant to what we are talking about. I reject the idea that criteria is needed in a definition (atleast to what we are referring to).\n \n \nOh, so now personal definitions are valid to you?\nno...but it would be interesting to see what you new language looks like.", 
   {}, 
   247620, 
   null, 
   1169092740.0
  ], 
  [
   247636, 
   null, 
   "Steeeeve", 
   "But milk is not a cheese. Just because it has the chance to become cheese, does not make milk cheese. Same goes with an embryo and a human.\n\n yet an embryo is a human :) So in this case an aging cheese is still a cheese even if not aged enough to eat (for some cheeses).", 
   {}, 
   247627, 
   null, 
   1169092860.0
  ], 
  [
   247642, 
   null, 
   "Steeeeve", 
   "Steeve, if my kidney isn't a human then what species is it?\n\n \n part of a entity that is homo sapien. You only classify a living species and are classified with common DNA as an entity..not parted like you seem to think.\n \n This really is basic biology.", 
   {}, 
   247629, 
   null, 
   1169093280.0
  ], 
  [
   247645, 
   null, 
   "Shooterandproud", 
   "part of a entity that is homo sapien. You only classify a living species and are classified with common DNA as an entity..not parted like you seem to think.\n \n This really is basic biology.\n\n \n Then why isn't an embryo part of an species that is homo sapien? It is living inside of the body, completely integrated and feeding off of its resources, like a kidney, so what makes it so different?", 
   {}, 
   247642, 
   null, 
   1169094960.0
  ], 
  [
   247731, 
   null, 
   "Sigma", 
   "Is it not obvious? No has a certian level of development as the point where other definitions of homo sapiens suggest the modern human or \"the only surviving hominid\"\n\n \n I don't understand this sentence. Please clarify.\n \n \nThe procedures for classifying are not in the dictionary..thus a biology book is what you need.\n\n \n You insist the fetus is human and that the dictionary definition makes it so, yet now you claim that the dictionary cannot classify what species the fetus is part of? It seems that the dictionary is not the authority on this subject you previously seemed to think it was.\n \n What is the criteria then, Steve. What objective criteria can we check about the fetus to determine whether the fetus is or is not human, biologically?\n \n \nWhy is it called cheese? Because it is \"a solid food prepared from the pressed curd of milk \". Why is a fetus a human because \"it belongs to the species homo sapiens\".\n\n \n Ah, but you can determine whether something is or is not milk. You are unwilling to accept the dictionary criteria for whether something is or is not a member of the species homo sapiens.\n \n \nYou have this idea of a new language for philosophy and I simply reject that. In the cheese example you would take \"milk\" and find a definition on that and then dig down some more until it makes no sense. Whatever happened to being reasonable?\n\n \n Reasonable? This discussion has absolutely nothing to do with reason and everything to do with semantics. That's what you wanted, Steve. Is the dictionary the authority is it not?\n \n \nIrrelevant to what we are talking about. I reject the idea that criteria is needed in a definition (atleast to what we are referring to).\n\n \n Of course the criteria is needed in the definition, if the dictionary is the authority over whether or not the fetus is a human. If the dictionary is not the authority, then you have no basis in claiming that because the dictionary says it then it must be so.\n \n \nno...but it would be interesting to see what you new language looks like.\n\n \n Amazingly enough, it looks exactly like English... because it is English. Living language, Steve ;)", 
   {}, 
   247635, 
   null, 
   1169148180.0
  ], 
  [
   247769, 
   null, 
   "Steeeeve", 
   "I don't understand this sentence. Please clarify.\n \n \"One has a certian level of development as the point the other definitions of homo sapiens suggest the modern human or \"the only surviving hominid\".\n \n So two different ideas.\n \n \nYou insist the fetus is human and that the dictionary definition makes it so, yet now you claim that the dictionary cannot classify what species the fetus is part of? It seems that the dictionary is not the authority on this subject you previously seemed to think it was.\nThe dictionary tells us proper usage of words....such as cheese. The word human can be used to describe the fetus. To say the word human could not describe a fetus is inaccurate. Words don't make something what it is...it is what it is...words just describe. I can't believe you are really debating how language works...I thought they taught this stuff.\n \n \nWhat is the criteria then, Steve. What objective criteria can we check about the fetus to determine whether the fetus is or is not human, biologically?\nDNA...consult a biology book for how they classify species.\n \n \n\n Ah, but you can determine whether something is or is not milk. You are unwilling to accept the dictionary criteria for whether something is or is not a member of the species homo sapiens.\nI actually an unwilling to accept one criteria as it conflicts with many others and the basic understanding of biology. You seem unwilling to accept everything but your own personal English language. Can you explain how you classify things in a species?\n \n \nReasonable? This discussion has absolutely nothing to do with reason and everything to do with semantics. That's what you wanted, Steve. Is the dictionary the authority is it not?\nIt has to do with proper usage of words and playing around with them to justify abortion. This started by someone calling the fetus \"not human\". If I called you \"not a human\" and you said I was wrong would you call that debate about \"semantics\"? Certainaly not. Seems you are just trying be annoying about the whole thing.\n \n \n\n Of course the criteria is needed in the definition, if the dictionary is the authority over whether or not the fetus is a human. If the dictionary is not the authority, then you have no basis in claiming that because the dictionary says it then it must be so.\nI never claimed it to be an authority over anything other than defining word usage. The dictionary doesn't make something what it is. When did you get this idea.\n \n \nAmazingly enough, it looks exactly like English... because it is English. Living language, Steve ;)\n[/QUOTE]Then use it correctly. The fetus is a human...of the species homo sapien....my cat is black...my desk is made out of maple. I mean really, this shouldn't have been such a long conversation. Just don't justify abortion by saying the fetus is not a human...that is inaccurate. Would you agree? or do you propose we make a new meaning human using your \"philosophy language\". Who defines words in your world?", 
   {}, 
   247731, 
   null, 
   1169165400.0
  ], 
  [
   247770, 
   null, 
   "Steeeeve", 
   "Then why isn't an embryo part of an species that is homo sapien? It is living inside of the body, completely integrated and feeding off of its resources, like a kidney, so what makes it so different?\n\n \n Are you really asking or just trying to be smart? In general genetically unique is the answer. Seriously, this stuff is in biology books. The embryo also has development properities which a kidney does not have (a kidney never grows into an adult).", 
   {}, 
   247645, 
   null, 
   1169165640.0
  ], 
  [
   247873, 
   null, 
   "Sigma", 
   "\n DNA...consult a biology book for how they classify species\n\n \n I see. I refer you to a previous post of mine, then: A sperm is human in the same way the fetus is human: they both contain human DNA.\n \n The adjective sense and the noun sense are the same. They both generally describe a living thing that contains human DNA.\n \n \nIt has to do with proper usage of words and playing around with them to justify abortion. This started by someone calling the fetus \"not human\". If I called you \"not a human\" and you said I was wrong would you call that debate about \"semantics\"? Certainaly not.\n\n \n If they tried to use the dictionary to justify this? lol, yes it would be a debate about semantics. It would be asnine to try to use the dictionary in this way.", 
   {}, 
   247769, 
   null, 
   1169259000.0
  ], 
  [
   247906, 
   null, 
   "maximus", 
   "I've been thinking of the reasons people go pro-choice or pro-life, and to me it seems that the pro-choice stance has overwhelming proof on their side. Lets take a look:\n \n \n Reasons for Pro-life:\n \n 1)Protecting the \"innocent\" baby or embryo or whatever\n \n 2)Earining brownie points in heavan\n \n I can't think of anymore, please post and i'll add to the list.\n \n Reasons for pro-choice:\n \n 1)This is a woman's body, not yours, not mine, and certainly not the governments.\n \n 2)An embryo can not make a decision, but a mother knows her circumstances best, therefore she should choose for the both.\n \n 3)An Embryo is not a sentient life form, and does not posses self awareness or consciousness, or to quote Another Opinion: \"Mentally exist\". \n \n 4)The only thing an embryo and humans have in common is a strand of DNA.\n \n 5)Abortion has some positive effects on society, as in the book Freakonomics by um... forgot the guy, Steve something, the author cites that the legalization of abortions caused a rapid decrease in crime, which makes sense if you think about it. Unwanted children are 10X more likely to become criminals.\n \n 6)And embryo does not have a 100% possiblilty of growing into a human being. 20% of pregnancies end in a miscarrige.\n \n 7)Birth control is not 100% effective. As I have said before, my friend's mom had her sister on the pill. Even though this makes up a small percentage of abortion, it still makes up some percentage, which is reason enough.\n \n 8)Being forced to carry through and unwanted pregnancy can have devastating effects on a women, namely financially and emotionally.\n \n\n \n It's very nice how you have enumertated your own pro-choice points so eloquently and elaborately yet put words into the mouths of the pro-life movement. Of course, you have not put forth the pro-life words so eloquently or elaborately. Of course, you seek to reduce our reasons to some implied childish motivation to get \"brownie points\" with God. \"But unless you become like a child you will never enter the kingdom of heaven.\" Matthew 18:3, \"I praise you, Father, Lord of heaven and earth, because you have hidden these things from the wise and learned, and revealed them to little children.\" Matthew 11:25\n \n But let's address your points specifically:\n \n \n1)This is a woman's body, not yours, not mine, and certainly not the governments.\n\n Freedom is not the ultimate good of this world. Your freedom revolves only about the mother. You fail to acknowledge that there is a truth existent outside of the realm of a mother's freedom of body yet intimately related to her freedom. Your freedom operates without recognition of this truth. Outside of your freedom there is an objective truth. You neglect the truth that there is another being in the womb, a being with inherent value and dignity. This truth must be considered in all acts of freedom. \n \n Abortion is not an act of freedom but an abuse of freedom. We can put it into the context of many other abuses of personal freedom. Freedom cannot exist without truth. \n \n \n2)An embryo can not make a decision, but a mother knows her circumstances best, therefore she should choose for the both.\n\n The mother (and often the father) obviously have to choose for both herself and her child. The question remains, though, what is a right, good choice? What is a legitimate, just choice? What is a choice that considers the full well-being of mother and child? Is the violent choice of abortion a beneficial choice in a civilized society?\n \n \n3)An Embryo is not a sentient life form, and does not posses self awareness or consciousness, or to quote Another Opinion: \"Mentally exist\". \n\n Lack of mental awareness or self-awareness is not a justification for killing these beings.\n \n \n4)The only thing an embryo and humans have in common is a strand of DNA.\n\n I think the comparison and contrast is more stark. \n \n \n5)Abortion has some positive effects on society, as in the book Freakonomics by um... forgot the guy, Steve something, the author cites that the legalization of abortions caused a rapid decrease in crime, which makes sense if you think about it. Unwanted children are 10X more likely to become criminals.\n\n Abortion has positive effects on society? Many evils may appear to have good effects. What good does gang violence bring about? It eliminates another individual who might commit crime, it decreases the population so there is less scarcity of resources, etc. We cannot commit evil to do good.\n Abortion has \"positive\" effects so let's eliminate these beings and not give them a chance at living the American Dream. There are a lot of others we can eliminate to decrease crime. \n \n Why not address the real problem, the treatment and rearing of children, instead of getting rid of the children. Why not address the idea that moral actions (or immoral actions--crime) are not determined by scarcity of resources. Why not discuss the breakdown of the traditional family (who has had the responsibilitiy of educating and raising these children for thousands of years) and the effect on society resulting from this.\n \n \n6)And embryo does not have a 100% possiblilty of growing into a human being. 20% of pregnancies end in a miscarrige.\n\n 100% of 5 year olds do not make it to be 10 years old, 100% of 20 year olds do not make it to be 30 year olds, 100% of 50 year olds do not make it to be 65 years old. Does this justify killing them?\n \n 20% of pregnancies end in miscarriage. So let's kill some more? But abortion and miscarriage are different in kind, not degree. An active action to kill a living human being in the womb is different than a spontaneous abortion due to inability to survive.\n \n \n7)Birth control is not 100% effective. As I have said before, my friend's mom had her sister on the pill. Even though this makes up a small percentage of abortion, it still makes up some percentage, which is reason enough.\n\n I'm not sure what you're saying here. Are you saying that due to birth control's failure, abortion is needed as a safety net? Are are you acknowledging the abortive aspects of artificial contraception?\n \n \n8)Being forced to carry through and unwanted pregnancy can have devastating effects on a women, namely financially and emotionally.\n\n I can think of no more devastating effect than the end of life prematurely, a destruction of one's being and existence. That is what the being in the womb goes through. This is not to mention the devastating effects on women who have undergone abortion.\n \n http://www.silentnomoreawareness.org/", 
   {}, 
   245426, 
   null, 
   1169310600.0
  ], 
  [
   247912, 
   null, 
   "gman", 
   "\n 1. You mean like a tapeworm? Should removing tapeworms be illegal too?\n \n 2. I don't follow you here. Can you back up your little sacred \"trust\" theory? There is no trust between an embryo and a woman. An embryo cannot feel trust, it cannot even feel itself. Its really only a hunk of cells, and saying that it trusts the woman is like me saying that the flowers in my garden trust me to water them. And, at what point does a life become \"sacred\". I'm sure you've weeded your garden, is that an embarrasing disregard for sacred life? Is hunting an embarrassing disregard for sacred life? \n 3. By your logic, i can call almost anything a \"sacred life\".\n\n \n 1. If I'm not mistaken, this is your thread. Was the subject tapeworms? \n \n 2. I'm not surprised that you don't follow the concept of trust a child automatically, by instinct, places in it's mom. You are assuming what an embryo can or can not feel. Due to it's inability to communicate. Are you stating that any being that can not communicate is expendable? I would bet that you would go to extremes to protect a baby seal about to get it's head bashed in by an eskimo hunter to sell it's coat. Regardless of it's inability to say I want to live. \n By the way, I support hunting. But I do not take killing lightly. \n \n 3. The subject of my topic is children. You are throwing others in as your argument is weak.", 
   {}, 
   245534, 
   null, 
   1169312760.0
  ], 
  [
   247957, 
   null, 
   "Steeeeve", 
   "I see. I refer you to a previous post of mine, then: A sperm is human in the same way the fetus is human: they both contain human DNA.\n \n The adjective sense and the noun sense are the same. They both generally describe a living thing that contains human DNA.\n I refer you to the biology book for classifying. You can't jump in on a response without the context. The question was asked how do they classify things...the answer was DNA although it used to be different. I guess I can't convince you that a sperm is not a \"member of the species homo sapien\" but biology is what it is until someone changes it. Covering your ears doesn't make something so ;)\n \n \nIf they tried to use the dictionary to justify this? lol, yes it would be a debate about semantics. It would be asnine to try to use the dictionary in this way.\nIn this case someone would just randomly claim you are not human...what would be your source for saying this person is wrong? Your pseudo langauge?", 
   {}, 
   247873, 
   null, 
   1169370840.0
  ], 
  [
   247960, 
   null, 
   "paw_x", 
   "I can think of no more devastating effect than the end of life prematurely, a destruction of one's being and existence. That is what the being in the womb goes through. This is not to mention the devastating effects on women who have undergone abortion \n\n \n From National Health Service Greater Glasgow & Clyde \n Women & Childrens Directorate - Social Gynaecology Patient Information \n \n Complications of Termination \n Psychological effects: a small number of women experience regret or adverse psychological effects. Few experience any long-term, adverse psychological effects. Early distress is common and usually a continuation of symptons present before the abortion. However, long-lasting, negative effects on both mothers and their children are reported where abortion has been denied. ", 
   {}, 
   247906, 
   null, 
   1169381760.0
  ], 
  [
   247961, 
   null, 
   "paw_x", 
   "I see. I refer you to a previous post of mine, then: A sperm is human in the same way the fetus is human: they both contain human DNA.\n \n The adjective sense and the noun sense are the same. They both generally describe a living thing that contains human DNA.\n\n \n I'm pro-choice, but I would definately say that a foetus is human, and not comparable to sperm at all. For example, after having an abortion here, I had to sign a form when I left the hospital confirming that I am aware that I had left 'human remains' in the hands of the health service so that they may be dealt with by an undertaker, and I was only 7 weeks along. [which obviously wouldn't happen if you left a sperm sample]", 
   {}, 
   247873, 
   null, 
   1169382180.0
  ], 
  [
   247968, 
   null, 
   "simone", 
   "Pawx, has this always been the case in Scotland, to classify an abortion as \"human remains,\" or is this a recent development?", 
   {}, 
   247961, 
   null, 
   1169400600.0
  ], 
  [
   247986, 
   null, 
   "gman", 
   "\n \n From National Health Service Greater Glasgow & Clyde \n Women & Childrens Directorate - Social Gynaecology Patient Information \n \n Complications of Termination \n Psychological effects: a small number of women experience regret or adverse psychological effects. Few experience any long-term, adverse psychological effects. Early distress is common and usually a continuation of symptons present before the abortion. However, long-lasting, negative effects on both mothers and their children are reported where abortion has been denied. \n\n \n So, it's a proven fact that children denied the act of abortion suffer negative effects? Hmmmmmm", 
   {}, 
   247960, 
   null, 
   1169408220.0
  ], 
  [
   247989, 
   null, 
   "ShadowPikachu", 
   "So, it's a proven fact that children denied the act of abortion suffer negative effects? Hmmmmmm\n\n \n Well, if the mother doesn't want the child, it would likely affect her attitude toward the child as it is growing up, usually in a rather negative way (i.e. feeling unwanted, not needed, etc.)", 
   {}, 
   247986, 
   null, 
   1169410920.0
  ], 
  [
   247995, 
   null, 
   "Shooterandproud", 
   "I refer you to the biology book for classifying. You can't jump in on a response without the context. The question was asked how do they classify things...the answer was DNA although it used to be different. I guess I can't convince you that a sperm is not a \"member of the species homo sapien\" but biology is what it is until someone changes it. Covering your ears doesn't make something so ;)\n \n In this case someone would just randomly claim you are not human...what would be your source for saying this person is wrong? Your pseudo langauge?\n\n \n Ya know, you always refer to \"biology\" and such and say were wrong because of it. Care to show me where biology says that? Care to show me how specifically an embryo differs from a sperm? I can show you many ways why an embryo is not a human, yet you only cite DNA and growth and say i'm discriminating. Sperm have DNA and can grow, so why is ejaculation not genocide? You really need to rethink your logic, that is, if you have any logic.", 
   {}, 
   247957, 
   null, 
   1169415420.0
  ], 
  [
   247996, 
   null, 
   "Shooterandproud", 
   "So, it's a proven fact that children denied the act of abortion suffer negative effects? Hmmmmmm\n\n \n Of course, you don't have the common sense to care for the humans do you? The humans with feelings, self awareness? The sentient homo sapeins? You just care about an embryotic cell sac. A non mental existent one, in which you value more than a woman. Either you are misinformed or a sexist.", 
   {}, 
   247986, 
   null, 
   1169415780.0
  ], 
  [
   247997, 
   null, 
   "Shooterandproud", 
   "1. If I'm not mistaken, this is your thread. Was the subject tapeworms?\n\n \n Irrelevant. That was an analogy, oh logical one.\n \n \n \n \n2. I'm not surprised that you don't follow the concept of trust a child automatically, by instinct, places in it's mom.\n\n \n I have the instinct to kill anyone that I don't like. Its a human trait that we've learned to control. Does that mean I should kill you because its my instict? I think humans have learned by now that instinct is not always the wisest thing to follow.\n \n \n \n \nYou are assuming what an embryo can or can not feel. Due to it's inability to communicate.\n\n \n What does communication have anything remotely to do with sentience? It is not self aware, it has no consciousness, and it has no intelligence. It is not sentient deserving of rights. Where in there is anything about communication?\n \n \n \n \nAre you stating that any being that can not communicate is expendable? I would bet that you would go to extremes to protect a baby seal about to get it's head bashed in by an eskimo hunter to sell it's coat.\n\n \n A baby seal has self awareness, consciousness, and intelligence. Nope, not expendable. It is a valued life form, that does deserve rights.\n \n \n \nRegardless of it's inability to say I want to live. \n By the way, I support hunting. But I do not take killing lightly.\n\n \n I am a hunter too, but animals have feelings. That is why I do not take killing lightly. However, we, as humans, were designed to hunt and kill animals for food. I think hunting is wrong if you are not going to eat the animal, but if you are, then it is OK. Just like foxes hunt rabbits, or snakes hunt mice. We are no different. However, animals have self awareness, consciousness, and... oh brother, do I have to go over this every time? Do you get the point?\n \n \n \n \n \n3. The subject of my topic is children. You are throwing others in as your argument is weak.\n\n \n What do you mean by throwing \"others\" in? We are not talking about children here, as children are fairly irrelevant to the abortion issue. However, if you are talking about embryos then why didn't you say so?", 
   {}, 
   247912, 
   null, 
   1169416260.0
  ], 
  [
   248004, 
   null, 
   "Steeeeve", 
   "Ya know, you always refer to \"biology\" and such and say were wrong because of it. Care to show me where biology says that? Care to show me how specifically an embryo differs from a sperm? I can show you many ways why an embryo is not a human, yet you only cite DNA and growth and say i'm discriminating. Sperm have DNA and can grow, so why is ejaculation not genocide? You really need to rethink your logic, that is, if you have any logic.\n\n \n Of course you can show how an embryo differs from a human...you made up a definition for human! I think I'll make up a definition for human and make sure you are not included and that would make about as much sense. And then of course you resort to insulting my logic...I feel like we are having a debate from a recent southpark episode (for those that don't watch southpark it was a show about in the future where religion doesn't exist and they just argue about logic the whole time).\n \n Anyway, since you haven't taken a biology class and are not familiar with the way things are classified I will direct you this page: http://en.wikipedia.org/wiki/Scientific_classification\n \n While probably not 100% accurate it still gives you a somewhat good idea about how classification works. Furthermore, the only thing I said biology proves you wrong on is that a sperm is classified living organism as opposed to a part of. \n \n I also like how I'm the only one with a definition for a human that has any kind of backing. Everyone elses \"mental existence\" theory 1) has no backing for defintion and 2) is arbitrary in and of itself\n \n So someone enlighten the rest of us on the proper usage of the word \"human\"...since there is obviously some mysterious language that I am not aware of that neatly defines all these terms. Please direct me to a source for this new language as well.", 
   {}, 
   247995, 
   null, 
   1169419440.0
  ], 
  [
   248005, 
   null, 
   "Steeeeve", 
   "Of course, you don't have the common sense to care for the humans do you? The humans with feelings, self awareness? The sentient homo sapeins? You just care about an embryotic cell sac. A non mental existent one, in which you value more than a woman. Either you are misinformed or a sexist.\n\n \n Bringing out the \"sexist\" term. What if the embryo is female...does that still make one sexist? \n \n And people wonder why I place suspicion on those that are still in grade school and have not seen real life.\n \n \nA baby seal has self awareness, consciousness, and intelligence. Nope, not expendable. It is a valued life form, that does deserve rights.\nGood to know that we can kill a fetus but not a baby seal....so these baby seals deserve all the rights as you do? If not then what rights? What criteria is there for those rights?", 
   {}, 
   247996, 
   null, 
   1169419620.0
  ], 
  [
   248026, 
   null, 
   "gman", 
   "Of course, you don't have the common sense to care for the humans do you? The humans with feelings, self awareness? The sentient homo sapeins? You just care about an embryotic cell sac. A non mental existent one, in which you value more than a woman. Either you are misinformed or a sexist.\n\n \n Are you trying deviate attention from the rediculousness of the statement made by National Health Service Greater Glasgow & Clyde\n Women & Childrens Directorate - Social Gynaecology Patient Information? \n Here, let me post it again, so everybody can laugh. \n \n Complications of Termination\n Psychological effects: a small number of women experience regret or adverse psychological effects. Few experience any long-term, adverse psychological effects. Early distress is common and usually a continuation of symptons present before the abortion. However, long-lasting, negative effects on both mothers and their children are reported where abortion has been denied.\n \n \n Shooter you sure are quick to resort to name calling when you get weak.", 
   {}, 
   247996, 
   null, 
   1169433360.0
  ], 
  [
   248030, 
   null, 
   "gman", 
   "\n 1. Irrelevant. That was an analogy, oh logical one.\n \n 2. I have the instinct to kill anyone that I don't like. Its a human trait that we've learned to control. Does that mean I should kill you because its my instict? I think humans have learned by now that instinct is not always the wisest thing to follow.\n \n 3. What does communication have anything remotely to do with sentience? It is not self aware, it has no consciousness, and it has no intelligence. It is not sentient deserving of rights. Where in there is anything about communication?\n \n 4. A baby seal has self awareness, consciousness, and intelligence. Nope, not expendable. It is a valued life form, that does deserve rights.\n \n 5. I am a hunter too, but animals have feelings. That is why I do not take killing lightly. However, we, as humans, were designed to hunt and kill animals for food. I think hunting is wrong if you are not going to eat the animal, but if you are, then it is OK. Just like foxes hunt rabbits, or snakes hunt mice. We are no different. However, animals have self awareness, consciousness, and... oh brother, do I have to go over this every time? Do you get the point?\n \n 6. What do you mean by throwing \"others\" in? We are not talking about children here, as children are fairly irrelevant to the abortion issue. However, if you are talking about embryos then why didn't you say so?\n\n \n 1. Logical? Tape worms are of equal value? \n 2. Humans who kill their offspring for the sake of their own comfort or financial security have not overcome the instinct to kill. Considering that I have lived and have a past, I am more worthy of your wrath than the innocents you consider expendable. \n 3. This puny argument belongs to you. I do not need to prove my stand as I need no excuse for not killing. \n 4. You will never have the ability to prove that what would become a child has no instinct to survive as you scrape it from the womb. \n You only proclaim what it feels to alleviate guilty consciences. \n 5. We seem to have found some common ground. Then you screwed it up by comparing wild life and human offspring. \n 6. Back to the tapeworm analogy.", 
   {}, 
   247997, 
   null, 
   1169435700.0
  ], 
  [
   248047, 
   null, 
   "Shooterandproud", 
   "1. Logical? Tape worms are of equal value?\n\n \n I rest my case.\n \n \n \n2. Humans who kill their offspring for the sake of their own comfort or financial security have not overcome the instinct to kill.\n\n \n Anyone who uses \"comfort\" or \"financial security\" to describe pregnancy and forced child bearing are either misinformed, not qualified for this debate, or both. It seems you do not value women. At all, or their bodies. You think they are disposable child bearing cubicles. Why? What nerve you have to critisize me when you equate no value to humans either.\n \n \n \n \nConsidering that I have lived and have a past, I am more worthy of your wrath than the innocents you consider expendable.\n\n \n I'm expending innocent cells? Oh, poor cells. You must think they feel really bad about this don't they? You must think they're humans like you or me, and that, is why I do not enjoy debating with you. Misinformation. \n \n \n \n \n3. This puny argument belongs to you. I do not need to prove my stand as I need no excuse for not killing.\n\n \n Neither do I, because I'm not killing anything. In fact, even if the embryo was a person, I do not advocate its killing. I advocate freedom. What this country was founded on, why we came here. What thousands of men died to protect, that you're trying to take away. You better have a damned good excuse for violating a woman's body and rights. Its sick you condone such a thing in the first place.\n \n \n \n \n4. You will never have the ability to prove that what would become a child has no instinct to survive as you scrape it from the womb.\n\n \n My point exactly.\n \n \n \n \nYou only proclaim what it feels to alleviate guilty consciences.\n\n \n My guilty conscience? It would be you, who would dare force your values on other human beings, forcing them to suffer for a botched scientific hypothesis of yours about human life. You only call the cell sack a child to make yourself feel better, because deep down you know its wrong.\n \n \n \n \n5. We seem to have found some common ground. Then you screwed it up by comparing wild life and human offspring.\n\n \n What makes our species so much more important than everyone else? What? It seems like you feel you are superior to other animals, am I not correct? You feel, that humans are worth more. Why? Look deep inside yourself. Why do you think that humans are worth more than animals? Because of our superior intelligence. Something an embryo lacks. It lacks any intelligence.\n \n \n \n \n6. Back to the tapeworm analogy.\n\n \n Nice try.", 
   {}, 
   248030, 
   null, 
   1169445720.0
  ], 
  [
   248078, 
   null, 
   "maximus", 
   "Pawx, has this always been the case in Scotland, to classify an abortion as \"human remains,\" or is this a recent development?\n\n \n I think we all know that they are human remains whether they are classified as such or not.", 
   {}, 
   247968, 
   null, 
   1169482260.0
  ], 
  [
   248081, 
   null, 
   "maximus", 
   "\n \n From National Health Service Greater Glasgow & Clyde \n Women & Childrens Directorate - Social Gynaecology Patient Information \n \n Complications of Termination \n Psychological effects: a small number of women experience regret or adverse psychological effects. Few experience any long-term, adverse psychological effects. Early distress is common and usually a continuation of symptons present before the abortion. However, long-lasting, negative effects on both mothers and their children are reported where abortion has been denied. \n\n \n I don't doubt that there are negative effects from that. But what if our way of thinking was converted from a distorted way of thinking on the value of human life and the inherent dignity of each human being? Then missing out on an abortion might be seen as a noble, positive thing.\n \n Many people experience \"adverse pyschological effects\" for many different phenomena experienced in their lives...violence, illness, death of friends and family members...but we all live through it. Pyschological illness must be treated but killing a child is not a valid treatment option.\n \n Also, adverse pyschological effects are not as extreme or severe or adverse as destruction/death that the embryo experiences.", 
   {}, 
   247960, 
   null, 
   1169482500.0
  ], 
  [
   248083, 
   null, 
   "simone", 
   "Ladling out the guilt again, Maximus?\n \n Don't forget take a large helping for yourself.", 
   {}, 
   248081, 
   null, 
   1169482680.0
  ], 
  [
   248090, 
   null, 
   "gman", 
   "\n 1. I rest my case.\n \n 2. Anyone who uses \"comfort\" or \"financial security\" to describe pregnancy and forced child bearing are either misinformed, not qualified for this debate, or both. It seems you do not value women. At all, or their bodies. You think they are disposable child bearing cubicles. Why? What nerve you have to critisize me when you equate no value to humans either.\n \n 3. I'm expending innocent cells? Oh, poor cells. You must think they feel really bad about this don't they? You must think they're humans like you or me, and that, is why I do not enjoy debating with you. Misinformation. \n \n 4. Neither do I, because I'm not killing anything. In fact, even if the embryo was a person, I do not advocate its killing. I advocate freedom. What this country was founded on, why we came here. What thousands of men died to protect, that you're trying to take away. You better have a damned good excuse for violating a woman's body and rights. Its sick you condone such a thing in the first place.\n \n 5. My point exactly.\n \n 6. My guilty conscience? It would be you, who would dare force your values on other human beings, forcing them to suffer for a botched scientific hypothesis of yours about human life. You only call the cell sack a child to make yourself feel better, because deep down you know its wrong.\n \n 7. What makes our species so much more important than everyone else? What? It seems like you feel you are superior to other animals, am I not correct? You feel, that humans are worth more. Why? Look deep inside yourself. Why do you think that humans are worth more than animals? Because of our superior intelligence. Something an embryo lacks. It lacks any intelligence.\n \n 8. Nice try.\n\n \n 1. Of course you do. \n 2. I do assume the right to criticize you. As do you, me. \n I do respect women. But I do not extend to women the right to make a choice that effects a life that she created. Once she created it, there was more than just \"her\" that matters. I do not extend to anyone the right to kill as a solution to a problem. \n 3. You define any disagreement with you as mis-information. \n Your argument is for the purpose of killing something that you refuse to consider the possibility has an instinct to survive. If it survives, it becomes a person. \n 4. Those veterans, of whom I am, have fought for the right to freedoms, not for the right to exterminate for convenience. \n 5. So, since we can not prove it, you opt to dismiss it's need to survive? \n 6. Your grasping at straws. I'm not calling it anything. I don't care what it's called. I want to save it. You on the other hand, must give it a label that makes destroying it seem a menial act.\n 7. Yes, I do feel superior. Not simply for the fact that we have the power to eliminate other species, but that we too are empowered to save them. Including Zygotes as you define them.", 
   {}, 
   248047, 
   null, 
   1169487600.0
  ], 
  [
   248093, 
   null, 
   "gman", 
   "\n 1. I rest my case.\n \n 2. Anyone who uses \"comfort\" or \"financial security\" to describe pregnancy and forced child bearing are either misinformed, not qualified for this debate, or both. It seems you do not value women. At all, or their bodies. You think they are disposable child bearing cubicles. Why? What nerve you have to critisize me when you equate no value to humans either.\n \n 3. I'm expending innocent cells? Oh, poor cells. You must think they feel really bad about this don't they? You must think they're humans like you or me, and that, is why I do not enjoy debating with you. Misinformation. \n \n 4. Neither do I, because I'm not killing anything. In fact, even if the embryo was a person, I do not advocate its killing. I advocate freedom. What this country was founded on, why we came here. What thousands of men died to protect, that you're trying to take away. You better have a damned good excuse for violating a woman's body and rights. Its sick you condone such a thing in the first place.\n \n 5. My point exactly.\n \n 6. My guilty conscience? It would be you, who would dare force your values on other human beings, forcing them to suffer for a botched scientific hypothesis of yours about human life. You only call the cell sack a child to make yourself feel better, because deep down you know its wrong.\n \n 7. What makes our species so much more important than everyone else? What? It seems like you feel you are superior to other animals, am I not correct? You feel, that humans are worth more. Why? Look deep inside yourself. Why do you think that humans are worth more than animals? Because of our superior intelligence. Something an embryo lacks. It lacks any intelligence.\n \n 8. Nice try.\n\n \n 1. Of course you do. \n 2. I do assume the right to criticize you. As do you, me. \n I do respect women. But I do not extend to women the right to make a choice that effects a life that she created. Once she created it, there was more than just \"her\" that matters. I do not extend to anyone the right to kill as a solution to a problem. \n 3. You define any disagreement with you as mis-information. \n Your argument is for the purpose of killing something that you refuse to consider the possibility has an instinct to survive. If it survives, it becomes a person. \n 4. Those veterans, of whom I am, have fought for the right to freedoms, not for the right to exterminate for convenience. \n 5. So, since we can not prove it, you opt to dismiss it's need to survive? \n 6. Your grasping at straws. I'm not calling it anything. I don't care what it's called. I want to save it. You on the other hand, must give it a label that makes destroying it seem a menial act.\n 7. Yes, I do feel superior. Not simply for the fact that we have the power to eliminate other species, but that we too are empowered to save them. Including Zygotes as you define them.", 
   {}, 
   248047, 
   null, 
   1169487900.0
  ], 
  [
   248107, 
   null, 
   "paw_x", 
   "Pawx, has this always been the case in Scotland, to classify an abortion as \"human remains,\" or is this a recent development?\n\n \n No idea, nor do I know if that's the case all over the world.", 
   {}, 
   247968, 
   null, 
   1169495760.0
  ], 
  [
   248115, 
   null, 
   "paw_x", 
   "I don't doubt that there are negative effects from that. But what if our way of thinking was converted from a distorted way of thinking on the value of human life and the inherent dignity of each human being? Then missing out on an abortion might be seen as a noble, positive thing.\n \n Many people experience \"adverse pyschological effects\" for many different phenomena experienced in their lives...violence, illness, death of friends and family members...but we all live through it. Pyschological illness must be treated but killing a child is not a valid treatment option.\n \n Also, adverse pyschological effects are not as extreme or severe or adverse as destruction/death that the embryo experiences.\n\n \n Sometimes having an abortion is the best option for them and their family. Financial commitments like a mortgage mean that many people need their full wage to get by, and if the mother had to go on maternity leave they would be seriously struggling and unable to feed their existing family. There are millions reasons for choosing to have an abortion and if a woman doesn't want to go through with a pregnancy, that is her decision as it's her body and her life that would be changing, and if she is unwilling to change her life she would hardly be an ideal person to become a fantastic mother. \n \n I wouldn't ever say abortion is a good thing, and in an ideal world it wouldn't be necessary, but people make mistakes and birth control is not 100% effective so it's always going to be needed.", 
   {}, 
   248081, 
   null, 
   1169498640.0
  ], 
  [
   248129, 
   null, 
   "Steeeeve", 
   "Ah, and here's what it is all about with you. the woman \"created\" it. Of course there is no mention of a male by you (sorry to tell you this, but, it takes two to tango). Here we see your true views on the subject: \"It's all the woman's fault, she cause it, etc.\" Feel the same way about rape and incest? I'll bet you are one of the sexists who blame the victim for rape, and not the little $hit who actually raped her.\n\n \n I like how you just claim a person is \"sexist\" and go to petty insults just because a person doesn't support abortion. Nevermind the fact that you have no basis for these assumptions, you just want to demean the other person...Perhaps you would like it if I called you a sexist or maybe a rapist lover? I have the same backing you for your claims.\n \n Anyway, you are getting really close to just slander (forbidden by the forum admin), I suggest all three of you calm it down as we have had many banned on here for the very tactics you use.", 
   {}, 
   248090, 
   null, 
   1169506380.0
  ], 
  [
   248137, 
   null, 
   "Sigma", 
   "I refer you to the biology book for classifying.\n\n \n That's fine. The dictionary is not the proper tool to try to classify things, however, as you were attempting to do ;)\n \n \nYou can't jump in on a response without the context. The question was asked how do they classify things...the answer was DNA although it used to be different.\n\n \n And you were insisting that the dictionary definition proved something. That obviously is not the case :P\n \n \nI guess I can't convince you that a sperm is not a \"member of the species homo sapien\" but biology is what it is until someone changes it. Covering your ears doesn't make something so ;)\n\n \n Neither does the dictionary saying something make it so. I'm so glad you've accepted that. It matters not a whit what the dictionary says humans are or what the fetus is.\n \n Neither can a biology book tell us what being human means, in a philosophical/moral sense. For that we would have personal beliefs and personal definitions. \n \n \nIn this case someone would just randomly claim you are not human...what would be your source for saying this person is wrong? Your pseudo langauge?\n\n \n lol. You're calling English a pseudo language now. What is your support for this, Steve? Your personal definition?\n \n My source definitely would not be the dictionary, Steve :P That would just be idiotic. Were that my opponents only argument I would dismiss them out of hand and not bother to refute them.", 
   {}, 
   247957, 
   null, 
   1169509680.0
  ], 
  [
   248138, 
   null, 
   "Sigma", 
   "I'm pro-choice, but I would definately say that a foetus is human, and not comparable to sperm at all. For example, after having an abortion here, I had to sign a form when I left the hospital confirming that I am aware that I had left 'human remains' in the hands of the health service so that they may be dealt with by an undertaker, and I was only 7 weeks along. [which obviously wouldn't happen if you left a sperm sample]\n\n \n I see. So, because the hospital had forms that read 'human remains' that conclusively proves that the fetus is human.\n \n That's almost, but not quite, as bad as Steve's argument that because it was a certain way in the dictionary it must be so.", 
   {}, 
   247961, 
   null, 
   1169509860.0
  ], 
  [
   248141, 
   null, 
   "paw_x", 
   "I see. So, because the hospital had forms that read 'human remains' that conclusively proves that the fetus is human.\n \n That's almost, but not quite, as bad as Steve's argument that because it was a certain way in the dictionary it must be so.\n\n \n I never said anything about conclusive proof. But what else is a foetus if not human? You have a scan at 12 weeks, you can see a human being inside you kicking its legs and wiggling about. Though that's further on than the majority of abortions, a few weeks earlier than that isn't a very long time and the foetus is developing into a human being. I wouldn't call it a baby until it's much more developed than that, but isn't it always human?", 
   {}, 
   248138, 
   null, 
   1169514480.0
  ], 
  [
   248148, 
   null, 
   "ShadowPikachu", 
   "I like how you just claim a person is \"sexist\" and go to petty insults just because a person doesn't support abortion. Nevermind the fact that you have no basis for these assumptions, you just want to demean the other person...Perhaps you would like it if I called you a sexist or maybe a rapist lover? I have the same backing you for your claims.\n \n Anyway, you are getting really close to just slander (forbidden by the forum admin), I suggest all three of you calm it down as we have had many banned on here for the very tactics you use.\n\n \n Sorry, but I called him sexist because of his attitude toward women as shown in his post. As a women, I felt that his comments were rather demeaning and sexist. I don't call anyone anything unless it has a basis in what they have said or done. \n \n And about getting banned, lol! I'm calling it as I see it and I'm not afraid of your petty threats.emoticon_xdonno\n \n Oh, and by the way, since you seem so obsessed with the dictionary, here you go:\n \nslan·der /&#712;slænd&#601;r/ Pronunciation Key - Show Spelled Pronunciation[slan-der] Pronunciation Key - Show IPA Pronunciation \n -noun 1. defamation; calumny: rumors full of slander. \n 2. a malicious, false, and defamatory statement or report: a slander against his good name. \n 3. Law. defamation by oral utterance rather than by writing, pictures, etc. \n -verb (used with object) 4. to utter slander against; defame. \n -verb (used without object) 5. to utter or circulate slander. \n \n \n --------------------------------------------------------------------------------\n \n [Origin: 1250-1300; (n.) ME s(c)laundre < AF esclaundre, OF esclandre, alter. of escandle < LL scandalum cause of offense, snare (see scandal); (v.) ME s(c)laundren to cause to lapse morally, bring to disgrace, discredit, defame < OF esclandrer, deriv. of esclandre] \n \n -Related forms\n slan·der·er, noun \n slan·der·ing·ly, adverb \n slan·der·ous, adjective \n slan·der·ous·ly, adverb \n slan·der·ous·ness, noun \n \n \n -Synonyms 4. malign, vilify, revile.\n Dictionary.com Unabridged (v 1.1)\n Based on the Random House Unabridged Dictionary, © Random House, Inc. 2006. \n \n\n \n There is nothing false about my statement, therefore it is not slander. Slander is what Bush's buddies did to McCain in the Republican primaries (I think it was the primaries - whatever it is where republicans choose their candidate for president out of a group of republicans).", 
   {
    "unicode_changes_made": true
   }, 
   248129, 
   null, 
   1169517900.0
  ], 
  [
   248153, 
   null, 
   "Sigma", 
   "I wouldn't call it a baby until it's much more developed than that, but isn't it always human?\n\n \n I would say yes, but Steve does not recognize anything but definitions provided for him. Therefore I am trying to ask him how we can conclusively prove the fetus is human. If the criteria is human DNA then the fetus is human like dead bodies are human and like sperm are human. Steve also wants to say that the fetus is human like you and I are human, but that would stray into the philosophical and moral realm and the criteria of DNA does not cover why we have moral weight :P", 
   {}, 
   248141, 
   null, 
   1169518860.0
  ], 
  [
   248167, 
   null, 
   "maximus", 
   "Sometimes having an abortion is the best option for them and their family. Financial commitments like a mortgage mean that many people need their full wage to get by, and if the mother had to go on maternity leave they would be seriously struggling and unable to feed their existing family. There are millions reasons for choosing to have an abortion and if a woman doesn't want to go through with a pregnancy, that is her decision as it's her body and her life that would be changing, and if she is unwilling to change her life she would hardly be an ideal person to become a fantastic mother. \n \n I wouldn't ever say abortion is a good thing, and in an ideal world it wouldn't be necessary, but people make mistakes and birth control is not 100% effective so it's always going to be needed.\n\n \n How much of a wage would your life be worth?\n \n Abortion as a safety for contraception is not a good argument. And there are many problems with artificial birth control itself.", 
   {}, 
   248115, 
   null, 
   1169536200.0
  ], 
  [
   248168, 
   null, 
   "maximus", 
   "Ladling out the guilt again, Maximus?\n \n Don't forget take a large helping for yourself.\n\n \n What do you mean, ladling out the guilt? How so? What am I guilty of?\n \n Do you dispute that everyone on the planet would know that a fetus or embryo would be human remains?", 
   {}, 
   248083, 
   null, 
   1169536380.0
  ], 
  [
   248180, 
   null, 
   "paw_x", 
   "How much of a wage would your life be worth?\n \n Abortion as a safety for contraception is not a good argument. And there are many problems with artificial birth control itself.\n\n \n Well, if I were to choose between being able to feed my daughter or to have a new baby and be unable to afford anything more than cornflakes for each meal, I'd choose to look after the child I already have. \n \n As for the problems with birth control, are you now saying that people perhaps just shouldn't have sex at all except at times they want to concieve?", 
   {}, 
   248167, 
   null, 
   1169548260.0
  ], 
  [
   248185, 
   null, 
   "Steeeeve", 
   "Sorry, but I called him sexist because of his attitude toward women as shown in his post. As a women, I felt that his comments were rather demeaning and sexist. I don't call anyone anything unless it has a basis in what they have said or done. \n \n And about getting banned, lol! I'm calling it as I see it and I'm not afraid of your petty threats.emoticon_xdonno\n \n Oh, and by the way, since you seem so obsessed with the dictionary, here you go:\n \n \n There is nothing false about my statement, therefore it is not slander. Slander is what Bush's buddies did to McCain in the Republican primaries (I think it was the primaries - whatever it is where republicans choose their candidate for president out of a group of republicans).\n\n \n So if I called you a child molesting rapist because I thought you were then you would be ok with this? \n \n It wasn't a threat...I don't ban people...I'm just saying that many folks have been.", 
   {}, 
   248148, 
   null, 
   1169570940.0
  ], 
  [
   248186, 
   null, 
   "Steeeeve", 
   "That's fine. The dictionary is not the proper tool to try to classify things, however, as you were attempting to do ;)\n I sure wasn't.\n \n \nAnd you were insisting that the dictionary definition proved something. That obviously is not the case :P\nIf proves that, for English at least, you can't say a fetus is not a human.\n \n\n Neither does the dictionary saying something make it so. I'm so glad you've accepted that. It matters not a whit what the dictionary says humans are or what the fetus is.\nIt matters if you are trying to communicate with people. If you don't think it matters what the meanings of words are then thats your deal not mine.\n \n \nNeither can a biology book tell us what being human means, in a philosophical/moral sense. For that we would have personal beliefs and personal definitions. \nhaha, a personal moral language if you will. Is this to make people sleep better at night?\n \n \nlol. You're calling English a pseudo language now. What is your support for this, Steve? Your personal definition?\nYou don't seem to use English....see your below comment.\n \n \nMy source definitely would not be the dictionary, Steve :P That would just be idiotic. Were that my opponents only argument I would dismiss them out of hand and not bother to refute them.\nhaha, if not the dictionary then I'd like to know how you figure out what words mean. How do you even understand what I am typing?", 
   {}, 
   248137, 
   null, 
   1169571240.0
  ], 
  [
   248197, 
   null, 
   "Sigma", 
   "I sure wasn't.\n\n \n Certainly you were. Your entire point was based on what the dictionary said humans are.\n \n \nIf proves that, for English at least, you can't say a fetus is not a human.\n\n \n I can say the fetus is not, philosophically, a human being in the sense of having someone \"in there\". I cannot say that the fetus is not biologically human, but no one is saying that. You seem comfortable valuing what the dictionary says is human, but I determine my own moral sense.\n \n \nIt matters if you are trying to communicate with people. If you don't think it matters what the meanings of words are then thats your deal not mine.\n\n \n Actually it's your deal when you assume the dictionary definition has any authority in this discussion. It really doesn't, unless the question is what the dictionary definition is. And that is not the question, Steve :P\n \n \nhaha, a personal moral language if you will. Is this to make people sleep better at night?\n\n \n So English is a personal moral language? I suppose that is true, in a sense.\n \n \nYou don't seem to use English....see your below comment.\n\n \n Then how do you know what I'm typing?\n \n \nhaha, if not the dictionary then I'd like to know how you figure out what words mean. How do you even understand what I am typing?\n\n \n lol, Steve, I would not care in the slightest if someone said I was not human according to the dictionary definition.\n \n I understand what you are typing because we're using the same language. English. You're the only one claiming we're using different languages. The dictionary has no authority over what English words mean, it merely records how people use English words. I am using English even if I do not use dictionary definitions. You're a riot :P", 
   {}, 
   248186, 
   null, 
   1169574480.0
  ], 
  [
   248201, 
   null, 
   "ShadowPikachu", 
   "So if I called you a child molesting rapist because I thought you were then you would be ok with this? \n \n \n\n \n I'd be fine with it... If I said anything in my posts which suggested it, which I have not. (Not to mention the fact that females as \"child molesting rapists\" are rather rare and unusual) \n You see, with his post, it pretty much showed a sexist attitude, hence why I said that I bet (key word here) he was one of those sexists who blamed the victim for the rape (something frighteningly common from people who live near me).\n \n \nIt wasn't a threat...I don't ban people...I'm just saying that many folks have been.\n\n \n Um, that's why I said you don't scare me with your petty litte threats, as I know you cannot ban me as you are not a moderator.\n \n I'll let the moderators tell me if I've gone to far, and then I will abide by their decision, not yours.", 
   {}, 
   248185, 
   null, 
   1169576160.0
  ], 
  [
   248232, 
   null, 
   "Steeeeve", 
   "I'd be fine with it... If I said anything in my posts which suggested it, which I have not. (Not to mention the fact that females as \"child molesting rapists\" are rather rare and unusual) \n You see, with his post, it pretty much showed a sexist attitude, hence why I said that I bet (key word here) he was one of those sexists who blamed the victim for the rape (something frighteningly common from people who live near me).\nI guess we just have a different set of morals. Accusing someone of the things you did or me calling you a \"child molesting rapist\" is wrong.", 
   {}, 
   248201, 
   null, 
   1169590020.0
  ], 
  [
   248260, 
   null, 
   "ShadowPikachu", 
   "I guess we just have a different set of morals. Accusing someone of the things you did or me calling you a \"child molesting rapist\" is wrong.\n\n \n It's not wrong if it's true, based on the evidence (of which you would have none to call me that). If I were to call someone who has killed children a \"child-murderer\", is that wrong?", 
   {}, 
   248232, 
   null, 
   1169602020.0
  ], 
  [
   248261, 
   null, 
   "ShadowPikachu", 
   "I sure wasn't.\n \n\n \n emoticon_wow emoticon_xdonno :xbanghead \n \n Wow, Steeeeve, are you feeling okay? Do you not remember that the bulk of this thread was you arguing about a dictionary definition of humans, and then squirming when another definition came up that you didn't like? Are you someone else, besides Steeeeve? To deny such a thing now, when anyone can look through this thread, makes you look rather foolish.", 
   {}, 
   248186, 
   null, 
   1169602140.0
  ], 
  [
   248311, 
   null, 
   "Steeeeve", 
   "It's not wrong if it's true, based on the evidence (of which you would have none to call me that). If I were to call someone who has killed children a \"child-murderer\", is that wrong?\n\n \n what is this \"evidence\"? The fact that he doesn't think a rape victim should get an abortion? I'd like to see that one in a court case..HA", 
   {}, 
   248260, 
   null, 
   1169659440.0
  ], 
  [
   248321, 
   null, 
   "Phyllis", 
   "what is this \"evidence\"? The fact that he doesn't think a rape victim should get an abortion? I'd like to see that one in a court case..HA\n\n \n What if it were to show up at the Supreme Court?", 
   {}, 
   248311, 
   null, 
   1169661240.0
  ], 
  [
   248324, 
   null, 
   "Steeeeve", 
   "What if it were to show up at the Supreme Court?\n\n \n We'd seek the opinion of the judges in Zimbabwe :p\n \n Doesn't matter...I blocked Shadow after that last post as it is very clear he is not going to give an honest debate but rather take pop-shots all day.", 
   {}, 
   248321, 
   null, 
   1169661600.0
  ], 
  [
   248345, 
   null, 
   "ShadowPikachu", 
   "We'd seek the opinion of the judges in Zimbabwe :p\n \n Doesn't matter...I blocked Shadow after that last post as it is very clear he is not going to give an honest debate but rather take pop-shots all day.\n\n \n \n That's pretty sad. Oh noes, What will I do, he blocked me! emoticon_cry emoticon_rolleyes\n \n I find it hilarious that Steeeeve just won't admit that he started out the thread by arguing for a dictionary definition, and then when a definition was shown which he didn't like, he started squirming, and recently claimed he wasn't arguing dictionary definitions, which he plainly an clearly was. It really shows who the dishonest one in this debate, now doesn't it. \n \n BTW, you might have been better off claiming I was taking POT-shots, as the word \"pop-shots\" does not exist.", 
   {}, 
   248324, 
   null, 
   1169669340.0
  ], 
  [
   248489, 
   null, 
   "maximus", 
   "Well, if I were to choose between being able to feed my daughter or to have a new baby and be unable to afford anything more than cornflakes for each meal, I'd choose to look after the child I already have. \n\n If I had to choose between being able to feed my daughter and kill my baby I would choose to sacrifice feeding my daughter. Hope stays alive in that situation. But once the new baby is destroyed and life is taken then there is no hope and love is extinguished.\n \n The problem is that you already have two children when it comes time for the decision of abortion. Why would you choose your older child over the younger one? Abortion kills a living human being. \n \n Are there not enough social service programs out there that could assist in this instance? How many people in this world have made it out of poverty to live a good life? Wouldn't you want to give them a shot?\n \n \nAs for the problems with birth control, are you now saying that people perhaps just shouldn't have sex at all except at times they want to concieve?\n\n When you divorce sex from its procreative potential then problems arise. It's not that people \"shouldn't have sex at all except at times they want to conceive.\" But they shouldn't have sex at all except at times when they are willing to accept conception and the baby that comes from it. I mean that married persons can have sex when they want to unite and form bonds and replenish and express their love for one another, even at times when procreation will not naturally occur. When two persons interact in this manner then they should be willing to accept that third person into their lives that may be created at any time--not as an intruder--but as a welcome visitor--because they were the ones who invited him, in a certain sense. If they cannot accept this then they should abstain. Sex cannot be healthily utilized simply for pleasure without respect for its inherent need for committment and respect for procreative potential.", 
   {}, 
   248180, 
   null, 
   1169795100.0
  ], 
  [
   248506, 
   null, 
   "simone", 
   "Bah humbug, Maximus! Admittedly pious sounding, not to mention with a high degree of self righteousness, but claptrap.", 
   {}, 
   248489, 
   null, 
   1169833440.0
  ], 
  [
   248594, 
   null, 
   "paw_x", 
   "If I had to choose between being able to feed my daughter and kill my baby I would choose to sacrifice feeding my daughter. Hope stays alive in that situation. But once the new baby is destroyed and life is taken then there is no hope and love is extinguished.\n \n The problem is that you already have two children when it comes time for the decision of abortion. Why would you choose your older child over the younger one? Abortion kills a living human being. \n\n \n Because my daughter feels hunger and pain, and I would not allow her to suffer. A foetus does not experience these things, therefore it would not suffer at an early stage abortion. How could you possibly allow one child to suffer just so you can give birth to another you may not be able to provide for properly? \n \n \nAre there not enough social service programs out there that could assist in this instance? How many people in this world have made it out of poverty to live a good life? Wouldn't you want to give them a shot? \n\n \n I don't think benefits here count when you have assets, such as a house you can sell. Stability for my daughter is what matters most to me, and ending up being moved to a dodgy area [which is all that is left to rent from the Council] isn't an option for me. Not when the other option is to terminate a pregnancy without causing the foetus to suffer. After 12 weeks gestation I'd perhaps have reconsidered my options again, but so early on I had made my decision. \n \n \nWhen you divorce sex from its procreative potential then problems arise. It's not that people \"shouldn't have sex at all except at times they want to conceive.\" But they shouldn't have sex at all except at times when they are willing to accept conception and the baby that comes from it. I mean that married persons can have sex when they want to unite and form bonds and replenish and express their love for one another, even at times when procreation will not naturally occur. When two persons interact in this manner then they should be willing to accept that third person into their lives that may be created at any time--not as an intruder--but as a welcome visitor--because they were the ones who invited him, in a certain sense. If they cannot accept this then they should abstain. Sex cannot be healthily utilized simply for pleasure without respect for its inherent need for committment and respect for procreative potential.\n\n \n Nice idea but it's never going to happen. Sex is part of a relationship and the small chance of conception isn't going to stop people from having sex when they don't want to concieve or be prepared to concieve. Some families never want children but they are hardly going to abstain for life. Contraception might never be 100% but it's the most people have unless they choose the permanant sterilisation option, which isn't going to be an option for a woman who wants to have a gap between having children. Perhaps in the past women were prepared to have every child they became pregnant with and ended up with 15 kids they couldn't feed, but in this day and age it isn't even worth discussing as a solution.", 
   {}, 
   248489, 
   null, 
   1169866800.0
  ], 
  [
   248595, 
   null, 
   "Shooterandproud", 
   "We'd seek the opinion of the judges in Zimbabwe :p\n \n Doesn't matter...I blocked Shadow after that last post as it is very clear he is not going to give an honest debate but rather take pop-shots all day.\n\n \n I find it interesting that the pro-lifers block the pro-choicers but not the other way around. Unless they were being downright XXXXXX, i see that as a sign of weakness or failure.", 
   {}, 
   248324, 
   null, 
   1169867040.0
  ], 
  [
   248596, 
   null, 
   "Shooterandproud", 
   "That's pretty sad. Oh noes, What will I do, he blocked me! emoticon_cry emoticon_rolleyes\n \n I find it hilarious that Steeeeve just won't admit that he started out the thread by arguing for a dictionary definition, and then when a definition was shown which he didn't like, he started squirming, and recently claimed he wasn't arguing dictionary definitions, which he plainly an clearly was. It really shows who the dishonest one in this debate, now doesn't it. \n \n BTW, you might have been better off claiming I was taking POT-shots, as the word \"pop-shots\" does not exist.\n\n \n \n Amen! I still can't find a valid reason why steeve blocked you.", 
   {}, 
   248345, 
   null, 
   1169867160.0
  ], 
  [
   248612, 
   null, 
   "ShadowPikachu", 
   "Amen! I still can't find a valid reason why steeve blocked you.\n\n \n I can find a valid reason: He doesn't have any sort of argument, so when people point out that he is contradicting himself completely, he blocks them.\n \n And that, my friends, is the only valid reason.", 
   {}, 
   248596, 
   null, 
   1169870280.0
  ], 
  [
   248694, 
   null, 
   "maximus", 
   "Bah humbug, Maximus! Admittedly pious sounding, not to mention with a high degree of self righteousness, but claptrap.\n\n \n Another eloquent rebuttal by simone.A concise, effective, engaging, deep response...claptrap. Another smear but another failure to argue her point.", 
   {}, 
   248506, 
   null, 
   1169978700.0
  ], 
  [
   248695, 
   null, 
   "maximus", 
   "Because my daughter feels hunger and pain, and I would not allow her to suffer. A foetus does not experience these things, therefore it would not suffer at an early stage abortion. How could you possibly allow one child to suffer just so you can give birth to another you may not be able to provide for properly? \n\n Are you sure a fetus does not suffer?\n \n \nI don't think benefits here count when you have assets, such as a house you can sell. Stability for my daughter is what matters most to me, and ending up being moved to a dodgy area [which is all that is left to rent from the Council] isn't an option for me. Not when the other option is to terminate a pregnancy without causing the foetus to suffer. After 12 weeks gestation I'd perhaps have reconsidered my options again, but so early on I had made my decision. \n \n What motivates you to draw your line at 12 weeks?\n \n \n \nNice idea but it's never going to happen. Sex is part of a relationship and the small chance of conception isn't going to stop people from having sex when they don't want to concieve or be prepared to concieve. Some families never want children but they are hardly going to abstain for life. Contraception might never be 100% but it's the most people have unless they choose the permanant sterilisation option, which isn't going to be an option for a woman who wants to have a gap between having children. Perhaps in the past women were prepared to have every child they became pregnant with and ended up with 15 kids they couldn't feed, but in this day and age it isn't even worth discussing as a solution\n\n The effectiveness of natural family planning:\n \n http://ccli.org/nfp/basics/effectiveness-p01.php\n \n Even planned parenthood informs about it:\n http://www.ppgg.org/site/c.esJMKZPKJtH/b.1164205/k.5BF7/Natural_Family_Planning.htm\n \n Some families never want children? Is that a family? Love gives life.", 
   {}, 
   248594, 
   null, 
   1169979060.0
  ], 
  [
   248698, 
   null, 
   "paw_x", 
   "Are you sure a fetus does not suffer? \n\n \n At that stage in development, yes.\n \n \nWhat motivates you to draw your line at 12 weeks? \n\n \n 12 weeks was the first time I ever saw my daughter in a scan, so it's basically an example of the time when I felt my baby was developed, as I could see her kicking her legs, etc. Obviously you can give or take a few weeks development from that but I basically wanted to have the abortion as soon as possible for both the humanity of the foetus and for my own mental health, as I would have found it a lot more difficult at that stage, having already gone through a pregnancy. \n \n \nSome families never want children? Is that a family? Love gives life.\n\n \n There are married couples out there who don't ever want to have kids of their own, I'd still call them a family.", 
   {}, 
   248695, 
   null, 
   1169988060.0
  ], 
  [
   248808, 
   null, 
   "Steeeeve", 
   "I find it interesting that the pro-lifers block the pro-choicers but not the other way around. Unless they were being downright XXXXXX, i see that as a sign of weakness or failure.\n\n \n I choose not to engage in childish behavoir...It makes life easier just to block the user instead of scroll past their posts.", 
   {}, 
   248595, 
   null, 
   1170100560.0
  ], 
  [
   248855, 
   null, 
   "thelmoose", 
   "12 weeks was the first time I ever saw my daughter in a scan, so it's basically an example of the time when I felt my baby was developed, as I could see her kicking her legs, etc. Obviously you can give or take a few weeks development from that but I basically wanted to have the abortion as soon as possible for both the humanity of the foetus and for my own mental health, as I would have found it a lot more difficult at that stage, having already gone through a pregnancy. \n \n There are married couples out there who don't ever want to have kids of their own, I'd still call them a family.\n\n \n \n Looking at your own ultrasound is hardly the way to answer the question of the age at which fetal perception occurs. First, ultrasound is not a test that could answer that question, and second, what do you know about it?\n \n What follows is a sytematic review of the literature on this subject. I submit the reference and the abstract. For you and max:\n \n \nLee SJ, Ralston HJP, Drey EA, Partridge JC, Rosen MA. Fetal Pain: A Systematic Multidisciplinary Review of the Evidence. JAMA, 2005; 294(8): 947-54.\n \n \n ABSTRACT\n \n Context\n Proposed federal legislation would require physicians to inform women\n seeking abortions at 20 or more weeks after fertilization that the fetus feels pain and to offer anesthesia administered directly to the fetus. This article examines whether a fetus feels pain and if so, whether safe and effective techniques exist for providing direct fetal anesthesia or analgesia in the context of therapeutic procedures or abortion.\n \n Evidence Acquisition \n Systematic search of PubMed for English-language articles focusing on human studies related to fetal pain, anesthesia, and analgesia. Included articles studied fetuses of less than 30 weeks' gestational age or specifically addressed fetal pain perception or nociception. Articles were reviewed for additional references. The search was performed without date limitations and was current as of June 6, 2005.\n \n Evidence Synthesis \n Pain perception requires conscious recognition or awareness of a noxious stimulus. Neither withdrawal reflexes nor hormonal stress responses to invasive procedures prove the existence of fetal pain, because they can be elicited by nonpainful stimuli and occur without conscious cortical processing. Fetal awareness of noxious stimuli requires functional thalamocortical connections. Thalamocortical fibers begin appearing between 23 to 30 weeks' gestational age, while electroencephalography suggests the capacity for functional pain perception in preterm neonates probably does not exist before 29 or 30 weeks. For fetal surgery, women may receive general anesthesia and/or analgesics intended for placental transfer, and parenteral opioids may be administered to the fetus under direct or sonographic visualization. In these circumstances, administration of anesthesia and analgesia serves purposes unrelated to reduction of fetal pain, including inhibition of fetal movement, prevention of fetal hormonal stress responses, and induction of uterine atony.\n \n Conclusions \n Evidence regarding the capacity for fetal pain is limited but indicates that fetal perception of pain is unlikely before the third trimester. Little or no evidence addresses the effectiveness of direct fetal anesthetic or analgesic techniques. Similarly, limited or no data exist on the safety of such techniques for pregnant women in the context of abortion. Anesthetic techniques currently used during fetal surgery are not directly applicable to abortion procedures. \n", 
   {
    "unicode_changes_made": true
   }, 
   248698, 
   null, 
   1170121500.0
  ], 
  [
   248871, 
   null, 
   "Shooterandproud", 
   "I can find a valid reason: He doesn't have any sort of argument, so when people point out that he is contradicting himself completely, he blocks them.\n \n And that, my friends, is the only valid reason.\n\n \n That, IMO, is not a valid reason.", 
   {}, 
   248612, 
   null, 
   1170126420.0
  ], 
  [
   248872, 
   null, 
   "Shooterandproud", 
   "Are you sure a fetus does not suffer?\n\n \n A very late term fetus MAY, but defonitaly not an early term one.\n \n \n \n \n \nThe effectiveness of natural family planning:\n \n http://ccli.org/nfp/basics/effectiveness-p01.php\n \n Even planned parenthood informs about it:\n http://www.ppgg.org/site/c.esJMKZPKJtH/b.1164205/k.5BF7/Natural_Family_Planning.htm\n \n Some families never want children? Is that a family? Love gives life.\n\n \n Oh please, these have been around since when we were abolishing slavery. (And I say \"we\" because I'm assuming you vote conservative).", 
   {}, 
   248695, 
   null, 
   1170126540.0
  ], 
  [
   248875, 
   null, 
   "Shooterandproud", 
   "I choose not to engage in childish behavoir...It makes life easier just to block the user instead of scroll past their posts.\n\n \n I agree, but sometimes your view of \"childish behavior\" is not entirely accurate.", 
   {}, 
   248808, 
   null, 
   1170127920.0
  ], 
  [
   249116, 
   null, 
   "maximus", 
   "A very late term fetus MAY, but defonitaly not an early term one.\n \n Oh please, these have been around since when we were abolishing slavery. (And I say \"we\" because I'm assuming you vote conservative).\n\n Don't confuse these with the Rhythm Method. This is the sympto-thermal method.", 
   {}, 
   248872, 
   null, 
   1170309180.0
  ], 
  [
   249118, 
   null, 
   "maximus", 
   "At that stage in development, yes.\n \n \n \n 12 weeks was the first time I ever saw my daughter in a scan, so it's basically an example of the time when I felt my baby was developed, as I could see her kicking her legs, etc. Obviously you can give or take a few weeks development from that but I basically wanted to have the abortion as soon as possible for both the humanity of the foetus and for my own mental health, as I would have found it a lot more difficult at that stage, having already gone through a pregnancy. \n \n \n \n There are married couples out there who don't ever want to have kids of their own, I'd still call them a family.\n\n You have come to this personal opinion of 12 wks. What is it you believe is there prior to this 12 week time? \n \n I call a married couple who never wants to have kids or who does want to have kids but hasn't yet, a married couple. When that first kid is added then I might call them a family.", 
   {}, 
   248698, 
   null, 
   1170309480.0
  ], 
  [
   249204, 
   null, 
   "paw_x", 
   "You have come to this personal opinion of 12 wks. What is it you believe is there prior to this 12 week time? \n\n \n I understand prior to 12 weeks the foetus is alive and growing and developing. Basically I mentioned 12 weeks for my own mental health, as I had seen my daughter in a scan at that age and could picture it more. Maybe that sounds stupid but I found it extremely difficult to go through with the abortion and the less real I could make it seem, the better I felt about going through with it. [though that didn't actually work out as I ended up seeing what I had passed in the bedpan]", 
   {}, 
   249118, 
   null, 
   1170363780.0
  ], 
  [
   249479, 
   null, 
   "maximus", 
   "What follows is a sytematic review of the literature on this subject. I submit the reference and the abstract. For you and max:\n \n Quote:\n Lee SJ, Ralston HJP, Drey EA, Partridge JC, Rosen MA. Fetal Pain: A Systematic Multidisciplinary Review of the Evidence. JAMA, 2005; 294(8): 947-54.\n \n ABSTRACT\n \n Context\n Proposed federal legislation would require physicians to inform women\n seeking abortions at 20 or more weeks after fertilization that the fetus feels pain and to offer anesthesia administered directly to the fetus. This article examines whether a fetus feels pain and if so, whether safe and effective techniques exist for providing direct fetal anesthesia or analgesia in the context of therapeutic procedures or abortion.\n \n Evidence Acquisition \n Systematic search of PubMed for English-language articles focusing on human studies related to fetal pain, anesthesia, and analgesia. Included articles studied fetuses of less than 30 weeks' gestational age or specifically addressed fetal pain perception or nociception. Articles were reviewed for additional references. The search was performed without date limitations and was current as of June 6, 2005.\n \n Evidence Synthesis \n Pain perception requires conscious recognition or awareness of a noxious stimulus. Neither withdrawal reflexes nor hormonal stress responses to invasive procedures prove the existence of fetal pain, because they can be elicited by nonpainful stimuli and occur without conscious cortical processing. Fetal awareness of noxious stimuli requires functional thalamocortical connections. Thalamocortical fibers begin appearing between 23 to 30 weeks' gestational age, while electroencephalography suggests the capacity for functional pain perception in preterm neonates probably does not exist before 29 or 30 weeks. For fetal surgery, women may receive general anesthesia and/or analgesics intended for placental transfer, and parenteral opioids may be administered to the fetus under direct or sonographic visualization. In these circumstances, administration of anesthesia and analgesia serves purposes unrelated to reduction of fetal pain, including inhibition of fetal movement, prevention of fetal hormonal stress responses, and induction of uterine atony.\n \n Conclusions \n Evidence regarding the capacity for fetal pain is limited but indicates that fetal perception of pain is unlikely before the third trimester. Little or no evidence addresses the effectiveness of direct fetal anesthetic or analgesic techniques. Similarly, limited or no data exist on the safety of such techniques for pregnant women in the context of abortion. Anesthetic techniques currently used during fetal surgery are not directly applicable to abortion procedures. \n\n Moose, Shooter, Paw,\n \n GULLIBLE TREATMENT OF TRUMPED UP \"STUDY\" ON FETAL PAIN ISSUE SHOULD EMBARRASS J.A.M.A. AND SOME JOURNALISTS\n This memo offers a number of points of information regarding the article \"Fetal Pain: A Systematic Multidisciplinary Review of the Evidence,\" published in the August 24 edition of the Journal of the American Medical Association (JAMA). Any of the material below, if not otherwise attributed, can be attributed to NRLC Legislative Director Douglas Johnson (Legfederal@aol.com), who prepared this memorandum.\n \n See this here: \n http://www.nrlc.org/abortion/Fetal_Pain/NRLCrebuttalJAMA.html\n \n The following excerpt is from:\n http://abort73.com/HTML/I-A-2a-pain.html\n \n \"Sir Albert Lilley, widely considered the \"Father of Fetology\", and unabashedly pro-life (as anyone with his vast knowledge of fetal development should be) makes some remarkable statements about fetal pain in an interview he conducted for the book The Tiniest Humans.\n \n Question: In the case of an 8- to-10-week fetus, if you apply pressure will it tend to try to get out of the way?\n \n Answer: Normally it would be extremely difficult, apart from putting a foreign instrument or needle into the uterus to apply pressure, but with a fetus at that maturity you have a very small fetus in a larger capsule of fluid. However, as the famous work of Dr. Davenport Hooker shows, in his many thousands of feet of film, babies at this maturity are responsive to touch.\n \n The fetus also responds violently to painful stimuli-needle puncture and injection of cold or of hypertonic solutions- stimuli which you and I find painful, children will tell you are painful, and the neonate, to judge from his responses, finds painful.\n ---\n I have been told by advocates of abortion that we have no proof that the fetus actually feels pain. Strictly, they are quite correct. Pain is a peculiarly personal and subjective experience and there is no biochemical or physiological test we can do to tell that anyone is in pain - a phenomenon which makes it very easy to bear other people's pain stoically, which is an important point for obstetricians to remember. By the same token we lack any proof that animals feel pain. However, to judge from their responses, it seems charitable to assume they do. Were this not so there would be no point in having an organization like the Society for Prevention of Cruelty to Animals, and I for one would be unhappy to think we would withhold from the human fetus a charitable consideration we were prepared to extend to animals.\n \n Question: The question, then, of pain felt by the fetus - it is your personal opinion, I gather from what you say in your paper, that in effect the fetus does feel pain?\n \n Answer: I can only say that the fetus responds violently to stimuli that you and I would find painful. Bertrand Russell once remarked that a fisherman had told him that fish had neither sense or sensation, but how he knew that the fisherman would not tell him.\"\n \n The following excerpt is from:\n http://www.theinterim.com/2000/nov/21fetalpain.html\n \n \n \"Dr. Glover's research in the area of fetal pain is hardly groundbreaking. Sir Albert W. Liley, the pre-eminent fetologist from New Zealand, had no doubt, on the basis of objective evidence, that the fetus has a capacity to feel pain. In 1963, Dr. Liley, the founder of fetology, developed the first surgical technique for administering intrauterine blood transfusions to the fetus. According to Liley, the fetus feels pain as early as three months. In offering instructions for carrying out the surgical technique of fetal blood transfusions, he advised his colleagues to take into serious consideration this fact of fetal pain. During the actual surgical procedure, the child must be sedated and given pain-relieving medication. Dr. Margaret Liley, wife and assistant to her husband, and a distinguished fetologist and pediatrician in her own right, remarks in her well-known book, Modern Motherhood: \n When doctors first began invading the sanctuary of the womb, they did not know that the unborn baby would react to pain in the same fashion as a child would. But they soon learned that he would. By no means a 'vegetable' as he has so often been pictured, the unborn knows perfectly well when he has been hurt, and he will protest it just as violently as would a baby in a crib. \n \n In referring to aborting a 12-week-old fetus by dilatation and curettage, (in which the neck of the womb is dilated and the fetus removed in pieces after the womb has been scraped by a sharp instrument called a curette), Dr. Eugene Diamond stated in 1971: \"When this procedure is done, there is little doubt that the fetus, in fact, feels what is done to it.\" In a comprehensive treatment of fetal pain, published in 1985 in the New England Journal of Medicine, Dr. K. Annand, a Harvard physiologist, stated that the fetus first perceives pain as early as 12 weeks. \n \n In a May 1975 piece in Atlantic, Willard Gaylin and Marc Lappe argue for fetal experimentation, which they contend is far less traumatic for the unborn than certain forms of abortion. If society allows a child in the womb to be subjected to \"unimaginable acts of violence,\" they write, such as \"dismemberment, salt-induced osmotic shock, or surgical extirpation,\" how can it balk at fetal experimentation, most forms of which are incomparably more benign. \n \n Fetal pain, of course, is a matter of fact, not ideology. Science, of course, should be based on fact, not political correctness. We live in a Therapeutic Culture in which popping pills has become a national pastime. We are only too sensitive about pain, inconvenience, and possibly offending someone. Yet our own ultra-sensitivity to pain does not, in general, extend to the unborn. Are we inconsistent in our war against pain? Is there a blatant contradiction that runs through the very heart of our Therapeutic Culture? \n \n The answer to this apparent dilemma lies in the fact that there are different levels of pain. Pain exists on a spiritual as well as on a physical level. Of the two, as many psychologists and psychiatrists have averred, the spiritual kind is more difficult to bear. The difference between the two is akin to the difference between pain and suffering. The suffering in one's soul that can arise from humiliation, guilt, despair, and terror, are formidable. An athlete would rather risk breaking his neck driving for a fly ball than feel the humiliation of being called a wimp. A soldier would rather risk injury and even death, than suffer the shame of dishonor. A Christian would rather mortify himself than experience the disgrace that comes with mortal sin. Defeat, dishonor, disgrace, as a rule, are far more devastating than physical pain. \n There is a pain that goes with being egregiously wrong (shame) or being recklessly immoral (disgrace) or being purposely obtuse (humiliation) that is more acute than physical pain. Our Therapeutic Culture is not inconsistent. Those who promote abortion want to spare themselves the pain that goes with suffering shame, disgrace, and humiliation. Because of that, they are willing to deny the pain that the aborted baby feels. To acknowledge what abortion really means is too painful for them. They would rather retreat into the presumed security of their comforting ideology. \n \n Pain and birth go together in a mysterious way, like death and life, fall and redemption. The birth of a child or the rebirth of an adult requires a certain amount of pain. Birth and redemption both demand pain. Abortion was instituted in an attempt to avoid pain. But it has magnified the very thing it had sought to reduce. We are drowning in a sea of tranquilizers while we increase our suffering. We thought we could eliminate physical suffering, but brought about spiritual torment. The abortion issue, like an ellipse, has two foci: one is the birth of the child (which is accompanied by pain); the other, the rebirth of the pro-abortionist (which is accompanied by suffering). Part of the painful truth about the abortion issue is that it includes both the unborn and the unrepentant.\" \n Dr. DeMarco is a professor of philosophy\n at St. Jerome's University in Waterloo, Ont.", 
   {
    "unicode_changes_made": true
   }, 
   248855, 
   null, 
   1170552300.0
  ], 
  [
   249482, 
   null, 
   "maximus", 
   "I understand prior to 12 weeks the foetus is alive and growing and developing. Basically I mentioned 12 weeks for my own mental health, as I had seen my daughter in a scan at that age and could picture it more. Maybe that sounds stupid but I found it extremely difficult to go through with the abortion and the less real I could make it seem, the better I felt about going through with it. [though that didn't actually work out as I ended up seeing what I had passed in the bedpan]\n\n \n So 12 weeks for your mental health and to make it seem less real? But what was there prior to 12 weeks? Does this being have no value at 11 weeks 6 days and then instantly gain value after one more day at 12 weeks? \n \n Is it worth the money and keeping the house and other \"benefits\" you \"gain\" by the abortion when measured against the fact that you deprived your daughter of a brother or sister (and deprived yourself and the father) and all of the rich aspects of life that would have come from that? How did you choose between your daughter living out of the womb and the one that was living within it?", 
   {}, 
   249204, 
   null, 
   1170552780.0
  ], 
  [
   249513, 
   null, 
   "paw_x", 
   "So 12 weeks for your mental health and to make it seem less real? But what was there prior to 12 weeks? Does this being have no value at 11 weeks 6 days and then instantly gain value after one more day at 12 weeks? \n\n \n 12 weeks is just an example as that was when I first realised I was actually having a baby, as before I saw the scan it didn't seem so real. It was nothing to do with the value of the foetus to me. \n \n \nIs it worth the money and keeping the house and other \"benefits\" you \"gain\" by the abortion when measured against the fact that you deprived your daughter of a brother or sister (and deprived yourself and the father) and all of the rich aspects of life that would have come from that? \n\n \n I do want to have more children later on. But at this time, we have just taken on a 5 year fixed rate mortgage, and if we pay it off before that time [i.e by selling the house, which is too small for 2 kids] we lose a substantial amount of money, probably wouldn't be able to afford anywhere bigger, and certainly unable to pay a high mortgage while I'd be on maternity leave, so we would probably have to wait for a council property, which would almost certainly be offered only in the deprived areas of my town as that's all that is left for rent. I don't want to go too much more into the money side of things as it seems like it's putting a price on a possible second child but I've worked hard to get my daughter out of our old rented house in a bad area and into a decent side of the town in an owned property. The 'rich aspects' don't seem as appealing when I would be living, granted with two great children, but in an area of my town where vandalism, antisocial behaviour and crime is constant, living in fear of having my daughters bedroom window smashed by two 10 year old boys, having drunk teenagers cut through my garden every weekend, and finding it difficult to even get my daughter to sleep at night because of the constant shouting and screaming of my lovely neighbours [basically the fabulous neighbourhood we lived in, offered by the housing association after I had my daughter]. I'm probably being too personal but I don't feel that my life would be very rich had I continued my pregnancy at this time in my life. \n \n \nHow did you choose between your daughter living out of the womb and the one that was living within it?\n\n \n I chose to have my daughter, and when I made that decision I took on the obligation of raising her well, and doing all I could for her. As you stated above, the earliest time a foetus begins feeling pain is at 12 weeks, so merely on a suffering basis, my daughters health and wellbeing meant more to me.", 
   {}, 
   249482, 
   null, 
   1170618240.0
  ], 
  [
   249788, 
   null, 
   "maximus", 
   "12 weeks is just an example as that was when I first realised I was actually having a baby, as before I saw the scan it didn't seem so real. It was nothing to do with the value of the foetus to me. \n \n I do want to have more children later on. But at this time, we have just taken on a 5 year fixed rate mortgage, and if we pay it off before that time [i.e by selling the house, which is too small for 2 kids] we lose a substantial amount of money, probably wouldn't be able to afford anywhere bigger, and certainly unable to pay a high mortgage while I'd be on maternity leave, so we would probably have to wait for a council property, which would almost certainly be offered only in the deprived areas of my town as that's all that is left for rent. I don't want to go too much more into the money side of things as it seems like it's putting a price on a possible second child but I've worked hard to get my daughter out of our old rented house in a bad area and into a decent side of the town in an owned property. The 'rich aspects' don't seem as appealing when I would be living, granted with two great children, but in an area of my town where vandalism, antisocial behaviour and crime is constant, living in fear of having my daughters bedroom window smashed by two 10 year old boys, having drunk teenagers cut through my garden every weekend, and finding it difficult to even get my daughter to sleep at night because of the constant shouting and screaming of my lovely neighbours [basically the fabulous neighbourhood we lived in, offered by the housing association after I had my daughter]. I'm probably being too personal but I don't feel that my life would be very rich had I continued my pregnancy at this time in my life. \n \n I chose to have my daughter, and when I made that decision I took on the obligation of raising her well, and doing all I could for her. As you stated above, the earliest time a foetus begins feeling pain is at 12 weeks, so merely on a suffering basis, my daughters health and wellbeing meant more to me.\n\n I wish you the best. I hope you don't have to go through any more abortions. I hope you and your family have a safe, healthy, happy, life.\n \n Peace.", 
   {}, 
   249513, 
   null, 
   1170745320.0
  ], 
  [
   249806, 
   null, 
   "paw_x", 
   "I wish you the best. I hope you don't have to go through any more abortions. \n\n \n I will never go through that again. It has been a big wake up call for me.", 
   {}, 
   249788, 
   null, 
   1170755700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why Pro-life?", 
  "url": "http://www.4forums.com/political/abortion-debates/9391-why-pro-life.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9391, 
  "discussion_files": [
   [
    "20843.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-print.html"
   ], 
   [
    "20844.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-12-print.html"
   ], 
   [
    "20845.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-10-print.html"
   ], 
   [
    "20846.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-8-print.html"
   ], 
   [
    "20847.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-6-print.html"
   ], 
   [
    "20848.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-4-print.html"
   ], 
   [
    "20849.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-5-print.html"
   ], 
   [
    "20850.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-7-print.html"
   ], 
   [
    "20851.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-9-print.html"
   ], 
   [
    "20852.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-11-print.html"
   ], 
   [
    "20853.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-3-print.html"
   ], 
   [
    "20854.html", 
    "http://www.4forums.com/political/abortion-debates/9391-why-pro-life-2-print.html"
   ]
  ], 
  "identifier": 9391
 }
]