[
 [
  [
   245523, 
   null, 
   "simone", 
   "Does it take to hang one man?\n \n Three Thousand.", 
   {
    "post_info": {
     "post_title": "How Many People . . ."
    }
   }, 
   null, 
   null, 
   1167765840.0
  ], 
  [
   245529, 
   null, 
   "99%BEEF", 
   "How many would be acceptable?", 
   {}, 
   245523, 
   null, 
   1167766620.0
  ], 
  [
   245546, 
   null, 
   "simone", 
   "I would have liked to have seen Saddam Hussein tried for ALL of his crimes, especially his MOST HEINOUS crimes.\n \n If Saddam had been tried for the MOST HEINOUS of his crimes, we might have been quite surprised by the skeletons that came tumbling out of of Saddam Hussein's closet.\n \n Donald Rumsfeld? Dick Cheney? Halliburton?", 
   {}, 
   245529, 
   null, 
   1167769680.0
  ], 
  [
   245558, 
   null, 
   "jim's trucking", 
   "How many people......Does it take to hang one man?\n ...\nOne...minimum!", 
   {}, 
   245523, 
   null, 
   1167777360.0
  ], 
  [
   245561, 
   null, 
   "simone", 
   "Oh, like the one man marched into Iraq and took Iraq and hung out and hunted down Saddam Hussein and hauled him off to prison and saw to it that a court was assembled and witnesses were called and judgments made and a gallows made ready and a lone man marched Saddam Hussein up the steps.\n \n Yeah. Really.", 
   {}, 
   245558, 
   null, 
   1167777900.0
  ], 
  [
   245567, 
   null, 
   "jim's trucking", 
   "Oh, like the one man marched into Iraq and took Iraq and hung out and hunted down Saddam Hussein and hauled him off to prison and saw to it that a court was assembled and witnesses were called and judgments made and a gallows made ready and a lone man marched Saddam Hussein up the steps.\n \n Yeah. Really.\nOf course not. You asked a simple question...I gave a simple answer. Saddam could have hung himself and saved us the trouble. It actually takes only one person to hang a person.\n \n Apparently, that wasn't the answer you were looking for.\n \n If you wanted to know how many people it takes to hunt down, capture, perform a trial with judges, witnesses and such...why didn't you ask?", 
   {}, 
   245561, 
   null, 
   1167779460.0
  ], 
  [
   245671, 
   null, 
   "simone", 
   "Hey! Didn't GWB's bungling manage to turn Saddam's execution into a barbaric lynching?\n \n Saddam Hussein is the only damned person who came out of that stupid scenario looking heroic.\n \n Now, damn his eyes, he's a bloody martyr and the Sunnis are probably going to make him an Islamic saint. \n \n Only George Walker Bush could screw things up so monumentally.", 
   {}, 
   245567, 
   null, 
   1167847080.0
  ], 
  [
   245676, 
   null, 
   "99%BEEF", 
   "Have there been many successful trials of war criminals? The only trial I recall in modern history was Slobodan Milosevic's. That turned into a farce and he ended dying before the conclusion. Sadamn was always going to be a martyr to some. I think they should have just shot Sadamn in the hole they found him.", 
   {}, 
   245671, 
   null, 
   1167847860.0
  ], 
  [
   245827, 
   null, 
   "James", 
   "Have there been many successful trials of war criminals? The only trial I recall in modern history was Slobodan Milosevic's. \n\n \n Have you forgotten the Nuremberg trials of Nazi war criminals, 1945-49? \n \n James.", 
   {}, 
   245676, 
   null, 
   1167919920.0
  ], 
  [
   245895, 
   null, 
   "Jo Bennett", 
   "I think the definition of modern in this instance is \"the last 20-30 years\". Nuremburg was a long time ago.", 
   {}, 
   245827, 
   null, 
   1167939840.0
  ], 
  [
   246036, 
   null, 
   "peteratwar", 
   "I think the definition of modern in this instance is \"the last 20-30 years\". Nuremburg was a long time ago.\n\n \n \n Must make you incredibly young:) \n \n Nuremberg is modern history to a huge number (albeit decreasing) of people", 
   {}, 
   245895, 
   null, 
   1168010280.0
  ], 
  [
   246041, 
   null, 
   "99%BEEF", 
   "Yeah I'm afraid I was talking about modern in the way an arrogant 24 year old might use the term. I should have been clearer. \n \n WW2 was a completely different type of warfare with defined sides and victory conditions. Certainly many more than 3000 died in bringing them to trial. Some people claimed and still claim that they were victor's justice. However the fascist powers were completly defeated and their support eroded. If we were prepared to bomb Saddam's supporters to the same extent then his trial may have been more popular. Being a war of liberation (This may or may not be the reason for the war, I'm never did find out, I think Bush said democracy and Blair said WMDs?) rules these tactics out.", 
   {
    "unicode_changes_made": true
   }, 
   246036, 
   null, 
   1168012920.0
  ], 
  [
   246126, 
   null, 
   "Zardoz", 
   "Hey! Didn't GWB's bungling manage to turn Saddam's execution into a barbaric lynching?\n\n Loaded comment but, care to elaborate rather than toss out inflammitory remarks? I didn't realize that George Bush was '3,000 people' or the entirity of those involved in the trial issue.\n \n \nSaddam Hussein is the only damned person who came out of that stupid scenario looking heroic.\n\n So, you think Saddam looked heroic? I know I don't...didn't. Of course, he did show some balls by not crying or wussing out. But, I'd doubt he'd ever behave in such a manner. I'm sure he had a lot of time to come to terms with his situation and accept it.\n \n \nNow, damn his eyes, he's a bloody martyr and the Sunnis are probably going to make him an Islamic saint. \n He's only a martyr to those who want him to be. Liberals, democrats, his followers...\n \n \nOnly George Walker Bush could screw things up so monumentally.\n\n This is a little like the 1st comment. I'm hard pressed to see 'bungling'. Maybe expecting Shiite's to show some decorum in the execution and not video tape it and throw out jeers...\n But, I guess we can think that many victims of executed criminals weren't a little glad when just deserts were done. I can recall some stories of Jews dancing a jig when a nazi guard was strung up. \n \n Saddam was found guilty of his least crime and hung for it. Why waste time trying him for more crimes when the same punishment would happen? They can only hang him once. Why prolong the venture with more 'show-boat' trials? I'm sure if he were tried over, and over, and over, you'd complain about that too. Remember, they aren't Americans. Don;t have American trials nor willingness to put up with redundant XXXX that waste time and money.\n Personally, I think it could have been embarrasing had Saddam been tried on other charges and found not guilty on one or more (highly doubtful).", 
   {}, 
   245671, 
   null, 
   1168047660.0
  ], 
  [
   246130, 
   null, 
   "daewoo", 
   "I would have liked to have seen Saddam Hussein tried for ALL of his crimes, especially his MOST HEINOUS crimes.\n \n If Saddam had been tried for the MOST HEINOUS of his crimes, we might have been quite surprised by the skeletons that came tumbling out of of Saddam Hussein's closet.\n \n Donald Rumsfeld? Dick Cheney? Halliburton?\n\n \n That would have been nice...it also would have been JUSTICE. Instead, we set up a court, tried him for the only 2 crimes we could come up with that he committed BEFORE massive US intervention (the only 2 that we could not be implicated in), then made sure he was sentenced to death for those. The last thing we wanted to see was Saddam expalingin how the US helped him with chem/bio weapons.\n \n My problem with hanging Saddam (though there is no doubt in my mind that he richly deserved it) is the manner in whihc the trial was conducted. We had one jusdge quit mid trial because he argued that the coalition government was interfering in the impartiality of the trial, and then to prove the point, the government later dismissed his replacement when it started to look like he may be leaning towards finding Saddam not guilty. \n \n With secret witnesses, closed testimony, and judges being replaced to ensure a desired outcome, it was not a trial, it was a farce,a dn everybody in the world could see right through it. There was no \"justice\" it was just a lynching.", 
   {}, 
   245546, 
   null, 
   1168049100.0
  ], 
  [
   246160, 
   null, 
   "Dono", 
   "Loaded comment but, care to elaborate rather than toss out inflammitory remarks? \n\n \n He's only a martyr to those who want him to be. Liberals, democrats, his followers...\n\n Inflammatory?", 
   {}, 
   246126, 
   null, 
   1168064700.0
  ], 
  [
   246166, 
   null, 
   "Liminus", 
   "The worst thing about the execution of Hussein is the message it send to the arabic peoples; once again we will be seen as double standard-imposing militaristic oppressors rather than liberators.\n \n For decades the US and UK have been seen as imperialistic warmongers by the rest of the world. It doesn't matter what our leaders recite as our noble reasons, our actions have created our image in the minds of (specifically) the middle eastern peoples.\n \n They know about the Nuremburg trials, and they will compare those to this blatant show trial and conclude once again that we are over there to impose imperialistic foreign policy. Whether or not our foreign policy is imperialistic is irrelevant; this is how it will be seen. The people over there all know about the crimes Hussein committed for which he was not tried, for which he had our support, financially and ideologically. They have seen that we have not built any bridges in terms of reconciliation between our societies. The enduring symbol of Hussein's execution will be that once again the US and UK can do whatever we like to weaker countries, a fact acknowledged for decades but now stepped up in that we have shown that we'll happily invade them and kill their leaders.\n \n Another problem is the message this sends to the political world in Iraq. Regardless of its former dictatorial leader, the Ba'ath party in Iraq has over 70 years of experience; is the largest and most organised of political parties in Iraq; and has considerable support even from those who hated Saddam. This party has been entirely sidelined by the US/UK-managed political organisation of the country, and the execution (as opposed to imprisonment) of Hussein is just another nail in the coffin of the potential for a truly democratic Iraq.\n \n If the Iraqis are ever to trust us; if we are ever to hope to stop creating US/UK-hating terrorists, we have to show with every action we take, at all times the utmost respect for diversity and democratic potential within Iraq. Unfortunately I believe we are far too gone to accomplish this, and we will see a whole new generation of nihilistic terrorists spawned from this conflict, just as we did in Afghanistan.", 
   {}, 
   246160, 
   null, 
   1168074540.0
  ], 
  [
   246202, 
   null, 
   "simone", 
   "Loaded comment but, care to elaborate rather than toss out inflammitory remarks? I didn't realize that George Bush was '3,000 people' or the entirity of those involved in the trial issue.\nUnfortunately, Iraq is still occupied by the United States. Bush certainly wasted some 3,000 souls in order to get his revenge Saddam for \"trying to kill my daddy.\"\n \nSo, you think Saddam looked heroic? I know I don't...didn't. Of course, he did show some balls by not crying or wussing out. But, I'd doubt he'd ever behave in such a manner. I'm sure he had a lot of time to come to terms with his situation and accept it.).\nIt doesn't made any difference what I thought about Saddam Hussein. I'm not a belligerent in Iraq.\n \nHe's only a martyr to those who want him to be. Liberals, democrats, his followers...).\nI am a Liberal, I am a Democrat. I am not a follower of Saddam Hussein. I don't think he's a martyr. It doesn't matter what I think. I am not a belligerent in Iraq. I am not a stupid radically rightwing ideologue either.\n \n. . . . Saddam was found guilty of his least crime and hung for it. Why waste time trying him for more crimes when the same punishment would happen? They can only hang him once. Why prolong the venture with more 'show-boat' trials? I'm sure if he were tried over, and over, and over, you'd complain about that too. Remember, they aren't Americans. Don;t have American trials nor willingness to put up with redundant XXXX that waste time and money.\n Personally, I think it could have been embarrasing had Saddam been tried on other charges and found not guilty on one or more (highly doubtful).\nA mountainous pile of evidence? A non-kangaroo type of trial? No assassinations of three of Hussein's defense attorneys?\n \n Something like a class act? Instead of a lynching?\n \n You can't imagine something like that, can you?", 
   {}, 
   246126, 
   null, 
   1168114440.0
  ], 
  [
   246205, 
   null, 
   "Shooterandproud", 
   "Loaded comment but, care to elaborate rather than toss out inflammitory remarks? I didn't realize that George Bush was '3,000 people' or the entirity of those involved in the trial issue.\n \n \n So, you think Saddam looked heroic? I know I don't...didn't. Of course, he did show some balls by not crying or wussing out. But, I'd doubt he'd ever behave in such a manner. I'm sure he had a lot of time to come to terms with his situation and accept it.\n \n He's only a martyr to those who want him to be. Liberals, democrats, his followers...\n \n \n This is a little like the 1st comment. I'm hard pressed to see 'bungling'. Maybe expecting Shiite's to show some decorum in the execution and not video tape it and throw out jeers...\n But, I guess we can think that many victims of executed criminals weren't a little glad when just deserts were done. I can recall some stories of Jews dancing a jig when a nazi guard was strung up. \n \n Saddam was found guilty of his least crime and hung for it. Why waste time trying him for more crimes when the same punishment would happen? They can only hang him once. Why prolong the venture with more 'show-boat' trials? I'm sure if he were tried over, and over, and over, you'd complain about that too. Remember, they aren't Americans. Don;t have American trials nor willingness to put up with redundant XXXX that waste time and money.\n Personally, I think it could have been embarrasing had Saddam been tried on other charges and found not guilty on one or more (highly doubtful).\n\n \n Yea, well we can thank the conservative nut-heads for this whole mess. IMO, bush and all of his republican minions should be thrown in jail for what they've done, when if a democrat was in power, this whole mess could've been avoided, and we would probably have Osama by now. But no, Osama's conservative followers wen't after a ghost instead. Typical Republican fallacy's. Makes me sick to my stomach.", 
   {}, 
   246126, 
   null, 
   1168115820.0
  ], 
  [
   246211, 
   null, 
   "Jo Bennett", 
   "Bush has wasted rather more than 3000 lives, 300000 would be closer to the mark.", 
   {}, 
   246205, 
   null, 
   1168118640.0
  ], 
  [
   246232, 
   null, 
   "simone", 
   "I'd say more like 655,000 lives. Of course, Saddam Hussein wasted about 2 million people according to some counts.\n \n So in sheer numbers Saddam Hussein is far worse than George W. Bush.", 
   {}, 
   246211, 
   null, 
   1168140900.0
  ], 
  [
   246249, 
   null, 
   "bmittking", 
   "Does it take to hang one man?\n \n Three Thousand.\n\n \n Q: How many men does it take to hang three thousand?\n \n A: One.\n \n Even though I don't agree with the careless way in which the war was carried out, I do believe that Saddam was a horrible person who deserved to be executed.", 
   {}, 
   245523, 
   null, 
   1168152660.0
  ], 
  [
   246255, 
   null, 
   "Zardoz", 
   "You're all wrong.\n \n It's 65 million.\n \n It's also doubtful that a democrat would have had any better response to post 911 events. Many of them gladly jumped on Bush's band wagon and okayed action without much forethought only to quickly jump off and loudly proclaim how things were going wrong. \n I often wonder how things would be if the liberals wouldn't be saying loudly to the world that everything is bad for coalition forces. I wounder if such vocal comments only embolden the enemy. I know I fight harder when my opponents seem willing to quit sooner...even if I'm getting my butt handed to me. \n \n My job, is a media monitor (it PR related). In doing so, I watch non-stop footage of the coverage of the Iraq war amongst others things.\n I find it odd that most coverage is of Baghdad. The constant violence there is extrapolated by the media to now be a civil war...in the whole nation.\n Kind of like, if some nastiness happened in D.C., all of America is experiencing it too. \n \n Maybe we should allow the Kurds to finally have their own nation to the north, push the sunnis into the desert to the east, move the shiites into central Iraq and take the south and oil fields for the US as a colony for our imperialistic nation for the next 100 years or so...we'll sign a lease to hand it back ala Hong Kong.\n Then maybe I can have some cheaper oil finally like the anti-war people said we wanted.\n \n Also, I doubt W wanted to avenge his daddy.\n The more likely conspiracy theory is he's pushing for the apocalypse.\n He's a known born again who associates with evangelist and word of faithers who harp about the end times. I think he's watched too many Left Behind movies. \n After all, didn't he also say that god gave him this mission?\n \n Oh, and initial US failure and the conflict spreading to the region IS what the evangelists want. Not a tidy little conflict in Iraq that results in peace and stability in a short period of time. The liberal nay saying and undermining any form of victory actually plays into his hands in the end. You think he's dumb because you look at the cover, his appearances and demeanor. He's got a win-win situation for himself. Win the war, knock the wind out of current terrorism (you really can't win) and look like a victorious president OR start the ball rolling for the 2nd coming.\n \n \n and @ simone, you were the one who said Saddam looked like a martyr. And no, it really doesn't matter what you think. So, why start such threads with such rabidness? With simple one liners devoid of thought, that seem stolen straight from your own demagogues mouths?\n You complain about rabid right wingers...are you aware that you're a rabid leftwinger? \"I am not a stupid radically rightwing ideologue either.\"\n \n I kind of agree with Liminus's comments save for the end. It really doesn't matter WHAT the US does. Many will see even the simplest action, the most compassionate of gesture as some evil move to be condemned. Giving humanitarian aid for example is bad you know and can be spun countless ways to be illustraited as such. \n \n \n \n Of course, I also covered Saddams trial...and it DID appear to me to be craptacular and of the kangaroo version. But then again, Saddams admin. was said to have documented a lot of what they did in the name of justice with more than enough witnesses and evidence to go around. All we got in the media was snippets and commentary. \n \n So, yes, I CAN imagine a lot, I just doubt you can. I saw as much as most here did of the event...actually was paid to do so and report on it in synopse form free of bias. I'm curious why more trials would be needed? Why endanger the lives of more defense lawyers? Why turn a show trial into one gigantic circus that last as long as the ones at the Haige?\n All I can say is I'm glad it's over. It was boring to cover. I'll also be glad when the short term rancor over the execution is a distant memory (a week or so) and people are railing against something else.", 
   {}, 
   246232, 
   null, 
   1168154880.0
  ], 
  [
   246256, 
   null, 
   "Zardoz", 
   "Inflammatory?\n\n \n \n Nope. \n The first part is factual. Only those who WANT to see Saddam as a martyr will do so. \n The last part are currently 3 types who seem to be calling him one.\n \n The only one's who've called him a martyr in the hours of media on this subject I've covered have been small bands of his former followers, a daughter in Jordan IIRC in a protest...and liberals and the media who repeat such claims.", 
   {}, 
   246160, 
   null, 
   1168155360.0
  ], 
  [
   246275, 
   null, 
   "simone", 
   "I, personally, do not think that Saddam Hussein was a martyr.\n \n But, it doesn't make any difference what I think. I don't live in Iraq. I am not an Iraqi belligerent set on ridding Iraq of Americans.\n \n And, sorry, Zardoz, that you are so clueless about the political and social situation in Iraq.", 
   {}, 
   246256, 
   null, 
   1168189620.0
  ], 
  [
   246298, 
   null, 
   "Dono", 
   "Nope. \n The first part is factual. Only those who WANT to see Saddam as a martyr will do so. \n The last part are currently 3 types who seem to be calling him one.\n \n The only one's who've called him a martyr in the hours of media on this subject I've covered have been small bands of his former followers, a daughter in Jordan IIRC in a protest...and liberals and the media who repeat such claims.\nI am surprised at your response since I see your posts as well considered and stated. I asked the question and you answered. To me it was clearly, by definition, inflammatory. We can agree to disagree and let readers make their own determination.", 
   {}, 
   246256, 
   null, 
   1168200060.0
  ], 
  [
   246493, 
   null, 
   "Zardoz", 
   "I, personally, do not think that Saddam Hussein was a martyr.\n \n But, it doesn't make any difference what I think. I don't live in Iraq. I am not an Iraqi belligerent set on ridding Iraq of Americans.\n \n And, sorry, Zardoz, that you are so clueless about the political and social situation in Iraq.\n\n \n You wre the one who said he looked like a martyr.\n \n As to being clueless...lol. Doubtful. And you stating so doesn't make it remotely true. \n I just don't sup from the cup you do...nor the one that 'right wingers' do.\n I don't pretend to profess absolute knowledge then try to display that with catch phrase one liners regurgitated from the party phamplet.\n I do know that both sides have equally valid claims about what's going on. Or, invalid.\n \n @ Dono. Anything can be seen in what ever the light the readers desire. IMO, had I said 'insane' liberal or attached some other derogatory modifier, it would be so...much as many liberals seem to do when talking to or describing a conservative.", 
   {}, 
   246275, 
   null, 
   1168330800.0
  ], 
  [
   246600, 
   null, 
   "obvious_child", 
   "That's not true. You know for a fact that the mission objectives of Iraq change every couple months. So those 3k dead weren't to eliminate Saddam, they were do fufil a ever increasingly long list of reasons that justify why we should be there after the previous reason fell though.", 
   {}, 
   245523, 
   null, 
   1168415220.0
  ], 
  [
   246617, 
   null, 
   "Steeeeve", 
   "Yea, well we can thank the conservative nut-heads for this whole mess. IMO, bush and all of his republican minions should be thrown in jail for what they've done, when if a democrat was in power, this whole mess could've been avoided, and we would probably have Osama by now. But no, Osama's conservative followers wen't after a ghost instead. Typical Republican fallacy's. Makes me sick to my stomach.\n\n \n The democrats coulda started by not voting for the war in the first place... I guess you forget that part of history", 
   {}, 
   246205, 
   null, 
   1168450020.0
  ], 
  [
   246634, 
   null, 
   "simone", 
   "There is a profound difference between saying that Saddam Hussein came off with the appearance of a martyr as opposed to my actually thinking that he was a martyr.\n \n Appearances can be, and often are, deceiving, dear boy. \n \n Welcome to reality!", 
   {}, 
   246617, 
   null, 
   1168454460.0
  ], 
  [
   246679, 
   null, 
   "Zardoz", 
   "\n Saddam Hussein is the only damned person who came out of that stupid scenario looking heroic.\n \n Now, damn his eyes, he's a bloody martyr and the Sunnis are probably going to make him an Islamic saint. \n\n \n \n Now Simone, while you know what you meant and I did too, that's not exactly what you typed.\n I respond to you because I actually think you're far more intelligent and rational than your posts present you to be. If you really didn't 'care', you wouldn't be so inflammed and passionate. \n \n Yes, Appearances can be quite deceiving and meaning isn't as clear as one would want. You seem to post though as if you KNOW though. \n \n Aren't you a parent? I forget the details and don't have access to my records. It's been over a year.\n Don't you, as many parents do, speak in vague generalities so as not to be pinned down with your own words?\n Use such terms as, maybe, may, seems, possibly.\n You know, vagueness that hints at what you want and what could be but still leaves you wiggle room in case it isn't.\n \n So, in conclusion, you did say he was a martyr. Not, He seems like a martyr to his followers.\n \n Welcome to reality!\n (next time wear glasses to see it better.)\n \n \n @Obvious Child.\n Well, we weren't there to gets all da's oilz or other such claims made by detractors.\n I'm sure the opposition would have came up with an ever increasing list of reasons themselves had they not had the easy out of saying 'You're not there for *blank*'\n \n 'You're not there for any WMD's, they don't exist.'\n (while some left over junk was found, Saddam was required to account for it all, it wasn't the modern stuff hoped for and while it was stated he had intentions of restarting his program after the heat died down, there's no guarantee that he could or would to any degree.)\n \n 'You're not there to spread democracy, They are incapable of it'\n (The Kurds are doing well to the north, the Shiites in the south are better than many want to believe. It's Anbar province and Baghdad where all the sectarian violence is and where the media focuses 90+% of it's attention.)\n \n 'You're not there to fight Al Qaeda, Saddam didn't have ties to Al Qaeda.'\n (Currently fighting Al Qaeda and other terrorists there.)\n \n As to 3,000 dead US troops. They're nearly all volunteers. And, call me fatalistic but, the death toll in the next state over, KY, from car accidents was down by about 60 last year. Roughly the number who died fighting in Iraq in 3 years. In my made up philosophy, they were destined to die already. Same with the Iraqi deaths.\n \n As for me, I think we went there will many initial reasons. MANY. But you don't get to sell something that big without catchy catch phrases and I'm sure a nice PR firm and spin machine found that, in the wake of 911, WMD's would stick and form a nice band wagon for others to jump on.\n \n It's like a Tootsie Pop. With each lick you have a new reason. Unfortunatly, we have no wise owl so will be licking until Bush hands things over to a democrat president. Which will be signal for the republicans to start yelling, 'Well, you going to fix it?' Then when something bad happens as an (in)direct response to cleaning up the mess Bush made, you'll get blamed for that. \n Yeah, that's politics.", 
   {}, 
   245671, 
   null, 
   1168475520.0
  ], 
  [
   246681, 
   null, 
   "obvious_child", 
   "Well, we weren't there to gets all da's oilz or other such claims made by detractors.\n I'm sure the opposition would have came up with an ever increasing list of reasons themselves had they not had the easy out of saying 'You're not there for *blank*'\n\n \n Iraq was not for oil. If it was, it would have been cheaper just to buy it or simply install a dictator who would give us cut rate price. Neither of those occured or were planned. \n \n \n'You're not there for any WMD's, they don't exist.'\n (while some left over junk was found, Saddam was required to account for it all, it wasn't the modern stuff hoped for and while it was stated he had intentions of restarting his program after the heat died down, there's no guarantee that he could or would to any degree.)\n\n \n If Iraq had a economy perhaps that would have been a threat but the sanctions lowered Iraq into a living ****hole. No economy, no weapons program. \n \n \nYou're not there to spread democracy, They are incapable of it'\n (The Kurds are doing well to the north, the Shiites in the south are better than many want to believe. It's Anbar province and Baghdad where all the sectarian violence is and where the media focuses 90+% of it's attention.)\n\n \n Questionable. The Kurds live in a largely homogenous society in the North. The Shiia largley the same in the South. When you add all three things go to Hell. A country where the three parties can't get along and resort to blowing each other up is hardly a foundation for a democracy. The best option in some minds is to split the country up and then democracy might have a chance. \n \n \n'You're not there to fight Al Qaeda, Saddam didn't have ties to Al Qaeda.'\n (Currently fighting Al Qaeda and other terrorists there.)\n\n \n after the invasion Seems kind of counter productive doesn't it? \n \n \nRoughly the number who died fighting in Iraq in 3 years. In my made up philosophy, they were destined to die already. Same with the Iraqi deaths\n\n \n 3k is chump change when you think about it. That's not my point. \n \n \nAs for me, I think we went there will many initial reasons. MANY.\n\n \n No, we went for one reason and one reason alone. Land to project US military influence and stability over the region. \n \n \nBut you don't get to sell something that big without catchy catch phrases and I'm sure a nice PR firm and spin machine found that, in the wake of 911, WMD's would stick and form a nice band wagon for others to jump on.\n\n \n of course. People wouldn't have supported the war if they knew the primary goal was to obtain land for air and ground bases.", 
   {}, 
   246679, 
   null, 
   1168476540.0
  ], 
  [
   246814, 
   null, 
   "Zardoz", 
   "Iraq was not for oil. If it was, it would have been cheaper just to buy it or simply install a dictator who would give us cut rate price. Neither of those occured or were planned. \n\n Yet, \"No blood for Oil!\" was a common mantra of the left prior to the war. Same one used in the 1st gulf war. \n There are many reasons the left has used fro the war. Simone has already used the 'He tried to kill my daddy.' one. I've heard others. None of which seem to have panned out. Just like Bush's excuses for the war.\n \n \nIf Iraq had a economy perhaps that would have been a threat but the sanctions lowered Iraq into a living ****hole. No economy, no weapons program. \n\n Mighty flawed logic you're using there. Some of the poorest countries in the world have no economy to speak of yet invest their meager funds into weapons. NK is dirt poor with a top heavy military and massive expenditures on missiles and even a nuclear program. There was also the graft from the Oil for Food program that saw funds siphoned back into Saddam's coffers. Once you have the technology (which he did) it's not hard to produce more (he had dual use chemicals from the likes of Germany that could have been used to make new weapons. As it turned out, it appears he didn't. He already had the precursors...no economy needed.\n \n \nQuestionable. The Kurds live in a largely homogenous society in the North. The Shiia largley the same in the South. When you add all three things go to Hell. A country where the three parties can't get along and resort to blowing each other up is hardly a foundation for a democracy. The best option in some minds is to split the country up and then democracy might have a chance.\n \n But, when they stick to their own, no big hassle...kind of like what's going on. Insurgents to the west, sectarian violence in the Baghdad area...translates to 'Civil War' on MSNBC. Odd how everyone is focusing on the capitol as if it translates to mean the whole country.\n Personally, I think (for a long time) that the Kurds should have been allowed to form Kurdistan as they've wanted for a long time. Of course, this upsets Turky...but, it would also upset Iran. Sounds like the ticket to me. Look good giving people their own freedoms and self determination...while actually setting the stage for more regional destabilization in the future that looks like we have our hands clean...something the great western powers should know works like a charm.\n \n \nafter the invasion Seems kind of counter productive doesn't it?\n\n Not really, the war set a stage to fight in. As an offensive sort of person, I'd much rather fight a war on your turf (or the neighbors) than mine. It's drawing anti-Americans to that area rather than here. If other nations experience collateral damage that they 'might' not have had...*shrugs*. Still aren't American civilian dead. The major issue I can see where Bush did fail miserably is not getting adequate ally support. \n I know this sounds cold hearted but, it's the mentality that was used when droping the bombs on Japan in WWII. More enemy civilian deaths to preserve American lives. Bush should also have had a post war plan of sorts even if he refused to tell anyone, because they'd just leak it to the media. \n \n \n3k is chump change when you think about it. That's not my point. \n\n I know, but it illustraits America's weakness to taking 'war casualties' as a whole. I think we've probably always been like that. \n \n \nNo, we went for one reason and one reason alone. Land to project US military influence and stability over the region. \n\n There is no ONE reason. And that reason is one of the many too. \n \n \nof course. People wouldn't have supported the war if they knew the primary goal was to obtain land for air and ground bases.\n\n As above, that wasn't the only reason...but, yes, I doubt it'd sell.", 
   {}, 
   246681, 
   null, 
   1168556460.0
  ], 
  [
   246836, 
   null, 
   "obvious_child", 
   "Mighty flawed logic you're using there. Some of the poorest countries in the world have no economy to speak of yet invest their meager funds into weapons.\n\n \n Yet almost all of them have militaries that would be crushed by a western power like a bug. \n \n \nNK is dirt poor with a top heavy military and massive expenditures on missiles and even a nuclear program.\n\n \n NK is one of the few poor nations that justifies its existance as a regime on the basis of its military power. They have to focus their economy for the regime to survive. That's not the case in virtually every other poor nation. \n \n \nThere was also the graft from the Oil for Food program that saw funds siphoned back into Saddam's coffers.\n\n \n True, but that was for Saddam's personal use rather then actually producing things of value and I don't call massive palaces built with state funds a value. \n \n \nOnce you have the technology (which he did) it's not hard to produce more (he had dual use chemicals from the likes of Germany that could have been used to make new weapons. As it turned out, it appears he didn't. He already had the precursors...no economy needed.\n\n \n Not necessarily. Such programs are massively expensive. You need to build the facilities to create the weapons, you need to store them properly, build delivery systems, train soldiers to use them, build networks of transportation, having testing and manitence, it's not that easy. South Africa had a nuke program, and they dismantled it partly because it was grossly expensive. Having the knowledge is quite a far step from being able to do it. Any decent chemistry major in college knows the steps of making a nuke, some of the nerds can recite it on command, they just lack the funds to go forward with it. \n \n \nOdd how everyone is focusing on the capitol as if it translates to mean the whole country.\n\n \n But Baghdad is one the largest population centers. You can't ignore it. Besides, even Basra has problems as the Brits found out and Mosul, even as it was peaceful has had numerous terrorist attacks on the Kurds. All is not well outside of Baghdad. \n \n \nPersonally, I think (for a long time) that the Kurds should have been allowed to form Kurdistan as they've wanted for a long time. Of course, this upsets Turky...but, it would also upset Iran.\n\n \n Hence why we didn't do it. Turkey going ape **** is not good for the US. \n \n \nwhile actually setting the stage for more regional destabilization in the future that looks like we have our hands clean...something the great western powers should know works like a charm.\n\n \n Hey, that's what the Europeans thought when they made this mess at the end of WWII. \n \n \nNot really, the war set a stage to fight in. As an offensive sort of person, I'd much rather fight a war on your turf (or the neighbors) than mine. It's drawing anti-Americans to that area rather than here.\n\n \n True, but Afghanistan is much better region for that. There we can utilize airpower to its full extent without fear of killing huge amounts of civilians. Iraq essentially handicapped much of the advantages the US enjoys over its enemies. Only a idiot fights a war on two fronts. We're better off focusing our power on to one battlefield rather then splitting them off. Besides, Iraq was not what Bush made it out to be. It's more of a terrorist haven now then it was before the invasion. Counterproductive. \n \n \nThe major issue I can see where Bush did fail miserably is not getting adequate ally support.\n\n \n Bush is not his father. And Bush has a history of digging his own grave and then asking Daddy to pull him out of it. \n \n \n \nI know this sounds cold hearted but, it's the mentality that was used when droping the bombs on Japan in WWII. More enemy civilian deaths to preserve American lives. Bush should also have had a post war plan of sorts even if he refused to tell anyone, because they'd just leak it to the media.\n\n \n The problem with that is that we are trying to cultivate these people to our side. Bombing them is not going to help there. Not to mention we have troops in those areas as well. WWII was bombing of enemy controlled terrirotry and we are not trying to win hearts and minds. Fire bombing and carpet bombing worked in WWII because those objectives were not on the table. \n \n \nI know, but it illustraits America's weakness to taking 'war casualties' as a whole. I think we've probably always been like that.\n\n \n Blame Clinton and Bush sr for that. They waged conflicts with minimal US losses. \n \n \nThere is no ONE reason. And that reason is one of the many too.\n\n \n It seems like the primary one. The rest can easily be refuted or have fallen through themselves. That one has stood the test since the invasion. It makes a hell of alot of sense compared to the XXXX bush spews and the filth protestors blech.", 
   {}, 
   246814, 
   null, 
   1168566540.0
  ], 
  [
   246987, 
   null, 
   "Zardoz", 
   "Yet almost all of them have militaries that would be crushed by a western power like a bug. \n\n I'd say ALL. But still, you don't need an economy worth mentioning to have weapons.\n \n \nNK is one of the few poor nations that justifies its existance as a regime on the basis of its military power. They have to focus their economy for the regime to survive. That's not the case in virtually every other poor nation.\n\n Most all who devote to arms production to the exclusion of all else either a) want to maintian power or b) seeking to come into power.\n \n \nTrue, but that was for Saddam's personal use rather then actually producing things of value and I don't call massive palaces built with state funds a value. \n\n But it remains that he could have spent it on anything. The exact extent of graft found wasn't detected AFAIK until after the invasion. \n See palaces going up as his people starve and it could be a safe bet that he's doing other things. Particularly when dual use chemicals were still going into Iraq from the likes of Germany. Iraq built them in the past. Had the know how and percursors, it was a decent bet to believe he had made more. Not that costly to do so. The US wasn't the only country to believe he had WMD's. \n I haven't seen yet anything explicitly stating that all the funds went for pleasurable use. Does even such documentation exist? Or, are you trying to shoe horn such to make it fit nicely with inate beliefs?\n \n \nNot necessarily. Such programs are massively expensive. You need to build the facilities to create the weapons, you need to store them properly, build delivery systems, train soldiers to use them, build networks of transportation, having testing and manitence, it's not that easy. South Africa had a nuke program, and they dismantled it partly because it was grossly expensive. Having the knowledge is quite a far step from being able to do it. Any decent chemistry major in college knows the steps of making a nuke, some of the nerds can recite it on command, they just lack the funds to go forward with it.\n\n LOL. Nope. They're cheap. Chemical weapons were even experimented with by Al Qaeda who had virtually no infrastructure. Saddam already had used them. Once you HAVE a technology known, it's not hard to pick back up. The expenditure has always been in R&D.\n And SA is a misnomer. There were several reasons to dismantle their program. A black gov't taking over would be a decent reason to drop them. And, expense aside, I believe they already had some atomic weapons. The maintenance of simple atomic bomb isn't that substantial. \n You're thinking start up vs maintenance. \n \n \nBut Baghdad is one the largest population centers. You can't ignore it. Besides, even Basra has problems as the Brits found out and Mosul, even as it was peaceful has had numerous terrorist attacks on the Kurds. All is not well outside of Baghdad. \n\n No, not all is well. But, managable in areas outside Baghdad. \n \n \nHence why we didn't do it. Turkey going ape **** is not good for the US. \n\n Hmm...Bushism! \"They screwed us over by not allowing the US to stage the campaign out of their terratory.\" \n Plus, screwing Turkey over and making them mad is a cheap price to make Iran mad too. Plus, if we can disrupt an entire region and maintain some distance, good in a Jerry Springer sort of way. You know, where you look good by putting the other guy down. \n \n [quote]Hey, that's what the Europeans thought when they made this mess at the end of WWII.[.quote] \n I know. Seemed to work well at the moment. And when you're focusing on local elections, looking good now is worth more than your descendents possibly getting screwed over by people smart enough to realize that's what happened to them.\n \n \nTrue, but Afghanistan is much better region for that. There we can utilize airpower to its full extent without fear of killing huge amounts of civilians. Iraq essentially handicapped much of the advantages the US enjoys over its enemies. Only a idiot fights a war on two fronts. We're better off focusing our power on to one battlefield rather then splitting them off. Besides, Iraq was not what Bush made it out to be. It's more of a terrorist haven now then it was before the invasion. Counterproductive.\n\n I'd agree. Fighting a multi front war is always bad. Even if you're vastly more advanced than you assume your opponents to be.\n My conspiracy theory was Bush hoped to pincer Iran between US and (suddenly) US friendly forces in Iraqn and Afghanistan, then slap Iran from 2 sides. Building such a power base of puppet like govt's in the area to pressure recalcitrant allies, knuckle Syrian if need be...then set up and ingenious way to stealz all da oilz. \n That'd leave only NK. \n I'm liking this conspiracy. It's not hard to say it's supported by Bush's vague and overt comments and a general glance at the map.\n \n \nBush is not his father. And Bush has a history of digging his own grave and then asking Daddy to pull him out of it.\n \n Hey, we all have our own clones to lay blame on. I'd conspire and say it's all caused by Bush Sr. who went through a clone making machine like in the movie Duplicity. \n \n \nThe problem with that is that we are trying to cultivate these people to our side. Bombing them is not going to help there. Not to mention we have troops in those areas as well. WWII was bombing of enemy controlled terrirotry and we are not trying to win hearts and minds. Fire bombing and carpet bombing worked in WWII because those objectives were not on the table.\n \n \n True, if you assume Bush to be sincear in his desires. But, wasn't the initial predictions that their hearts and minds would already be there as they welcomed us with open arms and flowers?\n Going with how many see Bush, it's easy to say one thing and do another.\n \"We Come in Peace\" *shoot to kill, shoot to kill*.\n There's a lot of ways I could spin this. \n I think is was possible even if a little over ambitious to try to win them over but, I supported the WMD cause. When they weren't found it the manner beleived, it was too late to pull out and leave a mess. Another gamble I think was made to clean up the mess without an adequate plan, without listening to others opinions and with both hands tied behind your back and ... you get the picture. \n I'd have simply supported the Kurds as allies and holed up in the south and protect the oil fields...left the rest to sort itself out...and slapped Saddam upside the head for (as white trash would say) making me 'hit' you.\n \n \nBlame Clinton and Bush sr for that. They waged conflicts with minimal US losses.\n\n Those weren't close to the same thing. W conducted a successful ground war to stomp a severly weakened Iraq too with minimal losses. Once the 'mission accomplished' was done, then the XXXX started. \n If all the US had to do was destroy the military (Bush Sr.) or drop some bombs (Clinton) I'm sure America would love it. Wasn't that the focus of the modern mentality for the US military? Quick and Bomby? \n \n \nIt seems like the primary one. The rest can easily be refuted or have fallen through themselves. That one has stood the test since the invasion. It makes a hell of alot of sense compared to the XXXX bush spews and the filth protestors blech.\n\n I do agree that it was an overt stated plan to have a base in Iraq for US troops as Saudi Arabia wanted us out. I think it'd be better than in Afghaistan (near a nuclear power) where, from Iraq, we could exert influence over the oil states, support Israel more directly. Seems centrally located to the area as well as local continents.\n But, in the past ccouple of years, there has been calls to remove the US presence for the area and daily it seems less plausible to have a fixed base there.\n \n I think we should send a lot of peanut butter and crackers. As our enemies eat that, their mouths will gum up. Lack of communications wil prevent them from complaining and having to use your fingers to constantly pry your mouth open will prevent them from having idle hands or operate weapons or make bombs.\n Yep, sitting in the desert eating peanut butter and crackers...feeds them while bringing regional peace.\n emoticon_xgood", 
   {}, 
   246836, 
   null, 
   1168652460.0
  ], 
  [
   246992, 
   null, 
   "obvious_child", 
   "I'd say ALL. But still, you don't need an economy worth mentioning to have weapons.\n\n \n Perhaps, but you do need a economy to have a viable weapons program that doesn't rely upon suicide bombers as the delivery, transporation and operation usages. \n \nMost all who devote to arms production to the exclusion of all else either a) want to maintian power or b) seeking to come into power.\n\n \n Nk is the exception in that their military is a reason for their existance. It's different in that NK justifies its existance and legitmacy on the threat of the West. For that to occur, it requires a large military for defense. Other who use military force do it to suppress primarily internal factions. \n \n \n\n See palaces going up as his people starve and it could be a safe bet that he's doing other things. Particularly when dual use chemicals were still going into Iraq from the likes of Germany. Iraq built them in the past. Had the know how and percursors, it was a decent bet to believe he had made more. Not that costly to do so. The US wasn't the only country to believe he had WMD's.\n\n \n True, but most of the intelligence was based on deliberate lies fed to us by Chalabi, or by informants that no one of expertise got to interrogate. There's little doubt Bush cherry picked information. \n \n \nI haven't seen yet anything explicitly stating that all the funds went for pleasurable use. Does even such documentation exist? Or, are you trying to shoe horn such to make it fit nicely with inate beliefs?\n\n \n I'm not saying he didn't. But given how we haven't found the fundemental basic logistics of a weapons program and given how other dicators have built up foreign bank accounts for possible exile abroad, he may have not. I'm just looking at what we found and what other dicators have done in the past. We cannot assume he did or did not based on what we want to think. We have to consider what was found and follow the money. \n \n \n;OL. Nope. They're cheap. Chemical weapons were even experimented with by Al Qaeda who had virtually no infrastructure. Saddam already had used them. Once you HAVE a technology known, it's not hard to pick back up. The expenditure has always been in R&D.\n\n \n If you're using suicide bombers as the weapon system yes. However, that is highly unlikely in Iraq's case. Chemical weapons were experimented by terrorists organizations, but on a small scale with sucide bombers as the delivery system. Iraq is nothing of the sort. A weapons program of their previous size had delivery systems, production facilities, storage, soldiers with training, and transportation networks. Terrorist chemical weapons are small scale. Saddam's history was not. As we have yet to find any of the logisitscs for a weapons program, it seems he didn't have one. \n \n \nAnd SA is a misnomer. There were several reasons to dismantle their program. A black gov't taking over would be a decent reason to drop them.\n\n \n I didn't say it was the reason. \n \n \nAnd, expense aside, I believe they already had some atomic weapons. The maintenance of simple atomic bomb isn't that substantial. \n You're thinking start up vs maintenance. \n\n \n Nonethless, one would have to find the funds to build such facilities as well as maintain delivery systems, keep training up, and transporation as well. None of that comes cheap, especially for a poor nation. \n \n \nNo, not all is well. But, managable in areas outside Baghdad. \n\n \n Perhaps. Depends who you ask.\n \n \nPlus, if we can disrupt an entire region and maintain some distance, good in a Jerry Springer sort of way. You know, where you look good by putting the other guy down.\n\n \n I hope you're joking. \n \n \nI'd agree. Fighting a multi front war is always bad. Even if you're vastly more advanced than you assume your opponents to be.\n\n \n \"Only a idiot fights a war on 2 fronts, much less 18.\" - Babylon 5\n \n \nMy conspiracy theory was Bush hoped to pincer Iran between US and (suddenly) US friendly forces in Iraqn and Afghanistan, then slap Iran from 2 sides. Building such a power base of puppet like govt's in the area to pressure recalcitrant allies, knuckle Syrian if need be...then set up and ingenious way to stealz all da oilz.\n\n \n If only Bush wasn't incompetent....\n \n if bush said the reason we're invading is to break OPEC, i'd totally be in on it. \n \n \nTrue, if you assume Bush to be sincear in his desires. But, wasn't the initial predictions that their hearts and minds would already be there as they welcomed us with open arms and flowers?\n\n \n Why didn't someone upstairs cry debacle before we even invaded? \n \n \n ... you get the picture.\n\n \n Pride comes before a fall. I pains me that this lesson is never learned by anyone in power. \n \n \nI'd have simply supported the Kurds as allies and holed up in the south and protect the oil fields...left the rest to sort itself out...and slapped Saddam upside the head for (as white trash would say) making me 'hit' you.\n\n \n Well...containtment was working. So just shrinking the area of contaiment....not a bad idea. \n \n \nThose weren't close to the same thing. W conducted a successful ground war to stomp a severly weakened Iraq too with minimal losses. Once the 'mission accomplished' was done, then the XXXX started.\n\n \n Which was done because of poor planning which seems to permeate everything the White does. \n \n \nIf all the US had to do was destroy the military (Bush Sr.) or drop some bombs (Clinton) I'm sure America would love it. Wasn't that the focus of the modern mentality for the US military? Quick and Bomby?\n\n \n Basically. Smash and grab really. In and out with the least amount of losses. Americans have gotten fat and lazy in accepting low losses. \n \n \nI do agree that it was an overt stated plan to have a base in Iraq for US troops as Saudi Arabia wanted us out. I think it'd be better than in Afghaistan (near a nuclear power) where, from Iraq, we could exert influence over the oil states, support Israel more directly. Seems centrally located to the area as well as local continents.\n\n \n Iraq as a geographical location is almost perfect. Central to the area, lots of open land, a deep water port, airfields, the one bad thing is that it is subject to Iran and its potential control over the straight of hormuz. Other then that Iraq is perfect. I can see the US being kicked out of Kuwait within 10 years. Turkey won't let us use their airspace for sorties. We're almost entirely out of Saudi Arabia except for training. We're frankly running out of space. Iraq made sense. \n \n \nBut, in the past ccouple of years, there has been calls to remove the US presence for the area and daily it seems less plausible to have a fixed base there.\n\n \n Of course. Reality sets in and ruins the Bush's adminstrations's best laid plans. \n \n \nYep, sitting in the desert eating peanut butter and crackers...feeds them while bringing regional peace.\n emoticon_xgood\n\n \n I'd rather launch a war of materialistic corruption.", 
   {}, 
   246987, 
   null, 
   1168654260.0
  ], 
  [
   246998, 
   null, 
   "Zardoz", 
   "Perhaps, but you do need a economy to have a viable weapons program that doesn't rely upon suicide bombers as the delivery, transporation and operation usages. \n\n Once you get to 2nd world stature (Iraq was) even a devestated economy can chug out items of substance. \n \n \nNk is the exception in that their military is a reason for their existance. It's different in that NK justifies its existance and legitmacy on the threat of the West. For that to occur, it requires a large military for defense. Other who use military force do it to suppress primarily internal factions.\n\n Justify's to who? Most inside the country are ignorant of the outside world. They live in as much repression as possible. \n \n \nTrue, but most of the intelligence was based on deliberate lies fed to us by Chalabi, or by informants that no one of expertise got to interrogate. There's little doubt Bush cherry picked information. \n\n He wasn't the only source. Old UN reports, even Canada I found had believed this. All he did was put a stamp of approval on what was believed. For what ever reasons the actual truth wasn't made known and after a long time, had it been made so, it's doubtful anyone would believe it.\n \n \nI'm not saying he didn't. But given how we haven't found the fundemental basic logistics of a weapons program and given how other dicators have built up foreign bank accounts for possible exile abroad, he may have not. I'm just looking at what we found and what other dicators have done in the past. We cannot assume he did or did not based on what we want to think. We have to consider what was found and follow the money.\nAcceptable. He also did have sons he appeared to be grooming for succession. Either case is possible, build a strong Iraq for them, stash funds away if it fell through.\n \n \nIf you're using suicide bombers as the weapon system yes. However, that is highly unlikely in Iraq's case. Chemical weapons were experimented by terrorists organizations, but on a small scale with sucide bombers as the delivery system. Iraq is nothing of the sort. A weapons program of their previous size had delivery systems, production facilities, storage, soldiers with training, and transportation networks. Terrorist chemical weapons are small scale. Saddam's history was not. As we have yet to find any of the logisitscs for a weapons program, it seems he didn't have one.\n\n I can't recall if the Japanese subway gas attack was suicide in nature or not. You don't need suicide bombers for them if other options exist. Time bombs, IUD's artillery shells, the IRA made their own mortars IIRC, those are cheap delivery systems. \n \n \nI didn't say it was the reason.\n\n You said it was financial, which really wasn't the stated reason by SA from what I heard. \n I'd agree that Lyberia may have had this as a practical reason since their program wen't no where and from what was seen at the time, the writing was on the wall that terror/rogue nations wouldn't be tolerated any longer.\n \n \nNonethless, one would have to find the funds to build such facilities as well as maintain delivery systems, keep training up, and transporation as well. None of that comes cheap, especially for a poor nation. \n\n Once you have it, it's there. You can store some things also with little maintenance. A lot of this is low tech by western standards. WWI and II level. The cost for those determined.\n Atom bomb...even a kid can build one...don't a kid build one for a science project? You can put the bomb on a shelf. Pull it out when needed. Wait too long or screw it up and it's XXXX but it's not an advanced nuclear weapon. The uranium/ plutonium making is the more difficult part.\n I know I'm being simplistic but it really isn't that complicated.\n \n \nI hope you're joking. \n\n Ghetto mentality. Surprisingly it's what the majority of humanity does. \n For example. 'You're Fat!' Response, \"Yeah, well, you're stupid.\" And destabalizing opponents and potential opponents IS very common. Why didn't the Kurds (past allies) for example get their own country after WWI during the dividing? To keep them disaffected and thorn in several nations sides? \n \n \n\"Only a idiot fights a war on 2 fronts, much less 18.\" - Babylon 5\n\n While I think it was close to accurate and made Bush look like he had big cahunas, calling the 'axis of evil' out was premature. \n \n \nIf only Bush wasn't incompetent....\n \n if bush said the reason we're invading is to break OPEC, i'd totally be in on it.\n\n But, not many others would be. \n \n \nWhy didn't someone upstairs cry debacle before we even invaded?\n\n Why? America Pwns! The Iraqi's were oppressed by a tyrant. The only ones crying foul were exteme lefties. They ALWAYS cry wolf. Anyone in Bush's counsel could have been replaced or sent to the gulag if they nay-sayed Bush. Who knows. Iraq crumbled fast the 1st time. Did so the 2nd. No one thought too much about the aftermath.\n \n \nWell...containtment was working. So just shrinking the area of contaiment....not a bad idea. \n\n But, we'd look obviously evil...sitting on the oilz, allowing poor Iraqis to kill each other miles away from our intervention. Wouldn't give Bush any form of moral stance to later wag his finger at the likes of the Sudan (not that he does anything).\n \n \nWhich was done because of poor planning which seems to permeate everything the White does. \n\n Well, we did sit out a long time in past wars and got somewhat of a picture of what was going on before going in. Iraq2 seemed a little pressed/pushed for time. A Custer charge. Works well for many types of things but, man, don't get caught out.\n \n \nBasically. Smash and grab really. In and out with the least amount of losses. Americans have gotten fat and lazy in accepting low losses. \n\n I think fatter and lazier would be more accurate. We really don't like casualties at all. Mostly so without over whelming support of a clear plan that's showing progress. Progress is important. ADHD and all that America sufferes from. We get frustraited too quickly as a people with lack of progress, stagnation and loss.\n \n \nIraq as a geographical location is almost perfect. Central to the area, lots of open land, a deep water port, airfields, the one bad thing is that it is subject to Iran and its potential control over the straight of hormuz. Other then that Iraq is perfect. I can see the US being kicked out of Kuwait within 10 years. Turkey won't let us use their airspace for sorties. We're almost entirely out of Saudi Arabia except for training. We're frankly running out of space. Iraq made sense. \n\n Yep. totally agree. But, it's not the sole reason. \n I feel it's like dealing with my wife. She always wants one reason for something. Like why I took her last name when we married, why I married her, why I do anything. Where as I take the kill multiple birds with one stone approach and seldom have a single reason for something.\n \n \nOf course. Reality sets in and ruins the Bush's adminstrations's best laid plans. \n \n I'd rather launch a war of materialistic corruption.\n\n \n Best laid plans of anyone go arwy more often than not.\n \n As fro material gain.\n I'd rather be an imperialistic nation and just admit it. Then admit it that we won't always be top dog. Steal everyone elses resources through hook and crook and conserve our own. Annex most of North America. Then, when the world is messed up and we're on the decline, nuke everyone else to a reasonably lesser level than we'd be resigned to and...\n \n Oh, sorry, that's too Jerry Springer. emoticon_xangel", 
   {}, 
   246992, 
   null, 
   1168659360.0
  ], 
  [
   247047, 
   null, 
   "obvious_child", 
   "Once you get to 2nd world stature (Iraq was) even a devestated economy can chug out items of substance.\n\n \n Iraq's economy was in the toliet. Sure anyone can produce chemical weapons, but you need a economy to actually produce sufficent quantity and quality as well as funding for other logistics to maintain a viable, weaponized system. \n \n \nJustify's to who? Most inside the country are ignorant of the outside world. They live in as much repression as possible.\n\n \n NK's people aren't actively trying to toss out the gov't. This issue alone can fill several threads. Therefore it make it simple, NK = Exception. \n \n [qupte]He wasn't the only source. Old UN reports, even Canada I found had believed this. All he did was put a stamp of approval on what was believed. For what ever reasons the actual truth wasn't made known and after a long time, had it been made so, it's doubtful anyone would believe it.[/quote]\n \n Chalabi's been feeding us lies for years prior to the invasion remember? Furthermore, Curveball was one of the primary sources of information for Bush's WMD rational and not a single US expert got to interview him. \n \n \nEither case is possible, build a strong Iraq for them, stash funds away if it fell through.\n\n \n IMO, he just hid the money in some off shore caman or swiss account for a future possible need to get away. Wouldn't be the first of many dictators to skim state funds and do just that. \n \n \nI can't recall if the Japanese subway gas attack was suicide in nature or not. You don't need suicide bombers for them if other options exist.\n\n \n It wasn't. The sarin balloons were punctured right before the carriers got off the trains allowing them escape unharmed. \n \n \nTime bombs, IUD's artillery shells, the IRA made their own mortars IIRC, those are cheap delivery systems.\n\n \n For what kind of chemical and how effective did they work? Artillery shells except for Vx require saturation (just as they did with the Germans.) That requires a huge amount of product as well as a packaging plant to fill such shells. The other two are more small scale uses, not in line with Saddam's grandiose dreams. \n \n \nI'd agree that Lyberia may have had this as a practical reason since their program wen't no where and from what was seen at the time, the writing was on the wall that terror/rogue nations wouldn't be tolerated any longer.\n\n \n Libya ditched its program, it tried to get rid of it in the later portion of the 90s voluntarily comming to the US and the Uk in what looks like a attempt to remove the sanctions during the rise of price of hydrocarbons. When your economy is based on fossil and you can't sell it and when prices are going nowhwere but up...quiaddi isn't a idiot. \n \n \nOnce you have it, it's there. You can store some things also with little maintenance. A lot of this is low tech by western standards. WWI and II level. The cost for those determined.\n\n \n Perhaps but we still did not find a the necessary means for usage, production, storage and transporation. Even if he had the sufficent funds, the logistics for the programs just didn't exist. Furthermore, making the stuff is messy and dangerous. We would have heard or seen some instances of accidents. \n \n \nAtom bomb...even a kid can build one...don't a kid build one for a science project? You can put the bomb on a shelf. Pull it out when needed. Wait too long or screw it up and it's XXXX but it's not an advanced nuclear weapon. The uranium/ plutonium making is the more difficult part.\n I know I'm being simplistic but it really isn't that complicated.\n\n \n Enriching the Uranium is beyond the capabilities for virtually every chem student. Uranium Hexafloride is not something kids have the ability to produce. \n \n \nBut, we'd look obviously evil...sitting on the oilz, allowing poor Iraqis to kill each other miles away from our intervention. Wouldn't give Bush any form of moral stance to later wag his finger at the likes of the Sudan (not that he does anything).\n\n \n Depends how they spent the money and who spent the money. \n \n \nWell, we did sit out a long time in past wars and got somewhat of a picture of what was going on before going in. Iraq2 seemed a little pressed/pushed for time. A Custer charge. Works well for many types of things but, man, don't get caught out.\n\n \n We had supply lines being regularly hit by infantry. That is embarrassing, especially for the US. \n \n \n We get frustraited too quickly as a people with lack of progress, stagnation and loss.\n\n \n Welcome to the 1st world.", 
   {}, 
   246998, 
   null, 
   1168717620.0
  ], 
  [
   247398, 
   null, 
   "Zardoz", 
   "The concern wasn't really Saddam's use ot the WMD's but his handing small amounts to terror groups. That's what was sold to get war support.\n \n As for nukes, you don't have to make the uranium/ plutonium yourself. \n \n More terror oriented or small scale use than for prolonged conflict. That was the scare. \n Now, NK and Iran have materials in unknown quantities. We stil don't know where that anthrax came from and many looking for small quantities (scare is just as useful as harm) less effective versions of toxins are just as effective.\n Most people are ignorant and would have the standard knee jerk reaction to something set off in public, even if it failed, they'd be fears that 'next time' it could be worse.", 
   {}, 
   247047, 
   null, 
   1168926480.0
  ], 
  [
   247571, 
   null, 
   "huckleberry", 
   "Loaded comment but, care to elaborate rather than toss out inflammitory remarks? I didn't realize that George Bush was '3,000 people' or the entirity of those involved in the trial issue.\n \n \n So, you think Saddam looked heroic? I know I don't...didn't. Of course, he did show some balls by not crying or wussing out. But, I'd doubt he'd ever behave in such a manner. I'm sure he had a lot of time to come to terms with his situation and accept it.\n \n He's only a martyr to those who want him to be. Liberals, democrats, his followers...\n \n \n This is a little like the 1st comment. I'm hard pressed to see 'bungling'. Maybe expecting Shiite's to show some decorum in the execution and not video tape it and throw out jeers...\n But, I guess we can think that many victims of executed criminals weren't a little glad when just deserts were done. I can recall some stories of Jews dancing a jig when a nazi guard was strung up. \n \n Saddam was found guilty of his least crime and hung for it. Why waste time trying him for more crimes when the same punishment would happen? They can only hang him once. Why prolong the venture with more 'show-boat' trials? I'm sure if he were tried over, and over, and over, you'd complain about that too. Remember, they aren't Americans. Don;t have American trials nor willingness to put up with redundant XXXX that waste time and money.\n Personally, I think it could have been embarrasing had Saddam been tried on other charges and found not guilty on one or more (highly doubtful).\n\n \n So far, of all the posts here, this all seems to make the most sense. The question is a bit loaded and biased to begin with. But the answers are reasonable. I would agree with Zardoz on this. More trials would have only been a waste of time and money. You can only kill a man once. \n \n I do not see that George Bush is responsible for the Iraqi actions during the hanging. One could say that it would have not been so if we had never entered Iraq but that would only be because it would be highly unlikely that this murderous cretin would have been deposed. Even the initial poster on this board said that he deserved to have his worst crimes seen so there is no doubting the existence of his crimes.\n \n Bush has made some mistakes but the response from 9/11 needed to be very strong to send a signal to those countries harboring such terrorists. If it was mamby pamby like blowing up an aspirin factory with nothing more then we would be seen as weak and irrelevant. \n \n We are in danger of that fate even now if we turn our continued response to milk toast. Withdraw is simply not a functional option. I am not certain what is but then, I am not in the middle of it. \n \n Good post Zardoz.", 
   {}, 
   246126, 
   null, 
   1169070540.0
  ], 
  [
   248705, 
   null, 
   "Adygeya", 
   "get this one", 
   {
    "post_info": {
     "post_title": "they want post count"
    }
   }, 
   247571, 
   null, 
   1170004920.0
  ], 
  [
   248936, 
   null, 
   "huckleberry", 
   "get this one\n\n \n \n ????????????????????????????", 
   {}, 
   248705, 
   null, 
   1170187620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How Many People . . .", 
  "url": "http://www.4forums.com/political/politics-debates/9396-how-many-people.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9396, 
  "discussion_files": [
   [
    "3264.html", 
    "http://www.4forums.com/political/politics-debates/9396-how-many-people-print.html"
   ], 
   [
    "3265.html", 
    "http://www.4forums.com/political/politics-debates/9396-how-many-people-3-print.html"
   ], 
   [
    "3266.html", 
    "http://www.4forums.com/political/politics-debates/9396-how-many-people-2-print.html"
   ]
  ], 
  "identifier": 9396
 }
]