[
 [
  [
   245717, 
   null, 
   "supersport", 
   "\"Don't put all your eggs in one basket\" \n \n I don't know who said it first, but whoever did is a genius because, indeed, life often has a way of pulling the rug right out from under you, causing all those little eggs to fall on the floor and break.\n \n \n But see, our little darwinist friends have done exactly that: they've taken all their little eggs and they've piled them up REAL HIGH in one big, gigantic basket of XXXX nonsense.\n \n So what's been piled up in the basket of nonsense???????\n \n It's their misguided notion that variation arises randomly and our genes/DNA define us. \n \n Their basic dogma is that genes control life. Not only that but they've created this huge fairytale that, because variation must arise accidentally, genes mutate and express themselves differently for no reason....which means there is no way that the environment can have a beneficial effect on genetic activity.......And that's because they believe our DNA controls us like cheap wooden puppets on strings. This, I submit, will go down as one of the stupidest, most fraudulent premises of all time. Instead of being victims of our genes -- or that our genes control our biology -- I suggest we are all masters of our own fates...products of our local environments...and that our genes control nothing because they are merely tools that are under the influence of the body.\n \n This means that cancer does not have a genetic cause...neither does depression, Adhd, diabetes, or any other disease. Also that means that any and every little nugget of Neo-dawinism is 100% FALSE....all of which I will back up here:\n \n Anyone who's interested in REAL biology needs to pick a book called The Biology of Belief from Bruce Lipton, Phd.\n \n This dude tells it like it is -- and despite being hated by the scientific community, he shatters ToE by dispelling the myth that genes are in control of anything. He says, \"it's the environment, stupid.\" \n \n Instead of genes, Lipton says it's the membrane of the cell who is the real hero -- it's the membrane that senses the local enviornment and reacts accordingly. He shows how genes, in fact, are not our destiny....that enviornmental influences -- including stress, nutrition and emotions can modify genes. Not only that but these modifications can be passed on to future generations. And what's even worse, genes are not even needed for cell functionality! Read on....\n \n \n To get started, let's see how he equates the individual cell to the human body:\n \n \n \"I taught my students that the biochemical mechanisms employed by cellular organelle systems are essentially the same mechanisms employed by our human organ systems. Even though humans are made up of trillions of cells, I stressed that there is not one new function in our bodies that is not already expressed in the single cell.\"\n \n \"Each eukaryote (nucleus-containing cell) possesses the functional equivalent of our nervous sytem, digestive system, respiratory system, excretory system, digestive system, respiratory systems, circulatory system, integument (skin) reproductive system and even a primitive immune system, which utilizes a family of anitbody-like proteins.\" Pg. 37\n \n \"I also made it clear to my students that each cell is an intelligent being that can survive on its own, as scientists demonstrate when they remove individual cells from the body and grow them in a culture.....these cells are imbued with intent and purpose; they actively seek environments that support their survival while simultaneously avoiding toxic or hostile ones. Like humans, single cells analyze thousands of stimuli from the microenvironment they inhabit. Throug the analysis of this data, cells select appropriate behavioral responses to ensure their survival.\"\n \n \"For example, when a measles virus infects a child, an immature immune cell is called in to create a protective protein antibody against that virus. In the process, the cell must create a new gene to serve as a blueprint in manufacturing the measles antibody protein.\" Pg. 38\n \n \"....The new antibody gene can also be passed on to all the cell's progeny when it divides. In this process, not only did the cell \"learn\" about the measles virus, it also created a \"memory\" that will be inherited and propagated by its daughter cells. This amazing feat of genetic engineering is profoundly important because it represents an inherent \"intelligence\" mechanism by which cells evolve.\" Pg. 39\n \n Next, Dr. Lipton destroys any notion that our genes control us:\n \n \".....the media repeatedly distort the meaning of two words: correlation and causation. It's one thing to be linked to a disease; it's quite another to cause a disease, which implies a directing, controlling action. If I show you my keys and say that a particular key \"controls\" my car, you at first might think that makes sense because you know you need that key to turn on the ignition. But does the key actually \"control\" the car? If it did, you couldn't leave the key in the car alone because it might just borrow your car for a joy ride when you are not paying attention. In truth, the key is \"correlated\" with the control of the car; but the person who actually turns the key actually controls the car. Specific genes are correlated with an organism's behavior and characteristics. But these genes are not activated until something triggers them.\" (Death spike for ToE right there)\n \n So what activates genes?\n \n When a gene product is needed, a signal from its environment, not an emergent property of the gene itself, activates experession of that gene. In otherwords, it's the environment, stupid.\" Pg/ 52\n \n Finally, Dr Lipton has the nerve to conclude that the nucleus of the cell is not in controll of the cell's processes....instead, it's the MEMBRANE:\n \n \n \"The notion that the nucleus and its genes are the \"brain\" of the cell is an untenable and illogical hypothesis. If the brain is removed from an animal, disruption of physiologic integration would immediately lead to the organism's death. If the nucleus truly represented the brain of the cell, then removal of the nucleus would result in the cessation of cell functions and immediate cell death. However, experimentally enucleated cells may survive for two or more months without genes, and yet are capable of effecting complex responses to environmental and cytoplasmic stimuli (Lipton, et al., Differentiation 1991, 46:117-133). Logic reveals that the nucleus can not be the brain of the cell!\" Pg. 65\n \n \n \"On the contrary, if one removes the membrane of the cell, the cell quickly dies as if the brain had been removed....and this happens because the cell no longer receives environmental signals necessary for operation....which is necessary for \"intelligent\" behavior.\"\n \n \"Following enucleation, cells can survive for up to two or more months without genes. Viable enucleated cells do not lie about like brain-dead lumps of cytoplasm on life-support systems. These cells actively ingest and metabolize food, maintain coordinated operation of their physiologic systems (respiration, digestion, excretion, morility, etc) retain an ability to communicate with other cells, and are able to engage in appropriate responses to growth and protection-requiring environmental stimuli.\" Pg. 66\n \n So there its. Genes are not our destiny. They are under strict control of the cell...and what's worse for the darwinist and his theory -- they are NOT EVEN NEEDED for cell function! So the next time an evolutionist says \"it's in the genes\" when it comes to traits or behavior or instinct -- just tell them to take a long walk on a short plank.\n \n So much for silly notion that genetic determinism, which has been erroneously forced down our throats by the community of quacks in the scientific world for the past 50 years.\n \n \n So Check out Dr. Lipton's book...it's awesome....it combines the worlds of evolution (including biology, genes, cells, etc), spirituality, and health/diseases. He basicallly says that most of the billions of dollars pumped in to bio-tech is wasted because fixing genes will never fix the physical cause of disease. (RIGHT ON, Brother!).....and that the cause of most disease is environmentally-related, not genetically related. Cells are just the result of their surrounding environments: Crummy environment...crummy cells.... Healthy environment...healthy cells. \n \n http://www.brucelipton.com/", 
   {
    "post_info": {
     "post_title": "ToE: The Biggest Fraud of all-time"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1167867120.0
  ], 
  [
   245718, 
   null, 
   "Mucusaur", 
   "Biggest fraud of all time! Well I am glad I am in on the ground floor on this one. Well, guess we still have all that geological evidence for an old earth.", 
   {}, 
   245717, 
   null, 
   1167867420.0
  ], 
  [
   245723, 
   null, 
   "Sigma", 
   "\n Their basic dogma is that genes control life.\n\n \n Evolution does not necessitate this.", 
   {}, 
   245717, 
   null, 
   1167868800.0
  ], 
  [
   245726, 
   null, 
   "supersport", 
   "Evolution does not necessitate this.\n\n \n ok...if genetic activity does not control life, then what does....? What controls traits? What causes disease? How did evolution occur?", 
   {}, 
   245723, 
   null, 
   1167869340.0
  ], 
  [
   245729, 
   null, 
   "sinjin", 
   "Are you sure you want to hitch your wagon to a New Age Buddhist? So I resemble my father because we live in the same town or because I imagine I want to or should? I'm confused.:xbanghead", 
   {}, 
   245726, 
   null, 
   1167869760.0
  ], 
  [
   245732, 
   null, 
   "Sigma", 
   "ok...if genetic activity does not control life, then what does....? What controls traits?\n\n \n Are you asking what determines our actions, behavior and personality? You seem to think ToE says that genes determine all of those things.", 
   {}, 
   245726, 
   null, 
   1167870060.0
  ], 
  [
   245734, 
   null, 
   "supersport", 
   "Are you sure you want to hitch your wagon to a New Age Buddhist? So I resemble my father because we live in the same town or because I imagine I want to or should? I'm confused.:xbanghead\n\n \n I did not come on here to talk about Dr. Lipton's spiritual beliefs. My OP is about how evolutionists have developed a whole theory based on the fraudulent premise that genes control everything. How many times have you head \"it's in the genes\"? But how can genes control anything if they don't even control the cell they reside in?", 
   {}, 
   245729, 
   null, 
   1167870060.0
  ], 
  [
   245736, 
   null, 
   "ShadowPikachu", 
   "I did not come on here to talk about Dr. Lipton's spiritual beliefs. My OP is about how evolutionists have developed a whole theory based on the fraudulent premise that genes control everything. How many times have you head \"it's in the genes\"? But how can genes control anything if they don't even control the cell they reside in?\n\n Ah, but it IS necessary to discuss his beliefs because they are behind his reasons to write it.", 
   {}, 
   245734, 
   null, 
   1167870480.0
  ], 
  [
   245738, 
   null, 
   "sinjin", 
   "I did not come on here to talk about Dr. Lipton's spiritual beliefs. My OP is about how evolutionists have developed a whole theory based on the fraudulent premise that genes control everything. How many times have you head \"it's in the genes\"? But how can genes control anything if they don't even control the cell they reside in?\nYou don't believe in inherited traits?", 
   {}, 
   245734, 
   null, 
   1167870660.0
  ], 
  [
   245756, 
   null, 
   "supersport", 
   "You don't believe in inherited traits?\n\n \n yes but that does not mean that genes are in control of these traits. Remember the \"car key\" analogy? Don't get confused with correlation and causation. Genes are just tools that the body uses. They are correlated with traits but they themselves are not the cause. And like I said, if genes aren't even in control of the cell in which they reside, how could they be in control of anything else in the body?", 
   {}, 
   245738, 
   null, 
   1167873360.0
  ], 
  [
   245759, 
   null, 
   "sinjin", 
   "yes but that does not mean that genes are in control of these traits. Remember the \"car key\" analogy? Don't get confused with correlation and causation. Genes are just tools that the body uses. They are correlated with traits but they themselves are not the cause. And like I said, if genes aren't even in control of the cell in which they reside, how could they be in control of anything else in the body?\nSo what do you believe is the mechanism passing traits from one generation to the next?", 
   {}, 
   245756, 
   null, 
   1167873900.0
  ], 
  [
   245760, 
   null, 
   "supersport", 
   "So what do you believe is the mechanism passing traits from one generation to the next?\n\n \n It's called the miracle of life, brotha! Life is non-scientific and no mechanism can be ascribed to it. You may be able to watch new traits form or emerge in offspring, but how it happens will always remain a mystery...just like mystery of life itself.", 
   {}, 
   245759, 
   null, 
   1167874020.0
  ], 
  [
   245761, 
   null, 
   "pandion", 
   "How many times have you head [sic] \"it's in the genes\"?\nCounting this time? Once.", 
   {}, 
   245734, 
   null, 
   1167874260.0
  ], 
  [
   245764, 
   null, 
   "sinjin", 
   "It's called the miracle of life, brotha! Life is non-scientific and no mechanism can be ascribed to it. You may be able to watch new traits form or emerge in offspring, but how it happens will always remain a mystery...just like mystery of life itself.\nI'm fairly certain that no miracle is involved with the fact that my eye color is exactly the same as my father's.", 
   {}, 
   245760, 
   null, 
   1167874860.0
  ], 
  [
   245767, 
   null, 
   "Mucusaur", 
   "I fairly certain that no miracle is involved with the fact that my eye color is exactly the same as my father's.\n\n \n Presumably the result of demonic interference. The devil hates change", 
   {}, 
   245764, 
   null, 
   1167875460.0
  ], 
  [
   245790, 
   null, 
   "supersport", 
   "I'm fairly certain that no miracle is involved with the fact that my eye color is exactly the same as my father's.\n\n \n Maybe so...but let's change it up. How do you explain that butterflys emerge with different traits according to which season/which environment they are born in? what is that mechanism?...the people who did the study don't evidently know.\n \n http://www.arachnology.org/monteiro/Press/2002_TREE_story/The_Hindu/2002040400080400.htm", 
   {}, 
   245764, 
   null, 
   1167884220.0
  ], 
  [
   245797, 
   null, 
   "Hi_Its_Me", 
   "Going back to the OP:\n \nTheir basic dogma is that genes control life. Not only that but they've created this huge fairytale that, because variation must arise accidentally, genes mutate and express themselves differently for no reason....\n\n Genes mutate during copying if all proofreading mechanisms fail. Genes are expressed differently based on the environment and/or other genes.\n \nwhich means there is no way that the environment can have a beneficial effect on genetic activity.......\n\n Having read your post, I was convinced that you argued against the existence of genetic \"activity,\" but I could be wrong...\n \nAnd that's because they believe our DNA controls us like cheap wooden puppets on strings.\n\n More like, genes act as a blueprint to create a nervous system and brain which do the actual controlling.\n \n-- or that our genes control our biology -- I suggest we are all masters of our own fates...\n\n How are those two contradictory? The genes create the brain, which then controls the body (and, up to a point, the fate of the organism).\n \nproducts of our local environments...\n\n That has nothing to do with the previous two. Also, \"local\" should probably be removed as people seem to be able to get away from \"local\" quickly.\n \nand that our genes control nothing because they are merely tools that are under the influence of the body.\n\n So influence your genes to break apart.\n If successful, this would show that genes are required for growth and day-to-day functions.\n If unsuccessful, this will show that you need to reword that statement.\n \nThis means that cancer does not have a genetic cause...neither does depression, Adhd, diabetes, or any other disease. Also that means that any and every little nugget of Neo-dawinism is 100% FALSE....all of which I will back up here:\n\n Try putting your arguments in order, meaning that evidence comes before the conclusion. It makes more sense, and it makes the argument more convincing (which you appear to need around here).\n \nAnyone who's interested in REAL biology needs to pick a book called The Biology of Belief from Bruce Lipton, Phd.\n\n I would say that real biologists should define real biology. You, sadly, do not qualify.\n \nThis dude tells it like it is -- and despite being hated by the scientific community, he shatters ToE by dispelling the myth that genes are in control of anything. He says, \"it's the environment, stupid.\"\n\n No evidence, no explanation, and an insult to boot. Not at all convincing.\n \nInstead of genes, Lipton says it's the membrane of the cell who is the real hero -- it's the membrane that senses the local enviornment and reacts accordingly.\n\n Consider the structure of the cell membrane: two layers of phospholipids.\n \nHe shows how genes, in fact, are not our destiny....that enviornmental influences -- including stress, nutrition and emotions can modify genes.\n\n Getting back to your alternative ToE? Of course, to do that, you would need to show that these changes explain the changes usually attributed to mutations. For example, can a moth change color due to a new tree color?\n \nNot only that but these modifications can be passed on to future generations.\n\n As long as the genome of the gamete cells (sperm/egg cells) is modified, the modification will be passed on. No huge surprises here.\n \nAnd what's even worse, genes are not even needed for cell functionality!\n\n I would like to see a cell without genes function successfully.\n Also, is producing proteins part of \"cell functionality\"?\n \nRead on....\n \n \n To get started, let's see how he equates the individual cell to the human body:\n\n Wow! Does this mean that I have trillions of human bodies within my body?\n \n\"I taught my students that the biochemical mechanisms employed by cellular organelle systems are essentially the same mechanisms employed by our human organ systems. Even though humans are made up of trillions of cells, I stressed that there is not one new function in our bodies that is not already expressed in the single cell.\"\n\n So individual cells contract to move cytoplasm around and to transport oxygen within itself?\n \n\"Each eukaryote (nucleus-containing cell) possesses the functional equivalent of our nervous sytem, digestive system, respiratory system, excretory system, digestive system, respiratory systems, circulatory system, integument (skin) reproductive system and even a primitive immune system, which utilizes a family of anitbody-like proteins.\" Pg. 37\n\n So... the cells have two equivalents of the digestive system and two of the respiratory system(s)?\n I know that the cell's reproductive system is unlike human reproduction, in that one cell duplicates itself and a person does not.\n \n I would also like to know what either of you consider to be the cell's \"circulatory system.\"\n \n\"I also made it clear to my students that each cell is an intelligent being that can survive on its own, as scientists demonstrate when they remove individual cells from the body and grow them in a culture.....these cells are imbued with intent and purpose; they actively seek environments that support their survival while simultaneously avoiding toxic or hostile ones. Like humans, single cells analyze thousands of stimuli from the microenvironment they inhabit. Throug the analysis of this data, cells select appropriate behavioral responses to ensure their survival.\"\n\n First, a cell lacks formal intelligence and simply responds to stimuli.\n Second, without proper preparations, cell colonies do not survive outside of a body, as demonstrated by scientists' initial difficulty in cultivating living colonies. Only after much difficulty did they succeed in producing living, separate, cells.\n \nNext, Dr. Lipton destroys any notion that our genes control us:\n \n \".....the media repeatedly distort the meaning of two words: correlation and causation. It's one thing to be linked to a disease; it's quite another to cause a disease, which implies a directing, controlling action. If I show you my keys and say that a particular key \"controls\" my car, you at first might think that makes sense because you know you need that key to turn on the ignition. But does the key actually \"control\" the car? If it did, you couldn't leave the key in the car alone because it might just borrow your car for a joy ride when you are not paying attention. In truth, the key is \"correlated\" with the control of the car; but the person who actually turns the key actually controls the car. Specific genes are correlated with an organism's behavior and characteristics. But these genes are not activated until something triggers them.\" \n\n So this means that genes are not related to the traits our body has?\n I didn't think so...\n \n(Death spike for ToE right there)\n\n So, how many times have you said this?\n Also, does it appear to be working?\n \nSo what activates genes?\n \n When a gene product is needed, a signal from its environment, not an emergent property of the gene itself, activates experession of that gene. In otherwords, it's the environment, stupid.\" Pg/ 52\n\n So what you are saying is simply that the genes do not actively control the body.\n What is wrong with assuming that genes therefore do not control the body is the fact that the genes were the blueprint for the body. The genes decided the arrangement of cells, the number of fingers, etc.\n The body, the cells, and the organelles within the cells are therefore strongly influenced by the DNA sequence.\n \nFinally, Dr Lipton has the nerve to conclude that the nucleus of the cell is not in controll of the cell's processes....instead, it's the MEMBRANE:\n\n This I've got to see (and refute, of course).\n \n\"The notion that the nucleus and its genes are the \"brain\" of the cell is an untenable and illogical hypothesis. If the brain is removed from an animal, disruption of physiologic integration would immediately lead to the organism's death. If the nucleus truly represented the brain of the cell, then removal of the nucleus would result in the cessation of cell functions and immediate cell death. However, experimentally enucleated cells may survive for two or more months without genes, and yet are capable of effecting complex responses to environmental and cytoplasmic stimuli (Lipton, et al., Differentiation 1991, 46:117-133). Logic reveals that the nucleus can not be the brain of the cell!\" Pg. 65\n\n That is true, but only because a brain is made of cells and cells do not have cells inside them. However, many cell functions depend on DNA. One such function is the production of proteins.\n I also happen to know of at least one type of animal that can survive without a brain (and no, I'm not making a joke involving you).\n \n\"On the contrary, if one removes the membrane of the cell, the cell quickly dies as if the brain had been removed....and this happens because the cell no longer receives environmental signals necessary for operation....which is necessary for \"intelligent\" behavior.\"\n\n More accurately, the cell dies because nothing separates it from its environment, and removing the membrane of a cell is akin to removing an insect's exoskeleton. Everything falls out.\n \n\"Following enucleation, cells can survive for up to two or more months without genes. Viable enucleated cells do not lie about like brain-dead lumps of cytoplasm on life-support systems. These cells actively ingest and metabolize food, maintain coordinated operation of their physiologic systems (respiration, digestion, excretion, morility, etc) retain an ability to communicate with other cells, and are able to engage in appropriate responses to growth and protection-requiring environmental stimuli.\" Pg. 66\n \n So there its. Genes are not our destiny. They are under strict control of the cell...and what's worse for the darwinist and his theory -- they are NOT EVEN NEEDED for cell function!\n\n Except that proteins are essential, and DNA is required for proteins. Cells that already have proteins can survive on that, but a few proteins won't do much to help all the cells in one body- the cells need to manufacture their own.\n \nSo the next time an evolutionist says \"it's in the genes\" when it comes to traits or behavior or instinct -- just tell them to take a long walk on a short plank.\n\n That is interesting advice, and I will work hard not to take it.\n \nSo much for silly notion that genetic determinism, which has been erroneously forced down our throats by the community of quacks in the scientific world for the past 50 years.\n\n Which has been debunked by someone who doesn't know what he's talking about?\n \nSo Check out Dr. Lipton's book...it's awesome....\n\n Not in terms of accuracy.\n \nit combines the worlds of evolution (including biology, genes, cells, etc), spirituality, and health/diseases. He basicallly says that most of the billions of dollars pumped in to bio-tech is wasted because fixing genes will never fix the physical cause of disease. (RIGHT ON, Brother!).....\n\n But it will stop the disease from being passed on to offspring... Or is that unimportant?", 
   {
    "unicode_changes_made": true
   }, 
   245717, 
   null, 
   1167890340.0
  ], 
  [
   245829, 
   null, 
   "Peeling", 
   "Supersport, you frequently talk about the ToE in terms of it being a conspiracy, yet you never supply a motive. Why would the vast, overwhelming majority of biological scientists, from many cultures, many countries, many backgrounds, working for different and often competing academic and commercial entities, all dedicate their lives and reputations to knowingly taking a falsehood and 'forcing it down the throat' of the masses, most of whom couldn't give a wet slap one way or the other?\n \n On the other hand, I've yet to encounter a proponent of ID who doesn't have a non-scientific, religious agenda behind their actions.\n \n Above the panel where I'm typing right now, there are several paid Goodle ads linking to creationist websites. Follow those links and you will find page after page of long-since-debunked objections to the ToE presented as if they were fresh and current (What use is half an eye? etc). You will find blatant quote-mines from Darwin saying that the evolution of the eye 'defeats the imagination', omitting his subsequent explanation of why it need not. You'll find po-faced 'scientists' saying that we've never observed a missing link - a statement whose profundity rates slightly below 'Everything you lose is always found in the last place you look' And running through them all: the bible and Jesus, Jesus and the bible. The alleged 'ultimate truths' marinading in a soup of distortion and outright lies.\n \n To me, that looks one hell of a lot more like a conspiracy.", 
   {}, 
   245797, 
   null, 
   1167921300.0
  ], 
  [
   245936, 
   null, 
   "supersport", 
   "Supersport, you frequently talk about the ToE in terms of it being a conspiracy, yet you never supply a motive. Why would the vast, overwhelming majority of biological scientists, from many cultures, many countries, many backgrounds, working for different and often competing academic and commercial entities, all dedicate their lives and reputations to knowingly taking a falsehood and 'forcing it down the throat' of the masses, most of whom couldn't give a wet slap one way or the other?\n \n On the other hand, I've yet to encounter a proponent of ID who doesn't have a non-scientific, religious agenda behind their actions.\n \n Above the panel where I'm typing right now, there are several paid Goodle ads linking to creationist websites. Follow those links and you will find page after page of long-since-debunked objections to the ToE presented as if they were fresh and current (What use is half an eye? etc). You will find blatant quote-mines from Darwin saying that the evolution of the eye 'defeats the imagination', omitting his subsequent explanation of why it need not. You'll find po-faced 'scientists' saying that we've never observed a missing link - a statement whose profundity rates slightly below 'Everything you lose is always found in the last place you look' And running through them all: the bible and Jesus, Jesus and the bible. The alleged 'ultimate truths' marinading in a soup of distortion and outright lies.\n \n To me, that looks one hell of a lot more like a conspiracy.\n\n \n It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.", 
   {}, 
   245829, 
   null, 
   1167948720.0
  ], 
  [
   245948, 
   null, 
   "sinjin", 
   "It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.\nI didn't know God supported lower taxes.", 
   {}, 
   245936, 
   null, 
   1167952020.0
  ], 
  [
   245964, 
   null, 
   "thelmoose", 
   "It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.\n\n \n I will let Peeling address this. But seriously, do you truly believe that scientists are this great cabal whose ultimate purpose is to steer the political process in a more liberal direction? To what end? Are conservatives more unwilling to fund science, is that your point?", 
   {}, 
   245936, 
   null, 
   1167954060.0
  ], 
  [
   245986, 
   null, 
   "electrolyte", 
   "It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.\n\n Notice supersport's equating science and atheism. Ever heard of the ASA?", 
   {}, 
   245936, 
   null, 
   1167960000.0
  ], 
  [
   245987, 
   null, 
   "wascallywabbit", 
   "It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.\n\n \n **\n Why is it that all yanks who oppose darwinism are such fanatical social darwinists? And all \"Christian\" fundamentalists are so fundamentally opposed to Christ's essential message? That is, why are they more aligned with the social vision of some \"Anti-Christ\" than they are to the actual social message of the gospels?\n \n I hope that no-one ever mistakes me for you, ever again, supersport.", 
   {}, 
   245936, 
   null, 
   1167960000.0
  ], 
  [
   245990, 
   null, 
   "Hi_Its_Me", 
   "It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.\n\n Are all scientists atheists? I suppose not, as you have recently quoted one who isn't.\n Are all supporters of evolution atheists? Consider the argument between me and lucaspa in the Occam's Razor thread.\n Are Democrats Communists? No. If you actually think so, provide evidence.", 
   {}, 
   245936, 
   null, 
   1167960600.0
  ], 
  [
   245996, 
   null, 
   "supersport", 
   "Are all scientists atheists? I suppose not, as you have recently quoted one who isn't.\n Are all supporters of evolution atheists? Consider the argument between me and lucaspa in the Occam's Razor thread.\n Are Democrats Communists? No. If you actually think so, provide evidence.\n\n \n No probably not. It deprends on the arena of science. Evolutionary scientists are mostly atheists. The media is comprised of mostly atheists...so they go hand-in-hand, walking happily together, without a care in their fairytale world.\n \n Democrats, or at least some of them, are wanna-be-Communists. They envy and fantasize over the old U.S.S.R. This is just my opinion based on the way they vote.", 
   {}, 
   245990, 
   null, 
   1167964920.0
  ], 
  [
   245999, 
   null, 
   "supersport", 
   "**\n Why is it that all yanks who oppose darwinism are such fanatical social darwinists? And all \"Christian\" fundamentalists are so fundamentally opposed to Christ's essential message? That is, why are they more aligned with the social vision of some \"Anti-Christ\" than they are to the actual social message of the gospels?\n \n I hope that no-one ever mistakes me for you, ever again, supersport.\n\n \n How is it that I'm \"fundamentally opposed to Christ's message?\"....because I have the audacity to believe that science is political....and that ToE brings a message that is designed to steer people away from the truth of God and His Creation? That doesn't make any sense.\n \n By the way...I'd like to ask you....sense you believe that traits are passed on in a lamarckian way, on what grounds do you believe that lifeforms have been around for hundreds of millions of years? Darwinists can get away with this because if lifeforms indeed evolved via RM + NS, then it would have to take that long. However, with a lamarcian inheritance, evolution could be sped up to lightning speed, thus eliminating the need for millions of years.", 
   {}, 
   245987, 
   null, 
   1167965100.0
  ], 
  [
   246006, 
   null, 
   "trebor", 
   "Notice supersport's equating science and atheism. Ever heard of the ASA?\n\n \n Not only is he equating science, and atheism, but he is equating science athiesm, liberalism, and democrats along with it, as well as a bunch of other policitcal subjects such as abortion, and taxes.", 
   {}, 
   245986, 
   null, 
   1167967680.0
  ], 
  [
   246011, 
   null, 
   "Hi_Its_Me", 
   "Democrats, or at least some of them, are wanna-be-Communists. They envy and fantasize over the old U.S.S.R. This is just my opinion based on the way they vote.\n\n You can't understand their voting principles, so you think they want to be part of a failed system of government that has bad connotations?", 
   {}, 
   245996, 
   null, 
   1167968700.0
  ], 
  [
   246014, 
   null, 
   "Collin", 
   "because I have the audacity to believe that science is political....and that ToE brings a message that is designed to steer people away from the truth of God and His Creation? That doesn't make any sense.\n\n \n You're right: the underlined part DOESN'T make any sense!", 
   {}, 
   246011, 
   null, 
   1167969720.0
  ], 
  [
   246017, 
   null, 
   "supersport", 
   "You're right: the underlined part DOESN'T make any sense!\n\n \n Evolutionists have taken the beauty and majesty of creation out of the hands of God and given to selection; they've taken the concept that life brings forth life and replaced it with the concept that death (selection) brings forth life. They've taken the reality and miraculousness out of life and replaced it with philosophical pseudo-science. They've taken the mind (intelligence) out of life and replaced it with stupid and randomly mutating genes.\n \n All that is about as anti-God as you can get.", 
   {}, 
   246014, 
   null, 
   1167970380.0
  ], 
  [
   246018, 
   null, 
   "wascallywabbit", 
   "[quote]\nHow is it that I'm \"fundamentally opposed to Christ's message?\"....\n\n \n **\n Your politics are fundamentally opposed to the teachings of Jesus Christ wrt social interaction. Yours are the politics of selfish elitism. His were those of equality, love, and sharing.\n \n \n\n because I have the audacity to believe that science is political....\n\n \n **\n Yes, science is political. Social darwinism, eugenics, ethnic cleansing, corporate looting, racism and fascism have all been justified by pointing to a distorted, darwinist, anthropomorphic, elitist vision of nature. Materialism has been the rationale for an even broader range of anti-human, anti-life atrocities. The world is paying for that big time, even as we watch, helplessly.\n \n So no, that is not the reason why you are fundamentally opposed to Christ's message. Here is the reason that I say that you and your regressive friends are fundamentally opposed to Christ's message. The problem with you and your anti-human, anti-christ, right-wing friends, is that although you are against darwinian 'evolution' on the basis that it opposes 'special creation', you are 100% darwinian; all darwinian morality and darwinian values when it comes to politics and economics. All of it stemming from an elitist (see fascist) corruption of Christ's teaching that reaches back to Augustine and even to the dualism of Zoroaster, and which is in direct contradiction to the real message of the true christian gospel. You want to see your \"Anti-Christ\". He's sitting next to you in your church, and preaching at you on television.\n \n \n\n and that ToE brings a message that is designed to steer people away from the truth of God and His Creation?\n\n \n **\n The ToE (i. e., RMNS darwinism, in which \"God\" is simply replaced by \"Chance\", or, \"It just happens, that's all!\") is basically , apart from that, no different from your peculiar notion of christianity. Darwinism arose out of the same pre-Calvinist roots as your own religion. They both spin the same worldview, using slightly different words. Why else do you think that Darwin is always portrayed looking like an Old Testament \"prophet\". It is largely because they are so much the same that your fundamentalist elitism hates darwinian fundamentalist elitism so much, and vice-versa.\n \n \n\n By the way...I'd like to ask you....sense you believe that traits are passed on in a lamarckian way, on what grounds do you believe that lifeforms have been around for hundreds of millions of years?\n\n \n **\n Believe it or not, geology, paleontology, and astrophysics, although they may not be able to pin down ancient events to the minute, are basically reliable sources of knowlwedge and understanding. To believe that the myth given in Genesis is anything more than a widespread middle-eastern folk-tale, for all of its literary and psychological beauty, is childishness. To believe that reality is just the whimsy of a touchy and whimsical anthropomorphic 'creator god' ranks right down there with a belief in trolls, witches, warlocks, devils, sorcerers and other magicians. Its the stuff of simple minds; i.e., children, or the reality-challenged adult. The kind of people who prefer comic books to rational thought.\n \n \n\n Darwinists can get away with this because if lifeforms indeed evolved via RM + NS, then it would have to take that long. However, with a lamarcian inheritance, evolution could be sped up to lightning speed, thus eliminating the need for millions of years.\n\n \n **\n Not. Neo-lamarckism, (at least in my own EAM, devo-evo model), does not 'require' the time that the chance-based darwinian model requires, but it does require ecological change sufficient to stimulate organismic reactions that are evolutionary. Those sorts of robust, chronic, vital alterations do not, thank G*D, happen in every ecosystem every day. Sometimes they do not happen in some ecosystems for hundreds of millions of years. Neo-lamarckian nature says, \"If it ain't broke, then just leave it be.\" Which is why we have so many organisms today that have successly survived, unchanged, for millions of years. Random genetic accidents happened to them constantly over countless generations, but because they did not need to change, they did not change. They themselves ruled their own morphology and behaviour, not billions of fly-by-night mutagenic rays. At the same time, drastic changes of the sort that cause mass extinctions and radical evolutionary changes in survivors are separated by thousands and even millions of years. Those events, and all the years between them, are written in stone, whether you prefer fairy-tales, or not.", 
   {}, 
   245999, 
   null, 
   1167970500.0
  ], 
  [
   246032, 
   null, 
   "Peeling", 
   "SS, I felt genuine sadness reading your last couple of posts. Why? Because the idea you hate so very, very much isn't evolution or the ToE. At some point you've either got the wrong idea yourself, or listened to someone who (intentionally or otherwise) supplied you with a distorted and macabre picture of evolution; a Frankenstein's monster of crudely stitched-together notions, almost none of them actually part of the ToE or representative of what it explains.\n \n \nEvolutionists have taken the beauty and majesty of creation out of the hands of God and given to selection;\n\n \n Theistic evolutionists don't see it that way. They see the ToE as a refinement of our understanding of how god does things. They see the ToE as a revelation: god didn't design each individual kind of organism as if it were part of a gigantic jigsaw puzzle; he was much smarter than that. He created a universe where life could find its own way - the ultimate expression of free will. Think about that: how much more wonderful is it that a species could arise on its own with sufficient intelligence to consider the infinite and find god, than it would be for god to brute-force manufacture a race for no other purpose than to worship him?\n \n Besides, the ToE makes no statement about how life came to exist; it is merely an explanation for the evolution we observe today and in the fossil record. Even if life was created a few thousand years ago, with all the fossil and geological data in place to fool us, it would not change the observable fact that genetic change is occurring on all the time; speciation is going on all around us - nature is evolving. Whether god created the universe or not, he did not create a tableau.\n \n \nthey've taken the concept that life brings forth life and replaced it with the concept that death (selection) brings forth life.\n\n \n Again, this is such a tragic, warped misconception. In the ToE it is not death that selects, it is life; success; birth. \n \n \nThey've taken the reality and miraculousness out of life and replaced it with philosophical pseudo-science.\n\n \n Only if you are personally beloved of a particular miracle. \n \n To me, an evolving biosphere, capable of giving rise to self-aware creatures like us, is infinitely more humbling and awe-inspiring than an act of forced creation. Why? Because creation-by-design is something humans do. To insist that god must work in the same way is to limit him to being nothing more than a bigger, cleverer version of ourselves.\n \n \nThey've taken the mind (intelligence) out of life and replaced it with stupid and randomly mutating genes.\n\n \n Genes shape the physical forms intelligence must work with, but that no more 'takes the intelligence out of life' than observing that the environment is also raw material that intelligence must work with.\n \n Consider us, the human race. Yes, randomly mutating genes have produced the raw materials, the 'gene pool' we had to work with, but the ToE doesn't preclude us from having exerted our intelligence to help the selection process along. The ToE doesn't say we never intelligently seized genetic opportunities; intelligently chose to select traits the rest of the environment alone would not advance.\n \n We also design societies, formulate cultures and pass them on - and though there is almost undoubtedly a genetic component to who we find sexually attractive, we also apply our intelligence, knowledge and foresight when deciding who to raise a family with. Intelligence is a fundamental part of Natural Selection in humans, and the culture and knowledge we possess - the 'genetic code' of the society we designed - is, today, as or more important to our individual and collective success than are our genes. Given that we apparently evolved from little shrewish creatures hundreds of millions of years ago, it would appear that far from taking the intelligence out of life, evolution has put it in.\n \n Maybe 'stupid, randomly mutating genes' win on a simple bean-count of success (bacteria literally outweigh all other forms of life on the planet), but is that really all that matters? \n \n \nAll that is about as anti-God as you can get.\n\n \n No; it is only antithetical to your personal belief in what god is and what he has done and how he has done it, which is based on a book written by men thousands of years ago. You are defending a book; you are defending a story; you are not defending god. You are insisting that men knew everything there was to know, two thousand years ago, and denying that careful study, massive technological advances and some of the greatest minds that ever lived could teach us better. If anyone here is denying the value of intelligence, it is you, for insisting that we should ignore what it reveals to us of the universe.", 
   {}, 
   246017, 
   null, 
   1168001580.0
  ], 
  [
   246070, 
   null, 
   "supersport", 
   "I would like to know how you guys can claim that the theory of evolution was not created specifically so that people could put their faith in something other than the Creator of the Universe.....The theory of evolution does the following:\n \n ToE is a thoery that takes the beauty and majesty of Creation out of the hands of God and gives to selection. Evolutionists believe the only reason humans are here is because some unfit monkeys died. Before that some unfit rodents died. Before that some unfit reptiles and amphibeans died. Before that some unfit insects and spiders and ameba died.....and it all came out of a swamp that stank of death until one lucky fluke accident. You guys are sick in the head.\n \n \n ToE takes the reality and miraculousness out of life and replaces it with philosophical, non-miraculous pseudo-science. You guys don't rely on science to form your theory -- your theory is enough proof by itself! To heck with testing animals. \n \n It takes the mind (intelligence) out of life and replaces it with randomly mutating genes. Only a diluted nitwit could claim that the life is not intelligent. (I'll get to this in a bit)\n \n \n It takes all of God's beautiful creatures and eliminates them as a unit of study when it comes to transmission of heredity.  \n \n It takes a wholistic view of life and abandons it, replacing it with the study of supposedly independently-acting molecules.\n \n It takes a human, who was created in God's image, and replaces him as something that was created in an ape's image.\n \n It takes away an all-powerful God and replaces Him with a God who relies on accidents.\n \n It takes God's power to create the world in the blink of an eye (ok 6 days) and forces Him to be less than powerful, requiring Him to use hundreds of millions of years to form creation.\n \n \n And I have a bonus question (or two) for you atheists:\n \n \n When you consider all of the complexity on earth: all the chemicals...all the DNA...all the red blood cells and brain cells.....all the starfish and raindrops and babbling brooks and sunrays and classical music and little babies and skydiving and snorkeling and all the cool things life has to offer -- and when you think of the fact that snowflakes are all different, as well as all the stars, as well as each blade of grass and every organism on earth, does it not strike you that what we live in is pretty spectacular? I mean when DNA breaks down into smaller and smaller particles and these particles eventually disappear, yet the \"fields\" that underlie these particles seem to somehow know what to do -- does life not strike you as something extraordinary? And when you taste a good steak or eat apple pie with ice cream or sing your favorite song or hug your wife or see your children born or tell someone that you love them -- does all that mean nothing? And is it just ho-hum when you think about how your sperm or egg ended up being one of your children? And how exactly is it, anyway, that a fertilized egg just happens to swirl around and form an embryo? \n \n How can you guys say that life is not miraculous? How can you claim that there is not an all powerful God? Do you think you could string all this together if you were given the right chemicals?....or heck --- if you weren't given anything. How would you go about creating a gene from scratch? Heck, how could you even think of a gene? How about a cell? How about an immune system? How about a nervous system or a spinal cord? How about an eyeball or some hemoglobin or adrenaline? \n \n I think you're all fooling yourselves. In the meantime you continue your charade, masquerading yourselves as intellectuals, adopting a sneering tone of arrogance and know-it-all attitude towards anyone who doensn't think like you. I think you all are in for a big surprise someday. \n \n And WW, you never did answer my question: How did monkeys/apes turn into human beings without randomly mutating genes and without selection?\n \n And I asked you before what makes you think life has been on this earth for so many millions of years in light of your mechanism of change allows for very rapid evolution. You did not answer me. In fact, did you know there are only about 4,000 TOTAL fossil hominid bones dug up? That includes all Neanderthals, homo erectus and all austolopithecus and every other primate. 4,000 total....many of these are represented by just a few small bones or teeth. So where are all the necessary MILLIONS and MILLIONS of fossil hominid bones necessary to support an earth that's been around for a billion years or more? \n \n Oh, that's right -- you're living on faith just like me.", 
   {}, 
   246032, 
   null, 
   1168024020.0
  ], 
  [
   246081, 
   null, 
   "Peeling", 
   "I would like to know how you guys can claim that the theory of evolution was not created specifically so that people could put their faith in something other than the Creator of the Universe.\n\n \n Theistic evolutionists would say that the theory of evolution allows us to better know god, because it exposes to us a more accurate vision of the history of life on earth than is written in the bible. \n \n The only thing saying that the bible is right, and that the bible is the word of god is the bible itself. It's just a book. Destroy all copies of the bible and where, then, is the creator god it describes? Gone; lost forever. What kind of god is it that relies on a bundle of papers for his existence?\n \n According to you, god is behind the bible, and god is behind the universe too - but the bible was written down by men, whom you acknowledge to be imperfect. So what should we study to learn the truth of god's works? A book? Or his creation directly?\n \n \nEvolutionists believe the only reason humans are here is because some unfit monkeys died.\n\n \n Wrong, so wrong. If any such gross oversimplification applies at all, it is that we are here because we were born, and we were more fit than those preceeding us. Evolution is not a story of death and decay, it is a story of survival. The population of the dead, after all, does not evolve.\n \n \nYou guys are sick in the head.\n\n \n It is your head, not mine, that is full of these grotesque images when you consider evolution. You bear an irrational and poisoned grudge against it that transcends logic, reason, and knowledge.\n \n \nYou guys don't rely on science to form your theory -- your theory is ENOUGH proof for you by itself! To heck with testing animals.\n\n \n You arrogant, arrogant little man.\n \n \nOnly a diluted nitwit could claim that the life is not intelligent.\n\n \n You really didn't even see the words I wrote in my last post, did you?\n \n \nIt takes a wholistic view of life and abandons it, replacing it with the study of supposedly independently-acting molecues.\n\n \n Wrong, wrong, wrong. Genes build the body that the organism has to work with. Like a racing driver's car, it can help win the race - and sure enough, after a billion races the cars left will assuredly be the fastest and best-handling, but that does not detract from the accomplishment of the drivers.\n \n \nIt takes a human, who was created in God's image, and replaces him as something that was created in an ape's image.\n\n \n You do know that 'god's image' is not meant as a physical likeness, don't you? Regardless, however much you think you look like god, the evidence that we descended from ape-like ancestors is compelling. You may not like the truth, but why base your faith on pretty, ego-stroking lies?\n \n \nIt takes away an all-powerful God and replaces Him with a God who relies on accidents.\n\n \n Absolutely false. Evolution is the opposite of accidental. If all births and deaths were purely accidental, no evolution could occur.\n \n \nIt takes God's power to create the world in the blink of an eye (ok 6 days) and forces Him to be less than powerful, requiring Him to use hundreds of millions of years to form creation.\n\n \n Again, this is a hopelessly unsophisticated vision of god. God is outside time, remember? Hundreds of millions of our years, to him, are like... like a skyscraper a hundred million storeys tall: if god created our whole universe, time dimension included, it took him none of 'our time' at all - how could it?\n \n \nWhen you consider all of the complexity on earth: all the chemicals...all the DNA...all the red blood cells and brain cells.....all the starfish and raindrops and babbling brooks and sunrays and classical music and little babies and skydiving and snorkeling and all the cool things life has to offer -- and when you think of the fact that snowflakes are all different, as well as all the stars, as well as each blade of grass and every organism on earth, does it not strike you that what we live in is pretty spectacular?\n\n \n YES. That's why I want to see it for what it is, and not close my eyes to it. I don't want to shoehorn it into the dusty pages of some old book and pretend all knowledge is contained therein; I understand that we don't know everything yet, and I'm excited about what we might find out if we get up of our knees and keep looking.\n \n \nAnd when you taste a good steak or eat apple pie with ice cream or sing your favorite song or hug your wife or see your children born or tell someone that you love them -- does all that mean nothing?\n\n \n It sure doesn't mean nothing to me. Think, man! Even if we are all there is, that means we define significance; what matters to us is what matters. There need be no bigger picture - which would only trivialise our existence anyway, not elevate it. Living to please god is just a grown-up version of living to please your parents; it's a timid refusal to accept responsibility. Why can't the human race just own its own destiny?\n \n \nAnd how exactly is it, anyway, that a fertilized egg just happens to swirl around and form an embryo? (I'd like an answer, WW.)\n\n \n Because that's what that configuration of matter, in that context, does.\n \n \nHow can you guys say that life is not miraculous?\n\n \n Because I'm too busy saying it's amazing, wonderful, exciting, awe-inspiring - I'm perfectly capable of enthusing without bringing god into it?\n \n \nHow can you claim that there is not an all powerful God?\n\n \n Careful inspection of the evidence.\n \n \nDo you think you could string all this together if you were given the right chemicals?\n\n \n The relevance of this being...?\n \n Here's an interesting factoid: no human could design the latest graphics chips. No computer designs them either. They're arrived at by evolutionary variation and selection.\n \n \nYou guys really think all that just happened by chance?\n\n \n No. What we think (crudely) is that billions of trillions of trillions of things happen by chance, and that what we see around us today is what worked, a process latterly accellerated by life itself as organisms became more complex and aware of the environment in which they lived. Two billion years of organic compounds, a billion years of single-celled creatures - now we're curing genetic diseases within a single lifetime. The ultimate bootstrapping process :)\n \n \nadopting a sneering tone of arrogance and know-it-all attitude towards anyone who doensn't think like you.\n\n \n Excuse me, but take a quick glance over the first page of this forum and the sneering, insulting, obnoxious, know-it-all posts mostly have your name beside them.\n \n \n In fact, did you know there are only about 4,000 TOTAL fossil hominid bones dug up? That includes all Neanderthals, homo erectus and all austolopithecus and every other primate. 4,000 total. So where are all the necessary MILLIONS and MILLIONS of bones necessary to support an earth that's been around for a billion years or more?\n\n \n 1. Places we haven't dug up. You did know we haven't excavated the whole crust of the planet, don't you?\n \n 2. Destroyed. Hardly any of the earth's surface is suitable for preserving fossils.\n \n Take those factors into account and we're actually slightly in credit, fossil-speaking.\n \n If I were you, I wouldn't venture too far into the realms of statistics in support of your argument; people are likely to start extrapolating post-flood populations at you, and asking how a couple of thousand children managed to build the pyramids :)", 
   {}, 
   246070, 
   null, 
   1168027440.0
  ], 
  [
   246083, 
   null, 
   "Shooterandproud", 
   "Oh yea, if evolution is such a fraud, then what is creationism? Poof! God created everything in 6 days then rested on the 7th. First of all, why the hell does god need rest? Isn't he god? Second, why did it take him 6 whole days? This whole \"evolution is wrong\" series you keep posting is pure deception. There is not ONE logical argument out there that can disprove it, there is overwhelming evidence of it. I just don't understand how anyone can think so differently.", 
   {}, 
   245767, 
   null, 
   1168027920.0
  ], 
  [
   246084, 
   null, 
   "Shooterandproud", 
   "I did not come on here to talk about Dr. Lipton's spiritual beliefs. My OP is about how evolutionists have developed a whole theory based on the fraudulent premise that genes control everything. How many times have you head \"it's in the genes\"? But how can genes control anything if they don't even control the cell they reside in?\n\n \n Which Theory of evolution are you talking about? Its sure not the one that many people on this forum plus myself believe in. Could you please elaborate?", 
   {}, 
   245734, 
   null, 
   1168028100.0
  ], 
  [
   246085, 
   null, 
   "Shooterandproud", 
   "Theistic evolutionists would say that the theory of evolution allows us to better know god, because it exposes to us a more accurate vision of the history of life on earth than is written in the bible. \n \n The only thing saying that the bible is right, and that the bible is the word of god is the bible itself. It's just a book. Destroy all copies of the bible and where, then, is the creator god it describes? Gone; lost forever. What kind of god is it that relies on a bundle of papers for his existence?\n \n According to you, god is behind the bible, and god is behind the universe too - but the bible was written down by men, whom you acknowledge to be imperfect. So what should we study to learn the truth of god's works? A book? Or his creation directly?\n \n \n \n Wrong, so wrong. If any such gross oversimplification applies at all, it is that we are here because we were born, and we were more fit than those preceeding us. Evolution is not a story of death and decay, it is a story of survival. The population of the dead, after all, does not evolve.\n \n \n \n It is your head, not mine, that is full of these grotesque images when you consider evolution. You bear an irrational and poisoned grudge against it that transcends logic, reason, and knowledge.\n \n \n \n You arrogant, arrogant little man.\n \n \n \n You really didn't even see the words I wrote in my last post, did you?\n \n \n \n Wrong, wrong, wrong. Genes build the body that the organism has to work with. Like a racing driver's car, it can help win the race - and sure enough, after a billion races the cars left will assuredly be the fastest and best-handling, but that does not detract from the accomplishment of the drivers.\n \n \n \n You do know that 'god's image' is not meant as a physical likeness, don't you? Regardless, however much you think you look like god, the evidence that we descended from ape-like ancestors is compelling. You may not like the truth, but why base your faith on pretty, ego-stroking lies?\n \n \n \n Absolutely false. Evolution is the opposite of accidental. If all births and deaths were purely accidental, no evolution could occur.\n \n \n \n Again, this is a hopelessly unsophisticated vision of god. God is outside time, remember? Hundreds of millions of our years, to him, are like... like a skyscraper a hundred million storeys tall: if god created our whole universe, time dimension included, it took him none of 'our time' at all - how could it?\n \n \n \n YES. That's why I want to see it for what it is, and not close my eyes to it. I don't want to shoehorn it into the dusty pages of some old book and pretend all knowledge is contained therein; I understand that we don't know everything yet, and I'm excited about what we might find out if we get up of our knees and keep looking.\n \n \n \n It sure doesn't mean nothing to me. Think, man! Even if we are all there is, that means we define significance; what matters to us is what matters. There need be no bigger picture - which would only trivialise our existence anyway, not elevate it. Living to please god is just a grown-up version of living to please your parents; it's a timid refusal to accept responsibility. Why can't the human race just own its own destiny?\n \n \n \n Because that's what that configuration of matter, in that context, does.\n \n \n \n Because I'm too busy saying it's amazing, wonderful, exciting, awe-inspiring - I'm perfectly capable of enthusing without bringing god into it?\n \n \n \n Careful inspection of the evidence.\n \n \n \n The relevance of this being...?\n \n Here's an interesting factoid: no human could design the latest graphics chips. No computer designs them either. They're arrived at by evolutionary variation and selection.\n \n \n \n No. What we think (crudely) is that billions of trillions of trillions of things happen by chance, and that what we see around us today is what worked, a process latterly accellerated by life itself as organisms became more complex and aware of the environment in which they lived. Two billion years of organic compounds, a billion years of single-celled creatures - now we're curing genetic diseases within a single lifetime. The ultimate bootstrapping process :)\n \n \n \n Excuse me, but take a quick glance over the first page of this forum and the sneering, insulting, obnoxious, know-it-all posts mostly have your name beside them.\n \n \n \n 1. Places we haven't dug up. You did know we haven't excavated the whole crust of the planet, don't you?\n \n 2. Destroyed. Hardly any of the earth's surface is suitable for preserving fossils.\n \n Take those factors into account and we're actually slightly in credit, fossil-speaking.\n \n If I were you, I wouldn't venture too far into the realms of statistics in support of your argument; people are likely to start extrapolating post-flood populations at you, and asking how a couple of thousand children managed to build the pyramids :)\n\n \n I hate to say this, but you didn't really need to go through all of this trouble. I applaud your arguments and your courage but you can't really debate with a partially crazy man. Most of us know that supersport could use some psycheatric treatment, as he has no base for these \"poof, god created everything\" arguments. He has failed many times at disproving Evolution, and his arguments don't really have any weight. Next he's going to try to disprove the law of gravity or something of that sort. SuperSport, you can't refute known facts.", 
   {}, 
   246081, 
   null, 
   1168028220.0
  ], 
  [
   246101, 
   null, 
   "supersport", 
   "Wow, shooter...I must really have gotten under your skin. 3 posts in a row!\n \n Now how about this...how about you prove to me that your XXXX version of evolution is true by doing the following:\n \n 1) Prove to me that NS is true on the level of the organism by showing me controlled experiments on real animals.\n \n 2) Prove to me that there is such thing as a beneficial random mutation that could lead to cumulative selection.\n \n 3) Prove to me that lamarckian inheritance is false, based on controlled experiments on animals.\n \n 4) Prove to me how dinosaur soft, bloody tissue could survive and be preserved for 65 million freaking years.\n \n 5) Show me a name or a fossil that was the supposed common ancestor to chimps and humans.\n \n 6) Show me a series of fossils that gradually lead from one type of animal to another.\n \n 7) Show me a series of fossils leading from australopithecus (ape) to homo erectus (human).\n \n 8) Show me how the frauds in science have dated dinosaurs via carbon 14 dating to rule out recent existence.\n \n And after you come up with absolutely jack-squat nothing for all for of these challenges, you can roll them all up, stick them in your little atheist pipe and smoke 'em.", 
   {}, 
   246085, 
   null, 
   1168036680.0
  ], 
  [
   246157, 
   null, 
   "Hi_Its_Me", 
   "I hope you don't mind me answering for SP here?\n \nWow, shooter...I must really have gotten under your skin. 3 posts in a row!\n\n Actually, peeling and I have spent more time posting in this thread. Also, the only thing that annoys me (just in case you extrapolate) is that you don't appear to be reading them.\n \nNow how about this...how about you prove to me that your XXXX version of evolution is true by doing the following:\n\n So now we have to prove it, as opposed to showing that it is a whole lot more sensible than the explanations you support?\n The second can be done; the first can't.\n \n1) Prove to me that NS is true on the level of the organism by showing me controlled experiments on real animals.\n\n Here's a good one, but the formatting is poorly done. Press ctrl+A to read it. \n http://www.dinosauria.com/jdp/evol/lizard.html\n \n2) Prove to me that there is such thing as a beneficial random mutation that could lead to cumulative selection.\n\n An example is shown above, and more beneficial mutation examples can be found here.\n \n3) Prove to me that lamarckian inheritance is false, based on controlled experiments on animals.\n\n Mice that had their tails chopped off bred to produce offspring with tails. I assume you remember that experiment?\n \n4) Prove to me how dinosaur soft, bloody tissue could survive and be preserved for 65 million freaking years.\n\n You mean these findings? Let's take a look at Mary Schweitzer's (the person who did most of the work) response to the misinterpretation of the data:Young-earth creationists also see Schweitzer's work as revolutionary, but in an entirely different way. They first seized upon Schweitzer's work after she wrote an article for the popular science magazine Earth in 1997 about possible red blood cells in her dinosaur specimens. Creation magazine claimed that Schweitzer's research was \"powerful testimony against the whole idea of dinosaurs living millions of years ago. It speaks volumes for the Bible's account of a recent creation.\"\n \n This drives Schweitzer crazy. Geologists have established that the Hell Creek Formation, where B. rex was found, is 68 million years old, and so are the bones buried in it. She's horrified that some Christians accuse her of hiding the true meaning of her data. \"They treat you really bad,\" she says. \"They twist your words and they manipulate your data.\"What has not been established is, apparently, the facts regarding fossilization. The age of the earth is fairly well established (much more so than the age of the dinosaur), and the age of the universe keeps getting revised upwards.\n Supporting a young earth isn't easy, I suppose...\n \n5) Show me a name or a fossil that was the supposed common ancestor to chimps and humans.\n\n Here's the name and some info. You can find the fossils yourself.\n Aegyptopithecus\n \n6) Show me a series of fossils that gradually lead from one type of animal to another.\n\n http://www.geocities.com/CapeCanaveral/Hangar/2437/therapsd.htm\n \n7) Show me a series of fossils leading from australopithecus (ape) to homo erectus (human).\n\n http://contradictions.darwin.ws/htree.jpg\n \n8) Show me how the frauds in science have dated dinosaurs via carbon 14 dating to rule out recent existence.\n\n Consider this:\"This means that carbon dating can only be used to date things that existed 50,000 years ago or less. It wouldn't be of any help in dating a dinosaur, for instance, because the last dinosaurs went extinct about 65 million years ago.\"If you think that this looks like helpful evidence, consider what an absence of radioactive carbon-14 means: the object in question is over 50,000 years old (which rules out recent existence).\n \nAnd after you come up with absolutely jack-squat nothing for all for of these challenges, you can roll them all up, stick them in your little atheist pipe and smoke 'em.\n\n And if we fail to come up with nothing?", 
   {
    "unicode_changes_made": true
   }, 
   246101, 
   null, 
   1168060260.0
  ], 
  [
   246159, 
   null, 
   "supersport", 
   " I hope you don't mind me answering for SP here?\n \n doesn't matter me....the answers will be sorry no matter which evolutionist tries.\n \n \n So now we have to prove it, \n \n yeap..that's how science works. If you want to call ToE a philosophy based on opinion, then fine....but don't put in textbooks masquerading as fact.\n \n \n \n Here's a good one, but the formatting is poorly done. Press ctrl+A to read it. \n http://www.dinosauria.com/jdp/evol/lizard.html\n \n don't make me laugh. for one thing lizards have legs that extremely adaptive to environmental conditions. Second, this was not a controlled experiment. \n \n An example is shown above, and more beneficial mutation examples can be found here.\n \n um...you forgot the word \"random.\" Try again. \n \n Mice that had their tails chopped off bred to produce offspring with tails. I assume you remember that experiment?\n \n you need to go back and re-read my recent post called \"let's get lamarckism straight.\" the mice thing was a dishonest experiment of lamarckian inheritance.\n \n You mean these findings? Let's take a look at Mary Schweitzer's (the person who did most of the work) response to the misinterpretation of the data:\n \n who cares what somebody says? I'm asking for a mechanism that would preserve soft tissue for 65 million years. now where is it? \n \n Here's the name and some info. You can find the fossils yourself.\n Aegyptopithecus\n \n nice try. Show me over at talk origins where they claim this is our common ancestor. I'd also like to see evidence or proof.\n \n \n \n http://contradictions.darwin.ws/htree.jpg\n \n lol...and what exactly is the name of that creature leading to homo erectus??? I can't quite read it.\n \n Consider this:\"This means that carbon dating can only be used to date things that existed 50,000 years ago or less. It wouldn't be of any help in dating a dinosaur, for instance, because the last dinosaurs went extinct about 65 million years ago.\"If you think that this looks like helpful evidence, consider what an absence of radioactive carbon-14 means: the object in question is over 50,000 years old (which rules out recent existence).\n \n that's circular reasoning at its finest. I can show you where dinosaurs have been dated at 9,000-15,000 years via carbon 14. don't you think it's odd that they've NEVER been tested by the scientific establishment?...even just for fun? don't you think science would be a little more honest if they did the test just rule out the possibility that dinosaurs are young? I guess not......but my point stands which is that science is full of chickens.\n \n And if we fail to come up with nothing?\n \n yeap...nothing.", 
   {
    "unicode_changes_made": true
   }, 
   246157, 
   null, 
   1168062960.0
  ], 
  [
   246161, 
   null, 
   "pandion", 
   "So now we have to prove it, \n \n yeap..that's how science works. If you want to call ToE a philosophy based on opinion, then fine....but don't put in textbooks masquerading as fact.\nNope. That's not how it works. At least have the honesty to learn what science is and how it works.\n \nHere's a good one, but the formatting is poorly done. Press ctrl+A to read it. \n http://www.dinosauria.com/jdp/evol/lizard.html\n \n don't make me laugh. for one thing lizards have legs that extremely adaptive to environmental conditions. Second, this was not a controlled experiment.\nMy bet is that not only can you not prove that lizards have legs that [are] extremely adaptive to environmental conditions, you won't even be able to cite a controlled experiment. By the way, the above experiment was controlled. It is apparent that you haven't read the paper. \n \nAn example is shown above, and more beneficial mutation examples can be found here.\n \n um...you forgot the word \"random.\" Try again.\nBut mutations are random. Why play dumb?\n \nMice that had their tails chopped off bred to produce offspring with tails. I assume you remember that experiment?\n \n you need to go back and re-read my recent post called \"let's get lamarckism straight.\" the mice thing was a dishonest experiment of lamarckian inheritance.\nDishonest because you don't understand the experiment I think. Or maybe dishonest because you are dishonest. You have yet to offer a single example of Lamarckism that stands up.\n \nYou mean these findings? Let's take a look at Mary Schweitzer's (the person who did most of the work) response to the misinterpretation of the data:\n \n who cares what somebody says? I'm asking for a mechanism that would preserve soft tissue for 65 million years. now where is it?\nThen you haven't read anything about Mary Schweitzer's work? Why am I not surprised. You object to what you know nothing about.\n \nHere's the name and some info. You can find the fossils yourself.\n Aegyptopithecus\n \n nice try. Show me over at talk origins where they claim this is our common ancestor. I'd also like to see evidence or proof.\nSo you are saying that you accept talk origins as authoritative? What about what talk origins says about Lamarckism? Do you accept that?\n \nhttp://contradictions.darwin.ws/htree.jpg\n \n lol...and what exactly is the name of that creature leading to homo erectus??? I can't quite read it.\nIt appears to be a depiction of Sangiran 17, an example of H. erectus from Java. It is about 800,000 years old, a caranium size of about 1000 cc, with certain differences intermediate between H. ergaster and later H. erectus specimens from Africa. Yet another example of your failure to actually learn the basics of what you claim to oppose.\n \nConsider this:\"This means that carbon dating can only be used to date things that existed 50,000 years ago or less. It wouldn't be of any help in dating a dinosaur, for instance, because the last dinosaurs went extinct about 65 million years ago.\"If you think that this looks like helpful evidence, consider what an absence of radioactive carbon-14 means: the object in question is over 50,000 years old (which rules out recent existence).\n \n that's circular reasoning at its finest. I can show you where dinosaurs have been dated at 9,000-15,000 years via carbon 14. don't you think it's odd that they've NEVER been tested by the scientific establishment?...even just for fun? don't you think science would be a little more honest if they did the test just rule out the possibility that dinosaurs are young? I guess not......but my point stands which is that science is full of chickens.\nThen why didn't you cite the papers? I suspect that you are a dupe. Actually, what you are saying, since you claim that these datings weren't done by legitimate scientific dating labs, is that the dates are suspect to start with. No doubt the amateur creationists weren't able to prevent contamination of the samples. Somewhat similar to the dating done by creationists on Grand Canyon rocks. When the results were studied closely, they were found to have been contaminated by pollen.\n \n So show one example of a dinosaur fossil that has a legitimate dating of less than 65 million years. Cite the papers or shut up.", 
   {
    "unicode_changes_made": true
   }, 
   246159, 
   null, 
   1168069140.0
  ], 
  [
   246163, 
   null, 
   "T.Q", 
   "Quote:Originally Posted by supersport \n You mean these findings? Let's take a look at Mary Schweitzer's (the person who did most of the work) response to the misinterpretation of the data:\n \n who cares what somebody says? I'm asking for a mechanism that would preserve soft tissue for 65 million years. now where is it?\n \n Then you haven't read anything about Mary Schweitzer's work? Why am I not surprised. You object to what you know nothing about.\n\n \n I'm guessing he has no idea what Schweitzer actually found. For some strange reason, I can see SS here picturing Schweitzer and Horner digging up a T. Rex steak.\n \n Here's a good place to start if you want to know what was actually found SS-and it wasn't \"bloody tissue\" by any stretch of the imagination: http://talkorigins.org/faqs/dinosaur/flesh.html", 
   {}, 
   246161, 
   null, 
   1168073220.0
  ], 
  [
   246164, 
   null, 
   "Shooterandproud", 
   "Wow, shooter...I must really have gotten under your skin. 3 posts in a row!\n\n \n Extreme ignorance can bother me sometimes.\n \n \n \n \n \nNow how about this...how about you prove to me that your XXXX version of evolution is true by doing the following:\n\n \n I don't need to prove anything. You brought up the whole issue and still haven't proved it.\n \n \n \n \n \n1) Prove to me that NS is true on the level of the organism by showing me controlled experiments on real animals.\n\n \n Experiments would take millions of years. In case you didn't know already, humans don't live that long.\n \n \n \n \n \n \n2) Prove to me that there is such thing as a beneficial random mutation that could lead to cumulative selection.\n\n \n Why would there not be?\n \n \n \n \n \n \n \n3) Prove to me that lamarckian inheritance is false, based on controlled experiments on animals.\n\n \n Not familiar with Lamarckian inheritance.\n \n \n \n \n4) Prove to me how dinosaur soft, bloody tissue could survive and be preserved for 65 million freaking years.\n\n \n If it couldn't, then how could it survive for 6,000? There are many methods of natural preservation.\n \n \n \n \n \n \n5) Show me a name or a fossil that was the supposed common ancestor to chimps and humans.\n\n \n Remember Lucy's bones?\n \n \n \n \n \n \n \n6) Show me a series of fossils that gradually lead from one type of animal to another.\n\n \n Lucy's bones again, plus Neanderthal remains, Homo erectus remains, etc.\n \n \n \n \n \n \n \n7) Show me a series of fossils leading from australopithecus (ape) to homo erectus (human).\n\n \n Have you ever considered the possibility that, i don't know, that the remains are destroyed somehow? Weather, volcanoes, storms etc can really wear it down.\n \n \n \n \n \n \n8) Show me how the frauds in science have dated dinosaurs via carbon 14 dating to rule out recent existence.\n\n What frauds?\n \n \nAnd after you come up with absolutely jack-squat nothing for all for of these challenges, you can roll them all up, stick them in your little atheist pipe and smoke 'em.\n\n \n Just because you do not have the intelligence to comprehend the basics of life, does not mean I should start smoking. And after you've come up with your fake little creationist fallacy, with nothing to prove it except an old book, you should start smoking.", 
   {}, 
   246101, 
   null, 
   1168074060.0
  ], 
  [
   246165, 
   null, 
   "Shooterandproud", 
   " I hope you don't mind me answering for SP here?\n \n doesn't matter me....the answers will be sorry no matter which evolutionist tries.\n \n \n So now we have to prove it, \n \n yeap..that's how science works. If you want to call ToE a philosophy based on opinion, then fine....but don't put in textbooks masquerading as fact.\n \n \n \n Here's a good one, but the formatting is poorly done. Press ctrl+A to read it. \n http://www.dinosauria.com/jdp/evol/lizard.html\n \n don't make me laugh. for one thing lizards have legs that extremely adaptive to environmental conditions. Second, this was not a controlled experiment. \n \n An example is shown above, and more beneficial mutation examples can be found here.\n \n um...you forgot the word \"random.\" Try again. \n \n Mice that had their tails chopped off bred to produce offspring with tails. I assume you remember that experiment?\n \n you need to go back and re-read my recent post called \"let's get lamarckism straight.\" the mice thing was a dishonest experiment of lamarckian inheritance.\n \n You mean these findings? Let's take a look at Mary Schweitzer's (the person who did most of the work) response to the misinterpretation of the data:\n \n who cares what somebody says? I'm asking for a mechanism that would preserve soft tissue for 65 million years. now where is it? \n \n Here's the name and some info. You can find the fossils yourself.\n Aegyptopithecus\n \n nice try. Show me over at talk origins where they claim this is our common ancestor. I'd also like to see evidence or proof.\n \n \n \n http://contradictions.darwin.ws/htree.jpg\n \n lol...and what exactly is the name of that creature leading to homo erectus??? I can't quite read it.\n \n Consider this:\"This means that carbon dating can only be used to date things that existed 50,000 years ago or less. It wouldn't be of any help in dating a dinosaur, for instance, because the last dinosaurs went extinct about 65 million years ago.\"If you think that this looks like helpful evidence, consider what an absence of radioactive carbon-14 means: the object in question is over 50,000 years old (which rules out recent existence).\n \n that's circular reasoning at its finest. I can show you where dinosaurs have been dated at 9,000-15,000 years via carbon 14. don't you think it's odd that they've NEVER been tested by the scientific establishment?...even just for fun? don't you think science would be a little more honest if they did the test just rule out the possibility that dinosaurs are young? I guess not......but my point stands which is that science is full of chickens.\n \n And if we fail to come up with nothing?\n \n yeap...nothing.\n\n \n All you really said to all of his arguments was \"nope, they're not true, and I'm right\" without showing any scientific evidence to back your claim.", 
   {
    "unicode_changes_made": true
   }, 
   246159, 
   null, 
   1168074240.0
  ], 
  [
   246167, 
   null, 
   "johnhanks", 
   "So where are all the necessary MILLIONS and MILLIONS of fossil hominid bones necessary to support an earth that's been around for a billion years or more?\n\n Others are answering your absurdities in far more detail, but I'll just chip in here and underline this particularly asinine challenge. For your question to make sense, evolutionary biologists would have to be claiming that hominids have been around for the earth's entire history: even a schoolchild knows that is not the case. The earth has probably existed some 4 billion years; life about 3-3.5. Hominids have been around a few million years at most - approximately one-thousandth of life's history.\n \n Add to that the fact that the ecological circumstances of early hominids make their fossilisation very unlikely, and frankly 4000-and-rising is a pretty good count.", 
   {}, 
   246070, 
   null, 
   1168075260.0
  ], 
  [
   246177, 
   null, 
   "jitobear", 
   "It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.\n\n \n I am a total new-comer to this thread. Do you have any idea how you lost every shred of credibility you might of had right here? You are in the middle of an argument about science and you resort to insults, generalizations and stereotypes? Pathetic.\n \n I/we don't know all the answers. I think thats exciting. Trying to figure out God's creation is fun, fascinating, cool. The scientists who have tried, and the creation itself, do much more to endear me to God than any hate-mongering Bible thumper does.\n \n Why can't your scientist work with others on their findings? Figure out what they have all learned and see how it all works together. But they don't - their only goal seems to be insult - no effort in further learning. \n \n I also agree with other posters - the age of this earth, evolution, etc. are far more miraculous than a some dude with a beard going \"POOF I MADE THE WORLD\".", 
   {}, 
   245936, 
   null, 
   1168100760.0
  ], 
  [
   246216, 
   null, 
   "Shooterandproud", 
   "It's all political. Science has all kinds of political ramifications. If the atheists can successfully steer people away from God, they can get them voting for the abortion-loving, tax-raising, American-hating party known as the Communists -- er -- Democrats.\n\n \n You're kidding right? The Liberal democrats are the ones who gave women the right to vote, the liberals are the ones who abolished slavery, the liberals are the ones who gave blacks civil rights. And you know who opposed them? The conservative bigots. The conservative bigots have done so many horrible things that I don't have enough computer memory to list them. THEY advocated slavery, THEY tried to take women's right to vote away, THEY are trying to take away a woman's right to choose, THEY opposed civil rights for blacks and gays, THEY advocate tax cuts for the rich and pretty much want the poor to starve, THEY are trying to legislate christian values into laws. See how many horrible things those anarchists have done? So think next time before you throw \"liberal\" or \"democrat\" at our feet like its trash.\n \n \n May I also add that the Republicans Murdered over 600,000 people plus over 3,000 American kids? Not to mencion the advocating of the death penalty. Its quite funny that you have the nerve to insult Democrats when the Republican's sewer is full of corrupt laws and dead bodies and corperate greed. Shame on you.", 
   {}, 
   246177, 
   null, 
   1168126500.0
  ], 
  [
   246220, 
   null, 
   "Collin", 
   "No, please stay on the topic at hand.", 
   {}, 
   246216, 
   null, 
   1168129140.0
  ], 
  [
   246239, 
   null, 
   "supersport", 
   "You're kidding right? The Liberal democrats are the ones who gave women the right to vote, the liberals are the ones who abolished slavery, the liberals are the ones who gave blacks civil rights. And you know who opposed them? The conservative bigots. The conservative bigots have done so many horrible things that I don't have enough computer memory to list them. THEY advocated slavery, THEY tried to take women's right to vote away, THEY are trying to take away a woman's right to choose, THEY opposed civil rights for blacks and gays, THEY advocate tax cuts for the rich and pretty much want the poor to starve, THEY are trying to legislate christian values into laws. See how many horrible things those anarchists have done? So think next time before you throw \"liberal\" or \"democrat\" at our feet like its trash.\n \n \n May I also add that the Republicans Murdered over 600,000 people plus over 3,000 American kids? Not to mencion the advocating of the death penalty. Its quite funny that you have the nerve to insult Democrats when the Republican's sewer is full of corrupt laws and dead bodies and corperate greed. Shame on you.\n\n \n \n er...how did republicans kill 600,000 people and over 3000 kids? \n \n how many people have the atheist communists + abortion rights people killed in the past century? It's no-doubt in the multi-millions. You people evidently have no problem sticking a scalpel in babies heads -- you sick, pathetic freak murderers make me want to throw up.\n \n And your assertion that conservative Christians opposed the abolishment of slavery is absurd. Probably 90% of this country was Christian back in the 1800s. Slavery, along with mistreatment of women and minorities was a world-wide phenomenon that stretch back as far as history will let us see. President Lincoln was a republican. Christians are not perfect, but they have fought all over the world for the end of slavery and the mistreatment of people -- and this continues today. Your statement about wanting poor people to starve simply reflects your blatant dishonesty.", 
   {}, 
   246216, 
   null, 
   1168145400.0
  ], 
  [
   246240, 
   null, 
   "supersport", 
   "You're kidding right? The Liberal democrats are the ones who gave women the right to vote, the liberals are the ones who abolished slavery, the liberals are the ones who gave blacks civil rights. And you know who opposed them? The conservative bigots. The conservative bigots have done so many horrible things that I don't have enough computer memory to list them. THEY advocated slavery, THEY tried to take women's right to vote away, THEY are trying to take away a woman's right to choose, THEY opposed civil rights for blacks and gays, THEY advocate tax cuts for the rich and pretty much want the poor to starve, THEY are trying to legislate christian values into laws. See how many horrible things those anarchists have done? So think next time before you throw \"liberal\" or \"democrat\" at our feet like its trash.\n \n \n May I also add that the Republicans Murdered over 600,000 people plus over 3,000 American kids? Not to mencion the advocating of the death penalty. Its quite funny that you have the nerve to insult Democrats when the Republican's sewer is full of corrupt laws and dead bodies and corperate greed. Shame on you.\n\n \n \n er...how did republicans kill 600,000 people and over 3000 kids? \n \n how many people have the atheist communists + abortion rights people killed in the past century? It's no-doubt in the multi-millions. You people evidently have no problem sticking a knives in babies heads and then sucking their brains out -- you sick, pathetic freak murderers make me want to throw up.\n \n And your assertion that conservative Christians opposed the abolishment of slavery is absurd. Probably 90% of this country was Christian back in the 1800s. Slavery, along with mistreatment of women and minorities was a world-wide phenomenon that stretched back as far as history will let us see. President Lincoln was a republican. Christians are not perfect, but they have fought all over the world for the end of slavery and the mistreatment of people -- and this continues today. Your statement about republicans/Christians wanting poor people to starve simply reflects your blatant dishonesty.", 
   {}, 
   246216, 
   null, 
   1168145460.0
  ], 
  [
   246244, 
   null, 
   "Collin", 
   "\n er...how did republicans kill 600,000 people and over 3000 kids?\n \n\n \n He's referring to the Iraq War. Just let it go. No one's going to think any less of you if you refuse to participate in the off-topic banter.", 
   {}, 
   246240, 
   null, 
   1168150020.0
  ], 
  [
   246284, 
   null, 
   "supersport", 
   "jitobear:\n \n \n I also agree with other posters - the age of this earth, evolution, etc. are far more miraculous than a some dude with a beard going \"POOF I MADE THE WORLD\n \n You know, if I had to believe in a God that was \"some dude with a beard going poof I made the world\" I wouldn't believe it either. See that's the problem with so many people. They don't give God credit for what He is. For one thing, God is not flesh just like you are not flesh. Oh, sure, you have bones and skin and muscles, but those are not what makes you YOU. You, whatever or whoever that is, is swimming somewhere between those little physical particles in your brain. You are invisible. You are the spiritual entity which controls your physical body. Likewise God is invisible. We are both invisible, spiritual entities. And just like we are able to manipulate our physical lives with thought, God is also able to manipulate the physical with HIS thought. Obviously His ways are different than our ways -- He is the Creator of everything...we are just part of His creation. \n \n And since God thought of, and then created everything around us, this is why He is worthy of your praise -- not your insults. He thought of everything, including you, and then made everything a reality.", 
   {}, 
   246177, 
   null, 
   1168195920.0
  ], 
  [
   246286, 
   null, 
   "Collin", 
   "You know, if I had to believe in a God that was \"some dude with a beard going poof I made the world\" I wouldn't believe it either. See that's the problem with so many people. They don't give God credit for what He is. For one thing, God is not flesh just like you are not flesh. Oh, sure, you have bones and skin and muscles, but those are not what makes you YOU. You, whatever or whoever that is, is swimming somewhere between those little physical particles in your brain. You are invisible. You are the spiritual entity which controls your physical body. Likewise God is invisible. We are both invisible, spiritual entities. And just like we are able to manipulate our physical lives with thought, God is also able to manipulate the physical with HIS thought. Obviously His ways are different than our ways -- He is the Creator of everything...we are just part of His creation.\n \n And since God thought of, and then created everything around us, this is why He is worthy of your praise -- not your insults. He thought of everything, including you, and then made everything a reality.\n\n \n What makes us \"us\" is the neural pattern in our brains. We know this because if you remove or fiddle with parts of the brain, either with chemicals or operating tools, you stop being \"you\". On the other hand, if you remove something like an abdominal organ or appendage, you are still \"you\".", 
   {}, 
   246284, 
   null, 
   1168197780.0
  ], 
  [
   246287, 
   null, 
   "supersport", 
   "What makes us \"us\" is the neural pattern in our brains. We know this because if you remove or fiddle with parts of the brain, either with chemicals or operating tools, you stop being \"you\". On the other hand, if you remove something like an abdominal organ or appendage, you are still \"you\".\n\n \n Likewise, you would stop being \"you\" if I hit you over the head with a sledge hammer. What's the difference? Indeed, an engine cannot run without all its physical, working parts...that does not disqualify though, that the spiritual controls the physical.\n \n I've got a lawn mower. If that mower has no gas in it, it will just sit there, not running. However, once someone pours gas in the tank and pulls the cord, walah!...the engine starts and the mower runs. Of Course, if I \"fiddled\" with the carburetor beforehand, it would not start. This does not disqualify, though, that the mower needs more than its physical parts to start. Your little brain analogy is no different.", 
   {}, 
   246286, 
   null, 
   1168198380.0
  ], 
  [
   246295, 
   null, 
   "Collin", 
   "Likewise, you would stop being \"you\" if I hit you over the head with a sledge hammer. What's the difference? Indeed, an engine cannot run without all its physical, working parts...that does not disqualify though, that the spiritual controls the physical.\n\n \n Yes it does. The spiritual is not bound by the health status of the physical. With your reasoning, you should be \"you\" no matter how hard someone hit you over the head with a sledgehammer. Drugs should not affect the spiritual either.", 
   {}, 
   246287, 
   null, 
   1168199040.0
  ], 
  [
   246296, 
   null, 
   "Hi_Its_Me", 
   "you are not flesh. Oh, sure, you have bones and skin and muscles, but those are not what makes you YOU. You, whatever or whoever that is, is swimming somewhere between those little physical particles in your brain. You are invisible. You are the spiritual entity which controls your physical body.\n\n Why does this remind me so much of WW's \"vitality\"?\n \n It's the same concept with a different take.", 
   {}, 
   246284, 
   null, 
   1168199280.0
  ], 
  [
   246297, 
   null, 
   "Collin", 
   "\n I've got a lawn mower. If that mower has no gas in it, it will just sit there, not running. However, once someone pours gas in the tank and pulls the cord, walah!...the engine starts and the mower runs. Of Course, if I \"fiddled\" with the carburetor beforehand, it would not start. This does not disqualify, though, that the mower needs more than its physical parts to start. Your little brain analogy is no different.\n\n \n The mower is dead if it has no gasoline to run off of. Putting gasoline into the mower and pulling the starter string is no different than jump-starting a human body with a defibrillator. The mower rots slower, so you have several years to decide whether or not you want to put more gasoline in it and start the engine, whereas you only have a precious minute to decide if you want to start a human heart.\n \n Both jump-starting techniques are purely physical. No spiritual activity needed for either one.", 
   {}, 
   246296, 
   null, 
   1168199760.0
  ], 
  [
   246318, 
   null, 
   "supersport", 
   "The mower is dead if it has no gasoline to run off of. Putting gasoline into the mower and pulling the starter string is no different than jump-starting a human body with a defibrillator. The mower rots slower, so you have several years to decide whether or not you want to put more gasoline in it and start the engine, whereas you only have a precious minute to decide if you want to start a human heart.\n \n Both jump-starting techniques are purely physical. No spiritual activity needed for either one.\n\n \n lol...you are one deluded person. If you think life is just a matter of all the physical atoms being lined up in the right order you've got a mental problem. LIfe is an act -- it's a verb. It's something that happens...starting with the moment that the egg is fertilzied by the sperm and it swirls around and somehow forms a new life. Science cannot pinpoint exactly what life is and that's because life is not mechanistic. Life is a miracle that cannot be explained by looking at matter. There is, indeed, a \"Ghost in the Machine.\" You are just tainted by all your atheist reading to realize it.", 
   {}, 
   246297, 
   null, 
   1168214400.0
  ], 
  [
   246319, 
   null, 
   "Hi_Its_Me", 
   "lol...you are one deluded person. If you think life is just a matter of all the physical atoms being lined up in the right order you've got a mental problem. LIfe is an act -- it's a verb. It's something that happens...starting with the moment that the egg is fertilzied by the sperm and it swirls around and somehow forms a new life. Science cannot pinpoint exactly what life is and that's because life is not mechanistic. Life is a miracle that cannot be explained by looking at matter. There is, indeed, a \"Ghost in the Machine.\" You are just tainted by all your atheist reading to realize it.\n\n Alternatively, you are biased by your religion. I notice that you have no evidence for your claims except for your claims themselves.\n On the other hand, we can provide evidence that live can occur based on chemical reactions and mechanical interactions alone.\n \n By the way, this argument you are making looks similar to the arguments that WW has been making recently. Is that a coincidence?", 
   {}, 
   246318, 
   null, 
   1168215300.0
  ], 
  [
   246321, 
   null, 
   "supersport", 
   "Alternatively, you are biased by your religion. I notice that you have no evidence for your claims except for your claims themselves.\n On the other hand, we can provide evidence that live can occur based on chemical reactions and mechanical interactions alone.\n \n By the way, this argument you are making looks similar to the arguments that WW has been making recently. Is that a coincidence?\n\n \n are you saying we are one in the same? How could I pull that off? -- I'm all into creative writing but I could never dream of masquerading as an atheist and a YEC at the same, appearing to be on the same page on many issues. That would be a pretty good trick. Besides that, WW is much more knowledgeable and articulate than I am regarding evolution.", 
   {}, 
   246319, 
   null, 
   1168216260.0
  ], 
  [
   246326, 
   null, 
   "Hi_Its_Me", 
   "are you saying we are one in the same? How could I pull that off? -- I'm all into creative writing but I could never dream of masquerading as an atheist and a YEC at the same, appearing to be on the same page on many issues. That would be a pretty good trick. Besides that, WW is much more knowledgeable and articulate than I am regarding evolution.\n\n I don't actually think that you two are the same person anymore, considering that if one person had the two accounts, that person would have dropped yours to avoid confusion.\n \n [edit: above statement rescinded]", 
   {}, 
   246321, 
   null, 
   1168222080.0
  ], 
  [
   246328, 
   null, 
   "jitobear", 
   "jitobear:\n \n \n I also agree with other posters - the age of this earth, evolution, etc. are far more miraculous than a some dude with a beard going \"POOF I MADE THE WORLD\n \n You know, if I had to believe in a God that was \"some dude with a beard going poof I made the world\" I wouldn't believe it either. See that's the problem with so many people. They don't give God credit for what He is. For one thing, God is not flesh just like you are not flesh. Oh, sure, you have bones and skin and muscles, but those are not what makes you YOU. You, whatever or whoever that is, is swimming somewhere between those little physical particles in your brain. You are invisible. You are the spiritual entity which controls your physical body. Likewise God is invisible. We are both invisible, spiritual entities. And just like we are able to manipulate our physical lives with thought, God is also able to manipulate the physical with HIS thought. Obviously His ways are different than our ways -- He is the Creator of everything...we are just part of His creation. \n \n And since God thought of, and then created everything around us, this is why He is worthy of your praise -- not your insults. He thought of everything, including you, and then made everything a reality.\n\n \n \n Excellent job of completely missing my point there, Sparky.", 
   {}, 
   246284, 
   null, 
   1168224780.0
  ], 
  [
   246337, 
   null, 
   "Shooterandproud", 
   "jitobear:\n \n \n I also agree with other posters - the age of this earth, evolution, etc. are far more miraculous than a some dude with a beard going \"POOF I MADE THE WORLD\n \n You know, if I had to believe in a God that was \"some dude with a beard going poof I made the world\" I wouldn't believe it either. See that's the problem with so many people. They don't give God credit for what He is. For one thing, God is not flesh just like you are not flesh. Oh, sure, you have bones and skin and muscles, but those are not what makes you YOU. You, whatever or whoever that is, is swimming somewhere between those little physical particles in your brain. You are invisible. You are the spiritual entity which controls your physical body. Likewise God is invisible. We are both invisible, spiritual entities. And just like we are able to manipulate our physical lives with thought, God is also able to manipulate the physical with HIS thought. Obviously His ways are different than our ways -- He is the Creator of everything...we are just part of His creation. \n \n And since God thought of, and then created everything around us, this is why He is worthy of your praise -- not your insults. He thought of everything, including you, and then made everything a reality.\n\n \n \n Thats darling and all, but I'd really like to see all of your scientific evidence. It would be interesting to find what lead you to believe in an omnipotent entity that just made everything out of nothing, and I would also like to see your evidence of \"you\" being an invisible spiritual entity. This is what happens when people of low intelligence can not comprehend the universe's and life's wonders, they try to make it into some weird magic thing happening and the whole world going \"poof!\" out of nowhere. I do believe in god, but not the god that less intelligent people refer to when trying to comprehend something when they do not posses enough intelligence to do so. If you actually thought about something once in awhile, really meditated deeply on it, you'd find out that the concept of a God is completely illogical, and would go against pretty much all sense for such a being to exist. Especially one that acts like a human (please refer to the bible).", 
   {}, 
   246284, 
   null, 
   1168226700.0
  ], 
  [
   246338, 
   null, 
   "Shooterandproud", 
   "lol...you are one deluded person. If you think life is just a matter of all the physical atoms being lined up in the right order you've got a mental problem. LIfe is an act -- it's a verb. It's something that happens...starting with the moment that the egg is fertilzied by the sperm and it swirls around and somehow forms a new life. Science cannot pinpoint exactly what life is and that's because life is not mechanistic. Life is a miracle that cannot be explained by looking at matter. There is, indeed, a \"Ghost in the Machine.\" You are just tainted by all your atheist reading to realize it.\n\n \n I know it seems hard for what little intelligence you have to comprehend, but I believe that pretty much everything can be solved with a simple mathematical equation. Well, maybe not a simple equation, but an equation nonetheless. This magical omnipotent hypothesis of yours is only an outlet for anything that you cannot understand. And if you can't understand something, don't make things up. Creationism is exactly that. People of an earlier time could not find out how everything came to be, so they decided to make something up, with no evidence or base. Creationism is such a primitive hypothesis that we must move out of one day, because it is holding us back. We must be teaching out children about all of the new breakthroughs in science and evolution, as they are our next generation, and not forcing primitive mindsets and ideas such as creationism into them. Sport may not be ignorant, he is just unenlightened, just like his group of followers compared to the rest of the world.\n \n \n And to clear things up, if this \"God\" exists, he surely wouldn't have made us better than everything else. We are just another part of nature, and part of a vast universe. I believe that there is much intelligent life in the universe, maybe some more intelligent than us. But, it is just too far away, and the universe is just too big. We'll probably never know. However, maybe when we become smarter, or evolve far enough to have a much more intelligence and mental capacity than we do now, then maybe we will start understanding the wonder of the universe and space. But until then, we should not be channeling our wonders that we cannot comprehend into make-believe spirit tales. There is so much more out there than the confinds of your religions. All you need to do is look.", 
   {}, 
   246318, 
   null, 
   1168227360.0
  ], 
  [
   246339, 
   null, 
   "supersport", 
   "Thats darling and all, but I'd really like to see all of your scientific evidence. It would be interesting to find what lead you to believe in an omnipotent entity that just made everything out of nothing, and I would also like to see your evidence of \"you\" being an invisible spiritual entity. This is what happens when people of low intelligence can not comprehend the universe's and life's wonders, they try to make it into some weird magic thing happening and the whole world going \"poof!\" out of nowhere. I do believe in god, but not the god that less intelligent people refer to when trying to comprehend something when they do not posses enough intelligence to do so. If you actually thought about something once in awhile, really meditated deeply on it, you'd find out that the concept of a God is completely illogical, and would go against pretty much all sense for such a being to exist. Especially one that acts like a human (please refer to the bible).\n\n \n \n you know I cannot prove God created the world with scientific proof....but neither can you prove the origin of life from non-life with scientific proof. \n \n I would say, however, that the genetic code is a pretty good indication of an intelligent being: common sense says a code of that complexity would require an intelligent sender.", 
   {}, 
   246337, 
   null, 
   1168227420.0
  ], 
  [
   246345, 
   null, 
   "Hi_Its_Me", 
   "I would say, however, that the genetic code is a pretty good indication of an intelligent being: common sense says a code of that complexity would require an intelligent sender.\n\n Which would require an even more intelligent \"sender,\" because that first intelligent sender would have to be even more complex, and your logic declares that complex things could only arise from intelligent entities.\n \n Here are the facts: a very complex set of data can arise without any intelligence whatsoever. Just take a look at a beach. The sand is arranged in an incredibly complex pattern, but I doubt a designer was involved.", 
   {}, 
   246339, 
   null, 
   1168230240.0
  ], 
  [
   246353, 
   null, 
   "supersport", 
   "Which would require an even more intelligent \"sender,\" because that first intelligent sender would have to be even more complex, and your logic declares that complex things could only arise from intelligent entities.\n \n Here are the facts: a very complex set of data can arise without any intelligence whatsoever. Just take a look at a beach. The sand is arranged in an incredibly complex pattern, but I doubt a designer was involved.\n\n \n your example is pathetic. absolutely schoolboy pathetic. I could drop a rock off a cliff and it will go down, too. That in no way invalidates how something as complex as a genetic code should come from an intelligent designer....especially considering random mutations and natural selection have IQs of jack squat.", 
   {}, 
   246345, 
   null, 
   1168238100.0
  ], 
  [
   246356, 
   null, 
   "Collin", 
   "your example is pathetic. absolutely schoolboy pathetic. I could drop a rock off a cliff and it will go down, too. That in no way invalidates how something as complex as a genetic code should come from an intelligent designer....especially considering random mutations and natural selection have IQs of jack squat.\n\n \n I hate to burst your bubble, but molecules more complex than DNA form before our own eyes all the time.", 
   {}, 
   246353, 
   null, 
   1168238880.0
  ], 
  [
   246365, 
   null, 
   "electrolyte", 
   "your example is pathetic. absolutely schoolboy pathetic. I could drop a rock off a cliff and it will go down, too. That in no way invalidates how something as complex as a genetic code should come from an intelligent designer....especially considering random mutations and natural selection have IQs of jack squat.\n\n Define the adjective \"complex.\"", 
   {}, 
   246353, 
   null, 
   1168243020.0
  ], 
  [
   246386, 
   null, 
   "supersport", 
   "I hate to burst your bubble, but molecules more complex than DNA form before our own eyes all the time.\n\n \n please humor me...how does this happen...along with a link? Are you saying that DNA just \"formed\"?", 
   {}, 
   246356, 
   null, 
   1168278180.0
  ], 
  [
   246874, 
   null, 
   "SLP", 
   "please humor me...how does this happen...along with a link? Are you saying that DNA just \"formed\"?\n\n \n \n Sure.\n It happens in space.\n \n \n Or are you asking a different question?", 
   {}, 
   246386, 
   null, 
   1168621560.0
  ], 
  [
   246875, 
   null, 
   "SLP", 
   "your example is pathetic. absolutely schoolboy pathetic. \nI guess you would be the expert at that, eh?\n emoticon_xkill", 
   {}, 
   246353, 
   null, 
   1168621680.0
  ], 
  [
   246878, 
   null, 
   "SLP", 
   "\n I would say, however, that the genetic code is a pretty good indication of an intelligent being: common sense says a code of that complexity would require an intelligent sender.\n\n \n Really? Why?", 
   {}, 
   246339, 
   null, 
   1168622580.0
  ], 
  [
   249163, 
   null, 
   "SLP", 
   "bump\n \n Note how SS relies on quantity rather than quality in his anti-evolution crusade....", 
   {}, 
   246878, 
   null, 
   1170347760.0
  ], 
  [
   249310, 
   null, 
   "obvious_child", 
   "bump\n \n Note how SS relies on quantity rather than quality in his anti-evolution crusade....\n\n \n Creationists know they cannot stay on one topic for long. Therefore, they must keep producing new arguments (which are really just rehased refuted ones that people have forgotten that the same user made last month). It's called the shotgun stragety and creationists rely on seemingly endless amount of rounds.", 
   {}, 
   249163, 
   null, 
   1170407460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  ToE: The Biggest Fraud of all-time", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9401-toe-biggest-fraud-all-time.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9401, 
  "discussion_files": [
   [
    "17351.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9401-toe-biggest-fraud-all-time-print.html"
   ], 
   [
    "17352.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9401-toe-biggest-fraud-all-time-5-print.html"
   ], 
   [
    "17353.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9401-toe-biggest-fraud-all-time-4-print.html"
   ], 
   [
    "17354.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9401-toe-biggest-fraud-all-time-3-print.html"
   ], 
   [
    "17355.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9401-toe-biggest-fraud-all-time-2-print.html"
   ]
  ], 
  "identifier": 9401
 }
]