[
 [
  [
   14609, 
   null, 
   "fallingupwards", 
   "I noticed that most (if not all) of the pro-gunners on this board support a passenger's and a terrorist's right to carry a deadly weapon on a plane. Which leads me to ask another question that I once thought absurd, but considering that I'm dealing with some gun fanatics here, ya never know.\n \n Would you support a high school student's right to bring a gun to school? Why or why not?", 
   {
    "post_info": {
     "post_title": "a question for those in favor of guns and violence"
    }
   }, 
   null, 
   null, 
   1062981240.0
  ], 
  [
   14610, 
   null, 
   "AMD4EVER", 
   "One thing that I've learned from debating here is that although a person can sound extremely pro-gun, they might just be strongly against violating the constitution. I'll agree that the constitution does leave it pretty difficult to defend gun control.\n \n Amendment II\n \n \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\"\n \n That means the right of people regardless of age, gender, or nationality and it really doesn't say where people can and can't keep and bear arms. Perhaps their are laws in place that restrict some of what the 2nd amendment put forth and in the case of High Schools I believe there are.", 
   {}, 
   14609, 
   null, 
   1062981900.0
  ], 
  [
   14617, 
   null, 
   "kelvin90701", 
   "I noticed that most (if not all) of the pro-gunners on this board support a passenger's and a terrorist's right to carry a deadly weapon on a plane. Which leads me to ask another question that I once thought absurd, but considering that I'm dealing with some gun fanatics here, ya never know.\n \n Would you support a high school student's right to bring a gun to school? Why or why not?\n\n \n Anyone under 18 is not a full citizen and does not have the full rights of a citizen. There is no Constitutional issue of prohibiting minors to have firearms. What is so fanatical about that?", 
   {}, 
   14609, 
   null, 
   1062986160.0
  ], 
  [
   14619, 
   null, 
   "fallingupwards", 
   "What about high school seniors who are 18 or 19. Shouldnt they be allowed to bring their guns inside the classroom?", 
   {}, 
   14617, 
   null, 
   1062993840.0
  ], 
  [
   14621, 
   null, 
   "kelvin90701", 
   "What about high school seniors who are 18 or 19. Shouldnt they be allowed to bring their guns inside the classroom?\n\n \n I believe you know my answer to that. \n \n But your question is moot. Please show me a 18 or 19 year old in high school who has all thier rights intact (not a convicted criminal) who wants to carry a gun to class.\n \n The short answer: I'll care about the ban when it does violate the Constitution. Your not going to find anyone to challenge the law.\n \n Personally I will not carry a firearm to a highschool. That is my personal choice. The consequences to me if I screw up with a firearm are too great, at the same time I would not restrict any citizen who wants to do so. If I find the need to be at a highschool, I am hoping that a gunman is going to shoot a lot of kids before he shoots me. That is what happens to the rest of society when you stop people who want to carry firearms. The good people who want to carry, hope that a lot of other people are going to get shot first before it is thier turn. It does not even have to be a gun, it can be any weapon. A criminals weapon vs. a good citizens \"hope\", criminals win.", 
   {}, 
   14619, 
   null, 
   1062996060.0
  ], 
  [
   14624, 
   null, 
   "AMD4EVER", 
   "Personally I will not carry a firearm to a highschool. That is my personal choice. The consequences to me if I screw up with a firearm are too great, at the same time I would not restrict any citizen who wants to do so. If I find the need to be at a highschool, I am hoping that a gunman is going to shoot a lot of kids before he shoots me. That is what happens to the rest of society when you stop people who want to carry firearms. The good people who want to carry, hope that a lot of other people are going to get shot first before it is thier turn. It does not even have to be a gun, it can be any weapon. A criminals weapon vs. a good citizens \"hope\", criminals win.\n\n \n I don't understand what point your trying to make here.\n \n Good citizens vs criminals with the criminals 'winning' is usually not the way it goes. Good citizens are the ones who catch and throw the criminals in jail. They are our police officers, the anonymous tipsters, and the countless law abiding citizens in our country. The way your talking you act like the only way for the good citizens to win is to have a gun or be ready to use force.\n \n If you want to do one better you could eliminate guns completely in order to lower the risk of deaths in gun fights. You can't debate the fact that less guns equals less murders. You can debate that without guns there would be more deaths to other weapons although you can't debate it would be to the same extent as gun murders and crimes would be.\n \n You talk about hope like it rests on whether you have the ability to kill another person or not. The criminals are the ones that have to hope. They are the ones who are outnumbered thousands to one and their weapon isn't going to protect them from that.\n \n \n I'm not trying to make the case that guns should be banned. I'm not trying to make the case that all criminals will get caught. I'm not trying to make the case that we are already in the best possible system for fighting crime or when it comes to gun control. What I am saying is that you cannot possible expect that just because our society doesn't expect people to carry around guns that the criminals will be able to walk all over us. They are the ones who are running most of the time. They are the ones who have their lives taken away most of the time. They are the ones who have their lives ruined and ruin the lives of the ones they know most of the time. I'd much rather be a good citizen without a weapon than a criminal with one for I know who has the odds on their side.", 
   {}, 
   14621, 
   null, 
   1062997500.0
  ], 
  [
   14627, 
   null, 
   "fallingupwards", 
   "Personally I will not carry a firearm to a highschool. That is my personal choice. \n\n \n That shocks me. Wouldnt you want to protect yourself against people like the Trench Coat Mafia? Remember Columbine? Why wouldnt you bring your guns to school? Whats the difference between bringing it to school and bringing it on an airplane?", 
   {}, 
   14621, 
   null, 
   1062999180.0
  ], 
  [
   14667, 
   null, 
   "kelvin90701", 
   "That shocks me. Wouldnt you want to protect yourself against people like the Trench Coat Mafia? Remember Columbine? Why wouldnt you bring your guns to school? Whats the difference between bringing it to school and bringing it on an airplane?\n\n \n Personal choice is not unconstitutinal. So stop trying to force me to do what you want. Plus I have other unarmed targets at a school who are probably going to get shot first. I weigh the risks and the benefits, my personal choice, which is not unconstitutional. \n \n Your really stretching? What are you stretching? Does any of this make sense to anyone here? Does any one here understand what falling is trying to say? I sure don't. I thought you were anti-gun. I applaud your decision to finally become pro-gun.\n \n It is also about rule of law, the highest law, the Constitution. Which in your pro-gun effort you are still trying to trample all over. I welcome your conversion, but please, all must be done with in the frame work of the Constitution. I would not want any pro-gun legislation that would weaken the rights of good cititizens, modify thier behavior, or change them in any way.\n \n Dude your pshyco. Trying to put guns in a school and trample the Constitution. I encourage putting guns in a school, but all done Constitutionally. So please quit trying of creative ways to avoid the Constitution.", 
   {}, 
   14627, 
   null, 
   1063076520.0
  ], 
  [
   14668, 
   null, 
   "kelvin90701", 
   "Good citizens are the ones who catch and throw the criminals in jail. They are our police officers, the anonymous tipsters, and the countless law abiding citizens in our country.\n\n \n Your living in a makebelieve land. Cops are the clean up the mess after a crime. \n \n Felon with knife vs 911 call. Knife wins. Are the cops going to get to you faster than the felon next to you in a parking lot? The cops will get there fast enough to direct traffic so the medics do not have to search for you underneath a car in the parking lot.\n \n Rapist vs anonymous call. Rapist wins. Is the anonymous call going to stop the rape at the moment. The cops should just get there fast enough for the rapist to put his pants back on and drive away for the police to take down his license plate.\n \n Angry ex-boyfriend vs restraining order. Girlfriend get beaten to a pulp. Cops arrive in time to do nothing but dial a medic for her.\n \n Countless unarmed citizens will do what most New Yorkers do when then see a crime in progress, DON'T GET INVOLVED.", 
   {}, 
   14624, 
   null, 
   1063077120.0
  ], 
  [
   14669, 
   null, 
   "fallingupwards", 
   "I think it is quite obvious that I am playing the devil's advocate. Of course I am against 19 year old high school students from bringing guns into their classrooms. I just wanted to know your opinion on the matter.\n \n If you support allowing terrorists to carry guns on planes, why wouldnt you support legal high school students from bringing guns on campus? I just want to know. I never said that I support it.", 
   {}, 
   14668, 
   null, 
   1063077240.0
  ], 
  [
   14671, 
   null, 
   "kelvin90701", 
   "\n \n \n If you want to do one better you could eliminate guns completely in order to lower the risk of deaths in gun fights. You can't debate the fact that less guns equals less murders. You can debate that without guns there would be more deaths to other weapons although you can't debate it would be to the same extent as gun murders and crimes would be.\n \n I'd much rather be a good citizen without a weapon than a criminal with one for I know who has the odds on their side.\n\n \n First priciple: gun control must not change, modify, or engineer good citizens. Good control as you have stated will change both good citizens and criminal alike. You need to do a better job and think of another gun control way that does not affect good citizens or trash the Constitution. Your still thinking of ways that trash good citizens rights. You need to try harder.\n \n Ever meet a felon? They have nothing to do all day but pump iron in prison. I for one will not play fair to save my life. I will do every dirty trick in the book to save my life. I will not play nice with a criminal. Criminals practice hurting people. They think about it all the time. That is what you do in prison. You practice hurting people so you don't get killed while you are in prison. They are quite good at taking human life with just thier bare hands. The odds are not on your side.\n \n In my town a few years ago a 90 lb woman shot and killed her unarmed attacker. It was rulled justified. A 90 lb woman vs an average sized man can be killed with bare hands if the distance gets closed. What do you say to 90 lb women? The odds are really on your side?", 
   {}, 
   14624, 
   null, 
   1063077840.0
  ], 
  [
   14680, 
   null, 
   "AMD4EVER", 
   "First priciple: gun control must not change, modify, or engineer good citizens. Good control as you have stated will change both good citizens and criminal alike. You need to do a better job and think of another gun control way that does not affect good citizens or trash the Constitution. Your still thinking of ways that trash good citizens rights. You need to try harder.\n \n Ever meet a felon? They have nothing to do all day but pump iron in prison. I for one will not play fair to save my life. I will do every dirty trick in the book to save my life. I will not play nice with a criminal. Criminals practice hurting people. They think about it all the time. That is what you do in prison. You practice hurting people so you don't get killed while you are in prison. They are quite good at taking human life with just thier bare hands. The odds are not on your side.\n \n In my town a few years ago a 90 lb woman shot and killed her unarmed attacker. It was rulled justified. A 90 lb woman vs an average sized man can be killed with bare hands if the distance gets closed. What do you say to 90 lb women? The odds are really on your side?\n\n \n You talk like guns is the solution to crime. Do you think for a moment that you would encounter less crime if everyone around you had a gun? That 90 lb woman could have been shot from a distant building and no criminal may ever have been found if that criminal decided to use a gun. In a shoot out, I'd place my money on the criminal every day of the week just as you would in an unarmed crime. So what has changed? Everyone has a gun, the criminals compensate by using guns, and you have the same level of crime but more death.\n \n Do you think prison would be any different? They would still get their guns. You make anything that accessible and even criminals will be able to get guns easier and I think you would agree that if all they think about is hurting people, they are not going to play fair either. They will be more effective than ever before and will learn to shoot people from a great distance or when people do not have their weapons. They will become better at avoiding direct confrontation with people they want to hurt. How does this solve crime? How does this make you feel more protected?\n \n Guns will not solve crime. Do you agree? Guns may even increase murders. Do you agree? The 90 lb woman will lose 99 times out of 100 in a gun fight assuming she is the typical 90 lb woman. Do you agree? Then why do you want everyone to have guns? The criminals will use them more effectively than the good citizens will and will be just as powerful at killing if not more so. The police will still have the same role.\n \n \nYour living in a makebelieve land. Cops are the clean up the mess after a crime. \n \n Felon with knife vs 911 call. Knife wins. Are the cops going to get to you faster than the felon next to you in a parking lot? The cops will get there fast enough to direct traffic so the medics do not have to search for you underneath a car in the parking lot.\n \n Rapist vs anonymous call. Rapist wins. Is the anonymous call going to stop the rape at the moment. The cops should just get there fast enough for the rapist to put his pants back on and drive away for the police to take down his license plate.\n \n Angry ex-boyfriend vs restraining order. Girlfriend get beaten to a pulp. Cops arrive in time to do nothing but dial a medic for her.\n \n Countless unarmed citizens will do what most New Yorkers do when then see a crime in progress, DON'T GET INVOLVED.\n\n \n \n Felon with gun vs. 911 call. Forget about it. That's worse than the knife. Assuming the person calling 911 has a gun I'll also assume the felon is better trained and better equip. That person is dead more often than not. I doubt the odds are any different than if the person had a knife fight with the felon. Also I think the 'good' citizen would be more likely to have a knife than a gun available to them. You want to change this but I think there are too many people that fear guns to change this any time soon.\n \n Rapist vs anonymous call? Well lets just say it is a murder now rather than a rape. Criminal sees person on phone. Well that's a shot to the head. No need to screw around especially if the criminal thinks the person may be going for their gun since everyone obviously has them.\n \n Angry ex-boyfriend vs restraining order? Hey guess what. Guys will always be more likely to have a gun than girls. We will also be more willing to use them in a heated situation like this. The guy can kill the girl now instead of slap her around. Is that better? The girl still has the disadvantage and now the guy has a gun.\n \n Your living in make believe land if you think that all people will have guns on them at all times. Plus you are living a dream if you think that guns are the solution to fixing the above situations. Felons will still going to try to steal only they will pray on the weak and fight with deadlier force. Rapes will still occur only now the criminal will require a gun before trying this. Ex-boyfriends will still break restraining orders and take out their anger only now they have easy access to guns and will be more likely to use them. The felons, rapists, and ex-boyfriends will all look for the best opportunities to commit their crimes. They will work around the fact that the other person may have a gun by wearing more protection and wielding their own weapons on a hair trigger. More killing is the result. And now the police are regularly chasing people who are better armed than them. That is not a universal solution to crime.\n \n You may want to stick with just debating that it is your constitutional right because you sure are not going to be able to make the case that guns will make people safer and reduce crime. The feeling of protection may rise with a gun, but the reality is that when everyone has one and criminals expect you to have one it doesn't mean near as much.", 
   {
    "unicode_changes_made": true
   }, 
   14668, 
   null, 
   1063084020.0
  ], 
  [
   14682, 
   null, 
   "kelvin90701", 
   "You talk like guns is the solution to crime .\n\n \n Excuse me. Please see \"Root Cause\"", 
   {}, 
   14680, 
   null, 
   1063084620.0
  ], 
  [
   14686, 
   null, 
   "kelvin90701", 
   "I think it is quite obvious that I am playing the devil's advocate. Of course I am against 19 year old high school students from bringing guns into their classrooms. I just wanted to know your opinion on the matter.\n .\n\n \n I am sorry, that opinion is STILL UNCONSTITUTIONAL.\n \n There is a difference. I support any laws that do not violate the Contitution. \n \n 1) Ban under 18. Constitutional.\n \n 2) Gun ban from schools. Constitutional. There are no 19 year olds who have their civil rights violated. (Short answer, I don't really care because no ones rights are violated). Show me a 19 year old high school student who has thier civil rights violated. Your not going to find anyone to challenge the ban.\n \n 3) Blanket ban of guns from high schools. Definately UNCONSTITUTIONAL. \n \n Check yourself. No one even pro-gunners are advocating minors bring guns to school. They want teachers, counselors, and school admin to be able to bring guns. Yes it allows 19 years olds to bring guns to school. Even 19 year olds coming by to pick up thier younger sister.\n \n http://www.csmonitor.com/2003/0729/p01s02-uspo.html", 
   {}, 
   14669, 
   null, 
   1063085340.0
  ], 
  [
   14883, 
   null, 
   "voiceofreason", 
   "I noticed that most (if not all) of the pro-gunners on this board support a passenger's and a terrorist's right to carry a deadly weapon on a plane.\n\n For some reason, this board tends to attract a lot of radical pro-gun extremists. These extremists are not very representative of typical the gun owner. 69% of adults favor stricter gun-control laws. 57% of gunowners want stricter gun-control laws. http://www.harrisinteractive.com/harris_poll/index.asp?PID=182\n \n And what if some 18 year old high school kid wanted to tote a machine gun around from class to class? As Kelvin would say- we can't restrict the rights of a good citizen.\n \n What if people want to bring guns into a courtroom?", 
   {}, 
   14686, 
   null, 
   1063300740.0
  ], 
  [
   14886, 
   null, 
   "AMD4EVER", 
   "And what if some 18 year old high school kid wanted to tote a machine gun around from class to class? As Kelvin would say- we can't restrict the rights of a good citizen.\n \n What if people want to bring guns into a courtroom?\n\n \n I already know his response to this. He will simply say that it is alright. You have to take your questions further. You have to ask what the solution will be if the death toll at schools and in the courtrooms begins to wildly increase due to the presents of guns. There is sufficient evidence and good reason to believe both of these events would be true and there seems to be no real solution.\n \n Kelvin has no trouble accepting the fact that allowing everyone to carry any type of gun they wish into any type of situation they wish means chaos and death increases ten fold. He will flat out say that it is fine because we can't go against the constitution and good citizens should be able to do whatever they want to do. But what he will never say is that he has a solution to these problems that will occur. He will never actually provide something that will just blow you away because he has no solutions. He only has a want and that want is more important than logicistics for some reason.\n \n Now observe as he ignores all the questions surrounding his ideas and proceeds to just talk about the constitution and how we are the ones who are hurting the good citizens of America.", 
   {}, 
   14883, 
   null, 
   1063301580.0
  ], 
  [
   14958, 
   null, 
   "kelvin90701", 
   "\n What if people want to bring guns into a courtroom?\n\n \n You really do not know very much about gun laws do you? There are only to places that are automatically illegal to bring guns into:\n \n 1) Courts\n 2) Polling places.\n \n And the ban in those places are Constitutional.", 
   {}, 
   14883, 
   null, 
   1063345740.0
  ], 
  [
   14976, 
   null, 
   "voiceofreason", 
   "You really do not know very much about gun laws do you? There are only to places that are automatically illegal to bring guns into:\n \n 1) Courts\n 2) Polling places.\n \n And the ban in those places are Constitutional.\n\n Where in the constitution does it say such bans are constitutional? Can you back up your claims? \n \n For some reason, this board tends to attract a lot of radical pro-gun extremists. These extremists are not very representative of typical the gun owner. 69% of adults favor stricter gun-control laws. 57% of gunowners want stricter gun-control laws and 10% of gun owners want neither stricter nor more lax gun-control laws. So only about a third of gun-owners want less gun-control. \n \"Perhaps the most surprising finding here is the strength of support for stricter control among gun owners. Clearly Charlton Heston and the National Rifle Association (NRA) do not represent the majority of gun owners\"\n http://www.harrisinteractive.com/harris_poll/index.asp?PID=182", 
   {}, 
   14958, 
   null, 
   1063358520.0
  ], 
  [
   14985, 
   null, 
   "kelvin90701", 
   "Where in the constitution does it say such bans are constitutional? Can you back up your claims? \n \n \n http://www.harrisinteractive.com/harris_poll/index.asp?PID=182\n\n \n Try and think it though. \n \n 1) Courts and due process. A jurry must be shielded from all external influence to make an unbiased decision. People with firearms at a court house pass a very clear message without words.\n \n 2) Voting. Same as above.\n \n I agree with gun bans that do not violate the Constitution. What is so \"gun-nut\" about that. Please try to keep further ideas regarding implementing gun control Constitutional.", 
   {}, 
   14976, 
   null, 
   1063376040.0
  ], 
  [
   14988, 
   null, 
   "AMD4EVER", 
   "Try and think it though. \n \n 1) Courts and due process. A jurry must be shielded from all external influence to make an unbiased decision. People with firearms at a court house pass a very clear message without words.\n \n\n \n Try and think about this then. You think the jury is going to be put under external influence to make an unbiased decision if firearms are in the court room. What other decision makers may have this problem if guns are allowed almost everywhere? The president? The senate? Judges? Don't expect that the jury can't be influenced either. The room cleaning service at their hotels will easily be able to have access to them if they wish and well armed of course.", 
   {}, 
   14985, 
   null, 
   1063377060.0
  ], 
  [
   14997, 
   null, 
   "Rev. HellH0und", 
   "VoR,\n \n \n Whats with the \"radical pro-gun extremists\" label? Your disney story about the people meaning the government in the second amendment and your support of the totalitarian state that tells the sheeple what they can and can not have puts you on the \"lunatic fringe\" in my book but I don't sit there and dismiss you as a socialist fanatic do I? Nor does Kelvins responses to you and the others warrant a generilization of \"radical pro-gun extremist\". The fact that you still call us \"pro-gun\" shows a level of contempt for the reality of the issue. I am a Libertarian. I trust the people more than I trust the government. \"Pro-Rights\" is more appropriate for my views and from what I read also applies to Kelvins. If these liberty minded positions cause you to come apart and call people extremists then may I suggest you reflect on this and figure out why individual liberty causes you so much fear...\n \n \n \"They that can give up essential liberty to purchase a little temporary safety, deserve neither liberty nor safety. \" -Benjamin Franklin", 
   {}, 
   14988, 
   null, 
   1063390860.0
  ], 
  [
   15023, 
   null, 
   "kelvin90701", 
   ". What other decision makers may have this problem if guns are allowed almost everywhere? The president? The senate? Judges? .\n\n \n My dear boy, that is the whole point of the Second Amendment. The whole point is to make the President, the Senate, the House, and any other person in the government think twice before enacting a law or grabbing power.\n \n The only rulers who did not fear SUBJECTS were kings and tyrants who had unarmed SUBJECTS. It is good that people in power fear CITIZENS. \n \n The only person above who is protected from influence described are judges. It is illegal and Constitutional to ban guns from court houses.", 
   {}, 
   14988, 
   null, 
   1063417800.0
  ], 
  [
   15025, 
   null, 
   "AMD4EVER", 
   "My dear boy, that is the whole point of the Second Amendment. The whole point is to make the President, the Senate, the House, and any other person in the government think twice before enacting a law or grabbing power.\n\n \n You can't be serious. The whole point of the 2nd amendment is to make it possible to kill a person in power if they don't do what an individual wants them to do? Your actually saying this? Are you advocating that the 2nd amendment should be used to kill our president if he doesn't agree with everyone? Because he would be long dead by now and so would almost every democrat and republican. Our government would have long since collapsed as well as the terrorist took advantage of their 2nd amendment right and went around shooting government officials who they disagreed with.\n \n Nah, you can't be serious. That's just too insane. Heh, good joke though.", 
   {}, 
   15023, 
   null, 
   1063418340.0
  ], 
  [
   15026, 
   null, 
   "Crim", 
   "AMD, what part of 'prevent totalitarian govt' involved 'kill government officials when you don't like them'?", 
   {}, 
   15025, 
   null, 
   1063418580.0
  ], 
  [
   15027, 
   null, 
   "AMD4EVER", 
   "AMD, what part of 'prevent totalitarian govt' involved 'kill government officials when you don't like them'?\n\n \n I'm afraid I don't see what your refering to here. I see Rev. HellH0und wrote something about totalitarian but kelvin didn't in the post I'm responding to. Could you expand on this.\n \n Actually I don't even know where you got those quotes from. I didn't even say 'kill government officials when you don't like them'. Are you paraphrasing?", 
   {}, 
   15026, 
   null, 
   1063418940.0
  ], 
  [
   15030, 
   null, 
   "kelvin90701", 
   "You can't be serious. The whole point of the 2nd amendment is to make it possible to kill a person in power if they don't do what an individual wants them to do? Your actually saying this? Are you advocating that the 2nd amendment should be used to kill our president if he doesn't agree with everyone? Because he would be long dead by now and so would almost every democrat and republican. Our government would have long since collapsed as well as the terrorist took advantage of their 2nd amendment right and went around shooting government officials who they disagreed with.\n \n Nah, you can't be serious. That's just too insane. Heh, good joke though.\n\n \n Yes it is 100% serious. It was so important to balance and check a tyranicall government or power grabber that the it was made the 2nd Amendment not the 10th. It was so important that the Constitution was CHANGED. Do you not fathom the act it takes to get a change in the Constitution? It was so important that militias are given the right to bear arms, not standing armies, not organized forces, but common men. \n \n If you think that is a joke. Dream on. Freedom is incredibly scarce and etheral. Stability in this country is a myth. In 225 years many many governments have come and gone. The USA is lucky, 225 years is not the norm, it is the rare exception. The 2nd Amendment is to give common men the choice to take guns, kill the President or Congress they day it becomes tyranicall. All government eventually fail. There is no such thing as an eternal government. The 2nd Amendment is to prepare common men for that day when the government does collaspe. It is not \"if\" the USA will collaspe it is \"when\".\n \n In 1986 there was peace in a country, everything was stable, the government was in control. Everything was so happy that the winter olympics were held there. Ten years later, few men in uniforms and rifles, would drive up to random villages and rape the women form 12-50 and castrate the men. All of them unarmed. Can you promise yourself in 10 years that you will not be castrated? Did anyone in Bosnia sitting in an olympic bleacher think they would be raped or castrated in 1995? I can promise you that I will not be castrated and I can keep that promise.", 
   {}, 
   15025, 
   null, 
   1063420260.0
  ], 
  [
   15060, 
   null, 
   "voiceofreason", 
   " The 2nd Amendment is to give common men the choice to take guns, kill the President or Congress they day it becomes tyranicall.\n On what basis do you say that? Actually the constitution talks about congress being able to suppress the insurrections by using the militia. See Article 1 Section 8. \n \n \n \n Ten years later, few men in uniforms and rifles, would drive up to random villages and rape the women form 12-50 and castrate the men. All of them unarmed. Can you promise yourself in 10 years that you will not be castrated? Did anyone in Bosnia sitting in an olympic bleacher think they would be raped or castrated in 1995? I can promise you that I will not be castrated and I can keep that promise.\n Remember that the Iraqi public was well armed, but that didn't protect them from the tryranny of Sadam Hussein's government. Read this article written in March. \"With a gun culture that closely resembles that of the United States, Iraq is one of the most heavily armed societies in the world.....\" http://www.csmonitor.com/2003/0310/p01s03-woiq.htm \n \n \"Every now and then, an extreme voice in the debate pops up and argues that if many Americans own guns, it is better for the general welfare of the country in case we are invaded by a foreign power, or by an American government gone tyrannical....Other paranoid voices argue that the citizens should arm themselves against their own government....The US Government knows it's history -- it knows that Mao Tse-Tung, Pol Pot, and even Hitler started out as leader of a small group of lunatics who had easy access to firearms. They used their guns to intimidate people, and thus gain power....Would you have supported the 'freedom' for Hitler and his cronies to own guns in 1932? Mao in 1947-48? Because those freedoms directly led to the abrogation of the ultimate right -- the right to life -- for at least 30 million people. Gun control is NOT about a government trying to disarm a people so that government can be tyrannical. It is about trying to disarm people so that people cannot be....We have extensive checks and balances to make sure no one person or agency can have too much power, and we have a healthy respect for democracy earned over 200 years. These are features that Nazi Germany and Imperial Japan lacked. There is always the possibility that another Hitler will come, yes, but in the meantime, we have the certainty of the annual toll in gun damage, which I will speak about later. We must weigh this certainty against the infinitesimally small chance that our well-constructed checks and balances will suddenly all fail....And what if they do fail? What can we do about it if we are not armed? First, let's answer the contrapositive: what can we do about it if, say, the US Military takes over, and we are armed?... One town of guys with shotguns won't cow the US Military, and a .45 isn't much good against an F-15. So unless one is prepared to argue that civilians should have the right to own similar weaponry, heavy artillery, even nuclear weapons, this argument must fall. Now, we answer the question, what can we do about it if, say, the US Military takes over, and we are not armed? The only option is to do what the Russians did; mass revolt. If numbers are sufficient, guns are not necessary. It took nary a shot to bring down the USSR.\" \n http://www.asahi-net.or.jp/~zj5j-gttl/freedom.htm", 
   {}, 
   15030, 
   null, 
   1063451700.0
  ], 
  [
   15236, 
   null, 
   "kelvin90701", 
   "On what basis do you say that? Actually the constitution talks about congress being able to suppress the insurrections by using the militia. See Article 1 Section 8. \n \n \n Remember that the Iraqi public was well armed, but that didn't protect them from the tryranny of Sadam Hussein's government. Read this article written in March. \"With a gun culture that closely resembles that of the United States, Iraq is one of the most heavily armed societies in the world.....\" http://www.csmonitor.com/2003/0310/p01s03-woiq.htm \n \n \"Every now and then, an extreme voice in the debate pops up and argues that if many Americans own guns, it is better for the general welfare of the country in case we are invaded by a foreign power, or by an American government gone tyrannical....Other paranoid voices argue that the citizens should arm themselves against their own government....The US Government knows it's history -- it knows that Mao Tse-Tung, Pol Pot, and even Hitler started out as leader of a small group of lunatics who had easy access to firearms. They used their guns to intimidate people, and thus gain power....Would you have supported the 'freedom' for Hitler and his cronies to own guns in 1932? Mao in 1947-48? Because those freedoms directly led to the abrogation of the ultimate right -- the right to life -- for at least 30 million people. Gun control is NOT about a government trying to disarm a people so that government can be tyrannical. It is about trying to disarm people so that people cannot be....We have extensive checks and balances to make sure no one person or agency can have too much power, and we have a healthy respect for democracy earned over 200 years. These are features that Nazi Germany and Imperial Japan lacked. There is always the possibility that another Hitler will come, yes, but in the meantime, we have the certainty of the annual toll in gun damage, which I will speak about later. We must weigh this certainty against the infinitesimally small chance that our well-constructed checks and balances will suddenly all fail....And what if they do fail? What can we do about it if we are not armed? First, let's answer the contrapositive: what can we do about it if, say, the US Military takes over, and we are armed?... One town of guys with shotguns won't cow the US Military, and a .45 isn't much good against an F-15. So unless one is prepared to argue that civilians should have the right to own similar weaponry, heavy artillery, even nuclear weapons, this argument must fall. Now, we answer the question, what can we do about it if, say, the US Military takes over, and we are not armed? The only option is to do what the Russians did; mass revolt. If numbers are sufficient, guns are not necessary. It took nary a shot to bring down the USSR.\" \n http://www.asahi-net.or.jp/~zj5j-gttl/freedom.htm\n\n \n \n Hitler, Mao, and Pol Pot; they only killed people who did not have guns. It gun control was for all the people they killed.\n \n \"The answer is that none of the American founders ever claimed that an armed citizenry was the necessary and sufficient condition of freedom. Even though most of them agreed that it was a powerful deterrent to tyrants, they were even more concerned with other matters--such as crafting a system of government that would nourish freedom. Such a system is notably absent from Iraq and most other middle eastern nations.\" - Dr. Timothy Wheeler\n \n http://www.claremont.org/weblog/000145.html\n \n \"Although I have a good job, and am therefore not currently looking for employment, any offers to play bass in a heavy metal band will be seriously considered. \" - Jason\n \n http://www.asahi-net.or.jp/~zj5j-gttl/index.htm\n \n Jason, he is almost 30 years old. The big accomplishement is his life thus far are summer jobs and the debate team. Please try to critically think about the sources you depend on.\n \n http://www.asahi-net.or.jp/~zj5j-gttl/resume.htm", 
   {}, 
   15060, 
   null, 
   1063561800.0
  ], 
  [
   15342, 
   null, 
   "kelvin90701", 
   "69% of adults favor stricter gun-control laws. 57% of gunowners want stricter gun-control laws and 10% of gun owners want neither stricter nor more lax gun-control laws. So only about a third of gun-owners want less gun-control. \n \"Perhaps the most surprising finding here is the strength of support for stricter control among gun owners. Clearly Charlton Heston and the National Rifle Association (NRA) do not represent the majority of gun owners\"\n http://www.harrisinteractive.com/harris_poll/index.asp?PID=182\n\n \n Thre is one problem with your poll, it does not really matter. There is only on poll every year that does, it is when citizens vote for elections. Opinion surveys and telephone surveys do not write laws. If you did not get the message from the last election, Congress got the message: \"Do not mess with guns\". The majority of Americans who went to the polls voted with the NRA.", 
   {}, 
   14976, 
   null, 
   1063614720.0
  ], 
  [
   15490, 
   null, 
   "DHard3006", 
   "I noticed that most (if not all) of the pro-gunners on this board support a passenger's and a terrorist's right to carry a deadly weapon on a plane. Which leads me to ask another question that I once thought absurd, but considering that I'm dealing with some gun fanatics here, ya never know.\n \n Would you support a high school student's right to bring a gun to school? Why or why not?\n\n \n \n Here is the definition of fanatic:\n Function: adjective\n Etymology: Latin fanaticus inspired by a deity, frenzied, \n Date: 1550\n : marked by excessive enthusiasm and often intense uncritical devotion <they're fanatic about politics< \n \n How does defending your rights make you a fanatic? \n Can the Black Americans that fought for their civil rights be labeled fanatics?\n The racist hate groups like the KKK tried to label Black Americans as fanatics.\n \n Can the religious people that have fought for their rights be labeled fanatics?\n Hate groups like the nazi's tried to label the Jewish race as subhuman race that needed to be removed from the face of the earth.\n \n So it is fanatics that want to take other peoples rights away. People defending the right to bear arms are not a threat to other people. Gun haters like the other hate groups have no respect for the rights of other people.\n \n Gun haters must attack people defending the right to bear arms by calling them fanatics. Notice that gun haters call people defending the right to bear arms as gun fanatics. Gun haters do this because the gun haters do not want the people to know that gun haters are anti rights fanatics! \n \n Every demand from gun haters is to limit or ban the right to bear arms. Not one demands from the gun haters is to protect the right of other people. \n Gun haters do not demand that dangerous criminals be taken off of the streets of America. \n Gun haters do not demand longer prison sentences for dangerous criminals that violate the rights of other people. Gun haters would rather ban guns and allow dangerous criminals to remain out of prison. \n \n The criminals at columbine broke over twenty laws dealing with guns. The law against criminals carry guns onto the school campus did not stop the criminals. It did stop law abiding citizens from defending themselves.\n \n Typical gun hater logic is to pass one more gun control law that criminals will not obey!", 
   {}, 
   14609, 
   null, 
   1063683780.0
  ], 
  [
   15518, 
   null, 
   "kelvin90701", 
   "Typicall response from the liberals on this thread has been to devise a plan to control crime, then worry about the civil rights violations later. The first principle of the liberals here has been \"workability\" and \"practically\", not civil rights.\n \n When challenged with a root cause that both sides have agreed upon, it is still the probelm is still guns. When challenged with a solution that addresses the \"workability\" and \"practically\" of civil rights as a first principle and a root cause that both sides have agreed upon, the problem liberals focus on is still guns.\n \n To pull a quote from an anti gunner on this board, please forgive the mis quote and feel free to correct me if I am wrong : \"I do not need guns, never have needed them , and never will.\"\n \n How about an open mind?", 
   {}, 
   15490, 
   null, 
   1063687980.0
  ], 
  [
   15546, 
   null, 
   "voiceofreason", 
   "Thre is one problem with your poll, it does not really matter. There is only on poll every year that does, it is when citizens vote for elections. Opinion surveys and telephone surveys do not write laws. If you did not get the message from the last election, Congress got the message: \"Do not mess with guns\". The majority of Americans who went to the polls voted with the NRA.\n\n Please back up your claims. President Bush said that he was committed to continuing the Federal Assault Weapons Ban during the 2000 presidential election campaign and he got voted into office. That's not voting with the NRA.", 
   {}, 
   15342, 
   null, 
   1063692600.0
  ], 
  [
   15600, 
   null, 
   "kelvin90701", 
   "Please back up your claims. President Bush said that he was committed to continuing the Federal Assault Weapons Ban during the 2000 presidential election campaign and he got voted into office. That's not voting with the NRA.\n\n \n Check the House NRA supporters. The supporters of the NRA out number anti-gun liberals. The bill will never get to his desk. It is going to die in the House. He can say he supports the bill. He can afford to be two faced. It will never get to his desk.", 
   {}, 
   15546, 
   null, 
   1063727280.0
  ], 
  [
   15604, 
   null, 
   "AMD4EVER", 
   "Check the House NRA supporters. The supporters of the NRA out number anti-gun liberals. The bill will never get to his desk. It is going to die in the House. He can say he supports the bill. He can afford to be two faced. It will never get to his desk.\n\n \n How does this support your original statement concerning an actual vote taking place?", 
   {}, 
   15600, 
   null, 
   1063729560.0
  ], 
  [
   15685, 
   null, 
   "kelvin90701", 
   "How does this support your original statement concerning an actual vote taking place?\n\n \n Opinion polls do not matter unless anti-gunners vote for anti-gun represenatives at polling places. There is not enough anti-gun represenatives in the House to bring the renewal to the President's desk. It will not make it to the President's desk for his signature.", 
   {}, 
   15604, 
   null, 
   1063770720.0
  ], 
  [
   15713, 
   null, 
   "voiceofreason", 
   "Opinion polls do not matter unless anti-gunners vote for anti-gun represenatives at polling places. There is not enough anti-gun represenatives in the House to bring the renewal to the President's desk. It will not make it to the President's desk for hi signature.\n Can you back up your claims? What are you basing this on? Anyway, Congress doesn't always go the way the people want then to. The NRA has often been accused of buying the legislature.\n \"Whoever said 'You get what you pay for' could well have had purchasing Senators and Congressional Representatives in mind. During the past couple weeks there have been several votes on gun control in the Federal Legislature and in 94% of the votes, the congressperson who received NRA funds voted the way the NRA told them to. Only two Senators who accepted NRA money dared to vote their consciences. That's a pretty effective lobby.\"\n http://salmonriver.com/tftd/19990523.html \n \n \"Public support for gun-control legislation is broad and strong,\"\n http://abcnews.go.com/sections/us/DailyNews/guns_poll990518.html\n \n \"Six in ten Americans believe that laws covering the sale of firearms should be more stringent than they are now, according to a CNN/USA Today/Gallup poll released Wednesday.\" \n http://www.cnn.com/2000/ALLPOLITICS/stories/04/12/poll.guns/", 
   {}, 
   15685, 
   null, 
   1063784580.0
  ], 
  [
   15759, 
   null, 
   "kelvin90701", 
   "Can you back up your claims? What are you basing this on? Anyway, Congress doesn't always go the way the people want then to. The NRA has often been accused of buying the legislature.\n \"Whoever said 'You get what you pay for' could well have had purchasing Senators and Congressional Representatives in mind. During the past couple weeks there have been several votes on gun control in the Federal Legislature and in 94% of the votes, the congressperson who received NRA funds voted the way the NRA told them to. Only two Senators who accepted NRA money dared to vote their consciences. That's a pretty effective lobby.\"\n http://salmonriver.com/tftd/19990523.html \n \n \"Public support for gun-control legislation is broad and strong,\"\n http://abcnews.go.com/sections/us/DailyNews/guns_poll990518.html\n \n \"Six in ten Americans believe that laws covering the sale of firearms should be more stringent than they are now, according to a CNN/USA Today/Gallup poll released Wednesday.\" \n http://www.cnn.com/2000/ALLPOLITICS/stories/04/12/poll.guns/\n\n \n Those are opinion polls. They do not chage the Constitution. Proof? OK just give me until 2004, that is when the Brady Bill dies in Congress. Are you worried about it? I'm not. The Brady Bill dies in 2004.", 
   {}, 
   15713, 
   null, 
   1063813500.0
  ], 
  [
   15762, 
   null, 
   "Rev. HellH0und", 
   "Typicall response from the liberals on this thread has been to devise a plan to control crime, then worry about the civil rights violations later. The first principle of the liberals here has been \"workability\" and \"practically\", not civil rights.\n \n When challenged with a root cause that both sides have agreed upon, it is still the probelm is still guns. When challenged with a solution that addresses the \"workability\" and \"practically\" of civil rights as a first principle and a root cause that both sides have agreed upon, the problem liberals focus on is still guns.\n \n To pull a quote from an anti gunner on this board, please forgive the mis quote and feel free to correct me if I am wrong : \"I do not need guns, never have needed them , and never will.\"\n \n How about an open mind?\n\n \n \n That is incorrect.. To surmize this correctly you should have said \"the liberals on this thread has been to devise a plan to control people by using victim disarmament , then use an orweillian version of civil rights for special interest groups in order to create a society of dependence\n \n \n This would be more accurate....", 
   {}, 
   15518, 
   null, 
   1063814460.0
  ], 
  [
   15914, 
   null, 
   "voiceofreason", 
   "Those are opinion polls. They do not chage the Constitution. Proof? OK just give me until 2004, that is when the Brady Bill dies in Congress. Are you worried about it? I'm not. The Brady Bill dies in 2004.\n\n I've never heard that the Brady Bill will die in 2004. And we weren't talking about the constitution. We were talking about what the majority of Americans think. Look at Senator Feinstein from California and Senator Hatch from Utah. Feinstein is anti-NRA and Hatch is pro-NRA. In Utah there are about 2 million people and there are about 35 million people in California. So a much greater percentage of the American population elected Senator Feinstein, but she gets the same amount of legislative power as Senator Hatch in congress. What happens in congress does not necessarily reflect the will of the American people.\n \n It'll be interesting see what congress decides about immunity for the gun industry.", 
   {}, 
   15759, 
   null, 
   1063876380.0
  ], 
  [
   15949, 
   null, 
   "kelvin90701", 
   "I've never heard that the Brady Bill will die in 2004. And we weren't talking about the constitution. We were talking about what the majority of Americans think. Look at Senator Feinstein from California and Senator Hatch from Utah. Feinstein is anti-NRA and Hatch is pro-NRA. In Utah there are about 2 million people and there are about 35 million people in California. So a much greater percentage of the American population elected Senator Feinstein, but she gets the same amount of legislative power as Senator Hatch in congress. What happens in congress does not necessarily reflect the will of the American people.\n \n It'll be interesting see what congress decides about immunity for the gun industry.\n\n \n Senator Fienstein has carried a concealed handgun for protection. Typical of anit-gunners, they have no delimma of saying that are for the Constitution and it's principles, and restricting 2nd Amendment rights.", 
   {}, 
   15914, 
   null, 
   1063897080.0
  ], 
  [
   15950, 
   null, 
   "kelvin90701", 
   "I've never heard that the Brady Bill will die in 2004. And we weren't talking about the constitution. We were talking about what the majority of Americans think. Look at Senator Feinstein from California and Senator Hatch from Utah. Feinstein is anti-NRA and Hatch is pro-NRA. In Utah there are about 2 million people and there are about 35 million people in California. So a much greater percentage of the American population elected Senator Feinstein, but she gets the same amount of legislative power as Senator Hatch in congress. What happens in congress does not necessarily reflect the will of the American people.\n \n It'll be interesting see what congress decides about immunity for the gun industry.\n\n \n You have a short memory. Do you not remember our argument with Jason and the The Manhattan Institute for Policy Research as sources?\n \n \"\"You don't need a legislative majority to file a lawsuit,\" proclaims Elisa Barnes\" \n \n http://www.manhattan-institute.org/html/_wsj-plaintiffs_lawyers_take_a.htm\n \n The lawyers are not even hiding it. It is very clear they want to by pass the Constitution without having a vote.", 
   {}, 
   15914, 
   null, 
   1063897380.0
  ], 
  [
   16341, 
   null, 
   "voiceofreason", 
   "You have a short memory. Do you not remember our argument with Jason and the The Manhattan Institute for Policy Research as sources?\n \n \"\"You don't need a legislative majority to file a lawsuit,\" proclaims Elisa Barnes\" \n \n http://www.manhattan-institute.org/html/_wsj-plaintiffs_lawyers_take_a.htm\n \n The lawyers are not even hiding it. It is very clear they want to by pass the Constitution without having a vote.\nMoot and irrelevant to the point that I just made.", 
   {}, 
   15950, 
   null, 
   1064052360.0
  ], 
  [
   16515, 
   null, 
   "kelvin90701", 
   "Moot and irrelevant to the point that I just made.\n\n \n It is quite relavant. Thus you can start quoting every wacko and looser on the internet to make your point.", 
   {}, 
   16341, 
   null, 
   1064160840.0
  ], 
  [
   16516, 
   null, 
   "kelvin90701", 
   "It is quite relavant. Thus you can start quoting every wacko and looser on the internet to make your point.\n\n Soooo, VOR? What do you think of Senator Feinstien, her anti-gun leadership, and her concealed handgun?", 
   {}, 
   16515, 
   null, 
   1064160900.0
  ], 
  [
   16686, 
   null, 
   "voiceofreason", 
   "Hitler, Mao, and Pol Pot; they only killed people who did not have guns. It gun control was for all the people they killed.\n http://www.claremont.org/weblog/000145.html\n\n On what basis do you say that Hitler, Mao, and Pol Pot only killed people who did not have guns? Please back up your claims. \n \n \"The Third Reich did not need gun control (in 1938 or at any time thereafter) to maintain their power....supposing the existance of an armed resistance also requires the acceptance that the German people would have rallied to the rebellion. This argument requires a total suspension of disbelief given everything we know about 1930s Germany....it hardly seems conceivable that armed resistance by Jews (or any other target group) would have led to any weakening of Nazi rule, let alone a full scale popular rebellion; on the contrary, it seems more likely it would have strengthened the support the Nazis already had....What must be remembered is that the Nazis were master manipulators of popular emotion and sentiment, and were disdainful of people thinking for themselves. There is the danger to which we should pay great heed. Not fanciful stories about Nazi's seizing guns.\"\n http://www.guncite.com/gun_control_gcnazimyth.html \n \n \n\"Although I have a good job, and am therefore not currently looking for employment, any offers to play bass in a heavy metal band will be seriously considered. \" - Jason\n \n http://www.asahi-net.or.jp/~zj5j-gttl/index.htm\n \n Jason, he is almost 30 years old. The big accomplishement is his life thus far are summer jobs and the debate team. Please try to critically think about the sources you depend on.\n \n http://www.asahi-net.or.jp/~zj5j-gttl/resume.htm\n\n You make it so obvious. You're using an ad hominem argument. This is a logical fallacy. \"Ad hominem arguments attempt to counter an argument by attacking the person making the argument, rather than the argument itself.\" http://www.theness.com/articles/logicalfallacies-nejs0203.html \n Why don't you respond to the arguments that people make rather than attacking them personally?", 
   {}, 
   15236, 
   null, 
   1064247360.0
  ], 
  [
   16794, 
   null, 
   "kelvin90701", 
   "\n You make it so obvious. You're using an ad hominem argument. This is a logical fallacy. \"Ad hominem arguments attempt to counter an argument by attacking the person making the argument, rather than the argument itself.\" http://www.theness.com/articles/logicalfallacies-nejs0203.html \n Why don't you respond to the arguments that people make rather than attacking them personally?\n\n \n How about that Senator Feinstein, hmmmm?\n \n Were not talking about a politician fighting for tax reform cheating on his wife.\n \n Were not talking about Senator's forgein policy even though they are boozers.\n \n Were not talking about a politician fighting for a school lunch program caught trying to embezzle money.\n \n Were talking about an anti-gun leader who very clearly wants one thing for herself and another thing for the people. So if Senator Feinstien bans guns and she is caught carrying a concealed handgun, should she go to jail?", 
   {}, 
   16686, 
   null, 
   1064288700.0
  ], 
  [
   16899, 
   null, 
   "Rev. HellH0und", 
   "How about that Senator Feinstein, hmmmm?\n \n Were not talking about a politician fighting for tax reform cheating on his wife.\n \n Were not talking about Senator's forgein policy even though they are boozers.\n \n Were not talking about a politician fighting for a school lunch program caught trying to embezzle money.\n \n Were talking about an anti-gun leader who very clearly wants one thing for herself and another thing for the people. So if Senator Feinstien bans guns and she is caught carrying a concealed handgun, should she go to jail?\n\n \n \n \n This is the hyprocracy of the left.... Add this to that fool James davis in Socialist New York where this anti was armed and let his killer slip by the metal detectors... HYPOCRACY\n \n \n His killer was shot by a police officer who has shot guns since he was 8... 50 feet from the 1st floor to the balcony admist screaming running people 5 shots fired 5 shots center mass.... The academy did not teach him that....\n \n \n Or hollywood where XXXXXX like rosie odonnell champions anti causes but has her bodyguards armed.... HYPOCRACY\n \n Mayor \"HAIL CEASAR\" bloomberg who on radio compared gun manufacturers to drug dealers.... never mind a more accurate description would have been Bloombergs ticket blitz to a sopranos shakedown.. HYPOCRACY\n \n \n and the (leftie) beat goes on.... \n \n \n Also fyi senators are exempt from any laws passed during thier tenure.... didn't you know that?", 
   {}, 
   16794, 
   null, 
   1064337000.0
  ], 
  [
   17623, 
   null, 
   "kelvin90701", 
   "This is the hyprocracy of the left.... Add this to that fool James davis in Socialist New York where this anti was armed and let his killer slip by the metal detectors... HYPOCRACY\n \n \n His killer was shot by a police officer who has shot guns since he was 8... 50 feet from the 1st floor to the balcony admist screaming running people 5 shots fired 5 shots center mass.... The academy did not teach him that....\n \n \n Or hollywood where XXXXXX like rosie odonnell champions anti causes but has her bodyguards armed.... HYPOCRACY\n \n Mayor \"HAIL CEASAR\" bloomberg who on radio compared gun manufacturers to drug dealers.... never mind a more accurate description would have been Bloombergs ticket blitz to a sopranos shakedown.. HYPOCRACY\n \n \n and the (leftie) beat goes on.... \n \n \n Also fyi senators are exempt from any laws passed during thier tenure.... didn't you know that?\n\n \n Rosie is not a hypocrite by her understanding. She does not own the gun that protects her children and she does not oppose you getting an armed body guard anytime and for any reason you want. It makes perfect sense to elistist liberals. Get with the program, we all need to work together for social progressiveness and common good. You need to sacrafice your rights for a greater common good. Never mind no one asked you or me to volunteer. Never mind the people enjoying the benefits of the common good sacrafice NOTHING.", 
   {}, 
   16899, 
   null, 
   1064713440.0
  ], 
  [
   17669, 
   null, 
   "Rev. HellH0und", 
   "Rosie is not a hypocrite by her understanding. She does not own the gun that protects her children and she does not oppose you getting an armed body guard anytime and for any reason you want. It makes perfect sense to elistist liberals. Get with the program, we all need to work together for social progressiveness and common good. You need to sacrafice your rights for a greater common good. Never mind no one asked you or me to volunteer. Never mind the people enjoying the benefits of the common good sacrafice NOTHING.\n\n \n \n HAIL ROSIE! heh heh heh... I am so with the program brotha as I believe you are... My battle flag is flying... Like the lexington days of old Or the Minutemen from Culpeper county VA. Those ominous words that tyrants fear everywhere live on today. LIVE FREE OR DIE; DON'T TREAD ON ME\n \n \n The call to muster was back when Klinton called patriots and militias racist, outcasts, and anti-American and a certain DEMOCRAT congress follows up:\n \n NEW WORLD ORDER INTELLIGENCE UPDATE\n \n \n Bush's litmus test it the Assault weapons ban... If he lets it die he may get my vote (for now). If it comes back in ANY form I fall back to my usual Libertarian bretheren. \n \n \n But smile and think back to a Warfare tactic first started here.... Target the \"officers\".... In this case it is Rosie, Clooney, Depp, The dick(sie) chicks, striesand (whore) et al. (I of course mean target them with angry letters and peaceful protests and boycotts of thier products) ;)\n \n \n \"War is an ugly thing, but not the ugliest of things; the decayed and degraded state of moral and patriotic feeling which thinks nothing worth a war, is worse. A man who has nothing which he cares more about than he does about his personal safety is a miserable creature who has no chance at being free, unless made and kept so by the exertions of better men than himself.\"\n \n - John Stuart Mill\n \n \n \n And Finally on the sunject of this stoopid thread I defer to this Gentlman:\n \n \"I prefer dangerous freedom over peaceful slavery.\" - Thomas Jefferson", 
   {
    "unicode_changes_made": true
   }, 
   17623, 
   null, 
   1064768040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  a question for those in favor of guns and violence", 
  "url": "http://www.4forums.com/political/gun-control-debates/941-question-those-favor-guns-violence.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 941, 
  "discussion_files": [
   [
    "24519.html", 
    "http://www.4forums.com/political/gun-control-debates/941-question-those-favor-guns-violence-print.html"
   ], 
   [
    "24520.html", 
    "http://www.4forums.com/political/gun-control-debates/941-question-those-favor-guns-violence-4-print.html"
   ], 
   [
    "24521.html", 
    "http://www.4forums.com/political/gun-control-debates/941-question-those-favor-guns-violence-3-print.html"
   ], 
   [
    "24522.html", 
    "http://www.4forums.com/political/gun-control-debates/941-question-those-favor-guns-violence-2-print.html"
   ]
  ], 
  "identifier": 941
 }
]