[
 [
  [
   246215, 
   null, 
   "Shooterandproud", 
   "Excerpted from\n Kofi Annan's Five Lessons\n By Kofi Annan \n Le Figaro\n http://www.truthout.org/docs_2006/121406G.shtml\n\n \n \"First Lesson: In today's world, we are all responsible for our reciprocal\n security. No nation can assure its own security by attempting to establish\n its supremacy over all the others in the face of threats such as nuclear\n proliferation, climate change, global pandemics or terrorist groups\n operating from safe havens in failed states. Only by working for everyone's\n security may we hope to assure a durable security for ourselves.\n \n Second Lesson: We are also responsible for everyone's well-being. Without\n solidarity, no society can be truly stable. It's not realistic to think that\n a few may continue to derive great advantages from globalization, while\n billions of others are abandoned or plunged into abject poverty. We must\n give all human beings the opportunity to share in our prosperity.\n \n Third Lesson: Security and prosperity depend on respect for human rights and\n a government of laws.\n \n Fourth lesson is that governments must be held responsible for their\n actions, as much on the international as on the domestic scene. Each state\n has accounts to settle with those who have been affected in a decisive way\n by their actions.\n \n My fifth and final lesson is that these institutions must be organized in a\n just and democratic manner that gives the poor and the weak some influence\n over the actions of the rich and the strong.\"\n\n \n \n \n Interesting. What do the you guys think of this? I, for one, agree 100%, but what does everyone else here think?", 
   {
    "post_info": {
     "post_title": "Kofi Annan's Five lessons."
    }
   }, 
   null, 
   null, 
   1168125540.0
  ], 
  [
   246427, 
   null, 
   "jyoshu", 
   "Interesting. What do the you guys think of this? I, for one, agree 100%, but what does everyone else here think?\n\n \n I'd guess I'd be able to take him more seriously if his own personal actions in the last few years backed up his statements.", 
   {}, 
   246215, 
   null, 
   1168296960.0
  ], 
  [
   246525, 
   null, 
   "sinjin", 
   "I think he's correct in many ways but few with power care what he says.", 
   {}, 
   246427, 
   null, 
   1168375380.0
  ], 
  [
   247859, 
   null, 
   "huckleberry", 
   "The corruption of the UN under his watch continues to grow. I doubt his \"lessons\", though, from a more realistic perspective.\n \n All of his lessons assume that governments are the ones who are responsible for the listed items. Particularly note the third lesson:\n \n \nThird Lesson: Security and prosperity depend on respect for human rights and a government of laws\n\n \n He is right in a tiny respect but very wrong in the most influencial respect. Governments do not respect anything. Governement is a concept and not a being. Individuals respect individuals. \n \n Security and prosperity begin with me. I must respect others. Each person must be responsible for that. It is not something that can be legislated no matter the type of country (democracy or dictatorship). In any \"system\" you will always have those whose heart is such that they will not respect each other. You cannot change the hearts of people. You may get compliance but that kind of compliance will only be public. \n \n Character is formed in relationship but revealed in isolation.\n \n Kofi has an idealistic vision and a poor understanding of human nature. People will do what they want. Isaac Asimov's foundation series points this particular societal dilemma out fairly well.", 
   {}, 
   246525, 
   null, 
   1169248800.0
  ], 
  [
   252643, 
   null, 
   "gman", 
   "My fifth and final lesson is that these institutions must be organized in a\n just and democratic manner that gives the poor and the weak some influence\n over the actions of the rich and the strong.\"\n \n What would be the purpose of empowering the poor and the weak to influence the actions of the rich and the strong? \n \n I can agree that it is reasonable to expect the rich and strong to raise the conditions of the weak and poor. But, they can not be allowed influence to bring the rich and strong down. What good there is in life flows from the rich and the strong. \n \n Koffi surely agrees with me on this, else why would the food for oil event have been tolerated?", 
   {}, 
   247859, 
   null, 
   1172590440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Kofi Annan's Five lessons.", 
  "url": "http://www.4forums.com/political/government-debates/9417-kofi-annans-five-lessons.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 9417, 
  "discussion_files": [
   [
    "3667.html", 
    "http://www.4forums.com/political/government-debates/9417-kofi-annans-five-lessons-print.html"
   ]
  ], 
  "identifier": 9417
 }
]