[
 [
  [
   246309, 
   null, 
   "simone", 
   "The battle over economic unfairness goes on. Surprisingly, the New York Times says something friendly:\n \n http://www.nytimes.com/2006/12/31/business/yourmoney/31mgmt.html\n \n December 31, 2006\n Under New Management\n Among Your Qualifications, an M.B.A. at Household U. \n By KELLEY HOLLAND\n AS many a Kodak commercial makes clear, child-rearing involves plenty of cuddles, angelic smiles and moments of treacly sweetness. But parents know that raising children also involves those other times - when the bowl of oatmeal overflows in the microwave while you resolve a sibling quarrel, when your knuckles whiten as you grip the dashboard for your teenager's first highway drive, when you try yet again to encourage a child who is struggling with the intractable mazes of geometry.\n \n It is all very different from business school, or even from an office. But many parents - including famous ones like Nancy Pelosi, the incoming House speaker, and Ann Crittenden, the author of \"If You've Raised Kids, You Can Manage Anything\" - know that the experience of raising children and managing a household is not just maddening and delicious: it can also serve to develop skills that are central to successful management.\n \n Parents need to master various skills, including quick decision- making in a changing environment (what to serve in two minutes once oatmeal is no longer an option), negotiating (coaxing a young child into snow boots in time for the school bus), and synthesizing information (if a daughter goes to gymnastics, her brother has to be dropped off early for soccer so the grocery shopping can be done). \n \n They also learn to motivate teams (let's have a playroom cleanup game!) and to multitask (doing laundry while the chicken roasts and soccer practices are coordinated). And they praise real effort at any level, whether it's a toddler's painstakingly balanced tower of blocks or a preteen's carefully drawn poster for a school election. Communication, time management and analytical skills can also be honed at home.\n \n Raising children is \"a developmental experience and you gain workplace skills from it,\" said Marian N. Ruderman of the Center for Creative Leadership, a research and training organization based in Greensboro, N.C. \"If you can negotiate between two kids when you're driving, you can negotiate at work,\" she added. \"There's no question in my mind about that.\"\n \n Ms. Ruderman and three of her colleagues have studied people in what they call \"multiple life roles\" - a marketing executive, for example, who is also a parent and a spouse. Their research has so far focused on female managers, but Ms. Ruderman said anecdotal evidence suggests that men have similar experiences. \n \n Instead of painting the typical picture of a tug of war between work and family demands, the research found that women with important roles outside of work believed that those responsibilities improved their ability to function at work. In a survey published in 2002 of 61 women with diverse responsibilities, the women cited improved interpersonal and leadership skills, increased comfort with taking risks and a greater ability to multitask, among other skills.\n \n In a subsequent survey of the bosses, peers and employees of several dozen working mothers, Ms. Ruderman and her colleagues found that women with multiple roles tended to be very effective at work - and even more so if they were particularly involved in their roles outside of work.\n \n \"It's a very rich developmental experience to spend time immersed in family roles,\" she said, \"and there can be benefits for people's careers.\" \n \n Goddard College in Plainfield, Vt., hired Barbara Mossberg as its president in 1997 after she answered a question about her achievements by writing about raising her children. After she was hired, her essay was posted on Goddard's Web site.\n \n In an interview, Ms. Mossberg, now Goddard's president emerita and a founding dean of the college of arts, humanities and social sciences at California State University, Monterey Bay, said: \"Our ability to plan multiple schedules, to get our kids to school and fed and forms filled out - right there, we see that being a C.E.O. is a walk. The work force needs those kinds of skills that we as parents take for granted.\"\n \n Despite the management skills that can come from raising children, many stay-at-home parents considering a return to paid work quail at the thought of explaining their years at home to potential employers. Some people are interested in switching to work that reflect interests they developed at home or that offer more predictable hours, and some worry that their potential employers may tag them as not committed enough to their careers. \n \n (More)", 
   {
    "post_info": {
     "post_title": "Valuing Women's Work"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1168206480.0
  ], 
  [
   246310, 
   null, 
   "simone", 
   "Several years ago, companies were more likely to look askance at parents trying to return to work after a long absence, according to John A. Challenger, chief executive of Challenger, Gray & Christmas, the outplacement firm in Chicago. \n \n Even today, he said, when stay-at-home parents meet prospective employers, it is still a good idea for them to talk less about their time taking care of children and much more about their successful coordination of a school bake sale or a nonprofit group's annual fund-raiser.\n \n It is a \"harder sell to market running a house as a management skill,\" Mr. Challenger said.\n \n Still, he and other experts said employers were increasingly open to candidates who did not have linear career paths. The market for highly educated employees is tight, he said, and more employers understand the merits of taking time away from work for all sorts of reasons, including child-rearing.\n \n \"In this kind of environment, more companies are open to thinking outside the box\" in hiring, Mr. Challenger said. \"When they do, and it works, that changes the culture.\"\n \n Ernst & Young, the big accounting and consulting firm, has programs aimed at retaining and recruiting women as managers, including those who have taken time off to raise children. \n \n \"We're very open to having women come back into the work force,\" said Billie Williamson, an Ernst & Young partner who oversees the firm's efforts to help employees balance duties at work and home. \n \n While she does not see stay-at-home parents holding forth about their domestic experience on their résumés, Ms. Williamson says she believes that parents improve their leadership skills at home, and learn to read their audience. \"Dealing with a 3-year-old having a tantrum is very different from dealing with a happy 3-year-old, and that's a lot like client service,\" she said.\n \n Lehman Brothers is one of several Wall Street firms with programs to help women and men join or rejoin the firms after taking time off - or \"offramping\" - from their careers in financial services.\n \n \"It really is legitimizing women and men who have offramped as a legitimate pool of talent,\" said Anne Erni, Lehman's chief diversity officer Lehman's research, she added, suggests that 93 percent of the women who take time off want to return at some point - and at least half are looking for some flexibility in their work schedules.\n \n JENNIFER HECKLER of Winnetka, Ill., is among many parents across the country who are contemplating a return to full-time paid work. She has spent 15 years as a stay-at-home parent or, recently, as a volunteer doing part-time consulting or other work. In her former jobs, as a trader and portfolio manager, she learned to love the financial markets, and as a volunteer in recent years she has developed a strong interest in nonprofit organizations. \n \n Her résumé includes a 12-year gap between positions, but Ms. Heckler says she hopes that her volunteer experience and financial acumen, will help her land meaningful work. And once she lands somewhere, she said, she believes that the skills she built raising her children will be on display along with her other talents and experience.\n \n Parenthood has given her a lot of practical experience, Ms. Heckler said. \"You're constantly using your management skills, juggling how am I going to get this or that done. You are meeting a lot of people's needs,\" she said. \"As a manager, you're not just thinking of your deadlines and projects; you're thinking of your staff's deadlines, too. I don't think you get rusty at home.\"", 
   {
    "unicode_changes_made": true
   }, 
   246309, 
   null, 
   1168206540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Valuing Women's Work", 
  "url": "http://www.4forums.com/political/economics-debates/9421-valuing-womens-work.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 9421, 
  "discussion_files": [
   [
    "17477.html", 
    "http://www.4forums.com/political/economics-debates/9421-valuing-womens-work-print.html"
   ]
  ], 
  "identifier": 9421
 }
]