[
 [
  [
   246401, 
   null, 
   "ShadowPikachu", 
   "http://www.cnn.com/2007/HEALTH/01/08/stem.cells.ap/index.html\n I found this article to be very interesting. Here is a snippet. \n(AP) -- Stem cell researchers reacted with enthusiasm and reservations to a report that scientists have found stem cells in amniotic fluid, a discovery that would allow them to sidestep the controversy over destroying embryos for research.\n \n Researchers at Wake Forest University and Harvard University reported Sunday that the stem cells they drew from amniotic fluid donated by pregnant women hold much the same promise as embryonic stem cells.\n \n They reported they were able to extract the stem cells from the fluid, which cushions babies in the womb, without harm to mother or fetus and turn their discovery into several different tissue cell types, including brain, liver and bone.\n \n But Dr. Anthony Atala, head of Wake Forest's regenerative medicine institute and the senior researcher on the project, said the scientists still don't know exactly how many different cell types can be made from the stem cells found in amniotic fluid. The scientists said preliminary tests in patients are years away.\n \n \n\n \n While it is not known how exactly they compare with embryonic stem cells, it seems to hold promise. I hope it shows to be as promising as it appears. It would be excellent to be able to use stem cells to help people. This way, the anti-abortionists won't have anything to complain about (even though I didn't see reason before as the embryos used would never have a chance to develop anyway) and prevent people from getting help from stem-cell procedures as they have been doing for the embryonic stem cells.", 
   {
    "post_info": {
     "post_title": "Stem cell researchers hopeful, cautious over new step forward"
    }
   }, 
   null, 
   null, 
   1168285140.0
  ], 
  [
   246424, 
   null, 
   "thelmoose", 
   "http://www.cnn.com/2007/HEALTH/01/08/stem.cells.ap/index.html\n I found this article to be very interesting. Here is a snippet. \n \n While it is not known how exactly they compare with embryonic stem cells, it seems to hold promise. I hope it shows to be as promising as it appears. It would be excellent to be able to use stem cells to help people. This way, the anti-abortionists won't have anything to complain about (even though I didn't see reason before as the embryos used would never have a chance to develop anyway) and prevent people from getting help from stem-cell procedures as they have been doing for the embryonic stem cells.\n\n \n I agree. Time will tell if the cells are as effective as embryonic stem cells, and it seems on the surface, they well might be.\n Except.\n These stem must be donated by pregnant women. Amniocentesis, while pretty darn safe, is not without risk.\n First, the pregnant mother must donate the cells.\n The risk to the fetus is not zero.\n When we already have a zero risk procedure from cells that are going to be disposed of anyway.\n In any event, I am sure some nut job with an extremely skewed sense of morality will find a way to call this procedure immoral in some way.", 
   {}, 
   246401, 
   null, 
   1168295520.0
  ], 
  [
   246425, 
   null, 
   "ShadowPikachu", 
   "I agree. Time will tell if the cells are as effective as embryonic stem cells, and it seems on the surface, they well might be.\n Except.\n These stem must be donated by pregnant women. Amniocentesis, while pretty darn safe, is not without risk.\n First, the pregnant mother must donate the cells.\n The risk to the fetus is not zero.\n When we already have a zero risk procedure from cells that are going to be disposed of anyway.\n In any event, I am sure some nut job with an extremely skewed sense of morality will find a way to call this procedure immoral in some way.\n\n \n Yeah, it does have risk unlike the embryonic stem cells, but I think that if it comes out the way they hope, it will eventually lead to more embryonic uses as well when people realize that this can have risks. I think it is good to have this way as a back up while people argue over the use of cells that would otherwise be disposed, and get some treatment to people who need it rather than letting it be denied to them by anti-abortionists. And yeah, it's pretty much guaranteed that someone will find something to object about, claiming it is immoral (maybe it will now be that these stem cells are potential human life and we can't use them emoticon_rolleyes ), but it will likely not have as many objections.", 
   {}, 
   246424, 
   null, 
   1168296180.0
  ], 
  [
   246428, 
   null, 
   "Another opinion", 
   "I hear that samples of amniotic fluid are often enough taken from women to test the fetus for Downe's syndrome, etc., so there does seem to be some ready supply available from which to take the stem cells. Of course, the question arises whether or not the woman has ownership claims over those cells, but a simple signature allowing their use should do the trick. \n \n I also have heard that stem cells can be gathered from placentas and umbilical cords.", 
   {}, 
   246401, 
   null, 
   1168298640.0
  ], 
  [
   246480, 
   null, 
   "dislexia", 
   "I am SOOOOOOOOOOO happy. \n I hope that this will hold the same \"cure for cancer\" rummered to exist thet would be removed from embryonik steam cells. \n I do not think that this is imoral. \n I do however think that embyonik steam cell reserch is. \n I must say that I am happy to not have been donated as an embryo to have my steam cells removed. \n What if we all had been donated to that fate.....", 
   {
    "post_info": {
     "post_title": "yea"
    }
   }, 
   246428, 
   null, 
   1168326000.0
  ], 
  [
   246481, 
   null, 
   "dislexia", 
   "http://www.cnn.com/2007/HEALTH/01/08/stem.cells.ap/index.html\n I found this article to be very interesting. Here is a snippet. \n \n While it is not known how exactly they compare with embryonic stem cells, it seems to hold promise. I hope it shows to be as promising as it appears. It would be excellent to be able to use stem cells to help people. This way, the anti-abortionists won't have anything to complain about (even though I didn't see reason before as the embryos used would never have a chance to develop anyway) and prevent people from getting help from stem-cell procedures as they have been doing for the embryonic stem cells.\n\n \n They did have a chance to live a full life , before you tore it away form them......", 
   {}, 
   246401, 
   null, 
   1168326240.0
  ], 
  [
   246484, 
   null, 
   "ShadowPikachu", 
   "They did have a chance to live a full life , before you tore it away form them......\n\n \n Uh, no, maybe you should learn a little more about the issue before you make claims like that. Embryonic stem cells used are from embryos that would otherwise be disposed of, so really, why just toss them out when you can use them to help people. Anti-abortionists seem to prefer to have us toss them out rather than have a chance of actually helping someone", 
   {}, 
   246481, 
   null, 
   1168327500.0
  ], 
  [
   246485, 
   null, 
   "ShadowPikachu", 
   "I am SOOOOOOOOOOO happy. \n I hope that this will hold the same \"cure for cancer\" rummered to exist thet would be removed from embryonik steam cells. \n I do not think that this is imoral. \n I do however think that embyonik steam cell reserch is. \n I must say that I am happy to not have been donated as an embryo to have my steam cells removed. \n What if we all had been donated to that fate.....\n\n \n We've already been through the whole \"what if\" argument in at least two other threads (in fact I think it was you who brought them up both times), so we don't really need to start that again.", 
   {}, 
   246480, 
   null, 
   1168327680.0
  ], 
  [
   246566, 
   null, 
   "Shooterandproud", 
   "I am SOOOOOOOOOOO happy. \n I hope that this will hold the same \"cure for cancer\" rummered to exist thet would be removed from embryonik steam cells. \n I do not think that this is imoral. \n I do however think that embyonik steam cell reserch is. \n I must say that I am happy to not have been donated as an embryo to have my steam cells removed. \n What if we all had been donated to that fate.....\n\n \n Why would we all donate? Embryonic stem cell research is noting different than organ donation. If a woman wishes to donate her embryo's cells to research for a cure to horrible and painful diseases than let her donate. Its her embryo, after all.", 
   {}, 
   246480, 
   null, 
   1168400160.0
  ], 
  [
   246567, 
   null, 
   "Shooterandproud", 
   "They did have a chance to live a full life , before you tore it away form them......\n\n \n No they didn't. My sperm has a chance to live a full life. Calm down.", 
   {}, 
   246481, 
   null, 
   1168400280.0
  ], 
  [
   246574, 
   null, 
   "thelmoose", 
   "I am SOOOOOOOOOOO happy. \n I hope that this will hold the same \"cure for cancer\" rummered to exist thet would be removed from embryonik steam cells. \n I do not think that this is imoral. \n I do however think that embyonik steam cell reserch is. \n I must say that I am happy to not have been donated as an embryo to have my steam cells removed. \n What if we all had been donated to that fate.....\n\n \n Do you realize that we are talking about frozen embryos that have been abandoned and will ultimately just be disposed of?\n \n Are you saying there is a moral equivalent between a collection of 100 undifferentiated cells and an 8 year old girl with diabetes?\n \n The \"what if\" argument is absurd. If your parents were undergoing in vitro fertilization and a sibling embryo implanted before they got to you, then you wouldn't be here to gripe about it, so what? If your parents never met or if someone had a headache and no sex occurred at the exact moment you were conceived, the combination of genes that make you would have never occurred. Every minute you are not busy conceiving, you are depriving a would-be human an existence. Please stop that silliness.", 
   {}, 
   246480, 
   null, 
   1168401840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Stem cell researchers hopeful, cautious over new step forward", 
  "url": "http://www.4forums.com/political/abortion-debates/9424-stem-cell-researchers-hopeful-cautious-over-new-step-forward.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9424, 
  "discussion_files": [
   [
    "10450.html", 
    "http://www.4forums.com/political/abortion-debates/9424-stem-cell-researchers-hopeful-cautious-over-new-step-forward-print.html"
   ]
  ], 
  "identifier": 9424
 }
]