[
 [
  [
   247253, 
   null, 
   "Galileo", 
   "\"Even after excluding many reported firearm victimizations, far more survey respondents report having been threatened or intimidated with a gun than having used a gun to protect themselves. A majority of the reported self defense gun uses were rated as probably illegal by a majority of judges. This was so even under the assumption that the respondent had a permit to own and carry the gun, and that the respondent had described the event honestly. CONCLUSIONS: Guns are used to threaten and intimidate far more often than they are used in self defense. Most self reported self defense gun uses may well be illegal and against the interests of society.\"\n http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=pubmed&dopt=Abstract&list_uids=11144624&query_hl=14&itool=pubmed_docsum\n \n \n I do not find the first claim surprising that guns are used far more often in crime than in self defense. What I do find interesting is that most self defense gun uses were rated as probably illegal by judges and that they may be against the interests of society. And this appears to be so even when a person legally owns a gun.", 
   {
    "post_info": {
     "post_title": "Guns used much more often in crime than in self defense"
    }
   }, 
   null, 
   null, 
   1168857180.0
  ], 
  [
   247254, 
   null, 
   "gamehuis", 
   "The question is whether or not it really matters if guns were used less for self defense and more for aggression.\n \n The Second Amendment is quite clear about guns. And if you look at the historical context you'll see that the Founding Fathers wanted ordinary citizens to be armed and it's not so they could defend themselves against criminals or because they needed a gun to go hunting.\n The whole reason why the Second Amendment exists is so that the people could defend themselves against the tyranny of their own government. The muskets that they used were the AK's and M16's of their time.\n The Founding Fathers knew that an unarmed citizenry could never overthrow a tyrannical regime.\n \n Throughout history more people have been killed by their own governments than by any other internal or external source.\n \n The day that the people of the US let their guns be taken away is the day that the Republic has truly died (although it could be said that these days the Republic is already in a sort of near-death comatose state).", 
   {}, 
   247253, 
   null, 
   1168864680.0
  ], 
  [
   247258, 
   null, 
   "emclean", 
   "who's job is it to protece ME from crime?", 
   {}, 
   247254, 
   null, 
   1168874100.0
  ], 
  [
   247260, 
   null, 
   "gamehuis", 
   "who's job is it to protece ME from crime?\n\n Well you should protect yourself of course, that is your right (and duty) as a human being, but that's not what the 2nd amendment is for. It's just convenient that the tools that protect you from tyranny can also be used to protect yourself against criminals.", 
   {}, 
   247258, 
   null, 
   1168877940.0
  ], 
  [
   247329, 
   null, 
   "emclean", 
   "Well you should protect yourself of course, that is your right (and duty) as a human being,\n\n and according to the courts, it is only my job. there is no one else out there who is responsabul for my safety.\n \n \nbut that's not what the 2nd amendment is for. \n\n but it is what section 32 of Indiana constitution Section 32. Arms--Right to bear. The people shall have a right to bear arms, for the defense of themselves and the State.", 
   {}, 
   247260, 
   null, 
   1168902960.0
  ], 
  [
   247615, 
   null, 
   "huckleberry", 
   "\"Even after excluding many reported firearm victimizations, far more survey respondents report having been threatened or intimidated with a gun than having used a gun to protect themselves. A majority of the reported self defense gun uses were rated as probably illegal by a majority of judges. This was so even under the assumption that the respondent had a permit to own and carry the gun, and that the respondent had described the event honestly. CONCLUSIONS: Guns are used to threaten and intimidate far more often than they are used in self defense. Most self reported self defense gun uses may well be illegal and against the interests of society.\"\n http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=pubmed&dopt=Abstract&list_uids=11144624&query_hl=14&itool=pubmed_docsum\n \n \n I do not find the first claim surprising that guns are used far more often in crime than in self defense. What I do find interesting is that most self defense gun uses were rated as probably illegal by judges and that they may be against the interests of society. And this appears to be so even when a person legally owns a gun.\n\n \n I doubt seriously that criminals who are willing to use a gun in the commission of their crimes actually give a rats patooty about whether or not the gun they were using was obtained legally or if there was a law against owning it.", 
   {}, 
   247253, 
   null, 
   1169084100.0
  ], 
  [
   247631, 
   null, 
   "gman", 
   " \n I do not find the first claim surprising that guns are used far more often in crime than in self defense. What I do find interesting is that most self defense gun uses were rated as probably illegal by judges and that they may be against the interests of society. And this appears to be so even when a person legally owns a gun.\n\n \n OK, you've made your point. \n More citizens need to arm themselves so that the number of defensive actions can rise. \n We could also consider making crime illegal. Maybe criminals would stop disregarding their victims right to safety.", 
   {}, 
   247253, 
   null, 
   1169090340.0
  ], 
  [
   247687, 
   null, 
   "Count Otto", 
   "We have a similar piece of legislation in the UK. Statute requires that every male over the age of 14 turn out at their local churchyard, on a Saturday, for two hours of longbow practice for the purposes of maintaining a functioning militia.\n \n It's generally regarded as an anarchronism hereabouts. We did have a civil war in the meantime but somehow everyone who wanted to get involved managed to find themselves a weapon and it all turned out okay.\n \n On the other hand, the statute that makes it legal to shoot a welshman with a bow and arrow if he's caught in sight of the city walls of Chester after midnight, should be protected with our collective dying breaths. Take away that right and who knows where it will end?", 
   {}, 
   247631, 
   null, 
   1169136780.0
  ], 
  [
   247695, 
   null, 
   "E Mutz", 
   "The supposition that guns are used for crime more often than self defense assumes that firearms have no other use. I believe this has been fairly debunked by the sportsmen, target shooters, and others of their ilk. \n \n Using the same logic flaw inherent in the first argument, one might be stunned to discover that the number of cars used in the commission of a crime exceeds the number used to prevent bank robberies. \n \n What I do find interesting is that most self defense gun uses were rated as probably illegal by judges and that they may be against the interests of society. And this appears to be so even when a person legally owns a gun.\n \n Here are some more things you will find interesting. Those drivers who used cars to prevent bank robberies probably committed a number of traffic offenses in their effort to prevent the bank robbery. \n \n For that matter, has a study been done to determine how many traffic ordinances are broken by expectant fathers rushing their wives to the hospital? Judges have the option to waive or enforce these violations just as a judge in a hearing on the justifiable use of force. Perhaps procreators should be registered? Perhaps expectant fathers should not be allowed to own or operate machinery as they might just endanger other motorists someday...\n \n More drunk driving fatalities are caused by car owners than bicyclists. Those bicyclists who avoided drunk drivers admittedly did so by disobeying traffic laws. \n \n The point is that some car owners do many bad bad things. Even drivers who don't kill people with cars do other bad bad things. Car owners cause more death and injuries in the US than firearms. All of these negatives do not overwhelm the positive aspects of car ownership. I don't believe that the study has overwhelmed the positives of firearm ownership either.", 
   {
    "post_info": {
     "post_title": "Guns don't kill people, Bullets kill people, guns just make bullets go real fast"
    }, 
    "unicode_changes_made": true
   }, 
   247687, 
   null, 
   1169140920.0
  ], 
  [
   247719, 
   null, 
   "Master_Shake", 
   "Well you should protect yourself of course, that is your right (and duty) as a human being, but that's not what the 2nd amendment is for.\n\n I don't mean to get off on a tangent here, but it's our duty  to protect ourselves? Right is one thing, but duty?", 
   {}, 
   247260, 
   null, 
   1169146800.0
  ], 
  [
   247720, 
   null, 
   "Master_Shake", 
   "Guns don't kill people, Bullets kill people, guns just make bullets go real fast\n\n lol\n \n Like Chris Rock said, we don't need gun control, we need bullet control ;)", 
   {}, 
   247719, 
   null, 
   1169146860.0
  ], 
  [
   247724, 
   null, 
   "gman", 
   "I don't mean to get off on a tangent here, but it's our duty  to protect ourselves? Right is one thing, but duty?\n\n \n Police are a reactionary force. Most effective in traffic control and revenue collection. \n Police do not have the ability to be where gun related crimes occur. They do not have ESP. Most Americans live many miles from any source of aid. Either in rural or suburban areas. City dwellers have officers in their vicinity but officers are hampered by crowds and traffic. Your assessment of rights versus duty is correct. But if we want to be safe, we should assume the duty.", 
   {}, 
   247719, 
   null, 
   1169147580.0
  ], 
  [
   247741, 
   null, 
   "DrNo", 
   "I don't mean to get off on a tangent here, but it's our duty  to protect ourselves? Right is one thing, but duty?\n\n \n heheheheheheh, you said \"duty.\"\n \n Seriously, though, if it were our duty there would probably be a law against not protecting yourself, which there isn't. That would be absurd. So I think that it is all well and fine that we consider each person having the right to protect themselves. It's not really a duty, however; it is more like our natural survival instinct.", 
   {}, 
   247719, 
   null, 
   1169153880.0
  ], 
  [
   247799, 
   null, 
   "Galileo", 
   "The supposition that guns are used for crime more often than self defense assumes that firearms have no other use. I believe this has been fairly debunked by the sportsmen, target shooters, and others of their ilk.\n\n It was nowhere claimed or assumed that guns can't be used for other purposes besides self defense and crime. The number of times that a gun is used for sporting purposes would not alter the ratio between the use of guns in crime and the use of guns in self defense so it is irrelevant.", 
   {}, 
   247695, 
   null, 
   1169197080.0
  ], 
  [
   247847, 
   null, 
   "huckleberry", 
   "\"Even after excluding many reported firearm victimizations, far more survey respondents report having been threatened or intimidated with a gun than having used a gun to protect themselves. A majority of the reported self defense gun uses were rated as probably illegal by a majority of judges. This was so even under the assumption that the respondent had a permit to own and carry the gun, and that the respondent had described the event honestly. CONCLUSIONS: Guns are used to threaten and intimidate far more often than they are used in self defense. Most self reported self defense gun uses may well be illegal and against the interests of society.\"\n http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=pubmed&dopt=Abstract&list_uids=11144624&query_hl=14&itool=pubmed_docsum\n \n \n I do not find the first claim surprising that guns are used far more often in crime than in self defense. What I do find interesting is that most self defense gun uses were rated as probably illegal by judges and that they may be against the interests of society. And this appears to be so even when a person legally owns a gun.\n\n \n It looks as if your only point is to communicate that it is interesting. What conclusions are you trying to draw?\n \n Please also note that you go a bit far in claiming that guns used for self defense was \"probably\" illegal. The article only states \"may well be illegal and against the best interests of society\". This is a conclusory statement of the article and not intended to be used as a statistical representation which you do (the logical fallacy of equivocation) when you use the term \"probably\".", 
   {}, 
   247253, 
   null, 
   1169242800.0
  ], 
  [
   247863, 
   null, 
   "E Mutz", 
   "It was nowhere claimed or assumed that guns can't be used for other purposes besides self defense and crime. The number of times that a gun is used for sporting purposes would not alter the ratio between the use of guns in crime and the use of guns in self defense so it is irrelevant.\n\n \n \n The framing of the argument is designed to present crime infliction vs crime prevention in order to elicit a response. One is led to a conclusion based on the limited information presented. As such, firearms use other than the ones presented are indeed relevant, unless you intend your factoid to exist in a vaccuum devoid of analysis.\n \n You might also note that Kitchen knives are more often used for crime than for self defense. Would you believe additional information on kitchen knives would be relevant, or would you have all the information necessary to make a policy decision?", 
   {}, 
   247799, 
   null, 
   1169251380.0
  ], 
  [
   247887, 
   null, 
   "Jeffersonian", 
   "\"Even after excluding many reported firearm victimizations, far more survey respondents report having been threatened or intimidated with a gun than having used a gun to protect themselves. A majority of the reported self defense gun uses were rated as probably illegal by a majority of judges. This was so even under the assumption that the respondent had a permit to own and carry the gun, and that the respondent had described the event honestly. CONCLUSIONS: Guns are used to threaten and intimidate far more often than they are used in self defense. Most self reported self defense gun uses may well be illegal and against the interests of society.\"\n http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=pubmed&dopt=Abstract&list_uids=11144624&query_hl=14&itool=pubmed_docsum\n \n \n I do not find the first claim surprising that guns are used far more often in crime than in self defense. What I do find interesting is that most self defense gun uses were rated as probably illegal by judges and that they may be against the interests of society. And this appears to be so even when a person legally owns a gun.\n\n \n \n Hemenway? BWAHHAAAA. The author of your post link? BAAHAAAAHAAA. That makes me laugh.\n \n He is the same guy who tried to prove that when states when CCW that road rage incidents would go up. Well seems that he stopped that research and won't answer what he found. Gee? I wonder what he found.", 
   {}, 
   247253, 
   null, 
   1169265600.0
  ], 
  [
   247903, 
   null, 
   "gamehuis", 
   "I don't mean to get off on a tangent here, but it's our duty  to protect ourselves? Right is one thing, but duty?\n\n Well let me put it like this, I consider it your duty because if you don't protect yourself then you basically shift that responsibility to someone else. Not only is this incredibly selfish, but 9 out of 10 times the 'protection business' gets outsourced to the State.\n This in itself it dangerous because when people decide that a third party like the State (which has no real accountability) has control over their lives it can all to easily lead to a situation where the State becomes tyrannical.\n More people have been killed by their own government than by any foreign government.", 
   {}, 
   247719, 
   null, 
   1169303760.0
  ], 
  [
   247905, 
   null, 
   "gman", 
   " \n I do not find the first claim surprising that guns are used far more often in crime than in self defense. What I do find interesting is that most self defense gun uses were rated as probably illegal by judges and that they may be against the interests of society. And this appears to be so even when a person legally owns a gun.\n\n \n Why would anyone be surprised that the action of bad guys who always have the advantage of surprise on their side outnumber people who get the opporitunity to retrieve a weapon to counter with? Victims of crime usually have no idea of a pending attack and are rarely prepared. \n Now that you've stated that judges suspect that victims defending themselves may be against the interest of society, perhaps you could get them to explain their stupidity?", 
   {}, 
   247253, 
   null, 
   1169308560.0
  ], 
  [
   248160, 
   null, 
   "Galileo", 
   "The framing of the argument is designed to present crime infliction vs crime prevention in order to elicit a response. One is led to a conclusion based on the limited information presented. As such, firearms use other than the ones presented are indeed relevant, unless you intend your factoid to exist in a vaccuum devoid of analysis.\n \n \n You might also note that Kitchen knives are more often used for crime than for self defense. Would you believe additional information on kitchen knives would be relevant, or would you have all the information necessary to make a policy decision? \n\n Okay, you seem to be changing your argument. Nothing was said about a policy decision in the first post. You had earlier claimed that \"The supposition that guns are used for crime more often than self defense assumes that firearms have no other use. I believe this has been fairly debunked by the sportsmen, target shooters, and others of their ilk.\"\n \n It is not a matter of a fact existing in a vacuum. It is a matter of focusing on the relevant information. How does the number of times that guns are used for sporting purposes alter the ratio between the use of guns in crime and the use of guns in self defense?", 
   {}, 
   247863, 
   null, 
   1169527080.0
  ], 
  [
   248210, 
   null, 
   "huckleberry", 
   "Okay, you seem to be changing your argument. Nothing was said about a policy decision in the first post. You had earlier claimed that \"The supposition that guns are used for crime more often than self defense assumes that firearms have no other use. I believe this has been fairly debunked by the sportsmen, target shooters, and others of their ilk.\"\n \n It is not a matter of a fact existing in a vacuum. It is a matter of focusing on the relevant information. How does the number of times that guns are used for sporting purposes alter the ratio between the use of guns in crime and the use of guns in self defense?\n\n \n \n This is exactly why I asked if you were just pointing out something interesting or what you were trying to communicate. People (not necessarily you, but in this case you seem to fit the bill) often make statements like you made in your original post and then expect others to draw nothing from that so that you can argue \"NOthing was ever said about a policy decision in the first post.\" \n \n While you may not have said anything the tone and tennor of your post was such that one could easily draw the inference of the policy decision you were trying to prompt.\n \n I find E Mutz response to be perfectly legitimate given the evasive nature of your argumentation. You are unwilling to stand on anything. It sounds far too much like a politician who will say whatever and say \"I never said that\". It is poor logic and poor argumentation. Perhaps you could consider answer the question I posted which was \"what are you actually trying to communicate?\" and avoid all the confusion. Unless, of course, the confusion was a part of your strategy in the first place, which you will now find that you have been found out.\n \n Huck", 
   {}, 
   248160, 
   null, 
   1169581080.0
  ], 
  [
   248246, 
   null, 
   "E Mutz", 
   "Okay, you seem to be changing your argument. Nothing was said about a policy decision in the first post. You had earlier claimed that \"The supposition that guns are used for crime more often than self defense assumes that firearms have no other use. I believe this has been fairly debunked by the sportsmen, target shooters, and others of their ilk.\"\n \n It is not a matter of a fact existing in a vacuum. It is a matter of focusing on the relevant information. How does the number of times that guns are used for sporting purposes alter the ratio between the use of guns in crime and the use of guns in self defense?\n\n \n \n Why sir, there is no change in argument. You stated that there was something interesting in a head to head comparison (guns/crime vs guns/self defense.) I countered with a head to head comparison (kitchen knives/crime vs kitchen knives/self defense) to demonstrate how the head to head comparison that excludes mitigating factors is factually irrelevant. The reader either makes an uninformed decision or asks Paul Harvey to provide the Rest of the Story.\n \n The problem with focusing on your \"relevant information\" is that once you start trying to formulate a conclusion, you must address outside concerns. The fact that more ocean liners were sunk by icebergs than the number of icebergs sunk by ocean liners in 1912 is interesting perhaps, but so what? Where do you go from there? Simply say \"huh, neat.\" and move on? Do you rid the world of icebergs? \n \n Nay sir, you do not waltz into a debate forum, announce a set of relevant facts then just stand there and admire your handiwork. You MUST expect a response. \n \n Based on the relevant information provided by your posting on this board, I can conclude that you either wanted to commence a debate on the subject, or else got lost looking for Wikipedia. I have granted you a modicum of respect and proceeded from the former conclusion. Do you wish to admit to the other possible conclusion and thus patter off without further discussion? Or would additional information be of value to the question at hand? If you subscribe to any of these conclusions, you have debunked your previous argument. If you introduce additional information, you have debunked your previous argument. \n \n Cordially,", 
   {}, 
   248160, 
   null, 
   1169593380.0
  ], 
  [
   248495, 
   null, 
   "Galileo", 
   "This is exactly why I asked if you were just pointing out something interesting or what you were trying to communicate. People (not necessarily you, but in this case you seem to fit the bill) often make statements like you made in your original post and then expect others to draw nothing from that so that you can argue \"NOthing was ever said about a policy decision in the first post.\"\n\n I was questioning how EMutz's second post was logically related to his first post. As I understood his first post said nothing about a public policy. \n \n \n\n While you may not have said anything the tone and tennor of your post was such that one could easily draw the inference of the policy decision you were trying to prompt.\n \n I find E Mutz response to be perfectly legitimate given the evasive nature of your argumentation. You are unwilling to stand on anything. It sounds far too much like a politician who will say whatever and say \"I never said that\". It is poor logic and poor argumentation. Perhaps you could consider answer the question I posted which was \"what are you actually trying to communicate?\" and avoid all the confusion. Unless, of course, the confusion was a part of your strategy in the first place, which you will now find that you have been found out.\n \n Huck\n\n If I come out and challenge one of the major beliefs of the gun lobby I think I'm standing on something. I don't need an explanation in my post that says, \"by the way this is an argument in favor of gun control\". And I only view the information in the first part of my post that way because the second part (which I referred to as interesting) was of a less certain nature.", 
   {}, 
   248210, 
   null, 
   1169824080.0
  ], 
  [
   248496, 
   null, 
   "Galileo", 
   "Why sir, there is no change in argument. You stated that there was something interesting in a head to head comparison (guns/crime vs guns/self defense.) I countered with a head to head comparison (kitchen knives/crime vs kitchen knives/self defense) to demonstrate how the head to head cfactually irrelevant. The reader either makes an uninformed decision or asks Paul Harvey to provide omparison that excludes mitigating factors is the Rest of the Story.\n \n The problem with focusing on your \"relevant information\" is that once you start trying to formulate a conclusion, you must address outside concerns. The fact that more ocean liners were sunk by icebergs than the number of icebergs sunk by ocean liners in 1912 is interesting perhaps, but so what? Where do you go from there? Simply say \"huh, neat.\" and move on? Do you rid the world of icebergs? \n \n Nay sir, you do not waltz into a debate forum, announce a set of relevant facts then just stand there and admire your handiwork. You MUST expect a response. \n \n Based on the relevant information provided by your posting on this board, I can conclude that you either wanted to commence a debate on the subject, or else got lost looking for Wikipedia. I have granted you a modicum of respect and proceeded from the former conclusion. Do you wish to admit to the other possible conclusion and thus patter off without further discussion? Or would additional information be of value to the question at hand? If you subscribe to any of these conclusions, you have debunked your previous argument. If you introduce additional information, you have debunked your previous argument. \n \n Cordially,\n\n Additional information wouldn't necessarily make the information I presented irrelevant. It depends on what the information is. Analogies can only take you so far and I question how comparable kitchen knives, icebergs and guns are to each other. So perhaps you'd like to tell me what these mitigating factors associated with guns are?", 
   {}, 
   248246, 
   null, 
   1169824980.0
  ], 
  [
   248526, 
   null, 
   "huckleberry", 
   "I was questioning how EMutz's second post was logically related to his first post. As I understood his first post said nothing about a public policy. \n \n \n If I come out and challenge one of the major beliefs of the gun lobby I think I'm standing on something. I don't need an explanation in my post that says, \"by the way this is an argument in favor of gun control\". And I only view the information in the first part of my post that way because the second part (which I referred to as interesting) was of a less certain nature.\n\n \n \n I have clearly misunderstood your intentions. I apologize for butting in.\n \n Huck", 
   {}, 
   248495, 
   null, 
   1169841960.0
  ], 
  [
   248546, 
   null, 
   "E Mutz", 
   "Additional information wouldn't necessarily make the information I presented irrelevant. It depends on what the information is.\n\n \n That was my point sir. What point were you trying to make, other than the fact that you were fascinated by half an argument? I was perplexed as to where you were going with it. This is not after all a show-and-tell forum, it is a debate forum. I am not trying to berate ye, merely to understand where we are going... \n \n \nAnalogies can only take you so far \n\n \n I agree, but presenting a statistical irrelevancy will get you an even shorter distance. What conclusions can you form from the statement \"more kitchen knives are used in crime than in self defense. Just try to move forward with just those two facts and you will understand my bewilderment. The kitchen knife statistic is equally fascinating as your firearm statistic. My point in presenting the analogy is that one can clearly see alternative uses to kitchen knives that makes the limited comparison seem less significant. \n \n \n I question how comparable kitchen knives, icebergs and guns are to each other. So perhaps you'd like to tell me what these mitigating factors associated with guns are?\n\n \n The question is not what guns have to do with icebergs, but rather what the first half of your original statement has to do with the other. My argument has nothing to do with WHAT you are arguing about, but rather the METHOD in which you are attempting to do so. So clear your mind of all considerations of policy, ocean liners, and mayonnaise spreading implements and focus on the following:\n \n Consider that an item may be used for A, B, C, D, E, and F. Now present a statistic that suggests that A<B where A result is a negative and B result is a positive. How is your statement complete from a logical or intellectually honest standpoint? The statement by itself may be irrefutable, but without full context, it is impossible to judge the full effect.", 
   {
    "unicode_changes_made": true
   }, 
   248496, 
   null, 
   1169849160.0
  ], 
  [
   248777, 
   null, 
   "Galileo", 
   "That was my point sir. What point were you trying to make, other than the fact that you were fascinated by half an argument? I was perplexed as to where you were going with it. This is not after all a show-and-tell forum, it is a debate forum. I am not trying to berate ye, merely to understand where we are going... \n \n I agree, but presenting a statistical irrelevancy will get you an even shorter distance. What conclusions can you form from the statement \"more kitchen knives are used in crime than in self defense. Just try to move forward with just those two facts and you will understand my bewilderment. The kitchen knife statistic is equally fascinating as your firearm statistic. My point in presenting the analogy is that one can clearly see alternative uses to kitchen knives that makes the limited comparison seem less significant.\n \n The question is not what guns have to do with icebergs, but rather what the first half of your original statement has to do with the other. My argument has nothing to do with WHAT you are arguing about, but rather the METHOD in which you are attempting to do so. So clear your mind of all considerations of policy, ocean liners, and mayonnaise spreading implements and focus on the following:\n \n Consider that an item may be used for A, B, C, D, E, and F. Now present a statistic that suggests that A<B where A result is a negative and B result is a positive. How is your statement complete from a logical or intellectually honest standpoint? The statement by itself may be irrefutable, but without full context, it is impossible to judge the full effect.\n\n But consideration of C, D, E, and F would not necessarily make the A<B comparison \"a statistical irrelevancy\". In the case of kitchen knives it might be because crime and self defense are far from being the main reasons for owning kitchen knives. Similiarly, in the case of cars such a comparison would be much less relevant because crime and self defense are not the main reasons people own cars. Transportation is. But the gun control debate centers so much around crime and self defense that I fail to see how such a statistic could be considered irrelevant to the debate.", 
   {
    "unicode_changes_made": true
   }, 
   248546, 
   null, 
   1170050880.0
  ], 
  [
   250504, 
   null, 
   "TRIGGER", 
   "The claim by the anti gun lobby that guns are used more often in crime than in self defence is and old one. Since they say that a gun is only used 2 to 3 hundred times a year in self defence. This number correlates with the number of criminals killed in the commission of a crime by their victims. Though it dosen't take in to account the millions of times a year where the criminal is detured from committing a crime because the victim is armed. I my self question any study done by a liberal institution like Havard that would have a desired out come for such a study. If you want to see the flip side of this study read John R Lotts book More Guns Less Crime it is a county buy county study using FBI crime statistics and proves just the opposite. I don't know this other study, but there was another one done in Texas that claims that lawful gun owners are 12 times less likley to commit a crime than the general public.\n \n I my self have detured 2 crimes in my past just by showing the butt of my pistol and by your study I guess I intimidated those criminals with a gun.", 
   {}, 
   248777, 
   null, 
   1171086960.0
  ], 
  [
   250538, 
   null, 
   "gman", 
   "The fact that guns are used in more crimes than in events of self defense is a reality only because law abiding citizens don't carry guns on a regular basis. \n It has nothing to do with \"if\" ownership of guns should be a right to law abiding citizens. \n A criminal cares nothing about laws. Crime is against the law. Depriving innocents the ability to defend themselves will not deter criminals from their craft. Getting shot will.", 
   {}, 
   250504, 
   null, 
   1171136340.0
  ], 
  [
   250677, 
   null, 
   "Yossarian", 
   "E Mutz I like you. You're too fu*@ing funny. emoticon_xgood \n \nWhat conclusions can you form from the statement \"more kitchen knives are used in crime than in self defense. Just try to move forward with just those two facts and you will understand my bewilderment.\n *sic\n \n I don't think, Galileo, that anyone's saying the first post presented \"irrelevant\" information, necessarily. Only that it (by itself) is irrelevant to anything but itself. Get it?", 
   {
    "unicode_changes_made": true
   }, 
   250538, 
   null, 
   1171246860.0
  ], 
  [
   250709, 
   null, 
   "Galileo", 
   "E Mutz I like you. You're too fu*@ing funny. emoticon_xgood \n *sic\n \n I don't think, Galileo, that anyone's saying the first post presented \"irrelevant\" information, necessarily. Only that it (by itself) is irrelevant to anything but itself. Get it?\n\n That's another way of saying it's irrelevant. What baffles me is that the pro-gun side does a lot to promote the self defense benefits of guns and then when someone presents information to question that claim people suddenly forget why the topic is relevant.", 
   {}, 
   250677, 
   null, 
   1171263600.0
  ], 
  [
   250710, 
   null, 
   "Galileo", 
   "The claim by the anti gun lobby that guns are used more often in crime than in self defence is and old one. Since they say that a gun is only used 2 to 3 hundred times a year in self defence. This number correlates with the number of criminals killed in the commission of a crime by their victims. Though it dosen't take in to account the millions of times a year where the criminal is detured from committing a crime because the victim is armed. I my self question any study done by a liberal institution like Havard that would have a desired out come for such a study. If you want to see the flip side of this study read John R Lotts book More Guns Less Crime it is a county buy county study using FBI crime statistics and proves just the opposite. I don't know this other study, but there was another one done in Texas that claims that lawful gun owners are 12 times less likley to commit a crime than the general public.\n \n I my self have detured 2 crimes in my past just by showing the butt of my pistol and by your study I guess I intimidated those criminals with a gun.\n\n Since the publication of More Guns Less Crime, a lot of doubts have arisen about the claims in the book. Lott analyzed crime data between 1977 and 1992. After 1992 a lot of places in the US without shall issue laws experienced big decreases in crime which is inconvenient for Lott's thesis. In addition, a lot of doubts have arisen about Lott's personal credibility-\n \"John Lott is a right-wing author who has made claims about the benefits of guns using fabricated evidence. To support his points on the Internet, he adopts various pseudonyms (known as sock puppets) who write in supporting John Lott and giving his books good reviews......\"\n http://www.sourcewatch.org/index.php?title=John_Lott", 
   {}, 
   250504, 
   null, 
   1171265160.0
  ], 
  [
   250905, 
   null, 
   "TRIGGER", 
   "Since the publication of More Guns Less Crime, a lot of doubts have arisen about the claims in the book. Lott analyzed crime data between 1977 and 1992. After 1992 a lot of places in the US without shall issue laws experienced big decreases in crime which is inconvenient for Lott's thesis.\n\n \n Not realy since alot of states legislated stiffer sentances for repeat offenders ,3 stikes your out remember those laws. I have never stated that guns were the only answer and I know of no one who has. \n \n \n \nIn addition, a lot of doubts have arisen about Lott's personal credibility-\n \"John Lott is a right-wing author who has made claims about the benefits of guns using fabricated evidence. To support his points on the Internet, he adopts various pseudonyms (known as sock puppets) who write in supporting John Lott and giving his books good reviews......\"\n http://www.sourcewatch.org/index.php?title=John_Lott\n\n \n This is the first I've heard of this but, I can't remember the name of this left wing professor ( It will take me time but I'll find his name) he went out to prove that gun's caused crime and found just the opposite. Every state that has adopted right to carry has had a drop in crime every one. In my state we had shall issue for a long time though we had 2 lices. one (for hunting and target) and (Protection). This allowed the chief to issue what he wanted. H&T you could carry conceiled but unloaded Protection it could be loaded. Most lic were for H&T there were very few issued for protection. In the early 90's the wording on the lic changed to all lawful purposes and 1 lic. The crime rate droped. In 98 the legislature changed the law to may issue most renewed their lic before the law took effect, for 4 more years now the crime rate has started to climb again that people are being denied again for no good reason .. I am not suprised that Lott would be under attack, anyone who has done a pro gun study goes under attack from the anti gunners.", 
   {}, 
   250710, 
   null, 
   1171412760.0
  ], 
  [
   250960, 
   null, 
   "E Mutz", 
   "What baffles me is that the pro-gun side does a lot to promote the self defense benefits of guns and then when someone presents information to question that claim people suddenly forget why the topic is relevant.\n \n What baffles me is the apparent assertion that negative aspects of a constitutional right somehow trump the right itself. I have no need and no interest in defending gun ownership as ye seem to indicate. I do not have to; the founding fathers have done this for me. Ye may give yourself scrivener's palsy deriving all possible negative aspects of gun ownership and still not dent the constitutionality of firearm ownership. Ye might as well list off all the positive aspects of quartering troops in my home for all the good it will avail ye.\n \n While ye are arguing against the constitution, consider that the average IQ is 100. Simple mathematics will inform ye that statistically, half of all people have a below average IQ, and thus any opinion expressed by any given individual has a 50% chance of being...shall we say...ill-informed. What level of controls would ye place on free speech? Surely we cannot have want-wits prattling about without some form of control! Would ye suggest that the potential for indiscriminate idiocy would outweigh the benefits of free speech? Extraordinary! \n \n The fact that there are racists and bigots and XXXXXX does nothing to reduce the right of the people to engage in free speech. The fact that there are criminals and murderers and violent bad bad people does nothing to reduce the rights of the people to keep and bear arms.", 
   {
    "unicode_changes_made": true
   }, 
   250709, 
   null, 
   1171480500.0
  ], 
  [
   250983, 
   null, 
   "Bryan", 
   "What baffles me is that the pro-gun side does a lot to promote the self defense benefits of guns and then when someone presents information to question that claim people suddenly forget why the topic is relevant.\n \n What baffles me is the apparent assertion that negative aspects of a constitutional right somehow trump the right itself. I have no need and no interest in defending gun ownership as ye seem to indicate. I do not have to; the founding fathers have done this for me. Ye may give yourself scrivener's palsy deriving all possible negative aspects of gun ownership and still not dent the constitutionality of firearm ownership. Ye might as well list off all the positive aspects of quartering troops in my home for all the good it will avail ye.\n \n While ye are arguing against the constitution, consider that the average IQ is 100. Simple mathematics will inform ye that statistically, half of all people have a below average IQ, and thus any opinion expressed by any given individual has a 50% chance of being...shall we say...ill-informed. What level of controls would ye place on free speech? Surely we cannot have want-wits prattling about without some form of control! Would ye suggest that the potential for indiscriminate idiocy would outweigh the benefits of free speech? Extraordinary! \n \n The fact that there are racists and bigots and XXXXXX does nothing to reduce the right of the people to engage in free speech. The fact that there are criminals and murderers and violent bad bad people does nothing to reduce the rights of the people to keep and bear arms.\n\n \n Amen brother. \n \n I don't have to justify the necessity of having a right to be free from unreasonable search and seizure; a right to free speech, press, and assembly; a right to remain silent, to be free from cruel and unusual punishments; or the 13th. Amendment's right not to be a slave. Why is it that the 2nd. Amendment RKBA is the only right which freedom haters believe they can demand justification for its existence?\n \n If you don't like the RKBA, then fine. Try and amend it out of the Constitution. But if criminal misuse is the standard for eradicating things, then we ought to bring back prohibition to cut down on the \"epidemic\" of drunk driving. I can see it now:\n \n The Man shows up at my door one night and demands that I surrender all the beer in my fridge. When I ask him why he says \"because we just caught a guy who killed somebody across town while driving drunk, and we have decided that we can't trust anyone with alcohol anymore.\" \n \n How is this different from banning guns as an attempt to cut down on crime? Who here can justify making any fundamental right I possess contingent on the behavior of others? If I am not responsible for the criminal misuse of guns by others, then how can someone claim that what others do justifies taking my right from me?\n \n http://www.4forums.com/political/showthread.php?p=246709#post246709 \n \n ---\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921. \n \n \"And I cannot see, why arms should be denied to any man who is not a slave, since they are the only true badges of liberty. . . .The possession of arms is the distinction between a freeman and a slave. He who has nothing, and belongs to another, must be defended by him, and needs no arms: but he who thinks he is his own master, and has anything he may call his own, ought to have arms to defend himself and what he possesses, or else he lives precariously and at discretion. And though for a while those who have the sword in their power abstain from doing him injury; yet, by degrees, he will be awed into submission to every arbitrary command. Our ancestors, by being always armed, and frequently in action, defended themselves against the Romans, Danes, and English; and maintained their liberty against encroachments of their own princes.\" Andrew Fletcher, Political Works, pp. 35 and 221 (1749).", 
   {
    "post_info": {
     "post_title": "It's a right, period."
    }, 
    "unicode_changes_made": true
   }, 
   250960, 
   null, 
   1171496400.0
  ], 
  [
   251032, 
   null, 
   "Count Otto", 
   "The Man shows up at my door one night and demands that I surrender all the beer in my fridge. When I ask him why he says \"because we just caught a guy who killed somebody across town while driving drunk, and we have decided that we can't trust anyone with alcohol anymore.\" \n \n How is this different from banning guns as an attempt to cut down on crime? Who here can justify making any fundamental right I possess contingent on the behavior of others? If I am not responsible for the criminal misuse of guns by others, then how can someone claim that what others do justifies taking my right from me?\n\n \n I don't understand this. I mean...that's exactly what you *did* do with the 18th amendment wasn't it? And then repealed it in the 21st? Was it wrong then? Or just unpopular?", 
   {
    "unicode_changes_made": true
   }, 
   250983, 
   null, 
   1171558980.0
  ], 
  [
   251053, 
   null, 
   "Bryan", 
   "Yep, we sure did effectively ban alcohol with the 18th., which was why my post referred to bringing back prohibition. I understand that it was a very popular idea when it was passed. I think it was wrong then, and I think it would be wrong now. \n \n My prohibition example seeks to take an otherwise lawful product from me not because I did anything worthy of losing it, but because someone else did. I used it as an example because in this sense it is similar to the justifications advanced for gun control.\n \n But perhaps prohibition was a poor object of comparison because it does not involve a fundamental right. So let me choose another right instead. There is no right afforded to Americans that is more dangerous to our society than the 4th. Amendment's right to be free from unreasonable search and seizure. This broad freedom severely restricts law enforcement's ability to combat all manner of crime, be it drugs, gangs, or terrorism. How often have we recently read about my government's desire to broaden its search and seizure powers in the name of combating domestic terrorism? \n \n It is the same principle at work when we suggest banning guns. Those in power first suggest that a crisis or emergency exists which must be resolved by drastic measures. A few have chosen to criminally misuse their freedom, and the only answer to save us from this crisis is to force the many who are innocent to surrender their freedom in exchange for the illusion of greater safety. I can remember when a presidential candidate suggested we do just that: \n \n \"Pick a night and cordon off a section of South Dallas. Send hundreds of police officers--however many it would take-into the area to 'vacuum it up.' Shake down everybody on the street. Search every house and apartment. Confiscate all drugs and weapons.\" Ross Perot (Source: The Washington Post, June 6, 1992).\n \n I do not live in a police state. I am note required to justify why I enjoy the freedoms secured to me by my ancestors. I live in a country in which the principle of my government is not to respond to crime by retaliating against the innocent. I believe that a total gun ban, no matter how it is justified, violates this principle. I believe that even those who work diligently to take my guns from me are prepared to accept this indictment of their actions. They simply justify what they are doing by arguing the crisis is so great that the end justifies their draconian means. \n \n But this gun control public policy argument cannot stand in the face of a fundamental right. If the RKBA exists, then their need based argument to ban guns is irrelevant, for no argument in favor of banning guns can succeed so long as the constitution denies them the authority to take them from me. Now it is no secret that gun control proponents know they lack the ability to change the constitution through amendment. This is why they instead argue that the 2nd. Amendment phrase \"right of the people\" really means a \"right of the states.\" If this example of Orwellian doublethink interpretation were to be accepted, then they would be entitled to make me satisfy their demand to justify why I should have a gun. Until then, I tell them that I own guns because the constitution ensures that I can. \n \n ---\n \n \"False is the idea of utility that sacrifices a thousand real advantages for one imaginary or trifling inconvenience; that would take fire from men because it burns, and water because one may drown in it; that has no remedy for evils, except destruction. The laws that forbid the carrying of arms are laws of such a nature. They disarm only those who are neither inclined nor determined to commit crimes. Can it be supposed that those who have the courage to violate the most sacred laws of humanity, the most important of the code, will respect the less important and arbitrary ones, which can be violated with ease and impunity, and which, if strictly obeyed, would put and end to personal liberty--so dear to men, so dear to the enlightened legislator--and subject innocent persons to all the vexations that the guilty alone ought to suffer? Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than to prevent homicides, for an unarmed man may be attacked with greater confidence than an armed man. They ought to be designated as laws not preventative but fearful of crimes, produced by the tumultuous impression of a few isolated facts, and not by thoughtful consideration of the inconveniences and advantages of a universal decree.\"-- Thomas Jefferson, Commonplace Book, 1774-1776, quoting 18th century criminologist Cesare Beccaria in On Crimes and Punishment, 1764. \n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Olmstead v. United States, 277 U.S. 438, 485 (1928) (J. Brandeis, dissenting).\n \n \"The natural progress of things is for liberty to yield and government to gain ground.\"-Thomas Jefferson\n \n \"The saddest epitaph which can be carved in memory of a vanished liberty is that it was lost because its possessors failed to stretch forth a saving hand while yet there was time.\"-Justice George Sutherland", 
   {
    "post_info": {
     "post_title": "Prohibition, the 4th. Amendment, and gun control"
    }, 
    "unicode_changes_made": true
   }, 
   251032, 
   null, 
   1171572300.0
  ], 
  [
   252506, 
   null, 
   "Galileo", 
   "What baffles me is that the pro-gun side does a lot to promote the self defense benefits of guns and then when someone presents information to question that claim people suddenly forget why the topic is relevant.\n \n What baffles me is the apparent assertion that negative aspects of a constitutional right somehow trump the right itself.\n \n I would question the relevancy of your argument. Who is making the argument that the information presented in this thread should be used to violate the Constitution? The courts have generally recognized no conflict between gun laws and the Second Amendment. And most gun control groups aren't actually advocating the confiscation of firearms. What they are advocating are laws that minimize the danger that firearms pose to society so that the rights of innocent people are not violated by gun violence. The gun lobby likes to give lip service to the idea of rights and freedom but every time they oppose reasonable safety measures intended to protect people's rights they show where they really stand.", 
   {}, 
   250960, 
   null, 
   1172492520.0
  ], 
  [
   252510, 
   null, 
   "E Mutz", 
   "I would question the relevancy of your argument. Who is making the argument that the information presented in this thread should be used to violate the Constitution? The courts have generally recognized no conflict between free speach laws and the First Amendment. And most thought control groups aren't actually advocating the confiscation of books. What they are advocating are laws that minimize the danger that books pose to society so that the rights of innocent people are not violated by those not intelligent enough to use them properly. The librarian lobby likes to give lip service to the idea of rights and freedom but every time they oppose reasonable safety measures intended to protect people's rights they show where they really stand.\n \n I simply took your reply and substituted the second amendment with the first to demonstrate the relevancy. Now lets discuss measures for quartering a reasonable amount of troops in my house.", 
   {
    "post_info": {
     "post_title": "Federal Law:  You must wait 7 days before reading this post"
    }
   }, 
   252506, 
   null, 
   1172505000.0
  ], 
  [
   252745, 
   null, 
   "TRIGGER", 
   " And most gun control groups aren't actually advocating the confiscation of firearms..\n\n \n Not yet, but as always they will not show their hand until they are ready. Like banning assult weapons these guns are rarely used in crime, they want to ban them because of their potential, whether they are ever used or not is irrelevant.\n \n \n What they are advocating are laws that minimize the danger that firearms pose to society so that the rights of innocent people are not violated by gun violence.\n\n \n How about the rights of the gun owner? What rights and how would those criminals violate those rights with a gun? So you would violate the rights of the people to have the tools to protect them selves from criminals. If you think gun are a danger to society how about the danger that governments pose? In the last century governments killed over 150 millon innocent civilians. This is why we have a second amendment so we the people have the tools to over throw the government if it should become nessary. It is dangerious to libertys of the people to have an army stationed among them over which they have no control. \n \n \n The gun lobby likes to give lip service to the idea of rights and freedom but every time they oppose reasonable safety measures intended to protect people's rights they show where they really stand.\n\n \n What measures? I have yet to see any measures that effected anyone but the law abiding gun owner. You talk about rights what rights? If they wanted to do anything to protect the people they would call for the end to the revolving door justice system and stiffer sentances for convicted felones.\n \n As far as the rights of innocent people being violated by gun violence. I am not sure what you mean, do you beleave that you have a right to be free from crime and,or violence? I would like to see how you explain that. You don't have a right to be free from crime, though you do have a right to protect your self from it. Since the police are here for after the crime is committed, not to prevent crime. It is your responsibility to protect your family and self, that task falls to no one else but you. Your only choice is how you do it, you don't have to use a gun you can use any method you chose. But with a gun a woman 5' tall weighing 90 lbs can protect herself from the attack of a man 6'6\" tall and 350lbs with ease, no other method can boast that.", 
   {}, 
   252506, 
   null, 
   1172632200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Guns used much more often in crime than in self defense", 
  "url": "http://www.4forums.com/political/gun-control-debates/9451-guns-used-much-more-often-crime-than-self-defense.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 9451, 
  "discussion_files": [
   [
    "15281.html", 
    "http://www.4forums.com/political/gun-control-debates/9451-guns-used-much-more-often-crime-than-self-defense-print.html"
   ], 
   [
    "15282.html", 
    "http://www.4forums.com/political/gun-control-debates/9451-guns-used-much-more-often-crime-than-self-defense-3-print.html"
   ], 
   [
    "15283.html", 
    "http://www.4forums.com/political/gun-control-debates/9451-guns-used-much-more-often-crime-than-self-defense-2-print.html"
   ]
  ], 
  "identifier": 9451
 }
]