[
 [
  [
   247371, 
   null, 
   "procrastinating", 
   "i've spent the last few days thinking about the pro's and con's of Decriminalizing very small Mushrooms, opium, and Cocaine, as well as legalizing and allowing Marijuana to become a legal cash crop in the United States. I am a supporter of the Idea, Just wondering where everyone else was on the issue.", 
   {
    "post_info": {
     "post_title": "Drug Legalization and decriminalization"
    }
   }, 
   null, 
   null, 
   1168915620.0
  ], 
  [
   247419, 
   null, 
   "Steeeeve", 
   "I really don't support the idea...even more so with cocaine.", 
   {}, 
   247371, 
   null, 
   1168966920.0
  ], 
  [
   247441, 
   null, 
   "procrastinating", 
   "any reason?", 
   {}, 
   247419, 
   null, 
   1168982880.0
  ], 
  [
   247514, 
   null, 
   "Steeeeve", 
   "A society functions better not on cocaine :)", 
   {}, 
   247441, 
   null, 
   1169051280.0
  ], 
  [
   247527, 
   null, 
   "jitobear", 
   "Legalize, tax it and get the damn hoodlums who sell it off the streets. I am tired of the violence in my neighborhood tied to it. It ain't my problem if a junkie wants to ruin their life. I want my 12 year old safe.", 
   {}, 
   247514, 
   null, 
   1169054640.0
  ], 
  [
   247749, 
   null, 
   "procrastinating", 
   "A society functions better not on cocaine :)\n\n \n Does it function better on tobacco? Alcohol? Caffine? How about hundereds and hundereds of different pills?", 
   {}, 
   247514, 
   null, 
   1169156580.0
  ], 
  [
   247994, 
   null, 
   "gman", 
   "The answer to drug abuse is to legalize it's use? \n Drunk drivers remain a problem. Almost half of deadly accidents that occur are alcohol related. What we do not need are more drivers driving under the influence of more legal substances. \n Those hoodlums on the street will find another reason to be there. They are quite adaptable.", 
   {}, 
   247749, 
   null, 
   1169414760.0
  ], 
  [
   248009, 
   null, 
   "Steeeeve", 
   "Does it function better on tobacco? Alcohol? Caffine? How about hundereds and hundereds of different pills?\n\n \n caffine maybe...everything else, no.\n \n The argument that \"because this is legal so should this\" doesn't make any sense....one could say it should all be illegal or all be legal but you choose only one side ;)", 
   {}, 
   247749, 
   null, 
   1169420280.0
  ], 
  [
   248061, 
   null, 
   "iparent", 
   "i don't think any of the drugs listed should be legal to sell, but I do think there can be 'weed' shops, where you must purchase as well as smoke everything inside the store", 
   {}, 
   248009, 
   null, 
   1169456580.0
  ], 
  [
   248194, 
   null, 
   "Another opinion", 
   "I see both sides of the arguement and, personally, haven't decided yet about whether to support drug legalization.\n \n On the pro-drug legalization side, I can see the arguements:\n 1) For those people who are able to use drugs responsibly, the legalization of strong drugs (cocaine, heroine, etc.) would be no different than people's use of alcohol. \n 2) Drug legalization would allow for the drug trade to be directed by legal companies under the control of the government, thus putting the drug lords out of business and reducing drug-related crime. \n 3) Legalization of drugs could also allow drug companies to develop and manufacture drugs that are not addictive. \n \n The arguements against drug legalization might include:\n 1) Many people are not able to use drugs responsibly (despite their own dillusions that they are) and, either through ignorance or weakness, allow themselves to get addicted - thus potentially causing themselves and others harm in their desperation for drugs. \n 2) Legalizing drugs would constitute government sanction of drugs - i.e. that it is \"ok\" to use them. This might increase the amount of drug users. Since most drug use generally renders society less competent, this would be a negative. \n \n Anyway, those are a few arguements for and against drug legalization. I haven't decided either way.", 
   {}, 
   248061, 
   null, 
   1169572680.0
  ], 
  [
   248231, 
   null, 
   "Master_Shake", 
   "Legalize, tax it and get the damn hoodlums who sell it off the streets. I am tired of the violence in my neighborhood tied to it. It ain't my problem if a junkie wants to ruin their life. I want my 12 year old safe.\n\n I honestly don't mean to sound judgemental, but if it's so bad, get the heck out of there.", 
   {}, 
   247527, 
   null, 
   1169589960.0
  ], 
  [
   248234, 
   null, 
   "Master_Shake", 
   "\n 1) For those people who are able to use drugs responsibly, the legalization of strong drugs (cocaine, heroine, etc.) would be no different than people's use of alcohol. \n\n There's no such thing as responsible or moderate heroin use.\n \n3) Legalization of drugs could also allow drug companies to develop and manufacture drugs that are not addictive. \n \n\n How would it do that?", 
   {}, 
   248194, 
   null, 
   1169590140.0
  ], 
  [
   248313, 
   null, 
   "Another opinion", 
   "There's no such thing as responsible or moderate heroin use.\n\n Why do you say that? Do you claim that it is immediately addictive? I am seriously asking since I am not an expert in this.\n \nHow would it do that?\n\n It would take time. However, the drug trade that is lucrative for illegal cartels would become lucrative for a drug company to pursue. I would assume that there would be insentives for drug companies to then develop drugs for recreational use that are not addictive - either via government pressure (limitations on addictive drugs) or through customer interest. \n \n As in my earlier post, I can see both the pros and cons of legalizing drugs. I would be against the blanket legalization of all drugs since some are clearly quite addictive. However, I am undecided as to the more benign drugs such as marijuana. Part of it comes into the question of how much we should let laws protect people from themselves and their own irresponsibility.", 
   {}, 
   248234, 
   null, 
   1169659740.0
  ], 
  [
   248446, 
   null, 
   "Master_Shake", 
   "Why do you say that? Do you claim that it is immediately addictive? I am seriously asking since I am not an expert in this.\n\n It can be. It's almost as addictive as meth. Few if any heroine users begin their drug use with heroine. By the time they reach that point, they're already an addict.\n \n \nIt would take time. However, the drug trade that is lucrative for illegal cartels would become lucrative for a drug company to pursue. I would assume that there would be insentives for drug companies to then develop drugs for recreational use that are not addictive - either via government pressure (limitations on addictive drugs) or through customer interest. \n \n\n Drug companies already make drugs that are addictive, and there's no pressure for them to stop, what would be any different if all drugs were legal?", 
   {}, 
   248313, 
   null, 
   1169767800.0
  ], 
  [
   248451, 
   null, 
   "Another opinion", 
   "Drug companies already make drugs that are addictive, and there's no pressure for them to stop, what would be any different if all drugs were legal?\n\n I assume that the addictive drugs which companies make now are tolerated by the government because their medical benifits outweigh the negatives of their addictive aspects and since there might not be suitable non-addictive alternatives for the particular ailments in question. \n \n In the case of legalized drugs, I would assume that the government would have some incentive of limiting the development, use or distribution of addictive drugs for the sake of protection of society. Customers also would probably prefer to have drugs that can give them the same \"high\" without the risk of addiction. Some would only take drugs if they were not addictive - opening up a pool of new customers. Both these reasons might entice drug companies to develop non-addictive versions of drugs.", 
   {}, 
   248446, 
   null, 
   1169770500.0
  ], 
  [
   248461, 
   null, 
   "Master_Shake", 
   "And what's stopping them from doing that now?", 
   {}, 
   248451, 
   null, 
   1169774580.0
  ], 
  [
   248465, 
   null, 
   "Another opinion", 
   "And what's stopping them from doing that now?\n\n A legal company would not develop non-addictive versions of currently illegal drugs since there would be no market for them, no profit, unless they sold those illegal but non-addictive drugs illegally (in which case the government would shut them down).\n \n As for their making non-addictive versions of drugs for medical uses, since they have a market already of people who NEED the drug and have nowhere else to go, they might have less incentive to develop a non-addictive version of the drug. A competitor might come along with a new version of the drug that is non-addictive and equally effective - something attractive to customers. If that competitor steals away market share, then they might be inclined to do more research into a non-addictive alternative. \n \n Competition does have its benefits too. Indeed, if drugs were legalized, competition between drug companies might drive drugs to become the thing that customers want - i.e. potent but not-addictive.", 
   {}, 
   248461, 
   null, 
   1169776020.0
  ], 
  [
   248516, 
   null, 
   "Master_Shake", 
   "A legal company would not develop non-addictive versions of currently illegal drugs since there would be no market for them, no profit, unless they sold those illegal but non-addictive drugs illegally (in which case the government would shut them down).\n\n If they were non-addictive versions, they wouldn't be the same drug and therefore probably wouldn't be illegal. Think about it, if there was some drug that gave all the energy and euphoria of cocaine, without any negative effects, don't you think it would be out there and be the hottest thing on the market?\n \n There are other reasons that certain drugs are illegal other than just their addictive properties. This should be made plain by the fact that there are plently of legal drugs that are addictive.", 
   {}, 
   248465, 
   null, 
   1169838600.0
  ], 
  [
   248518, 
   null, 
   "Another opinion", 
   "If they were non-addictive versions, they wouldn't be the same drug and therefore probably wouldn't be illegal. Think about it, if there was some drug that gave all the energy and euphoria of cocaine, without any negative effects, don't you think it would be out there and be the hottest thing on the market?\n\n Not necessarily. For example, from what I understand, marijuana is not addictive and it does give people a nice 'high\" but it is still illegal. \n \n I think that the main reason that the more benign drugs are kept illegal is that they are mind-altering. Many, if not most, people in the US and other countries seem to be against allowing any more mind-altering substances to be used apart from those that are so ingrained in our culture that it would be nearly impossible to stop - namely, alcohol, caffeine (coffee) and nicotine (cigarettes, cigars, etc.).", 
   {}, 
   248516, 
   null, 
   1169839200.0
  ], 
  [
   248519, 
   null, 
   "Master_Shake", 
   "Not necessarily. For example, from what I understand, marijuana is not addictive and it does give people a nice 'high\" but it is still illegal. \n \n I think that the main reason that the more benign drugs are kept illegal is that they are mind-altering. Many, if not most, people in the US and other countries seem to be against allowing any more mind-altering substances to be used apart from those that are so ingrained in our culture that it would be nearly impossible to stop - namely, alcohol, caffeine (coffee) and nicotine (cigarettes, cigars, etc.).\n\n That's a myth. There are plenty of marijuana addicts. People think that because marijuana addicts aren't shooting grandmas and killing random people to get their next fix that they aren't addicts.\n Marijuana isn't benign. What else are you referring to with \"benign drugs?\"", 
   {}, 
   248518, 
   null, 
   1169839680.0
  ], 
  [
   248552, 
   null, 
   "sinjin", 
   "That's a myth. There are plenty of marijuana addicts. People think that because marijuana addicts aren't shooting grandmas and killing random people to get their next fix that they aren't addicts.\n Marijuana isn't benign. What else are you referring to with \"benign drugs?\"\nIs coffee benign? An \"addiction\" to a substance that has no significant health risks seems benign to me.", 
   {}, 
   248519, 
   null, 
   1169851320.0
  ], 
  [
   248556, 
   null, 
   "Master_Shake", 
   "Is coffee benign? An \"addiction\" to a substance that has no significant health risks seems benign to me.\n\n That makes sense when it comes to coffee, but I don't want to turn this thread into another battle about the negatives aspects of marijuana.", 
   {}, 
   248552, 
   null, 
   1169852400.0
  ], 
  [
   248560, 
   null, 
   "sinjin", 
   "...the negatives aspects of marijuana.\nI must have missed your substantive posts on this topic.", 
   {}, 
   248556, 
   null, 
   1169853360.0
  ], 
  [
   248780, 
   null, 
   "Master_Shake", 
   "I must have missed your substantive posts on this topic.\n\n I guess you missed the part where I said \"but I don't want to turn this thread into another battle about...\"\n \n If you really want to talk about this, start a thread or PM me and I'd be more than happy to.", 
   {}, 
   248560, 
   null, 
   1170051960.0
  ], 
  [
   248804, 
   null, 
   "Another opinion", 
   "That's a myth. There are plenty of marijuana addicts. People think that because marijuana addicts aren't shooting grandmas and killing random people to get their next fix that they aren't addicts.\n Marijuana isn't benign. What else are you referring to with \"benign drugs?\"\n\n In my Google search, I have read opinions both ways - including discussions on Marijuana containing various drugs - some addictive and some not. So, the jury is still out on Marijuana.\n \n Either way, even if Marijuana is addictive, there are still many reasons that people choose to outlaw drugs that have little or nothing to do with their addictive value.\n \n Wikipedia has a nice list:\n http://en.wikipedia.org/wiki/Arguments_for_and_against_drug_prohibition\n \n So, I disagree that, were drug companies to develop drugs that were potent and non-addictive, that such drugs would automatically become legal.", 
   {}, 
   248519, 
   null, 
   1170096900.0
  ], 
  [
   249026, 
   null, 
   "Adept", 
   "i've spent the last few days thinking about the pro's and con's of Decriminalizing very small Mushrooms, opium, and Cocaine, as well as legalizing and allowing Marijuana to become a legal cash crop in the United States. I am a supporter of the Idea, Just wondering where everyone else was on the issue.\n\n \n The problem with illegal drugs isn't (IMO) that people use them with harmful effects. If people want to OD on drugs, thats their business.\n \n My concern is the peripheral crime associated with it. Junkies mug people and break into homes to feed their habit. If cocaine was legalised, those junkies would not magically get jobs and become responsible people. They would still break into homes and rob people to pay for their drugs.\n \n Having said that, much of the profit from drug sales goes into funding criminal activities, which could be minimised if those profits were taken by legitimate and legal corporations rather than criminal gangs.", 
   {}, 
   247371, 
   null, 
   1170262380.0
  ], 
  [
   249249, 
   null, 
   "Master_Shake", 
   "Having said that, much of the profit from drug sales goes into funding criminal activities, which could be minimised if those profits were taken by legitimate and legal corporations rather than criminal gangs.\n\n Possibly, but also aren't the people most likely to start \"legitimate\" business selling these drugs the people who are doing it already? I mean, these are the people who already have a supply line and infrastructure. It would obviously have to be modified a little, but I think these would be the people most likely to start legal businesses if it became legal. It would still then be funding the same criminal activities.", 
   {}, 
   249026, 
   null, 
   1170379020.0
  ], 
  [
   272685, 
   null, 
   "Capn_Danger", 
   "Possibly, but also aren't the people most likely to start \"legitimate\" business selling these drugs the people who are doing it already? I mean, these are the people who already have a supply line and infrastructure. It would obviously have to be modified a little, but I think these would be the people most likely to start legal businesses if it became legal. It would still then be funding the same criminal activities.\n\n \n So? Isn't that exactly what we would want: people who conduct legal business instead of illegal business? That means less crime, even if organized crime is still into other things. Making a drug illicit effectively creates another market for organized crime.\n \n Look at alcohol and prohibition. Alcohol was a huge market for organized crime back in prohibition days. How many mobsters or gangs still have distilleries? They only people who operate illegal distilleries nowadays are indepedant brewers in rural areas. When you can get a wide variety of quality-controlled drugs at a licensed store down the road, no one wants to pay prohibition prices to get goods of uncertain purity or quality. Organized crime goes elsewhere to seek massive profits.\n \n I think marijuana is an easy case, its blatantly obvious that most of the harm done by pot on our society comes from associated crime: drug deals gone bad or turf wars, money put into organized crime's hands, otherwise law-abiding citizens put in jail or given criminal records. More dangerous and addictive drugs are a harder sell, I think.\n \n Drug education is broken. Often, drug education is distorted to over-emphasize the dangers of drugs, which mystifies the drug, often increases their allure and destroys confidence in the source of information because the information is obviously biased and incomplete. With or without legalization, I believe the best solution to drug abuse is preventative: quality information and education. Reduction of poverty would do a lot to curb drug abuse (and drug-related crime) as well.\n \n Also, marijuana use in the Netherlands actually went down after legalization, as did alcohol consumption post-prohibition in the US back in the 30's. I would have to hunt a bit around for references for those facts, though, but those facts show that you can't with certainty expect drug use to increase after legalization.", 
   {}, 
   249249, 
   null, 
   1183831380.0
  ], 
  [
   273937, 
   null, 
   "snakespit", 
   "That's a myth. There are plenty of marijuana addicts. People think that because marijuana addicts aren't shooting grandmas and killing random people to get their next fix that they aren't addicts.\n Marijuana isn't benign. What else are you referring to with \"benign drugs?\"\n\n \n Marijuana is not physically addictive. It can however be psychologically addictive.", 
   {}, 
   248519, 
   null, 
   1184657160.0
  ], 
  [
   275616, 
   null, 
   "andjustice4all", 
   "There's no such thing as responsible or moderate heroin use.\n\n \n Sure there is. This practice is known as \"chipping,\" and it specifically includes heroin users who shoot up occassionally without becoming addicts. Further, another relatively unknown fact about heroin is that there is little evidence proving that it is a \"dangerous\" drug. That is, there are no specific pathologies (e.g., serious illnesses or physiological deterioration) that are known to result from heroin use. And get this, there is not any scientific evidence to deny that we do more \"irreversible\" damage by smoking cigarettes and drinking liquor than by using heroin.\n \n These are the facts that the government does not want to tell us. The above information regarding heroin, as well as the discussion of other illegal drugs, stems from Jeffrey Reiman's (2007), The Rich Get Richer and the Poor Get Prison. In particular, read pages 36-43 of the 8th edition.\n \n This is not my opinion, but merely facts!!", 
   {}, 
   248234, 
   null, 
   1185573660.0
  ], 
  [
   326782, 
   null, 
   "kands", 
   "if it was legalized we could regulate it and tax it. more people die from legal substances than illegal 120,000 people die ever year from pharmaceutical drugs alone. i think it is a problem when 50% of the prison population is non-violent drug offences and our own government is smuggling in drugs to put on the streets (watch an american drug war).", 
   {}, 
   247371, 
   null, 
   1223460060.0
  ], 
  [
   327367, 
   null, 
   "snakespit", 
   "Sure there is. This practice is known as \"chipping,\" and it specifically includes heroin users who shoot up occassionally without becoming addicts. Further, another relatively unknown fact about heroin is that there is little evidence proving that it is a \"dangerous\" drug. That is, there are no specific pathologies (e.g., serious illnesses or physiological deterioration) that are known to result from heroin use. And get this, there is not any scientific evidence to deny that we do more \"irreversible\" damage by smoking cigarettes and drinking liquor than by using heroin.\nI would call anything that can readily kill you a \"dangerous\" drug...wouldn't you?\n \nMedical consequences of chronic heroin injection use include scarred and/or collapsed veins, bacterial infections of the blood vessels and heart valves, abscesses (boils) and other soft-tissue infections, and liver or kidney disease. Lung complications (including various types of pneumonia and tuberculosis) may result from the poor health condition of the abuser as well as from heroin's depressing effects on respiration. Many of the additives in street heroin may include substances that do not readily dissolve and result in clogging the blood vessels that lead to the lungs, liver, kidneys, or brain. This can cause infection or even death of small patches of cells in vital organs. Immune reactions to these or other contaminants can cause arthritis or other rheumatologic problems. \n\n http://www.starliterecovery.com/heroin-medtreat.php\n \n \n* For intravenous users of heroin, the use of non-sterile needles and syringes and other materials leads to the risk of contracting blood-borne pathogens such as HIV and/or hepatitis infections from this drug injection, as well as the risk of contracting bacterial or fungal endocarditis and possibly Venous sclerosis\n \n * Poisoning from contaminants added to \"cut\" or dilute heroin\n \n * Chronic constipation\n \n * Tolerance leading to larger doses to achieve the same effect\n \n * Heroin-induced leukoencephalopathy (Very Rare, Smokers Only)\n \n A small percentage of heroin smokers may develop symptoms of leukoencephalopathy. This is believed to be caused by an uncommon adulterant that is only active when heated. Symptoms include slurred speech and difficulty walking. Contrary to popular rumor, aluminum foil probably has nothing to do with the development of leukoencephalopathy in heroin users.\n\n http://www.medic8.com/medicines/Heroin.html\n \n \n...One of the most detrimental long-term effects of heroin is addiction itself. Addiction is a chronic, relapsing disease, characterized by compulsive drug seeking and use, and by neurochemical and molecular changes in the brain...\n\n http://www.medceu.com/index/index.php?page=get_course&courseID=2051&nocheck\n \n \n While I agree that heroin can be used without becoming addictive, I would hardly classify heroin as a safe drug. Even those who use a clean needle every time are not immune to detrimental effects of heroin. While these people may have no risk of passing or aquiring HIV / Hepatitis, they still run many other risks common to heroin use.", 
   {}, 
   275616, 
   null, 
   1223716560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Drug Legalization and decriminalization", 
  "url": "http://www.4forums.com/political/crime-debates/9455-drug-legalization-decriminalization.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 9455, 
  "discussion_files": [
   [
    "7370.html", 
    "http://www.4forums.com/political/crime-debates/9455-drug-legalization-decriminalization-print.html"
   ], 
   [
    "7371.html", 
    "http://www.4forums.com/political/crime-debates/9455-drug-legalization-decriminalization-3-print.html"
   ], 
   [
    "7372.html", 
    "http://www.4forums.com/political/crime-debates/9455-drug-legalization-decriminalization-2-print.html"
   ]
  ], 
  "identifier": 9455
 }
]