[
 [
  [
   247904, 
   null, 
   "maximus", 
   "Dr. Martin Luther King's niece, Dr. Alveda C. King, who underwent two abortions presents, \"How Can the Dream Survive?\":\n \n In the ongoing travesty of the debate over whether abortion and infanticide should be condoned, a voice in the wilderness continues to cry out, \"what about the children?\" We have been fueled by the fire of \"women's rights,\" so long that we have become deaf to the outcry of the real victims whose rights are being trampled upon, the babies and the mothers. Of course a woman has a right to decide what to do with her own body. Thank God for the Constitution. Yet, she also has a right to know the serious consequences and repercussions of making a decision to abort her child. Then too, what about the rights of each baby who is artificially breached before coming to term in his or her mother's womb, only to have her skull punctured, and feel, yes agonizingly \"feel\" the life run out of her before she takes her first breath of freedom. What about of the rights of these women who have been called to pioneer the new frontiers of the new millennium only to have their lives snuffed out before the calendar even turns?\n \n Oh, God, what would Martin Luther King, Jr., who dreamed of having his children judged by the content of their characters do if he'd lived to see the contents of thousands of children's skulls emptied into the bottomless caverns of the abortionists pits?\n \n It is time for America, perhaps the most blessed nation on earth to lead the world in repentance, and in restoration of life! If only we can carry the freedom of repentance to its fullest potential. If only America can repent and turn away from the sins of our nation. Abortion is at the forefront of our destruction. Partial Birth Abortion is perhaps the most heinous form of this legal genocide. Direct links connecting abortion and serious conditions such as breast and cervical cancer, emotional disorders and other serious ills must be considered! The only healing and redemption is in the blood of Jesus, blood willingly shed so that we could stand today and cry out for the blood of the unborn that is drenching the land of our children.\n \n What terribly mixed signals we are sending to our society today? We allow and even encourage them to engage in promiscuous sex. Then when their sin conceives, we pretty much tell them, \"don't kill your babies, let our abortion facilities do it for you.\" We march to cure breast cancer, yet promote one of the biggest contributors. I am a mother of six living children, and I am a grandmother. I am also a post-abortive mother. In the early 1970's, I suffered one involuntary and one voluntary abortion.\n \n My involuntary abortion was performed just prior to Roe v. Wade by my private physician without my consent. I had gone to the doctor to ask why my cycle had not resumed after the birth of my son. I did not ask for and did not want an abortion. The doctor said, \"You don't need to be pregnant, let's see.\" He proceeded to perform a painful examination which resulted in a gush of blood and tissue emanating from my womb. He explained that he had performed a \"local D and C.\"\n \n Soon after the Roe v. Wade decision, I became pregnant again. There was adverse pressure and threat of violence from the baby's father. The ease and convenience provided through Roe v. Wade made it too easy for me to make the fateful and fatal decision to abort our child.\n \n I went to a doctor and was advised that the procedure would hurt no more than \"having a tooth removed.\" The next day, I was admitted to the hospital, and our baby was aborted. My medical insurance paid for the procedure. As soon as I woke up, I knew that something was very wrong. I felt very ill, and very empty. I tried to talk to the doctor and nurses about it. They assured me that \"it will all go away in a few days. You will be fine.\" They lied.\n \n Over the next few years, I experienced medical problems. I had trouble bonding with my son, and his five siblings who were born after the abortions. I began to suffer from eating disorders, depression, nightmares, sexual dysfunctions and a host of other issues related to the abortion that I chose to have. I felt angry about both abortions, and very guilty about the abortion I chose to have. The guilt made me very ill.\n \n My children have all suffered from knowing that they have a brother or sister that their mother chose to abort. Often they ask if I ever thought about aborting them and have said, \"You killed our baby.\" This is very painful for all of us. Also, my mother and grandparents were very sad to know about the loss of the baby. The aborted child's father also regrets the abortion. If it had not been for Roe v. Wade, I would never have had that abortion, only Jesus can.\n \n My birthday is January 22, and each year, this day is marred by the fact that it is the anniversary of Roe v. Wade, and the anniversary of death for millions of babies. I and my deceased children are victims of abortion, and subsequently the Roe v. Wade decision has adversely affected the lives of my entire family. I pray often for deliverance from the pain caused by my decision to abort my baby. I suffered the threat of cervical and breast cancer, and experienced the pain of empty arms after the baby was gone. And truly, for me, and countless abortive mothers, nothing on earth can fully restore what has been lost, only Jesus can.\n \n My grandfather, Dr. Martin Luther King, Sr., once said, \"No one is going to kill a child of mine.\" Tragically, two of his grandchildren had already been aborted when he saved the life of his next great-grandson with this statement. His son, King once said, \"The Negro cannot win as long as he is willing to sacrifice the lives of his children for comfort and safety.\" How can the \"Dream\" survive if we murder the children? Every aborted baby is like a slave in the womb of his or her mother. The mother decides his or her fate.\n \n I join the voices of thousands across America, who are SILENT NO MORE. We can no longer sit idly by and allow this horrible spirit of murder to cut down, yes cut out and cut away our unborn, and destroy the lives of our mothers. I am very grateful to God for the Spirit of Repentance that is sweeping our land. In Repentance there is healing. In the name of Jesus, we must humble ourselves and pray, and turn from our wicked ways, then God will hear from Heaven and Heal Our Land.\n \n I can only beseech the powers that be to hearken to the voice of the Lord and remember that human life is sacred. By taking the lives of our young, and wounding the wombs and lives of their mothers, we are flying in the face of God. We cannot play God. If we continue down this path of destruction, we will be met at the gates by our own doom. This is the day to choose life. We must live and allow our babies to live. We must end the pain of post-abortion trauma. If the Dream of Dr. Martin Luther King, Jr. is to live, our babies must live. Our mothers must choose life. If we refuse to answer the cry of mercy from the unborn, and ignore the suffering of the mothers, then we are signing our own death warrants.\n \n I too, like Martin Luther King, Jr., have a dream. I have a dream that the men and women, the boys and girls of America will come to our senses, and humble ourselves before God Almighty and pray for mercy, and receive His healing grace. I pray that this is the day, the hour of our deliverance. May God have mercy on us all.\n \n From:\n http://priestsforlife.org/africanamerican/howcandreamsurvive.htm\n \n Open letter to black leaders:\n http://priestsforlife.org/africanamerican/openletter.htm\n \n Bio: \n Dr. Alveda C. King founded King for America, Inc. \"to assist people in enriching their lives spiritually, personally, mentally and economically.\" She is the daughter of the late slain civil rights activist Rev. A. D. King and his wife Naomi Barber King. Alveda is the grateful mother of eight children and she is a doting grandmother. \n \n During the more than half century of her life, Alveda has worked towards her purpose of glorifying God in the earth by accomplishing many goals. Currently, Alveda is a minister of the Gospel of Jesus Christ, serving as Director of African American Outreach for Gospel of Life, headed up by Father Frank Pavone of Priests for Life. She also consults with the Africa Humanitarian Christian Fellowship, founded by her mentor, Pastor Allen McNair of Believers' Bible Christian Church in Atlanta, Georgia.\n \n She is a former college professor, holding the Masters of Arts degree in Business Management from Central Michigan University. Her undergraduate studies in journalism and sociology helped her to become a published author, the most popular works being her best selling books SONS OF THUNDER: THE KING FAMILY LEGACY, and I DON'T WANT YOUR MAN, I WANT MY OWN. This inspirational collection of Christian testimonies is used at conferences and workshops around the world.\n \n Alveda's Doctorate of Laws was conferred by Saint Anslem College. She has served as a Senior Fellow of the Alexis de Tocqueville Institute. She has also served on the boards and committees of numerous organizations, including the SILENT NO MORE AWARENESS CAMPAIGN, COALITION OF AFRICAN AMERICAN PASTORS, and the JUDEO-CHRISTIAN COALITION FOR CONSTITUTIONAL RESTORATION. She also served in the Georgia State House of Representatives, and is an accomplished actress and songwriter.\n \n During the years of the Civil Rights Movement, led by her Uncle, Dr. Martin Luther King, Jr., Alveda's family home was bombed in Birmingham, Alabama. In the heat of the struggle. \"Daddy's house was bombed, then in Louisville, Kentucky his church office was bombed. I was also jailed during the open housing movement,\" she recalls.\n \n Alveda has continued her long-term work as a civil rights activist, speaking out on issues that face society today. \"I believe that School Choice is a pressing civil rights issue. Perhaps the most compelling issue of all is the life of the unborn,\" Alveda says. \"Faith in God, and the commitment to fulfill His will for our lives -- not faith in government bureaucracy - is the key to positive action. Have faith in God!\" This is the message that Alveda carries to the world.", 
   {
    "post_info": {
     "post_title": "Can Martin Luther King Jr.'s Dream Survive?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1169308320.0
  ], 
  [
   247918, 
   null, 
   "simone", 
   "Alveda never got to exercise choice regarding her pregnancies. \n \n This is dead wrong and contrary to the principles of pro-choice.\n \n In her first pregnancy, her doctor never gave her the option of choice. In her second pregnancy, her abusive boyfriend refused to give her the option of choice.\n \n This is precisely why the choices of women must never be governed by the whims of men.", 
   {}, 
   247904, 
   null, 
   1169324280.0
  ], 
  [
   247919, 
   null, 
   "ShadowPikachu", 
   "Dr. Martin Luther King's niece, Dr. Alveda C. King, who underwent two abortions presents, \"How Can the Dream Survive?\":\n \n In the ongoing travesty of the debate over whether abortion and infanticide should be condoned, a voice in the wilderness continues to cry out, \"what about the children?\" We have been fueled by the fire of \"women's rights,\" so long that we have become deaf to the outcry of the real victims whose rights are being trampled upon, the babies and the mothers. Of course a woman has a right to decide what to do with her own body. Thank God for the Constitution. Yet, she also has a right to know the serious consequences and repercussions of making a decision to abort her child. Then too, what about the rights of each baby who is artificially breached before coming to term in his or her mother's womb, only to have her skull punctured, and feel, yes agonizingly \"feel\" the life run out of her before she takes her first breath of freedom. What about of the rights of these women who have been called to pioneer the new frontiers of the new millennium only to have their lives snuffed out before the calendar even turns?\n \n Oh, God, what would Martin Luther King, Jr., who dreamed of having his children judged by the content of their characters do if he'd lived to see the contents of thousands of children's skulls emptied into the bottomless caverns of the abortionists pits?\n \n It is time for America, perhaps the most blessed nation on earth to lead the world in repentance, and in restoration of life! If only we can carry the freedom of repentance to its fullest potential. If only America can repent and turn away from the sins of our nation. Abortion is at the forefront of our destruction. Partial Birth Abortion is perhaps the most heinous form of this legal genocide. Direct links connecting abortion and serious conditions such as breast and cervical cancer, emotional disorders and other serious ills must be considered! The only healing and redemption is in the blood of Jesus, blood willingly shed so that we could stand today and cry out for the blood of the unborn that is drenching the land of our children.\n \n What terribly mixed signals we are sending to our society today? We allow and even encourage them to engage in promiscuous sex. Then when their sin conceives, we pretty much tell them, \"don't kill your babies, let our abortion facilities do it for you.\" We march to cure breast cancer, yet promote one of the biggest contributors. I am a mother of six living children, and I am a grandmother. I am also a post-abortive mother. In the early 1970's, I suffered one involuntary and one voluntary abortion.\n \n My involuntary abortion was performed just prior to Roe v. Wade by my private physician without my consent. I had gone to the doctor to ask why my cycle had not resumed after the birth of my son. I did not ask for and did not want an abortion. The doctor said, \"You don't need to be pregnant, let's see.\" He proceeded to perform a painful examination which resulted in a gush of blood and tissue emanating from my womb. He explained that he had performed a \"local D and C.\"\n \n Soon after the Roe v. Wade decision, I became pregnant again. There was adverse pressure and threat of violence from the baby's father. The ease and convenience provided through Roe v. Wade made it too easy for me to make the fateful and fatal decision to abort our child.\n \n I went to a doctor and was advised that the procedure would hurt no more than \"having a tooth removed.\" The next day, I was admitted to the hospital, and our baby was aborted. My medical insurance paid for the procedure. As soon as I woke up, I knew that something was very wrong. I felt very ill, and very empty. I tried to talk to the doctor and nurses about it. They assured me that \"it will all go away in a few days. You will be fine.\" They lied.\n \n Over the next few years, I experienced medical problems. I had trouble bonding with my son, and his five siblings who were born after the abortions. I began to suffer from eating disorders, depression, nightmares, sexual dysfunctions and a host of other issues related to the abortion that I chose to have. I felt angry about both abortions, and very guilty about the abortion I chose to have. The guilt made me very ill.\n \n My children have all suffered from knowing that they have a brother or sister that their mother chose to abort. Often they ask if I ever thought about aborting them and have said, \"You killed our baby.\" This is very painful for all of us. Also, my mother and grandparents were very sad to know about the loss of the baby. The aborted child's father also regrets the abortion. If it had not been for Roe v. Wade, I would never have had that abortion, only Jesus can.\n \n My birthday is January 22, and each year, this day is marred by the fact that it is the anniversary of Roe v. Wade, and the anniversary of death for millions of babies. I and my deceased children are victims of abortion, and subsequently the Roe v. Wade decision has adversely affected the lives of my entire family. I pray often for deliverance from the pain caused by my decision to abort my baby. I suffered the threat of cervical and breast cancer, and experienced the pain of empty arms after the baby was gone. And truly, for me, and countless abortive mothers, nothing on earth can fully restore what has been lost, only Jesus can.\n \n My grandfather, Dr. Martin Luther King, Sr., once said, \"No one is going to kill a child of mine.\" Tragically, two of his grandchildren had already been aborted when he saved the life of his next great-grandson with this statement. His son, King once said, \"The Negro cannot win as long as he is willing to sacrifice the lives of his children for comfort and safety.\" How can the \"Dream\" survive if we murder the children? Every aborted baby is like a slave in the womb of his or her mother. The mother decides his or her fate.\n \n I join the voices of thousands across America, who are SILENT NO MORE. We can no longer sit idly by and allow this horrible spirit of murder to cut down, yes cut out and cut away our unborn, and destroy the lives of our mothers. I am very grateful to God for the Spirit of Repentance that is sweeping our land. In Repentance there is healing. In the name of Jesus, we must humble ourselves and pray, and turn from our wicked ways, then God will hear from Heaven and Heal Our Land.\n \n I can only beseech the powers that be to hearken to the voice of the Lord and remember that human life is sacred. By taking the lives of our young, and wounding the wombs and lives of their mothers, we are flying in the face of God. We cannot play God. If we continue down this path of destruction, we will be met at the gates by our own doom. This is the day to choose life. We must live and allow our babies to live. We must end the pain of post-abortion trauma. If the Dream of Dr. Martin Luther King, Jr. is to live, our babies must live. Our mothers must choose life. If we refuse to answer the cry of mercy from the unborn, and ignore the suffering of the mothers, then we are signing our own death warrants.\n \n I too, like Martin Luther King, Jr., have a dream. I have a dream that the men and women, the boys and girls of America will come to our senses, and humble ourselves before God Almighty and pray for mercy, and receive His healing grace. I pray that this is the day, the hour of our deliverance. May God have mercy on us all.\n \n From:\n http://priestsforlife.org/africanamerican/howcandreamsurvive.htm\n \n Open letter to black leaders:\n http://priestsforlife.org/africanamerican/openletter.htm\n \n Bio: \n Dr. Alveda C. King founded King for America, Inc. \"to assist people in enriching their lives spiritually, personally, mentally and economically.\" She is the daughter of the late slain civil rights activist Rev. A. D. King and his wife Naomi Barber King. Alveda is the grateful mother of eight children and she is a doting grandmother. \n \n During the more than half century of her life, Alveda has worked towards her purpose of glorifying God in the earth by accomplishing many goals. Currently, Alveda is a minister of the Gospel of Jesus Christ, serving as Director of African American Outreach for Gospel of Life, headed up by Father Frank Pavone of Priests for Life. She also consults with the Africa Humanitarian Christian Fellowship, founded by her mentor, Pastor Allen McNair of Believers' Bible Christian Church in Atlanta, Georgia.\n \n She is a former college professor, holding the Masters of Arts degree in Business Management from Central Michigan University. Her undergraduate studies in journalism and sociology helped her to become a published author, the most popular works being her best selling books SONS OF THUNDER: THE KING FAMILY LEGACY, and I DON'T WANT YOUR MAN, I WANT MY OWN. This inspirational collection of Christian testimonies is used at conferences and workshops around the world.\n \n Alveda's Doctorate of Laws was conferred by Saint Anslem College. She has served as a Senior Fellow of the Alexis de Tocqueville Institute. She has also served on the boards and committees of numerous organizations, including the SILENT NO MORE AWARENESS CAMPAIGN, COALITION OF AFRICAN AMERICAN PASTORS, and the JUDEO-CHRISTIAN COALITION FOR CONSTITUTIONAL RESTORATION. She also served in the Georgia State House of Representatives, and is an accomplished actress and songwriter.\n \n During the years of the Civil Rights Movement, led by her Uncle, Dr. Martin Luther King, Jr., Alveda's family home was bombed in Birmingham, Alabama. In the heat of the struggle. \"Daddy's house was bombed, then in Louisville, Kentucky his church office was bombed. I was also jailed during the open housing movement,\" she recalls.\n \n Alveda has continued her long-term work as a civil rights activist, speaking out on issues that face society today. \"I believe that School Choice is a pressing civil rights issue. Perhaps the most compelling issue of all is the life of the unborn,\" Alveda says. \"Faith in God, and the commitment to fulfill His will for our lives -- not faith in government bureaucracy - is the key to positive action. Have faith in God!\" This is the message that Alveda carries to the world.\n\n \n That's really sad how she was pretty much forced into having abortion. That is exactly opposite of what the pro-choice movement wants, something I think all of my fellow pro-choicers here will agree on. She wasn't allowed to have a choice, and I think that's disgusting, those men forcing her to have abortions.", 
   {
    "unicode_changes_made": true
   }, 
   247904, 
   null, 
   1169325480.0
  ], 
  [
   247927, 
   null, 
   "Shooterandproud", 
   "Dr. Martin Luther King's niece, Dr. Alveda C. King, who underwent two abortions presents, \"How Can the Dream Survive?\":\n \n In the ongoing travesty of the debate over whether abortion and infanticide should be condoned, a voice in the wilderness continues to cry out, \"what about the children?\" We have been fueled by the fire of \"women's rights,\" so long that we have become deaf to the outcry of the real victims whose rights are being trampled upon, the babies and the mothers. Of course a woman has a right to decide what to do with her own body. Thank God for the Constitution. Yet, she also has a right to know the serious consequences and repercussions of making a decision to abort her child. Then too, what about the rights of each baby who is artificially breached before coming to term in his or her mother's womb, only to have her skull punctured, and feel, yes agonizingly \"feel\" the life run out of her before she takes her first breath of freedom. What about of the rights of these women who have been called to pioneer the new frontiers of the new millennium only to have their lives snuffed out before the calendar even turns?\n \n Oh, God, what would Martin Luther King, Jr., who dreamed of having his children judged by the content of their characters do if he'd lived to see the contents of thousands of children's skulls emptied into the bottomless caverns of the abortionists pits?\n \n It is time for America, perhaps the most blessed nation on earth to lead the world in repentance, and in restoration of life! If only we can carry the freedom of repentance to its fullest potential. If only America can repent and turn away from the sins of our nation. Abortion is at the forefront of our destruction. Partial Birth Abortion is perhaps the most heinous form of this legal genocide. Direct links connecting abortion and serious conditions such as breast and cervical cancer, emotional disorders and other serious ills must be considered! The only healing and redemption is in the blood of Jesus, blood willingly shed so that we could stand today and cry out for the blood of the unborn that is drenching the land of our children.\n \n What terribly mixed signals we are sending to our society today? We allow and even encourage them to engage in promiscuous sex. Then when their sin conceives, we pretty much tell them, \"don't kill your babies, let our abortion facilities do it for you.\" We march to cure breast cancer, yet promote one of the biggest contributors. I am a mother of six living children, and I am a grandmother. I am also a post-abortive mother. In the early 1970's, I suffered one involuntary and one voluntary abortion.\n \n My involuntary abortion was performed just prior to Roe v. Wade by my private physician without my consent. I had gone to the doctor to ask why my cycle had not resumed after the birth of my son. I did not ask for and did not want an abortion. The doctor said, \"You don't need to be pregnant, let's see.\" He proceeded to perform a painful examination which resulted in a gush of blood and tissue emanating from my womb. He explained that he had performed a \"local D and C.\"\n \n Soon after the Roe v. Wade decision, I became pregnant again. There was adverse pressure and threat of violence from the baby's father. The ease and convenience provided through Roe v. Wade made it too easy for me to make the fateful and fatal decision to abort our child.\n \n I went to a doctor and was advised that the procedure would hurt no more than \"having a tooth removed.\" The next day, I was admitted to the hospital, and our baby was aborted. My medical insurance paid for the procedure. As soon as I woke up, I knew that something was very wrong. I felt very ill, and very empty. I tried to talk to the doctor and nurses about it. They assured me that \"it will all go away in a few days. You will be fine.\" They lied.\n \n Over the next few years, I experienced medical problems. I had trouble bonding with my son, and his five siblings who were born after the abortions. I began to suffer from eating disorders, depression, nightmares, sexual dysfunctions and a host of other issues related to the abortion that I chose to have. I felt angry about both abortions, and very guilty about the abortion I chose to have. The guilt made me very ill.\n \n My children have all suffered from knowing that they have a brother or sister that their mother chose to abort. Often they ask if I ever thought about aborting them and have said, \"You killed our baby.\" This is very painful for all of us. Also, my mother and grandparents were very sad to know about the loss of the baby. The aborted child's father also regrets the abortion. If it had not been for Roe v. Wade, I would never have had that abortion, only Jesus can.\n \n My birthday is January 22, and each year, this day is marred by the fact that it is the anniversary of Roe v. Wade, and the anniversary of death for millions of babies. I and my deceased children are victims of abortion, and subsequently the Roe v. Wade decision has adversely affected the lives of my entire family. I pray often for deliverance from the pain caused by my decision to abort my baby. I suffered the threat of cervical and breast cancer, and experienced the pain of empty arms after the baby was gone. And truly, for me, and countless abortive mothers, nothing on earth can fully restore what has been lost, only Jesus can.\n \n My grandfather, Dr. Martin Luther King, Sr., once said, \"No one is going to kill a child of mine.\" Tragically, two of his grandchildren had already been aborted when he saved the life of his next great-grandson with this statement. His son, King once said, \"The Negro cannot win as long as he is willing to sacrifice the lives of his children for comfort and safety.\" How can the \"Dream\" survive if we murder the children? Every aborted baby is like a slave in the womb of his or her mother. The mother decides his or her fate.\n \n I join the voices of thousands across America, who are SILENT NO MORE. We can no longer sit idly by and allow this horrible spirit of murder to cut down, yes cut out and cut away our unborn, and destroy the lives of our mothers. I am very grateful to God for the Spirit of Repentance that is sweeping our land. In Repentance there is healing. In the name of Jesus, we must humble ourselves and pray, and turn from our wicked ways, then God will hear from Heaven and Heal Our Land.\n \n I can only beseech the powers that be to hearken to the voice of the Lord and remember that human life is sacred. By taking the lives of our young, and wounding the wombs and lives of their mothers, we are flying in the face of God. We cannot play God. If we continue down this path of destruction, we will be met at the gates by our own doom. This is the day to choose life. We must live and allow our babies to live. We must end the pain of post-abortion trauma. If the Dream of Dr. Martin Luther King, Jr. is to live, our babies must live. Our mothers must choose life. If we refuse to answer the cry of mercy from the unborn, and ignore the suffering of the mothers, then we are signing our own death warrants.\n \n I too, like Martin Luther King, Jr., have a dream. I have a dream that the men and women, the boys and girls of America will come to our senses, and humble ourselves before God Almighty and pray for mercy, and receive His healing grace. I pray that this is the day, the hour of our deliverance. May God have mercy on us all.\n \n From:\n http://priestsforlife.org/africanamerican/howcandreamsurvive.htm\n \n Open letter to black leaders:\n http://priestsforlife.org/africanamerican/openletter.htm\n \n Bio: \n Dr. Alveda C. King founded King for America, Inc. \"to assist people in enriching their lives spiritually, personally, mentally and economically.\" She is the daughter of the late slain civil rights activist Rev. A. D. King and his wife Naomi Barber King. Alveda is the grateful mother of eight children and she is a doting grandmother. \n \n During the more than half century of her life, Alveda has worked towards her purpose of glorifying God in the earth by accomplishing many goals. Currently, Alveda is a minister of the Gospel of Jesus Christ, serving as Director of African American Outreach for Gospel of Life, headed up by Father Frank Pavone of Priests for Life. She also consults with the Africa Humanitarian Christian Fellowship, founded by her mentor, Pastor Allen McNair of Believers' Bible Christian Church in Atlanta, Georgia.\n \n She is a former college professor, holding the Masters of Arts degree in Business Management from Central Michigan University. Her undergraduate studies in journalism and sociology helped her to become a published author, the most popular works being her best selling books SONS OF THUNDER: THE KING FAMILY LEGACY, and I DON'T WANT YOUR MAN, I WANT MY OWN. This inspirational collection of Christian testimonies is used at conferences and workshops around the world.\n \n Alveda's Doctorate of Laws was conferred by Saint Anslem College. She has served as a Senior Fellow of the Alexis de Tocqueville Institute. She has also served on the boards and committees of numerous organizations, including the SILENT NO MORE AWARENESS CAMPAIGN, COALITION OF AFRICAN AMERICAN PASTORS, and the JUDEO-CHRISTIAN COALITION FOR CONSTITUTIONAL RESTORATION. She also served in the Georgia State House of Representatives, and is an accomplished actress and songwriter.\n \n During the years of the Civil Rights Movement, led by her Uncle, Dr. Martin Luther King, Jr., Alveda's family home was bombed in Birmingham, Alabama. In the heat of the struggle. \"Daddy's house was bombed, then in Louisville, Kentucky his church office was bombed. I was also jailed during the open housing movement,\" she recalls.\n \n Alveda has continued her long-term work as a civil rights activist, speaking out on issues that face society today. \"I believe that School Choice is a pressing civil rights issue. Perhaps the most compelling issue of all is the life of the unborn,\" Alveda says. \"Faith in God, and the commitment to fulfill His will for our lives -- not faith in government bureaucracy - is the key to positive action. Have faith in God!\" This is the message that Alveda carries to the world.\n\n \n You know something is wrong with this world when people start calling embryos and non-sentient life forms victims and referring to martin Luther King Jr. to justify their views. It seems today that anyone that shows any decency or slight intelligence or common sense is labeled a radical leftist. Man, the republicans are getting desperate when you see them trying to equate embryos to men using MLK.", 
   {
    "unicode_changes_made": true
   }, 
   247904, 
   null, 
   1169335440.0
  ], 
  [
   247984, 
   null, 
   "gman", 
   "You know something is wrong with this world when people start calling embryos and non-sentient life forms victims and referring to martin Luther King Jr. to justify their views. It seems today that anyone that shows any decency or slight intelligence or common sense is labeled a radical leftist. Man, the republicans are getting desperate when you see them trying to equate embryos to men using MLK.\n\n \n You know something is wrong with this world when people attack the act of posting an opinion (that of Ms. King) and another condemns the idea that someone may read it and develop their own opinion. Saving lives is not just a Republican goal. And yes it is an act of desperation. All acts are an act of desperation when it comes to saving the natural process of life with out interference of those who place their comfort above the life inside them. \n Whatever is wrong outside the womb, is not the fault of the inhabitant within the womb.", 
   {}, 
   247927, 
   null, 
   1169407620.0
  ], 
  [
   247998, 
   null, 
   "Shooterandproud", 
   "You know something is wrong with this world when people attack the act of posting an opinion (that of Ms. King) and another condemns the idea that someone may read it and develop their own opinion. Saving lives is not just a Republican goal. And yes it is an act of desperation. All acts are an act of desperation when it comes to saving the natural process of life with out interference of those who place their comfort above the life inside them. \n Whatever is wrong outside the womb, is not the fault of the inhabitant within the womb.\n\n \n Yup, we're in deep trouble.", 
   {}, 
   247984, 
   null, 
   1169416320.0
  ], 
  [
   248080, 
   null, 
   "simone", 
   "You know something is wrong with this world when people attack the act of posting an opinion (that of Ms. King) and another condemns the idea that someone may read it and develop their own opinion. Saving lives is not just a Republican goal. And yes it is an act of desperation. All acts are an act of desperation when it comes to saving the natural process of life with out interference of those who place their comfort above the life inside them. \n Whatever is wrong outside the womb, is not the fault of the inhabitant within the womb.\nSaving lives is a Republican goal?\n \n Then, why have the Republicans condemned us to this ugly, nonproductive war in Iraq?\n \n The terrorists continue to terrorize us because we have deterred our efforts against them to Iraq, (and Bush intends to widen this nonproductive war into Iran and Syria) where nearly 700,000 Iraqis have been needlessly slaughtered, where more than 3,000 of our young have been sacrified in vain, and you have the audacity to say that \"saving lives is a Republican goal.\"\n \n Meanwhile we burn Saudi Arabian oil and by so doing, fuel the funding of countless schools of hate against the United States throughout the world.\n \n Osama bin Laden, the prime terrorist in the world, issued out of Saudi Arabia. He was funded by Saudi Arabia. Most of the terrorists on those planes that attacked my nation on September 11, 2001, were from Saudi Arabia.\n \n Iraq had nothing to do with that attack. Iran had nothing to do with that attack. Syria had nothing to do with that attack.\n \n Ever had an attack of reality, Gman?", 
   {}, 
   247984, 
   null, 
   1169482440.0
  ], 
  [
   248086, 
   null, 
   "gman", 
   "\n Saving lives is a Republican goal?\n Then, why have the Republicans condemned us to this ugly, nonproductive war in Iraq?\n \n The terrorists continue to terrorize us because we have deterred our efforts against them to Iraq, (and Bush intends to widen this nonproductive war into Iran and Syria) where nearly 700,000 Iraqis have been needlessly slaughtered, where more than 3,000 of our young have been sacrified in vain, and you have the audacity to say that \"saving lives is a Republican goal.\"\n \n Meanwhile we burn Saudi Arabian oil and by so doing, fuel the funding of countless schools of hate against the United States throughout the world.\n \n Osama bin Laden, the prime terrorist in the world, issued out of Saudi Arabia. He was funded by Saudi Arabia. Most of the terrorists on those planes that attacked my nation on September 11, 2001, were from Saudi Arabia.\n \n Iraq had nothing to do with that attack. Iran had nothing to do with that attack. Syria had nothing to do with that attack.\n \n Ever had an attack of reality, Gman?\n\n \n Simone, read the sentence again please. It was \"Saving lives is \"not just\" a Republican goal.\" It concerns the subject of abortion. \n The only way it relates to the politics of Iraq, is that abortionist would rather kill our kids before they get to \"volunteer\" their services for Iraq. \n \n I can't let one statement you made go though. Terrorist continue to terrorize us? Where have they attacked in the U.S. since 9-11? Consider continuing this in an appropriate thread.", 
   {}, 
   248080, 
   null, 
   1169486040.0
  ], 
  [
   248490, 
   null, 
   "maximus", 
   "You know something is wrong with this world when people start calling embryos and non-sentient life forms victims and referring to martin Luther King Jr. to justify their views. It seems today that anyone that shows any decency or slight intelligence or common sense is labeled a radical leftist. Man, the republicans are getting desperate when you see them trying to equate embryos to men using MLK.\n\n Embryos are very easily victims of violence. I don't see much decency in it. There are thousands of pictures to prove it. \n \n Common sense? I don't see much common sense in denying the fact that a living, growing entity in the belly of a human woman, which is the product of a sexual union between a human man and human woman is not a living, human being whose growth and life is stopped by a planned, destructive act of violence. I see a lot of common sense that a common man might possess in realizing that the gift that comes forth from such an intimate and personal union between two people might also actually be a person of inherent value, worthy of protection. \n \n And I'm not sure who has labeled anyone a radical leftist on this thread but I might have missed it. And I wouldn't want to be called that name either.\n \n Republicans are desperate when you see them trying to equate embryos to men using MLK? I think it is MLK's niece doing this. Is she Republican? I'm not sure. I would have to research that.", 
   {}, 
   247927, 
   null, 
   1169795760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Can Martin Luther King Jr.'s Dream Survive?", 
  "url": "http://www.4forums.com/political/abortion-debates/9472-can-martin-luther-king-jr-s-dream-survive.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9472, 
  "discussion_files": [
   [
    "21070.html", 
    "http://www.4forums.com/political/abortion-debates/9472-can-martin-luther-king-jr-s-dream-survive-print.html"
   ]
  ], 
  "identifier": 9472
 }
]