[
 [
  [
   247970, 
   null, 
   "MrWriteLA", 
   "\"Last week I bought a gun. Yesterday I wrote the note. But last night I happened to turn on your show and just knowing that someday I might be able to go back into my church, I threw the gun in the river. My mom never has to know.\" \n -- A boy in Iowa \n \n The e-mail was only four sentences long, but it shaped Daniel Karslake's future. \n \n Karslake, 41, was a young television producer in 1998 when he received the above note from a boy in Iowa. His segment on a lesbian theologian had just aired on the PBS program \"In the Life.\" This boy's short message, one that still brings Karslake to tears, was the first of hundreds he would receive from gays and lesbians across the country - from people who felt rejected by their church families. The aspiring filmmaker had found his mission. \n \n \"This e-mail fueled everything I've done since,\" he said this week. \n \n Opening Sunday night at the Sundance Film Festival is Karslake's \"For the Bible Tells Me So,\" a documentary in the independent film competition. The production, which took more than three years to complete, was funded in large part by Orem-resident Bruce Bastian, co-creator of the word-processing software that became WordPerfect. The film shows how the Bible's verses have been used to justify, over centuries, various forms of discrimination, and how today religious conservatives use the Good Book to back anti-gay rhetoric.\n \n For gay and lesbian people who grew up steeped in Scripture and tied to church communities, this rhetoric - something referred to in the film as \"a modern invention\" - has been especially painful. Not just for them, but for their families. \n \n By focusing on the journeys of five Christian families, each with a member who came out as gay or lesbian, Karslake paints a personal picture. \n \n Viewers meet Mary Lou Wallner, who blames herself, and the teachings that shaped who she was, for the suicide of her daughter. They gain an insider's perspective on the coming-out process for Chrissy Gephardt, daughter of former Rep. Richard Gephardt (D-Mo.) and his wife, Jane. They also get to know Bishop V. Gene Robinson of New Hampshire, the first openly gay Episcopal Church bishop, his parents and his ex-wife. \n \n The path for Tonia Poteat's family wasn't easy to navigate, but by agreeing to be interviewed for this documentary, Poteat, 37, said lines of communication were opened. \n \n \"I was shocked that they agreed pretty easily to do it,\" Poteat, of Atlanta, said of her parents, who live in North Carolina. \"I actually think it's a coming-out process for them also. . . . It's been a journey for me to recognize this is a struggle for them.\" \n \n Randi Reitan, also featured in the film and reached in her Minneapolis-area home, thought back to when her son, Jake, came out. The family was then living in Mankato, Minn., a place she described as \"a very closeted town,\" and she and her husband, Phil, \"knew nothing about homosexuality.\" \n \n The Reitans never stopped loving their son, but the strict Lutherans first sought counsel and understanding from a pastor who told them, \"Don't worry, Jake can change,\" she remembered, her voice cracking. \"I get emotional just speaking about it.\"\n \n Now the Reitans count themselves among activists, finding their voice and passion in an organization called Soulforce.\n \n The Rev. Mel White, a former ghostwriter for evangelicals such as Jerry Falwell, Pat Robertson and Jim Bakker, is behind Soulforce. The organization combats \"the misuse of religion to sanction the condemnation and rejection of any of God's children\" through \"relentless nonviolent resistance,\" the group's Web site explains.\n \n White, 66, is one of many religious leaders and scholars, including Archbishop Desmond Tutu, who appear in Karslake's film. Contacted in Lynchburg, Va., where he moved so he could regularly attend and silently protest in Falwell's church, White said for 30 years he battled his homosexuality with therapies including electric shock. Only after he slit his wrists did he part ways with his wife and face up to who he was. \n \n \"I realized my orientation, too, was a gift from God,\" he said. \n \n He also realized preachers such as Falwell and Robertson were doling out messages that were \"the ultimate source of disinformation,\" he said. \"Fundamentalism is based on fear and politics of blame. . . . They were so smart at knowing what would create the kind of fear that would lead to donations.\" \n Peppered throughout \"For the Bible Tells Me So\" are snippets, including a cartoon, outlining statistics and research findings. Mixed in is the annual revenue of Bible-thumping moneymakers. James Dobson, of Focus on the Family, brings in $138 million a year, the film reports. Robertson: $459 million. \n \n The problem, too, the film points out, is the masses blindly accept biblical interpretations offered by these popular personalities rather than read and study for themselves. As a result, historical context is ignored, as are broader and supplementary materials, said the Rev. Laurence Keene, a soon-to-retire sociology professor at Pepperdine University.\n \n \"I have a soft spot in my heart for literalists because I used to be one,\" he said in the film. \"There's nothing wrong with a fifth-grade understanding of God [or the Bible], as long as you're in the fifth grade.\" \n \n Take, for instance, the word \"abomination,\" which is used over and over by fundamentalists to describe what the Bible says about same-sex relations. Keene reiterated in a phone call this week that the word \"abomination\" refers to actions that were deemed \"ritually impure.\" Other abominations include eating pork or shrimp, wearing linen and wool at the same time, and commingling crops. \n \n Abominations, Keene explained, are not \"intrinsically evil or immoral\"; they are the actions that were considered \"unclean\" or \"un-Jewish\" at the time when the Hebrew people were trying to build a nation and procreation - requiring sex between a man and a woman - was paramount.\n \n Rather than shy away from talk about religion, Keene said it's time people other than conservatives \"stood up\" to \"give the public another look at how the Bible can be understood.\" \n \n And it's this longing to spark conversation, this longing to reach gay youth like the boy who wrote him years ago, that motivates Karslake. \n \n \"I'm hoping fair-minded people of all kinds see the film, and it makes them think,\" he said. \"These kids just want a glimmer of hope.\" \n http://www.sltrib.com/faith/ci_5047696", 
   {
    "post_info": {
     "post_title": "&quot;The Bible Tells Me So&quot; at Sundance"
    }
   }, 
   null, 
   null, 
   1169401260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"The Bible Tells Me So\" at Sundance", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9475-bible-tells-me-so-sundance.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9475, 
  "discussion_files": [
   [
    "7029.html", 
    "http://www.4forums.com/political/gay-rights-debates/9475-bible-tells-me-so-sundance-print.html"
   ]
  ], 
  "identifier": 9475
 }
]