[
 [
  [
   248265, 
   null, 
   "foundit66", 
   "Catholic Church Threatens To End All Adoptions If UK Gay Rights Bill Passed\n Posted: January 23, 2007 - 1:00 pm ET\n \n (London) The Catholic Church has upped the ante in its dispute with the British government over a gay rights bill, threatening to shut down its adoption agencies if the measure passes.\n \n Cardinal Cormac Murphy-O'Connor, the Archbishop of Westminster, issued the warning demanding the government exempt the church and its organizations from the bill that adds sexuality to existing nondiscrimination laws.\n \n The measure covers employment and the rendering of services. It would mean companies cannot refuse jobs on the basis of sexuality, nor could they refuse services to gay and lesbian customers.\n \n \"We believe it would be unreasonable, unnecessary and unjust discrimination against Catholics for the government to insist that if they wish to continue to work with local authorities, Catholic adoption agencies must act against the teaching of the church and their own consciences by being obliged in law to provide such a service,\" said Murphy-O'Connor in a letter to the Prime Minister.\n \n The Cardinal said there are 4,000 children currently waiting for adoption placements.\n \n Murphy-O'Connor's letter was released to the media in the midst of a reported deep split in the cabinet of Prime Minister Tony Blair over the bill.\n \n The legislation is already in effect in Northern Ireland, and its provisions covering England and Wales are currently being debated in the House of Lords.\n \n Conservative Protestant churches also are fighting the measure and have already warned they may close soup kitchens and other services if they are forced to hire and service gays.\n \n Some black churches have said that pastors and churchgoers would go to jail rather than accept rules that would mean they had to open their meeting halls to gay lobby groups. Catholic adoption agencies have said they fear they may be forced to allow gay couples to adopt.\n \n In March, Britain's High Court will hear an attempt by a Christian group, the Christian Institute, to overturn the legislation in Northern Ireland.\n \n Christian activists also have submitted a petition to Queen Elizabeth calling on her to use her influence to get the bill quashed.\n http://www.365gay.com/Newscon07/01/012307ukrts.htm", 
   {
    "post_info": {
     "post_title": "Catholic Church Threatens To End All Adoptions If UK Gay Rights Bill Passed"
    }
   }, 
   null, 
   null, 
   1169609340.0
  ], 
  [
   248267, 
   null, 
   "jyoshu", 
   "Wow, that's insane! Why should children suffer and the homeless suffer over their beliefs? This is one case where these religious groups, in the way they are fighting this, are just wrong. In fact, it makes me very sad to read that. If this is true, it is such a blatant abandonment of Christian compassion. I would also like to see the story from a more mainstream news source, though.", 
   {}, 
   248265, 
   null, 
   1169609940.0
  ], 
  [
   248269, 
   null, 
   "ShadowPikachu", 
   "Catholic Church Threatens To End All Adoptions If UK Gay Rights Bill Passed\n Posted: January 23, 2007 - 1:00 pm ET\n \n (London) The Catholic Church has upped the ante in its dispute with the British government over a gay rights bill, threatening to shut down its adoption agencies if the measure passes.\n \n Cardinal Cormac Murphy-O'Connor, the Archbishop of Westminster, issued the warning demanding the government exempt the church and its organizations from the bill that adds sexuality to existing nondiscrimination laws.\n \n The measure covers employment and the rendering of services. It would mean companies cannot refuse jobs on the basis of sexuality, nor could they refuse services to gay and lesbian customers.\n \n \"We believe it would be unreasonable, unnecessary and unjust discrimination against Catholics for the government to insist that if they wish to continue to work with local authorities, Catholic adoption agencies must act against the teaching of the church and their own consciences by being obliged in law to provide such a service,\" said Murphy-O'Connor in a letter to the Prime Minister.\n \n The Cardinal said there are 4,000 children currently waiting for adoption placements.\n \n Murphy-O'Connor's letter was released to the media in the midst of a reported deep split in the cabinet of Prime Minister Tony Blair over the bill.\n \n The legislation is already in effect in Northern Ireland, and its provisions covering England and Wales are currently being debated in the House of Lords.\n \n Conservative Protestant churches also are fighting the measure and have already warned they may close soup kitchens and other services if they are forced to hire and service gays.\n \n Some black churches have said that pastors and churchgoers would go to jail rather than accept rules that would mean they had to open their meeting halls to gay lobby groups. Catholic adoption agencies have said they fear they may be forced to allow gay couples to adopt.\n \n In March, Britain's High Court will hear an attempt by a Christian group, the Christian Institute, to overturn the legislation in Northern Ireland.\n \n Christian activists also have submitted a petition to Queen Elizabeth calling on her to use her influence to get the bill quashed.\n http://www.365gay.com/Newscon07/01/012307ukrts.htm\n\n \n Wow, talk about bigots. Aren't these the same anti-choicers that talk about how \"the foetus shouldn't be harmed because of something that happened to the woman (rape, failure of contraception, etc.), that it isn't the \"child's\" fault\"? Aren't they doing that exact same thing (only worse as it is affecting children that are already born) in this case? What hypocrites.\n \n I hope that the law passes overwhelmingly in the UK. I think it is disgusting and repugnant the way they are trying to pressure the government to not pass a bill that would stop discrimination.\n \n Oh, and about those Protestant churches near the end of the article, how the hell would they tell if a person they serve in the soup kitchen is gay or not? Even better, how do they know the people they hire are not gay?\n \n This makes me wonder how many actual followers of Christ there are left in the world (I think I'm part of a dying breed). These \"christians\" are much closer to followers of the pharisees.", 
   {}, 
   248265, 
   null, 
   1169610540.0
  ], 
  [
   248272, 
   null, 
   "foundit66", 
   "Wow, that's insane! Why should children suffer and the homeless suffer over their beliefs? This is one case where these religious groups, in the way they are fighting this, are just wrong. In fact, it makes me very sad to read that. If this is true, it is such a blatant abandonment of Christian compassion. I would also like to see the story from a more mainstream news source, though.\n\n \n Here are a couple of British news web-sites. I have no idea how \"main-stream\" they are. They both seem to quote the same story, so I guess this might be like an \"AP\" type thing for Britain?\n \n http://www.thisislondon.co.uk/news/article-23376152-details/Don't%20impose%20your%20morality:%20Catholic%20Archbishop%20attacks%20gay%20rights%20bill/article.do?expand=true\n \n http://www.dailymail.co.uk/pages/live/articles/news/news.html?in_article_id=419067&in_page_id=1770&ico=Homepage&icl=TabModule&icc=NEWS&ct=5\n \n Ministers have been accused of overturning the nation's morality in a searing attack on new gay rights laws by a leading Roman Catholic churchman. \n \n Archbishop of Birmingham Vincent Nichols threatened to withdraw Catholic co-operation with the Government over schools, charity programmes and adoption agencies if the new sexual orientation regulations go ahead. \n \n The fierce assault on the new laws signalled an ominous deepening of the row between Labour and the churches over the new laws, which are designed to stop businesses from discriminating against homosexuals. \n \n Archbishop Nichols declared that ministers were \"engaged in an intense and at times aggressive reshaping of our moral framework\". \n \n And he added that \"those who are elected to fashion our laws are not elected to be our moral tutors. They have no mandate or competence to be so.\" \n \n The Church of England has already warned that it believes the new laws would make it possible for a gay couple to sue a vicar who refused to bless their same-sex partnership. \n \n Catholics have threatened to shut down their adoption agencies, which successfully found familes for more than 200 children last year, if they are forced to place children with gay couples. \n \n The Sexual Orientation Regulations are set to go into law in England in April. Final details have not yet been made public, largely because of a row between staunchly Catholic Communities Secretary Ruth Kelly and Cabinet colleagues. \n \n But yesterday Miss Kelly gave a confirmation that the new laws will go ahead. She told a conference run by the Commission for Racial Equality: \"Anger about people not being able to fulfil their potential brought me into politics. \n \n \"Whether the barrier is their background, their race, religion or sexual orientation the Labour Party has always been prepared to take the decisions to open up opportunity for all.\" \n \n Archbishop Nichols gave his scathing verdict in a sermon in St Chad's Cathedral. He told the congregation: \"The Government must realise that it is not possible to seek co-operation with us while at the same time trying to impose upon us conditions which contradict our moral values. \n \n \"It is simply unacceptable to suggest that the resources of faith communities, whether in schools, adoption agencies, welfare programmes, halls and shelters can work in co-operation with public authorities only if the faith communities accept not simply a legal framework but also the moral standards at present being touted by the Government.\" \n \n The Archbishop, who is a favourite to take over from Cardinal Cormac Murphy-O'Connor, the English Roman Catholic leader who is likely to step down in the next few months, said an inversion of family morality was being \"forced on us.\" \n \n He said: 'Take the notion of the family and the moral equivalence being forced upon us between marriage of a man and a woman, on the one hand, and on the other, a legally recognised partnership of two people of the same sex.' \n \n The attack is particularly sharp because Catholic bishops in England have traditionally leaned, like many of their flock, towards support for the Labour Party. \n \n They have published guidance on Catholic teaching in advance of elections that has broadly supported Labour. \n \n However ministers have been told that the Catholic church will shut down its seven adoption agencies rather than place children with homosexual couples. \n \n This, the Church has warned, would leave a 'huge gap' in the system for helping children in care. Roman Catholic agencies find homes for about one in 20 of all children adopted from care. \n \n Both Catholic and Anglican leaders say schools and church groups are deeply reluctant to rent out halls or facilities to gay pressure groups. They fear that conference centres and retreat houses could also be sued if they refuse to accept bookings from homosexual groups. \n \n Church of England leaders have said that priests could be sued for failing to bless same sex couples or give communion to churchgoers whose behaviour they believe to be wilfully sinful. \n \n The deep anger now coming from Church leaders has found echoes civil areas. A Christian magistrate in Sheffield, Andrew McClintock, has been forced to resign from family court duty after he said he would not support the adoption of a child by a gay couple. \n \n The Sexual Orientation Regulations would have an impact on religious believers in business. Christian hoteliers will be compelled to rent rooms to gay couples, while Muslim printers will be unable to refuse to print homosexual magazines or advertisements. \n \n While the final version of the rules - which the Government has produced to meet the demands of a European Directive - have yet to be published in England, the version which will operate in Northern Ireland from 1 January has appeared. \n \n The Northern Ireland rules, which appear to cement the role of the province as a test bed for new legislation and forms of taxation in England, say those found guilty of breaking the rules will be fined between &#163;500 and &#163;1,000 for a first offence. Subsequent serious offences can attract penalties of up to &#163;25,000. ", 
   {}, 
   248267, 
   null, 
   1169611620.0
  ], 
  [
   248281, 
   null, 
   "jyoshu", 
   "Well, there is no excuse to refuse to serve the needy, or find homes for orphans, whom Christ made clear were to be cared for. The Church is going against the teachings of Christ by reacting in this way.\n \n I will say this: I do not think it is right for a vicar to be sued for not performing a same-sex marriage, if that could indeed be a result of this legislation. Clergy should have freedom of choice, and a govt. should not be able to impose a morality any more than the Church should be able to. But the way the Church is choosing to fight this is terribly wrong, and an abandonment of Christ and his teachings.", 
   {}, 
   248272, 
   null, 
   1169614320.0
  ], 
  [
   248282, 
   null, 
   "Phunting", 
   "Here are a couple of British news web-sites. I have no idea how \"main-stream\" they are. They both seem to quote the same story, so I guess this might be like an \"AP\" type thing for Britain?\nThe Mail is Britain's 2nd biggest selling paper, so I'd accept that as mainstream. I'd not noticed this story myself though, and yep it's pretty disgusting.\n \n What's 'an \"AP\" type thing?'", 
   {}, 
   248272, 
   null, 
   1169614500.0
  ], 
  [
   248283, 
   null, 
   "ShadowPikachu", 
   "The Mail is Britain's 2nd biggest selling paper, so I'd accept that as mainstream. I'd not noticed this story myself though, and yep it's pretty disgusting.\n \n What's 'an \"AP\" type thing?'\n\n \n AP is a sort of American thing. It stands for Associated Press, and it is a sort of news agency that cooperates and shares its articles with newspapers, radio, tv news, etc. across the country, sometimes even sharing with news reporting in other countries as well. Sort of like Reuters.", 
   {}, 
   248282, 
   null, 
   1169615460.0
  ], 
  [
   248294, 
   null, 
   "foundit66", 
   "Well, there is no excuse to refuse to serve the needy, or find homes for orphans, whom Christ made clear were to be cared for. The Church is going against the teachings of Christ by reacting in this way.\n I will say this: I do not think it is right for a vicar to be sued for not performing a same-sex marriage, if that could indeed be a result of this legislation. Clergy should have freedom of choice, and a govt. should not be able to impose a morality any more than the Church should be able to. But the way the Church is choosing to fight this is terribly wrong, and an abandonment of Christ and his teachings.\n\n \n As a private citizen and not a public employee of the government, the vicar should not be sued. The government should not be obligating the church, anymore than the church should be obligating the government.", 
   {}, 
   248281, 
   null, 
   1169624640.0
  ], 
  [
   248299, 
   null, 
   "peteratwar", 
   "Unfortunately UK Governments and particularly this one have a long history of creating very badly thought legislation.\n \n The main problem seems to be that on a specific interpretation, people may be forced to do something which is against their strongly held beliefs, as opposed to being allowed to refuse to carry out whatever action has been asked and letting some other person who has no problem carry it out.", 
   {}, 
   248294, 
   null, 
   1169638020.0
  ], 
  [
   248315, 
   null, 
   "ShadowPikachu", 
   "Unfortunately UK Governments and particularly this one have a long history of creating very badly thought legislation.\n \n The main problem seems to be that on a specific interpretation, people may be forced to do something which is against their strongly held beliefs, as opposed to being allowed to refuse to carry out whatever action has been asked and letting some other person who has no problem carry it out.\n\n \n So, if, for instance, it was strongly against my beleifs to serve black people in my restaurant, I should be allowed to refuse to carry that out? Or maybe if I was an employer, I could refuse to hire women if it was strongly against my beleifs?\n \n It doesn't really matter if it is against their \"strongly held beleifs\" (read \"bigotry\"). By law they will have to serve gays in soup kitchens, hire gays, etc, along with any other entity that provides services or hires workers. Otherwise they can get in trouble for discrimination against gays. Churches shouldn't get a free pass to discriminate against gays in situations like that.\n \n I agree with everyone that a Vicar should not be forced to perform a gay marriage (which this law would not do, so ther is no argument there). That has to do with inter-church doctrine. But when they are providing services to the public, such as the soup kitchens, adoption, etc. or hiring from the public, they should not be allowed to discriminate against gays.\n \n BTW, I think it is just sick the way they are using children in need of adoption to try to pressure this bill into failing. It is diametrically opposed to the teachings of Christ, and I don't see how they can call themselves followers of christ and be able to sleep at night.", 
   {}, 
   248299, 
   null, 
   1169660280.0
  ], 
  [
   248323, 
   null, 
   "Steeeeve", 
   "Do these same adoptions places not offer adoptions to those that do not believe in God...or perhaps believe Satan is better?", 
   {}, 
   248315, 
   null, 
   1169661480.0
  ], 
  [
   248359, 
   null, 
   "Phunting", 
   "As a private citizen and not a public employee of the government, the vicar should not be sued. The government should not be obligating the church, anymore than the church should be obligating the government.\nI agree, though will make a slight point: In the UK we do not have separation of Church and state, and a Cof E vicar could be said to be a public official: their (temporal) authority does come from the Queen and the General Synod has it's powers delegated from Parliament. Further some Bishops are appointed by the Prime Minister and can sit on our parliament through virtue of their position.\n \n But anyway, that's just CofE and not Catholics...", 
   {}, 
   248294, 
   null, 
   1169685240.0
  ], 
  [
   248369, 
   null, 
   "ShadowPikachu", 
   "I agree, though will make a slight point: In the UK we do not have separation of Church and state, and a Cof E vicar could be said to be a public official: their (temporal) authority does come from the Queen and the General Synod has it's powers delegated from Parliament. Further some Bishops are appointed by the Prime Minister and can sit on our parliament through virtue of their position.\n \n But anyway, that's just CofE and not Catholics...\n\n \n In that case, I would definitely agree that as they are public officials of a sort, they should have to follow all of the laws passed.", 
   {}, 
   248359, 
   null, 
   1169690640.0
  ], 
  [
   248806, 
   null, 
   "foundit66", 
   "Unfortunately UK Governments and particularly this one have a long history of creating very badly thought legislation.\n The main problem seems to be that on a specific interpretation, people may be forced to do something which is against their strongly held beliefs, as opposed to being allowed to refuse to carry out whatever action has been asked and letting some other person who has no problem carry it out.\n\n \n 1) I find extreme irony in this situation with regards to a mirror over the Atlantic pond.\n In America, religion wants to be free to exercise influence over the government while being exempt from the government having influence over religion.\n Across the Atlantic, we see something happening where the government is exerting influence over religion.\n Quite frankly, to those who don't want to acknowledge the existence of separation of church and state (or at least one side of it), this demonstrates another side of the issue...\n \n 2) For the record, I support separation of church and state. On both sides.\n It looks like the government is exerting some undue control over the church which I do not support.\n \n 3) With that said, if the religions are performing some of these tasks which are \"governmental\" in nature, like adoption, then they should either follow the government requirements or get out.\n Other issues, like marriage, there is no reason to impose upon them if they don't want to marry the couple. A gay couple has no guaranteed right to get married in whatever church they desire.\n But the adoption impacts the life of the child, and the church has no right to insist that the child remain an orphan over being adopted by somebody they don't like.", 
   {}, 
   248299, 
   null, 
   1170100320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Catholic Church Threatens To End All Adoptions If UK Gay Rights Bill Passed", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9484-catholic-church-threatens-end-all-adoptions-if-uk-gay-rights-bill-passed.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9484, 
  "discussion_files": [
   [
    "4419.html", 
    "http://www.4forums.com/political/gay-rights-debates/9484-catholic-church-threatens-end-all-adoptions-if-uk-gay-rights-bill-passed-print.html"
   ]
  ], 
  "identifier": 9484
 }
]