[
 [
  [
   249622, 
   null, 
   "Master_Shake", 
   "I loathe all those people who love Peyton Manning. He's given WAY too much credit. :xcensored", 
   {
    "post_info": {
     "post_title": "Friggin Colts!!"
    }
   }, 
   null, 
   null, 
   1170697140.0
  ], 
  [
   249671, 
   null, 
   "Waxy", 
   "I'm not a Manning fan either, but I'm man enough to give credit where credit is due.........the guy has been the best QB in the NFL for the last 5 or 6 years, no question. Yes, Brady has the rings, but his numbers don't compare, and he's always had the defense to make his life easy.\n \n IMHO, the guy deserved to win a SuperBowl, as did the rest of the cast - Harrison, Wayne, that O-line, etc... If they would have had a defense for the last 5 years, they'd have been one of the NFL's great dynasties.\n \n Manning will eventually pass Marino and retire as the all time #1QB, of that I have no doubt. It would take a career ending injury for it not to happen, and so far, other than Favre, the guy is an incredible iron man, he hasn't even missed practice for crying out loud. \n \n Love him or hate him, the guy is a great QB.\n \n Congrats to the Colts.\n \n Waxy\n \n P.S. Poor Grossman, he's in for a long offseason, and maybe a short career.", 
   {}, 
   249622, 
   null, 
   1170706260.0
  ], 
  [
   249680, 
   null, 
   "Steeeeve", 
   "I loathe all those people who love Peyton Manning. He's given WAY too much credit. :xcensored\n\n \n I'd like him better if his commercials weren't so annoying. He probably is one of the best current quarterbacks but he has a lot of help from the talent on his team along with a good coach. The best coached team is still the Patriots though...they almost beat the Colts (and should have) with absolutely no talent other than Brady on their team...and maybe one or two more.", 
   {}, 
   249622, 
   null, 
   1170709320.0
  ], 
  [
   249691, 
   null, 
   "Master_Shake", 
   "IMHO, the guy deserved to win a SuperBowl, as did the rest of the cast - Harrison, Wayne, that O-line, etc... If they would have had a defense for the last 5 years, they'd have been one of the NFL's great dynasties.\n \n Manning will eventually pass Marino and retire as the all time #1QB, of that I have no doubt. It would take a career ending injury for it not to happen, and so far, other than Favre, the guy is an incredible iron man, he hasn't even missed practice for crying out loud. \n \n Love him or hate him, the guy is a great QB.\n \n Congrats to the Colts.\n \n Waxy\n \n P.S. Poor Grossman, he's in for a long offseason, and maybe a short career.\n\n He may pass Marino and Elway in the records, but that doesn't mean he is a better quarterback. Marino never had the team Manning does and Elway carried his team to the Super Bowl three times before he had a team.\n \n He may have the numbers, but Harrison, Wayne, (and a receiver that is escaping my mind at the moment), are a HUGE part of the reason he has the numbers he does.\n \n In an age of prima donnas like Terrel Owens, Keyshawn Johnson, etc. I respect a guy that works as hard as Peyton does. I'm not saying he's not a good quarterback, I simply think he is given all the credit when it wasn't all him. We do that too much in general with QBs. We make them the be all end all when they rarely, if ever, are.\n \n I feel for Grossman too. He's getting a lot of the blame in this and I don't think he really deserves as much as he's getting. I'm no Bears fan either, I just feel for him.", 
   {}, 
   249671, 
   null, 
   1170718020.0
  ], 
  [
   249854, 
   null, 
   "Waxy", 
   "Marino had Clayton and Duper, Montana/Young had Rice, Elway had Smith, Sharpe, MCaffrey, etc... None of these great QBs was throwing the ball to Freddie Mitchell as their go to guy, they were surrounded by greatness too, not only at WR, but at RB, O-line, and way more often than not, on defense too. \n \n Marino had great teams, how else were the Dolphins so dominant? The Broncos ran the ball and played defense for the most part to get to 3 SuperBowls, only to lose them all.\n \n To say that Manning, or any QB, is great because his receivers are great is illogical. How can any QB or WR be great without the other? Further to that, the combination is the key. The chemistry and work ethic that Manning and Harrison have is unparalled.\n \n As for QB's getting too much credit in general, I agree 110%. All the proof of that you need is that the Bears were in the SB, and had a real chance of winning...........with Rex Grossman at QB.\n \n Waxy", 
   {}, 
   249691, 
   null, 
   1170784560.0
  ], 
  [
   249863, 
   null, 
   "Master_Shake", 
   "Elway didn't have the Rod Smith, Ed McCaffery, Shannon Sharpe, TD combo until the end of his career. Hence the first three lost Super Bowls.", 
   {}, 
   249854, 
   null, 
   1170787740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Friggin Colts!!", 
  "url": "http://www.4forums.com/political/sports-debates/9528-friggin-colts.html", 
  "breadcrumbs": [
   "Sports"
  ], 
  "id_number": 9528, 
  "discussion_files": [
   [
    "29249.html", 
    "http://www.4forums.com/political/sports-debates/9528-friggin-colts-print.html"
   ]
  ], 
  "identifier": 9528
 }
]