[
 [
  [
   249757, 
   null, 
   "foundit66", 
   "OLYMPIA, Wash. -- Proponents of same-sex marriage have introduced a ballot measure that would require heterosexual couples to have a child within three years or have their marriages annulled.\n \n The Washington Defense of Marriage Alliance acknowledged on its Web site that the initiative was \"absurd\" but hoped the idea prompts \"discussion about the many misguided assumptions\" underlying a state Supreme Court ruling that upheld a ban on same-sex marriage.\n \n The measure would require couples to prove they can have children to get a marriage license. Couples who do not have children within three years could have their marriages annulled.\n \n All other marriages would be defined as \"unrecognized,\" making those couples ineligible for marriage benefits.\n \n The paperwork for the measure was submitted last month. Supporters must gather at least 224,800 signatures by July 6 to put it on the November ballot.\n \n The group said the proposal was aimed at \"social conservatives who have long screamed that marriage exists for the sole purpose of procreation.\"\n \n Cheryl Haskins, executive director of Allies for Marriage and Children, said opponents of same-sex marriage want only to preserve marriage as the union of a man and a woman.\n \n \"Some of those unions produce children and some of them don't,\" she said.\n \n http://seattlepi.nwsource.com/national/1110AP_Gay_Marriage_Washington.html", 
   {
    "post_info": {
     "post_title": "Idea would require couples to have kids"
    }
   }, 
   null, 
   null, 
   1170736020.0
  ], 
  [
   249768, 
   null, 
   "Matthew S", 
   "I love it\n \n If gay people can't get married because the court ruled that marriage was about children then I see no problem with turning the courts decision into law.", 
   {}, 
   249757, 
   null, 
   1170739200.0
  ], 
  [
   249812, 
   null, 
   "peteratwar", 
   "I love it\n \n If gay people can't get married because the court ruled that marriage was about children then I see no problem with turning the courts decision into law.\n\n \n \n Well as Marriage never has been SOLELY for the procreation of children and as 2 perfectly healthy people cannot sometimes have children, I think the proverbial snowball in hell works here in relation to the proposal", 
   {}, 
   249768, 
   null, 
   1170763080.0
  ], 
  [
   249818, 
   null, 
   "Matthew S", 
   "Well as Marriage never has been SOLELY for the procreation of children and as 2 perfectly healthy people cannot sometimes have children, I think the proverbial snowball in hell works here in relation to the proposal\n\n \n That is not what the religious right would have everyone believe or what the court ruling was about.\n http://seattletimes.nwsource.com/html/localnews/2003152467_webdoma26.html\n \n\"The Legislature was entitled to believe that limiting marriage to opposite-sex couples furthers procreation, essential to the survival of the human race and furthers the well-being of children by encouraging families where children are reared in homes headed by children's biological parents,\" Madsen wrote.\n", 
   {}, 
   249812, 
   null, 
   1170773100.0
  ], 
  [
   249825, 
   null, 
   "peteratwar", 
   "[QUOTE=Matthew S;249818]That is not what the religious right would have everyone believe or what the court ruling was about.\n [QUOTE]\n \n A minority element and a court of limited jurisdiction are hardly leading proponents nor do they speak for the vast majority. Another slightly absurd minority\n \n Moreover judging by the article I just read that was not the SOLE reason for the judgement, only an element in it.", 
   {}, 
   249818, 
   null, 
   1170776400.0
  ], 
  [
   249836, 
   null, 
   "jitobear", 
   "I think the idea is to poke holes in a favorite argument used by those who disagree with same-sex marriage. Nearly every opponent of same sex marriage I have encountered at least has it in its arsenal of reasons against same sex marriage.\n \n I don't think it will become law, nor do I think it should. But I do think it will be very effective at trashing that argument.", 
   {}, 
   249825, 
   null, 
   1170780060.0
  ], 
  [
   249842, 
   null, 
   "Kronus", 
   "Ooh, this seems like a bad idea to me. Philosophically their approach is sound, of course. But what they're really shooting for is PR here, and that can be really tricky. The whole \"marriage is about children argument is obviously bogus. Those who are taken in by it want to be taken in, so this won't effect them in the least. It might help convince some of the more middle of the road types, and educate those who hadn't heard about this tack, so some good is possible here. But it also would take very little effort to hold this up to ridicule, or use it to further mobilize the RR by pretending that it's a real attack on straight families. I'm not convinced that this group has the resources or expertise to keep this on track, and not have it turn around and bite them. This isn't hollywood, where any publicity is good publicity. This is politics, and bad public perception can haunt you for a long time.", 
   {}, 
   249836, 
   null, 
   1170781440.0
  ], 
  [
   249848, 
   null, 
   "ShadowPikachu", 
   "I think this is a good idea, I like it. As Matthew said, the court ruling specifically cited procreation. I think this will be a good way of poking holes in that decision. I don't think it will pass, nor do I think it should (although it might be rather interesting if it actually did), but since almost every anti-gay bigot I've run into uses procreation as one of their \"justifications\" for their bigotry, maybe this will help the American public see how wrong those bigots are (hell, if the law were to in the unlikely event pass, maybe we'd see a few of the bigots woken up from their hatred).", 
   {}, 
   249842, 
   null, 
   1170783480.0
  ], 
  [
   249866, 
   null, 
   "foundit66", 
   "That is not what the religious right would have everyone believe or what the court ruling was about.\n\n \nA minority element and a court of limited jurisdiction are hardly leading proponents nor do they speak for the vast majority. Another slightly absurd minority\n\n Say whaaa????\n Did you even read (and comprehend) what the statement Matthew was quoting was about?\n \n It was about a court ruling and legislative action which was AGAINST gay marriage.\n It was giving the REASON WHY they thought DOMA was constitutional.\n And these aren't isolated examples. In fact, I think it would be harder to find a court case which doesn't try to go the route of \"procreation\" for marriage for justification...\n \n I would be curious what your legal argument against gay marriage is, and then if you could actually find a court which ruled it was a constitutional argument...\n \n \n \nMoreover judging by the article I just read that was not the SOLE reason for the judgement, only an element in it.\n\n Not the \"SOLE\" reason?\n \n Yeah. There are numerous ridiculous assertions that the anti-gay marriage crowd makes when it comes to the issue.\n Was there another issue in the article that you wanted to discuss?\n \n Like the \"suspect class\" statement? Funny thing is that gays do not have to be a \"suspect class\" in order for their rights to be protected...\n \n Or that marriage is not a right? A claim which is refuted by numerous SCOTUS rulings...", 
   {}, 
   249825, 
   null, 
   1170788580.0
  ], 
  [
   250494, 
   null, 
   "Caprii", 
   "well, I personally don't care if gays marry, or if people want to marry more than one at the same time.\n \n but if proposal is to find a loop hole in the \"procreation\" notion, think it about, don't you think the hetro sexuals can \"procreate\" and then terminate and thus met the procreation requirement? Wonderful, increase the abortion rate, all for a loophole!\n \n Personally, I think marriage should be completely abolished, it's a waste of paperwork.", 
   {}, 
   249866, 
   null, 
   1171077000.0
  ], 
  [
   250520, 
   null, 
   "grammy", 
   " I don't think it will pass, nor do I think it should \nI agree - it shouldn't pass. And when it doesn't, won't that nullify the original decision by confirming that pro-creation is not a requirement or even the reason for marriage?", 
   {}, 
   249848, 
   null, 
   1171123920.0
  ], 
  [
   250521, 
   null, 
   "Kronus", 
   "I agree - it shouldn't pass. And when it doesn't, won't that nullify the original decision by confirming that pro-creation is not a requirement or even the reason for marriage?\n\n \n Do you mean nullify in the logical or in the legal sense?", 
   {}, 
   250520, 
   null, 
   1171124520.0
  ], 
  [
   250591, 
   null, 
   "ShadowPikachu", 
   "Do you mean nullify in the logical or in the legal sense?\n\n \n Yeah, the logical sense will be nullified, but not necissarily the legal side. However, with that as a sort of \"precedent\" that points out how ilogical it is, maybe if it is appealed or challenged or something, that might change their decision to keep the law. Ya never know.", 
   {}, 
   250521, 
   null, 
   1171166100.0
  ], 
  [
   250594, 
   null, 
   "obvious_child", 
   "It's pretty sad that it takes this kind of action for social conservatives to at least acknowledge their rationals are bull****.", 
   {}, 
   250591, 
   null, 
   1171167300.0
  ], 
  [
   250598, 
   null, 
   "Matthew S", 
   "You all do realize that this is not a legislative action. It is a group of people using the ballot petition system. If they get enough signatures it goes on the ballot. They are using the same system, and means as the cithgaps.", 
   {}, 
   250594, 
   null, 
   1171171740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Idea would require couples to have kids", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9531-idea-would-require-couples-have-kids.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9531, 
  "discussion_files": [
   [
    "8588.html", 
    "http://www.4forums.com/political/gay-rights-debates/9531-idea-would-require-couples-have-kids-print.html"
   ]
  ], 
  "identifier": 9531
 }
]