[
 [
  [
   14898, 
   null, 
   "Broker", 
   "Israel is basically saying that they will expel Arafat soon. \n \n What are opinions on this?\n \n I think it's a great thing. Arafat is only hurting the effort. He is funding terror directly, and blocking the Prime Minister from doing anything. He doesn't want the militants disarmed.\n \n If they expel Arafat and keep him out, I think we'll see big gains in the peace process.", 
   {
    "post_info": {
     "post_title": "And that's the end of that..."
    }
   }, 
   null, 
   null, 
   1063324020.0
  ], 
  [
   14902, 
   null, 
   "SilentPoet", 
   "I certainly beleive they should expel him (it should have been done sooner).\n \n \nIf they expel Arafat and keep him out, I think we'll see big gains in the peace process.\n \n \n At first we may see a substantial retalition from groups such as Hammas who say they are loyal to Arafat. \n \n Always Stay Open Minded", 
   {}, 
   14898, 
   null, 
   1063324380.0
  ], 
  [
   14907, 
   null, 
   "AMD4EVER", 
   "I certainly beleive they should expel him (it should have been done sooner).\n \n At first we may see a substantial retalition from groups such as Hammas who say they are loyal to Arafat. \n \n Always Stay Open Minded\n\n \n \n My feelings are the same. I was hoping Arafat would have been removed long ago since he really doesn't wish for peace. He is a terrorist by trade and he will only make peace harder to achieve.\n \n Your right in that things will get hairy in the short term, but in the long run I think this is going to make things go much smoother.", 
   {}, 
   14902, 
   null, 
   1063325640.0
  ], 
  [
   14914, 
   null, 
   "SilentPoet", 
   "Your right in that things will get hairy in the short term, but in the long run I think this is going to make things go much smoother.\n\n \n - That also depends on the leader that replaces him. \n \n Always Stay Open Minded", 
   {}, 
   14907, 
   null, 
   1063328100.0
  ], 
  [
   14924, 
   null, 
   "AMD4EVER", 
   "That also depends on the leader that replaces him.\n\n \n I'm under the impression that the Israeli security council removed Arafat. Why would they allow him to be replaced by someone who is like him or worse?", 
   {}, 
   14914, 
   null, 
   1063330560.0
  ], 
  [
   15037, 
   null, 
   "SilentPoet", 
   "http://www.cnn.com/2003/WORLD/meast/09/12/mideast.arafat/index.html\n \n I think this qualifies as harboring terrorists.\n \n (We assasinate terrorists and Israel isn't allowed to make them leave the country)\n \n Always Stay Open Minded", 
   {}, 
   14924, 
   null, 
   1063426380.0
  ], 
  [
   15649, 
   null, 
   "AMD4EVER", 
   "Hahaha, check this out. The anti-Israel UN tried to demanded Israel halt threats to expel Palestinian Authority President Yasser Arafat. In a vote 11 voted yea while 3 abstained and the US vetoed the whole thing. Wow, maybe this is why the US is in the UN. To stop them from voting on resolutions that support terrorism.\n \n http://www.cnn.com/2003/WORLD/meast/09/16/mideast/index.html", 
   {
    "post_info": {
     "post_title": "U.S. vetoes Arafat vote in U.N."
    }
   }, 
   14898, 
   null, 
   1063761180.0
  ], 
  [
   15654, 
   null, 
   "SilentPoet", 
   "Yes I've absolutely seen the article.\n Its ridiculous that the UN would try to prevent a country from removing a terrorist.\n Atleast the US has the sense to stop them in that regard.\n \n Although I just suspect the US is playing politics.\n \n Always Stay Open Minded", 
   {}, 
   15649, 
   null, 
   1063762020.0
  ], 
  [
   16277, 
   null, 
   "theLIBERTARIAN", 
   "I don't thing Arafat has any real power. Even if he were to tell every militant to cease fire, they would not listen. I think most Palestinians would just like to live in peace. The few that don't are broken up into various groups that are separate. Even if Arafat had some power it would be nearly impossible for one person to control the actions of all of these groups.", 
   {}, 
   15654, 
   null, 
   1064034420.0
  ], 
  [
   16381, 
   null, 
   "SilentPoet", 
   "Liberatian,\n \n I'll just continue this debate on the other thread. \"UN harboring terrorism\".", 
   {}, 
   16277, 
   null, 
   1064086620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  And that's the end of that...", 
  "url": "http://www.4forums.com/political/peace-middle-east/954-thats-end.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 954, 
  "discussion_files": [
   [
    "1378.html", 
    "http://www.4forums.com/political/peace-middle-east/954-thats-end-print.html"
   ]
  ], 
  "identifier": 954
 }
]