[
 [
  [
   250032, 
   null, 
   "lady x", 
   "the oil is runnin out. what will we do when it finshes.", 
   {
    "post_info": {
     "post_title": "what will happen after all the oil runs out?"
    }
   }, 
   null, 
   null, 
   1170817200.0
  ], 
  [
   250101, 
   null, 
   "obvious_child", 
   "the oil is runnin out. what will we do when it finshes.\n\n \n It won't get to that point. There's a clear reason why many of the potential alternative energy options have been largely patented by the oil industry and why that industry hires huge amounts of engineers out of college. \n \n When oil is reaching a point where it's not economical to sell, they will switch over. So instead of buying oil from them, we'll buy another fuel source from them. In the end they get our money.", 
   {}, 
   250032, 
   null, 
   1170833040.0
  ], 
  [
   250556, 
   null, 
   "TRIGGER", 
   "Actualy there is some indicators that oil isn't a finite source of fuel. There are indictors that the earth actualy makes oil and that some of the capped wells that we have started to refill. Wheather this is fact or fiction I don't know but it would not suprise me.", 
   {}, 
   250101, 
   null, 
   1171147980.0
  ], 
  [
   250561, 
   null, 
   "Jo Bennett", 
   "Actualy there is some indicators that oil isn't a finite source of fuel. There are indictors that the earth actualy makes oil and that some of the capped wells that we have started to refill. Wheather this is fact or fiction I don't know but it would not suprise me.\n\n \n fiction, to the best of my knowledge", 
   {}, 
   250556, 
   null, 
   1171150200.0
  ], 
  [
   252415, 
   null, 
   "Ignatius", 
   "Actualy there is some indicators that oil isn't a finite source of fuel. There are indictors that the earth actualy makes oil and that some of the capped wells that we have started to refill. Wheather this is fact or fiction I don't know but it would not suprise me.\n\n \n :xbanghead \n Really funny.\n Maybe seven dwarves are converting polluted water into oil...", 
   {}, 
   250556, 
   null, 
   1172454540.0
  ], 
  [
   252419, 
   null, 
   "Mucusaur", 
   "Actualy there is some indicators that oil isn't a finite source of fuel. There are indictors that the earth actualy makes oil and that some of the capped wells that we have started to refill. Wheather this is fact or fiction I don't know but it would not suprise me.\n\n \n The non biologic origin of oil? Fiction. If the oil companies dont believe it, you may be garaunteed there is no point pursuing it", 
   {}, 
   250556, 
   null, 
   1172456100.0
  ], 
  [
   252463, 
   null, 
   "daewoo", 
   "Ultimatly, I doubt that we will ever run out of oil. There are 2 scenarios that I think are probable when it comes to the end of the oil age. First, we may see an orderly transition from oil to alternative forms of energy. This would have to be coupled with a SERIOUS change in the lifestyles of most of the world, and would almost certianly include a decrease in the human population of the planet, since even if you discount energy we are extremely reliant on hydrocarbons from oil and those alternative forms of energy do not yield cheap hydrocarbons.\n \n The other scenario is a disorderly one. In this scenario, supply and demand lines cross and rather than a peaceful, orderly change, we see massive die offs, war, and famine. Ultimatly the human race implodes to the point that the massive infrastructure needed to pump, transport, and refine oil is no longer available, so the oil stops flowing.\n \n Ultimatly, given the data we have today, the second scenario seems FAR more likely. We do not currently have alternative energy sources that can come anywhere close to competing with oil. While we certainly have good, cheap ways to produce electricity, electricity is a pretty poor transportation fuel, and it does not do anything as far as providing us with hydrocarbons. The alternative energy sources we do have right now for transportation fuels all depend on cheap hydrocarbon input to be cost effective (ethanol, etc...). \n \n Ultimatly, most of the alternatives we DO have on the horizon are decades away from full implementation at any kind of scale that may even be able to replace a fraction of the oil we use. At the same time, all real indicators point to a peak in oil production and a susequent crossing of the supply and demand lines long before we have the chance to implement any of those programs on any really meaningful scale. The hirsh report claims that it would take a minimum of 20 years of crash programs in order to mitigate the effects of a peak in our oil supply. There are no such programs currently planned or funded.\n \n Ultimatly the arrival of a peak in oil supplies will mean that we will have to resign ourselves to a more sustainable human population for the planet earth. Estimates of what that might be range from a pretty depressing 500 million (probably low) to a nearly chearful 3 billion (probbaly a little high). With our current population of 6 billion, even the upper range estimates are pretty damn depressing.", 
   {}, 
   252419, 
   null, 
   1172469120.0
  ], 
  [
   252495, 
   null, 
   "Jo Bennett", 
   "I would disagree with electricity being a poor transportation fuel. With current (albeit quite new) battery technology, it is possible to charge batteries to an 80% charge in 10 minutes (you need a 200 amp socket though) and get in excess of 200 miles from that charge, with speed and acceleration comparable to a normal car.", 
   {}, 
   252463, 
   null, 
   1172486100.0
  ], 
  [
   252496, 
   null, 
   "daewoo", 
   "I would disagree with electricity being a poor transportation fuel. With current (albeit quite new) battery technology, it is possible to charge batteries to an 80% charge in 10 minutes (you need a 200 amp socket though) and get in excess of 200 miles from that charge, with speed and acceleration comparable to a normal car.\n\n \n Look into the hydrocarbon input required to produce batteries and it quickly becomes apparent that they are, like so many other things, dependant on cheap oil to be cost effective. \n \n Right now electricity is the best option we have. As a worldwide solution, it sucks. I have no doubt that eventually technology could be developed that would change that. It just does not seem likely that we have that kind of time.", 
   {}, 
   252495, 
   null, 
   1172486880.0
  ], 
  [
   253342, 
   null, 
   "Steeeeve", 
   "I would disagree with electricity being a poor transportation fuel. With current (albeit quite new) battery technology, it is possible to charge batteries to an 80% charge in 10 minutes (you need a 200 amp socket though) and get in excess of 200 miles from that charge, with speed and acceleration comparable to a normal car.\n\n \n great...we can have millions of batteries lining our landfills so we can just poison ourselves instead of dying from war :)", 
   {}, 
   252495, 
   null, 
   1173139980.0
  ], 
  [
   253382, 
   null, 
   "Jo Bennett", 
   "Batteries can be reprocessed quite effectively. Do you not have battery recycling points in the US?", 
   {}, 
   253342, 
   null, 
   1173177480.0
  ], 
  [
   253507, 
   null, 
   "Winston Smith", 
   "Our Prime Minister is hellbent on introducing nuclear power stations to Australia to replace coal driven power plants. \n For many years foreign interests have tried to use Australia's desert lands for dumping radioactive materials from all over the world; those business interests are good friends of our Prime Minister. \n Years ago they tried the argument that if Australia exported uranium then it was its responsibility to accept its waste. When that argument didn't convince the populace they shelved it.\n Now under the pretense of combating global warning they have have brought out the nuclear power option to the fore again.\n Given the lack of major reserves of oil and gas in Australia. Nuclear power is the only realistic option.", 
   {}, 
   253382, 
   null, 
   1173271920.0
  ], 
  [
   253508, 
   null, 
   "Winston Smith", 
   "Batteries can be reprocessed quite effectively. Do you not have battery recycling points in the US?\n\n \n Lead acid batteries are recycled in Australia, but the rest ? forget it. I just dump them like everybody else as only a few companies have recycling stations. Would you drive all the way to Sony in Sydney to discard a few AA batteries?", 
   {}, 
   253382, 
   null, 
   1173272100.0
  ], 
  [
   253509, 
   null, 
   "Winston Smith", 
   "world economy is predicated on continuous growth therefore human population will continue growing until the time comes of the big crash. We are consuming our dwindling resources faster than ever for a growing population has also the means to consume more, so this positive feedback will accelarate the rush to the cliff.\n As you know oil reserves, coal and gas will are not renewable resources, it took hundred of millions of years for Mother Nature to produce them and we will squander them in a few hundred years at the most, if global warming does not stop us in our tracks. So enjoy driving, as it may soon become a thing of the past. I am thinking of buying shares in oil companies and bicycle manufacturers as well. Just trting to cover every angle.", 
   {
    "post_info": {
     "post_title": "daewo"
    }
   }, 
   253508, 
   null, 
   1173272520.0
  ], 
  [
   253511, 
   null, 
   "Winston Smith", 
   "I would disagree with electricity being a poor transportation fuel. With current (albeit quite new) battery technology, it is possible to charge batteries to an 80% charge in 10 minutes (you need a 200 amp socket though) and get in excess of 200 miles from that charge, with speed and acceleration comparable to a normal car.\n\n \n a 200 Amp socket?? can you imagine the size of it???", 
   {}, 
   252495, 
   null, 
   1173272640.0
  ], 
  [
   253665, 
   null, 
   "snakespit", 
   "a 200 Amp socket?? can you imagine the size of it???\n\n \n Most enclosures designed for a 200A socket are about the size of a tissue box. The socket itself is is about 2.5 inches wide. Yeah...I can imagine.", 
   {}, 
   253511, 
   null, 
   1173383040.0
  ], 
  [
   253764, 
   null, 
   "daewoo", 
   "Most enclosures designed for a 200A socket are about the size of a tissue box. The socket itself is is about 2.5 inches wide. Yeah...I can imagine.\n\n \n The problem comes, of course, with the fact that most americans do not have a 200 amp service. Most houses in the US still only have a 100 amp electrical service, with a 200 amp service being considered \"big\". If your entire electrical service is only 200 amps, a 200 amp outlet is not going to fly.", 
   {}, 
   253665, 
   null, 
   1173460740.0
  ], 
  [
   253773, 
   null, 
   "Jo Bennett", 
   "But the point is that the local garage could have a bank of 200 amp sockets, it would only take a little while longer to charge than filling up with petrol. For home use, charging overnight from a standard socket would be fine for most people.", 
   {}, 
   253764, 
   null, 
   1173465660.0
  ], 
  [
   253778, 
   null, 
   "daewoo", 
   "But the point is that the local garage could have a bank of 200 amp sockets, it would only take a little while longer to charge than filling up with petrol. For home use, charging overnight from a standard socket would be fine for most people.\n\n \n If you are in the UK or Europe where the electrical grid has not been neglected for the last 50 or 60 years, that plan works GREAT. Here in the US, where we are still using the electrical grid that our grandfathers built, and using it with very few improvements, that is a problem. \n \n Figure 200 amps per charger, and a station is going to need the capacity to handle say 8 charges at once. That is 1600 amps. I happen to know that in most of Europe, if you order a 1600 ams service the power company just kind of shrugs and drops a panel. In the US, that is a major deal. a 1600 amp service is the kind of thing you find in a factory, not a gas station. \n \n Utlimatly the cost of infrastructure changes/improvements will probably keep us from doing anything proactive until it is too late...and then we may not be ABLE to do anything.", 
   {}, 
   253773, 
   null, 
   1173470100.0
  ], 
  [
   260962, 
   null, 
   "Judeau", 
   "I think we are going to be ok for a while on oil. Does anyone watch/check the futures markets? They are pretty dang good indicators of future oil supplies. That is why they exist. And by the way, we will find a way. We are not just going to cash in our chips and say we made a good run for it when the oil runs out. Alternatives will be found when the time comes.\n \n Thinking beyond batteries, what about capacitators? (I think that is what they're called) They hold as much of a charge as they have surface area in their interior. With new nanotechnology, it is possible to dramatically increase their capacities and they charge instantly with a jolt. I actually know very little about these things and if anyone knows more I would enjoy hearing about them.", 
   {}, 
   253778, 
   null, 
   1177951320.0
  ], 
  [
   261041, 
   null, 
   "Ripskar", 
   "Apart from the fact that countries and companies inflate their reserves estimates.\n Prices are rising and several of the inflated estimates have been shown to be empty, even fraudulent, leading to orders being unfulfilled.\n I suspect the problem of over inflation of reserve estimates will hit the market in the face in the next couple of years, 2010/2015 at the outside.", 
   {}, 
   260962, 
   null, 
   1177976940.0
  ], 
  [
   261167, 
   null, 
   "Waxy", 
   "Apart from the fact that countries and companies inflate their reserves estimates.\n Prices are rising and several of the inflated estimates have been shown to be empty, even fraudulent, leading to orders being unfulfilled.\n I suspect the problem of over inflation of reserve estimates will hit the market in the face in the next couple of years, 2010/2015 at the outside.\n\n \n This is really only true of the OPEC nations - Saudi Arabia and Venezuela in particular.\n \n North American in particular, but European as well, reserves reporting is EXTREMELY stringent. The banks and major brokerage houses make darn good and sure of that through the use of 3rd party reserve evaluators.\n \n It's also federal law in Canada.\n \n Waxy", 
   {}, 
   261041, 
   null, 
   1178042940.0
  ], 
  [
   261289, 
   null, 
   "Ripskar", 
   "One of the big western companies got pulled up about it late last year, Shell IIRC, Kuwait has also been pulled up and there are questions over most of the reports now. Shell said something to the effect that \"Everyone did it\" when they were caught.", 
   {}, 
   261167, 
   null, 
   1178120760.0
  ], 
  [
   261293, 
   null, 
   "Waxy", 
   "One of the big western companies got pulled up about it late last year, Shell IIRC, Kuwait has also been pulled up and there are questions over most of the reports now. Shell said something to the effect that \"Everyone did it\" when they were caught.\n\n \n Shell took reserve write downs on several of their fields - IMHO, this is only evidence that the system is working, it's nothing new or shocking. The company I used to work for would take write downs on some of its fields every year. It has to do with the reserve auditors adjusting the total reserves of the field due to additional drilling and well production performance within the field.\n \n \"Everyone does it\" is a typical answer anytime you get caught with your hand in the cookie jar. In a sense, they're right. It's every oil companies goal to get the maximum amount of reserves possible accounted for and recognized. They do everything they can to maximize that number, it's where their value lies. That's why the entire system of the independent reserve audit system and government regulations were put in place - as a system of checks and balances to maintain veracity of the reserve reports and to make sure that all companies were operating under the same rules.\n \n Most middle eastern and other OPEC nations present \"official reserves reports\", but they refuse access to independent reserve auditors that would verify those reports - for obvious reasons.\n \n Waxy", 
   {}, 
   261289, 
   null, 
   1178122020.0
  ], 
  [
   261310, 
   null, 
   "Ripskar", 
   "I suppose we'll find out how trustworthy the data is when the report on the investigation into BPs manipulation of the fuel market is released, though the signs don't look good with the CEO jumping ship.", 
   {}, 
   261293, 
   null, 
   1178127000.0
  ], 
  [
   262047, 
   null, 
   "stariennight", 
   "Here in the US the general populace is afraid of Nuclier Energy, the greenpeacers have put out so much bad data. It is true our electrical grid is so out dated, once again because the greenpeacers don't want expansion/updates to the equipment. Hell, we have untapped oil reserves that we can't drill. Greenpeacers again. We will survive, but at a cost of untold dollars.:xbanghead", 
   {}, 
   261310, 
   null, 
   1178547240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  what will happen after all the oil runs out?", 
  "url": "http://www.4forums.com/political/environmental-debates/9543-what-will-happen-after-all-oil-runs-out.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 9543, 
  "discussion_files": [
   [
    "27498.html", 
    "http://www.4forums.com/political/environmental-debates/9543-what-will-happen-after-all-oil-runs-out-print.html"
   ], 
   [
    "27499.html", 
    "http://www.4forums.com/political/environmental-debates/9543-what-will-happen-after-all-oil-runs-out-2-print.html"
   ]
  ], 
  "identifier": 9543
 }
]