[
 [
  [
   250208, 
   null, 
   "jim's trucking", 
   "I believe Harry Truman said, \"The only thing new is the history you haven't read.\"\n \n \n \n Those who cannot remember the past are condemned to repeat it.\n \n \n \n \n \n Tokyo Rose During World War II -- the Japanese developed a way to demoralize the American forces.\n \n Psychological warfare experts developed a message they felt would work.\n \n \n \n They gave the script to their famous broadcaster \"Tokyo Rose\" and every day she would broadcast this same message packaged in different ways, hoping it would have a negative impact on American GI's morale.\n \n \n \n What was that demoralizing message? It had three main points\n \n 1. Your President is lying to you.\n \n . This war is illegal.\n \n 3. You cannot win the war.\n \n \n \n Does this sound familiar?\n \n \n \n Is it because Tokyo Hillary, Tokyo Harry, Tokyo John, Tokyo Teddy, Tokyo Nancy, have picked up the same message and are broadcasting it on Tokyo CNN, Tokyo ABC, Tokyo CBS, Tokyo NBC, to our TROOPS?\n \n \n \n The only difference is that they claim to support our troops before they demoralize them.\n \n \n \n Come to think of it, Tokyo Rose told the troops she was on their side, too!", 
   {
    "post_info": {
     "post_title": "Tokyo Rose"
    }
   }, 
   null, 
   null, 
   1170890580.0
  ], 
  [
   250211, 
   null, 
   "simone", 
   "Hmm, some interesting stuff about Tokyo Rose:\n \n \n. . . . The story begins with World War II, when a myth began circulating in the Pacific about an American of Japanese descent who was said to be using her sultry voice on Japanese radio to undermine the morale of American soldiers. Walter Winchell got hold of the story, setting in motion the frenzy that was to lead to one of the great travesties in the history of American justice. At war's end reporters visiting Japan went on the hunt for Tokyo Rose. Only Tojo was a bigger \"get\" to interview. Unfortunately, as the reporters soon discovered, several women broadcast over Radio Tokyo and none used the name Tokyo Rose. Unwilling to puncture a balloon that now had grown to a gigantic size, the reporters promised $2,000 to Iva Toguri to say that she was Tokyo Rose. Toguri, who'd been stranded in Japan by the war and provided for herself by getting a job as a DJ, signed a statement claiming to be Tokyo Rose, though she had no idea that this figure had been implicated in treason.\n \n The army conducted an investigation and cleared her, as the New York Times reported in August 1945. \"There is no Tokyo Rose,\" the U.S. Office of War Information revealed, \"the name is strictly a G.I. invention.... Government monitors listening in twenty-four hours a day have never heard the word 'Tokyo Rose' over a Japanese-controlled Far Eastern radio.\" Three years later Assistant Attorney General Theron L. Caudle confirmed that Toguri was innocent. \"Her activity,\" he wrote, \"consisted of nothing more than the announcing of music selections.\"\n \n No matter. The media, led by Walter Winchell, went on a witch hunt. In 1948 the government of Harry Truman, then in the political race of his life, pressed charges against Toguri, indicting her for treason and trying her in federal court in San Francisco. It was a frame-up from the start. The key witnesses who testified against her during the trial, claiming she had broadcast propaganda over the radio, subsequently admitted they had lied. \"We had no choice,\" said one of the witnesses, a Japanese businessman. \"U.S. Occupation police came and told me I had no choice but to testify against Iva, or else.\" He and others flown in from Japan for the trial \"were told what to say and what not to say for two hours every morning for a month before the trial started.\" \n \n The judge in the trial was convinced that Toguri was guilty and privately confessed that he was shocked that his son -- a veteran who had been stationed in the Pacific -- felt no animosity to her. \"I can't understand it,\" the judge confessed. In his instructions to the jury he excluded virtually all of the arguments Toguri's lawyers had raised in her defense. The jury foreman afterward said, \"If it had been possible under the judge's instructions\" to acquit her, the jury would have. \n \n In 1956, after spending seven years in prison, Iva Toguri was finally released. Reporters hid in bushes all night so they could catch a glimpse of the notorious traitor.\n \n In the 1970s the truth came out and Ford, on his last full day in office, pardoned her, finally vindicating her quiet claims of innocence. But what is the truth compared to the myth? And so the New York Times and NBC repeated as truth one of the most sordid lies of postwar justice. \n\n \n http://hnn.us/articles/461.html", 
   {}, 
   250208, 
   null, 
   1170892020.0
  ], 
  [
   250212, 
   null, 
   "simone", 
   "Of course, a woman is always fair game for rabid attacks.", 
   {}, 
   250211, 
   null, 
   1170892080.0
  ], 
  [
   250213, 
   null, 
   "Kronus", 
   "This has to be the weakest pro-war argument I've seen yet. Not even a vague attempt to reference any facts, just a complete smear job.", 
   {}, 
   250211, 
   null, 
   1170892200.0
  ], 
  [
   250221, 
   null, 
   "gamehuis", 
   "Tokyo Rose liked sushi and so do I. This must mean that I'm a troop demoralizing Democrat.", 
   {}, 
   250213, 
   null, 
   1170894540.0
  ], 
  [
   250230, 
   null, 
   "GazzaElliott", 
   "Of course, a woman is always fair game for rabid attacks.\n\n \n Yeah, I mean if it had been a bloke on the radio, there'd have never been a witch hunt! emoticon_xdonno \n \n I'm glad she was released. It's nice to know that if you slap people aroud the face enough with the wet kipper of truth, they eventually serve the kedgeree of justice....\n \n (I know kedgeree is haddock not herring, but it was spur-of-the-moment)", 
   {}, 
   250221, 
   null, 
   1170896940.0
  ], 
  [
   250255, 
   null, 
   "daewoo", 
   "I believe Harry Truman said, \"The only thing new is the history you haven't read.\"\n \n Those who cannot remember the past are condemned to repeat it.\n\n \n Repeat it....or invent it in an attempt to score cheap points in a smear campaign.", 
   {}, 
   250208, 
   null, 
   1170902760.0
  ], 
  [
   250325, 
   null, 
   "jim's trucking", 
   "Hmm, some interesting stuff about Tokyo Rose:\n \n \n \n http://hnn.us/articles/461.html\n...all of which is true (TTBOMK). None of it changes the fact that it was a deliberate attempt to demoralize and defeat our efforts to win. Just as these people intend to promote things that they opposed when they were the minority, they intended for their broadcasts to demoralize our efforts to win. Things don't get much more parallel than that.\n \n \n \n ... Just wait 'til one of them gets to be our President.", 
   {}, 
   250211, 
   null, 
   1170954780.0
  ], 
  [
   250326, 
   null, 
   "jim's trucking", 
   "Of course, a woman is always fair game for rabid attacks.\nI believe Harry, John and Teddy are too. I've never seen them even dressed as women.\n \n The attack was not on Tokyo Rose here...it was on those who mimic her today...and 3/5 of those attacked are men (I think!).", 
   {}, 
   250212, 
   null, 
   1170955020.0
  ], 
  [
   250329, 
   null, 
   "peteratwar", 
   "Yeah, I mean if it had been a bloke on the radio, there'd have never been a witch hunt! emoticon_xdonno \n \n I'm glad she was released. It's nice to know that if you slap people aroud the face enough with the wet kipper of truth, they eventually serve the kedgeree of justice....\n \n (I know kedgeree is haddock not herring, but it was spur-of-the-moment)\n\n \n In UK we hanged the man who had been doing it for the Germans. However, he was actually guilty even if the reasons were a bit elastic!", 
   {}, 
   250230, 
   null, 
   1170955380.0
  ], 
  [
   250336, 
   null, 
   "simone", 
   "Yeah, I mean if it had been a bloke on the radio, there'd have never been a witch hunt! emoticon_xdonno \n \n I'm glad she was released. It's nice to know that if you slap people aroud the face enough with the wet kipper of truth, they eventually serve the kedgeree of justice....\n \n (I know kedgeree is haddock not herring, but it was spur-of-the-moment)\nHey! During WWII who was that plummy sounding guy who broadcast Nazi propaganda into Britain?", 
   {}, 
   250230, 
   null, 
   1170958320.0
  ], 
  [
   250337, 
   null, 
   "simone", 
   "Did the Brits still shoot soldiers for cowardice during WWII or did they give that up after WWI?", 
   {}, 
   250336, 
   null, 
   1170958380.0
  ], 
  [
   250338, 
   null, 
   "Master_Shake", 
   " What was that demoralizing message? It had three main points\n \n 1. Your President is lying to you.\n \n . This war is illegal.\n \n 3. You cannot win the war.\n \n \n \n Does this sound familiar?\n\n Sure. I disagree that it is demoralizing, but that doesn't really matter.\n Whether or not it is demoralizing is irrelevant if it's true. And all three of these things are.", 
   {}, 
   250208, 
   null, 
   1170958620.0
  ], 
  [
   250340, 
   null, 
   "peteratwar", 
   "Did the Brits still shoot soldiers for cowardice during WWII or did they give that up after WWI?\n\n \n \n The penalty was still there for extreme cases. However, the effects of shell-shock etc were much better known so there was nothing like WWI", 
   {}, 
   250337, 
   null, 
   1170959760.0
  ], 
  [
   250758, 
   null, 
   "GazzaElliott", 
   "The 'plummy sounding guy' was Lord Haw-Haw. As peter says we caught him and hung him for treason, even though he was actually an American. If that's not a case of bending the rules (darn lawyers, do anything with a technicality) I don't know what is.....\n \n Wiki article here\n \n To answer the second question, again as peter said, cases of execution for cowardice were much rarer. The causes of shell shock were better understood, and WWII though it killed more people, was not fought in such horrible unsanitary conditions (no more trenches in the mud and blood of Flanders) with nutters in charge ordering suicidal marches into machine gun fire every other day. I don't think you can shoot people today. I'm not sure what penalty desertion brings today, but I doubt they put you against a wall...", 
   {}, 
   250340, 
   null, 
   1171305960.0
  ], 
  [
   250875, 
   null, 
   "simone", 
   "Thank you, Elliott.\n \n There's an interesting series of novels about WWI by Pat Barker. The reader must be warned, however, that there are some very explicit homosexual scenes in one or two of the books.", 
   {}, 
   250758, 
   null, 
   1171397160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tokyo Rose", 
  "url": "http://www.4forums.com/political/politics-debates/9546-tokyo-rose.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9546, 
  "discussion_files": [
   [
    "13014.html", 
    "http://www.4forums.com/political/politics-debates/9546-tokyo-rose-print.html"
   ], 
   [
    "13015.html", 
    "http://www.4forums.com/political/politics-debates/9546-tokyo-rose-2-print.html"
   ]
  ], 
  "identifier": 9546
 }
]