[
 [
  [
   250437, 
   null, 
   "SLP", 
   "People who oppose mainstream (that is, supportable, non-fringe) science are typically not scientists themselves. They frequently overestimate their own ability to interpret and understand science, and so end up making incorrect, often silly claims premised on their substandard abilities.\n \n A good example fo that can be seen in WW's old compatriot, Bertha Jane vandeGrift here.\n \n \n These underinformed overconfident fringe agitators see only what they want to see, understand only what they want to understand, and reject anything else.", 
   {
    "post_info": {
     "post_title": "The delusional &quot;EAM&quot; supporter"
    }
   }, 
   null, 
   null, 
   1171049760.0
  ], 
  [
   250438, 
   null, 
   "SLP", 
   "And she continues...\n \n \n ANYTHING can be proof of EAM!\n emoticon_xkill emoticon_xkill emoticon_xkill", 
   {}, 
   250437, 
   null, 
   1171050120.0
  ], 
  [
   250707, 
   null, 
   "obvious_child", 
   "Erector sets anyone? \n \n I've never in 5 years on multiple boards seen a user able to hold his own in a science discussion with a theory that cannot be tested. I've however seen a pattern of deliberate ignoring of users who poke holes in their theories though. Apparently they'd rather ignore how they are wrong then fix their problems (yet they criticize the very nature of science). \n \n People say that civilization has advanced. These people make me think long and hard about that.", 
   {}, 
   250438, 
   null, 
   1171261620.0
  ], 
  [
   250712, 
   null, 
   "supersport", 
   " \n \n I've never in 5 years on multiple boards seen a user able to hold his own in a science discussion with a theory that cannot be tested. .\n\n \n What about ToE? That certainly cannot be tested -- or hasn't been. have you held your own?.....how about all the others in here?\n \n By the way...EAM, or some of the components of it, already have been tested and proven, which is way more than can be said of ToE.\n \n \n \n http://www.newscientist.com/channel/life/genetics/dn7185-rogue-weeds-defy-rules-of-genetics.html\n \n Mendelian inheritance, the central tenet of genetics, is under attack from a few scrawny weeds that have not read the textbooks. The weeds are somehow inheriting DNA sequences from their grandparents that neither of their parents possessed - which is supposed to be impossible.\n \n The orthodox view is that genes are passed down in the form of DNA, and all organisms have to make do with this parental DNA inheritance, mutations and all. Chemical or structural modifications to DNA can switch off genes, and these changes can pass from generation to generation, a phenomenon called epigenesis. But epigenetic changes do not alter the actual sequence of DNA.", 
   {}, 
   250707, 
   null, 
   1171266180.0
  ], 
  [
   250714, 
   null, 
   "obvious_child", 
   "What about ToE? That certainly cannot be tested -- or hasn't been.\n\n \n No you just refuse to admit it. \n \n \nhave you held your own?.....how about all the others in here?\n\n \n Considering that you keep running away from people who refute you (including authors of articles you fallaciously distort), it would seem that they are holding their own. You on the other hand resort to commercial dinosaur art of villagers and deny that erosion happens...\n \n Actually if you read the entire article it supports evolution, specifically RNA, it's functions and its history as predicted by evolution. \n \n Google Cache\n \n This is exactly what I'm talking about. You deliberately distort what a article says in the hopes that no one reads it. Then you'll simply ignore this point and come back with the same argument next week.", 
   {}, 
   250712, 
   null, 
   1171266360.0
  ], 
  [
   250715, 
   null, 
   "supersport", 
   " No you just refuse to admit it. \n \n \n SHOW ME", 
   {}, 
   250714, 
   null, 
   1171266480.0
  ], 
  [
   250716, 
   null, 
   "obvious_child", 
   "[B] No you just refuse to admit it.\n\n \n I quote this forum. Every thread. Why would I simply repeat everything others have said only to have you ignore it all like you normally do?\n \n Not that's the main issue here. You don't even understand erosion. Why should I even waste my time on complicated subjects on someone who thinks that a fresh organic sample is the same age as a eroded time capsule simply because they are both on top of the ground?\n \n I could spend hours providing solid evidence (as others have before) and you'd simply ignore it. Furthermore I have directly refuted your literal belief yet you refuse to admit it's wrong. \n \n I'm quickly joining the club that sees you as nothing more then a infantile trolls who has very little education.\n \n When one argues that the commercial dino art of South American villagers is proof of creationism and refutation of Evolution, one truly is delusion, not to mention refusing to admit that erosion occurs.", 
   {}, 
   250715, 
   null, 
   1171266900.0
  ], 
  [
   250717, 
   null, 
   "electrolyte", 
   "SHOW ME\n\n The discovery of Tiktaalik.\n \n Combining knowledge from ecology, geology, and paleogeography with predictions from evolutionary theory, paleontologists selected where to look and what to look for... and they found it.\n \n *awaits retorts alleging fraud and conspiracy...", 
   {}, 
   250715, 
   null, 
   1171268100.0
  ], 
  [
   250728, 
   null, 
   "SLP", 
   " No you just refuse to admit it. \n \n \n SHOW ME\n\n \n Please do not pollute this thread with your idiocy.", 
   {}, 
   250715, 
   null, 
   1171294560.0
  ], 
  [
   250735, 
   null, 
   "supersport", 
   "The discovery of Tiktaalik.\n \n ...\n\n \n Please humor me...don't just blow smoke...how does that one creature prove the theory of evolution? do you have thousands of other intermediates on either side of that creature, leading up to and fading away from it??? Do you have a proven mechanim that would allow for gradual change??? Your other explanation is worthless.", 
   {}, 
   250717, 
   null, 
   1171297140.0
  ], 
  [
   250812, 
   null, 
   "SLP", 
   "Please humor me...don't just blow smoke...how does that one creature prove the theory of evolution? do you have thousands of other intermediates on either side of that creature, leading up to and fading away from it??? Do you have a proven mechanim that would allow for gradual change??? Your other explanation is worthless.\n\n \n \n \n Please take your amateurish, grade-school demands to another thread.", 
   {}, 
   250735, 
   null, 
   1171316580.0
  ], 
  [
   250821, 
   null, 
   "obvious_child", 
   "Please take your amateurish, grade-school demands to another thread.\n\n \n Along with your south American commerical dinosaur art and lack of any understanding of erosion.", 
   {}, 
   250812, 
   null, 
   1171322880.0
  ], 
  [
   250827, 
   null, 
   "electrolyte", 
   "What about ToE? That certainly cannot be tested -- or hasn't been.\nNo you just refuse to admit it. \nSHOW ME\nThe discovery of Tiktaalik. [snip]\nhow does that one creature prove the theory of evolution?\n\n That was the fastest goalpost shift ever. Whoosh, and they're gone.\n You said that evolutionary theory cannot be tested and has not been tested. I gave you an example of a test not only that applied to evolutionary theory, but also that evolutionary theory passed with flying colors. Now your retort is that this one example doesn't prove the whole of the theory. I never claimed that it did (although it's really damn good evidence that creationism can neither predict nor explain); it does, however, counter your claim.", 
   {}, 
   250821, 
   null, 
   1171326960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The delusional \"EAM\" supporter", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9551-delusional-eam-supporter.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9551, 
  "discussion_files": [
   [
    "15644.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9551-delusional-eam-supporter-print.html"
   ]
  ], 
  "identifier": 9551
 }
]