[
 [
  [
   250602, 
   null, 
   "Shooterandproud", 
   "This makes me sick. This is the decline of America. There was a Decline of Rome and Greece. Well, this is of America. Its sick that anyone would imprison innocent children against their will. I think I'm going to lose my lunch.\n \n http://www.latimes.com/news/printedition/asection/la-na-immig10feb10,1,4941931.story?ctrack=1&cset=true\n \n \n \nTAYLOR, TEXAS - Khadijah Bessuges is confined by metal gates and razor wire. She wears a uniform. She sleeps in an 8-by-15 cell, and stands by her cot four times a day when the guards count heads. She has only two pairs of panties. Her favorite teddy bear was confiscated. But she has her father, Sebastien, who sleeps in the cell with her.\n \n Khadijah is 9 years old.\n \n She is one of 208 children being held with their parents at the T. Don Hutto family detention center, the Department of Homeland Security's answer to the problem of families caught living in or entering the country illegally.\n \n \"It's not a good place for people,\" Khadijah said in a recent telephone interview. \"People here get sad, and they don't want to be here. They want to be with their families.\"\n \n Hutto, which opened in May 2006, is a pillar of the Bush administration's effort to crack down on illegal immigrants and detain them until their appeals can be heard. It holds detainees who cannot easily be sent home, as Mexicans can. Hutto has families from 29 countries, most from South America.\n \n The center is touted by the Homeland Security Department as a major achievement, and may be a model for future facilities. Hutto also illustrates the administration's bind as its pursuit of border security collides with the reality that many illegal immigrants are minors.\n \n On Friday, a majority of Hutto's 383 inmates were children.\n \n Immigrant advocates and human rights groups ask why Khadijah and the others are jailed for their parents' actions.\n \n \"Children being in jail with their parents is what is morally and ethically wrong with this picture,\" said attorney Frances Valdez of the University of Texas Immigration Law Clinic, who has clients at Hutto.\n \n A former prison northeast of Austin, Hutto is run by a for-profit company with a controversial record. And though the facility is meant for detention measured in days, many immigrants are detained for months.\n \n The average stay is about 55 days for asylum seekers, 40 for others, officials said.\n \n The longest any family has stayed is 205 days. At Immigration and Customs Enforcement's other family facility, in Pennsylvania, the average stay is 59 days, activists say.\n \n Attorneys say children at Hutto lose weight because of substandard food and suffer from untreated medical problems. Adults and children are given an hour of recreation a day, and chances to venture outdoors are rare.\n \n The adults may be seeking asylum or may have been charged with violating immigration laws, like Khadijah's father. They have not been charged with other crimes. Sebastien Bessuges, 30, a Frenchman who last year married an American, was arrested for overstaying his visa; Khadijah, a French and Mexican citizen from a previous marriage, had overstayed her visa too.\n \n Immigrants make up the fastest-growing group of people incarcerated in the U.S., according to the American Bar Assn. The immigration agency holds more than 200,000 people over the course of a year at more than 300 sites.\n \n For the administration and attorneys, family detention is largely uncharted territory. \"Standards for family detention do not exist in the U.S.,\" said Michelle Brane of the Women's Commission for Refugee Women and Children. \"That's just one of our concerns.\"\n \n Immigration officials have asked Brane's group and others to discuss creating standards for family detention.\n \n Congress did not have Hutto in mind when it directed Homeland Security in 2005 and 2006 to stop separating families and house them in nonpenal, homelike environments. It suggested methods such as electronic monitoring, which is being tested in eight cities. Advocates for immigrants point to a San Diego family shelter run by nuns as another possible model.\n \n Concerns about Hutto are rising. A government commission issued a \"report card\" Thursday that gave Homeland Security a failing grade on its treatment of asylum seekers. A Texas legislator has introduced a resolution condemning the jailing of children, local groups have held vigils outside Hutto, the American Civil Liberties Union is considering a lawsuit, and a Latino advocacy group has demanded an investigation.\n \n \"We want to know what's going on there,\" said Rosa Rosales, president of the League of United Latin American Citizens. \"Putting immigrants in concentration camps should not be happening in the United States.\"\n \n \n Officials play down the complaints. \"I don't think the criticisms are fair,\" said Gary Mead, assistant director for Immigration and Customs' detention and removal operations. \"This is run as a family shelter; it's not run as a jail. There is medical care; the meals are nutritious. Do people complain? They probably do - they're being detained. They were here illegally and now they're facing, in some cases, certain removal.\"\n \n In November 2005, Homeland Security officials announced the Secure Border Initiative, an effort to end illegal border crossings. Secretary Michael Chertoff had identified families as a particular problem because the department lacked facilities to detain them. Human rights groups protested separations.\n \n \"We could let families go or split them up,\" Mead said. \"Hutto became very important to ending that.\"\n \n The facility is run by the Corrections Corp. of America, a government contractor paid $95 per person a day. Watchdogs have found mismanagement at Corrections Corp. facilities, including inadequate medical care, failure to control violence, and substandard conditions.\n \n In the two weeks since Sebastien and Khadijah Bessuges arrived, Homeland Security has upgraded Hutto. Razor wire has been removed from the entrance. Artificial plants camouflage the iron entry gates. Walls and doors are plastered in brightly colored paper, cheerful stickers and big letters. But the decor, installed before a media tour Friday, cannot disguise the fact that Hutto is a prison.\n \n \"We have tried to soften the facility as much as possible,\" said Mead, who led the tour.\n \n The Homeland Security Department also has tried to improve the food, say immigrants' advocates, who attribute the changes to media attention. The department has expanded Hutto's academic programs from an hour a day to four, and plans to introduce a curriculum based on Texas standards.\n \n Last week, inmates staged a hunger strike to protest the food and other conditions. Sebastien Bessuges said Khadijah had lost 4 pounds at Hutto.\n \n Homeland Security officials countered Friday with a study showing that 81% of Hutto detainees gained weight during their stay.\n \n Advocates and attorneys concerned about the facility say the medical care is insufficient and there is no pediatrician.\n \n Lawyer Griselda Ponce said one client's untreated leg injury eventually required emergency surgery, and a 4-year-old girl's lips cracked and bled before medical staff would respond to her mother's requests for balm.\n \n Children and parents can blow off steam an hour a day in a gym. The rest of the time, they are kept in pods of several cells. Some locks are disengaged, then armed at night with lasers and alarms.\n \n Bessuges said Khadijah had quarreled with other children and guards had told him he must hold her in check or damage his chances of avoiding deportation.\n \n \"Yesterday, I ... found out she was removed from school in Arizona because of all the time she's missed,\" he said, his voice quieting.\n \n \"But I can't tell her that. That would break her heart.\"\n \n Bessuges had visited a federal immigration center last month to see what forms he needed to extend his stay in the U.S. The next day, immigration agents raided his suburban Phoenix home and detained him and Khadijah.\n \n The following day, Bessuges said, immigration officials gave him a choice: He and his daughter could stay in Arizona in separate detention centers, or they could board a plane for the Texas detention center and be together.\n \n \"I would never leave her,\" Bessuges said. \"It's fine to make me pay for the mistakes I have made. But ... no child deserves this.\"\n\n \n \n \n Really sorry about that, was in quite a hurry when I posted. I apologize for the delay. I posted a picture of the family. The father and daughter were split up from their family and were imprisoned.", 
   {
    "post_info": {
     "attachments": 1, 
     "post_title": "Lets Imprison innocent children! Great idea! Horray for america!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1171173180.0
  ], 
  [
   250607, 
   null, 
   "jitobear", 
   "Can you summarize or copy and paste so I don't have register?", 
   {}, 
   250602, 
   null, 
   1171209480.0
  ], 
  [
   250636, 
   null, 
   "jim's trucking", 
   "Can you summarize or copy and paste so I don't have register?\nExactly!\n \n \n \n ...but it claims to be free and have GREAT BENEFITS!! like maybe, they have your basic info and can sell your addresses to hundreds of other relentless marketers...Whoopie!!\n \n \n SAP should post us a copy of the article.", 
   {}, 
   250607, 
   null, 
   1171227960.0
  ], 
  [
   250664, 
   null, 
   "Shooterandproud", 
   "Article is Posted.", 
   {}, 
   250636, 
   null, 
   1171240920.0
  ], 
  [
   250723, 
   null, 
   "jim's trucking", 
   "Thanks.\n \n Two mistakes I see in this program:\n \n 1\n Using an old prison.\n \n 2\n Using a for-profit administrator.\n \n The second smells of stuffing friend's pockets with tax money while offering little to alleviate the real problem and showing no compassion for the children. The children would fare better if left naked on the steps of a church.\n \n \nThe facility is run by the Corrections Corp. of America, a government contractor paid $95 per person a day. Watchdogs have found mismanagement at Corrections Corp. facilities, including inadequate medical care, failure to control violence, and substandard conditions.\n \n In the two weeks since Sebastien and Khadijah Bessuges arrived, Homeland Security has upgraded Hutto. Razor wire has been removed from the entrance. Artificial plants camouflage the iron entry gates. Walls and doors are plastered in brightly colored paper, cheerful stickers and big letters. But the decor, installed before a media tour Friday, cannot disguise the fact that Hutto is a prison.\n \n\n \n Let's see...318 x 95 = 30,210 PER DAY\n 211,470 PER WEEK\n 10,996,440 PER YEAR\n \n \n That's DOLLARS paid out to keep 318 people for a year.\n \n $34,580.00 PER PERSON!!!\n \n ..and they won't even buy the girl some panties!\n \n Then again, Corrections Corp of America must pay an fat-cat executive, several executive assitants, various consultants, insurance policies, retirement programs and the like...so there goes most of the money...and we have to keep the equipment relatively new so the employees can keep taking home the 'used' equipment...there goes the rest of the money. We can't afford to feed Khadijah and maintain all these jobs too.emoticon_cry \n \n \n Shame on Taylor Texans!!!!!\n \n Where's Parnell Roberts when you need him? HE can feed those children for just pennies a day!\n \n As for the trouble in getting them home, Nancy Polozi's new plane can carry them in style...and LOTS of comfort.emoticon_xgood", 
   {}, 
   250664, 
   null, 
   1171289340.0
  ], 
  [
   250733, 
   null, 
   "jitobear", 
   "Oh for :xcensored sake. The paranoid jack asses who run the show are getting more embarassing every day.", 
   {}, 
   250723, 
   null, 
   1171296180.0
  ], 
  [
   250790, 
   null, 
   "Steeeeve", 
   "Seems that the US dropped the ball on what to do about them. I do believe they should be deported or whatever (unless there are some extreme circumstances) as they are here illegally but until they can be deported you should at least keep them in a decent enviroment", 
   {}, 
   250733, 
   null, 
   1171314360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Lets Imprison innocent children! Great idea! Horray for america!", 
  "url": "http://www.4forums.com/political/crime-debates/9554-lets-imprison-innocent-children-great-idea-horray-america.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 9554, 
  "discussion_files": [
   [
    "25668.html", 
    "http://www.4forums.com/political/crime-debates/9554-lets-imprison-innocent-children-great-idea-horray-america-print.html"
   ]
  ], 
  "identifier": 9554
 }
]