[
 [
  [
   251043, 
   null, 
   "Master_Shake", 
   "It's finally changed back. Hopefully it won't continue to go in this back and forth forever. Fourth change in 8 years.\n \n http://timesofindia.indiatimes.com/NEWS/World/Rest_of_World/Conservatives_in_Kansas_lose_fight_against_Darwinism/articleshow/1614628.cms\n \n \nConservatives in Kansas lose fight against Darwinism\n [ 15 Feb, 2007 0154hrs ISTREUTERS ]\n \n \n TOPEKA, (KANSAS): The Kansas board of education on Tuesday threw out science standards deemed hostile to evolution, undoing the work of Christian conservatives in the ongoing battle over what to teach US public school students about the origins of life. \n \n The board in the central US state voted 6-4 to replace them with teaching standards that mirror the mainstream in science education and eliminate criticisms of evolutionary theory. \n \n \"I'm glad we've taken this step. If we are going to have a well-educated populace, this is important,\" said board member Sue Gamble. \n \n Similar efforts to weaken the teaching of evolution in public schools have occurred throughout the US including Pennsylvania, Michigan, Kentucky and Georgia. \n \n But Kansas has been in the forefront of the debate since 1999, when the board voted to sharply reduce the emphasis of evolution in science instruction. A public backlash ultimately led to a reversal of that revision. \n \n The new standards, set to take effect immediately, replace those put in place in 2005 by a conservative majority of the board who challenged the validity of evolution and called it incompatible with religious doctrine. \n \n It is the fourth time in eight years that science standards have been rewritten in Kansas. \n \n \"I think it actually curtails the ability of students to learn and to think,\" said conservative board member Steve Abrams of the latest revision. \n \n Kansas' struggles have been widely lampooned and were depicted in a documentary film entitled Flock of Dodos. \n", 
   {
    "post_info": {
     "post_title": "Evolution Back in Kansas Schools"
    }
   }, 
   null, 
   null, 
   1171563180.0
  ], 
  [
   251067, 
   null, 
   "obvious_child", 
   "They can't win a intellectual argument as to the merits of ID or the problems of evolution, therefore they rely upon stacking the deck and the board. \n \n How infantile. Still, even after this change Kansas is the laughing stock of the world.", 
   {}, 
   251043, 
   null, 
   1171581900.0
  ], 
  [
   251070, 
   null, 
   "Master_Shake", 
   "They can't win a intellectual argument as to the merits of ID or the problems of evolution, therefore they rely upon stacking the deck and the board. \n \n How infantile. Still, even after this change Kansas is the laughing stock of the world.\n\n Hey now! ;) \n \n Yes, yes, I know it is, but take it easy, I live here ya know. emoticon_xangel", 
   {}, 
   251067, 
   null, 
   1171582320.0
  ], 
  [
   251124, 
   null, 
   "daewoo", 
   "They can't win a intellectual argument as to the merits of ID or the problems of evolution, therefore they rely upon stacking the deck and the board. \n \n How infantile. Still, even after this change Kansas is the laughing stock of the world.\n\n \n Only those parts of the world that are ignorant and do not bother to do their research. Those who DO research recognize that even with the changes, there was still no ID being taught in our classrooms, and we still had stricter definitions of \"science\" and stricter curriculum than 38 other states.\n \n Personally, I don't CARE which way they go with this. They just need to pick one and stick with it. The changes DO NO effect curriculum at the classroom level, and DO NOT allow for any alternate theories (if you want to call \"god dunnit\" a theory) to be taught. The whole thing has just been an expensive peeing contest between 2 sets of XXXXXX that has drawn the attention of a bunch of other XXXXXX who fail to recognize that it means NOTHING. It is essentially a philosophical argument without meaning or merit. \n \n Kansas has some of the best schools in the nations. We are in the top 5. This IDIOCY never should have been allowed to pollute our educational system, and it CERTAINLY should not have been re-introduced 4 times. The stupidity is simply mind boggling.", 
   {}, 
   251067, 
   null, 
   1171604820.0
  ], 
  [
   251137, 
   null, 
   "obvious_child", 
   "Only those parts of the world that are ignorant and do not bother to do their research. Those who DO research recognize that even with the changes, there was still no ID being taught in our classrooms, and we still had stricter definitions of \"science\" and stricter curriculum than 38 other states.\n\n \n Last time I checked most state boards merely set the guidelines, whether or not they are followed is something entirely different. Still the fact that you have a board of education spouting such ridiculousness is pretty damn amusing.\n \n \nKansas has some of the best schools in the nations.\n\n \n You got numbers? I'm curious.", 
   {}, 
   251124, 
   null, 
   1171618380.0
  ], 
  [
   251140, 
   null, 
   "peteratwar", 
   "\n How infantile. Still, even after this change Kansas is the laughing stock of the world.\n\n \n Hate to have to spoil things, but the rest of the world has really no interest at all in Kansas and its scholastic problems", 
   {}, 
   251067, 
   null, 
   1171628040.0
  ], 
  [
   251153, 
   null, 
   "daewoo", 
   "Last time I checked most state boards merely set the guidelines, whether or not they are followed is something entirely different. Still the fact that you have a board of education spouting such ridiculousness is pretty damn amusing.\n\n \n The way it works in Kansas, the state board of education sets the guidelines and sends them out to all the school districts where they sit in a box in a closet somewhere. During much of the time when all this idiocy was going on, I was ON the local school board and had never once opened one of those books. We all knew they existed, and nearly half of us knew where ours were, it was just not something that anybody generally cares to look at. I would be shocked if you could find me 10 kids in the entire state who have ever read the state school boards definition of \"science\" or their guidelines. It is just not something that comes up. \n \n IMO, that is why this issue came up in kansas. Our state school board here has VERY little power or control, so nobody really pays attention to them. When the first set of changes occured, there was a lag of about 6 months before anybody even realized it and then it was somebody from the media.\n \n \nYou got numbers? I'm curious.\n\n \n There is the ever popular \"smartest state\" report that places kansas at #15 in the nation. It can be found at http://www.morganquitno.com/edrank.htm\n \n A lot of kansas educators take exception to that report because it factors in things that may not be related. For example, Kansas kids score in the top 5 states in ALL testing categories, BUT, we score 38th in spending per pupil. We score poorly in teacher salaries (28), and do not have teachers on our school boards (conflict of interest). All those factors count against us, as well as several others. Then you have new jersey and vermont, where the kids apparently can't take a test, and where their average SAT scores may be confused with a shoe size, and they score in the top 5 because they spend a LOT more than kansas. A lot of people argue that they penalize states for efficiency in their education system. \n \n If you want the most comprehensive report out there, go to www.alec.org and request a copy of their \"report card for education\". I think it is free, and it breaks down the states by several categories. It is what I always used to figure out how good a job our system was doing.", 
   {}, 
   251137, 
   null, 
   1171647180.0
  ], 
  [
   251167, 
   null, 
   "Master_Shake", 
   "Hate to have to spoil things, but the rest of the world has really no interest at all in Kansas and its scholastic problems\n\n Actually they do. Whether or not you think they should is another matter entirely. Did you not notice where the article came from? From a paper in India. I also found articles on the same subject from papers all over the country as well as in other countries such as Romania.\n \n Save your snobbery for someone else.", 
   {}, 
   251140, 
   null, 
   1171654080.0
  ], 
  [
   251168, 
   null, 
   "Master_Shake", 
   "Only those parts of the world that are ignorant and do not bother to do their research. Those who DO research recognize that even with the changes, there was still no ID being taught in our classrooms, and we still had stricter definitions of \"science\" and stricter curriculum than 38 other states.\n \n Personally, I don't CARE which way they go with this. They just need to pick one and stick with it. The changes DO NO effect curriculum at the classroom level, and DO NOT allow for any alternate theories (if you want to call \"god dunnit\" a theory) to be taught. The whole thing has just been an expensive peeing contest between 2 sets of XXXXXX that has drawn the attention of a bunch of other XXXXXX who fail to recognize that it means NOTHING. It is essentially a philosophical argument without meaning or merit. \n \n Kansas has some of the best schools in the nations. We are in the top 5. This IDIOCY never should have been allowed to pollute our educational system, and it CERTAINLY should not have been re-introduced 4 times. The stupidity is simply mind boggling.\n\n I couldn't agree more. It's embarrassing.", 
   {}, 
   251124, 
   null, 
   1171654260.0
  ], 
  [
   251237, 
   null, 
   "ShadowPikachu", 
   "It's finally changed back. Hopefully it won't continue to go in this back and forth forever. Fourth change in 8 years.\n \n http://timesofindia.indiatimes.com/NEWS/World/Rest_of_World/Conservatives_in_Kansas_lose_fight_against_Darwinism/articleshow/1614628.cms\n\n \n Thank God. I too hope it doesn't keep going back and forth. While I live across the river in Parkville, Missouri, I used to live in Overland Park Kansas and went to school there. I think they are generally pretty good public schools, it's just the state school board that keeps effing everything up when they get some christonazis on board.", 
   {}, 
   251043, 
   null, 
   1171683060.0
  ], 
  [
   251273, 
   null, 
   "Master_Shake", 
   "Thank God. I too hope it doesn't keep going back and forth. While I live across the river in Parkville, Missouri, I used to live in Overland Park Kansas and went to school there. I think they are generally pretty good public schools, it's just the state school board that keeps effing everything up when they get some christonazis on board.\n\n I lived in Overland Park for 12 years until recently when I moved to KCK. It's nice to see another local folk on here.", 
   {}, 
   251237, 
   null, 
   1171696080.0
  ], 
  [
   251366, 
   null, 
   "BlackEmperor", 
   "this is terrible. Kansas should have kept how it was instead of teaching the beleif of evolution like it was a fact when it is jst a theory and a beleif system of atheirsts", 
   {}, 
   251273, 
   null, 
   1171750680.0
  ], 
  [
   251368, 
   null, 
   "Mucusaur", 
   "this is terrible. Kansas should have kept how it was instead of teaching the beleif of evolution like it was a fact when it is jst a theory and a beleif system of atheirsts\n\n \n More people actuallysupport the FSM school of creationsim - would you agree that this could be a suitable compromise?", 
   {}, 
   251366, 
   null, 
   1171751280.0
  ], 
  [
   251370, 
   null, 
   "BlackEmperor", 
   "More people actuallysupport the FSM school of creationsim - would you agree that this could be a suitable compromise?\n\n \n What is this FSM? If it follows what God says, then it would be a suitable compromize, but I've never heard of this FSM.", 
   {}, 
   251368, 
   null, 
   1171751640.0
  ], 
  [
   251373, 
   null, 
   "Mucusaur", 
   "Well, it a slight variation on creation, still holy but plugs a lot of the annoying holes that the scientists keep poking at.\n \n It follows what god says, unfortuntly, the world rarely does", 
   {}, 
   251370, 
   null, 
   1171751820.0
  ], 
  [
   251375, 
   null, 
   "BlackEmperor", 
   "Well, it a slight variation on creation, still holy but plugs a lot of the annoying holes that the scientists keep poking at.\n \n It follows what god says, unfortuntly, the world rarely does\n\n \n Well if it follows the Bible then it should be taught, because it is the truth. Is FSM a denomination, or is it something like ID?", 
   {}, 
   251373, 
   null, 
   1171752120.0
  ], 
  [
   251377, 
   null, 
   "Mucusaur", 
   "Well if it follows the Bible then it should be taught, because it is the truth. Is FSM a denomination, or is it something like ID?\n\n \n As far as I am aware (not being a member myself) it is a denomination, but it attracts people from the outside due to its logical and straight-forward approach to ID, especially in schools. \n \n it is in favour or Occams razor", 
   {}, 
   251375, 
   null, 
   1171752480.0
  ], 
  [
   251379, 
   null, 
   "ShadowPikachu", 
   "this is terrible. Kansas should have kept how it was instead of teaching the beleif of evolution like it was a fact when it is jst a theory and a beleif system of atheirsts\n\n \n As a Christian who accepts evolution as fact, I think it is great that Kansas has gone back to teaching actual science instead of religious delusions of the IDers. And the claim of evolution being \"just a theory\" shows how much you know about science. Gravity is just a theory, do you accept that? There is Nuclear theory, do you claim the atomic bombs never went off in Japan?", 
   {}, 
   251366, 
   null, 
   1171752540.0
  ], 
  [
   251381, 
   null, 
   "BlackEmperor", 
   "As far as I am aware (not being a member myself) it is a denomination, but it attracts people from the outside due to its logical and straight-forward approach to ID, especially in schools. \n \n it is in favour or Occams razor\n\n \n Well, if it supports ID it should be taught in schools. Is it a denomination exclusive to Kansas? I haven't seen it around out here in Florida, so I'm just wondering.", 
   {}, 
   251377, 
   null, 
   1171752840.0
  ], 
  [
   251384, 
   null, 
   "BlackEmperor", 
   "As a Christian who accepts evolution as fact, I think it is great that Kansas has gone back to teaching actual science instead of religious delusions of the IDers. And the claim of evolution being \"just a theory\" shows how much you know about science. Gravity is just a theory, do you accept that? There is Nuclear theory, do you claim the atomic bombs never went off in Japan?\n\n \n If you beleive in evolution, then you are not a true Christian. God told us how he created us right in the bible. Evolution tells the exact opposite of that, so if you accept it, you deny God.", 
   {}, 
   251379, 
   null, 
   1171752900.0
  ], 
  [
   251385, 
   null, 
   "Mucusaur", 
   "Well, if it supports ID it should be taught in schools. Is it a denomination exclusive to Kansas? I haven't seen it around out here in Florida, so I'm just wondering.\n\n \n Not sure. Somewhat Worldwide, but I acnt be certain as I am here in Ireland", 
   {}, 
   251381, 
   null, 
   1171753020.0
  ], 
  [
   251392, 
   null, 
   "thelmoose", 
   "Not sure. Somewhat Worldwide, but I acnt be certain as I am here in Ireland\n\n \n FSM is not world-wide yet, but it is growing. Thank you for the consciousness raising by bringing attention to this glorious belief system. It has the advantage of being every bit as valid and supportable as either creationism or ID. More importantly, it's scripture is unambiguous on the origins of the universe.\n \n It looks like you may have attracted a new adherent.\n Ramen!", 
   {}, 
   251385, 
   null, 
   1171753500.0
  ], 
  [
   251393, 
   null, 
   "BlackEmperor", 
   "FSM is not world-wide yet, but it is growing. Thank you for the consciousness raising by bringing attention to this glorious belief system. It has the advantage of being every bit as valid and supportable as either creationism or ID. More importantly, it's scripture is unambiguous on the origins of the universe.\n \n It looks like you may have attracted a new adherent.\n Ramen!\n\n \n That's neat, is it accepted by atheists where it could be taught in schools so that people can know the truth of the Christian God, and that his word is correct and not evolution?", 
   {}, 
   251392, 
   null, 
   1171753680.0
  ], 
  [
   251402, 
   null, 
   "Mucusaur", 
   "It was petitioned to the Kansas school board fairly recently I believe, but it never went beyond that.", 
   {}, 
   251393, 
   null, 
   1171759680.0
  ], 
  [
   251403, 
   null, 
   "ShadowPikachu", 
   "Great job, Mucusaur, you seem to have gotten him to accept FSM. :)", 
   {}, 
   251402, 
   null, 
   1171760580.0
  ], 
  [
   251404, 
   null, 
   "daewoo", 
   "That's neat, is it accepted by atheists where it could be taught in schools so that people can know the truth of the Christian God, and that his word is correct and not evolution?\n\n \n FSM is a dogma that teaches intelligent design, but refers to a \"supernatural creator\" rather than actually referring to God by name. This keeps the athiests and those scientific types from getting too upset and insures that muslims, hindus, the ACLU, and other heathens are not constantly dragging people into court and suing them for forcing belief in god down their throats.\n \n Its a happy medium. I was on the local schoolboard when the debate was going on and somebody was kind enough to send me some FSM literature and an FSM ballcap.", 
   {}, 
   251393, 
   null, 
   1171760640.0
  ], 
  [
   251405, 
   null, 
   "daewoo", 
   "Great job, Mucusaur, you seem to have gotten him to accept FSM. The hilarious part is that he doesn't even know what it is. :)\n\n \n Dammit! Now he is going to look it up. There could have been several pages before he caught on to the fact that people were trying to convert him to pastafarianism but you had to screw it up. Thanks a lot, Shadow. I have a new puppy at my house. You want to come kick it???", 
   {}, 
   251403, 
   null, 
   1171761360.0
  ], 
  [
   251420, 
   null, 
   "BlackLotus", 
   "It's finally changed back. Hopefully it won't continue to go in this back and forth forever. Fourth change in 8 years.\n \n \n\n \n I think it is really sad that the darwinists have gotten their religion back into the public schools of Kansas. I hope this gets changed soon.", 
   {}, 
   251043, 
   null, 
   1171764060.0
  ], 
  [
   251424, 
   null, 
   "obvious_child", 
   "If you beleive in evolution, then you are not a true Christian.\n\n \n No, you just don't take the bible literally. \n \n \nEvolution tells the exact opposite of that, so if you accept it, you deny God.\n\n \n technically if you deny evolution, you deny science, which would then by proxy mean you deny the world God created. \n \n So really, it is you who deny God.", 
   {}, 
   251384, 
   null, 
   1171764840.0
  ], 
  [
   251825, 
   null, 
   "lamp", 
   "If you beleive in evolution, then you are not a true Christian. God told us how he created us right in the bible. Evolution tells the exact opposite of that, so if you accept it, you deny God.\n\n \n I have some trouble with your post. Evolution has been a big question in my mind for a long time, and a big debate in our dorm for months. \n \n I thought Supersport had some good answers, but I am not sure now. I posted some replkies in support and asked some questions. But Supersport never replied. Did not reply to a PM. Maybe I am just small potatoes to all you guys who post all the time.\n \n I am doing polymer chemistry, so I am supposed to know about biochemical molecules asd well. In our family, we always went to church and studied the Bible. \n \n But from my own thoughts, I could see that the Bible never mentions anything related to molecules or atoms, so the Bible does not contain all knowledge. So now I am strtuggling with information. I never thought that chemistry would question my faith in the Bible, but it has. My awe of God has increased, but my confidence in Noah's Flood has definitely decreased.\n \n BTW, all my professors seem to be sincere Christians. I never heard an anti-Christian remark, and when I spoke to them personally, they have always said that they have faith and my questions were normal.", 
   {
    "post_info": {
     "post_title": "The Bible does not contain certain knowledge."
    }
   }, 
   251384, 
   null, 
   1171960200.0
  ], 
  [
   251827, 
   null, 
   "obvious_child", 
   "If chemistry questions your faith, your faith is weak. \n \n One can be a Christian and believe the flood was nothing more then a metaphor. \n \n The flood itself has so many scientific problems that unless it was divinically done and then all evidence stripped from the world, it didn't happen.", 
   {}, 
   251825, 
   null, 
   1171965120.0
  ], 
  [
   251855, 
   null, 
   "Master_Shake", 
   "I thought Supersport had some good answers, but I am not sure now. I posted some replkies in support and asked some questions. But Supersport never replied. Did not reply to a PM. Maybe I am just small potatoes to all you guys who post all the time.\n\n No, you're not small potatoes. Supersport is just like that. Doesn't really make real responses to anyone. It's not you.\n \n Welcome aboard by the way lamp.", 
   {}, 
   251825, 
   null, 
   1171995360.0
  ], 
  [
   251950, 
   null, 
   "ShadowPikachu", 
   "If chemistry questions your faith, your faith is weak. \n \n One can be a Christian and believe the flood was nothing more then a metaphor. \n \n The flood itself has so many scientific problems that unless it was divinically done and then all evidence stripped from the world, it didn't happen.\n\n \n I am certainly a Christian, and have no trouble with the age of the earth or any of science. About the flood, I truly think it happened. It just happens to be one of the many stories in the bible that got exaggerated and blown out of proportion over each retelling, and eventually went from a story about a river valley that experienced a large amount of flooding, to a tale about how the world was covere by water. I think it really has some basis in fact, as most fairy tales do.", 
   {}, 
   251827, 
   null, 
   1172032140.0
  ], 
  [
   251953, 
   null, 
   "obvious_child", 
   "I am certainly a Christian, and have no trouble with the age of the earth or any of science. About the flood, I truly think it happened. It just happens to be one of the many stories in the bible that got exaggerated and blown out of proportion over each retelling, and eventually went from a story about a river valley that experienced a large amount of flooding, to a tale about how the world was covere by water. I think it really has some basis in fact, as most fairy tales do.\n\n \n Are you aware of the origin of the flood story originating from the Epic of Gilgemish?", 
   {}, 
   251950, 
   null, 
   1172032980.0
  ], 
  [
   252284, 
   null, 
   "Easyrider", 
   "Are you aware of the origin of the flood story originating from the Epic of Gilgemish?\n\n \n Are you aware they probably picked up on it from Noah's descendants?", 
   {}, 
   251953, 
   null, 
   1172345580.0
  ], 
  [
   252285, 
   null, 
   "Easyrider", 
   "I am certainly a Christian..... \n\n \n Do you believe Jesus Christ is the Lord God, promised Messiah, and crucified / resurrected Savior for the remission of sins?", 
   {}, 
   251950, 
   null, 
   1172345760.0
  ], 
  [
   252299, 
   null, 
   "obvious_child", 
   "Are you aware they probably picked up on it from Noah's descendants?\n\n \n Wow. That's beyond ignorance. Ignorance was 10 miles back.\n \n Are you aware that the Epic of Gilgamesh predates Jewish Genesis by at least a thousand years? \n \n How could the writers of Gilgamesh pick up the story from people that existed at least a thousand years after them?\n \n There's plenty of hardware stores in the US Ez, you might want to go pick up some lightbulbs, you're obviously running very low upstairs on them.\n \n But if you're serious where is their time machine?", 
   {}, 
   252284, 
   null, 
   1172360820.0
  ], 
  [
   252300, 
   null, 
   "ShadowPikachu", 
   "Do you believe Jesus Christ is the Lord God, promised Messiah, and crucified / resurrected Savior for the remission of sins?\n\n \n Yes, I do beleive all of that. Your point?", 
   {}, 
   252285, 
   null, 
   1172360820.0
  ], 
  [
   252301, 
   null, 
   "ShadowPikachu", 
   "Wow. That's beyond ignorance. Ignorance was 10 miles back.\n \n Are you aware that the Epic of Gilgamesh predates Jewish Genesis by at least a thousand years? \n \n How could the writers of Gilgamesh pick up the story from people that existed at least a thousand years after them?\n \n There's plenty of hardware stores in the US Ez, you might want to go pick up some lightbulbs, you're obviously running very low upstairs on them.\n\n \n Not to mention the fact that the gilgamesh epic is set before the supposed date of the \"flood\".", 
   {}, 
   252299, 
   null, 
   1172360880.0
  ], 
  [
   252303, 
   null, 
   "obvious_child", 
   "Not to mention the fact that the gilgamesh epic is set before the supposed date of the \"flood\".\n\n \n It amuses me for all the talk about religion EZ does, he has very little understanding of the history.", 
   {}, 
   252301, 
   null, 
   1172361000.0
  ], 
  [
   252310, 
   null, 
   "daewoo", 
   "It amuses me for all the talk about religion EZ does, he has very little understanding of the history.\n\n \n You see this in a lot of people that insist on a strict, literal interpetation of the bible. They have to will themselves ignorant when it comes to most of history and all of science or their (ludicrous) views can not exist. \n \n Ultimatly that kind of forced ignorance serves as a limiting factor in the religon in question. If you demand a literalist view of the bible, you are going to have trouble winning converts simply because there are not that many people out there who are ignorant enough, or good enough at self delusion, to ignore so much that we know to be true in order to propogate a nonsensical religous viewpoint. \n \n We have a religous group around here that insists on a literalist interpetation of the bible. They call themselves Baptists, and the other baptists in the area take great pains to make sure people understand that they are not associated with the \"kooks at the tin temple\". \n \n I know somebody who is a tin temple kook. He used to work for me and was a pretty good machinist, if not the sharpest pencil in the box. He is constantly sending me religously oriented junk Email. I have noticed a couple of things. First, most of the Emails he sends turn out to be BS (snopes). Second, a continuing theme in many of them tends to be that there are a large number of christians, or a large number of people who believe in god, in the US. \n \n I think that those messages are largely an appeal to common sense (which we all know is actually an appeal to ignorance). He essentially seems to be trying to say \"a lot of people agree with me, therefore I am right\". I don't think that he recognizes that most of those people do NOT agree with him, most of them would view him as the locals do...as a kook from the tin temple.\n \n I was raised catholic and I remember in the classes leading up to confirmation was one of the priests at our parish explaining the bible and how it should be interpeted. He said that to argue for the infalibility of the bible is to argue against in the existance of god. In the dark ages (and for quite a while following) information was rather scarce and hard to come by and when you DID learn something, it was often unreliable. During those times, when ignorance was the natural order of things simply due to a lack of reliable information, a literalist interpetation of the bible was possible by even reasonable people. Today, that is not the case. Essentially he argued that if your faith includes something as nonsensical as a lteralist interpetation of the bible, or the belief that the bible is infallable (when there are clearly some major contradictions there), Then a belief in god is nearly impossible since neither of those (litrealist interpetation or infallability) can possible be considered accurate by any reasonable person. Faith built on a lie is not faith.", 
   {}, 
   252303, 
   null, 
   1172368020.0
  ], 
  [
   252311, 
   null, 
   "ShadowPikachu", 
   "It amuses me for all the talk about religion EZ does, he has very little understanding of the history.\n\n \n I definately agree with Daewoo. I think EZ (who I beleive is a literalist) knows quite a bit about religion. However, knowledge of religion says nothing of your knowledge of history. Anyone who takes the bible as strict historical fact like EZ have my pity, as the bible and other religious books are nothing close to being historical texts or accounts.", 
   {}, 
   252303, 
   null, 
   1172368320.0
  ], 
  [
   252315, 
   null, 
   "jyoshu", 
   "To be fair, in point of fact no one actually KNOWS that the Gilgamesh epic is older than the Noah epic. We don't know how old the Noah story is at all--the writer(s) of Genesis very well may have been putting into writing a story that had been around awhile. The only 2 things we know here is that the materials on which the writing of the Gilgamesh epic predate anything we've found revealing the Noah event, and that the Noah story would be SET later if you go by the generations written about in Genesis (which is very vague at times). Neither really proves factually that the Gilgamesh account predates the Noah account.", 
   {}, 
   252310, 
   null, 
   1172369400.0
  ], 
  [
   252316, 
   null, 
   "obvious_child", 
   "To be fair, in point of fact no one actually KNOWS that the Gilgamesh epic is older than the Noah epic.\n\n \n The Gilgamesh Epic is the Noah epic, or more accurately the Noah Epic is the Gilgamesh Epic. Tablets recording to the Gilgamesh were dated well beyond any references to Israelites. Not to mention that Gilgamesh was stolen and turned into Enuma Elish, which is itself older then the Jewish story of Genesis. Tablets of both Elish and Gilgamesh were found in the areas the Israelites inhabited before any record of Jewish Genesis was found. \n \n \nWe don't know how old the Noah story is at all--the writer(s) of Genesis very well may have been putting into writing a story that had been around awhile.\n\n \n That seems very likely. The epic of gilgamesh, specifically the flood was likely a large flood of a valley that over hundreds and hundreds of year was blown out of porportion and slowly made its way down into Palestian and was written by Israelites into their stories of creation. \n \n \nThe only 2 things we know here is that the materials on which the writing of the Gilgamesh epic predate anything we've found revealing the Noah event, and that the Noah story would be SET later if you go by the generations written about in Genesis (which is very vague at times). Neither really proves factually that the Gilgamesh account predates the Noah account.\n\n \n Huh? How does dating of tablets at least a 1000 years before the first record of Jewish Genesis not factually prove that Gilgamesh is older?", 
   {}, 
   252315, 
   null, 
   1172370120.0
  ], 
  [
   252318, 
   null, 
   "jyoshu", 
   "The Gilgamesh Epic is the Noah epic, or more accurately the Noah Epic is the Gilgamesh Epic. Tablets recording to the Gilgamesh were dated well beyond any references to Israelites. Not to mention that Gilgamesh was stolen and turned into Enuma Elish, which is itself older then the Jewish story of Genesis. Tablets of both Elish and Gilgamesh were found in the areas the Israelites inhabited before any record of Jewish Genesis was found. \n\n \n But you're comparing the dating of writing material to the age of an oral tradition, which effectively can't be done. We really don't know which predates the other--all we KNOW is that older tablets of the Gilgamesh one were found. That is perfectly consistent with the fact that semitic cultures carried their myths orally, while Babylonian ones wrote it down. It doesn't speak to which one is older. You may be surprised that research has showed there to be at least somewhere in the neighborhood of 80,000 epic flood myths around the world. They are VERY common in cultural histories. Even the American Indians had similar flood myths. \n \n \nHuh? How does dating of tablets at least a 1000 years before the first record of Jewish Genesis not factually prove that Gilgamesh is older?\n\n \n Because, again, you're dating an object (tablets) against oral tradition (or at least what BEGAN as oral tradition). We have no idea how far back the Hebrew version goes. Really, it is possible that Gilgamesh goes back further than the tablets we have found as well! So the bottom line is that we just don't know.", 
   {}, 
   252316, 
   null, 
   1172373120.0
  ], 
  [
   252320, 
   null, 
   "obvious_child", 
   "But you're comparing the dating of writing material to the age of an oral tradition, which effectively can't be done. We really don't know which predates the other--all we KNOW is that older tablets of the Gilgamesh one were found. That is perfectly consistent with the fact that semitic cultures carried their myths orally, while Babylonian ones wrote it down.\n\n \n Gilgamesh was a oral story for significent part of its existance and was only written down much later. The bigger point is, we have evidence that the Epic was around before the Israelites, who later turned into the Jews. So without anyone to carry around a oral jewish tradition, there's not much of argument now is there? The most complete version of Gilgamesh is from the 7th century BC library of a old ruler, while Gilgamesh himself is believed to be living somewhere around the 3rd millennium BC. I'm pretty damn sure that's before any Israelites were walking around.\n \n \nYou may be surprised that research has showed there to be at least somewhere in the neighborhood of 80,000 epic flood myths around the world. They are VERY common in cultural histories. Even the American Indians had similar flood myths.\n\n \n Hardly. There are litterally thousands of flood beliefs in this world. What creationists omit is that very, very, very few of these stories have any similarities outside of water. Just because alot of cultures had a flood story doesn't mean a global flood happened. Chinese flood stories bare no resembles at all to the flood of Genesis. \n \n \nBecause, again, you're dating an object (tablets) against oral tradition (or at least what BEGAN as oral tradition). We have no idea how far back the Hebrew version goes. Really, it is possible that Gilgamesh goes back further than the tablets we have found as well! So the bottom line is that we just don't know.\n\n \n If there are no people speaking hebrew at the time of the oldest dated story, there's no argument as to which is older. The only way your argument is valid is if both existed at roughly the same time, that's simply not true.", 
   {}, 
   252318, 
   null, 
   1172374680.0
  ], 
  [
   252325, 
   null, 
   "Easyrider", 
   "Wow. That's beyond ignorance. Ignorance was 10 miles back.\n \n Are you aware that the Epic of Gilgamesh predates Jewish Genesis by at least a thousand years? \n \n How could the writers of Gilgamesh pick up the story from people that existed at least a thousand years after them?\n \n There's plenty of hardware stores in the US Ez, you might want to go pick up some lightbulbs, you're obviously running very low upstairs on them. \n\n \n Your arrogance knows no limits. \n \n We have it on no less of an authority than Jesus Christ himself (who is God), where he referred to the \"days of Noah.\" There were only eight people on that ark, and I seriously doubt any of them were tablet inscribers from Gilgamesh, who came later.", 
   {}, 
   252299, 
   null, 
   1172376060.0
  ], 
  [
   252326, 
   null, 
   "obvious_child", 
   "Your arrogance knows no limits.\n\n \n Arrogance: Education, Knowledge, Critical Thinking, Research Skills, Basic Math, Comparison Capabilities... \n \n \nWe have it on no less of an authority than Jesus Christ himself (who is God), where he referred to the \"days of Noah.\"\n\n \n We have tablets of Gilgamesh that existed before the Israelites. How do you deal with this problem? \n \n \nThere were only eight people on that ark, and I seriously doubt any of them were tablet inscribers from Gilgamesh, who came later.\n\n \n So you're saying that the tablets that predate the Israelites are in fact written by people who had magical time machines who wrote them after the Israelites and then warped them back in time?\n \n STAND UP COMEDY!\n \n Daewoo is very correct about you.\n \n \nYou see this in a lot of people that insist on a strict, literal interpetation of the bible. They have to will themselves ignorant when it comes to most of history and all of science or their (ludicrous) views can not exist.\n", 
   {}, 
   252325, 
   null, 
   1172376300.0
  ], 
  [
   252331, 
   null, 
   "ShadowPikachu", 
   "Hardly. There are litterally thousands of flood beliefs in this world. What creationists omit is that very, very, very few of these stories have any similarities outside of water. Just because alot of cultures had a flood story doesn't mean a global flood happened. Chinese flood stories bare no resembles at all to the flood of Genesis. \n \n\n \n Exactly. Most of them are not even close to the Noah myth. \n \n If you really think about it, it wouldn't make any sense if there were no flood myths around the world. Pretty much any place (culture) is in an area that can experience floods. The very large ones that devestate their area are eventually blown out of proportion (like the Noah's flood myth). I'd expect there might be even more myths in areas that are deserts which receive occasional large amounts of rainfall causing extreme flooding out of the ordinary for the inhabitants. I'd also expect places along coasts prone to hurricanes (even better, tsunamis like the one in December '04, or some of the \"mega-tsunamis\" like those there are evidence for across the world) to have more flood myths as well.\n \n I definately agree that the whole Gilgamesh thing was around quite a while before the Israelites first existed.", 
   {}, 
   252320, 
   null, 
   1172377200.0
  ], 
  [
   252334, 
   null, 
   "obvious_child", 
   "I definately agree that the whole Gilgamesh thing was around quite a while before the Israelites first existed.\n\n \n Given its exact steps, not to mention Enuma Elisha's exact steps, and the fact that I've had significent religious comparsion schooling, I believe that the Noah flood is nothing more then a adoption by Israelites of a long standing belief. \n \n Frankly, genesis is nothing more then a story to explain to ignorant, nomadic Israelites of how the world started. It's suppose to be simple, these people don't know jack about science and quite frankly, are concerned with two things: Finding their next meal and not being killed/enslaved by Egyptians. Telling them how it actually happened would be beyond futile.", 
   {}, 
   252331, 
   null, 
   1172377560.0
  ], 
  [
   252341, 
   null, 
   "Easyrider", 
   " We have tablets of Gilgamesh that existed before the Israelites. How do you deal with this problem? \n\n \n If you knew anything about Bible history, you would know that Noah lived long before the Israelites, who were called that after Jacob was named Israel. Of course Jacob was a descendant of Noah, as were your Gilgamesh writers. Get the picture?\n \n \n \n \n So you're saying that the tablets that predate the Israelites are in fact written by people who had magical time machines who wrote them after the Israelites and then warped them back in time?\n \n STAND UP COMEDY!\n \n Daewoo is very correct about you.\n\n \n See above. No time machine is necessary, just some common sense for a change on your part.", 
   {}, 
   252326, 
   null, 
   1172383260.0
  ], 
  [
   252342, 
   null, 
   "Easyrider", 
   "\n \n I definately agree that the whole Gilgamesh thing was around quite a while before the Israelites first existed.\n\n \n If you knew anything about Bible history, you would know that Noah lived long before the Israelites, who were called that after Jacob was named Israel. Of course Jacob was a descendant of Noah, as were your Gilgamesh writers.", 
   {}, 
   252331, 
   null, 
   1172383800.0
  ], 
  [
   252346, 
   null, 
   "obvious_child", 
   "If you knew anything about Bible history, you would know that Noah lived long before the Israelites, who were called that after Jacob was named Israel. Of course Jacob was a descendant of Noah, as were your Gilgamesh writers. Get the picture?\n\n \n You run into another problem: There isn't a clear timeline within the bible itself to make such a distinction. Furthermore, the Torah is considered by many Jews to be written by Moses, who died around 1272 BCE. As the epic of Gilgamesh is dated several thousand years before that, you again run into a giant problem. \n \n \nSee above. No time machine is necessary, just some common sense for a change on your part.\n\n \n Do you even know what the Epic of Gilgamesh is about?", 
   {}, 
   252341, 
   null, 
   1172385240.0
  ], 
  [
   252367, 
   null, 
   "Easyrider", 
   " You run into another problem: There isn't a clear timeline within the bible itself to make such a distinction.\n\n \n Well, we have Noah and his family getting off the Ark after the great flood. But no mention of Gilgamesh writers. They obviously weren't born yet.\n \n \n\n Furthermore, the Torah is considered by many Jews to be written by Moses, who died around 1272 BCE. As the epic of Gilgamesh is dated several thousand years before that, you again run into a giant problem.\n\n \n No, you do. It was inspired by God, who obviously knows more about all that than you do. \n \n \n\n \n Do you even know what the Epic of Gilgamesh is about?\n\n \n Oh yeah. Do you know anything about divine revelation?", 
   {}, 
   252346, 
   null, 
   1172419080.0
  ], 
  [
   252382, 
   null, 
   "Ripskar", 
   "We have no record of the Aztecs getting off the Mayflower, they obviously wasn't born yet!emoticon_xdonno", 
   {}, 
   252367, 
   null, 
   1172432940.0
  ], 
  [
   252383, 
   null, 
   "ShadowPikachu", 
   "We have no record of the Aztecs getting off the Mayflower, they obviously wasn't born yet!emoticon_xdonno\n\n \n emoticon_xgood LOL. That's really the basics of EZ's logic. Pretty sad, isn't it?", 
   {}, 
   252382, 
   null, 
   1172433240.0
  ], 
  [
   252438, 
   null, 
   "jyoshu", 
   "Gilgamesh was a oral story for significent part of its existance and was only written down much later. \n\n \n Then that only muddies the whole thing even more so. We know that much LESS which came first.\n \n \nThe bigger point is, we have evidence that the Epic was around before the Israelites, who later turned into the Jews.\n\n \n No, we have found tablets that existed before the Israelites, as a settled nation. That doesn't automatically mean the Gilgamesh epic was earlier than the Noah story, or that the Noah account wasn't around long earlier.\n \n \nSo without anyone to carry around a oral jewish tradition, there's not much of argument now is there? The most complete version of Gilgamesh is from the 7th century BC library of a old ruler, while Gilgamesh himself is believed to be living somewhere around the 3rd millennium BC. I'm pretty damn sure that's before any Israelites were walking around.\n\n \n Why on earth do you think that matters??? \"Israelites\" weren't around in the Noah story either! The question isn't whether \"Israelites\" were around; the question is whether or not the Noah story was around! (which is in not way dependent on whether Israel was an organized cuture/nation yet.) What you don't seem to understand is that just because one account was found to be early doesn't mean the other was automatically LATER. Semitic people moved around a lot--the Noah account very well could have originated elsewhere. You seem intent on tying it to the area, but with Semitic people of the time, that's unrealistic.\n \n \nThere are litterally thousands of flood beliefs in this world.\n\n \n Er, I think I just said that.\n \n \nWhat creationists omit is that very, very, very few of these stories have any similarities outside of water. Just because alot of cultures had a flood story doesn't mean a global flood happened.\n\n \n Irrelevant--I never said they were that similar. You're jumping to conclusions here; I'm not arguing for the legitimacy of a global flood here; I'm trying to get you to realize that we really can't KNOW for sure if the Gilgamesh epic predates the Noah account.\n \n \nIf there are no people speaking hebrew at the time of the oldest dated story, there's no argument ... \n\n \n Your premise is based on the idea that the Noah story had to have started out in Hebrew. You don't know that. The only thing we have to tie it to Hebrew is what we have of it written down, and since it very well could have existed in oral tradition much earlier, who knows? Again you're pitting oral tradition against written, here. You have to realize that Genesis is probably a compilation of various stories that were going on for awhile. Anyone who says they KNOW the Gilgamesh epic is older than the Noah epic is either lying, kidding themselves, or misrepresenting the situation. It MAY be older, but the only thing we KNOW is that what we have FOUND is older. For all we know the Noah story, in oral form being passed down, may predate the \"Israelites\" as well. There are just too many unanswered questions.", 
   {}, 
   252320, 
   null, 
   1172462580.0
  ], 
  [
   252456, 
   null, 
   "obvious_child", 
   "Then that only muddies the whole thing even more so. We know that much LESS which came first.\n\n \n Not really. We know the oldest version of the tablets existed before the Israelites. As the tradition existed well before the tablets in a oral tradition it seems somewhat logical that it would be older. If the tablets that recorded the oral tradition are older then the earliest records of the Israelites, why we are even discussing this? \n \n \nNo, we have found tablets that existed before the Israelites, as a settled nation. That doesn't automatically mean the Gilgamesh epic was earlier than the Noah story, or that the Noah account wasn't around long earlier.\n\n \n Israelites is a term for the nomadic people that turned into the Jewish Tribes which eventually turned into the Kingdoms of Israel. You're confusing Jews with Israelites. Not the same thing. \n \n \nWhy on earth do you think that matters??? \"Israelites\" weren't around in the Noah story either! The question isn't whether \"Israelites\" were around; the question is whether or not the Noah story was around!\n\n \n My point is that the Israelites adopted a story from another culture about the flood. If the Israelites didn't exist before Gilgamesh was recorded, that would suggest that they didn't come up with the flood story but adopted it. \n \n \nWhat you don't seem to understand is that just because one account was found to be early doesn't mean the other was automatically LATER.\n\n \n What you don't seem to understand is that if one account is found to be dated before any evidence of the existance of another group who believed something similar, that is it very likely that the first account is older. \n \n \nSemitic people moved around a lot--the Noah account very well could have originated elsewhere. You seem intent on tying it to the area, but with Semitic people of the time, that's unrealistic.\n\n \n Considering that that is the only area in the world that has such a flood story, it would seem logical to tie the argument there. I already commented that your statement on thousands of flood stories share virtually nothing in common. The first recorded tablets of the flood came from region above where the Akkadian Empire existed. Then the second batch of findings was in the Akkadian. Then the third batch was in Palestian. As we know there was extensive trade between the regions, logically we can point out as time progresses that the story traveled with the trade routes from its origin to Palestian where it was adopted by the Israelites who put it into the Torah. \n \n \nIrrelevant--I never said they were that similar.\n\n \n It was implied, and your statement was identical to creationists arguments that argue the flood was true. \n \n \nI'm trying to get you to realize that we really can't KNOW for sure if the Gilgamesh epic predates the Noah account.\n\n \n We can't know anything for sure from quantum physics to our own existance. What we can look at is the historical data and make conclusions and that data would suggest that the flood story moved down into Palestian and was adopted by the Israelites. Not that the Israelites came up with it. \n \n \nYour premise is based on the idea that the Noah story had to have started out in Hebrew.\n\n \n No, my premise is the idea that the flood story started out in whatever dilect was spoken in what today is Northern Iraq, North West Iran, South East Turkey and North East Syria. \n \n \nYou don't know that.\n\n \n We don't know anything. Stop using the skeptic argument. \n \n \nThe only thing we have to tie it to Hebrew is what we have of it written down, and since it very well could have existed in oral tradition much earlier, who knows?\n\n \n It also could have existed for thousands of years prior to being written down on the tablets in oral form as well. The empire in which Gilgamesh was found existed well before any existance of the Israelites. How you keep thinking that such data is irrevelant is borderline delusional. \n \n \nAgain you're pitting oral tradition against written, here.\n\n \n No, I'm pitting a old oral tradition that was later transfered to tablet aganist another oral and written tradition. What you seem to be deliberately ignoring is where recorded information was found, the travel and trade patterns and the fact that the oldest tablets existed before any evidence of the israelites. If someone does not exist, can they have a tradition older then themselves?\n \n Why can't you see this? Unlike EZ, you're not a idiot.\n \n \nYou have to realize that Genesis is probably a compilation of various stories that were going on for awhile.\n\n \n That's my subtle point.\n \n \nAnyone who says they KNOW the Gilgamesh epic is older than the Noah epic is either lying, kidding themselves, or misrepresenting the situation. It MAY be older, but the only thing we KNOW is that what we have FOUND is older. For all we know the Noah story, in oral form being passed down, may predate the \"Israelites\" as well. There are just too many unanswered questions.\n\n \n It bothers me you rely almost entirely upon the skeptic's argument in order to avoid discussing historical matters. \n \n We cannot 'know' anything for sure. What we can do is look at the data, I'm trying, you're clearly trying to avoid just that.", 
   {}, 
   252438, 
   null, 
   1172468280.0
  ], 
  [
   252511, 
   null, 
   "jyoshu", 
   "Not really. We know the oldest version of the tablets existed before the Israelites. As the tradition existed well before the tablets in a oral tradition it seems somewhat logical that it would be older. If the tablets that recorded the oral tradition are older then the earliest records of the Israelites, why we are even discussing this? \n\n \n Because when you are talking about something in antiquity and oral tradition, it is not so cut and dry as dealing with modern, recorded history. \n \n \nIsraelites is a term for the nomadic people that turned into the Jewish Tribes which eventually turned into the Kingdoms of Israel. You're confusing Jews with Israelites. Not the same thing. \n\n \n It doesn't matter, the story may still be older than that.\n \n \nMy point is that the Israelites adopted a story from another culture about the flood. If the Israelites didn't exist before Gilgamesh was recorded, that would suggest that they didn't come up with the flood story but adopted it. \n\n \n That's a theory, but it's certainly not a given. The Israelites (as a nomadic people) may very well HAVE existed at the time of Gilgamesh's 'recording.'\n \n \nWe don't know anything. Stop using the skeptic argument. \n \n It bothers me you rely almost entirely upon the skeptic's argument in order to avoid discussing historical matters. \n \n We cannot 'know' anything for sure. What we can do is look at the data, I'm trying, you're clearly trying to avoid just that.\n\n \n But particularly we can't know THIS, because it's a matter of antiquity and before recorded history. This is much more than just the same sort of 'skeptics argument' that could be applied to anything. It may indeed 'bother' you, but when you are dealing with ancient history, it always needs to be approached from the standpoint that there are no givens with things like this. You want to brush this off as irrelevant calling it the \"skeptics argument\" but you CAN'T deal with antiquity without it. When you're using your point to try to disprove something, you just can't state as fact what you don't know to be fact. I'm more than willing to discuss historical matters, I just am not willing to go along with you that we know for a fact that Gilgamesh came earlier. We don't. When people such as yourself sometimes try to use this to disprove the legitimacy of the Noah story, the \"skeptics argument\" becomes very relevant. Unless we were able to have proof about a oral tradition (which is basically impossible) we'll never really know for CERTAIN which came first.", 
   {}, 
   252456, 
   null, 
   1172506260.0
  ], 
  [
   252522, 
   null, 
   "Master_Shake", 
   "Wow, I think yall made it two whole pages beore talking about chemistry and Gilgamesh! I'm so proud of you!! ;)", 
   {}, 
   252511, 
   null, 
   1172513100.0
  ], 
  [
   252567, 
   null, 
   "obvious_child", 
   "Because when you are talking about something in antiquity and oral tradition, it is not so cut and dry as dealing with modern, recorded history.\n\n \n Perhaps, but Jewish scholars believe that the Torah, where the Noahic epic is first found in its monotheistic form was written by Moses as revealed by Yaweh. As Moses was born long after the dating of some of the tablets we run into a problem. Oral tradition or not, if the guy who wrote the Torah as revealed by the Jewish God didn't exist before the existance of the Gilgamesh tablets, well, that's pretty much open shut.\n \n \nit doesn't matter, the story may still be older than that.\n\n \n That kind is my point. The noahic version is merely a rewritting of a older story. My fundemental point here is that the Noahic Story is not of origin of the Israelites despite the desires of Fundemnetalist Christians and Ultra Conservative Jewish Scholars. I think that both of us can agree to that. \n \n \nThat's a theory, but it's certainly not a given. The Israelites (as a nomadic people) may very well HAVE existed at the time of Gilgamesh's 'recording.'\n\n \n We can say anyone could have existed at any time because we cannot prove anything. :xbanghead \n \n \nWhen people such as yourself sometimes try to use this to disprove the legitimacy of the Noah story\n\n \n The Flood story is false independent of human history. There are enough scientific problems with it in the fossil record and basic chemistry to prove it's bull. I'm not arguing that it's false here (there are other threads for that), merely that it is not of Israelite origin.\n \n \nUnless we were able to have proof about a oral tradition (which is basically impossible) we'll never really know for CERTAIN which came first.\n\n \n The skeptic's argument is deny all truth and all evidence. That is essentially what you are doing.", 
   {}, 
   252511, 
   null, 
   1172535000.0
  ], 
  [
   252666, 
   null, 
   "ShadowPikachu", 
   "\n That's a theory, but it's certainly not a given. The Israelites (as a nomadic people) may very well HAVE existed at the time of Gilgamesh's 'recording.'\n \n\n \n Well, we don't know if the Nazis existed during that time - it's a theory that they didn't but it's certainly not a given. The Nazis may very well HAVE existed at the time of Gilgamesh's recording. emoticon_rolleyes emoticon_rolleyesemoticon_xdonno \n Give it up, Jyoshu.", 
   {}, 
   252511, 
   null, 
   1172603220.0
  ], 
  [
   252960, 
   null, 
   "jyoshu", 
   "Perhaps, but Jewish scholars believe that the Torah, where the Noahic epic is first found in its monotheistic form was written by Moses as revealed by Yaweh. As Moses was born long after the dating of some of the tablets we run into a problem. Oral tradition or not, if the guy who wrote the Torah as revealed by the Jewish God didn't exist before the existance of the Gilgamesh tablets, well, that's pretty much open shut.\n\n \n The issue of whether Moses write the Pentateuch is independent of whether the Noah story goes farther back. Moses may not have written/compiled the 1st 5 books, or he may. He may have written the Noahic account from the oral account--more than likely he did. he wouldn't have had to exist before then.\n \n \nThat kind is my point. The noahic version is merely a rewritting of a older story. My fundemental point here is that the Noahic Story is not of origin of the Israelites despite the desires of Fundemnetalist Christians and Ultra Conservative Jewish Scholars. I think that both of us can agree to that. \n\n \n No, we can't. We don't know if the Noah account was a rewriting of an earlier account or not--we have no idea how far back the Noahic story goes in oral tradition. \n \n \nThe Flood story is false independent of human history. There are enough scientific problems with it in the fossil record and basic chemistry to prove it's bull. I'm not arguing that it's false here (there are other threads for that), merely that it is not of Israelite origin.\n\n \n I didn't mean 'legitimacy' in terms of the event actually having happened. I meant 'legitimacy' in the sense of it not being copied from an earlier story.\n \n \nThe skeptic's argument is deny all truth and all evidence. That is essentially what you are doing.\n\n \n how could I be denying truth and evidence that's not there to begin with? If you were able to really PROVE that the Gilgamesh epic came first this would be totally different. But you can't. All you can prove is that what has been found (in terms of tablets) is older. \n \n \nWell, we don't know if the Nazis existed during that time - it's a theory that they didn't but it's certainly not a given. The Nazis may very well HAVE existed at the time of Gilgamesh's recording.\n Give it up, Jyoshu.\n\n \n Give it up yourself. This \"analogy\" is, well, pretty ridiculous on your part. We're discussing ancient history that is in large part dependent on oral tradition, not modern recorded history which can be verified even by people still alive today. If you think ancient history that far back is so cut and dry that you can know for certain an account didn't exist orally long before it was written (during a time of oral tradition), you should be presenting your views and your reasons to every historical journal there is. You're talking in terms of abandoning some pretty darn fundamental understanding in terms of the way ancient history worked.", 
   {}, 
   252567, 
   null, 
   1172771100.0
  ], 
  [
   252991, 
   null, 
   "obvious_child", 
   "The issue of whether Moses write the Pentateuch is independent of whether the Noah story goes farther back. Moses may not have written/compiled the 1st 5 books, or he may. He may have written the Noahic account from the oral account--more than likely he did. he wouldn't have had to exist before then.\n\n \n Depends how and if you accept the Jewish Scholar's view on the Torah. If you follow their arguments, Yaweh divined the Torah to Moses. Therefore the Noahic story was God, not from a previous oral tradition. This, if true, therefore means three very similar flood stories inhabited the same region, two of them predating the Divinic revelation one. Granted this may have actually happened, and we're arguing something very moot. But that would require proof of Yaweh and we can't do that. \n \n \nNo, we can't. We don't know if the Noah account was a rewriting of an earlier account or not--we have no idea how far back the Noahic story goes in oral tradition.\n\n \n Or if goes back at all. Alright, let's assume the Israelite nomads had the first flood story. Given how they travelled huge areas, why do we have no records of such similar stories in those areas? If it was a truly old oral tradition, it would have difussed into the areas they wandered and eventually would have been recorded. Israelites were often slaves to other civilizations. Why do we have no records of the oral traditions from those civilizations? We are dealing with a alleged old oral tradition that left no mark anywhere else but the Torah despite huge diasporas of Isralites all over the region. This seem hugely suspicious. Granted, I'll give you we cannot know for certain (or anything) but given the historical evidence, there's not alot of crediblity towards the idea the Noah version was the first version.\n \n \nBut you can't. All you can prove is that what has been found (in terms of tablets) is older.\n\n \n But given the lack of any evidence that the oral tradition by the Israelites was indeed older, it does seem likely. Israelites were everywhere in the area. Why is there no record of this tradition, especially in civilizations like Early Egypt and Babyloan which wrote huge amounts of things about what they did down?", 
   {}, 
   252960, 
   null, 
   1172791140.0
  ], 
  [
   253034, 
   null, 
   "peteratwar", 
   "Wonderful how arguments can develop about events which happened probably in the dawn of history remembered as folk memories but about which there is no precise knowledge.\n \n So you argue about something of which you have no direct knowledge with evidence (?) which at the least is uncertain.\n \n One can only say that oral/folk traditions may get distorted over the millenia but usually recall some catastrophic event. You then distort this by citing records which were themselves probably written millenia or centuries after the event using dating ideas which are no more than theories.\n \n Mind you it would be lovely to know what really happened", 
   {}, 
   252991, 
   null, 
   1172841480.0
  ], 
  [
   253051, 
   null, 
   "ShadowPikachu", 
   "Wonderful how arguments can develop about events which happened probably in the dawn of history remembered as folk memories but about which there is no precise knowledge.\n \n So you argue about something of which you have no direct knowledge with evidence (?) which at the least is uncertain.\n \n One can only say that oral/folk traditions may get distorted over the millenia but usually recall some catastrophic event. You then distort this by citing records which were themselves probably written millenia or centuries after the event using dating ideas which are no more than theories.\n \n Mind you it would be lovely to know what really happened\n\n \n Ever heard of the good old \"I caught a fish this big\" story, and others similar to it? That's what happened here. It is perfectly logical to assume that someone witnessed a large flood, and over time it all got blown out of proportion and became the ludicroud claim of the entire world flooding and a man making a boat (which is pretty much incapable of actually floating and surviving a flood) and carrying two of every animal. With each telling of a story, things are changed and added and exaggerated - that's just common sense.", 
   {}, 
   253034, 
   null, 
   1172859180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution Back in Kansas Schools", 
  "url": "http://www.4forums.com/political/current-events-debates/9562-evolution-back-kansas-schools.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 9562, 
  "discussion_files": [
   [
    "6152.html", 
    "http://www.4forums.com/political/current-events-debates/9562-evolution-back-kansas-schools-print.html"
   ], 
   [
    "6153.html", 
    "http://www.4forums.com/political/current-events-debates/9562-evolution-back-kansas-schools-5-print.html"
   ], 
   [
    "6154.html", 
    "http://www.4forums.com/political/current-events-debates/9562-evolution-back-kansas-schools-4-print.html"
   ], 
   [
    "6155.html", 
    "http://www.4forums.com/political/current-events-debates/9562-evolution-back-kansas-schools-3-print.html"
   ], 
   [
    "6156.html", 
    "http://www.4forums.com/political/current-events-debates/9562-evolution-back-kansas-schools-2-print.html"
   ]
  ], 
  "identifier": 9562
 }
]