[
 [
  [
   251050, 
   null, 
   "simone", 
   "According to some sources there are three versions of the Ten Commandments in the Old Testament, in Exodus 20, Exodus 34 and Deuteronomy 5.\n \n I shall post the two different versions from Exodus 20 and Deuteronomy 5 but omit Exodus 34 since that version, if it is a version, deviates greatly from the other two. All, I believe, are King James version.\n \n First, from Exodus 20:1-27:\n \n \nAnd God spake all these words, saying:\n \n I. I [am] the LORD thy God, which have brought thee out of the land of Egypt, out of the house of bondage: Thou shalt have no other gods before me.\n \n II. Thou shalt not make unto thee any graven image, or any likeness [of any thing] that [is] in heaven above, or that [is] in the earth beneath, or that [is] in the water under the earth: Thou shalt not bow down thyself to them, nor serve them: for I the LORD thy God [am] a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth [generation] of them that hate me; And shewing mercy unto thousands of them that love me, and keep my commandments.\n \n III. Thou shalt not take the name of the LORD thy God in vain; for the LORD will not hold him guiltless that taketh his name in vain.\n \n IV. Remember the sabbath day, to keep it holy. Six days shalt thou labour, and do all thy work: But the seventh day [is] the sabbath of the LORD thy God: [in it] thou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thy stranger that [is] within thy gates: For [in] six days the LORD made heaven and earth, the sea, and all that in them [is], and rested the seventh day: wherefore the LORD blessed the sabbath day, and hallowed it.\n \n V. Honour thy father and thy mother: that thy days may be long upon the land which the LORD thy God giveth thee.\n \n VI. Thou shalt not kill.\n \n VII. Thou shalt not commit adultery.\n \n VIII. Thou shalt not steal.\n \n IX. Thou shalt not bear false witness against thy neighbour.\n \n X. Thou shalt not covet thy neighbour's house, thou shalt not covet thy neighbour's wife, nor his manservant, nor his maidservant, nor his ox, nor his XXX, nor any thing that [is] thy neighbour's.\n\n I have added the Roman numerals and combined several verses where necessary to comprise a particular commandment.", 
   {
    "post_info": {
     "post_title": "The Ten Commandments"
    }
   }, 
   null, 
   null, 
   1171571520.0
  ], 
  [
   251051, 
   null, 
   "simone", 
   "Deuteronomy 5:6-21:\n \n \nI. I am the LORD thy God, which brought thee out of the land of Egypt, from the house of bondage. Thou shalt have none other gods before me.\n \n II. Thou shalt not make thee any graven image, or any likeness of any thing that is in heaven above, or that is in the earth beneath, or that is in the waters beneath the earth: Thou shalt not bow down thyself unto them, nor serve them: for I the LORD thy God am a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth generation of them that hate me, And shewing mercy unto thousands of them that love me and keep my commandments.\n \n III. Thou shalt not take the name of the LORD thy God in vain: for the LORD will not hold him guiltless that taketh his name in vain.\n \n IV. Keep the sabbath day to sanctify it, as the LORD thy God hath commanded thee. Six days thou shalt labour, and do all thy work: But the seventh day is the sabbath of the LORD thy God: in it thou shalt not do any work, thou, nor thy son, nor thy daughter, nor thy manservant, nor thy maidservant, nor thine ox, nor thine XXX, nor any of thy cattle, nor thy stranger that is within thy gates; that thy manservant and thy maidservant may rest as well as thou. And remember that thou wast a servant in the land of Egypt, and that the LORD thy God brought thee out thence through a mighty hand and by a stretched out arm: therefore the LORD thy God commanded thee to keep the sabbath day.\n \n V. Honour thy father and thy mother, as the LORD thy God hath commanded thee; that thy days may be prolonged, and that it may go well with thee, in the land which the LORD thy God giveth thee.\n \n VI. Thou shalt not kill.\n \n VII. Neither shalt thou commit adultery.\n \n VIII. Neither shalt thou steal.\n \n IX. Neither shalt thou bear false witness against thy neighbour.\n \n X. Neither shalt thou desire thy neighbour's wife, neither shalt thou covet thy neighbour's house, his field, or his manservant, or his maidservant, his ox, or his XXX, or any thing that is thy neighbour's.\n\n I added the Roman numerals. Other editing was minimal. I learned, essentially, this version, in Evangelical Lutheran Sunday school, although Commandments II, IV and X were considerably shorter.", 
   {}, 
   251050, 
   null, 
   1171571700.0
  ], 
  [
   251052, 
   null, 
   "simone", 
   "I'd be very interested to know what version of the Ten Commandments was inscribed on the controversial stone monument of Judge Roy Moore in Alabama.", 
   {}, 
   251051, 
   null, 
   1171571880.0
  ], 
  [
   251068, 
   null, 
   "smiley", 
   "And don't forget the version of the Ten Commandments that was included in the 1632 edition of the Bible which included, \"thou shalt commit adultery\".\n \n How embarrassing . . . \n \n This version was nicknamed the 'Wicked BIble'.\n \n Smileyemoticon_xangel", 
   {}, 
   251052, 
   null, 
   1171582200.0
  ], 
  [
   251078, 
   null, 
   "Master_Shake", 
   "And don't forget the version of the Ten Commandments that was included in the 1632 edition of the Bible which included, \"thou shalt commit adultery\".\n \n How embarrassing . . . \n \n This version was nicknamed the 'Wicked BIble'.\n \n Smileyemoticon_xangel\n\n Oooh, I want a copy of that bible! ;)", 
   {}, 
   251068, 
   null, 
   1171583520.0
  ], 
  [
   251256, 
   null, 
   "Jim Colyer", 
   "It was funny when Woody Allen asked Billy Graham what his favorite Commandment was.", 
   {}, 
   251078, 
   null, 
   1171688640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Ten Commandments", 
  "url": "http://www.4forums.com/political/religion-debates/9563-ten-commandments.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9563, 
  "discussion_files": [
   [
    "20924.html", 
    "http://www.4forums.com/political/religion-debates/9563-ten-commandments-print.html"
   ]
  ], 
  "identifier": 9563
 }
]