[
 [
  [
   251257, 
   null, 
   "Jim Colyer", 
   "I wrestle with the question of whether or not there is a God. It seems like I can prove it both ways and disprove it both ways. Does the universe need a creator to exist? Or is this just an idea inside man-made theology? Man yearns for the eternal. He wants to live forever and be strong forever. He is the only animal as far as we know which builds churches and contemplates the infinite. This in itself may be an indication that immortality resides in a soul of some kind. If there is truth in religion, I accept the premises of the New Testament.\n \n Jim Colyer\n http://www.jimcolyer.com", 
   {
    "post_info": {
     "post_title": "Does God exist?"
    }
   }, 
   null, 
   null, 
   1171688700.0
  ], 
  [
   251258, 
   null, 
   "l33t", 
   "Hmph... I cannot argue the existence of God from an ethical point of view, but I can very well endeavor an explaination from a circumstantial one. \n \n Every religion has its own perception of God; or (solely in my opinion), its own story which developed somewhere along the way. We started out as an uneducated primitive specie; the human race did not have the knowledge - the scientific knowledge - to explain the world around them. I think that God, although I have previously had towering experiences not explainable by science, is just a mere creation of human mind. God is for man's own sake and satisfaction; giving a man purpose and light into the future. \n \n Man most often forgets the purpose of life itself by zelously attempting to find the meaning of God. In the end, we all die and are relieved of all connections to God. What purpose does God serve then? (yes, I do not believe in afterlife). Holy Books tell the story of God, God is the story itself, we are the readers of this ingenious fiction. Lets not blame our predecessors, they simply didn't have the tools. :)", 
   {
    "post_info": {
     "post_title": "My opinion - not a claim!"
    }
   }, 
   251257, 
   null, 
   1171690800.0
  ], 
  [
   251317, 
   null, 
   "johnhanks", 
   "I wrestle with the question of whether or not there is a God. It seems like I can prove it both ways and disprove it both ways. Does the universe need a creator to exist?\n\n If the universe needs a creator to exist, why doesn't the creator?", 
   {}, 
   251257, 
   null, 
   1171712220.0
  ], 
  [
   251341, 
   null, 
   "Shooterandproud", 
   "The idea of the Christian God seems illogical. It seems hard to believe that theres a guy up there playing little games with us, saying \"If you don't do everything I say, you'll burn in hell for eternity\". It also seems hard to believe that he is so anthropomorphized. I've read the Christian bible. God seems too much like a man. The way he thinks, how he acts. Why would this God have a desire to force his morals on us, and punish us if we don't abide by them? That sounds like something man would do, the desire to reward and punish. Not a God. And furthermore, why would he rely on our \"faith\" if he has given us no solid evidence of his existence? We don't know any better, he hasn't shown us anything except a 2000 year old book written by 4 ancient men that, for all we know, could be a complete fib. I'm sort of agnostic, however the only evidence of a God I can see, is everything around us. Where did it come from? From a scientific standpoint, Lavoisier's law of conservation of mass and energy states that matter and energy can't be created nor destroyed. The big bang did happen, theres no question about that. But, who created the big bang?\n \n It would logically be a God or another life form that we are unaware of. And even if it was another life form that created the universe as we know it, who created them?\n \n My conclusion, is that there is obviously no Christian God, or Judge God that uses man as his plaything, thats obviously mythology. However, it would seem logical to conclude that there is a higher power somewhere out there. However, I highly doubt it cares about the behaviors of man. It is not for me to ponder, and my philosophy is to just make the best of your life.\n \n The afterlife is a whole different story, but I'm probably boring you people, so I'll stop here.", 
   {}, 
   251317, 
   null, 
   1171742760.0
  ], 
  [
   251378, 
   null, 
   "Ripskar", 
   "Why do you accept the premises of the NT?\n Why on earth would you accept the claims of the Jews over those of anyone else on the planet when there is nothing to distinguish them?", 
   {}, 
   251257, 
   null, 
   1171752480.0
  ], 
  [
   251451, 
   null, 
   "Easyrider", 
   "The Reliability of the New Testament\n \n http://www.biblicaldefense.org/Writings/new_testament_reliability.htm\n \n Historical Jesus (Excellent!)\n \n http://www.sundayschoolcourses.com/histjesu/histjesu.htm", 
   {}, 
   251378, 
   null, 
   1171772700.0
  ], 
  [
   251495, 
   null, 
   "Easyrider", 
   "This is \"A chapter from his doctoral dissertation\".\n Hah!\n A doctoral dissertation in what?\n From the \"Institute of Biblical Defense\", please!\n Sounds like a doctorate in finger painting - peer review is from the choir...\n\n \n Beats the dickens out of the rubbish you put forth around here.", 
   {}, 
   251451, 
   null, 
   1171810320.0
  ], 
  [
   251506, 
   null, 
   "simone", 
   "I don't know and I don't care.\n \n The evidence, however, indicates no god.", 
   {}, 
   251495, 
   null, 
   1171818240.0
  ], 
  [
   251537, 
   null, 
   "Shooterandproud", 
   "Why do you accept the premises of the NT?\n Why on earth would you accept the claims of the Jews over those of anyone else on the planet when there is nothing to distinguish them?\n\n \n The OT and the NT are no different. God doesn't change his mind, I'm sorry. No matter how much you want to try to dance around this question, the only explanation is that one of them is wrong, or both are wrong.", 
   {}, 
   251378, 
   null, 
   1171839900.0
  ], 
  [
   251540, 
   null, 
   "smiley", 
   "I have to agree, shooter. There has been a lot of talk in another thread about how the laws set out in the old testiment are changed in the new (such as not getting your hair cut).\n \n However, according to the Bible (which is of course 100% accurate) . . . \n \n Matthew 5:17-20\n \n 17 Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. 18 For truly, I say to you, until heaven and earth pass away, not an iota, not a dot, will pass from the Law until all is accomplished. 19 Therefore whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven, but whoever does them and teaches them will be called great in the kingdom of heaven. 20 For I tell you, unless your righteousness exceeds that of the scribes and Pharisees, you will never enter the kingdom of heaven.\n \n So why have we a abandoned so much of the old testiment law? Stop eating pork, cutting your hair, shaving your beard (especially you girls), unless of course you just wish to adhere to those laws that are convenient.\n \n Luckily, I don't believe the Bible to be the word of God, so it's roast pork for dinner.\n \n Smiley", 
   {}, 
   251537, 
   null, 
   1171841640.0
  ], 
  [
   251546, 
   null, 
   "jyoshu", 
   "So why have we a abandoned so much of the old testiment law? Stop eating pork, cutting your hair, shaving your beard (especially you girls)\n\n \n For Christians? Quite simply, because that's what Christ decided was important. He tremendously changed the way the law is to be viewed.", 
   {}, 
   251540, 
   null, 
   1171843140.0
  ], 
  [
   251547, 
   null, 
   "smiley", 
   "For Christians? Quite simply, because that's what Christ decided was important. He tremendously changed the way the law is to be viewed.\n\n \n So, in the quote I gave he was lying?", 
   {}, 
   251546, 
   null, 
   1171843560.0
  ], 
  [
   251548, 
   null, 
   "jyoshu", 
   "So, in the quote I gave he was lying?\n\n \n You have to take the quote in the context of the overall sermon it was given in. Taking single passages out of overall context is never a good way to do Bible study or to understand it. Doing what you're doing is like taking the first statement a speaker gives to an audience to start things off, while ignoring the entire rest of the speech that explains what is meant by that statement.", 
   {}, 
   251547, 
   null, 
   1171844220.0
  ], 
  [
   251569, 
   null, 
   "smiley", 
   "Then perhaps you could enlighten us all as to what he meant when he said that he was not there to abolish the law or the prophets, but to fulfil them.  and that not an iota, not a dot, will pass from the law until all is accomplished.\n \n And just as a side note, a few verses later he 'says' this\n \n  31 It was also said, 'Whoever divorces his wife, let him give her a certificate of divorce.' 32 But I say to you that everyone who divorces his wife, except on the ground of sexual immorality, makes her commit adultery. And whoever marries a divorced woman commits adultery.\n \n Is this another law that has been conveniently abandoned?\n \n If you feel that I have taken these quotes out of context, please tell me how I should have taken them. If this is the 'Word of God' then surely we should not be interpreting it or just ignoring those parts that are inconvenient.\n \n Smiley", 
   {}, 
   251548, 
   null, 
   1171851000.0
  ], 
  [
   251572, 
   null, 
   "Easyrider", 
   " I have to agree, shooter. There has been a lot of talk in another thread about how the laws set out in the old testiment are changed in the new (such as not getting your hair cut).\n\n \n Which moral law was ever abandoned? Adultery is still adultery, murder is still murder, stealing is still stealing, etc.....\n \n \n So why have we a abandoned so much of the old testiment law? Stop eating pork, cutting your hair, shaving your beard (especially you girls), unless of course you just wish to adhere to those laws that are convenient.\n\n \n Well there's a new Covenant / Testament. But Jesus declared all foods clean so you can have your pork. Check for trichinellas, which is probably one reason it wasn't on God's preferred list in those unsanitary times.\n \n Recommended study for you: Investigate the different kinds of laws (i.e. moral, civil / tort, ceremonial, dietary). Then look at how these issues are treated in the NT.", 
   {}, 
   251540, 
   null, 
   1171851780.0
  ], 
  [
   251573, 
   null, 
   "electrolyte", 
   "Adultery is still adultery, murder is still murder, stealing is still stealing, etc.....\n\n But what is adultery?\n \n Mark 10:11:\n And he saith unto them, Whosoever shall put away his wife, and marry another, committeth adultery against her. And if a woman shall put away her husband, and be married to another, she committeth adultery.\n \n Matthew 19:9:\n And I say unto you, Whosoever shall put away his wife, except it be for fornication, and shall marry another, committeth adultery; and whoso marrieth her which is put away doth commit adultery. \n \n Strange that the gospels differ so importantly about what Jesus said in the same instance. According to Mark, all putting away is adultery, but Matthew says that her fornication provides for an out for him. Which is it?", 
   {}, 
   251572, 
   null, 
   1171852800.0
  ], 
  [
   251575, 
   null, 
   "Easyrider", 
   "Adultery and fornication are both sins. Don't try them. That's all I've got to say about that.", 
   {}, 
   251573, 
   null, 
   1171854000.0
  ], 
  [
   251578, 
   null, 
   "jyoshu", 
   "Then perhaps you could enlighten us all as to what he meant when he said that he was not there to abolish the law or the prophets, but to fulfil them.  and that not an iota, not a dot, will pass from the law until all is accomplished.\n\n \n I'll be glad to explain it to you, because this has been covered before already in these forums. FWIW, you don't represent \"all\" here.\n \n Jesus, in His coming, was the fulfillment of the law. That's whay he meant by saying he had come to fulfill the law. The reason the law had been around was to show people their need for a Savior. Now think about the rest of the Sermon on the Mount, because it's very important here. Jesus says things to the effect of, you have to never have a lustful thought, EVER, or else, that's basically adultery. You can't never be angry at someone else--it's really murder to do that. If your eye offends you, you are to gouge it out. Now do you really think Jesus wants us to gouge out our eyes??? Do you really think Jesus doesn't know that we will, at SOME point, get angry or have a lustful thought?\n \n The Sermon on the Mount was preached to show people that the real law--the sort of morality that God would require--is impossible. We can't measure up to it. When people look at the passage and think of it as just another group of rules, they miss the whole point. And when they take one verse out of it to prove something to the effect that the OT and NTs are the same (as you did), they miss the whole point. \n \n Now do you understand?\n \n \nAnd just as a side note, a few verses later he 'says' this\n \n  31 It was also said, 'Whoever divorces his wife, let him give her a certificate of divorce.' 32 But I say to you that everyone who divorces his wife, except on the ground of sexual immorality, makes her commit adultery. And whoever marries a divorced woman commits adultery.\n \n Is this another law that has been conveniently abandoned?\n\n \n But why stop there? Why not also note that, by getting angry at some point in your life, we ALL (including you) conveniently abandon the law? You're trying to misuse Jesus' words by using it as a means to an end to point out hypocrisy, and by doing that, you're missing the whole point of the sermon. Sad, really.", 
   {}, 
   251569, 
   null, 
   1171855200.0
  ], 
  [
   251581, 
   null, 
   "electrolyte", 
   "Adultery and fornication are both sins. Don't try them. That's all I've got to say about that.\n\n So you won't -- or possibly can't -- answer the question. Duly noted.", 
   {}, 
   251575, 
   null, 
   1171855740.0
  ], 
  [
   251582, 
   null, 
   "smiley", 
   "Now do you understand?\n\n \n Not entirely, but I shall dwell on it.\n \n Though it does appear that there is a lot of interpretation going on.", 
   {}, 
   251581, 
   null, 
   1171856040.0
  ], 
  [
   251583, 
   null, 
   "Easyrider", 
   "So you won't -- or possibly can't -- answer the question. Duly noted.\n\n \n Why suffer someone who is not really interested in learning? You don't really care about what Jesus or Matthew or Mark said about that or anything else. You think it's all garbage anyway, so what's the point?", 
   {}, 
   251581, 
   null, 
   1171856340.0
  ], 
  [
   251584, 
   null, 
   "ShadowPikachu", 
   "Why suffer someone who is not really interested in learning? You don't really care about what Jesus or Matthew or Mark said about that or anything else. You think it's all garbage anyway, so what's the point?\n\n \n Again, we have already noted that you won't (or can't) answer the question. You really don't have to keep repeating that fact to us.", 
   {}, 
   251583, 
   null, 
   1171856520.0
  ], 
  [
   251585, 
   null, 
   "Easyrider", 
   "Again, we have already noted that you won't (or can't) answer the question. You really don't have to keep repeating that fact to us.\n\n \n Try the principle that the Gospels accounts are complimentary, not either / or. That should take care of the both of you.", 
   {}, 
   251584, 
   null, 
   1171857780.0
  ], 
  [
   251589, 
   null, 
   "smiley", 
   "Try the principle that the Gospels accounts are complimentary, not either / or. That should take care of the both of you.\n\n Possibly, but it does tend to make a bit of a mockery of this\n \n \nJohn 14:26 - \"But the Counselor, the Holy Spirit, whom the Father will send in my name, will teach you all things and will remind you of everything I have said to you.\"\n\n Why would they have been told different things?\n \n Smiley", 
   {}, 
   251585, 
   null, 
   1171859100.0
  ], 
  [
   251590, 
   null, 
   "Easyrider", 
   "Possibly, but it does tend to make a bit of a mockery of this\n \n \n Why would they have been told different things?\n \n Smiley\n\n \n I don't know how different they were. Take it all in as complimentary and you should get a pretty well-rounded picture. Maybe that's what God intended to weed out the superficial pick-and-choosers of today instead of taking it all in.", 
   {}, 
   251589, 
   null, 
   1171859340.0
  ], 
  [
   251594, 
   null, 
   "smiley", 
   "I don't know how different they were. Take it all in as complimentary and you should get a pretty well-rounded picture. Maybe that's what God intended to weed out the superficial pick-and-choosers of today instead of taking it all in.\n\n Sounds like more interpreting to me. Why couldn't he have just made it clear for all us thickies?\n \n Smiley", 
   {}, 
   251590, 
   null, 
   1171859880.0
  ], 
  [
   251595, 
   null, 
   "electrolyte", 
   "You think it's all garbage anyway, so what's the point?\n\n The point is that you can't defend such garbage. One of them must be misquoting Jesus, yet the Bible is supposedly inerrant. The two statements are contradictory, yet you say that this contradiction is \"complimentary.\" That's like saying that two plus two is four and two plus two is five, and that the two expressions work together.\n \n If you'd like, I can get in touch with someone who would love to debate you on this topic.", 
   {}, 
   251583, 
   null, 
   1171860120.0
  ], 
  [
   251596, 
   null, 
   "ShadowPikachu", 
   "I don't know how different they were. Take it all in as complimentary and you should get a pretty well-rounded picture. Maybe that's what God intended to weed out the superficial pick-and-choosers of today instead of taking it all in.\n\n \n Or maybe, just maybe, these things called \"men\" wrote the Bible. And maybe these men might not be perfect. And maybe contradictions and such are common (maybe you've heard of the unreliablity of eyewitness acounts). And maybe since the bible was written by these men, it has errors, sometimes very large, and is subject to interpretation. \n \n Wow, that's a really farfetched account now, isn't it? emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes", 
   {}, 
   251590, 
   null, 
   1171860120.0
  ], 
  [
   251600, 
   null, 
   "Easyrider", 
   "Or maybe, just maybe, these things called \"men\" wrote the Bible. And maybe these men might not be perfect. And maybe contradictions and such are common (maybe you've heard of the unreliablity of eyewitness acounts). And maybe since the bible was written by these men, it has errors, sometimes very large, and is subject to interpretation. \n \n Wow, that's a really farfetched account now, isn't it? emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes\n\n \n You've got a lot of maybe's there, Shadow.", 
   {}, 
   251596, 
   null, 
   1171860300.0
  ], 
  [
   251601, 
   null, 
   "ShadowPikachu", 
   "You've got a lot of maybe's there, Shadow.\n\n \n Wow, sarcasm really falls on deaf ears around here when you are present, doesn't it? I don't think I've ever seen such a ridiculous response. Get real, EZ.", 
   {}, 
   251600, 
   null, 
   1171860540.0
  ], 
  [
   251602, 
   null, 
   "Easyrider", 
   " The point is that you can't defend such garbage. One of them must be misquoting Jesus, yet the Bible is supposedly inerrant. The two statements are contradictory, yet you say that this contradiction is \"complimentary.\" That's like saying that two plus two is four and two plus two is five, and that the two expressions work together.\n\n \n Nope. That's your spin.\n \n \n If you'd like, I can get in touch with someone who would love to debate you on this topic.\n\n \n Have them pray to God. He can help infidels see the light.", 
   {}, 
   251595, 
   null, 
   1171860540.0
  ], 
  [
   251616, 
   null, 
   "electrolyte", 
   "Get real, EZ.\n\n Hey, that's my line!", 
   {}, 
   251601, 
   null, 
   1171863720.0
  ], 
  [
   251617, 
   null, 
   "electrolyte", 
   "Have them pray to God. He can help infidels see the light.\n\n He was raised a Christian. His father was a preacher. He used to teach Sunday School. God had more than enough opportunity. It was learning so much about the Bible that made him disbelieve.", 
   {}, 
   251602, 
   null, 
   1171863840.0
  ], 
  [
   251618, 
   null, 
   "ShadowPikachu", 
   "Hey, that's my line!\n\n \n Oops!! Sorry, here's the line back, in the same condition as when I borrowed it. :)", 
   {}, 
   251616, 
   null, 
   1171864020.0
  ], 
  [
   251625, 
   null, 
   "Easyrider", 
   "He was raised a Christian. His father was a preacher. He used to teach Sunday School. God had more than enough opportunity. It was learning so much about the Bible that made him disbelieve.\n\n \n Nope. It was more likely a lie from the devil.", 
   {}, 
   251617, 
   null, 
   1171865040.0
  ], 
  [
   251653, 
   null, 
   "Shooterandproud", 
   "Nope. It was more likely a lie from the devil.\n\n \n No, it would be more logical to assume that it was a lie from the tooth fairy.", 
   {}, 
   251625, 
   null, 
   1171875420.0
  ], 
  [
   251680, 
   null, 
   "peteratwar", 
   "No, it would be more logical to assume that it was a lie from the tooth fairy.\n\n \n \n Tooth Fairy never lied to me & I always got my coin", 
   {}, 
   251653, 
   null, 
   1171880700.0
  ], 
  [
   251684, 
   null, 
   "Jo Bennett", 
   "If only the moral laws from the OT are still in force, as EZ claims (I'm not clear on where this moral/other distinction comes from), why do evangelicals pursue practisers of some things that the Bible calls \"ritually unclean\" but not others? My suspicion is that the \"moral\" code expands of contracts to include whatever suits the person describing it.", 
   {}, 
   251680, 
   null, 
   1171881660.0
  ], 
  [
   251695, 
   null, 
   "James", 
   "I doubt that Easyrider is simply claiming, without any qualification by reference to the gospels, that the moral laws of the Old Testament are in force right now. I suspect he has a more complicated theory of Christian ethics which his adversaries wish to distort in order to score cheap points in a tone of relentless hostility. (That's my impression in this and other threads). \n \n The sacred texts of Judaism are the foundation of Christianity, but the mission of Jesus Christ represents a new era in God's dealing with humanity - so much of the extensive body of Jewish law was/is no longer relevant. The Old Testament was revealed only to Israel; the New Testament is a revelation to all of mankind.\n \n Some evangelical scholars interpret the law embodied in the Mosaic Covenant by emphasizing the distinctions between moral, civil, and ceremonial imperatives. But this approach is sometimes arbitrary and tends to ignore the narrative context. It also fails to fully reflect the significant implications of the change from the Old Covenant to the New Covenant of salvation inaugurated by Jesus Christ.\n \n An alternative approach seeks universal principles in the Old Testament moral laws and legal codes which can be adopted by Christian believers today. In other words, we should filter the universal principle through the New Testament teaching regarding that principle, or regarding the specific law being studied. This allows Christians to see that all scripture is \"useful for teaching, rebuking, correcting, and training in righteousness\". (2 Tim. 3:16)\n \n Old Testament Law can be understood as an ancient deposit of timeless ethical and theological principles, and the interpreter therefore must strive to discover the unchanging truth beneath its cultural carapace.\n \n James.", 
   {}, 
   251684, 
   null, 
   1171904460.0
  ], 
  [
   251705, 
   null, 
   "Easyrider", 
   "If only the moral laws from the OT are still in force, as EZ claims (I'm not clear on where this moral/other distinction comes from), why do evangelicals pursue practisers of some things that the Bible calls \"ritually unclean\" but not others? My suspicion is that the \"moral\" code expands of contracts to include whatever suits the person describing it.\n\n \n You say, \"If only the moral laws from the OT are still in force, as EZ claims (I'm not clear on where this moral/other distinction comes from)...\"\n \n You're not sure where this moral distinction comes from? Is murder still murder under Jesus' teachings? Adultery? Thievery? Idolatry? Are you saying these moral laws from the OT are no longer in force? Certainly Jesus, Paul, and others wrote as if they were.", 
   {}, 
   251684, 
   null, 
   1171909140.0
  ], 
  [
   251714, 
   null, 
   "jyoshu", 
   "If only the moral laws from the OT are still in force, as EZ claims (I'm not clear on where this moral/other distinction comes from), why do evangelicals pursue practisers of some things that the Bible calls \"ritually unclean\" but not others? My suspicion is that the \"moral\" code expands of contracts to include whatever suits the person describing it.\n\n \n It didn't \"come from\" anywhere. The ritual/moral differences are there by default. It doesn't take an evangelical to see that--anyone subscribing to Christianity is more than likely going to subscribe to the differences--after all, chances are you don't think eating pork is unlawful, but you probably do think commiting adultery or murder is. It's not like someone had to formulate the distinction between moral and ceremonial law as a doctrine or 'new' thing. It's just the way it is--there's no other way to look at it, unless you view the law like orthodox Judaism while being a Christian. I suppose we could even say that, since Jesus healed on the Sabbath, that He Himself was the first of Christianity to make a distinction between moral and ritual laws.", 
   {}, 
   251684, 
   null, 
   1171914540.0
  ], 
  [
   251715, 
   null, 
   "Ripskar", 
   "The OT and the NT are no different. God doesn't change his mind, I'm sorry. No matter how much you want to try to dance around this question, the only explanation is that one of them is wrong, or both are wrong.\n\n \n Not sure whether you were addressing me or Jim Colyer, but my view is that the Jews made a mistake to start with which has been repeated by Christianity, and subsequently Islam, Mormonism etc.. The result is schism which is seen across monotheism as various groups try to square the circle.", 
   {}, 
   251537, 
   null, 
   1171915260.0
  ], 
  [
   251716, 
   null, 
   "johnhanks", 
   "Are you saying these moral laws from the OT are no longer in force?\n\n Deuteronomy 21 tells us that 'If a man have a stubborn and rebellious son' who hasn't responded to previous chastisement, we should have him stoned to death. How is this not a moral law? Is it still in force?\n \n That same upstanding chapter (v.10-14) legitimises the enforced sexual enslavement of any woman you fancy among enemy captives (though, to be fair, it gives her a month to mourn her slaughtered family before you're allowed to rape her). Great source for moral law, the bible.", 
   {}, 
   251705, 
   null, 
   1171915320.0
  ], 
  [
   251719, 
   null, 
   "Easyrider", 
   " Deuteronomy 21 tells us that 'If a man have a stubborn and rebellious son' who hasn't responded to previous chastisement, we should have him stoned to death. How is this not a moral law? Is it still in force?\n\n \n What, the sin or who dispenses the punishment? \n \n \n That same upstanding chapter (v.10-14) legitimises the enforced sexual enslavement of any woman you fancy among enemy captives (though, to be fair, it gives her a month to mourn her slaughtered family before you're allowed to rape her). Great source for moral law, the bible.\n\n \n \"If you are not pleased with her (the woman taken captive as a judgment against her wicked people - EZ) let her go WHATEVER SHE WISHES.\" Deut. 21\n \n Butcher another 50 million innocent unborn babies for us, O master race of humanism?", 
   {}, 
   251716, 
   null, 
   1171915680.0
  ], 
  [
   251720, 
   null, 
   "ShadowPikachu", 
   " Are you saying these moral laws from the OT are no longer in force? \n\n \n Are you saying tht they ARE in force? If so, why do you not support the stoning of disobedient children, along with various other \"moral\" laws.\n \n The so-called moral laws of the bible are laws for Israel, and only Israel. It is quite a bit different for today: we aren't an ancient group of people living back in the times of the OT (well, maybe you are, but the rest of the world sure as heck isn't).", 
   {}, 
   251705, 
   null, 
   1171915860.0
  ], 
  [
   251721, 
   null, 
   "ShadowPikachu", 
   "\"If you are not pleased with her (the woman taken captive as a judgment against her wicked people - EZ) let her go WHATEVER SHE WISHES.\" Deut. 21\n \n\n \n Ah, so that makes it a whole lot better. emoticon_rolleyes So, we can take her captive as a sexual slave, but if we aren't pleased with her (i.e. unattractive, refuses to do what we order), THEN we can let her go to do whatever she wishes. emoticon_rolleyes Really, EZ, get a life.", 
   {}, 
   251719, 
   null, 
   1171916040.0
  ], 
  [
   251726, 
   null, 
   "Easyrider", 
   "Ah, so that makes it a whole lot better. emoticon_rolleyes So, we can take her captive as a sexual slave, but if we aren't pleased with her (i.e. unattractive, refuses to do what we order), THEN we can let her go to do whatever she wishes. emoticon_rolleyes Really, EZ, get a life.\n\n \n Have you never read the New Testament? Get a new life and a clue to go along with it.", 
   {}, 
   251721, 
   null, 
   1171916940.0
  ], 
  [
   251730, 
   null, 
   "Shooterandproud", 
   "Tooth Fairy never lied to me & I always got my coin\n\n \n I swallowed my tooth once, and I didn't get any coins emoticon_cry.\n \n Stupid tooth fairy.", 
   {}, 
   251680, 
   null, 
   1171917300.0
  ], 
  [
   251731, 
   null, 
   "Shooterandproud", 
   "Not sure whether you were addressing me or Jim Colyer, but my view is that the Jews made a mistake to start with which has been repeated by Christianity, and subsequently Islam, Mormonism etc.. The result is schism which is seen across monotheism as various groups try to square the circle.\n\n \n I'm kind of addressing everyone. It would be logical to think that the people writing the OT made a huge mistake. However, whats to say the people writing the NT also made a huge mistake?", 
   {}, 
   251715, 
   null, 
   1171917480.0
  ], 
  [
   251733, 
   null, 
   "Shooterandproud", 
   "[QUOTE=Easyrider;251719]\n\"If you are not pleased with her (the woman taken captive as a judgment against her wicked people - EZ) let her go WHATEVER SHE WISHES.\" Deut. 21\n\n \n You condone this?\n \n \n \nButcher another 50 million innocent unborn babies for us, O master race of humanism?\n\n \n Oh God, not the \"embryos are people too\" dogma. *Walks away embarrassed*.", 
   {}, 
   251719, 
   null, 
   1171917660.0
  ], 
  [
   251734, 
   null, 
   "ShadowPikachu", 
   "Have you never read the New Testament? Get a new life and a clue to go along with it.\n\n \n We're talking about your claim that the OT moral law is still in place, EZ. Stop moving the goalposts and address our points. (Great comeback, by the way, repeating what I said. emoticon_rolleyes )", 
   {}, 
   251726, 
   null, 
   1171917780.0
  ], 
  [
   251735, 
   null, 
   "Shooterandproud", 
   "Have you never read the New Testament? Get a new life and a clue to go along with it.\n\n \n Whats to say the NT isn't just another catastrophic mistake, like the OT? What if, in 100 years from now, the NT is viewed like the OT? It seems logical.", 
   {}, 
   251726, 
   null, 
   1171917780.0
  ], 
  [
   251744, 
   null, 
   "Jo Bennett", 
   "You say, \"If only the moral laws from the OT are still in force, as EZ claims (I'm not clear on where this moral/other distinction comes from)...\"\n \n You're not sure where this moral distinction comes from? Is murder still murder under Jesus' teachings? Adultery? Thievery? Idolatry? Are you saying these moral laws from the OT are no longer in force? Certainly Jesus, Paul, and others wrote as if they were.\n\n \n What I'm questionning is, what defines a moral law? To my mind something that is immoral is something that does harm to yourself and/or others, in the first instance. That's not a perfect definition, but it fits the vast majority of things that most Christians would consider immoral, eg gambling, drunkeness, violence, adultery etc. To me, immorality is the breach of the command to love your neighbour as yourself; sin is either breach of this or of the command to love God (or indeed both).", 
   {}, 
   251705, 
   null, 
   1171918740.0
  ], 
  [
   251751, 
   null, 
   "Easyrider", 
   "We're talking about your claim that the OT moral law is still in place, EZ. Stop moving the goalposts and address our points. (Great comeback, by the way, repeating what I said. emoticon_rolleyes )\n\n \n There's all kinds of Judgments or chastisements by God on wicked people who violate moral laws. That hasn't changed. What has changed to a degree is who metes out the punishment, and that who is either God or the ruling authorities in the NT. I think you're hung up on who punishes who how. Which is why you're still in the dark on this.", 
   {}, 
   251734, 
   null, 
   1171920840.0
  ], 
  [
   251878, 
   null, 
   "johnhanks", 
   "I swallowed my tooth once, and I didn't get any coins emoticon_cry.\n \n Stupid tooth fairy.\n\n Look, there is a limit to what tooth fairies will rummage through to locate your tooth. Their union is very strict on this.", 
   {}, 
   251730, 
   null, 
   1172000820.0
  ], 
  [
   251879, 
   null, 
   "johnhanks", 
   "What, the sin or who dispenses the punishment?\n\n Ah, so nowadays disobedient kids are stoned to death by god, after they've died. That makes sense.\n \n\"If you are not pleased with her (the woman taken captive as a judgment against her wicked people - EZ) let her go WHATEVER SHE WISHES.\" Deut. 21\n\n Uh, yeah. This is after she's been raped, you realise [read the chapter]. In other words: 'Take your pick of the virgins you've captured, give her a while to get over the loss of her family, then rape her. And if she's not a great lay, let her go'. (Go where? Her family, her nation have all been slaughtered. Where has she got left to go?)\n \nButcher another 50 million innocent unborn babies for us, O master race of humanism?\n\n Ah, EZ wouldn't be EZ without the irrelevant tu quoque.", 
   {}, 
   251719, 
   null, 
   1172001240.0
  ], 
  [
   251895, 
   null, 
   "jyoshu", 
   "Deuteronomy 21 tells us that 'If a man have a stubborn and rebellious son' who hasn't responded to previous chastisement, we should have him stoned to death. How is this not a moral law? Is it still in force?\n\n \n If I may* ...\n \n Though it may seem subtle, I think you are conflating two very different things here. One of the things that changed with Christ is that of issues related to punishment. The passage you are referring to is about a punishment; it is not the sort of law that says \"thou shalt not\" do so-and-so. So no, this is not really an example of a \"moral law\" in the sense of moral-versus-ceremonial. It is an instruction about punishment (albeit very severe in this case). The admonition for a son to respect his father and mother IS still in place.\n \n To our 21st century eyes, in western culture, the idea of a son getting stoned for this seems incredibly harsh, but probably not so to the semitic culture a few thousand years ago. And so, this sort of thing has changed. However, the key point is that the law that demands children to obey their parents is indeed still in place, and it is the moral law here. It's just that we are to longer respond to the breaking of that law in the way prescribed in the passage you quote. THAT'S what has changed.\n \n \n \n \n \n * with hesitation, because my experience is that these sorts of cultural differences are sometimes used by the critics of religion as a means to an end to vilify God and the religion at issue, with little regard to the complexity of Biblical interpretation and cultural differences. ", 
   {}, 
   251716, 
   null, 
   1172003880.0
  ], 
  [
   251897, 
   null, 
   "Master_Shake", 
   "[QUOTE=Shooterandproud;251733]\n\n Oh God, not the \"embryos are people too\" dogma. *Walks away embarrassed*.\n\n This is the kind of commentary that we are talking about in that abortion thread that makes discussion impossible. (I'm not picking on you in particular. Everything EZ says makes any discussion impossible)", 
   {}, 
   251733, 
   null, 
   1172004900.0
  ], 
  [
   251898, 
   null, 
   "Master_Shake", 
   "Sorry, it messed up the above post. It quoted EZ where it should have quoted shooterandproud.", 
   {}, 
   251897, 
   null, 
   1172004960.0
  ], 
  [
   251899, 
   null, 
   "Master_Shake", 
   "Look, there is a limit to what tooth fairies will rummage through to locate your tooth. Their union is very strict on this.\n\n You mean there is more than one tooth fairy?!\n \n MY WHOLE LIFE HAS BEEN A LIE!!!!! emoticon_cry", 
   {}, 
   251878, 
   null, 
   1172005140.0
  ], 
  [
   251943, 
   null, 
   "Shooterandproud", 
   "Look, there is a limit to what tooth fairies will rummage through to locate your tooth. Their union is very strict on this.\n\n \n I still want my money back.", 
   {}, 
   251878, 
   null, 
   1172028600.0
  ], 
  [
   251944, 
   null, 
   "Shooterandproud", 
   "[QUOTE=Master_Shake;251897]\n\n This is the kind of commentary that we are talking about in that abortion thread that makes discussion impossible. (I'm not picking on you in particular. Everything EZ says makes any discussion impossible)\n\n \n Trust me, I've tried everything with the pro-lifers. Me and Another Opinion tried to find some middle ground, to try to talk things out, but all we got is flamed by the pro-lifers, with comments like \"why? so we can adhere to your terms instead of ours?\" and \"there is no middle ground when innocent babies are being slaughtered.\" Therefore, I've concluded that unless the pro-lifers agree to some intelligent talks and debates about the situation, that any further attempts at discussion in a civil manner will be futile. With that said, I refuse to lay dormant while pro-lifers hurdle comments like EZ's at us. I am going to do something about it, and I'm going to have to speak their language.", 
   {}, 
   251897, 
   null, 
   1172029560.0
  ], 
  [
   251945, 
   null, 
   "Shooterandproud", 
   "You mean there is more than one tooth fairy?!\n \n MY WHOLE LIFE HAS BEEN A LIE!!!!! emoticon_cry\n\n \n *Waits for EZ to come bust in here and start screaming \"THE TOOTH FAIRIES WORK FOR SATAN!!1\" or something of the sort*", 
   {}, 
   251899, 
   null, 
   1172029680.0
  ], 
  [
   251947, 
   null, 
   "Easyrider", 
   "*Waits for EZ to come bust in here and start screaming \"THE TOOTH FAIRIES WORK FOR SATAN!!1\" or something of the sort*\n\n \n I've concluded that unless the anti-lifers put away their anti-supernatural biases and agree to some intelligent talks and debates about the situation, that any further attempts at discussion in a civil manner will only dredge out more folly like we see above.", 
   {}, 
   251945, 
   null, 
   1172031120.0
  ], 
  [
   251948, 
   null, 
   "Master_Shake", 
   "[QUOTE=Shooterandproud;251944]\n\n Trust me, I've tried everything with the pro-lifers. Me and Another Opinion tried to find some middle ground, to try to talk things out, but all we got is flamed by the pro-lifers, with comments like \"why? so we can adhere to your terms instead of ours?\" and \"there is no middle ground when innocent babies are being slaughtered.\" Therefore, I've concluded that unless the pro-lifers agree to some intelligent talks and debates about the situation, that any further attempts at discussion in a civil manner will be futile. With that said, I refuse to lay dormant while pro-lifers hurdle comments like EZ's at us. I am going to do something about it, and I'm going to have to speak their language.\n\n This is exactly what I'm talking about. You're insulting a whole group of people that is more diverse than you think and thereby cutting off discussion with rational folks. emoticon_xgood \n \n Like me.", 
   {}, 
   251944, 
   null, 
   1172031300.0
  ], 
  [
   251973, 
   null, 
   "obvious_child", 
   "Pro-Lifers to me usually seem pretty ignorant and haven't thoughout their arguments.\n \n Let's just face it:\n Life is cheap. Humans are simply animals. Abortion can be used to save lives through stem cells. And many pro-lifers are not aganist invitro despite the huge contriction.", 
   {}, 
   251948, 
   null, 
   1172038860.0
  ], 
  [
   252066, 
   null, 
   "Easyrider", 
   "Pro-Lifers to me usually seem pretty ignorant and haven't thoughout their arguments.\n \n\n \n If there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.", 
   {}, 
   251973, 
   null, 
   1172101140.0
  ], 
  [
   252068, 
   null, 
   "Jo Bennett", 
   "If there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.\n\n \n There's a correlation between higher education and liberal political views, and a correlation between IQ and years in education. Make of that what you will. Of course, IQ is a measure of ability to complete IQ tests, rather than any useful judgement of intelligence.", 
   {}, 
   252066, 
   null, 
   1172102880.0
  ], 
  [
   252074, 
   null, 
   "Easyrider", 
   "There's a correlation between higher education and liberal political views, and a correlation between IQ and years in education. Make of that what you will. Of course, IQ is a measure of ability to complete IQ tests, rather than any useful judgement of intelligence.\n\n \n Republicans in the general public tend to be better educated than Democrats. In the 1994-2002 General Social Surveys (GSS), Republicans have over 6/10ths of a year more education on average than Democrats. Republicans also have a higher final mean educational degree. Further, Republicans scored better than Democrats on two word tests in the GSS--a short vocabulary test and a modified analogies test.\n \n If one breaks down the data by party affiliation and political orientation, the most highly educated group is conservative Republicans, who also score highest on the vocabulary and analogical reasoning tests. Liberal Democrats score only insignificantly lower than conservative Republicans. The least educated subgroups are moderate and conservative Democrats, who also score at the bottom (or very near the bottom) on vocabulary and analogy tests. - Prof. Jim Lindgren, law professor at Northwestern University and director of the Demography of Diversity Project\n \n More below:\n \n http://www.vdare.com/sailer/041114_iq.htm\n \n Of course, IQ and intelligence do not necessarily relate to Godly wisdom.", 
   {}, 
   252068, 
   null, 
   1172106960.0
  ], 
  [
   252075, 
   null, 
   "Master_Shake", 
   "Ok, lets abandon this ****ing contest shall we?", 
   {}, 
   252074, 
   null, 
   1172107440.0
  ], 
  [
   252078, 
   null, 
   "Easyrider", 
   "Conservatives and Christians Give More to Charities, ABC says\n \n As Doug explores in his post below, people of faith give far more to charities than non-religious people, and conservatives give more to the poor than do liberals. That's the finding of a study by author Arthur Brooks and the conclusion trumpeted by a John Stossel report on ABC this week. \n \n The report says: \n \n \"The single biggest predictor of whether someone will be charitable is his or her religious participation. Religious people are more likely to give to charity, and when they give, they give more money: four times as much. And Arthur Brooks told me that giving goes beyond their own religious organization: \"Actually, the truth is that they're giving to more than their churches,\" he says. \"The religious Americans are more likely to give to every kind of cause and charity, including explicitly non-religious charities.\"\n Christian conviction and conservative ideology increases the likelihood that an individual will give to charities-and not just to their churches, but to a variety of religious and secular causes.\n \n Liberals who see care for the poor as a government responsibility, give far less as individuals. At the same time, they describe conservatives as non-caring, and Christians as exclusionary and hypocritical. This could not be further from the truth, and these findings document it. \n \n http://www.stonescryout.org/archives/2006/12/conservatives_a_1.html", 
   {
    "unicode_changes_made": true
   }, 
   252075, 
   null, 
   1172107980.0
  ], 
  [
   252099, 
   null, 
   "Shooterandproud", 
   "Conservatives and Christians Give More to Charities, ABC says\n \n As Doug explores in his post below, people of faith give far more to charities than non-religious people, and conservatives give more to the poor than do liberals. That's the finding of a study by author Arthur Brooks and the conclusion trumpeted by a John Stossel report on ABC this week. \n \n The report says: \n \n \"The single biggest predictor of whether someone will be charitable is his or her religious participation. Religious people are more likely to give to charity, and when they give, they give more money: four times as much. And Arthur Brooks told me that giving goes beyond their own religious organization: \"Actually, the truth is that they're giving to more than their churches,\" he says. \"The religious Americans are more likely to give to every kind of cause and charity, including explicitly non-religious charities.\"\n Christian conviction and conservative ideology increases the likelihood that an individual will give to charities-and not just to their churches, but to a variety of religious and secular causes.\n \n Liberals who see care for the poor as a government responsibility, give far less as individuals. At the same time, they describe conservatives as non-caring, and Christians as exclusionary and hypocritical. This could not be further from the truth, and these findings document it. \n \n http://www.stonescryout.org/archives/2006/12/conservatives_a_1.html\n\n \n Thats cool and all, but, isn't it true that you discriminate against minorities, such as gays, women, etc.? From what I've heard, most conservatives are now even trying to ban gay marrige. Is this true?", 
   {
    "unicode_changes_made": true
   }, 
   252078, 
   null, 
   1172124120.0
  ], 
  [
   252100, 
   null, 
   "Easyrider", 
   "Thats cool and all, but, isn't it true that you discriminate against minorities, such as gays, women, etc.?\n\n \n Nope. Voting against gay marriage, etc., is not discrimination in God's eyes. \n \n Do you discriminate against NAMBLA members trying to express their sexual freedom, or is man-boy rape ok with you?", 
   {}, 
   252099, 
   null, 
   1172126940.0
  ], 
  [
   252103, 
   null, 
   "Shooterandproud", 
   "Nope. Voting against gay marriage, etc., is not discrimination in God's eyes.\n\n \n They said the exact same thing about blacks.\n \n \n \n \n \n \nDo you discriminate against NAMBLA members trying to express their sexual freedom, or is man-boy rape ok with you?\n\n \n A party is being harmed in \"man-boy rape\" as you call it, so in my and God's eyes it is not ok. However, the only time something is a sin is if a party is being unecessarily harmed.", 
   {}, 
   252100, 
   null, 
   1172130840.0
  ], 
  [
   252107, 
   null, 
   "obvious_child", 
   "If there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.\n\n \n IQ is irrevelant. One can be a genius and not know the difference between a cat and a nuclear reactor. \n \n What i'm interested in is the level of examination within one's argument and pro life arguments tend to be as hollow as pro-creationist arguments. So I will take you up on your reasoning claims.\n \n The fact that there hasn't been a decent response to the invitro thread much less a stance by pro-life aganist invitro seems to indicate that either they are ignorant as to what invitro does or that they wish to avoid discussing the giant, gapping sucking hole in their belief systems. Furthermore, pro-life arguments often reside upon alienating absolutes which often don't make much sense in a legal sense (abortion is muder) nor basic terminology (abortion is genocide). The constant claim to allegeded absolutes that aren't even correct and the failure to defend these yet the constant repeating of them would indicate that despite being shown to be technically, defintion based and legally wrong they contiune to wash, rinse, repeat. Furthermore the whole \"life is precious\" yet acceptance of abortion is okay for rape or incest creates another giant logical problem. There are plenty more of these serious flaws within the pro-life belief scheme that never seem to be addressed. Pro-Choice on the other hand in isolation is relatively consistant. While there are flaws within, none are as large as some that are present within the pro-life stance. The only pro-life stance that I have come across that is consistant within its beliefs is the anti-abortion, anti-invitro, anti-war, anti every that could possibly kill any potential human life in any shape or form. But I have met only one person like that and quite frankly, they were delusional. \n \n This would lead to evidence that Pro-life hasn't thoughtout their arguments and deliberately maintain self ignorance.\n \n I know full well you have a habit of trying to change the subject (as you clearly did with your other posts) and have a habit of avoiding honest discussion. Therefore by sticking to the subject you will either lose or run away from this post.", 
   {}, 
   252066, 
   null, 
   1172138700.0
  ], 
  [
   252119, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider  : Voting against gay marriage, etc., is not discrimination in God's eyes.\n \n \nThey said the exact same thing about blacks.\n\n \n Being born black isn't a moral sin. Indulging in gay sex is. \n \n \n\n A party is being harmed in \"man-boy rape\" as you call it, so in my and God's eyes it is not ok. However, the only time something is a sin is if a party is being unecessarily harmed.\n\n \n People can wind up in hell if they don't repent of their illicit carnality. That's not harmful?", 
   {}, 
   252103, 
   null, 
   1172158500.0
  ], 
  [
   252170, 
   null, 
   "Shooterandproud", 
   "Being born black isn't a moral sin. Indulging in gay sex is.\n \n \n Uh huh. Awhile ago they were saying being black is a moral sin. Who's to say you aren't any wrong than they were?\n \n \n \n \n \nPeople can wind up in hell if they don't repent of their illicit carnality. That's not harmful?\n\n \n \n I suspect \"illict carnality\" is some primitive Victorian Christian word for \"sex\".\n \n And, considering hell doesn't exist, having consensual sex with one's partner is indeed, not harmful, unless you can prove otherwise (which I doubt).", 
   {}, 
   252119, 
   null, 
   1172201160.0
  ], 
  [
   252236, 
   null, 
   "obvious_child", 
   "I know full well you have a habit of trying to change the subject (as you clearly did with your other posts) and have a habit of avoiding honest discussion. Therefore by sticking to the subject you will either lose or run away from this post.\n\n \n Hmmm. Did I not predict this?", 
   {}, 
   252107, 
   null, 
   1172265000.0
  ], 
  [
   252266, 
   null, 
   "Easyrider", 
   " What i'm interested in is the level of examination within one's argument and pro life arguments tend to be as hollow as pro-creationist arguments. So I will take you up on your reasoning claims.\n \n The fact that there hasn't been a decent response to the invitro thread much less a stance by pro-life aganist invitro seems to indicate that either they are ignorant as to what invitro does or that they wish to avoid discussing the giant, gapping sucking hole in their belief systems.\n\n \n People should get themselves right with (and pray to) God. He can open wombs. That's the enormous, sucking hole in your belief system - that you don't believe that. Your invitro is not necessary, and I don't support it. \n \n \n \n Furthermore, pro-life arguments often reside upon alienating absolutes which often don't make much sense in a legal sense (abortion is muder) nor basic terminology (abortion is genocide).\n\n \n \"Alienating absolutes\"? As opposed to an \"anything goes\" moral relativism that also alienates people? As for abortion being legal, so were a lot of other ungodly things at one time or another.\n \n \n \n The constant claim to allegeded absolutes that aren't even correct...\n\n \n Sorry, I'm not buying it.\n \n \n \n Furthermore the whole \"life is precious\" yet acceptance of abortion is okay for rape or incest creates another giant logical problem. There are plenty more of these serious flaws within the pro-life belief scheme that never seem to be addressed.\n\n \n Choose life, and let the babies live. If a woman wants to kill her baby, that's her choice in America. But that doesn't necessarily make it ok with God.\n \n \n \n Pro-Choice on the other hand in isolation is relatively consistant...\n\n \n Nope. Where's the \"pro-choice\" for the unborn infant? Who is his / her champion? Right off the bat it's an oxymoron.\n \n \n The only pro-life stance that I have come across that is consistant within its beliefs is the anti-abortion, anti-invitro, anti-war, anti every that could possibly kill any potential human life in any shape or form.\n\n \n Don't confuse many of us \"pro-life\" Christians with others who think evil men and regimes shouldn't be punished (via war or the justice system). Pro-life takes them off the street so more people can live. That's pro-life. \n \n \n This would lead to evidence that Pro-life hasn't thoughtout their arguments and deliberately maintain self ignorance.\n\n \n Hardly. Your own position is mortally brutal to the unborn, contradictory, and a reprehensible, ungodly philosophy.\n \n \n I know full well you have a habit of trying to change the subject (as you clearly did with your other posts) and have a habit of avoiding honest discussion. Therefore by sticking to the subject you will either lose or run away from this post.\n \n Hmmm. Did I not predict this?\n \n\n \n You just shot yourself in the chops again (or you're a false prophet). Which one is it?\n \n What do all pro-choicers have in common? Their mother's all chose life!! ", 
   {}, 
   252236, 
   null, 
   1172292540.0
  ], 
  [
   252274, 
   null, 
   "obvious_child", 
   "People should get themselves right with (and pray to) God. He can open wombs. That's the enormous, sucking hole in your belief system - that you don't believe that. Your invitro is not necessary, and I don't support it\n\n \n Honestly I have no idea if you are wrong. I have no idea what you said. You are not making a great deal of sense. \n \n \n\"Alienating absolutes\"? As opposed to an \"anything goes\" moral relativism that also alienates people? As for abortion being legal, so were a lot of other ungodly things at one time or another.\n\n \n Do you enjoy fab..Oh i wait know the answer to that. Moral relativism is hardly what you characterize it as. It is not anything goes. It is a look at a moral in a specific situation. What may be bad here may be good there. The morals are dictated by the situtation in which they are placed in. Please in the future stop lying. Ungodly? Since when was abortion ungodly? Fetuses don't even souls (Augustine). And just because other things you didn't like were legal at the time doesn't make all things legal bad. It's pretty clear from your post that you haven't even thoughout your rebuttle to defend your unthoughtout basic asserations. My point is being proven by your inability to reason.\n \n \nSorry, I'm not buying it.\n\n \n I do mention the cause of this. You seem very keen on supplying more evidence that my argument is indeed correct. Normally people try to provide evidence aganist what they believe is false. you on the other hand seem to enjoy giving evidence proving that the accusations you believe to be false are infact true.\n \n The term genocide doesn't even fit. I specifically asked people in the abortion form to show where genocide's criteria is met by abortion. No one responded with such criteria. Secondly, the abortion is murder is retarded as murder is a illegal killing. As abortion is legal, it cannot be murder unless you're delusional and think that something can be illegal and legal at the same time in the same situtation. Your inability to defend this point seems to indicate as I already have pointed out that deliberate ignorance is maintained by pro-life.\n \n \nChoose life, and let the babies live. If a woman wants to kill her baby, that's her choice in America. But that doesn't necessarily make it ok with God.\n\n \n How about you deal with my point instead of running off on a tangent?\n \n Pro-life often makes the decision that rape and incest are okay at the same time saying abortion is wrong because all life is precious. Big contridiction there. I see you are deliberately trying to avoid discussing this point which again lends evidence that pro-life is deliberately maintaining self ignorance.\n \n \nNope. Where's the \"pro-choice\" for the unborn infant? Who is his / her champion? Right off the bat it's an oxymoron.\n\n \n Show me where the Consitution grants rights to unborn children. Besides, your point isn't even relevant in showing how pro-choice is inconsistant.\n \n I know you hate staying on topic as you often lose that way, but try focus for a change. \n \n \nDon't confuse many of us \"pro-life\" Christians with others who think evil men and regimes shouldn't be punished (via war or the justice system). Pro-life takes them off the street so more people can live. That's pro-life.\n\n \n That's not even relevant to my point. I suggest you take a reading comprehension class as you clearly lack the ability to understand what is posted to you. My point was that the only consistant pro-life person I have met is one who was aganist the killing of humans as a whole. \n \n \nHardly. Your own position is mortally brutal to the unborn, contradictory, and a reprehensible, ungodly philosophy.\n\n \n Again, try to stay on topic. You have given in your own post many examples of what I have stated as true. How you think I wouldn't have caught them is delusional. Furthermore, you have yet to provide a example of where pro-choice is contridictory, or reprehensible, ungodly philosophy. And if you read Freakonomics and understand the concept of welfare, you'd understand that abortion is often the least brutal choice to a unborn. \n \n \nYou just shot yourself in the chops again (or you're a false prophet). Which one is it?\n\n \n Considering that you have deliberately tried to change the subject several times already as I have predicted and you failed to actually address a single point and it took a direct taunt to get you to post, it would seem that I'm quite right as usual. \n \n \nWhat do all pro-choicers have in common? Their mother's all chose life!! \n\n \n \n Try again Ez. that's beyond pathetic.", 
   {}, 
   252266, 
   null, 
   1172314440.0
  ], 
  [
   252278, 
   null, 
   "Easyrider", 
   " Moral relativism is hardly what you characterize it as. It is not anything goes. It is a look at a moral in a specific situation. What may be bad here may be good there. The morals are dictated by the situtation in which they are placed in. Please in the future stop lying.\n\n \n Can it. I'm sure that you can produce a situation where just about anything goes then, can't you? For instance, you can probably dredge up a scenario where adultery is a good idea and you even revel in it! The tail wags the dog.\n \n \n\n Ungodly? Since when was abortion ungodly? Fetuses don't even souls (Augustine). And just because other things you didn't like were legal at the time doesn't make all things legal bad. It's pretty clear from your post that you haven't even thoughout your rebuttle to defend your unthoughtout basic asserations. My point is being proven by your inability to reason.\n\n \n You're thinking is still steeped in folly because you are still clueless about what the Word of God says. It says (Psalm 139:13, Jeremiah 1:5, etc.) that God is instrumental in some way in the creation process of babies in their mother's wombs. What divine insight do you people think you have where you can destroy what God is then somehow instrumental in creating? Answer the question?\n \n \n\n I do mention the cause of this. You seem very keen on supplying more evidence that my argument is indeed correct. Normally people try to provide evidence aganist what they believe is false. you on the other hand seem to enjoy giving evidence proving that the accusations you believe to be false are infact true.\n\n \n Back at you. \n \n \nThe term genocide doesn't even fit. I specifically asked people in the abortion form to show where genocide's criteria is met by abortion. No one responded with such criteria.\n\n \n See above. I call it infanticide.\n \n \n Secondly, the abortion is murder is retarded as murder is a illegal killing. As abortion is legal, it cannot be murder unless you're delusional and think that something can be illegal and legal at the same time in the same situtation. Your inability to defend this point seems to indicate as I already have pointed out that deliberate ignorance is maintained by pro-life.\n\n \n More nonsense. Legal in the worldly system does not mean it's legal or that it's not infanticide in God's eyes.\n \n \n\n Pro-life often makes the decision that rape and incest are okay at the same time saying abortion is wrong because all life is precious. Big contridiction there.\n\n \n Bull. I never said rape or incest are ok. But you don't butcher the innocent infant for the mistakes or crimes of the parent(s). That where your argument fails.\n \n \n\n I see you are deliberately trying to avoid discussing this point which again lends evidence that pro-life is deliberately maintaining self ignorance.\n\n \n Bull. You're getting drilled and you don't even know it.\n \n \n\n Show me where the Consitution grants rights to unborn children.\n\n \n Show me where it says it's okay to butcher them? \n \n \nI suggest you take a reading comprehension class as you clearly lack the ability to understand what is posted to you. My point was that the only consistant pro-life person I have met is one who was aganist the killing of humans as a whole. \n\n \n And I showed you previously where that was a crock opinion. \n \n \nFurthermore, you have yet to provide a example of where pro-choice is contridictory, or reprehensible, ungodly philosophy.\n\n \n It's not pro-choice since the baby has no choice. It butchers the innocent unborn. Pro-choice is thus an oxymoron. Maybe someone needs to tatoo that on your monitor so it seeps in.\n \n \n\n And if you read Freakonomics and understand the concept of welfare, you'd understand that abortion is often the least brutal choice to a unborn. But I can't expect you to get a education now can I?\n\n \n You're the one taking the intellectual bath here, not me. \n \n \nSeriously, there are drugs for ADD\n \n Try again Ez. that's beyond pathetic.\n\n \n Recommend you go now and lick your self-inflicted wounds. If you want to run with the big dogs in this religion forum you'll need to gain a better understanding of Biblical principles.", 
   {}, 
   252274, 
   null, 
   1172338020.0
  ], 
  [
   252282, 
   null, 
   "jyoshu", 
   "Fellas ... this is to the point where it really belongs in the abortion forum.", 
   {}, 
   252278, 
   null, 
   1172342880.0
  ], 
  [
   252292, 
   null, 
   "Shooterandproud", 
   "Don't mind me jumping in, but...\n \n \n \nCan it. I'm sure that you can produce a situation where just about anything goes then, can't you? For instance, you can probably dredge up a scenario where adultery is a good idea and you even revel in it! The tail wags the dog.\n\n \n Exaggerations can be used in anyone's favor. Can it, right back at you.\n \n \n \n \nYou're thinking is still steeped in folly because you are still clueless about what the Word of God says. It says (Psalm 139:13, Jeremiah 1:5, etc.) that God is instrumental in some way in the creation process of babies in their mother's wombs. What divine insight do you people think you have where you can destroy what God is then somehow instrumental in creating? Answer the question?\n\n \n A) Unless you have God on speed dial, you don't know his intentions no matter how much you read the bible.\n \n B) Sperm + Egg = Zygote Zygote + 18 weeks = Embryo \n Embryo + uh... more weeks = Fetus Fetus + more weeks = human baby. I fail to see where \"God\" comes into the equation.\n \n \n \n \n \n \nSee above. I call it infanticide.\n\n \n Where is your support?\n \n \n \n \nMore nonsense. Legal in the worldly system does not mean it's legal or that it's not infanticide in God's eyes.\n\n \n Yes, but we don't care at the moment what God's opinions are. Church and state are separated, and everyone has a different belief. Your is no more superior than theirs.\n \n \n \n \n \nBull. I never said rape or incest are ok. But you don't butcher the innocent infant for the mistakes or crimes of the parent(s). That where your argument fails.\n\n \n A women should not have to be forced into a life of servitude against her own will to an embryo because of the criminality of the rapist. Look who's argument is failing now.\n \n \n \n \nBull. You're getting drilled and you don't even know it.\n\n \n You should really do stand-up comedy.\n \n \n \n \nShow me where it says it's okay to butcher them?\n\n \n Show me where it says zygotes are worth as much as women. \n \n \n \n \n \n \n \nIt's not pro-choice since the baby has no choice. It butchers the innocent unborn. Pro-choice is thus an oxymoron. Maybe someone needs to tatoo that on your monitor so it seeps in.\n\n \n A baby can not make a choice let alone an embryo. It is physically incapable of even thinking, it has no brain. Therefore, since a woman knows the circumstances best, it would only be logical for her to make the decision for both.\n \n \n \n \nYou're the one taking the intellectual bath here, not me.\n\n \n Still working on that comedy eh? \n \n \n \n \nRecommend you go now and lick your self-inflicted wounds. If you want to run with the big dogs in this religion forum you'll need to gain a better understanding of Biblical principles.\n\n \n If his wounds needed to be licked, then you'd be dead by now.", 
   {}, 
   252278, 
   null, 
   1172359200.0
  ], 
  [
   252295, 
   null, 
   "obvious_child", 
   "Can it. I'm sure that you can produce a situation where just about anything goes then, can't you? For instance, you can probably dredge up a scenario where adultery is a good idea and you even revel in it! The tail wags the dog.\n\n \n Again please stop with the fabrications. Deal with what I said rather then what you want to exist. Actions are dictated by circumstance. Not morals. You seem unable to understand such a basic concept.\n \n \nYou're thinking is still steeped in folly because you are still clueless about what the Word of God says. It says (Psalm 139:13, Jeremiah 1:5, etc.) that God is instrumental in some way in the creation process of babies in their mother's wombs. What divine insight do you people think you have where you can destroy what God is then somehow instrumental in creating? Answer the question?\n\n \n In some way. notice how you think that way is YOUR intepretation. Arrogance you have much of. As Calvanism is the most logical form of Christanity, it is God's divinic plan in what we do every day. Therefore, abortion is part of God's plan. But I can't expect you to understand logic. Furthermore, you're still ignoring my points.\n \n \nBack at you. \n\n \n I've highlighted piece of evidence which prove my point. All you do is go off on tangents and specifically refuse to address my points. Therefore your point is a lie.\n \n \nSee above. I call it infanticide.\n\n \n Which is not genocide. However, many pro-life call abortion genocide. How do you reconcil this problem? While you may not believe it to be so, others do and that is my point. What you inherently believe is really not important. It is the general concens of pro-life beliefs. You seem incapable of underestanding such a basic, elementry, pedestrian point. \n \n \nMore nonsense. Legal in the worldly system does not mean it's legal or that it's not infanticide in God's eyes.\n\n \n God is irrevelant. The Invisible Pretty Pink Unicorn says that abortion is okay. I can fabricate divinic support for any argument. Only XXXXXX believe that such backing has any merit. My point still stands. Abortion is not murder by definition and as it seems, abortion detractors are all too willing to change definitions at whim to suit their needs despite being correct as the correct definition, which again leads evidence to deliberate ignorance. \n \n \nBull. I never said rape or incest are ok. But you don't butcher the innocent infant for the mistakes or crimes of the parent(s). That where your argument fails.\n\n \n No, your arrogance is astounding. You cast your beliefs as the beliefs of all pro-life. That is beyond arrogance. Deal with my point or shutup. \n \n \nBull. You're getting drilled and you don't even know it.\n\n \n Funny how you say that and you're ignored several of my key points.\n You fail to address the problem of invitro, You fail to address the problem of definitions, you fail to address the problems of rape/incest, you fail to address basically everything I have said and in your astounding arrogance pretend that all pro-life beliefs are the same as your's. And then you make claims about ME without ANY reasoning or evidence at all. Typical EZ. Make statements he can never support even on the penalty of his life.\n \n You're getting your *** handed to you on a silver platter.\n \n \nShow me where it says it's okay to butcher them?\n\n \n Doesn't matter. Unless it is explicity stated in the Consitution, it doesn't exist. Don't you hate strict consitutionalism? I'm flushing you down the toliet. This proves another point. Abortion foes pretend they are aganist consitutional activism yet wholehardly support it themselves. Contridictions are abound in your beliefs, but that's pretty damn obvious to everyone.\n \n \nAnd I showed you previously where that was a crock opinion.\n\n \n No, your statement was absurd as it ignores the beliefs of everyone else and fallacious assumes everything believes the same thing as you. Does God look kindly upon people who have arrogance comming out of ever pore? You seemed to have failed to learn the lesson of humility. I guess the more you talk about Christ the less you have to act like him? Wouldn't you know this all too well EZ?\n \n \nIt's not pro-choice since the baby has no choice. It butchers the innocent unborn. Pro-choice is thus an oxymoron. Maybe someone needs to tatoo that on your monitor so it seeps in.\n\n \n The baby doesn't have rights. I asked you to show me where in the Consitution a baby does. you failed as you always do.\n \n \nYou're the one taking the intellectual bath here, not me. \n\n \n No, unlike you, I actually look at real data instead of assuming in arrogance that everyone believes the same thing as me. You haven't even brought up a valid point aganist pro-choice or dealt with a single argument I've given.\n \n \nRecommend you go now and lick your self-inflicted wounds. If you want to run with the big dogs in this religion forum you'll need to gain a better understanding of Biblical principles.\n\n \n On the contrary, you need to learn about the IPU and what the true religion states. \n \n Anyone with a brain knows that basising a argument like this one off of something unproven is futile. But then again....you are EZ.\n \n I know you have severe ADD, but this is not a discussion as to whether or not abortion is right or wrong, merely the examination of the reasoning and logic behind the arguments.", 
   {}, 
   252278, 
   null, 
   1172360460.0
  ], 
  [
   252296, 
   null, 
   "obvious_child", 
   "Don't mind me jumping in, but...\n\n \n Does EZ argue that pathetically when he's losing or is he just so junior in argumentation that he relies upon exaggerations, lack of facts and basic emotional appeals?", 
   {}, 
   252292, 
   null, 
   1172360520.0
  ], 
  [
   252302, 
   null, 
   "ShadowPikachu", 
   "Does EZ argue that pathetically when he's losing or is he just so junior in argumentation that he relies upon exaggerations, lack of facts and basic emotional appeals?\n\n \n From what I've seen of him, it's a little of both.", 
   {}, 
   252296, 
   null, 
   1172361000.0
  ], 
  [
   252304, 
   null, 
   "obvious_child", 
   "Fellas ... this is to the point where it really belongs in the abortion forum.\n\n \n Not quite. We're not arguing the rights or wrongs or abortion, well I'm trying not to, I'm arguing the reason and the logic behind the arguments, and EZ obviously does not want to do this despite his opening posts as you can see by his refusal to actually address my points and instead attempting to turn it into a abortion right vs. wrong argument. I suspected this was his plan in the first place.", 
   {}, 
   252282, 
   null, 
   1172361180.0
  ], 
  [
   252306, 
   null, 
   "Shooterandproud", 
   "Does EZ argue that pathetically when he's losing or is he just so junior in argumentation that he relies upon exaggerations, lack of facts and basic emotional appeals?\n\n \n Stop acting like you're new here.", 
   {}, 
   252296, 
   null, 
   1172362320.0
  ], 
  [
   252307, 
   null, 
   "obvious_child", 
   "Stop acting like you're new here.\n\n \n What classifies as new?", 
   {}, 
   252306, 
   null, 
   1172362560.0
  ], 
  [
   252319, 
   null, 
   "Easyrider", 
   "Again please stop with the fabrications. Deal with what I said rather then what you want to exist. Actions are dictated by circumstance. Not morals. You seem unable to understand such a basic concept.\n \n In some way. notice how you think that way is YOUR intepretation. Arrogance you have much of. As Calvanism is the most logical form of Christanity, it is God's divinic plan in what we do every day. Therefore, abortion is part of God's plan. But I can't expect you to understand logic. Furthermore, you're still ignoring my points.\n \n I've highlighted piece of evidence which prove my point. All you do is go off on tangents and specifically refuse to address my points. Therefore your point is a lie.\n\n \n Nothing above effectively counters the points I raised. Just more blather.\n \n \n (Infanticide) Which is not genocide. However, many pro-life call abortion genocide. How do you reconcil this problem?\n\n \n It's not a problem for me, it's a problem for you and others. Infanticide is still butchery when it comes to abortion.\n \n \n While you may not believe it to be so, others do and that is my point.\n\n \n Take it up with them, then. Go run an add or take a survey.\n \n \n\n What you inherently believe is really not important. It is the general concens of pro-life beliefs. You seem incapable of underestanding such a basic, elementry, pedestrian point.\n\n \n <flush<<sic<\n \n \n\n \n God is irrevelant. The Invisible Pretty Pink Unicorn says that abortion is okay. I can fabricate divinic support for any argument. Only XXXXXX believe that such backing has any merit.\n\n \n Nonsense. \n \n \n\n My point still stands. Abortion is not murder by definition and as it seems, abortion detractors are all too willing to change definitions at whim to suit their needs despite being correct as the correct definition, which again leads evidence to deliberate ignorance.\n\n \n That's your opinion. I think it's steeped in folly.\n \n \nNo, your arrogance is astounding. You cast your beliefs as the beliefs of all pro-life. That is beyond arrogance. Deal with my point or shutup. \n\n \n So far you're batting zero again. My beliefs are my own. You want to talk to someone else have at it. Maybe you should take a break and have a hot dog or something?\n \n \n\n You fail to address the problem of invitro\n\n \n Nope. I answered that. Go back and reread what I wrote. \n \n \n, You fail to address the problem of definitions, you fail to address the problems of rape/incest, you fail to address basically everything I have said and in your astounding arrogance pretend that all pro-life beliefs are the same as your's.\n\n \n Wrong again. And I can only speak for myself. You apparently want me to speak for the whole pro-life crowd, who undoubedtly don't agree on everything anymore than all homosexuals agree on gay marriage. So, go hold an assembly and quite bothering me with this tripe.\n \n \nDoesn't matter. Unless it is explicity stated in the Consitution, it doesn't exist. Don't you hate strict consitutionalism? I'm flushing you down the toliet.\n\n \n I think you just flushed yourself instead. Or have you never read, \"Render unto Caesar the things that are Caesar's, and to God the things that are God's?\" Why do you have such a hard time understanding Biblical concepts and principles? \n \n \nThis proves another point. Abortion foes pretend they are aganist consitutional activism yet wholehardly support it themselves. Contridictions are abound in your beliefs, but that's pretty damn obvious to everyone.\n\n \n I think abortion foes are mostly against liberal Judicial activism of the sort that would turn this country into a Canaanite cesspool, complete with sacrificing babies on the altars of their politically correct goddesses. \n \n \n\n No, your statement was absurd as it ignores the beliefs of everyone else and fallacious assumes everything believes the same thing as you. Does God look kindly upon people who have arrogance comming out of ever pore? You seemed to have failed to learn the lesson of humility. I guess the more you talk about Christ the less you have to act like him? Wouldn't you know this all too well EZ?\n\n \n Even Christ rebuked or corrected those who were full of folly. Why shouldn't I?\n \n \nThe baby doesn't have rights. I asked you to show me where in the Consitution a baby does. you failed as you always do.\n\n \n First answer the question you dodged and never really answered before: Psalm 139:13, Jeremiah 1:5, etc., say that God is instrumental in some way in the creation process of babies in their mother's wombs. What divine insight do you people think you have where you can butcher what God is then somehow instrumental in creating? Answer the question?\n \n \nAnyone with a brain knows that basising a argument like this one off of something unproven is futile. But then again....you are EZ. I know you have severe ADD, but this is not a discussion as to whether or not abortion is right or wrong, merely the examination of the reasoning and logic behind the arguments.\n\n \n Like I said before, if you want to post this in the religion forum and run with the big dogs then go bone up on your Biblical doctrines and principles. And even if I did have ADD, which I don't, I would still be much better off than having your philosophical outlook. \n \n What do all pro-choicers have in common? Their mother's all chose life!! ", 
   {}, 
   252295, 
   null, 
   1172374680.0
  ], 
  [
   252321, 
   null, 
   "Easyrider", 
   "What classifies as new?\n\n \n Mr. Kibbitzer, perhaps? How's it going?", 
   {}, 
   252307, 
   null, 
   1172374980.0
  ], 
  [
   252323, 
   null, 
   "obvious_child", 
   "Nothing above effectively counters the points I raised. Just more blather.\n\n \n Deliberate ignorance anyone? I'm not debating whether or not abortion is right or wrong, I'm debating as you stated which of the arguments are more reasoned. You clearly are trying to back out of this initial assertion and turn it into a debate on whether or not abortion is right or wrong. You can do that somewhere else. Stay on topic, and there are drugs for ADD.\n \n \nIt's not a problem for me, it's a problem for you and others. Infanticide is still butchery when it comes to abortion.\n\n \n Since when did your pro-life beliefs become everyone's pro-life beliefs?\n \n Your arrogance is astounding. I stated this before: \n \n \"What you inherently believe is really not important. It is the general concens of pro-life beliefs. You seem incapable of underestanding such a basic, elementry, pedestrian point.\"\n \n Again, I never intended to debate if abortion is right or wrong, just the reasoning as to the arguments. You claimed that pro-life had more reasoned arguments. You now are refusing to debate this. My original post clearly stated what I was after, which was to examine the reasoning. \n \n Why you now are refusing to do what you claimed is suggestive that you know your arguments are not reasoned.\n \n \nTake it up with them, then. Go run an add or take a survey.\n\n \n Yet you stated the following:\n \n \nIf there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.\n\n \n Why is you are now saying you won't do just this? Was I not correct in predicting you'd run away from a honest debate? Are you now not doing just that? \n \n You said that the reasoning ability of pro-life was better then pro-choice. Either admit your claim was false or defend it. Or at least amend that the reasoning ability of YOUR beliefs and not the entirity of pro-life is better then pro-choice. Either way you need to make a choice. \n \n \n<flush<<sic<\n\n \n We're not arguing the rights or wrongs or abortion, well I'm trying not to, I'm arguing the reason and the logic behind the arguments, and EZ obviously does not want to do this despite his opening posts as you can see by his refusal to actually address my points and instead attempting to turn it into a abortion right vs. wrong argument. I suspected this was his plan in the first place.\n \n Perhaps I am a prophet? \n \n \nNonsense.\n\n \n That's a idiot's answer as well as solution. Just ignore it. Explain to me how your divinic basis of reasoning is better then my divinic basis of reasoning when neither of the two can even be proven to exist. Like I said, only a XXXXX thinks that line of support is useful. \n \n \nThat's your opinion. I think it's steeped in folly.\n\n \n Perhaps you recall this threadwhere pro-lifers were doing just that? What is folly to you is reality to others, especially when they can cite examples of what they say is true, unlike you.\n \n \nSo far you're batting zero again. My beliefs are my own. You want to talk to someone else have at it. Maybe you should take a break and have a hot dog or something?\n\n \n So you admit your initial claim was false?\n \n \nIf there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.\n\n \n Did you not say that? I take by your statement that you nullify your claim that pro-life has a greater reasoning ability then Pro-choice. Perhaps you should remember your statements in the past before making statements in the future, you apparently seem to have a problem remembering what you claimed to be true. \n \n \nNope. I answered that. Go back and reread what I wrote.\n\n \n On the contrary, you stated your beliefs, which are not the beliefs of pro-life as a whole. Furthermore, you never stated that you are entirely aganist invitro nor have stated whether or not you think the practice should be banned. So no, you did not answer. \n \n \nWrong again. And I can only speak for myself. You apparently want me to speak for the whole pro-life crowd, who undoubedtly don't agree on everything anymore than all homosexuals agree on gay marriage. So, go hold an assembly and quite bothering me with this tripe.\n\n \n You stated you would do just that, speak for the whole pro-life crowd!\n \n \nIf there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.\n\n \n So apparently you're now rejecting your initial assertion. Now, if there is someone else who is willing to meet my initial assertion, which is as follows:\n \n \"Pro-Lifers to me usually seem pretty ignorant and haven't thoughout their arguments.\"\n \n \nI think you just flushed yourself instead. Or have you never read, \"Render unto Caesar the things that are Caesar's, and to God the things that are God's?\" Why do you have such a hard time understanding Biblical concepts and principles?\n\n \n Why do you have such a hard time accepting the most basic of legal processes and statements?\n \n \nI think abortion foes are mostly against liberal Judicial activism of the sort that would turn this country into a Canaanite cesspool, complete with sacrificing babies on the altars of their politically correct goddesses.\n\n \n You do have a talent for massive exaggeration. \n \n \nEven Christ rebuked or corrected those who were full of folly. Why shouldn't I?\n\n \n because you're a terrible christian and you seem to have bad memory. I already provided the quote of you saying you could argue that the reasoning of pro-life was better then pro-choice. You now have at least in this thread, rejected this claim yourself 2 or 3 times. \n \n \nFirst answer the question you dodged and never really answered before: Psalm 139:13, Jeremiah 1:5, etc., say that God is instrumental in some way in the creation process of babies in their mother's wombs. What divine insight do you people think you have where you can butcher what God is then somehow instrumental in creating? Answer the question?\n\n \n What divine insight do you have in proving God exists? You are entirely relying \n upon unprovable asserations as well as begging the question. For that argument to even be taken seriously, God must be proven to exist, and then that God must be proven to be one that actually does anything. Divinic support is outside of arguing about the nature of God itself, worthless. Only a idiot would rely upon faith foundations for a house, and likewise, only a idiot would rely upon faith foundations for a secular argument.\n \n \nLike I said before, if you want to post this in the religion forum and run with the big dogs then go bone up on your Biblical doctrines and principles.\n\n \n You think anyone here thinks you're nothing but a clown? \n \n As you have clearly stated you cannot meet your promise, my asseration of ignorance and unthoughtoutness of Pro-Life stands.", 
   {}, 
   252319, 
   null, 
   1172375940.0
  ], 
  [
   252324, 
   null, 
   "obvious_child", 
   "So as Ez has clearly rejected his claim that he could prove that the reasoning of Pro-life is better then Pro-choice, I extend my offer to debate the reasoning ability of these two parties in comparsion to each other not whether abortion is right or wrong.", 
   {}, 
   252323, 
   null, 
   1172376000.0
  ], 
  [
   252327, 
   null, 
   "electrolyte", 
   "Hey EZ, can we get a response to all the parts of this page?\n Even when we use the Bible as a source, a zygote/embryo/fetus isn't a person. Even a newborn isn't. The child has to be a month old to be counted in a census or worth any money.\n \n Of course, I don't advocate using the Bible as an authority, but I know somebody who does...\n \n How about responses to this page, too?", 
   {}, 
   252321, 
   null, 
   1172376540.0
  ], 
  [
   252328, 
   null, 
   "obvious_child", 
   "Hey EZ, can we get a response to all the parts of this page?\n Even when we use the Bible as a source, a zygote/embryo/fetus isn't a person. Even a newborn isn't. The child has to be a month old to be counted in a census or worth any money.\n \n Of course, I don't advocate using the Bible as an authority, but I know somebody who does...\n\n \n Careful, EZ may deny he ever said anything of such sorts when the discussion is honest and people force him to stay on subject!", 
   {}, 
   252327, 
   null, 
   1172376660.0
  ], 
  [
   252329, 
   null, 
   "electrolyte", 
   "Careful, EZ may deny he ever said anything of such sorts when the discussion is honest and people force him to stay on subject!\n\n No, EZ just puts me on ignore. That he does this after I accuse him of willful ignorance is just beautiful.", 
   {}, 
   252328, 
   null, 
   1172377020.0
  ], 
  [
   252330, 
   null, 
   "Easyrider", 
   "I've said what I had to say on those subjects. You've come up with nothing new, just more personal attacts and self-serving rhetoric. \n \n If you don't like it don't bother writing anymore.", 
   {}, 
   252328, 
   null, 
   1172377020.0
  ], 
  [
   252335, 
   null, 
   "obvious_child", 
   "I've said what I had to say on those subjects.\n\n \n I see. You've it very clear you no longer want anything to do with your previous claim that pro-life is more reasoned then pro-choice. Perhaps in the future you should not make claims you are not willing to defend. \n \n \nYou've come up with nothing new, just more personal attacts and self-serving rhetoric.\n\n \n That's your standard line for being beaten isn't it? \n \n \nIf you don't like it don't bother writing anymore.\n\n \n No, I just don't like it when people cop out of claims they made in the past without the maturity to admit that they had no business making that claim in the first place. There are two relatively mature ways of leaving a argument you have lost: One just leave and stop posting, two admit you were wrong.\n \n But for the sake of prophets, let's revist something I had stated earlier:\n \n \nI know full well you have a habit of trying to change the subject (as you clearly did with your other posts) and have a habit of avoiding honest discussion. Therefore by sticking to the subject you will either lose or run away from this post.\n\n \n Hmmmmmmm......or maybe you're just too predictable?", 
   {}, 
   252330, 
   null, 
   1172377740.0
  ], 
  [
   252340, 
   null, 
   "Easyrider", 
   "You lost, because, as usual, you're on the wrong side of Godly principles as I've referenced. In the future you'd be better off recognizing that there's a substantial number of people who don't believe according to the moral relatavism you embrace.", 
   {}, 
   252335, 
   null, 
   1172382480.0
  ], 
  [
   252347, 
   null, 
   "obvious_child", 
   "You lost, because, as usual, you're on the wrong side of Godly principles as I've referenced.\n\n \n Do you expect anyone to buy that line of garbage? Please show me where I have lost other threads. As I recall, you clearly lost the Iraq debate within this very thread. Please, show me my threads where I have lost arguments. Please. I dare you. \n \n You did not deal with a single point I discussed. Many of them you simply said others believe despite your claim you were speaking for the entireity of pro-life. \n \n I lost because you never dealt with a single argument I gave? That's pretty messed up. \n \n \nIn the future you'd be better off recognizing that there's a substantial number of people who don't believe according to the moral relatavism you embrace.\n\n \n Next time deal with the arguments given instead of weasling out when the discussion is actually honest.\n \n Can you at least have the maturity to admit you can't defend your claim? That's just pathetic man. So unless you're a 13 year old, there's no excuse. Really, no excuse for your behavior.", 
   {}, 
   252340, 
   null, 
   1172385420.0
  ], 
  [
   252358, 
   null, 
   "electrolyte", 
   "[to obvious_child]\n You lost, because, as usual, you're on the wrong side of Godly principles as I've referenced. In the future you'd be better off recognizing that there's a substantial number of people who don't believe according to the moral relatavism you embrace.\n\n That's funny, you're on the wrong side of the \"Godly principles\" that I referenced. And rather than address those as I asked you to, you're busy declaring faux victory over obvious_child. You're throwing around accusations of moral relativism as if they're insults, yet you clearly have your own version: the Bible is the ultimate moral authority... but only the parts you happen to like and agree with. How telling.", 
   {}, 
   252340, 
   null, 
   1172399880.0
  ], 
  [
   252361, 
   null, 
   "obvious_child", 
   "Does anyone notice that those who rarely win a argument are often those declaring that they have won in many of those arguments?", 
   {}, 
   252358, 
   null, 
   1172400840.0
  ], 
  [
   252368, 
   null, 
   "Easyrider", 
   "You and Electrolyte don't even know when you're busted. It obviously goes in one eyeball and out the other. LOL! \n \n (They're still in the dark).", 
   {}, 
   252361, 
   null, 
   1172419740.0
  ], 
  [
   252375, 
   null, 
   "electrolyte", 
   "You and Electrolyte don't even know when you're busted. It obviously goes in one eyeball and out the other. LOL! \n \n (They're still in the dark).\n\n You \"busted\" me by ignoring me? Get real.", 
   {}, 
   252368, 
   null, 
   1172431800.0
  ], 
  [
   252385, 
   null, 
   "johnhanks", 
   "You lost, because, as usual, you're on the wrong side of Godly principles as I've referenced.\n\n But electrolyte referenced 'Godly principles' too: here and here. You have yet to demonstrate how yours are superior to his.\n \nIn the future you'd be better off recognizing that there's a substantial number of people who don't believe according to the moral relatavism you embrace.\n\n 'There are other people who think like I do, therefore I'm right'. Hmm. Don't go staking too much on that argument, EZ.", 
   {}, 
   252340, 
   null, 
   1172433660.0
  ], 
  [
   252387, 
   null, 
   "ShadowPikachu", 
   " In the future you'd be better off recognizing that there's a substantial number of people who don't believe according to the moral relatavism you embrace.\n\n \n Hmm. Not a very compelling argument. After all, quite a few people agreed with Hitler, Stalin, and various other dictators (Hussein as well). Does that make what they did right?\n \n As I said, not a good argument at all.", 
   {}, 
   252340, 
   null, 
   1172433960.0
  ], 
  [
   252388, 
   null, 
   "Easyrider", 
   "Hmm. Not a very compelling argument. After all, quite a few people agreed with Hitler, Stalin, and various other dictators (Hussein as well). Does that make what they did right?\n \n As I said, not a good argument at all.\n\n \n Those too rejected God's Word. \n \n What do you want to do with Iran? Let them get nukes so they can play Hitler too?", 
   {}, 
   252387, 
   null, 
   1172435400.0
  ], 
  [
   252390, 
   null, 
   "ShadowPikachu", 
   "Those too rejected God's Word. \n \n What do you want to do with Iran? Let them get nukes so they can play Hitler too?\n\n \n Once agin, you completely ignore the point. Quite dishonest of you. This has nothing to with accepting or rejecting 'God's Word'. This has to do with your argument that people agree with you, so therefore you must be correct (more or less what you wer saying). I merely pointed out that some of the most atrocity rich men in the history of the world had people agree with them, but that does not make them right. Furthermore, regarding God's word, must I really bring up the Crusades and the witch burnings?\n \n As to your second part, please be coherent. Your question makes absolutely no sense in the context of the quote. To answer it however, no, I do not beleive we should allow them to have nukes. However, from your view of the people agreeing so therefore you must be orrect, apparently you WOULD support it, as they have plenty of people agreeing with them.", 
   {}, 
   252388, 
   null, 
   1172437980.0
  ], 
  [
   252391, 
   null, 
   "Easyrider", 
   " Once agin, you completely ignore the point. Quite dishonest of you. This has nothing to with accepting or rejecting 'God's Word'. This has to do with your argument that people agree with you, so therefore you must be correct (more or less what you wer saying). \n\n \n Don't twist my words, Shadow. That's dishonest of you. Here's what I wrote: \"In the future you'd be better off recognizing that there's a substantial number of people who don't believe according to the moral relatavism you embrace.\"\n \n There's nothing about agreeing with me personally in that. That was your circus.\n \n \n I merely pointed out that some of the most atrocity rich men in the history of the world (Hitler, etc.) had people agree with them, but that does not make them right. Furthermore, regarding God's word, must I really bring up the Crusades and the witch burnings?\n\n \n Go ahead. Those are violations of God's Word too.\n \n \n As to your second part, please be coherent. Your question makes absolutely no sense in the context of the quote. To answer it however, no, I do not beleive we should allow them to have nukes. \n\n \n What would you do about it? Engage in neverending debate at the U.N. while time passes and they get their nukes? Try sanctions which hardly ever work? What specifically?", 
   {}, 
   252390, 
   null, 
   1172443500.0
  ], 
  [
   252395, 
   null, 
   "obvious_child", 
   "So I've come to the conclusion:\n \n Easy depends primarily upon two basic fallacies:\n \n Bandwagon and Changing the Subject. \n \n It is pretty ironic that someone who talks about God all the time can be so dishonest.", 
   {}, 
   252391, 
   null, 
   1172444160.0
  ], 
  [
   252397, 
   null, 
   "Shooterandproud", 
   "What classifies as new?\n\n \n Everyone here knows the answer to that question ;) .", 
   {}, 
   252307, 
   null, 
   1172444700.0
  ], 
  [
   252399, 
   null, 
   "Shooterandproud", 
   "You lost, because, as usual, you're on the wrong side of Godly principles as I've referenced. In the future you'd be better off recognizing that there's a substantial number of people who don't believe according to the moral relatavism you embrace.\n\n \n \"Godly\" principles? Your opinions are outdated. You speak as though we are thousands of years in the past. Get into the 21st century, no one is burning in hell, gays aren't sinners, embryos aren't people, and it is not morally right to murder anyone unless you are in imminent danger, Mr. Righteous Godly Holier-than-thou Christian.", 
   {}, 
   252340, 
   null, 
   1172445000.0
  ], 
  [
   252400, 
   null, 
   "Shooterandproud", 
   "So I've come to the conclusion:\n \n Easy depends primarily upon two basic fallacies:\n \n Bandwagon and Changing the Subject. \n \n It is pretty ironic that someone who talks about God all the time can be so dishonest.\n\n \n Plus in almost all of his posts, he throws out \"Love thy neighbor\". Tell me EZ, I thought \"Love they neighbor\" meant \"Love they neighbor\", not \"Love they neighbor except for nonbelievers, gays, immigrants, democrats and everyone else who doesn't share your world view\".", 
   {}, 
   252395, 
   null, 
   1172445180.0
  ], 
  [
   252402, 
   null, 
   "electrolyte", 
   "Easy depends primarily upon two basic fallacies:\n \n Bandwagon and Changing the Subject.\n\n You forgot the third: Ignorance. EZ has hardly even acknowledged the existence of my posts, let alone addressed their content.\n \n \nBut electrolyte referenced 'Godly principles' too: here and here. You have yet to demonstrate how yours are superior to his.\n\n I would just like to point out that those are not \"my\" \"Godly principles.\" They're not my principles at all, but they are \"Godly principles,\" and they'd be principles of somebody relying upon an honest interpretation of scripture. Instead, EZ is picking and choosing, engaging in the very same selective morality of which he accuses others, and being snotty about it at the same time. (Then running away... but that's what we've come to expect by now.)", 
   {}, 
   252385, 
   null, 
   1172445480.0
  ], 
  [
   252403, 
   null, 
   "ShadowPikachu", 
   "Go ahead. Those are violations of God's Word too.\n Ah, really? They certainly didn't believe so. To go further, how about the whole promised land wars that the Isrealites supposedly went through as recorded in the bible. They certainly included quite the number of decimations of groups of people. You can't win this one EZ, just give it up and get a life.\n \n \n \n\n What would you do about it? Engage in neverending debate at the U.N. while time passes and they get their nukes? Try sanctions which hardly ever work? What specifically?\n\n \n This is not the thread to discuss such things. Note that the title of the thread is \"Does God Exist?\". Please stop trying to change the subject just because you don't want to stand up and make an actual argument and you would rather squirm around avoiding everyone else.", 
   {}, 
   252391, 
   null, 
   1172446260.0
  ], 
  [
   252420, 
   null, 
   "Easyrider", 
   "\n This is not the thread to discuss such things. Note that the title of the thread is \"Does God Exist?\". Please stop trying to change the subject just because you don't want to stand up and make an actual argument and you would rather squirm around avoiding everyone else.\n\n \n Run away and dodge the question. I figured you would.", 
   {}, 
   252403, 
   null, 
   1172456160.0
  ], 
  [
   252422, 
   null, 
   "foundit66", 
   "Run away and dodge the question. I figured you would.\n\n \n You have no grounds to lay such a complaint.\n Or maybe you would like to explicitly define what \"tolerance\" means to you?\n \n Or is YOUR response to \"run away and dodge the question\" Easyrider?\n emoticon_xangel", 
   {}, 
   252420, 
   null, 
   1172456760.0
  ], 
  [
   252424, 
   null, 
   "ShadowPikachu", 
   "Run away and dodge the question. I figured you would.\n\n \n Wow. Just wow. The question-dodging master has spoken. emoticon_rolleyes emoticon_rolleyes As foundit said, you have no grounds for such an accusation. I am merely keeping the thread on track, stopping your derailments caused by YOUR evasion of the question. The questions of Iran have not one whit to do with the topic at hand. \n \n Start a topic about it in the appropriate section of the board, and I'll give you my opinion, but as it has nothing to do with the topic (nor really the Religion sub-forum in general), I will not answer it in the context of this thread - I am sure everyone else agrees - we don't want to derail the thread any further than you have already (I am also sure the administrator agrees).", 
   {}, 
   252420, 
   null, 
   1172457900.0
  ], 
  [
   252426, 
   null, 
   "Easyrider", 
   "Wow. Just wow. The question-dodging master has spoken. emoticon_rolleyes emoticon_rolleyes As foundit said, you have no grounds for such an accusation. I am merely keeping the thread on track.... \n\n \n This is quite humerous since the topic is \"Does God exist,\" and so far in this thread Obvious Child has introduced invitro and debated abortion; Shooterandproud discussed consexual sex; Jo Bennett education, IQ, and liberal political views; Electrolyte adultery, and you brought in Hitler, Stalin, and various other dictators for a trot around the forum.\n \n Seems like when you want to answer or talk about a subject that's not specifically part of \"Does God Exist,\" you have no qualms about venturing off topic. But when it comes to answering a difficult question, all of a SUDDEN you run and use that self-contradictory excuse. Well, staying on topic is fine with me. Just don't give me the rubbish you just did, though, as an excuse. It's laughable, and disingenuous to boot.", 
   {
    "unicode_changes_made": true
   }, 
   252424, 
   null, 
   1172458560.0
  ], 
  [
   252427, 
   null, 
   "ShadowPikachu", 
   "This is quite humerous since the topic is \"Does God exist,\" and so far in this thread Obvious Child has introduced invitro and debated abortion; Shooterandproud discussed consexual sex; Jo Bennett education, IQ, and liberal political views; Electrolyte adultery, and you brought in Hitler, Stalin, and various other dictators for a trot around the forum.\n \n Seems like when you want to answer or talk about a subject that's not specifically part of \"Does God Exist,\" you have no qualms about venturing off topic. But when it comes to answering a difficult question, all of a SUDDEN you run and use that self-contradictory excuse. Well, staying on topic is fine with me. Just don't give me the rubbish you just did, though, as an excuse. It's laughable, and disingenuous to boot.\n\n \n \n All of those have been linked to the topic of the thread or the more general topic of religion by their posters. The Iran derailment you are trying to cause has not one whit to do with even the broad subject of religion. As to the Stalin and Hitler part, I didn't begin discussing them, I used them to prove false your inference of agreeing/disagreeing having anything to do with whether or not something is right/wrong.\n \n As I said before - post a new thread on the subject in the correct sub-forum, and I'll give my opinion there. If you can find some sort of way to link it to the discussion at hand, or even the wider subject of religion, I will post my opinion here - however, that will only be once you reply to the questions asked of you by foundit66 before you tried this derailment.\n \n Until then, EZ, get a life, and, as you seem fond of saying, tell it to your pet goat.", 
   {
    "unicode_changes_made": true
   }, 
   252426, 
   null, 
   1172459400.0
  ], 
  [
   252432, 
   null, 
   "Easyrider", 
   "Sure, Shadow.\n \n However, the new thread on the question of Iran is sitting there waiting for your specific response. Hop on over.", 
   {}, 
   252427, 
   null, 
   1172460900.0
  ], 
  [
   252435, 
   null, 
   "electrolyte", 
   "Run away and dodge the question. I figured you would.\n\n If supersport hadn't shattered even my backup irony meters too recently for me to have acquired another, I would have lost yet another one with this comment. For someone to have multiple people explicitly nail him for evading and ignoring points multiple times in this thread alone (notably as a continual behavior demonstrated repeatedly for many months) and make a post like the above epitomizes the nearly unfathomable \"thought\" processes we've come to expect from EZ.\n \n \nThis is quite humerous since the topic is \"Does God exist,\" and so far in this thread Obvious Child has introduced invitro and debated abortion; Shooterandproud discussed consexual sex; Jo Bennett education, IQ, and liberal political views; Electrolyte adultery, and you brought in Hitler, Stalin, and various other dictators for a trot around the forum.\n\n You pretend that Jo Bennett has overstepped derailment bounds by referring to IQ and political views, but you were the one who brought up IQs. Regarding my mention of adultery, you had made the comment that \"adultery is still adultery,\" so I used your beloved scripture to justify a question about what is considered adultery. You ran away. Remember?Adultery and fornication are both sins. Don't try them. That's all I've got to say about that.\nYou know your beliefs are indefensible, so you don't even try. Yet you cling to them anyway. You choose to ignore the overwhelming counterexamples and refutations of your points; this is willful ignorance, and it's pathetic. You, for some reason, not only have no problem with it but embrace it with all your heart.", 
   {}, 
   252427, 
   null, 
   1172461860.0
  ], 
  [
   252440, 
   null, 
   "Shooterandproud", 
   "EZ, I wish you would at least reply to SOME of my posts.", 
   {}, 
   252435, 
   null, 
   1172462820.0
  ], 
  [
   252446, 
   null, 
   "Easyrider", 
   "I'd rather ignore Electrolyte, who has continually engaged in extremely nasty personal attacks, some of which had to be deleted.", 
   {}, 
   252440, 
   null, 
   1172464920.0
  ], 
  [
   252458, 
   null, 
   "obvious_child", 
   "Run away and dodge the question. I figured you would.\n\n \n If there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.\n \n can anyone define the term hypocrite? \n \n How can you criticize someone for running away when you do it yourself? It's pretty bad when one does it, but in the same thread they did the same thing? That's beyond pathetic.", 
   {}, 
   252420, 
   null, 
   1172468580.0
  ], 
  [
   252461, 
   null, 
   "obvious_child", 
   "This is quite humerous since the topic is \"Does God exist,\" and so far in this thread Obvious Child has introduced invitro and debated abortion;\n\n \n Technically you brought abortion up.\n \n Post #44\n \n Do you have the memory of a goldfish?\n \n \nI'd rather ignore Electrolyte, who has continually engaged in extremely nasty personal attacks, some of which had to be deleted.\n\n \n No, you'd rather ignore him because he summarizes the number of people who have called you on your XXXX in a way that makes in painfully obvious to everyone just how poor your arguments really are.", 
   {}, 
   252426, 
   null, 
   1172468820.0
  ], 
  [
   252473, 
   null, 
   "electrolyte", 
   "I'd rather ignore Electrolyte, who has continually engaged in extremely nasty personal attacks, some of which had to be deleted.\n\n There are dozens upon dozens that weren't deleted, but you didn't respond to those, either. Your evasion and dishonesty get labeled accordingly. If you don't like that the most appropriate descriptors of your behavior are unflattering, stop that behavior. Unfortunately for you, that would require addressing points and using reason, neither of which you appear willing to do.", 
   {}, 
   252461, 
   null, 
   1172472360.0
  ], 
  [
   252477, 
   null, 
   "foundit66", 
   "I'd rather ignore Electrolyte, who has continually engaged in extremely nasty personal attacks, some of which had to be deleted.\n\n 1) It's quite obvious you ARE ignoring Electrolyte.\n 2) It's also quite obvious he isn't the only one you're ignoring.\n 3) A better question would be who are you NOT supposedly ignoring??? emoticon_confused", 
   {}, 
   252446, 
   null, 
   1172474280.0
  ], 
  [
   252486, 
   null, 
   "johnhanks", 
   "I would just like to point out that those are not \"my\" \"Godly principles.\" They're not my principles at all...\n\n Quite right: my carelessness. I should have said 'the ones he referenced' rather than 'his'.", 
   {}, 
   252402, 
   null, 
   1172478120.0
  ], 
  [
   252487, 
   null, 
   "ShadowPikachu", 
   "I'd rather ignore Electrolyte, who has continually engaged in extremely nasty personal attacks, some of which had to be deleted.\n\n \n Unfortunately, it is foundit66, myself, and I believe several others who are trying to get you to answer the question, not Electrolyte. And you tried to accuse me of running from a \"difficult\" question. emoticon_rolleyes You are the pinnacle of hypocricy, EZ.", 
   {}, 
   252446, 
   null, 
   1172478420.0
  ], 
  [
   252555, 
   null, 
   "ShadowPikachu", 
   "Well, EZ, I've replied on your other topic with several posts, now we await your answers to the questions asked of you in this topic. Hop to it.", 
   {}, 
   252487, 
   null, 
   1172528940.0
  ], 
  [
   252743, 
   null, 
   "Shooterandproud", 
   "I'd rather ignore Electrolyte, who has continually engaged in extremely nasty personal attacks, some of which had to be deleted.\n\n \n Um..., I'm talking about me, not electrolyte.", 
   {}, 
   252446, 
   null, 
   1172631120.0
  ], 
  [
   252751, 
   null, 
   "Easyrider", 
   "1) It's quite obvious you ARE ignoring Electrolyte.\n\n \n Very good, foundit. When did that brainstorm finally hit you? \n \n \n2) It's also quite obvious he isn't the only one you're ignoring.\n 3) A better question would be who are you NOT supposedly ignoring??? emoticon_confused\n\n \n Wait for another brainstorm. It may come to you in time. LOL!", 
   {}, 
   252477, 
   null, 
   1172639040.0
  ], 
  [
   252752, 
   null, 
   "Easyrider", 
   "If there were a way I'd love to match up the Pro-Lifer IQ's and reasoning ability to your group and watch this argument go quickly down the drain. It's nonsense.\n \n can anyone define the term hypocrite? \n \n How can you criticize someone for running away when you do it yourself? It's pretty bad when one does it, but in the same thread they did the same thing? That's beyond pathetic.\n\n \n Remember, stay on topic, Child.", 
   {}, 
   252458, 
   null, 
   1172639100.0
  ], 
  [
   252768, 
   null, 
   "ShadowPikachu", 
   "STILL waiting for your answer, EZ.", 
   {}, 
   252752, 
   null, 
   1172642760.0
  ], 
  [
   252776, 
   null, 
   "obvious_child", 
   "Remember, stay on topic, Child.\n\n \n Can you define the term hypocrite for me oh one who is mentally challenged?\n \n And it was you who refused to defend your assertion that pro-life's reasoning is better then pro-choice. You made the claim and then fleed the scene. How's that for not staying on topic?\n \n Memory of a goldfish Ez, you have the memory of a goldfish.", 
   {}, 
   252752, 
   null, 
   1172644740.0
  ], 
  [
   252814, 
   null, 
   "foundit66", 
   "Very good, foundit. When did that brainstorm finally hit you? \n Wait for another brainstorm. It may come to you in time. LOL!\n\n Maybe it's you who needs to hope for the brain-storm.\n Others got the point of my post.\n You mock that which you don't get...\n \n But I guess if you've been cornered on most of the issue, there isn't much left for you to really do but try to mock other people, and hope that nobody notices that you lost the actual debate...", 
   {}, 
   252751, 
   null, 
   1172664000.0
  ], 
  [
   256067, 
   null, 
   "bandgeek615", 
   "ok, i dont know how the whole argument got started, but im not about to scroll up a billion pages to find out. i believe the question for this thread was Does god exist?\n \n i can say that, i believe that the universe was created by the big bang. i dont believe in the sort of god that we've been presented with, no. however, i am purely scientific, so this may be a biased view.", 
   {
    "post_info": {
     "post_title": "ok, i dont know....."
    }
   }, 
   252814, 
   null, 
   1175226300.0
  ], 
  [
   256717, 
   null, 
   "huckleberry", 
   "ok, i dont know how the whole argument got started, but im not about to scroll up a billion pages to find out. i believe the question for this thread was Does god exist?\n \n i can say that, i believe that the universe was created by the big bang. i dont believe in the sort of god that we've been presented with, no. however, i am purely scientific, so this may be a biased view.\n\n \n Good start. NOw the question becomes where did the stuff for the big bang come from? You see, this could go on for a while, because the next logical question is \"where did that stuff come from\" and so on.\n \n No one could ask the same thing about a god. The god of the bible is supposedly self existent. One could say that about the universe, but given the big bang hypothesis, that does not fly. So now what?\n \n Huck", 
   {}, 
   256067, 
   null, 
   1175645640.0
  ], 
  [
   256724, 
   null, 
   "sinjin", 
   "Good start. NOw the question becomes where did the stuff for the big bang come from? You see, this could go on for a while, because the next logical question is \"where did that stuff come from\" and so on.\n \n No one could ask the same thing about a god. The god of the bible is supposedly self existent. One could say that about the universe, but given the big bang hypothesis, that does not fly. So now what?\n \n Huck\nIt is not known what or if anything existed prior to the Big Bang. We speculate on milliseconds before that event. Possibly a previous universe existed. Maybe the \"stuff\" is self-existent. The energy that is.", 
   {}, 
   256717, 
   null, 
   1175646480.0
  ], 
  [
   256768, 
   null, 
   "blasphemy", 
   "guys...\n \n you may argue about this topic as long as you all like...\n \n hehehe\n \n all i can say is that,,\n \n people have different beliefs..\n \n accepted or not, we have to respect it...\n \n after all,\n \n this is a free world....\n \n good day and god bless..........", 
   {}, 
   251572, 
   null, 
   1175677320.0
  ], 
  [
   256770, 
   null, 
   "johnhanks", 
   "Good start. NOw the question becomes where did the stuff for the big bang come from? You see, this could go on for a while, because the next logical question is \"where did that stuff come from\" and so on.\n \n No one could ask the same thing about a god.\n\n Oh yes we can. Invoking god is not an explanation for ultimate origins, it's the papering over of the absence of an explanation by declaring further application of the question off limits. Simply declaring that god's origin doesn't need explaining does not make that so.", 
   {}, 
   256717, 
   null, 
   1175678700.0
  ], 
  [
   256771, 
   null, 
   "johnhanks", 
   "It is not known what or if anything existed prior to the Big Bang. We speculate on milliseconds before that event.\n\n Actually, we speculate on milliseconds after it. Since time along with space was created at the BB, there was no such thing as milliseconds 'before' it.\n \nPossibly a previous universe existed. Maybe the \"stuff\" is self-existent. The energy that is.\n\n Absolutely. An origin-less series of universes is just as logically supportable as an origin-less anthropomorphic superbeing.", 
   {}, 
   256724, 
   null, 
   1175678880.0
  ], 
  [
   256850, 
   null, 
   "huckleberry", 
   "Oh yes we can. Invoking god is not an explanation for ultimate origins, it's the papering over of the absence of an explanation by declaring further application of the question off limits. Simply declaring that god's origin doesn't need explaining does not make that so.\n\n \n \n Actually, that was a misspelling, my comment (and it is clear from the context as well) was supposed to be NOW, one could ask the same thing about a god. I simply left off the \"w\".\n \n However, I do not think that saying God is the cause and is self existent is \"papering over\" anything. I think it is as likely an explanation as saying the universe or energy or what have you was self existent.\n \n Huck", 
   {}, 
   256770, 
   null, 
   1175714460.0
  ], 
  [
   256869, 
   null, 
   "johnhanks", 
   "However, I do not think that saying God is the cause and is self existent is \"papering over\" anything. I think it is as likely an explanation as saying the universe or energy or what have you was self existent.\n\n Precisely. So, if what we can see and measure is all we need, why invoke the spook? Ockham's Razor, and all that...?", 
   {}, 
   256850, 
   null, 
   1175716200.0
  ], 
  [
   256874, 
   null, 
   "huckleberry", 
   "Precisely. So, if what we can see and measure is all we need, why invoke the spook? Ockham's Razor, and all that...?\n\n \n Precisely because we cannot see what was before the big bang. We cannot measure it we cannot even speculate earlier than the first few seconds after the big bang. I am not invoking a spook; I am simply looking at the likely plausability of all possibilities and they are all equally plausible; there is not one more plausible therefore occams does not apply in this case.\n \n In fact, given the remarkable order (even in chaos and string theory) there is some argument that it was an Intelligent design. Not saying that for sure but certainly it must be considered when considering something that we cannot see or measure.\n \n Huck", 
   {}, 
   256869, 
   null, 
   1175716920.0
  ], 
  [
   256876, 
   null, 
   "nazsmith", 
   "I think it is as likely an explanation as saying the universe or energy or what have you was self existent.\n \n Huck\n\n \n \n \n The difference is that one is observable and exists within reality. The other is purported to be supernatural, outside of reality, and can't be observed.\n \n One can say there is a god or there are invisible, magical, undetectable elves. However, at this point, there is no evidence. I wouldn't know how to naturally, using our senses and technology, detect the supernatural.", 
   {}, 
   256850, 
   null, 
   1175717100.0
  ], 
  [
   256880, 
   null, 
   "huckleberry", 
   "The difference is that one is observable and exists within reality. The other is purported to be supernatural, outside of reality, and can't be observed.\n \n One can say there is a god or there are invisible, magical, undetectable elves. However, at this point, there is no evidence. I wouldn't know how to naturally, using our senses and technology, detect the supernatural.\n\n \n At this point in time it exists. Prior to the big bang..... What then. That is my point. You are moving forward in time instead of backward. What was there before the big bang. It was clearly not the universe. The universe is the result of the big bang. It must be something other, that does not currently exist in present time or is at least not currently observable or at least not currently recognized. God fits that definition as well as anything.", 
   {}, 
   256876, 
   null, 
   1175717460.0
  ], 
  [
   256888, 
   null, 
   "nazsmith", 
   "At this point in time it exists. Prior to the big bang..... What then. That is my point. You are moving forward in time instead of backward. What was there before the big bang. It was clearly not the universe. The universe is the result of the big bang.\n \n \n \n \n Yes, as does \"nothing.\" The universe, and its energy, has been here forever, although it may have had a beginning.\n \n We can guess, perhaps fallaciously, that since everything *within* the universe has a property, it means the universe has this property as a whole. In this case, the property would be cause-effect. We're not used to things happening without a cause (although folks say radioactive decay is truly random--I'd have to read more about this). But the whole doesn't have to have the properties of its parts (with enough very light material one could make a heavy bulletproof vest).\n \n \n \nIt must be something other, that does not currently exist in present time or is at least not currently observable or at least not currently recognized. God fits that definition as well as anything.\n\n \n \n Before the big bang, there was no time. Before the big bang, there wasn't a universe. I look around and think about what could exist when there is no time and there is no universe and I deduce nothing. As you say, 'nothing' doesn't exist in present time, 'nothing' is not observable, and 'nothing' is not easily recognized. Nothing can't exist. And as far as we can tell, there isn't anything that distinguishes God from nothing.\n \n Nothing fits that definition without additional alleged God properties. *Ha! Of course nothing has no additional properties:) Anyway, in a sense, nothing is supernatural because it doesn't exist within reality, can't be comprehended, and it doesn't follow the laws of the universe. It also doesn't answer my prayers:)", 
   {}, 
   256880, 
   null, 
   1175719080.0
  ], 
  [
   256889, 
   null, 
   "sinjin", 
   "Actually, we speculate on milliseconds after it. Since time along with space was created at the BB, there was no such thing as milliseconds 'before' it.\nThank you.", 
   {}, 
   256771, 
   null, 
   1175719140.0
  ], 
  [
   256892, 
   null, 
   "huckleberry", 
   "Yes, as does \"nothing.\" The universe, and its energy, has been here forever, although it may have had a beginning.\n \n We can guess, perhaps fallaciously, that since everything *within* the universe has a property, it means the universe has this property as a whole. In this case, the property would be cause-effect. We're not used to things happening without a cause (although folks say radioactive decay is truly random--I'd have to read more about this). But the whole doesn't have to have the properties of its parts (with enough very light material one could make a heavy bulletproof vest).\n \n \n \n \n \n Before the big bang, there was no time. Before the big bang, there wasn't a universe. I look around and think about what could exist when there is no time and there is no universe and I deduce nothing. As you say, 'nothing' doesn't exist in present time, 'nothing' is not observable, and 'nothing' is not easily recognized. Nothing can't exist. And as far as we can tell, there isn't anything that distinguishes God from nothing.\n \n Nothing fits that definition without additional alleged God properties. *Ha! Of course nothing has no additional properties:) Anyway, in a sense, nothing is supernatural because it doesn't exist within reality, can't be comprehended, and it doesn't follow the laws of the universe. It also doesn't answer my prayers:)\n\n \n \n You have actually described God except that you have done so in the Impersonal. In other words, it is easier for you to believe that the Universe (something) came from nothing than for you to believe that Universe (something) came from God (another something). That is why it is a matter of belief or faith. That is why occams razer does not apply. That is why they are equally likely given the evidence. I note you did not address the apparent order even in chaos. How does nothing explain that. It does not. \n \n In reality, no self respecting cosmologist would say that the big bang came from nothing.\n \n However, you are right, it was before time (there is a mind blower, how does one measure \"before time\" if there was no time then \"before\" simply has no meaning).\n \n This is actually one of the reasons that I think it possible that it could be God. Think about the name of God in the bible \"I am\". The hebrew turning of that phrase specifically means that which was, is and will always be. Odd that this name would be given to god by people thousands and thousands of years ago who had no such concept as \"before time\" nor of the big bang. It is mildly Ironic don't you think. Not proof and not enough for me at this point, but it certainly makes me stop and take note.\n \n Huck", 
   {}, 
   256888, 
   null, 
   1175720400.0
  ], 
  [
   256903, 
   null, 
   "nazsmith", 
   "You have actually described God except that you have done so in the Impersonal. In other words, it is easier for you to believe that the Universe (something) came from nothing than for you to believe that Universe (something) came from God (another something). That is why it is a matter of belief or faith. That is why occams razer does not apply. That is why they are equally likely given the evidence. I note you did not address the apparent order even in chaos. How does nothing explain that. It does not. \n \n In reality, no self respecting cosmologist would say that the big bang came from nothing.\n \n However, you are right, it was before time (there is a mind blower, how does one measure \"before time\" if there was no time then \"before\" simply has no meaning).\n \n This is actually one of the reasons that I think it possible that it could be God. Think about the name of God in the bible \"I am\". The hebrew turning of that phrase specifically means that which was, is and will always be. Odd that this name would be given to god by people thousands and thousands of years ago who had no such concept as \"before time\" nor of the big bang. It is mildly Ironic don't you think. Not proof and not enough for me at this point, but it certainly makes me stop and take note.\n \n Huck\n\n \n I have to re-read your statement about apparent order from chaos. I must've missed it. \n \n I didn't describe God. I described 'nothing.' I deliberately stated that nothing doesn't need the powers attributed to God by humans. Calling the beginning of the universe God seems little more than a way to protect one of the last of the gaps. \n \n It is easier for me to believe that nothing can exist outside of time and reality than to think that something can. I repeat, I can believe that nothing can exist outside of everything than believe that something can. Worrying about what came seems to be thinking forward, and not backward, as you advised I do.\n \n Does God explain it? It posits unnecessary things as well. Goddidit is not an explanation, but it does cause relief in human minds since it has similarities of an explanation. Unfortunately, we truly can't comprehend nothing, and a magical entity at least has properties.\n \n It doesn't mean much to me that Hebrews chose that as the word for their god. There are an estimated 4000 religions today (who knows how many in our history) and I'm sure many pondered upon the beginning of the universe while making up their gods.\n \n What happened before there was a before? What is north of the north pole? Was there something before there ever was something?\n \n \n Stephen Hawking may not be a self respecting cosmologist, but I'm not religious enough to pass judgement. (I know, irony intended.)", 
   {}, 
   256892, 
   null, 
   1175722860.0
  ], 
  [
   256924, 
   null, 
   "johnhanks", 
   "Precisely because we cannot see what was before the big bang. We cannot measure it we cannot even speculate earlier than the first few seconds after the big bang. I am not invoking a spook; I am simply looking at the likely plausability of all possibilities and they are all equally plausible; there is not one more plausible therefore occams does not apply in this case.\n\n Oh, but it does. If we have two competing explanations for the same phenomenon, one of which posits the existence of no entities other than those we can observe, and the other of which requires the insertion of an anthropomorphic superbeing, good old William requires we opt for the first.\n \n Alternatively, if you wish to argue that events outside the BB singularity ('before' is unhelpful here) are unobservable, then you will also accept that the Great Green Arkleseizure is as likely a Prime Mover as the judaeochristian god. And, as 'explanations go', about as useful.", 
   {}, 
   256874, 
   null, 
   1175731560.0
  ], 
  [
   256933, 
   null, 
   "huckleberry", 
   "Oh, but it does. If we have two competing explanations for the same phenomenon, one of which posits the existence of no entities other than those we can observe, and the other of which requires the insertion of an anthropomorphic superbeing, good old William requires we opt for the first.\n \n Alternatively, if you wish to argue that events outside the BB singularity ('before' is unhelpful here) are unobservable, then you will also accept that the Great Green Arkleseizure is as likely a Prime Mover as the judaeochristian god. And, as 'explanations go', about as useful.\n\n \n \n John, you missed my response previously. There are not two things one of which can be observed. There is no observation prior to the big bang. It does not exist. Even the concept of \"prior to the big bang\" is nebulous because in all likelihood time did not exist either at that ......\"point in time\"emoticon_xangel \n \n There are multiple possibilities, God, something from nothing, something from something else that also cannot be observed, great green arkelseizures and the coming of the great white handkerchief, lots of possibilities. Some have some philosophical basis in reality while others have none. But none of them are observable or measurable. Therefore, they are equally lilkely and plausible.\n \n nazsmith:\n \n If you look at your description of \"nothing\" without noting it as nothing (in other words objectively) and then look at the objective atributes of god as listed in the bible (again objectively without judging their validity) the only difference that you will come to is that nothing is impersonal and that god is personal.\n \n I have read hawkings books and enjoyed them immensely. In fact, in \"A Brief History of Time\" he discusses (however briefly) some of his own ponderings on god. He takes it from the discussion concerning the nature of the universe, according to the data, to be either bounded but infinite or finite but without boundary. This particular antinemy (sic?) is one of the most described attributes of the god of the bible. As is the \"self existent\" description. \n \n NOw, as I said, it certainly does not prove gods existence. it only hints at it. likewise the data only hints at the other things.\n \n For me, I simply cannot ignore the possibilities. It would be foolish to do so. I can certainly say my mind is not made up on the subject, but I have a firm belief in looking at things objectively. (although I am not perfect at doing that.)", 
   {}, 
   256924, 
   null, 
   1175735880.0
  ], 
  [
   256935, 
   null, 
   "Winston Smith", 
   "Hints is no proof. Now as Hawkins book's title says clearly it is a story about time, and time did not exist previous to the Big Bang.\n \n Science says that whatever existed prior to the beginning of time is unknowable.\n \n Everybody is entitled to his religious belief but we have to separate Hawkins's beliefs from his scientific pronouncements", 
   {}, 
   256933, 
   null, 
   1175736360.0
  ], 
  [
   256936, 
   null, 
   "huckleberry", 
   "Hints is no proof. Now as Hawkins book's title says clearly it is a story about time, and time did not exist previous to the Big Bang.\n \n Science says that whatever existed prior to the beginning of time is unknowable.\n \n Everybody is entitled to his religious belief but we have to separate Hawkins's beliefs from his scientific pronouncements\n\n \n I am not aware that anyone is declaring proof. I am merely pointing out the possibility. Using occams razer does not apply because they are equally plausible since they are, as you correctly point out, unknowable.\n \n Huck", 
   {}, 
   256935, 
   null, 
   1175736600.0
  ], 
  [
   256937, 
   null, 
   "ShadowPikachu", 
   "Hints is no proof. Now as Hawkins book's title says clearly it is a story about time, and time did not exist previous to the Big Bang.\n \n Science says that whatever existed prior to the beginning of time is unknowable.\n \n Everybody is entitled to his religious belief but we have to separate Hawkins's beliefs from his scientific pronouncements\n\n \n No, it says that whatever existed prior to the beginning of time (A little vague there itself, as there cannot be a \"prior to\" if time doesn't exist) is unknowable at the moment, and with our present capabilities, not that it can never be known - the statement you made is one that religion would make, not science (at least not without the modifiers I added).", 
   {}, 
   256935, 
   null, 
   1175736660.0
  ], 
  [
   256941, 
   null, 
   "Winston Smith", 
   "Of course I am talking about now, not about pie in the sky one day mybe in the future.\n yes, maybe science finds a way of increasing our intelligence one day and thus we can unravel the misteries of the Universe but on the other hand it might never happen so to believe one day it will happen is akin to religious belief to me", 
   {}, 
   256937, 
   null, 
   1175740920.0
  ], 
  [
   256967, 
   null, 
   "johnhanks", 
   "John, you missed my response previously. There are not two things one of which can be observed. There is no observation prior to the big bang.\n\n My final comment on this one - last word's yours if you want it.\n \n What I meant was that we observe now a universe of matter, energy and space-time, and have no reason whatsoever to suppose that anything else has ever existed. If we set aside for a moment the contradiction inherent in the term 'before' the BB, there is no reason to suppose anything other than an infinite series of other universes of matter, energy and space-time. To invoke an anthropomorphic super-being to account for these is not only a non-explanation - since it only invites the question of explaining its own origin - but does, indeed, violate Ockham's razor.\n \n Cordially,\n \n JH", 
   {}, 
   256933, 
   null, 
   1175763780.0
  ], 
  [
   256987, 
   null, 
   "nazsmith", 
   "\n For me, I simply cannot ignore the possibilities. It would be foolish to do so. I can certainly say my mind is not made up on the subject, but I have a firm belief in looking at things objectively. (although I am not perfect at doing that.)\n\n \n \n God might be the answer to questions such as \"What happened before there was a before?\" or \"What happened when there was nothing to happen?\" Maybe if the question doesn't seem loaded, irrational or imaginary, people will want a defined \"real\" answer. We know the answer to the fake question doesn't exist. But that may not be satisfactory.\n A person may demand a defined answer, because they don't know that \"What does a square-circle look like?\" has no real, rational answer. \"What existed before existence?\" In this case, if people cannot see what's wrong with the question in the first place, I guess God is a suitable answer for them. It's imaginary, still says nothing, but at least has the illusion of an answer to an irrational question. It also helped ancient man throughout history, so there may be an evolutionary reason many of us are still tied to this answer.\n \n You are ignoring the other alleged possibilities. If you demand a defined answer (albeit irrational) to an unreal loaded question, you are ignoring other irrational possibilities.\n There is no way to deduce god, since it's an entity that necessary \"exists\" in the world of the imaginary. There we'll find square-circles, the real number answer to 1 - infinity, and what time was it before time began. It seems the god of gaps may have found the safest home, though the home doesn't really exist:)", 
   {}, 
   256933, 
   null, 
   1175780400.0
  ], 
  [
   256995, 
   null, 
   "Winston Smith", 
   "if you say that existence began, then it is logical to ask when did it begin and of course the next question is how it came about for how come that non-existence produced existence. These are valid questions and I don't see what evoluton has to do with it.", 
   {}, 
   256987, 
   null, 
   1175782320.0
  ], 
  [
   257031, 
   null, 
   "huckleberry", 
   "My final comment on this one - last word's yours if you want it.\n \n What I meant was that we observe now a universe of matter, energy and space-time, and have no reason whatsoever to suppose that anything else has ever existed. If we set aside for a moment the contradiction inherent in the term 'before' the BB, there is no reason to suppose anything other than an infinite series of other universes of matter, energy and space-time. To invoke an anthropomorphic super-being to account for these is not only a non-explanation - since it only invites the question of explaining its own origin - but does, indeed, violate Ockham's razor.\n \n Cordially,\n \n JH\n\n \n I shall take the last word and thanks. The issue is that matter and energy did not always exist. The data for the big bang makes it pretty clear that once upon a time, this stuff was not there. Further, the data does not support a big crunch for the current universe (the idea that the universe is expanding and will one day collapse back on itself to form a crunch with a subsequent big bang.) Without the big crunch and then the following big bang again there would be no \"series of matter and energy conversions\" that you suppose. Your answer is a possibility, but the current data do not support it and in fact contradict it. Hawkings says that the universe is bounded and infinite or it is finite and unbounded. These two scenarios say that there is something other than the series you imply. They support the something from nothing idea.\n \n the order found in chaos and the something from nothing imply something intelligent behind it, much like the clearly square or circle field shapes one sees when flying to a vacation spot. One can see intelligent intervention in the design. There is no such thing as \"random order\". This is an oxymoron. \n \n I see God as a distinct possibility and our razer simply does not apply. You ASSUME that because God is not directly in contact with you. There is most certainly evidence for God and you choose to ignore it. The problem with occams is that you cannot use it on every piece of evidence and then deny the whole. That is a slippery slope. The whole of the evidence, taken together certainly does imply the possibility of God and that would actually be the SIMPLEST explanation, as opposed to some incredible cosmic mechanism (which the data do not support) or that something came from nothing and we just cannot explain it. God actually is more likely if we use your logic.\n \n Thanks for the debate.\n \n Huck", 
   {}, 
   256967, 
   null, 
   1175794200.0
  ], 
  [
   257113, 
   null, 
   "Winston Smith", 
   "to say that something can come out of nothing is simply absurd. I can believe that randomly rearranging pieces may one day produce order though.\n \n The Big Bang does not say that the Universe came out of nothing it says that is the product of a singularity; there was a pool of low level energy to begin with.\n \n How do you explain the existence of what you call God? He made Himself out of nothing?", 
   {}, 
   257031, 
   null, 
   1175819100.0
  ], 
  [
   257129, 
   null, 
   "INRI", 
   "Everyone is looking for God instead of listening to what he says. While we concern ourselves with the flame we fail to see the candle. If you want to descover the reality of God you only need to look for him in his word and then the hidden shall be revealed.", 
   {}, 
   251572, 
   null, 
   1175822640.0
  ], 
  [
   257130, 
   null, 
   "huckleberry", 
   "to say that something can come out of nothing is simply absurd. I can believe that randomly rearranging pieces may one day produce order though.\n \n The Big Bang does not say that the Universe came out of nothing it says that is the product of a singularity; there was a pool of low level energy to begin with.\n \n How do you explain the existence of what you call God? He made Himself out of nothing?\n\n \n I do not think that the theory is that there was a pool of low level energy prior to the big bang. I think it was a high level and immense density:\n \n \nExtrapolated into the past, these observations show that the universe has expanded from a state in which all the matter and energy in the universe was at an immense temperature and density. Physicists do not widely agree on what happened before this, although general relativity predicts a gravitational singularity.\n \n \nhttp://en.wikipedia.org/wiki/Big_Bang\n \n General relativity however is contravened by quantum gravitational concerns. The question is where did this thing (singualrity) come from. If the issue is that it was self existent, then why can God not be self existent?\n \n That is the point. We can only extrapolate back to the beginning. WEe cannot go \"before\" the beginning which is what we are discussing at this point (at least I am). The equations describing the big bang are time dependentn particularly hubbles law (a velocity calculation is involved which neceissitates time). Therefore, what have you \"before time?\"\n \n Huck", 
   {}, 
   257113, 
   null, 
   1175822940.0
  ], 
  [
   257208, 
   null, 
   "gaetano", 
   "Everyone is looking for God instead of listening to what he says. While we concern ourselves with the flame we fail to see the candle. If you want to descover the reality of God you only need to look for him in his word and then the hidden shall be revealed.\n\n \n \n \n gaetano:\n It was the closer inspection of his \"word\" that showed me that man created and breathed life into god. Not the other way around.", 
   {}, 
   257129, 
   null, 
   1175844600.0
  ], 
  [
   257247, 
   null, 
   "INRI", 
   "It was the closer inspection of his \"word\" that showed me that man created and breathed life into god. Not the other way around.\n\n \n Again you question who made who...did God make man or did man make god and it is not important perhaps that story is true or a metaphore for future events instead we need to be looking at the reality that we find ourselves in today.\n \n You are pondering over things that can not be answered and do not really matter and are over looking the fact that God exists either in reality (God made Man) or in the minds of man(man made God) either way God exists and has existed at least since the begining of humanity perhaps before that....but lets move further in time to the year 33AD and the future events that I talked about.\n \n The ressurection of Jesus, the Ressurection of the dead....God breathes new life into man.... he is raised up, Just as Jesus is raised up. Our old life we shared with the Animals our new life we share with God. So humanity takes on the divinity of Christ and the diginity and worth of Almighty God...so all human beings become one with Christ and share in the sacredness of almighty God and so we are given a new dignity a divine dignity, our dignity is ressurected and brought to a new life in Christ and so what we do to the least of our brothers (humanity) we do unto Christ himself and so in Christ we share in such dignity and so to sin we scandalize Christ and degrade ourselves, we abandon our divine dignity and are reduced to animalistic human nature which leads to the degrading of fellow human beings and a reduction of humanity once again to animal like status. When we embrace Christ our human nature is humbled before God and we are raised up to a divine nature with Christ a new life. \n \n A Christian does not discriminate or persecute or reduce people to a less status of divine dignity, we recognise their worth as divine but do they themselves recognise that in themselves?\n \n For example a Christian does not reduce a mna who is attracted to other men to a less status of divine dignity and if he embraces Christ he humbles his human nature before God and shares in the divine dignity of God. But the man who rejects Christ and embraces his human nature in his sin he abandons the dignity God wishes to grant to him and is given over to animalistic behaviour and becomes an enemy of God and of divine human dignity.\n \n A woman Caught in lust for another man other than her husband who embraces Christ humbles her human nature before God shares in his divine dignity, but the woman who rejects god fails to recognise her divine dignity is enflamed with passion and is given over to animalistic behaviour which leads her to her becoming an enemy of God and divine human dignity. Just as sexual act carried out in accord with Christ and with divine human dignity often becomes manifest in the flesh with the birth of a loved Child, so too the sexual act carried out in rejection of Christ and rejection of divine dignity often becomes manifest in the flesh with the abortion of a unwanted Child.\n \n All these human beings the Man with an attraction to another man, the woman with lust for another man other than her husband and the unborn Child all share in the dignity of Christ, just as You and I too share in this divine dignity but not everyone recognises their own dignity or the dignity of others, I recognise my own dignity in Christ and I recognise in others their divine dignity in Christ and I want to help others discover their divine dignity and defend those who for whatever reason are not being granted their divine dignity by others.\n \n \n We were raised to a new life in Christ, he breathed a new life into us \"he breathed on the and said recieve the holy spirit\" he came so we could have life and life abundently, a divine life with him that leads to a culture of life\n \n those who reject it do not have a new life and seek to destroy the life that is in others that leads to a culture of death.\n \n Points of reflection:\n \n Think of a world where all mankind share in the dignity of god and recognise that \n \n Then Think about the consiquences of mankind embracing sin... of mankind without divine dignity\n \n For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord. \n \n Satan was a lier and a murderer from the begining\n \n each person is tempted when he is drawn away and enticed by his own evil desires. 15 Then after desire has conceived, it gives birth to sin, and when sin is fully grown, it gives birth to death. \n \n GOD SENT HIS ONLY SON NOT TO CONDEMN THE WORLD BUT TO SAVE THE WORLD THROUGH HIM", 
   {}, 
   257208, 
   null, 
   1175883120.0
  ], 
  [
   257277, 
   null, 
   "johnhanks", 
   "GOD SENT HIS ONLY SON NOT TO CONDEMN THE WORLD BUT TO SAVE THE WORLD THROUGH HIM\n\n How was this to be accomplished, exactly?", 
   {}, 
   257247, 
   null, 
   1175891100.0
  ], 
  [
   257290, 
   null, 
   "INRI", 
   "How was this to be accomplished, exactly?\n\n \n Do you still not comprehend?", 
   {}, 
   257277, 
   null, 
   1175893800.0
  ], 
  [
   257307, 
   null, 
   "johnhanks", 
   "Do you still not comprehend?\n\n 'Comprehend' implies something subject to comprehension. You have yet to put any such proposition on the table. The assertion\n \nGOD SENT HIS ONLY SON NOT TO CONDEMN THE WORLD BUT TO SAVE THE WORLD THROUGH HIM\n\n is pious gobbledygook. It makes no rational sense.", 
   {}, 
   257290, 
   null, 
   1175898180.0
  ], 
  [
   257321, 
   null, 
   "INRI", 
   "GOD SENT HIS ONLY SON NOT TO CONDEMN THE WORLD BUT TO SAVE THE WORLD THROUGH HIM.\n \n I posted that in relation to the whole post, either you have not read the whole post or you fail to comprehend.", 
   {}, 
   257307, 
   null, 
   1175904060.0
  ], 
  [
   257324, 
   null, 
   "huckleberry", 
   "'Comprehend' implies something subject to comprehension. You have yet to put any such proposition on the table. The assertion\n \n is pious gobbledygook. It makes no rational sense.\n\n \n That was one sentence in a loooooooooooooooooong post. Can you say, \"taken out of context\"\n \n Read it again. Inri certainly posts a perfectly comprehensible position. I do not necessarily agree with it, but it is clearly there. You are ignoring it intentionally if you are just focusing on the one sentence.\n \n Huck", 
   {}, 
   257307, 
   null, 
   1175904960.0
  ], 
  [
   257334, 
   null, 
   "INRI", 
   "That was one sentence in a loooooooooooooooooong post. Can you say, \"taken out of context\"\n \n Read it again. Inri certainly posts a perfectly comprehensible position. I do not necessarily agree with it, but it is clearly there. You are ignoring it intentionally if you are just focusing on the one sentence.\n \n Huck\n\n \n Thank you huck, it is nice to be finally understood.\n \n I am pleased you understand this, because this is the begining of understanding the Good News. Once the light is on the whole room becomes illuminated but our eyes still dazeled fail to make out everything in the room. The human mind once enlightend by the message of Christ compells the heart to faith towards the things the mind can not yet comprehend", 
   {}, 
   257324, 
   null, 
   1175906640.0
  ], 
  [
   257359, 
   null, 
   "johnhanks", 
   "That was one sentence in a loooooooooooooooooong post. Can you say, \"taken out of context\"[?]\n\n Well, I can say it, but it was pretty clear I was referring to the sentence in context. 'Pious gobbledygook' is equally applicable to the rest of it, frankly. You claim \n \nInri certainly posts a perfectly comprehensible position.\n\n Please substantiate that. If you mean 'comprehensible' in the trivial sense of understanding the meaning of the individual words, sure; if you mean constructing a rational argument based on demonstrable premises ... well, as I said, please show me.", 
   {}, 
   257324, 
   null, 
   1175937300.0
  ], 
  [
   257467, 
   null, 
   "INRI", 
   "its not an argument though, If i said I had brown eyes, its a statement of fact not a debatable argument.", 
   {}, 
   257359, 
   null, 
   1175997960.0
  ], 
  [
   257493, 
   null, 
   "johnhanks", 
   "its not an argument though, If i said I had brown eyes, its a statement of fact not a debatable argument.\n\n I take your point. On the other hand the existence of eyes, and the rational status of the assertion that they are brown, are not in dispute. The statement begs no questions, whereas a statement like\n \nWe were raised to a new life in Christ, he breathed a new life into us \"he breathed on the and said recieve the holy spirit\" he came so we could have life and life abundently, a divine life with him that leads to a culture of life\n\n begs all manner of questions. Far from being equivalent to an assertion like 'I have brown eyes', it's more analogous to 'invisible green pixies have subjunctive eyes'. The individual words are capable of being comprehended, but the sentence as a whole does not form a rational statement without an awful lot of question-begging.", 
   {}, 
   257467, 
   null, 
   1176025620.0
  ], 
  [
   257495, 
   null, 
   "INRI", 
   "thats because the words are spiritual and metaphorical, I am not using them to be deliberatly obtuse. I am using biblical/spiritual language trying tp put them into a earthly/physical context to help you understand them.\n \n For example.\n \n We were raised to a new life in Christ, he breathed a new life into us \"he breathed on the and said recieve the holy spirit\" he came so we could have life and life abundently, a divine life with him that leads to a culture of life.\n \n This translates as best I can.\n \n Human beings in light of Christian understanding are not insignificant creatures. The christian understanding of Man is that because of Jesus Christ we are all Godlike and each one of us are deserving to the respect that throughout history has been atributed to God...\"We were raised to a new life.\" obviously such revereance for humanity leads to a \"culture of life\" \n \n Of course this is only one side of Christianity that stems from faith in the other side the spiritual the heavenly. we are raised also to a new spiritual eternal life and we have actually recieved the Holy Spirit.\n \n Just as Jesus is both God & Man, So Christianity is both heavenly & Earthly\n \n Just as Jesus was God & man from his conception in Our ladies womb - This duality has also been a facit of Christianity since our very conception.\n \n In fact many of the early converts to Christianity were rebuked by the apostles for ignoring/denying the spiritual aspects of Christianity.\n \n 1 Cor 15\n \n \"How can some of you say that there is no resurrection of the dead? 13 If there is no resurrection of the dead, then not even Christ has been raised...... If only for this life we have hope in Christ, we are to be pitied more than all men. \"\n \n Today the Church is urging the layity on in regards to the earthly side of Christianity because Christianity has over recent year has in part somewhat abandoned that facit of Christianity and our hope in Christ is not just in the next life but is also in this life. We have come full circle from the early christians, the circa 1500AD Idea of \"faith alone\" had to pull away from the earhtly aspect of Christianity... just as God became Man and Christianity is both Heavenly and Earthly so is salvation both Faith in the next life and Good works in this life... Amen!", 
   {}, 
   257493, 
   null, 
   1176028500.0
  ], 
  [
   257539, 
   null, 
   "johnhanks", 
   "I am using biblical/spiritual language ...\n\n ... and I am calling it pious gobbledygook. Frankly, I can't see us reaching any resolution on this one.\n \n Be well.\n \n JH", 
   {}, 
   257495, 
   null, 
   1176060600.0
  ], 
  [
   257585, 
   null, 
   "Winston Smith", 
   "if the Universe is self existent then what do we need the concept of God for? since God is the 'answer' to whatever questions we don't have an answer for.", 
   {}, 
   257130, 
   null, 
   1176083040.0
  ], 
  [
   257616, 
   null, 
   "INRI", 
   "I am calling it pious gobbledygook.\n\n \n well its not, it is a way of life for you to choose or reject a whole life/global changing , message.", 
   {}, 
   257585, 
   null, 
   1176092400.0
  ], 
  [
   257698, 
   null, 
   "huckleberry", 
   "if the Universe is self existent then what do we need the concept of God for? since God is the 'answer' to whatever questions we don't have an answer for.\n\n \n \n You will have to show me that the universe is self existent. Others would have to show me that God is self existent. The point is, YOU CANNOT SHOW IT NOR CAN THEY.\n \n The only difference in the two possibilities is that one is \"impersonal\" (the universe) and the other is personal (God). Some have a preference of one over the other. It is interesting to note, psychologically speaking, that those who choose the impersonal one typically are very controlling and unwilling to submit to the authority of others. They tend to own their own business because \"I can never work for anyone but myself\" and other such things. The personal God makes people responsible for things. An impersonal universe allows for such things as \"relative ethics\" or \"situational ethics\". Meaning that it is okay to steal if you really need something etc. A personal God means that there is a \"relationship\" that must be dealt with instead of something cold and impersonal where \"no harm\" comes. \"Impersonalism\" as a world view leads to such things as \"I can do whatever I want as long as it does not hurt anyone else\" or \"I can do whatever I want as long as I don't get caught.\" \n \n The problem with both of those is that people ALWAYS live in relationship with others. (Unless you have hidden in a cave all your life and even then your family might have something to say about that.) There is no such thing as a victimless crime. Just doing pot for example. Many think this is victimless, but if you look at the toll on the family and the cost to local health officials, one can find the harm it does to others.\n \n Just my two cents.\n \n Huck", 
   {}, 
   257585, 
   null, 
   1176152160.0
  ], 
  [
   257803, 
   null, 
   "INRI", 
   "Well huck, you certainly seem to understand.\n \n St Paul says that when one person suffers it effects everyone.", 
   {}, 
   257698, 
   null, 
   1176168240.0
  ], 
  [
   257820, 
   null, 
   "thelmoose", 
   "You will have to show me that the universe is self existent. Others would have to show me that God is self existent. The point is, YOU CANNOT SHOW IT NOR CAN THEY.\n \n The only difference in the two possibilities is that one is \"impersonal\" (the universe) and the other is personal (God). Some have a preference of one over the other. It is interesting to note, psychologically speaking, that those who choose the impersonal one typically are very controlling and unwilling to submit to the authority of others. They tend to own their own business because \"I can never work for anyone but myself\" and other such things. The personal God makes people responsible for things. An impersonal universe allows for such things as \"relative ethics\" or \"situational ethics\". Meaning that it is okay to steal if you really need something etc. A personal God means that there is a \"relationship\" that must be dealt with instead of something cold and impersonal where \"no harm\" comes. \"Impersonalism\" as a world view leads to such things as \"I can do whatever I want as long as it does not hurt anyone else\" or \"I can do whatever I want as long as I don't get caught.\" \n \n The problem with both of those is that people ALWAYS live in relationship with others. (Unless you have hidden in a cave all your life and even then your family might have something to say about that.) There is no such thing as a victimless crime. Just doing pot for example. Many think this is victimless, but if you look at the toll on the family and the cost to local health officials, one can find the harm it does to others.\n \n Just my two cents.\n \n Huck\n\n \n Where do you get ideas like this?\n \n You are simplistically saying that if you do not believe in God you are\n [*]Impersonal [*]Typically very controlling[*]Unwilling to submit to authority of others[*]Tend to own your own business[*]Not \"responsible for things\" [*]Essentially have no morals or ethics or ability to have human relationships\n \n Do you really believe this silliness? On what do you base such completely unfounded statements????? Please answer this. \n \n This idea that morals or ethics are only possible with a belief in a certain God is one of the lies that religious people must continue to tell themselves to provide justification for unfounded beliefs. Just because it makes you feel good about yourself doesn't mean it is true. \n \n A moral and ethical and loving life is a goal that we all should long to strive for. It makes the world livable. It may be the most important thing we can achieve as a human being. There is, however, no reason whatsoever to believe that this cannot be achieved, and very often is, in a non-religious manner.", 
   {
    "unicode_changes_made": true
   }, 
   257698, 
   null, 
   1176173520.0
  ], 
  [
   257827, 
   null, 
   "Zardoz", 
   "You do know that if you believe in the 'personal' god, you can still do all those naughty things and all you have to do to feel good about yourself is tell the magic fairy, \"I'm sorry.\" and Presto, all is peachy with the world until you need to do something equally dispicable again, something you often condemn others of doing.\n \n While I do agree that there really is no such thing as a victimless crime, I will say the pot headed acquaintences of mine were some of the best support I needed whilst dozens of 'Christians' treated me as a pariah without cause based simply on their prejudgemental attitudes and the malicious gosip on one.\n Actually, in my time I've encountered about 3 'Christians' worthy of the word who not only know what their book says but actually put it to use.\n And in my time, I've seen scores upon scores willingly engage in illegal activities, immoral practices, back stabbing friends and family and have total disregard for others...all whilst professing to be Christian.\n \n Of course, your mileage may vary.", 
   {}, 
   257820, 
   null, 
   1176177600.0
  ], 
  [
   257893, 
   null, 
   "jyoshu", 
   "You do know that if you believe in the 'personal' god, you can still do all those naughty things and all you have to do to feel good about yourself is tell the magic fairy, \"I'm sorry.\" and Presto, all is peachy with the world until you need to do something equally dispicable again, something you often condemn others of doing.\n\n \n Isn't that the nature of forgiveness regardless of whether or not there is a God? That's the case when ANYONE truly forgives you. If your child accidently catches the kitchen on fire, you can hold a grudge all your life or you can forgive him. Hopefully, you'll forgive. This may surprise you, but you really don't have to be religious or believe in God at all to forgive someone.", 
   {}, 
   257827, 
   null, 
   1176215220.0
  ], 
  [
   257897, 
   null, 
   "INRI", 
   "I dont think huck was saying that everyone is like this who believe this way or that, rather that he was simply giving the logical conclusion of both belife systems.\n \n \nYou do know that if you believe in the 'personal' god, you can still do all those naughty things and all you have to do to feel good about yourself is tell the magic fairy, \"I'm sorry.\" and Presto, all is peachy with the world until you need to do something equally dispicable again, something you often condemn others of doing.\n\n \n but you have to mean it and be resolved not to sin again....otherwise your commiting another sin.", 
   {}, 
   257893, 
   null, 
   1176217800.0
  ], 
  [
   257909, 
   null, 
   "nazsmith", 
   "You will have to show me that the universe is self existent. Others would have to show me that God is self existent. The point is, YOU CANNOT SHOW IT NOR CAN THEY.\n \n The only difference in the two possibilities is that one is \"impersonal\" (the universe) and the other is personal (God).\n\n \n There are many more differences. One exists within reality, one exists within imagination as a necessity. No matter how much people know about reality, \"God\" is purported to be just outside of the limit of knowledge. How people believe they can know what by definition they can't know is irrational.\n \n \n \n \n \n Some have a preference of one over the other. It is interesting to note, psychologically speaking, that those who choose the impersonal one typically are very controlling and unwilling to submit to the authority of others. They tend to own their own business because \"I can never work for anyone but myself\" and other such things. \n\n \n It's interesting to note that those who believe in fantasy find it easy to believe blind assertions. Maybe it's the fact that they need no evidence or proof at all to believe what they want. Maybe this makes it easy for them to come up with generalizations that also aren't based on evidence or proof.\n \n \n\n The personal God makes people responsible for things. An impersonal universe allows for such things as \"relative ethics\" or \"situational ethics\". Meaning that it is okay to steal if you really need something etc. A personal God means that there is a \"relationship\" that must be dealt with instead of something cold and impersonal where \"no harm\" comes. \"Impersonalism\" as a world view leads to such things as \"I can do whatever I want as long as it does not hurt anyone else\" or \"I can do whatever I want as long as I don't get caught.\" \n\n \n The personal \"god\" doesn't make people responsible because the personal god doesn't do anything. Everything you attributed to an \"impersonal universe\" (as if there is another kind) can be said about religion or superstition. Religious leaders molest, steal, and murder because their god makes it okay. This doesn't apply to all religions, of course. However, in the Bible, you could find guidelines of what to do with child female captives, a passage about Jesus stealing animals, and how murder is promoted so frequently within a religion of love. (Often murder is the punishment for other crimes, such as for a virgin who was raped but didn't cry out or tell anyone about it.)\n \n \n \n\n The problem with both of those is that people ALWAYS live in relationship with others. (Unless you have hidden in a cave all your life and even then your family might have something to say about that.) There is no such thing as a victimless crime. Just doing pot for example. Many think this is victimless, but if you look at the toll on the family and the cost to local health officials, one can find the harm it does to others.\n\n \n \n What is wrong with doing anything you want as long as it doesn't hurt anyone? This doesn't address that. What this does is assert that it's impossible to do anything you want without hurting someone else. All one has to do is propose a situation in which no one else is affected. (What if there is no family, what if the person's health remains intact or the person is wealthy enough to cover all costs?)\n So what is wrong with a person deciding to do something *you* don't agree with, if it affects no one else? I doubt you can answer the question. I presume that you will state that no one on the planet can do something without affecting another person. \n Believing in things without any basis in reality has made it hard for you to separate fantasy from the real world. There may be nothing inherently wrong with some things, but in your imagination there is--so you believe there is in reality as well. Maybe you can't see how this makes it hard to have a rational discussion. Unavoidably, there will be things about reality that you either ignore or imagine; either way, it will be true to you.\n BTW, doing pot isn't a crime in certain places. If it is, it's because of the local government, not because of a personal god.\n \n \n I am not anti-religion, even though believing in the supernatural isn't rational. However, I agree that some people (seemingly like you) need to believe in a personal god to make them behave morally. Some people cannot be trusted to behave as decent human beings if they don't have a fear of something infinitely powerful, a boogie man \"that must be dealt with.\" I know that some people function better with their delusions than without (and some cannot function even poorly). I do not feel these people need to think rationally -- vs irrationally--as long as they aren't hurting anyone else by doing so. (oh no! impersonalism!)", 
   {}, 
   257698, 
   null, 
   1176219900.0
  ], 
  [
   257913, 
   null, 
   "nazsmith", 
   "Where do you get ideas like this?\n \n You are simplistically saying that if you do not believe in God you are\n [*]Impersonal [*]Typically very controlling[*]Unwilling to submit to authority of others[*]Tend to own your own business[*]Not \"responsible for things\" [*]Essentially have no morals or ethics or ability to have human relationships\n \n Do you really believe this silliness? On what do you base such completely unfounded statements????? Please answer this. \n \n \n\n \n Exactly -- it doesn't need to be based on anything to believe it. That's why huck left reality and went to \"faith\" in the discussion. Blind faith allows a person to believe anything s/he wants, it doesn't have to be based on anything within reality. The statements can seem unfounded or silly to you, but that means nothing to me if I choose to think within the incomprehensible laws of fantasy and superstition while ignoring the restricting laws of logic. Would you argue with a schizophrenic about why he believes the things he does? It's his belief, it isn't rational, so it doesn't need any reason other than the simple choice to believe in it (ala faith).", 
   {
    "unicode_changes_made": true
   }, 
   257820, 
   null, 
   1176220680.0
  ], 
  [
   257914, 
   null, 
   "Zardoz", 
   "Isn't that the nature of forgiveness regardless of whether or not there is a God? That's the case when ANYONE truly forgives you. If your child accidently catches the kitchen on fire, you can hold a grudge all your life or you can forgive him. Hopefully, you'll forgive. This may surprise you, but you really don't have to be religious or believe in God at all to forgive someone.\n\n \n Luke 17:3-4 \"If your brother sins, rebuke him, and if he repents, forgive him. If he sins against you seven times in a day, and seven times comes back to you and says, 'I repent,' forgive him.\" \n \n See the prerequisit for forgiveness, you must repent to the one offended.\n Now, I do agree that asking for forgiveness and granting it are fairly clear Christian concepts but, most don't go to their brother and seek forgiveness., rather they ease their troubled consciences not by seeking redress from their fellow man but, ask the sky king for forgiveness of 'all their wrongs'.\n \n You can get as much forgiveness from your pet rock and feel just as good about it. But, what about coming to another complex human being and seeking such? A lot more complicated there. \n How do you respond if the one you slighted doesn't forgive as you'd like?\n How about if you perceive no wrong doing yet your brother rebuked your for a wrong he felt?\n \n Magic fairy style forgiveness circumnavigates all those problems.\n And, if you're secretly or subconsciously forgiving yourself since no magic fairy exist, well that's their problem.\n \n As for public confession of 'sins' as called for in the bible.\n Bah, skip that. Smart people realize that even a repentant man will forever have his crimes thrown in his face. Catholics at least have a priest...not much good. \n \n \n But, this is beside the issue J., Huck was making a point that Christians tend to harm others less than those who hold an impersonal view of the universe which isn't true.\n We're all human. Prone to the same mistakes.\n A impersonal human may simply shrug it off and say 'stuff happens' just as a personal Jesus person may simply ask his magic overseer for forgiveness...while in effect, shrugging it off. No one is really making much of an effort to improve themselves. The Christian pays lip service more often than not and the non believer sees little reason to do even that.", 
   {}, 
   257893, 
   null, 
   1176220980.0
  ], 
  [
   257934, 
   null, 
   "sinjin", 
   "You will have to show me that the universe is self existent. Others would have to show me that God is self existent. The point is, YOU CANNOT SHOW IT NOR CAN THEY.\n \n The only difference in the two possibilities is that one is \"impersonal\" (the universe) and the other is personal (God). \n \n Huck\nI appreciate your posting style Huck. I would observe another difference between the two positions. I can show you a universe in the first place. Not so with God. God is the introduction of another entity and therefore I see it as suseptible to razoring.", 
   {}, 
   257698, 
   null, 
   1176225600.0
  ], 
  [
   257980, 
   null, 
   "huckleberry", 
   "I appreciate your posting style Huck. I would observe another difference between the two positions. I can show you a universe in the first place. Not so with God. God is the introduction of another entity and therefore I see it as suseptible to razoring.\n\n \n However, I can also show you that at one point in time, the universe was NOT. Therefore, I can with relative assurance say that it, that which is observable anyway, is not self existent. However, there is the possibility that it is part of some cyclical cataclysm or something like that. But, no one knows what that is. \n \n I could just as easily say that the universe was NOT at one point therefore, it must have been created by something that always was. There is no data to substantiate either claim.\n \n Huck\n \n PS, thanks for your comments on my posting style it is much appreciated.", 
   {}, 
   257934, 
   null, 
   1176241860.0
  ], 
  [
   257981, 
   null, 
   "huckleberry", 
   "\n But, this is beside the issue J., Huck was making a point that Christians tend to harm others less than those who hold an impersonal view of the universe which isn't true.\n We're all human. Prone to the same mistakes.\n A impersonal human may simply shrug it off and say 'stuff happens' just as a personal Jesus person may simply ask his magic overseer for forgiveness...while in effect, shrugging it off. No one is really making much of an effort to improve themselves. The Christian pays lip service more often than not and the non believer sees little reason to do even that.\n\n \n Not true. I was saying those that hold a specific world view. There are many christians who claim such a world view and have no idea that their world view is just as controlling in reality. People of all faiths (and no faiths) are really awesome at DENIAL. \n \n I speak merely of those who truly hold that world view.\n \n Huck\n \n Just realized that what I wrote was really confusing. Some christians have a world view that leads to forgiveness and love. others have one that leads to control and manipulation. Other non christians are in the same boat. Chritianity teaches (largely anyway) the forgiveness and love worldview. People just don't have a clue how to enact it. Many would deny that they need to (christian or otherwise).\n \n H", 
   {}, 
   257914, 
   null, 
   1176242040.0
  ], 
  [
   257999, 
   null, 
   "trebor", 
   "However, I can also show you that at one point in time, the universe was NOT. Therefore, I can with relative assurance say that it, that which is observable anyway, is not self existent. However, there is the possibility that it is part of some cyclical cataclysm or something like that. But, no one knows what that is. \n \n I could just as easily say that the universe was NOT at one point therefore, it must have been created by something that always was. There is no data to substantiate either claim.\n \n Huck\n \n PS, thanks for your comments on my posting style it is much appreciated.\n\n \n Why must something that gets formed need to be 'created'?", 
   {}, 
   257980, 
   null, 
   1176245220.0
  ], 
  [
   258005, 
   null, 
   "INRI", 
   "The fact that it did get formed persuposes a force that created it.", 
   {}, 
   257999, 
   null, 
   1176248880.0
  ], 
  [
   258006, 
   null, 
   "huckleberry", 
   "Why must something that gets formed need to be 'created'?\n\n \n Why MUST it NOT be created?\n \n Neither case is provable as neither is observable in any way. In fact time is seen to begin at the big bang and therefore, \"before time\" has little meaning to our pea brains. We merely presuppose it to be and argue from there. It makes for difficult argumentation.", 
   {}, 
   257999, 
   null, 
   1176249540.0
  ], 
  [
   258020, 
   null, 
   "sinjin", 
   "I could just as easily say that the universe was NOT at one point therefore, it must have been created by something that always was. There is no data to substantiate either claim.\n \n Huck\nOr a continuation of something that always was. I don't think all claims should merit equal consideration in the absence of direct evidence. Do you?", 
   {}, 
   257980, 
   null, 
   1176250680.0
  ], 
  [
   258140, 
   null, 
   "Archangel", 
   "I appreciate your posting style Huck. I would observe another difference between the two positions. I can show you a universe in the first place. Not so with God. God is the introduction of another entity and therefore I see it as suseptible to razoring.\n\n \n Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?", 
   {}, 
   257934, 
   null, 
   1176309180.0
  ], 
  [
   258153, 
   null, 
   "sinjin", 
   "Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?\nWhy should I make allowance for such a thing? First I conjur an all-powerful, timeless being behind it all and then cast him as a deceiver? To what end? If I suggested that Hindu cosmology was in fact the correct scenario describing reality would you accept it as a possibility?", 
   {}, 
   258140, 
   null, 
   1176312360.0
  ], 
  [
   258161, 
   null, 
   "thelmoose", 
   "Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?\n\n \n According to current observation, it looks like the universe is 14 billion years old.\n \n This could be because it is. \n OR\n Because it is 25 thousand years old and God made it look exactly like it was 14 billion years old. \n \n You decide the latter is more likely? I guess that is one way to go through life.", 
   {}, 
   258140, 
   null, 
   1176313740.0
  ], 
  [
   258178, 
   null, 
   "Zardoz", 
   "Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?\n\n \n Actually if you read your bible, you'll realise that this is logically impossible.\n \n 1) What your stating is a form of deception by God. Deception is a form of lying. \n 2) The bible explicity says God is incapable of lying, that's the realm of the deceiver who art called Satan.\n \n You simply can't have it anyway you want without paying homage to Baal.", 
   {}, 
   258140, 
   null, 
   1176315900.0
  ], 
  [
   258193, 
   null, 
   "ShadowPikachu", 
   "Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?\n\n \n Archangel, do you realise you make your God sound like a scheming, deceptive liar who can't be trusted or relied upon to give a straight answer? How are we to trust anything in the Bible at all if God is a liar and the Bible is supposedly His word?\n \n And it's really, really sad that you have to resort to twisting the words of the bible so enormously to sustain your faith which seems to depend on a literal interpretation of the Bible.", 
   {}, 
   258140, 
   null, 
   1176319800.0
  ], 
  [
   258239, 
   null, 
   "huckleberry", 
   "Or a continuation of something that always was. I don't think all claims should merit equal consideration in the absence of direct evidence. Do you?\n\n \n Lacking any evidence, why not? There is no evidence of what was before time, at least not direct evidence. It is not observable. To say that GOd might exist is as legitimate as saying \"something\" might exist that always was. We have only a \"faith\" of what that might be.\n \n Huck", 
   {}, 
   258020, 
   null, 
   1176328860.0
  ], 
  [
   258261, 
   null, 
   "sinjin", 
   "Lacking any evidence, why not? There is no evidence of what was before time, at least not direct evidence. It is not observable. To say that GOd might exist is as legitimate as saying \"something\" might exist that always was. We have only a \"faith\" of what that might be.\n \n Huck\nThen why not a giant chicken beyond space and time that hatched the universe from its egg? Just as likely? Why a super being that made the universe? Why is that accepted as plausible? Tradition I suspect. \n \n The something I had in mind was a cycle of universes coming into being and passing away over and over. A natural process. Is expecting there to be a natural explanation that eludes us presently faith?", 
   {}, 
   258239, 
   null, 
   1176332940.0
  ], 
  [
   258273, 
   null, 
   "huckleberry", 
   "Then why not a giant chicken beyond space and time that hatched the universe from its egg? Just as likely? Why a super being that made the universe? Why is that accepted as plausible? Tradition I suspect. \n \n The something I had in mind was a cycle of universes coming into being and passing away over and over. A natural process. Is expecting there to be a natural explanation that eludes us presently faith?\nyes it is faith.\n \n However, the chicken one we could reasonably throw out as there is nothing that even gives rise to that suspicion. For God, there could certainly be claimed his \"revelation\" to humans. For the universe cycling, there could be claimed some evidence showing cyclical events already in existence with extrapolation leading to that possibility. I believe there are about two other serious possibilities given extrapolations.\n \n We can make some guesses. But God is as good a guess. While there is no proof of God there is evidence.\n \n Huck", 
   {}, 
   258261, 
   null, 
   1176338340.0
  ], 
  [
   258283, 
   null, 
   "Archangel", 
   "Archangel, do you realise you make your God sound like a scheming, deceptive liar who can't be trusted or relied upon to give a straight answer? How are we to trust anything in the Bible at all if God is a liar and the Bible is supposedly His word?\n \n And it's really, really sad that you have to resort to twisting the words of the bible so enormously to sustain your faith which seems to depend on a literal interpretation of the Bible.\n\n \n How do you come up with this stuff SP ? Just because man in his finite ignorance misinterprets what God Has done in His infinite wisdom, then God is the liar and the deceiver ? How can the sculptor be made to answer to the rock he forms through His own creativity. Your whole perspective is warped if my scenario leads you to blame God for something rather than to reconsider your beliefs about the beginnings of Time and Space. If God be God then who are we to place any absolutes on things that are both unknowable and unprovable by humanity, no matter how pompous some of us might be by assuming they can say what actually did happen 14 + Billion years ago. If it even did happen then. And in all sincerity SP, I repeat my question as it is reasonable and very possible from Gods point of view. Here it is again...\n \n \nOriginally Posted by Archangel \n Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?\n", 
   {}, 
   258193, 
   null, 
   1176340680.0
  ], 
  [
   258289, 
   null, 
   "ShadowPikachu", 
   "How do you come up with this stuff SP ? Just because man in his finite ignorance misinterprets what God Has done in His infinite wisdom, then God is the liar and the deceiver ? How can the sculptor be made to answer to the rock he forms through His own creativity. Your whole perspective is warped if my scenario leads you to blame God for something rather than to reconsider your beliefs about the beginnings of Time and Space. If God be God then who are we to place any absolutes on things that are both unknowable and unprovable by humanity, no matter how pompous some of us might be by assuming they can say what actually did happen 14 + Billion years ago. If it even did happen then. And in all sincerity SP, I repeat my question as it is reasonable and very possible from Gods point of view. Here it is again...\n\n \n As was said by someone else, for God to put out such deceptive evidence (making things seem much older than they are), he would be attempting to decieve us, and deceit is linked to lies, and that just does not mesh with pretty much any interpretation of the bible. If you want to beleive in a God that you fear and that you believe puts out such deceptive \"evidence\", have fun, but I don't think you'll find many people that want to convert to your form of \"Christianity\".", 
   {}, 
   258283, 
   null, 
   1176343320.0
  ], 
  [
   258314, 
   null, 
   "trebor", 
   "Why MUST it NOT be created?\n \n Neither case is provable as neither is observable in any way. In fact time is seen to begin at the big bang and therefore, \"before time\" has little meaning to our pea brains. We merely presuppose it to be and argue from there. It makes for difficult argumentation.\n\n \n There is no evidence it was 'created' rather than just formed. As for the various cosmologies, you are behind the times, so to speak.", 
   {}, 
   258006, 
   null, 
   1176354900.0
  ], 
  [
   258321, 
   null, 
   "Archangel", 
   "As was said by someone else, for God to put out such deceptive evidence (making things seem much older than they are), he would be attempting to decieve us, and deceit is linked to lies, and that just does not mesh with pretty much any interpretation of the bible. If you want to beleive in a God that you fear and that you believe puts out such deceptive \"evidence\", have fun, but I don't think you'll find many people that want to convert to your form of \"Christianity\".\n\n \n My point is, why do you insist that He set out to deceive us just because we misinterpret the evidence ? Why do you claim and insist deception was His intention ? Why can't you see that we may have just misinterpreted the available evidence. So the error is ours and involved no deception what so ever. \n \n God does not lie or deceive SP. As the author of life He doesn't have to because there is nothing He fears or can't control if He chooses to. But beside that, He is a perfect, just and holy God. He created us in love for fellowship, to have a personal relationship with each of us as a Father loves a child. He has no desire to deceive or lie to us at all. \n \n The greatest lesson one can learn is that nothing appears as it truly is in this World of deception and lies. The bible says that over and over again. The father of lies is the god of this world and his name is satan/lucifer. You must discern his lies from Gods truth. \n \n Now don't go accusing me of preaching again because I'm not insisting that anyone believe what I'm saying. But I'm speaking the spiritual truth that I know is truth but feel free not to see it that way.", 
   {}, 
   258289, 
   null, 
   1176357900.0
  ], 
  [
   258328, 
   null, 
   "Shooterandproud", 
   "Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?\n\n \n That is possible, however it is also possible that little fairy men created the world and that everything you see around you is an illusion created by them, and that you exist in a different realm but the fairy men are leading you to believe that you exist in this realm.\n \n My point is, there are a lot of possible explanations, however not all of them are plausible.", 
   {}, 
   258140, 
   null, 
   1176364320.0
  ], 
  [
   258330, 
   null, 
   "ShadowPikachu", 
   "Regarding the bolded, you make assumptions that because the Universe is expanding, and because we can measure the seeming passage of time in calculating the distance light has traveled to reach our telescopes, that the Universe is 14 billion years old, right ? Scientifically this seems reasonable and like reliable deductions.\n \n But what if God created the Universe 25,000 years ago and started with an initial big bang in which He then stretched time and Space out until it appears as it does today ? Can you say for certain that we aren't, from our very finite and limited perspective misinterpreting all the assumptions you are making regarding the evolution of the Universe ?\n\n \n Well, I personally think that the Gremlins and the Leprechauns made an alliance in 3086 B.C. and made the agreement to run amock throughout the world and mess with any instruments made by man - especially by scientists. That is why everything seems to be only 14 billion years old - the gremlins mess with all of our machines (spectrographic equipment, radio-isotope equipment, etc.), and the Leprechauns use their power over rainbows to mess with our telescopes. emoticon_rolleyes emoticon_rolleyes\n \n The funny thing is, my scenario is both just as provable, and just as probable, as your little story.", 
   {}, 
   258140, 
   null, 
   1176366660.0
  ], 
  [
   258339, 
   null, 
   "Zardoz", 
   "My point is, why do you insist that He set out to deceive us just because we misinterpret the evidence ? Why do you claim and insist deception was His intention ? Why can't you see that we may have just misinterpreted the available evidence. So the error is ours and involved no deception what so ever.\n\n \n I made the statement based on biblical knowledge.\n \n We don't question intent. Just RESULTS.\n \n If I don't set out with intent to sin, is it still a sin if I do something God doesn't want me to do? Of course it IS. The same applies with deception.\n God simply can not decieve, with intent or without. And EVERYTHING God does is with intent...he doesn't do anything accidentally or even incidentally.\n \n There would be no reason for God to create the universe several thousand years ago 'in progress' to make it look older by human senses and He knows the limit of out senses.\n There would be no need to have humans think wrongly over the universe.\n So, the logical conclusion is that the universe IS millions/billions of years old (as God would want) and Your perception and interpretations are wrong.", 
   {}, 
   258321, 
   null, 
   1176385800.0
  ], 
  [
   258382, 
   null, 
   "huckleberry", 
   "There is no evidence it was 'created' rather than just formed. As for the various cosmologies, you are behind the times, so to speak.\n\n \n \n Just forming out of nothing is evidence of creation by definition.", 
   {}, 
   258314, 
   null, 
   1176409080.0
  ], 
  [
   258534, 
   null, 
   "trebor", 
   "Just forming out of nothing is evidence of creation by definition.\n\n \n No, it isn't. It is formation. If it is not, then 'creation' does not need a 'creator'.", 
   {}, 
   258382, 
   null, 
   1176507240.0
  ], 
  [
   258539, 
   null, 
   "huckleberry", 
   "No, it isn't. It is formation. If it is not, then 'creation' does not need a 'creator'.\n\n \n The definition from dictionary.com\n \n noun 1. the act of producing or causing to exist \n \n \n ie forming from nothing. that is \"creation\" by definition. Please.", 
   {}, 
   258534, 
   null, 
   1176508920.0
  ], 
  [
   258553, 
   null, 
   "trebor", 
   "The definition from dictionary.com\n \n noun 1. the act of producing or causing to exist \n \n \n ie forming from nothing. that is \"creation\" by definition. Please.\n\n \n In that case, the start of existance of the universe is not proven to be a 'creation'. It is merely a formation.", 
   {}, 
   258539, 
   null, 
   1176513180.0
  ], 
  [
   258561, 
   null, 
   "Winston Smith", 
   "hmm... so a painting is not a creation and neither are any artistic produce such as music, poems, plays, and fiction of any kind?\n \n And God did not create the Universe (and us eventually) for the Universe was in a way 'inside' God; the Universe does not comes out of nothing therefore is what? a 'formation'?", 
   {}, 
   258553, 
   null, 
   1176515160.0
  ], 
  [
   258571, 
   null, 
   "trebor", 
   "hmm... so a painting is not a creation and neither are any artistic produce such as music, poems, plays, and fiction of any kind?\n \n And God did not create the Universe (and us eventually) for the Universe was in a way 'inside' God; the Universe does not comes out of nothing therefore is what? a 'formation'?\n\n \n \n There is a diffence between a painting, and the universe.\n \n A painting, we know man created. \n \n For the universe, there is no evidence of a 'creator'.", 
   {}, 
   258561, 
   null, 
   1176516840.0
  ], 
  [
   258599, 
   null, 
   "Winston Smith", 
   "I agree that there is no evidence of a creator of the universe but that is not the point.\n \n the point I was referring to is that according to hucky a creation has to come out of nothing. Therefore man can not 'create' anything.\n This is to me absurd as it would deny artistic creations and technical inventions.\n \n How can it be possible for something to come out of nothing?", 
   {}, 
   258571, 
   null, 
   1176543240.0
  ], 
  [
   258993, 
   null, 
   "huckleberry", 
   "In that case, the start of existance of the universe is not proven to be a 'creation'. It is merely a formation.\n\n \n How do you get that from this definition? I think it is pretty clear that it is indeed a \"creation\".\n \n Huck", 
   {}, 
   258553, 
   null, 
   1176760980.0
  ], 
  [
   259045, 
   null, 
   "trebor", 
   "How do you get that from this definition? I think it is pretty clear that it is indeed a \"creation\".\n \n Huck\n\n \n Because, there is no evidence for a 'creator', and according to your defintion, a 'creation' needs a creator.\n \n \"Self evident\" things often are not true.", 
   {}, 
   258993, 
   null, 
   1176769020.0
  ], 
  [
   259049, 
   null, 
   "Archangel", 
   "Because, there is no evidence for a 'creator', and according to your defintion, a 'creation' needs a creator.\n \n \"Self evident\" things often are not true.\n\n \n How can you possibly look at, and experience the World around you and not recognize the Creator's hand in it ? And how can you not see the evidence of a loving Creator in this World at that Trebor ?", 
   {}, 
   259045, 
   null, 
   1176769560.0
  ], 
  [
   259050, 
   null, 
   "sinjin", 
   "How can you possibly look at, and experience the World around you and not recognize the Creator's hand in it ? And how can you not see the evidence of a loving Creator in this World at that Trebor ?\nBy taking off the rose colored glasses? How can you look at all the needless suffering of innocents and believe some being who loves us is running the show? What kind of god allows babies to die in car crashes or be swept away by tsunami?", 
   {}, 
   259049, 
   null, 
   1176770100.0
  ], 
  [
   259053, 
   null, 
   "trebor", 
   "How can you possibly look at, and experience the World around you and not recognize the Creator's hand in it ? And how can you not see the evidence of a loving Creator in this World at that Trebor ?\n\n \n Very simply. There is no 'loving creator' behind this. There is no 'creator' period.\n \n THat is your projecting your superstitions onto the world.", 
   {}, 
   259049, 
   null, 
   1176770340.0
  ], 
  [
   259057, 
   null, 
   "huckleberry", 
   "Trebor:\n \n The something coming from nothing indicates a creation. That is evidence for a creator. You have the reasoning backwards. You are looking at it inductively and it is clearly deductive.\n \n Huck", 
   {}, 
   259053, 
   null, 
   1176771660.0
  ], 
  [
   259062, 
   null, 
   "MrWriteLA", 
   "There is no 'loving creator' behind this. There is no 'creator' period.\n It's a simple matter of \"Man creating God in his own image.\" \n \n Since Man makes things, he illogically assumes everything must have been similarly \"created\"--if they couldn't have been created by man, then it must have been by a vastly more powerful craftsman.", 
   {}, 
   259053, 
   null, 
   1176772500.0
  ], 
  [
   259064, 
   null, 
   "ShadowPikachu", 
   "It's a simple matter of \"Man creating God in his own image.\" \n \n Since Man makes things, he illogically assumes everything must have been similarly \"created\"--if they couldn't have been created by man, then it must have been by a vastly more powerful craftsman.\n\n \n Yes, and I think the Arthur C. Clarke quote in my sig puts it perfectly.", 
   {}, 
   259062, 
   null, 
   1176773400.0
  ], 
  [
   259177, 
   null, 
   "huckleberry", 
   "It's a simple matter of \"Man creating God in his own image.\" \n \n Since Man makes things, he illogically assumes everything must have been similarly \"created\"--if they couldn't have been created by man, then it must have been by a vastly more powerful craftsman.\n\n \n \n The problem is that while you discount God or a creator, you have ZERO way to explain how something came from nothing. There is no evidence, there is no observation. There are ONLY positions of faith. Something did indeed come from nothing. The big bang theory clearly puts forth that something came blasting out of nothingness. Why?\n \n Huck", 
   {}, 
   259062, 
   null, 
   1176844260.0
  ], 
  [
   259188, 
   null, 
   "nazsmith", 
   "The problem is that while you discount God or a creator, you have ZERO way to explain how something came from nothing. There is no evidence, there is no observation. There are ONLY positions of faith. Something did indeed come from nothing. The big bang theory clearly puts forth that something came blasting out of nothingness. Why?\n \n Huck\n\n \n Huck, you keep saying something came from nothing and then explain it with faith in a supernatural creature. This shows some flaws.\n \n One, you say that something came from nothing, so \"god\" caused the something. Evidently, something didn't come from nothing by this explanation. You're throwing \"god\" in place of the alleged gap. However, your explanation wipes out the foundation of the question it seeks to answer!\n \n Two, you ignore the law of conservation of mass-energy. It cannot be Created. Mass-energy was always here.\n \n Three, you have to presume that there was nothing. You have no reason to propose that there was nothing, and then demand an invalid explanation, but you still have the burden of proof to show that there was nothing. No one has evidence of nothing. It's analagous to asking, \"What came from the pink unicorn?\" No one has shown that there was a pink unicorn.\n \n Four, fact -- even perfect vacuums have energy. This may be mind boggling. Hopefully Hawking has a decent article about this. You can google vacuum fluctuations sometime.\n \n Five, the big bang doesn't say there was absolutely nothing before the big bang. The big bang is about what happened then and after.\n \n Six, you seek to explain your \"faith\" rationally. This makes no sense. Faith requires belief with no evidence. Ration requires logic, fact, and reasoning based on reality. Faith needs none of this.\n \n Seven, quantum theory shows how something can come from \"nothing\" although \"nothing\" isn't really nothing as we like to say it.\n \n Eighth, and this is touching the very limits of our common sense, not everything has to be \"caused\" or an \"effect.\" I know, it just doesn't make sense. I still can't believe that radioactive decay is random.\n \n However, you can have all the faith you want. Don't try to use reasoning or science to get to it, since neither reasoning or science can exist without evidence, facts, or reality. Faith is belief, with no limit of being connected to reality. Religious people, superstitious people and schizophrenics can believe things with no proof, this is faith. \n You are free to have faith just because. No need to try to attach reality to it.", 
   {}, 
   259177, 
   null, 
   1176845820.0
  ], 
  [
   259189, 
   null, 
   "MrWriteLA", 
   "As Ethan Allen put it: \nThose who invalidate reason ought seriously to consider whether they argue against reason with or without reason; if with reason, then they establish the principles that they are laboring to dethrone: but if they argue without reason (which, in order to be consistent with themselves they must do), they are out of reach of rational conviction, nor do they deserve a rational argument.\n Ethan Allen, \"Reason, the Only Oracle of Man\"\n", 
   {}, 
   259188, 
   null, 
   1176846300.0
  ], 
  [
   259201, 
   null, 
   "huckleberry", 
   "Huck, you keep saying something came from nothing and then explain it with faith in a supernatural creature. This shows some flaws.\n \n One, you say that something came from nothing, so \"god\" caused the something. Evidently, something didn't come from nothing by this explanation. You're throwing \"god\" in place of the alleged gap. However, your explanation wipes out the foundation of the question it seeks to answer!\n \n Two, you ignore the law of conservation of mass-energy. It cannot be Created. Mass-energy was always here.\n \n Three, you have to presume that there was nothing. You have no reason to propose that there was nothing, and then demand an invalid explanation, but you still have the burden of proof to show that there was nothing. No one has evidence of nothing. It's analagous to asking, \"What came from the pink unicorn?\" No one has shown that there was a pink unicorn.\n \n Four, fact -- even perfect vacuums have energy. This may be mind boggling. Hopefully Hawking has a decent article about this. You can google vacuum fluctuations sometime.\n \n Five, the big bang doesn't say there was absolutely nothing before the big bang. The big bang is about what happened then and after.\n \n Six, you seek to explain your \"faith\" rationally. This makes no sense. Faith requires belief with no evidence. Ration requires logic, fact, and reasoning based on reality. Faith needs none of this.\n \n Seven, quantum theory shows how something can come from \"nothing\" although \"nothing\" isn't really nothing as we like to say it.\n \n Eighth, and this is touching the very limits of our common sense, not everything has to be \"caused\" or an \"effect.\" I know, it just doesn't make sense. I still can't believe that radioactive decay is random.\n \n However, you can have all the faith you want. Don't try to use reasoning or science to get to it, since neither reasoning or science can exist without evidence, facts, or reality. Faith is belief, with no limit of being connected to reality. Religious people, superstitious people and schizophrenics can believe things with no proof, this is faith. \n You are free to have faith just because. No need to try to attach reality to it.\n\n \n Actually, let me try this question on you, What was there before time? What was there before the big bang? Do you know? Do you have an observational evidence? Is it possible to observe it at all? The concept of \"before time\" is a paradox at its best. Did time always exist? The evidence surrounding the big bang says no. There was a distinct beginning.\n \n Hawking's analysis is that the universe is either bounded and infinite or finite with no boundary. Again a bit of a paradox. I do not need to have faith nor prove it. \n \n You are quite right to say not everything has a cause and effect. In fact, I said that many posts ago. What that means (since you obviously did not read far enough back, I will duplicate my efforts once) is that SOMETHING must be self existent. I do not propose that something to be specifically God, only that God is a legitimate option. There are other legitimate options (again go back and read a little further back please, I do not like repeating the same arguments).\n \n As to quantum theory, it breaks down rather rapidly during the initial moments of the universe.\n \n As to seeking to explain my faith rationally, you mistakenly assume I have a specific faith. I do not. I am merely pointing out the objective possibilities and have been all along. Again, go back and read my posts.\n \n The conservation of mass and energy only apply to the universe after the big bang. Not before which is what the discussion is about. \n \n I do propose that there was not a universe at one point. The data are clear on this point. The universe \"came into existence\" at the time of the big bang from a singularity. The nature of that singualrity is only hypothetical as there is no data on it. It is presuposed because we can observe singualrities here in the universe, but time is another story. Take the equations back far enough and time stops at the beginning. What is predicted before that is that there is nothing. Why? because the equation is asymptotic at zero time.\n \n There is a limit. Even if you rotate the equations through spherical coordinates or cylindrical coordinates you approach an asymptote.\n \n Huck", 
   {}, 
   259188, 
   null, 
   1176853020.0
  ], 
  [
   259264, 
   null, 
   "nazsmith", 
   "Actually, let me try this question on you, What was there before time?\n\n \n You asked that question before. There's no such thing as before time. You're making an irrational assertion and demanding an answer. Accordingly, the only one you're satisfied with is an irrational explanation. \"How were square-circles created?\" Goddidit.\n \n \n \n \nI do not propose that something to be specifically God, only that God is a legitimate option. There are other legitimate options (again go back and read a little further back please, I do not like repeating the same arguments).\n\n \n God is only legitimate if we agree to abandon rational thinking. As I said, it's fine if you want to have faith, but there's no need to try to get there from logic. (It won't happen.) However you look at it, you will have to make that leap that we call faith. Faith allowed you to ignore Occam's Razor a few posts back.\n I admit I'm assuming I don't have to read your other arguments. You're proposing a supernatural non-explanation to a question about reality. That's the only argument I'm discussing. I admit I have a fault in that when I hear people talk about magical things, I become doubtful. I may read the other arguments, but if they don't assert magic or goddidit, I'll have no qualms.\n \n \n \n\n As to seeking to explain my faith rationally, you mistakenly assume I have a specific faith. I do not. I am merely pointing out the objective possibilities and have been all along. Again, go back and read my posts.\n\n \n I don't know if you have a specific faith. The faith you need to posit \"god\" is belief without evidence, rationality, and any basis within reality. Whether it's a religious faith, superstitious faith, or schizophrenic faith doesn't matter to me. Goddidit is necessarily a very subjective possibility.\n \n \n \n \n\n The conservation of mass and energy only apply to the universe after the big bang. Not before which is what the discussion is about.\n\n \n Says who? \n \n \n \n\n I do propose that there was not a universe at one point. The data are clear on this point. The universe \"came into existence\" at the time of the big bang from a singularity. The nature of that singualrity is only hypothetical as there is no data on it. It is presuposed because we can observe singualrities here in the universe, but time is another story. Take the equations back far enough and time stops at the beginning. What is predicted before that is that there is nothing. Why? because the equation is asymptotic at zero time.\n\n \n If you have zero volume, you can have all the energy of the universe without time. (Time needs space.) Existence can 'exist' without time looking at this. Mind bottling*, isn't it?\n \n You're also assuming there was a true nothing. I'd like to see sources that say there was absolutely no energy or anything. It would be nice to read articles that clearly state there was a time before the singularity that nothing existed. Otherwise, to assume \"nothing\" -- well, I already talked about this. I'm almost convinced your faith won't allow you to stop asserting this.\n \n (By true nothing, I mean no energy, no existence of anything.)\n \n You still don't see that goddidit doesn't answer the question of \"How did something come from nothing?\" Goddidit is something, which means--minimally--the question isn't answered. You assert that goddidit was already there, which means you answered \"How did something come from nothing?\" with \"Something made something.\"\n \n BTW, goddidit, even if it exists, doesn't answer the \"how\" part of the question. Here's an analogy, \"How was this building designed?\" \"Oh, John did it.\" \n In practical terms, all goddidit does is take a currently unexplained phenomena and classify it as forever unexplainable. History has taught us that the god of gaps is a very weak band-aid.\n \n I think the problem may be asking the wrong question. You should probably answer \"Was there truly a 'nothing'?\" before asserting god. (I still say something had to be here; nothing can't do anything, this includes existing.)\n I can't ask \"How do pink unicorns metabolize energy from elf juice?\" without answering \"Was there ever truly a 'pink unicorn'?\"\n \n So, take the question away. God will probably go with it.\n \n \n *anyone see that movie? Is it funny?", 
   {}, 
   259201, 
   null, 
   1176915180.0
  ], 
  [
   259281, 
   null, 
   "James", 
   "No problem of cosmology digs more deeply into the foundations of physics than the question of what preceded the initial state of infinite (or near infinite) density and temperature at the \"moment\" of the Big Bang.\n \n However, why is it \"irrational\" to approach the problem like this: \n \n 1. Everything that begins to exist has a cause of its existence.\n 2. The universe began to exist.\n 3. Therefore, the universe has a cause of its existence.\n \n And if we imagine the universe \"jumping into existence\" without a cause - which may not be logically impossible - it is inconsistent with everything we understand about the world in which we live. So why should we repudiate this intuition when we think about the origin of space and time? \n \n James.", 
   {}, 
   259264, 
   null, 
   1176918300.0
  ], 
  [
   259295, 
   null, 
   "sinjin", 
   "No problem of cosmology digs more deeply into the foundations of physics than the question of what preceded the initial state of infinite (or near infinite) density and temperature at the \"moment\" of the Big Bang.\n \n However, why is it \"irrational\" to approach the problem like this: \n \n 1. Everything that begins to exist has a cause of its existence.\n 2. The universe began to exist.\n 3. Therefore, the universe has a cause of its existence.\n \n And if we imagine the universe \"jumping into existence\" without a cause - which may not be logically impossible - it is inconsistent with everything we understand about the world in which we live. So why should we repudiate this intuition when we think about the origin of space and time? \n \n James.\nMaybe \"reality\" is not bounded by our conceptual understanding.", 
   {}, 
   259281, 
   null, 
   1176921540.0
  ], 
  [
   259298, 
   null, 
   "johnhanks", 
   "Hawking's analysis is that the universe is either bounded and infinite or finite with no boundary. Again a bit of a paradox.\n\n The surface of a sphere is finite, but has no boundary. How is this paradoxical?", 
   {}, 
   259201, 
   null, 
   1176922200.0
  ], 
  [
   259304, 
   null, 
   "thelmoose", 
   "No problem of cosmology digs more deeply into the foundations of physics than the question of what preceded the initial state of infinite (or near infinite) density and temperature at the \"moment\" of the Big Bang.\n \n However, why is it \"irrational\" to approach the problem like this: \n \n 1. Everything that begins to exist has a cause of its existence.\n 2. The universe began to exist.\n 3. Therefore, the universe has a cause of its existence.\n \n And if we imagine the universe \"jumping into existence\" without a cause - which may not be logically impossible - it is inconsistent with everything we understand about the world in which we live. So why should we repudiate this intuition when we think about the origin of space and time? \n \n James.\n\n \n This is merely the \"argument from first cause\" going back to Plato and Aristotle and then used by Aquinas as a proof for god's existence. If there must be a first cause (which itself does not have a cause) leaves open the question of why the First Cause should not require a cause.", 
   {
    "unicode_changes_made": true
   }, 
   259281, 
   null, 
   1176924960.0
  ], 
  [
   259308, 
   null, 
   "huckleberry", 
   "You asked that question before. There's no such thing as before time. You're making an irrational assertion and demanding an answer. Accordingly, the only one you're satisfied with is an irrational explanation. \"How were square-circles created?\" Goddidit.\n \n \n \n \n \n God is only legitimate if we agree to abandon rational thinking. As I said, it's fine if you want to have faith, but there's no need to try to get there from logic. (It won't happen.) However you look at it, you will have to make that leap that we call faith. Faith allowed you to ignore Occam's Razor a few posts back.\n I admit I'm assuming I don't have to read your other arguments. You're proposing a supernatural non-explanation to a question about reality. That's the only argument I'm discussing. I admit I have a fault in that when I hear people talk about magical things, I become doubtful. I may read the other arguments, but if they don't assert magic or goddidit, I'll have no qualms.\n \n \n \n \n I don't know if you have a specific faith. The faith you need to posit \"god\" is belief without evidence, rationality, and any basis within reality. Whether it's a religious faith, superstitious faith, or schizophrenic faith doesn't matter to me. Goddidit is necessarily a very subjective possibility.\n \n \n \n \n \n Says who? \n \n \n \n \n If you have zero volume, you can have all the energy of the universe without time. (Time needs space.) Existence can 'exist' without time looking at this. Mind bottling*, isn't it?\n \n You're also assuming there was a true nothing. I'd like to see sources that say there was absolutely no energy or anything. It would be nice to read articles that clearly state there was a time before the singularity that nothing existed. Otherwise, to assume \"nothing\" -- well, I already talked about this. I'm almost convinced your faith won't allow you to stop asserting this.\n \n (By true nothing, I mean no energy, no existence of anything.)\n \n You still don't see that goddidit doesn't answer the question of \"How did something come from nothing?\" Goddidit is something, which means--minimally--the question isn't answered. You assert that goddidit was already there, which means you answered \"How did something come from nothing?\" with \"Something made something.\"\n \n BTW, goddidit, even if it exists, doesn't answer the \"how\" part of the question. Here's an analogy, \"How was this building designed?\" \"Oh, John did it.\" \n In practical terms, all goddidit does is take a currently unexplained phenomena and classify it as forever unexplainable. History has taught us that the god of gaps is a very weak band-aid.\n \n I think the problem may be asking the wrong question. You should probably answer \"Was there truly a 'nothing'?\" before asserting god. (I still say something had to be here; nothing can't do anything, this includes existing.)\n I can't ask \"How do pink unicorns metabolize energy from elf juice?\" without answering \"Was there ever truly a 'pink unicorn'?\"\n \n So, take the question away. God will probably go with it.\n \n \n *anyone see that movie? Is it funny?\n\n \n When speaking of \"before time\" it is not an \"irrational question\" as you posit. it is based on those equations. There is an asymptote at zero time. There is also the converse of that asymptome at negative time. The problem is that the equations don't tell us anything about the matter or the energy at that time.\n \n You misunderstand my point completely. This is not a matter of faith. it is logic. Something must have been selfexistent. I do not define what that possibility is as the equations do not define it. I merely point out that saying the universe was self existent has as much support in the equations as God is self existent. Especially given that human beings no so incredibly little about either at the beginning of the universe. My point is that there is evidence that the universe did not exist at one time. Something must have caused its existence. Or it came from nothing. No one is actually arguing that something came from nothing. I am pointing out the illogical use of such an argument.\n \n Isaac newton who proposed the laws of conservation of mass and energy showed them to apply to the known universe. If you can show me how they apply to the unknown then I might accept that they do. until then, they do not apply as they cannot be shown to apply. \n \n John hanks. The surface of a sphere is neither infinite nor unbounded. It has a finite amount of space and it is bounded according to the equation of the form of:\n \n (x+a)squared/A + (y+b)squared/A + (z+c)squared/A = r squared.\n \n It is clearly bounded and finite as there is a finite set of points that define the surface of the sphere. You can calculate the surface area and can locate points on its surface within the boundaries.\n \n Huck", 
   {}, 
   259264, 
   null, 
   1176925860.0
  ], 
  [
   259368, 
   null, 
   "trebor", 
   "No problem of cosmology digs more deeply into the foundations of physics than the question of what preceded the initial state of infinite (or near infinite) density and temperature at the \"moment\" of the Big Bang.\n \n However, why is it \"irrational\" to approach the problem like this: \n \n 1. Everything that begins to exist has a cause of its existence.\n 2. The universe began to exist.\n 3. Therefore, the universe has a cause of its existence.\n \n And if we imagine the universe \"jumping into existence\" without a cause - which may not be logically impossible - it is inconsistent with everything we understand about the world in which we live. So why should we repudiate this intuition when we think about the origin of space and time? \n \n James.\n\n \n \n Can you prove the assumption number 1?\n \n Can you prove the assumption number 2?", 
   {}, 
   259281, 
   null, 
   1176946560.0
  ], 
  [
   259385, 
   null, 
   "James", 
   "This is merely the \"argument from first cause\" going back to Plato and Aristotle and then used by Aquinas as a proof for god's existence. If there must be a first cause (which itself does not have a cause) leaves open the question of why the First Cause should not require a cause.\n\n \n Yes, I know the history of this argument. What I asked was why it's supposed to be \"irrational\".\n \n Can you give an example of anything which came into existence without a cause? If you say the universe did, how can you establish the truth of that claim? \n \n Unless we postulate an endless series of theoretical causes, a First Cause must be self-existent. The idea that the universe began without a prior cause would make it a unique event in nature. Can you cite any evidence which confirms this singularity?\n \n In answer to trebor: The first two assumptions are consistent with a scientific understanding of natural phenomena, and they have to be made in order to make sense of the world around us. \n \n James.", 
   {
    "unicode_changes_made": true
   }, 
   259304, 
   null, 
   1176973560.0
  ], 
  [
   259401, 
   null, 
   "Zardoz", 
   "Physics and natural laws only apply to this universe. What came 'before' it or exist 'outside' it is up to pure conjecture and speculation but 'something from nothing' could be possible.\n \n Much like trying to apply rules to the imagination. Kind of like saying to another, \"you can't imagine that as it's not possible to imagine that, so stop and imagine what I'm imagining.\"", 
   {}, 
   259385, 
   null, 
   1176993480.0
  ], 
  [
   259408, 
   null, 
   "trebor", 
   "Yes, I know the history of this argument. What I asked was why it's supposed to be \"irrational\".\n \n Can you give an example of anything which came into existence without a cause? If you say the universe did, how can you establish the truth of that claim? \n \n\n \n Virtual particles.\n \n \n\n Unless we postulate an endless series of theoretical causes, a First Cause must be self-existent. The idea that the universe began without a prior cause would make it a unique event in nature. Can you cite any evidence which confirms this singularity?\n \n\n \n http://www.big-bang-theory.com/ .. And to clear up your misconcpetion, the 'Big Bang' did not ocme from nothing, ti came from a singularity in some\n models, which is not 'nothing.\n \n\n \n \n \n In answer to trebor: The first two assumptions are consistent with a scientific understanding of natural phenomena, and they have to be made in order to make sense of the world around us. \n \n James.\n\n \n Why? You hvae not given a valid reason why.", 
   {}, 
   259385, 
   null, 
   1176995460.0
  ], 
  [
   259445, 
   null, 
   "johnhanks", 
   "John hanks. The surface of a sphere is neither infinite nor unbounded. It has a finite amount of space and it is bounded according to the equation of the form of:\n \n (x+a)squared/A + (y+b)squared/A + (z+c)squared/A = r squared.\n \n It is clearly bounded and finite as there is a finite set of points that define the surface of the sphere. You can calculate the surface area and can locate points on its surface within the boundaries.\n\n You might try reading posts before you answer them. I wrote\n \nThe surface of a sphere is finite, but has no boundary.\n\n This remains true. A beetle on the finite surface of a football can wander around forever without coming to an edge.", 
   {}, 
   259308, 
   null, 
   1177007280.0
  ], 
  [
   259466, 
   null, 
   "huckleberry", 
   "You might try reading posts before you answer them. I wrote\n \n This remains true. A beetle on the finite surface of a football can wander around forever without coming to an edge.\n\n \n \n You might try reading the posts. I said it has a boundary and supplied the proof. This is an argument you did not address. I will assume you agree and admit your error.", 
   {}, 
   259445, 
   null, 
   1177015680.0
  ], 
  [
   259480, 
   null, 
   "trebor", 
   "You might try reading the posts. I said it has a boundary and supplied the proof. This is an argument you did not address. I will assume you agree and admit your error.\n\n \n \n And, on the that ball, please point to the spot that is the boundary.", 
   {}, 
   259466, 
   null, 
   1177022460.0
  ], 
  [
   259481, 
   null, 
   "AlbinoKangaroo2", 
   "I wrestle with the question of whether or not there is a God. It seems like I can prove it both ways and disprove it both ways. Does the universe need a creator to exist? Or is this just an idea inside man-made theology? Man yearns for the eternal. He wants to live forever and be strong forever. He is the only animal as far as we know which builds churches and contemplates the infinite. This in itself may be an indication that immortality resides in a soul of some kind. If there is truth in religion, I accept the premises of the New Testament.\n \n Jim Colyer\n \n\n \n \n The inconsistency within your statement is that humans are only animals for all we know. By stating that you are saying that it is morally correct to rape children and kill the elderly. There is a separation between us and the animal kingdom and that separation is unique. Even Creation Science has answers. Maybe you should look into Creation Science, your answer weren't answered by anything else.", 
   {
    "post_info": {
     "post_title": "Reply"
    }
   }, 
   251257, 
   null, 
   1177022640.0
  ], 
  [
   259482, 
   null, 
   "thelmoose", 
   "Yes, I know the history of this argument. What I asked was why it's supposed to be \"irrational\".\n \n Can you give an example of anything which came into existence without a cause? If you say the universe did, how can you establish the truth of that claim? \n \n Unless we postulate an endless series of theoretical causes, a First Cause must be self-existent. The idea that the universe began without a prior cause would make it a unique event in nature. Can you cite any evidence which confirms this singularity?\n \n In answer to trebor: The first two assumptions are consistent with a scientific understanding of natural phenomena, and they have to be made in order to make sense of the world around us. \n \n James.\n\n \n The main counter-argument is that why is the Creator excused from having a First Cause?\n \n Also, I didn't say the assumptions were irrational, I just don't know why one must assume them to be true. Just because neither of us can \"give an example of anything which came into existence without a cause\", doesn't mean that can't happen. Maybe the universe is indeed a \"unique event in nature.\" We don't know. There are lots of things that are unexplainable. I think that making up this God idea to help solve the unexplainable is a little too darn convenient a way to get out of a thorny cosmological conundrum.", 
   {}, 
   259385, 
   null, 
   1177022820.0
  ], 
  [
   259489, 
   null, 
   "huckleberry", 
   "And, on the that ball, please point to the spot that is the boundary.\n\n \n Equations describe boundaries. It is bounded by the curve with the equation in the format I previously posted. Have you had a maths class on analytic geometry by any chance? If not, I highly suggest one. it provides interesting frame of reference for these kinds of discussions.", 
   {}, 
   259480, 
   null, 
   1177025160.0
  ], 
  [
   259508, 
   null, 
   "Zardoz", 
   "The inconsistency within your statement is that humans are only animals for all we know. By stating that you are saying that it is morally correct to rape children and kill the elderly. There is a separation between us and the animal kingdom and that separation is unique. Even Creation Science has answers. Maybe you should look into Creation Science, your answer weren't answered by anything else.\n\n \n \n Morality is flexible.\n \n In times of crisis, it would be morally acceptably to rape someone considered a child to perpetuate the human race. Provided you mean child as a 'minor' and rape as against intercourse against anothers will.\n \n Same with killing the elderly to eliminate a drain on resources in times of crisis.\n \n Killing the elderly was common in some cultures. All they did was indoctrinate their culture to accept the practice as right and just for the well being of the community. Many elderly in the past HATED being a 'burden'. Some still do.\n \n \n These are concepts we don't currently believe in as a whole primarily due to an abundance of resources.\n It wasn't until about a century ago that the concept of 'childhood' became recognized. Women were married off young and children worked like adults.", 
   {}, 
   259481, 
   null, 
   1177033020.0
  ], 
  [
   259513, 
   null, 
   "thelmoose", 
   "Equations describe boundaries. It is bounded by the curve with the equation in the format I previously posted. Have you had a maths class on analytic geometry by any chance? If not, I highly suggest one. it provides interesting frame of reference for these kinds of discussions.\n\n \n Perhaps you should elaborate exactly what that equation is describing.", 
   {}, 
   259489, 
   null, 
   1177034340.0
  ], 
  [
   259542, 
   null, 
   "James", 
   "The main counter-argument is that why is the Creator excused from having a First Cause?\n\n Because that would logically introduce an infinite series of causes. I'm aware this isn't an answer that would convince an atheist. \n \nAlso, I didn't say the assumptions were irrational, I just don't know why one must assume them to be true. Just because neither of us can \"give an example of anything which came into existence without a cause\", doesn't mean that can't happen. Maybe the universe is indeed a \"unique event in nature.\" We don't know. There are lots of things that are unexplainable. I think that making up this God idea to help solve the unexplainable is a little too darn convenient a way to get out of a thorny cosmological conundrum.\n\n It may surprise you to hear that I agree with some of what you say here. It is not illogical to claim that a physical entity or property came into existence without a cause - it's just, well, unique.\n \n There are many things that can't be explained by scientific reasoning - including the origin of the singularity from which the universe evolved. The God postulate attempts to give a philosophical (or theological) answer to questions like, What came before? Or, Why is there something rather than nothing?\n \n The truthfulness of the premiss that a Final Cause, which is self-existent, got the whole show on the road is unprovable. But it appeals to those with a religious sensibility and an aesthetic appreciation of the beauty and harmony of the cosmos. This sensibility can and does coexist with a scientific understanding of the natural world. \n \n \"The religious inclination lies in the dim consciousness that dwells in humans that all nature, including the humans in it, is in no way an accidental game, but a work of lawfulness and that there is a fundamental cause of all existence.\" (Einstein)\n \n James.", 
   {}, 
   259482, 
   null, 
   1177059660.0
  ], 
  [
   259598, 
   null, 
   "johnhanks", 
   "You might try reading the posts. I said it has a boundary and supplied the proof.\n\n You also quoted me as saying a sphere has infinite area, when I clearly wrote finite.\n \n I refer you here for what I mean by 'finite but unbounded'.", 
   {}, 
   259466, 
   null, 
   1177095720.0
  ], 
  [
   259654, 
   null, 
   "thelmoose", 
   " Because that would logically introduce an infinite series of causes. I'm aware this isn't an answer that would convince an atheist. \n\n \n I don't know what that means, \"convince an atheist\". It sound like your just getting condescending now. \n \n Anyway, you still haven't answered the question. \n IF you are going to go with those three assumptions, why does a creator get to be excused from having its own prior cause? Who says there must be a first one?\n \n \n \n \n It may surprise you to hear that I agree with some of what you say here. It is not illogical to claim that a physical entity or property came into existence without a cause - it's just, well, unique.\n \n There are many things that can't be explained by scientific reasoning - including the origin of the singularity from which the universe evolved. The God postulate attempts to give a philosophical (or theological) answer to questions like, What came before? Or, Why is there something rather than nothing?\n \n The truthfulness of the premiss that a Final Cause, which is self-existent, got the whole show on the road is unprovable. But it appeals to those with a religious sensibility and an aesthetic appreciation of the beauty and harmony of the cosmos. This sensibility can and does coexist with a scientific understanding of the natural world. \n \n \"The religious inclination lies in the dim consciousness that dwells in humans that all nature, including the humans in it, is in no way an accidental game, but a work of lawfulness and that there is a fundamental cause of all existence.\" (Einstein)\n \n James.\n\n \n First, Einstein's explanation of the \"religious inclination\" explains merely that: why we create religion.\n \n We seem to agree that some things are not yet explainable. Whether some answers are aesthetically appealing indicates nothing about their truthfullness. You have said as much. My point is this is tantamount to believing in something because it's nice to believe it. It makes us feel better. I do not choose to go that route.\n \n Lastly I hope you are not implying that those who believe in God have a more developed sensitivity and appreciation of the \"beauty and harmony of the cosmos.\" An atheistic can equally appreciate and cherish the grandeur of nature without having to make up explanations for it.", 
   {}, 
   259542, 
   null, 
   1177109580.0
  ], 
  [
   259666, 
   null, 
   "huckleberry", 
   "You also quoted me as saying a sphere has infinite area, when I clearly wrote finite.\n \n I refer you here for what I mean by 'finite but unbounded'.\n\n \n I simply ignored that part but if you insist, I apologize for the error. It is irrelevant. The equation, describes a sphere. That is the equation of a sphere in standard form. It is bounded. It is finite.\n \n Huck", 
   {}, 
   259598, 
   null, 
   1177116900.0
  ], 
  [
   259718, 
   null, 
   "johnhanks", 
   "I simply ignored that part but if you insist, I apologize for the error. It is irrelevant.\n\n The distinction between 'infinite area' and 'finite area' irrelevant? You do have some odd ideas. (It wasn't your apology I sought, merely acknolwedgement of misrepresentation.)\n \nThe equation, describes a sphere. That is the equation of a sphere in standard form. It is bounded. It is finite.\n\n I think your equation refers to its being bounded in magnitude. Einstein and I (see earlier link http://www.bartleby.com/173/31.html) were referring to a different kind of boundary:\n \nLet us consider now a second two-dimensional existence, but this time on a spherical surface instead of on a plane. The flat beings with their measuring-rods and other objects fit exactly on this surface and they are unable to leave it. Their whole universe of observation extends exclusively over the surface of the sphere. Are these beings able to regard the geometry of their universe as being plane geometry and their rods withal as the realisation of \"distance\"? They cannot do this. For if they attempt to realise a straight line, they will obtain a curve, which we \"three-dimensional beings\" designate as a great circle, i.e. a self-contained line of definite finite length, which can be measured up by means of a measuring-rod. Similarly, this universe has a finite area, that can be compared with the area of asquare constructed with rods. The great charm resulting from this consideration lies in the recognition of the fact that the universe of these beings is finite and yet has no limits.\n", 
   {
    "unicode_changes_made": true
   }, 
   259666, 
   null, 
   1177147080.0
  ], 
  [
   259721, 
   null, 
   "James", 
   "I don't know what that means, \"convince an atheist\". It sound like your just getting condescending now. \n\n You seem to have detected a patronizing tone where none was intended. \n \nAnyway, you still haven't answered the question. \n IF you are going to go with those three assumptions, why does a creator get to be excused from having its own prior cause? Who says there must be a first one?\n\n I gave my answer: I said that unless a Creator is the self-existent Final Cause, we are left with an infinite series of prior causes. \n \nFirst, Einstein's explanation of the \"religious inclination\" explains merely that: why we create religion.\n\n Einstein wasn't giving an explanation of religious inclination per se, he was answering a question about why he had settled into a deism based on what he called the \"spirit manifest in the laws of the universe\" and a sincere belief in a \"God who reveals Himself in the harmony of all that exists.\" \n \nWe seem to agree that some things are not yet explainable. Whether some answers are aesthetically appealing indicates nothing about their truthfullness. You have said as much. My point is this is tantamount to believing in something because it's nice to believe it. It makes us feel better. I do not choose to go that route.\n\n The main point was in reference to a religious sensibility with aesthetic appreciation as a subsidiary. Some believers in God may have little if any developed aesthetic faculty. Describing the desiderata of ubiquitous religious inquiry simply as \"something nice to believe\", indicates a tendency to think in clichés. \n \nLastly I hope you are not implying that those who believe in God have a more developed sensitivity and appreciation of the \"beauty and harmony of the cosmos.\" An atheistic can equally appreciate and cherish the grandeur of nature without having to make up explanations for it.\n\n If I thought that atheists lacked an appreciation of the beauty and harmony of the cosmos, I would say so. \n \n James.", 
   {}, 
   259654, 
   null, 
   1177151100.0
  ], 
  [
   259983, 
   null, 
   "huckleberry", 
   "The distinction between 'infinite area' and 'finite area' irrelevant? You do have some odd ideas. (It wasn't your apology I sought, merely acknolwedgement of misrepresentation.)\n \n I think your equation refers to its being bounded in magnitude. Einstein and I (see earlier link http://www.bartleby.com/173/31.html) were referring to a different kind of boundary:\n\n \n The problem with this that you did not read far enough:\n \n \n Perhaps the reader will wonder why we have placed our \"beings\" on a sphere rather than on another closed surface. But this choice has its justification in the fact that, of all closed surfaces, the sphere is unique in possessing the property that all points on it are equivalent. I admit that the ratio of the circumference c of a circle to its radius r depends on r, but for a given value of r it is the same for all points of the \"world-sphere\"; in other words, the \"world-sphere\" is a \"surface of constant curvature.\" 6 \n To this two-dimensional sphere-universe there is a three-dimensional analogy, namely, the three-dimensional spherical space which was discovered by Riemann. Its points are likewise all equivalent. It possesses a finite volume, which is determined by its \"radius\" (22R3). Is it possible to imagine a spherical space? To imagine a space means nothing else than that we imagine an epitome of our \"space\" experience, i.e. of experience that we can have in the movement of \"rigid\" bodies. In this sense we can imagine a spherical space. \n \n \n \n Currently the data are endicating something similar to a sphere but not really a sphere (in one possibility) and also a horned representation. (See the PDS discussions available on the web). Einstein wrote general relativity in 1920 I believe. His specific spherical argument is not to show the infinite possibilities of a sphere but rather to show that the universe has the possibility of being finite and bounded or infinite and unbounded as stated by Hawkings in Brief History of Time. I think I already alluded to this.\n \n What you call a misrepresentation was not a misrepresentation. It was a mistake. I fully intended to say what you said. I made an error, so sue me. Why is it so incredibly important for you to hound the idea?\n \n Einstein uses a sphere and makes an assumption from the two dimensional to a three dimensional. The theory comes out as a Hypersphere or something kind of soccer ball shaped. However, the exact nature is still up for grabs. There is great argument and debate over it to include ellipsoidal, hyperbolic and flat spheroid.\n \n Huck", 
   {
    "unicode_changes_made": true
   }, 
   259718, 
   null, 
   1177357380.0
  ], 
  [
   259999, 
   null, 
   "johnhanks", 
   "The problem with this that you did not read far enough:\n\n I assure you, Huck, I read the whole thing. Before you did, I think; and if I hadn't, I don't think you would have.\n \nWhat you call a misrepresentation was not a misrepresentation. It was a mistake. I fully intended to say what you said ... Why is it so incredibly important for you to hound the idea?\n\n Hound? Who's hounding? Huck, if you fully intended to say what I said, what was stopping you?\n \nEinstein uses a sphere and makes an assumption from the two dimensional to a three dimensional. The theory comes out as a Hypersphere or something kind of soccer ball shaped. However, the exact nature is still up for grabs. There is great argument and debate over it to include ellipsoidal, hyperbolic and flat spheroid.\n\n Einstein uses a sphere and demonstrates that it is possible for a universe to be finite but unbounded. End of story.", 
   {}, 
   259983, 
   null, 
   1177365000.0
  ], 
  [
   260004, 
   null, 
   "huckleberry", 
   "I assure you, Huck, I read the whole thing. Before you did, I think; and if I hadn't, I don't think you would have.\n \n Hound? Who's hounding? Huck, if you fully intended to say what I said, what was stopping you?\n \n Einstein uses a sphere and demonstrates that it is possible for a universe to be finite but unbounded. End of story.\n\n \n Actually after rereading my post, I did not quote you as saying it was \"infinite\". I simply made the assertion that it was neither infinite nor unbounded. It was finite and bounded. I did not quote you at all. I never said you said it, I made the assertion and then proved it with my analysis. \n \n You however, have spen time making personal attacks. Please leave me out of your discussion from now on.", 
   {}, 
   259999, 
   null, 
   1177366200.0
  ], 
  [
   260019, 
   null, 
   "thelmoose", 
   "I simply ignored that part but if you insist, I apologize for the error. It is irrelevant. The equation, describes a sphere. That is the equation of a sphere in standard form. It is bounded. It is finite.\n \n Huck\n\n \n Pardon my ignorance, but when you say the equation describes a sphere, what attributes of a sphere are you talking about? What unit are you describing? That is not the formula for its surface area or volume. I thought this whole thought experiment is about a 2-dimensional universe that \"lives\" on the surface of a sphere, such that the surface clearly would be finite but without a boundary. \n \n What do the variables mean, x,y & z and a,b & c? I assume the r is the radius. \n \n What is the standard form of a sphere?", 
   {}, 
   259666, 
   null, 
   1177370760.0
  ], 
  [
   260020, 
   null, 
   "huckleberry", 
   "Pardon my ignorance, but when you say the equation describes a sphere, what attributes of a sphere are you talking about? What unit are you describing? That is not the formula for its surface area or volume. I thought this whole thought experiment is about a 2-dimensional universe that \"lives\" on the surface of a sphere, such that the surface clearly would be finite but without a boundary. \n \n What do the variables mean, x,y & z and a,b & c? I assume the r is the radius. \n \n What is the standard form of a sphere?\n\n \n It is the mathematical formula that describes a sphere. It is in standard form for cartesian coordinate space. X,y, and z represent the axes of cartesian coordinate space. I could post equations that are in polar coordinates or in cylindrical coordinates but then one starts using greek letters and those are just a pain to me to post.\n \n a,b,c represent variable that further define the specific location of the center of the sphere in cartesian coordinate space. Other common representations are h,j, and k. the capital A,B, and C are non zero numbers and are all equal. One could leave them out (it is a generic form used for any conic section in analytic geometry) and simply wrap them into r (and in fact, I probably should have done that to be more precise). r is indeed the radius of the sphere. \n \n These are not equations for surface area or volume as we were discussing boundaries not area. Area is also finite. boundaries clearly exist for the sphere.\n \n However, the issue of spherical space does not describe a sphere as one would normaly think of it. It describes \"spherical\" meaning like a sphere but there are some oddities inlcuding lensing effects and tunnels and tails. In particular in Einstein's equations there is the possibility of a horned space which Einstein did not specify in his general theory article but was later clarified by another physicist whose name escapes me at the moment. I want to say it was the a bomb fellow but just cannot put my finger on it at the moment. When I remember I will post.\n \n Huck", 
   {}, 
   260019, 
   null, 
   1177371720.0
  ], 
  [
   260127, 
   null, 
   "johnhanks", 
   "I thought this whole thought experiment is about a 2-dimensional universe that \"lives\" on the surface of a sphere, such that the surface clearly would be finite but without a boundary.\n\n You have described my side of the exchange correctly; Huck seems to have had something else in mind.", 
   {}, 
   260019, 
   null, 
   1177438800.0
  ], 
  [
   261788, 
   null, 
   "Jill White", 
   "I wrestle with the question of whether or not there is a God. It seems like I can prove it both ways and disprove it both ways. Does the universe need a creator to exist? Or is this just an idea inside man-made theology? Man yearns for the eternal. He wants to live forever and be strong forever. He is the only animal as far as we know which builds churches and contemplates the infinite. This in itself may be an indication that immortality resides in a soul of some kind. If there is truth in religion, I accept the premises of the New Testament.\n \n Jim Colyer\n http://www.jimcolyer.com\n\n Then I cant understand why the hell you asked the question in the first place, unless you did it to *#!@ me off.", 
   {}, 
   251257, 
   null, 
   1178373900.0
  ], 
  [
   262106, 
   null, 
   "huckleberry", 
   "Then I cant understand why the hell you asked the question in the first place, unless you did it to *#!@ me off.\n\n \n Didn't you know? We are all here on this board posting our ponderings and rumblings for one purpose and one purpose only. And that would be to *#!@ you off.emoticon_rolleyes \n \n After all the universe DOES revolve around you.", 
   {}, 
   261788, 
   null, 
   1178577360.0
  ], 
  [
   262110, 
   null, 
   "Jill White", 
   "Didn't you know? We are all here on this board posting our ponderings and rumblings for one purpose and one purpose only. And that would be to *#!@ you off.emoticon_rolleyes \n \n After all the universe DOES revolve around you.\nI take great comfort in your words now knowing that you understand me so well.", 
   {}, 
   262106, 
   null, 
   1178578560.0
  ], 
  [
   262158, 
   null, 
   "Ripskar", 
   "Huck has indicated one of the viewpoints regarding the existance/non existance of a deity;\n \nAfter all the universe DOES revolve around you.\n\n Certain interpretations of scripture imply that the Universe was created specifically for humanity, thus you as a human are the reason for existance.\n Personally I find this unlikely, I don't rate the whole human race as important enough to justify the existance of the Universe.\n It's also rather odd in that we are living on an insignificant rock, orbiting a typical main sequence yellow dwarf star a little more than halfway out in one of the spiral arms of a normal spiral galaxy which isn't even the largest in the local cluster and is right at the trailing edge of the Virgo Supercluster.\n Those who do subscribe to the viewpoint however point to Quantum Mechanics which suggests that we exist in a narrow band of probability where matter is stable.", 
   {}, 
   262110, 
   null, 
   1178628300.0
  ], 
  [
   262253, 
   null, 
   "huckleberry", 
   "emoticon_xclown emoticon_xclown emoticon_xclown emoticon_smile emoticon_smile emoticon_xhoho emoticon_xhoho emoticon_xangel emoticon_xbouncer \n \n I cannot even begin to describe how hard I laughed when I read this. Even serious its funny.\n \nHuck has indicated one of the viewpoints regarding the existance/non existance of a deity;\n \n Certain interpretations of scripture imply that the Universe was created specifically for humanity, thus you as a human are the reason for existance.\n Personally I find this unlikely, I don't rate the whole human race as important enough to justify the existance of the Universe.\n It's also rather odd in that we are living on an insignificant rock, orbiting a typical main sequence yellow dwarf star a little more than halfway out in one of the spiral arms of a normal spiral galaxy which isn't even the largest in the local cluster and is right at the trailing edge of the Virgo Supercluster.\n Those who do subscribe to the viewpoint however point to Quantum Mechanics which suggests that we exist in a narrow band of probability where matter is stable.\n", 
   {}, 
   262158, 
   null, 
   1178668680.0
  ], 
  [
   262259, 
   null, 
   "Zardoz", 
   "Johnny says it best for me", 
   {}, 
   262253, 
   null, 
   1178669520.0
  ], 
  [
   262286, 
   null, 
   "Jill White", 
   "I cannot even begin to describe how hard I laughed when I read this. Even serious its funny.\n\n Huck likes to play little games?", 
   {}, 
   262253, 
   null, 
   1178680200.0
  ], 
  [
   262295, 
   null, 
   "Archangel", 
   "Huck has indicated one of the viewpoints regarding the existance/non existance of a deity;\n \n Certain interpretations of scripture imply that the Universe was created specifically for humanity, thus you as a human are the reason for existance.\n Personally I find this unlikely, I don't rate the whole human race as important enough to justify the existance of the Universe.\n It's also rather odd in that we are living on an insignificant rock, orbiting a typical main sequence yellow dwarf star a little more than halfway out in one of the spiral arms of a normal spiral galaxy which isn't even the largest in the local cluster and is right at the trailing edge of the Virgo Supercluster.\n Those who do subscribe to the viewpoint however point to Quantum Mechanics which suggests that we exist in a narrow band of probability where matter is stable.\n\n \n \nemoticon_xclown emoticon_xclown emoticon_xclown emoticon_smile emoticon_smile emoticon_xhoho emoticon_xhoho emoticon_xangel emoticon_xbouncer \n \n I cannot even begin to describe how hard I laughed when I read this. Even serious its funny.\n\n \n I don't know huck, I think it's sad and kind of pitiful that an allegedly intelligent man would presume to belittle the awesome wonder of our placement in the Universe rather than be humbled that we live in a generation that has actually learned to define where we fit within it. Ripskar is so full of himself he thinks he's big enough to look down on Gods creation. But he isn't, and may God have mercy on his sense of superiority to so smugly degrade His magnificent creation.", 
   {}, 
   262286, 
   null, 
   1178682180.0
  ], 
  [
   262299, 
   null, 
   "thelmoose", 
   "emoticon_xclown emoticon_xclown emoticon_xclown emoticon_smile emoticon_smile emoticon_xhoho emoticon_xhoho emoticon_xangel emoticon_xbouncer \n \n I cannot even begin to describe how hard I laughed when I read this. Even serious its funny.\n\n \n What is the funny part? Or were you just pleased with yourself that you learned how to make emoticons and it made you giggle?", 
   {}, 
   262253, 
   null, 
   1178682660.0
  ], 
  [
   262320, 
   null, 
   "Jill White", 
   "I don't know huck, I think it's sad and kind of pitiful that an allegedly intelligent man would presume to belittle the awesome wonder of our placement in the Universe rather than be humbled that we live in a generation that has actually learned to define where we fit within it. Ripskar is so full of himself he thinks he's big enough to look down on Gods creation. But he isn't, and may God have mercy on his sense of superiority to so smugly degrade His magnificent creation.\nIt's always been bible religions goal to place man at the center of the universe and every time the religious have been wrong.\n \n With a track record like that it's a wonder people still believe in that BS.", 
   {
    "unicode_changes_made": true
   }, 
   262295, 
   null, 
   1178716320.0
  ], 
  [
   262324, 
   null, 
   "Jill White", 
   "Please leave me out of your discussion from now on.\n\n This is the only thing you have said that I agree with.", 
   {}, 
   260004, 
   null, 
   1178718540.0
  ], 
  [
   262340, 
   null, 
   "peteratwar", 
   "It's always been bible religions goal to place man at the center of the universe and every time the religious have been wrong.\n \n With a track record like that it's a wonder people still believe in that BS.\n\n \n \n Wrong. Nothing in the Bible states that", 
   {
    "unicode_changes_made": true
   }, 
   262320, 
   null, 
   1178723400.0
  ], 
  [
   262375, 
   null, 
   "huckleberry", 
   "I am thinking you are all taking ripskar and yourselves waaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaay to seriously. What he said was simply funny. He was very tongue in cheek about it.\n \n as to Jill, when you grow up a little bit and can have an intelligent conversation without attacking another in ad hominem fashion, then I owuld be more than happy to discuss the topic at hand with you. Clearly that has not occurred. You act like a five year old. \n \n I have generally offered decent opinions, backed them with sound logic, and evidentiary support. What have you done? If you have seen some logical flaw, point it out, but be prepared for a good argument. One you will no doubt lose given your unbelievable lack of ability to think.", 
   {}, 
   262340, 
   null, 
   1178744820.0
  ], 
  [
   262398, 
   null, 
   "Jill White", 
   "I am thinking you are all taking ripskar and yourselves waaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaay to seriously. What he said was simply funny. He was very tongue in cheek about it.\n \n as to Jill, when you grow up a little bit and can have an intelligent conversation without attacking another in ad hominem fashion, then I owuld be more than happy to discuss the topic at hand with you. Clearly that has not occurred. You act like a five year old. \n \n I have generally offered decent opinions, backed them with sound logic, and evidentiary support. What have you done? If you have seen some logical flaw, point it out, but be prepared for a good argument. One you will no doubt lose given your unbelievable lack of ability to think.\nI guess I should tell you I have not been reading your posts so I cant say I agree with your clearly exaggerated clams about yourself.\n \n I am inclined to believe that it is just another case of self-importance but I will give you the benefit of the doubt.\n \n Go ahead use some of that fancy logic on me tough guy.\n \n (Unless you would rather continue to complain.)", 
   {}, 
   262375, 
   null, 
   1178756040.0
  ], 
  [
   262401, 
   null, 
   "huckleberry", 
   "I guess I should tell you I have not been reading your posts so I cant say I agree with your clearly exaggerated clams about yourself.\n \n I am inclined to believe that it is just another case of self-importance but I will give you the benefit of the doubt.\n \n Go ahead use some of that fancy logic on me tough guy.\n \n (Unless you would rather continue to complain.)\n\n \n If you would actually post an argument instead of an attack on a person (ad hom) then I would be pleased to post with a counter argument. Do you have something resembling an argument as opposed to an ad hominem attack?", 
   {}, 
   262398, 
   null, 
   1178757120.0
  ], 
  [
   262406, 
   null, 
   "Jill White", 
   "If you would actually post an argument instead of an attack on a person (ad hom) then I would be pleased to post with a counter argument. Do you have something resembling an argument as opposed to an ad hominem attack?\nHuck, I got to say no, I don't think so, I don't think we should speak.\n \n You are obviously overly emotionally involved here you previous comments clearly being personal attacks against me.\n \n If we keep going I am afraid you would get yourself banned.", 
   {
    "unicode_changes_made": true
   }, 
   262401, 
   null, 
   1178758260.0
  ], 
  [
   262483, 
   null, 
   "simone", 
   "If you would actually post an argument instead of an attack on a person (ad hom) then I would be pleased to post with a counter argument. Do you have something resembling an argument as opposed to an ad hominem attack?\nGadzooks! Methinks thou dost protest too much.\n \n I think JW is relatively free from personal and emotional attacks.", 
   {}, 
   262401, 
   null, 
   1178815020.0
  ], 
  [
   262652, 
   null, 
   "huckleberry", 
   "once again, no arguments. I am not worried about getting banned. I have not engaged in personal attacks. I logically analyze an argument. Since, Jill, you choose not to post an argument, I will assume you do not have one.\n \n Simone, your opinion about someone's objectivity carries very little weight.", 
   {}, 
   262483, 
   null, 
   1178905140.0
  ], 
  [
   262655, 
   null, 
   "Jill White", 
   "lol @ Huck.", 
   {}, 
   262652, 
   null, 
   1178905380.0
  ], 
  [
   262758, 
   null, 
   "simone", 
   "Nonsense, I observe an air of detachment surrounding JW.", 
   {}, 
   262655, 
   null, 
   1178983020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Does God exist?", 
  "url": "http://www.4forums.com/political/religion-debates/9571-does-god-exist.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9571, 
  "discussion_files": [
   [
    "5010.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-print.html"
   ], 
   [
    "5011.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-19-print.html"
   ], 
   [
    "5012.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-17-print.html"
   ], 
   [
    "5013.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-15-print.html"
   ], 
   [
    "5014.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-13-print.html"
   ], 
   [
    "5015.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-12-print.html"
   ], 
   [
    "5016.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-10-print.html"
   ], 
   [
    "5017.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-8-print.html"
   ], 
   [
    "5018.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-6-print.html"
   ], 
   [
    "5019.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-4-print.html"
   ], 
   [
    "5020.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-5-print.html"
   ], 
   [
    "5021.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-14-print.html"
   ], 
   [
    "5022.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-7-print.html"
   ], 
   [
    "5023.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-16-print.html"
   ], 
   [
    "5024.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-9-print.html"
   ], 
   [
    "5025.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-18-print.html"
   ], 
   [
    "5026.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-11-print.html"
   ], 
   [
    "5027.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-3-print.html"
   ], 
   [
    "5028.html", 
    "http://www.4forums.com/political/religion-debates/9571-does-god-exist-2-print.html"
   ]
  ], 
  "identifier": 9571
 }
]