[
 [
  [
   251345, 
   null, 
   "Shooterandproud", 
   "I want to know how gay marrige harms heterosexuals. And I want some solid evidence. I don't care what your moral, or religious beliefs are, because that is irrelevant. I don't care about your personal opinion about gays. I want to know EXACTLY how you are harmed, and I want it backed up. Doing the electric slide around logic by using arguments like \"if we allow gays to marry, then whats to say that we won't let people marry dogs?\". Well, that logic could be applied to any law. In fact, why let anyone have rights at all? And if you're going to throw around statements like \"marrige is between 1 man and 1 woman\", then I want to see evidence of this. I can't see any anywhere.\n \n So again, where is your solid, logical evidence for your views?", 
   {
    "post_info": {
     "post_title": "How does Gay Marrige harm YOU?"
    }
   }, 
   null, 
   null, 
   1171746360.0
  ], 
  [
   251355, 
   null, 
   "jyoshu", 
   "I want to know how gay marrige harms heterosexuals. And I want some solid evidence. I don't care what your moral, or religious beliefs are, because that is irrelevant. I don't care about your personal opinion about gays. I want to know EXACTLY how you are harmed, and I want it backed up. Doing the electric slide around logic by using arguments like \"if we allow gays to marry, then whats to say that we won't let people marry dogs?\". Well, that logic could be applied to any law. In fact, why let anyone have rights at all? And if you're going to throw around statements like \"marrige is between 1 man and 1 woman\", then I want to see evidence of this. I can't see any anywhere.\n \n So again, where is your solid, logical evidence for your views?\n\n \n Speaking only for myself of course, I don't think I've seen anyone claim they themselves would be harmed, or that individuals would be harmed, by gay people.", 
   {}, 
   251345, 
   null, 
   1171749360.0
  ], 
  [
   251364, 
   null, 
   "ShadowPikachu", 
   "Speaking only for myself of course, I don't think I've seen anyone claim they themselves would be harmed, or that individuals would be harmed, by gay people.\n\n \n So what rational reason would there be to deny them the right to marry the person they love?", 
   {}, 
   251355, 
   null, 
   1171750260.0
  ], 
  [
   251369, 
   null, 
   "jyoshu", 
   "So what rational reason would there be to deny them the right to marry the person they love?\n\n \n They can \"marry\" whomever they love. Benefits though, are a different matter. The state and society views marriage as an opposite-sex institution. It's not about anyone getting harmed; no one said it was.", 
   {}, 
   251364, 
   null, 
   1171751340.0
  ], 
  [
   251383, 
   null, 
   "Shooterandproud", 
   "Speaking only for myself of course, I don't think I've seen anyone claim they themselves would be harmed, or that individuals would be harmed, by gay people.\n\n \n Yes they have. Are you denying that conservatives and religious-right advocates have not been trying to ban gay marrige?", 
   {}, 
   251355, 
   null, 
   1171752900.0
  ], 
  [
   251387, 
   null, 
   "BlackEmperor", 
   "Yes they have. Are you denying that conservatives and religious-right advocates have not been trying to ban gay marrige?\n\n \n Of course they have been. They are following the Bible which says homosexuality is a sin.", 
   {}, 
   251383, 
   null, 
   1171753080.0
  ], 
  [
   251388, 
   null, 
   "Shooterandproud", 
   "They can \"marry\" whomever they love. Benefits though, are a different matter. The state and society views marriage as an opposite-sex institution. It's not about anyone getting harmed; no one said it was.\n\n \n Then banning same-sex marrige would be wrong, and there would be no reason for it. Unless it harms someone, a law should never be passed. If no one is getting harmed, then what is the point of the law. That is the point of all laws, and you can't abuse a majority power by forcing minorities to abide by your own morals with no base for them, just because you can. And marrige is between two human beings who love each other. Their race, sex, or religious beliefs shouldn't matter. The whole \"opposite sex\" thing was just fabricated by conservatives. Its only when the progressives and liberals came into power when this dogma was questioned.", 
   {}, 
   251369, 
   null, 
   1171753140.0
  ], 
  [
   251389, 
   null, 
   "Shooterandproud", 
   "Of course they have been. They are following the Bible which says homosexuality is a sin.\n\n \n The bible also says that I should be killed for my haircut. The bible said that I should be able to own Mexicans as slaves. The bible says that we should kill all women if they have sex before they marry. Should we make these laws too? The bible has nothing to do with laws. If you don't like gay marrige, don't marry someone your own sex. Simple as that.", 
   {}, 
   251387, 
   null, 
   1171753200.0
  ], 
  [
   251391, 
   null, 
   "BlackEmperor", 
   "The bible also says that I should be killed for my haircut. The bible said that I should be able to own Mexicans as slaves. The bible says that we should kill all women if they have sex before they marry. Should we make these laws too? The bible has nothing to do with laws. If you don't like gay marrige, don't marry someone your own sex. Simple as that.\n\n \n Prove it, shooterandproud.", 
   {}, 
   251389, 
   null, 
   1171753500.0
  ], 
  [
   251411, 
   null, 
   "jyoshu", 
   "Then banning same-sex marrige would be wrong, and there would be no reason for it. Unless it harms someone, a law should never be passed. \n\n \n A law baning same-sex marriage, then I'd agree. But the reason same-sex marriage doesn't exist (other than Mass.) is not because of law; after all, there are plenty of states that don't have same-sex marriage with no law that outlaws it. You're barking up the wrong tree--this is a cultural issue more than a legal one.", 
   {}, 
   251388, 
   null, 
   1171762380.0
  ], 
  [
   251429, 
   null, 
   "jitobear", 
   "Of course they have been. They are following the Bible which says homosexuality is a sin.\n\n \n What the Bible says sure as well better be irrelevant in the writing of our laws. Our government was designed to be separate from religion to protect all who would worship. Our laws need solid secular reasoning or we become a theocratic state.", 
   {}, 
   251387, 
   null, 
   1171765740.0
  ], 
  [
   251432, 
   null, 
   "Shooterandproud", 
   "Prove it, shooterandproud.\n\n \n This is getting tiresome.\n \n http://www.humanistsofutah.org/2002/WhyCantIOwnACanadian_10-02.html\n \n This should cover most of it.", 
   {}, 
   251391, 
   null, 
   1171766340.0
  ], 
  [
   251433, 
   null, 
   "Shooterandproud", 
   "A law baning same-sex marriage, then I'd agree. But the reason same-sex marriage doesn't exist (other than Mass.) is not because of law; after all, there are plenty of states that don't have same-sex marriage with no law that outlaws it. You're barking up the wrong tree--this is a cultural issue more than a legal one.\n\n \n \n You're right, I worded that wrong. I meant that it should not be banned. \n \n If it is our culture to deny some rights to some sentient, human, American citizens, but give them to another, then we live in a twisted society. Gay marrige will eventually be legalized, I know that. The Nazis and the KKK eventually fell, so will this. Most people stop condoning discrimination eventually, however my goal is to speed up the process of moving forward.\n \n \n And for all you bible thumpers out there, let me remind you that the KKK was a Christian organization.", 
   {}, 
   251411, 
   null, 
   1171766700.0
  ], 
  [
   251438, 
   null, 
   "Coyote", 
   "A law baning same-sex marriage, then I'd agree. But the reason same-sex marriage doesn't exist (other than Mass.) is not because of law; after all, there are plenty of states that don't have same-sex marriage with no law that outlaws it. You're barking up the wrong tree--this is a cultural issue more than a legal one.\n\n \n \n States with laws banning same-sex marriage: 43\n \n States without laws banning same-sex marriage: 5\n \n States where same-sex marriage is legal (but not federally recognized).: 1\n \n \n I wouldn't call that \"plenty\".\n \n Source", 
   {}, 
   251411, 
   null, 
   1171767660.0
  ], 
  [
   251442, 
   null, 
   "obvious_child", 
   "What the Bible says sure as well better be irrelevant in the writing of our laws. Our government was designed to be separate from religion to protect all who would worship. Our laws need solid secular reasoning or we become a theocratic state.\n\n \n VT cruiser tried to make a thread about this. \n \n A nation that devouts itself a religion can be seen today: Iran, pre-invasion Afghanistan, and a degree, Saudi Arabia. \n \n VT didn't like his idea being compared to some of the most fascist, terroristic and inhuman gov'ts.", 
   {}, 
   251429, 
   null, 
   1171768080.0
  ], 
  [
   251443, 
   null, 
   "Matthew S", 
   "They can \"marry\" whomever they love. Benefits though, are a different matter. The state and society views marriage as an opposite-sex institution. It's not about anyone getting harmed; no one said it was.\n\n \n BUt it comes down to gay people being harmed by not being allowed to marry. Any time a group is excluded because of someone elses religious beliefs that group is harmed.", 
   {}, 
   251369, 
   null, 
   1171768320.0
  ], 
  [
   254603, 
   null, 
   "starry_eyed131", 
   "They can \"marry\" whomever they love. Benefits though, are a different matter.\n\n \n Marrige shouldn't be about benefits. I think a lot of people look upon an actual ceremony as a celebration. Why should we deny them that? It's something special, and a lot of people think of it as the happiest day of their lives. I don't think it has anything to do with \"I'm spending the rest of my life with you\", because that happens anyway. I think it's just about the celebration, and the joy that comes with it.\n \n Also, if what you say is true, and they can just \"marry\" without the celebration, what's the point in banning it? They're getting \"married\" anyway, right?", 
   {}, 
   251369, 
   null, 
   1174067220.0
  ], 
  [
   254604, 
   null, 
   "starry_eyed131", 
   "I want to know how gay marrige harms heterosexuals. And I want some solid evidence. I don't care what your moral, or religious beliefs are, because that is irrelevant. I don't care about your personal opinion about gays.\n\n \n Unfortunately, the only reason people have any issue with the subject is because of their religious beliefs. If it were not so, there would be no discussion upon the subject. I don't think you can really ask this of people and expect it to make sense. Yeah, a lot of people are harmed, but mostly because of religion and moral beliefs. Without these beliefs there would be no opposition to gay marriges. Ugly, but true.", 
   {}, 
   251345, 
   null, 
   1174067340.0
  ], 
  [
   254788, 
   null, 
   "jyoshu", 
   "Marrige shouldn't be about benefits. I think a lot of people look upon an actual ceremony as a celebration. Why should we deny them that? \n\n \n I don't think they should be denied those benefits at all. I just think it should be done a different way. \n \n \nAlso, if what you say is true, and they can just \"marry\" without the celebration, what's the point in banning it? They're getting \"married\" anyway, right?\n\n \n Who said anything about banning it?", 
   {}, 
   254603, 
   null, 
   1174175640.0
  ], 
  [
   254846, 
   null, 
   "handsomeman", 
   "Prove it, shooterandproud.\n\n \n He actually had a really good point there, the bible isnt law.", 
   {}, 
   251391, 
   null, 
   1174257720.0
  ], 
  [
   254989, 
   null, 
   "peteratwar", 
   "BUt it comes down to gay people being harmed by not being allowed to marry. Any time a group is excluded because of someone elses religious beliefs that group is harmed.\n\n \n Marriage is a secular condition set up by various Societies over the millenia and one of the prerequisites set out is that such a union should be between people of different genders.\n \n Religion has supported this and sanctified it but did not invent it.\n \n You don't curse the Church you lobby Society to see if you can effect a change. People who believe the different gender aspect are entitled to lobby for no change.", 
   {}, 
   251443, 
   null, 
   1174412760.0
  ], 
  [
   254990, 
   null, 
   "Matthew S", 
   "Marriage is a secular condition set up by various Societies over the millenia and one of the prerequisites set out is that such a union should be between people of different genders.\n \n Religion has supported this and sanctified it but did not invent it.\n \n You don't curse the Church you lobby Society to see if you can effect a change. People who believe the different gender aspect are entitled to lobby for no change.\n\n \n Then would you agree that I have the right to sue organizations that lobby and get legislation passed that adversly effects me and I suffer damages because of that legislation?", 
   {}, 
   254989, 
   null, 
   1174413240.0
  ], 
  [
   254992, 
   null, 
   "peteratwar", 
   "Then would you agree that I have the right to sue organizations that lobby and get legislation passed that adversly effects me and I suffer damages because of that legislation?\n\n \n Of course not. Unless you do not believe people other than yourself have any rights. And of course if you do not believe in democracy when it (in your view) adversely affects you to some small degree", 
   {}, 
   254990, 
   null, 
   1174414200.0
  ], 
  [
   254995, 
   null, 
   "Matthew S", 
   "Of course not. Unless you do not believe people other than yourself have any rights. And of course if you do not believe in democracy when it (in your view) adversely affects you to some small degree\n\n \n Then again if I suffer damages because of someone elses actions then I am entitled to sue for damages. Unless of course you do not believe in the concept of holding people accountable when they harm others.", 
   {}, 
   254992, 
   null, 
   1174414560.0
  ], 
  [
   255002, 
   null, 
   "peteratwar", 
   "Then again if I suffer damages because of someone elses actions then I am entitled to sue for damages. Unless of course you do not believe in the concept of holding people accountable when they harm others.\n\n \n \n Of course, but if it is the law of the land (and merely because some one is lobbying does not cause you to suffer damages) then tough you live with it", 
   {}, 
   254995, 
   null, 
   1174416360.0
  ], 
  [
   255003, 
   null, 
   "huckleberry", 
   "I want to know how gay marrige harms heterosexuals. And I want some solid evidence. I don't care what your moral, or religious beliefs are, because that is irrelevant. I don't care about your personal opinion about gays. I want to know EXACTLY how you are harmed, and I want it backed up. Doing the electric slide around logic by using arguments like \"if we allow gays to marry, then whats to say that we won't let people marry dogs?\". Well, that logic could be applied to any law. In fact, why let anyone have rights at all? And if you're going to throw around statements like \"marrige is between 1 man and 1 woman\", then I want to see evidence of this. I can't see any anywhere.\n \n So again, where is your solid, logical evidence for your views?\n\n \n This is a good question. I think government should get out of the \"mariage\" thing all together but that is another story. Given that government HAS interjected itself into marriage already, the obvious problems would be economic. Now, suddenly, business will be required to include benefits for people that they had not previously included (in order to be fair). Doing so greatly increases the cost of doing business which will ultimately greatly increase the cost of my purchases. Also, in the social service industry which is heavily funded through government contracts, there will be increases to the costs of those services which will likely increase my taxes. So I will take home less and pay more for the stuff I need.\n \n I do not think it is a slippery slope to consider where such legislation will lead? Clearly men and women \"fit\" biologically for procreation. Clearly homosexual behavior does not \"fit\" biologically speaking. It is irrelevant if it is morally wrong or right. To encourage such things (and I distinguish encourage from simply condoning or accepting) is a dangerous ground to tread. You are correct that many laws have already gone down that path but that does not mean they are good. It is one thing to legislate to protect rights that are \"inherent\" to the individual. It is another thing to change the definition of what is inherent. Not that we should not do that from time to time; abolition of slavery is a good example of when we changed that and its economic consequences were indeed severe, but we must carefully weigh each item for discussion. The abolition of slavery, in part, led to a massive war. The cost was very high. Is this something that really is worth such a cost.\n \n I personally do not know. I do know people who are gay, and I like them very much. I know some who do not support gay marriage and some who do.\n \n I have no real conclusion. Just observation.\n \n Huck", 
   {}, 
   251345, 
   null, 
   1174417200.0
  ], 
  [
   255004, 
   null, 
   "E Mutz", 
   "Then would you agree that I have the right to sue organizations that lobby and get legislation passed that adversly effects me and I suffer damages because of that legislation?\n\n \n Why yes indeed Matthew and I look forward having ye as amicus curiae at my lawsuit against those lobbying to raise taxes. They adversely affect my retirement.", 
   {}, 
   254990, 
   null, 
   1174417440.0
  ], 
  [
   255006, 
   null, 
   "Matthew S", 
   "Of course, but if it is the law of the land (and merely because some one is lobbying does not cause you to suffer damages) then tough you live with it\n\n \n I don't buy your argument. People sue others for damages all the time. If company x does something that harms someone then they are sued. These organiaztions have sought to harm others or the result of their actions have caused harm. I do not see why they can not be held accountable for that harm.", 
   {}, 
   255002, 
   null, 
   1174417500.0
  ], 
  [
   255007, 
   null, 
   "jim's trucking", 
   "Then again if I suffer damages because of someone elses actions then I am entitled to sue for damages. Unless of course you do not believe in the concept of holding people accountable when they harm others.\n...this coming from a guy who is offended by the sight of heterosexual couples flaunting the children in public.emoticon_wow\n \n Are you going to sue to have all children kept from public view?", 
   {}, 
   254995, 
   null, 
   1174417980.0
  ], 
  [
   255010, 
   null, 
   "Matthew S", 
   "...this coming from a guy who is offended by the sight of heterosexual couples flaunting the children in public.emoticon_wow\n \n Are you going to sue to have all children kept from public view?\n\n \n lol What a cool idea and I know many single heterosexuals that would favor having the messy, noisy, disruptive things kept out of sight.", 
   {}, 
   255007, 
   null, 
   1174418160.0
  ], 
  [
   255012, 
   null, 
   "Matthew S", 
   "Why yes indeed Matthew and I look forward having ye as amicus curiae at my lawsuit against those lobbying to raise taxes. They adversely affect my retirement.\n\n \n Yet I am not out there forming organizations amied at raising your taxes based upon my religious beliefs. Even you can see teh difference.", 
   {}, 
   255004, 
   null, 
   1174418220.0
  ], 
  [
   255014, 
   null, 
   "E Mutz", 
   "lol What a cool idea and I know many single heterosexuals that would favor having the messy, noisy, disruptive things kept out of sight.\n\n \n I'm with ye on this one. Perhaps we could start with airplanes, restaurants and movie theatres?", 
   {}, 
   255010, 
   null, 
   1174418340.0
  ], 
  [
   255021, 
   null, 
   "jitobear", 
   "I'm with ye on this one. Perhaps we could start with airplanes, restaurants and movie theatres?\n\n \n ooo ooo ooo \n \n How about my house! There is this one kid who keeps coming over and making a mess and stuff.", 
   {}, 
   255014, 
   null, 
   1174423740.0
  ], 
  [
   255073, 
   null, 
   "peteratwar", 
   "I don't buy your argument. People sue others for damages all the time. If company x does something that harms someone then they are sued. These organiaztions have sought to harm others or the result of their actions have caused harm. I do not see why they can not be held accountable for that harm.\n\n \n They are sued because they have done something against the law which has harmed you. Presumably also if your lobbying for gay marriage causes intense mental distress and harm to others they can sue you ?", 
   {}, 
   255006, 
   null, 
   1174472700.0
  ], 
  [
   255077, 
   null, 
   "Matthew S", 
   "They are sued because they have done something against the law which has harmed you. Presumably also if your lobbying for gay marriage causes intense mental distress and harm to others they can sue you ?\n\n \n Not always. Take the class actions against the cigarette companies or whole product liability industry. In many cases those companies obey and in some cases exceed the legal standards, yet they are still sued.\n \n \n What I am proposing is that If I loose money as a result of the death of my husband, which I would otherwise not have lost if we had had a marriage license, then I should have the right to sue those who where instrmental in stopping me from getting the license in the first place.", 
   {}, 
   255073, 
   null, 
   1174486440.0
  ], 
  [
   255083, 
   null, 
   "peteratwar", 
   "Not always. Take the class actions against the cigarette companies or whole product liability industry. In many cases those companies obey and in some cases exceed the legal standards, yet they are still sued.\n \n \n What I am proposing is that If I loose money as a result of the death of my husband, which I would otherwise not have lost if we had had a marriage license, then I should have the right to sue those who where instrmental in stopping me from getting the license in the first place.\n\n \n Oh, you mean the government and people of the USA (in your case) who made the laws. You could do that if the laws were themselves illegal (only possible in the USA or others who have a Constitution which may or may not affect this). Other than that if the law doesn't permit what you want, then what you want is illegal and hence yopu cannot sue.", 
   {}, 
   255077, 
   null, 
   1174494480.0
  ], 
  [
   255087, 
   null, 
   "Matthew S", 
   "Oh, you mean the government and people of the USA (in your case) who made the laws. You could do that if the laws were themselves illegal (only possible in the USA or others who have a Constitution which may or may not affect this). Other than that if the law doesn't permit what you want, then what you want is illegal and hence yopu cannot sue.\n\n \n Exactly and this is what causes civil wars and what causes people to take justice into thier own hands. When the government is not responsive to who have been harmed then can you blame people for violence and innserection?", 
   {}, 
   255083, 
   null, 
   1174496400.0
  ], 
  [
   255089, 
   null, 
   "peteratwar", 
   "Exactly and this is what causes civil wars and what causes people to take justice into thier own hands. When the government is not responsive to who have been harmed then can you blame people for violence and innserection?\n\n \n Yes, if the laws have been brought in fairly, discussed and voted on.\n \n Still more so if there has been a referendum on the subject\n \n Your response is to lobby to get them changed. Otherwise you are only a bully or dictator. I know you don't really believe in democracy", 
   {}, 
   255087, 
   null, 
   1174497180.0
  ], 
  [
   255090, 
   null, 
   "E Mutz", 
   "What I am proposing is that If I loose money as a result of the death of my husband, which I would otherwise not have lost if we had had a marriage license, then I should have the right to sue those who where instrmental in stopping me from getting the license in the first place.\n \n I truly believe that ye should be able to love who ye will and pass your estate to whoever ye will. That being said, what money will ye lose if ye have a last will and testament that assigns these assets? You can presently name whoever ye will as beneficiary for your life insurance and death benefits. Ye can establish a power of attorney to establish who makes medical and estate decisions in your absence. These things are all done prudently outside the bonds of marriage whether ye marry a man, woman, or tree. \n \n Exactly and this is what causes civil wars and what causes people to take justice into thier own hands. When the government is not responsive to who have been harmed then can you blame people for violence and innserection?\n \n Now that would be epic. A Civil War to bring the homosexual states back into the union. We have already had the blue vs the gray. Perhaps this would be the blue vs the gay?", 
   {}, 
   255089, 
   null, 
   1174497780.0
  ], 
  [
   255095, 
   null, 
   "jim's trucking", 
   " These things are all done prudently outside the bonds of marriage whether ye marry a man, woman, or tree. \n \n ... \n...but he can't marry a tree...or a man. Luckily, he doesn't even have to be married to give what he wants, including power of attorney, to anyone he chooses.\n \n However, that's not good enough to stop the ridiculous argument that he must be granted the use of 'marriage'.", 
   {}, 
   255090, 
   null, 
   1174502040.0
  ], 
  [
   255100, 
   null, 
   "E Mutz", 
   "...but he can't marry a tree...or a man. Luckily, he doesn't even have to be married to give what he wants, including power of attorney, to anyone he chooses.\n \n However, that's not good enough to stop the ridiculous argument that he must be granted the use of 'marriage'.\n\n \n Are ye telling me that society would be harmed by allowing me to marry a tree? Who are ye to judge! What Douglas Fir and I do in the privacy of our own home has nothing to do with ye. Just because no one photosynthesizes in your marriage doesn't make mine unnatural. \n \n If you don't want to incite a civil war, you had better recognize unions between man and spruce. For that matter, bushes must henceforth be referred to as trees to prevent unequal treatment by loggers. Our age old definition of tree is discriminatory to other members of the plant kingdom. \n \n Stop intolerant beavers!!", 
   {}, 
   255095, 
   null, 
   1174504080.0
  ], 
  [
   255107, 
   null, 
   "Master_Shake", 
   "Are ye telling me that society would be harmed by allowing me to marry a tree? Who are ye to judge! What Douglas Fir and I do in the privacy of our own home has nothing to do with ye. Just because no one photosynthesizes in your marriage doesn't make mine unnatural. \n \n If you don't want to incite a civil war, you had better recognize unions between man and spruce. For that matter, bushes must henceforth be referred to as trees to prevent unequal treatment by loggers. Our age old definition of tree is discriminatory to other members of the plant kingdom. \n \n Stop intolerant beavers!!\n\n As much as I disagree with the point you're trying to make, this is hilarious! emoticon_smile emoticon_xbouncer", 
   {}, 
   255100, 
   null, 
   1174506000.0
  ], 
  [
   255112, 
   null, 
   "Coyote", 
   "Now that would be epic. A Civil War to bring the homosexual states back into the union. We have already had the blue vs the gray. Perhaps this would be the blue vs the gay?\n\n \n Blue vs. Pink", 
   {}, 
   255090, 
   null, 
   1174507920.0
  ], 
  [
   255117, 
   null, 
   "Coyote", 
   "...but he can't marry a tree...or a man. Luckily, he doesn't even have to be married to give what he wants, including power of attorney, to anyone he chooses.\n \n However, that's not good enough to stop the ridiculous argument that he must be granted the use of 'marriage'.\n\n \n Look, what we want is simple. We want our relationships accorded the same respect as heterosexuals are automatically given when they marry.\n \n You, as a heterosexual, are free to marry the person you love with your whole heart. Of course, as a heterosexual, the person whom you love with your whole heart will be someone of the opposite sex. That marriage will be recognized in every state and will be accorded the respect due to a union sanctioned by the state. \n \n If your wife (I'm assuming you're a guy) was in the hospital anywhere in the country, all you'd have to say is \"she's my wife\" to gain access. You wouldn't have to pull out paperwork proving that you have the right to see the person on the other side of that ICU door, nor would you find yourself in a state that refuses to acknowledge that paperwork.\n \n If your wife dies without a will, you won't have to fight off her surviving relatives should they decide that they don't like you and want to inherit everything of hers. If you're married, it's automatically assumed that everything goes to the spouse unless stated otherwise in a will. If you're not, it's automatically assumed that everything goes to the next closest of kin. \n \n If your wife had children before you married, and those children have lived with you for some time since you've been married, if something happened to your wife it would be assumed the children would stay with you.\n \n What do you suppose would happen to my child (living with me and my \"Domestic Partner\") if something were to happen to me? If my son wanted to remain living here with my partner and continuing to attend school here, do you think the judge would let him stay? I don't. It wouldn't matter what my son wanted or what I have in my will. The child's biological mother lives in Indiana, so that's where any legal decisions would be made.\n \n \nThe [Indiana] General Assembly initially approved the marriage-ban proposal two years ago. If it passes again in exactly the same form, it will go on the general election ballot in 2008 for final approval.\n \n The proposed amendment has two parts. First, it defines marriage as the union of one man and one woman. The second part says that state law \"may not be construed\" to provide the \"incidents\" of marriage on unmarried couples or groups.\n \n ***\n \n They also said it could nullify contracts between unmarried people, including many older Hoosiers, that address inheritance, health care and other legal issues.\n \n http://indianalawblog.com/archives/2007/02/ind_govt_shifti.html\n \n\n \n The only way to keep the states from discriminating against us is to have the 14th amendment finally taken seriously and same sex marriage federally recognized.\n \n \nNo State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States...\n \n http://www.usconstitution.net/const.html#Am14\n\n \n You have the privilege of having your relationship recognized in every state in the Union, and immunity from having your children taken away from you or being kicked out of the house if your wife dies.\n \n That's all we want.", 
   {}, 
   255095, 
   null, 
   1174509840.0
  ], 
  [
   255151, 
   null, 
   "JakeCJB", 
   "Are ye telling me that society would be harmed by allowing me to marry a tree? Who are ye to judge! What Douglas Fir and I do in the privacy of our own home has nothing to do with ye. Just because no one photosynthesizes in your marriage doesn't make mine unnatural. \n \n If you don't want to incite a civil war, you had better recognize unions between man and spruce. For that matter, bushes must henceforth be referred to as trees to prevent unequal treatment by loggers. Our age old definition of tree is discriminatory to other members of the plant kingdom. \n \n Stop intolerant beavers!!\n\n \n Yes, plants have rights too, and are willing to fight for their full participation in human society to the same degree as non-vegetation, gays. Don't get on the wrong side of plants. Remember the Day of The Triffids.", 
   {}, 
   255100, 
   null, 
   1174542780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How does Gay Marrige harm YOU?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9573-how-does-gay-marrige-harm-you.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9573, 
  "discussion_files": [
   [
    "25421.html", 
    "http://www.4forums.com/political/gay-rights-debates/9573-how-does-gay-marrige-harm-you-print.html"
   ], 
   [
    "25422.html", 
    "http://www.4forums.com/political/gay-rights-debates/9573-how-does-gay-marrige-harm-you-3-print.html"
   ], 
   [
    "25423.html", 
    "http://www.4forums.com/political/gay-rights-debates/9573-how-does-gay-marrige-harm-you-2-print.html"
   ]
  ], 
  "identifier": 9573
 }
]