[
 [
  [
   252283, 
   null, 
   "wascallywabbit", 
   "**\n Just some random thoughts on the nature of intelligence.\n \n Intelligence, generally speaking, is considered to be a trait or property or characteristic that can only be considered as an ability, capacity, or power; that is, as an abstract quality, and not as any concrete entity that takes up space in the universe. That is, intelligence cannot be reified or materialized or in any way rendered corporeal. This means that it can only be inferred, rather than directly observed, from its effects upon corporeal entities. And that, therefore, is the only way in which it can be measured, and for materialists and materialist science, measurement is the sine qua non.\n \n For the strictist materialists, all of that which is abstract and incorporeal is, per se, unreal. By their definition of reality. Therefore, in their ontology, intelligence and other non-corporeal natural phenomena are essentially unreal. They are merely the epiphenomena, the 'side effects', of the only real entities, that is, 'bits of stuff', or 'particles'. Apparently that is mass bearing particles and massless packets of energy, even though energy is itself an incorporeal abstraction. Energy is an example of materialism reifying, concretizing, an abstraction, in order to make reality conform to their metaphysic. \n \n The \"epiphenomena\" supposedly generated by these sole actual entities (\"particles\") out of their motion in space--that is, out of their interactions with one another,-- would include all natural phenomena which do not take up space, including intelligence. Anyone starting from this materialist point of view will be unable to deal with the essential reality of intelligence and all other psychical qualities, properties, traits as real causes, or to attribute their observable and observed effects on material entities back to them, rather than to the motion of particles in space.\n \n But if we begin by discarding the metaphysical postulats of materialism, and consider psychical phenomena, such as intelligence, to be every bit as real as any mass-bearing particle, or even go so far as to postulate that even mass-bearing particles are the epiphenomena of dynamic non-corporeal, abstract phenomena such as intelligence, we have an entirely fresh ontology; that of Idealism/Dynamism/Vitalism.\n \n From that POV, intelligence might be defined as the dynamic power or capacity possessed by some entities, by which power they can receive sense-data about themselves and others, can discriminate between themselves and others, can determine a set of values based upon what is best for themselves, (and, in advanced cases, others), can discriminate between strategies for obtaining what is best for themselves, as personal goals and ends, and can choose/select, (by comparing new data to retained data in order to generate meaning and significance. i.e., information), between alternative goal-seeking, value-driven, strategies/behaviours, and then act in accordance with that selected alternative.\n \n In order to study intelligence, it is essential to know and understand motivation, and motivation cannot be known or understood without first knowing and understanding the value system of the entity under study. Anything which does not possess it's own intrinsic value-system is not naturally intelligent. Machines or artifices which reflect the intelligent capacities that have been invested in them by naturally intelligent agents may be termed artificially intelligent, but in fact they are not intelligent, in se, but are merely the material extension of an intelligent agent or agents. Simply because they serve the values/goals of those agents, and not their own.\n \n The only inherent, intrinsic values/goals that may be inferred generally, if not universally, are those detected in the behaviours of live organisms. At their most basic they reduce to survive, thrive, and self-replicate. These goals vary in strength and importance to one another, even within the same organism, depending upon local circumstances and the organism's individual history, and their local variations are numerous and comlex, making them difficult to discern, and so making the behaviours they motivate largely unpredictable, without being random.\n \n Well, just some idle thoughts. If anyone has anything to add, feel free.", 
   {
    "post_info": {
     "post_title": "Intelligence considered."
    }
   }, 
   null, 
   null, 
   1172343120.0
  ], 
  [
   252308, 
   null, 
   "supersport", 
   "Good post. \n \n Materialists only acknowledge \"things.\" That's why they'd love nothing more than to be able to explain life by the things they can see -- for 50 years these \"things\" were genes. Now they are realizing -- or at least some of them are -- that the culmination of our genes do not make us who we are. Yet, they've filled millions of hours in the past decades catagorizing species, analyzing molecules, labeling all the shades and colors and trivial physical characteristics of animals and much more. Little do they know that it's the intrinsic properties that explain life. Life is not and will never be explained by looking at the physical. When an animal adapts to its environment, the first step is not an accidental change in a single structure, it's a wholistic phenomenon that begins with an intelligent \"idea\" or \"sensation.\" Neither of these two can be scientifically measured -- thus materialists ignore them as if they don't exist.", 
   {}, 
   252283, 
   null, 
   1172364060.0
  ], 
  [
   252355, 
   null, 
   "Symbiote", 
   "This interests me as I am currently beginning my thesis based around intelligence, ways we could improve intelligence testing, things that such tests should cover but don't, etc.\n \n \nIntelligence, generally speaking, is considered to be a trait or property or characteristic that can only be considered as an ability, capacity, or power; that is, as an abstract quality, and not as any concrete entity that takes up space in the universe. That is, intelligence cannot be reified or materialized or in any way rendered corporeal. This means that it can only be inferred, rather than directly observed, from its effects upon corporeal entities. And that, therefore, is the only way in which it can be measured, and for materialists and materialist science, measurement is the sine qua non.\n\n \n Sort of true. We could try and measure it by assigning mental tasks to perform and viewing the results. Still others would argue that a truer measure of intelligence is direct measurement of the physical constructs that cause or are what we view as intelligence, through attributes such as transmission speed, packet loss, neural density, volume of interconnections and soforth.\n \n I would tend to agree with the latter, I believe when we talk about someone's intelligence we are talking about the physical attributes of their brain. At the same time the term \"intelligence\" is necessarily vague, a sort of broad summary of someone's capabilities. If we wanted to be more precise we could specify particular properties, and indeed someone might have a high transmission speed but a lot of packet loss, or vice versa.\n \n To draw an analogy with another attribute, \"fitness\". When we say someone is \"physically fit\", we mean they are good at performing physical tasks. Now we could try to scientifically \"measure\" fitness by having them perform a variety of physical tasks and averaging the results, but one person might be more determined than another and this would necessarily contaminate the results. So a more accurate measure would be to specifically measure their muscles, fat, heart volume and strength, lung capacity, etc, and through some formula come up with a \"fitness\" figure... but to be even more precise we could simply hold these factors separate.\n \n \nAnyone starting from this materialist point of view will be unable to deal with the essential reality of intelligence and all other psychical qualities, properties, traits as real causes, or to attribute their observable and observed effects on material entities back to them, rather than to the motion of particles in space.\n\n \n But you see, for the materialist, there is no distinction between \"intelligence\" and \"the motion of physical particles in space\", its not an either/or proposition - they may well say \"He scored 155 on the IQ test because he is intelligent (by intelligent, meaning his brain has certain physical characteristics).\n \n \nIn order to study intelligence, it is essential to know and understand motivation, and motivation cannot be known or understood without first knowing and understanding the value system of the entity under study.\n\n \n Well, sort of. It isn't necessary, but if you're predicting intelligence from what someone does rather than direct measurements of physical properties, knowing their motivation level might allow you to make more accurate predictions.\n \n Nevertheless even without knowing the subjects' motivations at all, today's generic intelligence tests still have excellent predictive power for success in both school and employment, and are perhaps better predictors for future success than any other method we have (including interviews, personality inventories, aptitude in a particular field)\n \n \n. Anything which does not possess it's own intrinsic value-system is not naturally intelligent. Machines or artifices which reflect the intelligent capacities that have been invested in them by naturally intelligent agents may be termed artificially intelligent, but in fact they are not intelligent, in se, but are merely the material extension of an intelligent agent or agents. Simply because they serve the values/goals of those agents, and not their own.\n\n \n Firstly, I wish to distinguish the terms \"intelligent\" and \"consciousness\", I assume you are talking here about what makes a thing conscious, rather than clever. I agree that a thing needs to have a system of preferences to be considered conscious. I'm not sure why you include the corollary that these preferences need to be \"innate\" or \"not invested in them by naturally intelligent agents\" - it makes no difference to a creature's behaviour or to their moral status how they got certain preferences. If tonight when you went to sleep I performed surgery on you and implanted in you a burning desire for Coca Cola you would be no less conscious or \"intelligent\" the next morning when you woke up.\n \n Now there are no machines at present in existence (that I know of) that I would definitively say possess such consciousness, but if we are considering fictional machines, I would certainly that for example the Terminator robots (with their preprogrammed preferences) are indeed conscious entities.\n \n \n\n The only inherent, intrinsic values/goals that may be inferred generally, if not universally, are those detected in the behaviours of live organisms. At their most basic they reduce to survive, thrive, and self-replicate.\n\n \n Much less generally than you might consider - I don't believe most living things are conscious and have desires at all - for example trees, mosses and ants certainly DO survive, thrive and self-replicate, and they certainly ARE alive, but they do not appear to WANT to behave this way, they have simply evolved biological features that induce them to perform these functions.\n \n And even amongst humans (whose motivations we know best), our basic drives don't appear to be the ones you mentioned at all. For example a basic desire is to satiate our appetite and thirst, even before we know what death is, a basic desire is to have sex even if we do not know sex causes reproduction.\n \n Indeed an organism that had a basic desire of \"avoid death\" would probably die quite early, because it would not have the experience to know what was required of it to attain this goal. \"eat things that taste good\" and \"drink when you are thirsty\" are much more productive instincts.", 
   {}, 
   252308, 
   null, 
   1172395620.0
  ], 
  [
   252356, 
   null, 
   "Symbiote", 
   "Materialists only acknowledge \"things.\" That's why they'd love nothing more than to be able to explain life by the things they can see -- for 50 years these \"things\" were genes. Now they are realizing -- or at least some of them are -- that the culmination of our genes do not make us who we are.\n\n \n 1) The proportion of influence attributable to genes and environment on various attributes has been an ongoing debate in science for a long, long time. And you won't find any reputable scientist who believes that people are reducable to their genes alone - but thankyou for revealing once again your remarkable dishonesty. Michael Jordan wouldn't have been good at basketball if he didn't train hard, but no matter how hard you train, you won't be as good as Jordan, because you don't have the genes for it.\n \n 2) The environment is a material thing and appealing to its influence is in no way contrary to materialism.\n \n \n \nLittle do they know that it's the intrinsic properties that explain life. Life is not and will never be explained by looking at the physical. When an animal adapts to its environment, the first step is not an accidental change in a single structure, it's a wholistic phenomenon that begins with an intelligent \"idea\" or \"sensation.\" Neither of these two can be scientifically measured -- thus materialists ignore them as if they don't exist.\n\n \n If they can't be scientifically measured, how can science study them or even say anything about them? How do you know not only that they exist, but also what they do, if scientific evidence for them is inherently impossible? Did the voices in your head tell you?\n \n How do you explain the environment influencing these non-material things (ideas) and then these non-material things influencing an organism? \n \n What you're proposing is a pointless brand of dualism. Going:\n Material World ------influences-----< Nonmaterial World -------influences------< Material World, pointless because we can just as easily cut out the middle man and study the phenomenon scientifically, assuming it behaves in a predictable way.\n \n Your theory would be analogous to proposing that mass doesn't cause gravity, but rather that Mass causes immaterial ideas, and that these immaterial ideas then cause gravity - even if it were \"true\", which could never be proven, it would be an entirely pointless addition to humanities body of knowledge - it would add nothing to the predictive power of the theory, so why waste your time even talking about it?", 
   {}, 
   252355, 
   null, 
   1172397360.0
  ], 
  [
   252379, 
   null, 
   "wascallywabbit", 
   "\n This interests me as I am currently beginning my thesis based around intelligence, ways we could improve intelligence testing, things that such tests should cover but don't, etc.\n\n \n **\n Hi symbiote; thanks for the interesting response.\n \n \n\n Quote:\n Intelligence, generally speaking, is considered to be a trait or property or characteristic that can only be considered as an ability, capacity, or power; that is, as an abstract quality, and not as any concrete entity that takes up space in the universe. That is, intelligence cannot be reified or materialized or in any way rendered corporeal. This means that it can only be inferred, rather than directly observed, from its effects upon corporeal entities. And that, therefore, is the only way in which it can be measured, and for materialists and materialist science, measurement is the sine qua non. \n \n \n Sort of true. We could try and measure it by assigning mental tasks to perform and viewing the results.\n\n \n **\n That is precisely what we do do, simply because that is all we can do, as I just said.\n \n \n \n\n Still others would argue that a truer measure of intelligence is direct measurement of the physical constructs that cause or are what we view as intelligence, through attributes such as transmission speed, packet loss, neural density, volume of interconnections and soforth.\n\n \n **\n This is really nothing more than the old method of measuring skull size and shape in proportion to overall body mass in order to establish intelligence as a brain-size to body-size correlation that is sufficiently constant and universal as to render 'intelligence' a simple corollary of a physical quantity. The only problem being that that that correlation is quite simply not universal, constant, and linear, but is at best a simple rule of thumb. \n \n Now, accepting that fact, materialist/mechanist science has sub-divided the brain into 'regions', and even reduced its components to, as you say, to \"transmission speed, packet loss, neural density, volume of interconnections and soforth\". That's all very well at showing where and how the brain operates mechanically, as a tool, but it still does not tell us anything about what it is that wields that tool. If you claim that the brain uses itself, then once again, as in genetics, you must employ reduction until you make inanimate bits of stuff in charge of, and responsible for, every phenomenon that inanimate bits of stuff cannot possibly experience in any way, shape or form.\n \n To avoid this, materialists must abandon their purely quantitative worldview and accept qualitative differences. That is, they must accept that 'form' is as real as 'substance', and that form is insubstantial and incorporeal, (i.e., abstract, as in math and geometry), and cannot be reduced to 'bits of stuff in motion'. And that neither can any abstract, psychical property or phenomenon be so reduced.\n \n \n\n I would tend to agree with the latter, I believe when we talk about someone's intelligence we are talking about the physical attributes of their brain.\n\n \n **\n That is the materialist/mechanist view, for sure. I, OTH, would posit that the brain is the physical attribute of intelligence, that is, of form generation, of mind 'informing' substance. Just as a newspaper is. And, just as simply reducing a newspaper to it essential substances and chemicals, its 'bits of stuff', will in the end reveal little of note about the nature of newspapers, neither will reducing the brain to its corporeal, physical components reveal anything about the nature of 'mind', and mind's psychical components, such as, 'intelligence'.\n \n \n \n To draw an analogy with another attribute, \"fitness\". When we say someone is \"physically fit\", we mean they are good at performing physical tasks. Now we could try to scientifically \"measure\" fitness by having them perform a variety of physical tasks and averaging the results, but one person might be more determined than another and this would necessarily contaminate the results.\n\n \n **\n Right here you have shown perfectly how mere substance has no dependable correlation to behaviour in a living organism, but that incorporeals, abstractions, such as values and motives can, to some degree, over-ride and over-rule substance in such cases. That is to say, mind can sometimes overcome matter in living organisms, which would be impossible if mind were only an epiphenomenon of matter.\n \n \n \n\n Quote:\n Anyone starting from this materialist point of view will be unable to deal with the essential reality of intelligence and all other psychical qualities, properties, traits as real causes, or to attribute their observable and observed effects on material entities back to them, rather than to the motion of particles in space. \n \n \n But you see, for the materialist, there is no distinction between \"intelligence\" and \"the motion of physical particles in space\", its not an either/or proposition - they may well say \"He scored 155 on the IQ test because he is intelligent (by intelligent, meaning his brain has certain physical characteristics).\n\n \n **\n I thought that this was what I had just said. Oh well, it bears repeating.\n \n \n\n Quote:\n In order to study intelligence, it is essential to know and understand motivation, and motivation cannot be known or understood without first knowing and understanding the value system of the entity under study. \n \n \n Well, sort of. It isn't necessary, but if you're predicting intelligence from what someone does rather than direct measurements of physical properties, knowing their motivation level might allow you to make more accurate predictions.\n\n \n **\n Well, that's it then. The issue becomes this;-- is it actually, (as opposed to theoretically), as possible to accurately predict behaviour in dynamic, self-directing biosystems, strictly from direct measurements of their physical properties, as it is to do so wrt mechanical, passive, externally directed systems, (eg. machines, solar systems, etc.)? I say that it is not. If it is, then we should be as able to predict every choice a lab rat makes, supposing we have full knowledge of its morphology and biochemistry. But even having only partial knowledge of an organism's morphology and biochemistry should be enough to determine most of its choices. So, according to your view, if we found a live space alien we could carefully measure and analyse its/his/her morphology and biochemistry, and predict exactly what choices it/he/she would make in given circumstances, would we not? Obviously I here once more link intelligence to choice of behaviour, where a mechanist might claim that reality is fully determined, and the concept of 'choice' is illusory.\n \n Time for a break. More later.", 
   {}, 
   252356, 
   null, 
   1172432340.0
  ], 
  [
   252386, 
   null, 
   "supersport", 
   "1) The proportion of influence attributable to genes and environment on various attributes has been an ongoing debate in science for a long, long time. And you won't find any reputable scientist who believes that people are reducable to their genes alone - but thankyou for revealing once again your remarkable dishonesty. \n\n \n hang on -- screw the debate -- your whole theory is based on random genetic mutations. It's these changes in genes that supposedly make the changes in phenotype....but if the environment is what cues different phenotypes (which it does), not new or different or changing genes, then your theory is worthless. (natural selection can only work off of random, genetically-linked changes in phenotype.....if there are beneficial changes in phenotype that are not linked to genes, then there is no way for animals to build up genetically over time because NS would be unable to \"see\" the genes, instead all it would see is the enviornmentally-induced phenotype.)\n \n \n \nMichael Jordan wouldn't have been good at basketball if he didn't train hard, but no matter how hard you train, you won't be as good as Jordan, because you don't have the genes for it. \n\n \n The reason Michael Jordon can do what he does is not because he has different genes than other people -- it's because of the way his genes are expressed. Gene expression is the resut of many things, including heredity and a maze of other factors such as diet, exercise, environment etc.\n \n \n \n2) The environment is a material thing and appealing to its influence is in no way contrary to materialism. \n\n \n You don't know your theory. Your theory was constructed on small genetic changes that happen irrespective to the enviornment. This is a core issue for you guys....if you want to turn around and run from it, fine. According to you guys the one and only thing that is creative is natural selection. All variation must arise unoriented to the environment -- it's natural selection and only natural selection which determines who is adapted and who is not. Period. If you don't like this then I suggest you do some further research and find what you do like.", 
   {}, 
   252356, 
   null, 
   1172433780.0
  ], 
  [
   252406, 
   null, 
   "wascallywabbit", 
   "\n Nevertheless even without knowing the subjects' motivations at all, today's generic intelligence tests still have excellent predictive power for success in both school and employment, and are perhaps better predictors for future success than any other method we have (including interviews, personality inventories, aptitude in a particular field)\n\n \n **\n You have here linked 'intelligence' to the concept of 'success'; something with which I agree heartily, but which a materialist/mechanist must discard along with all other values. For a materialist/mechanist values entail teleology, (as indeed, they do), where teleology is antithetical materialism/mechanism. As in the view that evolution is non-directional and undirected, save by mechanical forces that are themselves ateleological, and whose own origins are held to be ateleological.\n \n \n\n Quote:\n . Anything which does not possess it's own intrinsic value-system is not naturally intelligent. Machines or artifices which reflect the intelligent capacities that have been invested in them by naturally intelligent agents may be termed artificially intelligent, but in fact they are not intelligent, in se, but are merely the material extension of an intelligent agent or agents. Simply because they serve the values/goals of those agents, and not their own. \n \n \n Firstly, I wish to distinguish the terms \"intelligent\" and \"consciousness\", I assume you are talking here about what makes a thing conscious, rather than clever.\n\n \n **\n Let's be careful here. I, too take pains to distinguish intelligence from consciousness. I would saythat intelligence includes awareness, but not necessarily an awareness of being aware; that which I would call consciousness. Therefore intelligence can be, (and in nature usually is), an attribute of which the organism is unconscious. Deliberate, analytical, consciously directed thought is reserved for the most advanced biosystems, such as ourselves, but it is an anthropocentric projection to assume that anything that has not attained our level of intelligence is, by that token, unintelligent.\n \n \n\n I agree that a thing needs to have a system of preferences to be considered conscious. I'm not sure why you include the corollary that these preferences need to be \"innate\" or \"not invested in them by naturally intelligent agents\" - it makes no difference to a creature's behaviour or to their moral status how they got certain preferences.\n\n \n **\n I think it makes all the difference in the world to \"their moral status\", but leaving that aside, it also makes all the difference in the world to biology, that is, our understanding of life forms and their operations. Simply because it makes all the difference in the world between dynamic and passive, natural and artificial, and other concepts central to the field. You may say that it makes no difference whether a horse pulls a wagon because it inherently chooses to pull wagons, or because it has been 'trained' to do so, but I disagree. Perhaps it does not make a difference to the wagon, but I believe that it makes a great deal of difference to the horse, and that difference can amount to a real difference for the carter. \n \n \n\n If tonight when you went to sleep I performed surgery on you and implanted in you a burning desire for Coca Cola you would be no less conscious or \"intelligent\" the next morning when you woke up.\n\n \n **\n Not so. My intelligence would be diminished by my inability to reject coke as a choice. Moreover, the cause for my yen for coke would be apart from any analysis I might make of it, making my behaviour less conscious, (as I have defined it, above), then it would have been had I been conscious of what you'd done.\n \n \n\n Now there are no machines at present in existence (that I know of) that I would definitively say possess such consciousness, but if we are considering fictional machines, I would certainly that for example the Terminator robots (with their preprogrammed preferences) are indeed conscious entities.\n\n \n **\n I know nothing of them. I can only say that a mechanical behaviour is a choice-free behaviour, and is therefore not an intelligent behaviour. If you can inject me with something that compels me to seek out and drink a coke, then I am not acting freely, and if I am not choosing to act in a certain fashion, then intelligence is not involved, at least not directly, in what I do. That is to say, intelligence and volition are inseparable. A horse is 'intelligent' when it makes its own decisions, directs its own behaviours. Those behaviours it performs according to some other entity's volition, have no connection to its intelligence, and only indirectly to the intelligence of its trainer/drover. That is the difference between natural and artificial intelligence. If you ever get robots, warbots, computers, that are able to do what they want to do, rather than what you want them to do, you better run.\n \n \n\n Quote:\n The only inherent, intrinsic values/goals that may be inferred generally, if not universally, are those detected in the behaviours of live organisms. At their most basic they reduce to survive, thrive, and self-replicate. \n \n \n Much less generally than you might consider - I don't believe most living things are conscious and have desires at all - for example trees, mosses and ants certainly DO survive, thrive and self-replicate, and they certainly ARE alive, but they do not appear to WANT to behave this way, they have simply evolved biological features that induce them to perform these functions.\n\n \n **\n Granted that much organismic behaviour has become automatized over time, it was still intelligently generated in its origins. That is, at some time in the past their forebears did choose to act that way. To say that \"they have simply evolved biological features that induce them to perform these functions\" says, (if you will pardon me; no offense meant), nothing at all.\n \n \n\n And even amongst humans (whose motivations we know best), our basic drives don't appear to be the ones you mentioned at all. For example a basic desire is to satiate our appetite and thirst, even before we know what death is, a basic desire is to have sex even if we do not know sex causes reproduction.\n\n \n **\n You are confusing consciousness and knowledge with goals and drives. Why would a living, sentient biosystem need to 'know' about death if its inherent goal is to survive, thrive, and reproduce in some fashion? If those are inherent goals, as I suggest, then consciousness of them and their alternatives isn't going to change them.\n \n But you might ask yourself where goals, drives, motives, and values come from, since, to the best of my knowledge, bits of stuff in motion possess none of these things.\n \n \n\n Indeed an organism that had a basic desire of \"avoid death\" would probably die quite early, because it would not have the experience to know what was required of it to attain this goal. \"eat things that taste good\" and \"drink when you are thirsty\" are much more productive instincts.\n\n \n **\n Again you are confusing overall goals with the particular behaviours taken to achieve them. Eating, drinking, breathing and metabolizing are all necessary to the goal of survival. So is being afraid of heights, snakes, lions and tigers and bears, oh my.The sensations of hunger, thirst, cold, heat, and on and on are all servants of this intrinsic goal/drive. For the materialist the problem is to explain how these goals and the mechanisms that achieve them could arise, ex nihilo, 'spontaneously', out of bits of stuff that not only do not possess them, but are not even aware of their existence.\n __________________", 
   {}, 
   252379, 
   null, 
   1172446740.0
  ], 
  [
   252418, 
   null, 
   "Symbiote", 
   "That is precisely what we do do, simply because that is all we can do, as I just said.\n\n \n It's not \"all we can do\", we can also measure physical attributes of the brain... increasingly so with advances in technology..\n \n \nThis is really nothing more than the old method of measuring skull size and shape in proportion to overall body mass in order to establish intelligence as a brain-size to body-size correlation that is sufficiently constant and universal as to render 'intelligence' a simple corollary of a physical quantity. The only problem being that that that correlation is quite simply not universal, constant, and linear, but is at best a simple rule of thumb.\n\n \n Yes, skull size is only a (quite poor) rule of thumb because it is only one part of it, for example someone may have a large brain that is not very densely packed, and because what is actually important is brain mass (density and volume) rather than raw volume, this measure is going to be inherently flawed - people with thicker skulls will also have their intelligence overestimated by such a measure.\n \n When we take these factors into account and get at brain mass rather than raw skull size we get much higher correlations with traditional intelligence measures. And that's still only part of the picture, we haven't yet looked at the relative proportions of different parts of the brain and degree of myelinisation for example...\n \n So its not \"nothing more\" than measuring skull size, its a \"lot more\", and a \"lot more reliable a predictor of performance\".\n \n \nThat's all very well at showing where and how the brain operates mechanically, as a tool, but it still does not tell us anything about what it is that wields that tool. \n\n \n You're making the assumption that the brain requires a \"user\" when the reality could easily be that it contains the functionality to operate without one. When a tree grows, who is \"using\" it? When a stream flows, who is making it? To the brain, thought is just as natural, it doesn't require positive direction to do it, and it makes no sense to demand an operator, who presumably also requires an operator, in some kind of infinite operator chain.\n \n \nWell, that's it then. The issue becomes this;-- is it actually, (as opposed to theoretically), as possible to accurately predict behaviour in dynamic, self-directing biosystems, strictly from direct measurements of their physical properties, as it is to do so wrt mechanical, passive, externally directed systems, (eg. machines, solar systems, etc.)? I say that it is not. If it is, then we should be as able to predict every choice a lab rat makes, supposing we have full knowledge of its morphology and biochemistry. But even having only partial knowledge of an organism's morphology and biochemistry should be enough to determine most of its choices.\n\n \n If we have full knowledge of a system we can predict all of its consequences, yes. If we know 90% of a system there is no reason to believe that we can predict 90% of its consequences, that's absurd. A single unknown factor in an equation renders the solution unfindable, and we are then confined to probabalistic predictions about relatively broad performance indicators, rather than specific accurate predictions.\n \n And we are a long way from knowing 90% about the brain, human or rat.\n \n Nevertheless psychometric inventories AND measures of physical brain attributes can be used to make predictions which are accurate to the point of being useful.\n \n \nSo, according to your view, if we found a live space alien we could carefully measure and analyse its/his/her morphology and biochemistry, and predict exactly what choices it/he/she would make in given circumstances, would we not?\n\n \n If we haven't yet fully understood even the brain of a rat, what makes you think we could gain complete knowledge of an alien brain system through study? Theoretically, yes, with sufficient time and advances in technology we could, but we do not yet have the power to do this.\n \n \nYou have here linked 'intelligence' to the concept of 'success'; something with which I agree heartily, but which a materialist/mechanist must discard along with all other values. For a materialist/mechanist values entail teleology, (as indeed, they do), where teleology is antithetical materialism/mechanism. As in the view that evolution is non-directional and undirected, save by mechanical forces that are themselves ateleological, and whose own origins are held to be ateleological.\n\n \n This is a caricature of materialism that presents a sort of strawman version to knock down. I am a materialist, and for me values do not entail teleology, so your claim \"for a materialist, values entail teleology\" is false. A creature can have \"values\" in the form of physical properties in their brain, and these physical properties of their brain can influence their future action - this isn't \"teleology\" at all.\n \n \nNot so. My intelligence would be diminished by my inability to reject coke as a choice. Moreover, the cause for my yen for coke would be apart from any analysis I might make of it, making my behaviour less conscious, (as I have defined it, above), then it would have been had I been conscious of what you'd done.\n\n \n Likewise you could dream of coke and wake up, unremembering your dream and desiring coke.... or have a stroke and have the same thing happen, the distinction between another person intervening and it happening by accident make no difference.\n \n \n. If you can inject me with something that compels me to seek out and drink a coke, then I am not acting freely, and if I am not choosing to act in a certain fashion, then intelligence is not involved, at least not directly, in what I do.\n\n \n Well this involves the free will / determinism debate, you say you aren't free if your preferences are implanted... I say you are free when you act in accordance with your preferences, regardless of how those preferences were arrived at. I think to claim you need to \"choose\" your preferences is absurd, as the act of choosing requires prior preferences, which presumably also required a choice.... and the question of how we acquired our first preference arises...\n \n \nGranted that much organismic behaviour has become automatized over time, it was still intelligently generated in its origins. That is, at some time in the past their forebears did choose to act that way.\n\n \n You're claiming the ancestors of trees \"chose\" to grow seeds and only now in later generations the process of reproduction is automised?\n \n \nYou are confusing consciousness and knowledge with goals and drives. Why would a living, sentient biosystem need to 'know' about death if its inherent goal is to survive, thrive, and reproduce in some fashion? \n\n \n If an organism doesn't KNOW that starvation causes death, why would it choose to eat to survive? Why wouldn't it simply stab itself with scissors instead? A \"desire to live\" is meaningless without knowledge of the causes of life and death, knowledge I think we can safely say we are not born with.\n \n \n\n But you might ask yourself where goals, drives, motives, and values come from, since, to the best of my knowledge, bits of stuff in motion possess none of these things.\n\n \n They most certainly do.\n \n \n \n Supersport - I won't bother responding to someone who continually LIES and then pretends it never happened when he is called on it. Find me some scientists who think people are wholly determined by their genes or shut it. Show me how \"environmental influence\" is contrary to materialism or shut it. You're a waste of everybody's time.", 
   {}, 
   252283, 
   null, 
   1172455740.0
  ], 
  [
   252434, 
   null, 
   "supersport", 
   "Supersport - I won't bother responding to someone who continually LIES and then pretends it never happened when he is called on it. Find me some scientists who think people are wholly determined by their genes or shut it. Show me how \"environmental influence\" is contrary to materialism or shut it. You're a waste of everybody's time\n \n Your challenge is quite simple. Your materialist theory is grounded on a platform that DNA cannot be changed in an adaptive manner in response to an environmental stimuli. According to your theory, when an organism is presented with a problem, it cannot introduce a change in its own DNA. Instead, changes in organisms must arise in a random manner, and the selection of those organisms with randomly adaptive change then follows. This is one of the fundamental concepts of ToE. Another fundamental concept is that the soma cannot influence the hereditary information in the germ cells...The Weismann's Barrier says that organims may produce more hair or thicker skin, for instance, when introduced to colder weather, but thicker skin and longer hair will not be transmitted to progeny, which makes lamarckian inheritance impossible. This, of course is not the truth. Epigenetics proves a quasi-lamarckian inheritance that dispenses with Weismann's barrier and adaptive mutations and Horizontal gene transfer dispenses with the inference that DNA is not adaptive.\n \n http://www.twnside.org.sg/title/bad.htm\n \n Directed mutation, or adaptive mutation, is a phenomenon first discovered in bacteria some 25 years ago, and is now found in yeast and other organisms. When cells are presented with a nutrient they cannot use, the starving cells eventually acquire mutations that enable them to feed on it. Directed mutations may be similar to the mutations that make cells resistant to drugs, insecticides and herbicides. Gene conversion, on the other hand, is the substitution of one sequence of a gene by another. Evidence suggests that those genes that are most actively used are candidates for converting other genes. This is a case of the Lamarckian principle of use and disuse at the molecular level. \n \n Finally, the genes themselves can travel outside the original organism on their way to infect another. This is horizontal gene transfer, now known to be very widespread. The scope of horizontal gene transfer is essentially the entire biosphere, so genes and genomes are not only fluid and adaptable, they are also delocalised. Typical vectors or carriers for horizontal gene transfer are viruses, and other genetic parasites, plasmids and transposons. Plasmids are pieces of DNA that replicate independently of the genome of cells, and transposons are 'jumping genes' - units of DNA that can jump from one site in the genome to another, or jump out into the genome of another organism altogether.\n \n Finally, the ultimate neo-Darwinian taboo has been broken. Wiesmann's barrier has been breached, and in many different forms, some of which I mentioned already (see box 2). \n \n \n Now what I'd like you to do is show me how Epigenetics, horizontal gene transfer, non-random mutations and phenotypic plasticity fit under the neo-darwin umbrella. I would a link please to back yourself up just so I don't think you're blowing smoke.\n \n Oh, and stop calling me a liar.", 
   {
    "unicode_changes_made": true
   }, 
   252418, 
   null, 
   1172461860.0
  ], 
  [
   252455, 
   null, 
   "Hi_Its_Me", 
   "Your challenge is quite simple. Your materialist theory is grounded on a platform that DNA cannot be changed in an adaptive manner in response to an environmental stimuli. According to your theory, when an organism is presented with a problem, it cannot introduce a change in its own DNA.\n\n That isn't completely true. Bacteria have been observed to increase their mutation rate in times of stress. (I don't remember the exact source, but I do know that you provided it.) Put another way, bacteria have been observed to introduce random changes in their DNA when they are presented with a problem.\n Also, while the ToE is not based on the assumption that DNA may change in response to environmental stimuli, it doesn't rule that out, either. Life is pretty complex, and a simple ToE just doesn't cover everything.\n \nInstead, changes in organisms must arise in a random manner, and the selection of those organisms with randomly adaptive change then follows. This is one of the fundamental concepts of ToE. Another fundamental concept is that the soma cannot influence the hereditary information in the germ cells...The Weismann's Barrier says that organisms may produce more hair or thicker skin, for instance, when introduced to colder weather, but thicker skin and longer hair will not be transmitted to progeny, which makes lamarckian inheritance impossible. This, of course is not the truth. Epigenetics proves a quasi-lamarckian inheritance...\n\n Only to a point. Something you may not know (or may not realize the implications of) is that epigenetic inheritance is reversible. The relevance of this is that information about the organism's previous state must be stored somewhere (or else the process could not be reliably reversed). As you probably know, information regarding the phenotype of an organism is stored within DNA.\n The conclusion? DNA stores information about all states which can be activated via epigenetic inheritance. Therefore, your \"quasi-Lamarckian inheritance\" must remain just that. You will be unable to show (via epigenetics, at least) that organisms pass on all traits (or most adaptive traits; take your pick) which they acquire during their lifetimes.\n \n If you remain unconvinced by my analysis, read this section of the Wikipedia entry. Actually, read it whether or not you are convinced.\n \n...that dispenses with Weismann's barrier and adaptive mutations and Horizontal gene transfer dispenses with the inference that DNA is not adaptive.\n\n Please rephrase that statement unless you mean that this molecule regulates its reproduction to ensure that its offspring (for lack of a better word) have a more favorable code.\n \nhttp://www.twnside.org.sg/title/bad.htm\n\n A quote from the page:Abstract: The debate on evolution between the creationists and the neo-Darwinists is not just sterile, it misses the central issue, which is that neo-Darwinism is wrong and dangerous. It is promoting and misguiding a runaway technology that has the potential to destroy all life on earth. It reinforces a worldview that undermines every single moral value that makes us human. It is also obstructing and preventing the necessary shift to holistic ecological sciences that can connect to the organic revolution rising from the grassroots all over the world, which can truly regenerate the earth and revitalize the human spirit.\nI'm pretty sure I've seen this before. I can already tell that the writer is biased in favor of religion.\n \nDirected mutation, or adaptive mutation, is a phenomenon first discovered in bacteria some 25 years ago, and is now found in yeast and other organisms. When cells are presented with a nutrient they cannot use, the starving cells eventually acquire mutations that enable them to feed on it.\n\n That is an adaptive mutation. There is no evidence that it is directed in any way you would care to use the term.\n The author of the paper is attempting to mislead, and it would be nice if you didn't quote such authors...\n \nDirected mutations may be similar to the mutations that make cells resistant to drugs, insecticides and herbicides. Gene conversion, on the other hand, is the substitution of one sequence of a gene by another. Evidence suggests that those genes that are most actively used are candidates for converting other genes. This is a case of the Lamarckian principle of use and disuse at the molecular level. \n \n Finally, the genes themselves can travel outside the original organism on their way to infect another.\n\n Is that a joke? It isn't the correct use of the term (except possibly when talking about viruses, but that's a stretch)...\n \nThis is horizontal gene transfer, now known to be very widespread. The scope of horizontal gene transfer is essentially the entire biosphere...\n\n \"Oh no! I've just been infected with the genes of a banana! Now all my children will be plants!\"\n \n I may not have a P.H.D. in biology, but I can tell you that that isn't how it works. If people received any genes from plants, chances are that it would be mentioned by the media...\n Human-to-human transfer is more likely, but people generally appear to have traits similar to their parents. Either way, this doesn't appear to be very relevant to environmental influence or materialism.\n \n...so genes and genomes are not only fluid and adaptable, they are also delocalised. Typical vectors or carriers for horizontal gene transfer are viruses, and other genetic parasites, plasmids and transposons. Plasmids are pieces of DNA that replicate independently of the genome of cells, and transposons are 'jumping genes' - units of DNA that can jump from one site in the genome to another, or jump out into the genome of another organism altogether.\n\n Again: could you explain why this is relevant to symbiote's question?\n \nFinally, the ultimate neo-Darwinian taboo has been broken. Wiesmann's barrier has been breached, and in many different forms, some of which I mentioned already (see box 2).\n\n So now Wiesmann's barrier is the most important thing to the ToE? Somehow I doubt that biologists agree, but obviously creationists have more authority on the topic of evolution...\n \nNow what I'd like you to do is show me how Epigenetics, horizontal gene transfer, non-random mutations and phenotypic plasticity fit under the neo-darwin umbrella. I would a link please to back yourself up just so I don't think you're blowing smoke.\n\n Here's a link. Note that only one of the above is relevant to the synthesis in any way. Also note that you have not shown any truly non-random mutations, and I have only mentioned mutations that occur non-randomly (not the same as non-random mutations).\n You're up next on evidence.\n \n \n Oh, and in case you hadn't noticed, I'm back. :)", 
   {
    "unicode_changes_made": true
   }, 
   252434, 
   null, 
   1172468220.0
  ], 
  [
   252478, 
   null, 
   "supersport", 
   " That isn't completely true. Bacteria have been observed to increase their mutation rate in times of stress. (I don't remember the exact source, but I do know that you provided it.) Put another way, bacteria have been observed to introduce random changes in their DNA when they are presented with a problem.\n Also, while the ToE is not based on the assumption that DNA may change in response to environmental stimuli, it doesn't rule that out, either. \n\n \n Well you seem to be going against what your theory says....here's an overview: (please notice there is no mention of epigenetics, nonrandom mutations, the inheritance of acquired characteristics, adaptive mutations, or horizontal gene transfer -- all of which can bring about new traits/functions.\n \n http://www.biologycorner.com/bio3/notes-chap17.html\n \n How Organisms Evolve\n \n Evolution occurs on populations, not individuals. Individuals do not evolve, but are part of populations which do\n \n Evolution is a genetic change occuring in a population of organisms over many generations \n \n Population Genetics - branch of biology that deals with the frequency, distribution and inheritance of alleles (genes) in a population\n \n A gene pool is the sum of all the genes occuring in a population\n \n  The Mechanisms of Evolution\n \n There are five majore causes of evolutionary change within a population\n \n 1. mutation\n 2. migration\n 3. small population\n 4. nonrandom mating\n 5. natural selectionGenetic Drift - small populations are more effected by random chance \n \n Your theory is OUTDATED!\n \n \n \n \n \n \n A quote from the page:I'm pretty sure I've seen this before. I can already tell that the writer is biased in favor of religion. \n\n \n She is not a creationist and not a Christian. \n \n \n That is an adaptive mutation. There is no evidence that it is directed in any way you would care to use the term.\n The author of the paper is attempting to mislead, and it would be nice if you didn't quote such authors... \n\n \n what's the difference? ToE does not accept an adaptive mutation...which is why they've fought it for all these years.\n \n \n Is that a joke? It isn't the correct use of the term (except possibly when talking about viruses, but that's a stretch)...\n \"Oh no! I've just been infected with the genes of a banana! Now all my children will be plants!\" \n\n \n Don't laugh too hard.\n \n The information is slowly leaking out that genomes are inherently fluid and dynamic. Not only that but their genes do not remain static in the genome once they're in there. They can jump between species that do not interbreed when the conditions are favorable. This happens by way of viruses, plasmids, and genetic parasites that can hop in and out of genomes, repicate themselves and infect other cells. It's much like a virus on a computer. Once computer is exposed a virus can get in and screw things up for good. This is the problem with genetic engineering of crops -- they are artificially putting genes in organisms that do not belong.....these genes are transmitting antibiotic resistance and generating new pathogens. Antibiotic resistance is a result of an overuse of antibiotics in farming. We are starting to see the fruits of this dangerous procedure by way of e-coli showing up in crops. Turns out that antibiotics acts as a powerful stimulant for bacteria, causing it to grow out of control. \n \n you can read more here:\n \n http://www.hinduonnet.com/2001/08/06/stories/05062523.htm\n \n or here:\n \n http://www.mercola.com/2001/aug/25/gm_foods.htm\n \n \n So now Wiesmann's barrier is the most important thing to the ToE? Somehow I doubt that biologists agree, but obviously creationists have more authority on the topic of evolution... \n\n \n Well since you guys say it's not important I guess it's not. However, that's not what the dogma has been for several decades. \n \n \n Also note that you have not shown any truly non-random mutations, \n\n \n Nonrandom mutations:\n \n http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=94481", 
   {}, 
   252455, 
   null, 
   1172474280.0
  ], 
  [
   252588, 
   null, 
   "Hi_Its_Me", 
   "Well you seem to be going against what your theory says....here's an overview: (please notice there is no mention of epigenetics, nonrandom mutations, the inheritance of acquired characteristics, adaptive mutations, or horizontal gene transfer -- all of which can bring about new traits/functions.\n\n I said that while the ToE doesn't assume those things (as shown by the page you quoted), it does not rule them out, either.\n \nhttp://www.biologycorner.com/bio3/notes-chap17.html\n \n How Organisms Evolve\n \n Evolution occurs on populations, not individuals. Individuals do not evolve, but are part of populations which do\n \n Evolution is a genetic change occuring in a population of organisms over many generations \n \n Population Genetics - branch of biology that deals with the frequency, distribution and inheritance of alleles (genes) in a population\n \n A gene pool is the sum of all the genes occuring in a population\n \n  The Mechanisms of Evolution\n \n There are five major causes of evolutionary change within a population\n \n 1. mutation\n 2. migration\n 3. small population\n 4. nonrandom mating\n 5. natural selectionGenetic Drift - small populations are more effected by random chance \n \n Your theory is OUTDATED!\n\n I sense a lack of reading comprehension... Did you read the phrase \"five major causes\"? There are a large number of causes of variation within a population, some of which are only marginally related to the ToE. Also, you can hardly expect every biology book to cover those things at the same time as natural selection. I know from experience that natural selection alone gives some people a hard time...\n \nShe is not a creationist and not a Christian.\n\n Reread this quote:\"Abstract: The debate on evolution between the creationists and the neo-Darwinists is not just sterile, it misses the central issue, which is that neo-Darwinism is wrong and dangerous.\"Who would you say she is siding with?\n It doesn't really matter if she is either creationist or Christian, but religious bias is not necessarily either of those.\n \nwhat's the difference? ToE does not accept an adaptive mutation...which is why they've fought it for all these years.\n\n That doesn't go too well with your next statement, but fortunately they were regarding different topics.\n \nDon't laugh too hard.\n\n An adaptive mutation is the same as a beneficial mutation. Neither of those is the same as a directed mutation.\n It's a little funny that you say that evolution's supporters are the ones criticizing adaptive mutations...\n \nThe information is slowly leaking out that genomes are inherently fluid and dynamic. Not only that but their genes do not remain static in the genome once they're in there. They can jump between species that do not interbreed when the conditions are favorable. This happens by way of viruses, plasmids, and genetic parasites that can hop in and out of genomes, repicate themselves and infect other cells. It's much like a virus on a computer. Once computer is exposed a virus can get in and screw things up for good. This is the problem with genetic engineering of crops -- they are artificially putting genes in organisms that do not belong.....these genes are transmitting antibiotic resistance and generating new pathogens. Antibiotic resistance is a result of an overuse of antibiotics in farming. We are starting to see the fruits of this dangerous procedure by way of e-coli showing up in crops. Turns out that antibiotics acts as a powerful stimulant for bacteria, causing it to grow out of control.\n\n Is this relevant to the discussion? In particular, is it relevant to symbiote's question?\"Find me some scientists who think people are wholly determined by their genes or shut it. Show me how \"environmental influence\" is contrary to materialism or shut it.\"Remember that?\n \nWell since you guys say it's not important I guess it's not. However, that's not what the dogma has been for several decades.\n\n Well, it is relevant, or at least was. It just isn't fundamental to the ToE, and even if Weismann's barrier needs to be revised, that doesn't mean that the ToE is invalid as well.\n \nNonrandom mutations:\n \n http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=94481\n\n In that case, I will provide a description of how those mutations fit under the umbrella of the modern synthesis:\n A Biochemical Mechanism for Nonrandom Mutations and Evolution\n \n \n You might recognize it.", 
   {}, 
   252478, 
   null, 
   1172540460.0
  ], 
  [
   252605, 
   null, 
   "wascallywabbit", 
   "\n It's not \"all we can do\", we can also measure physical attributes of the brain... increasingly so with advances in technology..\n\n \n **\n Measuring physical attributes of the brain, albeit a good and worthwhile endeavor, will never tell us the first thing about intelligence until and unless those measurements are correlated to organismic behaviour.\n \n \n\n When we take these factors into account and get at brain mass rather than raw skull size we get much higher correlations with traditional intelligence measures. And that's still only part of the picture, we haven't yet looked at the relative proportions of different parts of the brain and degree of myelinisation for example...\n \n So its not \"nothing more\" than measuring skull size, its a \"lot more\", and a \"lot more reliable a predictor of performance\".\n\n \n \n **\n Well, there certainly should be a strong positive correlation between the physical characteristics of a brain and the kind and degree of intelligence of the creature possessing that brain or one of the very same kind from the same kind of organism. And it would be amazingly simple to test that correlation. You simply have people volunteer to donate their brains upon death, and then challenge brain researchers, operating blind, to establish their IQ scores from the physical features of their individual brains. Then go to the scores they made during their lifetimes, and compare results.\n \n \n\n Quote:\n That's all very well at showing where and how the brain operates mechanically, as a tool, but it still does not tell us anything about what it is that wields that tool. \n \n \n You're making the assumption that the brain requires a \"user\" when the reality could easily be that it contains the functionality to operate without one. When a tree grows, who is \"using\" it?\n\n \n [quote]\n Does the heart \"contain[] the functionality to operate without [a body entire]\"? No, it does not, and neither does a brain. Brains are parts of whole biosystems, they are not autonomous organisms in their own right. As such, like all organs, they are 'used' by the whole. The 'whole' it serves, however, is not the sum or mass of its material parts, but that which is expressed through the interactions of those material parts, i,e., life itself. This starts at the cell and goes on up from there.\n \n As to what any autonomous organism serves, (such as a tree), basically it serves itself, 'as a whole biosystem', in order to survive, thrive and reproduce. But the question raises a greater perspective--every organism also serves the ecosystem of which it forms a part, and that ecosystem serves the biosphere of which it forms a part. What the biosphere serves will depend upon what it is found to be a part of, itself, and I would suggest to you that is much more than bits of stuff flying about in space, aimlessly banging into one another.\n \n \n\n When a stream flows, who is making it?\n\n \n **\n What do passive chemicals like water have to do with how dynamic biosystems operate. Do you find yourself perpetually flowing downhill?\n \n \n\n To the brain, thought is just as natural, it doesn't require positive direction to do it, and it makes no sense to demand an operator, who presumably also requires an operator, in some kind of infinite operator chain.\n\n \n **\n This is just the old, 'it just happens, that's all', version of spontaneous generation. The fact is, though materialists deny it, it that everything productive has a function, and every function serves a purpose, and every purpose is seated in that which it serves. The only way out for materialists is to arbitrarily postulate, metaphysically, that teleology is an illusion, that goals and purposes do not exist, and that existence is essentially pointless, purposeless, and absurd.\n \n \n\n If we have full knowledge of a system we can predict all of its consequences, yes. \n\n \n **\n Actually, in many cases, and contrary to materialist/mechanist metaphysics, that's just not the case. Materialism/mechanism holds that with full knowledge of the physical mechanics of any causal process, perfect prediction of its outcomes/effects is unavoidable, simply because the universe is 100% determined mechanically, in strict linear fashion. Like so many materialist postulates, this one just doesn't stand up to empirical scrutiny. To account for the discrepancy, latter-day materialist have dreamt up a new way to say 'spontaneous generation'--they now say 'emergent properties', instead.\n \n \n \n\n Quote:\n You have here linked 'intelligence' to the concept of 'success'; something with which I agree heartily, but which a materialist/mechanist must discard along with all other values. For a materialist/mechanist values entail teleology, (as indeed, they do), where teleology is antithetical materialism/mechanism. As in the view that evolution is non-directional and undirected, save by mechanical forces that are themselves ateleological, and whose own origins are held to be ateleological. \n \n \n This is a caricature of materialism that presents a sort of strawman version to knock down. I am a materialist, and for me values do not entail teleology, so your claim \"for a materialist, values entail teleology\" is false.\n\n \n **\n So you, unlike the rest of us, have values, but those values in no way determine your goals, or in any way direct and constrain your behaviour in the pursuit of those goals? The fact is that all live organisms have some sense of 'values', even if it is only to value their life over death, or well-being over hunger, injury, and illness. Only inanimate bits of stuff have no values. \n All live organisms, including you, operate teleologically, even if your metaphysic says that you don't.\n \n \n\n A creature can have \"values\" in the form of physical properties in their brain, and these physical properties of their brain can influence their future action - this isn't \"teleology\" at all.\n\n \n **\n If you think that a brain tumour is a \"value\", then you have a very peculiar understanding of the word, 'value'.\n \n \n\n Quote:\n Not so. My intelligence would be diminished by my inability to reject coke as a choice. Moreover, the cause for my yen for coke would be apart from any analysis I might make of it, making my behaviour less conscious, (as I have defined it, above), then it would have been had I been conscious of what you'd done. \n \n \n Likewise you could dream of coke and wake up, unremembering your dream and desiring coke.... or have a stroke and have the same thing happen, the distinction between another person intervening and it happening by accident make no difference.\n\n \n **\n It is the compulsion, the lack of choice, that makes all the difference in whether a behaviour is voluntary or not, and to the degree in which it is or is not voluntary, and that degree of volition is part and parcel of the actual topic of this thread, intelligence, and the degree to which a behaviour is intelligent, or mechanical, or random.\n \n \n\n Well this involves the free will / determinism debate, you say you aren't free if your preferences are implanted... I say you are free when you act in accordance with your preferences, regardless of how those preferences were arrived at. I think to claim you need to \"choose\" your preferences is absurd, as the act of choosing requires prior preferences, which presumably also required a choice.... and the question of how we acquired our first preference arises...\n\n \n **\n It certainly does, but that changes nothing. What's your point?\n \n \n\n Quote:\n Granted that much organismic behaviour has become automatized over time, it was still intelligently generated in its origins. That is, at some time in the past their forebears did choose to act that way. \n \n \n You're claiming the ancestors of trees \"chose\" to grow seeds and only now in later generations the process of reproduction is automised?\n\n \n **\n I'm saying that some early proto-plants 'chose' a system of reproduction that through repeated 'choices' over generations resulted in seed trees. You belive that pro-plants were just passive bits of stuff flung together by chance, and that, willy-nilly, over generations and constant battering by chance accidents, some of them just happened to end up as seed-bearing trees.\n \n \n\n Quote:\n You are confusing consciousness and knowledge with goals and drives. Why would a living, sentient biosystem need to 'know' about death if its inherent goal is to survive, thrive, and reproduce in some fashion? \n \n \n If an organism doesn't KNOW that starvation causes death, why would it choose to eat to survive? Why wouldn't it simply stab itself with scissors instead? A \"desire to live\" is meaningless without knowledge of the causes of life and death, knowledge I think we can safely say we are not born with.\n\n \n **\n True we are born without knowledge death, but we are born with knowledge of our own lives and well-being, and the fact that we possess inherent drives to survive, thrive, and possibly replicate,-- drives that are at the same time powerfully dynamic, but still not mechanical and insurmountable,-- is a great problem for materialism, although not so much for the rest of us. \n \n \n\n Quote:\n But you might ask yourself where goals, drives, motives, and values come from, since, to the best of my knowledge, bits of stuff in motion possess none of these things. \n \n \n They most certainly do.\n\n \n **\n If you truly belive this, then we are never going to understand one another.", 
   {}, 
   252588, 
   null, 
   1172551260.0
  ], 
  [
   252617, 
   null, 
   "Symbiote", 
   "Well, there certainly should be a strong positive correlation between the physical characteristics of a brain and the kind and degree of intelligence of the creature possessing that brain or one of the very same kind from the same kind of organism. And it would be amazingly simple to test that correlation. You simply have people volunteer to donate their brains upon death, and then challenge brain researchers, operating blind, to establish their IQ scores from the physical features of their individual brains. Then go to the scores they made during their lifetimes, and compare results.\n\n \n This research HAS been done and strong positive correlations HAVE been found.. its not as \"amazingly simple\" as you say because the brain of an elderly man who had alzheimers and lost a bunch of brain tissue in his later years isn't going to match well with IQ tests he did when he was 30, and because brain tissue decays quite quickly after death, but when these factors are controlled for the correlations are remarkably strong.\n \n \nDoes the heart \"contain[] the functionality to operate without [a body entire]\"? No, it does not, and neither does a brain. Brains are parts of whole biosystems, they are not autonomous organisms in their own right. As such, like all organs, they are 'used' by the whole. \n\n \n I'm not saying the brain doesn't require external inputs (eg oxygen), I'm saying it doesn't require a controller, and neither does the heart. Its operation is based on the physical properties of itself and of its adjoining biological systems, there need be no supernatural homonculus telling it what to do.\n \n \nWhat do passive chemicals like water have to do with how dynamic biosystems operate. Do you find yourself perpetually flowing downhill?\n\n \n The brain is composed of \"passive chemicals\", if the term has any meaning. The components of the brain don't have minds of their own, they interact according to the laws of physics. Brain in the blood would \"flow down hill\" if it were not for pressure from the pumps in the heart pushing it around. Electrical currents in the brain flow in the same way that any other electrical current flows.\n \n You will find NOTHING in the brain which does not follow the same laws of physics as everything else in this universe.\n \n \nMaterialism/mechanism holds that with full knowledge of the physical mechanics of any causal process, perfect prediction of its outcomes/effects is unavoidable\n\n \n No it doesn't, once again you are presenting a strawman or caricature, I don't know where you are getting this information but it is incorrect.\n \n \n\n So you, unlike the rest of us, have values\n\n \n No, we all have values... I never said you or anyone else didn't.\n \n \n, but those values in no way determine your goals, or in any way direct and constrain your behaviour in the pursuit of those goals?\n\n \n Those values do determine my goals.. just as your values determine your goals.... I never said they didn't.\n \n \n \nThe fact is that all live organisms have some sense of 'values'\n\n \n This claim is baseless and counterintuitive, particularly with regard to extremely basic live organisms, and non-animals in general.\n \n \n \nAll live organisms, including you, operate teleologically, even if your metaphysic says that you don't.\n\n \n Teleology and operating according to values are different things, this is an important distinction.\n \n \nIf you think that a brain tumour is a \"value\", then you have a very peculiar understanding of the word, 'value'.\n\n \n I never said a brain tumour was a value. That the brain contains values does not imply that everything in the brain is a value.\n \n \nIt is the compulsion, the lack of choice, that makes all the difference in whether a behaviour is voluntary or not\n\n \n So is it the lack of choice about a behaviour or lack of choice about a preference that determines whether an action is free or not?\n \n \n\n It certainly does, but that changes nothing. What's your point?\n\n \n You have previously claimed that in order to possess free will, someone's preferences themselves must be chosen... but preferences must be chosen, if at all, on the basis of prior preferences... so what you are terming \"free will\" is meaningless because at some point their preferences must have been unchosen. In other words, your definition of free will is deeply flawed.\n \n \nI'm saying that some early proto-plants 'chose' a system of reproduction that through repeated 'choices' over generations resulted in seed trees.\n\n \n This claim is both bizarre and baseless, and I don't know why you put the word chose in inverted commas. Either they chose (no matter how stupid it sounds) or they didn't. (here's a hint, trees, and proto-trees, don't choose)", 
   {}, 
   252605, 
   null, 
   1172560920.0
  ], 
  [
   252659, 
   null, 
   "SLP", 
   "\n Granted that much organismic behaviour has become automatized over time, it was still intelligently generated in its origins. That is, at some time in the past their forebears did choose to act that way. ___\n\n \n And surely you can present some supportive evidence for this bald asssertion?\n \n Or do you really expect anyone to simply accept such claims at face value without question?\n \n emoticon_xdonno", 
   {}, 
   252406, 
   null, 
   1172602140.0
  ], 
  [
   252661, 
   null, 
   "SLP", 
   "\n This claim is both bizarre and baseless, and I don't know why you put the word chose in inverted commas. Either they chose (no matter how stupid it sounds) or they didn't. (here's a hint, trees, and proto-trees, don't choose)\n\n \n Well, Symbiote, how does it feel to bear the brunt of WWs arrogance, condescension, and wrath?\n \n Soon, he will complain about how mean you are and start ignoring you.\n \n That is his M.O. - one or two post as a 'nice guy', then the fangs come out when he realizes that you don't buy his garbage...", 
   {}, 
   252617, 
   null, 
   1172602380.0
  ], 
  [
   252693, 
   null, 
   "wascallywabbit", 
   "[quote][QUOTE=Symbiote;252617]This research HAS been done and strong positive correlations HAVE been found.. its not as \"amazingly simple\" as you say because the brain of an elderly man who had alzheimers and lost a bunch of brain tissue in his later years isn't going to match well with IQ tests he did when he was 30, and because brain tissue decays quite quickly after death, but when these factors are controlled for the correlations are remarkably strong.\n \n **\n That's interesting. Got any details? Links would be best.\n \n \n \n\n I'm not saying the brain doesn't require external inputs (eg oxygen), I'm saying it doesn't require a controller, and neither does the heart. Its operation is based on the physical properties of itself and of its adjoining biological systems, there need be no supernatural homonculus telling it what to do.\n\n \n **\n Well, now you are turning snide and sarcastic. I have never suggested anything resembling a \"supernatural homonculus\"(sic) as the central control mechanism in complex biosystems. But your insistence that each and every part of such systems acts soley according to the dictates of its own physical properties, or in conjunction with the dictates of the physical properties of adjoining parts, really astonishes me. That's like saying automobiles drive themselves, independent of any controlling driver/designer/builder, in accordance with the physical properties of their parts, taken singly or in conjunction with one another. Quite an amazing view, not only of live organisms, but of machinery, come to that. Complex systems cannot, and I do mean cannot, operate productively without some kind of centralized 'control of operations'. Even airplanes on autopilot must subordinate the behaviours of their parts to the dictates of the autopilot, if the plane is to stay safely in the air.\n \n The trick with living complex, self-organizing, self-adapting, self-directing, self-serving biosystems lays in identifying the autopilot in charge. And unless you make qualitative distinctions between life wrt plants, contrasted to life wrt microbes, contrasted to life wrt animals, the autopilot in charge of life forms does not require or entail a very special part called a 'brain' . \n \n \n\n The brain is composed of \"passive chemicals\", if the term has any meaning. The components of the brain don't have minds of their own, they interact according to the laws of physics. Brain in the blood would \"flow down hill\" if it were not for pressure from the pumps in the heart pushing it around. Electrical currents in the brain flow in the same way that any other electrical current flows.\n \n You will find NOTHING in the brain which does not follow the same laws of physics as everything else in this universe.\n\n \n **\n I never said that any physical entity, be it animate or inanimate, was above and independent of any physical laws and constants, from gravity to entropy.\n I have no idea where you got that impression. What I have been assertinbg here, is that the laws, etc., of physics are necessary to any understanding oh physical entities, but that they are insufficient to the understanding of self-serving, self-controlled biosystems. That is to say, something more than 'brain matter mass' and the phiscs of interconnected physical parts is necessary to an understanding of intelligence and all psychical properties evinced by live organisms. You claim that nothing else is necessary; that physics alone explains life and its properties. Other materialists do this by appealing to the magic of spontaneous generation, cloaked and disguised by the meaningless label, 'emergence' or 'emergent properties'.\n \n \n\n No it doesn't, once again you are presenting a strawman or caricature, I don't know where you are getting this information but it is incorrect.\n\n \n **\n Well, I don't know where you get your information, but it is an explicit principle in materialism/mechanism that randomness and chance are only illusions caused by ignorance of actual causes, because all events are mechanically determined from cause to effect to cause to effect, in a perfectly linear fashion, from the Big Bang to your choice of entree. That means that they hold that perfect knowledge is theoretically attainable, and being obtained, would eliminate both chance and choice as actual realities.\n \n They have maintained this metaphysical postulate for millenia, and despite the apparent revelation from quantum mechanics that reality is not, in fact, 100% mechanically pre-determined, many still insist upon it.\n \n \n\n No, we all have values... I never said you or anyone else didn't.\n\n \n **\n And I never said that you, I, or any other living thing, didn't. To the contrary, I asserted that values are intrinsic to being alive.\n \n \n\n Those values do determine my goals.. just as your values determine your goals.... I never said they didn't.\n\n \n **\n You said, \"A creature can have \"values\" in the form of physical properties in their brain, and these physical properties of their brain can influence their future action - this isn't \"teleology\" at all.\" In short, you committed the fallacy of concretizing an abstraction, by asserting that someone's appetites and desires and values, (say for a glass or white wine but not red), which determine their goals, (to consume some of it), and thus generate all of the behaviours necessary to that goal, are in reality only a mechanical compulsion to act generated by some vague, undiscovered and undescribed, but entirely corporeal, bit of brain matter, that you call a \"value\".\n \n I'll stick to what the English language calls a \"value\" . From answers.com, value--\"A measure of those qualities that determine merit, desirability, usefulness, or importance.\" A measure or assessment or evaluation of conitions which can be either negatively or positively derived [i], but only by an evaluator capable of discrimination and self-determination\". A train cannot be said to 'value' one track over another simply because a mechanical switch determines that that is the way it must go. Neither can brain matter pick and choose its own track.\n \n \n\n This claim is baseless and counterintuitive, particularly with regard to extremely basic live organisms, and non-animals in general.\n\n \n **\n What you mean is that it is not materialist and mechanical. And again, unless you want to raise a false dichotomy (wrt to non-physical phenomena) between 'organisms that have brains' and 'organisms that don't have brains', then what applies to one organism must, to some variable degree, generally and universally apply to all. \n \n \n\n Teleology and operating according to values are different things, this is an important distinction.\n\n \n **\n Oh, really?!? My understanding of the word 'teleology', (answers.com), is this---\"The use of ultimate purpose or design as a means of explaining phenomena.\" [design meaning intention]. That is, ultimate goals as 'final' causes, and goals determined by values. Values assess possible outcomes/results, and so generate selected goals, and those goals determine behaviour. Outcome as the source of motivation, and motive as the cause of action. But only in live organisms. Materialists arbitrarily dismiss the reality of values and goals, i.e., teleology in the behaviour of organisms just as they dismiss it in the behaviour of 'bits of stuff'. That because, according to their metaphysic, there is no real difference between a bird and dust in the wind.\n \n [quote]\n I never said a brain tumour was a value. That the brain contains values does not imply that everything in the brain is a value.\n \n \n\n So is it the lack of choice about a behaviour or lack of choice about a preference that determines whether an action is free or not?\n\n \n **\n It's about choice vs lack of choice, pure and simple, in any regard and at any stage. Your dichotomy is false. Available and perceived choice determines whether an action is free or compelled, and it is the degree to which there is some measure of choice that determines the degree of freedom.\n \n \n\n You have previously claimed that in order to possess free will, someone's preferences themselves must be chosen... but preferences must be chosen, if at all, on the basis of prior preferences... so what you are terming \"free will\" is meaningless because at some point their preferences must have been unchosen. In other words, your definition of free will is deeply flawed.\n\n \n **\n Well, begging your pardon, but from where I sit it is your reasoning that is deeply flawed. It is totally 'non sequitur'. It simply does not follow, logically, that \"preferences\", i.e., values, mechanically determine behaviour. And if the original values, i.e., it is better to be alive than dead, satisfied rather than in want, reproduced rather than not, are an intrinsic and inherent part of being a live organism, from first to last, then that is a part of what it means to be alive, that's all. As far as free will is concerned, is the values of life, and the goals they generate, were compulsory and irresistable, then your mechanist view that they obviate 'free will', i.e., 'choice', would be true. \n But obviously, in empirical terms, they are not compulsory and irrestible, even at the most basic cellular level, where we find apoptosis, for instance, all the way to animals that appear to choose to die of nothing more physical than a broken heart, or even to commit deliberate suicide. Never mind that some creatures can and do decide to go hungry, or to refrain from reproducing, or whatever. So the values that come with being alive can be overridden, and are, enabling choice; that is, enabling freedom and making it very meaningful indeed..\n \n \n \n\n This claim is both bizarre and baseless, and I don't know why you put the word chose in inverted commas. Either they chose (no matter how stupid it sounds) or they didn't. (here's a hint, trees, and proto-trees, don't choose)\n\n \n **\n I put the word 'chose' in inverted commas to signify that, in contrast to what you aparently believe, 'choice' is not always a matter of conscious, analytical thought and deliberation. That is just being anthropocentric on your part, and even human beings make the vast majority of their choices subconsciously, without being aware of so doing. And so it is for most non-human organisms, including trees. So the word 'choose' and its cognates apply to all life forms, unless you can show some non-arbitrary distinction, as mentioned above, between the lives of animals, plants, and microbes. Just making a snide and arrogant proclamation, \"here's a hint, trees, and proto-trees, don't choose\", doesn't cut any ice with rational people.", 
   {}, 
   252617, 
   null, 
   1172610840.0
  ], 
  [
   252729, 
   null, 
   "Symbiote", 
   "I have never suggested anything resembling a \"supernatural homonculus\"(sic) as the central control mechanism in complex biosystems. But your insistence that each and every part of such systems acts soley according to the dictates of its own physical properties, or in conjunction with the dictates of the physical properties of adjoining parts, really astonishes me.\n\n \n So you aren't suggesting a \"supernatural homonculus\" is operating the brain, but you are suggesting the brain has a \"non-physical (supernatural) central controller (homonculus)... got you.\n \n \nComplex systems cannot, and I do mean cannot, operate productively without some kind of centralized 'control of operations'. Even airplanes on autopilot must subordinate the behaviours of their parts to the dictates of the autopilot, if the plane is to stay safely in the air.\n\n \n Its called the brain, or if you want to be really pedantic, you can include the spine in that \"centralised control of operations\" too. Asserting that the control mechanism itself requires a controller is sheer stupidity... given that you agree something so primitive as an autopilot can function alone, why do you believe the vastly more advanced human \"control system\" requires a non-physical mind to work?\n \n \nAnd unless you make qualitative distinctions between life wrt plants, contrasted to life wrt microbes, contrasted to life wrt animals, the autopilot in charge of life forms does not require or entail a very special part called a 'brain' .\n\n \n There clearly are qualitative differences between animals and algae and plants. Your assertion now that there is a single 'autopilot' in charge of all life forms is baseless. And while aircraft and people require central control systems, extremely simple organisms do not. And not all \"central control systems\" involve values.... as you well know from your example of the autopilot system.\n \n \nI never said that any physical entity, be it animate or inanimate, was above and independent of any physical laws and constants, from gravity to entropy.\n I have no idea where you got that impression. What I have been assertinbg here, is that the laws, etc., of physics are necessary to any understanding oh physical entities, but that they are insufficient to the understanding of self-serving, self-controlled biosystems. \n\n \n You can't have it both ways. Either the human body operates according to the laws of physics, or it does things which are physically impossible, make up your mind.\n \n \n\n Well, I don't know where you get your information, but it is an explicit principle in materialism/mechanism that randomness and chance are only illusions caused by ignorance of actual causes, because all events are mechanically determined from cause to effect to cause to effect, in a perfectly linear fashion, from the Big Bang to your choice of entree.\n\n \n 1) You're conflating mechanism with materialism. This is not a feature of materialism, although many materialists in the past also believed this.\n \n 2) Even those who call themselves mechanists today largely don't believe this.\n \n 3) This is the equivalent of claiming \"it is an explicit principle of christianity that the earth is flat\"\n \n You are aiming to set up a strawman of materialism which is contrary to what the vast majority of materialists believe to knock down.\n \n \nSo you, unlike the rest of us, have values\n\n \n \nAnd I never said that you, I, or any other living thing, didn't (have values). To the contrary, I asserted that values are intrinsic to being alive.\n\n \n what?\n \n \nIn short, you committed the fallacy of concretizing an abstraction, by asserting that someone's appetites and desires and values, (say for a glass or white wine but not red), which determine their goals, (to consume some of it), and thus generate all of the behaviours necessary to that goal, are in reality only a mechanical compulsion to act generated by some vague, undiscovered and undescribed, but entirely corporeal, bit of brain matter, that you call a \"value\".\n\n \n Values aren't an \"abstraction\", they are a real physical phenomena, and I don't need to \"concretize\" them, their existence is already concrete.\n \n You yourself admit they have physical form when you make the distinction between \"natural\" and \"unnatural\" values created, for example in machines (presumably by physical means, unless the builders of robots are channeling some kind of transdimensional hive-mind to imbue their creations with power), and science can quite easily manipulate values in creatures by purely physical means.\n \n http://www.infosatellite.com/news/2002/05/p030502robot_rats.html\n \n \nMaterialists arbitrarily dismiss the reality of values and goals\n\n \n Strawman. I'm a materialist, I don't dismiss the reality of values and goals. Neither do many other materialists.\n \n \n**\n Oh, really?!? My understanding of the word 'teleology', (answers.com), is this---\"The use of ultimate purpose or design as a means of explaining phenomena.\" [design meaning intention]. That is, ultimate goals as 'final' causes, and goals determined by values.\n\n \n If being determined at least in part by your historic values means teleology, then materialists have no reason to reject teleology. But this isn't what teleology means.\n \n http://en.wikipedia.org/wiki/Teleology might be a good place for you to read up on it.\n \n Why did the river flow downhill?\n The teleologist answers - To reach the sea.\n The materialist answers - Because of gravity.\n \n Why did the man reach out with his hand?\n The teleologist answers - To get the apple.\n The materialist answers - Because he held the historic value of eating.\n \n \nIt simply does not follow, logically, that \"preferences\", i.e., values, mechanically determine behaviour. \n\n \n Ok, so if your preferences don't determine your behaviour, then you are being controlled by something else, so you aren't free.\n \n \nAnd if the original values, i.e., it is better to be alive than dead, satisfied rather than in want, reproduced rather than not, are an intrinsic and inherent part of being a live organism, from first to last, then that is a part of what it means to be alive, that's all.\n\n \n \nIt's about choice vs lack of choice, pure and simple, in any regard and at any stage. \n\n \n So to be alive means to be unfree, got you.\n \n \nAs far as free will is concerned, is the values of life, and the goals they generate, were compulsory and irresistable, then your mechanist view that they obviate 'free will', i.e., 'choice', would be true.\n\n \n Strawman, I am a firm believer in free will and choice.\n \n \nI put the word 'chose' in inverted commas to signify that, in contrast to what you aparently believe, 'choice' is not always a matter of conscious, analytical thought and deliberation. That is just being anthropocentric on your part, and even human beings make the vast majority of their choices subconsciously, without being aware of so doing.\n\n \n So proto-trees decided whether to produce feti, seeds or spores not only on the basis of a choice, but on the basis of a choice they were not aware of, and this is supposed to make it more plausible?\n \n \n \n \n To sum up:\n You attribute views to materialists in general, and me personally, which we do not hold. Your argument is based around a caricature of materialism that\n a) Rejects free will\n b) Rejects the possibility of randomness in the universe\n c) Rejects the existence of values and goals (because you do not understand what teleology is)\n \n You baselessly claim that\n a) There do not exist qualitative differences between algae and humans. \n b) But the distinction between non-living and living is important and real.\n c) There is a autopilot in charge of life forms. (Some kind of god?)\n d) A plane's autopilot does not require someone to operate it. But the human brain does (why?).\n e) Even though people are governed completely by the laws of physics, their behaviour could not possibly ever be predicted.\n f) If you get a brain tumour and it causes you to like eating peaches, you are unfree. But if you are born with a brain structure that causes you to like eating peaches, you are free.", 
   {}, 
   252693, 
   null, 
   1172625180.0
  ], 
  [
   252765, 
   null, 
   "wascallywabbit", 
   "**\n well, symbiote, going by your stated opinions, we are from two separate and distinct realities, and there is no chance whatever that we can ever truly communicate with one another.", 
   {}, 
   252729, 
   null, 
   1172641920.0
  ], 
  [
   252796, 
   null, 
   "supersport", 
   "Hey WW....does how does Horizontal Gene transfer work into EAM....or does it? I've been reading alot about it. Many of the Gaia people think this may explain much of evolution. It turns out that genes can jump from one creature to another by way of viruses, sexual encounters, soil etc. A big can of worms seems to be opening.", 
   {}, 
   252765, 
   null, 
   1172649060.0
  ], 
  [
   252831, 
   null, 
   "wascallywabbit", 
   "Hey WW....does how does Horizontal Gene transfer work into EAM....or does it? I've been reading alot about it. Many of the Gaia people think this may explain much of evolution. It turns out that genes can jump from one creature to another by way of viruses, sexual encounters, soil etc. A big can of worms seems to be opening.\n\n \n **\n \n I don't know yet, because I haven't found the required info needed to make a judgement. With your wonderful link-finding abilities, you might be able to help me out. The issue is basically this--if organisms must pasively accept, or mechanically reject, incoming, horizontally transferred genes, and have no ability to accept or reject whatever presents itself to them, then I would have to say that there is no EAM in HGT. If, OTH, and as I suspect, organisms do have the ability to accept or reject, (and better yet, generate), the transfer of genes to and from one another, as in a form of teleological information-sharing, then it become 100% EAM. If you could find a link that resolves this question it would great.", 
   {}, 
   252796, 
   null, 
   1172685540.0
  ], 
  [
   252832, 
   null, 
   "SLP", 
   "Hey WW....does how does Horizontal Gene transfer work into EAM....or does it? I've been reading alot about it. Many of the Gaia people think this may explain much of evolution. It turns out that genes can jump from one creature to another by way of viruses, sexual encounters, soil etc. A big can of worms seems to be opening.\n\n \n A great example of SS ignoring information provided to him.\n \n The impact of HGT on higher eukaryotes has been explained to you before. Your embellishment of its impact has been refuted.\n \n Now, hyere you are a week or so later, posting as if those exchanges never took place.\n \n Jesus must be so proud...", 
   {}, 
   252796, 
   null, 
   1172685720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Intelligence considered.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9600-intelligence-considered.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9600, 
  "discussion_files": [
   [
    "7261.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9600-intelligence-considered-print.html"
   ], 
   [
    "7262.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9600-intelligence-considered-2-print.html"
   ]
  ], 
  "identifier": 9600
 }
]