[
 [
  [
   252467, 
   null, 
   "obvious_child", 
   "How useful, if at all, is Divinic Support for a Secular argument? \n \n What makes one religion's divinic support more valid then anothers? \n \n No one can prove nor disprove the existance of such beings, therefore it would seem foolish to rely upon them as reasons a secular argument is true or false. One does not rely upon untested materials for a house, why would they rely upon untested much less unaccepted materials for a argument? \n \n For the laymen in the thread, \n \n Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\n \n Neither can prove their Gods exist much less their religion is correct. Can either of them rely sanely upon divinic support?", 
   {
    "post_info": {
     "post_title": "Divinic Support for Secular Arguments"
    }
   }, 
   null, 
   null, 
   1172469960.0
  ], 
  [
   252488, 
   null, 
   "johnhanks", 
   "How useful, if at all, is Divinic Support for a Secular argument?\n\n In the sociobiological view, this has been one of religion's prime cultural functions since its earliest origins. As the OT shows us, there is no limit to the atrocity you can justify on the grounds that it's god's will.\n \nWhat makes one religion's divinic support more valid then anothers? \n\n The fact that it's Our religion's divinic support, and Ours is self-evidently the One True Religion while Theirs is ignorant superstition and idolatry.", 
   {}, 
   252467, 
   null, 
   1172478720.0
  ], 
  [
   252491, 
   null, 
   "obvious_child", 
   "While I apperciate your sarcasm, you seem rather bitter. \n \n I'm hoping that someone who regularly relies upon faith based arguments in secular debates can provide some reason, hopefully intelligently, as to why such support is valid or meritful.\n \n IMO, arguing that since Allah in the Koran said ____, that therefore C is wrong is just as viable as saying that magical space Pandas who farted the universe into existance and reveal the truth through the magical language of Pandanese say _____, that therefore C is correct. Now, every religious person I've used the Panda argument on tends to give me a funny look that indicates they think I'm more then a little crazy, but you get my point here.", 
   {}, 
   252488, 
   null, 
   1172479860.0
  ], 
  [
   252595, 
   null, 
   "electrolyte", 
   "Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\n\n Unless subject C speaks to the absurdity that arises when relying upon \"Divinic Support,\" said \"support\" is meaningless.\n \n For example, if my god says that Divinic Support is not by necessity an indicator of truth, and your god says that Divinic Support is by necessity an indicator of truth...\n You realize, of course, that I won't give a damn what your god thinks, and you won't give a damn what my god thinks, so the conclusion that rational people come to won't necessarily be shared by believers...", 
   {}, 
   252467, 
   null, 
   1172544660.0
  ], 
  [
   252609, 
   null, 
   "obvious_child", 
   "Does it bother you two that no one who actually uses these kind of arguments has the guts to post? \n \n Doesn't that suggest that the basic line of reasoning is faulty?", 
   {}, 
   252595, 
   null, 
   1172555700.0
  ], 
  [
   252613, 
   null, 
   "electrolyte", 
   "Does it bother you two that no one who actually uses these kind of arguments has the guts to post? \n \n Doesn't that suggest that the basic line of reasoning is faulty?\n\n Well, to play on your characterization, it could just mean that those people are gutless. Why not cut past the representation (or lack thereof) and just go by my reductio ad absurdum?", 
   {}, 
   252609, 
   null, 
   1172557260.0
  ], 
  [
   252615, 
   null, 
   "obvious_child", 
   "Well if they thought that what they used was actually viable, they'd defend it no? We see this all the time in the evolution thread. We see this all the time with abortion. We see this with virtually kind of belief. So why can't I apply that to the form of logic people use? \n \n People run away when their arguments are refuted. I just see this as a simple extension of that.", 
   {}, 
   252613, 
   null, 
   1172559600.0
  ], 
  [
   252622, 
   null, 
   "electrolyte", 
   "Well if they thought that what they used was actually viable, they'd defend it no?\n\n To be frank, these are the same people whose \"logic\" is beyond any explanation. We shouldn't be surprised if they see no problem with running away. I do, however, have no qualms about giving them hell for it.", 
   {}, 
   252615, 
   null, 
   1172562000.0
  ], 
  [
   252628, 
   null, 
   "obvious_child", 
   "To be frank, these are the same people whose \"logic\" is beyond any explanation. We shouldn't be surprised if they see no problem with running away. I do, however, have no qualms about giving them hell for it.\n\n \n You gotta wonder. I have a habit of making these threads which point out specific flaws in their reasoning. Why it is that they specifically avoid these threads like they're afraid if they open it they'll catch some kind of horrible disease? \n \n If someone can't even examine how they produce arguments, how can they even accept their beliefs? The idea of the whole man from monkey joke comes up. Perhaps some of us at least are monkeys when it comes to thinking.", 
   {}, 
   252622, 
   null, 
   1172571300.0
  ], 
  [
   252647, 
   null, 
   "jyoshu", 
   "Does it bother you two that no one who actually uses these kind of arguments has the guts to post? \n \n Doesn't that suggest that the basic line of reasoning is faulty?\n\n \n Considering you're already jumping to conclusions, you're starting to sound like you were just baiting. Did you already have your mind made up or are you really open about this? Knowing this is probably just a baiting thread, I'll take my chances and weigh in.\n \n But first, I'd like you to define exactly what you mean by \"divinic support\". That's a bit vague.", 
   {}, 
   252609, 
   null, 
   1172595240.0
  ], 
  [
   252668, 
   null, 
   "obvious_child", 
   "But first, I'd like you to define exactly what you mean by \"divinic support\". That's a bit vague.\n\n \n See example A.\n \n \"Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\"\n \n Neither can prove their God exists nor religion is true and the subject is secular. \n \n Can their basis of logic be taken sanely?\n \n It the thread is baiting because no one who uses that kind of logic (ez) is willing to argue its merits within a thread nor are they willing to even respond to how it fails within a thread. Forcing into its own thread more or less does two things: forces them to post or shows that they won't post for a damn good reason.", 
   {}, 
   252647, 
   null, 
   1172603400.0
  ], 
  [
   252692, 
   null, 
   "jyoshu", 
   "See example A.\n \n \"Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\"\n \n Neither can prove their God exists nor religion is true and the subject is secular. \n \n Can their basis of logic be taken sanely?\n \n It the thread is baiting because no one who uses that kind of logic (ez) is willing to argue its merits within a thread nor are they willing to even respond to how it fails within a thread. Forcing into its own thread more or less does two things: forces them to post or shows that they won't post for a damn good reason.\n\n \n To prove \"secular\" issues ...\n \n I think your question to show how divinic support is logical is a little disingenuous because I'm not sure anyone is claiming that they are operating from purely logic. Sometimes people take stands on an issue based on their conscience, such as the abortion issue. They do so because they believe killing something that will soon be born, be a child, an adolescent, and an adult is wrong. It's the same reason they oppose killing an adult. Most pro-lifers make exceptions for rape and so certainly both sides would agree logic is being employed in that case.\n \n In the area of, say, evolution, I would be more inclined to agree with you here. I think THAT is a matter that truly falls under the realm of the measurable to begin with, and therefore is a scientific issue (unlike the existence of God which is outside the realm of the provable/disprovable to begin with).\n \n To prove the existence of God (which you also mention) ...\n \n I think the problem there isn't so much that God can't be proven logically as that the issue of God is not a logical matter to begin with. There are some things that don't fall under that paradigm--things that are abstract and metaphysical in meaning. Examples would be \"love\" or \"forgiveness.\" Or even \"evil\". These are all things that can't really be defined logically--they lie in the eye of the beholder. I think \"God\" falls under that category. Asking religious people to prove God logically is a bit like asking someone to scientifically prove that there is something tangible called 'love'. Or something tangible called 'malice'. If someone tells you they have malice, you just have to take them at their word. There is no real way to measure that sort of thing and logically prove it--there is no Love-O-Meter\u0099 to hook people up to and see measurable results. It's in the realm of the abstract. The issue of whether there is a God does not belong in the same paradigm as, say, whether or not someone is type O+ bloodtype, which is determinable to begin with.\n \n So, bottom line ... it's not in the realm of the provable/disprovable in the first place. With that in mind, I find it somewhat disingenuous that some \"skeptics\" expect people to operate ONLY under the skeptics' paradigm of what is provable/disprovable to begin with.", 
   {}, 
   252668, 
   null, 
   1172610540.0
  ], 
  [
   252694, 
   null, 
   "Jo Bennett", 
   "Sometimes people take stands on an issue based on their conscience, such as the abortion issue. They do so because they believe killing something that will soon be born, be a child, an adolescent, and an adult is wrong. It's the same reason they oppose killing an adult. Most pro-lifers make exceptions for rape and so certainly both sides would agree logic is being employed in that case.\n\n \n See, those last two statements are contradictory. If a woman killed a 2 year old after discovering the father was someone who had raped her, one would expect her to go to jail for murder, or at least be convicted of manslaughter. Do those willing to make an exception for rape think that the mother in this case should not be tried, indeed that she should be allowed to hire a hit man to kill the toddler for her? If not, then they make a distinction between the child before and after it is born, and we are simply arguing about matters of degree.", 
   {}, 
   252692, 
   null, 
   1172611740.0
  ], 
  [
   252701, 
   null, 
   "johnhanks", 
   "While I apperciate your sarcasm, you seem rather bitter.\n\n That response surprises me, because I honestly didn't think I was being sarcastic. In response to your\n \nWhat makes one religion's divinic support more valid then anothers?\n\n I wrote\n \nThe fact that it's Our religion's divinic support, and Ours is self-evidently the One True Religion while Theirs is ignorant superstition and idolatry.\n\n Forget sarcasm: I do believe that's how it works. Ask any religious American conservative how much credence (s)he is prepared to give to the Islamic position vis-a-vis US policy toward the Middle East; then ask any militant Muslim the same question. I think you'll find their answers approximate very closely to the one I gave above.", 
   {}, 
   252491, 
   null, 
   1172613360.0
  ], 
  [
   252704, 
   null, 
   "jyoshu", 
   "See, those last two statements are contradictory. If a woman killed a 2 year old after discovering the father was someone who had raped her, one would expect her to go to jail for murder, or at least be convicted of manslaughter. Do those willing to make an exception for rape think that the mother in this case should not be tried, indeed that she should be allowed to hire a hit man to kill the toddler for her? If not, then they make a distinction between the child before and after it is born, and we are simply arguing about matters of degree.\n\n \n I think this is because most people (including pro-lifers) realize that the law can only reasonably go so far. Making abortion in general illegal is one thing, but it just becomes too unrealistic to write law to where a woman has to birth a child conceived by rape. From the ethical standpoint of abortion (outside of the law), I suspect most pro-lifers would still prefer the rape-produced fetus not be killed. For example, I've heard my wife say many times that if she were raped, she would still have the baby because it would certainly not have been the baby's fault. And knowing my wife, I have no doubt she would follow through with that.", 
   {}, 
   252694, 
   null, 
   1172614200.0
  ], 
  [
   252714, 
   null, 
   "obvious_child", 
   "To prove \"secular\" issues ...\n \n I think your question to show how divinic support is logical is a little disingenuous because I'm not sure anyone is claiming that they are operating from purely logic.\n\n \n Or logic at all. \n \nSometimes people take stands on an issue based on their conscience, such as the abortion issue. They do so because they believe killing something that will soon be born, be a child, an adolescent, and an adult is wrong. It's the same reason they oppose killing an adult. Most pro-lifers make exceptions for rape and so certainly both sides would agree logic is being employed in that case.\n\n \n Um, the rape incest exception is a logical hole in the opposition of killing life, especially as many pro-life say all life is precious. Abortion is one of the arguments that is often logic-free and usually based almost entirely upon emotion. \n \n \nI think the problem there isn't so much that God can't be proven logically as that the issue of God is not a logical matter to begin with.\n\n \n Therefore how can one sanely argue that their unproven God's religious arguments are better then another one's when the subject has in isolation nothing to do with either? \n \n \nWith that in mind, I find it somewhat disingenuous that some \"skeptics\" expect people to operate ONLY under the skeptics' paradigm of what is provable/disprovable to begin with.\n\n \n If you're dealing in a argument that requires facts and logical reasoning in the world of reality, then relying upon unproven and unaccepted rational is just insane now isn't it? \n \n johnhanks's comment about OUR religion is kind of how I see most of it and kind of why I see those arguments as rather infantile and stupid.\n \n One group claims they are right because of their religion. Another claims the same. Neither accepts the validity of the other's religion or God and both accept their own based on their own faith. This is a insane position to take in a reasoned debate.", 
   {}, 
   252692, 
   null, 
   1172617920.0
  ], 
  [
   252717, 
   null, 
   "Jo Bennett", 
   "I think this is because most people (including pro-lifers) realize that the law can only reasonably go so far. Making abortion in general illegal is one thing, but it just becomes too unrealistic to write law to where a woman has to birth a child conceived by rape. From the ethical standpoint of abortion (outside of the law), I suspect most pro-lifers would still prefer the rape-produced fetus not be killed. For example, I've heard my wife say many times that if she were raped, she would still have the baby because it would certainly not have been the baby's fault. And knowing my wife, I have no doubt she would follow through with that.\n\n \n But that just raises another contradiction, you're prepared to use the power of the state to impose your own morality, but only up to a point? I would rather there were no abortions, in that respect I am pro-life, but I think the law goes too far if it leads to people commiting suicide or obtaining abortions through unsanitary means, as happened when it was last prohibited (and disproportionately to the poor, I might add - wealthy women simply went overseas). So once again we are back to a question of degrees - at what point does it become unreasonable to implement a law? If what you state is truly the position of most pro-lifers, then they need to shut up about morality and principles, because all that has happened is that they have drawn a different line in the same continuum as everyone else. If we're talking about divine support for arguments, where is the biblical support to say that God only knows in the womb those children born from consensual sex, as the pro-lifers argument would seem to imply. The truth is that \"rape or incest only\" brigade take that position with the aim of getting votes, to avoid appearing as callous and uncaring about women in desparate situations as they actually are.", 
   {}, 
   252704, 
   null, 
   1172619300.0
  ], 
  [
   252852, 
   null, 
   "simone", 
   "Is divinic a real word?\n \n What does it mean?", 
   {}, 
   252467, 
   null, 
   1172697840.0
  ], 
  [
   252864, 
   null, 
   "Kronus", 
   "Is divinic a real word?\n No.\n \n \nWhat does it mean?\n Of, or relating to, the divine.", 
   {}, 
   252852, 
   null, 
   1172701380.0
  ], 
  [
   252867, 
   null, 
   "jyoshu", 
   "Um, the rape incest exception is a logical hole in the opposition of killing life, especially as many pro-life say all life is precious. Abortion is one of the arguments that is often logic-free and usually based almost entirely upon emotion. \n\n \n Well that depends on how one views it--you're apparently very pro-choice so naturally you view the pro-life side as being the \"logic-free\" side. Many pro-lifers probably feel the same about your position. I'm not interested in getting into an abortion debate here, I was just giving you an example of a case where people take a stand based on their conscience. If you'd rather think of it in terms of a different example, fine by me. (shrug)\n \n \nSo once again we are back to a question of degrees - at what point does it become unreasonable to implement a law? If what you state is truly the position of most pro-lifers, then they need to shut up about morality and principles, because all that has happened is that they have drawn a different line in the same continuum as everyone else.\n\n \n The position of pro-lifers is that they believe prenatal human life that will grow into a child, adolescent, etc. is very sacred and shouldn't be killed. THAT'S the only thing pro-lifers really have in common. They have varying stances on how far the law should go--my views on the law are different and even more liberal than some other pro-lifers, and I've heard pro-lifers that are more 'liberal' on their views of what the law should be than I am. I wasn't trying to speak on behalf of pro-lifers everywhere with the comment you just replied to.", 
   {}, 
   252714, 
   null, 
   1172703120.0
  ], 
  [
   252889, 
   null, 
   "huckleberry", 
   "How useful, if at all, is Divinic Support for a Secular argument? \n \n What makes one religion's divinic support more valid then anothers? \n \n No one can prove nor disprove the existance of such beings, therefore it would seem foolish to rely upon them as reasons a secular argument is true or false. One does not rely upon untested materials for a house, why would they rely upon untested much less unaccepted materials for a argument? \n \n For the laymen in the thread, \n \n Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\n \n Neither can prove their Gods exist much less their religion is correct. Can either of them rely sanely upon divinic support?\n\n \n Can you give a more concrete example as your current question is too vague to properly interpret. \"subject C\" could be anything at all. You also include a qualifier of a \"secular argument\". Please provide a decent definition of this. Otherwise your question makes little sense.", 
   {}, 
   252467, 
   null, 
   1172711400.0
  ], 
  [
   252903, 
   null, 
   "obvious_child", 
   "Well that depends on how one views it--you're apparently very pro-choice so naturally you view the pro-life side as being the \"logic-free\" side.\n\n \n No. The entire argument is virtually logic free. Both sides largely depend upon emotion in their arguments. Hence why my posts dealing with abortion are very unorthodox as they aren't reliant upon emotion and hence why they are largely designed to pick out the flaws in arguments.", 
   {}, 
   252867, 
   null, 
   1172722200.0
  ], 
  [
   252904, 
   null, 
   "obvious_child", 
   "Can you give a more concrete example as your current question is too vague to properly interpret.\n\n \n How is it vague at all? \n \n \n\"subject C\" could be anything at all.\n\n \n It is meant to be. \n \n \nYou also include a qualifier of a \"secular argument\". Please provide a decent definition of this. Otherwise your question makes little sense.\n\n \n Whether one should cut their hair or not. \n \n You are missing the point though almost entirely. I suggest you read John's post.", 
   {}, 
   252889, 
   null, 
   1172722320.0
  ], 
  [
   252968, 
   null, 
   "huckleberry", 
   "How is it vague at all? \n \n \n \n It is meant to be. \n \n \n \n Whether one should cut their hair or not. \n \n You are missing the point though almost entirely. I suggest you read John's post.\n\n \n I did miss the point entirely. The question has little point. I asked for some specific definitions. Can you define \"secular argument\" Cutting ones hair hardly qualilfies as an \"argument\". Please define the term \"secular argument\"/\n \n I did read john's post. Are you saying \"Is it legitmate to take a position based on support of a divine being?\"\n \n Your question did not ask about legitimacy but usefulness. Is this a veiled attempt to question the legitimacy of something or do you want to discuss the uses?", 
   {}, 
   252904, 
   null, 
   1172776380.0
  ], 
  [
   252989, 
   null, 
   "obvious_child", 
   "I did miss the point entirely. The question has little point.\n\n \n That's not what others think.\n \n \nI asked for some specific definitions. Can you define \"secular argument\" Cutting ones hair hardly qualilfies as an \"argument\". Please define the term \"secular argument\"/\n\n \n Okay, is cutting hair wrong? \n \n \nI did read john's post. Are you saying \"Is it legitmate to take a position based on support of a divine being?\"\n\n \n Not quite. It is sane to argue something that is irrevelant to religion on the basis of a unproven religion and diety.", 
   {}, 
   252968, 
   null, 
   1172790240.0
  ], 
  [
   253006, 
   null, 
   "huckleberry", 
   "\n Not quite. It is sane to argue something that is irrevelant to religion on the basis of a unproven religion and diety.\n\n \n I assume you mean \"is it sane to argue something that is irrelevant to religion on the basis of an unproven religion and deity.\"\n \n It is difficult to understand you. However, you have still not defined \"secular argument.\" If you are trying to define it as an argument that is irrelevant to religion, then my questions would be: Who gets to say what is irrelevant to religion? Which religions as different religions believe different things and therefore different things would be relevant to them.\"\n \n Arguing based on a religion or God is perfectly acceptable. It is not only acceptable but I think one should actually do it. One should always argue based on what they believe to be true. The POINT of argument is to have dialogue and discourse and to test ones values and beliefs with others. \n \n If this were not the point of argument then there would be no point to arguing at all. If that were true then why do so many do it?\n \n Now as to the hair cutting thing, if my religion says nothing about it then I would not likely say it is wrong. If my religion did say something about it then I would stand with that.", 
   {}, 
   252989, 
   null, 
   1172798460.0
  ], 
  [
   253081, 
   null, 
   "obvious_child", 
   "I still don't understand how you can't understanding something so pedestainly simple.\n \n Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\n \n That's all you need. \n \n How can you prove one is right when neither can even prove their validity of their argument's foundation?\n \n Are you SERIOUSLY suggesting that arguments that are derived from the fallacy of begging the question are useful and valid? \n \n SERIOUSLY? A FALLACY as VALID? emoticon_xdonno \n \n \nArguing based on a religion or God is perfectly acceptable. \n\n \n That is insane. Especially when it's one religion arguing aganist another and when neither can prove the existance or validity of their religion or God(s). \n \n \nOne should always argue based on what they believe to be true.\n\n \n Like EZ does despite the fact he's so far removed from reality?", 
   {}, 
   253006, 
   null, 
   1172873820.0
  ], 
  [
   253103, 
   null, 
   "Easyrider", 
   "You're the one with the monicker \"Obvious Child\". I guess that's your reality.", 
   {}, 
   253081, 
   null, 
   1172885040.0
  ], 
  [
   253107, 
   null, 
   "obvious_child", 
   "You're the one with the monicker \"Obvious Child\". I guess that's your reality.\n\n \n Actually I just use it to goad people into making dumb comments like that in the face of their overwhelming failures. One who has nothing more then \"oh your name is funny\" replies is quite low on the respect scale.", 
   {}, 
   253103, 
   null, 
   1172887560.0
  ], 
  [
   253108, 
   null, 
   "Easyrider", 
   "Oh, I have more to do than that, but it befuddles me why anyone who tries to represent their views as those of an informed adult would hang that kind of a monicker on themself. Unless, of course, they knew deep down what was really going on.", 
   {}, 
   253107, 
   null, 
   1172887740.0
  ], 
  [
   253129, 
   null, 
   "James", 
   "I still don't understand how you can't understanding something so pedestainly simple.\n Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\n That's all you need. \n \n\n You seem to be making a great deal of fuss about the commonplace observation that if we study comparative religion, we shall discover that there are contradictions between the beliefs of different religions. At least I think that's what you're saying. You haven't developed a coherent argument based on specific non-trivial examples. \n \n Each religion can be understood as providing a different path to transcendent truths or as a different human response to ultimate concerns. Many (sophisticated) religions inculcate some eternal principles or \"moral truths\", but the state of civilisation determines their degree of misrepresentation. \n \n While some opposition between religious views is inevitable, even provocative, other points of conflict are not. In particular, those conflicts which result from shoddy habits of thinking.\n \n James.", 
   {}, 
   253081, 
   null, 
   1172932740.0
  ], 
  [
   253160, 
   null, 
   "obvious_child", 
   "You seem to be making a great deal of fuss about the commonplace observation that if we study comparative religion, we shall discover that there are contradictions between the beliefs of different religions.\n\n \n Don't patronize me. I understand the vast contridiction between modern, ancient and everything in between of religions from Asia to America. \n \n Why can't you people understand this pedestrian concept? \n \n A says C is true. \n B says C is false. \n Neither can prove their religon or diety are true or even exist. Neither accepts either's basis. \n \n Subject is unrelated to religion or God.\n \n Can either sane rationally or even sanely use such a basis?", 
   {}, 
   253129, 
   null, 
   1172963640.0
  ], 
  [
   253165, 
   null, 
   "Ripskar", 
   "Given that a lot of religions claim universality finding a truely secular argument that would be recognised as such by believers is somewhat optimistic.\n There are no end of subjects that you could show where religious organisations weigh in, from Global Warming and Evolution to Free Speach, and Equal Rights.\n From a non-religious PoV these statements represent a block of opinion, for or against, the attached theology is of little intrest.", 
   {}, 
   253160, 
   null, 
   1172966280.0
  ], 
  [
   253188, 
   null, 
   "James", 
   "Don't patronize me. I understand the vast contridiction between modern, ancient and everything in between of religions from Asia to America. \n \n Why can't you people understand this pedestrian concept? \n \n A says C is true. \n B says C is false. \n Neither can prove their religon or diety are true or even exist. Neither accepts either's basis. \n \n Subject is unrelated to religion or God.\n \n Can either sane rationally or even sanely use such a basis?\n\n \n You complain that you've been patronized, yet you continually refer to views that you don't share as being \"insane\". And I notice that you have already assumed the answer to your questions.\n \n Why don't you pick a specific example of the religious contradictions you seem to be talking about, and explain your assertions on that basis? Perhaps what you have in mind, for example, are different justifications for war: the \"God's on our side\" claim. (Can you see here how I'm attempting to put words into your mouth because you haven't explained yourself properly?) \n \n It's no use referring to the unprovability of the Christian God or any other god and assuming that closes down all discussion of your opinions. How can an experiential conclusion be proved? \n \n If you want to air your scepticism about the existence of God, you could start a new thread. Though I haven't checked, I suspect that's been done over and over again in this forum.\n \n James.", 
   {}, 
   253160, 
   null, 
   1173004260.0
  ], 
  [
   253226, 
   null, 
   "obvious_child", 
   "I thought this place was intelligent. Guess I'm quite wrong. \n \n It amazes me how you can't understand a concept a 5 year old could and you make assumptions that are completely outside of the discussion.\n \n What I find insane is that two groups demand the other accept their positions when their positions are completely faith based and cannot be proven at all merely because \"their religion/God\" says so. It boils down to \"I say so\" vs. \"You say so.\" Is that a reasonable or sane method argumentation? Most people can see that the \"i say so\" method is retarded yet when you throw in a completely unproven and unaccepted religious belief instead of \"I\" some don't find it insane even though the fundemental point hasn't changed. This isn't about if God exists or not, that does not matter. It is about whether expecting your opponent to embrace your argument on something that they don't believe nor accept nor you can prove.", 
   {}, 
   253188, 
   null, 
   1173052020.0
  ], 
  [
   253274, 
   null, 
   "James", 
   "I thought this place was intelligent. Guess I'm quite wrong. \n \n It amazes me how you can't understand a concept a 5 year old could and you make assumptions that are completely outside of the discussion.\n \n What I find insane is that two groups demand the other accept their positions when their positions are completely faith based and cannot be proven at all merely because \"their religion/God\" says so. It boils down to \"I say so\" vs. \"You say so.\" Is that a reasonable or sane method argumentation? Most people can see that the \"i say so\" method is retarded yet when you throw in a completely unproven and unaccepted religious belief instead of \"I\" some don't find it insane even though the fundemental point hasn't changed. This isn't about if God exists or not, that does not matter. It is about whether expecting your opponent to embrace your argument on something that they don't believe nor accept nor you can prove.\n\n \n No reasonable person demands that another agrees with their opinions on the basis that \"I say so\". Even if my ultimate position is faith based, I wouldn't expect anyone to accept my point of view, on say a moral issue, simply because I believe in God. I could do no better than present my arguments and if they fail to convince, leave any disagreement intact. \n \n You keep talking about \"unproven\" religious beliefs. But if religious belief could be proven like a theorem in geometry or like a scientific fact about the natural world, there would be no need of faith. There are many things in which I believe but cannot prove - the existence of other minds, including yours, for instance.\n \n This has been written from my perspective as a retarded 5 year old, but it must suffice for now.\n \n James", 
   {}, 
   253226, 
   null, 
   1173091500.0
  ], 
  [
   253285, 
   null, 
   "obvious_child", 
   "No reasonable person demands that another agrees with their opinions on the basis that \"I say so\". Even if my ultimate position is faith based, I wouldn't expect anyone to accept my point of view, on say a moral issue, simply because I believe in God. I could do no better than present my arguments and if they fail to convince, leave any disagreement intact.\n\n \n You could have just said that in the first place. \n \n Why do people make such arguments if rational people can see the inherent flaws in them?\n \n What makes my belief that I'm right based on the existance and religion of the invisible pink unicorn any more valid then a muslim's claim based on the existance and religion of Islam and Allah?", 
   {}, 
   253274, 
   null, 
   1173096000.0
  ], 
  [
   253293, 
   null, 
   "James", 
   "You could have just said that in the first place.\n\n Yes, I would have made this point earlier, if I'd understood what you were trying to say.\n \nWhy do people make such arguments if rational people can see the inherent flaws in them?\n\n Your appeal to rationality is premature because what you call the \"inherent flaws\" in an argument, excluding logical error, may be a matter of dispute. \n \n \nWhat makes my belief that I'm right based on the existance and religion of the invisible pink unicorn any more valid then a muslim's claim based on the existance and religion of Islam and Allah?\n\n I assume you're talking about value judgments based on a set of religious beliefs. There is no way of settling differences about right and wrong unless we agree to consult the same moral standard. If, which seems unlikely but on the basis of your belief in a pink unicorn god's commandment, you said that child prostitution is wrong, it would appear that on this issue your moral principle is the same as mine. But if you cited the pink unicorn in an argument to the contrary, I would have to say that you've been misinformed by your god and that you are wrong. \n \n I recall that you claimed (in post #35) that the question of whether God exists isn't relevant to what you're trying to probe. You said, \"This isn't about if God exists or not, that does not matter\". At the same time you want to know how moral decisions can be justified when based (ultimately) on a belief in the existence of God. What you have already ruled out as irrelevant is material to the question you're asking. \n \n James.", 
   {}, 
   253285, 
   null, 
   1173106140.0
  ], 
  [
   253335, 
   null, 
   "huckleberry", 
   "I still don't understand how you can't understanding something so pedestainly simple.\n \n Religion B says subject C is true on the basis of its Divinic Support.\n Religion A says subject C is false on the basis of its Divinic Support.\n \n That's all you need. \n \n How can you prove one is right when neither can even prove their validity of their argument's foundation?\n \n Are you SERIOUSLY suggesting that arguments that are derived from the fallacy of begging the question are useful and valid? \n \n SERIOUSLY? A FALLACY as VALID? emoticon_xdonno \n \n \n \n That is insane. Especially when it's one religion arguing aganist another and when neither can prove the existance or validity of their religion or God(s). \n \n \n \n Like EZ does despite the fact he's so far removed from reality?\n\n \n \n You have now equivocated the meaning of argument. You started out as simply making a statement, then it became an actual logical argument. This is why I asked for your definition. You must know that all statements are based on assumptions. There is no begged question here. There is an assumption. There is nothing that is for certain without some degree of faith, at least as far as fundemental ideas go. Certainly saying the word \"wrench\" one could reasonably assume that the item is metal and that would not be a begged question\n \n To state that it is right or wrong based upon God's will presumes the existence of God and the person making the statement is the one that defines what God he is talking about. This is perfectly acceptable for such things. Why? because you must assume a base point, a standard, an objective beginning, when speaking of right and wrong. Without an objective or standard then such words simply have no meaning.\n \n It is not a begged question. All logical arguments begin with an assumption. Logic is the process not the end result nor the beginning assumption. You can begin with a false assumption and still come to a logical conclusion. It may be incorrect, but it will be logical. I see kids do it all the time in math problems. They assume that all rectangles are squares and apply the properties of squares to their geometry problem. It screws them up because the assumption is incorrect.\n \n That does not mean they start with a logical fallacy or a begged question. It is simply that they have incorrect info. That is what I am saying. You clearly do not understand what fallacies are or how to apply them.\n \n Huck.", 
   {}, 
   253081, 
   null, 
   1173138180.0
  ], 
  [
   253347, 
   null, 
   "obvious_child", 
   "Your appeal to rationality is premature because what you call the \"inherent flaws\" in an argument, excluding logical error, may be a matter of dispute.\n \n \n Perhaps, but when the matter of dispute is over something that cannot be proven, is there a rational dispute? I realize that people like EZ will claim their religion is true and all others are false, therefore you should accept his argument on faith, but he's beyond reasoning. The only people I see using these insane arguments are those who are essentially delusional. \n \n \nIf, which seems unlikely but on the basis of your belief in a pink unicorn god's commandment, you said that child prostitution is wrong, it would appear that on this issue your moral principle is the same as mine. But if you cited the pink unicorn in an argument to the contrary, I would have to say that you've been misinformed by your god and that you are wrong.\n\n \n What if the IPU's commandment said that child prostution is good? Furthermore, what if never of us could provide evidence of what the Gods actually say? You can see the problem here. One can provide divinic support for anything, and one can fabricate a God that supports anything. Why should any rational person build or accept a argument on such reasoning? \n \n \nI recall that you claimed (in post #35) that the question of whether God exists isn't relevant to what you're trying to probe. You said, \"This isn't about if God exists or not, that does not matter\". At the same time you want to know how moral decisions can be justified when based (ultimately) on a belief in the existence of God. What you have already ruled out as irrelevant is material to the question you're asking.\n\n \n Not quite. God's actual existance is irrevelant. What i'm getting at is the inability for one to PROVE that God exists and using that as a reason for why one is correct. God could easily exist and it wouldn't effect the argument unless it came down and revealed itself. Furthermore, BOTH Gods could exist at the same time and nothing would change.", 
   {}, 
   253293, 
   null, 
   1173140760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Divinic Support for Secular Arguments", 
  "url": "http://www.4forums.com/political/religion-debates/9605-divinic-support-secular-arguments.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9605, 
  "discussion_files": [
   [
    "10388.html", 
    "http://www.4forums.com/political/religion-debates/9605-divinic-support-secular-arguments-print.html"
   ], 
   [
    "10389.html", 
    "http://www.4forums.com/political/religion-debates/9605-divinic-support-secular-arguments-3-print.html"
   ], 
   [
    "10390.html", 
    "http://www.4forums.com/political/religion-debates/9605-divinic-support-secular-arguments-2-print.html"
   ]
  ], 
  "identifier": 9605
 }
]