[
 [
  [
   253759, 
   null, 
   "simone", 
   "Osama bin Laden is about George Walker Bush's very best friend.\n \n Bin Laden got Bush re-elected in 2004. Of course, Bush had very nicely kissed up to bin Laden after September 11, 2001, by making dead sure that all of bin Laden's relatives and bin Laden's dear friends in the Saudi royal family were safely ushered out of our angry country while we law-abiding Americans were not allow to fly.\n \n Bin Laden wanted our military people out of Saudi Arabia. Bush kissed up to him and removed the troops.\n \n Bin Laden did not want his precious hide in our hands. Bush kissed up to him and made sure that he got away at Tora Bora.\n \n Bin Laden did not like Saddam Hussein because he was too sectarian. Bush kissed up to bin Laden once again and took our military out of Afghanistan so that the Taliban and Al-Qaeda would be totally free to regroup and Bush took out bin Laden's Number One Enemy in the Middle East, Saddam Hussein.\n \n I am sure that Osama bin Laden is having a very, very happy birthday because of George Walker Bush.\n \n I'll bet Bush even sent him a nice cake.\n \n Did I mention that the bin Laden family bailed Georgie Porgy out a couple of time?\n \n Did I mention that Georgy Porgy's daddy was sitting right across from bin Laden's half brother in the Ritz Carlton in Washington DC at the very moment that plane with bin Laden people running it crashed into the Pentagon?\n \n Did I mention that?", 
   {
    "post_info": {
     "post_title": "Osama bin Laden's Birthday"
    }
   }, 
   null, 
   null, 
   1173456720.0
  ], 
  [
   253760, 
   null, 
   "simone", 
   "Oh, did I mention that Osama bin Laden's birthday is on March 10?\n \n I don't know how old he is.\n \n All I know is that he's too old, he is far too old to be alive--when you think about all those people who died on September 11.", 
   {}, 
   253759, 
   null, 
   1173456840.0
  ], 
  [
   253846, 
   null, 
   "simone", 
   "Osama bin Laden is 50 years old today and his biggest, bestest birthday present is from George Walker Bush who has given him 2006 more days of life, liberty and injustice to the people of America.", 
   {}, 
   253760, 
   null, 
   1173547680.0
  ], 
  [
   253869, 
   null, 
   "Winston Smith", 
   "Well, it is true that the US has reduced its personnel there to a minimum. Apparently they remain there to train Saudis.\n But can't you see the irony that the mean justification for Bin Laden attacks on the USA was the presence of infidel troops in his holy land.\n \n In other words isolationism is sometimes the best foreign policy, it beats late xxth imperialism any time.\n \n By the way the Saudis are mainly Sunnis so the USA by its actions in Iraq has caused the ascendancy of the Shites and Iran in the region.\n \n You seem ready to thing happy birthday to him", 
   {
    "post_info": {
     "post_title": "Happy birthday"
    }
   }, 
   253846, 
   null, 
   1173570420.0
  ], 
  [
   253918, 
   null, 
   "simone", 
   "Nooo, I am not thinging \"Happy Birthday\" to Osama.\n \n I want the bustard dead. I want his hide nailed to the wall.", 
   {}, 
   253869, 
   null, 
   1173629700.0
  ], 
  [
   253983, 
   null, 
   "Baron", 
   "Nooo, I am not thinging \"Happy Birthday\" to Osama.\n \n I want the bustard dead. I want his hide nailed to the wall.\n\n \n I'll hold the nail, while you thwing the hammer.", 
   {}, 
   253918, 
   null, 
   1173685440.0
  ], 
  [
   254006, 
   null, 
   "simone", 
   "Sankew, Baron!", 
   {}, 
   253983, 
   null, 
   1173716460.0
  ], 
  [
   254274, 
   null, 
   "huckleberry", 
   "Interesting though that Usama Bin Laden and otehr members of Al-Qaeda wanted the democrats to win the election. Surely that must mean something.", 
   {}, 
   254006, 
   null, 
   1173834840.0
  ], 
  [
   254318, 
   null, 
   "simone", 
   "Actually, Huck, BushyBoy cut a private deal with Osama bin Laden for access to his videotapes so that he would have a frightening video of bin Laden to run just before the presidential election in 2004 to panic US voters into voting for Bush again.\n \n It worked, didn't it?\n \n And Osama bin Laden was mightily pleased with the results. What is it now?\n \n Two thousand ten some days of absolute freedom and liberty for Osama bin Laden, thanks to his good friend George Walker Bush.\n \n God forbid! If Kery had won in 2004 he might have actually tracked down Osama bin Laden and hold him prisoner now.\n \n Osama bin Laden well knows that his personal freedom is largely writ in the adoring eyes of George Walker Bush.", 
   {}, 
   254274, 
   null, 
   1173889440.0
  ], 
  [
   254332, 
   null, 
   "huckleberry", 
   "Actually, Huck, BushyBoy cut a private deal with Osama bin Laden for access to his videotapes so that he would have a frightening video of bin Laden to run just before the presidential election in 2004 to panic US voters into voting for Bush again.\n \n It worked, didn't it?\n \n And Osama bin Laden was mightily pleased with the results. What is it now?\n \n Two thousand ten some days of absolute freedom and liberty for Osama bin Laden, thanks to his good friend George Walker Bush.\n \n God forbid! If Kery had won in 2004 he might have actually tracked down Osama bin Laden and hold him prisoner now.\n \n Osama bin Laden well knows that his personal freedom is largely writ in the adoring eyes of George Walker Bush.\n\n \n YOu have evidence of this somewhere? a contract, bank account, something?\n \n Check any news service you like and see al qaeda response to the last election.\n \n Huck", 
   {}, 
   254318, 
   null, 
   1173898980.0
  ], 
  [
   254409, 
   null, 
   "Winston Smith", 
   "Everybody knows that Pakistan is harbouring Osama bin Laden. The Pakis know that the USA always sides with India. The Pakis helped the Taliban since day one and continue to do so as the Taliban continue to re-gain ground in Afgahistan, eventually Osama and his followers will also re-group.", 
   {}, 
   254332, 
   null, 
   1173969660.0
  ], 
  [
   254582, 
   null, 
   "simone", 
   "YOu have evidence of this somewhere? a contract, bank account, something?\n \n Check any news service you like and see al qaeda response to the last election.\n \n Huck\nGeesh! Huck! You know how nasty Cheney gets when anyone starts snooping around!", 
   {}, 
   254332, 
   null, 
   1174060620.0
  ], 
  [
   254622, 
   null, 
   "huckleberry", 
   "Geesh! Huck! You know how nasty Cheney gets when anyone starts snooping around!\n\n \n I'll take that to mean you have no evidence. Therefore, your entire post is supposition and your opinion. Makes for a poor argument. I will ignore the thread then. I was hoping for a good debate.\n \n Huck", 
   {}, 
   254582, 
   null, 
   1174072380.0
  ], 
  [
   274586, 
   null, 
   "rubia126", 
   "Everybody knows that Pakistan is harbouring Osama bin Laden. The Pakis know that the USA always sides with India. The Pakis helped the Taliban since day one and continue to do so as the Taliban continue to re-gain ground in Afgahistan, eventually Osama and his followers will also re-group.\n\n \n hey thr seems like u have a complete miss perception abt the paksitan ... i think u should not forget that pakistan is been all the way with USA in fight against terrorism and all ... its been doing its best as it can...on the other hand pakistan itself affected by terrorism and extreamism but if u go for the true picture of the country so its beautyfull and having a very grace full and full of life culture u can find more info abt on pakistanshining.com\n hope my this source of information will changes people point of few abt a countyr :)\n good luck", 
   {
    "post_info": {
     "post_title": "true picture of pakistan"
    }
   }, 
   254409, 
   null, 
   1184924220.0
  ], 
  [
   276053, 
   null, 
   "alvacia3", 
   "Does anybody want a poisonus cake?", 
   {
    "post_info": {
     "post_title": "Birthday?"
    }
   }, 
   253759, 
   null, 
   1186060980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Osama bin Laden's Birthday", 
  "url": "http://www.4forums.com/political/politics-debates/9638-osama-bin-ladens-birthday.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9638, 
  "discussion_files": [
   [
    "32777.html", 
    "http://www.4forums.com/political/politics-debates/9638-osama-bin-ladens-birthday-print.html"
   ]
  ], 
  "identifier": 9638
 }
]