[
 [
  [
   254292, 
   null, 
   "obvious_child", 
   "\"I would guess if we had gone in there, I would still have forces in Baghdad today. We'd be running the country. We would not have been able to get everybody out and bring everybody home.\n \n And the final point that I think needs to be made is this question of casualties. I don't think you could have done all of that without significant additional U.S. casualties. And while everybody was tremendously impressed with the low cost of the (1991) conflict, for the 146 Americans who were killed in action and for their families, it wasn't a cheap war.\n \n \"And the question in my mind is how many additional American casualties is Saddam (Hussein) worth? And the answer is not that damned many. So, I think we got it right, both when we decided to expel him from Kuwait, but also when the president made the decision that we'd achieved our objectives and we were not going to go get bogged down in the problems of trying to take over and govern Iraq.\" - Dick Cheney, 1992\n \n http://seattlepi.nwsource.com/connelly/192828_joel29.html", 
   {
    "post_info": {
     "post_title": "Dick Cheney 1992, Wise man. Dick Cheney 2003 King of Fools"
    }
   }, 
   null, 
   null, 
   1173851100.0
  ], 
  [
   254322, 
   null, 
   "simone", 
   "There was also the major point that Saddam Hussein, with his Sunni roots, stood as a major bulwark against Shi'ite Iran.\n \n Now that bulwark has been destroyed, Iraq is ruled by Shi'ites--and the Sunni rulers of Saudi Arabia are very displeased.", 
   {}, 
   254292, 
   null, 
   1173889920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dick Cheney 1992, Wise man. Dick Cheney 2003 King of Fools", 
  "url": "http://www.4forums.com/political/politics-debates/9650-dick-cheney-1992-wise-man-dick-cheney-2003-king-fools.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9650, 
  "discussion_files": [
   [
    "16988.html", 
    "http://www.4forums.com/political/politics-debates/9650-dick-cheney-1992-wise-man-dick-cheney-2003-king-fools-print.html"
   ]
  ], 
  "identifier": 9650
 }
]