[
 [
  [
   254355, 
   null, 
   "Caprii", 
   "It used to be the state had the power, but over time, the Federal Government is now the government which holds supreme. This is not a monarch, but it sure feels we are being supressed by an elite group, the wealthy. \n \n History has shown, nothing stays the same, and all empires come to an end, eventually the working class and poor get fed up of their \"living conditions\" and when push comes to shove, we're going to shove back, and then things start to change.\n \n When do you think America will begin a revolt? Remember, I said WHEN, not if. Because it will happen, but when. And also, WHO, do you think will be the players?\n \n I personally, would love to see the Governors of California, Oregon and Washington unite and start a new nation. But do they have the political balls? \n \n Perhaps Texas will try it again.\n \n What do you all think?", 
   {
    "post_info": {
     "post_title": "A new American Revolution"
    }
   }, 
   null, 
   null, 
   1173912060.0
  ], 
  [
   254358, 
   null, 
   "Master_Shake", 
   "You are right, historically speaking, but I think we are quite far off from anything of the sort.", 
   {}, 
   254355, 
   null, 
   1173912480.0
  ], 
  [
   254453, 
   null, 
   "billsco", 
   "It used to be the state had the power, but over time, the Federal Government is now the government which holds supreme. This is not a monarch, but it sure feels we are being supressed by an elite group, the wealthy. \n\n \n I'm not following your line of thought here. How does a strong Federal Government translate into being suppressed by the wealthy?\n \n \n \n\n History has shown, nothing stays the same, and all empires come to an end, eventually the working class and poor get fed up of their \"living conditions\" and when push comes to shove, we're going to shove back, and then things start to change.\n\n \n Wouldn't the working class and poor be just as overworked and just as poor regardless of where the fulcrum of power was? Or. as I see, it, more so without a strong national government which can uniformly administer labor standards.\n \n \n \n\n I personally, would love to see the Governors of California, Oregon and Washington unite and start a new nation. But do they have the political balls? \n\n \n \n I personally abhor secession talk. That's all it is fortunately--talk.", 
   {}, 
   254355, 
   null, 
   1173990720.0
  ], 
  [
   255409, 
   null, 
   "Dono", 
   "It used to be the state had the power, but over time, the Federal Government is now the government which holds supreme. This is not a monarch, but it sure feels we are being supressed by an elite group, the wealthy. \n \n History has shown, nothing stays the same, and all empires come to an end, eventually the working class and poor get fed up of their \"living conditions\" and when push comes to shove, we're going to shove back, and then things start to change.\n \n When do you think America will begin a revolt? Remember, I said WHEN, not if. Because it will happen, but when. And also, WHO, do you think will be the players?\n \n I personally, would love to see the Governors of California, Oregon and Washington unite and start a new nation. But do they have the political balls? \n \n Perhaps Texas will try it again.\n \n What do you all think?\nAfter WWII, with the rest of the world's manufacturing infrastructure in shambles, we were the world's provider of manufactured goods, a creditor nation with a huge positive balance of trade. Our companies prospered and did little to resist our workers incessant demands for higher pay and benefits. Many came to believe that increasing prosperity was a birthright instead of something to be earned. Now those foreign factories are rebuilt and staffed with workers eager to work at rates much lower than ours, and nations that once rode bicycles are now stressing education and buying cars (not from us). Advances in technology has lowered the barriers that oceans once were. We are now a debtor nation with a large negative trade balance and an ongoing demand for goods now provided by our former customers, and paid for with debt. We are still the world's economic engine, but our power is waning. We are an innovative, hard working people capable of amazing things if we can stop being the world's policeman and direct our talents and resources inward.", 
   {}, 
   254355, 
   null, 
   1174798560.0
  ], 
  [
   256315, 
   null, 
   "gman", 
   "It used to be the state had the power, but over time, the Federal Government is now the government which holds supreme. \n\n \n What advantages will be to the advancement of the inhabitants of the more powerful states? Will they miss the funding they receive from the feds? \n What part of powerful states is missed? The right to \"own\" humans? \n In my experience, state bureacracies are ever much as incompetent as any federal organization I have dealt with. They are all made up of \"people\". \n Without a federal government, it is my opinion that the civil war would not be the only war in our history books.\n A documentary I watched suggested that if \"all\" of the world lived as Americans do, the world would quickly run out of resources.\n Do you feel like the average American is downtrodden or oppressed? If so, how would states holding the power change that? Should states focus the use of their power in advancing the lifestyles of it's inhabitants even at the cost of neighboring states?", 
   {}, 
   254355, 
   null, 
   1175438340.0
  ], 
  [
   256324, 
   null, 
   "Symbiote", 
   "Without a federal government, it is my opinion that the civil war would not be the only war in our history books.\n\n \n Is this supposed to be ironic? Or are your history books really that innaccurate?\n \n Without a strong federal government, the US almost certainly never have entered into WW1 to \"make the world safe for democracy\" (that was certainly a rousing success, wasn't it, giving us Nazi Germany). WW2 may never have occurred.\n \n We wouldn't have funding of oppressive foreign regimes, so 9/11 almost certainly would never have occurred, the world most likely wouldn't have been pushed to the brink of nuclear destruction. Corrupt African and South Americans wouldn't have been propped up either, thus ensuring two continents remained in perpetual poverty.\n \n Without the federal reserve screwing around with your money, the great depression would have been avoided. Along with the subtler but no less devastating drain on wealth long term inflation has given you.\n \n I think on the whole we could say the world would have been a lot better off without the US acquiring a strong federal government and its associated war and theft. Lincoln's victory in the American civil war was a disgrace, it had nothing to do with slavery, which I am certain would have been abolished shortly anyway without the needless bloodshed.", 
   {}, 
   256315, 
   null, 
   1175441340.0
  ], 
  [
   261366, 
   null, 
   "TANSTAAFL'07", 
   "This country WILL NEVER support a socialist/marxist/communist revolution. We may be duped into a welfare state, bordering on socialism, maybe even into socialism, but there will never be a \"revolution.\" If only a few states had the balls to suscede for a good reason. Namely, a free market economy with a HIGHLY decentralized, defanged government. We still have the culture to support such a nongovernment.", 
   {
    "post_info": {
     "post_title": "Wow, another socialist revolutionary, how original"
    }
   }, 
   256324, 
   null, 
   1178144160.0
  ], 
  [
   263667, 
   null, 
   "snakespit", 
   "Without a strong federal government, the US almost certainly never have entered into WW1 to \"make the world safe for democracy\" (that was certainly a rousing success, wasn't it, giving us Nazi Germany). WW2 may never have occurred.\n\n Weren't the ANZAC's already fighting in WWI prior to US involvement? And even forget about Galipoli, the ANZAC's fought on the western front too. Yeah...maybe you're right, we should have let you and the rest of Europe get slaughtered, then divided Europe up with Germany. \n \n \nI think on the whole we could say the world would have been a lot better off without the US acquiring a strong federal government and its associated war and theft.\n\n Perhaps in some respects you are right. But then again, the US has probably done just as much if not more good in the world that would probably not be possible without a strong federal government. \n \n \n Lincoln's victory in the American civil war was a disgrace, it had nothing to do with slavery, which I am certain would have been abolished shortly anyway without the needless bloodshed.\n\n Slavery was merely an excuse used to make the Federal troops feel justified and noble in killing their fellow countrymen. The real reason was secession. What exactly would your government do if Queensland and Nothern Territory suddenly decided they were no longer going to be part of your Commonwealth and suddenly formed their own country? Do you think your government would be OK with that? While tragic, the American Civil War was one fought out of neccesity rather than desire.", 
   {}, 
   256324, 
   null, 
   1179490800.0
  ], 
  [
   263718, 
   null, 
   "Symbiote", 
   "Neither Australia nor New Zealand are part of Europe, though at the time of the first world war, the majority of soldiers probably would have considered themselves in some sense british, or at least loyal to the monarchy.\n \n When you say \"we\", are you saying you fought in WW1 or do you think about the US military the way sports fans do about their favourite teams?\n \n In any case the rest of Europe did get slaughtered, as the democracy imposed on Germany turned out not to be so great after all. And then came the Soviet Union, and now... who knows what else this past century of militaristic exportation of democracy will reap, but if history is to be our guide, every crisis solved by the current method seems to generate unexpected problems just a little later on.\n \n \nWhat exactly would your government do if Queensland and Nothern Territory suddenly decided they were no longer going to be part of your Commonwealth and suddenly formed their own country?\n\n \n I have no idea, the prospect is so incredibly remote I don't think anyone would have even bothered thinking about it yet. But \"Timmy does it too\" doesn't make it right.\n \n Recently in Indonesia you might recall the secession of East Timor, the attempts of the indonesian central government to retain control over this province were largely viewed as villainous, and the same applies to the southern states in the US, or a hypothetical situation occuring in northern Australia.\n \n You can claim it was necessary, but necessary for who? The royalty in washington who would rather their power and kingdom expand rather than diminish?", 
   {}, 
   263667, 
   null, 
   1179511080.0
  ], 
  [
   263874, 
   null, 
   "snakespit", 
   "Neither Australia nor New Zealand are part of Europe, though at the time of the first world war, the majority of soldiers probably would have considered themselves in some sense british, or at least loyal to the monarchy.\n\n They're not!? Wow. So what does this have to do with what I asked you?\n \n \nWhen you say \"we\", are you saying you fought in WW1 or do you think about the US military the way sports fans do about their favourite teams?\n\n Meaning the US, America, a group that I am part of, my home country. Do you have anything of substance to say, or are you just going to nit-pick at my use of language?\n \n \nIn any case the rest of Europe did get slaughtered, as the democracy imposed on Germany turned out not to be so great after all. And then came the Soviet Union, and now... who knows what else this past century of militaristic exportation of democracy will reap, but if history is to be our guide, every crisis solved by the current method seems to generate unexpected problems just a little later on.\n\n And you blame this all on who? Please do not forget that you're country was heavily involved in WWI prior to any US involvement, stood shoulder to shoulder with the US during WWII, and has been involved with us in just about every other conflict since. \n \n \n \nYou can claim it was necessary, but necessary for who? The royalty in washington who would rather their power and kingdom expand rather than diminish?\n\n \n First off, we don't have any of that silly royalty stuff in the US. \n \n Necessary for preservation of the Union. This must have been a popular goal not only with the politicians, but with the people as well. With little exception, the vast majority of the troops were volunteers to the army, rather than conscripts. I guess some people just believe that there are things worth fighting for. Obviously you are not one of those people.", 
   {}, 
   263718, 
   null, 
   1179591420.0
  ], 
  [
   263881, 
   null, 
   "Symbiote", 
   "And you blame this all on who? Please do not forget that you're country was heavily involved in WWI prior to any US involvement, stood shoulder to shoulder with the US during WWII, and has been involved with us in just about every other conflict since. \n\n \n If my point was that Australia = good, US = bad, this would be relevant. But I disagree with Australia's involvement in those wars too, so it isn't.\n \n \nNecessary for preservation of the Union\n\n \n And why is the preservation of the union so important that it was worth hundreds of thousands of lives? Is it a god, demanding human sacrifice?\n \n \nThis must have been a popular goal not only with the politicians, but with the people as well. With little exception, the vast majority of the troops were volunteers to the army, rather than conscripts\n\n \n The war in Iraq must be incredibly popular then, since as far as I know, none of the troops there are conscripts. \n \n \nI guess some people just believe that there are things worth fighting for. Obviously you are not one of those people.\n\n \n Oh there are things worth fighting for, but the continued domination of a group of people weaker than you, whether they be the southern states in the US, or a province of Indonesia, is not one of them.\n \n I wonder, if you were Indonesian, would you be demanding the Indonesian military rape and pillage east timor. Or in Iraq, would you be backing Saddam's continued domination of the Kurds, to preserve the national union there. Perhaps in North Korea, you'd back Kim Jong Il's desire for unification. Or if you were British, would you demand the suppression of the American revolution at any cost, to maintain the integrity of Her Majesty's empire? Was Germany right in going to war to unify the Aryan people under a single national flag?\n \n I mean it seems to me that you would support none of these things, and when it comes to other nations, you would probably view seccession as legitimate. But when it comes to your own nation, butchering hundreds of thousands to prevent seccession suddenly becomes the right thing. Not only right, but mysteriously necessary.\n \n And this is why I highlight your use of the word \"we\", because you identify yourself with the US government and military, which explains why you are willing to excuse their brutality.\n \n Nor is a war to impose democracy on another nation worthwhile. It didn't work in World War 1, and it's sure as hell not working now. The demand for it in WW2 might be viewed as having acceptable consequences, had it not required the nuclear bombardment of Japanese civilians and sufficient delays in resolving the war's end to allow soviet domination of eastern europe.", 
   {}, 
   263874, 
   null, 
   1179592980.0
  ], 
  [
   266850, 
   null, 
   "gman", 
   "It used to be the state had the power, but over time, the Federal Government is now the government which holds supreme. This is not a monarch, but it sure feels we are being supressed by an elite group, the wealthy. \n \n History has shown, nothing stays the same, and all empires come to an end, eventually the working class and poor get fed up of their \"living conditions\" and when push comes to shove, we're going to shove back, and then things start to change.\n \n When do you think America will begin a revolt? Remember, I said WHEN, not if. Because it will happen, but when. And also, WHO, do you think will be the players?\n \n I personally, would love to see the Governors of California, Oregon and Washington unite and start a new nation. But do they have the political balls? \n \n Perhaps Texas will try it again.\n \n What do you all think?\n\n \n I think you are a whacked out whiner. Sitting at your computer extolling the agony we Americans are in. Oh God, help us. We are so downtodden. We pray for the strength and courage to rebel and kill our oppressors. \n Spoiled XXX Americans. Ingrates.", 
   {}, 
   254355, 
   null, 
   1181052000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A new American Revolution", 
  "url": "http://www.4forums.com/political/history-debates/9651-new-american-revolution.html", 
  "breadcrumbs": [
   "History"
  ], 
  "id_number": 9651, 
  "discussion_files": [
   [
    "13400.html", 
    "http://www.4forums.com/political/history-debates/9651-new-american-revolution-print.html"
   ]
  ], 
  "identifier": 9651
 }
]