[
 [
  [
   254370, 
   null, 
   "ShadowPikachu", 
   "I thought this article was interesting - kind of a neat idea, especially with the amount of discrimination going on that prevents gays from going to adoption agencies in some states. Here's the article: Gay male parents get dedicated fertility program - CNN .", 
   {
    "post_info": {
     "post_title": "Dedicated Fertility Program for Gay male parents"
    }
   }, 
   null, 
   null, 
   1173918120.0
  ], 
  [
   254382, 
   null, 
   "jitobear", 
   "Gender selection kind of weirds me out - but other than that - nifty!", 
   {}, 
   254370, 
   null, 
   1173924600.0
  ], 
  [
   254388, 
   null, 
   "ShadowPikachu", 
   "Gender selection kind of weirds me out - but other than that - nifty!\n\n \n Yeah, that was the only part I was a little leery about, but apparently it is something that some fertility clinics do in the US. Don't know that I'd want to get involved with that (sounds a little too much like designer babies), but other than that little tidbit, I think it is great that someone is taking the initiative in this.", 
   {}, 
   254382, 
   null, 
   1173930540.0
  ], 
  [
   254405, 
   null, 
   "Matthew S", 
   "Now if they could just find a way to genetically link the child to both males second parent adoption would be irrelivant. If they could some how take an egg remove its genetic material then introduce two sperms. Shoot one of the men could even carry the child Ectopicly.", 
   {}, 
   254388, 
   null, 
   1173966120.0
  ], 
  [
   254425, 
   null, 
   "jitobear", 
   "Now if they could just find a way to genetically link the child to both males second parent adoption would be irrelivant. If they could some how take an egg remove its genetic material then introduce two sperms. Shoot one of the men could even carry the child Ectopicly.\n\n \n That would be a whole lot of biological engineering. providing the environment, training the male body to provide nurishment to it.\n \n I think their are many marvelous gay parents - but men and women are different critters - us girls get to carry the babies. Blessing or curse....hmmmm? (Depends on how many times I puked that day....)\n \n emoticon_xangel", 
   {}, 
   254405, 
   null, 
   1173977700.0
  ], 
  [
   254444, 
   null, 
   "ShadowPikachu", 
   "Well, you never know. They might find a way to make the baby from the sperm of the two men like Matthew suggested, but it'd be even harder to enable them to carry it. They HAVE created fatherless mice (medically-assisted parthogenesis), so it is at least conceivable that they might make it possible for lesbians (I think they'd have a lot harder time with two men).", 
   {}, 
   254425, 
   null, 
   1173984720.0
  ], 
  [
   254471, 
   null, 
   "Matthew S", 
   "That would be a whole lot of biological engineering. providing the environment, training the male body to provide nurishment to it.\n \n I think their are many marvelous gay parents - but men and women are different critters - us girls get to carry the babies. Blessing or curse....hmmmm? (Depends on how many times I puked that day....)\n \n emoticon_xangel\n\n \n A man can carry a baby it is the baby that creates the placenta. It is possible to implant a fertilized egg under the abdominal wall of a man. I saw the program once where this woman was pregant with multiple babies and one of them was outside her uterus. The baby was lodged beteewn her large intestine and her bladder with its placenta attched to her bladder. As with all extopic pregancies it is extreamly dangerous since there is no telling where the placenta will atach to the mans blood supply. So if a woman can have a baby with out it being in the uterus then why not a man?", 
   {}, 
   254425, 
   null, 
   1174001820.0
  ], 
  [
   254472, 
   null, 
   "Matthew S", 
   "Well, you never know. They might find a way to make the baby from the sperm of the two men like Matthew suggested, but it'd be even harder to enable them to carry it. They HAVE created fatherless mice (medically-assisted parthogenesis), so it is at least conceivable that they might make it possible for lesbians (I think they'd have a lot harder time with two men).\n\n \n I dont see why it has to be difficult? The sperms both have 23 chromosomes so why not remove the eggs dna then just add two sperms to the egg.", 
   {}, 
   254444, 
   null, 
   1174002000.0
  ], 
  [
   254598, 
   null, 
   "jitobear", 
   "A man can carry a baby it is the baby that creates the placenta. It is possible to implant a fertilized egg under the abdominal wall of a man. I saw the program once where this woman was pregant with multiple babies and one of them was outside her uterus. The baby was lodged beteewn her large intestine and her bladder with its placenta attched to her bladder. As with all extopic pregancies it is extreamly dangerous since there is no telling where the placenta will atach to the mans blood supply. So if a woman can have a baby with out it being in the uterus then why not a man?\n\n \n Interesting. It would have to be a c-section. I am no biologist - but there is lot of hormonal and biological triggers involved in pregnancy. I suspect it would be very difficult and risky to duplicate.\n \n Not sure where you came up with the first sentence tho. The placenta is created in my uterus every month. If there is no baby it leaves my body. I am dealing with that fact of biology as we speak.\n \n I wouldn't stress too much about it. One thing my life has taught me is that family has very little to do with biology. Some of my closest family members aren't even related to me. My sister-in-law's family, my sister-in-law's daughter, my best friend, my kid's dad and partner - are more family than my son's biogical father or my own father are.", 
   {}, 
   254471, 
   null, 
   1174065900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dedicated Fertility Program for Gay male parents", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9652-dedicated-fertility-program-gay-male-parents.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9652, 
  "discussion_files": [
   [
    "7177.html", 
    "http://www.4forums.com/political/gay-rights-debates/9652-dedicated-fertility-program-gay-male-parents-print.html"
   ]
  ], 
  "identifier": 9652
 }
]