[
 [
  [
   254376, 
   null, 
   "JPSartre12", 
   "I challenge ShadowPikachu to defend his assertion that gays aren't responsible for the initial spread of AIDS in the US.", 
   {
    "post_info": {
     "post_title": "Challenge"
    }
   }, 
   null, 
   null, 
   1173920340.0
  ], 
  [
   254489, 
   null, 
   "Collin", 
   "Make it more interesting: why no sexual orientation is responsible for the spread of a disease that moves between sexes no matter the partner. I think the relevance of your resolution is rather flattened by your admission that the spread would have occured with or without gays.", 
   {}, 
   254376, 
   null, 
   1174008660.0
  ], 
  [
   254508, 
   null, 
   "JPSartre12", 
   "Make it more interesting: why no sexual orientation is responsible for the spread of a disease that moves between sexes no matter the partner. I think the relevance of your resolution is rather flattened by your admission that the spread would have occured with or without gays.\n\n \n I made the challenge because our resident homosexual apologist wouldn't admit that the spread of AIDS in the US was started by homosexuals.\n While the disease moves between sexes, it obtained critical mass in the US in the gay community.", 
   {}, 
   254489, 
   null, 
   1174014120.0
  ], 
  [
   254532, 
   null, 
   "Collin", 
   "I understand that...\n \n But are we then to blame ourselves for the start of virtually every other STD out there? I just doesn't make sense to me. Why does it matter who started it if it would have spread notwithstanding?", 
   {}, 
   254508, 
   null, 
   1174018980.0
  ], 
  [
   254535, 
   null, 
   "daewoo", 
   "You are going to have to be careful how you word the resolution in order to ensure that the debate is not a ludicrously wide net of \"what ifs\" and \"could have beens\", or a ludicrously narrow argument about who FIRST transmitted the disease, which I don't think is what either of you are after. \n \n Since you both seem to actually like debating this issue, I don' think that too much time needs to be spent ont he reslution or scope of the resolution, just make sure ths does not turn into a 110 page superdebate!", 
   {}, 
   254532, 
   null, 
   1174019580.0
  ], 
  [
   254539, 
   null, 
   "JPSartre12", 
   "I understand that...\n \n But are we then to blame ourselves for the start of virtually every other STD out there? I just doesn't make sense to me. Why does it matter who started it if it would have spread notwithstanding?\n\n \n The comment was part of a larger issue. I just got tired of hearing PC apologists claim, as you just did, that AIDS would have become an epidemic in the US without the influence of the gay community. That's simply contrary to the facts. Critical mass was reached in the US because of gays. Period. The fact that once it reached critical mass, it spread to the blood supply, junkies, etc., doesn't change the fact that the initiation occurred in homosexuals males playing Brokeback Mountain. :xcensored", 
   {}, 
   254532, 
   null, 
   1174020480.0
  ], 
  [
   254542, 
   null, 
   "Collin", 
   "The idea that AIDS required homosexuality is ridiculous. That doesn't explain the hundreds of other rampant STD's. If you disagree, debate a resolution like that.", 
   {}, 
   254539, 
   null, 
   1174020840.0
  ], 
  [
   254546, 
   null, 
   "ShadowPikachu", 
   "Well, just saw this thread. Guess everyone can see by his attitude and posts here (not to mention the proposed resolved statement) exactly why I refused to get into a formal debate with him.", 
   {}, 
   254542, 
   null, 
   1174021260.0
  ], 
  [
   254557, 
   null, 
   "Jo Bennett", 
   "The comment was part of a larger issue. I just got tired of hearing PC apologists claim, as you just did, that AIDS would have become an epidemic in the US without the influence of the gay community. That's simply contrary to the facts. Critical mass was reached in the US because of indiscriminate butt####ing amongst gays. Period. The fact that once it reached critical mass, it spread to the blood supply, junkies, etc., doesn't change the fact that the initiation occurred in homosexuals males playing Brokeback Mountain in each others' arses. :xcensored\n\n \n How come most sufferers in Africa are heterosexual then? The disease would have spread anyway. Sure, the chances of transmission are higher for anal than vaginal sex, but it's not like gay men are the only people who have anal sex anyway.", 
   {}, 
   254539, 
   null, 
   1174026660.0
  ], 
  [
   254559, 
   null, 
   "daewoo", 
   "Well, just saw this thread. Guess everyone can see by his attitude and posts here (not to mention the proposed resolved statement) exactly why I refused to get into a formal debate with him.\n\n \n Actually, no. It seems like you guys obviosuly see this from different viewpoints, why would you not want to do a formal debate with him and set the record straight so to speak? Admittedly he is a little crass in his representation of the argument, but in a formal debate crude remarks like that will just cost him points anyway, which would speed you towards an easy victory, so why not go for it???? \n \n What resoution? I have not seen one presented yet. What would you suggest as a good resolution??", 
   {}, 
   254546, 
   null, 
   1174029720.0
  ], 
  [
   254576, 
   null, 
   "JPSartre12", 
   "Well, just saw this thread. Guess everyone can see by his attitude and posts here (not to mention the proposed resolved statement) exactly why I refused to get into a formal debate with him.\n\n \n Pick a resolution that you like. As long as it has the elements of my original statement that you disputed in your weak attempt to dismiss me as a bigot, I'm OK with it. \n And for the record, I don't have a problem with gays. My son and I go drag racing with a gay man at least 3 times/season. The reason that I got ###### was because, without knowing a damn thing about me, you attempted to blow my statement off by calling me a bigot. And when I challenged you to show that I was wrong, you and other apologists, tried to deflect the topic away from my actual statement. Now, I'd like to formally debate the topic with you so that there will be no personal attacks and any attempts at subterfuge will be easily seen by the judges for what they truly are.\n \n Now, if you doubt that I'm capable of civility towards you, read some of my prior debates and judge for yourself.", 
   {}, 
   254546, 
   null, 
   1174055520.0
  ], 
  [
   254577, 
   null, 
   "JPSartre12", 
   "How come most sufferers in Africa are heterosexual then? The disease would have spread anyway. Sure, the chances of transmission are higher for anal than vaginal sex, but it's not like gay men are the only people who have anal sex anyway.\n\n \n And if I was going to debate the spead of AIDS in Africa, then your statement would be relevent. But I wasn't speaking about Africa. I WAS speaking about the onset of AIDS in the US and its predominant cause.", 
   {}, 
   254557, 
   null, 
   1174055640.0
  ], 
  [
   254588, 
   null, 
   "Collin", 
   "And if I was going to debate the spead of AIDS in Africa, then your statement would be relevent. But I wasn't speaking about Africa. I WAS speaking about the onset of AIDS in the US and its predominant cause.\n\n \n Then argue that AIDS would not have spread without homosexuals. Otherwise the debate's entire point is moot.", 
   {}, 
   254577, 
   null, 
   1174061820.0
  ], 
  [
   254620, 
   null, 
   "JPSartre12", 
   "Then argue that AIDS would not have spread without homosexuals. Otherwise the debate's entire point is moot.\n\n \n Did you read post #1? emoticon_confused \n \n \n\n I challenge ShadowPikachu to defend his assertion that gays aren't responsible for the initial spread of AIDS in the US. \n \n", 
   {}, 
   254588, 
   null, 
   1174071060.0
  ], 
  [
   254629, 
   null, 
   "Master_Shake", 
   "We all understand what your original statement was. The point is, if you, in the end, believe that HIV/AIDS would have spread regardless what difference does it ultimately make how it began?\n And if you don't believe it would have spread, what is your ultimate point?", 
   {}, 
   254620, 
   null, 
   1174073760.0
  ], 
  [
   254635, 
   null, 
   "Waxy", 
   "The comment was part of a larger issue. I just got tired of hearing PC apologists claim, as you just did, that AIDS would have become an epidemic in the US without the influence of the gay community. That's simply contrary to the facts. Critical mass was reached in the US because of indiscriminate butt####ing amongst gays. Period. The fact that once it reached critical mass, it spread to the blood supply, junkies, etc., doesn't change the fact that the initiation occurred in homosexuals males playing Brokeback Mountain in each others' arses. :xcensored\n\n \n JP, if you made a post like this in debate or a challenge to me, I'd write you off as a bigot too.\n \n Quite frankly, I'm really not impressed that you've stooped to this level, I'm surprised and disappointed to see it from you. \n \n Waxy\n \n P.S. The \"I have a gay acquaintance I drag race with\" was rather George Costanza. I'm sure you talk to him like you did above too.", 
   {}, 
   254539, 
   null, 
   1174074660.0
  ], 
  [
   254660, 
   null, 
   "JPSartre12", 
   "JP, if you made a post like this in debate or a challenge to me, I'd write you off as a bigot too.\n \n Quite frankly, I'm really not impressed that you've stooped to this level, I'm surprised and disappointed to see it from you. \n \n Waxy\n \n P.S. The \"I have a gay acquaintance I drag race with\" was rather George Costanza. I'm sure you talk to him like you did above too.\n\n \n I admit that my post above was venting. I had reached my saturation point for BS. I'm calm now and he still won't debate me, even though I promised to be on my best behavior while I shred his position. emoticon_xangel", 
   {}, 
   254635, 
   null, 
   1174084500.0
  ], 
  [
   254665, 
   null, 
   "JPSartre12", 
   "We all understand what your original statement was. \n\n I disagree. Most of the respondents argued against a strawman argument. I was specific in my claim. Key points: INITIAL and US. I know that HIV is spreading in Africa via different means, but it has ZERO bearing on my statement about the initiation of AIDS in the US.\n I've seen the usual tactics come out when the PC crowd wants to avoid the cold hard facts. Argue about what happened elsewhere and deflect the real argument away from the real argument. Well, I don't get distracted that easily anymore. \n \n\n The point is, if you, in the end, believe that HIV/AIDS would have spread regardless what difference does it ultimately make how it began?\n And if you don't believe it would have spread, what is your ultimate point?\n\n \n What makes you think that I agree that HIV would have spread throughout the US regardless? There are lots of deadly diseases that haven't become pandemics. My contention is that without gays, AIDS could have very likely been one of them. Unfortunately, I can't seem to get the loudest opposing voice to agree to argue the point with me. Instead, he'd rather call me a bigot and make unsubstantiated statements that don't address the topic.", 
   {}, 
   254629, 
   null, 
   1174085160.0
  ], 
  [
   254668, 
   null, 
   "ShadowPikachu", 
   "JP, if you made a post like this in debate or a challenge to me, I'd write you off as a bigot too.\n \n Quite frankly, I'm really not impressed that you've stooped to this level, I'm surprised and disappointed to see it from you. \n \n Waxy\n \n P.S. The \"I have a gay acquaintance I drag race with\" was rather George Costanza. I'm sure you talk to him like you did above too.\n\n \n It's not just his statement here, either. He has made other statements of similar content and tone on the thread where he \"challenged\" me, and he wonders why people would call him a bigot. emoticon_rolleyes", 
   {}, 
   254635, 
   null, 
   1174085580.0
  ], 
  [
   254685, 
   null, 
   "Master_Shake", 
   "As I see it, there really isn't any point in this debate. The contention that HIV/AIDS wouldn't have spread to the degree it has without the gay population is something that is pretty impossible to prove or dispute. We know the way it developed, but it's way too complex to determine \"what could've been.\"", 
   {}, 
   254668, 
   null, 
   1174089000.0
  ], 
  [
   254699, 
   null, 
   "JPSartre12", 
   "It's not just his statement here, either. He has made other statements of similar content and tone on the thread where he \"challenged\" me, and he wonders why people would call him a bigot. emoticon_rolleyes\n\n \n Quit crying. You want to debate or not?emoticon_cry", 
   {}, 
   254668, 
   null, 
   1174097340.0
  ], 
  [
   254719, 
   null, 
   "Collin", 
   "What makes you think that I agree that HIV would have spread throughout the US regardless? There are lots of deadly diseases that haven't become pandemics. My contention is that without gays, AIDS could have very likely been one of them.\n\n \n If you do believe that, debate that claim. It is not the same statement as \"Gays got AIDS rolling in the U.S.\" That claim is worthless -- it doesn't mean anything. You'd be arguing the validity of evidence instead of the conclusion that the evidence actually leads to. It would be boring, like arguing over whether or not mass is attracted to itself instead of the actual validity of Gravitational Theory.\n \n You can stop playing this game of coming up with the most innocent-looking resolution with the intent of exploiting it during the debate. While it's understandable that a seasoned debating judge like you would try, the rest of us are gonna keep calling you on it.", 
   {}, 
   254699, 
   null, 
   1174140180.0
  ], 
  [
   254722, 
   null, 
   "Archangel", 
   "The undeniable fact remains that in the beginning, before Aids even had a name. As the medical authorities were dealing with literally hundreds of patients coming into hospitals between NY and San Francisco, all males, all gay, and all with the same exact range of symptoms. There are only 2 reasons why the medical authorities concluded that this disease was spreading from and within the gay community, and that is because as they traced where these men spent their time it was found that they ALL spent time in public bath houses, the gay sex clubs of the time period.\n \n They also tracked down Patient #1 as a Flight Attendent who traveled on International flights and had visited Africa, New York Bath houses and Bath houses in San Francisco. It is believed that he caught it in Africa and transfered it to the American Gay community in NY and San Fran. So there is no reason to believe that if but for the Gay communities intrussive anal activities that HIV or AIDS might never gotten a foothold in the USA at all.", 
   {}, 
   254719, 
   null, 
   1174144200.0
  ], 
  [
   254734, 
   null, 
   "JPSartre12", 
   "If you do believe that, debate that claim. It is not the same statement as \"Gays got AIDS rolling in the U.S.\" That claim is worthless -- it doesn't mean anything. You'd be arguing the validity of evidence instead of the conclusion that the evidence actually leads to. It would be boring, like arguing over whether or not mass is attracted to itself instead of the actual validity of Gravitational Theory.\n \n You can stop playing this game of coming up with the most innocent-looking resolution with the intent of exploiting it during the debate. While it's understandable that a seasoned debating judge like you would try, the rest of us are gonna keep calling you on it.\n\n \n I asked Shadow to come up with a resolution that encompassed my original assertion. The keys were INITIAL SPREAD and the US. I'd be stupid to debate a resolution such as \"AIDS was spread exclusively by gays\" or similar. All that a decent debater would have to do is find a single exception and my claim is refuted. That's why I stated it the way I did. I don't want somebody taking an absolute resolution and using a single example to the contrary to defeat it.\n The reality is that the primary transmission of HIV in the US occurred via the homosexual community. I've yet to see ANY evidence from the apologists to dispute that, but they want to call me a bigot for making that factual assertion. So, I said to Shadow, put up or shut up. If my statement is in err, then debate me formally, where personal attacks and attempted subterfuge will be caught by the judges and exposed for what it is.", 
   {}, 
   254719, 
   null, 
   1174154040.0
  ], 
  [
   254735, 
   null, 
   "Jo Bennett", 
   "So the actual assertion you want to debate is not the one you initially made, but more like \"the first people in the US to contract HIV were gay men\"? Your original statement implied that gays collectively should be held responsible for the transmission of a disease no-one knew existed, and your subsequent statements implied that it would not have spread without gay men, despite the evidence from other countries to the contrary.", 
   {}, 
   254734, 
   null, 
   1174154580.0
  ], 
  [
   254738, 
   null, 
   "JPSartre12", 
   "So the actual assertion you want to debate is not the one you initially made, but more like \"the first people in the US to contract HIV were gay men\"? Your original statement implied that gays collectively should be held responsible for the transmission of a disease no-one knew existed, and your subsequent statements implied that it would not have spread without gay men, despite the evidence from other countries to the contrary.\n\n \n I told you. I'll debate a resolution that includes the points that I was attacked on. AIDS in US spread primarily due to gays. Shadow can word it any way he likes as long as those elements are present. :xbanghead", 
   {}, 
   254735, 
   null, 
   1174154880.0
  ], 
  [
   254833, 
   null, 
   "daewoo", 
   "If the two parties want to move forward with the debate, I could try to word a resolution/broker a compromise on the resolution that would be acceptable to both sides. A simple resolution would probably not do it, but maybe something like this:\n \n The intial spread of AIDS and growth to epidemic proportions was the result of intentional actions within the gay community and could have been avoided if the gay community had changed their behavior.\n \n A few things to note (since I don't want anybody to agree and then feel that it was a trick resolution):\n \n 1. The \"intentional actions\" need not necessarily have been motivated specifically at spreading the aids virus....the resolution does NOt suggest that aids was ever spread on purpose by anybody\n 2. There is a certain amount of \"could have been\" and conjecture in the second part of the resolution. \n 3. The resolution assumes that aids is an epidemic. This is critical to the resolution, so if either participant has trouble with the use of the term \"epidemic\", changes would have to be made.", 
   {}, 
   254738, 
   null, 
   1174247880.0
  ], 
  [
   254834, 
   null, 
   "JPSartre12", 
   "If the two parties want to move forward with the debate, I could try to word a resolution/broker a compromise on the resolution that would be acceptable to both sides. A simple resolution would probably not do it, but maybe something like this:\n \n The intial spread of AIDS and growth to epidemic proportions was the result of intentional actions within the gay community and could have been avoided if the gay community had changed their behavior.\n \n A few things to note (since I don't want anybody to agree and then feel that it was a trick resolution):\n \n 1. The \"intentional actions\" need not necessarily have been motivated specifically at spreading the aids virus....the resolution does NOt suggest that aids was ever spread on purpose by anybody\n 2. There is a certain amount of \"could have been\" and conjecture in the second part of the resolution. \n 3. The resolution assumes that aids is an epidemic. This is critical to the resolution, so if either participant has trouble with the use of the term \"epidemic\", changes would have to be made.\n\n \n With the \"intentional' clause in the resolution, I'd take the negative position. emoticon_wow \n I would also want it US-specific, since that was my original contention.emoticon_xgood", 
   {}, 
   254833, 
   null, 
   1174251360.0
  ], 
  [
   291506, 
   null, 
   "ShadowPikachu", 
   "I asked Shadow to come up with a resolution that encompassed my original assertion. The keys were INITIAL SPREAD and the US. I'd be stupid to debate a resolution such as \"AIDS was spread exclusively by gays\" or similar. All that a decent debater would have to do is find a single exception and my claim is refuted. That's why I stated it the way I did. I don't want somebody taking an absolute resolution and using a single example to the contrary to defeat it.\n The reality is that the primary transmission of HIV in the US occurred via the homosexual community. I've yet to see ANY evidence from the apologists to dispute that, but they want to call me a bigot for making that factual assertion. So, I said to Shadow, put up or shut up. If my statement is in err, then debate me formally, where personal attacks and attempted subterfuge will be caught by the judges and exposed for what it is.\n\n \n I have considered this a long time now, and am willing to go back on my previous promise to not debate you, mainly due to recent changes.\n \n I would be willing to debate you on this on the new Formal Open Debate forum if you start a thread there. I stand by my statement that I do not have the time for a complete Formal Debate (with the deadlines, word limits, etc.), but I think the new Open Debate would be quite apt for this discussion (and for the schedule I keep), especially over the regular forum where ad homs, etc. are flung by both sides.\n \n So, if you would like to still debate this, take your time and then post a resolution post in the new Forum, and I'll respond when I can.", 
   {}, 
   254734, 
   null, 
   1196062200.0
  ], 
  [
   291515, 
   null, 
   "billsco", 
   "I have considered this a long time now, and am willing to go back on my previous promise to not debate you, mainly due to recent changes.\n \n I would be willing to debate you on this on the new Formal Open Debate forum if you start a thread there. I stand by my statement that I do not have the time for a complete Formal Debate (with the deadlines, word limits, etc.), but I think the new Open Debate would be quite apt for this discussion (and for the schedule I keep), especially over the regular forum where ad homs, etc. are flung by both sides.\n \n So, if you would like to still debate this, take your time and then post a resolution post in the new Forum, and I'll respond when I can.\n\n \n Please be aware that posting in the Open Debate Forum does not offer you exclusivity. All members are free to post to the thread. If you want a one on one debate with JP, the Formal Debate Room is the only choice.", 
   {}, 
   291506, 
   null, 
   1196083500.0
  ], 
  [
   291562, 
   null, 
   "ShadowPikachu", 
   "Please be aware that posting in the Open Debate Forum does not offer you exclusivity. All members are free to post to the thread. If you want a one on one debate with JP, the Formal Debate Room is the only choice.\n\n \n Ah, ok. Thanks for the heads up.\n \n I'd still be willing to do so, even if it involves more than a one on one debate in the Open Debate Forum. I merely do not have the kind of schedule to allow me to do a regular Formal Debate. I think it might even be more interesting if more people were involved on both sides.\n \n So, I guess it's up to JP now on whether or not he wants to debate there.", 
   {}, 
   291515, 
   null, 
   1196103000.0
  ], 
  [
   291566, 
   null, 
   "JPSartre12", 
   "Ah, ok. Thanks for the heads up.\n \n I'd still be willing to do so, even if it involves more than a one on one debate in the Open Debate Forum. I merely do not have the kind of schedule to allow me to do a regular Formal Debate. I think it might even be more interesting if more people were involved on both sides.\n \n So, I guess it's up to JP now on whether or not he wants to debate there.\n\n \n Here's the basic resolution that I proposed that you claimed wasn't true.\n \n \"the primary transmission of HIV in the US occurred via the homosexual community\"\n \n or alternately \"gays aren't responsible for the initial spread of AIDS in the US\" in which I would argue the negative.\n \n While you don't want to make this a formal debate, doing so would ensure that there would be no third party interference AND that ad hominum attacks wouldn't occur. I don't believe that an open forum debate guarantees either of these desirable characteristics. \n With you, I would consider a formal debate \"bloodsport\" and as such, I wouldn't want anyone else messing with MY kill. emoticon_xkill \n \n If you want to start a thread and make it an informal debate, I'll still participate, but my heart might not be in it (or your heart for that matter). ;)", 
   {}, 
   291562, 
   null, 
   1196107080.0
  ], 
  [
   291583, 
   null, 
   "billsco", 
   "The Open Forum Debate will guarantee no ad hominen attacks survive and that the topic stays focused only on the resolution.", 
   {}, 
   291566, 
   null, 
   1196116080.0
  ], 
  [
   291585, 
   null, 
   "jim's trucking", 
   "The Open Forum Debate will guarantee no ad hominen attacks survive and that the topic stays focused only on the resolution.\nAre we generating confusion with two names? The new forum is the Formal Open Debate forum. The Open Forum is not moderated...the Formal Open Debate forum is.", 
   {}, 
   291583, 
   null, 
   1196116500.0
  ], 
  [
   291641, 
   null, 
   "Peeling", 
   "And when we're done with this debate, I'd like to offer up another:\n \n \"Resolved: The second world war was catalysed primarily by people called Adolph\"", 
   {}, 
   291585, 
   null, 
   1196178900.0
  ], 
  [
   291654, 
   null, 
   "JPSartre12", 
   "And when we're done with this debate, I'd like to offer up another:\n \n \"Resolved: The second world war was catalysed primarily by people called Adolph\"\n\n \n I like that one. Maybe I'll take the negative and argue in favor of Hiro Hito's responsibility. ;)", 
   {}, 
   291641, 
   null, 
   1196194380.0
  ], 
  [
   291655, 
   null, 
   "JPSartre12", 
   "The Open Forum Debate will guarantee no ad hominen attacks survive and that the topic stays focused only on the resolution.\n\n \n I see, but it still isn't a mono y mono debate, so it's not a true bloodsport. ;)", 
   {}, 
   291583, 
   null, 
   1196194440.0
  ], 
  [
   291664, 
   null, 
   "jim's trucking", 
   "I see, but it still isn't a mono y mono debate, so it's not a true bloodsport. ;)\nIt is if you dedact all comments save yours and Shadow's. As to the character limits, time span between posts, and number of posts you two could comply with those voluntarily while other posters may choose not to.\n \n All posts in that forum are subject to moderation regarding ad hominem attacks and relevancy to the subject.", 
   {}, 
   291655, 
   null, 
   1196197860.0
  ], 
  [
   291723, 
   null, 
   "JPSartre12", 
   "It is if you dedact all comments save yours and Shadow's. As to the character limits, time span between posts, and number of posts you two could comply with those voluntarily while other posters may choose not to.\n \n All posts in that forum are subject to moderation regarding ad hominem attacks and relevancy to the subject.\n\n \n I prefer clean kills to death by a thousand cuts. In an open debate, it's like pirranha in a feeding frenzy. It's impossible to distinguish the victor from the mob. ;)", 
   {}, 
   291664, 
   null, 
   1196222280.0
  ], 
  [
   427433, 
   null, 
   "poet", 
   "I challenge ShadowPikachu to defend his assertion that gays aren't responsible for the initial spread of AIDS in the US.\n\n \n Oh, I completely agree....because, after all, the virus was, allegedly introduced to the gay population via \"Patient Zero\" (Gaetan Dugas) (still debateable) And the Band Played On - Wikipedia, the free encyclopedia, \n after Africans had been infected with tainted monkey blood, during polio trials ( whether intentionally or accidentally, remains to be seen), by French healthcare workers. \n Timeline of early AIDS cases - Wikipedia, the free encyclopedia\n \n Then the disease progressed, exponentially, into other populations, significantly via bi-sexual men, and intervenous drug users. \n I wouldn't go as far as to say that \"gays\" are responsible for the initial spread of HIV/AIDS, except within their own community. Bi-sexual men, who had unprotected sex with infected gays (Haitians, drug users), are responsible for the world wide pandemic. Contaminated blood supplies also contributed to AIDS cases...notably Arthur Ashe, the famed tennis star.", 
   {}, 
   254376, 
   null, 
   1302883260.0
  ], 
  [
   427441, 
   null, 
   "JPSartre12", 
   "Oh, I completely agree....because, after all, the virus was, allegedly introduced to the gay population via \"Patient Zero\" (Gaetan Dugas) (still debateable) And the Band Played On - Wikipedia, the free encyclopedia, \n after Africans had been infected with tainted monkey blood, during polio trials ( whether intentionally or accidentally, remains to be seen), by French healthcare workers. \n Timeline of early AIDS cases - Wikipedia, the free encyclopedia\n \n Then the disease progressed, exponentially, into other populations, significantly via bi-sexual men, and intervenous drug users. \n I wouldn't go as far as to say that \"gays\" are responsible for the initial spread of HIV/AIDS, except within their own community. Bi-sexual men, who had unprotected sex with infected gays (Haitians, drug users), are responsible for the world wide pandemic. Contaminated blood supplies also contributed to AIDS cases...notably Arthur Ashe, the famed tennis star.\n\n \n Does that mean that you'd like to debate the original resolution? If so, I can certainly make it happen. \n If you feel froggy, leap. emoticon_xgood", 
   {}, 
   427433, 
   null, 
   1302888060.0
  ], 
  [
   427450, 
   null, 
   "JPSartre12", 
   "What? Only to have you delete my contribution at your discretion?\n You've shown that you're not serious about debating. The only thing you're capable of is \"grandstanding\". And here, you have a rapt audience. \n Deleted. Ciao.\n\n \n This is a debate challenge forum. If you're only interest is in harassing me, I will delete your posts. If you want to take a chance that you can match intellect with me in a formal debate, I will guarantee you that I won't edit a thing. I'll let the full bouquet of your BS fill the air. emoticon_xgood\n \n Oh, and I will remove references to other forums. This isn't a forum for your personal playground for outside grudges.", 
   {}, 
   427441, 
   null, 
   1302891900.0
  ], 
  [
   427457, 
   null, 
   "JPSartre12", 
   "emoticon_cryemoticon_cryemoticon_cryemoticon_cry...already done.\n\n \n Does that mean that you accept my challenge to formally debate? emoticon_xgood", 
   {}, 
   427450, 
   null, 
   1302894120.0
  ], 
  [
   427490, 
   null, 
   "poet", 
   "Does that mean that you accept my challenge to formally debate? emoticon_xgood\n\n \n No. So, go ahead and claim pyrrhic victory...I wouldn't give you the satisfaction. You'd never admit to defeat, in any event. It isn't in you. \n Challenge your son.", 
   {}, 
   427457, 
   null, 
   1302914820.0
  ], 
  [
   427496, 
   null, 
   "JPSartre12", 
   "No. So, go ahead and claim pyrrhic victory...I wouldn't give you the satisfaction. You'd never admit to defeat, in any event. It isn't in you. Challenge your son.\n\n \n That's not the way we do it here. We pick judges that are acceptable to both parties prior to starting a debate. But I can understand your reluctance ti actually have to cash the check that your mouth is writing. \n Stripped of personal attacks, vacuous arguments are quickly exposed for what they are.", 
   {}, 
   427490, 
   null, 
   1302922620.0
  ], 
  [
   427497, 
   null, 
   "poet", 
   "That's not the way we do it here. We pick judges that are acceptable to both parties prior to starting a debate. But I can understand your reluctance ti actually have to cash the check that your mouth is writing. \n Stripped of personal attacks, vacuous arguments are quickly exposed for what they are.\n\n \n The only thing vacuous is your head. F picking any white racist judges....you hold the cards. And I don't trust you as far as I could throw you. \n Your mouth wrote a check your behind couldn't cash...and now you're all \"perils of Pauline\". Admit it. I bested you. Again.", 
   {}, 
   427496, 
   null, 
   1302924360.0
  ], 
  [
   427514, 
   null, 
   "admin", 
   "I have removed moderation power from JPSartre12.\n I have decided that moderators should not be involved in the debates.\n admin", 
   {
    "post_info": {
     "post_title": "moderator"
    }
   }, 
   254542, 
   null, 
   1302963060.0
  ], 
  [
   427574, 
   null, 
   "JPSartre12", 
   "I have removed moderation power from JPSartre12.\n I have decided that moderators should not be involved in the debates.\n admin\n\n \n There you go Poet. I'm no longer a moderator, so now you have no excuse to duck me other than your fear of being shown as a fraud. Let's see that \"intellect\" in action. So far, all I've seen is your ability to bait and troll.\n Surely the decendant of a Hollywood star, who was that again, Rastus?, should be able to mop the floor with me. emoticon_xchicken\n \n So, \"what up wit dat?\"\n http://www.youtube.com/watch?v=VczETynS6AM", 
   {}, 
   427514, 
   null, 
   1303004400.0
  ], 
  [
   427584, 
   null, 
   "poet", 
   "There you go Poet. I'm no longer a moderator, so now you have no excuse to duck me other than your fear of being shown as a fraud. Let's see that \"intellect\" in action. So far, all I've seen is your ability to bait and troll.\n Surely the decendant of a Hollywood star, who was that again, Rastus?, should be able to mop the floor with me. emoticon_xchicken\n \n So, \"what up wit dat?\"\n YouTube - Saturday Night Live - What Up With That (with Joseph Gordon-Levitt and Al Gore)\n\n \n Oh, don't thank me. I'm such an advocate for \"personal responsibility\", that you appear foolish trying to play the \"consummate victim\". I have no need to prove my intellectual prowess. The mere fact that I'm here, and holding my own against intellectual \"lightweights\", can be \"spun\" into \"baiting and trolling\". \n And look! More racist humor from you. Rastus? Who is that? \n I have \"cousins\" who are household names, the world over..not just the States. But rather than you being able to skewer them through me, simply won't happen. I won't allow it. I don't need their notoriety to deal with you. I'm formidable on my own, as I have shown. Jealousy and envy are traits unbecoming to men...but who said....you know? I'm still getting kudos for the way I handled you at the other place. Revenge is a dish best served \"cold\".", 
   {}, 
   427574, 
   null, 
   1303028040.0
  ], 
  [
   427592, 
   null, 
   "JPSartre12", 
   "Oh, don't thank me. I'm such an advocate for \"personal responsibility\", that you appear foolish trying to play the \"consummate victim\". I have no need to prove my intellectual prowess. The mere fact that I'm here, and holding my own against intellectual \"lightweights\", can be \"spun\" into \"baiting and trolling\". \n And look! More racist humor from you. Rastus? Who is that? \n\n \n Holding your own? You're quaking in your loafers at the thought of actually engaging in a real debate. You're great at walking the fine line between being banned and not while you bait others, but that's the extent of your skills. \n \n \n\n I have \"cousins\" who are household names, the world over..not just the States. But rather than you being able to skewer them through me, simply won't happen. I won't allow it. I don't need their notoriety to deal with you.\n\n \n Sure you don't. That's why you mentioned them several times. I think it's all BS without naming names. \n \n \n\n I'm formidable on my own, as I have shown. Jealousy and envy are traits unbecoming to men...but who said....you know? I'm still getting kudos for the way I handled you at the other place. Revenge is a dish best served \"cold\".\n\n \n If you really believed that you were \"formidable\", you'd jump at the chance to make me look bad in a formal debbate. You're mouth is writing checks your mind can't cash. \n And this has nothing to do with revenge, I want to expose you for the lightweight that you really are. The fraud is being perpetuated by YOU. \n So \"man up\" if you can, and take me up on my challenge or slither back under your rock.", 
   {}, 
   427584, 
   null, 
   1303057800.0
  ], 
  [
   427593, 
   null, 
   "poet", 
   "Holding your own? You're quaking in your loafers at the thought of actually engaging in a real debate. You're great at walking the fine line between being banned and not while you bait others, but that's the extent of your skills. \n \n Oh, please. You're itching to take me on in a debate, so you can try to save face from the a** whooping I've given you, here and \"there\". I'm reminded of Marlon Brando's quote from \"On the Waterfront\"...\"I coulda been a contender\" (if the fight hadn't been fixed). Sad and pathetic. \n \n Sure you don't. That's why you mentioned them several times. I think it's all BS without naming names. \n \n And oh please again. I could tell you and you'd swear I was lying. I tell you what. They have won Emmys and Tonys and Golden Globes. And their name is not \"Rastus\". I haven't lied to this point...why would I start now?\n If you really believed that you were \"formidable\", you'd jump at the chance to make me look bad in a formal debbate. You're mouth is writing checks your mind can't cash. \n And this has nothing to do with revenge, I want to expose you for the lightweight that you really are. The fraud is being perpetuated by YOU. \n So \"man up\" if you can, and take me up on my challenge or slither back under your rock.\n\n \n I don't have to. Reasonable doubt affords me all the leverage I require. \n So much for your accusations of \" minority entitlement mentality\". You've been exposed as a racist and a bigot. Try to recover from that. \n Funny, you keep responding to my posts....puppet on a string.", 
   {}, 
   427592, 
   null, 
   1303059960.0
  ], 
  [
   427597, 
   null, 
   "JPSartre12", 
   "\n Oh, please. You're itching to take me on in a debate, so you can try to save face from the a** whooping I've given you, here and \"there\". I'm reminded of Marlon Brando's quote from \"On the Waterfront\"...\"I coulda been a contender\" (if the fight hadn't been fixed). Sad and pathetic. \n \n\n \n Like I said, you're afraid of a formal debate because it removes your only weapon, personal attacks. \n Since you lack the intellect to debate facts, I'd be fighting an unarmed opponent. \n And you don't have to worry about being a contender, because you're too scared to step into the ring.emoticon_xchicken\n \n\n And oh please again. I could tell you and you'd swear I was lying. I tell you what. They have won Emmys and Tonys and Golden Globes. And their name is not \"Rastus\". I haven't lied to this point...why would I start now?\n\n Of course you're lying. You've provided no facts to back up any of your claims.\n I could tell you that I was related to Queen Elizabeth, but without any proof, it's just hot air.\n \n \n\n I don't have to. Reasonable doubt affords me all the leverage I require. \n So much for your accusations of \" minority entitlement mentality\". You've been exposed as a racist and a bigot. Try to recover from that. \n Funny, you keep responding to my posts....puppet on a string.\n\n \n What \"reasonable doubt'? There's no doubt that you're afraid to debate me. That's clear for all to see. In a fair contest, you're affirmative action mentality is useless. You aren't given any advantage because you're black in a debate. No extra points for being black, like when you applied for college. No pressure on the white fraternity that accepted you as a pledgee. No extra consideration as you got when you went for a job interview. No favorable treatment like when you applied for a mortgage. The list goes on and on. \n It's just you and me, a fair contest, not one stacked in your favor. \n And you fold like a house of cards at the prospect of an even contest because you've never had to experience it. You've never had to depend on just yourself.", 
   {}, 
   427593, 
   null, 
   1303065360.0
  ], 
  [
   427649, 
   null, 
   "poet", 
   "Like I said, you're afraid of a formal debate because it removes your only weapon, personal attacks. \n Since you lack the intellect to debate facts, I'd be fighting an unarmed opponent. \n And you don't have to worry about being a contender, because you're too scared to step into the ring.emoticon_xchicken\n \n \n Delusion. Smoke and mirrors. \n Of course you're lying. You've provided no facts to back up any of your claims.\n I could tell you that I was related to Queen Elizabeth, but without any proof, it's just hot air.\n \n And you know this how? I have the info posted on my facebook and myspace pages. I have pictures which back my claim. But what matter? Who are you that I should have to prove myself to you, on any level, about anything. You are no one. You touted the achievements of your son. How do we know you weren't lying about that, as well as everything else, including your alleged \"140 I.Q.\"? Bottom line, is no one cares. No one cares that I'm related to show biz bigwigs. No one cares that your son did a damn thing in school or any place else. This is just a political debate forum, and you can't debate, but only insinuate on a racist and bigoted frame of reference. And you are chomping at the bit, to get me to debate with you...except you're not honorable nor an honest debater...so, \"denied\". \n \n What \"reasonable doubt'? There's no doubt that you're afraid to debate me. That's clear for all to see. In a fair contest, you're affirmative action mentality is useless. You aren't given any advantage because you're black in a debate. No extra points for being black, like when you applied for college. No pressure on the white fraternity that accepted you as a pledgee. No extra consideration as you got when you went for a job interview. No favorable treatment like when you applied for a mortgage. The list goes on and on. \n It's just you and me, a fair contest, not one stacked in your favor. \n And you fold like a house of cards at the prospect of an even contest because you've never had to experience it. You've never had to depend on just yourself.\n\n \n More stereotypical drama from the usual suspect. I don't expect any advantage or privileges for being black. I can debate on the merits, without resorting to stereotype. Can you? No, you cannot. \n I was begged by the fraternity members to join their fraternity. I'm sorry if that doesn't fit your model of reality. It happened. Don't hate me because I'm beautiful. \n I placed in the Greater Houston Science Fair 1970, which caught the attention of the head of pulmonary, Baylor College of Medicine, who offered me an entry level position, which I held for 14 years. Don't hate. \n Some black people are as qualified or moreso, than any white person. Fact. \n Get into some acceptance. Or not. \n What I am enjoying is you \"twisting in the wind\" at the chance to debate me. \n I ain't doing it. Not because I'm afraid of losing...but because I will not give you the opportunity to redeem yourself in the eyes of this forum. Period. Now move around. ", 
   {}, 
   427597, 
   null, 
   1303105500.0
  ], 
  [
   427664, 
   null, 
   "daewoo", 
   "More stereotypical drama from the usual suspect. I don't expect any advantage or privileges for being black. I can debate on the merits, without resorting to stereotype. Can you? No, you cannot. \n I was begged by the fraternity members to join their fraternity. I'm sorry if that doesn't fit your model of reality. It happened. Don't hate me because I'm beautiful. \n I placed in the Greater Houston Science Fair 1970, which caught the attention of the head of pulmonary, Baylor College of Medicine, who offered me an entry level position, which I held for 14 years. Don't hate. \n Some black people are as qualified or moreso, than any white person. Fact. \n Get into some acceptance. Or not. \n What I am enjoying is you \"twisting in the wind\" at the chance to debate me. \n I ain't doing it. Not because I'm afraid of losing...but because I will not give you the opportunity to redeem yourself in the eyes of this forum. Period. Now move around. \n\n \n ROTFLMAO. Redeem himself in the eyes of this forum???\n \n JP has been posting here for years. He has thousands of posts....posts with substance...posts that actually make SENSE and have CONTENT.\n \n You, on the other hand, seem to be a mentally ill internet stalker. Thus far all you have done since your arrival is post nonsensical personal attacks. As far as I can tell you are nothing but a nuisance who is completely uninterested in furthering reasonable debate. \n \n It is not JP who needs to be redeemed in the eyes of this forum.", 
   {}, 
   427649, 
   null, 
   1303134660.0
  ], 
  [
   427669, 
   null, 
   "poet", 
   "ROTFLMAO. Redeem himself in the eyes of this forum???\n \n JP has been posting here for years. He has thousands of posts....posts with substance...posts that actually make SENSE and have CONTENT.\n \n You, on the other hand, seem to be a mentally ill internet stalker. Thus far all you have done since your arrival is post nonsensical personal attacks. As far as I can tell you are nothing but a nuisance who is completely uninterested in furthering reasonable debate. \n \n It is not JP who needs to be redeemed in the eyes of this forum.\n\n \n Really? How nice. You see, I didn't know JP, until fairly recently, when I had the misfortune to encounter him, in another forum. He presented his racist and bigoted POV, and of course, I handed him his head on a platter. He freaked, and our little tete a tete got us both restricted. He violated the TOS, by creating a sok, was banned. I got a warning. I merely followed him here to inform him of the outcome and to gloat, as I wasn't about to let him get away thinking he had won on some level. \n I'm not mentally ill, and I'm not a stalker. I just don't take to folks throwing \"white privilege\" and stereotyping me. I'm not your typical black, gay liberal. I'm an uppity n-word, just like Barack Obama. And I don't give a rat's booty. And debate is civilized discourse. Not one frequented by \"low blows\", insults, pejorative inferences, or hyperbole. You'd have to bring some reasonable debate to get some. And I haven't seen evidence of such, as of yet.", 
   {}, 
   427664, 
   null, 
   1303138740.0
  ], 
  [
   427671, 
   null, 
   "gansao", 
   "Really? How nice. You see, I didn't know JP, until fairly recently, when I had the misfortune to encounter him, in another forum. He presented his racist and bigoted POV, and of course, I handed him his head on a platter. He freaked, and our little tete a tete got us both restricted. He violated the TOS, by creating a sok, was banned. I got a warning. I merely followed him here to inform him of the outcome and to gloat, as I wasn't about to let him get away thinking he had won on some level. \n I'm not mentally ill, and I'm not a stalker. I just don't take to folks throwing \"white privilege\" and stereotyping me. I'm not your typical black, gay liberal. I'm an uppity n-word, just like Barack Obama. And I don't give a rat's booty. And debate is civilized discourse. Not one frequented by \"low blows\", insults, pejorative inferences, or hyperbole. You'd have to bring some reasonable debate to get some. And I haven't seen evidence of such, as of yet.\n\n \n We need some people who can debate fairly without insults or hyperbole on this forum.\n Unfortunately it doesnt seem that you are one of them", 
   {}, 
   427669, 
   null, 
   1303139460.0
  ], 
  [
   427674, 
   null, 
   "poet", 
   "We need some people who can debate fairly without insults or hyperbole on this forum.\n Unfortunately it doesnt seem that you are one of them\n\n \n On the contrary...on other forums, my praises are sung \"daily\", for exercising restraint, intellect, insight, and enlightenment. I can't help it if you're so caught up in the vapors of JP, that you can't see the charlatan that he is, the drum major for \"white \"pseudo-Christian\" conservative men.\n I have not debated yet, as it seems there is no one, other than JP, to debate with. If you'd put away your \"steely knives\", and wipe the froth away from your mouths, one might feel open to civilized debate. I've only been flashing my credentials. And I don't think we've been formally introduced. \n Who the hell are you?", 
   {}, 
   427671, 
   null, 
   1303141920.0
  ], 
  [
   427678, 
   null, 
   "JPSartre12", 
   "We need some people who can debate fairly without insults or hyperbole on this forum.\n Unfortunately it doesnt seem that you are one of them\n\n \n I see you've met my stalker. Lovely soul, isn't s/he? ;)", 
   {}, 
   427671, 
   null, 
   1303142700.0
  ], 
  [
   427681, 
   null, 
   "gansao", 
   "I see you've met my stalker. Lovely soul, isn't s/he? ;)\n\n \n A gay black intellectual high flyer coming from a close family of high flying and famous individuals would be an asset to this forum.\n However a gay black delusional psuedo intellectual who claims he is a high flyer would only be another of many individuals that claimed they were superior people simply because they said they were.\n I would like to see some of his beautiful mind rather than see his bragging.", 
   {}, 
   427678, 
   null, 
   1303143240.0
  ], 
  [
   427683, 
   null, 
   "JPSartre12", 
   "A gay black intellectual high flyer coming from a close family of high flying and famous individuals would be an asset to this forum.\n However a gay black delusional psuedo intellectual who claims he is a high flyer would only be another of many individuals that claimed they were superior people simply because they said they were.\n I would like to see some of his beautiful mind rather than see his bragging.\n\n \n In that case, don't hold your breath. ;)", 
   {}, 
   427681, 
   null, 
   1303143960.0
  ], 
  [
   427684, 
   null, 
   "gansao", 
   "In that case, don't hold your breath. ;)\n\n \n I think you could be right.", 
   {}, 
   427683, 
   null, 
   1303144440.0
  ], 
  [
   427686, 
   null, 
   "Steeeeve", 
   "I merely followed him here to inform him of the outcome and to gloat, as I wasn't about to let him get away thinking he had won on some level. I'm not mentally ill, and I'm not a stalker. \nDid you read your own post? Perhaps you should admit to being mentally ill because at least that's not your own fault. \n \n This is just creepy.", 
   {}, 
   427669, 
   null, 
   1303146480.0
  ], 
  [
   427690, 
   null, 
   "JPSartre12", 
   "Did you read your own post? Perhaps you should admit to being mentally ill because at least that's not your own fault. \n \n This is just creepy.\n\n \n He has a persecution complex. He thinks that every intelligent white male is out to put chains on him and make him sing Gospel songs. ;)", 
   {}, 
   427686, 
   null, 
   1303147560.0
  ], 
  [
   427691, 
   null, 
   "poet", 
   "Did you read your own post? Perhaps you should admit to being mentally ill because at least that's not your own fault. \n \n This is just creepy.\n\n \n Think so? You should have read his \"creepy\" racist and bigoted rhetoric at the other forum. Then you would understand better my purpose. Notice how you guys are banding together, to stick up for one of your own, not knowing how despicable he is or could be. Benefit of the doubt? Naaah. I'm black and gay, and obviously \"undeserving\".", 
   {}, 
   427686, 
   null, 
   1303147680.0
  ], 
  [
   427692, 
   null, 
   "poet", 
   "He has a persecution complex. He thinks that every intelligent white male is out to put chains on him and make him sing Gospel songs. ;)\n\n \n Oh, no darling...I have no persecution complex. That is you \"projecting\". You have the need to \"persecute\", no doubt, due to feelings of inadequacy. Hence, you mentioning you possess an I.Q., well above average.....140, no less. Funny, but your commentary and rhetoric flies in the face of that bogus claim. I haven't found too many intellligent white males to begin with. They seem to equate intelligence with the ability to write their names in the snow with urine. \n And if your level of intelligence is to be measured by your last sentence, then you're in the whole worlds of trouble I said you were in....not making any sense, nor being funny. \n What is it with you and \"gospel songs/spirituals\"? Is that supposed to be another of your black stereotypes? I grew up Episcopalian, and sang liturgical music 6 days out of 7 for 3 years, in a boys choir school, based on the English tradition. Atypical.", 
   {}, 
   427690, 
   null, 
   1303148100.0
  ], 
  [
   427694, 
   null, 
   "poet", 
   "A gay black intellectual high flyer coming from a close family of high flying and famous individuals would be an asset to this forum.\n However a gay black delusional psuedo intellectual who claims he is a high flyer would only be another of many individuals that claimed they were superior people simply because they said they were.\n I would like to see some of his beautiful mind rather than see his bragging.\n\n \n Start a dialogue. That is, if you're capable and willing.", 
   {}, 
   427681, 
   null, 
   1303148220.0
  ], 
  [
   427697, 
   null, 
   "Steeeeve", 
   "Think so?\nYes, I do.\n \n \nNotice how you guys are banding together, to stick up for one of your own, not knowing how despicable he is or could be.\nDon't worry about JP. The fact that you follow him around and keep bringing him up is creepy and makes you look like a lunatic. JP could have said the most racist thing imaginable and that would not change the fact that these last few posts by you are absolutely nuts.", 
   {}, 
   427691, 
   null, 
   1303148580.0
  ], 
  [
   427698, 
   null, 
   "poet", 
   "Yes, I do.\n \n Don't worry about JP. The fact that you follow him around and keep bringing him up is creepy and makes you look like a lunatic. JP could have said the most racist thing imaginable and that would not change the fact that these last few posts by you are absolutely nuts.\n\n \n I take great comfort in the fact that you take his side. Were I not the confident, and uppity negro that I am, I would have easily crumbled, heartbroken, that you didn't like me. I actually give a rat's booty.\n \n And I find it interesting, all this talk about my bragging, my intelligent mind (or the rumor of it), and no one outside of JP, has even brought up a topic to debate or even civil discourse. What is it? Fear of a black penis?", 
   {}, 
   427697, 
   null, 
   1303148940.0
  ], 
  [
   427699, 
   null, 
   "Steeeeve", 
   "I take great comfort \nI couldn't be happier! Congratulations. \n \n \n and no one outside of JP, has even brought up a topic to debate or even civil discourse.\nis it not clear? We are debating your sanity, or lack thereof.", 
   {}, 
   427698, 
   null, 
   1303149660.0
  ], 
  [
   427701, 
   null, 
   "poet", 
   "I couldn't be happier! Congratulations. \n \n is it not clear? We are debating your sanity, or lack thereof.\n\n \n You're either ignorant or stupid, or a legend in your own mind.\n It's clear you have no idea what debate is. All you have done is echo JP's sentiments (having no original thoughts of your own), and resorted to ad hominem attacks. I'm unfazed.", 
   {}, 
   427699, 
   null, 
   1303149960.0
  ], 
  [
   427708, 
   null, 
   "gansao", 
   "Start a dialogue. That is, if you're capable and willing.\n\n \n I think Aristotle golden mean is relevant to all of the social issues in the modern world.\n \n I also think that you are a twat.\n Choose one of these topics.", 
   {}, 
   427694, 
   null, 
   1303151100.0
  ], 
  [
   427710, 
   null, 
   "Steeeeve", 
   "You're either ignorant or stupid, or a legend...\nI'll go with legend.", 
   {}, 
   427701, 
   null, 
   1303151580.0
  ], 
  [
   427712, 
   null, 
   "JPSartre12", 
   "S/he's a drama queen guys. S/he's eating up the attention. Now grind on the organ and watch the monkey dance some more. ;)", 
   {}, 
   427710, 
   null, 
   1303151880.0
  ], 
  [
   427713, 
   null, 
   "poet", 
   "I think Aristotle golden mean is relevant to all of the social issues in the modern world.\n \n I also think that you are a twat.\n Choose one of these topics.\n\n \n Hmmm. Let's see. Do I engage someone who has no knowledge of the possessive case (i.e. Aristotle's golden mean....or laugh, because I intimidate?\n \n \n Since I am a history buff, and studied philosophy, I'll cut you a break.\n \n I choose: You think I'm a twat\n \n Define twat. And how I'm one.", 
   {}, 
   427708, 
   null, 
   1303152000.0
  ], 
  [
   427714, 
   null, 
   "gansao", 
   "S/he's a drama queen guys. S/he's eating up the attention. Now grind on the organ and watch the monkey dance some more. ;)\n\n \n Im beginning to like him.;)", 
   {}, 
   427712, 
   null, 
   1303152000.0
  ], 
  [
   427715, 
   null, 
   "poet", 
   "S/he's a drama queen guys. S/he's eating up the attention. Now grind on the organ and watch the monkey dance some more. ;)\n\n \n She? Uh, you don't know me like that, Miss Thing. You're the one with more pudenda than the Pointer Sisters. And I'm not eating any attention. I'm mildly amused. I haven't seen any evidence of your reputed prowess here. And why don't you ask the real monkey to dance? Somebody at home.", 
   {}, 
   427712, 
   null, 
   1303152180.0
  ], 
  [
   427721, 
   null, 
   "gansao", 
   "Hmmm. Let's see. Do I engage someone who has no knowledge of the possessive case (i.e. Aristotle's golden mean....or laugh, because I intimidate?\n \n \n Since I am a history buff, and studied philosophy, I'll cut you a break.\n \n I choose: You think I'm a twat\n \n Define twat. And how I'm one.\n\n I find your discrimination against dyslexics quite nauseating.\n \n Twat... A derogatory term for a person whose behaviour is considered to be extremely or intolerably ignorant, obnoxious, offensive or moronic.\n \n The possesive case has nothing to do with the Golden mean but your remarks have shown that your are in fact a twat..thanks\n \n Also agreeing to debate where you try to disprove that I THINK you are a twat is proof of your twatness.\n Shut the door on the way out", 
   {}, 
   427713, 
   null, 
   1303153980.0
  ], 
  [
   427722, 
   null, 
   "JPSartre12", 
   "Im beginning to like him.;)\n\n \n Yeah, he grows on you........like a cancerous tumor. ;)\n \n \nShe? Uh, you don't know me like that, Miss Thing. You're the one with more pudenda than the Pointer Sisters. And I'm not eating any attention. I'm mildly amused. I haven't seen any evidence of your reputed prowess here. \n\n \n Then you're not nearly as observant as I thought. Look around.....You're in the right forum already. ;)\n \n \n\n And why don't you ask the real monkey to dance? Somebody at home.\n\n \n I believe I did. Now, I'm going to crank the handle one more time, so give it your all this time. ;)", 
   {}, 
   427715, 
   null, 
   1303154460.0
  ], 
  [
   427725, 
   null, 
   "poet", 
   "I find your discrimination against dyslexics quite nauseating.\n \n Twat... A derogatory term for a person whose behaviour is considered to be extremely or intolerably ignorant, obnoxious, offensive or moronic.\n \n The possesive case has nothing to do with the Golden mean but your remarks have shown that your are in fact a twat..thanks\n \n Also agreeing to debate where you try to disprove that I THINK you are a twat is proof of your twatness.\n Shut the door on the way out\n\n \n Really? And I find your dismissal of me and charges of saboteur equally nauseating.\n \n Twat, I'll have you know is a vulgar term for vagina. You knew that, though, and revealing yourself to be dishonest as well as insulting. \n \n The grammatically incorrect phrase, \"Aristotle golden mean\", I corrected to \"Aristotle's golden mean\". https://teach.lanecc.edu/lugenbehld/201/handouts/Golden%20Mean.htm\n Aristotle lived in Greece (384-322 BC). In his book Nicomachaean Ethics, he outlines what he also calls \"the doctrine of the mean.\" What he has to say here is very similar in many ways to the views of Confucius, and he develops at length how this doctrine applies to determining what course of action is right in a number of different situations.\n \n So it's not Napoleon's golden mean, or Confucius's golden mean, but Aristotle's. \n \n Thus, I have exposed you as a charlatan and a rookie, without the intelligence necessary to engage me in intellectual discourse, much less, \"constructive debate\". Next. ", 
   {}, 
   427721, 
   null, 
   1303158420.0
  ], 
  [
   427726, 
   null, 
   "poet", 
   "Yeah, he grows on you........like a cancerous tumor. ;)\n \n \n \n Then you're not nearly as observant as I thought. Look around.....You're in the right forum already. ;)\n \n \n \n I believe I did. Now, I'm going to crank the handle one more time, so give it your all this time. ;)\n\n \n I meant \"your son\". Are you going to get your panties all in a wad again, or follow through on your threat?", 
   {}, 
   427722, 
   null, 
   1303158480.0
  ], 
  [
   427729, 
   null, 
   "gansao", 
   "Really? And I find your dismissal of me and charges of saboteur equally nauseating.\n \n Twat, I'll have you know is a vulgar term for vagina. You knew that, though, and revealing yourself to be dishonest as well as insulting. \n \n The grammatically incorrect phrase, \"Aristotle golden mean\", I corrected to \"Aristotle's golden mean\". https://teach.lanecc.edu/lugenbehld/201/handouts/Golden%20Mean.htm\n Aristotle lived in Greece (384-322 BC). In his book Nicomachaean Ethics, he outlines what he also calls \"the doctrine of the mean.\" What he has to say here is very similar in many ways to the views of Confucius, and he develops at length how this doctrine applies to determining what course of action is right in a number of different situations.\n \n So it's not Napoleon's golden mean, or Confucius's golden mean, but Aristotle's. \n \n Thus, I have exposed you as a charlatan and a rookie, without the intelligence necessary to engage me in intellectual discourse, much less, \"constructive debate\". Next. \n\n \n I hate bad losersemoticon_xchicken\n Aristotle lived in Greece?Who would have known?\n I see you went to the university of wiki.\n The twat seems to fitemoticon_xbye", 
   {}, 
   427725, 
   null, 
   1303158900.0
  ], 
  [
   427732, 
   null, 
   "gansao", 
   "The intellectual giant known as Poet lost a debate in one post because he did not check to see what he was debating.\n No wonder JP kicked his arse on the other forum.\n Easiest one yetemoticon_xbouncer", 
   {}, 
   427729, 
   null, 
   1303159680.0
  ], 
  [
   427733, 
   null, 
   "JPSartre12", 
   "I meant \"your son\". Are you going to get your panties all in a wad again, or follow through on your threat?\n\n \n Nice attempt to push my buttons, but I'll let you in on a little secret. My son is 26 and would eat you alive if you ever started any XXXX with him. He hangs out in racing forums coaxing street racers to run for $500 a pop. \n \n Now, come on, the music's playing \"Pop goes the weasel\". Time for you to perform. ;)", 
   {}, 
   427726, 
   null, 
   1303159920.0
  ], 
  [
   427734, 
   null, 
   "JPSartre12", 
   "The intellectual giant known as Poet lost a debate in one post because he did not check to see what he was debating.\n No wonder JP kicked his arse on the other forum.\n Easiest one yetemoticon_xbouncer\n\n \n See what I mean. He's a legend in his own mind. Rattle his cage again. I'm sure we can get him to do another trick. emoticon_xagree", 
   {}, 
   427732, 
   null, 
   1303160100.0
  ], 
  [
   427735, 
   null, 
   "gansao", 
   "He seems a bitchy one, that Poet!", 
   {}, 
   427733, 
   null, 
   1303160100.0
  ], 
  [
   427736, 
   null, 
   "JPSartre12", 
   "He seems a bitchy one, that Poet!\n\n \n Maybe his boyfriend's out of town. ;)", 
   {}, 
   427735, 
   null, 
   1303160160.0
  ], 
  [
   427737, 
   null, 
   "gansao", 
   "See what I mean. He's a legend in his own mind. Rattle his cage again. I'm sure we can get him to do another trick. emoticon_xagree\n\n \n I may get him to be my spelling and grammar bitch;)", 
   {}, 
   427734, 
   null, 
   1303160160.0
  ], 
  [
   427738, 
   null, 
   "gansao", 
   "Maybe his boyfriend's out of town. ;)\n\n \n Without a backward look , if he has any sense:p", 
   {}, 
   427736, 
   null, 
   1303160220.0
  ], 
  [
   427740, 
   null, 
   "poet", 
   "I hate bad losersemoticon_xchicken\n Aristotle lived in Greece?Who would have known?\n I see you went to the university of wiki.\n The twat seems to fitemoticon_xbye\n\n \n I didn't utilize wiki. I had to be clear what the golden mean meant. \n And don't mind me....you and JP can continue your little 69 action, to your hearts' content. Same thing happened at the other place...a lot of self-indulgence and back slapping. When you have to keep telling yourself that you've won....you, in fact, haven't. \n You didn't properly engage a debate on \"the golden mean\". I mean, the sky is blue.....debate that. Idiocy. \n You white people slay me. LOL", 
   {}, 
   427729, 
   null, 
   1303161060.0
  ], 
  [
   427741, 
   null, 
   "gansao", 
   "I didn't utilize wiki. I had to be clear what the golden mean meant. \n And don't mind me....you and JP can continue your little 69 action, to your hearts' content. Same thing happened at the other place...a lot of self-indulgence and back slapping. When you have to keep telling yourself that you've won....you, in fact, haven't. \n You didn't properly engage a debate on \"the golden mean\". I mean, the sky is blue.....debate that. Idiocy. \n You white people slay me. LOL\n\n \n You rejected the golden mean debate and chose the twat one...dont try to wriggle out of it.\n I gave you the choice between a meaningful debate and an idiotic one.\n Guess which one the mighty intellectual one chose?\n Have you always been racist?\n Did they laugh at you on the other forum too?", 
   {}, 
   427740, 
   null, 
   1303161600.0
  ], 
  [
   427742, 
   null, 
   "gansao", 
   "Hmmm. Let's see. Do I engage someone who has no knowledge of the possessive case (i.e. Aristotle's golden mean....or laugh, because I intimidate?\n \n \n Since I am a history buff, and studied philosophy, I'll cut you a break.\n \n I choose: You think I'm a twat\n \n Define twat. And how I'm one.\n\n \n What a twatemoticon_xchicken", 
   {}, 
   427713, 
   null, 
   1303161720.0
  ], 
  [
   427743, 
   null, 
   "poet", 
   "You rejected the golden mean debate and chose the twat one...dont try to wriggle out of it.\n I gave you the choice between a meaningful debate and an idiotic one.\n Guess which one the mighty intellectual one chose?\n Have you always been racist?\n Did they laugh at you on the other forum too?\n\n \n Who's wriggling. I asked you to define twat and you came up with your version of what it meant. I corrected you, and called you out. \n You failed to illustrate how I was one or like one. \n Racist? Because I'm pointing out your ambush of me, 2 (or 3) on 1, white vs. black, straight vs. gay, conservatards vs. liberal? \n Don't feign superiority based on you being white and there would be no need for me to bring up race. Alas, you can't do it. You'd have no more arrows in your quiver. Notions of white privilege minus relative intelligence is all you have.", 
   {}, 
   427741, 
   null, 
   1303161900.0
  ], 
  [
   427744, 
   null, 
   "poet", 
   "What a twatemoticon_xchicken\n\n \n Stumped, eh? I understand.", 
   {}, 
   427742, 
   null, 
   1303161960.0
  ], 
  [
   427745, 
   null, 
   "JPSartre12", 
   "You rejected the golden mean debate and chose the twat one...dont try to wriggle out of it.\n I gave you the choice between a meaningful debate and an idiotic one.\n Guess which one the mighty intellectual one chose?\n Have you always been racist?\n Did they laugh at you on the other forum too?\n\n \n Yes, he was laughed at on that forum as well. I guess I laughed a little too hard at his expense and got booted, though. He still thinks that it was his doing and not mine.\n I got bored there arguing with XXXXXX and decided to come back \"home\". I like to practice a scorched earth policy so I'm not as tempted to return there again. I'm sure the admin there removed my final missive long before poet would have seen it. ;)", 
   {}, 
   427741, 
   null, 
   1303161960.0
  ], 
  [
   427746, 
   null, 
   "JPSartre12", 
   "Who's wriggling. I asked you to define twat and you came up with your version of what it meant. I corrected you, and called you out. \n You failed to illustrate how I was one or like one. \n Racist? Because I'm pointing out your ambush of me, 2 (or 3) on 1, white vs. black, straight vs. gay, conservatards vs. liberal? \n Don't feign superiority based on you being white and there would be no need for me to bring up race. Alas, you can't do it. You'd have no more arrows in your quiver. Notions of white privilege minus relative intelligence is all you have.\n\n \n Everybody now! \n \"Nobody knows the trouble I've seen........\"", 
   {}, 
   427743, 
   null, 
   1303162080.0
  ], 
  [
   427747, 
   null, 
   "poet", 
   "Yes, he was laughed at on that forum as well. I guess I laughed a little too hard at his expense and got booted, though. He still thinks that it was his doing and not mine.\n I got bored there arguing with XXXXXX and decided to come back \"home\". I like to practice a scorched earth policy so I'm not as tempted to return there again. I'm sure the admin there removed my final missive long before poet would have seen it. ;)\n\n \n Oh, I saw enough of it...admin is still \"lysol-ing\" the place, after your exit. I guess your parents never taught you not to defacate where you eat.\n So much for any notions of superiority. LOL", 
   {}, 
   427745, 
   null, 
   1303162200.0
  ], 
  [
   427748, 
   null, 
   "poet", 
   "Everybody now! \n \"Nobody knows the trouble I've seen........\"\n\n \n LOL. One trick pony.", 
   {}, 
   427746, 
   null, 
   1303162260.0
  ], 
  [
   427750, 
   null, 
   "JPSartre12", 
   "Oh, I saw enough of it...admin is still \"lysol-ing\" the place, after your exit. I guess your parents never taught you not to defacate where you eat.\n So much for any notions of superiority. LOL\n\n \n I highly doubt that you saw the steamy pile I left for you. \n \n \nLOL. One trick pony.\n\n \n That was my assessment of you from Day 1. \"Whitey this..Blah Blah Blam..whitey that....Blah Blah Blah. '\" You perform a one-note song every time the organ grinder cranks the handle. \n Why don't you tell them about you getting caught plagiarizing? I'm sure that you have an interesting spin on that one. ;)", 
   {}, 
   427748, 
   null, 
   1303162560.0
  ], 
  [
   427751, 
   null, 
   "gansao", 
   "Who's wriggling. I asked you to define twat and you came up with your version of what it meant. I corrected you, and called you out. \n You failed to illustrate how I was one or like one. \n Racist? Because I'm pointing out your ambush of me, 2 (or 3) on 1, white vs. black, straight vs. gay, conservatards vs. liberal? \n Don't feign superiority based on you being white and there would be no need for me to bring up race. Alas, you can't do it. You'd have no more arrows in your quiver. Notions of white privilege minus relative intelligence is all you have.\n\n \n You are.\n I proposed that I think you are a twat and you chose to debate it.\n Even I wouldnt fall for that one.\n I did not need to prove you was a twat , you needed to disprove that I thought you was one.\n Alas you prove me right wth every post you make.\n Please point out exactly where I feigned superiority based on me being white.\n I dont believed I ambushed you either.\n If I have then by your definition been ambushed by muliple homosexuals on this forum more than once.\n Why do you hate white people?", 
   {}, 
   427743, 
   null, 
   1303162680.0
  ], 
  [
   427752, 
   null, 
   "gansao", 
   "Stumped, eh? I understand.\n\n \n No I posted that so you could not alter it.\n That was the post where you choose to debate whether I thought you were a twat in preference to a debate about philosophy lol", 
   {}, 
   427744, 
   null, 
   1303162860.0
  ], 
  [
   427753, 
   null, 
   "gansao", 
   "Yes, he was laughed at on that forum as well. I guess I laughed a little too hard at his expense and got booted, though. He still thinks that it was his doing and not mine.\n I got bored there arguing with XXXXXX and decided to come back \"home\". I like to practice a scorched earth policy so I'm not as tempted to return there again. I'm sure the admin there removed my final missive long before poet would have seen it. ;)\n\n \n So you got under his skin and he cant let it lie?", 
   {}, 
   427745, 
   null, 
   1303162920.0
  ], 
  [
   427754, 
   null, 
   "poet", 
   "You are.\n I proposed that I think you are a twat and you chose to debate it.\n Even I wouldnt fall for that one.\n I did not need to prove you was a twat , you needed to disprove that I thought you was one.\n Alas you prove me right wth every post you make.\n Please point out exactly where I feigned superiority based on me being white.\n I dont believed I ambushed you either.\n If I have then by your definition been ambushed by muliple homosexuals on this forum more than once.\n Why do you hate white people?\n\n \n Lord have mercy. You have turned this into a circus. I'm going to let you go your merry/happy/gay way, because I've found that you have to leave some people where they are at, in their evolution, or stage of development. \n You have misinterpreted me, and believed the lie. I, with every fiber of my being, do not hate white people. I have half-white cousins. I have a gazillion white friends and associates. I've been in white-dominated environs, personally and professionally...and have no problems or concerns interacting, socializing, fraternizing with white people. My partner is often confused as being white...but recoils at the thought of it. I have to moderate him, as white Americans have put such a bad taste in his mouth. I assure him, \"they are not all like that\". \n So. I'm putting both you and JP on ignore, as I've grown bored and irritated by both of you...and there is nothing more to see here. Please reciprocate.", 
   {}, 
   427751, 
   null, 
   1303163460.0
  ], 
  [
   427756, 
   null, 
   "gansao", 
   "Lord have mercy. You have turned this into a circus. I'm going to let you go your merry/happy/gay way, because I've found that you have to leave some people where they are at, in their evolution, or stage of development. \n You have misinterpreted me, and believed the lie. I, with every fiber of my being, do not hate white people. I have half-white cousins. I have a gazillion white friends and associates. I've been in white-dominated environs, personally and professionally...and have no problems or concerns interacting, socializing, fraternizing with white people. My partner is often confused as being white...but recoils at the thought of it. I have to moderate him, as white Americans have put such a bad taste in his mouth. I assure him, \"they are not all like that\".\n\n \n Isnt ' gazillion' hyperbole?\n \n So you claim its your partner that is racist, not you.\n \n This turned this into a circus when you chose the second debate option.\n \n I notice that you claim to have put me and JP on ignore AFTER I quoted your post.\n Once again, I am dissappointed (sic) in you Poet.\n I never had you down as a quitter....a twat yes but not a quitter", 
   {}, 
   427754, 
   null, 
   1303163760.0
  ], 
  [
   427758, 
   null, 
   "JPSartre12", 
   "Lord have mercy. You have turned this into a circus. I'm going to let you go your merry/happy/gay way, because I've found that you have to leave some people where they are at, in their evolution, or stage of development. \n\n \n I'd say that he handed you a shovel and you just couldn't help but dig.\n \n \n\n You have misinterpreted me, and believed the lie. I, with every fiber of my being, do not hate white people. I have half-white cousins. I have a gazillion white friends and associates. \n \n\n This is the black version of \"I don't hate blacks, some of my best friends are black\" argument. LOL...\n \n \n\n I've been in white-dominated environs, personally and professionally...and have no problems or concerns interacting, socializing, fraternizing with white people. \n\n \n I find that hard to believe given the chip you carry on your shoulder in forums. Or is this just your anti-white facade? You're really a nice guy IRL. ;)\n \n\n My partner is often confused as being white...but recoils at the thought of it. I have to moderate him, as white Americans have put such a bad taste in his mouth. I assure him, \"they are not all like that\". \n\n \n So, your white-looking boyfriend is the racist and not you? emoticon_frazzled\n \n\n So. I'm putting both you and JP on ignore, as I've grown bored and irritated by both of you...and there is nothing more to see here. Please reciprocate.\n\n \n You mean you've grown tired of being embarrassed by us. emoticon_emb emoticon_xbyeemoticon_xbye", 
   {}, 
   427754, 
   null, 
   1303166520.0
  ], 
  [
   427759, 
   null, 
   "gansao", 
   "Aw... leave him alone JP.\n Its like kicking a puppy.", 
   {}, 
   427758, 
   null, 
   1303166760.0
  ], 
  [
   427772, 
   null, 
   "JPSartre12", 
   "Aw... leave him alone JP.\n Its like kicking a puppy.\n\n \n I wasn't kicking a puppy. I was trying to get an ankle biter off my leg. emoticon_xangel", 
   {}, 
   427759, 
   null, 
   1303187880.0
  ], 
  [
   427776, 
   null, 
   "Bassman", 
   "I wasn't kicking a puppy. I was trying to get an ankle biter off my leg. emoticon_xangel\nHey JP, ya got booted too??", 
   {}, 
   427772, 
   null, 
   1303189080.0
  ], 
  [
   428166, 
   null, 
   "poet", 
   "Hey JP, ya got booted too??\n\n \n I didn't. LOL.", 
   {}, 
   427776, 
   null, 
   1303746420.0
  ], 
  [
   428267, 
   null, 
   "poet", 
   "I wasn't kicking a puppy. I was trying to get an ankle biter off my leg. emoticon_xangel\n\n \n What's the matter? Cat got your tongue? And the leg would be too easy...I always go for the vicera.", 
   {}, 
   427772, 
   null, 
   1303830900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Challenge", 
  "url": "http://www.4forums.com/political/debate-challenges/9653-challenge.html", 
  "breadcrumbs": [
   "Debate Challenges"
  ], 
  "id_number": 9653, 
  "discussion_files": [
   [
    "10211.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-print.html"
   ], 
   [
    "10212.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-8-print.html"
   ], 
   [
    "10213.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-6-print.html"
   ], 
   [
    "10214.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-4-print.html"
   ], 
   [
    "10215.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-5-print.html"
   ], 
   [
    "10216.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-7-print.html"
   ], 
   [
    "10217.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-3-print.html"
   ], 
   [
    "10218.html", 
    "http://www.4forums.com/political/debate-challenges/9653-challenge-2-print.html"
   ]
  ], 
  "identifier": 9653
 }
]