[
 [
  [
   15210, 
   null, 
   "BobSci", 
   "What is evolution. Evolution is the change in the genetic makeup of a population over time. That this happens if a fact. The theory of evolution is the explanation of this fact. How good is the theory of evolution. A theory is a good theory when there is no evidence to disprove the theory and the theory makes good and useful predictions. Evolution does this.\n \n What are the predictions made by evolution. First and most important was when the theory was in it's infancy, it was predicted that a mechanism would be found that would pass along characteristics from generation to generation. It took at least a hundred years but sure enough DNA and genes were found. One of the hottest areas in science is genetics with hundreds of millions of dollars being invested This along with many other predictions makes evolution a good theory.\n \n Well lets look where evolution is used in everyday life. When a new drug is found the testing is done by evolutionary principals. That is you look at the tree of life and test on animals close to the branch that the drug is developed for. The same goes for all cosmetics. When you look for oil, a evolutionary geologist is used to find the oil. An acquaintance who was an oil company geologist made this statement. \"Oil companies spend millions on evolutionary geologists to find oil and not one cent on creationist geologists. Again, predictions that make evolution a good theory.\n \n What would make a theory a great theory. I would say a great theory is one that finds use outside of its primary field. Here again evolution does this. Where is evolution used outside of Biology, Geology, Anatomy, Biochemistry, Embryology, and Genetics \n \n Evolutionary algorithms have been used for a number of years to design computer programs. One of the latest developments is designing electronic circuits using evolution. What is done is to start with a random design and create a population of these circuits. For the next generation, a random variation is introduced in a small subset of the population. Those that were most suitable for the job were selected and mated with some of the unmutated circuits. The next generation was still not near desired result but the process but the process continued. Each generation is closer to the desired result. After 5000 generations a working circuit was developed that even the designers did not understand how it worked. some of these circuit have received patents. You can read more about this at www.genetic-programming.com. As you can see the theory of evolution works in fields outside its primary field, this makes this a great theory.\n \n The next time you hear someone say, \"When you see a computer (any manufactured item) you know it was designed\", you can now say it may have been designed using evolution.", 
   {
    "post_info": {
     "post_title": "Evolution, A great theory"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1063526220.0
  ], 
  [
   15221, 
   null, 
   "montalban", 
   "What is evolution?\n \n This is quite a funny post! Such a vacuous attempt at a sales pitch... let's all get comfy with evolution!\n \n \"A theory is a good theory when there is no evidence to disprove the theory and the theory makes good and useful predictions. Evolution does this.\"\n \n \"What are the predictions made by evolution.\"\n \n Well, we can find oil (!) and test cosmetics on animals (!) I wasn't sure if this was meant to be funny or not. Did they not find oil before evolution? Would they not be able to tell that oil exists next to certain rocks without evolution? Why bring in animal testing? If you want to stake a claim that such cruel behaviour is part of evolution, hey, that's up to you (takes a bit of heat off us Christians over the Crusades!) (ha!)\n \n \"First and most important was when the theory was in it?s infancy, it was predicted that a mechanism would be found that would pass along characteristics from generation to generation. It took at least a hundred years but sure enough DNA and genes were found. One of the hottest areas in science is genetics with hundreds of millions of dollars being invested This along with many other predictions makes evolution a good theory\"\n \n Really, you've hit the jackpot with this one, because www.talkorigins.com claims that the 'mechanism' is still unknown... at least how the 'mechanism' works to produce macroevolution. Perhaps you should write to them!\n \n \"An acquaintance who was an oil company geologist made this statement. ?Oil companies spend millions on evolutionary geologists to find oil and not one cent on creationist geologists. Again, predictions that make evolution a good theory.\"\n \n Yes, that is an amazing statement folks. The oil companies actively weed-out geologists who are creationists, because they've been looking for oil in all the wrong places (!) (at least that's what I assume this quote means).\n \n \"Where is evolution used outside of Biology, Geology, Anatomy, Biochemistry, Embryology, and Genetics\"\n \n That's right, many of these sciences didn't exist before evolution (certainly not the first three!) (Ouch!)\n \n \"Evolutionary algorithms have been used for a number of years to design computer programs. One of the latest developments is designing electronic circuits using evolution. What is done is to start with a random design and create a population of these circuits. For the next generation, a random variation is introduced in a small subset of the population. Those that were most suitable for the job were selected and mated with some of the unmutated circuits. The next generation was still not near desired result but the process but the process continued. Each generation is closer to the desired result. After 5000 generations a working circuit was developed that even the designers did not understand how it worked. some of these circuit have received patents. You can read more about this at http://www.genetic-programming.com. As you can see the theory of evolution works in fields outside its primary field, this makes this a great theory.\"\n \n Can I restate this again... 'designing electronic circuits' ... design implies intelligence. And look, after 5000 generations we get what? A cyborg super-intelligence? Nope!\n \n \"The next time you hear someone say, \"When you see a computer (any manufactured item) you know it was designed\", you can now say it may have been designed using evolution.\"\n \n Yes, I can say that. I'll do that tomorrow at work! (ha!)\n \n But seriously, evolution is a theory of explaining an apparent change in animals. It is not the change in animals... because that has not been proven!", 
   {}, 
   15210, 
   null, 
   1063535040.0
  ], 
  [
   15254, 
   null, 
   "Ursus maritimus", 
   "Well, we can find oil (!) and test cosmetics on animals (!) I wasn't sure if this was meant to be funny or not. Did they not find oil before evolution? Would they not be able to tell that oil exists next to certain rocks without evolution? Why bring in animal testing? If you want to stake a claim that such cruel behaviour is part of evolution, hey, that's up to you (takes a bit of heat off us Christians over the Crusades!) (ha!)\n\n Actually, no they could not find oil without evolution. It's not only a matter of finding \"certain rocks\" associated with oil, but by reconstructing the paleo-environment. Only certain environments, indicated by types of rocks and the types of animals/plants that existed at that time, are suitable for the production of petroleum.\n \n In fact, a lot of mineral resources are located by certain geologic formations as interpreted by modern theories of geology. Without a knowledge of biological and geological evolution prospectors would waste a lot of time looking in the wrong places.", 
   {}, 
   15221, 
   null, 
   1063569900.0
  ], 
  [
   15255, 
   null, 
   "lurch", 
   "So montalban. Why don't you tell us about creationism. What is the theory? What is the evidence? What predictions can be made.\n \n We can assume that since you haven't responded to previous requests that there is no theory and no evidence. It is only superstition based on childish mythology.", 
   {}, 
   15221, 
   null, 
   1063569900.0
  ], 
  [
   15293, 
   null, 
   "montalban", 
   "So montalban. Why don't you tell us about creationism. What is the theory? What is the evidence? What predictions can be made.\n \n We can assume that since you haven't responded to previous requests that there is no theory and no evidence. It is only superstition based on childish mythology.\n\n \n \n Yes it is patent that you would assume that. Your wish to advertise this and tell the world, repeatedly must make you of some import.\n \n Repeatedly you make this a personal issue. I have addressed posts and say 'another poster has said ...such and such'. But you insist that I address YOU in such posts.\n \n Now you are going at it again, saying I'm not answering questions. This is an attempt to take the moral high-ground, and is itself highly deceitful, especially in light that you have in the past accused me of saying things that I didn't... see our discussions re: Archie, the transitional bird-beast.\n \n Also, you name-call, and then chuck a tantrum if anyone does the same back.\n \n I must say here that I do wish you'd stop personalising this, as it only leads to more confrontation, not discussion.\n \n Calling people names is just grand-standing. It is the sort of behaviour that suggests someone who is just interested in making themselves heard, regardless of anyone else.", 
   {}, 
   15255, 
   null, 
   1063596360.0
  ], 
  [
   15305, 
   null, 
   "lurch", 
   "So I assume that there is no evidence or theory of creation that you know of. Your response didn't have anything to do with my questions. I didn't call you a name I just pointed out that your inability to present the theory and evidence would be an indication that there wasn't any.\n \n Thanks for making my case.\n \n That was quite a tantrum. The whine was so shirll it made my dog cry.", 
   {}, 
   15293, 
   null, 
   1063598520.0
  ], 
  [
   15309, 
   null, 
   "Gracchus", 
   "Yes it is patent that you would assume that. Your wish to advertise this and tell the world, repeatedly must make you of some import.\n \n Repeatedly you make this a personal issue. I have addressed posts and say 'another poster has said ...such and such'. But you insist that I address YOU in such posts.\n \n Now you are going at it again, saying I'm not answering questions. This is an attempt to take the moral high-ground, and is itself highly deceitful, especially in light that you have in the past accused me of saying things that I didn't... see our discussions re: Archie, the transitional bird-beast.\n \n Also, you name-call, and then chuck a tantrum if anyone does the same back.\n \n I must say here that I do wish you'd stop personalising this, as it only leads to more confrontation, not discussion.\n \n Calling people names is just grand-standing. It is the sort of behaviour that suggests someone who is just interested in making themselves heard, regardless of anyone else.\n\n \n And there is still no evidence on the table for YEC.", 
   {}, 
   15293, 
   null, 
   1063599120.0
  ], 
  [
   15314, 
   null, 
   "montalban", 
   "And there is still no evidence on the table for YEC.\n\n What is YEC?", 
   {}, 
   15309, 
   null, 
   1063600920.0
  ], 
  [
   15318, 
   null, 
   "Pikeman85", 
   "YEC = Young Earth Creationist\n \n And the mechanisms for \"macro\" evolution are the same as micro evolution.\n \n And it also has been observed :)\n \n In flies, certain types of plants, and a few other organisms, according to the BSC.", 
   {
    "post_info": {
     "post_title": "You are a YEC"
    }
   }, 
   15314, 
   null, 
   1063601400.0
  ], 
  [
   15321, 
   null, 
   "montalban", 
   "Thanks for clearing that up.\n \n To the people who would suggest \"And there is still no evidence on the table for YEC.\"\n \n This is an easy statement to make as all the 'evidence' that does support it isn't 'evidence'.\n \n I suggest a good book to be tabled as evidence...\n \n Richard Milton \"Shattering the Myths of Darwinism\"\n \n \n \n \n \n PS\n I predict that all the negative posts will come a flying fast... and most will deal with the man, Milton, rather than the message. I have learnt this from experience with so-called 'rational' thinkers.", 
   {}, 
   15318, 
   null, 
   1063602000.0
  ], 
  [
   15322, 
   null, 
   "BobSci", 
   "I also would like to hear the predictions of you creation theory. Does it predict what strain of flu will be here next year so we can make the flu shots. Come on, tell us what are your predictions. Lurch asked on other threads, but never gets a reply. Why? Aren't there any prediction to be made. Why not?", 
   {}, 
   15221, 
   null, 
   1063602120.0
  ], 
  [
   15325, 
   null, 
   "BobSci", 
   "<Can I restate this again... 'designing electronic circuits' ... design implies intelligence. And look, after 5000 generations we get what? A cyborg super-intelligence? Nope!<\n \n Not what was being selected for so why would you get it. Only a creationist would look for something like that. \n What they did design were working electronic circuits that are useful. If evolution is so wrong, why do they get working circuits when they apply the TOE.\n \n <But seriously, evolution is a theory of explaining an apparent change in animals. It is not the change in animals... because that has not been proven![/QUOTE]<\n \n Actually it is seen all the time in labs. That it happens is a fact and the changes can be repeated in other labs. Changes have also been observed out of the lab. The TOE explains these changes. Just as the theory of gravity explains the fact of gravity. THe only difference is we know less about how gravity works.", 
   {}, 
   15221, 
   null, 
   1063602960.0
  ], 
  [
   15329, 
   null, 
   "montalban", 
   "<Can I restate this again... 'designing electronic circuits' ... design implies intelligence. And look, after 5000 generations we get what? A cyborg super-intelligence? Nope!<\n \n Not what was being selected for so why would you get it. Only a creationist would look for something like that. \n What they did design were working electronic circuits that are useful. If evolution is so wrong, why do they get working circuits when they apply the TOE.\n \n <But seriously, evolution is a theory of explaining an apparent change in animals. It is not the change in animals... because that has not been proven!\n<\n \n Actually it is seen all the time in labs. That it happens is a fact and the changes can be repeated in other labs. Changes have also been observed out of the lab. The TOE explains these changes. Just as the theory of gravity explains the fact of gravity. THe only difference is we know less about how gravity works.[/QUOTE]\n \n \n Observation in labs doesn't 'prove' anything other than observation in labs!\n \n This is a paraphrasing of a case put forward in \"Chaos\" by James Gleick\n Suppose that you are a scientist working in a lab... and you are given newly discovered bacteria and you are asked to describe its nature.\n \n You peer at it through a microscope and notice that the bacteria is quite 'excited'\n \n You write a paper explaining your observations.\n \n Other labs around the world, under similar conditions observe the same behaviour in the same bacteria.\n \n The conclusion is that the bacteria ARE as you had stated.\n \n \n But what you are failing to realise is that in order to observe the bacteria through a microscope, you are shining a light onto them. The bacteria could be reacting with the light, so how they ARE normally might be quite different to how they ARE when you observe them.\n \n Repeat observations would only confirm your misunderstanding!\n \n \n BUT anyway, if you'd be kind enough to give a specific example of observed evolution, I can deal with that.", 
   {
    "unicode_changes_made": true
   }, 
   15325, 
   null, 
   1063604760.0
  ], 
  [
   15332, 
   null, 
   "montalban", 
   "I also would like to hear the predictions of you creation theory. Does it predict what strain of flu will be here next year so we can make the flu shots. Come on, tell us what are your predictions. Lurch asked on other threads, but never gets a reply. Why? Aren't there any prediction to be made. Why not?\n\n \n \n Sorry, I missed this earlier post. Again you've been a bit tight with information, and liberal with generalisation.\n \n \n I would dispute that you call this 'evolutionary' science and not just 'science', but that's a moot point I don't want to be bogged down in...\n \n But, tell me, how do they make predictions on up and coming flu strains? (Ouiji board, maths modelling, stab-in-the-dark?)\n \n What is the definition of 'strain'? Is it the same as 'species'?\n \n Is there a new 'strain' each year, and why/why not?", 
   {}, 
   15322, 
   null, 
   1063605240.0
  ], 
  [
   15336, 
   null, 
   "lurch", 
   "And still montalban doesn't tell us about any observations, about no hypothesis, about no predictions, nor about any tests that support the threory of creation. There seems to be lots of evolutionary theory for him to deny but he can't offer a single example of support for creationism.\n \n I know what that means.", 
   {}, 
   15332, 
   null, 
   1063607700.0
  ], 
  [
   15340, 
   null, 
   "Gracchus", 
   "And still montalban doesn't tell us about any observations, about no hypothesis, about no predictions, nor about any tests that support the threory of creation. There seems to be lots of evolutionary theory for him to deny but he can't offer a single example of support for creationism.\n \n I know what that means.\n\n \n It means YEC's cannot refute arguments based on biology. Neither can they support their position with the findings of biology.\n \n Likewise, geology refutes their position, and there are no geological observations that support it.", 
   {}, 
   15336, 
   null, 
   1063613340.0
  ], 
  [
   15346, 
   null, 
   "montalban", 
   "It means YEC's cannot refute arguments based on biology. Neither can they support their position with the findings of biology.\n \n Likewise, geology refutes their position, and there are no geological observations that support it.\n\n \n You guys are trying again to have both arguments. Once, I posted something about evolution and abiogenesis. I was immediately shouted down 'evolution has nothing to do with abiogenesis'!\n \n I've been told that YEC means Young Earth Creationist. If this is true, then why are you now asking to find observations in biology?\n \n Is the age of the earth related to a biological observations?\n \n Yes, I know a Christian raised this, but you have accepted his post without question... so is it that you too believe that these things are linked?", 
   {}, 
   15340, 
   null, 
   1063618320.0
  ], 
  [
   15348, 
   null, 
   "Gracchus", 
   "You guys are trying again to have both arguments. Once, I posted something about evolution and abiogenesis. I was immediately shouted down 'evolution has nothing to do with abiogenesis'!\n \n I've been told that YEC means Young Earth Creationist. If this is true, then why are you now asking to find observations in biology?\n \n Is the age of the earth related to a biological observations?\n \n Yes, I know a Christian raised this, but you have accepted his post without question... so is it that you too believe that these things are linked?\n\n \n Indeed, one of the first objections to the theory of evolution, was that the Earth was too young for evolution. Then there was the argument that the geologic column was composed of sediment laid down by Noah's flood, and fossils were the remains of organisms killed by the flood. If it were possible to prove the Earth were only a few thousand years old, it would be strong evidence against evolution and all of geology. It would not, however, be evidence for creationism.", 
   {}, 
   15346, 
   null, 
   1063619160.0
  ], 
  [
   15349, 
   null, 
   "montalban", 
   "Indeed, one of the first objections to the theory of evolution, was that the Earth was too young for evolution. Then there was the argument that the geologic column was composed of sediment laid down by Noah's flood, and fossils were the remains of organisms killed by the flood. If it were possible to prove the Earth were only a few thousand years old, it would be strong evidence against evolution and all of geology. It would not, however, be evidence for creationism.\n\n \n Though I too am one who leans towards a young earth!\n \n A typical debate on another forum went like this. (and for the record I'm way over my head on this one)\n \n Citing a creationist bulletin that suggested the evolutionaries were wrong with their radiometric dating...\n \n Montalban: John G. Funkhouser and John J. Naughton, \"Radiogenic Helium and Argon in Ultramafic Inclusions from Hawaii,\" Journal of Geophysical Research, Vol. 73, No. 14 (July 15, 1968), pp. 4601-4607 (especially p. 4606) (volcanic eruption of 1800 on Hualalai Island, Hawaii, produced rocks which falsely \"dated\" 160 million to 3 billion years). \n http://www.christiananswers.net/q-eden/edn-radioactive.html#4\n \n \n heathen (not his real ID): For your comfort, Funkhouser and Naughton dated the lava matrix at zero years, accurate enough for the technology of the time. The inclusions gave various ages which demonstrates why they should be removed when dating samples of lava flows. Of course Austin and Snelling would have been aware of this. That's why they didn't bother doing it, so that they could produce discordant dates.\n http://www.don-lindsay-archive.org/creation/hawaii.html\n \n Montalban: first off, what is Ultramafic? Igneous rocks made mostly of the mafic minerals hypersthene, augite, and/or olivine. \n http://volcano.und.nodak.edu/vwdocs/glossary.html \n What is Intrusion? \n Intrusion: The process of emplacement of magma in pre-existing rock. Also, the term refers to igneous rock mass so formed within the surrounding rock. \n (Ibid) \n What is a Xenoliths? \n A foreign inclusion in an igneous rock. \n (Ibid) \n I don't know... I've been searching for some time. \n So, at best an Ultramafic olivine intrusion is an igneous rock made up of olivine that is intruded into another igneous rock. The web-sites that 'heathen' gives suggests that the olivine intrusions are in fact old - as according to the dates, but this is circular reasoning because there is nothing to suggest that these particular volcanic rocks were formed millions of years before the other volcanic rocks into which they intruded! \n I have yet to find something that suggests otherwise. Otherwise it's circular logic again! \n This is why they use Funkhouser as a reference, regardless of whether he was trying to date the whole rock or the intrusion \n The best article I've found on this (excepting that it gets way too technical) is \n \"ANDESITE FLOWS AT MT NGAURUHOE, NEW ZEALAND, AND THE IMPLICATIONS FOR POTASSIUM-ARGON \"DATING\"\"at \n http://www.icr.org/research/as/as-r01.htm \n which I found from this site... \n http://www.icr.org/pubs/imp/imp-307.htm \n There is more info on this at... \n http://www.biblestudymanuals.net/k55.htm \n One of 'heathen' sites says \"The important word here is \"Inclusions\". The scientists were not out to date the lava: they were dating some chunks of olivine that were stuck in the lava like raisins. This lava was not hot enough to melt olivine, so the chunks were carried along when the eruption brought lava up from the depths. Of course the olivine inclusions dated as being old. They are old. \" \n The next paragraph says the opposite \"In fact, the scientists weren't trying to date the olivine inclusions - the xenoliths. Rather, they were trying to find out if Potassium/Argon dating worked on such inclusions.\" I went huh? Are they trying to date them or not? \n How do they know the age of the olivines, anyway? They don't! They are assuming that! \n \"Olivine is known for its low potassium concentration, and is seldom used for dating, but when the test was run, it again showed an excessively high concentration of argon for this amount of potassium, thus yielding an \"age\" of 117 plus or minus 3 million years! {8} Some explain this away by claiming the mineral was contained within a \"pod\", which may have become incorporated into the lava flow from a deeper source at the time of eruption. Thus, this \"pod\" was unable to give up its excess argon, it is claimed, and retained evidence of its older age. Fair enough, but as we have seen, even molten rocks do not always \"reset the clock\" to zero. When does the method work, and on what basis can one determine which specimens are valid just by looking at the field evidence? And how do we know that even the 10,000 year specimen didn't retain excess argon?\" \n http://www.ronsbibleresearch.net/youngearth/chap5.htm\n \n Heathen: Funkhouser and Naughton were testing the volcanic material to determine if the radiometric clock for the included minerals such as olivine had been reset by their incorporation in the igneous mass and partial remelting. The theoretical opinion at the time (1968) was that the clock was not reset and therefore the inclusions or xenoliths in the lava matrix would produce spurious results. Their investigations confirmed this opinion. Note, the lava matrix, excluding the xenoliths, dated to the correct age (0 years). Of course this was necessary as a baselinel for comparison with the xenolith datings. \n \n \n \n This went on for some time...\n To get to the point...\n \n Knowing the age of certain rocks already - from historical eruptions, Creationists presented volcanic rocks to evolutionaries. The evolutionaries Funkhouser et al dated the rocks (or the inclusions in the rocks) and got millions of years for a rock that was formed just a few centuries ago.\n \n Now the critical point evolutionaries say is that the inclusions were in fact millions of years old. Therefore they claim, the creationists have got it all wrong...\n \n But (http://www.don-lindsay-archive.org/creation/hawaii.html) says \"The important word here is \"Inclusions\". The scientists were not out to date the lava: they were dating some chunks of olivine that were stuck in the lava like raisins. This lava was not hot enough to melt olivine, so the chunks were carried along when the eruption brought lava up from the depths. Of course the olivine inclusions dated as being old. They are old\"\n \n How do they know that the inclusions were millions of years old? They dated them as being millions of years old! So, of course they would give discordant ages.\n \n Unfortunately the very next paragraph completely blurs the issue...\"In fact, the scientists weren't trying to date the olivine inclusions - the xenoliths. Rather, they were trying to find out if Potassium/Argon dating worked on such inclusions. There was a theory that the method wouldn't work, because the inclusions had spent a long time in the magma chamber below the volcano. The inclusions had probably been heated enough (for long enough) that some part of their Argon had escaped. So, their Potassium/Argon ages should be scattered all over the map. No one single age should dominate in the measurements.\" (Ibid).\n \n In other words, they believed that they wouldn't be able to date the inclusions, because of contamination. Then they did date them and still they can claim that they are millions of years old? How do they know when...?\n a) they suggested they'd not be able to do it, and they then agreed that they couldn't\n b) they say at one stage they weren't trying to date the inclusions, and then they were\n c) they can still say that the inclusions 'WERE' millions of years old\n \n \"The article reports that the theory was correct. K/Ar dating should not be used on xenoliths. But, the article clearly states (on page 4603) that the surrounding lava was dated correctly. This article casts no doubts whatsoever on the dating of lava\" (Ibid)\n Thus they can date the lava, they shouldn't date it anyway, but they dated the inclusions, and they still dated that correct too!\n \n This didn't help me understand their case at all, they were arguing that they were trying to do everything and nothing, and that they succeeded in doing both!\n \n So I wrote :Also you didn't answer my questions... \"...how long does it take for 'contamination' to occur? I ask this because I read somewhere about discordant dates from Mt St. Helen's which was tested within 10 years of the eruption... and if this is the case... then how accurate is any testing on volcanic rocks? \"\n \n How do they know how much contamination did occur? And, if they shouldn't be trying to date lava because of contamination, why do they do it all the time?\n \n Put more succinctly\n Heathen: \"You do realise that xenoliths are pre-existing minerals which have been mixed in with the lava? Obviously they must be older that the lava matrix, but it's not possible to tell how old. The lava matrix starts to age when it has crystalized.\" \n \n Montalban: If it's not possible to tell how old, then how did they date the xenoliths as being millions of years old?", 
   {}, 
   15348, 
   null, 
   1063621260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution, A great theory", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/966-evolution-great-theory.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 966, 
  "discussion_files": [
   [
    "25464.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/966-evolution-great-theory-print.html"
   ], 
   [
    "25465.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/966-evolution-great-theory-2-print.html"
   ]
  ], 
  "identifier": 966
 }
]