[
 [
  [
   254935, 
   null, 
   "Phyllis", 
   "The Supreme Court heard a First Amendment case today. Below I have posted a brief summary of the facts. However, if one wishes to engage in a fully informed discussion of this case, he should read the briefs of this case, as well as the oral argument transcripts.\n \n IMPORTANT NOTE\n \n The question here is not, of course, whether you think the principal acted incorrectly, but rather it is whether the principal's action was unconstitutional. Please keep in mind that these are not always the same, and stick to discussing the latter rather than the former.\n \n \nIn January 2002, the Olympic torch was carried through Juneau, Alaska, en route to the Winter Olympic Games in Salt Lake City, Utah. Students in the Juneau public schools were permitted to attend the event during school hours. Most students at Juneau-Douglas High School gathered outside the school building, which was on the torch route. School administrators and teachers accompanied the students. Joseph Frederick, then a senior at the high school, was unable to reach school on time that morning because of snow in his driveway, but he was able to get to the sidewalk across Glacier Avenue in front of the school. There, he and some classmates unfurled a 14-foot-long banner with the message, \"BONG HITS 4 JESUS,\" just as the torch relay and a television camera crew passed by the school. \n \n Juneau School Board has a written policy that specifically prohibits any assembly or public expression that \"advocates the use of substances that are illegal to minors\" or otherwise \"urges the violation of law.\" The board's policies likewise prohibit \"[t]he distribution on school premises\" of \"materials that \"advocate the use by minors of any illegal substance\" or otherwise \"urge the violation of law.\"\n \n In light of those policies, the school's principal asked Frederick to take down the banner. When he refused, she took down the banner and later issued him a ten-day suspension. She told him that the banner \"violated the [school] policy against displaying offensive material, including material that advertises or promotes use of illegal drugs.\" Although the banner did not physically disrupt the parade, the principal believed that it \"sparked\" subsequent pro-drug graffiti in the school. School officials determined that \"[f]ailure to react to the display would appear to give the district's imprimatur to [the banner's pro-drug] message and would be inconsistent with the district's responsibility to teach students the boundaries of socially appropriate behavior.\"\n", 
   {
    "post_info": {
     "post_title": "Bong Hits for Who?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1174352220.0
  ], 
  [
   254938, 
   null, 
   "Steeeeve", 
   "I'd like to add that the prinicpal is being sued for violating the first amendment which means that eventhough there was no law created that violated the first amendment the person is said to have infridged on the 1st amendment rights of another and thus can be punished via cash $$$. \n \n There are many key facts in this case that might change your thoughts. \n \n The student was with other students holding the banner also the student attended class after the event. The event was across the street but the students were not restricted to school grounds for the event.\n \n Also, the student is not challenging the \"at the heat of the moment\" taking down the banner but after learning the facts the principal should have known that she couldn't do that.", 
   {}, 
   254935, 
   null, 
   1174353360.0
  ], 
  [
   254944, 
   null, 
   "Matthew S", 
   "I'd like to add that the prinicpal is being sued for violating the first amendment which means that eventhough there was no law created that violated the first amendment the person is said to have infridged on the 1st amendment rights of another and thus can be punished via cash $$$. \n \n There are many key facts in this case that might change your thoughts. \n \n The student was with other students holding the banner also the student attended class after the event. The event was across the street but the students were not restricted to school grounds for the event.\n \n Also, the student is not challenging the \"at the heat of the moment\" taking down the banner but after learning the facts the principal should have known that she couldn't do that.\n\n \n \n \n I hope the student wins. I have many people I want to sue for cash.", 
   {}, 
   254938, 
   null, 
   1174355700.0
  ], 
  [
   254945, 
   null, 
   "Phyllis", 
   "I hope the student wins. I have many people I want to sue for cash.\n\n \n As usual, you can't stay on topic. Perhaps you didn't read the poll question before you voted.", 
   {}, 
   254944, 
   null, 
   1174359480.0
  ], 
  [
   254946, 
   null, 
   "JPSartre12", 
   "I heard a little about this case on TV this AM. On a cursory look, I'd say the principal overstepped her bounds if the student was NOT on school property. But, that's a little tricky because it might be argued that they were \"technically\" on a field trip, in which case, school rules would still apply......Ahhhh!!! :xbanghead", 
   {}, 
   254945, 
   null, 
   1174360320.0
  ], 
  [
   254948, 
   null, 
   "gman", 
   "Is free speech applicable to under aged individuals under the tuteledge and care of educators entrusted with their welfare and behavior? If so, why? They don't pay taxes, the add nothing to the GDP. Who cares what they have to say?", 
   {}, 
   254946, 
   null, 
   1174362240.0
  ], 
  [
   254951, 
   null, 
   "Phyllis", 
   "I heard a little about this case on TV this AM. On a cursory look, I'd say the principal overstepped her bounds if the student was NOT on school property. But, that's a little tricky because it might be argued that they were \"technically\" on a field trip, in which case, school rules would still apply......Ahhhh!!! :xbanghead\n\n \n I don't see how his not being on school property matters in this case. Suppose his location did not count as the school function. Then neither was the principal on school property or at a school function when she told him to take the sign down. So where would the first amendment violation be?", 
   {}, 
   254946, 
   null, 
   1174362660.0
  ], 
  [
   254972, 
   null, 
   "Matthew S", 
   "As usual, you can't stay on topic. Perhaps you didn't read the poll question before you voted.\n\n \n Ok here goes.\n \n The students were on a public street in the public right of way they have the right to say what they want. They were not creating a disturbance. So yes the principal, as a public official, violated the constitutional rights of the student.\n \n Furthermore if they win the case it would give other groups the legal stnding to sue.", 
   {}, 
   254945, 
   null, 
   1174403460.0
  ], 
  [
   254975, 
   null, 
   "Steeeeve", 
   "Ok here goes.\n \n The students were on a public street in the public right of way they have the right to say what they want. They were not creating a disturbance. So yes the principal, as a public official, violated the constitutional rights of the student.\n \n Furthermore if they win the case it would give other groups the legal stnding to sue.\n\n \n I often wonder where \"congress shall make no law\" became \"ANY government employee shall not stop...\"\n \n Seems like if you water meter man came by and ripped down the sign that you'd still think the government could be sued. \n \n What if this were a private school? All of a sudden no leg to stand on? Could you sue the private school? Do you even know the underlying law regarding this case Matthew?\n \n Like normal it seems many of you just say \"hey, I dont' want my signs being ripped down...this must be unconstitutional\" but you never stop to think what that means or if it really is. Perhaps it was wrong for the teacher to tear down the sign...but that doesn't make it a 1st amendment violation. Perhaps it was wrong because there was no authority to do so. This would make it the same offense as if you or I ripped down the sign: Destruction of property.", 
   {}, 
   254972, 
   null, 
   1174406280.0
  ], 
  [
   254979, 
   null, 
   "Phyllis", 
   "Ok here goes.\n \n The students were on a public street in the public right of way they have the right to say what they want. They were not creating a disturbance. So yes the principal, as a public official, violated the constitutional rights of the student.\n \n Furthermore if they win the case it would give other groups the legal stnding to sue.\n\n \n If the rule is that because the student was on a public street, then he is no longer acting in his capacity as a student, then it would also be the case that because the principal was on a public street when she confiscated the sign, then she was no longer acting in her official capacity as a public official.\n \n If follows from you suggestion that a public official in fact did not violate the constitutional rights of a student, a public citizen ripped up the sign of another public citizen. Call that what you may, but it is not a first amendment violation.", 
   {}, 
   254972, 
   null, 
   1174409040.0
  ], 
  [
   254983, 
   null, 
   "Master_Shake", 
   "I don't see how his not being on school property matters in this case. Suppose his location did not count as the school function. Then neither was the principal on school property or at a school function when she told him to take the sign down. So where would the first amendment violation be?\n\n Neither were on school property, but the principal punished the student through the arm of the school.\n \n Personally I think the student is an idiot, but I also believe they have a right to be an idiot :)", 
   {}, 
   254951, 
   null, 
   1174411140.0
  ], 
  [
   254993, 
   null, 
   "JPSartre12", 
   "Is free speech applicable to under aged individuals under the tuteledge and care of educators entrusted with their welfare and behavior? If so, why? They don't pay taxes, the add nothing to the GDP. Who cares what they have to say?\n\n \n Hum......if paying taxes and adding to the GDP were necessary to get constitutional protection then we'd have a whole lot of poor people that shouldn't be voting in the US.emoticon_wow", 
   {}, 
   254948, 
   null, 
   1174414320.0
  ], 
  [
   255015, 
   null, 
   "daewoo", 
   "Is free speech applicable to under aged individuals under the tuteledge and care of educators entrusted with their welfare and behavior? If so, why? They don't pay taxes, the add nothing to the GDP. Who cares what they have to say?\n\n \n Uh....becuase it si a fundamental right, which means that under our system of government is is considered pre-existing...a right that every human being has simply by existing. It is not a reward given by the government for your constribution to society. \n \n People like you make me SERIOUSLY worry about the future of this country. Do you have any concept of \"freedom\" at all?", 
   {}, 
   254948, 
   null, 
   1174419060.0
  ], 
  [
   255025, 
   null, 
   "E Mutz", 
   "Uh....becuase it si a fundamental right, which means that under our system of government is is considered pre-existing...a right that every human being has simply by existing. It is not a reward given by the government for your constribution to society. \n \n People like you make me SERIOUSLY worry about the future of this country. Do you have any concept of \"freedom\" at all?\n\n \n Well that would then presuppose that ye come out of the womb with all pre-existing rights. If that is the case, how might a parent legally get the little creature to shaddap at the local Fridays? Can the parent prevent Junior from bearing arms? Frankly, the idea that a minor is in any way capable of exercising or understanding the marriage of freedom and responsibility is absurd. \n \n If ye concede that the parent may exercise control over the rights of the minor, ye must locgically accept that said parent may appoint an agent to do same. The educator is in the position of acting as the parent's agent to provide the little heads of mush with an education sufficient for them to grow up and function. That which aids that goal is good. That which detracts from that goal, as indicated by the SCOTUS characterization of disruptive or undermining speech is bad. The pinhead's right to espress \"bong hits for Jesus\" is trumped by the greater good of the other 29 students in the class who are trying to get an already substandard education. This balance is not changed when the one disruptive student turns 18.\n \n The fact that this incident occured off school property is irrelevant. The incident occured at a gathering of students overseen by the school officials. Nit wit had ample opportunity to unfurl his banner along the 10-mile stretch of road and yet he chose the patch of land opposite the school and the TV camera. By so doing, his banner was in direct opposition to the school's anti-drug policy. Moreover, his proximity to other students and school officials would amount to tacit acceptance of his message if no action were taken. \n \n The Yute is seeking compensatory damages from the school official. It would be a poor precedent indeed to accept the judgment of the minor over the adult as to what constitutes a disruption in class.\n \n As to your concern about the future of the country, I am more concerned with folks who do not have any concept of responsibility. Every action (freedom) has a reaction (responsibility).", 
   {}, 
   255015, 
   null, 
   1174431120.0
  ], 
  [
   255029, 
   null, 
   "Coyote", 
   "Hum......if paying taxes and adding to the GDP were necessary to get constitutional protection then we'd have a whole lot of poor people that shouldn't be voting in the US.emoticon_wow\n emoticon_xhoho \n \n \n This is difficult. I think I like the citizen v. citizen angle. I think the Principal overstepped her bounds as a school official, and she could be reprimanded by the administration (though I don't think she should be), but that's as far as it should go. I understand where she's coming from, though. I can't say that if I were in her place I wouldn't have done the same thing. Stupid kid. :)", 
   {}, 
   254993, 
   null, 
   1174433220.0
  ], 
  [
   255043, 
   null, 
   "JPSartre12", 
   "Well that would then presuppose that ye come out of the womb with all pre-existing rights. If that is the case, how might a parent legally get the little creature to shaddap at the local Fridays? Can the parent prevent Junior from bearing arms? Frankly, the idea that a minor is in any way capable of exercising or understanding the marriage of freedom and responsibility is absurd. \n\n So, your position is that a high school student has no constitutional rights unless they have a note from their parents saying so?emoticon_confused \n \n\n If ye concede that the parent may exercise control over the rights of the minor, ye must locgically accept that said parent may appoint an agent to do same. The educator is in the position of acting as the parent's agent to provide the little heads of mush with an education sufficient for them to grow up and function.\n\n You are presuming that the principal had authority over the student outside of school on non-school property. Had this been a field trip, I would agree, but it appears that this wasn't a field trip and he wasn't on school property so IMO, the principal overstepped her bounds. \n \n \n\n That which aids that goal is good. That which detracts from that goal, as indicated by the SCOTUS characterization of disruptive or undermining speech is bad. The pinhead's right to espress \"bong hits for Jesus\" is trumped by the greater good of the other 29 students in the class who are trying to get an already substandard education. This balance is not changed when the one disruptive student turns 18.\n \n\n He wasn't in class; he was across the street. Big difference, IMO.\n \n\n The fact that this incident occured off school property is irrelevant. The incident occured at a gathering of students overseen by the school officials. Nit wit had ample opportunity to unfurl his banner along the 10-mile stretch of road and yet he chose the patch of land opposite the school and the TV camera. By so doing, his banner was in direct opposition to the school's anti-drug policy. Moreover, his proximity to other students and school officials would amount to tacit acceptance of his message if no action were taken. \n\n It's very relevent that he wasn't on school property. When I was an incorrageable \"yoot\", I used to cross the street during lunch to catch a smoke and there was nothing that the school could do about it because I had secured permission to leave school property at lunch.\n \n\n The Yute is seeking compensatory damages from the school official. It would be a poor precedent indeed to accept the judgment of the minor over the adult as to what constitutes a disruption in class.\n\n Now, I think that it's ridiculous that the student is trying to sue the school. If I was their attorney, I'd threaten to file charges againsyt the kid and his parents for truency. emoticon_xgood \n \n\n As to your concern about the future of the country, I am more concerned with folks who do not have any concept of responsibility. Every action (freedom) has a reaction (responsibility).\n\n \n I'm not the kind of parent that will give the school carte blanche control over my children. For one thing, I don't like the liberal agenda that they promote and secondly, I've dealt with enough unionized teachers to know just how screwed up they really can be. emoticon_wow \n \n Instead of te principal taking matters into her own hands, I would rather have seen her make a call to the prents. Discipline, outside of school, is their responsibility and theirs alone.", 
   {}, 
   255025, 
   null, 
   1174438020.0
  ], 
  [
   255054, 
   null, 
   "E Mutz", 
   "Well JP, At least I am able to irritate folks on all sides of the political spectrum. \n \n So, your position is that a high school student has no constitutional rights unless they have a note from their parents saying so?  \n \n I would not suppose that High School students have no rights; however, I disagree with the premise that they have the same rights as adults. If one rejects the premise that minors have the same rights as adults (which they demonstrably do not), it is no great leap to realize that these rights may be subject to adult scrutiny.\n \n You are presuming that the principal had authority over the student outside of school on non-school property. Had this been a field trip, I would agree, but it appears that this wasn't a field trip and he wasn't on school property so IMO, the principal overstepped her bounds. \n \n I see your point; however, my thesis is that when students gather and school officials are present, the officials have a de facto responsibility to those students. Were something to have happened to one of those students, that official would likely have been held responsible for failing to act. \n \n \n He wasn't in class; he was across the street. Big difference, IMO.\n \n The key thing to me is that he was close enough to the school for the media to construe tacit approval of school officials. Again, failing to act would be complicity to advocation of illegal bong hits. \n \n It's very relevent that he wasn't on school property. When I was an incorrageable \"yoot\", I used to cross the street during lunch to catch a smoke and there was nothing that the school could do about it because I had secured permission to leave school property at lunch.\n \n I thought I recognized you. You were one of those stoners with the Dokken T-shirt, admit it! I remember those yutes (southern for yoot). Technically, you were in violation of the law. I don't know how many police cars would have U-turned to arrest ye. Now, had you been outside for a parade when the Olympic torch was passing by and you lit up a lucky in view of the principal. Well...\n \n Now, I think that it's ridiculous that the student is trying to sue the school. If I was their attorney, I'd threaten to file charges againsyt the kid and his parents for truency. \n \n The Supreme Court mentioned that. It would indeed go against laws that forbid one from profiting from a crime, ala OJ. \n \n I'm not the kind of parent that will give the school carte blanche control over my children. For one thing, I don't like the liberal agenda that they promote and secondly, I've dealt with enough unionized teachers to know just how screwed up they really can be. \n \n Instead of te principal taking matters into her own hands, I would rather have seen her make a call to the prents. Discipline, outside of school, is their responsibility and theirs alone.\n \n Honestly, I had concerns about this very thing. Academia is infested with leftist ideology; however, I am less afraid of crimping my kid's right to speech as I am having my kid exposed to...crap.", 
   {
    "unicode_changes_made": true
   }, 
   255043, 
   null, 
   1174443720.0
  ], 
  [
   255058, 
   null, 
   "Phyllis", 
   "Uh....becuase it si a fundamental right, which means that under our system of government is is considered pre-existing...a right that every human being has simply by existing. It is not a reward given by the government for your constribution to society. \n \n People like you make me SERIOUSLY worry about the future of this country. Do you have any concept of \"freedom\" at all?\n\n \n I'm not sure I agree with this. It is my understanding that the First Amendment (and other Constitutional provisions) only apply to US citizens. Thus, for example, the US military does not violate the First Amendment if it regulates the speech of anyone who is not a US citizen.\n \n But I understand your larger point, and would modify it thus: all US citizens are guaranteed the protections in the Constitution regardless of their contribution to society.", 
   {}, 
   255015, 
   null, 
   1174445460.0
  ], 
  [
   255138, 
   null, 
   "JPSartre12", 
   "Well JP, At least I am able to irritate folks on all sides of the political spectrum. \n\n Not irritated at all, just looking for clarification and a good debate. emoticon_xgood \n \n\n So, your position is that a high school student has no constitutional rights unless they have a note from their parents saying so?  \n \n I would not suppose that High School students have no rights; however, I disagree with the premise that they have the same rights as adults. If one rejects the premise that minors have the same rights as adults (which they demonstrably do not), it is no great leap to realize that these rights may be subject to adult scrutiny.\n\n No argument there. We might have some disagreement about the details, but we're in line on principle, so far.\n \n\n You are presuming that the principal had authority over the student outside of school on non-school property. Had this been a field trip, I would agree, but it appears that this wasn't a field trip and he wasn't on school property so IMO, the principal overstepped her bounds. \n \n I see your point; however, my thesis is that when students gather and school officials are present, the officials have a de facto responsibility to those students. Were something to have happened to one of those students, that official would likely have been held responsible for failing to act. \n \n \n He wasn't in class; he was across the street. Big difference, IMO.\n \n The key thing to me is that he was close enough to the school for the media to construe tacit approval of school officials. Again, failing to act would be complicity to advocation of illegal bong hits. \n\n I think that we differ here in interprettion only. IMO, being across the street was a conscious act on his part to remove himself from the school's control.\n \n\n It's very relevent that he wasn't on school property. When I was an incorrageable \"yoot\", I used to cross the street during lunch to catch a smoke and there was nothing that the school could do about it because I had secured permission to leave school property at lunch.\n \n I thought I recognized you. You were one of those stoners with the Dokken T-shirt, admit it! I remember those yutes (southern for yoot). Technically, you were in violation of the law. I don't know how many police cars would have U-turned to arrest ye. Now, had you been outside for a parade when the Olympic torch was passing by and you lit up a lucky in view of the principal. Well...\n\n When I was in HS, I could have a beer and a cigarette in the bar across the street at lunchtime and be perfectly legal. emoticon_xhoho (I was in HS in the early 70's and I'm guessing that Dokken's members were in diapers at the time. ) :) \n \n\n Now, I think that it's ridiculous that the student is trying to sue the school. If I was their attorney, I'd threaten to file charges againsyt the kid and his parents for truency. \n \n The Supreme Court mentioned that. It would indeed go against laws that forbid one from profiting from a crime, ala OJ. \n \n\n Yep. That's why death row prisoners can't make millions writing books, either.\n \n\n I'm not the kind of parent that will give the school carte blanche control over my children. For one thing, I don't like the liberal agenda that they promote and secondly, I've dealt with enough unionized teachers to know just how screwed up they really can be. \n \n Instead of te principal taking matters into her own hands, I would rather have seen her make a call to the prents. Discipline, outside of school, is their responsibility and theirs alone.\n \n Honestly, I had concerns about this very thing. Academia is infested with leftist ideology; however, I am less afraid of crimping my kid's right to speech as I am having my kid exposed to...crap.\n\n \n My kids would have pointed at the stoners and laughed at the sign. I've never had to worry about them. All three were honor students with their heads screwed on straight.emoticon_xgood", 
   {
    "unicode_changes_made": true
   }, 
   255054, 
   null, 
   1174528200.0
  ], 
  [
   255150, 
   null, 
   "Steeeeve", 
   "I think that we differ here in interprettion only. IMO, being across the street was a conscious act on his part to remove himself from the school's control.\nOn the contrary. The student went to where the school was and was with other students at the time as students were allowed to go where the wanted to see the event (obviously not even street space in front of one school for all students). So immediatly you realize that the teacher could never have known the student was skipping. \n \n Either way, the question is not whether or not the teacher had a right to take down the sign but whether she should be allowed to be sued assuming she violated the first amendment....an amendment that states \"congress shall make no law\"", 
   {}, 
   255138, 
   null, 
   1174542360.0
  ], 
  [
   255191, 
   null, 
   "JPSartre12", 
   "On the contrary. The student went to where the school was and was with other students at the time as students were allowed to go where the wanted to see the event (obviously not even street space in front of one school for all students). So immediatly you realize that the teacher could never have known the student was skipping. \n \n Either way, the question is not whether or not the teacher had a right to take down the sign but whether she should be allowed to be sued assuming she violated the first amendment....an amendment that states \"congress shall make no law\"\n\n \n Yours is an \"old-fashioned\" view of constitutionality (unfortunately). We have had several high profile cases in which individuals sued others for violating their civil rights. It appears to be a growing trend. If you can't convict someone of a crime, charge them with a civil rights violation. That way double jepoardy isn't involved. :xcensored", 
   {}, 
   255150, 
   null, 
   1174587600.0
  ], 
  [
   255207, 
   null, 
   "Steeeeve", 
   "Yours is an \"old-fashioned\" view of constitutionality (unfortunately). We have had several high profile cases in which individuals sued others for violating their civil rights. It appears to be a growing trend. If you can't convict someone of a crime, charge them with a civil rights violation. That way double jepoardy isn't involved. :xcensored\n\n \n You don't sue for murder 1 though...you sue for wrongful death. Even so, assuming you can sue for this let us continue?(not I realize court cases say you can...I disagree with them).\n \n What damages have come about? Moreover, civil cases like this normally involve tests to see if the person should have known a violation occured. Finally, was this person acting for the government. I doubt you would claim a 1st amendment violation if the gas station owner came over and told them to take down the sign. \n \n This brings up the question of sovereign immunity and how that applies to the case. Generally the Supreme Court has said that or constitutional torts you can sue the person but they can be immune if either they didn't know what they were doing violated a right or the right doesn't apply to the what the person was doing. To go with this another case said if it is a \"clearly established statutory or constitutional rights of which a reasonable person would have known\" then you are not immune.\n \n So applying this to the facts of this case we see a student who was skipping class show up at a school event mixed in with other students. The principal (or teacher..whatever you wanna call her) had no way of knowing this student was skipping and even so a skipping student can still be forced to come back to school. This student voluntary came back to school. So the teachers actions to take down the sign are not really questioned as you are allowed to restrict speech at a school where it violates school teachings. The second part of this is whether or not the teacher should have known when she brought the student back to her office. Considering 2 courts have differed on this I don't understand how the principal/teacher ever could have known or reasonably should have known. Not only that, the punishment for the sign was reversed a few days later as it was not clear what to do about the situation which makes me believe that at the very least the teacher was acting in good faith. \n \n So now you sue a teacher/prinicpal for actions that she believed to be ok and were fairly reasonable given the circumstances. \n \n I'd have to say that you'd be a fool to allow this student to win.", 
   {}, 
   255191, 
   null, 
   1174598460.0
  ], 
  [
   255265, 
   null, 
   "Caprii", 
   "1. Whether, consistent with the First Amendment,\n public schools may prohibit students from promoting the\n use of illegal substances at school events.\n The school had an event outside the school grounds and in a public arena, for all the public to see, including television. The school has no legal claim to our public domain. \n \n The student was 18 at the time I believe, a legal adult, in public, veiwing an event happening on our public streets. \n \n He has a right to free speech, he will win. If this guy had a banner that said \"I want some Penis Pleasure\", is that offensive? Perhaps, but too bad.\n \n 2. Whether petitioner Morse is entitled to qualified\n immunity from suit based on her decision to discipline a\n student for displaying a large banner containing a slang\n endorsement of marijuana at a school event.\n \n \n Someone must have accountability and I think she is fair game. It was her action that harmed someone else, she should be liable. Aren't we all liable for our own action? I know I am, she should too.", 
   {}, 
   254935, 
   null, 
   1174621320.0
  ], 
  [
   255271, 
   null, 
   "Steeeeve", 
   "1. Whether, consistent with the First Amendment,\n public schools may prohibit students from promoting the\n use of illegal substances at school events.\n The school had an event outside the school grounds and in a public arena, for all the public to see, including television. The school has no legal claim to our public domain. \n \n The student was 18 at the time I believe, a legal adult, in public, veiwing an event happening on our public streets. \n \n He has a right to free speech, he will win. If this guy had a banner that said \"I want some Penis Pleasure\", is that offensive? Perhaps, but too bad.\n I'd be surprised if he won. He was at a school event. You are still under school authority on a field trip are you not? The fact that he was skipping is interesting...but one might say that him joining the event with the school enrolled him in. \n \n Secondly, if he was in the public domain then why isn't the teacher considered to be in a public domain? \n \n Finally, why do you ignore the idea of whether or not she should have known?\n \n \n\n 2. Whether petitioner Morse is entitled to qualified\n immunity from suit based on her decision to discipline a\n student for displaying a large banner containing a slang\n endorsement of marijuana at a school event.\n \n \n Someone must have accountability and I think she is fair game. It was her action that harmed someone else, she should be liable. Aren't we all liable for our own action? I know I am, she should too.\nIf you tore down the side then they couldn't bring suit against you for 1st amendment violation...if I recall correctly.", 
   {}, 
   255265, 
   null, 
   1174630020.0
  ], 
  [
   255322, 
   null, 
   "JPSartre12", 
   "I'd be surprised if he won. He was at a school event. You are still under school authority on a field trip are you not? The fact that he was skipping is interesting...but one might say that him joining the event with the school enrolled him in. \n\n It wasn't a school event. The \"parade' happened to go past the school, right? The student was off school property and if he was 18, then there's no issue with truency.\n \n\n Secondly, if he was in the public domain then why isn't the teacher considered to be in a public domain? \n \n\n Excellent point. If he's judged to have not been involved in a school function, then she should be seen as a private citizen in her dealings with him.\n \n\n Finally, why do you ignore the idea of whether or not she should have known?\n \n\n Since when is ignorance of the law a good defense? emoticon_confused \n \n\n If you tore down the side then they couldn't bring suit against you for 1st amendment violation...if I recall correctly.\n\n I believe that an individual can be prosecuted for violating someone's civil rights, so wouldn't the 1st qualify as a civil right? emoticon_confused", 
   {}, 
   255271, 
   null, 
   1174675500.0
  ], 
  [
   255406, 
   null, 
   "Phyllis", 
   "Excellent point. If he's judged to have not been involved in a school function, then she should be seen as a private citizen in her dealings with him.\n\n \n I made this point earlier.\n \n \nI believe that an individual can be prosecuted for violating someone's civil rights, so wouldn't the 1st qualify as a civil right? emoticon_confused\n\n \n This is not correct. The Bill of Rights does not prevent a private citizen from doing those things which the government is prohibited from doing. This is why an employer can fire an employee for saying the word \"gobbledygook\" without violating the first amendment.", 
   {}, 
   255322, 
   null, 
   1174794900.0
  ], 
  [
   255410, 
   null, 
   "JPSartre12", 
   "I made this point earlier.\n \n \n \n This is not correct. The Bill of Rights does not prevent a private citizen from doing those things which the government is prohibited from doing. This is why an employer can fire an employee for saying the word \"gobbledygook\" without violating the first amendment.\n\n \n It IS correct. An individual can be charged with violating someone's civil rights. Ask Jesse Jackson.:) \n http://www.judicialwatch.org/3567.shtml", 
   {}, 
   255406, 
   null, 
   1174798560.0
  ], 
  [
   255416, 
   null, 
   "daewoo", 
   "Well that would then presuppose that ye come out of the womb with all pre-existing rights. If that is the case, how might a parent legally get the little creature to shaddap at the local Fridays? Can the parent prevent Junior from bearing arms? Frankly, the idea that a minor is in any way capable of exercising or understanding the marriage of freedom and responsibility is absurd. \n\n \n Only absurd if you don't understand the concepts involved. First, rights may be limited if there is a compelling public interest in doing so. Obviously there is a compelling public interest in curtailing the rights of children so they can be raised to NOT be little psychopaths. \n \n That is largely immaterial here, though. Ultimatly the reason that children are treated as less than human in their rights is due to the fact that their parents are wholly responsible for their actions. Parents can be not only held responsible in a civil court, but actually be criminally charged for their childrens actions. Since the parents are legally responsible for all those actions, we give them the legal authority to make all the kids decisions. Otherwise there would be no accountability at all for childrens actions. \n \n In the early 40's, the supreme court ruled that states MUST allow emancipation of children who are younger than full \"adult\" age (from a legal standpoint). Emancipation is essentially a legal procedure where a childs parents (an older child) are relieved of responsibility for that childs actions and the child gains their full rights prior to whatever age has been set for adulthood (currently 18). A child who has been emancipated can even sign contracts and be bound to them as an adult would. \n \n \nIf ye concede that the parent may exercise control over the rights of the minor, ye must locgically accept that said parent may appoint an agent to do same. The educator is in the position of acting as the parent's agent to provide the little heads of mush with an education sufficient for them to grow up and function. That which aids that goal is good. That which detracts from that goal, as indicated by the SCOTUS characterization of disruptive or undermining speech is bad. The pinhead's right to espress \"bong hits for Jesus\" is trumped by the greater good of the other 29 students in the class who are trying to get an already substandard education. This balance is not changed when the one disruptive student turns 18.\n\n \n First, you are wrong. You clearly do not understand the legal precedent that allows parents to dicipline thier children and deprive them of rights.\n \n Second, you are completely dishonest. You confirm here that you DO recognize the fact that the \"child\" here was, in fact, over 18 and NOT a child. You tossed the idiotic and ignorant laced rant about parents dicipline out as a red herring. Red herrings are more effective if there is actually some substance to them. There was none to yours.\n \n Your understanding of right and how and why they are curtailed is bone chilling. There is no precedent in constitutional law related to \"the greater good\" and there sure as hell is none that allows a SINGLE PERSON to decide what is for the greater good of 29 others and curtail the rights of an individual based on what they believe constitutes the greater good. By your logic, if an individual decided it was \"for the greater good\" of 29 people for you to die, they could kill you and they would just be okee dokee. \n \n \n \nThe fact that this incident occured off school property is irrelevant. The incident occured at a gathering of students overseen by the school officials. Nit wit had ample opportunity to unfurl his banner along the 10-mile stretch of road and yet he chose the patch of land opposite the school and the TV camera. By so doing, his banner was in direct opposition to the school's anti-drug policy. Moreover, his proximity to other students and school officials would amount to tacit acceptance of his message if no action were taken. \n\n \n This is the most ludicrous thing you have said so far, and you have said some pretty ludicrous things. If you break into my house in the middle of the night, I can blow your head off. If I do the same on the street in the middle fo the day, people would get upset and there is roughly a 1 in 7 chance that I would be captured and end up in jail. Location is EVERYTHING in this case.\n \n The supreme court has traditionally allowed schools to limit the rights of their pupils ON SCHOOL PROPERTY based on the logic that there is no \"right\" to an education, and the most drastic punishment a school is able to institute is expulsion. Students are essentially there at the schools discretion, therefore the school is free to place restrictions on the students behavior, clothing, and actions. Schools are not, however, allowed to actually enforce any punishments besides suspension and expulsion. For example, if you are a high school kid and you wear inappropriate clothing and refuse to change it, the school can make you leave. They can ask you to change your clothing, but can not FORCE you to do so. Likewise if they tell you to stay after class, or serve a detention, they can NOT do anything to FORCE you to do so. Serving the detention is strictly voluntary. HOWEVER, if you fail to do so, they can suspend or expel you, and if you show up for school anyway, they can have you arrested for trespassing since you have no RIGHT to be there. If they FORCE you to serve your suspension they end up in prison for kidnapping.\n \n Again, though, in this case, it is immaterial. Your entire argument is based on an apparent complete lack of understanding of the concept of \"rights\" and a gross and dishonest mischaracterization of the facts. Here are the facts:\n \n 1. This person was an ADULT. \n 2. This person was NOT AT school\n 3. This person was NOT AT a shool sponsered event\n 4. This person was NOT ON school grounds\n 5. An individual FROM THE SCHOOL acting IN THEIR CAPACITY as a school official ASSAULTED this person on the street, STOLE his property, and CURTAILED this individuals rights to free speech.\n 6. After assault, theft, and a clear and gross violation of his constitutional right, the individual ACTING IN THEIR CAPACITY AS A SCHOOL OFFICIAL chose to use their power in that capacity to FURTHER punish this individual DESPITE the fact that they CLEARLY did not have the LEGAL right to do so.\n \n In theory, this should be an open and shut case. The legal precendet for school officials controlling behavior IN their schools and AT school sponsored events is clearly defined and the precedent is well understood (though apparently not by you). It is VERY CLEARLY LIMITED to activities that take place DURING SCHOOL or school sponsored events. \n \n By your reasoning, we would not need parents or police. The schools woudl just punish kids for everything they ever did right there in school and it would all be good. \n \n \nThe Yute is seeking compensatory damages from the school official. It would be a poor precedent indeed to accept the judgment of the minor over the adult as to what constitutes a disruption in class.\n\n \n Again, a red herring. The judgement of the minor is not is question here. His judgement matters not one bit. The precedent that YOU seem to be suggesting we need to set is one where we accept the judgement of a school official in BFE alaska over that set by 200+ years of constitutional law and the entire concept of jeffersonian democracy. You are literally advocating allowing a SINGLE PERSON to decide singlehandedly what power they may and may not exercise and what rights others may and may not exercise ON A PUBLIC STREET. Congratulations. You, Stalin, Hitler, Mussolini, Mao, and pretty much every other tyrant in the history of the planet have had about the same concept of \"rights\".\n \n \nAs to your concern about the future of the country, I am more concerned with folks who do not have any concept of responsibility. Every action (freedom) has a reaction (responsibility).\n\n \n As good a closing as this is, it is YOU that is attempting to relieve a person of their responsibility. When you assault an individual on the street, steal their property, actively curtail their rights, then inappropriatly abuse the power of your public post to further silence them, you should be held responsible for your actions.\n \n ANYBODY in the US has the right to hold up any dumb XXX sign they want on a public street. That is just part of living here. You REALLY think that Fred Phelps annoying, obscene signs should be protected speech, but an idiotic sign that says \"bong hits for jesus\" is not? The first ammendment covers XXXXXX, too.", 
   {}, 
   255025, 
   null, 
   1174804740.0
  ], 
  [
   255418, 
   null, 
   "daewoo", 
   "I'd be surprised if he won. He was at a school event. You are still under school authority on a field trip are you not? The fact that he was skipping is interesting...but one might say that him joining the event with the school enrolled him in. \n\n \n But he was NOT at a school sponsored event. The school sponsored event was taking place AT THE SCHOOL across the street. JPs example of smoking across the street from the school is a good one (people did the same thing at our high school). \n \n \nSecondly, if he was in the public domain then why isn't the teacher considered to be in a public domain? \n\n \n Because she made it clear that she was acting based on her alleged power as a school official and then used her power as a school official to punish him.\n \n \nIf you tore down the side then they couldn't bring suit against you for 1st amendment violation...if I recall correctly.\n\n \n Yes, they could. Try tearing down one of fred phelps signs. He has people arrested routinely for doing just that. They end up being charged with battery and theft, then he sues them.", 
   {}, 
   255271, 
   null, 
   1174805280.0
  ], 
  [
   255476, 
   null, 
   "E Mutz", 
   "Daewoo! This an unexpected pleasure. It has been entirely to long since yet have directed your singular wit my way. \n \n \n \"Only absurd if you don't understand the concepts involved. First, rights may be limited if there is a compelling public interest in doing so. Obviously there is a compelling public interest in curtailing the rights of children so they can be raised to NOT be little psychopaths. \n \n That is largely immaterial here, though. Ultimatly the reason that children are treated as less than human in their rights is due to the fact that their parents are wholly responsible for their actions. Parents can be not only held responsible in a civil court, but actually be criminally charged for their childrens actions. Since the parents are legally responsible for all those actions, we give them the legal authority to make all the kids decisions. Otherwise there would be no accountability at all for childrens actions. \n \n In the early 40's, the supreme court ruled that states MUST allow emancipation of children who are younger than full \"adult\" age (from a legal standpoint). Emancipation is essentially a legal procedure where a childs parents (an older child) are relieved of responsibility for that childs actions and the child gains their full rights prior to whatever age has been set for adulthood (currently 18). A child who has been emancipated can even sign contracts and be bound to them as an adult would.\" \n \n How wonderfully far from the point. This is a question of how far the school may act in loco parentis. This specific case will determine the applicability of Tinker vs Des Moines School District outside of school ground but within school-sponsored activities, and the question whether pro-drug legalization speech can be prohibited by school districts. Ye are free to disagree with me, but do not presume that I do not understand the concepts involved. \n \n \n First, you are wrong. You clearly do not understand the legal precedent that allows parents to dicipline thier children and deprive them of rights. \n \n Second, you are completely dishonest. You confirm here that you DO recognize the fact that the \"child\" here was, in fact, over 18 and NOT a child. You tossed the idiotic and ignorant laced rant about parents dicipline out as a red herring. Red herrings are more effective if there is actually some substance to them. There was none to yours.\n \n \"Your understanding of right and how and why they are curtailed is bone chilling. There is no precedent in constitutional law related to \"the greater good\" and there sure as hell is none that allows a SINGLE PERSON to decide what is for the greater good of 29 others and curtail the rights of an individual based on what they believe constitutes the greater good.\" \n \n This from the fellow who would have argued for compulsory immunization? I believe ye were arguing for the greater good then. What happened? If ye do not recognize the influence of the greater good in American Politics, I am at a loss how to bring ye around. \n \n Lets see, so far I have been called wrong, dishonest, idiotic, ignorant, and bone chilling. It is comforting to know I have such an effect on ye. \n \n By your logic, if an individual decided it was \"for the greater good\" of 29 people for you to die, they could kill you and they would just be okee dokee. \n \n Two can play the extreme game. By your logic if one person decided 29 should die ye and they would be okee dokee. Come now. Ye are better than that.\n \n This is the most ludicrous thing you have said so far, and you have said some pretty ludicrous things. If you break into my house in the middle of the night, I can blow your head off. If I do the same on the street in the middle fo the day, people would get upset and there is roughly a 1 in 7 chance that I would be captured and end up in jail. Location is EVERYTHING in this case.\n Precisely. Location is everything which was my point to begin with. Had the yute gone anywhere else along the 10 mile path of the torch instead at the location of the school gathering he would not be arguing before the supreme court. I have never said that the yute did not have the right to be an idiot, just that there are limits to where he can so exercise said idiocy.\n \n The supreme court has traditionally allowed schools to limit the rights of their pupils ON SCHOOL PROPERTY based on the logic that there is no \"right\" to an education, and the most drastic punishment a school is able to institute is expulsion. Students are essentially there at the schools discretion, therefore the school is free to place restrictions on the students behavior, clothing, and actions. Schools are not, however, allowed to actually enforce any punishments besides suspension and expulsion. For example, if you are a high school kid and you wear inappropriate clothing and refuse to change it, the school can make you leave. They can ask you to change your clothing, but can not FORCE you to do so. Likewise if they tell you to stay after class, or serve a detention, they can NOT do anything to FORCE you to do so. Serving the detention is strictly voluntary. HOWEVER, if you fail to do so, they can suspend or expel you, and if you show up for school anyway, they can have you arrested for trespassing since you have no RIGHT to be there. If they FORCE you to serve your suspension they end up in prison for kidnapping.\n \n Again, though, in this case, it is immaterial. Your entire argument is based on an apparent complete lack of understanding of the concept of \"rights\" and a gross and dishonest mischaracterization of the facts. Here are the facts:\n \n 1. This person was an ADULT. Enrolled in School and therefore subject to the authority of the school official\n 2. This person was NOT AT school. The person was at a school supervised event\n 3. This person was NOT AT a shool sponsered event. Nevertheless, the event was supervised by school personnel who would be held liable for any harm that befell those students. \n 4. This person was NOT ON school grounds. Irrelevent. The football coach is still responsible when the team travels.\n 5. An individual FROM THE SCHOOL acting IN THEIR CAPACITY as a school official ASSAULTED this person on the street, STOLE his property, and CURTAILED this individuals rights to free speech. Oh my dear sir, please. The school official reacted to a sign that undermines the school's anti-drug policy. \n 6. After assault, theft, and a clear and gross violation of his constitutional right, the individual ACTING IN THEIR CAPACITY AS A SCHOOL OFFICIAL chose to use their power in that capacity to FURTHER punish this individual DESPITE the fact that they CLEARLY did not have the LEGAL right to do so. \n \n In theory, this should be an open and shut case. The legal precendet for school officials controlling behavior IN their schools and AT school sponsored events is clearly defined and the precedent is well understood (though apparently not by you). \n \n My what long paragraphs ye write! The fact that this is going to the SCOTUS after a split decision is testimony to the fact that this is NOT an open and shut case. You can gush all the ink ye want and not demonstrate otherwise. \n \n By your reasoning, we would not need parents or police. The schools woudl just punish kids for everything they ever did right there in school and it would all be good. \n \n And contrariwise by your reasoning, there would be no means for school officials to exert control over disruptive influences. We are playing the extreme game again!\n \n Again, a red herring. The judgement of the minor is not is question here. His judgement matters not one bit. The precedent that YOU seem to be suggesting we need to set is one where we accept the judgement of a school official in BFE alaska over that set by 200+ years of constitutional law and the entire concept of jeffersonian democracy. You are literally advocating allowing a SINGLE PERSON to decide singlehandedly what power they may and may not exercise and what rights others may and may not exercise ON A PUBLIC STREET. Congratulations. You, Stalin, Hitler, Mussolini, Mao, and pretty much every other tyrant in the history of the planet have had about the same concept of \"rights\".\n \n Careful how many dictators ye compare me to in one sentence, you'll give yourself a nosebleed. \"I'll Take Daewoo Red Herrings for $1,000 please Alex.\" If you can come down from the hysterical height from which ye have climbed, ye will note that I have argued for limited authority of school officials in determining activities and speech contrary or disruptive to its educational goal. No gas chambers, no on time trains. \n \n \"As good a closing as this is, it is YOU that is attempting to relieve a person of their responsibility. When you assault an individual on the street, steal their property, actively curtail their rights, then inappropriatly abuse the power of your public post to further silence them, you should be held responsible for your actions.\n \n ANYBODY in the US has the right to hold up any dumb XXX sign they want on a public street. That is just part of living here. You REALLY think that Fred Phelps annoying, obscene signs should be protected speech, but an idiotic sign that says \"bong hits for jesus\" is not? The first ammendment covers XXXXXX, too.\"\n \n Glad ye brought up Mr. Phelps, he of the Military Funeral protest. The States have used the greater good philosophy to construct legislation to curtail funeral protests. Idiotic speech can and does have geographic limits. This is what is being argued here. \n \n Since ye rely so heavily on ad hominem and vitriol, may I suggest the following words to help ye prove your point: totalitarian, fascist, idealogue, neocon, fundamentalist, etc. Don't worry about looking them up, they fit right in to your debate technique. Just insert them randomly as ye have done heretofore.", 
   {
    "unicode_changes_made": true
   }, 
   255418, 
   null, 
   1174872480.0
  ], 
  [
   255490, 
   null, 
   "Steeeeve", 
   "It IS correct. An individual can be charged with violating someone's civil rights. Ask Jesse Jackson.:) \n http://www.judicialwatch.org/3567.shtml\n\n \n Phyllis is correct...a CA civil rights claim is not the same as a claim against a constitutional right violation.", 
   {}, 
   255410, 
   null, 
   1174881780.0
  ], 
  [
   255491, 
   null, 
   "Steeeeve", 
   "But he was NOT at a school sponsored event. The school sponsored event was taking place AT THE SCHOOL across the street. JPs example of smoking across the street from the school is a good one (people did the same thing at our high school). \n irrelevant when students are allowed across the street as well.\n \n \nBecause she made it clear that she was acting based on her alleged power as a school official and then used her power as a school official to punish him.\nThen he made it very clear that he is now currently in school as he was with other students enrolled in school that day with a banner being displayed at an event of the school. At the very least the student didn't make it clear (at the time) that he was not enrolled in school that day and it is also very clear that the teacher had no way of knowing 1) this student was skipping and 2) that she couldn't punish a student for a violation like this.\n \n \nYes, they could. Try tearing down one of fred phelps signs. He has people arrested routinely for doing just that. They end up being charged with battery and theft, then he sues them.\nbut not for a violation of the first amendment.", 
   {}, 
   255418, 
   null, 
   1174882020.0
  ], 
  [
   255639, 
   null, 
   "JPSartre12", 
   "Phyllis is correct...a CA civil rights claim is not the same as a claim against a constitutional right violation.\n\n \n There are civil and there are criminal civil rights violations. \n http://www.usdoj.gov/crt/crim/faq.htm#diff", 
   {}, 
   255490, 
   null, 
   1174970220.0
  ], 
  [
   255649, 
   null, 
   "Steeeeve", 
   "There are civil and there are criminal civil rights violations. \n http://www.usdoj.gov/crt/crim/faq.htm#diff\n\n \n Again, this regarding a violation of constitutional rights..it is not a civil rights claim. I am not aware of normal people being sued for violating the first amendment.", 
   {}, 
   255639, 
   null, 
   1174977000.0
  ], 
  [
   255724, 
   null, 
   "daewoo", 
   "How wonderfully far from the point. This is a question of how far the school may act in loco parentis. This specific case will determine the applicability of Tinker vs Des Moines School District outside of school ground but within school-sponsored activities, and the question whether pro-drug legalization speech can be prohibited by school districts. Ye are free to disagree with me, but do not presume that I do not understand the concepts involved. \n\n \n No, you do not seem to understand the concepts involved or you would not have tried to make the ludicrous claim that there is somehow support for your position in the concept of loco parentis. \n \n Maybe you should try reading the tinker decision:\n \n http://www.bc.edu/bc_org/avp/cas/comm/free_speech/tinker.html\n \n It is a fairly strong statement for the recognition of students rights. Some choice excerpts from the majority decision:\n \n \nThe District Court concluded that the action of the school authorities was reasonable because it was based upon their fear of a disturbance from the wearing of the armbands. But, in our system, undifferentiated fear or apprehension of disturbance is not enough to overcome the right to freedom of expression. Any departure from absolute regimentation may cause trouble. Any variation from the majority's opinion may inspire fear. Any word spoken, in class, in the lunchroom, or on the campus, that deviates from the views of another person may start an argument or cause a disturbance. But our Constitution says we must take this risk, Terminiello v. Chicago, 337 U.S. 1 (1949); and our history says that it is this sort of hazardous freedom--this kind of openness--that is [509] the basis of our national strength and of the independence and vigor of Americans who grow up and live in this relatively permissive, often disputatious, society. \n \n In order for the State in the person of school officials to justify prohibition of a particular expression of opinion, it must be able to show that its action was caused by something more than a mere desire to avoid the discomfort and unpleasantness that always accompany an unpopular viewpoint. Certainly where there is no finding and no showing that engaging in the forbidden conduct would \"materially and substantially interfere with the requirements of appropriate discipline in the operation of the school,\" the prohibition cannot be sustained. Burnside v. Byars, supra, at 749. \n \n\n \n \nIn our system, state-operated schools may not be enclaves of totalitarianism. School officials do not possess absolute authority over their students. Students in school as well as out of school are \"persons\" under our Constitution. They are possessed of fundamental rights which the State must respect, just as they themselves must respect their obligations to the State. In our system, students may not be regarded as closed-circuit recipients of only that which the State chooses to communicate. They may not be confined to the expression of those sentiments that are officially approved. In the absence of a specific showing of constitutionally valid reasons to regulate their speech, students are entitled to freedom of expression of their views. As Judge Gewin, speaking for the Fifth Circuit, said, school officials cannot suppress \"expressions of feelings with which they do not wish to contend.\" Burnside v. Byars, supra, at 749. \n\n \n \n To find as you think is appropriate would essentially be an overruling of tinker, not an extension of it. \n \n \nThis from the fellow who would have argued for compulsory immunization? I believe ye were arguing for the greater good then. What happened? If ye do not recognize the influence of the greater good in American Politics, I am at a loss how to bring ye around. \n \n Lets see, so far I have been called wrong, dishonest, idiotic, ignorant, and bone chilling. It is comforting to know I have such an effect on ye. \n\n \n Compulsory immunization has already been argued and it has been confirmed by EVERY district court AND the supreme court that the \"compelling public interest\" involved in compulsory immunization is valid.\n \n There is no legal precedent for curtailing rights based on the \"greater good\". That as been argued in court more times than anybody can count. Virtually every time a law is declared unconstitutional there has been a \"greater good\" argument. The \"greater good\" and \"compelling public interest\" are NOT the same thing. \n \n \nTwo can play the extreme game. By your logic if one person decided 29 should die ye and they would be okee dokee. Come now. Ye are better than that.\n\n \n No, because by my way of thinking, all of those 29 people have fundamental rights that cannot be infringed by the simple decision of another, or even a majority vote. \n \n \n \nMy what long paragraphs ye write! The fact that this is going to the SCOTUS after a split decision is testimony to the fact that this is NOT an open and shut case. You can gush all the ink ye want and not demonstrate otherwise. \n\n \n Do you even understand why this is going to the supreme court? If the guy was simply suing the school, this would have been over a long time ago. tinker, which you cited apparently without reading above, clearly applies to this case. This would have been over a long time ago if he was just suing the school. He is not.\n \n The quesiton here is whether the school administrator here, acting in her capacity as a school administrator, can PERSONALLY be sued for her actions. \n \n This case has very little to do with the amount of control that schools can exert on their students and the limits of a students rights. That was established in tinker. This case is about whether or not the INDIVIDUAL can be held responsible. Traditionally school officials have enjoyed what amounts to personal immunity in cases like this. They have been protected by their titles. What this case essentially does is seek to end that immunity and place responsibility not only on the school district, but on the individual.\n \n \nAnd contrariwise by your reasoning, there would be no means for school officials to exert control over disruptive influences. We are playing the extreme game again!\n\n \n Again, you are misrepresenting my position entirely, and i think you know it. My assertation was a DIRECT correlation to your position. If they adopted the E Muntz advocated position in full, that would be the direct result. \n \n I believe I wrote several paragraphs outlining the fact that NOW schools have only 2 real tools at their disposal to maintain order...suspension and expulsion. Everything else is voluntary on the part of the student.\n \n \nCareful how many dictators ye compare me to in one sentence, you'll give yourself a nosebleed. \"I'll Take Daewoo Red Herrings for $1,000 please Alex.\" If you can come down from the hysterical height from which ye have climbed, ye will note that I have argued for limited authority of school officials in determining activities and speech contrary or disruptive to its educational goal. No gas chambers, no on time trains. \n\n \n The \"limited authority\"? You have argued that a school official has the right to curtail the first ammendment rights of an adult on a public street. That is not LIMITED AUTHORITY. My representation of your argument is accurate. You are advocating allowing a single individual to decide what FUNDAMENTAL rights others may and may not exercise on a public street.\n \n \nGlad ye brought up Mr. Phelps, he of the Military Funeral protest. The States have used the greater good philosophy to construct legislation to curtail funeral protests. Idiotic speech can and does have geographic limits. This is what is being argued here. \n\n \n BS\n \n The funeral protest laws are ALL based on National Archives and Records Administration vs Favish where the supreme court \"recognizes surviving family members' right to personal privacy with respect to their close relative's death-scene images\".\n \n \nFamily members have a personal stake in honoring and mourning their dead and objecting to unwarranted public exploitation that, by intruding upon their own grief, tends to degrade the rites and respect they seek to accord to the deceased person who was once their own \n\n \n The logic behind the legislation in question is not related to the Stalinistic ideal of wimsical removal of rights and privelages based on a fluid and illogical claim of a \"greater good\". They are based on the implied right of privacy of the family members of the deceased.", 
   {
    "unicode_changes_made": true
   }, 
   255476, 
   null, 
   1175025120.0
  ], 
  [
   255732, 
   null, 
   "daewoo", 
   "irrelevant when students are allowed across the street as well.\n\n \n Then would it have been appropriate for her to assault a non student since, after all, there were students ont he same side of the street.\n \n I finally got around to doing a little more looking inot this. This was not even anything that resembels a \"school sponsored activity\". The school did not even mandate that the kids stay and watch the parade. They just started school late that day. Apparently kids who did not want to watch the parade just stayed home and showed up late when school actually started.\n \n \nThen he made it very clear that he is now currently in school as he was with other students enrolled in school that day with a banner being displayed at an event of the school. At the very least the student didn't make it clear (at the time) that he was not enrolled in school that day and it is also very clear that the teacher had no way of knowing 1) this student was skipping and 2) that she couldn't punish a student for a violation like this.\n\n \n Enrollment in school is irrelevant. \n \n First, go to my above post to muntz and read tinker. Under the tinker test, the school districts ban on the sign is clearly unconstitutional. The question here is whether the administrators actions were illegal and whether she can be held personally responsible for them. \n \n Traditionally, teachers and school administrators have gotten away witht he nazi war criminal excuse...\"I was just following the districts rules\". This case has the potential to change that. \n \n \nbut not for a violation of the first amendment.\n\n \n Yes, for violation of his first ammendment rights. \n \n You have to keep in mind that every employment discrimination case is a civil rights case. Keeping that in mind, I think it would be difficult to claim that you can not sue another individual for violation of your civil rights. \n \n Ultimatly, though, this is not as complex as all that. She is a public official. Are you familiar with \"color of law\" cases? \n \n http://www.fbi.gov/hq/cid/civilrights/color.htm\n \n \nPreventing abuse of this authority, however, is equally necessary to the health of our nation's democracy. That's why it's a federal crime for anyone acting under \"color of law\" willfully to deprive or conspire to deprive a person of a right protected by the Constitution or U.S. law. \"Color of law\" simply means that the person is using authority given to him or her by a local, state, or federal government agency. \n\n \n The question being asked here is essentially whether a color of law case can be brought against a school official. \n \n After reviewing the case, I think there is an issue of quailified immunity here. Qualified immunity is a concept that applies to suing an individual of violating your civil rights that essentially protects defendants in civil rights cases as long as their conduct does not violate established rights that the defendant should have been aware of.\n \n The administrator has been arguing pretty much all along that while the students first ammendment rights may have been violated, in the context of the situation it was not apparent, nor would it have been apparent to an individual practicing reasonable discretion, that those first ammendment rights were in force (that is horribly worded but hopefully you understand what I am saying here). \n \n Coupled with the \"following orders\" defense, the adminsitrator may well get off on this one. \n \n It is impoirtant to note that qualified immunity is a \"first bite free\" arrangement. While the current administrator may not be found liable due to qualified immunity issues, every other one after this will be.", 
   {
    "unicode_changes_made": true
   }, 
   255491, 
   null, 
   1175027340.0
  ], 
  [
   255780, 
   null, 
   "Steeeeve", 
   "Then would it have been appropriate for her to assault a non student since, after all, there were students ont he same side of the street.\n \n I finally got around to doing a little more looking inot this. This was not even anything that resembels a \"school sponsored activity\". The school did not even mandate that the kids stay and watch the parade. They just started school late that day. Apparently kids who did not want to watch the parade just stayed home and showed up late when school actually started.\n \n So school was not in session then? If this is the thought then the teacher was not acting as one and therefore can't be said to have violated the first amendment.\n \n \n\n Enrollment in school is irrelevant. \n \n First, go to my above post to muntz and read tinker. Under the tinker test, the school districts ban on the sign is clearly unconstitutional. The question here is whether the administrators actions were illegal and whether she can be held personally responsible for them. \n \n Traditionally, teachers and school administrators have gotten away witht he nazi war criminal excuse...\"I was just following the districts rules\". This case has the potential to change that. \nEnrollment is relevant for the use of the Tinker test. Furthermore, this test has been eroded over the years and many feel that if this did apply then it would 1) admit the student was a student at the time and 2) The teacher could justify taking the sign down as a valid reason (not undermining a school message).\n \n \n\n Yes, for violation of his first ammendment rights. \n \n You have to keep in mind that every employment discrimination case is a civil rights case. Keeping that in mind, I think it would be difficult to claim that you can not sue another individual for violation of your civil rights. \n \n Ultimatly, though, this is not as complex as all that. She is a public official. Are you familiar with \"color of law\" cases? \n \n http://www.fbi.gov/hq/cid/civilrights/color.htm\nThe quote there was that a citizen in a nongovernment authority role cannot be sued for a first amendment violation. I have never seen a case where one has succeeded in this.\n \n The \"color of law\" thing was the same thing I was talking about earlier. To claim this person violated the students rights you must show that 1) She did so knowlingly and 2) If she didn't know then she should have known.\n \n Considering 2 courts have decided differently on this I find it hard to believe that she should have know or even did know.\n \n \n \n\n The question being asked here is essentially whether a color of law case can be brought against a school official. \n \n After reviewing the case, I think there is an issue of quailified immunity here. Qualified immunity is a concept that applies to suing an individual of violating your civil rights that essentially protects defendants in civil rights cases as long as their conduct does not violate established rights that the defendant should have been aware of.\n \n The administrator has been arguing pretty much all along that while the students first ammendment rights may have been violated, in the context of the situation it was not apparent, nor would it have been apparent to an individual practicing reasonable discretion, that those first ammendment rights were in force (that is horribly worded but hopefully you understand what I am saying here). \n \n Coupled with the \"following orders\" defense, the adminsitrator may well get off on this one. \n \n It is impoirtant to note that qualified immunity is a \"first bite free\" arrangement. While the current administrator may not be found liable due to qualified immunity issues, every other one after this will be.\nYou just stated what I did above and what I have been saying all along. At the very least she will get off for not knowing it was wrong if it fact it was. The decision will probably be in 2 parts...1) was it wrong and 2) is she liable for this. I think the easiest one to decide is 2 where you would say she is not liable. 1 is a harder question because if the student is to be considered a student at the time then it is not wrong. The defense argued that this student should be able to hang this poster up at a pep rally if he so chosed. I think this is probably unlikely but the situation across the street is too close to call. If enrolled in school for that day then you are not given free speech overall. It'll be close.", 
   {}, 
   255732, 
   null, 
   1175036820.0
  ], 
  [
   255857, 
   null, 
   "E Mutz", 
   "Daewoo,\n \n I appreciate the education your posts provide. In the spirit of further learning, may I continue my dissent:\n \n To begin, we have spent a fair amount of energy discussing the catastrophic effects on society if our respective views were taken to extremes. Ye fear the totalitarian state, I the tyranny of the individual. Stalin, and unlimited Bong Hits for Jesus are presumably the wages of concession. But we are both thinking individuals and as such we may dispense with such hyperbole that gets rather away from the nucleus of the argument.\n \n In the example regarding the 29 vs 1, the hysteria holds that either one dies or 29. Where you fear the power of the 29 to oppress the 1, I recognize the compelling public interest for the 29 to be free of outburst from the one at a school supervised event. I am in no way arguing for carte blanche for the school. Neither, presumably, are ye arguing that any individual regardless of age, location, or environment may disrupt and cause harm to the educational process of the greater number. So putting aside notions of Stalin and anarchy we may see that we are in a tussle over who may construct limits, where they may be constructed, how they may be enforced and by whom.\n \n \n Your wizardry in calling up pages of case law, which heretofore has been exemplary, but tiresome to my pollen-addled eyes, has been appreciated for its educational value. I am not one to get tied around the bend on matters legal, but matters philosophical. It is for that reason that I have not delved into that legal world in which you reign but rather remained within that happy little philosophical world that knows no attorneys, only olives and togas. \n \n I will have to conclude that your understanding of Tinkeris greater than my own, as I am admittedly not a legal expert. You were kind enough to post sections of that ruling; however, you neglected to post the following sections from same: (underlined emphasis is my own)\n \n \"In West Virginia v. Barnette, supra, this Court held that under the First Amendment, the student in public school may not be compelled to salute the flag. Speaking through Mr. Justice Jackson, the Court said:\n \"The Fourteenth Amendment, as now applied to the States, protects the citizen against the State itself and all of its creatures--Boards of Education not excepted. These have, of course, important, delicate, and highly discretionary functions, but none that they may not perform within the limits of the Bill of Rights. That they are educating the young for citizenship is reason for scrupulous protection of Constitutional freedoms of the individual, if we are not to strangle the free mind at its source and teach youth to discount important principles of our government as mere platitudes.\" 319 U.S., at 637. \n \n On the other hand, the Court has repeatedly emphasized the need for affirming the comprehensive authority of the States and of school officials, consistent with fundamental constitutional safeguards, to prescribe and control conduct in the schools. See Epperson v. Arkansas, supra, at 104; Meyer v. Nebraska, supra, at 402. Our problem lies in the area where students in the exercise of First Amendment rights collide with the rules of the school authorities....\n \n ...As we have discussed, the record does not demonstrate any facts which might reasonably have led school authorities to forecast substantial disruption of or material interference with school activities, and no disturbances or disorders on the school premises in fact occurred. These petitioners merely went about their ordained rounds in school. Their deviation consisted only in wearing on their sleeve a band of black cloth, not more than two inches wide. They wore it to exhibit their disapproval of the Vietnam hostilities and their advocacy of a truce, to make their views known, and, by their example, to influence others to adopt them. They neither interrupted school activities nor sought to intrude in the school affairs or the lives of others. They caused discussion outside of the classrooms, but no interference with work and no disorder. In the circumstances, our Constitution does not permit officials of the State to deny their form of expression.\"\n \n I wondered why ye would not have added that to the extant list of quotes ye had earlier presented. Perhaps it was mere oversight, or perhaps not because it appears to my philosophy addled mind to suggest a standard for what does and does not constitute substantial disruption. Further, I recognize that if the disruption was viewed by the school official to \"forecast substantial disruption of or material interference with school activities\", viz-a-viz, the school anti-drug policy and the prospect of encouraging students to engage in Bong Hits For Jesus, why that would indeed appear to fit the standard set by Tinker.\n \n To me, it does not approach Stalinism to suggest that the Court may consider the difference in disruption caused by a \"band of black cloth not more than two inches wide\" and a 14 ft banner with a potentially pro-drug message and consider whether the event was supervised or not. But I yield to your better understanding on such matters to show where I am misinterpreting the above language.", 
   {
    "unicode_changes_made": true
   }, 
   255780, 
   null, 
   1175109360.0
  ], 
  [
   256244, 
   null, 
   "daewoo", 
   "Daewoo,\n \n I appreciate the education your posts provide. In the spirit of further learning, may I continue my dissent:\n \n To begin, we have spent a fair amount of energy discussing the catastrophic effects on society if our respective views were taken to extremes. Ye fear the totalitarian state, I the tyranny of the individual. Stalin, and unlimited Bong Hits for Jesus are presumably the wages of concession. But we are both thinking individuals and as such we may dispense with such hyperbole that gets rather away from the nucleus of the argument.\n \n In the example regarding the 29 vs 1, the hysteria holds that either one dies or 29. Where you fear the power of the 29 to oppress the 1, I recognize the compelling public interest for the 29 to be free of outburst from the one at a school supervised event. I am in no way arguing for carte blanche for the school. Neither, presumably, are ye arguing that any individual regardless of age, location, or environment may disrupt and cause harm to the educational process of the greater number. So putting aside notions of Stalin and anarchy we may see that we are in a tussle over who may construct limits, where they may be constructed, how they may be enforced and by whom.\n\n \n This is more or less correct. In this cse, they were \"enforced\" clearly under the color of law, against an adult individual, on a public street, who attended the school but was not, at the time, at a school sponsored activity or on school property.\n \n A far wider question would be whether the shool district had the right to enact such a ban to begin with. Such bans have been struck down in several states, including here in kansas, where a student won a lawsuit against a local schol district because they were unable to show that his wearing of a shirt with a hemp leaf on it was fundamentally disruptive or materially undermined the school districts anti drug program. \n \n \n \nYour wizardry in calling up pages of case law, which heretofore has been exemplary, but tiresome to my pollen-addled eyes, has been appreciated for its educational value. I am not one to get tied around the bend on matters legal, but matters philosophical. It is for that reason that I have not delved into that legal world in which you reign but rather remained within that happy little philosophical world that knows no attorneys, only olives and togas. \n \n I will have to conclude that your understanding of Tinkeris greater than my own, as I am admittedly not a legal expert. You were kind enough to post sections of that ruling; however, you neglected to post the following sections from same: (underlined emphasis is my own)\n\n \n That is becuase they do not materialy change the case, and in order to really analyze them, you have to get into WV vs Barnett and Meyer V Nebraska. Lets take a look at the third section, though, that essentially establishes the Tinker test:\n \n \n \n[B]\"In West Virginia v. Barnette, supra, this Court held that under the First Amendment, the student in public school may not be compelled to salute the flag. Speaking through Mr. Justice Jackson, the Court said:\n \"The Fourteenth Amendment, as now applied to the States, protects the citizen against the State itself and all of its creatures--Boards of Education not excepted. These have, of course, important, delicate, and highly discretionary functions, but none that they may not perform within the limits of the Bill of Rights. That they are educating the young for citizenship is reason for scrupulous protection of Constitutional freedoms of the individual, if we are not to strangle the free mind at its source and teach youth to discount important principles of our government as mere platitudes.\" 319 U.S., at 637. \n \n On the other hand, the Court has repeatedly emphasized the need for affirming the comprehensive authority of the States and of school officials, consistent with fundamental constitutional safeguards, to prescribe and control conduct in the schools. See Epperson v. Arkansas, supra, at 104; Meyer v. Nebraska, supra, at 402. Our problem lies in the area where students in the exercise of First Amendment rights collide with the rules of the school authorities....\n \n ...As we have discussed, the record does not demonstrate any facts which might reasonably have led school authorities to forecast substantial disruption of or material interference with school activities, and no disturbances or disorders on the school premises in fact occurred. These petitioners merely went about their ordained rounds in school. Their deviation consisted only in wearing on their sleeve a band of black cloth, not more than two inches wide. They wore it to exhibit their disapproval of the Vietnam hostilities and their advocacy of a truce, to make their views known, and, by their example, to influence others to adopt them. They neither interrupted school activities nor sought to intrude in the school affairs or the lives of others. They caused discussion outside of the classrooms, but no interference with work and no disorder. In the circumstances, our Constitution does not permit officials of the State to deny their form of expression.\"\n\n \n Ultimatly, the part I bolded above is the \"test\" established by the Tinker court. In order for a school, or a school district, to enact bans on free speech, they must be able to show that the activity in question causes, or has a high probability of causing, a material disruption that would be detrimental to other students. For example, streaking during an assembly would cause a material disruption. Wandering around the hallways with an air horn woudl do the same. In several states, handing out certain leaflets has been ruled a material disruption. Courts have consistantly ruled that signage either displayed in general, or on clothing, does not constitute a material disruption.\n \n Look at the case in question here. What would the likely effects have been if the school offocial had not acted when the student unrolled the sign? Likely a few people would have laughed, the parade would have passed, and the kid would have then rolled the sign up and thrown it away. There is no disruption there. Some people may have had their moral sensibilities assaulted, but under our system of rights based law we do not allow for restriction of rights based on the potential offense of individuals in a public venue. \n \n \n \nI wondered why ye would not have added that to the extant list of quotes ye had earlier presented. Perhaps it was mere oversight, or perhaps not because it appears to my philosophy addled mind to suggest a standard for what does and does not constitute substantial disruption. Further, I recognize that if the disruption was viewed by the school official to \"forecast substantial disruption of or material interference with school activities\", viz-a-viz, the school anti-drug policy and the prospect of encouraging students to engage in Bong Hits For Jesus, why that would indeed appear to fit the standard set by Tinker.\n \n To me, it does not approach Stalinism to suggest that the Court may consider the difference in disruption caused by a \"band of black cloth not more than two inches wide\" and a 14 ft banner with a potentially pro-drug message and consider whether the event was supervised or not. But I yield to your better understanding on such matters to show where I am misinterpreting the above language.\n\n \n The schools anti drug policy is, in this regard, unconstitutional. When I was on the local school board (whihc is why I am even marginally familiar with Tinker) we dealt with similar questions in several occasion. Ultimatly what it boils down ot is you haev to ask yourself \"does it really hurt anything?\"\n \n In order for their ban (which as I understand it has already been found unconstitutional and removed from district policy) to be allowable, they would have to show that the presence of signage that is drug related actually causes material disruption to their academic goals. While I would agree that a ban on signage that is drug related on school property would be a good thing, \"good thing\" is not a recognized lagal argument for restriction of rights. Ultimatly in order for such a ban to be constitutional you would have to argue that having such signage on the premisie would make drug use at school more prevelant, or that students who would not usually take drugs would do so SOLEY on the basis of the signs. That is certainly not reasonable. You wuld never be able to sell it to a judge.\n \n There is another issue here, which is a bright line rule when it comes to school authority. Typically, schools are responisble for their students, and have the power to regulate their activities, on school property, or when they are on ORGANIZED school outings. An organized school outing would be something like a field trip where teachers woudl reasonabley be expected to be directly supervising all students in a controlled environment. At best, you could argue that the event in question MAY HAVE BEEN a disorganized school function, analogous to a skating party (we had skating parties when I was in grade school...skating at the local roller rink...don't know if they have htem other places). At a disorganized school function, held off of school property, the school has not responsibility to the students or ability to dicipline them. \n \n IMO, the school district in this case hung the administrator out to dry. They essentially admitted right from the start that this was a disorganized activity and argued that the teacher was acting outside her authority. IF they had stood by their administrator, this would have been a vs school district case. Instead they dodged the bullet and turned it into a color of law case essentially by saying \"she was acting on her own\". A nifty way to absolve themselves of responsibility, but they completely hung that administrator out to dry. It was their weasely lack of support for their employee that turned this case into what it is...a color of law case.\n \n The constitutional principals here have been settled. There is no question as far as the court is concered that she violated the guys civil rights. The only question os whether this is a color of law case where he can pursue a remedy in civil court. His side argues that YES, he should be able to, since she used her position and authority as a school offocial to violate his rights. Her side argues that while she DID use her position and authority to violate his rights, that under the circumstances that she did not recognize this, and it ws not unreasonable for her to drow that conclusion even practicing due diligence.\n \n Since both sides have already admitted that the students rights WERE violated, and it was illegal, the only real argument here is the color of law one, which, IMO, boils down to a question of due diligence. I think that the administrator is likely to loose. Here is why (and steeeve, I want your feedback on this).\n \n Her actions ON THE DAY IN QUESTION were, IMO, reasonable given the circumstances and the somewhat hazy nature of the activity. Everybody seems to accept that the students rights were violated. It was done at the spur of the moment by an individual who ASSUMED they were acting soley within their discretion as a school administrator and were acting correctly.\n \n Where I think the administrator screwed herself is in the later suspension. At that point, the student had already made a first ammendment argument. IMO exercising due diligence in that circumstance would have required that the administrator re-examine her position and seek clarification from her superiors. She failed to do so. She simply suspended the kid on her own without taking any steps to address what was a serious accusation. While it could be argued that she acted in the heat of the moment and made a snap judgement call at the time, thus lightening the burden associated with due discretion, it seems like she would be hard pressed to argue that days lter when she suspended the guy that she had not had time to exercise it.", 
   {
    "unicode_changes_made": true
   }, 
   255857, 
   null, 
   1175375520.0
  ], 
  [
   256404, 
   null, 
   "Steeeeve", 
   "Daewoo,\n \n You need to realize that Tinker has been eroded over the years and was questionable even at the time it was decided (probably why it was eroded by the Reinquest court).\n \n If you have access to Westlaw then you can see the progression beyond Tinker...if not take a look at Fraser among others than have eroded the ruling in that case.\n \n If you can be suspended for wearing a confederate flag jacket that didn't result in any violence then you can certainly be suspended for any drug banner.", 
   {}, 
   256244, 
   null, 
   1175496240.0
  ], 
  [
   256442, 
   null, 
   "daewoo", 
   "Daewoo,\n \n You need to realize that Tinker has been eroded over the years and was questionable even at the time it was decided (probably why it was eroded by the Reinquest court).\n \n If you have access to Westlaw then you can see the progression beyond Tinker...if not take a look at Fraser among others than have eroded the ruling in that case.\n \n If you can be suspended for wearing a confederate flag jacket that didn't result in any violence then you can certainly be suspended for any drug banner.\n\n \n I have done some searching and reading and I am not really seeing substantial erosion of tinker. There have been 4 cases regarding the free speech rights of students heard before the supreme court:\n \n Tinker v. Des Moines Independent Community School District \n \n Already covered this one\n \n  Bethel School District No. 403 v. Fraser \n \n This one was a case regarding lewd and obscene speech in a school assembly. The court essentially ruled that the right of free speech does not give a student the right to deliver an obscene speech in a room full of 14 yr old kids. This has been seen by some as an erosion of tinker, but is it? I do not have the right, as an adult, to give an obscene speech in a room full of 14 yr old kids. Limiting obscenity has been seen by all courts that I am aware of, in the presence of children, as an appropriate limit on free speech rights. This is why they can not show hard core pornography between \"spongebob squarepants\" and \"the rugrats\" on Nickelodeon. Far from eroding Tinker, the court determined that the speech in question did not meet the test laid forth in Tinker, and that it was harmful and disruptive in nature.\n \n I think that you would be hard pressed to claim that the stupid Bong hits 4 jesus sign was the same. \n \n Hazelwood School District v. Kuhlmeier \n \n Hazelwood was a case realted to a student newspaper. In hazelwood, the court found that a schoo lpaper that had not been established as a public forum for student views could have its content limited. The court went a little further than this and specifically included statements that this decision was not a reversal of Tinker. Rather they said that a school could not be compelled to affirmatively support speech that was in conflict with their educational goals. Basically, the students could say whatever they wanted, byt they could not force the school to repeat it by proxy by forcing them to print it in their school paper.\n \n Dean v. Utica Community Schools \n \n Dean is not a supreme court case but, IMO, is a finding that supports my view that Tinker has not been eroded even in light of fraser and Hazelwood. In Dean, a student wrote an article for the school paper about a lawsuit against the shool district by a local couple who claimed that the exhaust fumes from idling school busses contributed to the mans cancer. \n \n In Dean, the court ruled that, based on past editorial practices, the school paper was indeed a limited public forum, and (more importantly) that they had impermissibly squelched the students freedom of speech by censoring the article in its own interest. \n \n Phillips v. Anderson County School District Five\n \n \n This was the \"confederate jacket\" case and the latest supreme court ruling on the issue. It confirms that Tinker is still in full force. The decision in this case was SOLEY based on the tinker test, in its entirety. The school district showed that the wearing of clothing featuring the confederate flag had, in the past, caused significant disruption including violence. The court ruled that based on this, the school district had shown that there was a substantial potential for disruption due to the wearing of such clothing and therefore, under the Tinker test, their banning of the garmets in question was permissibale and they the actual display itself did not have to have caused a disruption, the school district just had to show that there was a high likelyhood that it could.\n \n This is not at all inconsistent with prior constitutional. Your freedom of speech does not extend to yelling \"fire\" in a crowded theater. The crime is in doing so, regardless of whether it causes any disruption, because a high likelyhood of a dangerous disruption exists....a likelyhood that any reasonable person should be able to recognize.", 
   {}, 
   256404, 
   null, 
   1175532780.0
  ], 
  [
   256448, 
   null, 
   "Steeeeve", 
   "Fraser and Hazelwood are the two main ones.\n \n Fraser without a doubt limits Tinker in that it narrows its meaning and making specific exceptions. Cases that follow do the same things...give specific exceptions which in a sense erode the all-inclusive nature of Tinker. This really isn't something new though. The oral arguments of the case admitted that the case has been limited but \"the heart\" of the case still remains...kinda like how the \"heart\" of Roe v. Wade remained when Casey decided to remove the entire case except a one line conclusion. \n \n Anyway, my point is that Tinker is not absolute and it has been narrowed so using just the Tinker test is not wise unless you look at the reasons for exceptions under Fraser, Hazelwood, etc. \n \n Coming down to this case we still get back to the idea that at the very least there is no way the administrator should have or could have known this was wrong assuming it was wrong.\n \n I think this point will be 9-0.\n \n \nMR. MERTZ: And she did testify that she had taken a master's degree course in school law in which she studied Kuhlmeier and Frazier and Tinker. So -\n \n CHIEF JUSTICE ROBERTS: And so it should be perfectly clear to her exactly what she could and couldn't do.\n \n MR. MERTZ: Yes.\n \n JUSTICE SCALIA: As it is to us, right?\n (Laughter.)\n \n JUSTICE SOUTER: I mean, we have had a debate here for going on 50 minutes about what Tinker means, about the proper characterization of the behavior, the nonspeech behavior. The school's terms in dealing with the kids that morning. The meaning of the, of the statement. We've been debating this in this courtroom for going on an hour,\n", 
   {}, 
   256442, 
   null, 
   1175534940.0
  ], 
  [
   256580, 
   null, 
   "daewoo", 
   "Fraser and Hazelwood are the two main ones.\n \n Fraser without a doubt limits Tinker in that it narrows its meaning and making specific exceptions. Cases that follow do the same things...give specific exceptions which in a sense erode the all-inclusive nature of Tinker. This really isn't something new though. The oral arguments of the case admitted that the case has been limited but \"the heart\" of the case still remains...kinda like how the \"heart\" of Roe v. Wade remained when Casey decided to remove the entire case except a one line conclusion. \n \n Anyway, my point is that Tinker is not absolute and it has been narrowed so using just the Tinker test is not wise unless you look at the reasons for exceptions under Fraser, Hazelwood, etc. \n\n \n Fraser relies on the tinker test for it finding. Lets go back to Tinker for a second:\n \n \nAs we have discussed, the record does not demonstrate any facts which might reasonably have led school authorities to forecast substantial disruption of or material interference with school activities, and no disturbances or disorders on the school premises in fact occurred. These petitioners merely went about their ordained rounds in school. Their deviation consisted only in wearing on their sleeve a band of black cloth, not more than two inches wide. They wore it to exhibit their disapproval of the Vietnam hostilities and their advocacy of a truce, to make their views known, and, by their example, to influence others to adopt them. They neither interrupted school activities nor sought to intrude in the school affairs or the lives of others. They caused discussion outside of the classrooms, but no interference with work and no disorder. In the circumstances, our Constitution does not permit officials of the State to deny their form of expression.\" \n\n \n From Fraser (quoting tinker):\n \n \nThe marked distinction between the political \"message\" of the armbands in Tinker and the sexual content of respondent's speech in this case seems to have been given little weight by the Court of Appeals. In upholding the students' right to engage in a nondisruptive, passive expression of a political viewpoint in Tinker, this Court was careful to note that the case did \"not concern speech or action that intrudes upon the work of the schools or the rights of other students.\" \n\n \n \nThe pervasive sexual innuendo in Fraser's speech was plainly offensive to both teachers and students -- indeed to any mature person. By glorifying male sexuality, and in its verbal content, the speech was acutely insulting to teenage girl students. The speech could well be seriously damaging to its less mature audience, many of whom were only 14 years old and on the threshold of awareness of human sexuality. Some students were reported as bewildered by the speech and the reaction of mimicry it provoked. We have also recognized an interest in protecting minors from exposure to vulgar and offensive spoken language.... \n\n \n Fraser relies completely on tinker. The court essentially ruled that there was a fundamental difference between the speech in Tinker and that in Fraser. They found the speech in Fraser essentially violated others rights and was disruptive. Since the cornerstone of the Tinker ruling is essentially that non disruptive speech that does not violate others rights is protected, I have trouble understanding how anybody can come to the conclusion that Fraser, where they found that disruptive speech that infringed on others rights was not protected, in any way erodes tinker. \n \n Hazelwood did not actually deal with free speech at all, except in a passing manner, in the opinion. The hazelwood opinion instead focused on whether or not the school could be compelled as an organization to print and distribute content in a school paper that they disagreed with. \n \n \n \nComing down to this case we still get back to the idea that at the very least there is no way the administrator should have or could have known this was wrong assuming it was wrong.\n \n I think this point will be 9-0.\n\n \n Tough call. Scalia and Roberts will, predicatably, side with the principal. They both LOVE authority. IMO it will depend on how much research the judges do. The principal took educational law classes. I have taken a couple of educational law classes, nowhere near masters level, and I would have known full well that the action was impermissible, especially if given a day to think about it. At the very least, due diligence should have required that she contact the school districts counsel for advice. \n \n Ultimatly, I would expect this to end up being about qualified immunity, and I am not sure how the court is likely to rule there. Being familiar with tinker and Fraser, she should have known better. She should have at least known that her actions were suspect and taken some kind of steps to ensure that they were within the bounds of the law. She did not. \n \n Personally, if I was her, I would have done the same thing AT the parade. I would have removed the sign since it would have been embaressing to have it on the news and potentially associated with the school. I then would have called the district counsel and had him tell me \"that was the wrong thign to do\" and I would not have suspended the student. That is what is called \"covering your back side\". Frankly, anybody in any kind of administrative position should know this. Then again, I am reminded of what a lawyer friend of mine once told me regarding the supreme court:\n \n \"These are supreme court justices you are talking about. Most of them have not had a real job for 20 years. You never know what they are going to do. They are masters of BS and are not afraid to lay it on as thick as they think they need to\"\n \n Scalia, Roberts, and to some degree Alito are predictable. Thomas is a wildcard. Kennedy is a shill. The others are up in the air on a lot of things.", 
   {
    "unicode_changes_made": true
   }, 
   256448, 
   null, 
   1175590920.0
  ], 
  [
   256659, 
   null, 
   "Steeeeve", 
   "Tough call. Scalia and Roberts will, predicatably, side with the principal. They both LOVE authority. IMO it will depend on how much research the judges do. The principal took educational law classes. I have taken a couple of educational law classes, nowhere near masters level, and I would have known full well that the action was impermissible, especially if given a day to think about it. At the very least, due diligence should have required that she contact the school districts counsel for advice. \nScalia and Roberts? That is an odd thing to say about them...and to not include Thomas is odd as well as Thomas was the one that pretty much molded Scalia.\n \n Anyway, I think my quote from the transcripts says it all with regards to whether she could have known or did know or shoulda known. She also did give due diligence if I recall correctly. She contaced the counsel and they decided to remove the suspension.\n \n \nUltimatly, I would expect this to end up being about qualified immunity, and I am not sure how the court is likely to rule there. Being familiar with tinker and Fraser, she should have known better. She should have at least known that her actions were suspect and taken some kind of steps to ensure that they were within the bounds of the law. She did not. \nI'm not all certain Tinker and Fraser make it so you rule in favor of the kid. Even so, this is only one of the questions the court has to answer. As I previously stated...there are really two main questions to answer.\n \n \nPersonally, if I was her, I would have done the same thing AT the parade. I would have removed the sign since it would have been embaressing to have it on the news and potentially associated with the school. I then would have called the district counsel and had him tell me \"that was the wrong thign to do\" and I would not have suspended the student. That is what is called \"covering your back side\". Frankly, anybody in any kind of administrative position should know this. Then again, I am reminded of what a lawyer friend of mine once told me regarding the supreme court:\nWell, the kid only received suspension for skipping. The other was dropped later I believe.\n \n \n\"These are supreme court justices you are talking about. Most of them have not had a real job for 20 years. You never know what they are going to do. They are masters of BS and are not afraid to lay it on as thick as they think they need to\"\nA rather cynical view in my opinion. I'd say the ones that do the \"living constitution\" idea are masters of BS. Any other view of the constitution really leaves you with what it says or just flat out lying which Justice Scalia said was the \"old fashion\" way of changing the constitution.\n \n \nScalia, Roberts, and to some degree Alito are predictable. Thomas is a wildcard. Kennedy is a shill. The others are up in the air on a lot of things.\nThomas? Thomas is predictable 100% of the time. He doesn't believe the bill of rights applies to the states in that manner in thus this is an easy case for him. He didn't ask one question during arguments (no surprise) and had is mind made up prior to the thing reaching the court...which is not a bad thing, the man is right most of the time. It seems clear that Scalia, Thomas, Alito, and Souter are going to agree that she couldn't have known. Roberts is a 90% bet to go with those 4 and Breyer and Kennedy are about 50/50. Ginsburg is most likely to go for the kid. No one cares about Stevens because he probably can't read anything much less have the ability to hear.", 
   {}, 
   256580, 
   null, 
   1175633040.0
  ], 
  [
   256692, 
   null, 
   "daewoo", 
   "Scalia and Roberts? That is an odd thing to say about them...and to not include Thomas is odd as well as Thomas was the one that pretty much molded Scalia.\n\n \n You have that backwards. calia was there first and molded Thomas. They used to call thomas \"Scalias son\"\n \n \nAnyway, I think my quote from the transcripts says it all with regards to whether she could have known or did know or shoulda known. She also did give due diligence if I recall correctly. She contaced the counsel and they decided to remove the suspension.\n\n \n No, the suspension was removed after the student appealed to the principals superiors at the district level.\n \n \nWell, the kid only received suspension for skipping. The other was dropped later I believe.\n\n \n It was \"dropped\" after he had served it, and it is still on his record. In addition to the 5 days he got for the sign, he got 3 more days for refusing to tell the principal who else was holding the sign, and 2 more for quoting Thomas Jefferson in his defense of his act.\n \n \nA rather cynical view in my opinion. I'd say the ones that do the \"living constitution\" idea are masters of BS. Any other view of the constitution really leaves you with what it says or just flat out lying which Justice Scalia said was the \"old fashion\" way of changing the constitution.\n\n \n I can see hsi point in this though. Look at Scalia and his views regarding stare decisis. He says that he does not believe the supreme court should be bound by SD, but he also does not believe that the court should make sweeping changes. So, in other words, he does not believe they should be bound by SD unless it would rock the boat, then he will come up with a BS justification for ruling in favor of stability. \n \n Interestingly enough there was another famous justice who did not believe that the supreme court should make rulings that would result in sweeping changes. His name was Rodger Taney. He wrote the Dredd Scott ruling. \n \n \nThomas? Thomas is predictable 100% of the time. He doesn't believe the bill of rights applies to the states in that manner in thus this is an easy case for him. He didn't ask one question during arguments (no surprise) and had is mind made up prior to the thing reaching the court...which is not a bad thing, the man is right most of the time. It seems clear that Scalia, Thomas, Alito, and Souter are going to agree that she couldn't have known. Roberts is a 90% bet to go with those 4 and Breyer and Kennedy are about 50/50. Ginsburg is most likely to go for the kid. No one cares about Stevens because he probably can't read anything much less have the ability to hear.\n\n \n Thomas has been the odd man out in more cases than any other justice in supreme court history. Occasionally he jsut sees things in a twisted light and goes off on some kind of bizzare train of thought. That makes him unpredictable. I agree with you on stevens.", 
   {}, 
   256659, 
   null, 
   1175640360.0
  ], 
  [
   256749, 
   null, 
   "Steeeeve", 
   "You have that backwards. Scalia was there first and molded Thomas. They used to call thomas \"Scalias son\"\n Incorrectly called him \"Scalias son\". If you read \"Supreme Conflict: The Inside Story of the Struggle for Control of the United States Supreme Court\" or \"The Supreme Court: The Personalities and Rivalries That Defined America\" then it talks about how Thomas really was the person that kinda molded Scalia into a more finite thinking of orginialism (Scalia was always an orginialist but had some issues that he \"gave up\" on). \n \n \nNo, the suspension was removed after the student appealed to the principals superiors at the district level.\n \n It was \"dropped\" after he had served it, and it is still on his record. In addition to the 5 days he got for the sign, he got 3 more days for refusing to tell the principal who else was holding the sign, and 2 more for quoting Thomas Jefferson in his defense of his act.\nYeah, I'm not sure where I remember that from...nevertheless, The suspension seems to not have been appealed immediatly from what I can tell (according to the briefs) http://www.abanet.org/publiced/preview/briefs/pdfs/06-07/06-278_Petitioner.pdf see page 3-4.\n \n \nI can see hsi point in this though. Look at Scalia and his views regarding stare decisis. He says that he does not believe the supreme court should be bound by SD, but he also does not believe that the court should make sweeping changes. So, in other words, he does not believe they should be bound by SD unless it would rock the boat, then he will come up with a BS justification for ruling in favor of stability. \nYeah, be doesn't believe in \"wrentching departures\" such as declaring the bill of rights not to apply to the states. The major difference in Thomas and Scalia is that Thomas thinks in black and white while Scalia accepts that sometimes this isn't reasonable. Scalia's approach does lead to a slippery slope but in the sense he uses it, I'd say it is fairly reasonable. I think Scalia doesn't like inconsistent use of SD which is a pretty fair argument.\n \n \nInterestingly enough there was another famous justice who did not believe that the supreme court should make rulings that would result in sweeping changes. His name was Rodger Taney. He wrote the Dredd Scott ruling. \nHe was also the first judge to use an idea of \"substantive\" due process. Rodger Taney believed in breathing but that doesn't make it a bad idea ;).\n \n \nThomas has been the odd man out in more cases than any other justice in supreme court history. Occasionally he jsut sees things in a twisted light and goes off on some kind of bizzare train of thought. That makes him unpredictable. I agree with you on stevens.\n Awww, I like Thomas. He seems to be what a judge should be...he just does his job and goes home...he isn't trying to change the world. \n \n Yeah, you'd be hard pressed to find someone that thinks Stevens was worth anything.", 
   {}, 
   256692, 
   null, 
   1175659800.0
  ], 
  [
   257174, 
   null, 
   "daewoo", 
   "Incorrectly called him \"Scalias son\". If you read \"Supreme Conflict: The Inside Story of the Struggle for Control of the United States Supreme Court\" or \"The Supreme Court: The Personalities and Rivalries That Defined America\" then it talks about how Thomas really was the person that kinda molded Scalia into a more finite thinking of orginialism (Scalia was always an orginialist but had some issues that he \"gave up\" on). \n \n\n \n HAve not read them, so I will take your word for it. \n \n \nYeah, I'm not sure where I remember that from...nevertheless, The suspension seems to not have been appealed immediatly from what I can tell (according to the briefs) http://www.abanet.org/publiced/preview/briefs/pdfs/06-07/06-278_Petitioner.pdf see page 3-4.\n\n \n That is my understanding as well.\n \n \nYeah, be doesn't believe in \"wrentching departures\" such as declaring the bill of rights not to apply to the states. The major difference in Thomas and Scalia is that Thomas thinks in black and white while Scalia accepts that sometimes this isn't reasonable. Scalia's approach does lead to a slippery slope but in the sense he uses it, I'd say it is fairly reasonable. I think Scalia doesn't like inconsistent use of SD which is a pretty fair argument.\n\n \n To me, Scalias approach is absolutly NOT what you want in a supreme court justice. Not only does Scalias approach lead to a potential \"slippery slope\", it would keep him from advocating correcting injustice when it would cause a wrentching departure. Based on his apparent views, I think we can be pretty sure he would have voted with the majority in Dredd Scott because while he probably would not have actually believed what was written there (nor, we now know, did many of the jsutices who put their name to it), it would have avoided one of those wrentching departures that he seems to dislike. \n \n \nHe was also the first judge to use an idea of \"substantive\" due process. Rodger Taney believed in breathing but that doesn't make it a bad idea ;).\n\n \n This is true. However, his views in this area, and where those views led him, are, IMO, a pretty substantial argument against similar views. \n \n I think that the \"don't rock the boat\" mentality is FAR more dangerous today than it was in Taneys time. When Taney was on the court, cases often went through the entire court system in 12-18 months. Today, a fast tracked case MIGHT get there in 2 years, but most take 5-10 years just to get through the judicial process to get them in front of the high court. The case we are discussing here is a good example. The kid filed the case as a high school senior and today is out of college and living abroad, and they are just now considering it. \n \n This means that unlike in the past when new laws could be tested in the courts relatively quickly...BEFORE they became imbedded in our legal system and our culture. That is not the case today. Any change that results in the striking of a law has a high probability of leading to a wrentching departures scenario. \n \n \n Awww, I like Thomas. He seems to be what a judge should be...he just does his job and goes home...he isn't trying to change the world. \n\n \n That is what I like about thomas as well. I don't think he cares if he changes the world or not. He gets in there and rules the way he feels he should and consequencess be damned. He knows his job and he does it. That does not mean that occasionally he does not get a wild hair up his butt and go off on a bizzare tangent.", 
   {}, 
   256749, 
   null, 
   1175836020.0
  ], 
  [
   257278, 
   null, 
   "Steeeeve", 
   "To me, Scalias approach is absolutly NOT what you want in a supreme court justice. Not only does Scalias approach lead to a potential \"slippery slope\", it would keep him from advocating correcting injustice when it would cause a wrentching departure. \n which is Thomas's argument. It is a fair one. At the very least Thomas and Scalia think pretty similar and I'd rather have 9 of them than the Breyers or Ginsburgs who have no approach. \n \n \nBased on his apparent views, I think we can be pretty sure he would have voted with the majority in Dredd Scott because while he probably would not have actually believed what was written there (nor, we now know, did many of the jsutices who put their name to it), it would have avoided one of those wrentching departures that he seems to dislike.\nI didn't think Dred Scott was using SD to decide the case. Scalia and Thomas both might have joined the minority but this doesn't make them wrong (for the record I doubt they would). In fact, it might show that they are not biased towards popular opinion but rather what the law says. A judge has no authority to decide if a law is unjust or not as this is the job of the people...they decide what justice means. So lets assume Dred Scott was a correct decision at the time (lets be clear I don't think it was), wouldn't it be ok for them to side with it? The 13th and 14th amendment overturned it and it seems the democratic process worked well....much like what happened with the 19th amendment. Point is, we don't need judges to correct unjust laws or really bad laws...we already have folks that are supposed to do it.\n \n Back to Dred Scott, I do believe this was the first use of substantive due process (although different at the time because there was no 14th amendment). So it could easily have been that Scalia would have dissented or concurred.\n \n Scalia has often been critical of Dred Scott for the substantive due process reason and even wrote in Casey that the thinking behind Roe was the same thinking in making the Dred Scott decision. I'd say its a pretty strong argument. \n \n \n[D]red Scott...rested upon the concept of \"substantive due process\" that the Court praises and employs today. Indeed, Dred Scott was very possibly the first application of substantive due process in the Supreme Court, the original precedent for...Roe v. Wade.\n", 
   {}, 
   257174, 
   null, 
   1175891280.0
  ], 
  [
   257282, 
   null, 
   "Steeeeve", 
   "This is true. However, his views in this area, and where those views led him, are, IMO, a pretty substantial argument against similar views. \n Well then substantive due process is off the table...thats a good thing. Seems like you are a Thomas fan more than anything else. If Thomas and Scalia were the two opposite extreme ends on the court then we'd probably avoid the situation you describe below.\n \n \nI think that the \"don't rock the boat\" mentality is FAR more dangerous today than it was in Taneys time. When Taney was on the court, cases often went through the entire court system in 12-18 months. Today, a fast tracked case MIGHT get there in 2 years, but most take 5-10 years just to get through the judicial process to get them in front of the high court. The case we are discussing here is a good example. The kid filed the case as a high school senior and today is out of college and living abroad, and they are just now considering it. \n \nAssuming the high court selects it. Probably 1-2% are selected a year (40-80 cases or so?)\n \n \nThis means that unlike in the past when new laws could be tested in the courts relatively quickly...BEFORE they became imbedded in our legal system and our culture. That is not the case today. Any change that results in the striking of a law has a high probability of leading to a wrentching departures scenario. \n no, the wrentching departure thing only works from a SD stand point. So the cases would have to be repeatedly confirmed in the high court for this to work...such as the 1st amendment applying to the states.\n \n \nThat is what I like about thomas as well. I don't think he cares if he changes the world or not. He gets in there and rules the way he feels he should and consequencess be damned. He knows his job and he does it. That does not mean that occasionally he does not get a wild hair up his butt and go off on a bizzare tangent.\nYou can't get it right 100% of the time but if you had 9 Thomas type people then you get a pretty high rate of accuracy...in fact, prior to the living constitution the courts didn't really have the 5-4 decisions on everything like you see today. Granted they did some issues of conflict but nothing like today.", 
   {}, 
   257174, 
   null, 
   1175891820.0
  ], 
  [
   257300, 
   null, 
   "Phyllis", 
   "To me, Scalias approach is absolutly NOT what you want in a supreme court justice. Not only does Scalias approach lead to a potential \"slippery slope\", it would keep him from advocating correcting injustice when it would cause a wrentching departure. Based on his apparent views, I think we can be pretty sure he would have voted with the majority in Dredd Scott because while he probably would not have actually believed what was written there (nor, we now know, did many of the jsutices who put their name to it), it would have avoided one of those wrentching departures that he seems to dislike.\n\n \n I have previously suggested that Scalia's stare decisis is wanting based on slippery slope grounds. But I hardly think Scalia's approach would necessitate him ruling with the majority in Dred Scott. The way I see it, Scalia's \"wrenching departures\" is a very limited standard only to be utilized if an originalist decision would completely wreck the country. Keeping in mind that stare decisis played no role in the Dred Scott decision, I'll overlook that important point to make a larger point.\n \n Therefore, he would not have to agree with Taney in Dred Scott because if there was a wrenching departure in that case, it was the decision by the majority. Prior to that, it had become clear that society at large was coming to view slavery in a very negative light (hence the Missouri Compromise). Thus, a judicial decision consistent with that view would not constitute a wrenching departure.\n \n I think that Scalia's willingness to overturn Roe is evidence enough that his \"wrenching departure\" standard really does have teeth, and is very tough to meet.\n \n I'm not defending Scalia's stare decisis approach here. I am merely pointing out that it is not as open-ended as has been suggested. I for one think that judges should render the correct decision regardless of the consequences. But Scalia's view is not unreasonable.", 
   {}, 
   257174, 
   null, 
   1175896320.0
  ], 
  [
   257313, 
   null, 
   "Steeeeve", 
   "I have previously suggested that Scalia's stare decisis on slippery slope grounds. But I hardly think Scalia's approach would necessitate him ruling with the majority in Dred Scott. The way I see it, Scalia's \"wrenching departures\" is a very limited standard only to be utilized if an originalist decision would completely wreck the country.\n \n Therefore, he would not have to agree with Taney in Dred Scott because if there was a wrenching departure in that case, it was the decision by the majority. Prior to that, it had become clear that society at large was coming to view slavery in a very negative light (hence the Missouri Compromise). Thus, a judicial decision consistent with that view would not constitute a wrenching departure.\n \n I think that Scalia's willingness to overturn Roe is evidence enough that his \"wrenching departure\" standard really does have teeth, and is very tough to meet.\n \n I'm not defending Scalia's stare decisis approach here. I am merely pointing out that it is not as open-ended as has been suggested. I for one think that judges should render the correct decision regardless of the consequences. But Scalia's view is not unreasonable.\n\n \n Another Thomas fan haha", 
   {}, 
   257300, 
   null, 
   1175902740.0
  ], 
  [
   257340, 
   null, 
   "Phyllis", 
   "Another Thomas fan haha\n\n \n I'm just a fan of the law. I think that the Constitution allows American People to wreck their country if they want. It doesn't put judges there to keep them from doing that.", 
   {}, 
   257313, 
   null, 
   1175908140.0
  ], 
  [
   257927, 
   null, 
   "daewoo", 
   "Well then substantive due process is off the table...thats a good thing. Seems like you are a Thomas fan more than anything else. If Thomas and Scalia were the two opposite extreme ends on the court then we'd probably avoid the situation you describe below.\n\n \n Yep, I like Thomas. To me, thomas is what a supreme court justice should be. Politics typically do not enter into his decisions, nor does he spend a whole lot of time mired in past decisions. He rules based on constitutionality and the law, and damn the wider implications.\n \n \nAssuming the high court selects it. Probably 1-2% are selected a year (40-80 cases or so?)\n\n \n IMO this is a failing point in our system of government, but one that is difficult to rectify. At the nations founding, most cases that were appealed to the supreme court were accepted. Now selection seems to be largely arbitrary. This is one way in which the naiton ahs outgrown its government. \n \n \n no, the wrentching departure thing only works from a SD stand point. So the cases would have to be repeatedly confirmed in the high court for this to work...such as the 1st amendment applying to the states.\n\n \n I disagree here. Look at Scalia in Raich. The Raich decision was total BS, but Scalia went along with it. It seems reasonable to me to assume that he did so in order to avoid a wrenching departure from current laws and social convention. \n \n \nYou can't get it right 100% of the time but if you had 9 Thomas type people then you get a pretty high rate of accuracy...in fact, prior to the living constitution the courts didn't really have the 5-4 decisions on everything like you see today. Granted they did some issues of conflict but nothing like today.\n\n \n I can agree with that. I would MUCH rather have a court full of thomas types than the mess we have today where we just invent things as we go.", 
   {}, 
   257282, 
   null, 
   1176223080.0
  ], 
  [
   257998, 
   null, 
   "Steeeeve", 
   "I disagree here. Look at Scalia in Raich. The Raich decision was total BS, but Scalia went along with it. It seems reasonable to me to assume that he did so in order to avoid a wrenching departure from current laws and social convention.\nThis is actually a perfect example of him using SD with repeated decisions by the Supreme Court. In this case the wrentching departure was not the idea of the legal drugs but the use of the commerce clause. The commerce clause has been understood to mean something it doesn't for so long and in so many SCOTUS cases that Scalia just goes with it. Obviously Thomas does not believe in that and thus he went the other way.\n \n \nI can agree with that. I would MUCH rather have a court full of thomas types than the mess we have today where we just invent things as we go.\nTry convincing the masses that. People seem to like the idea of 9 people ruling the country. It shouldn't a surprise why the hearings are so polorized now....you just get the guy in there that will vote for what you believe in...its almost like how the senate used to elected.", 
   {}, 
   257927, 
   null, 
   1176245100.0
  ], 
  [
   258004, 
   null, 
   "daewoo", 
   "This is actually a perfect example of him using SD with repeated decisions by the Supreme Court. In this case the wrentching departure was not the idea of the legal drugs but the use of the commerce clause. The commerce clause has been understood to mean something it doesn't for so long and in so many SCOTUS cases that Scalia just goes with it. Obviously Thomas does not believe in that and thus he went the other way.\n\n \n I had not considered the case in that light (a simple SD case re: the commerce clause). Viewed that way, it is a consistend pro SD ruling for scalia\n \n \nTry convincing the masses that. People seem to like the idea of 9 people ruling the country. It shouldn't a surprise why the hearings are so polorized now....you just get the guy in there that will vote for what you believe in...its almost like how the senate used to elected.\n\n \n It amazes me when people cite a court, without examining the underlying reasoning, to \"prove\" their point. Frankly, a lot of court decisions, especially in the last 50 or so years, are politically motivated BS that act only as \"proof\" that our legal system has some SERIOUS problems.WE effectively put judges in place with the understanding that they will interpet the laws with a specific political end in mind, and that \"god dman piece of paper\" is not to stand in their way.\n \n I think it was georged who said something along hte lines of :\n \n \nThe constitution is largely irrelevant. They will simply find a team of lawyers to explain why their clearly unconstitutional behavior is fine and the people will believe it\n", 
   {}, 
   257998, 
   null, 
   1176248100.0
  ], 
  [
   258013, 
   null, 
   "Steeeeve", 
   "I had not considered the case in that light (a simple SD case re: the commerce clause). Viewed that way, it is a consistend pro SD ruling for scalia\n This doesn't make it a great idea for statue cases (SD would be better for common law cases you'd think) but, like I said, if Scalia and Thomas were the two opposite extremes you would rarely have a poorly decided case.\n \n \nIt amazes me when people cite a court, without examining the underlying reasoning, to \"prove\" their point. Frankly, a lot of court decisions, especially in the last 50 or so years, are politically motivated BS that act only as \"proof\" that our legal system has some SERIOUS problems.WE effectively put judges in place with the understanding that they will interpet the laws with a specific political end in mind, and that \"god dman piece of paper\" is not to stand in their way.\n \n This happens a lot here with folks saying \"well the Supreme Court said this therefore it is so\". Apparently the school system is teaching that the Supreme Court Judges are always right and what they decide the constitution says is actually what it says. This means that the constitution really has no meaning in and of itself but rather a personal, self meaning to each person which could mean anything. In fact, the first amendment could only apply to the word \"hello\" for one judge and he is not wrong apparently. \n \n I've said it before but the one idea that the anti-federalists got right was the abuse of the judicial power to become the strongest unchecked branch.\n \n \nI think it was georged who said something along hte lines of :\nThat is almost a direct quote from all of Scalia's speeches.", 
   {}, 
   258004, 
   null, 
   1176250140.0
  ], 
  [
   258752, 
   null, 
   "zachvac", 
   "Is free speech applicable to under aged individuals under the tuteledge and care of educators entrusted with their welfare and behavior? If so, why? They don't pay taxes, the add nothing to the GDP. Who cares what they have to say?\n\n \n First of all depending on their age, they may have been over 18. And if they weren't they will be paying taxes in another couple years, and they won't forget.\n \n I haven't read the whole discussion yet, and although I meant to hold any posts until the end, I couldn't pass this one by. This attitude is just plain wrong. Oh and how about this?\n \"All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States\" - Amendment XIV, Section 1 of the US Constitution", 
   {}, 
   254948, 
   null, 
   1176614400.0
  ], 
  [
   258757, 
   null, 
   "zachvac", 
   "I made this point earlier.\n \n \n \n This is not correct. The Bill of Rights does not prevent a private citizen from doing those things which the government is prohibited from doing. This is why an employer can fire an employee for saying the word \"gobbledygook\" without violating the first amendment.\n\n \n A public school is not a private business. People have to pay taxes to pay for the public schools their kids can go to. You're telling me now that a school parents are forced to pay for (whether their kid attends or not) can punish a kid going there for something he has a Constitutional right to do? No one has a RIGHT to have a job, so firing them is fine. People do have a right to a \"free\" education through high school, I put free in quotes because their parents are really paying for it through taxes.", 
   {}, 
   255406, 
   null, 
   1176615000.0
  ], 
  [
   258765, 
   null, 
   "zachvac", 
   "OK, after reading all the comments here's my opinion on the matter:\n \n I do not believe it is a Constitutional violation. I do think she acted illegally and overstepped her bounds. She has no jurisdiction on what a kid does outside of school during a school day. If this suspension has already been served I think she owes the kid an appology and the suspension should be removed from his permanent record.\n \n As a side note, we have a church accross the street from our school. It has messeges on the front all the time that are visible from the school. Do you think the school has the right to regulate what they put there since the messege is visible from school property? How about suspending a kid who volunteers there outside of school and refuses to change the messege (for argument's sake let's pretend he has final say over the messege board on the front)? This isn't a first amendment case, this is a case of a principal abusing her power. She had no power to take the sign down and no power to suspend him.", 
   {}, 
   258757, 
   null, 
   1176616140.0
  ], 
  [
   258774, 
   null, 
   "Steeeeve", 
   "OK, after reading all the comments here's my opinion on the matter:\n \n I do not believe it is a Constitutional violation. I do think she acted illegally and overstepped her bounds. She has no jurisdiction on what a kid does outside of school during a school day. If this suspension has already been served I think she owes the kid an appology and the suspension should be removed from his permanent record.\n \n As a side note, we have a church accross the street from our school. It has messeges on the front all the time that are visible from the school. Do you think the school has the right to regulate what they put there since the messege is visible from school property? How about suspending a kid who volunteers there outside of school and refuses to change the messege (for argument's sake let's pretend he has final say over the messege board on the front)? This isn't a first amendment case, this is a case of a principal abusing her power. She had no power to take the sign down and no power to suspend him.\n\n \n So you do or do not believe it to be a constitutional violation? Your post seems to contradict your first sentence", 
   {}, 
   258765, 
   null, 
   1176627900.0
  ], 
  [
   258825, 
   null, 
   "zachvac", 
   "So you do or do not believe it to be a constitutional violation? Your post seems to contradict your first sentence\n\n \n Nope, I believe she acted illegally, but she isn't in violation of the first amendment. She should be punished for forcing the kid to remove the sign, vandalizing his property by removing it, and the kid's record should have the suspensions removed because she gave out a punishment she had no power to give.\n \n Do you understand the difference? What she did was wrong, but I fail to see how she violated the first amendment. She was perfectly within her rights to do what she did, ON SCHOOL GROUNDS. This is a case of her abusing her power and doing outside of school what she can only do on school grounds.", 
   {}, 
   258774, 
   null, 
   1176682500.0
  ], 
  [
   258827, 
   null, 
   "Steeeeve", 
   "Nope, I believe she acted illegally, but she isn't in violation of the first amendment. She should be punished for forcing the kid to remove the sign, vandalizing his property by removing it, and the kid's record should have the suspensions removed because she gave out a punishment she had no power to give.\n \n Do you understand the difference? What she did was wrong, but I fail to see how she violated the first amendment. She was perfectly within her rights to do what she did, ON SCHOOL GROUNDS. This is a case of her abusing her power and doing outside of school what she can only do on school grounds.\n\n \n I agree with the first amendmetn assessement but I am not so sure about your second point. A teacher can certain take down a sign if the kids were on a field trip which is outside school grounds.", 
   {}, 
   258825, 
   null, 
   1176682920.0
  ], 
  [
   259006, 
   null, 
   "JPSartre12", 
   "I agree with the first amendmetn assessement but I am not so sure about your second point.  A teacher can certain take down a sign if the kids were on a field trip which is outside school grounds.\n\n \n Huh? emoticon_confused \n I think that you meant to say that she CAN'T take down a sign that isn't on school ground. In this situation, the sign was across the street from the school property.", 
   {}, 
   258827, 
   null, 
   1176762600.0
  ], 
  [
   259088, 
   null, 
   "zachvac", 
   "I agree with the first amendmetn assessement but I am not so sure about your second point. A teacher can certain take down a sign if the kids were on a field trip which is outside school grounds.\n\n \n Earlier it said that he was not on a field trip and that most kids came to school late that day. But whether she took it down or not, it should be obvious after the fact that what the student did was fine because he was not officially at school so the suspension should be erased.", 
   {}, 
   258827, 
   null, 
   1176810480.0
  ], 
  [
   261030, 
   null, 
   "Steeeeve", 
   "Earlier it said that he was not on a field trip and that most kids came to school late that day. But whether she took it down or not, it should be obvious after the fact that what the student did was fine because he was not officially at school so the suspension should be erased.\n\n \n When are you officially at school?", 
   {}, 
   259088, 
   null, 
   1177972740.0
  ], 
  [
   267381, 
   null, 
   "Marijuanifornia", 
   "I'll bet twenty bucks that teacher hasn't ever heard of \"Hemp For Victory,\" the 1942 USDA film that urged Americans as young as 16 to grow \"Marihuana\" in defense of the United States during World War II.\n \n If she had heard of it, she'd feel differently (along with everyone else that has an IQ higher than that of a tree stump) about the \"Marihuana\" prohibition laws in the US.", 
   {}, 
   261030, 
   null, 
   1181266920.0
  ], 
  [
   267433, 
   null, 
   "daewoo", 
   "I'll bet twenty bucks that teacher hasn't ever heard of \"Hemp For Victory,\" the 1942 USDA film that urged Americans as young as 16 to grow \"Marihuana\" in defense of the United States during World War II.\n \n If she had heard of it, she'd feel differently (along with everyone else that has an IQ higher than that of a tree stump) about the \"Marihuana\" prohibition laws in the US.\n\n \n Uh...\"Hemp For Victory\" advocates the cultivation of hemp for industrial use, not smoking it. Industrial use of hemp is a good thing. It is a cheap, easily produced, versatile raw material. Smoking it just makes you hungry and stupid.", 
   {}, 
   267381, 
   null, 
   1181281440.0
  ], 
  [
   270718, 
   null, 
   "Phyllis", 
   "The Supreme Court ruled today that the principal (and other school officials) did not violate the Constitution. If my calculations are correct, the decision was 6-3.\n \n Congrats to those voting \"no\" in the poll.\n \n From the Opinion:\n \n \nWe conclude that the school officials in this case did\n not violate the First Amendment by confiscating the prodrug\n banner and suspending the student responsible for it.\n \n ...We granted certiorari on two questions: whether Frederick\n had a First Amendment right to wield his banner, and,\n if so, whether that right was so clearly established that\n the principal may be held liable for damages. 549 U. S.\n ___ (2006). We resolve the first question against Frederick,\n and therefore have no occasion to reach the second.\n \n", 
   {
    "post_info": {
     "post_title": "Put That in Your Pipe and Smoke It"
    }
   }, 
   267433, 
   null, 
   1182791340.0
  ], 
  [
   270724, 
   null, 
   "Steeeeve", 
   "Thomas rips it up again:\n \n\n I am afraid that our jurisprudence now says that students have a right to speak in schools except when they don't\n\n \n This was in his concurring opinion where he talks about how Tinker is not a correct decision. He makes a good point here saying there are so many exceptions now that we really don't know when Tinker applies and when it doesn't...you just have to walk blindly and the courts will figure it out.\n \n \nI join the Court's opinion because it erodes Tinker's hold in the realm of student speech, even though it does so by adding to the patchwork of exceptions to the Tinker standard. I think the better approach is to dispense with Tinker altogether, and given the opportunity, I would do so.\n What a smart man", 
   {
    "unicode_changes_made": true
   }, 
   270718, 
   null, 
   1182793020.0
  ], 
  [
   270765, 
   null, 
   "Phyllis", 
   "Thomas' dissent is both interesting and gutsy.\n \n \nIn my view, the history of public education suggests that the First Amendment, as originally understood, does not protect student speech in public schools. Although colonial schools were exclusively private, public education proliferated in the early 1800's. By the time the States ratified the Fourteenth Amendment, public schools had become relatively common. W. Reese, America's Public Schools: From the Common School to \"No Child Left Behind\" 11-12 (2005) (hereinafter Reese). If students in public schools were originally understood as having free-speech rights, one would have expected 19th-century public schools to have respected those rights and courts to have enforced them. They did not.\n\n \n It is interesting that as Justice Thomas is asserting his position to be the \"original understanding\" of the First Amendment with respect to students in public shcools, Justice Scalia, as an originalist, did not join his opinion.\n \n \nIn my view, petitioners could prevail for a much simpler reason: As originally understood, the Constitution does not afford students a right to free speech in public schools.\n\n \n I must say that Thomas' argument is pretty forceful however repugnant it may seem on the surface.", 
   {
    "unicode_changes_made": true
   }, 
   270724, 
   null, 
   1182801600.0
  ], 
  [
   270768, 
   null, 
   "Steeeeve", 
   "Thomas' dissent is both interesting and gutsy.\n \n It is interesting that as Justice Thomas is asserting his position to be the \"original understanding\" of the First Amendment with respect to students in public shcools, Justice Scalia, as an originalist, did not join his opinion.\n \n He didn't join because Scalia \"caves\" in after awhile and says if it is standing policy long enough then Stare Decisis kicks in and the precedent stands. Thomas doesn't believe in State Decisis unless the decision was correct the first time :)\n \n \nI must say that Thomas' argument is pretty forceful however repugnant it may seem on the surface.\nTinker had a \"powerful\" line saying \"free speech rights don't end at the school house doors\" (or whatever the quote was). I find this to be an odd statement. Your free speech rights end at almost every private door. If you come into my house screaming then I'll kick you out and you aren't gonna charge me with free speech violation. Think this is limited to private places? What about a Library. You even talk loudly in a library and they can kick you out. \n \n The idea of absolute free speech is just not true.", 
   {}, 
   270765, 
   null, 
   1182803940.0
  ], 
  [
   270773, 
   null, 
   "Phyllis", 
   "He didn't join because Scalia \"caves\" in after awhile and says if it is standing policy long enough then Stare Decisis kicks in and the precedent stands. Thomas doesn't believe in State Decisis unless the decision was correct the first time :)\n\n \n I have stated several times on these forums that this is what I find particularly annoying about Justice Scalia. Perhaps we should insist that Justice Scalia label himself as \"an originalist, but only most of the time.\" Whereas we could certainly allow Justice Thomas to label himself a consistent originalist jurist. Is this a shot at Justice Scalia? It certainly is.\n \n \nTinker had a \"powerful\" line saying \"free speech rights don't end at the school house doors\" (or whatever the quote was). I find this to be an odd statement. Your free speech rights end at almost every private door. If you come into my house screaming then I'll kick you out and you aren't gonna charge me with free speech violation. Think this is limited to private places? What about a Library. You even talk loudly in a library and they can kick you out. \n \n The idea of absolute free speech is just not true.\n\n \n The Court has often had to use such smooth philosophical language as a cover for its blatant departure from Constitutional history.\n \n Doesn't the phrase \"students do not 'shed their constitutional rights to freedom of speech or expression at the schoolhouse gate[]'\" just make you feel all warm and fuzzy inside?\n \n Or consider the phrase, \"The foregoing cases suggest that specific guarantees in the Bill of Rights have penumbras, formed by emanations from those guarantees that help give them life and substance.\" Doesn't that just make you want to agree with whatever the Court would say after that?\n \n Or perhaps my favorite, \"Liberty finds no refuge in a jurisprudence of doubt.\" Simply stupendous. Doesn't that just make you want to go give somebody a hug? Who could disagree with a Court that is able to create such eloquent prose?", 
   {}, 
   270768, 
   null, 
   1182805680.0
  ], 
  [
   270787, 
   null, 
   "Steeeeve", 
   "The Court has often had to use such smooth philosophical language as a cover for its blatant departure from Constitutional history.\n \n Doesn't the phrase \"students do not 'shed their constitutional rights to freedom of speech or expression at the schoolhouse gate[]'\" just make you feel all warm and fuzzy inside?\n \n Or consider the phrase, \"The foregoing cases suggest that specific guarantees in the Bill of Rights have penumbras, formed by emanations from those guarantees that help give them life and substance.\" Doesn't that just make you want to agree with whatever the Court would say after that?\n \n Or perhaps my favorite, \"Liberty finds no refuge in a jurisprudence of doubt.\" Simply stupendous. Doesn't that just make you want to go give somebody a hug? Who could disagree with a Court that is able to create such eloquent prose?\n All wonderful and inspiring but I still prefer the obvious: \"As originally understood, the Constitution does not afford students a right to free speech in public school\"\n \n KISS: Keep it simple, stupid :p", 
   {}, 
   270773, 
   null, 
   1182808500.0
  ], 
  [
   270824, 
   null, 
   "Marijuanifornia", 
   "Watch the 1942 USDA film, HEMP FOR VICTORY. Three minutes into the film, you will see a Special Tax Stamp issued to American farmers as young as 16 years old to help defend our nation's freedom.\n \n Does the Special Tax Stamp shown in Hemp For Victory say, \"Producer of Industrial Hemp?\" No.\n \n Does it say, \"Producer of a Dangerous Gateway Narcotic That Will Kill Your Children?\" No.\n \n What does it say?\n \n \"PRODUCER OF MARIHUANA.\"\n \n This isn't rocket science. It's weed. Cannabis Sativa. The same plant that helped save this country's XXX from Hitler.\n \n So, take note, everyone. Americans as young as 16 were urged to grow \"MARIHUANA\" in defense of this country.\n \n If you're 16 or older, don't bother with a sign that says \"Bong Hits 4 Santa Claus\" or anything else. Just take a picture of the Special Tax Stamp shown in Hemp For Victory to a print shop and have it blown up to poster size.\n \n If the Supreme Court, which is filled by dumbasses who were hand-picked by the last few douchebag Presidents, doesn't want to support free speech, then maybe they'll support our troops, because that's why \"Marihuana\" was legalized.", 
   {}, 
   270787, 
   null, 
   1182822660.0
  ], 
  [
   270835, 
   null, 
   "Caprii", 
   "What a sad day when an \"adult\" not on school grounds cannot express his freedom of speech. When in fact the words were NOT offensive, what's next?", 
   {}, 
   270824, 
   null, 
   1182828540.0
  ], 
  [
   270912, 
   null, 
   "E Mutz", 
   "\n \n So, take note, everyone. Americans as young as 16 were urged to grow \"MARIHUANA\" in defense of this country.\n \n If you're 16 or older, don't bother with a sign that says \"Bong Hits 4 Santa Claus\" or anything else. Just take a picture of the Special Tax Stamp shown in Hemp For Victory to a print shop and have it blown up to poster size.\n \n If the Supreme Court, which is filled by dumbasses who were hand-picked by the last few douchebag Presidents, doesn't want to support free speech, then maybe they'll support our troops, because that's why \"Marihuana\" was legalized.\n\n \n About the same time as your vaunted Marihuana film the same gubment was recommending the widespread use of DDT and the medicinal effects of tobacco. Suffice to say we have moved on.\n \n I would respond to your second paragraph but I could not find a point therein.", 
   {}, 
   270824, 
   null, 
   1182866640.0
  ], 
  [
   270927, 
   null, 
   "JPSartre12", 
   "What a sad day when an \"adult\" not on school grounds cannot express his freedom of speech. When in fact the words were NOT offensive, what's next?\n\n \n It's a little more complicated than that. Read the opinion.", 
   {}, 
   270835, 
   null, 
   1182872280.0
  ], 
  [
   270931, 
   null, 
   "JPSartre12", 
   "About the same time as your vaunted Marihuana film the same gubment was recommending the widespread use of DDT and the medicinal effects of tobacco. Suffice to say we have moved on.\n\n Actually, the use of DDT has made a resurgance in Africa. It appears to be less harmful than the mosquitos that it kills. \n And \"the other film\" that Uncle Sam made about hemp was \"Reefer Madness.\" What a fiasco that was. emoticon_xclown \n \n\n I would respond to your second paragraph but I could not find a point therein.\n", 
   {}, 
   270912, 
   null, 
   1182872460.0
  ], 
  [
   270953, 
   null, 
   "Zardoz", 
   "Uh...\"Hemp For Victory\" advocates the cultivation of hemp for industrial use, not smoking it. Industrial use of hemp is a good thing. It is a cheap, easily produced, versatile raw material. Smoking it just makes you hungry and stupid.\n\n \n There is a huge difference in the 2 (Hemp vs Marijuana). Mostly the THC content.\n Industrial hemp can't really get you high and is a very versitile material that other textiles (like cotton) don't want to compete against. It also contains hardly any THC\n Marijuana on the other hand is of the same family but has THC for getting high...\n They also can't cross pollinate without destroying the pot. They give off different UV for aerial detection. \n \n They aren't the same. Much like a boy and a girl are both humans but not the same. \n The ability to grow hemp in the US decades past to support the war wasn't for the type that could be smoked or used as a drug but the type used to make rope. \n \n Of course, idiotic propagandists who want to muddy the waters over look this. I mean, hemp is hemp...*puff* emoticon_rolleyes\n \n Hemp info.", 
   {}, 
   267433, 
   null, 
   1182875880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bong Hits for Who?", 
  "url": "http://www.4forums.com/political/current-events-debates/9664-bong-hits-who.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 9664, 
  "discussion_files": [
   [
    "24511.html", 
    "http://www.4forums.com/political/current-events-debates/9664-bong-hits-who-print.html"
   ], 
   [
    "24512.html", 
    "http://www.4forums.com/political/current-events-debates/9664-bong-hits-who-6-print.html"
   ], 
   [
    "24513.html", 
    "http://www.4forums.com/political/current-events-debates/9664-bong-hits-who-4-print.html"
   ], 
   [
    "24514.html", 
    "http://www.4forums.com/political/current-events-debates/9664-bong-hits-who-5-print.html"
   ], 
   [
    "24515.html", 
    "http://www.4forums.com/political/current-events-debates/9664-bong-hits-who-3-print.html"
   ], 
   [
    "24516.html", 
    "http://www.4forums.com/political/current-events-debates/9664-bong-hits-who-2-print.html"
   ]
  ], 
  "identifier": 9664
 }
]