[
 [
  [
   254998, 
   null, 
   "simone", 
   "Then came warfare:\n \n http://www.nytimes.com/2007/03/20/science/20moral.html\n \n \n. . . . Religion can be seen as another special ingredient of human societies, though one that emerged thousands of years after morality, in Dr. de Waal's view. There are clear precursors of morality in nonhuman primates, but no precursors of religion. So it seems reasonable to assume that as humans evolved away from chimps, morality emerged first, followed by religion. \"I look at religions as recent additions,\" he said. \"Their function may have to do with social life, and enforcement of rules and giving a narrative to them, which is what religions really do.\"\n \n As Dr. de Waal sees it, human morality may be severely limited by having evolved as a way of banding together against adversaries, with moral restraints being observed only toward the in group, not toward outsiders. \"The profound irony is that our noblest achievement - morality - has evolutionary ties to our basest behavior - warfare,\" he writes. \"The sense of community required by the former was provided by the latter.\" . . .\n\n So. . . if we had skipped the religion thing, does that mean there wouldn't be any warfare?", 
   {
    "post_info": {
     "post_title": "First Came Morality, Then Came Relibion. . ."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1174415580.0
  ], 
  [
   254999, 
   null, 
   "simone", 
   "But, come to think of it, if we had done the relibion thing--my misspelling of religion, then we might have been OK.", 
   {}, 
   254998, 
   null, 
   1174415700.0
  ], 
  [
   255023, 
   null, 
   "billsco", 
   "Jebus is my relibion.", 
   {}, 
   254999, 
   null, 
   1174425780.0
  ], 
  [
   255024, 
   null, 
   "MrWriteLA", 
   "I, on the other hand, am a Guddhist.", 
   {}, 
   255023, 
   null, 
   1174426860.0
  ], 
  [
   255026, 
   null, 
   "Big Orn", 
   "Shirley we ain't gonna stot maikin fun uv how foxe spel aroun heer r we?\n \n enniway I dont fawl fer awl thet tawk ubowt relibion. If won round of wimmins libion aint inuff, thin thay need to kwit.", 
   {}, 
   255024, 
   null, 
   1174431240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  First Came Morality, Then Came Relibion. . .", 
  "url": "http://www.4forums.com/political/religion-debates/9667-first-came-morality-then-came-relibion.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9667, 
  "discussion_files": [
   [
    "12515.html", 
    "http://www.4forums.com/political/religion-debates/9667-first-came-morality-then-came-relibion-print.html"
   ]
  ], 
  "identifier": 9667
 }
]