[
 [
  [
   255561, 
   null, 
   "Another opinion", 
   "I have always been curious about the personal experiences that people have which convince them to believe in the supernatural - be it God, the soul, or any other supernatural idea. It has always been a touchy subject to bring up since people consider these experiences very personal and, most of the time, are unwilling to openly present them due to fear of criticism or ridicule.\n \n So, I am trying an experiment in this thread in that I am inviting people to share those experiences with the ground rules that this is intended as a survey only without any of those posts being open for discussion. So, no responses commenting on those posts are allowed - especially not negative ones. Of course, such a thing is hard to police and some people might respond to your posts anyway. However, in the ground rules of this forum, the posters need feel NO OBLIGATION to respond to such rule-breakers. These rules are set out to make people feel more comfortable presenting their experiences.\n \n -----\n To start with myself, though most unusual experiences I have had could be reasonably explained also with probability and/or psychological interpretation, there is one that to this day remains mysterious and hard to justify. Namely, when I was an early teenager, my grandmother died. She had been relatively sick for years but there was nothing to indicate that the sickness had gotten any worse or that she was near death. The afternoon of her death, after school, the thought popped into my head that she was dead and I spoke it out loud to my brother. That thought had never occurred to me before, I had not been thinking a lot about her recently and the thought was not accompanied by any strong emotion. It simply came \"out of the blue\". That evening, my mother came home crying since her mother, my grandmother, had died. That experience was such a very low probability and unusual occurrence that it has remained a mystery to me to this day - one that opens my intellectual curiousity to the possibility of a supernatural.\n \n So, would you be willing to share your experiences?", 
   {
    "post_info": {
     "post_title": "A survey of personal experiences supporting a belief in the supernatural"
    }
   }, 
   null, 
   null, 
   1174937460.0
  ], 
  [
   255608, 
   null, 
   "billsco", 
   "Why the overly-restictive ground rule? Are you concerned about having your supernatural experience uncovered for what it is--probably a simple coincidence? Or you were picking up vibes from your mother who was shielding you from some developments. Or...well we'll never know with these restrictions in place.", 
   {}, 
   255561, 
   null, 
   1174948140.0
  ], 
  [
   255614, 
   null, 
   "Big Orn", 
   "Unless there is a \"Testimony Only\" sub-forum, the rules are just about useless.\n \n Apart from that...testimony does not fare very well in any public forum. Those who share them are usually torn to shreds...emoticon_xdonno", 
   {}, 
   255608, 
   null, 
   1174954500.0
  ], 
  [
   255625, 
   null, 
   "jyoshu", 
   "Unless there is a \"Testimony Only\" sub-forum, the rules are just about useless.\n \n Apart from that...testimony does not fare very well in any public forum. Those who share them are usually torn to shreds...emoticon_xdonno\n\n \n Well, I for one was about to participate, but I was holding my tongue until I could see whether critics would actually be courteous enough to allow the thread to continue without belittling these testimonies. Based on Bilsco's response, it doesn't look very promising at this point. I think AnotherOpinion has a great idea here. The critics are always wanting to get evidence and so why should people not share their experiences? It seems to me that this would be a great chance for the critics to actually learn what makes some religious people believe what they do ... that is if they aren't here just for the purpose of belittling religious people t begin with. emoticon_xangel", 
   {}, 
   255614, 
   null, 
   1174967100.0
  ], 
  [
   255632, 
   null, 
   "Another opinion", 
   "Well, I for one was about to participate, but I was holding my tongue until I could see whether critics would actually be courteous enough to allow the thread to continue without belittling these testimonies. Based on Bilsco's response, it doesn't look very promising at this point. I think AnotherOpinion has a great idea here. The critics are always wanting to get evidence and so why should people not share their experiences? It seems to me that this would be a great chance for the critics to actually learn what makes some religious people believe what they do ... that is if they aren't here just for the purpose of belittling religious people t begin with. emoticon_xangel\n\n It is a pity that you, and probably others, are intimidated from participating by billsco's response. Several months ago, I had tried a similar approach - a survey with ground rules of no responses - in the Abortion forum in order to encourage the presentation of new views from people who do not usually participate for fear of flamers. It had worked enough for several new people to present their views before the thread lost momentum. I was hoping for something similar here but it seems that the Religion forum is even more attractive to flamers (in the form of billsco in this case) than the Abortion forum - somewhat surprising to me. I have ignored his post as I hope others would ignore the posts of flamers if they do find the courage to present their views here. \n \n I remain hopeful for more personal experiences being presented but understand if people are too intimidated to present them. As you said, it would be useful for all involved to hear people's experiences and then judge for themselves.", 
   {}, 
   255625, 
   null, 
   1174968780.0
  ], 
  [
   255674, 
   null, 
   "Big Orn", 
   "Testimony strengthens those of us who have been blessed with His touch. There is no other single event or string of events that can compare. However, no matter how you present it, those blessings will appear to be nothing more than hype to non-believers. God is illogical...period. Illogical discussions will fall under the category of insane rantings in any public forum.\n \n Cold, hard fact.", 
   {}, 
   255632, 
   null, 
   1175004060.0
  ], 
  [
   255678, 
   null, 
   "jyoshu", 
   "It is a pity that you, and probably others, are intimidated from participating by billsco's response.\n\n \n I don't feel intimidated, it's just that I'm sick of dealing with prejudiced people, frankly, who can't abide other views without feeling the need to try and discredit it. Religion is the only field I know of where experience is automatically discounted, simply on the basis of it being religion. Now THAT'S prejudice. Religion isn't going to go away, so people like Billsco really need to learn to live with it. I'll think through my response some more and then I may post some of my experiences.", 
   {}, 
   255632, 
   null, 
   1175007120.0
  ], 
  [
   255707, 
   null, 
   "trebor", 
   "I have always been curious about the personal experiences that people have which convince them to believe in the supernatural - be it God, the soul, or any other supernatural idea. It has always been a touchy subject to bring up since people consider these experiences very personal and, most of the time, are unwilling to openly present them due to fear of criticism or ridicule.\n \n So, I am trying an experiment in this thread in that I am inviting people to share those experiences with the ground rules that this is intended as a survey only without any of those posts being open for discussion. So, no responses commenting on those posts are allowed - especially not negative ones. Of course, such a thing is hard to police and some people might respond to your posts anyway. However, in the ground rules of this forum, the posters need feel NO OBLIGATION to respond to such rule-breakers. These rules are set out to make people feel more comfortable presenting their experiences.\n \n -----\n To start with myself, though most unusual experiences I have had could be reasonably explained also with probability and/or psychological interpretation, there is one that to this day remains mysterious and hard to justify. Namely, when I was an early teenager, my grandmother died. She had been relatively sick for years but there was nothing to indicate that the sickness had gotten any worse or that she was near death. The afternoon of her death, after school, the thought popped into my head that she was dead and I spoke it out loud to my brother. That thought had never occurred to me before, I had not been thinking a lot about her recently and the thought was not accompanied by any strong emotion. It simply came \"out of the blue\". That evening, my mother came home crying since her mother, my grandmother, had died. That experience was such a very low probability and unusual occurrence that it has remained a mystery to me to this day - one that opens my intellectual curiousity to the possibility of a supernatural.\n \n So, would you be willing to share your experiences?\n\n \n \n I have had several experiances that could potentially be considered 'psychic'. \n I knew when my father passed away. Of course, there WAS plenty of reason to think he was in the final stages of life. I also had pop into my head that one of my school mates was returning to school after a period of absense due to illness. \n \n The third one was when I was a child, I saw a luminous ball, vaguely oval shaped that was just floating in the house. I thought it was a ghost back then (being a 5 year old kid). TO this day I don't know what it was.", 
   {}, 
   255561, 
   null, 
   1175019480.0
  ], 
  [
   255710, 
   null, 
   "johnhanks", 
   "Religion is the only field I know of where experience is automatically discounted, simply on the basis of it being religion.\n\n With respect, I don't think that's true. Testimony based on personal experience is also viewed with scepticism in matters such as alien visitations, poltergeist encounters and homeopathic cures. Anywhere, in fact, where the testimony runs counter to most people's experience of how the world works. Religion is not singled out here.\n \n We all construct our own mental model of how the world works. When someone makes an extraordinary claim, whether of alien abduction or of religious revelation, we tend to test the claim against our world-view and ask which is more consistent with it - the truth of the claim, or the testimony being unreliable. Have we ever experienced alien abduction? Probably not. Have we ever experienced another individual's personal testimony that has proven to be false or mistaken? Probably. The scales are thus tilted toward scepticism, but to call that tilt prejudice is a little harsh, I think. It has not been pre-judged that all personal testimony is necessarily false, merely that extraordinary claims need extraordinary evidence; and testimony of personal experience is all too ordinary, and all too fallible.\n \n (I apologise to Another opinion for violating his rule of non-comment, and can only say in mitigation that I was responding to comments already made.)", 
   {}, 
   255678, 
   null, 
   1175020260.0
  ], 
  [
   255734, 
   null, 
   "billsco", 
   "Well, I mean there's already a platform for sharing supernatural experiences. Coast to Coast radio which begins late at night is the perfect place for people to call in and tell about the spook they just saw or the almond-eyed alien looking in their window. The genial host won't ask any penetrating questions, just an occassional hmmm and oooohhh. \n \n You know, if you guys want to do that in this thread, that's fine by me. I just think if one holds a certain belief one should be able to defend it rigorously, or else don't possess it.", 
   {}, 
   255710, 
   null, 
   1175027700.0
  ], 
  [
   255752, 
   null, 
   "jyoshu", 
   "With respect, I don't think that's true. Testimony based on personal experience is also viewed with scepticism in matters such as alien visitations, poltergeist encounters and homeopathic cures. \n\n \n Ever heard of project blue book? The govt. took the alien thing pretty seriously. The other examples I'll grant you.\n \n \nAnywhere, in fact, where the testimony runs counter to most people's experience of how the world works. Religion is not singled out here.\n\n \n I don't think that's what the 'skepticism' is based on, simply because atheists are pretty much outnumbered. You're using an argument based on quantity here (\"most\"). Since so many people the world over ARE religious, apparently it DOESN'T go against the experiences of as many people as you must think.", 
   {}, 
   255710, 
   null, 
   1175030040.0
  ], 
  [
   255759, 
   null, 
   "johnhanks", 
   "Ever heard of project blue book? The govt. took the alien thing pretty seriously. The other examples I'll grant you.\n\n What your government took or takes seriously is a problem for you and your voting intentions. I was talking about the reaction of people in general. (And the other examples will do nicely by themselves, thank you.)\n \nI don't think that's what the 'skepticism' is based on, simply because atheists are pretty much outnumbered. You're using an argument based on quantity here (\"most\"). Since so many people the world over ARE religious, apparently it DOESN'T go against the experiences of as many people as you must think.\n\n Atheists may be out-numbered, but non-christians are not. Are you suggesting that most Hindus and Muslims are/were receptive to the validity of Christians' personal testimony of the truth of their beliefs? Are you receptive to the divinity of Ganesh? Thousands of eye-witnesses will testify to it.", 
   {}, 
   255752, 
   null, 
   1175031360.0
  ], 
  [
   255762, 
   null, 
   "jyoshu", 
   "What your government took or takes seriously is a problem for you and your voting intentions.\n\n \n It's no problem for me! I'm just pointing out that with that example, it IS taken seriously, at least at times.\n \n \nAtheists may be out-numbered, but non-christians are not. Are you suggesting that most Hindus and Muslims are/were receptive to the validity of Christians' personal testimony of the truth of their beliefs? Are you receptive to the divinity of Ganesh? Thousand of eye-witnesses will testify to it.\n\n \n Again, you're shifting your argument to pit religions against ea other, but that doesn't address the more general issue of religious experience. This is the 'religion' forum, not the 'Christianity' forum. You did this awhile back in a diff. thread. If both Hindus AND Christians claim to have religious experiences, then that strengthens the argument for religious experiences MORE so than if only Christians did, or only Hindus. This is pretty basic. Take your poltergeist example, for instance. If group A says they have seen red ghosts, and group B says they have seen green ghosts, they are BOTH still claiming experiences of seeing ghosts, even if group A doesn't believe in green ghosts, and group B doesn't believe in red ones.", 
   {}, 
   255759, 
   null, 
   1175032140.0
  ], 
  [
   255764, 
   null, 
   "Big Orn", 
   "You know, if you guys want to do that in this thread, that's fine by me. I just think if one holds a certain belief one should be able to defend it rigorously, or else don't possess it.\n\n Afternoon, Sir Billsco :) \n \n If there was any way that a person could share that belief in any other form than how we go about it, then there would be plenty of defensive strategies. But you know from years of debating this, that it just ain't gonna happen.\n \n For a church, testimony is essential. We are constantly battling against the unseen, unprovable powers of this world. One thing leads to another until we finally succeed. This success comes at a price, sometimes carnal, sometimes spiritual, but always beneficial. When we're finally able to grasp all this and understand it, we feel the need to tell it. \n \n It's not the telling of it, though, that's hard, it's the ability to believe it. When we ask those that have no idea of what this power is and where it comes from to lend an ear, it turns more into a science fiction party than a serious discussion.\n \n Of course, I am skeptical of accounts of those who have had encounters with Bigfoot...so I can see where you're coming from.", 
   {}, 
   255734, 
   null, 
   1175032800.0
  ], 
  [
   255765, 
   null, 
   "Another opinion", 
   "Atheists may be out-numbered, but non-christians are not. Are you suggesting that most Hindus and Muslims are/were receptive to the validity of Christians' personal testimony of the truth of their beliefs? Are you receptive to the divinity of Ganesh? Thousands of eye-witnesses will testify to it.\n\n Speaking for myself, I started this thread mainly out of curiosity about what exactly it was that made people believe in the supernatural and hold onto those beliefs - specifically, what was it in their personal experience that supported that belief. Given that the great majority of people around the world, including in the US, profess to believe in some faith, I think it is a legitimate question.\n \n Presumably, many people believe in a religion simply because their parents believed that, it is a part of their tradition, and they need no supporting experiences to continue to believe that. However, I think that many do claim to have spiritual / emotional experiences that support their belief (whatever that belief may be). I am simply quite curious about what those experiences are.\n \n Also, given that the great majority of people in the world claim to be religious, this is not a fringe wacky issue (as are claims of alien abduction, etc.). We are talking about BILLIONS of people who hold religious views - the majority of our world's population. It is important for me and, I think, for many others to know WHY they hold them. Aren't you at all curious?", 
   {}, 
   255759, 
   null, 
   1175032980.0
  ], 
  [
   255768, 
   null, 
   "johnhanks", 
   "If both Hindus AND Christians claim to have religious experiences, then that strengthens the argument for religious experiences MORE so than if only Christians did, or only Hindus.\n\n I think you're on dangerous ground here. You are in effect saying[*]I possess a special, unique truth vouchsafed to me by personal experience[*]Xavier, Yolande and Zebedee also say they possess special, unique truths vouchsafed by personal experience, though they are contradictory to mine[*]but surely the more of us who claim to have experienced special, unique truths, the more likely it is that the experience and the revealed truth must be valid!!!The logic works differently. The more people who claim to possess their own special, unique and exclusive truth, the less likely it is that any of them actually does.\n \n If Christians report experiences which to them confirm that Christ is Lord, and Hindus report experiences which to them confirm that Ganesh is Lord, this simply adds weight to the idea that such experiences are mutually self-cancelling and illusory.", 
   {}, 
   255762, 
   null, 
   1175033580.0
  ], 
  [
   255769, 
   null, 
   "sinjin", 
   "However, I think that many do claim to have spiritual / emotional experiences that support their belief (whatever that belief may be).\nIs there any other kind?", 
   {}, 
   255765, 
   null, 
   1175034000.0
  ], 
  [
   255770, 
   null, 
   "jyoshu", 
   "If Christians report experiences which to them confirm that Christ is Lord, and Hindus report experiences which to them confirm that Ganesh is Lord, this simply adds weight to the idea that such experiences are mutually self-cancelling and illusory.\n\n \n No, it only means they are contradicting. It doesn't speak to whether the experiences are real. Furthermore, who says that the experiences all Christians have are about Christ being exclusive? If someone has a religious experience of being healed, or a vision of the virgin Mary standing before them but saying nothing, nowhere in those experiences is the exclusivity of any given religion addressed. Maybe some Christians believe that Christ is the exclusive correct religion due to their reading of the Bible, even though the religious experiences they've had were about other matters (such as healing). I think you are conflating a belief with religious experience, and the two are not always directly related.", 
   {}, 
   255768, 
   null, 
   1175034000.0
  ], 
  [
   255772, 
   null, 
   "johnhanks", 
   "Also, given that the great majority of people in the world claim to be religious, this is not a fringe wacky issue (as are claims of alien abduction, etc.). We are talking about BILLIONS of people who hold religious views - the majority of our world's population. It is important for me and, I think, for many others to know WHY they hold them. Aren't you at all curious?\n\n AO, I'm enormously curious. Why else do you think I, an atheist, hang around religion forums? But I don't think you can dismiss the alien abduction analogy so lightly: at one time, christianity was a 'fringe wacky issue'. You're right, the great majority of people in the world profess to believing absurd ideas, be they milk-drinking statues of elephant-gods, the holiness of big black rocks, or virgins giving birth to godlings. Who wouldn't be curious as to why?\n \n Please let me know if you find the answer. In the meantime, I'll keep probing.", 
   {}, 
   255765, 
   null, 
   1175034240.0
  ], 
  [
   255775, 
   null, 
   "billsco", 
   "I'm not sure we're welcome here johnhanks. It seems they want to go about telling their spook stories unmolested.", 
   {}, 
   255772, 
   null, 
   1175035560.0
  ], 
  [
   255776, 
   null, 
   "johnhanks", 
   "No, it only means they are contradicting. It doesn't speak to whether the experiences are real ... I think you are conflating a belief with religious experience, and the two are not always directly related.\n\n Now, correct me if I'm wrong, but I think this whole exchange began with the proposition that personal religious experience can be one of the foundations of belief. I agree, that last word is a tricksy one: I might be using it to mean 'belief in the exclusive truth of christianity', whilst you might be using it to mean 'belief in some generalised multi-purpose supernatural deely which lets me co-opt all other world religions onto my side of the argument'. I just end up wondering which of those more closely fits your true position.\n \n With that, tuning out for this evening. I've enjoyed the exchange, and hope to pick it up tomorrow.", 
   {}, 
   255770, 
   null, 
   1175035620.0
  ], 
  [
   255778, 
   null, 
   "Another opinion", 
   "AO, I'm enormously curious. Why else do you think I, an atheist, hang around religion forums? But I don't think you can dismiss the alien abduction analogy so lightly: at one time, christianity was a 'fringe wacky issue'. You're right, the great majority of people in the world profess to believing absurd ideas, be they milk-drinking statues of elephant-gods, the holiness of big black rocks, or virgins giving birth to godlings. Who wouldn't be curious as to why?\n \n Please let me know if you find the answer. In the meantime, I'll keep probing.\n\n I myself am on-the-fence where religion is concerned. I tend to oscillate between agnosticism and some version of Christianity. I was brought up under a moderate version of Catholicism but shifted away from it both due to intellectual reasons and due to distaste of the hate-filled rhetoric of many on the religious right. As a scientist/engineer, I place a tremendous amount of trust in the scientific method. However, I acknowledge that science cannot give answers to every question. Does that mean that religion can? It tries to and often times its answers are much more emotionally sattisfying than the scientific ones. For ex., the scientific analysis shows that those such as Hitler or Stalin who committed such attrocities on a mass scale barely suffered in life, whereas most religions promote some sort of cosmic justice. There are many such areas in which religion gives the more sattisfying answer which, I think, constitutes part of its draw. At least, those aspects are the ones which draw me most to wanting to believe in some sort of supernatural. \n \n However, I fully acknowledge that wanting to believe something is true and it being true are two entirely different things. I believe in following the evidence, but sometimes there is no evidence either way and one either assumes that the cracks in scientific knowledge cannot be filled by anything that is not present in those areas that are known by science, or one might take a leap of faith into supernatural beliefs. If there is no scientific evidence of the supernatural, then is there any other type of evidence that might support it? I agree that anecdotal evidence is very unreliable but I think it is worth hearing out - which is what I was hoping for in this thread. Some anecdotal evidence can certainly be explained away by probability or psychological interpretations. However, so many people seem to have mysterious experiences that are hard to explain away with science or logic (including my experience of my grandmother's death) that I hold out hope that perhaps there is something behind those experiences.\n \n The fact that religions vary so widely does not, in my mind, disprove them. No religion is imune to human interpretation (I am sure that you would claim that all religions are purely human interpretation and imagination). However, perhaps there is some common thread among them that constitutes a real supernatural - not just an imagined one. I think the only way to explore this is to hear people out. I would rather hear an unchallenged version of these experiences than not hear them at all. That is why I set up the ground rules of this thread.", 
   {}, 
   255772, 
   null, 
   1175036040.0
  ], 
  [
   255779, 
   null, 
   "sinjin", 
   "I myself am on-the-fence where religion is concerned. I tend to oscillate between agnosticism and some version of Christianity. I was brought up under a moderate version of Catholicism but shifted away from it both due to intellectual reasons and due to distaste of the hate-filled rhetoric of many on the religious right. As a scientist/engineer, I place a tremendous amount of trust in the scientific method. However, I acknowledge that science cannot give answers to every question. Does that mean that religion can? It tries to and often times its answers are much more emotionally sattisfying than the scientific ones. For ex., the scientific analysis shows that those such as Hitler or Stalin who committed such attrocities on a mass scale barely suffered in life, whereas most religions promote some sort of cosmic justice. There are many such areas in which religion gives the more sattisfying answer which, I think, constitutes part of its draw. At least, those aspects are the ones which draw me most to wanting to believe in some sort of supernatural. \n \n However, I fully acknowledge that wanting to believe something is true and it being true are two entirely different things. I believe in following the evidence, but sometimes there is no evidence either way and one either assumes that the cracks in scientific knowledge cannot be filled by anything that is not present in those areas that are known by science, or one might take a leap of faith into supernatural beliefs. If there is no scientific evidence of the supernatural, then is there any other type of evidence that might support it? I agree that anecdotal evidence is very unreliable but I think it is worth hearing out - which is what I was hoping for in this thread. Some anecdotal evidence can certainly be explained away by probability or psychological interpretations. However, so many people seem to have mysterious experiences that are hard to explain away with science or logic (including my experience of my grandmother's death) that I hold out hope that perhaps there is something behind those experiences.\n \n The fact that religions vary so widely does not, in my mind, disprove them. No religion is imune to human interpretation (I am sure that you would claim that all religions are purely human interpretation and imagination). However, perhaps there is some common thread among them that constitutes a real supernatural - not just an imagined one. I think the only way to explore this is to hear people out. I would rather hear an unchallenged version of these experiences than not hear them at all. That is why I set up the ground rules of this thread.\nWhy do you hope the supernatural realm is real? Btw I don't find \"cosmic justice\" a satisfying explanation in the least.", 
   {}, 
   255778, 
   null, 
   1175036640.0
  ], 
  [
   255781, 
   null, 
   "jyoshu", 
   "I just end up wondering which of those more closely fits your true position.\n\n \n Personally speaking, my beliefs are that Christianity is the one true religion. But for the sake of this argument, that doesn't really matter, it seems to me. We're discussing religious experience and belief in the general sense, I think. I for one feel that I can logically argue the merits of something independent of my personal beliefs. I get the impression that you seem to think my belief in an exclusive religion somehow invalidates something here. I don't think it does--maybe Hindus (for example) HAVE seen something in their visions, from the supernatural. To debate which one has the correct claim to exclusivity would take a whole other thread, and then some. Anyway, this got way off (unsurprisingly) from where AnotherOpinion wanted to go with this thread, so I think I'm going to cease my part of this particular line of discussion.", 
   {}, 
   255776, 
   null, 
   1175037180.0
  ], 
  [
   255783, 
   null, 
   "Zardoz", 
   "\n The logic works differently. The more people who claim to possess their own special, unique and exclusive truth, the less likely it is that any of them actually does.\n\n \n I'd have to concur to that reasoning being factual.\n I've read enough testimonials to convince me than it's a form of self delusion, manipulation (you'd be surprised how much mind manipulation and brainwashing goes on in services where most 'religious experiences' take place) or outright fraud by the one experiencing because they want to fit in or feel special. Some ex followers of Pat Robertson, Jerry Falwell and plenty others have confessed.\n Even Marjoe Gortner pretty much says that he manipulated people to have experiences so that he and other evangelical leaders at the time can milk the dupes for more money. \n \n \n \n Maybe people here should investigate more into mind control issues.\n \n For example, did you know that certain light settings can affect your suggestibility?\n Did you know that some religious institutions invest in 'decent lighting'.\n Want to discuss music?\n Hand gestures?\n How to construe a monolog to go from logical A to illogical Z and still get the bobble headed masses to agree?\n Did you know there are classes where you can learn this?\n Did you know politicians are engaged in this. Advertisers for products your really don't need, don't want and will probably never use?\n \n The greatest lie one ever tells themselves is that they are immune to the influences of others, that they are independent thinkers and that their 'experiences' no matter how bizzarre are 100% legitimate.\n \n Granted, there are a few out there who may defy the above explanation but, more often than not, we're just tools to someone who's stumbled on manipulation techniques or worse, finely honed them for fun and personal profit.\n \n That being said, I have a sermon to give tonight in 3 hours and I still have to select a suit and tie. I think I'll moonwalk in my Armani. \n The sermon won't have to be much of anything meaningful. Probably start out with some healing of aches and pains and heal some mysterious person in the congregation who had a growth on their gall bladder...but didn't know it. Then general slayings in the Spirit and some holy laughter. Then shake down the group for some walking money with some calls for a love offering.\n I've been light lately on calls for tithing but, this weekend, I'll lash them harshly with Malachi on robbing God after an hour of music worship and general tongues speaking. Nothing puts you in an alpha state easier.", 
   {}, 
   255768, 
   null, 
   1175037780.0
  ], 
  [
   255784, 
   null, 
   "Another opinion", 
   "Why do you hope the supernatural realm is real?\n\n For a few reasons. Partly, there are trends in religions that appeal to our emotions:\n - Most believe in some sort of life after death, which not only soothes some of the sense of loss we might have at the death of a loved one, but also gives us some hope that death is not the very end of our own existence. \n - Most religions have some sense of cosmic justice. The details of the cosmic justice system that some religions believe (such as nonbelievers going to hell) may not be appealing but it is appealing to think that those who caused tremendous suffering will themselves be punished in an afterlife.\n - The banality of everyday life can be lifted if one believes oneself part of a grand cosmic world.\n \n On another note, wouldn't the world just be so much more INTERESTING if there really was a supernatural. I would absolutely love it if scientific evidence presented itself of the supernatural - anything from telepathy through the soul, or evidence of a supernatural being. Assuming that this supernatural would not be dangerous to us, it would make life so much more exciting to know it existed. \n \n Btw I don't find \"cosmic justice\" a satisfying explanation in the least.\n\n Doesn't it bother you if horrible people get away with attrocities? Wouldn't it be nice if there was cosmic justice? I'm not saying that cosmic justice is the real explanation just that it is a sattisfying one. The scientific explanation says that when we die, there is nothing left of our existence. Where justice is concerned, that means that the worst war criminals can eventually die peacefully in their beds without ever having faced justice for their crimes. This makes me uncomfortable enough to at least hope that a cosmic justice system exists.", 
   {}, 
   255779, 
   null, 
   1175037780.0
  ], 
  [
   255786, 
   null, 
   "sinjin", 
   "On another note, wouldn't the world just be so much more INTERESTING if there really was a supernatural. I would absolutely love it if scientific evidence presented itself of the supernatural - anything from telepathy through the soul, or evidence of a supernatural being. Assuming that this supernatural would not be dangerous to us, it would make life so much more exciting to know it existed.\nI think those who need more miracles than the natural world offers aren't paying attention.\n \nDoesn't it bother you if horrible people get away with attrocities? Wouldn't it be nice if there was cosmic justice? I'm not saying that cosmic justice is the real explanation just that it is a sattisfying one. The scientific explanation says that when we die, there is nothing left of our existence. Where justice is concerned, that means that the worst war criminals can eventually die peacefully in their beds without ever having faced justice for their crimes. This makes me uncomfortable enough to at least hope that a cosmic justice system exists.\nConvincing people that justice needn't be served in this life is the best thing oppressors have going for themselves.", 
   {}, 
   255784, 
   null, 
   1175038500.0
  ], 
  [
   255788, 
   null, 
   "Another opinion", 
   "I think those who need more miracles than the natural world offers aren't paying attention.\n\n Nature certainly does offer quite an array of interesting creatures and environments to ponder - many quite beautiful or intriguing. Also, though the great majority of our lives are either predictable or understandable, there are certainly also those great tales of noble deads, fascinating people, etc. I am not saying that the world is not interesting without a supernatural. I am mostly saying that an actual supernatural would add so much more to what we have. Is it necessary in order to enjoy life or make it interesting? I don't think so. Would it make life more interesting than it is? I would say yes.\n \nConvincing people that justice needn't be served in this life is the best thing oppressors have going for themselves.\n\n I am certainly not saying that justice shouldn't be served in this life (and I don't think most religions are either). However, history has shown that far too often, justice is not served no matter whether people thought it should be in life or after. The attempts at gaining justice in this life often just don't work out. So, that leaves people with the choice of either accepting that justice will never be faced by that perpetrator or to gain satisfaction in thinking that, at least, he got what he deserved in an afterlife. Even if this is not true (which the scientific view says it isn't), then that bit of self-dillusion can be quite psychologically beneficial to the one who suffered the injustice.\n \n However, I think we are going far afield of the purpose of this thread, so I am signing off for now. We can continue this discussion in another thread, if you like.", 
   {}, 
   255786, 
   null, 
   1175039820.0
  ], 
  [
   255814, 
   null, 
   "James", 
   "Temperament probably accounts for our religious views and for any emphasis we lay on spiritual matters generally. Cast of mind may easily determine a person's view when the scriptures are ambiguous.\n \n If we accept the bias of disposition as something inevitable, it seems that questions raised about the purpose of life, \"cosmic justice\", etc., will tend to be explored, as a rule, in religious terms by many thoughtful people. Many others, equally thoughtful, will regard such questions as absurd or meaningless. There is no meeting of minds because materialism and theism are incompatible.\n \n I don't think we are always in control of what we believe - in the sense that if I was offered a reward to stop believing in, say, Boyle's Law, there is no way I could collect. The same probably holds true for my belief in God: even if I wanted to, I couldn't just abandon it.\n \n James.", 
   {}, 
   255788, 
   null, 
   1175084040.0
  ], 
  [
   255832, 
   null, 
   "Ripskar", 
   "Personal experiences: ZERO.\n \n I know a number of people who claim to have seen/spoken to angels/ghosts.\n None of which were convincing, indded such experiences invariably seem to have occured when the person is under some form of mental distress, (relationship breakup/ suicidal/ moving house/ recieving death threats, etc.)\n At the same time they seem inclined to see coincidences in things.\n as such this leads me to the belief that these are more connected to their state of mental health than anything else.", 
   {}, 
   255814, 
   null, 
   1175100300.0
  ], 
  [
   255847, 
   null, 
   "Another opinion", 
   "Personal experiences: ZERO.\n \n I know a number of people who claim to have seen/spoken to angels/ghosts.\n None of which were convincing, indded such experiences invariably seem to have occured when the person is under some form of mental distress, (relationship breakup/ suicidal/ moving house/ recieving death threats, etc.)\n At the same time they seem inclined to see coincidences in things.\n as such this leads me to the belief that these are more connected to their state of mental health than anything else.\n\n I certainly agree that most unusual experiences can be explained by more conventional means. For example, in college, I was particularly stressed at one point and woke up in the middle of the night with the image of my paternal grandmother (not the one whose death I previously mentioned) floating above me. Though it would be nice to think otherwise, I think that experience also could have been explained by a combination of stress and the newly awoken state I was in.\n \n However, my experience (from the first post) of the death of my maternal grandmother truly remains a mystery to this day. The thought that popped into my head that she had died really came out of the blue since the sickness that she had for years had not gotten particularly worse, we had not been talking or especially thinking about her recently, and I had no way of knowing that she had died until my mother came home that evening with the news. I also never had such random thoughts pop into my head before or after (I was not prone to such random guesses). I cannot think of any logic or practically possible reason why that experience should have happened. It remains an intriguing mystery to me. I have heard enough of these types of intriguing stories that it leaves me intellectually open to the possibility of a supernatural (i.e. processes that are not currently explainable by science).", 
   {}, 
   255832, 
   null, 
   1175106060.0
  ], 
  [
   255851, 
   null, 
   "johnhanks", 
   "However, I fully acknowledge that wanting to believe something is true and it being true are two entirely different things.\n\n Absolutely. To think otherwise is to fall into the Appeal to Consequences fallacy.\n \nThe fact that religions vary so widely does not, in my mind, disprove them.\n\n This must necessarily be true, since disproving a claim of an entity's existence is in principle impossible. When the truth-claims of different religions clash, however, this can only serve to cast doubt on them.\n \nHowever, perhaps there is some common thread among them that constitutes a real supernatural - not just an imagined one.\n\n Or perhaps the common thread tells us something about the way human brains are wired.\n \nI think the only way to explore this is to hear people out. I would rather hear an unchallenged version of these experiences than not hear them at all. That is why I set up the ground rules of this thread.\n\n And so, belatedly, I will respect those rules and bow out.", 
   {}, 
   255778, 
   null, 
   1175108520.0
  ], 
  [
   255931, 
   null, 
   "Archangel", 
   "Well. I'm glad I waited long enough to allow you to voice your opinions before I bothered sharing some of the supernatural interventions and experiences that have taken place in my life. None of them of my doing, but all of them in response to my request for help or my praising God for His protection over me. In every case the intervention was immediate and very obvious that it was from Him. And Angels were involved in 4 episodes, but I never saw them, only the people who meant me harm did. And they responded by running from me in fear. \n \n After reading what the above posts say though, it would be a waste of my time and energy to share my experiences with you as you would typically accuse me of being delusional or so needy that I cling to imaginings to convince myself I'm not alone. Or some other typical rubbish. The bible clearly say's that apart from Christ, the natural man cannot see things of the Spirit. Let me assure you that the bible is correct. That's why all of your shallow arguments mean nothing to me because I've been where you're at spiritually, and according to the Gospel, that is spiritually dead. And nothing you can say can negate what I have experienced in the Supernatural through my Heavenly Father and His Holy Spirit which indwells me. I know you can't relate to me because you haven't seen what I have seen. But I have seen what you have seen and can surely relate to being spiritually blind and deaf.", 
   {}, 
   255851, 
   null, 
   1175144760.0
  ], 
  [
   256044, 
   null, 
   "INRI", 
   "Well I for one am not affraid to be riddiculed by people who dont understand these things.\n \n I have had a number of spiritual experiences in my life. I can think of two rather profound experiances. One as a Christian and one that played a part in my conversion.\n \n 1. It was late, I was alone in the dark and had been in prayer for some hours and had reached a deep meditative state. Upon contemplation of the crucifixion I cried out into the night \"My God it must have been so painful, why lord did you choose to die this most terrible way\" and instantly, not a few minutes after giving me time to think of an answer for myself but instantly I heard a voice, it was the lords voice and he said that he had choosen this kind of death to reveal to mankind on a human level the incomprehensable pain that he suffers when we sin. Instantly I realised that neither Jew or Roman were guilty of putting him to death but me. I understood that it was me who dragged him before the court and tried him, that it was me who condemned him before the crowds, it was me who spat in his face and lashed him half to death. It was me who nailed him to the tree and crowned him with thorns and I was doing it over and over and *over again*.\n \n Well as you can imagine I was in a terrible state a few days had passed and I had been miserable so I visited my parish priest. Bless him he tried his hardest to reassure me that now that Jesus was in heaven he no longer felt pain. He wanted me to put it out my mind that I had through my own mind made it up. So I tried to do as he had said and about a week had passed and although a little more relaxed having being reassured by my priest I still felt a little down. It was then on the Saturday afternoon while watching a Catholic TV station that a short programme came on about the lives of different saints, I wasnt paying too much attention to it, the programme that I was interested in had finished and I was thinking about that so I am not sure which saint it was they were highlighting but the saint was a female saint. She had experianced visual apparitions of our lord throughout her life and she too had asked him the same question and this is no ####...the answer was the same as what I had been given.... that is no ####, on my heart before God, that is true!\n \n However their conversation had continued where I had been somewhat emotionally incapable of keeping the meditative state she had continued to converse with the lord and he said to her....The physical pain was all worth while if just one sinning human being loved him a little more and that he would do it all *over again*\n \n I was an emotional wreck again but this time it wasnt sadness but Joy.\n \n 2.\n \n This expereiance unlike the above happend not in reality but in a dream like state and palyed a factor in my conversion\n \n It was early morning, I was in bed in an inbetween state of being awake and asleep. I was with 2 of my firends in one of my firends back garden when i heard what sounded like hymns turning I saw a man sitting on the back step to my firends house immediatly thinking it was my father I went to see what he wanted. I had gotten into the middle of the lawn when a great wind engulffed me in a swirling sensation, at first I was afraid and I tried to fight it but it was so powerful I couldnt advance. Realising that the wind was not harming me I opened my arms to experiance its power and slowly I was lifted up, i just kept going up and up, above the streets and houses until I was perched on an invisable ledge at a great hight, but not so high to be unable to see the action on earth below and I watched people going about their daily lives I saw my village and surrounding area and when I looked I saw the whole earth each home each village each city each person in great detail all at once. I noticed that around each and every person wrapped around them was a black cloak and I then felt a presence behind me and out the corner of my eye a bright white light, I knew it was the lord and I said \"forgive them for the whole world is shrouded in sin\" as I turned towards him. It was then that the light emmiting from him made me realise that I cast a shadow and I fell at his feet sobbing... \"forgive me for I too am shrouded in sin\"......Then I felt a hand upon my head and an undescribable feeling surged through my entire being, my body and my soul, It is a feeling I had never expereianced in my life before or after that event, sometimes I get a similar yet different and so infinatly less intense experieance from the sacrament of reconciliation.", 
   {}, 
   255931, 
   null, 
   1175215380.0
  ], 
  [
   256053, 
   null, 
   "Archangel", 
   "1. It was late, I was alone in the dark and had been in prayer for some hours and had reached a deep meditative state. Upon contemplation of the crucifixion I cried out into the night \"My God it must have been so painful, why lord did you choose to die this most terrible way\" and instantly, not a few minutes after giving me time to think of an answer for myself but instantly I heard a voice, it was the lords voice and he said that he had choosen this kind of death to reveal to mankind on a human level the incomprehensable pain that he suffers when we sin. Instantly I realised that neither Jew or Roman were guilty of putting him to death but me. I understood that it was me who dragged him before the court and tried him, that it was me who condemned him before the crowds, it was me who spat in his face and lashed him half to death. It was me who nailed him to the tree and crowned him with thorns and I was doing it over and over and *over again*.\n \n\n \n You weren't alone in the pain you caused our Lord INRI, I was right by your side with every sin I have commited. We are all so guilty of causing Him the pain He suffered on our behalf. Thank you for sharing your experiences, they are powerful and confirm the promise that say's that in the Last days, old men will prophecy and young men will dream dreams.", 
   {}, 
   256044, 
   null, 
   1175219880.0
  ], 
  [
   256080, 
   null, 
   "INRI", 
   "The real pain of the cross that Jesus suffered continues to suffer was/is the rejection/seperation/sin of mankind.", 
   {}, 
   256053, 
   null, 
   1175247840.0
  ], 
  [
   256099, 
   null, 
   "Archangel", 
   "The real pain of the cross that Jesus suffered continues to suffer was/is the rejection/seperation/sin of mankind.\n\n \n This is so true. But even we believers continue to crucify Him if we continue in sin after recieving the Holy Spirit. And He warns us against such rebellion in Hebrews.\n \n Hbr 6:4 For it is impossible for those who were once enlightened, and have tasted the heavenly gift, and have become partakers of the Holy Spirit, \n Hbr 6:5 and have tasted the good word of God and the powers of the age to come, \n Hbr 6:6 if they fall away,* to renew them again to repentance, since they crucify again for themselves the Son of God, and put Him to an open shame. \n ", 
   {}, 
   256080, 
   null, 
   1175268600.0
  ], 
  [
   256139, 
   null, 
   "INRI", 
   "That passage is about those who convert to and then fall away from the faith. Not so much the temptaition to sin, St Paul talks about suffering from a thorn in the flesh, the thorn represents sin, the flaming thorn bush that God appeared to moses. The thorns represented sin, the healing fire of God. The Crown of thorns, Jesus is king over sin. So when paul talkes about suffering from a thorn in the flesh, he is talking about a sinful weakness, he comes to this conclusion.\n \n \nTo keep me from becoming conceited because of these surpassingly great revelations, there was given me a thorn in my flesh, a messenger of Satan, to torment me. 8 Three times I pleaded with the Lord to take it away from me. 9 But he said to me, \"My grace is sufficient for you, for my power is made perfect in weakness.\" Therefore I will boast all the more gladly about my weaknesses, so that Christ's power may rest on me. 10 That is why, for Christ's sake, I delight in weaknesses, in insults, in hardships, in persecutions, in difficulties. For when I am weak, then I am strong.\n\n \n A man who lives without christ may not recognise his sin and his weakness to sin. Say a man suffers much from temptation to have premarital intercourse, the non believe will participate in willful ignorance, but a believer he may last a month and crumble and he repents and is resoloved with the grace of christ not to sin again and he lasts 6 months and he succumbs to the temptaion and he repents again resolved with the grace of Christ to not sin again and a year goes by and he succumbes again. This man is experiancing in his life the grace of Christ drawing him ever closer to himself....Even if he were to never fall to the temptation he would still have to live with the temptation the desire of the heart...which is still a sin in itself.... We are not christians....we are practicing Christians....that is we are trying to be Christians.", 
   {}, 
   256099, 
   null, 
   1175277540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A survey of personal experiences supporting a belief in the supernatural", 
  "url": "http://www.4forums.com/political/religion-debates/9689-survey-personal-experiences-supporting-belief-supernatural.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9689, 
  "discussion_files": [
   [
    "6620.html", 
    "http://www.4forums.com/political/religion-debates/9689-survey-personal-experiences-supporting-belief-supernatural-print.html"
   ], 
   [
    "6621.html", 
    "http://www.4forums.com/political/religion-debates/9689-survey-personal-experiences-supporting-belief-supernatural-3-print.html"
   ], 
   [
    "6622.html", 
    "http://www.4forums.com/political/religion-debates/9689-survey-personal-experiences-supporting-belief-supernatural-2-print.html"
   ]
  ], 
  "identifier": 9689
 }
]