[
 [
  [
   256184, 
   null, 
   "Zardoz", 
   "NEW YORK (Reuters) - A Manhattan art gallery canceled its Easter-season exhibit of a life-size chocolate sculpture of a naked Jesus Friday after an outcry by Roman Catholics. \n \n The gallery's artistic director tendered his resignation to protest the cancellation. \n \n The sculpture \"My Sweet Lord\" by Cosimo Cavallaro was to be exhibited for two hours each day next week in a street-level window of the Roger Smith Lab Gallery in Midtown Manhattan. \n \n The display had been scheduled to open Monday, days ahead of Good Friday when Christians mark the crucifixion of Jesus and Easter Sunday when they celebrate his resurrection. \n \n But protests including a call to boycott the affiliated Roger Smith Hotel forced the gallery to scrap the showing. \n \n \"We have caused the cancellation of the exhibition and wish to affirm the dignity and responsibility of the hotel in all its affairs,\" James Knowles, president of the Roger Smith Hotel, said in a statement. \n \n The Catholic League for Religious and Civil Rights had called for a boycott of the hotel and dropped the idea once \"We got what we wanted,\" a spokeswoman said. \n \n \"We're delighted with the outcome. We're glad that they came to their senses,\" said Kiera McCaffrey, director of communications for the league, which describes itself as the largest U.S. Catholic civil-rights group. \n \n Before the cancellation, she had called it \"an assault on Christians\" adding: \"They would never dare do something similar with a chocolate statue of the prophet Mohammad naked with his genitals exposed during Ramadan.\" \n \n 'SICKENING DISPLAY' \n \n The archbishop of New York, Cardinal Edward Egan, had called the sculpture \"scandalous\" and a \"sickening display.\" \n \n Matthew Semler, artistic director of the gallery, said he sent the gallery his letter of resignation to protest the cancellation and that \"the ball's in their court\" as to whether he might be convinced to stay. \n \n He does not consider the piece irreverent and said he would look for another venue to display it. \n \n \"I saw it as meditation on all those issues: the fact that it's chocolate, the fact that it's nude, that the chocolate is black,\" Semler said. \n \n A photo of the piece on the artist's Web site (http://www.cosimocavallaro.com/) shows the work suspended in air, depicting Jesus as if on the cross. \n \n New York is familiar with clashes between art and religion. \n \n In 1999, then-Mayor Rudolph Giuliani tried to withdraw a grant from the Brooklyn Museum of Art for a painting depicting the Virgin Mary as a black woman splattered with elephant dung adorned with cut-outs from pornographic magazines. \n \n Current Mayor Michael Bloomberg took a different approach. \n \n \"If you want to give the guy some publicity, talk more about it, make a big fuss,\" Bloomberg told WABC radio. \"If you want to really hurt him, don't pay attention.\" \n\n \n Personally, Who cares what color the Christ is? He was a short Semitic Hebrew if he conformed to his genetic lineage. What of it?\n \n Chocoloate for me would tie in how a High Holy Day has become a feast of gluttony (a deadly sin) for the hypocritic masses claiming to embrase the resurrected one.\n \n Nude? Christ WAS nude folks when he was hung from the cross.\n 1) When you die, you stand a good chance of loosen your bowls and defecating yourself. Why still wear under garments? (ever hear of the Golgothan Sh*t demon from the movie Dogma?) The Romans would have no need for him to have soilt clothing as he (or others) were strung up to die. A process that took a long time to accomplish.\n 2) Form of embarrasment for the condemned. Or, do you really think that Romans would 'allow a man to be executed in dignity' particularly a non-citizen.\n 3) Scripture states so implicity. The Romans divided his garments and when they came to an unseamed article of clothing, rather than cut it, they cast lots for it. Now, contrary to what pulpit pimp will try to tell you, the ONLY unseemed garment would be his loin cloth. An article of clothing wrapped around his nether regions. No other 'unseemed' garment would have fit the description of the times. It was NOT a specially made article of clothing worth a lot of money they were wagering for. John 19:23-27\n \n From the media I had to watch today, the issue was his nudity that was focused on.\n \n Comments?", 
   {
    "post_info": {
     "post_title": "Cucko for Coco Christ"
    }
   }, 
   null, 
   null, 
   1175306160.0
  ], 
  [
   256191, 
   null, 
   "johnhanks", 
   "Comments?\n\n A plague on both their houses. The artistic 'justification' from Semler is trite and contrived. My gut feeling is that he just wants people to think what a bad boy he is: it's the same gesture as Bart Simpson dropping his shorts and showing off his butt.\n \n That said, freedom of expression has to include the right to offend, and it bothers me when self-appointed guardians of public decency proclaim their personal sensibilities inviolable. Setting aside the chocolate gimmick, the piece is just a more or less realistic portrayal of a crucified man, as he almost certainly would have looked. I'm struck by how unpornographic it is: 'conventional' depictions of the crucifixion, revelling in all the blood and agony, are to my mind much more so. Are Christians offended by the suggestion that Christ had a penis?\n \n The only sensible reaction seems to have come from Bloomberg.", 
   {}, 
   256184, 
   null, 
   1175329620.0
  ], 
  [
   256196, 
   null, 
   "gamehuis", 
   "What he said. ^^^", 
   {}, 
   256191, 
   null, 
   1175339460.0
  ], 
  [
   256201, 
   null, 
   "Jo Bennett", 
   "Apart from the lack of loin cloth, I can't see how this figure is any different from the statues of Jesus that hang in or around many churches. Certainly the figure is reminiscent of a figure hanging in one of the churches in my home town (in that case it was a plaster figure painted dark bronze). In terms of giving a realistic understanding of the crucifixion, the chocolate figure is as good as any other. If it weren't for the possible insect problem and the eventual decay (maybe a few coats of matt varnish would solve the problem?) I'd be happy to see the statue grace a church wall. It seems to me that the problem here is not the statue but the the Roman church's persistent fear of willies.", 
   {}, 
   256196, 
   null, 
   1175343180.0
  ], 
  [
   256219, 
   null, 
   "jyoshu", 
   "Apart from the lack of loin cloth, I can't see how this figure is any different from the statues of Jesus that hang in or around many churches. Certainly the figure is reminiscent of a figure hanging in one of the churches in my home town (in that case it was a plaster figure painted dark bronze). In terms of giving a realistic understanding of the crucifixion, the chocolate figure is as good as any other. If it weren't for the possible insect problem and the eventual decay (maybe a few coats of matt varnish would solve the problem?) I'd be happy to see the statue grace a church wall. It seems to me that the problem here is not the statue but the the Roman church's persistent fear of willies.\n\n \n Well, there's always the problem of it melting during the summer. :) Actually, I tend to agree with you here. It's just a statue for goodness' sake.", 
   {}, 
   256201, 
   null, 
   1175362740.0
  ], 
  [
   256223, 
   null, 
   "Zardoz", 
   "That said, freedom of expression has to include the right to offend, and it bothers me when self-appointed guardians of public decency proclaim their personal sensibilities inviolable. Setting aside the chocolate gimmick, the piece is just a more or less realistic portrayal of a crucified man, as he almost certainly would have looked. I'm struck by how unpornographic it is: 'conventional' depictions of the crucifixion, revelling in all the blood and agony, are to my mind much more so. Are Christians offended by the suggestion that Christ had a penis?\n\n \n I do understand your position. But technically offense works BOTH ways.\n \n Would you not be offended by idolotry? Graven images of any type are prohibited by the very texts Christians claim to follow. \n Would you not be offended by the constant and ever increasing over commercialization of holidays of profound importance to your faith?\n Would you not be offended how various sects ever increasily de-humanize or over humanize who the Christ was?\n \n IMO, it should be somewhat offensive because it displays the hypocracy embrassed by those who are offended.\n I see it a little different than holding a mirror up.\n \n I really don't think that some of those who were offended even got the message. This is the reality of a crucifiction and this is the reality of how you treat it with commercialization.\n \n \"This is my body, eat of it in rememberance of me...and let the compounds effect your brain chemistry and give you a nice euphoric feeling.\"", 
   {}, 
   256191, 
   null, 
   1175366040.0
  ], 
  [
   256224, 
   null, 
   "trebor", 
   "Well, there's always the problem of it melting during the summer. :) Actually, I tend to agree with you here. It's just a statue for goodness' sake.\n\n \n \n Morality changes with the time too. Davinci's \"David\" was carved naked. 100 years later, someone had a fig leaf made to cover his obviously not Jewish figure. Over the centuries, the fig leave had been put on it, and taken off depending on the morals of the time.\n \n I don't see that any different that this, except the material it is made from.", 
   {}, 
   256219, 
   null, 
   1175366820.0
  ], 
  [
   256226, 
   null, 
   "Jo Bennett", 
   "Well, there is a point of view among certain segments of society that art is only art if the artist has been dead for a century or so.", 
   {}, 
   256224, 
   null, 
   1175367840.0
  ], 
  [
   256235, 
   null, 
   "jyoshu", 
   "That said, freedom of expression has to include the right to offend, and it bothers me when self-appointed guardians of public decency proclaim their personal sensibilities inviolable.\n\n \n I think sometimes people go too far with it. If someone makes a nude statue of one of your family members (say, your children if you have any) engaged in lewd activity and puts it in a public place for everyone to see, you wouldn't be offended? The problem with intentionally offensive displays of religious figures is that it is intentionally taking something people hold VERY dear and sacred (like a family member) and belittling it. It can be a very senseless, insensitive, and offensive act. I don't think this issue with a chocolate figure of Jesus falls under that though, because it doesn't portray Jesus as doing something intentionally blasphemous or misrepresent him in practice.", 
   {}, 
   256191, 
   null, 
   1175372340.0
  ], 
  [
   256237, 
   null, 
   "jyoshu", 
   "Morality changes with the time too. Davinci's \"David\" was carved naked. 100 years later, someone had a fig leaf made to cover his obviously not Jewish figure. Over the centuries, the fig leave had been put on it, and taken off depending on the morals of the time.\n \n I don't see that any different that this, except the material it is made from.\n\n \n You mean Michelangelo? I agree. It's my opinion that he didn't carve him nude to be intentionally pornographic anyway, but he did so in the tradition of hellenistic art which simply tended to be less prone to covering the body.", 
   {}, 
   256224, 
   null, 
   1175372520.0
  ], 
  [
   256238, 
   null, 
   "trebor", 
   "You mean Michelangelo? I agree. It's my opinion that he didn't carve him nude to be intentionally pornographic anyway, but he did so in the tradition of hellenistic art which simply tended to be less prone to covering the body.\n\n \n Yes, Michalengelo (I been dan brownisized.. doh). \n \n No, I don't think he was intended to be pornographic. However, some of the later ones felt he was never the less. Some generations had more hangups abou the nude figures than others. \n \n I think sometimes people misread artists who are trying to make a statement, and are 'offended' because it doesn't match their personal prejudices. The original piece of art is not made to offend, but made to make a religious or political statement that is a heart felt message that the artist feels, that is NOT against the religion.", 
   {}, 
   256237, 
   null, 
   1175374140.0
  ], 
  [
   256295, 
   null, 
   "johnhanks", 
   "I think sometimes people go too far with it. If someone makes a nude statue of one of your family members (say, your children if you have any) engaged in lewd activity and puts it in a public place for everyone to see, you wouldn't be offended?\n\n I think in that case the issue would go beyond offense and become one of defamation, with appropriate recourse to law. Leave out the 'lewd activity', and it's a different matter. As my children are grown up, they'd need to decide whether to be offended or not. If you mean nude statues of them when they were minors, again we'd be looking at legal issues of child abuse.\n \nThe problem with intentionally offensive displays of religious figures is that it is intentionally taking something people hold VERY dear and sacred (like a family member) and belittling it. It can be a very senseless, insensitive, and offensive act.\n\n Yes it can; but you load the dice here by using the term 'belittling'. Suppose that isn't the artist's intention. Suppose the artist is making a genuine attempt to be thought-provoking. The issue is the usual hackneyed question about censorship: when does one person's offense justify stifling another's freedom of expression?\n \nI don't think this issue with a chocolate figure of Jesus falls under that though, because it doesn't portray Jesus as doing something intentionally blasphemous or misrepresent him in practice.\n\n Agreed. In this country there was a much bigger controversy over Jerry Springer: the Opera, which some Christian groups tried to have banned. I hadn't imagined any American theatre would be brave enough to put it on, but according to Wikipedia\n \nThe show will have its American premiere in a non-equity production in Chicago at the Bailiwick Repertory Theatre scheduled to begin on May 3, 2007, toward a May 14 opening. Performances are schduled to continue until July 8. ... Though Chicago will be the first to mount the show, Playhouse On the Square in Memphis, Tennessee was the first to receive a nonexclusive license, and the show is scheduled to run there from August 10th to September 9th, 2007.\n\n Book now!", 
   {}, 
   256235, 
   null, 
   1175419140.0
  ], 
  [
   256296, 
   null, 
   "Jo Bennett", 
   "It's worth pointing out that the groups which tried to supress Jerry Springer - The Opera were a tiny minority even of Christian Evangelicals in the UK, never mind the broader mass of Christians.", 
   {}, 
   256295, 
   null, 
   1175419920.0
  ], 
  [
   256298, 
   null, 
   "johnhanks", 
   "It's worth pointing out that the groups which tried to supress Jerry Springer - The Opera were a tiny minority even of Christian Evangelicals in the UK, never mind the broader mass of Christians.\n\n Agreed: I did, you'll note, refer to 'some Christian groups', not Christians as a whole. The protests and attempted prosecutions mainly involved organisations called Christian Voice and The Christian Institute.", 
   {}, 
   256296, 
   null, 
   1175427240.0
  ], 
  [
   256313, 
   null, 
   "Matthew S", 
   "Personally, Who cares what color the Christ is? He was a short Semitic Hebrew if he conformed to his genetic lineage. What of it?\n \n Chocoloate for me would tie in how a High Holy Day has become a feast of gluttony (a deadly sin) for the hypocritic masses claiming to embrase the resurrected one.\n \n Nude? Christ WAS nude folks when he was hung from the cross.\n 1) When you die, you stand a good chance of loosen your bowls and defecating yourself. Why still wear under garments? (ever hear of the Golgothan Sh*t demon from the movie Dogma?) The Romans would have no need for him to have soilt clothing as he (or others) were strung up to die. A process that took a long time to accomplish.\n 2) Form of embarrasment for the condemned. Or, do you really think that Romans would 'allow a man to be executed in dignity' particularly a non-citizen.\n 3) Scripture states so implicity. The Romans divided his garments and when they came to an unseamed article of clothing, rather than cut it, they cast lots for it. Now, contrary to what pulpit pimp will try to tell you, the ONLY unseemed garment would be his loin cloth. An article of clothing wrapped around his nether regions. No other 'unseemed' garment would have fit the description of the times. It was NOT a specially made article of clothing worth a lot of money they were wagering for. John 19:23-27\n \n From the media I had to watch today, the issue was his nudity that was focused on.\n \n Comments?\n\n \n \n Well what would they do with the chocolate? They could offer it in communion. Now that gives a new meaning of \"this is the body of christ given for you\" And if the inside of the statue was cherry syrup.", 
   {}, 
   256184, 
   null, 
   1175436540.0
  ], 
  [
   256627, 
   null, 
   "Big Orn", 
   "Well what would they do with the chocolate? They could offer it in communion. Now that gives a new meaning of \"this is the body of christ given for you\" And if the inside of the statue was cherry syrup.\n\n \n You are kidding....right?\n \n \n A nude statue of Christ, chocolate or not, is offensive to Christians. To allow it to be displayed, whether Christians like or not, is just another example that there is nothing held sacred here anymore.\n \n This doesn't surprise me a bit, fwiw.", 
   {}, 
   256313, 
   null, 
   1175621940.0
  ], 
  [
   256643, 
   null, 
   "johnhanks", 
   "A nude statue of Christ, chocolate or not, is offensive to Christians.\n\n Really? You take it upon yourself to speak for all Christians here? At least two Christian posters have indicated in this thread that they don't take offense at the statue: is their Christianity in some way compromised by that?\n \n What you mean is that the statue is offensive to you - a viewpoint you are perfectly entitled to. In that case, don't look at the damned thing or think about it; but leave others the freedom to make up their own minds.", 
   {}, 
   256627, 
   null, 
   1175625540.0
  ], 
  [
   256655, 
   null, 
   "Jo Bennett", 
   "You are kidding....right?\n \n \n A nude statue of Christ, chocolate or not, is offensive to Christians. To allow it to be displayed, whether Christians like or not, is just another example that there is nothing held sacred here anymore.\n \n This doesn't surprise me a bit, fwiw.\n\n \n A nude statue is probably historically accurate in this regard. Of course you have every right to be offended by the barbaric Roman execution methods, but I don't see why whether Jesus was wearing a loin cloth or not matters so much to you.", 
   {}, 
   256627, 
   null, 
   1175630880.0
  ], 
  [
   256688, 
   null, 
   "MrWriteLA", 
   " I don't see why whether Jesus was wearing a loin cloth or not matters so much to you.\n Because nothing disturbs conservative Christians quite so much as overt references to the very natural phenomenon known as \"sex.\" It's why they're hung up on what they imagine gays do in bed, on pornography, and on teaching their kids about it. It just plain embarrasses the hell out of them, and they don't want anything on public display that is evidence of its existence... even, bizarrely enough, their Savior's own holy organs, despite the fact that he must have had them, and that they must by definition be sacred and as worthy of admiration--more so, even--as David's.", 
   {}, 
   256655, 
   null, 
   1175639460.0
  ], 
  [
   256697, 
   null, 
   "Big Orn", 
   "Really? You take it upon yourself to speak for all Christians here? At least two Christian posters have indicated in this thread that they don't take offense at the statue: is their Christianity in some way compromised by that?\n \n What you mean is that the statue is offensive to you - a viewpoint you are perfectly entitled to. In that case, don't look at the damned thing or think about it; but leave others the freedom to make up their own minds.\n\n For someone, such as myself, to explain my feelings towards my God in a place like this, would be similar to giving my testimony. It goes in one ear and then out of a mouth with a whole new meaning.\n \n But so you can understand - God, to me, is like a father, my daddy, for example. The difference is that He has already died for me. Showing His genitals is an insult to me...and I think many Christians would agree.\n \n But my last statement in my previous post says it all: It doesn't surprise me that #### like this happens.", 
   {}, 
   256643, 
   null, 
   1175640960.0
  ], 
  [
   256698, 
   null, 
   "Big Orn", 
   "A nude statue is probably historically accurate in this regard. Of course you have every right to be offended by the barbaric Roman execution methods, but I don't see why whether Jesus was wearing a loin cloth or not matters so much to you.\n\n I'm not offended by the execution - I glory in the Cross. Something that seems to have gotten misplaced somewhere between the keyboard and brain.", 
   {}, 
   256655, 
   null, 
   1175641080.0
  ], 
  [
   256700, 
   null, 
   "ShadowPikachu", 
   "For someone, such as myself, to explain my feelings towards my God in a place like this, would be similar to giving my testimony. It goes in one ear and then out of a mouth with a whole new meaning.\n \n But so you can understand - God, to me, is like a father, my daddy, for example. The difference is that He has already died for me. Showing His genitals is an insult to me...and I think many Christians would agree.\n \n But my last statement in my previous post says it all: It doesn't surprise me that #### like this happens.\n\n \n I'd think that it would show his glory even more. After all, according to the creation myth we were \"made in his own image\", and only after we turned to sin did we even percieve nakedness. I'm a Christian, and I personally have no problem with this. Also, it would depict exactly how Jesus was when he hung on the cross. I really don't see what the big deal here is, but I guess some Christians are real prudes or something and would view seeing someone's genitals as an insult (how they ever reproduce is beyond me - eyes closed and hope they hit the right hole?).", 
   {}, 
   256697, 
   null, 
   1175641560.0
  ], 
  [
   256701, 
   null, 
   "Big Orn", 
   "Because nothing disturbs conservative Christians quite so much as overt references to the very natural phenomenon known as \"sex.\" It's why they're hung up on what they imagine gays do in bed, on pornography, and on teaching their kids about it. It just plain embarrasses the hell out of them, and they don't want anything on public display that is evidence of its existence... even, bizarrely enough, their Savior's own holy organs, despite the fact that he must have had them, and that they must by definition be sacred and as worthy of admiration--more so, even--as David's.\n\n \n \n Grow up...\n \n This is not about sex - far from it... geeesh...", 
   {}, 
   256688, 
   null, 
   1175641680.0
  ], 
  [
   256702, 
   null, 
   "Big Orn", 
   "I'd think that it would show his glory even more. After all, according to the creation myth we were \"made in his own image\", and only after we turned to sin did we even percieve nakedness. I'm a Christian, and I personally have no problem with this. Also, it would depict exactly how Jesus was when he hung on the cross. I really don't see what the big deal here is, but I guess some Christians are real prudes or something and would view seeing someone's genitals as an insult (how they ever reproduce is beyond me - eyes closed and hope they hit the right hole?).\n\n \n \n I can see where this is going. :xbanghead", 
   {}, 
   256700, 
   null, 
   1175641740.0
  ], 
  [
   256707, 
   null, 
   "MrWriteLA", 
   "Grow up...\n \n This is not about sex - far from it... geeesh...\nGee, I'm just bowled over by your mature and articulate counterargument.emoticon_rolleyes We all know genitals have nothing to do with sex.", 
   {}, 
   256701, 
   null, 
   1175642760.0
  ], 
  [
   256708, 
   null, 
   "Big Orn", 
   "Gee, I'm just bowled over by your mature and articulate counterargument.emoticon_rolleyes\n\n \n It was appropriate.", 
   {}, 
   256707, 
   null, 
   1175642880.0
  ], 
  [
   256748, 
   null, 
   "MrWriteLA", 
   "You just proved my point, thanks. (By the way, huffy, non-specific one-liners aren't a very persuasive argument.)\n \n The human body, male or female... which, do I need to remind you, was made \"in God's image\"... is a beautiful thing--including the genitalia. \n \n It's the up-tight, extremely conservative religious types, as far as I can see, who are hung up on the concept of genitals as \"dirty bits\" and consider depictions of the adult Jesus' penis (which they have no problem with when he's depicted as a baby... now, why is that?) as \"an insult.\" \n \n The insult is to God--if you happen to believe in such a thing--for expressing such disgust at the totality of his ultimate creation.\n \n It also appears that some people have \"daddy\" issues.", 
   {}, 
   256708, 
   null, 
   1175659620.0
  ], 
  [
   256752, 
   null, 
   "JPSartre12", 
   "Sorry that I haven't weighed in earlier. I was busy making my own chocolate sculpture. It depicts two gay men having anal sex while the one on his knees eats a chocolate-covered bananna. I call it Hershey Highway. As soon as I'm done, I'm going to place it on display in San Francisco. Do you think that anyone will mind? emoticon_rolleyes", 
   {}, 
   256748, 
   null, 
   1175662620.0
  ], 
  [
   256772, 
   null, 
   "johnhanks", 
   "Sorry that I haven't weighed in earlier. I was busy making my own chocolate sculpture. It depicts two gay men having anal sex while the one on his knees eats a chocolate-covered bananna. I call it Hershey Highway. As soon as I'm done, I'm going to place it on display in San Francisco. Do you think that anyone will mind? emoticon_rolleyes\n\n I'm guessing here, but I think the people who'll mind will be the same people who are objecting to the chocolate Jesus. I imagine gays and liberals will find it quite amusing. Go ahead and find out.", 
   {}, 
   256752, 
   null, 
   1175679180.0
  ], 
  [
   256773, 
   null, 
   "ShadowPikachu", 
   "I'm guessing here, but I think the people who'll mind will be the same people who are objecting to the chocolate Jesus. I imagine gays and liberals will find it quite amusing. Go ahead and find out.\n\n \n Yep, I think most who object would be the ones objecting to the chocolate Jesus. I certainly would find it rather amusing (might even take a bite out of it - I love chocolate) :)", 
   {}, 
   256772, 
   null, 
   1175679600.0
  ], 
  [
   256782, 
   null, 
   "Big Orn", 
   " (By the way, huffy, non-specific one-liners aren't a very persuasive argument.)\n\n Looks like you need to take a dose of your own medicine.\n \n \n And you missed the whole point about the \"daddy\" part, too.\n \n \n :xbanghead", 
   {}, 
   256748, 
   null, 
   1175694960.0
  ], 
  [
   256785, 
   null, 
   "trebor", 
   "Looks like you need to take a dose of your own medicine.\n \n \n And you missed the whole point about the \"daddy\" part, too.\n \n \n :xbanghead\n\n \n No, I am sure he understood it. \n \n While 'many christians' would be offended, by the comments of a few of the Christians here, not all are.\n \n What I DO find interesting is that there are a number of people who are offended not that Jesus is nude, but the statue is made from CHOCOLATE.", 
   {}, 
   256782, 
   null, 
   1175699580.0
  ], 
  [
   256791, 
   null, 
   "Big Orn", 
   "No, I am sure he understood it. \n\n Okay... \n \n \nWhile 'many christians' would be offended, by the comments of a few of the Christians here, not all are.\n\n I'm aware of that, trebor. I have to admit, though, that did surprise me.\n \n \nWhat I DO find interesting is that there are a number of people who are offended not that Jesus is nude, but the statue is made from CHOCOLATE.\n\n Chocolate, cement, wood, stone....no problem; never was - to me anyway.", 
   {}, 
   256785, 
   null, 
   1175701740.0
  ], 
  [
   256798, 
   null, 
   "thelmoose", 
   "Yep, I think most who object would be the ones objecting to the chocolate Jesus. I certainly would find it rather amusing (might even take a bite out of it - I love chocolate) :)\n\n \n \n It would probably be a huge hit.\n \n JP's post was super funny, though- San Francisco, Hershey Highway - where does he come up with this stuff??", 
   {}, 
   256773, 
   null, 
   1175703240.0
  ], 
  [
   256800, 
   null, 
   "Matthew S", 
   "You are kidding....right?\n \n \n A nude statue of Christ, chocolate or not, is offensive to Christians. To allow it to be displayed, whether Christians like or not, is just another example that there is nothing held sacred here anymore.\n \n This doesn't surprise me a bit, fwiw.\n\n \n No not at all. I am not kidding. If you believe that the bread and wine become the body and blood of Jesus then what does it matter is it is bread and wine or chocolate and cherry syurp. \n http://www.4forums.com/political/showpost.php?p=256799&postcount=9\n \n BTW better take a closer look at a crucifix \n http://images.google.com/images?hl=en&client=opera&rls=en&hs=k95&sa=N&resnum=0&q=crucifix&ie=UTF-8&oe=UTF-8&um=1&tab=wi\n Jesus looks pretty naked to me so once again what is the difference.", 
   {}, 
   256798, 
   null, 
   1175703480.0
  ], 
  [
   256803, 
   null, 
   "Matthew S", 
   "Sorry that I haven't weighed in earlier. I was busy making my own chocolate sculpture. It depicts two gay men having anal sex while the one on his knees eats a chocolate-covered bananna. I call it Hershey Highway. As soon as I'm done, I'm going to place it on display in San Francisco. Do you think that anyone will mind? emoticon_rolleyes\n\n \n Not at all bring it on emoticon_xgood", 
   {}, 
   256752, 
   null, 
   1175704260.0
  ], 
  [
   256807, 
   null, 
   "Big Orn", 
   "No not at all. I am not kidding. If you believe that the bread and wine become the body and blood of Jesus then what does it matter is it is bread and wine or chocolate and cherry syurp.\n\n What I read from your reply was that you understood about the chocolate not being an issue and that you agreed that it was the nudity that was behind the debate. Isn't that true? If so, what would happen to the offensive part of the statue?\n You said, \n \n Well what would they do with the chocolate? They could offer it in communion.\n\n \n If that's not what was being discussed, then I apologize. If, however, you were declaring that Christians use the genitals as communion, then my reply is reasonable.", 
   {
    "unicode_changes_made": true
   }, 
   256800, 
   null, 
   1175706120.0
  ], 
  [
   256810, 
   null, 
   "Matthew S", 
   "What I read from your reply was that you understood about the chocolate not being an issue and that you agreed that it was the nudity that was behind the debate. Isn&#8217;t that true? If so, what would happen to the offensive part of the statue?\n You said, \n \n \n If that&#8217;s not what was being discussed, then I apologize. If, however, you were declaring that Christians use the genitals as communion, then my reply is reasonable.\n\n \n Personally I don't find any of it offensive. I can see where both can be offensive to those christians who don't have a sence of humor or are self righteous, judgemental, and holier then thou.", 
   {}, 
   256807, 
   null, 
   1175706720.0
  ], 
  [
   256827, 
   null, 
   "trebor", 
   "Okay... \n \n \n I'm aware of that, trebor. I have to admit, though, that did surprise me.\n \n \n Chocolate, cement, wood, stone....no problem; never was - to me anyway.\n\n \n I find that I am less surprised at your attitude than the attitude of the people that seemed more disturbed that it was chocolate than nude. While I don't agree with that attitude, I also realise that there is a strong puritanical influence on the country", 
   {}, 
   256791, 
   null, 
   1175710020.0
  ], 
  [
   256831, 
   null, 
   "MrWriteLA", 
   "To me--and admittedly I'm an atheist--I think the work is far more irreverent towards the crass commercialism of Easter (and its flood of chocolate everything) than towards Christ, whom I don't think it disrespects at all. Quite the contrary, in fact: medium apart, as a crucifixion sculpture I find it to be quite beautifully rendered.", 
   {}, 
   256827, 
   null, 
   1175710680.0
  ], 
  [
   256835, 
   null, 
   "Zardoz", 
   "I'm kind of amazed at some of the responses.\n \n 1) The only comment that any Christian should take offense with would be the comment to turn the chocolate into communion, yet none was.\n Communion is a sacred sacrament and for half of Christiandom it transubstantiats into the Christ, a symbolic act or accepting Christ into you.\n Various sects of protestants also feel similar to certain levels...but, most evangelicals don't. I've sat in their services when it was deemed time for communion but the pastor, being on a roll/rant, called for the ushers to 'Take That away.' \n Saying, well, eat candy and think of it as God should be somewhat offensive and a further degredation of christian mores and beliefs.\n \n 2) That, as in the media, here the issue is the nakedness of the Christ. I've cited scripture and reasonings in the opening posts as to the accuracy of this. If you consider Him being exposed more offensive (at any point) then I'd say that that should further emphasize the sacrafice He made for your sins. The humiliation was without end...all for your sake.\n \n 3) That, as I mentioned earlier, no one has addressed the socio-religious commentary that the artist is representing. That Christians are offending and profaning a spiritual day by entering pagan symbology and non-christian and overly commercialized practices into it. The chocolate goodness represents that. It being dark chocolate could be taken to have double meaning as how the issue of race is often made in the depictions of the Christ.\n As said, if he conforms to the genetic lineage of his relative(s), he should have been a fairly short semetic hebrew. The Lord veiled his majesty in the body of a simple carpenter who came from within His People to lead His People to salvation. Much like Moses.\n \n So, this Sunday, on Easter, are you Christians going to rejoice in your Risen and ever LIVING Lord...or, keep him on the Cross in graven image while you dress in your finest, go to a service and then feast on ham while your wee ones go hunt for eggs and goodies?\n That somehow, you need a physical reminder of his suffering for your sins. I'd hazard a guess that it's because you really don't have the indwelling presence of Him as a reminder, having replaced it with emotionally charged personal experiences that are more often than not...counterfeited. \n Matthew 24:24 For false Christs and false prophets will appear and perform great signs and miracles to deceive even the elect-if that were possible. \n \n I wonder how offended the Pharasies were when the Christ insulted them, when He cast the money changers out of the house of His Father as they profaned true worship by making it a den of thieves.\n Oh, never mind. They despised Him and plotted His death. Which, as fortold in prophasy, came pass.", 
   {
    "unicode_changes_made": true
   }, 
   256810, 
   null, 
   1175710980.0
  ], 
  [
   256844, 
   null, 
   "ShadowPikachu", 
   "To me--and admittedly I'm an atheist--I think the work is far more irreverent towards the crass commercialism of Easter (and its flood of chocolate everything) than towards Christ, whom I don't think it disrespects at all. Quite the contrary, in fact: medium apart, as a crucifixion sculpture I find it to be quite beautifully rendered.\n\n \n Yes, the guy who did it seems to be quite a good sculptor.", 
   {}, 
   256831, 
   null, 
   1175713560.0
  ], 
  [
   256853, 
   null, 
   "Big Orn", 
   "I find that I am less surprised at your attitude than the attitude of the people that seemed more disturbed that it was chocolate than nude. While I don't agree with that attitude, I also realise that there is a strong puritanical influence on the country\n\n Attitude at 4forums = a response that you don't agree with. (?)\n \n Other than that, how can you tell what I'm feeling.\n \n Just because I give my opinion that, in this case, stands apart from the rest, I am classified as having an attitude? It would be better, I guess, than driving me off with a bullwhip...", 
   {}, 
   256827, 
   null, 
   1175714640.0
  ], 
  [
   256859, 
   null, 
   "Big Orn", 
   "Personally I don't find any of it offensive. I can see where both can be offensive to those christians who don't have a sence of humor or are self righteous, judgemental, and holier then thou.\n\n \n \n Oops - argumentum ad consequentiam....being offended in this instance doesn't = lack of humor or self-righteous or judgmental or even holier-than-thou...\n \n You know better than that. Using emotions to make a point is a waste of time.", 
   {}, 
   256810, 
   null, 
   1175715240.0
  ], 
  [
   256910, 
   null, 
   "trebor", 
   "Attitude at 4forums = a response that you don't agree with. (?)\n \n Other than that, how can you tell what I'm feeling.\n \n Just because I give my opinion that, in this case, stands apart from the rest, I am classified as having an attitude? It would be better, I guess, than driving me off with a bullwhip...\n\n \n \n No, it is your response, I called your response an 'attitude'. yes.. that is what it is.\n \n Just like some others attitude was 'who cares'.", 
   {}, 
   256853, 
   null, 
   1175726160.0
  ], 
  [
   256911, 
   null, 
   "Big Orn", 
   "No, it is your response, I called your response an 'attitude'. yes.. that is what it is.\n \n Just like some others attitude was 'who cares'.\n\n I think I get it. Since EZ left, you ain't got nobody to play with...", 
   {}, 
   256910, 
   null, 
   1175726520.0
  ], 
  [
   256915, 
   null, 
   "Matthew S", 
   "I think I get it. Since EZ left, you ain't got nobody to play with...\n\n \n Has he not found EZ's replacement archangel?", 
   {}, 
   256911, 
   null, 
   1175728380.0
  ], 
  [
   256920, 
   null, 
   "Big Orn", 
   "Has he not found EZ's replacement archangel?\n\n \n I'm not mean enough.\n \n Sorry to disappoint you boys...", 
   {}, 
   256915, 
   null, 
   1175729520.0
  ], 
  [
   256940, 
   null, 
   "JPSartre12", 
   "It would probably be a huge hit.\n \n JP's post was super funny, though- San Francisco, Hershey Highway - where does he come up with this stuff??\n\n \n \n Shhhhhh! Don't encourage him. He won't stop. ;)", 
   {}, 
   256798, 
   null, 
   1175739540.0
  ], 
  [
   256966, 
   null, 
   "gaetano", 
   "Shhhhhh! Don't encourage him. He won't stop. ;)\n\n \n \n \n \n \n Gaetano:\n I have to thank you for making me laugh. That was really funny! ,,,,,,,,,,,,,", 
   {}, 
   256940, 
   null, 
   1175758800.0
  ], 
  [
   256997, 
   null, 
   "Matthew S", 
   "Shhhhhh! Don't encourage him. He won't stop. ;)\n\n \n Did you forget to add that when some one bites into your statue it shoots a white creamy substance out?", 
   {}, 
   256940, 
   null, 
   1175782620.0
  ], 
  [
   257077, 
   null, 
   "Jo Bennett", 
   "you mean it has a fondant filling? Damn, what's the point of that? Solid chocolate is the best.", 
   {}, 
   256997, 
   null, 
   1175808540.0
  ], 
  [
   257087, 
   null, 
   "Matthew S", 
   "you mean it has a fondant filling? Damn, what's the point of that? Solid chocolate is the best.\n\n \n I like a good coconut cream maybe some almonds inside.", 
   {}, 
   257077, 
   null, 
   1175809440.0
  ], 
  [
   257110, 
   null, 
   "Zardoz", 
   "I like a good coconut cream maybe some almonds inside.\n\n \n Almonds might be too large to 'feed the elephant'. Try peanuts.", 
   {}, 
   257087, 
   null, 
   1175817540.0
  ], 
  [
   257168, 
   null, 
   "JPSartre12", 
   "Did you forget to add that when some one bites into your statue it shoots a white creamy substance out?\n\n \n You're just jealous because, even with Viagara, you can't gets yours to stand like a statue. :)", 
   {}, 
   256997, 
   null, 
   1175835240.0
  ], 
  [
   257206, 
   null, 
   "Shooterandproud", 
   "you mean it has a fondant filling? Damn, what's the point of that? Solid chocolate is the best.\n\n \n I'd agree if I had beaver jaws. However, I don't, and I have no freaking idea how people can actually bite into solid chocolate without their jaw falling out.", 
   {}, 
   257077, 
   null, 
   1175843520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cucko for Coco Christ", 
  "url": "http://www.4forums.com/political/religion-debates/9700-cucko-coco-christ.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9700, 
  "discussion_files": [
   [
    "15727.html", 
    "http://www.4forums.com/political/religion-debates/9700-cucko-coco-christ-print.html"
   ], 
   [
    "15728.html", 
    "http://www.4forums.com/political/religion-debates/9700-cucko-coco-christ-4-print.html"
   ], 
   [
    "15729.html", 
    "http://www.4forums.com/political/religion-debates/9700-cucko-coco-christ-3-print.html"
   ], 
   [
    "15730.html", 
    "http://www.4forums.com/political/religion-debates/9700-cucko-coco-christ-2-print.html"
   ]
  ], 
  "identifier": 9700
 }
]