[
 [
  [
   256187, 
   null, 
   "Archangel", 
   "This is an incredible News story about a lost city found under the Ocean off the Coast of Japan. The massive Pyramid found one hundred feet deep and larger than the largest Egyptian Pyramid is estimated to be twice as old as the Egyptian Pyramids. But strangely enough it was barely reported at all in the USA. Why, is my first of many questions. \n \n And also, how does such a sophisticated sunken city exist in such pristine condition so close to mainland Japan without ever being discovered prior to this ? How do we explain such advanced architecture in such ancient ruins ? Has anyone else heard of this ? Can anyone else explain it ? What does this say about modern mans belief that this is humanities first time reaching this level of sophistication and technology ? I mean a pretty advanced people had to have built that city to have moved and cut such massive blocks that dwarfed even the sizes found in Egyptian Pyramids. Any theories or explanations ?\n \n http://www.cyberspaceorbit.com/phikent/japan/japan2.html\n \n Here's an excerpt from the article dealing with the News Blackout. \n \n \nExceptionally clear sub-surface clarity, with 100 foot visibility a common factor, allowed for thorough photographic documentation, both still photography and video. These images provided the basis of japan's leading headlines for more than a year. Yet, not a word about the Okinawa discovery reached the US public, until the magazine, \"Ancient American\" broke the news last spring. Since that scoop, only the CNN network televised a report about Japan's underwater city. Nothing about it has been mentioned in any of the nation's other archaeology publications, not even in any of our daily newspapers. One would imagine that such a mind-boggling find would be the most exciting piece of news an archaeologist could possibly hope to learn. Even so, outside of the \"Ancient American\" and CNN's single report, the pall of silence covering all the facts about Okinawa's structures screens them from view more effectively then their location at the bottom of the sea. Why? How can this appalling neglect persist in the face of a discovery of such unparalleled magnitude? At the risk of accusations of paranoia, one might conclude that a real conspiracy of managed information dominates America's well-springs of public knowledge.\n\n \n And here's an excerpt that deals with the size and possible age of this find. It's incredible to say the least. \n \n \nDivers Find World's Oldest Building\n \n by Trushar Barot\n \n A STRUCTURE thought to be the world's oldest building, nearly twice the age of the great pyramids of Egypt, has been discovered. The rectangular stone ziggurat under the sea off the coast of Japan could be the first evidence of a previously unknown Stone Age civilisation, say archeologists.\n \n The monument is 600ft wide and 90ft high and has been dated to at least 8000BC. The oldest pyramid in Egypt, the Step Pyramid at Saqqara, was constructed more than 5,000 years later.\n \n The structure off Yonaguni, a small island southwest of Okinawa, was first discovered 75ft underwater by scuba divers 10 years ago and locals believed it was a natural phenomenon.\n \n Professor Masaki Kimura, a geologist at Ryukyu University in Okinawa, was the first scientist to investigate the site and has concluded that the mysterious five-layer structure was man-made. \"The object has not been manufactured by nature. If that had been the case, one would expect debris from erosion to have collected around the site, but there are no rock fragments there,\" he said.\n \n The discovery of what appears to be a road surrounding the building was further evidence that the structure was made by humans, he added.\n \n Robert Schoch, professor of geology at Boston University, dived at the site last month. \"It basically looks like a series of huge steps, each about a metre high. Essentially, it's a cliff face like the side of a stepped pyramid. It's a very interesting structure,\" he said. \"It's possible that natural water erosion combined with the process of cracked rocks splitting created such a structure, but I haven't come across such processes creating a structure as sharp as this.\"\n \n Further evidence that the structure is the work of humans came with the discovery of smaller underwater stone mounds nearby. Like the main building, these mini-ziggurats are made of stepped slabs and are about 10m wide and 2m high.\n \n Kimura said it was too early to know who built the monument or its purpose. \"The structure could be an ancient religious shrine, possibly celebrating an ancient deity resembling the god Nirai-Kanai, whom locals say gave happiness to the people of Okinawa from beyond the sea. This could be evidence of a new culture as there are no records of a people intelligent enough to have built such a monument 10,000 years ago,\" he said.\n", 
   {
    "post_info": {
     "post_title": "Why the News Blackout ?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1175308200.0
  ], 
  [
   256188, 
   null, 
   "Archangel", 
   "Here's more...\n \n Japan's Mysterious Submerged Stone Structures:\n New evidence suggests they may have been used by Man\n by Laura Lee\n \n YONAGUNI: The ancient underwater pyramid structure off the coast of Yonaguni-jima, Japan\n \n Man-made, made by Nature, or did humankind finish what Nature started? These enigmatic, sunken stone structures off Okinawa, Japan, located 60 to 100 feet beneath the ocean surface, have the Japanese wondering if their homeland was once part of the lost continent of Mu.\n \n Stone terraces, right angled block and walls, and stone circles encompassing hexagonal columns look intriguingly, if not conclusively, man made. A few more clues: an encircling road, what might be post holes supported long-gone wooden structures, what look like cut steps, and castles with similar archietecture located nearby and still on land. (see photos; link at end of this article)\n \n The two sites that are getting the most attention: near the city of Naha is Okinawa is what looks like a wall, with a coral encrusted right angled block. Another, just off the southern end of the tiny island of Yonaguni, the southernmost island of Japan, is an extensive site, with five irregular layers that look like ceremonial, terraced platforms. There are eight anomalous, underwater sites found to date.\n \n Prof. Masaaki Kimura, a marine geologist with the University of the Ryukyus in Okinawa has spent several years studying all eight sties, especially Yonaguni, which was found 13 years ago, in 1985.\n \n Kimura believes these are monuments made by man, left by an unknown civilization, perhaps from the Asian mainland, home of our oldest civilizations. He reasons that if the five layers on the Yonaguni site had been carved by nature, you would find debris from the erosion to have collected around the site, but no rock fragments have yet been found. He adds that there is what look like a road encircling the site as further indication it was used by man. He believes building this monument necessitated a high degree of technology, and some sort of machinery.\n \n How to date these sites? A few possible scenarios have been suggested. The sites may have been submerged when sea levels rose at the end of the last Ice Age as the continental ice sheets melted. Or, as Japan sits on the Ring of Fire, tectonic activity might have caused subsidence of the land. Or perhaps a combination of subsidence and inundation from rising sea levels, or some catastrophic event, dropped it, intact and upright, into the ocean. Teruaki Ishii, a professor of geology at Tokyo University, believes the site is partly man-made, partly natural, and suggests a date of 8,000 B.C., contemporary to the ancient civilizations of Mesopotamia and the Indus Valley. Others have suggested a date of 12,00 years.\n \n The preliminary reports from the fist Americans to dive the sites:\n \n Just back (May 1998) from diving two of the eight known sites are Mike Arbuthnot, an amateur underwater archeologist adventurer, and Boris Said, Executive Producer of the NBC documentary, \"Mystery of the Sphinx.\" Both are experienced divers. Arbuthnot explored a three-mast schooner wrecked off Grand Cayman Island, and Said has been diving for 40 years.\n \n It was treacherous terrain even for experienced divers. \"The Yonaguni site is fairly near the shore, so there was heavy surge (the up and down motion of waves) as well as swift currents, and sharks,\" says Arbuthnot. \"One the up side, the area has the third clearest water in the world, with visibility to 200 feet. And the corals were gorgeous.\"\n \n \"The two sites are very different, though both are at a comparable depth, 60 to 100 feet beneath the ocean's surface. The Yonaguni site might be ceremonial platforms, and the Okinawa site seems similar to a castle wall, a conjecture that is supported by nearby castles on the island with a similar architectural style,\" says Arbuthnot.\n \n Arbuthnot says that when he came up after the first dive, at Yonaguni, he found little to suggest that it was man made. It was only after diving the Okinawa site, and interviewing Prof. Kimura for two days, that he began to entertain the notion. The conversations with Prof. Kimura were all the more productive and in-depth, with the translating skills of Corina Tettinger, who speaks fluent Japanese. \"The case for the sites being artificial, or modified by man, requires supporting evidence,\" he says, and \"we found very precise rectilinear stone features that seem to be indicative of either artificial tooling, or modifying the natural geology.\" A particularly intriguing find: holes in the rock platforms. Could these be post holes to support a wooden structure? The terraces are massive, by human standards. But we can imagine naturally terraced platforms easily utilized for ceremonial purposes with the addition of wooden structures built atop them. You'd simply need to insert the supporting beams into the rock, by drilling a few holes.\n \n \"What we were able to observe was fascinating and warrants additional research,\" he says. \"There is some false information on the sites out there. We want to bring clarity to the situation, and intend to mount a full-scale scientific expedition to do further investigation.\"\n We'll report new developments on this project as they happen.\n \n Geologist Robert Schoch and Egyptologist John Anthony West (both featured in the NBC documentary \"The Mystery of the Sphinx\") dove many months ago at Yonaguni, also without arriving at any conclusions, only more questions. Schoch focused on determining what geological forces might have been at work here. While he notes that the strong currents might have cut the terraces out of the layered sediments, he has not ruled out human modification. Schoch says he very much wants to go back to dive again before arriving at any conclusions. \"I have not seen the other sites,\" he says, \"and, not having previous diving experience, I spent much of my time underwater just staying alive.\"\n \n We thank Shun Daichi for his help in preparing our report. We thank Shun and Kenichi Shindo, for use of their photos.\n \n http://www.lauralee.com/japan.htm\n \n Here's another link that shows a statue of a human type figure and a glyph tablet.\n http://www.pureinsight.org/pi/index.php?news=1678", 
   {
    "unicode_changes_made": true
   }, 
   256187, 
   null, 
   1175308680.0
  ], 
  [
   256197, 
   null, 
   "gamehuis", 
   "Well I guess the media blackout has reached Europe too because I haven't heard anything about this story and that's strange considering that a) I'm always interested in this kind of stuff and b) I'm a news whore.\n \n Thanks for sharing this story. :)", 
   {}, 
   256187, 
   null, 
   1175340240.0
  ], 
  [
   256282, 
   null, 
   "Archangel", 
   "Well I guess the media blackout has reached Europe too because I haven't heard anything about this story and that's strange considering that a) I'm always interested in this kind of stuff and b) I'm a news whore.\n \n Thanks for sharing this story. :)\n\n \n This type of discovery has always interested me too. I have some strong beliefs about the actual age of humanity apart from how theologians add up the generations from Adam to Jesus. I believe we may be as old as 25,000 years but at the minimum 10,000 years old. I believe it's possible that this underwater city is an example of the Pre Flood technological civilization that was destroyed by Noah's flood which may have happened 6000 to 7000 years ago. I don't believe that the Theologians allowed enough generations from Adam to Noah to allow for the sophisticated ruins we have found evidence of in addition to just this one.", 
   {}, 
   256197, 
   null, 
   1175401380.0
  ], 
  [
   256350, 
   null, 
   "Mucusaur", 
   "Anatomically modern humans appear in the fossil record in Africa about 130,000 years ago\n \n A little bit older than 25,000. Civilsation (cities and towns) is what, 10000? \n \n Written history - 6000?", 
   {}, 
   256282, 
   null, 
   1175462100.0
  ], 
  [
   256369, 
   null, 
   "Master_Shake", 
   "The monument is 600ft wide and 90ft high and has been dated to at least 8000BC.\n\n This can't possibly be! The earth is only 6000 years old!!\n \n \n But in all seriousness, thanks for posting this here. I love this stuff. I wanted to be an archaeologist for most of my life. I too am surprised I haven't seen this elsewhere.", 
   {}, 
   256350, 
   null, 
   1175471580.0
  ], 
  [
   256395, 
   null, 
   "Archangel", 
   "This can't possibly be! The earth is only 6000 years old!!\n \n \n But in all seriousness, thanks for posting this here. I love this stuff. I wanted to be an archaeologist for most of my life. I too am surprised I haven't seen this elsewhere.\n\n \n The age of the Earth isn't the question here, the age of humanity is. And even though I know you're mocking me, the fact is that the genealogical map followed by the theologians who tracked the age of humanity to 6500 years old could have sizable gaps they could never account for. And i can't prove my beliefs either but between 10,000 and 25,000 years back is reasonable to me. It's just my personal beliefs though and impossible to defend as a certainty. \n \n As to the fossil record confirming Anatomically modern humans appearing in the fossil record in Africa about 130,000 years ago, I reject your evidence out of hand due to unreliable science and untrustworthy scientists who have a predetermined agenda.", 
   {}, 
   256369, 
   null, 
   1175490360.0
  ], 
  [
   256408, 
   null, 
   "Mucusaur", 
   "untrustworthy scientists who have a predetermined agenda.\n\n \n which is?\n \n interesting find on the underwater pyramid though. Subsidence can happen quite rapidly though, 6000 years of galcial eustacy plus a small rise in sea level is long enough to put something under 20 meters of water. Especially an isalnd arc system like japan with a downwarping forearc trench.\n \n Just thinking out loud", 
   {}, 
   256395, 
   null, 
   1175511600.0
  ], 
  [
   256438, 
   null, 
   "Master_Shake", 
   "The age of the Earth isn't the question here, the age of humanity is. And even though I know you're mocking me, the fact is that the genealogical map followed by the theologians who tracked the age of humanity to 6500 years old could have sizable gaps they could never account for. And i can't prove my beliefs either but between 10,000 and 25,000 years back is reasonable to me. It's just my personal beliefs though and impossible to defend as a certainty. \n \n As to the fossil record confirming Anatomically modern humans appearing in the fossil record in Africa about 130,000 years ago, I reject your evidence out of hand due to unreliable science and untrustworthy scientists who have a predetermined agenda.\n\n I wasn't mocking you in particular, just the idea, and it was meant in jest. It's ok to not take everything so seriously. You're gonna give yourself an aneurysm.\n Despite the fact that I nonetheless disagree with your assessment that the earth is approx 10-25K old, I do admire that you have stepped slightly outside the box so many creationists keep themselves in and admit there is room for error.\n \n My evidence? What evidence? Dd I offer up evidence of anything?\n No I did not. Don't pick fights ;)", 
   {}, 
   256395, 
   null, 
   1175530680.0
  ], 
  [
   256441, 
   null, 
   "Ripskar", 
   "OK, how have they dated the structure to \"at least 8000BC\"? That's during the last glaciation. I do vaguely rember the Ch4 doc on it but didn't find it that intresting. Sea level was a lot lower then thus explaing how it came to be where it is but the age would put it on par with the Chauvet and Lascaux cave paintings.", 
   {}, 
   256438, 
   null, 
   1175532780.0
  ], 
  [
   256459, 
   null, 
   "sinjin", 
   "It's not man-made.", 
   {
    "post_info": {
     "post_title": "news blackout, oh brother!"
    }
   }, 
   256441, 
   null, 
   1175539080.0
  ], 
  [
   256463, 
   null, 
   "ShadowPikachu", 
   "It's not man-made.\n\n \n Meh. It's neither here nor there. I personally think it is probably a geological feature, and not man-made, but until a study is done to clear up the apparent conflicting hypotheses, I'll remain undecided.", 
   {}, 
   256459, 
   null, 
   1175540640.0
  ], 
  [
   256464, 
   null, 
   "ShadowPikachu", 
   "which is?\n \n\n \n You mean you haven't heard of the EAC? *gasp*", 
   {}, 
   256408, 
   null, 
   1175540760.0
  ], 
  [
   256467, 
   null, 
   "sinjin", 
   "http://www.robertschoch.net/Enigmatic%20Yonaguni%20Underwater%20RMS%20CT.htm", 
   {}, 
   256464, 
   null, 
   1175541480.0
  ], 
  [
   256474, 
   null, 
   "ShadowPikachu", 
   "http://www.robertschoch.net/Enigmatic%20Yonaguni%20Underwater%20RMS%20CT.htm\n\n \n Interesting study. That is definitely a strong possibility: It was a natural geological formation that may have been modified by humans. I definitely agree with him that we should see evidence of it being made of blocks, etc. if it was entirely man-made.", 
   {}, 
   256467, 
   null, 
   1175544600.0
  ], 
  [
   256512, 
   null, 
   "Ripskar", 
   "It does remind me of the Giant's Causeway, though it's sandstone and mudstone. The fact that the 'steps' are a minimum of around half a metre in height would suggest they weren't for humans.\n The pages mention that the structure is asymetric but don't provide a map which is frustrating.", 
   {}, 
   256474, 
   null, 
   1175552880.0
  ], 
  [
   256521, 
   null, 
   "Archangel", 
   "http://www.lauralee.com/japan/japan1.htm\n \n Is there any doubt that someone with intelligence cut these stones at right angles ? This was obviously not a natural occurrence.\n \n And then there's this from the first article I posted:\n \n \nProfessor Masaki Kimura, a geologist at Ryukyu University in Okinawa, was the first scientist to investigate the site and has concluded that the mysterious five-layer structure was man-made. \"The object has not been manufactured by nature. If that had been the case, one would expect debris from erosion to have collected around the site, but there are no rock fragments there,\" he said.\n \n The discovery of what appears to be a road surrounding the building was further evidence that the structure was made by humans, he added.\n \n Robert Schoch, professor of geology at Boston University, dived at the site last month. \"It basically looks like a series of huge steps, each about a metre high. Essentially, it's a cliff face like the side of a stepped pyramid. It's a very interesting structure,\" he said. \"It's possible that natural water erosion combined with the process of cracked rocks splitting created such a structure, but I haven't come across such processes creating a structure as sharp as this.\"\n \n Further evidence that the structure is the work of humans came with the discovery of smaller underwater stone mounds nearby. Like the main building, these mini-ziggurats are made of stepped slabs and are about 10m wide and 2m high.\n \n Kimura said it was too early to know who built the monument or its purpose. \"The structure could be an ancient religious shrine, possibly celebrating an ancient deity resembling the god Nirai-Kanai, whom locals say gave happiness to the people of Okinawa from beyond the sea. This could be evidence of a new culture as there are no records of a people intelligent enough to have built such a monument 10,000 years ago,\" he said.\n \n \"This could only have been done by a people with a high degree of technology, probably coming from the Asian continent, where the oldest civilisations originate. There would have to have been some sort of machinery involved to have created such a huge structure.\"\n\n \n And this picture is a side view of the Pyramid, the continuity is beyond conclusive that it was made by intelligent people.\n http://www.lauralee.com/images/japan/japan_8.jpg", 
   {}, 
   256512, 
   null, 
   1175558160.0
  ], 
  [
   256523, 
   null, 
   "sinjin", 
   "http://www.lauralee.com/japan/japan1.htm\n \n Is there any doubt that someone with intelligence cut these stones at right angles ? This was obviously not a natural occurrence.\nYes, there is doubt since rock formations on the neighboring islands have the same \"blocking\" pattern and the formation seems to be integral to the bedrock. Additionally many of the angles are not at 90 degrees. Careful with the term \"obvious\".", 
   {}, 
   256521, 
   null, 
   1175558880.0
  ], 
  [
   256532, 
   null, 
   "Archangel", 
   "Yes, there is doubt since rock formations on the neighboring islands have the same \"blocking\" pattern and the formation seems to be integral to the bedrock. Additionally many of the angles are not at 90 degrees. Careful with the term \"obvious\".\n\n \n But I was referring to the ones that are cut at 90 degree angles. And are you actually suggesting that this is a natural formation, and not made by intelligent beings ? Just so that I'm sure of what you're saying.\n \n http://www.lauralee.com/images/japan/japan_8.jpg", 
   {}, 
   256523, 
   null, 
   1175562000.0
  ], 
  [
   256597, 
   null, 
   "Matthew S", 
   "History channel will be brodcasting a program about this on april 9th. I mean april 10th", 
   {}, 
   256532, 
   null, 
   1175611260.0
  ], 
  [
   256599, 
   null, 
   "gamehuis", 
   "History channel will be brodcasting a program about this on april 9th.\n\n Bummer, we don't have the History Channel over here. Oh well, let's hope that someone has the \"decency\" to copy the broadcast and distribute it on the Internet. :p", 
   {}, 
   256597, 
   null, 
   1175612520.0
  ], 
  [
   256608, 
   null, 
   "Mucusaur", 
   "But I was referring to the ones that are cut at 90 degree angles. And are you actually suggesting that this is a natural formation, and not made by intelligent beings ? Just so that I'm sure of what you're saying.\n \n http://www.lauralee.com/images/japan/japan_8.jpg\n\n \n van Daniken smiles, surely?", 
   {}, 
   256532, 
   null, 
   1175617440.0
  ], 
  [
   256621, 
   null, 
   "sinjin", 
   "And are you actually suggesting that this is a natural formation, and not made by intelligent beings ?\nRead the link I provided.", 
   {}, 
   256532, 
   null, 
   1175620560.0
  ], 
  [
   256625, 
   null, 
   "Archangel", 
   "Read the link I provided.\n\n \n I did. your site also say's this.\n \n Now remains that are considered by some people to be tangible evidence of a lost, highly sophisticated, and very ancient civilization have been located in the Okinawa area under the sea. Could this be Mu or Lemuria? \n \n The structures that have been discovered thus far are all located off the coasts of Okinawa and various islands of the Ryukyu Island chain, Japan. The best publicized and most spectacular of these structures is one located off the southern coast of Yonaguni Island, a small (approximately 10 km by 4 km) Japanese island located east of Taiwan and west of Ishigaki and Iriomote Islands in the East China Sea.\n \n The structure off the coast of Yonaguni has been hailed as \"the world's oldest building\" (Barot, 1998), taking the form of a \"stone ziggurat\" dating back to 8000 B.C. (Barot, 1998). If this is actually the case, this could prove to be one of the most important archaeological discoveries of the last fifty years. In order to evaluate the site, I have visited Yonaguni on two separate occasions (in September 1997 at the invitation of the Japanese businessman Mr. Yasuo Watanabe and during July-August 1998 as a member of the \"Team Atlantis\" underwater archaeological project). On each trip I made several dives on the site. \n \n If there was one structure only then this could be a fluke of nature. But to have a massive complex covering a very large area that is connected by smooth road like paths, well that is a bit too organized to be an accident of nature. That is why even the most skeptical scientists aren't making any absolute statements that is a natural formation.", 
   {}, 
   256621, 
   null, 
   1175621640.0
  ], 
  [
   256644, 
   null, 
   "sinjin", 
   "That is why even the most skeptical scientists aren't making any absolute statements that is a natural formation.\nGranted but a news blackout? Conspiracy? Hardly. I happen to believe the site will prove to be naturally formed.", 
   {}, 
   256625, 
   null, 
   1175625600.0
  ], 
  [
   256743, 
   null, 
   "Archangel", 
   "Granted but a news blackout? Conspiracy? Hardly. I happen to believe the site will prove to be naturally formed.\n\n \n It wasn't me who raised the prospect of a News cover up, it was the Article from the first post of this thread. See ? \n \n \nThese images provided the basis of japan's leading headlines for more than a year. Yet, not a word about the Okinawa discovery reached the US public, until the magazine, \"Ancient American\" broke the news last spring. Since that scoop, only the CNN network televised a report about Japan's underwater city. Nothing about it has been mentioned in any of the nation's other archaeology publications, not even in any of our daily newspapers. One would imagine that such a mind-boggling find would be the most exciting piece of news an archaeologist could possibly hope to learn. Even so, outside of the \"Ancient American\" and CNN's single report, the pall of silence covering all the facts about Okinawa's structures screens them from view more effectively then their location at the bottom of the sea. Why? How can this appalling neglect persist in the face of a discovery of such unparalleled magnitude? At the risk of accusations of paranoia, one might conclude that a real conspiracy of managed information dominates America's well-springs of public knowledge.\n\n \n And it makes a good point. I often wonder why in a Nation of supposedly free and open press, so much widely reported info in other Countries isn't ever reported here. It's enough to make one go hmmmm, why is that ???", 
   {
    "unicode_changes_made": true
   }, 
   256644, 
   null, 
   1175656980.0
  ], 
  [
   256754, 
   null, 
   "Matthew S", 
   "It wasn't me who raised the prospect of a News cover up, it was the Article from the first post of this thread. See ? \n \n \n \n And it makes a good point. I often wonder why in a Nation of supposedly free and open press, so much widely reported info in other Countries isn't ever reported here. It's enough to make one go hmmmm, why is that ???\n\n \n I am just wondering why this is bothering you so much. So there are ruins under water so big wooping deal. Japan is in a subsidence zone so one earth quake and the city goes under the waves. Big deal.", 
   {}, 
   256743, 
   null, 
   1175663340.0
  ], 
  [
   256761, 
   null, 
   "Archangel", 
   "I am just wondering why this is bothering you so much. So there are ruins under water so big wooping deal. Japan is in a subsidence zone so one earth quake and the city goes under the waves. Big deal.\n\n \n I didn't say it was bothering me. Can you show where I did ? It's an amazing story of a massive compound that appears to be man made and twice as old as the oldest known buildings on Earth. If that doesn't pique your interest and seem like an impressive story, I don't know what is. What does bother me is that the Press didn't report it here promptly. That bothers me and makes me ask why not.", 
   {}, 
   256754, 
   null, 
   1175665560.0
  ], 
  [
   256820, 
   null, 
   "sinjin", 
   "I didn't say it was bothering me. Can you show where I did ? It's an amazing story of a massive compound that appears to be man made and twice as old as the oldest known buildings on Earth. If that doesn't pique your interest and seem like an impressive story, I don't know what is. What does bother me is that the Press didn't report it here promptly. That bothers me and makes me ask why not.\nWhat did you come up with for an answer to \"why not\"?", 
   {}, 
   256761, 
   null, 
   1175707980.0
  ], 
  [
   256834, 
   null, 
   "Archangel", 
   "What did you come up with for an answer to \"why not\"?\n\n \n I didn't sinjin, that's the question I asked you all in the first post that has yet to be answered by anyone here.", 
   {}, 
   256820, 
   null, 
   1175710740.0
  ], 
  [
   256841, 
   null, 
   "sinjin", 
   "I didn't sinjin, that's the question I asked you all in the first post that has yet to be answered by anyone here.\nI'd guess it's because the average American is more interested in \"American Idol\" or \"Dancing with the Stars\".", 
   {}, 
   256834, 
   null, 
   1175712360.0
  ], 
  [
   256908, 
   null, 
   "Zardoz", 
   "I have it from a reliable source that is was created by the 2nd Extra-terrestial civilization that enslaved humanity (after defeating the 1st one in an intergalactic war).\n \n When their own civilization declined, ET scavengers seeking to exploit the dwindling resources of the Earth set up shop, causing a form of global warming that resulted in a massive flood.\n \n By the time we were enslaved by the 3rd ET civilization around 800 CE most remaining artifacts and structures of the previous rulers were wiped from the face of the earth.\n \n Apparently such objects and land markes act as an intelligence dampening field designed to keep the slaves in darkness and superstition.\n \n I'd naturally recommend their destruction whenever found.", 
   {}, 
   256841, 
   null, 
   1175725200.0
  ], 
  [
   257029, 
   null, 
   "Archangel", 
   "Then how do you explain the Piri Reis Map ? Here's an excerpt from the article that once again reveals another advanced Civilization going back, strangely enough to precisely 6000 years ago, which is around 4000 BC, a solid 1000 years before the rise of the fist recorded Civilization ?\n \n The official science has been saying all along that the ice-cap which covers the Antarctic is million years old.\n The Piri Reis map shows that the northern part of that continent has been mapped before the ice did cover it. That should make think it has been mapped million years ago, but that's impossible since mankind did not exist at that time.\n \n Further and more accurate studies have proven that the last period of ice-free condition in the Antarctic ended about 6000 years ago. There are still doubts about the beginning of this ice-free period, which has been put by different researchers everything between year 13000 and 9000 BC.\n The question is: Who mapped the Queen Maud Land of Antarctic 6000 years ago? Which unknown civilization had the technology or the need to do that?\n \n It is well-known that the first civilization, according to the traditional history, developed in the mid-east around year 3000 BC, soon to be followed within a millennium by the Indus valley and the Chinese ones. So, accordingly, none of the known civilizations could have done such a job. Who was here 4000 years BC, being able to do things that NOW are possible with the modern technologies?\n \n http://www.world-mysteries.com/sar_1.htm", 
   {}, 
   256908, 
   null, 
   1175794080.0
  ], 
  [
   257103, 
   null, 
   "Mucusaur", 
   "The piri reis map is the staple of the ancient astronaut brigade? you know that right?", 
   {}, 
   257029, 
   null, 
   1175813160.0
  ], 
  [
   257118, 
   null, 
   "Archangel", 
   "The piri reis map is the staple of the ancient astronaut brigade? you know that right?\n\n \n No I don't, and nothing from this link supports that contention. And just because a credible discovery is adopted to make an incredible claim, shouldn't then make the credible story unbelievable. Here's more from the bottom of the article. It speaks of other maps that defy known knowledge of the time. All I'm asking for is a credible explanation, not the standard dismissal of anything that happens to conflict with your preconcieved World View.\n \n \nAnyway, whether Hapgood's theory is correct, the mystery still thrills.\n The Piri Reis map is something which is not supposed to exist. I mean that by no means there was supposed to be anyone that far back in time able to draw a map of such precision; in fact the relative longitudinal coordinates are totally accurate, as stated by Official studies on the map that we saw above.\n And this is a demonstration of impossible technology: the first instrument to calculate the longitude in a approximately correct way has been invented in 1761 by the english John Harrison.\n Before there was no way to calculate the longitude in an acceptable way: there could be errors of hundreds kilometers....\n And the Piri Reis map is just one of several which show supposedly unknown lands, impossible knowledge, precision which still today would surprise........\n \n In fact Piri Reis himself admitted he based his map on way older charts; and those older charts had been used as sources by others who have drawn different maps still of great precision.\n Impressive is the \"Dulcert's Portolano\", year 1339, where the latitude of Europe and North Africa is perfect, and the longitudinal coordinates of the Mediterranean and of the Black sea are approximated of half degree.\n An even more amazing chart is the \"Zeno's chart\", year 1380. It shows a big area in the north, going up till the Greenland; Its precision is flabbergasting. \"It's impossible\" says Hapgood \"that someone in the fourteenth century could have found the exact latitudes of these places, not to mention the precision of the longitudes...\"\n Another amazing chart is the one drawn by the Turkish Hadji Ahmed, year 1559, in which he shows a land stripe, about 1600 Km. wide, that joins Alaska and Siberia. Such a natural bridge has been then covered by the water due to the end of the glacial period, which rose up the sea level.\n \n Oronteus Fineus was another one who drew a map of incredible precision. He too represented the Antarctic with no ice-cap, year 1532.\n There are maps showing Greenland as two separated islands, as it was confirmed by a polar French expedition which found out that there is an ice cap quite thick joining what it is actually two islands.\n \n As we saw, many charts in the ancient times pictured, we might say, all the earth geography. They seem to be pieces of a very ancient world wide map, drawn by unknown people who were able to use technology that we consider to be a conquer of the very modern times.\n When human beings were supposed to live in a primitive manner, someone \"put on paper\" the whole geography of the earth. And this common knowledge somehow fell into pieces, then gathered here and there by several people, who had lost though the knowledge, and just copied what they could find in libraries, bazaars, markets and about all kind of places.\n \n Hapggod made a disclosure which amazingly lead further on this road: he found out a cartographic document copied by an older source carved on a rock column, China, year 1137. It showed the same high level of technology of the other western charts, the same grid method, the same use of spheroid trigonometry. It has so many common points with the western ones that it makes think more than reasonably, that there had to be a common source: could it be a lost civilization, maybe the same one which has been chased by thousands years so far?\n \n \n \n Summary\n \n The Piri Re'is map is often exhibited in cases seeking to prove that civilization was once advanced and that, through some unknown event or events, we are only now gaining any understanding of this mysterious cultural decline. The earliest known civilization, the Sumerians in Mesopotamia, appear out of nowhere around 4,000 B.C. but have no nautical or maritime cultural heritage. They do, however, speak reverently of ancestral people who were like the \"gods\" and were known as the nefilim.\n \n Here is a summary of some of the most unusual findings about the map:\n \n Scrutiny of the map shows that the makers knew the accurate circumference of the Earth to within 50 miles.\n \n The coastline and island that are shown in Antarctica must have been navigated at some period prior to 4,000 B.C. when these areas were free of ice from the last Ice Age. \n \n The map is thought to be one of the earliest \"world maps\" to show the Americas. Early scholars suggested that it showed accurate latitudes of the South American and African coastlines - only 21 years after the voyages of Columbus! (And remember, Columbus did NOT discover North America - only the Caribbean!) Writing in Piri Re'is own hand described how he had made the map from a collection of ancient maps, supplemented by charts that were drawn by Columbus himself. This suggests that these ancient maps were available to Columbus and could have been the basis of his expedition.\n As can be seen below, an azimuthal projection ( looking at the globe from a point above the globe), from the point above Cairo, Africa (Egypt) shows that the Piri Reis map corresponds more or less with the lower right quarter of this map if one rotates it some 20 degrees counter clockwise.\n\n \n http://www.world-mysteries.com/piri_cairo2.gif", 
   {}, 
   257103, 
   null, 
   1175820060.0
  ], 
  [
   257120, 
   null, 
   "Mucusaur", 
   "I honestly dont quite know what to make of the Piri reis map. if, as you suggest there was an ancient advanced civilisation, we have no archaeological evidence of it. Thats why it often falls into the realm of fringe theory", 
   {}, 
   257118, 
   null, 
   1175820600.0
  ], 
  [
   257121, 
   null, 
   "Archangel", 
   "And here's a link that gives the history of the maps discovery and the realization of its importance as an historical artifact.\n \n Ancient Mysteries\n The Piri Re'is Map of 1513\n \n An ancient map was found in renovations of a palace in Turkey. \n The copy of the map gathered dust for years until a professor \n with an interest in maps took a closer look. \n His findings shocked the scientific world with a challenge to our history and culture.\n \n Background:\n During renovations of the old Imperial Palace in what is now Istanbul (formerly Constantinople), a painted, parchment map was found, dated in the month of Muharrem, in the Moslem year 919 (A.D. 1513), and signed by an admiral of the Turkish navy, Piri Ibn Haji Memmed, known as Piri Re'is.\n \n Thought to be one of the earliest \"world maps\" to show the Americas, the map was originally used to bolster Turkish national pride. Early scholars suggested that it showed accurate latitudes of the South American and African coastlines - only 21 years after the voyages of Columbus! (And remember, Columbus did NOT discover North America - only the Caribbean!) Writing in Piri Re'is own hand described how he had made the map from a collection of ancient maps, supplemented by charts that were drawn by Columbus himself. This suggests that these ancient maps were available to Columbus and could have been the basis of his expedition.\n \n A copy of the map was presented to a diplomat in the U.S. government, where it remained a curious artifact for years. The true mysteries of of this map were eventually discovered by professor Charles H. Hapgood and revealed to the scientific community in his book, Maps of the Ancient Sea Kings. During scrutiny of the map, Hapgood discovered a partial charting of Antarctica, made during a period when the coast was free of ice. This coastal structure, now covered again by ice, was subsequently verified by satellite radar scanning. Ice core samples of the coastline have fixed the last ice-free period to between 11,000 B.C. and 4,000 B.C.\n \n Our historical understanding of navigation includes a period of time before which it was impossible to determine a ships latitude (North to South position) in the Southern Hemisphere. This was because the known method involved sighting the angle of the only fixed star - the North Star - which cannot be seen in the Southern Hemisphere because of the curviture of the Earth. Despite this handicap, these maps show amazing details and acurate latitude placement of many known islands along the southern most coastlines of Antarctica! But this paradox of history was made even more astounding.\n \n Hapgood has proved that the Piri Re'is map is plotted out in plane geometry, containing latitudes and longitudes at right angles in a traditional \"grid\"; yet it is obviously copied from an earlier map that was projected \n using spherical trigonometry! Not only did the early map makers know that the Earth was round, but they had knowledge of its true circumference to within 50 miles!\n \n (See similar map on right, based on spherical projection and used for air flights originating in Cairo to determine distances and fuel consumption. This map was generated using sherical trigonometry - a science unknown to scholars until its discovery by the mathematician Hipparcus).\n \n Other Unusual Findings:\n Scrutiny of the map shows that the makers knew the acurate circumference of the Earth to within 50 miles.\n \n The \"center\" of the source map projected from coordinates in what is now Alexandria - the center of culture and home of the world's oldest and largest library until its destruction by Christian invaders.\n \n The coastline and island that are shown in Antarctica must have been navigated at some period prior to 4,000 B.C. when these areas were free of ice from the last Ice Age.\n \n Piri Re'is own commentary indicates that some of his source maps were from the time of Alexander the Great (332 B.C.).\n \n View a large color photograph of the actual map here.\n \n http://www.viewzone.com/pirireisxmap.jpg\n \n The Piri Re'is map is often exhibited in cases seeking to prove that civilization was once advanced and that, through some unknown event or events, we are only now gaining any understanding of this mysterious cultural decline.\n \n The earliest known civilization, the Sumerians in Mesopotamia, appear out of nowhere around 4,000 B.C. but have no nautical or maritime cultural heritage. They do, however, speak reverently of ancestral people who were like the \"gods\" and were known as the nefilim. But that is yet another story.", 
   {}, 
   257118, 
   null, 
   1175820600.0
  ], 
  [
   257122, 
   null, 
   "Archangel", 
   "I honestly dont quite know what to make of the Piri reis map. if, as you suggest there was an ancient advanced civilisation, we have no archaeological evidence of it. Thats why it often falls into the realm of fringe theory\n\n \n Uh Mucusaur, did you happen to notice the article in post # 1 of this thread you are on ? It speaks of a sunken city off the coast of Japan that seems to date back to 8000 years ago or so. It too defies what we know to be true yet there it is, the oldest and largest Pyramid on Earth. Rather than discuss the existence of these artifacts, people here have spent their time dismissing this as natural formations and mythical imaginings or what not. \n \n Only the fundamentalist Christian who is so brainwashed that the World must be 6500 years old is open to discussing what we don't know for certain. What's up with that huh ? I thought I was close minded and you all were forward thinking liberated intellectuals ?", 
   {}, 
   257120, 
   null, 
   1175821140.0
  ], 
  [
   257125, 
   null, 
   "Mucusaur", 
   "That sunken city is not proven to be human formed, not yet. All we have are some photos of things that could be geological in origin.\n \n All I am saying is, dont be so ready to jump to conclusions. Let the evidence do the talking. But you are the creationist, that is why you dont have any idea how to look objectivly at evidence. You said yourself you are coming at this from a biblical, genelogical standpoint. \n \n In any case, what does a 6000 year old pyramid prove? newgrange here in ireland is near 5000, and that is at least as impressive. \n \n http://en.wikipedia.org/wiki/Newgrange", 
   {}, 
   257122, 
   null, 
   1175821860.0
  ], 
  [
   257132, 
   null, 
   "Archangel", 
   "That sunken city is not proven to be human formed, not yet. All we have are some photos of things that could be geological in origin.\n \n All I am saying is, dont be so ready to jump to conclusions. Let the evidence do the talking. But you are the creationist, that is why you dont have any idea how to look objectivly at evidence. You said yourself you are coming at this from a biblical, genelogical standpoint. \n \n In any case, what does a 6000 year old pyramid prove? newgrange here in ireland is near 5000, and that is at least as impressive. \n \n http://en.wikipedia.org/wiki/Newgrange\n\n \n First of all, it's at least 8000 years old, not 6000 years old. And secondly, here's a picture from the second post on this thread of a carved head found in the same underwater complex. Is it also being suggested that this is a natural formation ?\n http://www.pureinsight.org/pi/pi_images/2003-6-29-japanundersea3.jpg\n \n And Groups of hieroglyphs uncovered from the undersea ruins Professor Masaaki Kimura provided the picture.\n http://www.pureinsight.org/pi/pi_images/2003-6-29-japancharacters.jpg\n \n Masaaki Kimura is a professor of geology at the University of Ryukyu. He stated during a September 1999 interview that one could clearly see that they were man-made constructions. There were streets, right angle stairs with round holes in the rock which seemed designed for stone pillar insertion, etc. The discovery of the human head statue and the hieroglyphs, were especially convincing that the undersea ruins at south Yonaguni Island originated from a prehistoric civilization. \n \n Here's the picture of the round holes in the rock for you to judge for yourself. Notice the size of the perfectly round holes in proportion to the scuba divers size on the right side of the picture. The wooden objects that went into those holes must have been massive.\n http://www.lauralee.com/japan/japan_15.htm\n \n And more:\n http://www.lauralee.com/japan/japan1.htm\n Look at the top, first picture and tell me that Nature made three perfectly straight lines leading to a point as that huge step represents. How can the same people who will accept unprovable bits of bone said to be tens of millions of years old are reliable evidence of evolution, yet something so obviously man made is possibly naturally formed ? It makes no sense at all, but I'm just trying to be reasonable here, I dont have an agenda.", 
   {}, 
   257125, 
   null, 
   1175823300.0
  ], 
  [
   257153, 
   null, 
   "Mucusaur", 
   "It could be man made, i dont deny it. Is it too much to withhold interpretations untill observations are made? A lot of that can still be geological, such as those holes - they look very like scour pits to me. But I do look with geologist eyes.\n \n I anuy case, why do you trust these scientists, and denounce others as part of some far reaching evolution conspiracy? if the japenese scientist leading the dive is a geologist, surely he shoud not be trusted at all?\n \n \nHow can the same people who will accept unprovable bits of bone said to be tens of millions of years old are reliable evidence of evolution,\n\n In any case, evolution is seen to happen today, on human observable timescales.", 
   {}, 
   257132, 
   null, 
   1175832300.0
  ], 
  [
   257173, 
   null, 
   "Archangel", 
   "It could be man made, i dont deny it. Is it too much to withhold interpretations untill observations are made? A lot of that can still be geological, such as those holes - they look very like scour pits to me. But I do look with geologist eyes. \n\n \n How deep do scour pits get Mucusaur ? How large do they get ? And while we're at it, what is a scour pit ? What natural process makes a perfectly round hole in solid rock that is 4' or 5' in diameter and equally as deep ? \n \n \nI anuy case, why do you trust these scientists, and denounce others as part of some far reaching evolution conspiracy? if the japenese scientist leading the dive is a geologist, surely he shoud not be trusted at all?\n\n \n I haven't said I trust these scientists at all. But I trust my own eyes and I trust evidence that stays within what is a reasonable time limit for mans existence. I know for a fact that the suppositions and assumptions scientists make going back from millions, to hundreds of millions of years is just total BS. It is totally unprovable, irrational, wishful thinking at the very best. \n \n But you give me the remains of a lost city that is almost perfectly preserved, shows the markings of human design and occupation, can be dated accurately to be older than the modern era simply because the current residents who have historically and consistently occupied the land since their own earliest memories didn't know about it. Now that is evidence I can get a hold of. \n \n I mean the bible doesn't say how old man is. Theologians determined that by adding up the geneological record that exists. But I know that only the one geological line was followed, the line from Shem to Jesus. And their could be sizeable gaps in that geneology. The Spirit within me has always been uncomfortable with the 6500 year dating age of humanity.\n \n One fact that has bothered me since learning it years ago is about the Egyptian Sphynx. Did you know its type of construction bears no resemblance to the known construction of Egyptian architecture of any of the great dynasties of the period ? It has been theorized that the Sphynx is as old as 10,000 years and survived because it got buried in sand untill a boy pharoah who's name escapes me right now found it with only the head of a lion sticking out. I firmly believe the Egyorians inherited the Sphynx, carved the Pharoahs appearance where the Lions head was and have taken credit for it ever since. I also believe that giant lion was the sentry of a great pre flood civilization, possibly the lost city of Atlantis, but that is total speculation as to the who.\n \n \nIn any case, evolution is seen to happen today, on human observable timescales.\n\n \n No. Rapid Adaptation occurs on human observable timescales, not evolution. Evolution arguibly takes millions of years to occur through so called random mutations. Rapid Adaptation can be proven. Evolution can't.", 
   {}, 
   257153, 
   null, 
   1175836020.0
  ], 
  [
   257217, 
   null, 
   "Mucusaur", 
   "I have no problem with these being the age claimed. It does not conflict with my world view. WHat amuses me is your readiness to accept hook line and sinker anything to do with this japenese city, yet will out of hand anything that conflicts with your world view. Why do you accept these grainy images off the web, yet will cry out \"fraud!\" when radiometirc dating of early home sapiens is discussed?", 
   {}, 
   257173, 
   null, 
   1175868000.0
  ], 
  [
   257219, 
   null, 
   "Archangel", 
   "I have no problem with these being the age claimed. It does not conflict with my world view. WHat amuses me is your readiness to accept hook line and sinker anything to do with this japenese city, yet will out of hand anything that conflicts with your world view. Why do you accept these grainy images off the web, yet will cry out \"fraud!\" when radiometirc dating of early home sapiens is discussed?\n\n \n Grainy images ? These are quality photos taken with high quality under water cameras within the last decade. You can even click on some of them gor a larger view. Yet Radiometric dating technology cannot be relied on as a process. And it isn't even known what elements or materials will impede its accuracy making it impossoble to guarantee accuracy. I firmly believe that fossils that are dated at 60 million years old, are in fact potentially 6000 years old. So we are so far away from agreeing on anything evo claims it's rediculous.\n \n Just out of curiosity, you completely ignored my defense of Rapid Adaptation as a legitimate answer to how animals change based on environmental pressures. Why is that ? Here's a link that explains my position.\n www.answersingenesis.org/creation/v23/i2/speciation.asp\n \n And please, for the less informed, describe what a scour pit is and how it comes into being please. And what its average size usually is also.", 
   {}, 
   257217, 
   null, 
   1175870160.0
  ], 
  [
   257221, 
   null, 
   "Archangel", 
   "I did a quick search, does this sound like the holes that are bigger than the man to the right of the holes in the picture I posted ? And why haven't the geologists on scene made the observation that the hoes resemble scour pits ?\n \n Naturally occurring scour pits in nearshore sands\n \n Alex E. Hay\n Department of Oceanography, Dalhousie University, Halifax, Nova Scotia, Canada\n \n Rachel Speller\n Department of Oceanography, Dalhousie University, Halifax, Nova Scotia, Canada\n \n Abstract\n \n Depressions 10-50 cm in diameter and O(10) cm deep were observed in rotary acoustic imagery of the seafloor during SandyDuck97. The rotary sonar record spans a 77 day period and 13 storm events. The depressions occurred during both the wave growth and the wave decay phases of each storm and over a relatively narrow range of wave energies (u rms = 0.32 cm/s ± 0.05 cm/s standard deviation) and grain roughness Shields parameters(=0.7 ± 0.2). The observations are mainly from the outer surf zone in ?3 m mean water depth at two stations separated by 40 m cross-shore distance. Depressions were 6.5 times more frequent at the inner station (N = 485) than at the outer (N = 75). Areal densities were small: O(0.1) m?2. Depressions were also observed in the inner surf zone at a third station, for which the data record is less complete. The probability distribution of the locations of depression first occurrences is nonrandom (i.e., non-Poisson) due to 50% reoccurrence in roughly the same positions from storm to storm. The geometry and temporal development of the depressions are similar to scour pits formed by cylindrical piles and other objects. On the basis of these similarities, and the clustering of first occurrence locations, we conclude that the likely origin of the depressions is scour about compact semimobile obstacles on or embedded within the sandy seafloor. Possible candidate obstacles include pebbles, large shells or large shell fragments, and the chimney structures left by burrowing organisms. Importantly, 13 of the pits evolved into meter-scale lunate megaripples, indicating that these features can act as megaripple precursors.", 
   {
    "unicode_changes_made": true
   }, 
   257219, 
   null, 
   1175870940.0
  ], 
  [
   257231, 
   null, 
   "Mucusaur", 
   "Yet Radiometric dating technology cannot be relied on as a process\n\n \n yes it can. you just dont like the impications of it. Are you arguing that we do not understand nuclear theory? We have been over this ground before, methinks\n \n Did you miss this part?\n \n \nIt could be man made, i dont deny it\n\n \n and\n \n \n I have no problem with these being the age claimed\n\n \n What exactly is the confusion here? All I am trying to get across is that we withold interpretations until we have all observations made. You seem to be happy to jump to conclusions, based on what you see online. Study at the site is ongoing. \n \n Again, what amuses me is your acceptance of one part of science, but denoucing other parts as fraud. Also, your application of this shadowy conspiracy is patchy at best", 
   {}, 
   257221, 
   null, 
   1175877480.0
  ], 
  [
   257233, 
   null, 
   "Mucusaur", 
   "Scour pits are hollows often abraded hollows in river beds, caused by the action of rotating clasts of larger material. Though in the case of that picture, the side by side nature of them probably argues against it. They can be up to a metre in some cases, though usually a foot in size is more usual.", 
   {}, 
   257221, 
   null, 
   1175877660.0
  ], 
  [
   257249, 
   null, 
   "Archangel", 
   "yes it can. you just dont like the impications of it. Are you arguing that we do not understand nuclear theory? We have been over this ground before, methinks\n \n Did you miss this part?\n \n and\n \n What exactly is the confusion here? All I am trying to get across is that we withold interpretations until we have all observations made. You seem to be happy to jump to conclusions, based on what you see online. Study at the site is ongoing. \n \n Again, what amuses me is your acceptance of one part of science, but denoucing other parts as fraud. Also, your application of this shadowy conspiracy is patchy at best\n\n \n \nScour pits are hollows often abraded hollows in river beds, caused by the action of rotating clasts of larger material. Though in the case of that picture, the side by side nature of them probably argues against it. They can be up to a metre in some cases, though usually a foot in size is more usual.\n\n \n There's a huge difference in science interpreting evidence that is under 25,000 years old to claiming accuracy with fossils, rocks and artifacts said to be multiple millions of years old. Yes, I admit that i can accept the possibility of one type of evidence while totally rejecting the other, and i do it unashamedly.\n \n And I can prove my lack of faith in long term evo theory is correct and confirmed by the evidence itself. If you take any and all of the evolutionary claims that were made and ACCEPTED AS FACT a short 50 or even 25 years ago regarding the Age of Life on Earth, the Age of the Earth itself, the Age of Man, and the first signs of homo-sapien, all of those accepted facts are totally different today than they were then.\n \n And they will be totally different in 50 years than they are today too, if we are still here that is. Which I contend we wont be because this Age will have ended by then and the Lord will have returned by then as promised.\n Now I know you will say that we are still learning and it is a growing process that is a fluid science and ever changing based on what we learn , right ? \n \n Great, then stop trying to convince me that evo is right and proven in any way. That it stands up to scientific scrutiny because you can't have it both ways. It can't be fluid and ever changing corrections and facts on one hand and reliable consistent evidence of anything on the other.\n \n And you still have ignored completely Rapid Adaptation. Why is that my friend ? And are you seriously suggesting that the holes in two holes in that rock with the indented space between them, that by the way resemble the exact type of holes we would create to receive an insertable post is really natural and not man made ? I mean it would take two holes side by side to prevent the object from turning as it would in a single round hole. And have you any comment on the size of the holes compared to the scuba diver in the picture ?", 
   {}, 
   257233, 
   null, 
   1175884140.0
  ], 
  [
   257250, 
   null, 
   "Archangel", 
   "yes it can. you just dont like the impications of it. Are you arguing that we do not understand nuclear theory? We have been over this ground before, methinks\n \n Did you miss this part?\n \n and\n \n What exactly is the confusion here? All I am trying to get across is that we withold interpretations until we have all observations made. You seem to be happy to jump to conclusions, based on what you see online. Study at the site is ongoing. \n \n Again, what amuses me is your acceptance of one part of science, but denoucing other parts as fraud. Also, your application of this shadowy conspiracy is patchy at best\n\n \n \nScour pits are hollows often abraded hollows in river beds, caused by the action of rotating clasts of larger material. Though in the case of that picture, the side by side nature of them probably argues against it. They can be up to a metre in some cases, though usually a foot in size is more usual.\n\n \n There's a huge difference in science interpreting evidence that is under 25,000 years old to claiming accuracy with fossils, rocks and artifacts said to be multiple millions of years old. Yes, I admit that i can accept the possibility of one type of evidence while totally rejecting the other, and i do it unashamedly.\n \n And I can prove my lack of faith in long term evo theory is correct and confirmed by the evidence itself. If you take any and all of the evolutionary claims that were made and ACCEPTED AS FACT a short 50 or even 25 years ago regarding the Age of Life on Earth, the Age of the Earth itself, the Age of Man, and the first signs of homo-sapien, all of those accepted facts are totally different today than they were then.\n \n And they will be totally different in 50 years than they are today too, if we are still here that is. Which I contend we wont be because this Age will have ended by then and the Lord will have returned by then as promised.\n Now I know you will say that we are still learning and it is a growing process that is a fluid science and ever changing based on what we learn , right ? \n \n Great, then stop trying to convince me that evo is right and proven in any way. That it stands up to scientific scrutiny because you can't have it both ways. It can't be fluid and ever changing corrections and facts on one hand and reliable consistent evidence of anything on the other.\n \n And you still have ignored completely Rapid Adaptation. Why is that my friend ? And are you seriously suggesting that the two holes in that rock with the indented space between them, that by the way resemble the exact type of holes we would create to receive an insertable post is really natural and not man made ? I mean it would take two holes side by side to prevent the object from turning as it would in a single round hole. And have you any comment on the size of the holes compared to the scuba diver in the picture ?", 
   {}, 
   257233, 
   null, 
   1175884380.0
  ], 
  [
   257254, 
   null, 
   "sinjin", 
   "http://www.bihou.com/iseki/tategami/tategami.htm\n \n You find this convincing as a man made sculpture?", 
   {}, 
   257250, 
   null, 
   1175885940.0
  ], 
  [
   257337, 
   null, 
   "Archangel", 
   "http://www.bihou.com/iseki/tategami/tategami.htm\n \n You find this convincing as a man made sculpture?\n\n \n Considering that thousands of years of coral has built up on it, yes, the eyes are still very evident and it was recognized as a manufactured statue by the Geologist who photographed it and submitted it as further evidence that the site isn't some naturally formed anomaly. Don't you trust the scientists that believe it is man made and have seen it up close and personally ?", 
   {}, 
   257254, 
   null, 
   1175907960.0
  ], 
  [
   257338, 
   null, 
   "Mucusaur", 
   "\n And are you seriously suggesting that the two holes in that rock with the indented space between them, that by the way resemble the exact type of holes we would create to receive an insertable post is really natural and not man made ? I mean it would take two holes side by side to prevent the object from turning as it would in a single round hole. And have you any comment on the size of the holes compared to the scuba diver in the picture ?\n\n \n I get the impression that you are not listening to me\n \n \nScour pits are hollows often abraded hollows in river beds, caused by the action of rotating clasts of larger material. Though in the case of that picture, the side by side nature of them probably argues against it\n\n \n \nThough in the case of that picture, the side by side nature of them probably argues against it\n\n \n \nprobably argues against it\n\n \n Rapid adaptation? I am not an authority on biology, indeed i claim only knowledge in a small field of science, unlike your learned self, whose very rising in the morn causes the overthrow of numerous paradigms. \n \n I'm sure there are many here who are willing to debate you on the topic, but we have been down this road many a time before", 
   {}, 
   257250, 
   null, 
   1175908080.0
  ], 
  [
   257345, 
   null, 
   "Archangel", 
   "\n Rapid adaptation? I am not an authority on biology, indeed i claim only knowledge in a small field of science, unlike your learned self, whose very rising in the morn causes the overthrow of numerous paradigms. \n \n I'm sure there are many here who are willing to debate you on the topic, but we have been down this road many a time before\n\n \n But you brought it up Mucasaur. You specifically asked me why I reject evo yet accept this more recent discovery as possible. I explained why, so now you don't even have an opinion ? Weak Mucasour, very weak.", 
   {}, 
   257338, 
   null, 
   1175911920.0
  ], 
  [
   257366, 
   null, 
   "Mucusaur", 
   "You specifically asked me why I reject evo yet accept this more recent discovery as possible.I explained why\n\n \n Not really \n \n \nAnd I can prove my lack of faith in long term evo theory is correct and confirmed by the evidence itself. If you take any and all of the evolutionary claims that were made and ACCEPTED AS FACT a short 50 or even 25 years ago regarding the Age of Life on Earth, the Age of the Earth itself, the Age of Man, and the first signs of homo-sapien, all of those accepted facts are totally different today than they were then.\n\n \n The age of the Earth = nothing to do with evolution. The age of the Earth has been accepted as 4.5 billion since the 1950's. The first serious attempts at dating its age were in the mid 1800's and even they had to assume millions of years to explain the formations the saw around them. Estimates steadily incresed sinse then. The discovery of radioactivity allowed for a source of heat, pushing the estimates into the billions. To find estimates of the earth being in the thousands, you have to look back nearly 200 years, So why are you diving headfirst into this Japenese study and accepting their findings before its even finished and yet will look back nearly 200 years for an estimate of the Earth age? \n \n Again, because its so important - the age of the Earth = nothing to do with evolution. Physics, geology and astromomy can tell us about this, not biology. \n \n \nAnd they will be totally different in 50 years than they are today too,\n Refined maybe. Not changed \"totally\"\n \n \nNow I know you will say that we are still learning and it is a growing process that is a fluid science and ever changing based on what we learn , right ? \n\n I agree fully. So why are you accepting a very out of date earth age? You are the one who has closed his mind to anything other than that which supports with the Bible, regardless of evidence.\n \n Having taken a look at the rapid adaptation link, I cant see what the point is. The claim that animals can speciate in very short spaces of time. This is already known, and I dont see how their theory is \"not evolution\". This in no way argues against an old earth, unless you tie it into \"off ark rapid speciation\" or such. So, what is the point?\n \n \n In any case, still not clear why you accept this unfinished and ongoing japenese archaeological study, whilst out of hand rejecting established, tested and observed science often of several decades age. It makes even less sense when this Japenese dive has many of the same specialists (geologists) and techiniques (radio dating) that give all the results you refuse to accept.", 
   {}, 
   257345, 
   null, 
   1175951580.0
  ], 
  [
   268680, 
   null, 
   "Ravin", 
   " \n The age of the Earth = nothing to do with evolution. \n\n It is really rather normal to see that creationists are unable to distinguish such a thing - anything that contradicts their fairy-tale is \"evilution\"", 
   {}, 
   257366, 
   null, 
   1181848440.0
  ], 
  [
   268691, 
   null, 
   "jitobear", 
   "IT WAS ALIENS!\n \n Seriously - geology or man-made it is very cool. Why have we not heard more here in America? Who can say? Why do eat cheetohs, watch reality TV or listen to Brittney Spears? It all has something to do with too much empty space in-between the ears if you ask me.\n \n And the earth is oooooooooooooooooooooooooooooollllllllllllllllllllllldddddddddddddddddd.", 
   {}, 
   268680, 
   null, 
   1181851740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why the News Blackout ?", 
  "url": "http://www.4forums.com/political/news-forum/9701-why-news-blackout.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 9701, 
  "discussion_files": [
   [
    "25026.html", 
    "http://www.4forums.com/political/news-forum/9701-why-news-blackout-print.html"
   ], 
   [
    "25027.html", 
    "http://www.4forums.com/political/news-forum/9701-why-news-blackout-4-print.html"
   ], 
   [
    "25028.html", 
    "http://www.4forums.com/political/news-forum/9701-why-news-blackout-3-print.html"
   ], 
   [
    "25029.html", 
    "http://www.4forums.com/political/news-forum/9701-why-news-blackout-2-print.html"
   ]
  ], 
  "identifier": 9701
 }
]