[
 [
  [
   256272, 
   null, 
   "Shooterandproud", 
   "Actually, the title is a little deceptive, however I have noticed that one verse in his new song \"Runaway Love\", one of the verses brings up something relevant on the abortion debate. Verse 3 goes of the song, I noticed goes:\n \n \"Little Erica is eleven years old\n She's steady trying to figure why the world is so cold\n So she pops x to get rid of all the pain\n 'Cause she's having sex with a boy who's sixteen\n Emotions run deep and she thinks she's in love\n So there's no protection he's using no glove\n Never thinking 'bout the consequences of her actions\n Living for today and not tomorrow's satisfaction\n The days go by and her belly gets big\n The father bails out he ain't ready for a kid\n Knowing her mama will blow it all outta proportion\n Plus she lives poor so no money for abortion\n Erica is stuck up in the world on her own\n Forced to think that hell is a place called home\n Nothing else to do but get her clothes and pack\n She say she's about to run away and never come back.\"\n \n \n \n I know its not completely relevant to the abortion issue, but it is very relevant to the lives of little girls living in poverty and being abused. I would like to know what your opinion of the verse is.", 
   {
    "post_info": {
     "post_title": "Looks like Ludachris is in the abortion issue too."
    }
   }, 
   null, 
   null, 
   1175390940.0
  ], 
  [
   256280, 
   null, 
   "___", 
   "With no idea how or why he came about,\n he trusts in his mummy it will all be sorted out.\n From time to time a tune will be played,\n it's only his mother humming away.\n It is like being in space and bouncing around,\n especially when mum is running up and down.\n But it is all cut short one bad day,\n a bladed catheter sliced me away.\n First it ripped and severed my leg,\n then it punctured my guts, removed them today.\n The jabbing and slicing makes me feel bad,\n I wonder why mummy is making me sad?\n I never got the chance to see her face,\n now I'm dismembered all over the place. \n I will never know her or see her, not a trace,\n I have been removed from the human race.\n Want to cuddle and give her a kiss,\n and say hi to my brothers I know I will miss.", 
   {}, 
   256272, 
   null, 
   1175398620.0
  ], 
  [
   256283, 
   null, 
   "Shooterandproud", 
   "With no idea how or why he came about,\n he trusts in his mummy it will all be sorted out.\n From time to time a tune will be played,\n it's only his mother humming away.\n It is like being in space and bouncing around,\n especially when mum is running up and down.\n But it is all cut short one bad day,\n a bladed catheter sliced me away.\n First it ripped and severed my leg,\n then it punctured my guts, removed them today.\n The jabbing and slicing makes me feel bad,\n I wonder why mummy is making me sad?\n I never got the chance to see her face,\n now I'm dismembered all over the place. \n I will never know her or see her, not a trace,\n I have been removed from the human race.\n Want to cuddle and give her a kiss,\n and say hi to my brothers I know I will miss.\n\n \n The only reason why that makes no sense is that no one exists inside the embryo. It would be like writing about someone weeding their garden from a weeds point of view. The anthropomorphization of non-mental existant beings is implausible at least.", 
   {}, 
   256280, 
   null, 
   1175406300.0
  ], 
  [
   256289, 
   null, 
   "Bell", 
   "I know its not completely relevant to the abortion issue, but it is very relevant to the lives of little girls living in poverty and being abused. I would like to know what your opinion of the verse is.\n\n \n I think Ludacris brings up some very important issues that others would rather pretend aren't there in favor of an easier point of view. \n \n It's much easier to sit and say, \"don't have an abortion\" than to stand up and say \"here's how I will help you so you don't have to have an abortion\".", 
   {}, 
   256272, 
   null, 
   1175411520.0
  ], 
  [
   256306, 
   null, 
   "___", 
   "The only reason why that makes no sense is that no one exists inside the embryo. It would be like writing about someone weeding their garden from a weeds point of view. The anthropomorphization of non-mental existant beings is implausible at least.\n\n \n I never claimed anyone did live inside an embryo.", 
   {}, 
   256283, 
   null, 
   1175432760.0
  ], 
  [
   256307, 
   null, 
   "___", 
   "I think Ludacris brings up some very important issues that others would rather pretend aren't there in favor of an easier point of view. \n \n It's much easier to sit and say, \"don't have an abortion\" than to stand up and say \"here's how I will help you so you don't have to have an abortion\".\n\n \n And it is much easier to have an abortion than to be a mother.", 
   {}, 
   256289, 
   null, 
   1175432820.0
  ], 
  [
   256317, 
   null, 
   "jitobear", 
   "And it is much easier to have an abortion than to be a mother.\n\n \n Look Bell - your point is made.", 
   {}, 
   256307, 
   null, 
   1175438460.0
  ], 
  [
   256358, 
   null, 
   "chloe", 
   "Actually, the title is a little deceptive, however I have noticed that one verse in his new song \"Runaway Love\", one of the verses brings up something relevant on the abortion debate. Verse 3 goes of the song, I noticed goes:\n \n \"Little Erica is eleven years old\n She's steady trying to figure why the world is so cold\n So she pops x to get rid of all the pain\n 'Cause she's having sex with a boy who's sixteen\n Emotions run deep and she thinks she's in love\n So there's no protection he's using no glove\n Never thinking 'bout the consequences of her actions\n Living for today and not tomorrow's satisfaction\n The days go by and her belly gets big\n The father bails out he ain't ready for a kid\n Knowing her mama will blow it all outta proportion\n Plus she lives poor so no money for abortion\n Erica is stuck up in the world on her own\n Forced to think that hell is a place called home\n Nothing else to do but get her clothes and pack\n She say she's about to run away and never come back.\"\n \n \n \n I know its not completely relevant to the abortion issue, but it is very relevant to the lives of little girls living in poverty and being abused. I would like to know what your opinion of the verse is.\n\n \n Ludacris and many others in the hip hop scene disrespect women with their lyrics and videos. Much of what hip hop puts out contributes to unwanted pregnancies.", 
   {}, 
   256272, 
   null, 
   1175464440.0
  ], 
  [
   256368, 
   null, 
   "JPSartre12", 
   "And it is much easier to have an abortion than to be a mother.\n\n \n It's usually easier to take the immoral path. Stealing's easier than working. Lying's easier than telling the truth. Being a deadbeat parent is easier than being a good parent. The list goes on and on.", 
   {}, 
   256307, 
   null, 
   1175470440.0
  ], 
  [
   256389, 
   null, 
   "Bell", 
   "Ludacris and many others in the hip hop scene disrespect women with their lyrics and videos. Much of what hip hop puts out contributes to unwanted pregnancies.\n\n \n I think hip hop and the arts are reflections of society. It is good to bring these issues to light, if only so that those who wouldn't normally be aware of them are enlightened.\n \n \nLook Bell - your point is made.\n\n \n Yeah, isn't it great? :)", 
   {}, 
   256358, 
   null, 
   1175482620.0
  ], 
  [
   256391, 
   null, 
   "Shooterandproud", 
   "I never claimed anyone did live inside an embryo.\n\n \n Well, you're writing from an embryo's point of view, when an embryo doesn't even have a point of view. It would be like writing from a rock's point of view.", 
   {}, 
   256306, 
   null, 
   1175486400.0
  ], 
  [
   256392, 
   null, 
   "Shooterandproud", 
   "Ludacris and many others in the hip hop scene disrespect women with their lyrics and videos. Much of what hip hop puts out contributes to unwanted pregnancies.\n\n \n I don't see how other rapper's disrespect for women are even relevant here.", 
   {}, 
   256358, 
   null, 
   1175486460.0
  ], 
  [
   256403, 
   null, 
   "Steeeeve", 
   "I don't see how other rapper's disrespect for women are even relevant here.\n\n \n I don't see how \"Ludachris\"'s opinion is relevant here but that didn't seem to stop you. but since you admit this here: \"I know its not completely relevant to the abortion issue, but it is very relevant to the lives of little girls living in poverty and being abused. I would like to know what your opinion of the verse is.\" I'll just go ahead and answer your question about what I think the verse is talking about...\n \n It is talking about a young woman who is having troubles and ended up getting pregnant. This verse is fairly obvious and seems to be of no difference here. However, we once again see people falling into the idea that if you don't think abortion is right then you must be willing to do anything for a young girl who is pregnant. Of course this black and white thinking will never extend beyond this one example as it doesn't fit with the inconsistent, situational based pro-choicers. For example we all think a 40yr old white male raping and killing a 10yr old little girl is wrong and horrible but I don't see any of you out there giving the girls family all of your money, time, etc etc. Perhaps one day some of you will learn that the actions done by those that believe something do not determine the issue to be morally right or wrong.", 
   {}, 
   256392, 
   null, 
   1175495820.0
  ], 
  [
   256427, 
   null, 
   "jim's trucking", 
   "Just as Richard Gere does not sway my political views, Ludacris is no more influentual with me than is any other celebrity idiot...like Sean Penn.\n \n It is amusing how people put value in what some goofball celebrity says or does just because he's famous.", 
   {}, 
   256403, 
   null, 
   1175527320.0
  ], 
  [
   256452, 
   null, 
   "Bell", 
   "It is talking about a young woman who is having troubles and ended up getting pregnant. This verse is fairly obvious and seems to be of no difference here. However, we once again see people falling into the idea that if you don't think abortion is right then you must be willing to do anything for a young girl who is pregnant. Of course this black and white thinking will never extend beyond this one example as it doesn't fit with the inconsistent, situational based pro-choicers. For example we all think a 40yr old white male raping and killing a 10yr old little girl is wrong and horrible but I don't see any of you out there giving the girls family all of your money, time, etc etc. Perhaps one day some of you will learn that the actions done by those that believe something do not determine the issue to be morally right or wrong.\n\n \n I don't think that prolife people should be giving all their time, money, etc to help pregnant women/girls, nor do I think that's the only way they can \"justify\" their position. I do think that they should recognize that there are reasons women think abortion is the best solution even if they disagree with them, and perhaps consider that when they voice their opinion, go to the polls, or consider which charity to donate to.\n \n\n Ludacris is no more influentual with me than is any other celebrity idiot...like Sean Penn.\n \n It is amusing how people put value in what some goofball celebrity says or does just because he's famous.\n\n \n I think the only value is that he is bringing this kind of situation more attention so that people know it's out there. His opinion on the subject means naught to me.", 
   {}, 
   256403, 
   null, 
   1175536260.0
  ], 
  [
   256506, 
   null, 
   "___", 
   "Well, you're writing from an embryo's point of view, when an embryo doesn't even have a point of view. It would be like writing from a rock's point of view.\n\n \n I was an embryo, I have a point of view.", 
   {}, 
   256391, 
   null, 
   1175551500.0
  ], 
  [
   256507, 
   null, 
   "___", 
   "Look Bell - your point is made.\n\n \n We agree! \n \n Excellent!", 
   {}, 
   256317, 
   null, 
   1175551560.0
  ], 
  [
   256510, 
   null, 
   "jim's trucking", 
   "I was an embryo, I have a point of view.\nThen please do tell us what the first trimester was like.", 
   {}, 
   256506, 
   null, 
   1175552160.0
  ], 
  [
   256530, 
   null, 
   "___", 
   "Then please do tell us what the first trimester was like.\n\n \n It was like yours.", 
   {}, 
   256510, 
   null, 
   1175561820.0
  ], 
  [
   256593, 
   null, 
   "jitobear", 
   "Hey I was an embryo once too.\n \n Maybe I should write a poem about how I wish my grandmother could have been granted birth control without permission from her abusive wouldn't work even though they ended up having 11 kids in a one room shack lunatic of a husband? Or maybe one about how I wish my mother could have been able to make the decision to get her tubes tied without her doctor lieing to my father so he would agree to it? How about one that praises both of these women for teaching to own my own body and to be pro-choice?", 
   {}, 
   256530, 
   null, 
   1175610420.0
  ], 
  [
   256594, 
   null, 
   "JPSartre12", 
   "Hey I was an embryo once too.\n \n Maybe I should write a poem about how I wish my grandmother could have been granted birth control without permission from her abusive wouldn't work even though they ended up having 11 kids in a one room shack lunatic of a husband? Or maybe one about how I wish my mother could have been able to make the decision to get her tubes tied without her doctor lieing to my father so he would agree to it? How about one that praises both of these women for teaching to own my own body and to be pro-choice?\n\n \n So tell us, did your Mom and her 10 siblings all grow up to be axe murders or productive members of society?", 
   {}, 
   256593, 
   null, 
   1175610720.0
  ], 
  [
   256601, 
   null, 
   "jim's trucking", 
   "I was an embryo, I have a point of view.\n\n \n \nThen please do tell us what the first trimester was like.\n\n \n \nIt was like yours.\nThen you have no memory of it. Your nervous system was not developed enough to generate pain signals...and there was no brain there to interpret the signals as pain. You had no thoughts. You were nothing more than a lump developing slowly into a mammal to be born when ready. You were a burden to your mother. You hadn't the ability nor the knowledge to protest an abortion or to beg for your life for you had no brain with which to think about ANYTHING. You had no point of view.", 
   {}, 
   256530, 
   null, 
   1175613000.0
  ], 
  [
   256609, 
   null, 
   "Zardoz", 
   "If you review the lyrics, it's more of a commentary on the plight of African American poor.\n A girl gets caught up in the sweet talk of someone who probably promises her \n the world but both are too young and have little to no guidance in their lives, so make a mistake. \n The boy, doing what many Blacks do, (and most Black Churches are fighting an uphill battle to combat it) leaves.\n There is drug use. There is the lack of use of condoms, the African American community has problems dealing with AIDS in addition to the unplanned pregnancies and other issues.\n They have no money so even if they wanted to use abortion, that option is out. \n Her mother WILL be mad because she's now witnessing a cycle repeat itself and while she had all the best intentions for her daughter, more often than not she was too busy to effectively teach her daughter in the way she should go. She was also too trusting in allowing her daughter to roam at such a young age and find the ever present trouble. Most parents have little to no ability to discipline their children let alone ensure they are in school during the day. Any hear on how some communities are going after the parents legally for truancy? \n It is a mess.\n \n Yet, all Luda is doing is pointing a light at it. No answers.\n However, he has recently been with Bishop Eddie Long, a 1st class pulpit pimp looking for fame and money. ( http://www.pulpit-pimps.org/archives/2006/10/06/fast-eddie-and-ludacris-a-tale-of-two-pimps for commentary on their relationship.)\n While I dispise most of what these types of religious leaders do, their bad doctrine, their abuse of their congregation, they do more often than not preach on social issues relevant to the Black community.\n If you'll note in the lyrics, one of the problems is relationships. The girl has none. No father is mentioned. Her mother's going to be made, more than likely, yet again. Her 'man' (a boy who could be legally prosecuted for rape here) bails on her because he more than likely has no better role to follow than his old mans who's not there either. \n Black churches often call black men to be men. To step up to the plate and deal with their responsibilities too. They also encourage black women to be strong in the face of the many adversities. \n \n Same goes for 1st and 2nd verses of the song dealing with sexual abuse of children, neglect and isolation due to rampant street violence. Chicago recently had several girls killed by stray bullets. I'm constantly covering news from Detroit, Philadelphia, Houston, Chicago and other large cities where this problem is endemic. I think the Guardian Angels even moved from NY to Boston to assist in patroling the streets for crime in the past week.\n \n Of course, the community activists ususally respond to this with bitching and bellyaching...to get someone else to do something. When they do something themselves...it's hold a street march...to bring 'awareness'.\n I'm awarenessed out. Ludacris/ Mary Bliges song doesn't say anything new and it's doubtful that it will inspire others to take action.\n More than likely, some kid will listen to it in misery while smoking some weed and contemplating whether they'd be better off dead since they have problems they aren't capable of dealing with and no one seems to really care to help in any tangible manner. \n \n Some here think an abortion is the answer to all things related to problems with child rearing. Some here cry murder, yet won't drop a dime to save a life.\n I hear calls from the liberals on attacking the causes that lead one to a situation where they're forced into what they see as a no win situation and seek the lesser of 2 evils in their mind, getting an abortion. Maybe the causes should be addressed.\n \n I'd hazard a guess that if the sales of just this one song went to fund youth activities and education, assist in mentoring programs for boys and girls or even adults, then maybe there might be a few less kids (or adults) in this situation in the future. \n \n But, then again, don't you think Luda would best be served with more fine quality bling? I mean, so people will know he's a man of success and deserving of respect...so, they'll listen to him...when he tries to raise awareness on an issue...", 
   {}, 
   256403, 
   null, 
   1175618160.0
  ], 
  [
   256668, 
   null, 
   "___", 
   "Then you have no memory of it. Your nervous system was not developed enough to generate pain signals...and there was no brain there to interpret the signals as pain. You had no thoughts. You were nothing more than a lump developing slowly into a mammal to be born when ready. You were a burden to your mother. You hadn't the ability nor the knowledge to protest an abortion or to beg for your life for you had no brain with which to think about ANYTHING. You had no point of view.\n\n \n \n I still have a point of view.", 
   {}, 
   256601, 
   null, 
   1175635260.0
  ], 
  [
   256670, 
   null, 
   "jim's trucking", 
   "I still have a point of view.\nAs does every person alive...it has NOTHING WHATSOEVER to do with the fact that each was once an embryo. You have a point of view because you survived the embryonic stage.", 
   {}, 
   256668, 
   null, 
   1175635440.0
  ], 
  [
   256675, 
   null, 
   "___", 
   "As does every person alive...it has NOTHING WHATSOEVER to do with the fact that each was once an embryo. You have a point of view because you survived the embryonic stage.\n\n \n I don't disagree with that.", 
   {}, 
   256670, 
   null, 
   1175637600.0
  ], 
  [
   256684, 
   null, 
   "jitobear", 
   "So tell us, did your Mom and her 10 siblings all grow up to be axe murders or productive members of society?\n\n \n None are ax murderers - beyond that I will not say and is frankly none of your business. Don't use my mom to prove your side - SHE will reach through the computer and beat you over the head with your mouse.", 
   {}, 
   256594, 
   null, 
   1175638680.0
  ], 
  [
   256958, 
   null, 
   "Shooterandproud", 
   "I was an embryo, I have a point of view.\n\n \n Your flesh was an embryo, what we know as \"you\" or who is typing that, came to exist somewhere in the third trimester. Besides, I used to be a sperm, that doesn't mean sperm have points of views.", 
   {}, 
   256506, 
   null, 
   1175756280.0
  ], 
  [
   256959, 
   null, 
   "Shooterandproud", 
   "I still have a point of view.\n\n \n Are you saying that you're still an embryo?", 
   {}, 
   256668, 
   null, 
   1175756400.0
  ], 
  [
   256989, 
   null, 
   "___", 
   "Are you saying that you're still an embryo?\n\n \n No, I said I was an embryo and I have a point of view.", 
   {}, 
   256959, 
   null, 
   1175781360.0
  ], 
  [
   256999, 
   null, 
   "jitobear", 
   "No, I said I was an embryo and I have a point of view.\n\n \n Just like everybody else.", 
   {}, 
   256989, 
   null, 
   1175784720.0
  ], 
  [
   257003, 
   null, 
   "___", 
   "Just like everybody else.\n\n \n We all agree.", 
   {}, 
   256999, 
   null, 
   1175785920.0
  ], 
  [
   257026, 
   null, 
   "ShadowPikachu", 
   "We all agree.\n\n \n Yes, we agree that everyone alive now has a point of view now, just like embryos don't have a \"point of view\" (nor even a mind).", 
   {}, 
   257003, 
   null, 
   1175793480.0
  ], 
  [
   257034, 
   null, 
   "___", 
   "Yes, we agree that everyone alive now has a point of view now, just like embryos don't have a \"point of view\" (nor even a mind).\n\n \n Very newborns don't have a point of view.", 
   {}, 
   257026, 
   null, 
   1175798460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Looks like Ludachris is in the abortion issue too.", 
  "url": "http://www.4forums.com/political/abortion-debates/9705-looks-like-ludachris-abortion-issue-too.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9705, 
  "discussion_files": [
   [
    "28538.html", 
    "http://www.4forums.com/political/abortion-debates/9705-looks-like-ludachris-abortion-issue-too-print.html"
   ], 
   [
    "28539.html", 
    "http://www.4forums.com/political/abortion-debates/9705-looks-like-ludachris-abortion-issue-too-3-print.html"
   ], 
   [
    "28540.html", 
    "http://www.4forums.com/political/abortion-debates/9705-looks-like-ludachris-abortion-issue-too-2-print.html"
   ]
  ], 
  "identifier": 9705
 }
]