[
 [
  [
   256760, 
   null, 
   "ShadowPikachu", 
   "Just saw this on CNN today. Apparently the president of Ukraine has dissolved their parliament and called for early elections. The Constitutional Court still has to rule on the validity of Yushcenko's orders.\n \n The link is here: Ukranian political crisis deepens - CNN.com", 
   {
    "post_info": {
     "post_title": "Ukrainian president dissolves parliament"
    }
   }, 
   null, 
   null, 
   1175665140.0
  ], 
  [
   268681, 
   null, 
   "Ravin", 
   "It is things like this that make me wonder why we are so worried about Iraq. Especially the fact that noone has replied to this topic.", 
   {}, 
   256760, 
   null, 
   1181848560.0
  ], 
  [
   268697, 
   null, 
   "Master_Shake", 
   "Yeah, no kidding.\n \n What has happened since this was posted in this situation?", 
   {}, 
   268681, 
   null, 
   1181852340.0
  ], 
  [
   268704, 
   null, 
   "ShadowPikachu", 
   "Yeah, no kidding.\n \n What has happened since this was posted in this situation?\n\n \n Apparently the crisis has been settled down - they've agreed to hold elections September 30. Crisis calmed: Ukraine to hold early elections", 
   {}, 
   268697, 
   null, 
   1181854380.0
  ], 
  [
   269570, 
   null, 
   "Magii", 
   "HR situation in Ukraine in perspective of entering NATO\n \n Owing to the fact that a final decision concerning Ukraine's membership in NATO is expected to be made in 2008, I turned into general situation in this country in order to figure Ukraine out. To begin with, I studied human rights situation in Ukraine. To do it, I looked through several HR reports about Ukraine by Amnesty International, International Helsinki Federation for human rights, Privacy International, US Department of State and Human Rights Watch. \n \n Honestly, the HR situation in Ukraine appeared to be even more... hopeless. I knew it is not all okay with Ukraine but I could not imagine it was so desperate. It also made me wonder why the problem of human rights in Ukraine was not a main topic of discussion at the OSCE conference on combating discrimination and promoting mutual respect and understanding that took place in Bucharest early in June. Considering that Ukraine is sort of going to be a NATO member state, a lot of attention must be paid to this aspect. \n \n Let's specify what is objectionable about HR situation in Ukraine. \n \n First of all, despite all attempts of the West to end the practice of tortures and ill-treatment in Ukrainian police detention facilities and prisons, the problem persists. Detainees are at high risk of being physically ill-treated at the time of their apprehension and while in police custody, particularly when being questioned. Those responsible for crimes against detainees are very rarely (never if to be certain) investigated or prosecuted. Serious problems in detention facilities include overcrowding, substandard conditions of detention, high rates of tuberculosis and other infectious diseases including HIV/AIDS, as well as inadequate food, medical, and other provisions. \n \n HIV-positive persons often face discrimination in access to health and social services and violations of their right to privacy. In addition, they often face discrimination in the workplace and ill-treatment by police. \n \n Racism and xenophobia remain entrenched problems in Ukraine. Police regularly target minorities for so-called \"document checks,\" which almost always result in bribes or illegal detention accompanied by beatings or other ill-treatment. \n \n Numerous anti-Semitic attacks were reported in the recent years, but police have been reluctant to label the incidents as hate crimes.\n \n Quite often Ukrainian Jews get assaulted by skinheads, however the police deny that anti-Semitism has anything to do with the attacks. \n \n Roma in Ukraine continue to suffer frequent and unremedied police abuse, despite repeated appeals by Romani organizations to the police, prosecutors, and the Ombudsperson calling for effective investigations and punishments.\n \n Women in Ukraine do not enjoy equal access to employment opportunities as a result of discriminatory attitudes among both public and private employers, including blatantly discriminatory recruitment practices. Men hold a disproportionate number of senior government and managerial positions and receive better pay than women in comparable jobs. Women are forced into the low-paying and unregulated informal economy or remain unemployed.\n \n To sum up what I was able to learn about HR situation in Ukraine, this country is not ready to become a NATO member state as yet. Besides that, there is a lot to be done about economic situation of Ukraine. It is unstable and stagnating.", 
   {
    "post_info": {
     "post_title": "HR situation in Ukraine in perspective of entering NATO"
    }, 
    "unicode_changes_made": true
   }, 
   268704, 
   null, 
   1182353400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ukrainian president dissolves parliament", 
  "url": "http://www.4forums.com/political/news-forum/9717-ukrainian-president-dissolves-parliament.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 9717, 
  "discussion_files": [
   [
    "9068.html", 
    "http://www.4forums.com/political/news-forum/9717-ukrainian-president-dissolves-parliament-print.html"
   ]
  ], 
  "identifier": 9717
 }
]