[
 [
  [
   257272, 
   null, 
   "wascallywabbit", 
   "**\n \n For lack of which, on all sides, these discussions are never resolved---\n \n \"(A statement by Michael Scriven & Richard Paul for the National Council for\n Excellence in Critical Thinking Instruction)\n \n Summary\n \n Critical thinking is the intellectually disciplined process of actively and\n skillfully conceptualizing, applying, analyzing, synthesizing, and/or\n evaluating information gathered from, or generated by, observation,\n experience, reflection, reasoning, or communication, as a guide to belief\n and action. In its exemplary form, it is based on universal intellectual\n values that transcend subject matter divisions: clarity, accuracy,\n precision, consistency, relevance, sound evidence, good reasons, depth,\n breadth, and fairness.\n \n It entails the examination of those structures or elements of thought\n implicit in all reasoning: purpose, problem, or question-at-issue;\n assumptions; concepts; empirical grounding; reasoning leading to\n conclusions; implications and consequences; objections from alternative\n viewpoints; and frame of reference. Critical thinking - in being responsive\n to variable subject matter, issues, and purposes - is incorporated in a\n family of interwoven modes of thinking, among them: scientific thinking,\n mathematical thinking, historical thinking, anthropological thinking,\n economic thinking, moral thinking, and philosophical thinking.\n \n Critical thinking can be seen as having two components: 1) a set of\n information and belief generating and processing skills, and 2) the habit,\n based on intellectual commitment, of using those skills to guide behavior.\n It is thus to be contrasted with: 1) the mere acquisition and retention of\n information alone, because it involves a particular way in which\n information is sought and treated; 2) the mere possession of a set of\n skills, because it involves the continual use of them; and 3) the mere use\n of those skills (\"as an exercise\") without acceptance of their results.\n \n Critical thinking varies according to the motivation underlying it. When\n grounded in selfish motives, it is often manifested in the skillful\n manipulation of ideas in service of one's own, or one's groups', vested\n interest. As such it is typically intellectually flawed, however\n pragmatically successful it might be. When grounded in fairmindedness and\n intellectual integrity, it is typically of a higher order intellectually,\n though subject to the charge of \"idealism\" by those habituated to its\n selfish use.\n \n Critical thinking of any kind is never universal in any individual;\n everyone is subject to episodes of undisciplined or irrational thought. Its\n quality is therefore typically a matter of degree and dependent\n on, among other things, the quality and depth of experience in a given\n domain of thinking or with respect to a particular class of questions. No\n one is a critical thinker through-and-through, but only to such-and-such a\n degree, with such-and-such insights and blind spots, subject to\n such-and-such tendencies towards self-delusion. For this reason, the\n development of critical thinking skills and dispositions is a life-long\n endeavor.\n \n Why Critical Thinking?\n The Problem:\n Everyone thinks; it is our nature to do so. But much of our thinking, left\n to itself, is biased, distorted, partial, uninformed or down-right\n prejudiced. Yet the quality of our life and that of what we produce, make,\n or build depends precisely on the quality of our thought. Shoddy thinking\n is costly, both in money and in quality of life. Excellence in thought,\n however, must be systematically cultivated.\n \n A Definition:\n Critical thinking is that mode of thinking - about any subject, content, or\n problem - in which the thinker improves the quality of his or her thinking\n by skillfully taking charge of the structures inherent in thinking and\n imposing intellectual standards upon them.\n \n The Result:\n A well cultivated critical thinker:\n \n * raises vital questions and problems, formulating them clearly and\n precisely;\n * gathers and assesses relevant information, using abstract ideas to\n interpret it effectively comes to well-reasoned conclusions and\n solutions, testing them against relevant criteria and standards;\n * thinks openmindedly within alternative systems of thought,\n recognizing and assessing, as need be, their assumptions,\n implications, and practical consequences; and\n * communicates effectively with others in figuring out solutions to\n complex problems.\n \n Critical thinking is, in short, self-directed, self-disciplined,\n self-monitored, and self-corrective thinking. It presupposes assent to\n rigorous standards of excellence and mindful command of their use. It\n entails effective communication and problem solving abilities and a\n commitment to overcome our native egocentrism and sociocentrism.\n \n www.criticalthinking.org\n Copyright © 2004 Foundation for Critical Thinking\n ALL RIGHTS RESERVED\n To contact us:\n cct@...\n 707-878-9100\n P.O. BOX 220\n Dillon Beach, CA. 94929\"\n \n Just something to think about.", 
   {
    "post_info": {
     "post_title": "Critical Thinking"
    }
   }, 
   null, 
   null, 
   1175890380.0
  ], 
  [
   257303, 
   null, 
   "Collin", 
   "Belongs in a different forum. Maybe \"Debating Techniques\".", 
   {}, 
   257272, 
   null, 
   1175896740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Critical Thinking", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9729-critical-thinking.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9729, 
  "discussion_files": [
   [
    "4016.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9729-critical-thinking-print.html"
   ]
  ], 
  "identifier": 9729
 }
]