[
 [
  [
   257542, 
   null, 
   "JL...W", 
   "I was struck by several things in this recent \"Dear Annie\" advice column (below) especially how the advice columnists appear to make a distinction between depression and \"mental illness\". What mental illness do they suppose brother Elton is suffering from? I think his behavior sounds quite consistent with depression and the fact that \"Annie\" ascribes it to something more than depression underscores my suspicion that depression is often trivialized in many people's understanding. \n \n Annie's Mailbox, April 6\n Dear Annie: I have an older brother who is 38. \"Elton\" has suffered from depression for a long time. In earlier years, he got help, but now he refuses and is convinced everyone is out to get him.\n \n My problem is, he uses the family members for his needs only. He treats my parents horribly. He lived with them for almost two years (between jobs) and wouldn't help out at all, not even cleaning his own room.\n \n Now Elton is upset with me because I don't want to argue with him over the phone. It was about some really unimportant matter, and when I told him I wasn't interested in a fight, he slammed the phone in my ear. I can no longer deal with the hurtful things Elton does to me, and he's been abusive like this for years.\n \n Right now, I am taking a break from my brother. My parents, however, do not like this decision. They always want me to be the one to say \"Sorry,\" even if I don't owe him an apology. They also don't like the idea of my brother not seeing my kids. They feel this is good for him, almost like therapy.\n \n How do I stand up for myself when everyone else bends to my brother's every wish for fear he'll do something irrational? - Trying to Stand in Illinois\n \n Dear Illinois: Elton sounds more than depressed. He sounds mentally ill and apparently has little control over his emotions and actions. While he should not be using your children as \"therapy,\" it might help you and your family to understand more thoroughly what is going on so you can respond appropriately. Please contact the National Alliance on Mental Illness (nami.org) at 1-800-950-NAMI (1-800-950-6264) and ask for assistance.\n \n I think too that this letter illustrates the problematical nature of coping with family members with mental illness, because due to its subjective nature, there's always some degree of \"Well, he could be better/act differently/be normal, etc, if he really wanted to\". There's a lot of resentment apparent here. The referral to NAMI seems like something of a copout, but, otoh, I'm not sure what other advice I would give. \n \n JL", 
   {
    "post_info": {
     "post_title": "How do we define mental illness?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1176062520.0
  ], 
  [
   257641, 
   null, 
   "Ripskar", 
   "I agree entirely that Depression is a mental illness.\n The major problem in the case quoted is that Elton refuses to get help.\n The policy of groups like Mind in the UK (and I think NAMI in the US would have a similar policy) is towards \"Empowerment\", in practical terms if a person is capable of doing something for themselves they should be encouraged to carry it out themselves rather than becoming dependant on others.\n \n http://www.mind.org.uk/Information/Booklets/Understanding/Understanding+depression", 
   {}, 
   257542, 
   null, 
   1176121500.0
  ], 
  [
   257770, 
   null, 
   "huckleberry", 
   "A quick perusal of the DSM IV puts some other info into light. The statement \"but now he refuses and is convinced everyone is out to get him.\" is indicative of paranoid schizophrenia. The columnist (and lets remember that this is a columnist and not a mental health professional) may not be making a clear distinction. It certainly does indicate the general populace lack of understanding but, consider that the columnist is likely to be communicating that there is more going on than just depression. Even though depression is a mental illness, it is very different from what most people think of when they think of mental illness. I know, that is your point, but there are some problems which need a different approach. The referral to NAMI is likely the best thing to do. They have links to every state mental health program.\n \n Huck.", 
   {}, 
   257641, 
   null, 
   1176164580.0
  ], 
  [
   257776, 
   null, 
   "Zardoz", 
   "A quick perusal of the DSM IV puts some other info into light. The statement \"but now he refuses and is convinced everyone is out to get him.\" is indicative of paranoid schizophrenia. The columnist (and lets remember that this is a columnist and not a mental health professional) may not be making a clear distinction. It certainly does indicate the general populace lack of understanding but, consider that the columnist is likely to be communicating that there is more going on than just depression. Even though depression is a mental illness, it is very different from what most people think of when they think of mental illness. I know, that is your point, but there are some problems which need a different approach. The referral to NAMI is likely the best thing to do. They have links to every state mental health program.\n \n Huck.\n\n \n My thoughts exactly.\n \n Personally, my advice to the write would be to a) run. Leave em all behind and get on with a healthier life or b) douse em all in gas and burninate everyone and collect all the insurance for yourself. Claim 'insanity runs in the family' as a defense. Take some time in a mental health facility when you can chill and plan on what to do with your new found wealth. \n But, that's my advice to all who'd write 'Anne'.", 
   {}, 
   257770, 
   null, 
   1176165360.0
  ], 
  [
   257779, 
   null, 
   "huckleberry", 
   "My thoughts exactly.\n \n Personally, my advice to the write would be to a) run. Leave em all behind and get on with a healthier life or b) douse em all in gas and burninate everyone and collect all the insurance for yourself. Claim 'insanity runs in the family' as a defense. Take some time in a mental health facility when you can chill and plan on what to do with your new found wealth. \n But, that's my advice to all who'd write 'Anne'.\n\n \n \n I think my advice to the writer would be similar but not as tongue in cheek. I would say take care of you and your immediate family. Have contact with your brother as you feel comfortable. Your parents are codependent and need a good twelve step support group.\n \n Huck", 
   {}, 
   257776, 
   null, 
   1176165540.0
  ], 
  [
   257953, 
   null, 
   "JL...W", 
   "I agree entirely that Depression is a mental illness.\n The major problem in the case quoted is that Elton refuses to get help.\n The policy of groups like Mind in the UK (and I think NAMI in the US would have a similar policy) is towards \"Empowerment\", in practical terms if a person is capable of doing something for themselves they should be encouraged to carry it out themselves rather than becoming dependant on others.\n \n\n \n I agree that people should be encouraged to help themselves, which is one reason why I think the definition of \"mental illness\" is so important. If someone accepts a diagnosis of mental illness, does it mean freedom from counter-productive self-blame, for instance, or does it drive a person down in terms of thinking, \"Oh, I'm sick. I'm so sick\". Ditto for how others see that person.\n \n And re the letter, I'd point out that \"refuses to get help\" is the characterization of the writer. We don't really know what it means. Refusing any and all help, or help that has been tried and found not that helpful? How many drug trials and drug combos must a person try, for instance? How 'bout ECT? Is refusing ECT, refusing \"help\"?\n \n NAMI, btw, is heavily funded by Big Pharma. Also true for Mind in the U.K.?\n \n JL", 
   {}, 
   257641, 
   null, 
   1176232440.0
  ], 
  [
   257954, 
   null, 
   "JL...W", 
   "A quick perusal of the DSM IV puts some other info into light. The statement \"but now he refuses and is convinced everyone is out to get him.\" is indicative of paranoid schizophrenia. \n \n Huck.\n\n \n It's also indicative of garden variety hard-core depression, imo. When you're severely depressed, it's hard to \"get help\", especially if you've tried various things in the past that have failed or been only somewhat helpful. Depression is also characterized by distorted thinking, emotional hypersensitivity and negativity. It's relatively easy to misinterpret other people's behavior and overreact under those conditions. Let's also remember that we're only hearing the letter writer's description of Elton as \"convinced that everyone is out to get him\". \n \n JL", 
   {}, 
   257770, 
   null, 
   1176233280.0
  ], 
  [
   257956, 
   null, 
   "JL...W", 
   " Your parents are codependent and need a good twelve step support group.\n \n Huck\n\n \n Or the parents are compassionate and trying to help; it's hard to say. \n \n I was thinking that this letter writer could benefit from some codependency advice though too. She needs to learn to not be bothered by her brother's behavior and let go of some hard feelings and the need for approval from her parents. Easier said than done, especially within a family. \n \n JL", 
   {}, 
   257779, 
   null, 
   1176234060.0
  ], 
  [
   257976, 
   null, 
   "huckleberry", 
   "Or the parents are compassionate and trying to help; it's hard to say. \n \n I was thinking that this letter writer could benefit from some codependency advice though too. She needs to learn to not be bothered by her brother's behavior and let go of some hard feelings and the need for approval from her parents. Easier said than done, especially within a family. \n \n JL\n\n \n Totasl agreement from me.\n \n The problem with definitions of mental illness is that they have only one purpose, funding.", 
   {}, 
   257956, 
   null, 
   1176241080.0
  ], 
  [
   258083, 
   null, 
   "mae", 
   "A quick perusal of the DSM IV puts some other info into light. The statement \"but now he refuses and is convinced everyone is out to get him.\" is indicative of paranoid schizophrenia. The columnist (and lets remember that this is a columnist and not a mental health professional) may not be making a clear distinction. It certainly does indicate the general populace lack of understanding but, consider that the columnist is likely to be communicating that there is more going on than just depression. Even though depression is a mental illness, it is very different from what most people think of when they think of mental illness. I know, that is your point, but there are some problems which need a different approach. The referral to NAMI is likely the best thing to do. They have links to every state mental health program.\n \n Huck.\n\n \n \n Depression is a serious mental illness. After reading the first post in this thread in the letters to Anne, I can say it sounds familiar to what I have come across .....selfishness, using people, manipulative, paranoia, delusional, these are all symptoms of depression. Unfortunately family members don't have an option such as the sister in the letter to Anne and the only remedy is to seek professional advice.", 
   {}, 
   257770, 
   null, 
   1176270420.0
  ], 
  [
   258098, 
   null, 
   "Winston Smith", 
   "one more symptom of depression you forgot to add: hacking into other people's hotmail account.\n \n By the way laughter is the best medicine.", 
   {}, 
   258083, 
   null, 
   1176288720.0
  ], 
  [
   258099, 
   null, 
   "Symbiote", 
   "The \"paranoid\" aspect of the symptoms would raise questions as to whether the illness was simple depression.\n \n HOWEVER the author of the letter does not provide any example of what the subject of discussion has done that has caused her to believe he is paranoid, she sounds resentful of him being with her children and her diagnosis may be coloured by bias.\n \n Its stupid to try and label someone on the basis of a second hand report of their symptoms by a relative.\n \n \nNow Elton is upset with me because I don't want to argue with him over the phone. It was about some really unimportant matter, and when I told him I wasn't interested in a fight, he slammed the phone in my ear. I can no longer deal with the hurtful things Elton does to me, and he's been abusive like this for years.\n\n \n Relatively unimportant? To who? Does slamming a phone down constitute \"abuse\", and when we look at this hyperbole, what, to the author, constitutes \"paranoia\"?", 
   {}, 
   258098, 
   null, 
   1176290700.0
  ], 
  [
   258180, 
   null, 
   "mae", 
   "one more symptom of depression you forgot to add: hacking into other people's hotmail account.\n \n\n \n \n I will take your word for it. You must have been there.", 
   {}, 
   258098, 
   null, 
   1176316200.0
  ], 
  [
   258185, 
   null, 
   "Baron", 
   "Totasl agreement from me.\n \n The problem with definitions of mental illness is that they have only one purpose, funding.\n\n \n Could you please explain what it is you are trying to say.", 
   {}, 
   257976, 
   null, 
   1176316860.0
  ], 
  [
   258243, 
   null, 
   "huckleberry", 
   "Could you please explain what it is you are trying to say.\n\n \n \n The labels of symptoms for mental illness have one purpose only. They determine where the money to pay for the treatment comes from. Psychiatrists do not treat diagnoses. they treat symptoms. The diagnosis is only used for funding purposes. This is why the US has HIPAA, to standardize all of this stuff for medicare and medicaid etc.\n \n Huck", 
   {}, 
   258185, 
   null, 
   1176329160.0
  ], 
  [
   258253, 
   null, 
   "Master_Shake", 
   "I too agree that \"Annie\" is trivializing depression by trying to make a distinction between depression and mental illness.\n \n \n Attempting to diagnose paranoid schizophrenia from one line in a letter to an advice column is quite misguided.\n Nevermind the fact that even if you took that one line you could pull several diagnoses out of the DSM in about two minutes.", 
   {}, 
   258243, 
   null, 
   1176330420.0
  ], 
  [
   258257, 
   null, 
   "Master_Shake", 
   "Totasl agreement from me.\n \n The problem with definitions of mental illness is that they have only one purpose, funding.\n\n There is truth to what you say. Mental health professionals have to use a label from the DSM to be able to bill. Then things end up happening like this: where I work, the children that I work with have to have a diagnosis to be in the program. Most of them, in addition to other diagnoses, are given th label of generalized anxiety disorder. Many have only that diagnosis. It's used as a catch-all when a kid needs services but they don't really have a mental health diagnosis. This shows one of the problems with the DSM.\n \n But it is not entirely true. As far as the million syptoms listed in the DSM are concerned you are right for the most part. But definitions are required so that the proper treatment can be implemented.\n \n As a side note, IMO, there is far too great of a \"medicate first, ask questions later\" attitude in the world of mental health treatment. It's irresponsible as well as being harmful and disrespectful to those being served.", 
   {}, 
   257976, 
   null, 
   1176331020.0
  ], 
  [
   258299, 
   null, 
   "mae", 
   "It's also indicative of garden variety hard-core depression, imo. When you're severely depressed, it's hard to \"get help\", especially if you've tried various things in the past that have failed or been only somewhat helpful. Depression is also characterized by distorted thinking, emotional hypersensitivity and negativity. It's relatively easy to misinterpret other people's behavior and overreact under those conditions. Let's also remember that we're only hearing the letter writer's description of Elton as \"convinced that everyone is out to get him\". \n \n JL\n\n \n Depression is also characterized by distorted thinking, emotional hypersensitivity and negativity. It's relatively easy to misinterpret other people's behavior and overreact under those conditions\n \n Having come into contact with severly depressed people, I agree wholeheartedly with your statements above. I have seen 'distorted thinking' many many times and it ain't a pretty sight nor are the other symptoms especially negativity - whining and complaining all the time.\n \n Seriously this thread is enormously educational as many people (even the sufferers themselves) don't even understand how serious a mental illness this is and the impact of the symptoms.", 
   {}, 
   257954, 
   null, 
   1176346920.0
  ], 
  [
   258376, 
   null, 
   "huckleberry", 
   "Depression is also characterized by distorted thinking, emotional hypersensitivity and negativity. It's relatively easy to misinterpret other people's behavior and overreact under those conditions\n \n Having come into contact with severly depressed people, I agree wholeheartedly with your statements above. I have seen 'distorted thinking' many many times and it ain't a pretty sight nor are the other symptoms especially negativity - whining and complaining all the time.\n \n Seriously this thread is enormously educational as many people (even the sufferers themselves) don't even understand how serious a mental illness this is and the impact of the symptoms.\n\n \n I have suffered from a low level of depression. Doctors call it dysthymia. I feel sad at times.\n \n Mental illness in all its forms is far more prevalent that one would suppose. There are many on this board that I would identify as depressed given their specific posts at times. The thinking is hoplessness. I recognize it readily in others as I recognize it well in myself.\n \n Huck", 
   {}, 
   258299, 
   null, 
   1176405540.0
  ], 
  [
   258411, 
   null, 
   "mae", 
   "I have suffered from a low level of depression. Doctors call it dysthymia. I feel sad at times.\n \n Mental illness in all its forms is far more prevalent that one would suppose. There are many on this board that I would identify as depressed given their specific posts at times. The thinking is hoplessness. I recognize it readily in others as I recognize it well in myself.\n \n Huck\n\n \n \n Huck, I think it is quite brave of you to acknowledge you suffer from a kind of depression. I myself don't know too much about this subject and am learning a lot from this thread. For instance I didn't know distorted thinking was a symptom of depression till now. But I can now put the pieces of the puzzle together. Yes! you are right, there are people with depression posting in this forum and as you say, it is so obvious given their hoplessness thinking.", 
   {}, 
   258376, 
   null, 
   1176425520.0
  ], 
  [
   258438, 
   null, 
   "Winston Smith", 
   "well, ignorance about a subject has never prevented you from giving your opinion on it.\n emoticon_angry", 
   {}, 
   258411, 
   null, 
   1176454500.0
  ], 
  [
   258484, 
   null, 
   "JL...W", 
   "Having come into contact with severly depressed people, I agree wholeheartedly with your statements above. I have seen 'distorted thinking' many many times and it ain't a pretty sight nor are the other symptoms especially negativity - whining and complaining all the time.\n \n Seriously this thread is enormously educational as many people (even the sufferers themselves) don't even understand how serious a mental illness this is and the impact of the symptoms.\n\n \n Well, let's make sure we don't overstate the case. You've made some very unflattering characterizations of depressives here and in a previous posting in terms of \"selfishness, using people, manipulative, paranoia, delusional\". \n \n Many people who are depressed have symptoms that are primarily internal to them, that affect the way they go through life, and the choices they make. They are in pain, but may also be quite adept at hiding it. That's why sometimes when people commit suicide, people around them are shocked. I used to work with someone who shot himself in the chest. I didn't know him well but my impression of him was that he was an attractive, easy-to-talk-to, good-sense-of-humor kind of guy. People who knew him better were very upset. No one knew there was a problem, other than that he had been divorced. \n \n Whether someone is whiny, complaining or manipulative or even a generally pessimistic kind of person may have absolutely nothing to do with actual depression. A lot depends on a person's level of maturity and ability to be self-aware and self-inhibiting, imo. Depression may make a person feel unable to actually share a friend's joy at some good news, for instance, but that person may still manage to say something appropriately positive. Some depressives may choose to avoid interaction with people altogether because they know they are incapable of being someone people want to be around. \n \n One of the worst symptoms of depression, in my experience, and it's one that's frequently described, is the feeling that there is something like a gray curtain or glass isolating you from other people and \"life\" in all its color and vibrancy. It's a type of deadness and you simply don't feel capable of or inclined to engage. \n \n And what I meant by \"distorted thinking\" was primarily in terms of what's termed \"cognitive distortions\", http://www.healthymind.com/s-distortions.html, which are not exclusive to depression, but are undoubtedly far less automatic and habitual in \"normal\" people. \n \n JL", 
   {}, 
   258299, 
   null, 
   1176487380.0
  ], 
  [
   258492, 
   null, 
   "mae", 
   "Well, let's make sure we don't overstate the case. You've made some very unflattering characterizations of depressives here and in a previous posting in terms of \"selfishness, using people, manipulative, paranoia, delusional\". \n \n Many people who are depressed have symptoms that are primarily internal to them, that affect the way they go through life, and the choices they make. They are in pain, but may also be quite adept at hiding it. That's why sometimes when people commit suicide, people around them are shocked. I used to work with someone who shot himself in the chest. I didn't know him well but my impression of him was that he was an attractive, easy-to-talk-to, good-sense-of-humor kind of guy. People who knew him better were very upset. No one knew there was a problem, other than that he had been divorced. \n \n Whether someone is whiny, complaining or manipulative or even a generally pessimistic kind of person may have absolutely nothing to do with actual depression. A lot depends on a person's level of maturity and ability to be self-aware and self-inhibiting, imo. Depression may make a person feel unable to actually share a friend's joy at some good news, for instance, but that person may still manage to say something appropriately positive. Some depressives may choose to avoid interaction with people altogether because they know they are incapable of being someone people want to be around. \n \n One of the worst symptoms of depression, in my experience, and it's one that's frequently described, is the feeling that there is something like a gray curtain or glass isolating you from other people and \"life\" in all its color and vibrancy. It's a type of deadness and you simply don't feel capable of or inclined to engage. \n \n And what I meant by \"distorted thinking\" was primarily in terms of what's termed \"cognitive distortions\", http://www.healthymind.com/s-distortions.html, which are not exclusive to depression, but are undoubtedly far less automatic and habitual in \"normal\" people. \n \n JL\n\n \n \n That was very informative. \n \n I was speaking from my experience with severely depressed people. As it has been noted in this thread, depression occurs in varying degrees and that can mean different symptoms for the different kinds of depression\n \n My experience after coming into contact with severely depressed people is very similiar to the letter writer to Annie in respect to selfishness, paranoia, delusion, using people etc.\n \n It was an individual experience just like the letter writer's experience, and it was by no means a description of everybody who suffers from depression.", 
   {}, 
   258484, 
   null, 
   1176490140.0
  ], 
  [
   258558, 
   null, 
   "Winston Smith", 
   "well, you have to broaden your experience and meet all kinds of depressed people. Why are you so interested in this illness? Do you suffer from depression? I know you are a hacker who specializes in hacking hotmail accounts, is hacking a symptom of depression?\n Although this is a depressive subject reading your comments about it has made me laugh. You are a funny person. I wish you well with your depression, seriously get professional help.\n Maybe the cold long Canadian winter has affected you for weather may have an impact on a person's behaviour. For instance the sunny warm weather in Sydney has made us easy going, nonchalant and happy people without a care in the world. We call our country: the lucky country. Nobody calls that freezer aka Canada 'the lucky country' right?:)", 
   {
    "post_info": {
     "post_title": "poor depressed little girl"
    }
   }, 
   258492, 
   null, 
   1176514560.0
  ], 
  [
   258654, 
   null, 
   "mae", 
   "Speaking of paranoia and delusions........", 
   {}, 
   258558, 
   null, 
   1176585240.0
  ], 
  [
   258729, 
   null, 
   "Winston Smith", 
   "yes? ... lay back and tell me all about it, from the beginning ...", 
   {}, 
   258654, 
   null, 
   1176606960.0
  ], 
  [
   258732, 
   null, 
   "JPSartre12", 
   ".....\n Maybe the cold long Canadian winter has affected you for weather may have an impact on a person's behaviour. For instance the sunny warm weather in Sydney has made us easy going, nonchalant and happy people without a care in the world. We call our country: the lucky country. Nobody calls that freezer aka Canada 'the lucky country' right?:)\n\n \n For being such a \"happy Aussie\", you sure do love to take shots and criticize people. Run out of those happy pills, perhaps? :)", 
   {}, 
   258558, 
   null, 
   1176607440.0
  ], 
  [
   258784, 
   null, 
   "Ripskar", 
   "I agree that people should be encouraged to help themselves, which is one reason why I think the definition of \"mental illness\" is so important. If someone accepts a diagnosis of mental illness, does it mean freedom from counter-productive self-blame, for instance, or does it drive a person down in terms of thinking, \"Oh, I'm sick. I'm so sick\". Ditto for how others see that person.\n \n And re the letter, I'd point out that \"refuses to get help\" is the characterization of the writer. We don't really know what it means. Refusing any and all help, or help that has been tried and found not that helpful? How many drug trials and drug combos must a person try, for instance? How 'bout ECT? Is refusing ECT, refusing \"help\"?\n \n NAMI, btw, is heavily funded by Big Pharma. Also true for Mind in the U.K.?\n \n JL\n\n \n Mind is a registered Charity, funding comes from charity shops, fundraising events, legacies and Social Services.\n http://www.mind.org.uk/\n In all the yearsI've been a volunteer at a Mind Drop-in centre I've only once come across leaflets produced by a drugs company (Glaxo) and they were provided by Social Services.", 
   {}, 
   257953, 
   null, 
   1176633840.0
  ], 
  [
   259142, 
   null, 
   "mae", 
   "For being such a \"happy Aussie\", you sure do love to take shots and criticize people. Run out of those happy pills, perhaps? :)\n\n \n \n LOL\n \n Maybe the supply can't keep up with the demand.", 
   {}, 
   258732, 
   null, 
   1176833940.0
  ], 
  [
   260008, 
   null, 
   "huckleberry", 
   "well, you have to broaden your experience and meet all kinds of depressed people. Why are you so interested in this illness? Do you suffer from depression? I know you are a hacker who specializes in hacking hotmail accounts, is hacking a symptom of depression?\n Although this is a depressive subject reading your comments about it has made me laugh. You are a funny person. I wish you well with your depression, seriously get professional help.\n Maybe the cold long Canadian winter has affected you for weather may have an impact on a person's behaviour. For instance the sunny warm weather in Sydney has made us easy going, nonchalant and happy people without a care in the world. We call our country: the lucky country. Nobody calls that freezer aka Canada 'the lucky country' right?:)\n\n \n Is there a reason your so interested in hounding some folks? Are you mentally challenged yourself? Do you have problems the rest of us should know. Perhaps you should stay where you are, I am sure the fellas in the white coats will be dropping by shortly.emoticon_xangel", 
   {}, 
   258558, 
   null, 
   1177366920.0
  ], 
  [
   260188, 
   null, 
   "mae", 
   "Huck, as they say.........the truth is stranger than fiction.", 
   {}, 
   260008, 
   null, 
   1177462260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How do we define mental illness?", 
  "url": "http://www.4forums.com/political/mental-health/9740-how-do-we-define-mental-illness.html", 
  "breadcrumbs": [
   "Mental Health"
  ], 
  "id_number": 9740, 
  "discussion_files": [
   [
    "20206.html", 
    "http://www.4forums.com/political/mental-health/9740-how-do-we-define-mental-illness-print.html"
   ], 
   [
    "20207.html", 
    "http://www.4forums.com/political/mental-health/9740-how-do-we-define-mental-illness-3-print.html"
   ], 
   [
    "20208.html", 
    "http://www.4forums.com/political/mental-health/9740-how-do-we-define-mental-illness-2-print.html"
   ]
  ], 
  "identifier": 9740
 }
]