[
 [
  [
   257622, 
   null, 
   "ShadowPikachu", 
   "I am really curious what everyone else's views on birth control are. For example, do you reject all forms (condom, patch, etc)? Do you not believe day-after methods should be used? Who should they be available to, and if they are available should it be OTC or via prescription? Would you allow abortions in cases where protection fails and there is proof that protection was being used (thus a case for the woman not intending to get pregnant - for all those who have more limited views on abortions).\n \n My personal views are that all types of birth control should be freely available to anyone over the age of consent, all should be OTC. I think that we need much better sex-ed in our schools, teaching good safe-sex practices, etc.\n \n I'm curious because I know Roman Catholics tend to be against most forms of birth control, and because I know that Protestants are all over the place from allowing none to allowing all.", 
   {
    "post_info": {
     "post_title": "Birth Control"
    }
   }, 
   null, 
   null, 
   1176093300.0
  ], 
  [
   257657, 
   null, 
   "jitobear", 
   "I support all forms of birthcontrol being readily available to anyone all the time. I do believe the pill needs monitoring and a prescription though. It is a serious medication.", 
   {}, 
   257622, 
   null, 
   1176130980.0
  ], 
  [
   257722, 
   null, 
   "simone", 
   "Comprehensive sex ed and full access to contraception. It's the only way, it's God's way.", 
   {}, 
   257657, 
   null, 
   1176153960.0
  ], 
  [
   257736, 
   null, 
   "jim's trucking", 
   "Were it not for birth control, there would be thousands more abortions each year.\n \n Objections to birth control based on religious beliefs are ludicrous...expecially when those who can least afford to care for new children keep having them...in the name of religion.emoticon_xdonno", 
   {}, 
   257722, 
   null, 
   1176156720.0
  ], 
  [
   257737, 
   null, 
   "samiinh", 
   "<<<<<My personal views are that all types of birth control should be freely available to anyone over the age of consent, all should be OTC. I think that we need much better sex-ed in our schools, teaching good safe-sex practices, etc.<<<<\n \n I agree with this 100%, and I also believe that some young people should be placed on BC before the age of consent, for their own protectiion.", 
   {}, 
   257736, 
   null, 
   1176156900.0
  ], 
  [
   257745, 
   null, 
   "jim's trucking", 
   "<<<<<My personal views are that all types of birth control should be freely available to anyone over the age of consent, all should be OTC. I think that we need much better sex-ed in our schools, teaching good safe-sex practices, etc.<<<<\n \n I agree with this 100%, and I also believe that some young people should be placed on BC before the age of consent, for their own protectiion.\nAnd who would pick the 'some'? Perhaps you also believe they should be placed on Ritilin...for their own protection...because their teachers (without medical training) diagnose the infamous ADD demon in them.\n \n Not to get off topic too far, some teachers evidently have trouble recognizing the difference between students that can't seem to pay attention and themselves (the teachers) being in dire need of coming across as interesting.\n \n What makes you think teachers or parents could ever become adept at recognizing who needs to put on birth control? Shall we wait 'til one becomes pregnant? Shall we offer a survey of sexual activities?...to what age group?", 
   {}, 
   257737, 
   null, 
   1176158580.0
  ], 
  [
   257917, 
   null, 
   "Another opinion", 
   "I agree that birth control should be freely available. \n \n I also think it should be given out free of charge to those who wish it but cannot afford it - ex. teenagers and the poor - but would support such free distributions coming along with some level of \"lecturing\" on the perils of STDs, risks of pregnancy, etc.", 
   {}, 
   257745, 
   null, 
   1176221520.0
  ], 
  [
   259632, 
   null, 
   "Moonlitface", 
   "I have no objection to birth control. Actually I'm on it because I have a condtion with a hormonal imbalance. Yet I don't think giorls should take it, and then have an excuse to be able to be sexually active when they're too young. For birthcontrol (rarely) can not always be 100% affective. As all of you well know i'm sure. emoticon_zzzz", 
   {}, 
   257917, 
   null, 
   1177105140.0
  ], 
  [
   259663, 
   null, 
   "Master_Shake", 
   "I agree that birth control needs to be readily available. I also agree with Jo that there needs to be monitoring through prescription for chemical forms of birth control. They are often taken too lightly.\n Oddly enough, I also agree with Jim ;) It shouldn't be forced on anyone.\n \n And we need consistent, comprehensive sex-ed.", 
   {}, 
   259632, 
   null, 
   1177113540.0
  ], 
  [
   259782, 
   null, 
   "paw_x", 
   "Oddly enough, I also agree with Jim ;) It shouldn't be forced on anyone.\n\n \n Would you still believe that in cases of heroin addicts, with three kids they already struggle to look after?", 
   {}, 
   259663, 
   null, 
   1177186440.0
  ], 
  [
   259882, 
   null, 
   "Master_Shake", 
   "Would you still believe that in cases of heroin addicts, with three kids they already struggle to look after?\n\n Interesting question coming from someone who is avidly pro-choice. If abortion rights are about a woman's control over her body, than the same thinking applies here.", 
   {}, 
   259782, 
   null, 
   1177283760.0
  ], 
  [
   259884, 
   null, 
   "jitobear", 
   "Interesting question coming from someone who is avidly pro-choice. If abortion rights are about a woman's control over her body, than the same thinking applies here.\n\n \n I agree with you. But I still want to knock said individuals upside the head. (I also would like to do this with many who are purposely and repeatably irresponsible.)", 
   {}, 
   259882, 
   null, 
   1177284360.0
  ], 
  [
   259888, 
   null, 
   "Bassman", 
   "OK here's where I stand on this: As long as the method is contraceptive in nature (not allowing sperm and egg to unite) then I support birth control. Otherwise, methods such as the IUD, etc. are considered abortive in nature. As to sex ed, as long as abstinence is taught not just as a side note, but the central topic.", 
   {}, 
   259884, 
   null, 
   1177285080.0
  ], 
  [
   259945, 
   null, 
   "jitobear", 
   "OK here's where I stand on this: As long as the method is contraceptive in nature (not allowing sperm and egg to unite) then I support birth control. Otherwise, methods such as the IUD, etc. are considered abortive in nature. As to sex ed, as long as abstinence is taught not just as a side note, but the central topic.\n\n \n No method should be a side note in sex ed. None should be the central topic either. Just teach the facts. And those facts should include that sex requires maturity and that abstinence os the only method that is 100% effective.\n \n I agree with any and all birth control. I think IUDs are nasty. Do people even use them anymore?", 
   {}, 
   259888, 
   null, 
   1177334640.0
  ], 
  [
   259952, 
   null, 
   "Master_Shake", 
   "I agree with you. But I still want to knock said individuals upside the head. (I also would like to do this with many who are purposely and repeatably irresponsible.)\n\n Yeah, I'm a bit torn on this issue personally.", 
   {}, 
   259884, 
   null, 
   1177343760.0
  ], 
  [
   259956, 
   null, 
   "Another opinion", 
   "OK here's where I stand on this: As long as the method is contraceptive in nature (not allowing sperm and egg to unite) then I support birth control. Otherwise, methods such as the IUD, etc. are considered abortive in nature. As to sex ed, as long as abstinence is taught not just as a side note, but the central topic.\n\n Abstinence certainly is the most effective method and it should be presented as such. However, teens are influenced by the media (TV, movies) and each other that sex is fun and cool. If you concentrate on teaching abstinence in sex education class then you will most likely have the majority of students rolling their eyes or smirking during the class - i.e. not taking it seriously. If you can convince them to be abstinent, great. I think the only way to do that is to give them the impression that one can be a virgin and still be cool - opposite to the message that they mostly get from the media. \n \n Either way, you have to face the reality that the majority of teenagers will have sex anyway and sex education needs to prepare them by showing them how to do so responsibly, and convincing them to be responsible by explaining all the risks in a way that will catch their attention. I think that they need to have graphic presentations or descriptions of the problems associated with sexually transmitted diseases so that they get scared enough to seriously think about being responsible about sex. This apparently works well for bad student drivers - i.e. show them how nasty accidents can be.", 
   {}, 
   259888, 
   null, 
   1177345560.0
  ], 
  [
   259958, 
   null, 
   "jyoshu", 
   "Abstinence certainly is the most effective method and it should be presented as such. However, teens are influenced by the media (TV, movies) and each other that sex is fun and cool. If you concentrate on teaching abstinence in sex education class then you will most likely have the majority of students rolling their eyes or smirking during the class - i.e. not taking it seriously. If you can convince them to be abstinent, great. I think the only way to do that is to give them the impression that one can be a virgin and still be cool - opposite to the message that they mostly get from the media. \n\n \n What if they roll their eyes and smirk at condom teaching? Would it change your view that you should teach or focus on protection? To use another analogy, if you're teaching driver's ed and they roll their eyes smirk at you teaching them not to drive at excessive speeds or run traffic lights, does that mean you teach them to try and use excessive speed in a more safe and controlled way??? I have no problem with tailoring teaching to appeal to kids, but not to the point where you lose your message. If your concern over eye rolling and smirks involves not using abstinence-focused ed, then I strongly disagree.", 
   {}, 
   259956, 
   null, 
   1177348320.0
  ], 
  [
   259960, 
   null, 
   "Another opinion", 
   "What if they roll their eyes and smirk at condom teaching? Would it change your view that you should teach or focus on protection? To use another analogy, if you're teaching driver's ed and they roll their eyes smirk at you teaching them not to drive at excessive speeds or run traffic lights, does that mean you teach them to try and use excessive speed in a more safe and controlled way??? I have no problem with tailoring teaching to appeal to kids, but not to the point where you lose your message. If your concern over eye rolling and smirks involves not using abstinence-focused ed, then I strongly disagree.\n\n What do teens care about and what will convince them? They care about being cool, having fun. Some care about being responsible. They might care about safe sex if you scare them into caring by showing the risks of STDs, etc. However, even if you do convince teens that they need to be responsible, teens know that there are options to safe sex other than abstinence.\n \n The difference between abstinence and safe sex via contraceptives is:\n \n 1) Abstinence is 100% effective vs contraceptives being ~99% effective. With contraceptives being almost completely effective, the advantage of abstinence is not that great. If they double up on contraceptives, then the risk goes down even more.\n \n 2) The moral issue. Those who advocate abstinence tend to preach that sex before marriage is immoral. This is where the eye-rolling and smirking comes in. Nearly everything they see in the media (TV, movies) is telling them otherwise. It is a hard sell. Go ahead and try - especially if you can somehow sell the concept of virginity being cool. I doubt you will be able to convince the majority of teenagers unless you change the images they get from TV and movies.\n \n I would personally also prefer to see more abstinence in teenagers and I think that a lot of the sex that does happen occurs because young girls feel pressured into having sex. If you can teach abstinence while avoiding moralizing, then you might be more effective. Either way, you have to face the fact that most of their external influences (the media, etc.) are teaching the opposite message in a much more exciting way. So, you will still have large numbers of teens having sex and it is the responsibility of sex education class to prepare them.", 
   {}, 
   259958, 
   null, 
   1177350120.0
  ], 
  [
   259962, 
   null, 
   "ShadowPikachu", 
   "OK here's where I stand on this: As long as the method is contraceptive in nature (not allowing sperm and egg to unite) then I support birth control. Otherwise, methods such as the IUD, etc. are considered abortive in nature. As to sex ed, as long as abstinence is taught not just as a side note, but the central topic.\n\n \n That seems a little.... hypocritical to me. I'd agree that absinence should be taught, but not as the central topic (and not as a side note either - I see it as hypocritial becasue you want it to not be a side nore, but then would push the others to being a side note, but that's just me).\n \n Abstinence should be taught equally as much as the rest of the birth-control education, not given special footing.", 
   {}, 
   259888, 
   null, 
   1177350780.0
  ], 
  [
   259965, 
   null, 
   "jyoshu", 
   "What do teens care about and what will convince them? They care about being cool, having fun. Some care about being responsible. They might care about safe sex if you scare them into caring by showing the risks of STDs, etc. However, even if you do convince teens that they need to be responsible, teens know that there are options to safe sex other than abstinence.\n \n The difference between abstinence and safe sex via contraceptives is:\n \n 1) Abstinence is 100% effective vs contraceptives being ~99% effective. With contraceptives being almost completely effective, the advantage of abstinence is not that great. If they double up on contraceptives, then the risk goes down even more.\n\n \n Agreed, though effectiveness, in BOTH cases, involves willingness to use. Protection isn't effective if forgotten, and abstinence isn't effective if forgotten.\n \n One thing that I think is important is that the issue is often portrayed as abstinence-VERSUS-contraceptives. I don't like that framing of the issue; that should not be the debate, IMO--I think abstinence should be promoted as the standard, and contraception as the safety net. They are BOTH part of responsible behavior rather than two behaviors juxtaposed toward one another.\n \n \n2) The moral issue. Those who advocate abstinence tend to preach that sex before marriage is immoral. This is where the eye-rolling and smirking comes in. Nearly everything they see in the media (TV, movies) is telling them otherwise. It is a hard sell. Go ahead and try - especially if you can somehow sell the concept of virginity being cool. I doubt you will be able to convince the majority of teenagers unless you change the images they get from TV and movies.\n\n \n Interesting that you see it that way, because I have never considered abstinence so much a moral issue as a pragmatic one. And if there is morality in that, it is because it avoids harm being done to someone, so in that sense, yes it's moral. The reason marriage is used as a point of allowance in our culture is that hopefully it serves as a sort of context of monogamous commitment to someone--and monogamy is the safest way to conduct a sexual lifestyle. So it's not like marriage is just some arbitrary moment where sex should be allowed. There's an important rhyme to the reason. \n \n I guess I have some problems with you apparent view that, if someone rolls their eyes at something, that means we should automatically change the message. Emphasis on self-control (my preferred term to abstinence) shouldn't be compromised just because some kids think it's silly, that's why I used the analogies I did to show you other situations where that's the case.\n \n \nEither way, you have to face the fact that most of their external influences (the media, etc.) are teaching the opposite message in a much more exciting way. So, you will still have large numbers of teens having sex and it is the responsibility of sex education class to prepare them.\n\n \n Yes, and unfortunately our culture is working against protecting kids. It champions promiscuity and then expects education to somehow take up the slack. That is why conservatives often work toward trying to keep our culture from going too far. Culture needs to be changed before there will any REAL protection for our kids.", 
   {}, 
   259960, 
   null, 
   1177351500.0
  ], 
  [
   259968, 
   null, 
   "Another opinion", 
   "Agreed, though effectiveness, in BOTH cases, involves willingness to use. Protection isn't effective if forgotten, and abstinence isn't effective if forgotten.\n \n One thing that I think is important is that the issue is often portrayed as abstinence-VERSUS-contraceptives. I don't like that framing of the issue; that should not be the debate, IMO--I think abstinence should be promoted as the standard, and contraception as the safety net. They are BOTH part of responsible behavior rather than two behaviors juxtaposed toward one another.\n\n I agree that both should be taught but we disagree as to which should be stressed. I fear that, if you concentrate on the abstinence message, then you will quickly loose the attention of the teenagers and will not only have limited effectiveness in teaching abstinence but you will not as effectively impart the teaching of safe sex via contraceptives. \n \nInteresting that you see it that way, because I have never considered abstinence so much a moral issue as a pragmatic one. And if there is morality in that, it is because it avoids harm being done to someone, so in that sense, yes it's moral. The reason marriage is used as a point of allowance in our culture is that hopefully it serves as a sort of context of monogamous commitment to someone--and monogamy is the safest way to conduct a sexual lifestyle. So it's not like marriage is just some arbitrary moment where sex should be allowed. There's an important rhyme to the reason.\n\n Well, you are arguing mainly for sex in a committed relationship. Saying that it has to happen in marriage is just saying that the relationship has to have state / church sanction. I think that it would be easier to convince girls that a committed relationship is important than it would be to convince boys, since I think there is still a bit of macho culture abounding that suggests that promiscuous boys are cool. I would certainly support any efforts to convince girls that they don't have to have sex if they don't want to. Girls are sexualized earlier and earlier in this culture. I think it is partially a self esteem issue and empowering girls to stand up for themselves could only be a good thing.\n \nI guess I have some problems with you apparent view that, if someone rolls their eyes at something, that means we should automatically change the message. Emphasis on self-control (my preferred term to abstinence) shouldn't be compromised just because some kids think it's silly, that's why I used the analogies I did to show you other situations where that's the case.\n\n The hard part is convincing teenagers to be responsible to begin with, and I am all for that. I think that is the main goal - for teenagers not to have irresponsible sex. I simply think it would be harder to convince them if you concentrate on the abstinence message (which has a much smaller probability of success) than if you concentrate on the contraceptive method (which has a much higher probability of success). \n \n Actually, perhaps our goals in sex education would be different. Is your main goal that of reducing irresponsible teen sex or do you have another main goal?", 
   {}, 
   259965, 
   null, 
   1177352520.0
  ], 
  [
   259973, 
   null, 
   "jyoshu", 
   "Well, you are arguing mainly for sex in a committed relationship. Saying that it has to happen in marriage is just saying that the relationship has to have state / church sanction. \n\n \n A truly committed relationship toward monogamy IS going to be marriage. I don't like the idea of drawing a distinction between the two. A monogamy commitment between two people that doesn't have state sanction is sometimes called a \"common law marriage.\" (Some states even recognize these.) There's nothing magical about state sanction; it's the commitment that makes it a marriage. (that's why gays who have entered into a commitment call themselves married even though the state doesn't recognize it in most cases.) I also don't see that there has to be a church thing there either for it to be a marriage (although I certainly think it's better).\n \n \nThe hard part is convincing teenagers to be responsible to begin with, and I am all for that. I think that is the main goal - for teenagers not to have irresponsible sex. I simply think it would be harder to convince them if you concentrate on the abstinence message (which has a much smaller probability of success) than if you concentrate on the contraceptive method (which has a much higher probability of success). \n\n \n When you say self-control has a smaller prob. of success, what do you mean? Because we don't really know if contraceptive teaching is working better. Are kids really using condoms enough? I don't think they are. So I'm not so sure we can say that contraceptive method has a much higher prob. of success. And as you pointed out earlier, if we're comparing effectiveness, then self-control wins, period.\n \n \nActually, perhaps our goals in sex education would be different. Is your main goal that of reducing irresponsible teen sex or do you have another main goal?\n\n \n Well, yes, I guess that's my goal. But for the purpose of protecting kids from the various problems that a non-committed sexual lifestyle can cause.", 
   {}, 
   259968, 
   null, 
   1177354020.0
  ], 
  [
   259980, 
   null, 
   "Another opinion", 
   "A truly committed relationship toward monogamy IS going to be marriage. I don't like the idea of drawing a distinction between the two. A monogamy commitment between two people that doesn't have state sanction is sometimes called a \"common law marriage.\" (Some states even recognize these.) There's nothing magical about state sanction; it's the commitment that makes it a marriage. (that's why gays who have entered into a commitment call themselves married even though the state doesn't recognize it in most cases.) I also don't see that there has to be a church thing there either for it to be a marriage (although I certainly think it's better).\n\n I would agree that sex in a truly committed relationship is best - where we seem to agree that one does not have to be officially married to be in a truly committed relationship. On a related note, I think people don't put enough effort into working out the problems of a relationship nowadays and too many relationships (including marriage) break up for minor reasons. That said, many relationships that start off with good intentions simply break up because people change and become incompatable. \n \n Nevertheless, I don't think sex needs to only be restricted to long-term committed relationships. Some people simply want to have sex for the pleasure of it. If they are not hurting anyone (for ex. deceiving their partner about their intentions) and if they are acting responsibly (with protection from STDs and pregnancy), then what is so wrong with that? I personally think that sex should go along with emotional attachment but not everyone views the emotional part of sex as important.\n \nWhen you say self-control has a smaller prob. of success, what do you mean? Because we don't really know if contraceptive teaching is working better. Are kids really using condoms enough? I don't think they are. So I'm not so sure we can say that contraceptive method has a much higher prob. of success. And as you pointed out earlier, if we're comparing effectiveness, then self-control wins, period.\n\n I didn't say that self-control has a small probability of success. I said that self-control to the point of abstinence has a low probability of success because it doesn't have a strong selling point for most teenagers. A successful sex education class can convince them to care about STDs and pregnancy risks, but they have the option of using contraceptives and still having their sexual fun. I should also note that responsible use of contraception also requires self-control. As for relationships, many teenagers in the pangs of their first love do view their relationship as being important and sex in that relationship as being important. \n \n What would your main selling points be on the advantages of abstinence over contraceptive use in safe sex? I just don't see a strong selling point.", 
   {}, 
   259973, 
   null, 
   1177355880.0
  ], 
  [
   259984, 
   null, 
   "paw_x", 
   "Interesting question coming from someone who is avidly pro-choice. If abortion rights are about a woman's control over her body, than the same thinking applies here.\n\n \n Didn't actually think about it in that way. Though I would maintain that someone who is obviously unable to look after their existing kids, and having had several previous pregnancies and children and continued using drugs, shouldn't have the same rights over their own body when it comes to the choice of bringing a child into the world, as those who don't have the same risk factors to a child.", 
   {}, 
   259882, 
   null, 
   1177357440.0
  ], 
  [
   259985, 
   null, 
   "jyoshu", 
   "Nevertheless, I don't think sex needs to only be restricted to long-term committed relationships. Some people simply want to have sex for the pleasure of it. If they are not hurting anyone (for ex. deceiving their partner about their intentions) and if they are acting responsibly (with protection from STDs and pregnancy), then what is so wrong with that? I personally think that sex should go along with emotional attachment but not everyone views the emotional part of sex as important.\n\n \n Because the idea that a couple who is going to have sex with ea other, in the heat of the moment, is always going to properly use protection and never have that time where they get carried away without protection is being unrealistic IMO. Then there's the STD risk, and then there's the pregnancy risk. And then there's the 1% that you pointed out earlier that could go wrong with contraception--and if someone is very promiscuous, hitting that 1% is not out of the question. It's also a matter of lifestyle. What you are describing could also be a promiscuous lifestyle (though not in all cases) and promiscuity is just not a good thing.\n \n \nI didn't say that self-control has a small probability of success. I said that self-control to the point of abstinence has a low probability of success because it doesn't have a strong selling point for most teenagers. \n \n \n I use \"self-control\" instead of abstinence, because that's what it's really about. I think \"abstinence\" has gotten a bad rap (largely due to it's opponents) and perhaps it would be good if different terminology were used. You say \"self-control to the point of abstinence\" but I'd argue that not using abstinence is not exercising self-control regardless. \n \n I agree that self-control doesn't have a strong selling point, but this needs to be changed. The culture needs to be changed.\n \n \nWhat would your main selling points be on the advantages of abstinence over contraceptive use in safe sex? I just don't see a strong selling point.\n\n \n Again, you're doing this as an either-or scenario, and I think that's the wrong approach to begin with. Self-control needs to be fostered early on, and it should be a focus. It shouldn't be approached from the standpoint of selling it--for instance they don't sell the idea of not driving at excessive speeds in driver's ed. It's expected. Now, chances are, most kids at some point drive at excessive speeds. After all, kids are kids. But we still expect them not to do it and teach them emphatically not to drive at a high rate of speed or run traffic lights. It should be default. Your approach is like a driver's ed teacher saying \"they're going to speed anyway so let's not emphasize driving under the speed limit.\" \n \n It just occured to me that we have gotten pretty far off-topic here, as this is the abortion forum. Perhaps we should move this to a different forum.", 
   {}, 
   259980, 
   null, 
   1177357500.0
  ], 
  [
   259990, 
   null, 
   "Another opinion", 
   "Because the idea that a couple who is going to have sex with ea other, in the heat of the moment, is always going to properly use protection and never have that time where they get carried away without protection is being unrealistic IMO. Then there's the STD risk, and then there's the pregnancy risk. And then there's the 1% that you pointed out earlier that could go wrong with contraception--and if someone is very promiscuous, hitting that 1% is not out of the question. It's also a matter of lifestyle. What you are describing could also be a promiscuous lifestyle (though not in all cases) and promiscuity is just not a good thing.\n\n Where STDs are concerned, getting STDs in not much worse if one is in a committed relationship vs having casual sex. Either way, the person getting the STD will suffer and, if he/she is responsible, will take precautions to not pass it on to their sexual partner.\n \n Where pregnancy is concerned, if the couple is in a committed relationship, then a better structure is in place to take care of the baby if they decide to keep it. I don't view abortion in the first trimester as too immoral an option as you do, so this issue isn't of as great a concern for me as it might be for you, since I see a choice of not keeping a pregnancy if one is not in a committed relationship as also a reasonable choice.\n \nI use \"self-control\" instead of abstinence, because that's what it's really about. I think \"abstinence\" has gotten a bad rap (largely due to it's opponents) and perhaps it would be good if different terminology were used. You say \"self-control to the point of abstinence\" but I'd argue that not using abstinence is not exercising self-control regardless. \n\n But you seem to ignore the fact that safe sexual practices also require self-control and show responsibility on the part of the teen. Abstinence is not the only use of self-control so to say that \"self-control\" means \"abstinence\" is misleading.\n \nI agree that self-control doesn't have a strong selling point, but this needs to be changed. The culture needs to be changed.\n\n How would you change the culture. What is your ultimate goal and why?\n \nAgain, you're doing this as an either-or scenario, and I think that's the wrong approach to begin with. Self-control needs to be fostered early on, and it should be a focus. It shouldn't be approached from the standpoint of selling it--for instance they don't sell the idea of not driving at excessive speeds in driver's ed. It's expected. Now, chances are, most kids at some point drive at excessive speeds. After all, kids are kids. But we still expect them not to do it and teach them emphatically not to drive at a high rate of speed or run traffic lights. It should be default. Your approach is like a driver's ed teacher saying \"they're going to speed anyway so let's not emphasize driving under the speed limit.\" \n\n You need to give them reasons why they should change their behavior. Where driving is concerned, the reasons for not speeding or driving eradically include:\n 1. They could get caught by the police, get a fine, possibly get their drivers license taken away or even get arrested.\n 2. They could get in an accident - potentially causing not only harm to their own car, but to themselves and to others.\n \n Those are strong selling points - especially if you back them up with details and graphic images.\n \n I think there are strong selling points on being responsible about sex (which, I think, is the main goal) but the selling points for choosing abstinence over responsible sex are much weaker. If you don't have good reasons for recommending abstinence over responsible sex, then that suggests that abstinence should not be the main method stressed.\n \n I know this is somewhat off topic, but it does pertain to the most effective way of keeping teens from getting unwanted pregnancies. Proper sex education would help in reducing abortions because it would reduce the number of unwanted pregnancies.", 
   {}, 
   259985, 
   null, 
   1177359120.0
  ], 
  [
   259994, 
   null, 
   "jyoshu", 
   "Where STDs are concerned, getting STDs in not much worse if one is in a committed relationship vs having casual sex. \n\n \n I don't agree. A committed relationship involves knowing the other person, their issues, history, etc. You're going to have a better chance of knowing if the other person has an STD already. Casual sex is a crapshoot. You know little about the person, more than likely. Heck, there are even people out there who intentionally try to spread their STDs.\n \n \nBut you seem to ignore the fact that safe sexual practices also require self-control and show responsibility on the part of the teen. Abstinence is not the only use of self-control so to say that \"self-control\" means \"abstinence\" is misleading.\n\n \n With all due respect, if we've reduced the idea of \"self-control\" to little more than quickly putting on a condom, it's no wonder promiscuity is so commonplace. Sure, I guess you could call that \"self-control\" but I think that's pushing it. Nevertheless, I'm going to continue using the term in place of \"abstinence\" because of the connotations that \"abstinence\" carries these days. If you have another suggestion for a term, I welcome your ideas.\n \n \nHow would you change the culture. What is your ultimate goal and why?\n\n \n I told you, my ultimate goal is to protect kids. How I'd change the culture is promote sound values like self-value, self-control, the importance of commitment and sticking to it, etc. All this is related. I believe that kids' values are being influenced very early on. And then there's the issue of the saturation of our market economy with sexual messages and visuals. I'd love to see more effort toward convincing companies to clean up their advertising. Maybe even with incentives, if necessary. \n \n \nYou need to give them reasons why they should change their behavior. Where driving is concerned, the reasons for not speeding or driving eradically include:\n 1. They could get caught by the police, get a fine, possibly get their drivers license taken away or even get arrested.\n 2. They could get in an accident - potentially causing not only harm to their own car, but to themselves and to others.\n \n Those are strong selling points - especially if you back them up with details and graphic images.\n \n I think there are strong selling points on being responsible about sex (which, I think, is the main goal) but the selling points for choosing abstinence over responsible sex are much weaker. \n\n \n That's like saying we should just offer an alternative to not speeding called \"controlled speeding,\" or learning to speed in a safe way. No, I don't think the selling points on protection are better than self-control--I think the problem is that self-control just doesn't have enough people pushing it. Think about it-- using protection means putting your life in the hands of a layer of latex, all for a cheap temporary thrill. There's that 1% chance of failure, and if you're the girl you're essentially trusting the guy completely if you let him use his own protection. \n \n \nIf you don't have good reasons for recommending abstinence over responsible sex, then that suggests that abstinence should not be the main method stressed.\n\n \n Again, for the 3rd time, you're pitting abstinence against safe-sex. This is a false dichotomy; BOTH can be taught. Both SHOULD be taught. I just think abstinence should be taught up front along with safe-sex as a safety net, because it sets a standard and if you only teach safe-sex or just put abstinence on as an afterthought, you run the risk of giving the idea that promiscuity is a normal and healthy way of life. It's not. It's a risky way of life. \n \n That way you have it covered. They know abstinence is best, but you've given then the knowledge and information they need for safe-sex too if they give in or intend not to exercise self-control.", 
   {}, 
   259990, 
   null, 
   1177361640.0
  ], 
  [
   259995, 
   null, 
   "ShadowPikachu", 
   "Because the idea that a couple who is going to have sex with ea other, in the heat of the moment, is always going to properly use protection and never have that time where they get carried away without protection is being unrealistic IMO.\n\n \n Because the idea that a couple who is going to have sex with each other, in the heat of the moment, is always going to decide to be abstinent and never have that time where they get carried away without deciding to be abstinent is being unrealistic IMO. ;)", 
   {}, 
   259985, 
   null, 
   1177362060.0
  ], 
  [
   259996, 
   null, 
   "jyoshu", 
   "Because the idea that a couple who is going to have sex with each other, in the heat of the moment, is always going to decide to be abstinent and never have that time where they get carried away without deciding to be abstinent is being unrealistic IMO. ;)\n\n \n That's why you need teaching about both. But the good thing about teaching abstinence is that it sets a higher bar than just \"do it, but do it safely\". It teaches that not doing is even more safe.", 
   {}, 
   259995, 
   null, 
   1177362600.0
  ], 
  [
   259997, 
   null, 
   "ShadowPikachu", 
   "That's why you need teaching about both. But the good thing about teaching abstinence is that it sets a higher bar than just \"do it, but do it safely\". It teaches that not doing is even more safe.\n\n \n Agreed. Both should be taught. However, one should not be the main focus, they should both have equal focus in the classroom.", 
   {}, 
   259996, 
   null, 
   1177363140.0
  ], 
  [
   259998, 
   null, 
   "Another opinion", 
   "I don't agree. A committed relationship involves knowing the other person, their issues, history, etc. You're going to have a better chance of knowing if the other person has an STD already. Casual sex is a crapshoot. You know little about the person, more than likely. Heck, there are even people out there who intentionally try to spread their STDs.\n\n The people out there who are purposely spreading STDs are rare. Either way, I agree with you that sex in a committed relationship is generally safer where STDs are concerned than sex outside a committed relationship. I think the consequences if one does get STDs are not that different but the original risk is smaller. How much smaller? That depends on how one practices the safe sex. I don't have the numbers, but if one practices sex responsibly, I think the risk of catching STDs is quite small. It may be higher for people who are truly promiscuous (lots of sex partners each year) but most people are not nearly that promiscuous.\n \nWith all due respect, if we've reduced the idea of \"self-control\" to little more than quickly putting on a condom, it's no wonder promiscuity is so commonplace. Sure, I guess you could call that \"self-control\" but I think that's pushing it. Nevertheless, I'm going to continue using the term in place of \"abstinence\" because of the connotations that \"abstinence\" carries these days. If you have another suggestion for a term, I welcome your ideas.\n\n What connotations does \"abstinence\" carry, in your view, that you disagree with? \n \n Either way, I think \"self-control\" applies to any responsible behavior on the teenagers part. Of course, abstinence requires more self control but the self control needed to put on a condom or take contraception would go a long way toward reducing unwanted teenage pregnancies and abortions. I think that is a worthy goal.\n \nI told you, my ultimate goal is to protect kids. How I'd change the culture is promote sound values like self-value, self-control, the importance of commitment and sticking to it, etc. All this is related. I believe that kids' values are being influenced very early on. And then there's the issue of the saturation of our market economy with sexual messages and visuals. I'd love to see more effort toward convincing companies to clean up their advertising. Maybe even with incentives, if necessary. \n\n I would agree with most of that. Kids are influenced by media to grow up too quickly here. You even see ten year old girls dressing provocatively nowadays. What ever happened to innocent childhood? I agree that reducing sexual images will help. However, at some point, hormones really do kick in and effect teen's social tendencies toward sex. You have to prepare them with the proper tools to face that.\n \nThat's like saying we should just offer an alternative to not speeding called \"controlled speeding,\" or learning to speed in a safe way. \n\n I should note that in reality we have that. Nearly everyone speeds, but they are controlled by a combination of their fear of getting caught (where the rule of thumb, even as stated by police, is that going up to 10mph above is ok) and their own driving abilities in a wide range of weather, traffic, road and car conditions.\n \nNo, I don't think the selling points on protection are better than self-control--I think the problem is that self-control just doesn't have enough people pushing it. Think about it-- using protection means putting your life in the hands of a layer of latex, all for a cheap temporary thrill. There's that 1% chance of failure, and if you're the girl you're essentially trusting the guy completely if you let him use his own protection. \n\n If you double up on protection, then the risk goes much farther down. Yes, there is a small risk no matter what contraceptive you use. Most teens are willing to take that risk for the thrill of sex. You are trying to convince them that the slight increase in safety is worth their huge sacrifice of not having sex. That is not an arguement that will convince a lot of teens. What other arguements do you have?\n \nAgain, for the 3rd time, you're pitting abstinence against safe-sex. This is a false dichotomy; BOTH can be taught. Both SHOULD be taught. I just think abstinence should be taught up front along with safe-sex as a safety net, because it sets a standard and if you only teach safe-sex or just put abstinence on as an afterthought, you run the risk of giving the idea that promiscuity is a normal and healthy way of life. It's not. It's a risky way of life.\n\n Once again, I am not saying that only one should be taught. I agree with you that both should be taught. However, I would concentrate on teaching about contraception, while also noting the benefits of abstinence - for you, it would be the other way around. As for promiscuity being a risky way of life, yes it is but it depends both on the degree of promiscuity and on the precautions (in contraception) used during sex. Perhaps I'm wrong, but I think that most teens who have sex are not having sex with a wide range of partners - just one, perhaps another the next year, etc.\n \n I would rather have a greater chance of reducing unwanted teen pregnancies by accepting the reality and teaching them to have sex responsibly than by trying to change their reality (which is much harder to do and has a high risk of failure). \n \nThat way you have it covered. They know abstinence is best, but you've given then the knowledge and information they need for safe-sex too if they give in or intend not to exercise self-control.\n\n Agreed. We BOTH agree that both safe-sex and abstinence should be taught. However, teens have a minimal attention span. I am worried that if you concentrate more on abstinence, then you will loose too much of the teenage audience and they won't even be listening any more to the contraceptive part.", 
   {}, 
   259994, 
   null, 
   1177364580.0
  ], 
  [
   260002, 
   null, 
   "Master_Shake", 
   "Didn't actually think about it in that way. Though I would maintain that someone who is obviously unable to look after their existing kids, and having had several previous pregnancies and children and continued using drugs, shouldn't have the same rights over their own body when it comes to the choice of bringing a child into the world, as those who don't have the same risk factors to a child.\n\n What are the standards for determining who has a right over their own bodies then and who gets to determine them?", 
   {}, 
   259984, 
   null, 
   1177365780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Birth Control", 
  "url": "http://www.4forums.com/political/abortion-debates/9742-birth-control.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9742, 
  "discussion_files": [
   [
    "3732.html", 
    "http://www.4forums.com/political/abortion-debates/9742-birth-control-print.html"
   ], 
   [
    "3733.html", 
    "http://www.4forums.com/political/abortion-debates/9742-birth-control-3-print.html"
   ], 
   [
    "3734.html", 
    "http://www.4forums.com/political/abortion-debates/9742-birth-control-2-print.html"
   ]
  ], 
  "identifier": 9742
 }
]