[
 [
  [
   257696, 
   null, 
   "Steeeeve", 
   "This is worse than the Strom Thurman 100th birthday saga.\n \n http://www.foxnews.com/story/0,2933,264946,00.html\n \n \nThat's some nappy-headed hos there, I'm going to tell you that\n\n \n This is referring to the Rutgers womans basketball team. \n \n The full, relevant, portion is as follows:\n \n \n\"That's some rough girls from Rutgers,\" Imus said. \"Man, they got tattoos...\"\n \n \"Some hardcore hos,\" McGuirk said.\n \n \"That's some nappy-headed hos there, I'm going to tell you that,\" Imus said.\n\n \n I'm not exactly sure how you make this the most racist comment of the year but Al Sharpton did. Honestly, I'm not offended by it and it actually was kinda funny (the first part). The Rutgers team does look a lot meaner and tougher than the Tenn team. \n \n Honestly, if you get offended by something so trivial then perhaps you should just go into your house, lock the doors, and never listen to anyone again.\n \n Some got offended, he said he was sorry...get over it. emoticon_mad", 
   {
    "post_info": {
     "post_title": "Imus Comments Not That Bad"
    }
   }, 
   null, 
   null, 
   1176151680.0
  ], 
  [
   257703, 
   null, 
   "Phyllis", 
   "If this comment is about race, then observe this. If the majority of the Rutgers team were white and the comment was made, then that, too, would be a racist remark would it not? Do you think Mr. Sharpton would be so up in arms if the Rutgers team was mostly white? No, he would not. Why, because Sharpton has no principles. Therefore, this comment was not about race, and Sharpton is simply an idiot.\n \n The comment was offensive, not because it was a racist comment (as I've said, I just can't see how it is), but because what Imus said was a very disrespectful thing to say about another human being regardless of their race, even if it is in a joking context. That is an offense that stems from principle.", 
   {}, 
   257696, 
   null, 
   1176152940.0
  ], 
  [
   257710, 
   null, 
   "Steeeeve", 
   "If this comment is about race, then observe this. If the majority of the Rutgers team were white and the comment was made, then that, too, would be a racist remark would it not? Do you think Mr. Sharpton would be so up in arms if the Rutgers team was mostly white? No, he would not. Why, because Sharpton has no principles. Therefore, this comment was not about race, and Sharpton is simply an idiot.\n \n The comment was offensive, not because it was a racist comment (as I've said, I just can't see how it is), but because what Imus said was a very disrespectful thing to say about another human being regardless of their race, even if it is in a joking context. That is an offense that stems from principle.\n\n \n I don't even think it was that offensive. I'd be willing to bet that of the thousands of people that heard that live 99% of them probably didn't think twice about it. \n \n It is certainly no more offensive then saying the Florida State football team all came from jail (as an example)....its a just a funny comment to poke fun of the fact that a lot of FSU players have gone to jail.", 
   {}, 
   257703, 
   null, 
   1176153360.0
  ], 
  [
   257751, 
   null, 
   "jim's trucking", 
   "Al Sharpton is an attention whore. Had The Right Reverend Al Charlaton been at an Eddie Murphy concert and heard Eddie say the same thing, he would have laughed his black XXX off!\n \n ...and don't tell me it's racist to say that Al has a black XXX!\n \n ...and I'm not surprised that the racist's racist, the questionably honorable Jesse 'it's okay for me to have a mistress' Jackson is looking for active camera lenses also. What a frickin' race pimp!", 
   {}, 
   257710, 
   null, 
   1176159780.0
  ], 
  [
   257817, 
   null, 
   "Zardoz", 
   "Well, apparently I learn somethng new.\n \n Was just going to report on how 1) I don't like Imus, even when I'm paid to watch his show. and 2) I can recite a non stop litany of derogatory terms against neary every type of person without repeating but never heard that term used to denote racial issues...\n \n Well, my wife just instructed me that 'nappy' originally refered to a black persons hair 'way back when'. Now, it's said about everyone with nasty hair.\n \n Personally, I'd say Imus was refering to the over all trashy/ unkept appearance of the 'womens' basketball team. Calling them 'Hos is far more sexist than saying nappy is racist. \n Now, where's NOW to put that race whore Sharpton in his place for jumping the gun with racism on a sexist issue!", 
   {}, 
   257751, 
   null, 
   1176170520.0
  ], 
  [
   257819, 
   null, 
   "snakespit", 
   "If this comment is about race, then observe this. If the majority of the Rutgers team were white and the comment was made, then that, too, would be a racist remark would it not? Do you think Mr. Sharpton would be so up in arms if the Rutgers team was mostly white? No, he would not. Why, because Sharpton has no principles. Therefore, this comment was not about race, and Sharpton is simply an idiot.\n\n \n What? I have never heard the term \"nappy headed\" when referring to anyone other than blacks. The majority of the team is black, 8 out of 10 starters. Had the majority of the team been white, I don't think the comment would have drawn nearly as much attention. I'm not sure how, given the choice wording of the remarks, that this would have been a racial remark had the team been mostly white. Whether or not Imus was intending to be racist or not, the comment seems innapropriate and racist to me. I don't think Imus should be fired for his remarks, I find him innapropriate most every time I hear him speak. I simply don't listen to him...that seems to solve the problem. \n \n And I agree, Sharpton is an idiot.", 
   {}, 
   257703, 
   null, 
   1176173460.0
  ], 
  [
   257825, 
   null, 
   "Jim Colyer", 
   "Al Sharpton should be fired.", 
   {}, 
   257819, 
   null, 
   1176177420.0
  ], 
  [
   257841, 
   null, 
   "Archangel", 
   "The Imus Show has ben suspended, not fired; for 2 weeks starting monday.", 
   {}, 
   257825, 
   null, 
   1176180540.0
  ], 
  [
   257845, 
   null, 
   "Steeeeve", 
   "The Imus Show has ben suspended, not fired; for 2 weeks starting monday.\n\n \n what a lame way to try and make both sides happy....they need to grow a backbone and stand up for something.", 
   {}, 
   257841, 
   null, 
   1176181380.0
  ], 
  [
   257848, 
   null, 
   "Archangel", 
   "There is such a huge double standard regarding racism in this Country it is ridiculous. Just 2 months ago or so a white Congressman in a predominantly black district attempted to join the Congressional Black Caucus and was basically laughed out of the hall by the black membership. Now, can anyone even imagine the outrage and uproar if within the US Government we had an organization made up of only whites and disallowed admittance to a black Congressman ?\n \n White America is on such a guilt trip over slavery we are paralyzed from being across the board fair about racism in America. If free speech exists then no matter how repugnant what Imus said, and I am no fan of his, but he has a right to say whatever he likes without fear. But this is another example of political correctness gone crazy.", 
   {}, 
   257845, 
   null, 
   1176182220.0
  ], 
  [
   257858, 
   null, 
   "snakespit", 
   "Al Sharpton should be fired.\n\n But what does Sharpton really do? I would think as village hypocrite that he would be considered self employed. I'm not sure you can really fire yourself.", 
   {}, 
   257825, 
   null, 
   1176188760.0
  ], 
  [
   257867, 
   null, 
   "gamehuis", 
   "I find it amusing to note that Al Sharpton, while accusing Imus of being a racist, is actually the real racist. That's because he jumps on a white guy saying things like that, but says nothing about black people saying far worse things. In other words he sees race as a criteria for what can and cannot be said by a person. Ergo Al Sharpton is a racist.", 
   {}, 
   257696, 
   null, 
   1176203880.0
  ], 
  [
   257894, 
   null, 
   "snakespit", 
   "I find it amusing to note that Al Sharpton, while accusing Imus of being a racist, is actually the real racist. That's because he jumps on a white guy saying things like that, but says nothing about black people saying far worse things. In other words he sees race as a criteria for what can and cannot be said by a person. Ergo Al Sharpton is a racist.\n\n \n Al Sharpton is an idiot, but that does not make him a racist.\n \n What \"black people\" saying what \"worse things\"? Name one black radio host that came out on a nationally broadcast show and called a group of whites \"honkys\" or \"crackers\". I mean if we want to be fair about it, at least put it in the same scope and context. \n \n To be fair, Sharpton has every right to come out and call foul on Imus. If he as a black man really was offended by Imus and his remark, then Sharpton has every right to speak up. I doubt that is really the case, but hey, it's his right. If Sharpton wants to make an XXX out of himself on national news yet again, have at it. \n \n If Jesse Jackson came out on the national scene and called me or a group of my white peers redneck honky crackers, I personally would not be offended. I would however see how others could take offense to such a remark, and full well support their right to voice their displeasure.", 
   {}, 
   257867, 
   null, 
   1176216600.0
  ], 
  [
   257903, 
   null, 
   "Steeeeve", 
   "I find it amusing to note that Al Sharpton, while accusing Imus of being a racist, is actually the real racist. That's because he jumps on a white guy saying things like that, but says nothing about black people saying far worse things. In other words he sees race as a criteria for what can and cannot be said by a person. Ergo Al Sharpton is a racist.\n\n \n Wow, the one thing everyone agrees on in this forum is that Al Sharpton is a racist...who knew?", 
   {}, 
   257867, 
   null, 
   1176219360.0
  ], 
  [
   257905, 
   null, 
   "gamehuis", 
   "Al Sharpton is an idiot, but that does not make him a racist.\n \n What \"black people\" saying what \"worse things\"? Name one black radio host that came out on a nationally broadcast show and called a group of whites \"honkys\" or \"crackers\". I mean if we want to be fair about it, at least put it in the same scope and context. \n\n What I'm talking about is the commonly accepted notion that only people belonging to a certain group (racially/religiously etc) can make derogatory comments/jokes about said group.\n For example, a black comedian can say the n-word and it'll be funny as hell. But if a white comedian even thinks about saying it, he'll be called a racist for the rest of his life.\n Just take the average Chris Rock standup comedy show, replace Chris Rock with a white guy and see what happens. Suddenly all those n-word jokes aren't so funny anymore. And the only reason for that is because the comedian is white instead of black. I call that racism, because people look at the color of the skin and not the content of the message.", 
   {
    "unicode_changes_made": true
   }, 
   257894, 
   null, 
   1176219540.0
  ], 
  [
   257972, 
   null, 
   "simone", 
   "This is worse than the Strom Thurman 100th birthday saga.\n \n http://www.foxnews.com/story/0,2933,264946,00.html\n \n \n \n This is referring to the Rutgers womans basketball team. \n \n The full, relevant, portion is as follows:\n \n \n \n I'm not exactly sure how you make this the most racist comment of the year but Al Sharpton did. Honestly, I'm not offended by it and it actually was kinda funny. The Rutgers team does look a lot meaner and tougher than the Tenn team. \n \n Honestly, if you get offended by something so trivial then perhaps you should just go into your house, lock the doors, and never listen to anyone again.\n \n Some got offended, he said he was sorry...get over it. emoticon_mad\nYou don't get it, do you? Obviously you will never get it!\n \n That stinking bastard essentially called my daughters and my granddaughters whores. I don't go along with that line of sexist ####.\n \n Obviously you do. Bad cess to you, but one can not expect much from you, so why try.", 
   {}, 
   257696, 
   null, 
   1176239820.0
  ], 
  [
   257973, 
   null, 
   "simone", 
   "I find it amusing to note that Al Sharpton, while accusing Imus of being a racist, is actually the real racist. That's because he jumps on a white guy saying things like that, but says nothing about black people saying far worse things. In other words he sees race as a criteria for what can and cannot be said by a person. Ergo Al Sharpton is a racist.\nWrong! Sharpton plainly said that he dislikes it when rap singers call black women hos.\n \n The difference is the the public platform that Imus has--as opposed to the platform available to rap singers. Imus has influence over a large number of powerful people, undeservedly so, it would seem.", 
   {}, 
   257867, 
   null, 
   1176240000.0
  ], 
  [
   257977, 
   null, 
   "Zardoz", 
   "Wrong! Sharpton plainly said that he dislikes it when rap singers call black women hos.\n \n The difference is the the public platform that Imus has--as opposed to the platform available to rap singers. Imus has influence over a large number of powerful people, undeservedly so, it would seem.\n\n \n But Sharpton wasn't complaining about hos AT ALL. In the hours of media I had to cover in the past couple of days, all I heard was racism.\n \n I agree with you that Imus comments were plainly sexists but it took my wife (from FL.) to educate me that when she was a kid, she heard the term 'nappy' to refer to black people.\n Which is saying a lot since I was raised in a fairly white supremacist environment, that's how obscure the word is to me.\n In today's parlance, nappy is used quite a lot to simply mean nasty (they even rhyme).\n \n Being the worldly person I am, the only 'nappy' I can think of is the English slang for diapers. Is there a correlation between diapers and say a black womans head? Were the head scarves worn in ages past called nappy?\n *shrug*\n \n To me, it's nothing more than a race pimp (Sharpton) making a band wagon about the wrong subject. \n \n Also, I'd like to know who Imus speaks to? I've had to write synopsis on his shows in the past and can't stand him. He's barely more comprehensible than Ozzy Ozbourne...and looks about as strung out as he does too.", 
   {}, 
   257973, 
   null, 
   1176241200.0
  ], 
  [
   257991, 
   null, 
   "Steeeeve", 
   "You don't get it, do you? Obviously you will never get it!\n \n That stinking bastard essentially called my daughters and my granddaughters whores. I don't go along with that line of sexist ####.\n \n Obviously you do. Bad cess to you, but one can not expect much from you, so why try.\n\n \n emoticon_cry <--for you Simone\n \n Perhaps you should have read that no one even cared if the comments were sexist...they were thought to be racist and I don't see them as being racist it all and I do not take offense to them.", 
   {}, 
   257972, 
   null, 
   1176244440.0
  ], 
  [
   258045, 
   null, 
   "snakespit", 
   "What I'm talking about is the commonly accepted notion that only people belonging to a certain group (racially/religiously etc) can make derogatory comments/jokes about said group.\n For example, a black comedian can say the n-word and it'll be funny as hell. But if a white comedian even thinks about saying it, he'll be called a racist for the rest of his life.\n Just take the average Chris Rock standup comedy show, replace Chris Rock with a white guy and see what happens. Suddenly all those n-word jokes aren't so funny anymore. And the only reason for that is because the comedian is white instead of black. I call that racism, because people look at the color of the skin and not the content of the message.\n\n Not true. I have heard George Carlin use the word \"nigger\" about a hundred times in his shows. He get's laughs, from both whites and blacks, and I cannot recall one instance when I have heard people complaining about it. Chris Rock also uses the word \"nigger\" quite frequently, and he also gets laughs and does not offend people. \n \n Actually, Carlin talks about this very issue in one of his routines. He states that it is not the usage of the word itself that is offensive, it is the context that the word is used in. Words are simply words, neither good or bad. It is the context that makes the word and its usage derogatory. A person of any color can use any word in a derogatory context and offend people...even people of his own race.", 
   {
    "unicode_changes_made": true
   }, 
   257905, 
   null, 
   1176257400.0
  ], 
  [
   258054, 
   null, 
   "gman", 
   "\n Words are simply words, neither good or bad. It is the context that makes the word and its usage derogatory. A person of any color can use any word in a derogatory context and offend people...even people of his own race.\n\n \n This is only partially true. People such as Jessie Jackson, Al Sharpton make a living at being overly sensitive. Looking for reasons to challenge any white man for any reason. The media never challenges the extremism of the sensitivity police. Jessie and Al won't take on George Carlin because they know he will blow them out of the water with reality.\n By the way, when did Al Sharpton get his credibility back after going to wall over false accusations of white men raping a black girl? \n Why didn't gutless Imus throw that in his lap? Don't worry Imus, this will fade, you're a liberal and they'll figure out how to give you a pass.\n Say a bunch of ugly things about Bush. That'll bring them back.", 
   {}, 
   258045, 
   null, 
   1176260640.0
  ], 
  [
   258058, 
   null, 
   "Phyllis", 
   "Wrong! Sharpton plainly said that he dislikes it when rap singers call black women hos.\n\n \n I'm sure he dislikes it. Especially when he is called to the carpet on it in front of the national media. Of course he has to say something like this so that he looks like he is a consistent thinker. But no dispassioned observer could look at Sharpton's actions and conclude that he is consistent.\n \n Have you ever heard Sharpton call for 50 Cent to resign? Ever heard of Sharpton calling on 50 Cent to be fired? Ever heard Sharpton initiate a protest of his music? He has called on Imus to resign, and for him to be fired. This is a clear double standard, and the only basis for the double standard that makes sense to me is that Imus is white, and 50 cent is not. That is a standard that treats people differently based on their race, which as we have learned from this situation, is ok so long as you are not white.", 
   {}, 
   257973, 
   null, 
   1176261600.0
  ], 
  [
   258066, 
   null, 
   "JL...W", 
   "\"That's some rough girls from Rutgers,\" Mr. Imus said on Wednesday. \"Man, they got tattoos ...\" The program's executive producer, Bernard McGuirk, agreed: \"Some hardcore ho's,\" he said. Imus continued, \"That's some nappy-headed ho's there, I'm going to tell you that.\" \n \n Later in the show, Mr. McGuirk characterized the women's collegiate basketball championship Tuesday night, between Rutgers and the University of Tennessee, as \"the Jigaboos versus the Wannabes.\" http://www.nytimes.com/2007/04/07/arts/television/07imus.html\n \n I've never heard the Imus program and read this \"cold\" one morning in my usual skim of the NYT. I found it shocking - clearly racist AND sexist and just all around offensive. Shocking even, in this day and age. And \"Jigaboos\"???? You've gotta be kidding! From a radio program executive producer of a popular show? Has he been fired? He should be, imo. \n \n Imus won't be fired because he makes too much money for somebody. The current 2 week suspension is also about money - namely the advertisers on the Imus show, which include some prominent sports organizations as I understand it. \n \n I don't blame Sharpton, Jesse Jackson or whomever being up in arms about this. And some people saying, \"Hey, what's the big deal?\" is, well, disheartening, imo. \n \n JL", 
   {
    "unicode_changes_made": true
   }, 
   258058, 
   null, 
   1176263640.0
  ], 
  [
   258088, 
   null, 
   "Steeeeve", 
   "Ugh, we might have the most overly senstive country on this planet.\n \n No wonder other countries hate us so much...we complain about stupid things like this.", 
   {}, 
   258066, 
   null, 
   1176273660.0
  ], 
  [
   258093, 
   null, 
   "snakespit", 
   "Ugh, we might have the most overly senstive country on this planet.\n \n No wonder other countries hate us so much...we complain about stupid things like this.\n\n \n There is a difference between being politically correct to rediculous lengths, and being culturally and racially sensitive. Calling someone a \"spokesperson\" rather than a \"spokesman\" simply because they are female is rediculous. Calling a group of black females \"nappy headed ho's\" is simply wrong, and I can't understand how it is being \"overly sensitive\" when people complain about it. \n \n If being culturally and racially sensitive causes other nations to hate us, so be it. I would rather be hated by ignorant people for being decent than hated by decent people for being ignorant.", 
   {}, 
   258088, 
   null, 
   1176275580.0
  ], 
  [
   258119, 
   null, 
   "simone", 
   "emoticon_cry <--for you Simone\n \n Perhaps you should have read that no one even cared if the comments were sexist...they were thought to be racist and I don't see them as being racist it all and I do not take offense to them.\nThis is the 21st century, not the 19th and it is time that people stopped being ######ned fools and started caring about sexist remarks.\n \n You are welcome to remain with the damned, as that appears to be your lot.", 
   {}, 
   257991, 
   null, 
   1176304020.0
  ], 
  [
   258121, 
   null, 
   "simone", 
   "I'm sure he dislikes it. Especially when he is called to the carpet on it in front of the national media. Of course he has to say something like this so that he looks like he is a consistent thinker. But no dispassioned observer could look at Sharpton's actions and conclude that he is consistent.\n \n Have you ever heard Sharpton call for 50 Cent to resign? Ever heard of Sharpton calling on 50 Cent to be fired? Ever heard Sharpton initiate a protest of his music? He has called on Imus to resign, and for him to be fired. This is a clear double standard, and the only basis for the double standard that makes sense to me is that Imus is white, and 50 cent is not. That is a standard that treats people differently based on their race, which as we have learned from this situation, is ok so long as you are not white.\nDoes 50 Cent have the national platform that Imus has?\n \n That's the main problem. And, I wouldn't be too surprised if rappers were not pressured to cut the #### in their lyrics as a result of the Imus dustup.\n \n There are going to be all kinds of changes in our cultue as a result of Imus' flapping mouth. We might even be able to shut up the even more racist mouths of Rush Limbaugh, Michael Savage, et al. I don't think they should be banned from the airwaves but they should be humiliated and made examples of, just as Imus was.", 
   {}, 
   258058, 
   null, 
   1176304200.0
  ], 
  [
   258122, 
   null, 
   "simone", 
   "Ugh, we might have the most overly senstive country on this planet.\n \n No wonder other countries hate us so much...we complain about stupid things like this.\nBS! Utter BS!\n \n Sorry to find out that you have such a profound hatred of basic civilization. I'd suspected it, but you just delivered the total proof.", 
   {}, 
   258088, 
   null, 
   1176304320.0
  ], 
  [
   258123, 
   null, 
   "simone", 
   "Kudos, snakespit. I'm surprised that I'm saying that to you.", 
   {}, 
   258122, 
   null, 
   1176304440.0
  ], 
  [
   258130, 
   null, 
   "JL...W", 
   "Ugh, we might have the most overly senstive country on this planet.\n \n No wonder other countries hate us so much...we complain about stupid things like this.\n\n \n More sensitive than Muslims who can't abide a pictorial depiction of their prophet, or an opinion of their religion -- to the point of death??\n \n Rude characterizations such as Imus indulges in don't have much meaning in themselves, but do in a greater cultural context that such language and corresponding sentiments have caused acutal harm to people. The fact that people are defending, not just his right to say whatever might spew from his mouth, but that what he said was \"no big deal\", imo, illustrates that we have a ways to go in race relations in this country. And sexism, as well. These are young women, still teenagers some of them, getting national attention for accomplishing something they've worked hard to do, that they would ordinarily be admired for, and they're trashed by some bigot on the radio in sexist and racist terms. What's so ok about that?\n \n JL", 
   {}, 
   258088, 
   null, 
   1176304980.0
  ], 
  [
   258133, 
   null, 
   "Phyllis", 
   "Does 50 Cent have the national platform that Imus has?\n\n \n 50 Cent certainly has a platform on the level of Imus. His albums have reached the top of the charts, and he's won multiple Grammy awards. And so, it would appear that 50 Cent has quite a large audience.\n \n \nThat's the main problem. And, I wouldn't be too surprised if rappers were not pressured to cut the #### in their lyrics as a result of the Imus dustup.\n\n \n Sure they might be pressured. But will they be pressured equally? If Imus' remarks are deserving of a protest and a resignation/firing, than surely 50 Cent's are as well.\n \n Note, I am not suggesting Imus should be let off the hook. I am only suggesting that Sharpton is unprincipled.\n \n \nThere are going to be all kinds of changes in our cultue as a result of Imus' flapping mouth. We might even be able to shut up the even more racist mouths of Rush Limbaugh, Michael Savage, et al. I don't think they should be banned from the airwaves but they should be humiliated and made examples of, just as Imus was.\n\n \n Are they racist merely because you say so? Frankly, I don't listen to talk radio, but I wonder if you can back that up.", 
   {}, 
   258121, 
   null, 
   1176307020.0
  ], 
  [
   258135, 
   null, 
   "Steeeeve", 
   "There is a difference between being politically correct to rediculous lengths, and being culturally and racially sensitive. Calling someone a \"spokesperson\" rather than a \"spokesman\" simply because they are female is rediculous. Calling a group of black females \"nappy headed ho's\" is simply wrong, and I can't understand how it is being \"overly sensitive\" when people complain about it. \n \n If being culturally and racially sensitive causes other nations to hate us, so be it. I would rather be hated by ignorant people for being decent than hated by decent people for being ignorant.\n\n \n Perhaps it did hurt the feelings of the Rutgers basketball team and thus an apology should be said to them. However, calling for him to resign and making a deal deal about it makes it seem like our country is over senstive. \n \n Honestly, have you never said something that was mean? Have you never said something mean while working? If not you are a liar and if so should you be fired? Does this change because Imus is more well known? All of a sudden a more well known figure means the comments are worse? That makes no sense.\n \n Finally, if you listen to talk radio, normal music radio, and TV for more than a week you will hear 10 times as many mean comments.\n \n Believe it or not, Ann Coulter got it right. He probably should apologize to the Rutgers team and them only. Why? Because many people heard it and it was a story that was well known and thus the Rutgers players were in the middle of it out of no where. He shouldn't have to apologize to Al Sharpton or anyone else for that matter and certainly shouldn't be fired for, as Charles Barkley said, \"saying one stupid comment\".", 
   {}, 
   258093, 
   null, 
   1176308340.0
  ], 
  [
   258138, 
   null, 
   "Steeeeve", 
   "More sensitive than Muslims who can't abide a pictorial depiction of their prophet, or an opinion of their religion -- to the point of death??\n definitly. I have many friends from Africa and India and their biggest complaint is that we get our panties in a wad over stuff like this while they struggle to get one meal a day.\n \n \nThe fact that people are defending, not just his right to say whatever might spew from his mouth, but that what he said was \"no big deal\", imo, illustrates that we have a ways to go in race relations in this country. And sexism, as well. \n I'm not saying it wasn't mean (although only to the rutgers players) I'm just saying it isn't as big as people make it and it certainly isn't a massivly racist or sexist comment. \n \n I had to travel to a univeristy for work the other day and while eating do you want to know how many times I heard \"hos\" or \"bitch\" or other words said? Should we kick all of these people out of college? The thing that made this offensive to the Rutgers players was the fact that it got so much press. I'm sure if some of your comments throughout your life got this much press then you'd probably being going through the same thing.\n \n \nThese are young women, still teenagers some of them, getting national attention for accomplishing something they've worked hard to do, that they would ordinarily be admired for, and they're trashed by some bigot on the radio in sexist and racist terms. What's so ok about that?\nSeems like making a big issue did this. If a few people didn't make it a big deal then they would never have known just like many people will never know of some of the mean comments I'm sure you have made.", 
   {}, 
   258130, 
   null, 
   1176308820.0
  ], 
  [
   258142, 
   null, 
   "jim's trucking", 
   "I recall hearing this morning that the AJC (Atlanta Journal-Constitution), our local fish wrap is calling for the firing of the interviewer that was talking with Imus when he made the comment. What's next...close down the network?\n \n The Rutgers girls and their handlers should take a lesson from my grandmother...just because somebody calls you something doesn't mean that's what you are. Somehow, I think they already know that but just want to remain 'hurt' long enough to maintain the spotlight for a while.\n \n The Rutgers girls know they are not nappy headed hos. They know the expression was not meant as an accurate descriptor but a humorous comment, just as when Cynthia McKinney was compared to Buckwheat with that nappy hairdo that got a hard working security guard in hot water and her in the news again crying RACIST!...just like Al Sharpton is doing now.\n \n Can you say Tawana Brawley?", 
   {}, 
   258135, 
   null, 
   1176309240.0
  ], 
  [
   258148, 
   null, 
   "Phyllis", 
   "The Rutgers girls and their handlers should take a lesson from my grandmother...just because somebody calls you something doesn't mean that's what you are. Somehow, I think they already know that but just want to remain 'hurt' long enough to maintain the spotlight for a while.\n\n \n I happened to watch the entire press conference with the Rutgers team, and I must say that I was impressed with how they handled it. I did not get the sense that they were simply trying to get the spotlight, as you suggest. In fact, the evidence seems to show that they were trying to avoid it. If that is not the case, then why did it take so long for them to publicly address it?\n \n I think the team (and only the team) deserves a direct apology from Imus, which he has been prepared to give, and which they have graciously given him the opportunity to do. Whether you think Imus' comments were offensive or not, the fact remains that his comments took away from the team and their accomplishment. His comments have caused them to be hounded by the media, not for their superb season (which the media has ignored), but for a stupid comment from a stupid radio host. I'm sure their studies have been affected, and I'm sure their private lives have been affected. And all of this was uninvited. Imus should not apologize simply because he offended his listeners. He should apologize because of what he did to the Rutgers team.\n \n I stand by my real point, though, which is that Sharpton is inconsistent (a hypocrite, really), and there is no reason that his opinion should have any sway over the situation. He was offended. But people say offensive things all of the time. Big deal, get over it. Neither Sharpton nor his listeners deserve an apology for being offended. The Rutgers team was more than offended; their life was directly impacted in a very negative way, and thus they deserve an apology.", 
   {}, 
   258142, 
   null, 
   1176311580.0
  ], 
  [
   258150, 
   null, 
   "Steeeeve", 
   "I think the team (and only the team) deserves a direct apology from Imus, which he has been prepared to give, and which they have graciously given him the opportunity to do. Whether you think Imus' comments were offensive or not, the fact remains that his comments took away from the team and their accomplishment. His comments have caused them to be hounded by the media, not for their superb season (which the media has ignored), but for a stupid comment from a stupid radio host. I'm sure their studies have been affected, and I'm sure their private lives have been affected. And all of this was uninvited. Imus should not apologize simply because he offended his listeners. He should apologize because of what he did to the Rutgers team.\n \n It seems like an odd situation. If the media didn't pick this up then the Rutgers team would probably never have known for one and they would still be recognized for their great season of basketball. The only reason the Rutgers team got offended was really because others made it so they had to deal with it. \n \n At some point you gotta wonder if talking about this so much is really helping anything.", 
   {}, 
   258148, 
   null, 
   1176312060.0
  ], 
  [
   258154, 
   null, 
   "jim's trucking", 
   "I happened to watch the entire press conference with the Rutgers team, and I must say that I was impressed with how they handled it. I did not get the sense that they were simply trying to get the spotlight, as you suggest. In fact, the evidence seems to show that they were trying to avoid it. If that is not the case, then why did it take so long for them to publicly address it?\n \n I think the team (and only the team) deserves a direct apology from Imus, which he has been prepared to give, and which they have graciously given him the opportunity to do. Whether you think Imus' comments were offensive or not, the fact remains that his comments took away from the team and their accomplishment. His comments have caused them to be hounded by the media, not for their superb season (which the media has ignored), but for a stupid comment from a stupid radio host. I'm sure their studies have been affected, and I'm sure their private lives have been affected. And all of this was uninvited. Imus should not apologize simply because he offended his listeners. He should apologize because of what he did to the Rutgers team.\n \n I stand by my real point, though, which is that Sharpton is inconsistent (a hypocrite, really), and there is no reason that his opinion should have any sway over the situation. He was offended. But people say offensive things all of the time. Big deal, get over it. Neither Sharpton nor his listeners deserve an apology for being offended. The Rutgers team was more than offended; their life was directly impacted in a very negative way, and thus they deserve an apology.\nPerhaps I shouldn't comment because I didn't hear the newsconference. I suspect it's more the handlers and Al Sharpton who would extend this into next month.\n \n The one comment I did hear that seemed totally inflated was something to the effect that 'he stole our dignity'. THAT part is hogwash!\n \n I think he should explain his intended humor and apologize for not realizing how it might offend some people and get Al out of his luxuries to preach racism again.\n \n I've not heard Imus much at all. I doubt he's racist. I've heard Al Sharton a bit more. I know he's racist.", 
   {}, 
   258148, 
   null, 
   1176312360.0
  ], 
  [
   258155, 
   null, 
   "Phyllis", 
   "It seems like an odd situation. If the media didn't pick this up then the Rutgers team would probably never have known for one and they would still be recognized for their great season of basketball. The only reason the Rutgers team got offended was really because others made it so they had to deal with it. \n \n \n If he didn't make the comment, it wouldn't be an issue. Regardless of who really caused the problem, he made the comment and should be responsible enough not to push the blame on to others. So far, Imus has done this, which is admirable. By the way, I don't particularly like Imus, so it's not like I'm just trying to find a way to let him off. I truly am a dispassioned observer.\n \n \nAt some point you gotta wonder if talking about this so much is really helping anything.\n\n \n I'm glad you made the thread, because as the responses have shown, there are many things that can be observed through the whole situation, the least of which is the actual comments Imus made.\n \n As far as I'm concerned, as soon as he apologizes to the team, this story is over. Of course, Sharpton won't think so. But then again, nobody really seems to care what that idiot has to say anyway except for NBC, CBS, and such.", 
   {}, 
   258150, 
   null, 
   1176312360.0
  ], 
  [
   258158, 
   null, 
   "E Mutz", 
   "On behalf of a grateful nation, I would like to thank Messrs Imus and Sharpton for keeping the Anna Nicole Circus from returning to the airwaves. \n \n According to Arbitron ratings Imus has approximately 3.5 million listeners. \n \n 50 Cent has sold 21 million albums. That means 50 cent has had the opportunity to influence six times the listeners as Mr. Imus. \n \n But that does not consider how many songs have been purchased/downloaded, ipodded or whatever the hell kids do these days. To my knowledge, the self-proclaimed I-Man is not doing a bank o' business on I-tunes. I am also assuming that when 50 cent refers to \"bitches\", he is not referring to a kennel club. Perhaps I am wrong in that regard.\n \n So what do these knuckleheads have in common? Here's the bottom line: They may say whatever the hell they want to say about anyone they wish, in accordance with the approval of their audience. These people are media personalities. Their job is to get and hold your attention long enough for some company to schlep its products. Perceived racism, sexism, regionalism, whateverism will only be a factor as it impacts that audience. 50 Cent's audience has no problem with that artist's misogyny. Don Imus (gasp) is a shock jock. Guess what he does for a living? Indeed, one of the first actions the Rev. Al took was to book Imus on his radio show. Why? Ratings. Did ye honestly know that Rev Al had a radio show? Thanks to Imus, ye do now. Rev Al knows that racism and sexism sell. He and 50 cent make money off different sides of the same coin. All of them will follow the money.\n \n These comments were made by an angry old coot against 10 basketball players. Thus, the matter is ideally for 11 folks to decide. I do not believe there are many in Imus's audience who will depart from his crusty cantakery over one questionable comment. They have heard far worse comments, not the least of which being his endorsement of Sen. John Kerry for President.", 
   {
    "post_info": {
     "post_title": "Imus ado about nothing"
    }, 
    "unicode_changes_made": true
   }, 
   258155, 
   null, 
   1176313200.0
  ], 
  [
   258177, 
   null, 
   "Steeeeve", 
   "If he didn't make the comment, it wouldn't be an issue. Regardless of who really caused the problem, he made the comment and should be responsible enough not to push the blame on to others. So far, Imus has done this, which is admirable. By the way, I don't particularly like Imus, so it's not like I'm just trying to find a way to let him off. I truly am a dispassioned observer.\n I realize he said it and should take responsibility but does it not seem odd that the problem was fueled by the people that claimed their was a problem? Everyone makes mean comments....does that mean we all should get fired? Obviously not :) He apologized (or will) to the team and I think thats a good enough jesture. Al Sharpton doesn't need to contact anyone about it.\n \n \nI'm glad you made the thread, because as the responses have shown, there are many things that can be observed through the whole situation, the least of which is the actual comments Imus made.\n true\n \n \nAs far as I'm concerned, as soon as he apologizes to the team, this story is over. Of course, Sharpton won't think so. But then again, nobody really seems to care what that idiot has to say anyway except for NBC, CBS, and such.\nI'm still awaiting Sharpton's apology to those kids in Raleigh.", 
   {}, 
   258155, 
   null, 
   1176315060.0
  ], 
  [
   258181, 
   null, 
   "simone", 
   "Bill Bennett responding to a call on air:\n \n \nBENNETT: Well, I don't think it is either, I don't think it is either, because first of all, there is just too much that you don't know. But I do know that it's true that if you wanted to reduce crime, you could -- if that were your sole purpose, you could abort every black baby in this country, and your crime rate would go down. That would be an impossible, ridiculous, and morally reprehensible thing to do, but your crime rate would go down. So these far-out, these far-reaching, extensive extrapolations are, I think, tricky.\n", 
   {}, 
   258177, 
   null, 
   1176316380.0
  ], 
  [
   258183, 
   null, 
   "simone", 
   "Michael Savage on Savage Nation, February 7:\n \nSAVAGE: How can a schoolmarm like Condoleezza Rice conceptually deal with the complex problems of this world? She was appointed to the chancellorship at Stanford because of affirmative action. She was chosen by George Bush as part of an affirmative action program in order to make his Cabinet look like America. I mean, do we have to mince words for the rest of our life? She's over her head. She's way over her head. Now, you could have picked an African-American person, if you want to call people of color that, but it wouldn't have been Condoleezza Rice. It should have been a man, it should have been a man who speaks Arabic, it should have been a man because he would have more respect in the Middle East than does a woman to begin with. It has nothing to do with race, it has to do with the fact that she is a schoolmarm who has been pushed up the ladder all of her life because of social engineering.\n\n http://mediamatters.org/items/200702080010", 
   {}, 
   258181, 
   null, 
   1176316740.0
  ], 
  [
   258184, 
   null, 
   "simone", 
   "Rush Limbaugh:\n \nDuring Sunday's ESPN broadcast of their NFL Countdown program (9/28/03), Limbaugh was talking about Philadelphia Eagles quarterback Donovan McNabb, who is black:\n \n Limbaugh: \"I don't think he's been that good from the get-go. I think what we've had here is a little social concern in the NFL. I think the media has been very desirous that a black quarterback do well. They're interested in black coaches and black quarterbacks doing well. I think there's a little hope invested in McNabb and he got a lot of credit for the performance of his team that he really didn't deserve. The defense carried this team.\"\n\n http://www.adversity.net/special/rush_limbaugh.htm", 
   {}, 
   258183, 
   null, 
   1176316860.0
  ], 
  [
   258188, 
   null, 
   "E Mutz", 
   "Rush Limbaugh:\n \n http://www.adversity.net/special/rush_limbaugh.htm\n\n \n In case of thread hijacking, remain calm. Do not attempt to intervene until the hijacking has blown over. The hijacker cannot be reasoned with and it is best to just let this run it's natural course. \n \n This has been a message from your Thread Security Agency", 
   {}, 
   258184, 
   null, 
   1176317700.0
  ], 
  [
   258189, 
   null, 
   "Steeeeve", 
   "Thanks for those quotes? Not sure how they deal with this but whatever.", 
   {}, 
   258184, 
   null, 
   1176317760.0
  ], 
  [
   258190, 
   null, 
   "Steeeeve", 
   "In case of thread hijacking, remain calm. Do not attempt to intervene until the hijacking has blown over. The hijacker cannot be reasoned with and it is best to just let this run it's natural course. \n \n This has been a message from your Thread Security Agency\n\n \n Bingo. Thanks for the alert emoticon_xgood", 
   {}, 
   258188, 
   null, 
   1176317820.0
  ], 
  [
   258195, 
   null, 
   "jitobear", 
   "Both Imus and Sharpton are XXXXXX and 50 Cent is a lousy rapper.", 
   {}, 
   258190, 
   null, 
   1176320940.0
  ], 
  [
   258199, 
   null, 
   "E Mutz", 
   "Don Imus's radio Woe\n Has gotten him kicked off of his show\n For there's no phrase more dreaded\n Than ho's nappy headed\n So this Kerry endorser must go", 
   {
    "unicode_changes_made": true
   }, 
   258195, 
   null, 
   1176321720.0
  ], 
  [
   258200, 
   null, 
   "grammy", 
   "this has gotten SOOO blown out of proportion. First of all, it didn't even become an issue until something like 2 days later when Sharpton/Jackson picked up on it. They demand an apology and firing. So the powers that be tell Imus he has to apologize. Now, if they really thought there was anything wrong, don't you think they would have directed him to apologize that day? The apology is for the benefit of the media circus, not the comment. \n \n Second, the remark was a bit stupid and insensitive. But look at the situation here. Imus is a shock-jock. Who EXPECTS him to be smart and sensitive? This is the US, and he has every right to be stupid and insensitive. Really - he is just doing what he does every day. You don't like what he does every day, then don't listen to his show.\n \n Moving right along now...", 
   {}, 
   258195, 
   null, 
   1176322020.0
  ], 
  [
   258207, 
   null, 
   "sinjin", 
   "this has gotten SOOO blown out of proportion. First of all, it didn't even become an issue until something like 2 days later when Sharpton/Jackson picked up on it. They demand an apology and firing. So the powers that be tell Imus he has to apologize. Now, if they really thought there was anything wrong, don't you think they would have directed him to apologize that day? The apology is for the benefit of the media circus, not the comment. \n \n Second, the remark was a bit stupid and insensitive. But look at the situation here. Imus is a shock-jock. Who EXPECTS him to be smart and sensitive? This is the US, and he has every right to be stupid and insensitive. Really - he is just doing what he does every day. You don't like what he does every day, then don't listen to his show.\n \n Moving right along now...\nHow 'bout if I don't like it I threaten to boycott the products advertised on the station unless they fire him? This is the US afterall.", 
   {}, 
   258200, 
   null, 
   1176323520.0
  ], 
  [
   258210, 
   null, 
   "jim's trucking", 
   "How 'bout if I don't like it I threaten to boycott the products advertised on the station unless they fire him? This is the US afterall.\nYes...I think the threat of boycott did work against Coca-Cola some time back.\n \n Jesse has acute boycottitus complicated by an adiction to television cameras and concubines.\n \n \n \n http://topics.nytimes.com/top/reference/timestopics/subjects/b/boycotts/index.html?query=JACKSON,%20JESSE%20L&field=per&match=exact", 
   {}, 
   258207, 
   null, 
   1176324240.0
  ], 
  [
   258214, 
   null, 
   "grammy", 
   "How 'bout if I don't like it I threaten to boycott the products advertised on the station unless they fire him? This is the US afterall.\nsame thing - if no one listens, then the advertisers will pull out...", 
   {}, 
   258207, 
   null, 
   1176324780.0
  ], 
  [
   258263, 
   null, 
   "sinjin", 
   "same thing - if no one listens, then the advertisers will pull out...\nSame thing except Imus goes off the air in my scenario.", 
   {}, 
   258214, 
   null, 
   1176333300.0
  ], 
  [
   258270, 
   null, 
   "grammy", 
   "Same thing except Imus goes off the air in my scenario.\nand he would somehow stay on the air with no advertisers? I don't understand the difference.", 
   {}, 
   258263, 
   null, 
   1176336180.0
  ], 
  [
   258274, 
   null, 
   "Phyllis", 
   "story: http://www.breitbart.com/article.php?id=D8OEM9M81&show_article=1\n \n His top advertisers are bailing, and now NBC has dropped him. Imus is done.", 
   {}, 
   258270, 
   null, 
   1176338880.0
  ], 
  [
   258278, 
   null, 
   "Archangel", 
   "story: http://www.breitbart.com/article.php?id=D8OEM9M81&show_article=1\n \n His top advertisers are bailing, and now NBC has dropped him. Imus is done.\n\n \n Agreed, he's toast. Advertisers are dropping like flies over a camp fire.", 
   {}, 
   258274, 
   null, 
   1176339780.0
  ], 
  [
   258317, 
   null, 
   "Jim Colyer", 
   "Imus in 2008", 
   {}, 
   257696, 
   null, 
   1176356460.0
  ], 
  [
   258343, 
   null, 
   "gamehuis", 
   "Not true. I have heard George Carlin use the word \"nigger\" about a hundred times in his shows. He get's laughs, from both whites and blacks, and I cannot recall one instance when I have heard people complaining about it. Chris Rock also uses the word \"nigger\" quite frequently, and he also gets laughs and does not offend people. \n \n Actually, Carlin talks about this very issue in one of his routines. He states that it is not the usage of the word itself that is offensive, it is the context that the word is used in. Words are simply words, neither good or bad. It is the context that makes the word and its usage derogatory. A person of any color can use any word in a derogatory context and offend people...even people of his own race.\n\n I'm a big fan of George Carlin, but I've never ever heard him (or any other white comedian) say \"nigger\". Not that I'm saying that you're dishonest or anything. Afterall, I know I haven't seen all of his shows and George Carlin would definately be the type to utter such a thing.\n However, I do think that George Carlin is the exception to the rule.\n \n The point that I'm trying to make (with quite some difficulty obviously) is that in todays society the color of your skin or the faith that you have determines what you can or cannot say.\n Heard any good Jew jokes lately from non-Jews? I haven't. On the other hand I have seen Lewis Black (a Jew) blast the Jewish faith like a nuke on Hiroshima. If a white guy would have said the things he has said, the cries of \"anti-semite\" would reach the Senate floor.", 
   {}, 
   258045, 
   null, 
   1176390060.0
  ], 
  [
   258346, 
   null, 
   "gamehuis", 
   "BTW I noticed that the charges in the Duke rape case have been dropped.\n Have Al Sharpton and Jesse Jackson made an apology yet to the players after they accused them of racism?\n Probably not...\n \n \n Al Sharpton and Jesse Jackson: proffessional black guys.", 
   {}, 
   258343, 
   null, 
   1176392280.0
  ], 
  [
   258349, 
   null, 
   "simone", 
   "In case of thread hijacking, remain calm. Do not attempt to intervene until the hijacking has blown over. The hijacker cannot be reasoned with and it is best to just let this run it's natural course. \n \n This has been a message from your Thread Security Agency\nBull cookies.", 
   {}, 
   258188, 
   null, 
   1176397200.0
  ], 
  [
   258351, 
   null, 
   "E Mutz", 
   "Bull cookies.\n\n \n \n Pardon me Simone, but your name appears on our Thread Security Agency do-not-type list. I'm afraid we will have to ask you to step over here for a random and routine security procedure...", 
   {
    "unicode_changes_made": true
   }, 
   258349, 
   null, 
   1176397620.0
  ], 
  [
   258357, 
   null, 
   "simone", 
   "I must warn you that I am extremely ticklish and if I inadvertently kick one of your agents in the shins or stomp heavily on their feet, you are accountable.", 
   {}, 
   258351, 
   null, 
   1176398220.0
  ], 
  [
   258358, 
   null, 
   "simone", 
   "From the Wall Street Journal and Lionel Tiger, no less:\n \n The 'H' Word\n By LIONEL TIGER\n April 12, 2007; Page A14\n What Don Imus failed to recognize in his puerile fatuity about the Rutgers women's basketball team is the intimacy of college athletics, and hence its hot importance to the inner lives of everyone concerned with it. I've not had members of the current team in any of my classes. But I've taught other varsity athletes and there is something clear-cut and rich when you see them moving especially slowly to enter a classroom because you know they had a trying game the night before and their bones hurt.\n \n When, at the beginning of a semester, they present for signature the schedule of their away games so that their absences are acceptable, it becomes clear how hard the good ones work, how keenly they evaluate their own results, and how sharply they are able to separate the carnival of public success and failure from the private experience of their own effort. When a student describes leaving his dorm for a winter practice at 5 a.m. while fellow students are still returning from parties, it becomes clear that the personal costs of athletic achievement are measured out on a daily basis.\n \n So when Imus made his improbably ugly comment, he could not anticipate how many people were heartbroken that he turned a vibrantly decent moment of celebration and joy for the team, their coaches and supporters into confrontation with a national pathology.\n \n And of course national pathology it is. Pressing the Race and Sex buttons always gets a response from the media machine and the garrulous shepherds of the diversity flock. Mr. Imus's views on the decor habits of women with dark skin and very curly hair are condescending, pedestrian and of no interest except as a symptom of the lens he uses with which to see other people. But it's his use of the \"H\" word which is most significant, and herein lies an anthropological story.\n \n Perhaps because I was raised in Victorian Canada, I have always found the casual use of the H word perplexing, offensive and violent. Whatever its etymological derivation, the fact is that it's understood to be shorthand for \"whore.\" The term appears to have achieved currency and seeming acceptability initially and mainly in the community of people with dark skin. Just take a look -- if your stomach is settled -- at any number of MTV video spectacles of Rapper Princes surrounded by wholly compliant and nearly nude women grinding their lives away. But this is of course no alibi at all for any people with any pigment to describe any woman or group of women in a manner which deprives them of their sexual autonomy and paints them with the sign \"commodity for purchase.\"\n \n The thoughtless use of such language is bad enough. Far worse is the situation which provoked and appears to support it -- the comparative ineffectiveness of some African-American males in achieving stable and rewarding statuses in the wider society.\n \n Perhaps as a dramatic antidote, that culture has produced a galaxy of tight-rope heroes embedded in the largest black or white SUVs with a weapon on the floor as they float from misogynist performance to performance. They and their managers have not had to endure sermons from Rev. Al Sharpton and don't get threatened with losing their record contracts or concert venues.\n \n The coercive trend is that ordinary African-American males earn decreasing amounts of money compared to women of their community. They are more accident-prone, more imprisoned and have frailer family lives than women do. Is this why they smoothly call them whores, out of desperate resentment at their own ineffectuality?\n \n There are structural reasons for this beyond the craven crumminess of popular culture. When African and Arab slavers captured people for the New World, they preferred to break up families. Subsequent slave-owning policies sustained that pattern. As well, many slaves were taken from West African societies in which biological mothers and fathers didn't necessary share child caretaking but mother and her brother did. When I lived in Ghana years ago, Christian families with father and mother in the household were called \"same muddah same fadduh\" in the street. It's likely that continuities persist, as they certainly do in Caribbean societies.\n \n There's also a massive contemporary reason for the invidiousness many African-American men feel in the presence of women -- their relative failure in a school system which broadly favors females. By college age, there is a sharp fall-off of male enrollment in general and of African-American men specifically.\n \n When Don Imus meets with the Rutgers women, as they agreed he can, it is doubtful he will have the bravery or stupidity to call them whores to their troubled faces. He was after all an unelected representative of a broader culture when he used That Phrase.\n \n Nevertheless, for those of us in the Rutgers community, these are our accomplished young women, whatever their color. In their stately tearjerker news conference on Tuesday, they conducted themselves with discreet dignity and care. And to a woman they called him Mr. Imus.\n \n Mr. Tiger is a professor of anthropology at Rutgers University and the author of \"The Decline of Males\" ( St. Martin's Press, 2000).", 
   {
    "post_info": {
     "post_title": "The Word &quot;Ho&quot;"
    }
   }, 
   258357, 
   null, 
   1176398280.0
  ], 
  [
   258403, 
   null, 
   "Steeeeve", 
   "Imus got fired by everyone....what a sad hypocritical world we live in.", 
   {}, 
   258358, 
   null, 
   1176420480.0
  ], 
  [
   258408, 
   null, 
   "Phyllis", 
   "Imus got fired by everyone....what a sad hypocritical world we live in.\n\n \n An important message from your local first amendment advocacy center:\n \n Be careful what you write on these forums. The speech police are out in force, and when they find you, they will ruin you. In order to retain the best possibility of getting a pass from the speech police, you must do the following:\n \n 1) Ensure that you are not white. If you are, the best advice is that you bite your tongue.\n \n 2) Ensure that you have a haircut that makes you look like a clown.\n \n 3) Ensure that you are in no way consistent in any of the statements you make or the actions you perform.\n \n If you satisfy all three of these conditions, you shall get a free pass from everyone for everything that you say and do. If you do not satisfy all three of these conditions, you take your life into your own hands when you open your mouth.", 
   {}, 
   258403, 
   null, 
   1176423360.0
  ], 
  [
   258410, 
   null, 
   "grammy", 
   "In their stately tearjerker news conference on Tuesday, they conducted themselves with discreet dignity and care. \nI don't mean to sound like what mr. imus said was anything other than stupid. But I listened to parts of this new conference, and I have to say, I was pretty bored and thought they were quite whiney. Had I been the coach, I think I would have simply had a news conference, told the world how proud I was of these young women and their accomplishments, and absolutely totally ignored Mr. Imus. That would have gotten him all the attention he deserved and shown the world what class these women REALLY have.", 
   {}, 
   258358, 
   null, 
   1176425100.0
  ], 
  [
   258418, 
   null, 
   "Archangel", 
   "I'm no fan of Imus because he always promoted dems but it kills me that CBS and NBC allowed Jesse Jackson and Al Sharpton to strong arm them into this. Those hypocrites have overlooked the systematic degradation of women for decades now by ignoring the lirics in Rap and pop music by artists within their own community. It's ludicrous and an embarrassment that such an over reaction could be allowed to happen.", 
   {}, 
   258410, 
   null, 
   1176431460.0
  ], 
  [
   258430, 
   null, 
   "Steeeeve", 
   "I was at a speech done by Al Sharpton a few years ago and the one thing I remember him saying was that he may not believe in what you say but he will \"defend your right to say whatever you want\". \n \n I guess he forgot to say that he will also try to destroy you if he disagrees.", 
   {}, 
   258418, 
   null, 
   1176438000.0
  ], 
  [
   258433, 
   null, 
   "Phyllis", 
   "I'm no fan of Imus because he always promoted dems but it kills me that CBS and NBC allowed Jesse Jackson and Al Sharpton to strong arm them into this. Those hypocrites have overlooked the systematic degradation of women for decades now by ignoring the lirics in Rap and pop music by artists within their own community. It's ludicrous and an embarrassment that such an over reaction could be allowed to happen.\n\n \n An important message from your local first amendment advocacy center:\n \n My well placed sources have informed me that speech of this sort is ill advised unless you meet the three criteria laid forth in this post. The speech police have ears everywhere.\n \n Just looking out for the little guy.", 
   {}, 
   258418, 
   null, 
   1176439740.0
  ], 
  [
   258434, 
   null, 
   "Archangel", 
   "An important message from your local first amendment advocacy center:\n \n My well placed sources have informed me that speech of this sort is ill advised unless you meet the three criteria laid forth in this post. The speech police have ears everywhere.\n \n Just looking out for the little guy.\n\n \n Let them arrest me then Phyllis cuz I would love to publicly call Sharpton and jackson the racists they are. \n \n Here's a link that has too many examples of Sharptons hypocrisy regarding racism to list here so here's the link.\n \n http://www.discoverthenetworks.org/individualProfile.asp?indid=1527", 
   {}, 
   258433, 
   null, 
   1176441000.0
  ], 
  [
   258470, 
   null, 
   "JL...W", 
   "I'm not saying it wasn't mean (although only to the rutgers players) I'm just saying it isn't as big as people make it and it certainly isn't a massivly racist or sexist comment. \n \n I had to travel to a univeristy for work the other day and while eating do you want to know how many times I heard \"hos\" or \"bitch\" or other words said? Should we kick all of these people out of college? The thing that made this offensive to the Rutgers players was the fact that it got so much press. I'm sure if some of your comments throughout your life got this much press then you'd probably being going through the same thing.\n \n Seems like making a big issue did this. If a few people didn't make it a big deal then they would never have known just like many people will never know of some of the mean comments I'm sure you have made.\n\n \n So Imus's comments are merely \"mean\"? I'm wondering what you would consider a \"massively racist or sexist comment\" that someone might make on the radio that would warrant others making a \"big issue\" of?\n \n If I had a radio program that was also broadcast on TV I would be at least exercising the same kind of discretion I do when talking to my mom, my boss or dealing with clients. What's so tough about that? And furthermore, I don't THINK in these terms. If people on college campuses are, more's the pity. Do you really not see the point that Imus is not just \"some guy\", making remarks in a lunchroom?\n \n Oh, and it got press, btw, not because of Sharpton and Jackson but because the media was following the lead of the Internet. It was first reported on the website Media Matters, is my understanding. Then blame the availiability of downloads for the curious, and the blogosphere. Anyone in the public eye these days is subject to the likelihood that someone has a video camera and and inevitable upload to YouTube if it's some celebrity saying something controversial. \n \n Imus was Old Media in a New Media age. \n \n JL", 
   {}, 
   258138, 
   null, 
   1176483840.0
  ], 
  [
   258474, 
   null, 
   "JL...W", 
   "I've not heard Imus much at all. I doubt he's racist. \n\n \n If you've not heard him, why would you doubt he's racist? Imo, no one who wasn't racist would say what he said. \n \n Washington Post sports columnist Michael Wilbon:\n \n I don't care whether Don Imus apologizes, or whether he's fired. Freedom of speech allows him to say whatever he wants to say. But I've got freedom of speech, as well, and I prefer to have the right to rip his face off in print and on TV for saying, repeatedly, the racially offensive stuff he says over and over and over and over. He compares blacks and Hispanics to apes all the time. ALL THE TIME. It's not rare, it's not an exception. It's not a one-time deal. ALL THE TIME. He and the people in his studio act as if all Blacks are pimps and whores and all have gold teeth and are illiterate...I'm glad I'm guaranteed the right to come right back at a bigot of this level and say whatever I want to say...And I'm happy to go toe-to-toe. Happy to.http://blog.washingtonpost.com/rawfisher/2007/04/turned_tables_imus_on_the_hot.html?nav=rss_blog\n \n Sounds to me like Imus is no great loss to the airwaves. \n \n JL", 
   {}, 
   258154, 
   null, 
   1176484260.0
  ], 
  [
   258515, 
   null, 
   "jyoshu", 
   "If you've not heard him, why would you doubt he's racist? Imo, no one who wasn't racist would say what he said. \n \n Washington Post sports columnist Michael Wilbon:\n \n I don't care whether Don Imus apologizes, or whether he's fired. Freedom of speech allows him to say whatever he wants to say. But I've got freedom of speech, as well, and I prefer to have the right to rip his face off in print and on TV for saying, repeatedly, the racially offensive stuff he says over and over and over and over. He compares blacks and Hispanics to apes all the time. ALL THE TIME. It's not rare, it's not an exception. It's not a one-time deal. ALL THE TIME. He and the people in his studio act as if all Blacks are pimps and whores and all have gold teeth and are illiterate...I'm glad I'm guaranteed the right to come right back at a bigot of this level and say whatever I want to say...And I'm happy to go toe-to-toe. Happy to.http://blog.washingtonpost.com/rawfisher/2007/04/turned_tables_imus_on_the_hot.html?nav=rss_blog\n \n Sounds to me like Imus is no great loss to the airwaves. \n \n JL\n\n \n I don't think anyone would disagree that Imus shouldn't have said it. I'm disappointed in the way things have played out after he said it. I don't agree with everything Pat Buchanan says, but I think he hit the nail on the head here ...\n \"Compare, if you will, what was done to them - a single nasty insult - to the savage slanders for weeks on end of the Duke lacrosse team and the three players accused by a lying stripper of having gang-raped her at a frat party. Duke faculty and talking heads took that occasion to vent their venom toward all white \"jocks\" on college campuses. Where are the demands for apologies from the talk-show hosts, guests, Duke faculty members and smear artists, all of whom bought into the lies about those Duke kids - because the lies comported with their hateful view of America? And hate is what this is all about. While the remarks of Imus and Bernie about the Rutgers women were indefensible, they were more unthinking and stupid than vicious and malicious. But malice is the right word to describe the howls for their show to be canceled and them to be driven from the airwaves - by phonies who endlessly prattle about the First Amendment. The hypocrisy here was too thick to cut with a chainsaw. What was the term the I-Man used? It was \"hos,\" slang for whores, a term employed ad infinitum et ad nauseam by rap and hip-hop \"artists.\" It is a term out of the African-American community. Yet, if any of a hundred rap singers has lost his contract or been driven from the airwaves for using it, maybe someone can tell me about it. If the word \"hos\" is a filthy insult to decent black women, and it is, why are hip-hop artists and rap singers who use it incessantly not pariahs in the black community? Why would black politicians hobnob with them? Why are there no boycotts of the advertisers of the radio stations that play their degrading music? Answer: The issue here is not the word Imus used. The issue is who Imus is - a white man, who used a term about black women only black folks are permitted to use with impunity and immunity. Whatever Imus' sins, no one deserves to have Al Sharpton - hero of the Tawana Brawley hoax, resolute defender of the fake rape charge against half a dozen innocent guys, which ruined lives - sit in moral judgment upon them. \"It is our feeling that this is only the beginning. We must have a broad discussion on what is permitted and not permitted in terms of the airwaves,\" says Sharpton. It says something about America that someone with Al's track record can claim the role of national censor. Who is next? And why do we take it? I did a bad thing, but I am not a bad person, says Imus. Indeed, whoever used his microphone to do more good for more people - be they the cancer kids of Imus Ranch, the families of Iraq war dead now more justly compensated because of the I-Man or the cause of a cure for autism? \"We know of no spectacle so ridiculous as the British public in one of its periodic fits of morality,\" said Lord Macaulay. Unfortunately, Macaulay never saw the likes of the Revs. Sharpton and Jackson. Imus threw himself on the mercy of the court of elite opinion - and that court, pandering to the mob, lynched him. Yet, for all his sins, he was a better man than the lot of them rejoicing at the foot of the cottonwood tree.\" (http://www.worldnetdaily.com/staticarticles/article55179.html)", 
   {
    "unicode_changes_made": true
   }, 
   258474, 
   null, 
   1176497220.0
  ], 
  [
   258535, 
   null, 
   "Archangel", 
   "And here's an article by a woman who puts this situation into proper perspective I think.\n \n http://www.wnd.com/news/article.asp?ARTICLE_ID=55173\n \n Mob gives Imus the ol' heave-ho\n \n Posted: April 13, 2007\n 1:00 a.m. Eastern\n \n The future of Don Imus' nationally syndicated CBS radio show clearly hinged less on Les Moonves, CBS' chief executive, than on a lynch mob led by the Reverends Jesse Jackson and Al Sharpton. CBS fired Imus, after MSNBC dropped its TV simulcast of the \"Imus in the Morning\" radio program, because the broadcaster had referred to the predominantly black Rutgers women's basketball team as \"nappy-headed hos.\" \n \n The media monolith, pitchforks hoisted, has conducted a swift public trial meant to make an example of Imus and serve as a warning to all others who fail to march in lockstep. In solidarity with the offended women, members of the chattering class have been tripping over one another to show-off their suppurating stigmata. We heard from weatherman Al Roker, Whoopi Goldberg, Maya Angelou, Amy Holmes, Naomi Wolf - all spoke with one voice (so much for diversity). With few exceptions, everybody demanded that Imus be silenced, fired, retired. So said the National Association of Black Journalists. \n \n Extolled as the best this nation has to offer, the young players held a somber press conference, during which they honed the art of taking offense. Faces grim, the girls were as charitable as the Politburo. \"They had not decided whether they would accept Mr. Imus' apology,\" they informed the press. All they knew was that they had been \"scarred for life\"; that theirs was the collective howl of wounded womanhood. \"All of our accomplishments were lost, our moment was taken away,\" the women intoned. \n \n Said Essence Carson, the captain of the team: \n \n Not only has Mr. Imus stolen a moment of pure grace from us, but he has brought us to the harsh reality that behind the faces of the networks. They have worked so hard to convey a message and empowerment to young adults that somehow, some way the door has been left open to attack your leaders of tomorrow.\n Come again? Although the speeches of both black and white spokeswomen were short on grammatical English and long on banalities and clichés, everyone and his dog praised the girls for their extraordinary eloquence. \n \n An old git utters an ugly utterance, and these \"strong\" and sinewy women are stripped of \"all that they had worked for, all that they sacrificed for\"? Oh the hyperbole! Whatever happened to sticks and stones and all that? What about rising above the fray? Turning the other cheek? Not milking a situation tackily for all its worth? Where's the Christian forgiveness in all this? Were these athletes my daughters, I'd have advised them to lighten up, tell Gramps to get a grip, and get back to the game. \n \n The next stop on their Via Dolorosa is Oprah, naturally. \n \n Just so his fans know he's on the side of the angels, the insufferably sanctimonious Keith Olbermann, host of MSNBC's \"Countdown,\" made sure to divulge he had been agitating behind the scenes for Imus' removal. Olbermann then let Jesse Jackson of \"Hymietown\" fame (and friend to Louis Farrakhan) shake down MSNBC on air. I was unable to decipher Jackson's word salad, bar the demand for more black anchors and hosts on the network. \"Where were all the black talk-show hosts,\" Jackson wanted to know? \n \n Well, the one I liked most was axed by MSNBC: WND columnist Alan Keyes. Other than being overeducated, Keyes displayed a lamentable lack of tolerance for Palestinian suicide bombers. His show was terminated shortly after a magnificent display of moral outrage at the \"existential meaning of painstakingly - almost lovingly - packing parcels of shrapnel, ball-bearings, nails and rat poison, to lodge in the bodies of Israeli civilians,\" as I wrote in a 2002 column. \n \n Al Sharpton as the nation's moral arbiter: now that's a preposterous notion. Tawana Brawley anyone? The Crown Heights Riot? The first was a version of the Duke lacrosse libel, where a black girl, carefully coached by Sharpton, Nifonged a district attorney and some innocent police officers. Sharpton never retracted the rapist and racist epithets he slung at the falsely accused. The last saw Sharpton help incite an anti-Jewish riot, after a rabbi's motorcade accidentally ran over a black boy. Consequently, a young Jew was lynched by a mob chanting \"kill the Jew.\" Sharpton, a bent and brutal man with vengeance on his mind, was impenitent. \n \n I cringed when self-styled Jewish leaders like Abe Foxman of the Anti-Defamation League leapt into denazifying mode following Mel Gibson's anti-Jew petit mal. But this latest Sharpton-and-Jackson-led reign of terror has made Foxman look as genteel and sedate as an English squire. \n \n When in doubt about the latest media-fanned contagion, check with satirist Jon Stewart. He usually gets it. (And no, he's not a left-liberal; Stephen Colbert is. Stewart is a super smart left-libertarian, equally scathing about the left, the right and most of all, the media.) After announcing the winner in the media-manipulated Anna Nicole Smith paternity sweepstakes, Stewart set about placing the Imus burlesque in perspective. \n \n \"An off-hand remark uttered by an elderly man on the radio deserves nothing less than our full-team coverage,\" he quipped sarcastically, summoning the Daily Show's \"senior black correspondent\" and \"senior woman correspondent.\" The delicious Samantha Bee also pronounced herself expert on all things ho. A knuckle dragging, date rapist correspondent weighed in for balance. As Stewart noted, Imus had donned his contrition shades and tried to apologize, but when that didn't work, \"it was time for page two of the white-celebrity-struggling-with-racism playbook: sitting down with Al Sharpton or Jesse Jackson.\" \n \n But that failed, too. And that's something not even Stewart could have predicted.", 
   {
    "unicode_changes_made": true
   }, 
   258515, 
   null, 
   1176508380.0
  ], 
  [
   258569, 
   null, 
   "chloe", 
   "KC Star sportswriter Jason Whitlock hits the nail on the head in this interview.\n \n link", 
   {}, 
   258535, 
   null, 
   1176516600.0
  ], 
  [
   258570, 
   null, 
   "Steeeeve", 
   "So Imus's comments are merely \"mean\"? I'm wondering what you would consider a \"massively racist or sexist comment\" that someone might make on the radio that would warrant others making a \"big issue\" of?\n It wouldn't matter on the radio or not. A massively racist comment would be one that is hate filled such as saying \"black people are ignorant lazy good for nothing slobs\". I'd find that pretty racist. At the same time, Chris Rock jokes about things like that all the time and it doesn't offend me.\n \n \nIf I had a radio program that was also broadcast on TV I would be at least exercising the same kind of discretion I do when talking to my mom, my boss or dealing with clients. What's so tough about that? And furthermore, I don't THINK in these terms. If people on college campuses are, more's the pity. Do you really not see the point that Imus is not just \"some guy\", making remarks in a lunchroom?\nLocation or where something is said does make it more or less offensive. What makes something offensive AND racist or sexist is that 1) The comment was hate filled and meant to activitly degrade and 2) the comment was hurtful to a person that directly heard it. So why was this comment mean and offensive? Because the Rutgers players took it that way after it had been thrown in their face. Was it hate filled and meant to degrade the basketball team? No, it was a bad joke done in the moment. So the solution is to apologize to the team and move on. Making it out to be a racist and sexist comment is a bit much and to have him fired over it is just extreme. \n \n In the end, a mean comment is a mean comment no matter if 4 people hear it or 4 million. So unless you are prepared to fire everyone that has ever made a mean comment at a job then I'd say they went overboard.", 
   {}, 
   258470, 
   null, 
   1176516780.0
  ], 
  [
   258572, 
   null, 
   "Steeeeve", 
   "KC Star sportswriter Jason Whitlock hits the nail on the head in this interview.\n \n link\n\n \n nice find....what a smart guy. He did nail it", 
   {}, 
   258569, 
   null, 
   1176517380.0
  ], 
  [
   258575, 
   null, 
   "Phyllis", 
   "nice find....what a smart guy. He did nail it\n\n \n \n An important message from your local first amendment advocacy center:\n \n My sources tell me that you need to exercise greater caution in your posts. Whitlock, of course, is allowed to say it, but you are not allowed to publicly agree with him unless you satisfy the three criteria I posted here.\n \n Looking out for the little guy,\n \n President, your local first amendment advocacy center.", 
   {}, 
   258572, 
   null, 
   1176518220.0
  ], 
  [
   258591, 
   null, 
   "Archangel", 
   "KC Star sportswriter Jason Whitlock hits the nail on the head in this interview.\n \n link\n\n \n WOW Thank you Jason Whitlock. And chloe for posting this video that say's it better than anyone else through out this whole mess.", 
   {}, 
   258569, 
   null, 
   1176529980.0
  ], 
  [
   258593, 
   null, 
   "Steeeeve", 
   "An important message from your local first amendment advocacy center:\n \n My sources tell me that you need to exercise greater caution in your posts. Whitlock, of course, is allowed to say it, but you are not allowed to publicly agree with him unless you satisfy the three criteria I posted here.\n \n Looking out for the little guy,\n \n President, your local first amendment advocacy center.\n\n \n haha, Whitlock only qualified for one (he had no hair) and stop assuming im white :(", 
   {}, 
   258575, 
   null, 
   1176533280.0
  ], 
  [
   258799, 
   null, 
   "simone", 
   "So, why are you all ignoring the major point that some fine, outstanding young women from Rutgers were nastily characterized as nappy-headed hos?\n \n Why do you find that so wonderfully acceptable?", 
   {}, 
   258593, 
   null, 
   1176660180.0
  ], 
  [
   258808, 
   null, 
   "Steeeeve", 
   "So, why are you all ignoring the major point that some fine, outstanding young women from Rutgers were nastily characterized as nappy-headed hos?\n \n Why do you find that so wonderfully acceptable?\n\n \n I don't. I just think people are making too big of a deal out of it. You've said plenty of mean things in your life but no one is calling for your head.", 
   {}, 
   258799, 
   null, 
   1176664860.0
  ], 
  [
   258811, 
   null, 
   "JL...W", 
   "It wouldn't matter on the radio or not. A massively racist comment would be one that is hate filled such as saying \"black people are ignorant lazy good for nothing slobs\". I'd find that pretty racist. At the same time, Chris Rock jokes about things like that all the time and it doesn't offend me.\n\n \n Of course, it makes a difference if someone is on the radio or just at some job and for that matter, I really wonder at the circles you move in if you think this would be an acceptable comment at many jobs. Some jobs, sure, maybe. But not most. Why? Because \"nappy headed ho's\" is racist and sexist! Say it, or something like it enough times, have a managerial atmosphere that allows it, and I'm no lawyer, but I think a black woman working there would have grounds for a harassment case re \"a hostile environment\". I think that is one of the things that undid Imus -- that it was widely reported that this was not an isolated comment. \n \n And I disagree that it wasn't \"hate filled\". WHY say it? What was motivating him? Where did such language come from? A real joke might have been something related to their basketball prowess, which could have been mean as such attempts at humor often are, but referring to tattoos, the Producer saying \"Jigaboos\", and also \"nappy headed ho's\" is nothing BUT racist and sexist. \n \n Oh, and a racist making that remark about black people probably wouldn't acknowledge that it was \"hate filled\". He might even tell you it wasn't meant to degrade, not meant to be offensive, that it was not even his opinion, just fact. And then he'd trot out statistics to \"prove\" it. Or, he might even say, \"Hey, it was just a joke\". \n \n The day after Imus was fired, his wife did his radio show and implored listeners to quit sending hate mail to the Rutger's team. Why do you think his supporters were sending hate mail to the Rutger's team? \n \n Anyone defending Imus might want to consider the company he's keeping. \n \n JL", 
   {}, 
   258570, 
   null, 
   1176665280.0
  ], 
  [
   258824, 
   null, 
   "Steeeeve", 
   "Of course, it makes a difference if someone is on the radio or just at some job and for that matter, \n\n How on earth does it make a difference? A racist is a racist whether he is on the radio or working at Burger King. \n \n \n I really wonder at the circles you move in if you think this would be an acceptable comment at many jobs. \nNot sure I said this....\n \n \n\n And I disagree that it wasn't \"hate filled\". WHY say it? What was motivating him? Where did such language come from? A real joke might have been something related to their basketball prowess, which could have been mean as such attempts at humor often are, but referring to tattoos, the Producer saying \"Jigaboos\", and also \"nappy headed ho's\" is nothing BUT racist and sexist. \nYou obviously haven't seen the movie he was referring to. It was an aspect of that movie. As for this being \"hate filled\"...have you never ever said something that was probably mean but you didn't mean it to be? If not then you are a liar and if you have then quit your job because you feel people should be fired for mean comments.\n \n I don't even like Imus nor do I think he is a nice person...but to want him to be fired over this is just insane and the people that wanted him fired for this are hypocrites.", 
   {}, 
   258811, 
   null, 
   1176681600.0
  ], 
  [
   258826, 
   null, 
   "zachvac", 
   "So, why are you all ignoring the major point that some fine, outstanding young women from Rutgers were nastily characterized as nappy-headed hos?\n \n Why do you find that so wonderfully acceptable?\n\n \n \"Sticks and stones can break my bones but words can never hurt me\"\n \n Yeah he was mean, but calling people names never hurt anyone. People are free to say whatever they want, they can be mean, they can criticize the government, they can call people \"nappy-headed hos\". But the stations don't have to broadcast you if you're going to do that, which is why he's been dropped. I'd never heard of him before this incident, but he sounds like an idiot, but XXXXXX have a right to say what they want too. And if no one wants to listen to him, he won't have a show. If he does, he has the right to talk and they have the right to listen to him.", 
   {}, 
   258799, 
   null, 
   1176682860.0
  ], 
  [
   259337, 
   null, 
   "DrNo", 
   "I have been saying this for a long time: We live in a \"Culture of Offense.\" Everybody is offended by something. Soon we won't be allowed to express our opinions anymore without it being approved by some government agency. Political correctness is a clever way of abolishing free speech. Imus has the right to say whatever he wants on the radio, no matter how ignorant, offensive, or idiotic his comments may be. And...surprise! Anybody who finds his comments ignorant, offensive, or idiotic has the right to say so. What I don't understand is why people start demanding that he lose his job. How many things do you think Imus has said throughout his entire career that may have offended someone? Get over it! This is pathetic. You are upset over words? You are offended by a XXXXX?\n \n For all of you out there who were offended by Imus' remarks: I'm offended that you're offended. \n \n Now what?", 
   {
    "post_info": {
     "post_title": "Culture of Offense"
    }
   }, 
   258826, 
   null, 
   1176932940.0
  ], 
  [
   259341, 
   null, 
   "jim's trucking", 
   "I have been saying this for a long time: We live in a \"Culture of Offense.\" Everybody is offended by something. Soon we won't be allowed to express our opinions anymore without it being approved by some government agency. Political correctness is a clever way of abolishing free speech. Imus has the right to say whatever he wants on the radio, no matter how ignorant, offensive, or idiotic his comments may be. And...surprise! Anybody who finds his comments ignorant, offensive, or idiotic has the right to say so. What I don't understand is why people start demanding that he lose his job. How many things do you think Imus has said throughout his entire career that may have offended someone? Get over it! This is pathetic. You are upset over words? You are offended by a XXXXX?\n \n For all of you out there who were offended by Imus' remarks: I'm offended that you're offended. \n \n Now what?\nYou're fired!\n \n \n Imus got fired because the candy-assed advertizers are scared clueless of the REVERENDS Sharpton and Jackson. The REVERENDS Sharpton and Jackson attack the advertizers and threaten boycotts because they can. It's their most useful tool in the struggle to make sure that blacks are pampered and whites are beat down.\n \n Neither of the REVERENDS Sharpton nor Jackson is worth an ounce of spit!", 
   {}, 
   259337, 
   null, 
   1176934380.0
  ], 
  [
   259343, 
   null, 
   "Master_Shake", 
   "I don't even think it was that offensive. I'd be willing to bet that of the thousands of people that heard that live 99% of them probably didn't think twice about it. \n \n It is certainly no more offensive then saying the Florida State football team all came from jail (as an example)....its a just a funny comment to poke fun of the fact that a lot of FSU players have gone to jail.\n\n Ok, I see. So this was a funny comment to point out that a lot of women on the Rutgers team are prostitutes. Thanks for clearing that up Steeeeve.", 
   {}, 
   257710, 
   null, 
   1176935280.0
  ], 
  [
   259350, 
   null, 
   "gamehuis", 
   "Wow. A lot of people here got their Offense-O-Meter(t/m) fine tuned to \"Ultra sensitive\".", 
   {}, 
   259343, 
   null, 
   1176937500.0
  ], 
  [
   259356, 
   null, 
   "wascallywabbit", 
   "Wow. A lot of people here got their Offense-O-Meter(t/m) fine tuned to \"Ultra sensitive\".\n\n \n **\n Sounds more to me like a bunch of right-wing, no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads don't grasp the offensiveness of racist and chauvinist and other insults applied to groups of people, so long as they themselves do not belong to that group. If I haven't made you understand already, imagine a well-known media personality saying what I've just said to you, right out loud, to all the world, but off-the cuff and for no reason. Just to be 'witty' about right-wingers.\n \n Next time a black sport or other announcer casually describes a mostly caucasian bb team as a bunch of string-bean honkies on steroids, we'll see what happens. Oh, you say that's never happened yet!?! Gee, I guess you're right about that. I wonder why not?\n \n ww", 
   {}, 
   259350, 
   null, 
   1176939540.0
  ], 
  [
   259403, 
   null, 
   "DrNo", 
   "**\n Sounds more to me like a bunch of right-wing, no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads don't grasp the offensiveness of racist and chauvinist and other insults applied to groups of people, so long as they themselves do not belong to that group. If I haven't made you understand already, imagine a well-known media personality saying what I've just said to you, right out loud, to all the world, but off-the cuff and for no reason. Just to be 'witty' about right-wingers.\n \n Next time a black sport or other announcer casually describes a mostly caucasian bb team as a bunch of string-bean honkies on steroids, we'll see what happens. Oh, you say that's never happened yet!?! Gee, I guess you're right about that. I wonder why not?\n \n ww\n\n \n Good point here, because the media never insults right-wingers....emoticon_rolleyes \n \n I don't think anybody is denying that Imus' comments were tasteless and offensive. The point that is being made here is that he has the right to make such comments. He didn't discriminate against anyone. He simply said something stupid. If this is going to be considered a crime, we would all be locked away.", 
   {}, 
   259356, 
   null, 
   1176994200.0
  ], 
  [
   259411, 
   null, 
   "gamehuis", 
   "**\n Sounds more to me like a bunch of right-wing, no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads don't grasp the offensiveness of racist and chauvinist and other insults applied to groups of people, so long as they themselves do not belong to that group. If I haven't made you understand already, imagine a well-known media personality saying what I've just said to you, right out loud, to all the world, but off-the cuff and for no reason. Just to be 'witty' about right-wingers.\n\n I have absolutely no problem with that. As long as it's not slanderous or inciting hatred, people can say whatever they please, even if it offends other (or should that be \"especially if it offends other\"?).\n \n I suggest that you read what the honorable dr. Ron Paul has to say about the issue: \n \n http://www.lewrockwell.com/paul/paul381.html\n \n Kinda makes sense, doesn't it?", 
   {}, 
   259356, 
   null, 
   1176996180.0
  ], 
  [
   259416, 
   null, 
   "Archangel", 
   "**\n Sounds more to me like a bunch of right-wing, no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads don't grasp the offensiveness of racist and chauvinist and other insults applied to groups of people, so long as they themselves do not belong to that group. If I haven't made you understand already, imagine a well-known media personality saying what I've just said to you, right out loud, to all the world, but off-the cuff and for no reason. Just to be 'witty' about right-wingers.\n \n Next time a black sport or other announcer casually describes a mostly caucasian bb team as a bunch of string-bean honkies on steroids, we'll see what happens. Oh, you say that's never happened yet!?! Gee, I guess you're right about that. I wonder why not?\n \n ww\n\n \n WOW, you direct your ignorant slander at Right Wing Conservatives as if we started this scandal and insulted the Rutgers Team when an avowed liberal made the statements that offended the whole Country. So who are the real no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads that were exposed for what they are in this debacle ? The evidence shows they are liberals.\n \n This was an excellant example of the left eating its own as the same pundits who used Imus as a personal platform for spewing their venom were the first to turn on him and burn him at the proverbial stake. But you, in your twisted logic are still able to blame the right for the scandal they had nothing to do with promoting or causing at all.", 
   {}, 
   259356, 
   null, 
   1176997500.0
  ], 
  [
   259679, 
   null, 
   "Archangel", 
   "Originally Posted by wascallywabbit \n **\n Sounds more to me like a bunch of right-wing, no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads don't grasp the offensiveness of racist and chauvinist and other insults applied to groups of people, so long as they themselves do not belong to that group. If I haven't made you understand already, imagine a well-known media personality saying what I've just said to you, right out loud, to all the world, but off-the cuff and for no reason. Just to be 'witty' about right-wingers.\n \n Next time a black sport or other announcer casually describes a mostly caucasian bb team as a bunch of string-bean honkies on steroids, we'll see what happens. Oh, you say that's never happened yet!?! Gee, I guess you're right about that. I wonder why not?\n ww\n\n \n WOW, you direct your ignorant slander at Right Wing Conservatives as if we started this scandal and insulted the Rutgers Team when an avowed liberal made the statements that offended the whole Country. So who are the real no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads that were exposed for what they are in this debacle ? The evidence shows they are liberals.\n \n This was an excellant example of the left eating its own as the same pundits who used Imus as a personal platform for spewing their venom were the first to turn on him and burn him at the proverbial stake. But you, in your twisted logic are still able to blame the right for the scandal they had nothing to do with promoting or causing at all.", 
   {}, 
   259416, 
   null, 
   1177124760.0
  ], 
  [
   259682, 
   null, 
   "JPSartre12", 
   "**\n Sounds more to me like a bunch of right-wing, no-neck, knuckle-dragging, drool-soaked, self-righteous slope-heads don't grasp the offensiveness of racist and chauvinist and other insults applied to groups of people, so long as they themselves do not belong to that group. If I haven't made you understand already, imagine a well-known media personality saying what I've just said to you, right out loud, to all the world, but off-the cuff and for no reason. Just to be 'witty' about right-wingers.\n \n Next time a black sport or other announcer casually describes a mostly caucasian bb team as a bunch of string-bean honkies on steroids, we'll see what happens. Oh, you say that's never happened yet!?! Gee, I guess you're right about that. I wonder why not?\n \n ww\n\n \n You're obviously not familiar with \"The Fighting Whities\" I see. \n \n \n\n \n 'Fightin' Whities' Cash in on Controversy\n \n By Dana Williams | Staff writer, Tolerance.org \n Jan. 23, 2003 -- When members of the University of Northern Colorado's intramural basketball team named themselves the \"Fightin' Whities\" last year, they were hoping to make a point. They ended up making a whole lot more. \n \n The UNC team adopted the \"Fightin' Whities\" name after an unsuccessful attempt to get nearby Eaton High School to drop the use of a loin-cloth clad caricature for its team, \"Fighting Reds.\" \n \n The satirical move set off a media frenzy and requests poured in for shirts, hats and other merchandise bearing the \"Fightin' Whities\" name and slogan, \"Everythang's gonna be all white.\" \n \"We never really thought anything would become of it,\" said Jeff Van Irwarden, a senior on the basketball team and manager of the T-shirt campaign. \"We just wanted to send a message to Eaton by doing the same thing they had done. But it really went beyond anything we could have ever expected.\" \n \n Internet sales of the T-shirts and hats, featuring the team name, slogan and a caricature of a grinning white guy, have raised more than $125,000 to be used as scholarship money for Native American students at UNC. \n VanIrwarden says the team - made up of white, Native American and Hispanic students - didn't initially set out to make a profit from its new name. \n \n \"We were just trying to send a message at first. But when the media calls starting coming and we saw that people wanted to get shirts and were willing to pay money for them, we decided to put together the T-shirt campaign and the scholarship foundation.\" \n \n More than 15,000 shirts and hats have been sold, with proceeds placed in an endowment for two scholarships per year. VanIrwarden says he expects the first scholarship to be awarded this fall. \n Others are cashing in on the controversy too. \n \n Last fall a local brewery announced a new Fightin' White Wheat beer. Management at Smiling Moose Brew Pub and Grill says the new wheat beer with a hint of orange peel and coriander has gained a loyal following. \n \n And across the country, activists in the fight against racist mascots are taking notice of the \"Fightin' Whities'\" success. \n \n \"They are really doing a good job of making a point,\" said Jen Tayabji, a student at the University of Illinois at Urbana-Champaign. \"They're getting a lot of attention and getting people who might not have been interested in the issue to start thinking about it.\" Tayabji is a member of the university's Progressive Resource Action Cooperative, which is spearheading its own movement against UIUC's mascot, Chief Illiniwek. \n \n But VanIrwarden admits not everyone who purchases \"Fightin' Whities\" merchandise does so because they understand or identify with the cause. Many people, he says, just think it's funny. The team has even received merchandise requests from white supremacists. \n \n \"It's hard to show the majority what it's like to be discriminated against,\" said VanIrwarden. \n \n One visitor to the message board at the \"Fightin' Whities\" Web site put it this way: \n \n I think that the white community is not offended because it sits in the position of being the MAJORITY racial group and does not feel threatened. Most whites do not know what it feels like to be a minority in a community. They cannot thus feel threatened by being inundated with cultural hypocrisy thrown in their faces.\n Another post by someone identifying himself as \"One Tall White Boy,\" further illustrates the depth of the debate: \n \n I think its hilarious that someone thought this would be offensive... I think its great. I am white and love it!! This is a support! As far as the Indian MASCOTS, give me a break. If I was Indian I would be thrilled to have my culture be the center of a professional football team... I am going to buy a fighting whitie T-shirt, wear it with pride along with my Cleveland Indian Hat and Washington Redskin Boxers!\n \n\n Unfortunately for them, white people got a kick out of it and the school was flooded with requests for Fighting Whities jerseys. The demand was so great that cafepress was commissioned to provide the T-shirts. The proceeds went towards scholarships. \n http://www.cafepress.com/fightinwhite/106", 
   {
    "unicode_changes_made": true
   }, 
   259356, 
   null, 
   1177126080.0
  ], 
  [
   269948, 
   null, 
   "Aivlis", 
   "Don Imus may ver well have the right to say such things as \"nappy headed hos\" but do we have to stand for it? I understand that some people are confused or upset over the notion that black people are allowed to say those things, but I think people are looking at it the wrong way. Not that I agree with this approach in the given context but like many feminists who continue to use the often derogatory word \"feminism\", they are in fact trying to re-claim that word if you will. Perhaps some of the comedians and rappers are using these words in their shows and songs to demean their power, to say to the white community, \"these are only words and the more we use and parody them, the less power they have over us\". This might not be working of course, but I think that might be part of the idea.\n \n Of course it becomes a whole new agrument when we involve sexist terms and images like Don Imus' comment and the rap videos seen all over MTV. I'm not really sure what to say about these things except for the fact that it seems to be part of a rapper's culture to demean women in this way. I believe there are a few people in the industry trying to change this.\n \n My whole point is that I get very upset when people say, \"enough with political correctness\" or, \"he was using his right to free speech\". I do not think that is an excuse to make demeaning comments about any sex or race, whoever you are. It is not about \"political correctness\" but about changing the consciousness of peoples minds so that hopefully these terms will never be used again. I also think that the racism part of Imus' comment definately overshadowed the sexist part. It seems that in this country, while we pretend to be progressive and tout that we have forsaken racism, it is obvious that we are still very much a racist society. Also, that sexism gets pushed to the back burner while we deal with more \"controversial\" issues like racism. It is not sexist in itself to ignore sexist comments like these? \n \n I think the reason why we continue to fight about these issues is not because some people are racist still and others aren't...it is because we do not have a clear definition of what racism actually is. Some people would say that it is making comments like Imus, or discriminating against people of color, or even commiting hate crimes against people of color. However, some people would argue that just thinking about people's color is racist...if you clutch your purse tighter to your body while passing a black man on the street, you would be considered racist by some. \n \n Take one day and pay attention to the first thoughts that come into your mind when you see a stranger walk into a room, is it not their race first and sex second?", 
   {}, 
   259682, 
   null, 
   1182461400.0
  ], 
  [
   269989, 
   null, 
   "JPSartre12", 
   "Don Imus may ver well have the right to say such things as \"nappy headed hos\" but do we have to stand for it? I understand that some people are confused or upset over the notion that black people are allowed to say those things, but I think people are looking at it the wrong way. Not that I agree with this approach in the given context but like many feminists who continue to use the often derogatory word \"feminism\", they are in fact trying to re-claim that word if you will. Perhaps some of the comedians and rappers are using these words in their shows and songs to demean their power, to say to the white community, \"these are only words and the more we use and parody them, the less power they have over us\". This might not be working of course, but I think that might be part of the idea.\n \n Of course it becomes a whole new agrument when we involve sexist terms and images like Don Imus' comment and the rap videos seen all over MTV. I'm not really sure what to say about these things except for the fact that it seems to be part of a rapper's culture to demean women in this way. I believe there are a few people in the industry trying to change this.\n \n My whole point is that I get very upset when people say, \"enough with political correctness\" or, \"he was using his right to free speech\". I do not think that is an excuse to make demeaning comments about any sex or race, whoever you are. It is not about \"political correctness\" but about changing the consciousness of peoples minds so that hopefully these terms will never be used again. I also think that the racism part of Imus' comment definately overshadowed the sexist part. It seems that in this country, while we pretend to be progressive and tout that we have forsaken racism, it is obvious that we are still very much a racist society. Also, that sexism gets pushed to the back burner while we deal with more \"controversial\" issues like racism. It is not sexist in itself to ignore sexist comments like these? \n \n I think the reason why we continue to fight about these issues is not because some people are racist still and others aren't...it is because we do not have a clear definition of what racism actually is. Some people would say that it is making comments like Imus, or discriminating against people of color, or even commiting hate crimes against people of color. However, some people would argue that just thinking about people's color is racist...if you clutch your purse tighter to your body while passing a black man on the street, you would be considered racist by some. \n \n Take one day and pay attention to the first thoughts that come into your mind when you see a stranger walk into a room, is it not their race first and sex second?\n\n \n \n It is purely about political correctness when a white radio host, paid to be funny gets crucified for making a silly comment when black \"so-called\" civic leaders like Sharpton and Jackson can make anti-white, anti-semetic comments until the cows come home. And the same many people that yelled for Imus' head were the ones defending cop killer lyrics in rap songs. Sure, it's about political correctness. White men are politically correct targets, blacks aren't. PERIOD. :xcensored \n OJ wasn't acquitted because the jury believed that he was innocent. He was acquitted because the defense council painted an irrelevant investigating officier as a racist and they were punishing him and NOT OJ, because the officier was white and OJ was \"one of us\". :xcensored", 
   {}, 
   269948, 
   null, 
   1182473460.0
  ], 
  [
   270121, 
   null, 
   "Aivlis", 
   "Let me guess, you're white?\n \n I'm sorry for all those people crying for Don Imus, but he is a grown man that should understand the ramifications of racist comments in todays society. \n \n I am not advocating black on black or black on white racism, but we must understand history in order to understand the present.\n \n Much in the same way that I do not have sympathy for the scared and ignorant \"war on terror\" fanatics of this country, I find it hard to bring myself to feel bad for a white man who was fired because of his \"silly\" comment when he knew perfectly well that he was being a jackass. People on public radio understand that their job requires a certain bit of class. I'm not at all for censorship, but that does not mean I'm going to laugh at some #######'s comments.\n \n This country has done nothing but persecute people from its creation. We left England for religious freedom, came here and massacred the Indians and enslaved the blacks, now we're killing every muslim we can find. Bravo America, feel proud. Do you really blame these people for hating our guts? I don't\n \n We're aren't the only racist country of course, but when we pretend that we like diversity and people of color it is sickening. Don Imus' comments only prove the twisted consciousness of the deeply rooted and engrained racism in this country.", 
   {}, 
   269989, 
   null, 
   1182535680.0
  ], 
  [
   270190, 
   null, 
   "jim's trucking", 
   "Let me guess, you're white?\n \n I'm sorry for all those people crying for Don Imus, but he is a grown man that should understand the ramifications of racist comments in todays society. \n \n I am not advocating black on black or black on white racism, but we must understand history in order to understand the present.\n \n Much in the same way that I do not have sympathy for the scared and ignorant \"war on terror\" fanatics of this country, I find it hard to bring myself to feel bad for a white man who was fired because of his \"silly\" comment when he knew perfectly well that he was being a jackass. People on public radio understand that their job requires a certain bit of class. I'm not at all for censorship, but that does not mean I'm going to laugh at some #######'s comments.\n \n This country has done nothing but persecute people from its creation. We left England for religious freedom, came here and massacred the Indians and enslaved the blacks, now we're killing every muslim we can find. Bravo America, feel proud. Do you really blame these people for hating our guts? I don't\n \n We're aren't the only racist country of course, but when we pretend that we like diversity and people of color it is sickening. Don Imus' comments only prove the twisted consciousness of the deeply rooted and engrained racism in this country.\nLet me guess, your eyes are brown.\n \n I fear you are full to the brim.\n \n What you say is only partially true and completely inadequate to fully describe this country and what it offers.\n \n Imus was a victim of the double standard held by the Fake Reverends Sharpton and Jackson...and the double standard applied to the use of such words as got him in trouble.\n \n Perhaps you have black on black crime confused with racism. Please explain black on black racism...and just why do you mention only blacks and whites?...there are numerous other races suffering from racism.\n \n Scared and ignorant is hardly a true description of those who are opposing the terrorists. Without the efforts to discover what the maniacal Muslim deviants are planning, there'd have been many more innocent deaths by now. Clandestine surveilance is required in this effort. I'm convinced the ignorance here belongs to you. If you leave these people alone, they will convert or kill you. These people 'hate our guts' because we are not all Muslims. Why hellfire, they even kill each other for not being the right kind of Muslim.\n \n This country has done a lot more than just persecute people.\n \n We did indeed mistreat the natives here, we did not start the practice of slavery. Blacks sold blacks to anyone who would buy them long before the colonization of America began. We're not killing every Muslim we can find. Many of us have Muslim friends. There are several at my company. There are about 2300 mosques in the US with some 400 of them being run by radical E-mommys (or whatever thy're called) preaching death to all non-Muslims. It's only these radical Muslims that need to be killed...unless of course you'd like to sit down over a cup of tea and convince them of their error in demanding our conversion to Islam. Good luck, buddy! It ain't gonna happen.\n \n Racism exists everywhere. That doesn't make it right, but it redirects your comments to all countries.", 
   {}, 
   270121, 
   null, 
   1182545940.0
  ], 
  [
   270201, 
   null, 
   "Aivlis", 
   "Actually, my eyes are gray, but thanks for trying.\n \n What I meant was that I'm sick of people saying, \"if a black person can call another black person nigger, why do I get in trouble for the same thing?\"\n \n Well it seems that the people who say this really, deep down, would like to be able to say these remarks to blacks...or other derogatory remarks to any other race. Instead of crying because you'll get in trouble for it for being white, why don't you try and figure out a way to stop it from happening all together. Well, that probably won't happen very soon because it takes a long time to change the way people think. This country likes to say that we've progressed and we aren't a racist country any more, but that is not true. The thing about other countries is that many of them openingly admit to being racist, but we here in America are secretly ashamed of the fact that we are so we pretend like it doesn't exist. \n \n Oh, I'm sorry, I guess you forgot about the 650,000 people that have been killed since we invaded Iraq. The people fleeing the country, I believe that is called a brain-drain, since the only people who can afford to leave are the educated upper-class. Mothers and Fathers picking up their dead children off the side of the road. Oh yeah, why did we invade Iraq again? 911? right. I thought Bid Laden was in Afghanistan...I guess I was wrong. So the muslims hate us for our freedom, lets go kill them all...make sure to kill all those young boys so they don't grow up and hate us even more. This country will never be not hated, so I guess we should just blow up the rest of the world so we can live in peace with our money and our power, except we won't have any more power to exert because their will be no more people to control... shucks. Violence only begets violence, that is what people who are supporting the war should expect...violence and death and the destruction of lives and peace for them and for us. \n \n As for slavery, we all know Africa has many many problems. However, isn't America supposed to be a part of the free world? So I guess all those black slave traders over in Africa forced those slaves upon us...darn. I guess those big fat rich plantation owners really didn't like the fact that they sat around all day sipping tea while those damn unwanted slaves made all their money for them. GIVE ME A BREAK", 
   {}, 
   270190, 
   null, 
   1182547320.0
  ], 
  [
   270208, 
   null, 
   "Steeeeve", 
   "Well we can tell this guy doesn't look at facts too often. Instead of seeing if the 50-60 thousand numbers were correct (and there are many) you go directly to the disputed 650,000 number. \n \n So, are you white Aivlis....certainly seems like it.", 
   {}, 
   270201, 
   null, 
   1182548580.0
  ], 
  [
   270214, 
   null, 
   "jim's trucking", 
   "Actually, my eyes are gray, but thanks for trying.\n \n What I meant was that I'm sick of people saying, \"if a black person can call another black person nigger, why do I get in trouble for the same thing?\"\nWhy are you sick of that question. Complete fairness would say that any word that blacks can use without retribution should be available for anyone's use without retribution.\n \n \n\n Well it seems that the people who say this really, deep down, would like to be able to say these remarks to blacks...or other derogatory remarks to any other race. \nI seriously doubt that you truly know what other people think or what their motives are in using certain words.\n \n \n Instead of crying because you'll get in trouble for it for being white, why don't you try and figure out a way to stop it from happening all together. Well, that probably won't happen very soon because it takes a long time to change the way people think. \nWho's crying? You seem to confuse discussion of a topic with crying.\n \n \n This country likes to say that we've progressed and we aren't a racist country any more, but that is not true. \nAgain, you boast of knowledge you do not have. What spokesman for 'this country' taught you what 'this country likes to say'?\n The thing about other countries is that many of them openingly admit to being racist, but we here in America are secretly ashamed of the fact that we are so we pretend like it doesn't exist. \nI'm pretending no such thing. I know racism exists everywhere. \n \n \n\n Oh, I'm sorry, I guess you forgot about the 650,000 people that have been killed since we invaded Iraq. The people fleeing the country, I believe that is called a brain-drain, since the only people who can afford to leave are the educated upper-class. Mothers and Fathers picking up their dead children off the side of the road. Oh yeah, why did we invade Iraq again? 911? right. I thought Bid Laden was in Afghanistan...I guess I was wrong. So the muslims hate us for our freedom, lets go kill them all...make sure to kill all those young boys so they don't grow up and hate us even more. This country will never be not hated, so I guess we should just blow up the rest of the world so we can live in peace with our money and our power, except we won't have any more power to exert because their will be no more people to control... shucks. Violence only begets violence, that is what people who are supporting the war should expect...violence and death and the destruction of lives and peace for them and for us. \nI won't get into a numbers game with you. Most of the topics you mentioned have been beaten to death already anyway.\n \n You just need to remember that it's not all the Muslims that need killing...just the radical ones who call for our conversion or death. Turning the other cheek will not slow them at all.\n \n Kill emoticon_xkill all radical Muslims and those who support them...and their children!\n \n \n\n As for slavery, we all know Africa has many many problems. However, isn't America supposed to be a part of the free world? So I guess all those black slave traders over in Africa forced those slaves upon us...darn. I guess those big fat rich plantation owners really didn't like the fact that they sat around all day sipping tea while those damn unwanted slaves made all their money for them. GIVE ME A BREAK\nYou indeed need a break. Slave trade involved sales of humans to humans for thousands of years. Egyptians used slaves to build the pyramids. It was not created for the US plantation owners. Slavery still exists in many countries...India, Pakistan and more. That's why you are able to wear such cheap shirts and tennis shoes.", 
   {}, 
   270201, 
   null, 
   1182550680.0
  ], 
  [
   270228, 
   null, 
   "Aivlis", 
   "Well we can tell this guy doesn't look at facts too often. Instead of seeing if the 50-60 thousand numbers were correct (and there are many) you go directly to the disputed 650,000 number. \n \n So, are you white Aivlis....certainly seems like it.\n\n \n First of all, I'm female...maybe you should not assume so much. \n \n Many people dispute the actual death toll in Iraq, Bush says it's around 30,000. Others say close to 100,000, others over 650,000 thousand. It all depends on the type of research you conduct in order to come up with these numbers. I sure as hell am not going to believe anything that comes out of Bush's mouth though. Where do you get your numbers steve? Here is a nice CNN article that talks about this very topic\n http://www.cnn.com/2006/WORLD/meast/10/11/iraq.deaths/\n \n \nKill all radical Muslims and those who support them...and their children!\n \n\n \n After that comment, I see no real further reason to continue discussing topics with someone of your mentality, it obviously will go no where...\n \n The trouble is, during the chaos of war, how can you really tell the difference between a radical and a non-radical? Do they have cardboard sandwich signs proclaiming their radical muslim faith? Many innocent, everyday Iraqis have been killed in this war for no reason. I know a man who recently got back from Iraq saying that his fellow soldiers would get so crazy from all this anti-islam, anti-middle eastern propaganda that they would actually gun down random Iraqis in the streets. That same soldier came back from war with a deep resentment towards fundamental christians and their greed for power and control. Christians and Muslims do it different ways, but we all want power...the history of Christianity and the Western world is full of disgusting accounts of senseless slaughter in the name of religion...do you think we are any better than them? Look up Edward Said and his theory of Orientalism and you might understand how we've marginalized and othered those in the Middle East and Asia.\n \n You seem to be missing my point about Slavery. I know it happens all over the world, but I'm specifically talking about this country and it's history so please focus on what I'm saying. Nobody shoved these slaves down our throats, no black slave-traders in Africa convinced us to hang, refuse services to and generally treat blacks like dogs for hundreds of years. Do you sort of understand my point...that maybe this country has a lot of problems and that the people in this country really haven't changed all too much no matter how much we proclaim diversity. Case in point, Don Imus...oh, I'll throw in all those other rappers also so you don't think I'm only picking on whites.\n \n P.S. I'll make sure to make my own clothes and tennis shoes from now on. : )", 
   {}, 
   270214, 
   null, 
   1182554580.0
  ], 
  [
   270238, 
   null, 
   "JPSartre12", 
   "Let me guess, you're white? \n\n No, I'm an American. \n \n\n I'm sorry for all those people crying for Don Imus, but he is a grown man that should understand the ramifications of racist comments in todays society. \n \n\n So, what you're saying is that we should expect our freedom of speech to be diminished today? I didn't get the memo stating that my first amendment rights had been suspended, did you?\n \n\n I am not advocating black on black or black on white racism, but we must understand history in order to understand the present.\n \n\n Please, I first heard Don Imus over 30 years ago while attending college in North Jersey. He was far more controversial then. We've allowed the PC police to intimidate everyone who doesn't mind his politically correct P's and Q's.\n \n\n Much in the same way that I do not have sympathy for the scared and ignorant \"war on terror\" fanatics of this country, I find it hard to bring myself to feel bad for a white man who was fired because of his \"silly\" comment when he knew perfectly well that he was being a jackass. People on public radio understand that their job requires a certain bit of class. I'm not at all for censorship, but that does not mean I'm going to laugh at some #######'s comments.\n\n Imus made a jaskass of himself for 40 years. It was his schtick(sp?)\n \n\n This country has done nothing but persecute people from its creation. We left England for religious freedom, came here and massacred the Indians and enslaved the blacks, now we're killing every muslim we can find. Bravo America, feel proud. Do you really blame these people for hating our guts? I don't. \n\n Maybe your right. We should have let SH kill off all of the Kurds and Shi'ia. While we're at it, let's rearm the Hutus and let them have a go at the Tutsis again. \n Your history is weak, your outrage misdirected. \n \n\n We're aren't the only racist country of course, but when we pretend that we like diversity and people of color it is sickening. Don Imus' comments only prove the twisted consciousness of the deeply rooted and engrained racism in this country.\n\n \n Don Imus' punishment only proves that white males can't be politically incorrect, but blacks can. Isn't that racist in itself? We have one set of standards for white celebrities and another one for black celebrities? emoticon_rolleyes", 
   {}, 
   270121, 
   null, 
   1182561180.0
  ], 
  [
   270356, 
   null, 
   "jim's trucking", 
   "First of all, I'm female...maybe you should not assume so much. \nSurely you don't believe that I believe that women are beneath me, do you? I mean, seriously. Why should I attach any significance to your gender? It's the thoughts you convey that interest me...for a while at least. \n \n \n \n\n Many people dispute the actual death toll in Iraq, Bush says it's around 30,000. Others say close to 100,000, others over 650,000 thousand. It all depends on the type of research you conduct in order to come up with these numbers. I sure as hell am not going to believe anything that comes out of Bush's mouth though. Where do you get your numbers steve? Here is a nice CNN article that talks about this very topic\n http://www.cnn.com/2006/WORLD/meast/10/11/iraq.deaths/\n \n \n...and here's a nice article that also talks about this very topic.\n \n http://www.4forums.com/political/showthread.php?p=270346#post270346\n \n \n You can comment on it in that thread if you like. I look forward to your true opinions.\n \n \n \n\n After that comment, I see no real further reason to continue discussing topics with someone of your mentality, it obviously will go no where...\nMy mentality has little to do with your need to converse with me. Your mode of ignorance gained through ignoring your opposition is common among appeasing philosophies such as held by those of you who choose to ignore the maniacal, deadly mentality of proven sworn enemies vowing to kill convert or kill you. In the face of recent history, your ignorance is turning into utter stupidity.\n \n \n\n The trouble is, during the chaos of war, how can you really tell the difference between a radical and a non-radical? Do they have cardboard sandwich signs proclaiming their radical muslim faith?\nNo. They sneak into crowds looking like good old Joe's and then blow themselves and innocent others into small pieces in the name of Allah and in want of some imaginery virgins awaiting them in the afterlife...if they really have one. If Allah punishes those who murder innocent people, then perhaps the suicide bombers go straight to hell, do not pass go and do not collect $200. God only knows.\n \n The only defense against this type of activity is to detect and foil the plans of those radicals.\n \n \n Many innocent, everyday Iraqis have been killed in this war for no reason. I know a man who recently got back from Iraq saying that his fellow soldiers would get so crazy from all this anti-islam, anti-middle eastern propaganda that they would actually gun down random Iraqis in the streets. That same soldier came back from war with a deep resentment towards fundamental christians and their greed for power and control. Christians and Muslims do it different ways, but we all want power...the history of Christianity and the Western world is full of disgusting accounts of senseless slaughter in the name of religion...do you think we are any better than them? Look up Edward Said and his theory of Orientalism and you might understand how we've marginalized and othered those in the Middle East and Asia.\nPerhaps you should report this to the DoD..with names of course. I suspect you are adept at making up stories...sort of like parables that may have not really happened.\n \n If you want me to read Edward Said, post a link to his writings. If you want to read some Michael Coren...\n \n http://www.4forums.com/political/showthread.php?p=270346#post270346\n \n \n \n\n You seem to be missing my point about Slavery. I know it happens all over the world, but I'm specifically talking about this country and it's history so please focus on what I'm saying. Nobody shoved these slaves down our throats, no black slave-traders in Africa convinced us to hang, refuse services to and generally treat blacks like dogs for hundreds of years. Do you sort of understand my point...that maybe this country has a lot of problems and that the people in this country really haven't changed all too much no matter how much we proclaim diversity. Case in point, Don Imus...oh, I'll throw in all those other rappers also so you don't think I'm only picking on whites.\nSounds precisely like something the Fake Reverends Jesse 'it's okay for me to have a mistress' Jackson and Albert Charlaton would say in their insistence upon living in the past.\n \n You can drop the 'we' and 'us' when talking about slavery to me. What has happened is history in regard to slavery in the US (except for the sex slave trade which is alive an well in all countries). The plantation days are over. The slaves have been freed. In case you didn't notice, that happened well over a hundred years ago. Neither you nor I had a damn thing to do with slavery or the abolition of it. You shouldn't expect pity and free gifts to last forever following emancipation of oppressed peoples. Work for what you get, protect what you have, enjoy life.\n \n Get and maintain a JOB!\n \n Kill emoticon_xkill all radical Muslims and those who support them! ...and their children!\n \n Have a drink on me!emoticon_xhoho \n \n \n \n\n P.S. I'll make sure to make my own clothes and tennis shoes from now on. : )\nI knew I could count on a ridiculous reply to that one.", 
   {}, 
   270228, 
   null, 
   1182627240.0
  ], 
  [
   270547, 
   null, 
   "Phunting", 
   "Kill emoticon_xkill all radical Muslims and those who support them! ...and their children!\nemoticon_xdonno Yeah nice Jim. Living perpetuation of the mentality that just makes the defense against such people so much harder.", 
   {}, 
   270356, 
   null, 
   1182728460.0
  ], 
  [
   270689, 
   null, 
   "jim's trucking", 
   "emoticon_xdonno Yeah nice Jim. Living perpetuation of the mentality that just makes the defense against such people so much harder.\nPlease propose another solution...mine would work...and will ultimately. One side will kill more of the other and win...for a while.", 
   {}, 
   270547, 
   null, 
   1182785040.0
  ], 
  [
   270973, 
   null, 
   "Aivlis", 
   "Jim, why aren't you off in Iraq fighting all the nasty terrorists huh?\n \n Would you kill yourself if the Iraqi's won?", 
   {}, 
   270689, 
   null, 
   1182879420.0
  ], 
  [
   270978, 
   null, 
   "jim's trucking", 
   "Jim, why aren't you off in Iraq fighting all the nasty terrorists huh?\n \n Would you kill yourself if the Iraqi's won?\nWhy aren't you telling us of your alternate to my solution?\n \n The Iraqi's have already won their freedom. It's the radical Muslims that we now battle. If they win, I won't have to kill myself...they'll do that for you. Then they'll kill you if you don't convert. Are you ready to convert to Islam and live under Sharia law as the radical Muslims insist. If not, you'd better insist that we fight to win.\n \n Do you realize what their caveman laws mean to women?", 
   {}, 
   270973, 
   null, 
   1182880860.0
  ], 
  [
   271091, 
   null, 
   "Phunting", 
   "Please propose another solution...mine would work...and will ultimately. One side will kill more of the other and win...for a while.\nDubious foreign policy aside, we have little control over foreign extremists beliefs. However the one thing that really shocks me is the 'home-grown' terrorists. It utterly staggers me to think that someone who grows up British could ever sympathize with such philosophy. But they have, and a lot of it is due to the alienation that many Muslims feel in this country.\n \n Now I'm hardly a bleeding liberal who thinks that this excuses it, but I do think we have a duty to address this issue, if our society, or a sub-branch of our society, is capable of producing and harbouring such things there is obviously something that needs to be addressed. \n \n I have several Muslim friends, and they say they do feel uneasy. When people espouse stuff like killing \"all radical Muslims and those who support them... and their children.\" To espouse killing children, to bring everything down to \"us\" and \"them\", this is what alienates the society and this is a vast contributory factor to what fosters the problem in the first place. How are you any better than a cleric who encourages people to \"kill all infidels?\"\n \n That said, I know you like your hyperbole Jim, and I hope you don't really mean it, or at least not in the way it comes across. Regardless I think its an ignorant, irresponsible and reprehensible attitude to take.", 
   {}, 
   270689, 
   null, 
   1182909060.0
  ], 
  [
   271159, 
   null, 
   "jim's trucking", 
   "Dubious foreign policy aside, we have little control over foreign extremists beliefs. However the one thing that really shocks me is the 'home-grown' terrorists. It utterly staggers me to think that someone who grows up British could ever sympathize with such philosophy. But they have, and a lot of it is due to the alienation that many Muslims feel in this country.\nBad philosophies can be cultivated in any human brain. We had our Timothy McVeigh...'til we executed him.\n \n\n Now I'm hardly a bleeding liberal who thinks that this excuses it, but I do think we have a duty to address this issue, if our society, or a sub-branch of our society, is capable of producing and harbouring such things there is obviously something that needs to be addressed. \nQuite true. What needs to be addressed is the source of the hatred. It has already been identified. Now it needs to be addressed. The source is RADICAL ISLAM. That is, radical Muslims within the large group of people that we know as Muslims.\n \n\n I have several Muslim friends, and they say they do feel uneasy. When people espouse stuff like killing \"all radical Muslims and those who support them... and their children.\" To espouse killing children, to bring everything down to \"us\" and \"them\", this is what alienates the society and this is a vast contributory factor to what fosters the problem in the first place. How are you any better than a cleric who encourages people to \"kill all infidels?\"\n \n That said, I know you like your hyperbole Jim, and I hope you don't really mean it, or at least not in the way it comes across. Regardless I think its an ignorant, irresponsible and reprehensible attitude to take.\nI doubt that your Muslim friends are radical Muslims. I have several Muslim friends also. I work with several Muslims daily. They are fine people.\n \n On a large sheet of paper, draw a large circle to include all Muslims. Within that circle draw a very small circle to include all radical Muslims.\n \n Now take a pair of scissors and cut the small circle out of the paper, place it in an ashtray and set it afire.\n \n My proposed killing of all radical Muslims should be embraced by Muslims and non-Muslims alike. It would be like removing a deadly cancer from the Muslim community. There have been occasions where good Muslims have aided in the fight against bad Muslims. Muslims are not stupid people. It is the small percentage of Muslims that I call radical (those who preach that death should come to all non-Muslims) that I propose to kill.\n \n Certainly there would be a lower limit to the age of children that would need to die in this effort to disinfect the world of such a radical agenda. You may suggest an age. I suspect it would best be less than six. The cowardly Taliban recently sent a six year old suicide bomber to do their dirty work.\n \n I think it is stupid, irresponsible and reprehensible to attempt appeasement of the sworn lunatics I call redical Muslims. Their intent is that you convert or die. I shall not convert. I shall not stand idly by while they sneak more bombs into the public.", 
   {}, 
   271091, 
   null, 
   1182956220.0
  ], 
  [
   271202, 
   null, 
   "Zardoz", 
   "Why aren't you telling us of your alternate to my solution?\n \n The Iraqi's have already won their freedom. It's the radical Muslims that we now battle. If they win, I won't have to kill myself...they'll do that for you. Then they'll kill you if you don't convert. Are you ready to convert to Islam and live under Sharia law as the radical Muslims insist. If not, you'd better insist that we fight to win.\n \n Do you realize what their caveman laws mean to women?\n\n \n I'd convert!\n Simply 'cause womens is teh suxor and need re-oppressing. \n \n As to your paper circle analogy.\n How about using drops of water. Fill a sink full of water drops with each representing a nice Muslim then add in some drops representing radical muslims. Now, remove the radicals.\n Pretty near impossible.\n Might as well drain the whole sink to ensure you get them all. After all, a moderate could turn radical in the removal process so we shouldn't take chances.\n \n Why is it that I seem to be the only one who advocates genocide?\n \n Of course, while I do this, my eldest daughter is in D.C. on the 'anti-genocide' bandwagon.\n I could spend hours upon hours explaining that whities burden should be abandoned since it's founded in ignorance and bigotry an that if we simply armed everyone, the problems would quicky take care of themselves but she's too uppity to listen to her superiors.\n \n Thus, I'm doubly committed to conversion to an anti-feminist form of existance...Yah Islam! \n I'd then have to hope my sons don't get uppitty too...Inche Allah.\n \n Oops, they are.\n Where's my lucky stones of stoning when I need them?", 
   {}, 
   270978, 
   null, 
   1182974100.0
  ], 
  [
   271210, 
   null, 
   "jim's trucking", 
   "I'd convert!\n Simply 'cause womens is teh suxor and need re-oppressing. \n \n As to your paper circle analogy.\n How about using drops of water. Fill a sink full of water drops with each representing a nice Muslim then add in some drops representing radical muslims. Now, remove the radicals.\n Pretty near impossible.\n Might as well drain the whole sink to ensure you get them all. After all, a moderate could turn radical in the removal process so we shouldn't take chances.\n \n Why is it that I seem to be the only one who advocates genocide?\n \n Of course, while I do this, my eldest daughter is in D.C. on the 'anti-genocide' bandwagon.\n I could spend hours upon hours explaining that whities burden should be abandoned since it's founded in ignorance and bigotry an that if we simply armed everyone, the problems would quicky take care of themselves but she's too uppity to listen to her superiors.\n \n Thus, I'm doubly committed to conversion to an anti-feminist form of existance...Yah Islam! \n I'd then have to hope my sons don't get uppitty too...Inche Allah.\n \n Oops, they are.\n Where's my lucky stones of stoning when I need them?\nPerhaps you should cut down on the medicine. I believe you are hallucinating.\n \n Radical Muslims can be identified. Many of them already have been. Once identified, they should be killed.", 
   {}, 
   271202, 
   null, 
   1182976920.0
  ], 
  [
   271228, 
   null, 
   "Zardoz", 
   "Perhaps you should cut down on the medicine. I believe you are hallucinating.\n \n Radical Muslims can be identified. Many of them already have been. Once identified, they should be killed.\n\n \n Really?\n \n How do you identify a 'radical' muslim from a 'moderate' muslim?\n \n Can the same methods be used for identifying 'radical' christian from a 'moderate' one?\n \n I mean, this is a belief system. So long as they sit quietly for a while, you really can't tell them apart.\n \n Can we use your methods for weeding out so called sleeper cells?\n \n Do we have to test each individual muslim to root out the radicals?\n I keep getting flash backs of the scene from Blade Runner where that idiot keeps asking dumb questions to elicit an emotional response to root out Replicants...do we ask a Muslim why they'd turn a turtle over on it's back just to watch it suffer?\n \n \n \n \n Do I have to point out the irony of where I call for the same thing Jimmy does (only using more logic) and rather than being praised for it by him...I'm told I need to deal with my meds?", 
   {}, 
   271210, 
   null, 
   1182982260.0
  ], 
  [
   271233, 
   null, 
   "jim's trucking", 
   "Really?\n \n How do you identify a 'radical' muslim from a 'moderate' muslim?\n \n Can the same methods be used for identifying 'radical' christian from a 'moderate' one?\n \n I mean, this is a belief system. So long as they sit quietly for a while, you really can't tell them apart.\n \n Can we use your methods for weeding out so called sleeper cells?\n \n Do we have to test each individual muslim to root out the radicals?\n I keep getting flash backs of the scene from Blade Runner where that idiot keeps asking dumb questions to elicit an emotional response to root out Replicants...do we ask a Muslim why they'd turn a turtle over on it's back just to watch it suffer?\n \n \n \n \n Do I have to point out the irony of where I call for the same thing Jimmy does (only using more logic) and rather than being praised for it by him...I'm told I need to deal with my meds?\nYou don't call for the same thing I do.\n \n Some radical Muslims have already been identified. They are the ones publicly denouncing infidels and calling for their conversion or death. (Maybe you missed where I already said that.) Let's start by killing them. Then when others do the same, we do the same. Kill all those who call for the death of 'infidels'. Keep killing them until nobody preaches that goal.\n \n Duh!", 
   {}, 
   271228, 
   null, 
   1182982800.0
  ], 
  [
   271409, 
   null, 
   "Zardoz", 
   "You don't call for the same thing I do.\n\n Sure I do. I want to eliminate the bad guys.\n \n \nSome radical Muslims have already been identified. They are the ones publicly denouncing infidels and calling for their conversion or death. (Maybe you missed where I already said that.)\n\n So, the only way to identify these radicals is by them openly stating drivel and nonsense? That their calls for our death or conversion identify them. And that's it? No secret handshakes and identifying marks? \n Seems to me like your own cries for such place you in a similar boat. \n \n \nLet's start by killing them.\n\n I'm down with that Charlie Brown. \n \n \nThen when others do the same, we do the same.\n\n So, we kill some trouble makers, then when their grieving loved ones call for justice...erm retaliation, we kill them too. Sweet logic. emoticon_xgood \n \n \nKill all those who call for the death of 'infidels'. Keep killing them until nobody preaches that goal.\n\n So, basically, out terrorize the terrorists to get them to shut up?\n Awsome.\n \n And to think, I'm probably the only one here who's ever been arrested on 'terrorism' charges. (All false and unsubstantiated he-said/she-said ####).\n \n Seriously, I'm cool with your proposal. Everyone knows the US has the capability to do so.\n Only we lack sufficient will.\n \n Thus, I think calls for conversion to the 'winning side' should be heeded. \n They've demonstrated the will...and they can often find the means.\n \n Besides, I like having Allah back me up when I want to lay the smack down on the uppity women.\n They should know their place. Barefoot, pregnant and in the kitchen making me a sandwich.", 
   {}, 
   271233, 
   null, 
   1183052340.0
  ], 
  [
   271479, 
   null, 
   "JPSartre12", 
   "Really?\n \n How do you identify a 'radical' muslim from a 'moderate' muslim?\n\n \n Oo! Oo! Pick me! Pick me! I know the answer. The radical Muslim is the one practicing to blow the shat out of me when I least expect it. :xcensored \n \n\n Can the same methods be used for identifying 'radical' christian from a 'moderate' one?\n \n\n Show me a radical Christian suicide bomber and then I'll start fearing them. emoticon_xgood \n \n\n I mean, this is a belief system. So long as they sit quietly for a while, you really can't tell them apart.\n \n\n But they don't sit quietly. They plot, make videos, brag about their plans.....and get caught.\n \n\n Can we use your methods for weeding out so called sleeper cells?\n \n Do we have to test each individual muslim to root out the radicals?\n I keep getting flash backs of the scene from Blade Runner where that idiot keeps asking dumb questions to elicit an emotional response to root out Replicants...do we ask a Muslim why they'd turn a turtle over on it's back just to watch it suffer?\n \n\n I can \"name that radical Muslim\" in three notes. :) \n \n\n Do I have to point out the irony of where I call for the same thing Jimmy does (only using more logic) and rather than being praised for it by him...I'm told I need to deal with my meds?\n\n Maybe it's because he's dealing with reality while your pontificating about the abstract.emoticon_confused He isn't worried about an abstraction blowing up people in the US. He's worrying about reality.", 
   {}, 
   271228, 
   null, 
   1183074780.0
  ], 
  [
   271843, 
   null, 
   "Phunting", 
   " The source is RADICAL ISLAM. That is, radical Muslims within the large group of people that we know as Muslims.\n I doubt that your Muslim friends are radical Muslims. I have several Muslim friends also. I work with several Muslims daily. They are fine people.\n \n On a large sheet of paper, draw a large circle to include all Muslims. Within that circle draw a very small circle to include all radical Muslims.\n \n Now take a pair of scissors and cut the small circle out of the paper, place it in an ashtray and set it afire.\n \n My proposed killing of all radical Muslims should be embraced by Muslims and non-Muslims alike. It would be like removing a deadly cancer from the Muslim community. There have been occasions where good Muslims have aided in the fight against bad Muslims. Muslims are not stupid people. It is the small percentage of Muslims that I call radical (those who preach that death should come to all non-Muslims) that I propose to kill.\nOk, but that's not what you said. You proposed the killing of 'radical Muslims', 'those who support them' and 'their children'. Now assuming we go by the definition of 'radical Muslim' being those advocating death to those who disagree with them, who are, exactly, 'those who support them'? Obviously they can't approve of murder as if they did they would fall into the 'radical' category. Therefore you are advocating the killing of people who are not advocating killing themselves. How is this justifiable?\n \n \nCertainly there would be a lower limit to the age of children that would need to die in this effort to disinfect the world of such a radical agenda. You may suggest an age. I suspect it would best be less than six. The cowardly Taliban recently sent a six year old suicide bomber to do their dirty work.\nErr. How can I argue this? If you really think that it is justified to murder children over six because of their parents' beliefs then you are every bit as bad as a 'radical Muslim'.\n \n \nI think it is stupid, irresponsible and reprehensible to attempt appeasement of the sworn lunatics I call redical Muslims. Their intent is that you convert or die. I shall not convert. I shall not stand idly by while they sneak more bombs into the public.\nI don't support appeasement. I also don't support calling for the murder of people who are not themselves committing crimes because of their beliefs. That is what the radical Muslims are doing, and that is what you are doing.", 
   {}, 
   271159, 
   null, 
   1183248660.0
  ], 
  [
   272047, 
   null, 
   "jim's trucking", 
   "Ok, but that's not what you said. You proposed the killing of 'radical Muslims', 'those who support them' and 'their children'. Now assuming we go by the definition of 'radical Muslim' being those advocating death to those who disagree with them, who are, exactly, 'those who support them'? Obviously they can't approve of murder as if they did they would fall into the 'radical' category. Therefore you are advocating the killing of people who are not advocating killing themselves. How is this justifiable?\nThere is a number of logical errors in the above analysis. Begin where you say, obviously. Then again where you say, therefore. \n \n Those who advocate conversion or death would be those who preach openly for it. Those who support them would be those who may not speak out in public but who do give to the cause, knowing that whatever they are providing will help the cause. \n \n Though you arrived at it by false logic, you do state correctly that I am advocating the killing of people who are not advocating killing themselves. Brave Osama and all the Brave E-Mommys preaching death to infidels all want SOMEONE ELSE to strap on the bombs. They do not advocate killing themselves. They advocate having some of their stupid sheeple kill themselves in order to kill infidels. If Wussy Osama and his following of Wussy E-Mommys really practiced what they preached, they would have killed themselves already.\n \n\n Err. How can I argue this? If you really think that it is justified to murder children over six because of their parents' beliefs then you are every bit as bad as a 'radical Muslim'.\nAdding their children to the list merely makes it more likely that 200 years or so will pass before radical Islam raises its demented head again. Their children are brainwashed early to believe in the glory of becoiming a 'holy warrior' for the Jihad. A Muslim reporter stated that a 5 year old boy proudly proclaimed that very thought during her visit to their village. Getting rid of them is just a form of insurance.\n \n \n \n\n I don't support appeasement.\nWhat action do you support in regard to radical Islam?\n \n \n\n I also don't support calling for the murder of people who are not themselves committing crimes because of their beliefs.\n \n That is what the radical Muslims are doing, and that is what you are doing.\nWould you like to wait until they kill a big crowd of people and then prosecute them in a court of law? Who are you going to prosecute? The bomber likely blew himself to bits? The supplier of the bomb will likely be unknown to you after the bomb goes off. The inspirational leader who talked the bomber into killing himself will have not (by your way of thinking) committed a crime.\n \n So...you'll be dead...along with half your family and many other innocent people...simply because you don't have the balls to kill the bastards who are seriously threatening to kill us all.", 
   {}, 
   271843, 
   null, 
   1183397160.0
  ], 
  [
   272188, 
   null, 
   "jim's trucking", 
   "...\n \n \n What action do you support in regard to radical Islam?\n \n ... \nemoticon_confused", 
   {
    "post_info": {
     "post_title": "Well?"
    }
   }, 
   272047, 
   null, 
   1183497300.0
  ], 
  [
   272192, 
   null, 
   "Master_Shake", 
   "Adding their children to the list merely makes it more likely that 200 years or so will pass before radical Islam raises its demented head again. Their children are brainwashed early to believe in the glory of becoiming a 'holy warrior' for the Jihad. A Muslim reporter stated that a 5 year old boy proudly proclaimed that very thought during her visit to their village. Getting rid of them is just a form of insurance.\n\n You've become at least as bad, no, I take that back, worse than Siegfriedson.\n \n \nSo...you'll be dead...along with half your family and many other innocent people...simply because you don't have the balls to kill the bastards who are seriously threatening to kill us all.\n\n Ok jim, if you have these balls, why don't you hop on a plane to Saudi Arabia or Iraq, or wherever you feel is the biggest threat and cap some five year olds. Go ahead jim, you have the courage of your convictions.\n \n \n \n \n \n \n Don't you?", 
   {}, 
   272047, 
   null, 
   1183498920.0
  ], 
  [
   272196, 
   null, 
   "jim's trucking", 
   "You've become at least as bad, no, I take that back, worse than Siegfriedson.\nActually, Siegy hates people because of their race. I hate people who advocate my death, regardless of their race, religion, creed, national origin, gender or age. \n \n \n\n Ok jim, if you have these balls, why don't you hop on a plane to Saudi Arabia or Iraq, or wherever you feel is the biggest threat and cap some five year olds. \nThat's not the way it works. We, the People discuss, ponder and vote on our course of action. Our military does the killing.\n \n \nGo ahead jim, you have the courage of your convictions.\n \n \n \n \n \n \n Don't you?\nI doubt your courage matches mine. When confronted with an angry radical Muslim holding a sword above my neck demanding I convert or die...I would flip him the bird whereas you would say \"Yassuh, Mastah!\"emoticon_xchicken\n \n \n What is your proposed solution to the problem we have with radical Muslims?\n \n Oh, I'm sorry. I presumed you recognized that we have a serious problem with them. If not, please disregard the previous question and stick your head back in the sand.", 
   {}, 
   272192, 
   null, 
   1183499940.0
  ], 
  [
   272200, 
   null, 
   "Master_Shake", 
   "Actually, Siegy hates people because of their race. I hate people who advocate my death, regardless of their race, religion, creed, national origin, gender or age.\n\n Sorry, you're right, forgive me. You just advocate murdering children. Between the two of you, you definitely have the moral high ground.\n \n \nThat's not the way it works. We, the People discuss, ponder and vote on our course of action. Our military does the killing.\n\n How convenient for you.\n \n \nI doubt your courage matches mine. When confronted with an angry radical Muslim holding a sword above my neck demanding I convert or die...I would flip him the bird whereas you would say \"Yassuh, Mastah!\"emoticon_xchicken\n\n That's not analogaous to what we were discussing. The real question is, if a five year old walked up to you and proclaimed death to America, would you shoot him in the head?\n I certainly know I wouldn't. Forgive my conscience.\n \n \nWhat is your proposed solution to the problem we have with radical Muslims?\n\n I don't have a one step, simple-minded, nuke em all plan. Again, forgive me for recognizing complexity.", 
   {}, 
   272196, 
   null, 
   1183502580.0
  ], 
  [
   272203, 
   null, 
   "jim's trucking", 
   "Sorry, you're right, forgive me. You just advocate murdering children. Between the two of you, you definitely have the moral high ground.\nOnly those brainwashed to believe that I should die.\n \n \n\n How convenient for you.\nThat's the way it works. I'm not a vigilante. I'm just one of several calling for governmental action.\n \n \n\n That's not analogaous to what we were discussing. \nDoesn't have to be. It's merely a measure of courage. Are you willing to die to remain free to choose whatever religion (or absense of it) you prefer?\n \n \nThe real question is, if a five year old walked up to you and proclaimed death to America, would you shoot him in the head?\nOf course not, you silly person...not until it's not against the law to do so. If the governement declares open season on people who call for the death of America, I might get out my guns. That's not likely to happen. Even if we declared it unlawful to scream, \"Death to America\" in public, we'd have trials and appeals and shyster lawyers clogging up the courts with differing arguments about the punishment and the mistreatment of the poor little bastard. No, that will never happen.\n \n \n\n I certainly know I wouldn't. Forgive my conscience.\nDone.\n \n \n\n I don't have a one step, simple-minded, nuke em all plan. Again, forgive me for recognizing complexity.\nI don't want to hear what kinds of plans you don't have. I want to hear you propose a solution that might work. I'm rather certain mine would work.\n \n What is your alternate plan?", 
   {}, 
   272200, 
   null, 
   1183504080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Imus Comments Not That Bad", 
  "url": "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 9745, 
  "discussion_files": [
   [
    "24260.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-print.html"
   ], 
   [
    "24261.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-9-print.html"
   ], 
   [
    "24262.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-7-print.html"
   ], 
   [
    "24263.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-5-print.html"
   ], 
   [
    "24264.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-4-print.html"
   ], 
   [
    "24265.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-6-print.html"
   ], 
   [
    "24266.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-8-print.html"
   ], 
   [
    "24267.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-3-print.html"
   ], 
   [
    "24268.html", 
    "http://www.4forums.com/political/current-events-debates/9745-imus-comments-not-bad-2-print.html"
   ]
  ], 
  "identifier": 9745
 }
]