[
 [
  [
   257932, 
   null, 
   "wascallywabbit", 
   "**\n FYI--\n \n \"From The TimesApril 7, 2007\n \n Worldly wise web\n For centuries we wrongly believed that only man has intelligence. How stupid can you get, Simon Barnes asks after reading a challenging new study\n AN EXTRAORDINARY AMOUNT of thought has been dedicated to building colossal barriers between humans and nonhumans. There are obvious benefits from this. The first is the development of overweening species pride: the essential notion that human beings are not animals. \n \n The second, of course, is that if animals are so different from human beings, then it really doesn't matter how we treat them: a way of thinking that leads us straight to factory farms. There is a powerful need to see human and nonhuman animals as opposites: never mind that we come face to face with evidence of our mammalian nature every time we turn to Page 3 of The Sun. \n \n The history of human thought, then, is a history of avoiding this inconvenient truth. René Descartes said of animals: \"It is nature that acts in them according to the disposition of their organs, just as a clock, which is composed only of wheels and weights, is able to measure the time more correctly than we can with all our wisdom.\" \n \n (The English philosopher John Cottingham commented: \"To believe that a dog with a broken paw is not really in pain when it whimpers is a quite extraordinary achievement, even for a philosopher.\") The need to see humans as something beyond and above every animal ever created has been central to human development: and yet the idea is utterly wrongheaded. Sigmund Freud suggested that in the course of human history there have been three great assaults on our \"naive self-love\". \n \n The first of these, he said, was Galileo's revelation that the Earth was not the centre of the Universe. The second was the Darwinian bombshell: that human beings were animals - apes not angels - and that we share a common ancestor with chimpanzees. The third great insight Freud modestly attributed to himself: he deprived humans of rationality, and with it, the notion that we were at least rational animals. \n \n The human species has responded by ignoring these truths, or by constructing new myths about human uniqueness: the idea, for example, that humans represent the ultimate achievement of evolution - as if a blind natural process could be goal-orientated. \n \n Nonhuman animals are denied emotion, feeling, sense, intelligence, creativity, joy: because if we did not do so, we would have to examine more closely our own place in the Universe and the way we treat nonhuman animals. However, the more we investigate the nature of the creatures with which we share the planet, the harder it gets to maintain this rigid duality: this vision of a world with human beings and, on the opposite side of an ocean a billion miles wide, nonhumans. \n \n Animal Architects is not so much an exploration of the gee-whiz wonders of the things that animals make, but an investigation into the mental processes required to make them. Time and again the response we humans wish to make - that it is all blind instinct, hard-wired stuff, innate, jolly intriguing and all that but nothing to do with the way human beings think and act and build - is shown to be unsustainable. \n \n Spiders on the Space Shuttle, encountering conditions that they had never met before - the absence of gravity - worked out a way of building a web: improvisation, imagination and a clear picture of the goal involved. Alternative explanations for this achievement require a great deal more complexity: and in science, as in philosophy, parsimony in argument is the big thing. \n \n As the Goulds discuss hive-construction, they conclude that the waggle-dance - the way in which bees use symbolic movements and complex conventions to indicate the location of a food source - is \"the second most complex language on the planet\". \n \n They discuss the way that bees will leave the mother-hive to set up a new establishment, how a consensus is reached, the way that the swarm departs to take up life in a new place: \"Were this description rewritten substituting 'ape' for 'bee', we would still be amazed at the cognitive flexibility of the behaviour.\" \n \n But the Goulds are pretty brutal to their own thesis. They have a positive phobia about excess credibility, about wishing to attribute nonexistent human-like thought processes to the nonhuman world. The books bursts with caution; and yet the overwhelming weight of evidence in unanswerable. \n \n Intelligence is not like swing; it's not something you either got or you ain't got. It is unrealistic to say that humans have it, that nonhumans don't. It is far more intriguing to investigate the level of intelligence required for certain tasks of construction: to witness, as I was doing in Zambia a couple of weeks ago, for example, the improvisation of weaver-birds as they make repairs to their beautiful and extraordinary nests. The Goulds list complex levels of intelligence and attribute them to animals only when it is simpler to accept this rather than \"instinct\". Intelligence is not a matter of absolutes but of tiers: stratifications of mental ability. \n \n Building, the Goulds believe, is at the heart of it. In the manipulating and restructuring of the environment and, as such, they suggest, it is at the very root the evolution of human intelligence. There is not a clean division of clever and stupid, of genius and instinct. Rather, there is a continuum. \n \n And this continuum includes aesthetics. Art, if you like. The bower-birds of Australasia make elaborate structures that they paint and decorate with loving care, not according to some clockwork motor that drives them, but with individual flair, culturally transmitted conventions, taste and imagination. \n \n But let's leave the last word to Douglas Adams in The Hitch-Hiker's Guide to the Galaxy: \"Man has always believed he was more intelligent than dolphins because he had achieved so much - the wheel, New York, wars and so on - while all the dolphins had ever done was muck about in the water having a good time. But conversely, the dolphins had always believed that they were far more intelligent than man - for precisely the same reasons.\" \n \n ANIMAL ARCHITECTS: Building and the Evolution of Intelligence by James L. Gould and Carol Grant Gould Basic Books, £15.99; 324pp £14.99 (free p&p) 0870 1608080 or buy here\"\n \n at--\n http://entertainment.timesonline.co.uk/tol/arts_and_entertainment/books/article1620221.ece", 
   {
    "post_info": {
     "post_title": "Against the anthropocentric darwinist/creationist view of life"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1176225060.0
  ], 
  [
   257935, 
   null, 
   "ShadowPikachu", 
   "Interesting article. I too think that even some scientists unconsciously are biased toward humans when talking about evolution. Really, we are nothing special - and I think that a common misconception about evolution is that it \"worked\" toward a \"final result\" - us. This could not be farther from the truth.\n \n That's a major problem with creationists as well - they view humans as a \"special\" thing - far above the \"lowly animals\". I think that is one of the reasons that they dislike evolution so much - because it shows that we actually are those \"lowly animals\", and our ancestors were those \"lowly animals\", and their ancestors, etc.\n \n Plus, science has shown, as the article said, that there are other intelligent beings out there. Just recently I read an article about possible intelligence in octopuses (and yes that is the correct plural - not octopi - has to do with the \"pus\" being Greek derived rather than Latin) - I'll have to see if I can get a hold of it. Others I know of include horses, great apes, dolphins, parrots, crows, dogs, etc.\n \n P.S. - I loved the Douglas Adams quote - he's one of my favorite writers. So long and thanks for all the fish. ;)\n \n EDIT: Dang, now I was inspired to change my signature. :)", 
   {}, 
   257932, 
   null, 
   1176226560.0
  ], 
  [
   257945, 
   null, 
   "Baron", 
   "This should be as good as any a thread to ask two simple questions.\n \n 1. Is evolution a never ending process?\n \n 2. How do animals pass their intelligence and acquired knowledge on to the\n next generation? \n \n MvR", 
   {}, 
   257935, 
   null, 
   1176229860.0
  ], 
  [
   257957, 
   null, 
   "trebor", 
   "This should be as good as any a thread to ask two simple questions.\n \n 1. Is evolution a never ending process?\n \n 2. How do animals pass their intelligence and acquired knowledge on to the\n next generation? \n \n MvR\n\n \n Intelligence, there is a genetic component. Aquireed knowledge.. that can be answered by watching a mother bird teach her fledgelings to fly..", 
   {}, 
   257945, 
   null, 
   1176234780.0
  ], 
  [
   257964, 
   null, 
   "ShadowPikachu", 
   "This should be as good as any a thread to ask two simple questions.\n \n 1. Is evolution a never ending process?\n \n 2. How do animals pass their intelligence and acquired knowledge on to the\n next generation? \n \n MvR\n\n \n 1. Put simply, YES.\n \n 2. Some intelligence can be passed on through genetics like trebor said. The blueprints that lead to brain size also could indirectly lead to passing on intelligence, but then it also has to include neural pathways and such and end up getting pretty complicated.", 
   {}, 
   257945, 
   null, 
   1176237060.0
  ], 
  [
   257966, 
   null, 
   "obvious_child", 
   "This should be as good as any a thread to ask two simple questions.\n \n 1. Is evolution a never ending process?\n\n \n Evolution will cease under two contigent conditions:\n Enviromental pressures do not change and species evolve to fill their ecological niches perfectly. As enviromental pressures are never likely to stop, evolution will never cease. \n \n \n2. How do animals pass their intelligence and acquired knowledge on to the\n next generation? \n \n MvR\n\n \n Genetics and education. A lion teaches her cubs to hunt and they are born with a innate amount of intelligence.", 
   {}, 
   257945, 
   null, 
   1176237120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Against the anthropocentric darwinist/creationist view of life", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9750-against-anthropocentric-darwinist-creationist-view-life.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9750, 
  "discussion_files": [
   [
    "9759.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9750-against-anthropocentric-darwinist-creationist-view-life-print.html"
   ]
  ], 
  "identifier": 9750
 }
]