[
 [
  [
   259071, 
   null, 
   "Bassman", 
   "OK Gang, the NHL is down to the final 16.\n \n Time for your comments/picks on who will take Lord Stanley's Cup this year. \n \n Right now, the Buffalo Sabres are playing game three against Ted Nolan and the NY Islanders with one game each.", 
   {
    "post_info": {
     "post_title": "Stanley Cup 2007"
    }
   }, 
   null, 
   null, 
   1176783120.0
  ], 
  [
   259072, 
   null, 
   "E Mutz", 
   "There is a Red Storm Rising in Detroit. Woe to all who come before the Wings.\n \n It is good to hear another living being who cares about hockey.", 
   {}, 
   259071, 
   null, 
   1176784620.0
  ], 
  [
   259080, 
   null, 
   "college_girl", 
   "Canucks!\n \n Wait a second, that's crazy talk...", 
   {}, 
   259072, 
   null, 
   1176796800.0
  ], 
  [
   259198, 
   null, 
   "Bassman", 
   "There is a Red Storm Rising in Detroit. Woe to all who come before the Wings.\n \n It is good to hear another living being who cares about hockey.\n\n \n I don't think so!!! The way Buffalo is playing right now, and with Miller Time betwwen the pipes, the Wings'll be shot dowwwwwwwnnnnnnnnn!!!!!!!!!", 
   {}, 
   259072, 
   null, 
   1176850800.0
  ], 
  [
   259930, 
   null, 
   "Bassman", 
   "With the Islanders sent packing, Buffalo advances to the next round, without a signifigant change in mileage because they're due to play the Rangers.\n \n Oh the prospect of humiliating BOTH NYC teams emoticon_xkill emoticon_xkill emoticon_xkill", 
   {
    "post_info": {
     "post_title": "Sabres in next round!!!!!!!!!!!!!!!"
    }
   }, 
   259198, 
   null, 
   1177305480.0
  ], 
  [
   260416, 
   null, 
   "E Mutz", 
   "Bufflalo made a statement in their 5-2 opening win. Unfortunately, to no avail. Doom comes from the west on Red Wings. The Apostle Hasek has already seen the light. Bow down to the west and submit burnt offerings to hockey town!", 
   {}, 
   259930, 
   null, 
   1177562340.0
  ], 
  [
   260444, 
   null, 
   "Waxy", 
   "Woe to those that must cross the path to Lord Stanley's cup laid out by the Mighty Ducks. Two Norris trophy winners on the blue line, both capable of playing 30-40 minutes a night, a good supporting cast of Dmen, an impressive array of hungry young talent up front, with just the right sprinkling of veteran leadership, and solid goaltending. Brian Burke is a visionary.\n \n Anaheim will dispatch the Nucks in 5 or less.\n \n Detroit is in for a long series against San Jose. This one is really tough to call, as good as Detroit looked at home against the Lames, they looked pretty bad in a couple losses on the road. Eliminating Nashville was no small feat, so I'm not real sure of the Sharks right now. I can't stand the Red Wings, so I'm going to go with the happy ending and take the Sharks.\n \n In the East, I see Buffalo rolling over the Rangers. The Rangers will start to play to their true calibre, and so will the Sabres.\n \n The Sens will win a long and DULL series over the Devils. The Sens talent will win out if Emery comes up big when he needs to, but eliminating the Devils is never easy.\n \n Anaheim over San Jose\n \n Buffalo over Ottawa\n \n Ducks win the Cup.\n \n Waxy", 
   {}, 
   260416, 
   null, 
   1177606680.0
  ], 
  [
   260453, 
   null, 
   "E Mutz", 
   "Detroit is going to have a tough series against San Jose. I think the winner of this series takes the cup. With Holmstrom out for the first game, Detroit's home advantage is all but negated. Given San Jose's road record too...\n \n I think Anaheim will have their way with the Cannots. It may come down to an all California Semi...\n \n The cup was in town just the other day and I had no idea. Very upsetting indeed.", 
   {
    "post_info": {
     "post_title": "Ducks, Nucks, Pucks, Sucks"
    }, 
    "unicode_changes_made": true
   }, 
   260444, 
   null, 
   1177615140.0
  ], 
  [
   260483, 
   null, 
   "Bassman", 
   "Bufflalo made a statement in their 5-2 opening win. Unfortunately, to no avail. Doom comes from the west on Red Wings. The Apostle Has-Been has already seen the light. Bow down to the west and submit burnt offerings to hockey town!\n\n There! fixed it for ya!!!emoticon_xgood", 
   {}, 
   260416, 
   null, 
   1177631640.0
  ], 
  [
   260513, 
   null, 
   "E Mutz", 
   "Oh no you dih ent!!!", 
   {}, 
   260483, 
   null, 
   1177645200.0
  ], 
  [
   261738, 
   null, 
   "Bassman", 
   "Ottawa leads series against the Devils 3-1\n \n Anahem in West Conference Finals\n \n Wings go to Shark Tank\n \n Maxim Afenigenov scores in OT to give Buffalo a 3 games to 2 lead over the Rangers.\n \n My predictions:\n \n Buffalo and Ottawa rematch of last years semifinals\n \n Wings and Ducks in West.", 
   {
    "post_info": {
     "post_title": "Update!!!!!!!!!!!!!"
    }
   }, 
   260513, 
   null, 
   1178339340.0
  ], 
  [
   262010, 
   null, 
   "Bassman", 
   "Buffalo took the series against the Rangers by a score of 5-4, so it will be Buffalo against Ottawa in the East.", 
   {}, 
   261738, 
   null, 
   1178506800.0
  ], 
  [
   262120, 
   null, 
   "Waxy", 
   "So far I'm pretty damn close in my predictions.\n \n I really wasn't sure on the SJ/DET series, and I'm still not. I think it'll go 7, but I'm not sure SJ can pull off the game 7 win in Joe Louis.\n \n Waxy", 
   {}, 
   262010, 
   null, 
   1178585100.0
  ], 
  [
   262144, 
   null, 
   "E Mutz", 
   "Can I make a Statement!\n \n The Red Wings have crushed San Jose and now look to Anaheim. If you have real estate in the Anaheim area, I would sell now and evacuate.", 
   {
    "post_info": {
     "post_title": "Another day, another cup..."
    }
   }, 
   262120, 
   null, 
   1178601840.0
  ], 
  [
   262145, 
   null, 
   "Bassman", 
   "Can I make a Statement!\n \n The Red Wings have crushed San Jose and now look to Anaheim. If you have real estate in the Anaheim area, I would sell now and evacuate.\n\n In your dreams, punk!!!! After Buffalo slices-and-dices the Senators, we'll make mincemeat out of Dominik Has-Been and Co.", 
   {}, 
   262144, 
   null, 
   1178602260.0
  ], 
  [
   262211, 
   null, 
   "Waxy", 
   "Well, you can't win 'em all.\n \n I'm sticking with my previous predictions, just replace SJ with DET. I'm not sure on the BUF/OTT series though, OTT has looked surprisingly good. \n \n I'd love to see a Canadian team in the final, so the series I would like to see would be ANA vs. OTT.\n \n At any rate, we should be in for some great hockey, the \"defensive\" teams are out, so we should see more skill, puck movement, and a generally higher pace to the games.\n \n Waxy", 
   {}, 
   262145, 
   null, 
   1178647320.0
  ], 
  [
   262990, 
   null, 
   "snakespit", 
   ":) With a 2 game lead, Ottawa looks to be well on the road to the finals. Sorry Bassman, I don't think it's going to happen this year. :) Not that this makes me smile or anything :) :) :) :) :) :) (Please note: Numerous \":) \" indicate sarcasm.) DOWN WITH THE BUFFALO CHIPS!!!!\n \n The real contest is going to be Ana / Det. These 2 teams are so evenly matched that I think it is anyone's series. My pick is Ana in 7, but who really knows. \n \n I think I must give my vote to Ottawa in the finals. Emery is just too hot to handle right now, and I just don't see the Ducks slipping too many past him. \n \n Please note: This is only my opinion, and as such, should be worshipped like a religion.", 
   {}, 
   262211, 
   null, 
   1179138000.0
  ], 
  [
   263038, 
   null, 
   "Gigga", 
   "LOL Winter Olympics in South Korea... LOL sounds rather like a pie in the sky!... :)\n I wonder whether members of the IOC ever knew that there is no natural snow in Korea. You see their climate is too mild for it! It snows in Korea approximately once a decade - how on earth Winter Olympics are going to be held there? \n To cover the slopes the Koreans use artificial snow that melts away under the parching sun in the space of an hour or two. Besides that, there is the tendency for the global warming of the Earth's climate. What kind of climate will there be in South Korea by 2014? \n I bet that in case the Olympic Committee chooses South Korean city of Pyeongchang as a host of Winter Olympics-2014, this gonna be the greatest blooper in the whole history of Olympic games! Pyeongchang seems to be the worst bid for Winter Olympics. Honestly, I fail to understand how on earth it managed to be selected as one of the three finalists by the Olympic committee. It probably did not do without palming some of the Olympic committee members by Korea's global corporations. For them, Olympic games are a sure-fire way to make a pretty penny out.", 
   {
    "post_info": {
     "post_title": "Winter Olympics in South Korea"
    }, 
    "unicode_changes_made": true
   }, 
   259071, 
   null, 
   1179158700.0
  ], 
  [
   263204, 
   null, 
   "Waxy", 
   "In your nightmares, punk!!!! After Ottawa slices-and-dices the Sabres, they'll be made mincemeat out of by the Mighty Ducks.\n\n \n Fixed it for ya Bassman!\n \n Waxy", 
   {}, 
   262145, 
   null, 
   1179252360.0
  ], 
  [
   263210, 
   null, 
   "snakespit", 
   "I hear brooms Bassman...brooms.", 
   {}, 
   263204, 
   null, 
   1179255840.0
  ], 
  [
   263242, 
   null, 
   "E Mutz", 
   "I hear brooms Bassman...brooms.\n\n \n Have some compassion people! It's not like he's a Crapalanche fan or anything... He's a Buffalo fan, he's harmless.\n \n Besides, watching Ottawa try to defend against the Detroit onslaught will be about as pathetic as watching Richard Simmons try to throw a baseball.\n \n The Senators are term limited at 4 games vs Detroit.", 
   {}, 
   263210, 
   null, 
   1179264660.0
  ], 
  [
   263276, 
   null, 
   "snakespit", 
   "Have some compassion people! It's not like he's a Crapalanche fan or anything... He's a Buffalo fan, he's harmless.\n\n Since my team sucks so bad this year, I have to play the angry, jaded fan.\n \n \nBesides, watching Ottawa try to defend against the Detroit onslaught will be about as pathetic as watching Richard Simmons try to throw a baseball.\n \n The Senators are term limited at 4 games vs Detroit.\n\n I honestly believe that you will have to bring more to the table than the Motown Pink Chicken Wings can bring. It's a nice story, but it belongs in the fiction section.", 
   {}, 
   263242, 
   null, 
   1179280860.0
  ], 
  [
   263305, 
   null, 
   "Bassman", 
   "\n I honestly believe that you will have to bring more to the table than the Motown Pink Chicken Wings can bring. It's a nice story, but it belongs in the fiction section.\n\n Just as I've said. With Dominik Hasbeen between the pipes.", 
   {}, 
   263276, 
   null, 
   1179295260.0
  ], 
  [
   263368, 
   null, 
   "Waxy", 
   "I hear brooms Bassman...brooms.\n\n \n I'll get the dustpan ready.......\n \n Waxy", 
   {}, 
   263210, 
   null, 
   1179335760.0
  ], 
  [
   263369, 
   null, 
   "Waxy", 
   "Yowsers, the Ducks got winged last night. \n \n They better get it together for game 4, and I'm guessing they will.\n \n Waxy", 
   {}, 
   263368, 
   null, 
   1179335880.0
  ], 
  [
   263518, 
   null, 
   "snakespit", 
   "I'll get the dustpan ready.......\n \n Waxy\n\n \n Alas, it was not to be. I guess it will be more fun to see Buffalo get beat at home anyway.", 
   {}, 
   263368, 
   null, 
   1179387360.0
  ], 
  [
   263660, 
   null, 
   "snakespit", 
   "Yowsers, the Ducks got winged last night. \n \n They better get it together for game 4, and I'm guessing they will.\n \n Waxy\n\n \n They looked good, even without Pronger. I still think the series could go either way, as the Ducks and Wings are just so evenly matched, but I would give it to the Ducks in the end.", 
   {}, 
   263369, 
   null, 
   1179473220.0
  ], 
  [
   263703, 
   null, 
   "E Mutz", 
   "I figured the Ducks would be L'Oranged again by the Wings. It seems that the two teams alternate who is going to show up. Momentum simply hasn't carried from one game to the next. Teemu finally woke up and scored and Pronger will be back for game 5. This does not bode well, but then, the series shifts back to the Joe. Let the octopi fly.", 
   {}, 
   263660, 
   null, 
   1179504420.0
  ], 
  [
   263709, 
   null, 
   "Waxy", 
   "I just hope the right Pronger shows up for the all critical game 5, the old Pronger would be on the warpath looking to take out his frustrations on anyone wearing red. \n \n I'm pretty confident that the new Pronger will show up though, and that's bad news for the Wings. Getting some scoring out of the top 2 lines for Anaheim is bad news for the Wings as well....\n \n Who knows though, this series could easily go either way.\n \n What great hockey we're being treated to though, both series are hockey at it's best, and the finals should be awesome.\n \n Waxy", 
   {}, 
   263703, 
   null, 
   1179506580.0
  ], 
  [
   263742, 
   null, 
   "Bassman", 
   "Game five of the Eastern conference finals is this Saturday Afternoon at HSBC Arena and I suspect the hometown crowd will be pumped. I just hope the Sabres are just as motivated as they were in game four.", 
   {}, 
   263709, 
   null, 
   1179529020.0
  ], 
  [
   263962, 
   null, 
   "snakespit", 
   "Game five of the Eastern conference finals is this Saturday Afternoon at HSBC Arena and I suspect the hometown crowd will be pumped. I just hope the Sabres are just as motivated as they were in game four.\n\n I give them credit for playing a hell of a game. Miller made some amazing stops. Always a threat, but just not going to happen this year...sorry Bassman.", 
   {}, 
   263742, 
   null, 
   1179678540.0
  ], 
  [
   263981, 
   null, 
   "Bassman", 
   "True, But I think the main problem is that the Sabres have been playing their ballet-style hockey during the playoffs and got just plain lucky! Drury, Briere, and Neumanen are up for free agency this year and I'm not going to be one bit sorry they're gone. I'd like to see Buffalo pick up a couple of goons.", 
   {}, 
   263962, 
   null, 
   1179689280.0
  ], 
  [
   264273, 
   null, 
   "Waxy", 
   "Time to change that location tag Bassman......\n \n Waxy\n \n P.S. Briere and Drury for goons? You have to make the playoffs in order to win in the playoffs.", 
   {}, 
   263981, 
   null, 
   1179865860.0
  ], 
  [
   264414, 
   null, 
   "Waxy", 
   "Condolences E Mutz.\n \n Tough series to call is the final set to for Lord Stanley's Cup, but I'm going to follow my head and go with Anaheim.\n \n I'll be cheering for Ottawa though, only because I'd like to see the Cup return to its rightful home north of the 49th.\n \n Waxy", 
   {}, 
   264273, 
   null, 
   1179961740.0
  ], 
  [
   265290, 
   null, 
   "Waxy", 
   "It's deafeningly quiet in here...........\n \n Waxy", 
   {}, 
   264414, 
   null, 
   1180461780.0
  ], 
  [
   265295, 
   null, 
   "E Mutz", 
   "It's deafeningly quiet in here...........\n \n Waxy\n\n \n Something unpleasant has happened...", 
   {}, 
   265290, 
   null, 
   1180463280.0
  ], 
  [
   268076, 
   null, 
   "Fisher", 
   "Is it too late to pick the ducks to beat the sens in 5 games. With S. Neydermier winning the conn smyth. Emery will look shaky and Alfie will dissappear for game 4 and score twice in game 5 losing effort.\n \n Predictions Ducks win, Pronger still broke from all the child support payments he has in Edmonton.", 
   {}, 
   262145, 
   null, 
   1181558220.0
  ], 
  [
   276590, 
   null, 
   "Dora", 
   "I'm sad that canadians can't win the Stanley cup about 15 years :( such traditionals and no result :(", 
   {}, 
   268076, 
   null, 
   1186404360.0
  ], 
  [
   284794, 
   null, 
   "Fisher", 
   "Canadians do win the stanley cup every year. Each of the 30 NHL teams is full of Canucks. Not to mention that the Habs, Sens, Canucks, Leafs all have european captains and no european has ever Captained a Team to victory in the Stanley cup finals. The cup winning team will always have 19 Canadians and three russians Markov, Chekov and Fukoff \n \n Peace Fisher", 
   {}, 
   276590, 
   null, 
   1190355480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Stanley Cup 2007", 
  "url": "http://www.4forums.com/political/sports-debates/9774-stanley-cup-2007-a.html", 
  "breadcrumbs": [
   "Sports"
  ], 
  "id_number": 9774, 
  "discussion_files": [
   [
    "28608.html", 
    "http://www.4forums.com/political/sports-debates/9774-stanley-cup-2007-a-print.html"
   ], 
   [
    "28609.html", 
    "http://www.4forums.com/political/sports-debates/9774-stanley-cup-2007-a-3-print.html"
   ], 
   [
    "28610.html", 
    "http://www.4forums.com/political/sports-debates/9774-stanley-cup-2007-a-2-print.html"
   ]
  ], 
  "identifier": 9774
 }
]