[
 [
  [
   259530, 
   null, 
   "Archangel", 
   "This article is very insightful as it exposes how Hillbilly will even deceive their own supporters in order to give the impression of overwhelming support based on the money they raise. I wont support Ossama, I mean Obama either but I like to see him outclassing her as the junior Senator he is.\n \n \n FIRST PRIMARY': OBAMA ROMPED HILLARY\n Body: By DICK MORRIS & EILEEN MCGANN\n \n Bill Clinton defined the March 31 financial filings as the \"first primary\" as he exhorted donors to do their utmost to lift his wife to the winners' circle. Now the results are in - and S en. Barack Obama is the victor by a wide margin. \n \n The breadth and scope of Obama's win weren't apparent until when we got to see the fine print of the detailed first-quarter financial reports filed with the Federal Elections Commission. \n \n On the surface, his fund-raising success seemed roughly similar to Sen. Hillary Clinton's - by itself a big victory for the rookie from Illinois. She reports $22.5 million on hand (minus debt) that she can spend during the primary, while he has $19 million. \n \n But $10 million of Clinton's total comes from funds transferred to her presidential campaign from her Senate campaign committee (i.e., funds raised last year). So when it comes to net primary cash-on-hand raised this quarter, Obama has a substantial edge - $19 million vs. $12.5 million. \n \n Hillary padded her fund-raising total with almost $7 million that she can only spend in the general election. This might as well be Confederate currency for all the good it can do her during the primaries. \n \n But the rout gets even more substantial as you probe the fine print. \n * Hillary raised extensive contributions, certainly more than $1 million, from special-interest political-action committees (PACs) and lobbyists. Obama refused to tap this source of funding and even returned $50,000 he'd received from lobbyists.\n \n * An estimated three-quarters of Clinton's donors have maxed out, (that is, given the legal maximum of $2,300 a person for during the primary), vs. with fewer than half of Obama's contributors, according to news reports. Most of his donors can keep giving; most of hers can't. \n \n * Obama out-raised Clinton on the Web by 3:2. Internet money is especially valuable because it can be tapped repeatedly and quickly, as Howard Dean showed in '04. \n \n * Hillary didn't list any expenditures for candidate travel, charter flights, makeup or hair. She may have rolled over this spending so as not to have to deplete her cash-on-hand showing. \n Obama's success in assembling a cash juggernaut so early in a campaign that wasn't a gleam in anybody's eye seven months ago is extraordinary. Lacking the star power of a former president, with a far smaller list of past donors, and then running a distant second in the polls, he scored an amazing triumph. \n \n But just as interesting is why Hillary failed to win this \"first primary.\" Without the perks of the Lincoln bedroom, state dinners, pending legislation, plumb appointments, federal contracts and Air Force One flights, the Clintons seem to lack the goodies to bring in the donors. Just how much of their money was driven by these trappings of power is evident in their pedestrian first-quarter fund-raising record. \n \n Obama's victory in the fund-raising derby may now be mirrored by a new poll spurt. CNN has the Hillary-Obama margin closing from 37 percent to 22 percent on March 9-11 to a bare 30-to-26 on April 10-12. The Rasmussen poll reflects a similar tightening from 34-29 on April 9 to a scant 32-30 on April 16. \n \n In all, it's not a good time to be Hillary Rodham Clinton.", 
   {
    "post_info": {
     "post_title": "SURPRISE: Hillary didn't really raise 26 Million in Donations:"
    }
   }, 
   null, 
   null, 
   1177046400.0
  ], 
  [
   259539, 
   null, 
   "Master_Shake", 
   "And I should care why exactly?", 
   {}, 
   259530, 
   null, 
   1177053420.0
  ], 
  [
   259541, 
   null, 
   "Archangel", 
   "And I should care why exactly?\n\n \n A) It's a debate forum.\n \n B) It reveals something about her honesty and that appearances are more important to the Clintons than substance. \n \n And C) That their old manipulative tricks aren't going to work so easily this time around. \n \n As to why you should care ? I don't remember asking you to comment, you did that on your own.", 
   {}, 
   259539, 
   null, 
   1177054860.0
  ], 
  [
   259549, 
   null, 
   "gamehuis", 
   "Hold the presses people, Archangel just found out that politicians* lie and are deceitful. \n \n Whatever will Captain Obvious think of next?\n \n Stay tuned for the next episode of \"No S**t Sherlock.\"\n \n \n *This naturally only applies to Democrats\n \n \n The Clintons are scum, I thought everybody knew that.", 
   {}, 
   259541, 
   null, 
   1177071240.0
  ], 
  [
   259558, 
   null, 
   "Matthew S", 
   "A) It's a debate forum.\n \n B) It reveals something about her honesty and that appearances are more important to the Clintons than substance. \n \n And C) That their old manipulative tricks aren't going to work so easily this time around. \n \n As to why you should care ? I don't remember asking you to comment, you did that on your own.\n\n \n You forgot several things. \n \n A) She raised the money for her senate campaign so she raised the money at one time.\n \n B)No where have I ever heard that she raised the money in a certain time frame. Just that she had raised the money as of a certain date.\n \n C) She can legally transfer the money as long as it is used for a political campaign. In fact Al Gore or John Kerry could donate the millions they have left from their campaigns to her campaign if they wanted to do so.\n \n And D) Even if she did something that was not above board, she is still 1000000 times a better human being then any evil, inhuman, bigoted, trash that is on the republinazi side.", 
   {}, 
   259541, 
   null, 
   1177072620.0
  ], 
  [
   259560, 
   null, 
   "Matthew S", 
   "\n \n \n The Clintons are scum, I thought everybody knew that.\n\n \n If the Clintons are scum then that must make all the republinazis sludge. Wake up there is not one republinazi that is even half the human being Hillary is.", 
   {}, 
   259549, 
   null, 
   1177072920.0
  ], 
  [
   259565, 
   null, 
   "gamehuis", 
   "If the Clintons are scum then that must make all the republinazis sludge. Wake up there is not one republinazi that is even half the human being Hillary is.\n\n I think that it's you who needs to wake up.\n There is no real difference between the Republicans and the Democrats. Both parties serve the big corporate interests and Israel.\n \n Here's Hillary on the issues:\n \n - Iraq ==< pass non-binding resolution\n - Iran ==< nuke it if Israel says so\n - Fiscal deficits ==< what deficits?\n - Immigrants ==< my maid Juanita says they're ok\n - Gay marriage ==< for it, as long as doesn't cost me any votes\n - GITMO ==< don't mention that again, ever\n - Minimum wage increase ==< Pass the bill in the House for show, but block it in the Senate or else our corporate overlords will complain\n \n The only thing that Hillary really campaigns on is that Bush blows. I'm sorry but \"I'm not as bad as Bush\" is not a platform that should be good enough to become President.\n \n If anything, Bush is less worse than Hillary because he can plead insanity and the whole world would agree with him.\n \n \n BTW, if Hillary gets elected, then think of this: \n \n Presidents since 1988:\n \n - Bush\n - Clinton\n - Bush\n - Clinton\n - (Jeb Bush?)\n \n You guys have got your own plutocratic monarchy going over there.\n \n \n Oh and if you think that all Republicans are nazis, check this guy out, he might surprise you:\n \n http://www.ronpaul2008.com/html/Issues_fx.html\n \n This guy is so feared by both the Democrats and the Republicans that the media have been told to shun him.\n Not even moral crusader Jon Stewart mentions him...", 
   {}, 
   259560, 
   null, 
   1177074780.0
  ], 
  [
   259566, 
   null, 
   "Matthew S", 
   "\n \n This guy is so feared by both the Democrats and the Republicans that the media have been told to shun him.\n Not even moral crusader Jon Stewart mentions him...\n\n \n Actually he sounds like Brownback lite and is more liberal then many republinazis like Santorum and Buchanan", 
   {}, 
   259565, 
   null, 
   1177075680.0
  ], 
  [
   259569, 
   null, 
   "gamehuis", 
   "Actually he sounds like Brownback lite and is more liberal then many republinazis like Santorum and Buchanan\n\n He's actually a Libertarian. \n This guy is literally the only person in Washington DC with a clean consistent voting record. He has always voted to lower taxes and never to raise them.\n He voted against the Patriot Act and the Iraq war.\n \n I suggest you Youtube him and hear him speak. Please note how he actually answers questions unlike any other presidental candidate and actually makes sense of all the issues, be it abortion, gay marriage, the Iraq war etc.", 
   {}, 
   259566, 
   null, 
   1177076400.0
  ], 
  [
   259581, 
   null, 
   "Master_Shake", 
   "Archangel- My point was, as gamehuis made clear as well, so what? I'm not much of a fan of Hillary to begin with and politicians lie. It's what they do for a living. They've made this whole race about money and she was trying to give herself an edge. Whoop de doo.", 
   {}, 
   259569, 
   null, 
   1177085220.0
  ], 
  [
   259591, 
   null, 
   "Archangel", 
   "Archangel- My point was, as gamehuis made clear as well, so what? I'm not much of a fan of Hillary to begin with and politicians lie. It's what they do for a living. They've made this whole race about money and she was trying to give herself an edge. Whoop de doo.\n\n \n Like her or not, she is a contender in this race and must be followed and reported on. Especially her lies, manipulations and inconsistencies. That is what I'm doing by posting on her activities. If it doesn't interest you then don't comment on it but don't brush it off or dismiss it as if I'm wasting forum space. Because last I saw, It wasn't necessary to make sure a thread passed the master_shake approval test before posting it.", 
   {}, 
   259581, 
   null, 
   1177089720.0
  ], 
  [
   259592, 
   null, 
   "Archangel", 
   "Oh and if you think that all Republicans are nazis, check this guy out, he might surprise you:\n \n http://www.ronpaul2008.com/html/Issues_fx.html\n \n This guy is so feared by both the Democrats and the Republicans that the media have been told to shun him.\n Not even moral crusader Jon Stewart mentions him...\n\n \n I sincerely wish a third party candidate could get some traction in this Country. Maybe the Republicans and Dems have become so intertwined and similar that the voters will revolt again this time only to give us a Third Party President to shake Washington up. I'll tell you this, If Ron Paul ever won, he could much more easily win over Republican support with his views than the dems.", 
   {}, 
   259591, 
   null, 
   1177090020.0
  ], 
  [
   259594, 
   null, 
   "sinjin", 
   "I sincerely wish a third party candidate could get some traction in this Country. Maybe the Republicans and Dems have become so intertwined and similar that the voters will revolt again this time only to give us a Third Party President to shake Washington up. I'll tell you this, If Ron Paul ever won, he could much more easily win over Republican support with his views than the dems.\n\"Winner take all\" by Congressional District pretty much neutralizes any threat of a third party candidate ever getting into the White House.", 
   {}, 
   259592, 
   null, 
   1177090680.0
  ], 
  [
   259596, 
   null, 
   "Archangel", 
   "\"Winner take all\" by Congressional District pretty much neutralizes any threat of a third party candidate ever getting into the White House.\n\n \n What do you mean ? I don't understand what you're saying sinjin. If 2/3rds of all registered voters in America voted for Ron Paul in the General Election, are you saying he still wouldn't win the Whitehouse because we don't have at least 1/3rd Libertarian representation in Congress ?", 
   {}, 
   259594, 
   null, 
   1177092120.0
  ], 
  [
   259604, 
   null, 
   "Dono", 
   "Dick Morris cowrote .... I remember a statement he made on TV, \"Hillary Clinton cannot move to New York and be elected senator\".", 
   {}, 
   259596, 
   null, 
   1177097220.0
  ], 
  [
   259610, 
   null, 
   "jim's trucking", 
   "Creative accounting has long been a tool of the Clintons.", 
   {}, 
   259604, 
   null, 
   1177098900.0
  ], 
  [
   259615, 
   null, 
   "sinjin", 
   "What do you mean ? I don't understand what you're saying sinjin. If 2/3rds of all registered voters in America voted for Ron Paul in the General Election, are you saying he still wouldn't win the Whitehouse because we don't have at least 1/3rd Libertarian representation in Congress ?\nNo, I'm not saying that at all. Please check out how the Electoral College functions. Specifically how it puts third party candidates at a disadvantage.", 
   {}, 
   259596, 
   null, 
   1177100820.0
  ], 
  [
   259617, 
   null, 
   "Master_Shake", 
   "Like her or not, she is a contender in this race and must be followed and reported on. Especially her lies, manipulations and inconsistencies. That is what I'm doing by posting on her activities. If it doesn't interest you then don't comment on it but don't brush it off or dismiss it as if I'm wasting forum space. Because last I saw, It wasn't necessary to make sure a thread passed the master_shake approval test before posting it.\n\n Oh lordy, why does everyone around here take themselves so :xcensored ing seriously? You're all gonna give yourselves strokes.", 
   {}, 
   259591, 
   null, 
   1177100940.0
  ], 
  [
   259621, 
   null, 
   "Archangel", 
   "Oh lordy, why does everyone around here take themselves so :xcensored ing seriously? You're all gonna give yourselves strokes.\n\n \n I take it personally when I'm dismissed as if I'm wasting the forums time with a subject of interest. Don't presume to \"so what\" a thread of mine you have no interest in, just don't respond at all if you have nothing to contribute. And I'm not taking myself seriously, I'm taking your condescending attitude towards my thread seriously. But thanks for the concern about a stroke. :)", 
   {}, 
   259617, 
   null, 
   1177102020.0
  ], 
  [
   259623, 
   null, 
   "Archangel", 
   "No, I'm not saying that at all. Please check out how the Electoral College functions. Specifically how it puts third party candidates at a disadvantage.\n\n \n I understand the Electoral College, and believe that if 2/3rds of the American registered voters voted for a Third Party Candidate in the General Election, he would win hands down. Especially since the other two candidates would split the remaining 1/3rd of the votes. Sounds like a landslide victory to me. Correct me if I'm wrong.", 
   {}, 
   259615, 
   null, 
   1177102320.0
  ], 
  [
   259626, 
   null, 
   "E Mutz", 
   "Oh lordy, why does everyone around here take themselves so :xcensored ing seriously? You're all gonna give yourselves strokes.\n\n \n A guy with a lion picture is tussling with a mutant ninja turtle on matters of gravity. \n \n I grock the fullness!", 
   {}, 
   259617, 
   null, 
   1177103820.0
  ], 
  [
   259661, 
   null, 
   "Master_Shake", 
   "A guy with a lion picture is tussling with a mutant ninja turtle on matters of gravity. \n \n I grock the fullness!\n\n How I love you E Mutz emoticon_xgood", 
   {}, 
   259626, 
   null, 
   1177113000.0
  ], 
  [
   259669, 
   null, 
   "Matthew S", 
   "He's actually a Libertarian. \n This guy is literally the only person in Washington DC with a clean consistent voting record. He has always voted to lower taxes and never to raise them.\n He voted against the Patriot Act and the Iraq war.\n \n I suggest you Youtube him and hear him speak. Please note how he actually answers questions unlike any other presidental candidate and actually makes sense of all the issues, be it abortion, gay marriage, the Iraq war etc.\n\n \n I don't like liertarians either they are too conservative for me.", 
   {}, 
   259569, 
   null, 
   1177122000.0
  ], 
  [
   259672, 
   null, 
   "Archangel", 
   "A guy with a lion picture is tussling with a mutant ninja turtle on matters of gravity. \n \n I grock the fullness!\n\n \n You oughta be on TV E Mutz.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n So I can turn the channel :) emoticon_xgood emoticon_xhoho \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n emoticon_xdonno", 
   {}, 
   259626, 
   null, 
   1177122960.0
  ], 
  [
   259684, 
   null, 
   "JPSartre12", 
   "If the Clintons are scum then that must make all the republinazis sludge. Wake up there is not one republinazi that is even half the human being Hillary is.\n\n \n Wow! Another cogent argument by Matthew. emoticon_rolleyes \n Yer sister wears combat boots! :)", 
   {}, 
   259560, 
   null, 
   1177126620.0
  ], 
  [
   259687, 
   null, 
   "Symbiote", 
   "I don't like liertarians either they are too conservative for me.\n\n \n That's like saying the problem with milk is that its too much like a milkshake.", 
   {}, 
   259669, 
   null, 
   1177128180.0
  ], 
  [
   259698, 
   null, 
   "jyoshu", 
   "Oh and if you think that all Republicans are nazis, check this guy out, he might surprise you:\n \n http://www.ronpaul2008.com/html/Issues_fx.html\n \n This guy is so feared by both the Democrats and the Republicans that the media have been told to shun him.\n Not even moral crusader Jon Stewart mentions him...\n\n \n Looks like an old-school conservative, in the vein of Barry Goldwater. \n \n He's too different from neo-cons to get anywhere in the Republican party. Sadly, Goldwater conservatism is mostly a dead breed.", 
   {}, 
   259565, 
   null, 
   1177132080.0
  ], 
  [
   259724, 
   null, 
   "Matthew S", 
   "That's like saying the problem with milk is that its too much like a milkshake.\n\n \n Why?\n \n I believe the government must strictly regulate business, tax the rich to take care of the poor, and government must ensure universal health care. Libertarians do not believe in these things so they are too conservative for me.", 
   {}, 
   259687, 
   null, 
   1177161420.0
  ], 
  [
   259725, 
   null, 
   "Symbiote", 
   "Why?\n\n \n Because the only sense in which libertarianism is at all conservative is in those parts of conservativism where conservatives have borrowed (at least in rhetoric) from libertarianism (or at the least, classical liberalism).\n \n \nI believe the government must strictly regulate business, tax the rich to take care of the poor, and government must ensure universal health care. Libertarians do not believe in these things so they are too conservative for me.\n\n \n Conservative doesn't mean \"anything Matthew S doesn't believe\", that's like how creationists label anything to do with evolution \"atheistic\" and anyone they dislike \"liberal\".\n \n This is not an accurate depiction of political beliefs:\n \n Matthew S<-----------------Moderate---------------<Conservative\n \n I believe the government must cease all regulation of business, eliminate taxes on both the rich and the poor, and government must get out of health care. Matthew S does not believe in these things so he is too conservative for me.\n \n Now you tell me what is wrong with this fashion of argument.", 
   {}, 
   259724, 
   null, 
   1177162140.0
  ], 
  [
   259727, 
   null, 
   "Matthew S", 
   "Because the only sense in which libertarianism is at all conservative is in those parts of conservativism where conservatives have borrowed (at least in rhetoric) from libertarianism (or at the least, classical liberalism).\n \n \n \n Conservative doesn't mean \"anything Matthew S doesn't believe\", that's like how creationists label anything to do with evolution \"atheistic\" and anyone they dislike \"liberal\".\n \n This is not an accurate depiction of political beliefs:\n \n Matthew S<-----------------Moderate---------------<Conservative\n \n I believe the government must cease all regulation of business, eliminate taxes on both the rich and the poor, and government must get out of health care. Matthew S does not believe in these things so he is too conservative for me.\n \n Now you tell me what is wrong with this fashion of argument.\n\n \n \n \n Have you ever done a political scale test? http://www.politicalcompass.org/questionnaire I am sorry but because liberterians do not favor regulations on business, or a strong tax base to support the poor and under privledged they are on the right and hence conservative.", 
   {}, 
   259725, 
   null, 
   1177163460.0
  ], 
  [
   259729, 
   null, 
   "Bassman", 
   "Matthew, what you are advocating is outright Socialism. High taxes and onerous regulations do more harm than good.", 
   {}, 
   259727, 
   null, 
   1177164360.0
  ], 
  [
   259730, 
   null, 
   "gamehuis", 
   "Have you ever done a political scale test? http://www.politicalcompass.org/questionnaire I am sorry but because liberterians do not favor regulations on business, or a strong tax base to support the poor and under privledged they are on the right and hence conservative.\n\n Here's a novel idea. Instead of taxing people into oblivion and then redistributing the money in a completely inefficient way (overhead anyone?), how about no taxes and no redistribution of wealth.\n \n I hope you do realise that one of the reason why you're in Iraq right now is because of big government and high taxes.\n \n In a way you're just like the neocons: big government, redistribution of wealth and high taxes.\n \n Ponzi-scheme socialist programs do not, nor will they ever benefit the people.\n \n BTW, taxing the rich to give to the poor, regulating business and welfare are all not mentioned in the Constitution and with good reason. The Founders were hardcore capitalists and they knew that true free market capitalism would make people prosper and set them free.\n Check out the true story of Thanksgiving to see the value of free market capitalism.", 
   {}, 
   259727, 
   null, 
   1177164420.0
  ], 
  [
   259731, 
   null, 
   "Bassman", 
   "Here's a novel idea. Instead of taxing people into oblivion and then redistributing the money in a completely inefficient way (overhead anyone?), how about no taxes and no redistribution of wealth.\n \n I hope you do realise that one of the reason why you're in Iraq right now is because of big government and high taxes.\n \n In a way you're just like the neocons: big government, redistribution of wealth and high taxes.\n \n Ponzi-scheme socialist programs do not, nor will they ever benefit the people.\n\n Good call Gamehuis. Matthew, I posted this in whistlestopper.com and this thread has the stats to prove my point (with thanks to fellow Buffalonian The Blue Max emoticon_xgood ) http://www.whistlestopper.com/forum/showthread.php?t=51961\n \n Right now, because of unchecked Liberalism, New York has the creme'de la creme' of social spending programs, yet is dead last in private sector business growth. And as everybody with half a brain knows, it is the private sector that makes or breaks an economy.", 
   {}, 
   259730, 
   null, 
   1177164660.0
  ], 
  [
   259734, 
   null, 
   "Symbiote", 
   "Political compass is worthwhile for the sole reason that it highlights the inadequecies of categorising political beliefs as \"left vs right\" or \"liberal vs conservative\" - there is NO conservative axis (of the four) on the political compass site.\n \n Simply because someone doesn't agree with some of your views doesn't make them a conservative.\n \n Simply because someone shares some views with a conservative doesn't make them a conservative.\n \n The Nazis believed in public education. You believe in public education. Are you therefore a Nazi? This line of argument is simply ignorant.", 
   {}, 
   259727, 
   null, 
   1177164780.0
  ], 
  [
   259735, 
   null, 
   "Matthew S", 
   "Political compass is worthwhile for the sole reason that it highlights the inadequecies of categorising political beliefs as \"left vs right\" or \"liberal vs conservative\" - there is NO conservative axis (of the four) on the political compass site.\n \n Simply because someone doesn't agree with some of your views doesn't make them a conservative.\n \n Simply because someone shares some views with a conservative doesn't make them a conservative.\n \n The Nazis believed in public education. You believe in public education. Are you therefore a Nazi? This line of argument is simply ignorant.\n\n \n It goes back to my high school government class. Those on the left were liberal, those on the right were conservative.", 
   {}, 
   259734, 
   null, 
   1177164960.0
  ], 
  [
   259736, 
   null, 
   "Symbiote", 
   "Well if the government told you it, it must be true. /sarcasm", 
   {}, 
   259735, 
   null, 
   1177165020.0
  ], 
  [
   259737, 
   null, 
   "Bassman", 
   "It goes back to my high school government class. Those on the left were liberal, those on the right were conservative.\n\n \n And therein lies the flawed logic. You know full well I am Conservative, but by the same token, I tend to be liberal on some issues (like prison reform)", 
   {}, 
   259735, 
   null, 
   1177165560.0
  ], 
  [
   259739, 
   null, 
   "gamehuis", 
   "What people need to understand is that no person on this planet is only one thing. People aren't liberal or conservative on all the issues.\n And until we understand that all people are individuals and cannot and should not be lumped together in one group, the \"left-right-liberal-conservative\" debate is just plain stupid.", 
   {}, 
   259737, 
   null, 
   1177165920.0
  ], 
  [
   259743, 
   null, 
   "Bassman", 
   "What people need to understand is that no person on this planet is only one thing. People aren't liberal or conservative on all the issues.\n And until we understand that all people are individuals and cannot and should not be lumped together in one group, the \"left-right-liberal-conservative\" debate is just plain stupid.\n\n \n So true, as I am learning.", 
   {}, 
   259739, 
   null, 
   1177166820.0
  ], 
  [
   259801, 
   null, 
   "JPSartre12", 
   "Here's a novel idea. Instead of taxing people into oblivion and then redistributing the money in a completely inefficient way (overhead anyone?), how about no taxes and no redistribution of wealth.\n \n I hope you do realise that one of the reason why you're in Iraq right now is because of big government and high taxes.\n \n In a way you're just like the neocons: big government, redistribution of wealth and high taxes.\n \n Ponzi-scheme socialist programs do not, nor will they ever benefit the people.\n \n BTW, taxing the rich to give to the poor, regulating business and welfare are all not mentioned in the Constitution and with good reason. The Founders were hardcore capitalists and they knew that true free market capitalism would make people prosper and set them free.\n Check out the true story of Thanksgiving to see the value of free market capitalism.\n\n \n I don't know how we can disagree on so much but still be in 100% agreement on the above. emoticon_confused emoticon_xgood", 
   {}, 
   259730, 
   null, 
   1177198380.0
  ], 
  [
   259804, 
   null, 
   "gamehuis", 
   "I don't know how we can disagree on so much but still be in 100% agreement on the above. emoticon_confused emoticon_xgood\n\n I wonder about that myself sometimes. :p\n \n Just goes to show you that while people can't agree on everything there's always some common ground.", 
   {}, 
   259801, 
   null, 
   1177198740.0
  ], 
  [
   259810, 
   null, 
   "Matthew S", 
   "I wonder about that myself sometimes. :p\n \n Just goes to show you that while people can't agree on everything there's always some common ground.\n\n \n My one and only conservative issue is I do not believe that there should be a sex offender registry. Then again that might be a liberal thing since it smacks against personal freedom.", 
   {}, 
   259804, 
   null, 
   1177201140.0
  ], 
  [
   259812, 
   null, 
   "Bassman", 
   "My one and only conservative issue is I do not believe that there should be a sex offender registry. Then again that might be a liberal thing since it smacks against personal freedom.\n\n \n There is that flawed thinking again. Haven't you learned anything yet?!?!? emoticon_confused \n \n Just because something doesn't agree with your worldview, you lump it into what is commonly called an \"offensive generalization\". Hey Matthew, try taking some of your own advice and open your mind up. OK??", 
   {}, 
   259810, 
   null, 
   1177202280.0
  ], 
  [
   259838, 
   null, 
   "Archangel", 
   "Here's an interesting piece about Barack Obama's journey to who he is today. And it reveals that like hillary, he's very careful how he delineates the details of his past. Concentrating heavilly on minimizing his moslem roots and education in a Wahabi Madrassas school. \n \n Apr 21, 2007 11:22 PM \n Subject OBAMA= INTERESTING ? Be careful, be very careful. \n Body: Barack Hussein Obama was born in Honolulu, Hawaii, to Barack Hussein Obama Sr. (black muslim) of Nyangoma-Kogelo, Siaya District, Kenya, and Ann Dunham of Wichita, Kansas. (white atheist ).\n \n When Obama was two years old, his parents divorced and his father returned to Kenya. His mother married Lolo Soetoro -- a Muslim -- moving to Jakarta with Obama when he was six years old. Within six months he had learned to speak the Indonesian language. Obama spent \"two years in a Muslim school, then two more in a Catholic school\" in Jakarta. Obama takes great care to conceal the fact that he is a Muslim while admitting that he was once a Muslim, mitigating that damning information by saying that, for two years, he also attended a Catholic school.\n \n Obama's father, Barack Hussein Obama, Sr. was a radical Muslim who migrated from Kenya to Jakarta, Indonesia. He met Obama's mother, Ann Dunham-a white atheist from Wichita, Kansas-at the University of Hawaii at Manoa. Obama, Sr. and Dunham divorced when Barack, Jr. was two.\n \n Obama's spinmeisters are now attempting to make it appear that Obama's introduction to Islam came from his father and that influence was temporary at best.\n \n In reality, the senior Obama returned to Kenya immediately following the divorce and never again had any direct influence over his son's education.\n \n Dunham married another Muslim, Lolo Soetoro who educated his stepson as a good Muslim by enrolling him in one of Jakarta's Wahabbi schools. Wahabbism is the radical teaching that created the Muslim terrorists who are now waging Jihad on the industrialized world.\n \n Since it is politically expedient to be a Christian when you are seeking political office in the United States, Obama joined the United Church of Christ to help purge any notion that he is still a Muslim.\n \n Handsome . . . Charming . . . Winsome . . . Dangerous . . . Deceptive . . . Determined ", 
   {
    "post_info": {
     "post_title": "Obama's Biography:"
    }
   }, 
   259812, 
   null, 
   1177219980.0
  ], 
  [
   259845, 
   null, 
   "obvious_child", 
   "and as everybody with half a brain knows, it is the private sector that makes or breaks an economy.\n\n \n In the long run yes, in the short no. Government spending on war in WWII made the economy, likewise the massive private sector boom in the 1990s made the economy. But a country cannot rely on one exclusively though, even the USSR had a semi-private sector. A significant amount of the growth in the US economy over the past 6 years was due to exploding government spending.", 
   {}, 
   259731, 
   null, 
   1177228980.0
  ], 
  [
   259848, 
   null, 
   "obvious_child", 
   "What do you mean ? I don't understand what you're saying sinjin. If 2/3rds of all registered voters in America voted for Ron Paul in the General Election, are you saying he still wouldn't win the Whitehouse because we don't have at least 1/3rd Libertarian representation in Congress ?\n\n \n Under that set of circumstances yes. However that's not how it works. What sinjin is referring to is the congressional redistricting and single seat/vote districts. Essentially the districts for Congress are 'gerrymandered' into democrat/republican strongholds shutting out the power that 3rd party voters hold. Perot showed that the 3rd party does have significant power, what the Fiengold-McCain bill was to completely disperse this power. This ensures that Congress is either Red or Blue, never any other color. This basic regionalization applies to the White house as well as 3rd party votes are therefore spread out, thereby reducing their effect. If we had a PR system we'd see, as Perot showed, somewhere around a 12% representation in Congress, a unheard of 6 3rd party senators, and 52 3rd party representatives.", 
   {}, 
   259596, 
   null, 
   1177230060.0
  ], 
  [
   259851, 
   null, 
   "Archangel", 
   "Here's more on the Dems future VP running mate for Hillbilly.\n \n MORE INTERESTING OPINIONS ON OBAMA \n Body: Is Barack Obama Ideologically Muslim?\n Published 2 months, 3 weeks ago in Islam in America and U.S. Politics. \n Tags: Islam in America, U.S. Politics.\n \n \n In recent days I had the question posed to me: \"Is Senator Barack Obama secretly a Muslim?\"\n \n That question made me ponder. Up until that moment, frankly, I'd never given it much thought because I've had little reason to pay attention to Obama. He's the darling of the Democratic Party, but there are greater fish to fry when you deal with jihad and Islam on a daily basis. That being said, however, I suddenly realized that this matter deserved more attention, because what if - just if - Barack Obama is hiding more than a smoking habit? If there are Muslim teachings and beliefs in his system, suddenly I do need to get involved in the investigation.\n \n And so, here we are. Time to start Google-ing, right?\n \n First things first, I did a search of my own site for references to Obama. I couldn't recall ever commenting on him before and as it turns out, I haven't. However, one reference to Barack did come up and that was my posting from 2006: A Listing of the Senators that Betrayed America. It turns out that Senator Obama's name appears on the list of \"Open Borders Supporters\", as I called them; one of too many U.S. Senators that voted Yes on S. 2611 ('Immigration Bill' or 'Amnesty for Illegals Bill', take your pick), passed by a vote of 62 to 36. Thankfully, this bill never got by the House.\n \n I'm not happy with that vote, but I can hardly start critiquing Barack Obama any more harshly than I would John McCain, a Presidential hopeful I once supported, who also signed off on S. 2611. (I am, by the way, no longer a supporter of Senator McCain's hopes for the Presidency. When given new information, I do indeed change my mind.) \n \n Now, the latest reports out of Hollywood seem to have folks like Steven Spielberg hosting fund raisers for Barack. \n \n I am not surprised by this, but I am always surprised by the lack of insight people show - a smooth-tongued, tall black man gets hailed as the savior of the Democratic Party, but so few are asking pointed questions. I suppose I'll be one of the few to ask then, because I have no desire to see anyone who even sniffs of Islamic ideology holding a seat in the White House. It's dangerous enough that we have one Muslim Congressman (Keith Ellison) and one Senator (Obama) that has been taught in a madrassa (an Islamic school), because these things in and of themselves, while outwardly seeming innocuous, are trend-setting, and that ain't good.\n \n Obama doesn't drink. That's a red flag, believe it or not. He does smoke though, as I mentioned before. Oops. Another red flag. Why? Well, alcohol consumption is taboo in Islam, but smoking is anything but: smoking fine, drinking baaaaad. Just coincidence?\n \n But, Obama is a recovering drug user you say? Cut him some slack - of course he won't drink? Wait a second. What's that - he used cocaine and marijuana and writes about it freely in his latest book topping bestseller lists with 800,000 copies in print, \"The Audacity of Hope: Thoughts on Reclaiming the American Dream\":\n \n \"Pot had helped, and booze; maybe a little blow when you could afford it. Not smack, though,\" he wrote. \"Junkie. Pothead. That's where I'd been headed: the final, fatal role of the young would-be black man. ... I got high [to] push questions of who I was out of my mind.\" \n \n Not smack (that's heroine, by the way) though. Wow. I guess we should be thankful that Senator Barack showed some willpower? What a tangent I could go off on here, but I'll stay focused. Is Barack Obama hiding an Islamic ideology in his closet? He sure seems open and honest about many things most politicians run from doesn't he?\n \n This could be a plus for Senator Barack. It's harder to believe he's hiding some attachment to Quranic teachings when he admits to drug use in his past. And so far, I have not convinced myself that the teachings in a madrassa have had any longterm impact on the Senator. However, let's be wise enough to own the fact that bold men can make great liars, while some make terrible ones. Is Barack just brutally honest?\n \n \"We were always playing on the white man's court . . . by the white man's rules,\" he writes. \"If the principal, or the coach, or a teacher . . . wanted to spit in your face, he could, because he had the power and you didn't. . . . The only thing you could choose was withdrawal into a smaller and smaller coil of rage.\n \n \"And the final irony: should you refuse this defeat and lash out at your captors . . . they would have a name for that too. Paranoid. Militant.\"\n \n For a man that's half-white (his mother and grandparents that raised him in Kansas are white), Barack sure seemed to have an axe or two to grind with the \"White Man\" as a youth, and that again is - yes, you guessed it - a red flag. \n \n But, to the seeming rescue of Barack, here comes (trumpets please) - CNN. I guess I'm supposed to believe everything they report, right? Well, let's go beyond that - let's watch the report that claims to debunk claims that Barack was taught in an Islamic school. \"I came here to Barack Obama's elementary school in Jakarta looking for what some are calling an Islamic madrassa ... like the ones that teach hate and violence in Pakistan and Afghanistan,\" Vause, the CNN reporter so charmingly coins in, as if the mere idea is audacious. What follows is the video segment and more details from CNN may be found in print here:\n \n \"It's not (an) Islamic school. It's general,\" Winadijanto (the current headmaster) said. \"There is a lot of Christians, Buddhists, also Confucian. ... So that's a mixed school.\"\n \n A \"mixed school\" where \"most\" of the students are Muslim. Hmm. Indeed. Watch the video again and you'll hear the CNN reporter himself admit to that very quickly. This should be no surprise when one understands that there are more Muslims in Indonesia than there are anywhere else in the world, including the Middle East.\n \n I've seen enough. Look, I've got nothing personally against Barack Obama, and I don't have enough evidence yet to be convinced myself, let alone convince others, that Barack is hiding some deep, dark Islamic scheme in his closet. I just don't really believe that yet. But I do know this much: that he was taught in a predominantly Islamic school in a part of the world that is rife with Islamic violence, and the only reason that Western attire is worn by the teachers there is more a product of Asian Muslim influences and Australia as a neighbor as opposed to the typical Islamic seat-of-power influence that hails from Mecca in the Arab Middle East. If this madrassa had been in Saudi Arabia (or even Virginia for that matter), I'd have some very serious reservations.\n But reservations I have, and that's enough.\n \n The bottom line is this: Barack was influenced by Islamic teachings in his formative years (the Indonesian school in question teaches ages 6 to 12). This is not the chemical mixture for someone that I want to see holding a seat of any type in the White House. Is that clear for everyone? You can make up your own minds, and address the information as presented here in this article and elsewhere as you see fit, but the facts speak loudly to me when it comes to Islam in America, and I am not going to ever vote for Barack Obama.\n \n Hell, if Barack Obama ever becomes President of the United States, then there really is nothing stopping me from attempting that climb someday on my own, and that gives me quite a chuckle. I, for instance, have never used cocaine, and I don't smoke, but I do drink. A nice juxtaposition to Barack.\n \n Perhaps I'm aiming too low though? In today's America, my lack of the usual vices of our politicians might even make me a candidate for Sainthood. \n \n I think I'll stick to blogging the truth for now.\n \n Good luck, Senator Obama. I know that the Democratic Party is grooming you for the Vice Presidential seat next to President Hillary with all this publicity, this article now included, and the idea of that ticket gives me and thousands of others like me chills and nightmares, but if it does come to pass, perhaps this will be exactly what the USA needs to wake her up to just how crazy and dangerous the world has become. I can almost see the Islamists sharpening their axes at the mere prospect of such a pair entering the White House. They will proclaim the intent to lead us to victory over the \"radical\" Muslims and the \"evil terrorists\", while all-the-while giving handouts to all the \"moderate\" Muslims who want to find more seats in the U.S. Congress and also be sworn in on a Quran (preferably one owned by a Founding Father) and begin to tell the rest of us how to live under Sharia Law like they do so successfully in places like Saudi Arabia. \n \n Hey, I'm just being honest. I'm sure someone as open as Barack can respect that.\n \n Related Links: Media Matters, Snopes, FoxNews, CNN, Washington Post \n ", 
   {
    "unicode_changes_made": true
   }, 
   259848, 
   null, 
   1177246980.0
  ], 
  [
   259852, 
   null, 
   "Archangel", 
   "Under that set of circumstances yes. However that's not how it works. What sinjin is referring to is the congressional redistricting and single seat/vote districts. Essentially the districts for Congress are 'gerrymandered' into democrat/republican strongholds shutting out the power that 3rd party voters hold. Perot showed that the 3rd party does have significant power, what the Fiengold-McCain bill was to completely disperse this power. This ensures that Congress is either Red or Blue, never any other color. This basic regionalization applies to the White house as well as 3rd party votes are therefore spread out, thereby reducing their effect. If we had a PR system we'd see, as Perot showed, somewhere around a 12% representation in Congress, a unheard of 6 3rd party senators, and 52 3rd party representatives.\n\n \n My point is that if the people, the voting public united behind a third Party Candidate, then he could win the Whitehouse even though he has no third party support in Congress.", 
   {}, 
   259848, 
   null, 
   1177247580.0
  ], 
  [
   259854, 
   null, 
   "Big_Bear_Scot", 
   "Who actually cares that Obama may be Muslim ?\n \n That thinking is very dangerous when you try to preclude someone from public office because of their Religion.\n \n If he is a Muslim does that in any way stop him from being a good candidate for President ?\n \n In my Country we have had a Muslim MP for about 10 years and he has been a credit to his constituents.\n \n http://en.wikipedia.org/wiki/Mohammad_Sarwar", 
   {}, 
   259852, 
   null, 
   1177250880.0
  ], 
  [
   259859, 
   null, 
   "Archangel", 
   "Who actually cares that Obama may be Muslim ?\n \n That thinking is very dangerous when you try to preclude someone from public office because of their Religion.\n \n If he is a Muslim does that in any way stop him from being a good candidate for President ?\n \n In my Country we have had a Muslim MP for about 10 years and he has been a credit to his constituents.\n \n http://en.wikipedia.org/wiki/Mohammad_Sarwar\n\n \n If his unstated allegiance is to islam then yes. Since we are at War with Islam, it's imperitive to me that my president be more concerned about America's best interests than Islams. Especially since America is the #1 Superpower on Earth. Scotland has very different standing and responsibility than the US does being as small as it is.", 
   {}, 
   259854, 
   null, 
   1177255500.0
  ], 
  [
   259860, 
   null, 
   "Big_Bear_Scot", 
   "If his unstated allegiance is to islam then yes. Since we are at War with Islam, it's imperitive to me that my president be more concerned about America's best interests than Islams. Especially since America is the #1 Superpower on Earth. Scotland has very different standing and responsibility than the US does being as small as it is.\n\n \n The US isn't at war with Islam, even George Bush has stated that. \n \n I would ask you as Christian what is your first allegiance to your faith or to your Country ?", 
   {}, 
   259859, 
   null, 
   1177257000.0
  ], 
  [
   259864, 
   null, 
   "simone", 
   "Obama IS NOT Muslim. That is an idiotic thing to say. He has been educated in Muslim schools--when he was a kid in Indonesia.", 
   {}, 
   259860, 
   null, 
   1177258020.0
  ], 
  [
   259868, 
   null, 
   "Big_Bear_Scot", 
   "Obama IS NOT Muslim. That is an idiotic thing to say. He has been educated in Muslim schools--when he was a kid in Indonesia.\n\n \n Just like if he grew up in Ireland he would have been educated in a Roman Catholic School.\n \n If AA wants to go down that route then only people of no Faith could ever be a President.\n \n The same argument was essentially used against Kennedy in the 60s. Some said that because Kennedy was a Roman Catholic he would put the interests of Vatican before the interests of the US.", 
   {}, 
   259864, 
   null, 
   1177260900.0
  ], 
  [
   259875, 
   null, 
   "ShadowPikachu", 
   "The US isn't at war with Islam, even George Bush has stated that. \n \n I would ask you as Christian what is your first allegiance to your faith or to your Country ?\n\n \n I'd reccomend not even trying to reason with him. He has made it clear through his posts throughout the forums that he believes we are at war with Islam, and we must decimate people following islam that are \"threats\" (Once he said we should have gone to Saudi Arabia and murdered all the relatives of Osama Bin Laden - because they have an estate there or something - his parents, brothers and sisters, and nephews and nieces, merely because of who Osama is.) There is no reasoning with a religious zealot who thinks we are in a Holy War against another religion.\n \n \n As of right now, and from what I know of him, I would definitely vote for Obama as president this next election.", 
   {}, 
   259860, 
   null, 
   1177270080.0
  ], 
  [
   259881, 
   null, 
   "JPSartre12", 
   "Obama IS NOT Muslim. That is an idiotic thing to say. He has been educated in Muslim schools--when he was a kid in Indonesia.\n\n \n Yeah, he may have been a crack-smokin' doper, but, God forbid, he wasn't a Muslim. :)", 
   {}, 
   259864, 
   null, 
   1177283520.0
  ], 
  [
   259889, 
   null, 
   "Bassman", 
   "To put it simply, Obama is the media poster boy, and has a liberal voting record both in the Senate and Illinois. I would not vote for him, pure and simple.", 
   {}, 
   259881, 
   null, 
   1177285320.0
  ], 
  [
   259913, 
   null, 
   "Archangel", 
   "The US isn't at war with Islam, even George Bush has stated that. \n \n I would ask you as Christian what is your first allegiance to your faith or to your Country ?\n\n \n I repeat, we are at War with Radical Islamist Fundamentalism, a movement that crosses all borders and races. It's an ideology that is taught in Madrasas schools by the name of Wahabiism. I liken it to electing an american as President who was educated in a National Socialist School during World War 2 as we were fighting Naziism. With a Nation full of Americans whose loyalties are beyond question, why even go there is my opinion.", 
   {}, 
   259860, 
   null, 
   1177297680.0
  ], 
  [
   259914, 
   null, 
   "ShadowPikachu", 
   "I repeat, we are at War with Radical Islamist Fundamentalism, a movement that crosses all borders and races. It's an ideology that is taught in Madrasas schools by the name of Wahabiism. I liken it to electing an american as President who was educated in a National Socialist School during World War 2 as we were fighting Naziism. With a Nation full of Americans whose loyalties are beyond question, why even go there is my opinion.\n\n \n Actually, if you were to actually repeat, you would have said this again: \n Since we are at War with Islam, it's imperitive to me that my president be more concerned about America's best interests than Islams.\n\n \n Not what you now are saying after we have criticised you.", 
   {}, 
   259913, 
   null, 
   1177297920.0
  ], 
  [
   259916, 
   null, 
   "Archangel", 
   "Actually, if you were to actually repeat, you would have said this again: \n \n Not what you now are saying after we have criticised you.\n\n \n I clarified for the sake of the simple minded. excuse the gesture. :)", 
   {}, 
   259914, 
   null, 
   1177298580.0
  ], 
  [
   259918, 
   null, 
   "Archangel", 
   "And here's more from the magnificent Rush Limbaugh on the truth behind the Imus scandal.\n \n 1. Limbaugh: Clintons Linked to Imus' Downfall\n \n Talk radio-star Rush Limbaugh sees the hand of the Clinton political machine in the ouster of Don Imus - who was an outspoken critic of Hillary Clinton while he was on the air.\n \n Discussing what he sees as an upcoming assault on conservatives on the radio, Limbaugh told his listeners on Monday: \"Understand that this is a Democrat Party, 'drive-by media,' Clinton image machine - or Clinton machine agenda - and it is to suppress and kill conservative information, which it labels 'misinformation.'\"\n \n He continued: \"They will say that their purpose is to eliminate conservative information because it's misinformation, because there's a template, and the template is conservatives are racist, and as such they have to be banned.\"\n \n Before Imus was fired by CBS, Hillary sent a mass e-mail to her supporters, saying Imus' comments about the Rutgers women's basketball team showed \"small-minded bigotry and coarse sexism.\"\n \n Imus constantly attacked Hillary on the air, even referring to her often as \"satan\" or the \"devil.\"\n \n Opining that there is an \"80 percent chance\" that Hillary will be the next president, Rush added that criticism of conservatives on the radio \"is about destroying the credibility of anybody who has anything in opposition, to save the Clintons and their quest to be re-ensconced in the White House . . . \n \n \"So when you keep talking about this in the context of Imus, it's so much more about things having nothing to do with Imus. If it was about Imus, it would be over, wouldn't it? And it's not, is it?\"\n \n Editor's Note:\n \n http://www.newsmax.com as an added offense to your sensibilities.", 
   {
    "unicode_changes_made": true
   }, 
   259916, 
   null, 
   1177299540.0
  ], 
  [
   259924, 
   null, 
   "obvious_child", 
   "My point is that if the people, the voting public united behind a third Party Candidate, then he could win the Whitehouse even though he has no third party support in Congress.\n\n \n Possible. But that would require a radical shift in opinion. Currently the system is designed to screw 3rd parties.", 
   {}, 
   259852, 
   null, 
   1177303620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  SURPRISE: Hillary didn't really raise 26 Million in Donations:", 
  "url": "http://www.4forums.com/political/politics-debates/9787-surprise-hillary-didnt-really-raise-26-million-donations.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9787, 
  "discussion_files": [
   [
    "27807.html", 
    "http://www.4forums.com/political/politics-debates/9787-surprise-hillary-didnt-really-raise-26-million-donations-print.html"
   ], 
   [
    "27808.html", 
    "http://www.4forums.com/political/politics-debates/9787-surprise-hillary-didnt-really-raise-26-million-donations-5-print.html"
   ], 
   [
    "27809.html", 
    "http://www.4forums.com/political/politics-debates/9787-surprise-hillary-didnt-really-raise-26-million-donations-4-print.html"
   ], 
   [
    "27810.html", 
    "http://www.4forums.com/political/politics-debates/9787-surprise-hillary-didnt-really-raise-26-million-donations-3-print.html"
   ], 
   [
    "27811.html", 
    "http://www.4forums.com/political/politics-debates/9787-surprise-hillary-didnt-really-raise-26-million-donations-2-print.html"
   ]
  ], 
  "identifier": 9787
 }
]