[
 [
  [
   259963, 
   null, 
   "Abaddon660", 
   "You can only curtail violence by addressing the cause of the violence not the manner in which it was carried out. \n \n People that are trying to implement gun control and bans are probably the most ignorant lot of political activist crazies we have here in the USA. I say ignorant not to insult people but as an accurate statement of their level of knowledge about the true nature of what they are trying to accomplish and about firearms in general. \n \n Your typical anti-gun person is passion driven, non-gun owning, well to do upper-middle class, sheltered and high strung. Soccer mom's and Metro-sexual's for the most part. Born and raised in suburbia in a sheltered community with a blind eye to the real world. Cookie cutter people with cookie cutter lives that alleviate their tremendous boredom by backing some cause or another so as to give themselves the illusion that they are doing some good in the world when in fact their lifestyle is going to cause more pain and suffering and death to the world through destruction of the environment then any gun ever could. \n \n Guns are not the problem. End of Story. Whenever there is a tragedy of some kind everyone is looking for someone or something to blame. If the perpetrator of the crime is dead... that's not enough. There has to be some justice of some kind to placate the masses. The people demand it! So where do people set their focus? Certainly not on themselves for ignoring the plight of American society and poverty and lack of funds for things like treatment for the mentally ill, better education and the like. NOOOOOO! They want to focus on something more convenient. The gun must be to blame!!! Ya.. That's it. Everyone gang up and parade the likeness of the victims behind your misdirected cause and march like lemmings over the cliff of reason into the bottomless pit of ignorant bliss. \n \n It's just like the supposed \"War on Drugs\". The Government has spent Billions on stomping out drugs of all kinds and in the end all we have is more chaos. We have jails full of drug offenders and streets full of drugs and a quirk that was once a somewhat harmless vice of society has become a full-blown epidemic. People failed to address the real issues and focused on an object.\n \n Same aspect with gun violence. Society fails to see or outright ignores the real causes. \n \n For instance, I own several Guns. I hope I never have to use them outside of target shooting and hunting but am prepared to do so if necessary. There are other people out there who don't share my sense and reason and would see the same guns as a tool to take advantage of others or cause them harm. But you don't need a gun for that. If there were no guns those same people would use other weapons, or make bombs. You could just Google up how to make a pipe bomb, make 20-30 of them and have a blast. That weapon in the same settings as the VT shooting would have probably caused more death. He could have opened a door, Tossed in a pipe bomb and closed the door... move on to the next room... rinse and repeat. Someone good with a sword could do just a much damage. A sword doesn't go BOOM so you could rack up quite a mess before anyone knew what was going on. \n \n My point is... People like the VT shooter can snap, taking away 1 tool of dealing death will only see it replaced by another. In the case of firearms you do more harm then good by taking away the most effective means of defense a person can carry. Instead of focusing on the tools why can't people focus on the root issues. Mass murderers are usually mentally deranged. Wouldn't it be a better use of the taxpayers money to work toward identifying those with severe mental issues and helping them get treated rather then just taking away one of the many possible tools they could use when they finally snap. Someone shoots a Gas Station clerk in a robbery. Instead of spending millions on enforcing new gun laws to slightly reduce the chance that that robber might have gotten the gun he used. Why not put the millions of dollars into civil action and education programs that would help that kind of person that is desperate enough to rob the store get a better life. Most do that sort of crime out of need and desperation. Some just do it for fun, those people have a warped sense of right and wrong and need help getting that straightened out though some method. \n \n You cannot have a utopia without the means to defend it. People must have the right to defend themselves and their homes. They must have the means to protect freedom from tyranny if needs be. \n \n The statement \"Guns don't Kill People, People Kill People\" says a great deal and is one of the most truthful quotes of all time. A man determined to kill another man will use a gun if he has one, if not then the next best thing, A good blade. If not that then a pointy stick. If not that then a rock. You cannot stop violence by eliminating the tools of violence. Or even reduce it for that matter. You have to address the causes where you can. Mankind is violent in nature so you will never stop all violence. By you can curtail a great deal of it by working with people and helping yourself and others lead a good life. \n \n This whole gun debate is not about the guns. It's about that people think guns cause. And in truth guns are not the cause. Owning a gun does not make me want to use it against someone. Just because I can doesn't mean I will. Address the reasons that cause people to want to use the available tools for destructive means and you can make the world a better place.", 
   {
    "post_info": {
     "post_title": "Take off your Blinders and Look at the Real Issues!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1177350780.0
  ], 
  [
   260823, 
   null, 
   "stariennight", 
   "YAY! WHAT HE/SHE SAID!!emoticon_xhoho", 
   {}, 
   259963, 
   null, 
   1177868760.0
  ], 
  [
   260881, 
   null, 
   "muttonchops", 
   "Couldn't agree more.", 
   {}, 
   259963, 
   null, 
   1177903920.0
  ], 
  [
   260954, 
   null, 
   "Sigma", 
   "\n It's just like the supposed \"War on Drugs\". The Government has spent Billions on stomping out drugs of all kinds and in the end all we have is more chaos. We have jails full of drug offenders and streets full of drugs and a quirk that was once a somewhat harmless vice of society has become a full-blown epidemic. People failed to address the real issues and focused on an object.\n \n\n \n While certainly the reasons people use drugs should and must be addressed, I think it disingenuous to suggest that easy access to drugs is not part of the problem. Cutting off the supply is a justifiable goal.", 
   {}, 
   259963, 
   null, 
   1177950240.0
  ], 
  [
   260998, 
   null, 
   "Abaddon660", 
   "Cutting off the supply is a justifiable goal.\n\n \n It would be if it were possible. \n \n To acomplish this you would have to: \n \n -Make extinct all plants that can be used to make drugs.\n -Destroy all chemicals that can be used to make drugs.\n -Erase all knowledge pertaining to the process of making drugs.\n -Find and Destroy all drugs in existence. \n -Erase the knowledge that drugs exist and what they do. \n \n The reason you would have to do these things is because it has been proven time and again that whenever there is a demand for something in society there will always be someone supplying or attempting to supply said demand. \n \n Best modern evidence to the fact is the American alcohol prohibition of the early 1900's. \n \n The same equasion can be applied to anything that there is a demand for.", 
   {}, 
   260954, 
   null, 
   1177965240.0
  ], 
  [
   261001, 
   null, 
   "Sigma", 
   "It would be if it were possible.\n\n \n Very true. Perhaps I should have said \"Restricting supply\" or \"Policing supply\". \n \n \nThe reason you would have to do these things is because it has been proven time and again that whenever there is a demand for something in society there will always be someone supplying or attempting to supply said demand.\n\n \n Absolutely. You stop demand, you stop supply. You stop supply, you get illegal supply.\n \n This is not to say, however, that drugs are not more than a \"minor vice\" to specific areas or that controlling supply is not possible with limited success. Also, again, it is disingenuous to suggest that easy access to drugs is not part of the problem, however minor the problem you believe it to be.", 
   {}, 
   260998, 
   null, 
   1177966260.0
  ], 
  [
   261007, 
   null, 
   "Abaddon660", 
   "Also, again, it is disingenuous to suggest that easy access to drugs is not part of the problem, however minor the problem you believe it to be.\n \n\n \n I think you're in the right arena but having some trouble finding the right seat on this one :) \n \n Means of drug access is a heavy contributing factor to allot of the gun crime we have here in the USA. \n \n Drugs are not as easy to come by as one might think. There is allot of risk invloved. \n \n -You might get caught... going to jail can take a person with a simple vice that had an otherwise good life and turn him/her into a burdon on society. \n -Criminals are the ones who deal drugs... they might rip you off or kill you. \n -Drugs are expensive. Due to hard crackdowns drugs are very costly... feeding a habbit is expensive and people will do anything to feed the habbit. Lie, Cheat, Steal, Kill and whatever else has to happen for them to get what they need. \n -Sharing of hard to come by paraphanalia spreads deadly desiese. \n \n In reality the things that are in place that make drugs more difficult to access are causing more overall crime. \n \n If drugs were more accessable we would likly have far less crime and far more drug adicts. \n \n I'm fine with that. You can punish people for doing stupid things on drugs just like drunk drivers get punished (some places anyway). \n \n I happen to think that you cannot save everyone. Drugs (starting them anyway) are a choice, like drinking and smoking. Let them be legal and then we all know who the adicts are when they show up to get their supply. Let the adicts be adicts. They will destroy their own lives and leave others unharmed (for the most part) by their actions. Eventually that element would diminish as the hardcore adicts OD and die off. The recreational users would continue to use recreational drugs (Pot and such). Minimal harm there. There might be a national shortage of macrowave burito's but hey... ya can't have everything perfect.", 
   {}, 
   261001, 
   null, 
   1177967400.0
  ], 
  [
   261009, 
   null, 
   "Sigma", 
   "\n Drugs are not as easy to come by as one might think. There is allot of risk invloved.\n\n \n Increasing the risk of buying and selling drugs is exactly the intended effect of the \"War on Drugs\" you lament.\n \n \nIf drugs were more accessable we would likly have far less crime and far more drug adicts.\n\n \n I think you might want to check your logic here... As far as I am aware, drug addicts cause a great deal of crime to support their habit. As you are, I am not terribly fond of policing someone's personal habits, but when drugs are the motivating force behind burglaries, assaults and muggings and addicts carry diseases such AIDS and tuberculosis then means of curtailing this should be explored. This may include policing or controlling the supply of drugs to an area to cut down and the amount of drugs sold, and thus less crime to support fewer habits.\n \n Easy access to drugs is, logically, part of the problem.\n \n \nThey will destroy their own lives and leave others unharmed (for the most part) by their actions. Eventually that element would diminish as the hardcore adicts OD and die off.\n\n \n Again, check your logic. They destroy their own lives, and they destroy other's lives by the crime they perpetrate. As \"harcore addicts OD and die off\" new ones take their place without restricted supply to those drugs. Other avenues, of course, should be persued (but mostly are not) concurrently, but that does not diminish that restricting or policing the supply of drugs with at least limited success is both defensible and logically sound.", 
   {}, 
   261007, 
   null, 
   1177968360.0
  ], 
  [
   261018, 
   null, 
   "TANSTAAFL'07", 
   " You can only curtail violence by addressing the cause of the violence not the manner in which it was carried out.\n\n \n Best thing I've seen written yet on this forum! Awesome post! Its CULTURAL people! Guns and Gun control has nothing to do with it!", 
   {
    "post_info": {
     "post_title": "Right on Brother!"
    }
   }, 
   261009, 
   null, 
   1177969980.0
  ], 
  [
   261137, 
   null, 
   "Abaddon660", 
   "I think you might want to check your logic here... As far as I am aware, drug addicts cause a great deal of crime to support their habit.\n\n \n Yes, absolutly right. They do. But why? \n Getting high does not constitute automatic crime as the media and polititions would have you believe. You don't just snort some coke and automatically decide to rob someone. \n \n The crime generally comes from desperation. Desperation for getting the next fix. The desperation exists because the drug of choice is very dificult to obtain due to it's cost and availability. Desperate people do desperate things. Take out the desperation and you take out the crime. \n \n Think of Cigaretes. Cigaretes are just as physically adictive as some of the harder drugs. It's been said by medical scientists that Cigaretes are as hard if not harder to kick then Heroin. I've known some people who have been on Heroin and it's a nightmare to watch. \n \n Now if Cigaretes are so hard and terrible. Why is it that we never hear of \"Cigarete related Crime\"? How come noone kills anyone else over this adiction? How come you never hear of someone robbing a store for cigarete money? \n \n Because this drug is relativly inexpensive and widly available. Getting the next fix is not a desperate thing because in a tight spot with no money for the next fix most poeple don't have to look far to \"bum\" a smoke from someone and feed the craving. The desperation disapeares at this point.\n \n Getting High is done for it's own sake. If you want to eliminate the Gun crime that permiates from drug related issues (which is substantial in the USA) you must target the desperation that causes the crime. \n \n The end result that people abhore is the pain and loss that comes from the crime. People look to place blame for their loss. They place the blame on Drugs and Guns. But those are just objects. The objects did not commit or cause the crime. It takes a person to cause a crime. They commited the crime for a reason. Most times the reason is desperation. \n \n In order to reduce the crime that we all abhore you must attack the desperation. You cannot curtail supply and demand, you cannot totally eliminate drugs, new ones will replace them. You cannot eliminate weapons like guns, new ones will replace them. You must focus on the real cause. The desparation in people that commit crimes that results from the circumstances of their lives. Address those issues by working with people and their addictions. Not squashing them under foot and sending them to jail which ruins any change of betterment for them. Take the money from the war on drugs and the money spent enforcing drug laws and put it into social action programs that will treat the people not the object. \n \n Annother option if to research the nature of adiction. If someone were to create a treatment that could instantly and compleatly cure the craving of adiction and remove the need for the next fix. The desperation would also be removed. That would at least drop the drug related crime through the floor. Instead of sending people to jail for useing hard drugs, treat them for adiction. Try to help the person be a productive member of society and not just annother life long criminal going from one desperate situation to annother. \n \n The other side of the coin is greed. Selling is profitable because it's risky. Demand is low, supply is high. Being a supplier is very risky. With so much money and risk people also get desperate in these situations. Being that people doing this are allready willing to violate the law... crime breeds out of this as well. Dealers shooting eachother over teritory and supplies. It's a risky game where the penelties are death and jail for screwing up. Desperation and the human need for self preservation here drive even more crime. \n \n And this whole thing is all because our leaders decided to treat the object and not the root causes. Because objects are easier to put in a campaign slogan and more tanjable for stiring up the masses.", 
   {}, 
   261018, 
   null, 
   1178032440.0
  ], 
  [
   261140, 
   null, 
   "Judeau", 
   "I too would like to show my support for your argument here. Cheersemoticon_xhoho", 
   {}, 
   261137, 
   null, 
   1178033100.0
  ], 
  [
   261183, 
   null, 
   "Sigma", 
   "You don't just snort some coke and automatically decide to rob someone.\n\n \n With such a high correlation, however, I would not rule out causation. This is like saying you don't drink and automatically decide to drive. This is true, but drinking makes it more difficult to make a good judgement call on that score, so what you stated here is disingenuous.\n \n \nNow if Cigaretes are so hard and terrible. Why is it that we never hear of \"Cigarete related Crime\"? How come noone kills anyone else over this adiction? How come you never hear of someone robbing a store for cigarete money?\n\n \n Your characterization is skewed, and your solution shortsighted. The effects of nicotine, both positive and negative, are mild in comparison to heroin and the self-administering of powerful opiates is idiotic to say the least. \n \n The effect of widely available, currently illegal drugs such as cocaine and heroin would lead to more deaths due to interaction and overdose (which you do not usually get with alcohol and cigarettes) and would not logically reduce crime since violent offenders are often under the influence of illegal drugs when they commit their offenses, leading one to believe that such powerful drugs are an influence on undesirable behavior.\n \n \nGetting High is done for it's own sake. If you want to eliminate the Gun crime that permiates from drug related issues (which is substantial in the USA) you must target the desperation that causes the crime.\n [snip]\n The end result that people abhore is the pain and loss that comes from the crime. People look to place blame for their loss. They place the blame on Drugs and Guns. But those are just objects. The objects did not commit or cause the crime. It takes a person to cause a crime. They commited the crime for a reason. Most times the reason is desperation. \n \n\n \n While this is absolutely something that should be done, the ready supply of means is detrimental towards the goal and should be curtailed. I read something that struck me about this... I'm trying to remember. It went something like: \"Without their armies and machines they were not monsters but only little boys...\". Certainly removing the means does not solve the problem by itself but it is a justifiable goal just the same.\n \n Yes, drugs and guns, by themselves, are not to blame. It is desires of the people who use these objects that are to blame. However, the nature of our laws is not to change people, it is to change behavior.\n \n \n\n And this whole thing is all because our leaders decided to treat the object and not the root causes. Because objects are easier to put in a campaign slogan and more tanjable for stiring up the masses.\n\n \n Which is why gun control and drug laws are not as effective as they possibly could be. You are right that the desires must be addressed, but then you ignore that easy access to guns and drugs may be a contributing factor, which I think is quite shortsighted and skewed.", 
   {}, 
   261137, 
   null, 
   1178049240.0
  ], 
  [
   261264, 
   null, 
   "Abaddon660", 
   "Sigma, \n \n Most of your line of sugestion pertaining to the control of the supply of guns and drugs looks to be the kind of thinking that is allready in use by the current policy. We know from the last 30 years in this country that these ideas are badly flawed and do not work. It's nothing but \"feel good\" ploitics. \n \n I believe that every law abiding American head of household should be required to own and maintain a firearm. Places in the world where this mentality exist have virtualy no violent crime at all. As well as several towns in America where this practice is a law. As far as criminals getting guns. It's gonna happen one way or the other. I'd rather have a fighting chance personally. \n \n \nWith such a high correlation, however, I would not rule out causation. This is like saying you don't drink and automatically decide to drive. This is true, but drinking makes it more difficult to make a good judgement call on that score, so what you stated here is disingenuous.\n \n\n \n Spoken like someone who has never touched an illegal drug in their life. I'm not advocating that you try illegal drugs mind you but it's a bit difficult to make a determination like that without the experience to back it up. I like my take on this better. It comes from real world experience, some personal and some second hand. \n \n \nWhich is why gun control and drug laws are not as effective as they possibly could be.\n\n \n They can never be effective for one simple reason. Only law abiding people obey the law. Criminals do not. There is an expression I've heard come from a great many not so law abiding people. \"It's only illegal if you get caught.\" That's the criminal mentality. The laws you would put in place only serve to hurt the people who obey the laws. While out of desperation, greed and hatred the criminal element will take advantage of the laws by being willing to thwart them for personal gain where honest people will not. \n \n There are no easy answers to these issues. They have been with us for thousands of years. We do know however that what our country is doing is not working and we also know that as laws get tougher the crime gets worse. Laws are not the answer. \n \n Also one of the things I'm trying to get at: \n \n Heroin and other very hard and very dangerous drugs should not be in stores or anything like that. Society should also stop focusing on the drug. Eliminate heroin and someone will invent something more addictive and more dangerous. Focus on the Social problems that get people into doing heroin and work with that. It's not 100% effective but it's all you can do without causing nasty side effects. \n \n As far as lighter drugs... LSD, POT, X, Magic Mushrooms, and a few other relativly harmless drugs that are made out to be killers. These should be Legal, Sold and taxed. \n \n Amsterdam legalized Pot and saw a huge drop in the use of things like heroin and cocane. Also a huge drop in violent crime.", 
   {}, 
   261183, 
   null, 
   1178113620.0
  ], 
  [
   261318, 
   null, 
   "Sigma", 
   "\n Most of your line of sugestion pertaining to the control of the supply of guns and drugs looks to be the kind of thinking that is allready in use by the current policy. We know from the last 30 years in this country that these ideas are badly flawed and do not work. It's nothing but \"feel good\" ploitics.\n\n \n Because it is not implemented as the line of thinking would lead. The implementation is aimed at the \"feel good\" politics, not at actually working. Therein lies the difference. The logic is sound, the implementation has not been. \n \n \nAs far as criminals getting guns. It's gonna happen one way or the other. I'd rather have a fighting chance personally.\n\n \n I don't think we're at the point we need to abandon all efforts and batten down the hatches.\n \n \nSpoken like someone who has never touched an illegal drug in their life.\n\n \n Oh, wow, quite a deduction. Since I don't classify myself as an idiot and characterized those who self-administer powerful opiates (such as heroin) as XXXXXX, that is quite a safe assumptions. However, it is an unwarranted assumption for less powerful drugs, illegal or not.\n \n \nThey can never be effective for one simple reason. Only law abiding people obey the law. Criminals do not\n\n \n Law abiding people don't kill people because it is against the law. Were that law not in place more people would kill others. Would that not be true of drugs and guns?\n \n Certainly I am not suggesting that laws prohibiting things such as guns and drugs will solve the problems all by themselves. I do not think, however, that making no effort at controlling the distribution is the correct course of action.\n \n \n While out of desperation, greed and hatred the criminal element will take advantage of the laws by being willing to thwart them for personal gain where honest people will not.\n\n \n There are criminals who don't obey laws no matter what law you try to quote, and those criminals may harm law abiding people. That by itself is not a reason to remove those laws. \n \n \nThere are no easy answers to these issues. They have been with us for thousands of years. We do know however that what our country is doing is not working and we also know that as laws get tougher the crime gets worse. Laws are not the answer.\n\n \n I don't believe removing these laws is the answer either. A different approach is required if current efforts are not accomplishing the goal.\n \n \nFocus on the Social problems that get people into doing heroin and work with that. It's not 100% effective but it's all you can do without causing nasty side effects.\n\n \n Or do both. \n \n \nAs far as lighter drugs... LSD, POT, X, Magic Mushrooms, and a few other relativly harmless drugs that are made out to be killers. These should be Legal, Sold and taxed.\n\n \n Or, same as above, work on social problems that get people into doing these drugs.", 
   {}, 
   261264, 
   null, 
   1178129460.0
  ], 
  [
   261337, 
   null, 
   "Abaddon660", 
   "Before I go any further with this... \n \n Let me ask you something. \n \n \n \n If you had a problem at work with a co-worker (a peer, not above or below you in rank). The guy makes fun of you, plays pranks, generaly is causing your work life to be miserable. As far as you know your respective boss is not aware of this behavior as of yet but you know He has a low tolorence for this kind of thing. \n \n How do you handle the situation with the co-worker?", 
   {}, 
   261318, 
   null, 
   1178137080.0
  ], 
  [
   261339, 
   null, 
   "conservative", 
   "I just felt like pointing out that its interesting how the current argument supports the point of the original post. By arguing how drugs cause crime, it shows that the real problems are the causes, not guns; just like the first post says...", 
   {}, 
   261337, 
   null, 
   1178138520.0
  ], 
  [
   261368, 
   null, 
   "Sigma", 
   "\n If you had a problem at work with a co-worker (a peer, not above or below you in rank). The guy makes fun of you, plays pranks, generaly is causing your work life to be miserable. As far as you know your respective boss is not aware of this behavior as of yet but you know He has a low tolorence for this kind of thing. \n \n How do you handle the situation with the co-worker?\n\n \n It depends. Is the co-worker aware that his behavior is bothering me?", 
   {}, 
   261337, 
   null, 
   1178145000.0
  ], 
  [
   261374, 
   null, 
   "Sigma", 
   "I just felt like pointing out that its interesting how the current argument supports the point of the original post. By arguing how drugs cause crime, it shows that the real problems are the causes, not guns; just like the first post says...\n\n \n I have not argued that guns cause crime.", 
   {}, 
   261339, 
   null, 
   1178145660.0
  ], 
  [
   261378, 
   null, 
   "Abaddon660", 
   "It depends. Is the co-worker aware that his behavior is bothering me?\n\n \n Maybe... maybe not. You have to look at this from your own perspective. Not from the outside looking in.", 
   {}, 
   261374, 
   null, 
   1178146080.0
  ], 
  [
   261379, 
   null, 
   "Sigma", 
   "Maybe... maybe not. You have to look at this from your own perspective. Not from the outside looking in.\n\n \n I would make sure he knows that his behavior is bothering me and follow up by reporting that behavior to the manager if it doesn't stop.", 
   {}, 
   261378, 
   null, 
   1178146560.0
  ], 
  [
   261382, 
   null, 
   "Abaddon660", 
   "I've got a detailed response... i'll post it later. Gotta finish up here at work and head home at the moment.", 
   {}, 
   261379, 
   null, 
   1178146980.0
  ], 
  [
   261414, 
   null, 
   "bigandrich", 
   "You're acting like everyone who doesn't agree with you thinks that guns walk around and kill people by themselves. No one in their right minds thinks that. Yeah, a lot of people have tough lives, but, just as you say violence will always be around, poverty will also always be around. We, as a country, do things to try and limit poverty, but there is no way to stop it entirely. That is an unrealistic goal. The same holds true for gun control. There is no way to entirely stop violence or murder, but we place laws to try to limit it. That is the point of gun control. Now, I'm not saying that we should entirely ban guns, but we should do more to control them. The fact that gun control laws won't eliminate violence is not the main issue. Where are the statistics of the murders that have been prevented by the gun control laws we have in place? There is no way to determine how many, but there have been a lot.\n Suppose we don't place any laws, and a person goes, gets a gun, and kills someone. The person is dead, but the inconvenience it would have caused to make stricter laws wouldn't have been worth that one life.\n Now suppose we place stricter gun control laws that cost the government billions of dollars. We spent millions of dollars, and saved one life. If this law saves just that one life, isn't it worth it?", 
   {}, 
   261337, 
   null, 
   1178158320.0
  ], 
  [
   261430, 
   null, 
   "E Mutz", 
   "You're acting like everyone who doesn't agree with you thinks that guns walk around and kill people by themselves. No one in their right minds thinks that. Yeah, a lot of people have tough lives, but, just as you say violence will always be around, poverty will also always be around. We, as a country, do things to try and limit poverty, but there is no way to stop it entirely. That is an unrealistic goal. The same holds true for gun control. There is no way to entirely stop violence or murder, but we place laws to try to limit it. That is the point of gun control. Now, I'm not saying that we should entirely ban guns, but we should do more to control them. The fact that gun control laws won't eliminate violence is not the main issue. Where are the statistics of the murders that have been prevented by the gun control laws we have in place? There is no way to determine how many, but there have been a lot.\n Suppose we don't place any laws, and a person goes, gets a gun, and kills someone. The person is dead, but the inconvenience it would have caused to make stricter laws wouldn't have been worth that one life.\n Now suppose we place stricter gun control laws that cost the government billions of dollars. We spent millions of dollars, and saved one life. If this law saves just that one life, isn't it worth it?\n\n \n Why do ye make this so easy?\n \n 2003 data\n Total firearms deaths: 28,000\n Motor Vehicle related deaths: 43,000\n Cardiovascular related deaths: 936,000\n Total number of ammendments protecting firearm possession: 1\n Ammendments protecting vehicle possession: 0\n Ammendments preventing infringement of right to eat french fries: 0\n \n Given that motor vehicles cause far more deaths annually, how many lives would be saved by lowering the speed limit to 20 MPH. If it saves one life, is it worth it?\n \n Now I'm not saying we should ban french fries, but we should control them. My God! French Fries kill 936,000 people a year and ye are prattling on about firearms! Suppose we don't place a law and Joe Snuffy goes down and crams his face full of French Fries and croaks of a heart attack. Surely it is worth the inconvenience to the rest of us eaters to forego french fries. Perhaps we could simply ban fat folks from purchasing french fries? Limit the number of fries a fat XXX can purchase? Institute a 7-day waiting period before serving the fries? \n \n I hope ye French Fry eaters give your fries a big fat kiss good night. Y'all are just Ronald McDonald extremists.", 
   {}, 
   261414, 
   null, 
   1178168400.0
  ], 
  [
   261469, 
   null, 
   "Abaddon660", 
   "Now suppose we place stricter gun control laws that cost the government billions of dollars. We spent millions of dollars, and saved one life. If this law saves just that one life, isn't it worth it?\n\n \n No!\n \n \n Strict gun Control laws cost more lives then they save. Just look at my other threat entitled \"Tech your kids to shoot! Here's why!\" on this forum for all the proof you need on that matter.", 
   {}, 
   261430, 
   null, 
   1178202720.0
  ], 
  [
   261471, 
   null, 
   "Abaddon660", 
   "now... back to the other thing. \n \n Sigma, Everyone gives the response you gave. But most people would not actualy take that route at all. They would go strait to the boss to avoid the possible confruntation. What does that tell you about people's thinking in this day and age? \n \n People for the most part have come to rely on their betters to guide them. Each individual person is capable of being a good person and running their own life. But as a people we are trained from birth to put our faith in things better then ourselves in the hopes that everything will work out just fine. \n \n Same thing with governement and laws. When we have a problem we demand the Gov take care of it by making a law. Parents don't want their kids playing violent video games so instead of parenting. They go to the Gov and demand a law banning violence in video games. Same thing happens with a mess of issues. Including Guns and Drugs. Instead of taking responsability for our own lives we rely on the government and scores of laws to protect us. \n \n Instead of keeping a gun in the home to protect their family. Some people rely on alarm systems and the police to protect them. Personaly I trust a good Dog and a loaded gun anyday over the cops and an alarm which can be disabled and police that might take 15 minutes to get to me. It takes 2 minutes tops to murder a house full of people and rob the place. And people know this. As a result they live in fear and ignorance. So what happens is they call for more protection, more security, more police, more laws, more protection. The Unwillingness of people at large to take personal responsability for their own safty and the safty of their family can only lead to one logical end. Those who will not control their own lives will be controled by others. \n \n In the past I would have said... to each their own. But with all the things going on in the political world and the world at large. I believe America is circleing the drain into a fullblown Dictatorship. Democracy is all but dead and when people finally realize it the whole place is gonna turn on it's head. When that happens I'm gonna want my assault rifles and plenty of ammo. Lots of ammo. When the time comes your gonna wish you had them. If it were you and me in a place and only food enough for 1 to survive and I have my guns...\n Guess who's gonna eat. \n \n Therin lies my whole point. Laws are not the answer. The more we as a people rely on laws to fix things the easier it is for us to be enslaved. All I can say for my fellow Americans to avoid this grim fate is that there are 2 Presidential hopefulls running that are pushing the platform of true Democracy. Ron Paul (Rep) and Mike Gravel (Dem). Get one of those guys in office and They might just re-empower the American people. The government works for us.... not the other way around.", 
   {}, 
   261469, 
   null, 
   1178204160.0
  ], 
  [
   261515, 
   null, 
   "Sigma", 
   "\n Sigma, Everyone gives the response you gave. But most people would not actualy take that route at all. They would go strait to the boss to avoid the possible confruntation. What does that tell you about people's thinking in this day and age?\n\n \n Then why the hell ask me the question if you're going to disbelieve me anyway. \n \n \nPeople for the most part have come to rely on their betters to guide them. Each individual person is capable of being a good person and running their own life. But as a people we are trained from birth to put our faith in things better then ourselves in the hopes that everything will work out just fine.\n\n \n I care very little about your personal crusade. Seriously. Watch me not care.\n \n \nDemocracy is all but dead and when people finally realize it the whole place is gonna turn on it's head. When that happens I'm gonna want my assault rifles and plenty of ammo. Lots of ammo. When the time comes your gonna wish you had them. If it were you and me in a place and only food enough for 1 to survive and I have my guns...\n Guess who's gonna eat.\n\n \n We were never a democracy. We were a Constitutional Republic.\n \n Yes, I support gun ownership for this reason. Resisting oppressive gov't is the reason the 2nd Amendment was adopted. However, the current use of personal gun ownership is way out of wack with that original meaning. Hunting is not the original meaning. Defending yourself against intruders was not in the original meaning. The current use allows schools to be shot up by students and criminals easy access to guns as a means of killing each other and law-abiding citizens. Curbing or regulating these uses is justifiable.\n \n \nTherin lies my whole point. Laws are not the answer. The more we as a people rely on laws to fix things the easier it is for us to be enslaved.\n\n \n I think your solution is shortsighted and skewed.", 
   {}, 
   261471, 
   null, 
   1178222460.0
  ], 
  [
   261537, 
   null, 
   "Abaddon660", 
   "Hunting is not the original meaning. Defending yourself against intruders was not in the original meaning.\n\n \n Wow... are you kidding me? Do you mean to say you do not condone defending your home against an intruder with a firearm is a justified use of the device? That hunting for food is not a justified use of the device? In those days hunting for food was still a major sorce of food you know. Home defence was just as important then as it is now. Instead of drug dealers and gang bangers they and Indians and the British to contend with. \n \n \nThen why the hell ask me the question if you're going to disbelieve me anyway\n\n \n BTW I asked you the work question just to see if you would overanalyze. And you did. It's a real simple phyche question that is used allot. I allready knew from the way you write about things what your likly to do in a confruntation situation. Asking you was more or less for my own amusement. \n \n \nThe current use allows schools to be shot up by students and criminals easy access to guns as a means of killing each other and law-abiding citizens. Curbing or regulating these uses is justifiable.\n\n \n HAHAHA... no no no no no and no! Bzzzzzzzzzzzzz. Try again. \n \n Easy access to guns does not cause people to commit crimes and shoot up schools. We've been over this. There are other factors that drive this behavior. If Guns were not around they would simply be replaced by bombs or swords or nailbats or poison gass or even arson (lock the doors and torch the place) Lets try and see ya try and prevent that. Anyone got 2 sticks? \n \n This has been my whole point all along. The tools which people choose to inflict pain and death are not the cause of said pain and death. Whatever caused the person to inflict said pain and death is what must be addressed. And before you blame drugs you gotta think to look past that too because there are causes for that kind of thing too. \n \n Here are some quotes to back up my first paragraph: \n \n They that can give up essential liberty to obtain a little temporary safety deserve neither liberty nor safety. \n ---Benjamin Franklin, Historical Review of Pennsylvania, 1759. \n \n No freeman shall ever be debarred the use of arms. \n ---Thomas Jefferson: Draft Virginia Constitution, 1776\n \n [C]onceived it to be the privilege of every citizen, and one of his most essential rights, to bear arms, and to resist every attack upon his liberty or property, by whomsoever made. The particular states, like private citizens, have a right to be armed, and to defend, by force of arms, their rights, when invaded. \n 14 Debates in the House of Representatives, ed. Linda Grand De Pauw. (Balt., Johns Hopkins Univ. Press, 1972), 92-3.", 
   {}, 
   261515, 
   null, 
   1178230500.0
  ], 
  [
   261542, 
   null, 
   "Sigma", 
   "Wow... are you kidding me?\n\n \n Whether it is justified or not is opinion. However, the meaning of the 2nd Amendment appears to be to resiste those destructive of your Constitutional Rights, not for hunting or what have you. And also given that at the time of writing the 2nd Amendment was a prohibition against Federal infringment, and not State, the fear was obviously an oppressive Federal gov't.\n \n \nAsking you was more or less for my own amusement.\n\n \n Ah. I figured you had no purpose to this :P \n \n \nEasy access to guns does not cause people to commit crimes and shoot up schools.\n\n \n Where did I say guns cause criminal attitudes? I'm not saying guns cause anything. I said that easy access to guns provides the means for the criminal behavior. This may tend behavior towards more crime or not, but is nontheless true.\n \n \nLets try and see ya try and prevent that. Anyone got 2 sticks?\n\n \n Well, then I would have accomplished what I said. They would not shoot up the school. I'm surprised you even would admit it would keep the guns out of the student's hands.", 
   {}, 
   261537, 
   null, 
   1178231880.0
  ], 
  [
   261563, 
   null, 
   "bigandrich", 
   "Why do ye make this so easy?\n \n Given that motor vehicles cause far more deaths annually, how many lives would be saved by lowering the speed limit to 20 MPH. If it saves one life, is it worth it?\n\n \n You do have a good point. However, it does not change my mind. We do our best to make cars as safe as we can, but so many people need to travel fast just to work and survive. More importantly, when one gets into a car, they know that they run the risk of crashing. \n \n \n French Fries kill 936,000 people a year and ye are prattling on about firearms! Surely it is worth the inconvenience to the rest of us eaters to forego french fries. Perhaps we could simply ban fat folks from purchasing french fries? Limit the number of fries a fat XXX can purchase? Institute a 7-day waiting period before serving the fries? \n \n I hope ye French Fry eaters give your fries a big fat kiss good night. Y'all are just Ronald McDonald extremists.\n\n \n Aside from being offensive, this is irrational. You are skewing the statistic. It says that there are 936,000 cardiovascular related deaths, not 936,000 french fry deaths. Cardiovascular related deaths also include heart disease, heart attacks from diabetes and smoking, high blood pressure, and congenital cardiovascular defects. Furthermore, when someone is obese from overeating, they know that it's bad for them to live that way. Plus, it's hurting them and nobody else. Someone who gets murdered isn't doing anything to put themselves at risk, and the murderer is hurting other people, rather than just themselves.", 
   {}, 
   261430, 
   null, 
   1178241480.0
  ], 
  [
   261583, 
   null, 
   "E Mutz", 
   "You do have a good point. However, it does not change my mind. We do our best to make cars as safe as we can, but so many people need to travel fast just to work and survive. More importantly, when one gets into a car, they know that they run the risk of crashing. \n \n \n I do my best to make my house as safe as I can. Firearm possession is one of the means to attain that safety. When the criminal breaks into a home that criminal knows that he runs a risk of earning a chalk outline. Remove the firearms and remove the risk to the criminal. Consequently, ye increase the risk to the homeowner. \n \n \n Aside from being offensive, this is irrational. Ye are skewing the statistic. It says that there are 936,000 cardiovascular related deaths, not 936,000 french fry deaths. Cardiovascular related deaths also include heart disease, heart attacks from diabetes and smoking, high blood pressure, and congenital cardiovascular defects. Furthermore, when someone is obese from overeating, they know that it's bad for them to live that way. Plus, it's hurting them and nobody else. \n \n Why sir, I am sorry that you find my attempt to divest ye of your french fries to be so offensive. Perhaps then ye may understand my offense at your attempt to usurp my firearm ownership. You can on the one hand point exclusively to the firearm as the agent of destruction and then turn sanctimonious when one threatens your side dish. \n \n Your assertion that the walking land-mass hurts only himself is offensive and irrational. As a runner and athlete, I bear the high cost of that planetoids personal meal decisions. My health insurance rises with his poor dietary choices. And just who pays when that Behemoth has no insurance? What about Gargantuan's kids? They grow up bearing the example of their super-sized parents do they not? \n \n But alas, ye are correct in that french fries do not cause all cardiovascular deaths. Alas, I fear you have me there. So I am prepared to concede that French Fries, as one form of fatty food are not the sole instrument of destruction. There are many different fatty foods, just are there are many different kinds of firearms...Wait a minute there...Clearly if one KIND of fatty food did not cause all 936,000 deaths, certainly one KIND of firearm did not cause all firearm related deaths. To claim otherwise would be skewing the statistics. Why sir, there are breechloaders, black powder, .22, .30, 30.30, 3006, .44, .45, .50, .54, shot gun, lever action, etc etc etc...Perhaps if ye would agree to for all eaters to give up french fries, all firearms owners would agree to give up the .22 (rim-fire only). \n \n Someone who gets murdered isn't doing anything to put themselves at risk, and the murderer is hurting other people, rather than just themselves.\n \n Not true. Clearly not true. You cannot categorically state that all victims had absolutely no control over the circumstances of their demise. Not saying that they deserved what they got, just that it is folly to assume each did everything in their power to eliminate all the risks.", 
   {}, 
   261563, 
   null, 
   1178247660.0
  ], 
  [
   261585, 
   null, 
   "Abaddon660", 
   "I'm surprised you even would admit it would keep the guns out of the student's hands.\n\n \n I has stated \"If Guns were not around\" meaning that they were somehow compleatly eliminated. I was useing an extreme circumstance to prove a point. No I don't think that strict gun control would keep firearms out of the hands of the wrong people by any measure. \n \n \nAh. I figured you had no purpose to this :P \n\n \n No, It had a purpose, It amused me. \n \n \nI said that easy access to guns provides the means for the criminal behavior.\n\n \n And I said that criminal behavior exists nonetheless and will find other, possibly more destructive ways of manifesting itself. \n \n \n Lets Clerify something here. \n \n When were talking about Gun Control most of us are just fine with a few hoops to jump through as long as long abiding people can get guns. Good guns at that. I should be able to arm myself to the teeth with high powered weapons If I so choose without question from the Gov. \n \n Backgorund Check - Fine\n Special Permit for automatic weapons - Fine (As long as there is a way to get them) \n No non-emergency discharge of weapons in public areas - good\n \n \n On the other hand I wouldn't want a criminal to be able to legaly get the same arsonal. That's Good gun control. The kind that keeps criminal people from LEGALY obtaining firearms. \n \n Bad Gun control are things that hinder a lawfull person from being able to purchase and use firearms. Hense laws that require trigger locks or that firearms be locked up 24/7 with the ammo stored elsewhere. Laws that say I cannot buy a certain gun because it \"Looks Scarry\" ( Im of corse refering to the idiotic 1994 Clinton Crime Bill with the rediculous assault weapons ban)\n I'm opposed to Gun Control laws that are un-constitutional like the ones some states have that prevent lawfull people from Conceal Carry. (Keep and Bear arms anyone?) \n \n Lets set that premise and make sure were not debating 2 different things.", 
   {}, 
   261563, 
   null, 
   1178248680.0
  ], 
  [
   264491, 
   null, 
   "Galileo", 
   "You can only curtail violence by addressing the cause of the violence not the manner in which it was carried out. \n \n People that are trying to implement gun control and bans are probably the most ignorant lot of political activist crazies we have here in the USA. I say ignorant not to insult people but as an accurate statement of their level of knowledge about the true nature of what they are trying to accomplish and about firearms in general. \n \n Your typical anti-gun person is passion driven, non-gun owning, well to do upper-middle class, sheltered and high strung. Soccer mom's and Metro-sexual's for the most part. Born and raised in suburbia in a sheltered community with a blind eye to the real world. Cookie cutter people with cookie cutter lives that alleviate their tremendous boredom by backing some cause or another so as to give themselves the illusion that they are doing some good in the world when in fact their lifestyle is going to cause more pain and suffering and death to the world through destruction of the environment then any gun ever could.\n\n What are you basing this on? The surveys I've seen that show that women, blacks, and minority groups are more likely to support gun control. People living in poor inner city neighborhoods are more likely to support gun control. \n \n \n\n Guns are not the problem. End of Story. Whenever there is a tragedy of some kind everyone is looking for someone or something to blame. If the perpetrator of the crime is dead... that's not enough. There has to be some justice of some kind to placate the masses. The people demand it! So where do people set their focus? Certainly not on themselves for ignoring the plight of American society and poverty and lack of funds for things like treatment for the mentally ill, better education and the like. NOOOOOO! They want to focus on something more convenient. The gun must be to blame!!! Ya.. That's it. Everyone gang up and parade the likeness of the victims behind your misdirected cause and march like lemmings over the cliff of reason into the bottomless pit of ignorant bliss. \n \n It's just like the supposed \"War on Drugs\". The Government has spent Billions on stomping out drugs of all kinds and in the end all we have is more chaos. We have jails full of drug offenders and streets full of drugs and a quirk that was once a somewhat harmless vice of society has become a full-blown epidemic. People failed to address the real issues and focused on an object.\n \n Same aspect with gun violence. Society fails to see or outright ignores the real causes. \n \n For instance, I own several Guns. I hope I never have to use them outside of target shooting and hunting but am prepared to do so if necessary. There are other people out there who don't share my sense and reason and would see the same guns as a tool to take advantage of others or cause them harm. But you don't need a gun for that. If there were no guns those same people would use other weapons, or make bombs. You could just Google up how to make a pipe bomb, make 20-30 of them and have a blast. That weapon in the same settings as the VT shooting would have probably caused more death. He could have opened a door, Tossed in a pipe bomb and closed the door... move on to the next room... rinse and repeat. Someone good with a sword could do just a much damage. A sword doesn't go BOOM so you could rack up quite a mess before anyone knew what was going on. \n \n My point is... People like the VT shooter can snap, taking away 1 tool of dealing death will only see it replaced by another. In the case of firearms you do more harm then good by taking away the most effective means of defense a person can carry. Instead of focusing on the tools why can't people focus on the root issues. Mass murderers are usually mentally deranged. Wouldn't it be a better use of the taxpayers money to work toward identifying those with severe mental issues and helping them get treated rather then just taking away one of the many possible tools they could use when they finally snap. Someone shoots a Gas Station clerk in a robbery. Instead of spending millions on enforcing new gun laws to slightly reduce the chance that that robber might have gotten the gun he used. Why not put the millions of dollars into civil action and education programs that would help that kind of person that is desperate enough to rob the store get a better life. Most do that sort of crime out of need and desperation. Some just do it for fun, those people have a warped sense of right and wrong and need help getting that straightened out though some method. \n \n You cannot have a utopia without the means to defend it. People must have the right to defend themselves and their homes. They must have the means to protect freedom from tyranny if needs be. \n \n The statement \"Guns don't Kill People, People Kill People\" says a great deal and is one of the most truthful quotes of all time. A man determined to kill another man will use a gun if he has one, if not then the next best thing, A good blade. If not that then a pointy stick. If not that then a rock. You cannot stop violence by eliminating the tools of violence. Or even reduce it for that matter. You have to address the causes where you can. Mankind is violent in nature so you will never stop all violence. By you can curtail a great deal of it by working with people and helping yourself and others lead a good life. \n\n Why is it when you defend yourself the type of weapon you have does matter? You say recognize a gun as being \"the most effective means of defense a person can carry\" But when it comes to killing people all weapons are equally effective- whether it be a gun, a rock or a pointy stick. \n \n And if it's as easy to kill a person with a pointy stick as with a gun then the US Army could save a lot of money by arming its soldiers with pointy sticks.", 
   {
    "unicode_changes_made": true
   }, 
   259963, 
   null, 
   1180021500.0
  ], 
  [
   264493, 
   null, 
   "Galileo", 
   "You do have a good point. However, it does not change my mind. We do our best to make cars as safe as we can, but so many people need to travel fast just to work and survive. More importantly, when one gets into a car, they know that they run the risk of crashing. \n \n \n I do my best to make my house as safe as I can. Firearm possession is one of the means to attain that safety. When the criminal breaks into a home that criminal knows that he runs a risk of earning a chalk outline. Remove the firearms and remove the risk to the criminal. Consequently, ye increase the risk to the homeowner.\n\n But is the gun that you keep in your home a greater risk to yourself or to a potential intruder? It's pretty easy to find information on the FBI and the CDC websites that shows that more people die in gun accidents than criminals die in legally justifiable self defense shootings. People defending guns often only look at the gross benefit of gun ownership, not the net benefit when it comes to safety. That would make about as much sense as only looking at your gross income while ignoring the fact that your net income is negative.", 
   {}, 
   261583, 
   null, 
   1180022460.0
  ], 
  [
   264533, 
   null, 
   "jim's trucking", 
   "...And if it's as easy to kill a person with a pointy stick as with a gun then the US Army could save a lot of money by arming its soldiers with pointy sticks.\nThat's the way it was before the invention of gunpowder. Spears, swords, arrows, darts, pointy sticks...none can reach out and touch someone like a well aimed bullet driven by the gases of exploding powder through a rifled barrel of sufficient length, straightness and consistent caliber.\n \n Prior to this (the invention of gunpowder), I doubt there were any successful efforts to legally control the possession of pointy sticks and stuff. Oh, I'm sure the conquering armies often took the weapons of their defeated foes, but those foes made some more weapons and fought again. Swords were beat into plowshares and back into swords depending on the needs of the locals.\n \n Even long after the invention of gunpowder, the Mexicans, desirous of remaining free, beat the snot out the French infantry with hoes and a herd of cattle. Sergeant York (as played by Gary Cooper) single-handedly obtained the surrender of hundreds of Germans by picking some of them off (killing them) one at a time as if he were at a turkey shoot...so his one well-aimed rifle saved a load of people by serving as his own personal killing tool...used from a relatively great distance. The \"One Shot-One Dead Terrorist\" thread that I was maligned for posting demonstrates the surgical capabilities of the modern rifle in the hands of a true sharpshooter.\n \n How dare you even suggest the army go back to pointy sticks. It's how you use the gun that counts.", 
   {}, 
   264491, 
   null, 
   1180045860.0
  ], 
  [
   264541, 
   null, 
   "Archangel", 
   "Sergeant York wishes he had one of these...\n \n http://www.snipercentral.com/brown.htm", 
   {}, 
   264533, 
   null, 
   1180052040.0
  ], 
  [
   264564, 
   null, 
   "Symbiote", 
   "Drug prohibition is the cause of drug dealers, drug pushers, turf wars, crack cocaine and the other harder drugs, financing for international terrorism, a bloated and unsustainable prison population, the aerial bombardment of south america with defoliants leading to birth defects and the propping up of criminals in power around the world on the basis of their drugs policy.\n \n But hey, its worth it and we just need to do more, because clearly if heroin and crack were legal, we'd all go out and buy some.\n \n And clearly getting tough on drugs is going to be successful in keeping them away, all we need is to transform our nations into giant prisons, guards for every cell block, surveillance in every room. Because we all know that when somewhere is as highly controlled as a prison, drugs can't get in.", 
   {}, 
   264541, 
   null, 
   1180060020.0
  ], 
  [
   264929, 
   null, 
   "Galileo", 
   "That's the way it was before the invention of gunpowder. Spears, swords, arrows, darts, pointy sticks...none can reach out and touch someone like a well aimed bullet driven by the gases of exploding powder through a rifled barrel of sufficient length, straightness and consistent caliber.\n \n Prior to this (the invention of gunpowder), I doubt there were any successful efforts to legally control the possession of pointy sticks and stuff. Oh, I'm sure the conquering armies often took the weapons of their defeated foes, but those foes made some more weapons and fought again. Swords were beat into plowshares and back into swords depending on the needs of the locals.\n \n Even long after the invention of gunpowder, the Mexicans, desirous of remaining free, beat the snot out the French infantry with hoes and a herd of cattle. Sergeant York (as played by Gary Cooper) single-handedly obtained the surrender of hundreds of Germans by picking some of them off (killing them) one at a time as if he were at a turkey shoot...so his one well-aimed rifle saved a load of people by serving as his own personal killing tool...used from a relatively great distance. The \"One Shot-One Dead Terrorist\" thread that I was maligned for posting demonstrates the surgical capabilities of the modern rifle in the hands of a true sharpshooter.\n \n How dare you even suggest the army go back to pointy sticks. It's how you use the gun that counts.\n\n I began that sentence with \"And if...\" so it doesn't follow that I was suggesting that the army go back to pointy sticks. I was just demonstrating the fallacy in an argument by pointing out what it leads to.", 
   {}, 
   264533, 
   null, 
   1180291020.0
  ], 
  [
   265317, 
   null, 
   "Abaddon660", 
   "What are you basing this on? The surveys I've seen that show that women, blacks, and minority groups are more likely to support gun control. People living in poor inner city neighborhoods are more likely to support gun control.\n\n \n I don't intend this as an isult of any kind to the pople you outlined but the women, blacks, and minority groups opinion you are basing you're statment on is for the most part un-educated and passion driven. If in an inner city neighborhood all you see is shooting and killing day to day it's natural to work up an irrational passion against guns. Just because a large number of people have the same opinion about a subject does not make that opinion correct in any way. Allot of people use to think the world was flat. Minorities also refuse to believe that their own comunities are the problem for the crime. They are the cause of their own issues. There is such a culture of \"Blaming the Man\" in this country that people refuse to take action and better themselves and their community. The problems of crime and gun violence are Social not physical. Guns are physical. Also I might add that such survay's also include the opinion of gang members and criminals. Those types of people LOVE gun control. Makes it safer for them to do what they do. \n \n \n \n \nWhy is it when you defend yourself the type of weapon you have does matter? You say recognize a gun as being \"the most effective means of defense a person can carry\" But when it comes to killing people all weapons are equally effective- whether it be a gun, a rock or a pointy stick.\n\n \n WOW... talk about missing the point.... \n \n Lets take a look at History for this one. \n \n The Battle of Hastings 1066 A.D. \n Norman Army: \n 6000 men at arms with the melee weapons of the time. \n \n Saxon Army: \n 4000 Men at arms with the Melee Weapon of the Time (said to be some of the best fighters in all of Europe at that time) \n \n Casualties: \n estimated 6000 dead total on both sides. \n \n So out of just 10000 men that Took the field of battle, 6000 died. \n \n 60% loss of life in battle. \n \n Many large scale mideval battles like this one show 40-60% dead.\n \n Lets look at a War with Firearms\n \n The Union armies had 2,750,000 men.\n Battle deaths: 110,070 \n \n The Confederate strength was 1,250,000.\n Battle deaths: 94,000 \n \n Total Men = 4,000,000\n Dead in Battle = 204,070\n \n 5% loss of life in battle\n \n % of battle deaths against the # of participating soldiers in modern warfare is far lower in most all cases. \n \n Food for thought.", 
   {}, 
   264929, 
   null, 
   1180473120.0
  ], 
  [
   268295, 
   null, 
   "Unriggable", 
   "My name is unriggable and I am for gun control. Why? Below:\n \n \"Of 626 shootings in or around a residence in three U.S. cities, [this study] revealed that, for every time a gun in the home was used in a self-defense or legally justifiable shooting, there were four unintentional shootings, seven criminal assaults or homicides, and 11 attempted or completed suicides (Kellermann et al, 1998).\"\n \n \"There is a positive correlation between homicide rates and availability of guns in developed nations. (Hemenway and Miller, 2000)\"\n \n \"Analyses that controlled for several measures of resource deprivation, urbanization, aggravated assault, robbery, unemployment, and alcohol consumption found that states with higher rates of household firearm ownership had significantly higher homicide victimization rates for children, and for women and men. In these analyses, states within the highest quartile of firearm prevalence had firearm homicide rates 114% higher than states within the lowest quartile of firearm prevalence. Overall homicide rates were 60% higher. (Harvard School of Public Health)\"", 
   {}, 
   259963, 
   null, 
   1181637660.0
  ], 
  [
   268329, 
   null, 
   "Bryan", 
   "Welcome to the forum Unriggable. It sounds like you take the position that our current gun control regulatory scheme is inadequate to address the safety issues you raise. If this is your position, then let me ask a couple of questions to clarify your thoughts on the issue if I might:\n \n What gun control laws in addition to those we currently have would you favor?\n \n For any new law you propose, what argument would you put forward to defend its constitutionality?", 
   {
    "post_info": {
     "post_title": "Welcome to the forum Unriggable"
    }
   }, 
   268295, 
   null, 
   1181662200.0
  ], 
  [
   268372, 
   null, 
   "Unriggable", 
   "Welcome to the forum Unriggable. It sounds like you take the position that our current gun control regulatory scheme is inadequate to address the safety issues you raise. If this is your position, then let me ask a couple of questions to clarify your thoughts on the issue if I might:\n \n What gun control laws in addition to those we currently have would you favor?\n \n For any new law you propose, what argument would you put forward to defend its constitutionality?\n\n \n Okay. Well what I am about to say may seem cliche, but at the time of the signing of the bill of rights (and the second amendment) 'arms' were weapons which would take a good ten to fifteen seconds to load (not only that but the wielder has to stand still while they reload), meaning that once a shot was fired people had plenty of time to run for their lives, and as a result few lives were lost. So today's weapons, which are way off that scale, follow that two hundred year old rule. To me that makes no sense. The availability of guns led to so many crises (crisises?) in recent history. I wouldn't mind it as much if there was a law that required some level of training for guns to be purchased, so we know that whoever buys these will no how to defend themselves.\n \n Yes, guns will always be circulated illegally. But do you think that when it comes to guns, you can fight fire with fire? Keep in mind the stat above: For every person shot in self defense, four are shot by accident (personally, when somebody raids my house, I knife their XXX).", 
   {}, 
   268329, 
   null, 
   1181677980.0
  ], 
  [
   268384, 
   null, 
   "Master_Shake", 
   "Abaddon660- Ok, this seems to be your logic. If we legalize drugs then the availability will go up and the price will come down, therefore crime will be reduced.\n \n There are a couple of flaws in your logic. First of all, not all of the crime caused by drug users is just theft to get there next fix. Some, more than just a little, of it is violent crime that has nothing to do with theft that is caused by various effects of various drugs (paranoia, sense of invincibility, excessive uncontrolled energy, increased violent tendencies in general). Making drugs legal would not decrease any of this.\n \n Secondly, what makes you think that if drugs were made legal that they still wouldn't be tightly controlled and prices kept high? People who traffic drugs are still going to want to keep their high profit margins.\n \n Third, drug dealers/traffickers/etc. are almost always affiliated with other crime in general. This wouldn't change if drugs were made legal because the suppliers would remain essentially the same.", 
   {}, 
   261337, 
   null, 
   1181680320.0
  ], 
  [
   268403, 
   null, 
   "Unriggable", 
   "Master Shake, that last part isn't true at all. Every single person who sells drugs that I know of is pretty peaceful and to the extent of my knowledge doesn't steal, fight, etc.\n \n Weed should be legalized, everything else should remain against the law. Weed was outlawed to allow the deportation of many mexican immigrants in the 30's, the only reason it is illegal today is because we have too many traditionalists on Capitol Hill.", 
   {}, 
   268384, 
   null, 
   1181685180.0
  ], 
  [
   268439, 
   null, 
   "E Mutz", 
   "Okay. Well what I am about to say may seem cliche, but at the time of the signing of the bill of rights (and the second amendment) 'arms' were weapons which would take a good ten to fifteen seconds to load (not only that but the wielder has to stand still while they reload), meaning that once a shot was fired people had plenty of time to run for their lives, and as a result few lives were lost. So today's weapons, which are way off that scale, follow that two hundred year old rule. To me that makes no sense. The availability of guns led to so many crises (crisises?) in recent history. I wouldn't mind it as much if there was a law that required some level of training for guns to be purchased, so we know that whoever buys these will no how to defend themselves.\n \n Yes, guns will always be circulated illegally. But do you think that when it comes to guns, you can fight fire with fire? Keep in mind the stat above: For every person shot in self defense, four are shot by accident (personally, when somebody raids my house, I knife their XXX).\n\n \n Those weapons that required several seconds to load managed to kill over one million during the American Civil War. I guess them yanks and rebs jes weren't so good at runnin or else you jes ain't good at figurin what constitutes \"a few lives\".\n \n One may apply your approach to the 2nd amendment to the 1st as well. \"Speech\" at the time the constitution consisted of literal speech. The closest thing to radio was the loud XXX town crier. I wouldn't mind if there was a law that required some level of education before someone went off prattling about the constitution. \n \n Be careful you don't knife four people by accident before you successfully stab someone in self defense. Keep in mind, that the weed you would legalize slows your reaction time. That might be a factor the next time you bring a knife to a gun fight.", 
   {}, 
   268372, 
   null, 
   1181709540.0
  ], 
  [
   268448, 
   null, 
   "Master_Shake", 
   "Master Shake, that last part isn't true at all. Every single person who sells drugs that I know of is pretty peaceful and to the extent of my knowledge doesn't steal, fight, etc.\n\n So the guy you buy your pot from down the street isn't a mean guy. Big deal.\n Secondly, I was really talking about the primary suppliers, not small-timers, although the same applies to many small-timers.", 
   {}, 
   268403, 
   null, 
   1181716560.0
  ], 
  [
   268570, 
   null, 
   "Unriggable", 
   "Those weapons that required several seconds to load managed to kill over one million during the American Civil War. I guess them yanks and rebs jes weren't so good at runnin or else you jes ain't good at figurin what constitutes \"a few lives\".\n\n \n Yeah, but they were all soldier's lives, not only that but there were enough soldiers for you to see coming and escape (there were minimal civilian casualties during the civil war). Also the weapons were far from concealable (today you can hide an automatic weapon in your vest).\n \n \nOne may apply your approach to the 2nd amendment to the 1st as well. \"Speech\" at the time the constitution consisted of literal speech. The closest thing to radio was the loud XXX town crier. I wouldn't mind if there was a law that required some level of education before someone went off prattling about the constitution.\n \n \n Literal Speech was enough managed to separate the United States from England. BTW you're forgetting the printing press. And there was no FCC back in the day.\n \n \nBe careful you don't knife four people by accident before you successfully stab someone in self defense. Keep in mind, that the weed you would legalize slows your reaction time. That might be a factor the next time you bring a knife to a gun fight.\n\n \n Don't forget that there wouldn't be a gun fight were it not for the guns...\n And yes, if you legalize weed I'll be on it 24/7... emoticon_xgood", 
   {}, 
   268439, 
   null, 
   1181780040.0
  ], 
  [
   268572, 
   null, 
   "Unriggable", 
   "So the guy you buy your pot from down the street isn't a mean guy. Big deal.\n Secondly, I was really talking about the primary suppliers, not small-timers, although the same applies to many small-timers.\n\n \n I think you've watched too many mob movies. A lot of the weed is grown in the US, not imported. And most of the grown #### is grown by college students, small rings of adults, you know, people who aren't running entire business chains off them (as depicted in tv shows, whatever).", 
   {}, 
   268448, 
   null, 
   1181780160.0
  ], 
  [
   268601, 
   null, 
   "Bryan", 
   "Okay. Well what I am about to say may seem cliche, but at the time of the signing of the bill of rights (and the second amendment) 'arms' were weapons which would take a good ten to fifteen seconds to load (not only that but the wielder has to stand still while they reload), meaning that once a shot was fired people had plenty of time to run for their lives, and as a result few lives were lost. So today's weapons, which are way off that scale, follow that two hundred year old rule. To me that makes no sense. The availability of guns led to so many crises (crisises?) in recent history. I wouldn't mind it as much if there was a law that required some level of training for guns to be purchased, so we know that whoever buys these will no how to defend themselves.\n \n Yes, guns will always be circulated illegally. But do you think that when it comes to guns, you can fight fire with fire? Keep in mind the stat above: For every person shot in self defense, four are shot by accident (personally, when somebody raids my house, I knife their XXX).\n\n \n Thanks for responding, Unriggable.\n \n I disagree with Kellerman's 4/1 ratio claim that you ask me to keep in mind. He has a history of first assuming a result and then creating studies using deliberately small and target skewed sampling to prove the point he wants to make. This 1998 study in particular demonstrated blatantly biased methodology. He had at his disposal several years of nationwide data, both urban and rural to choose from, and he samples only 626 events from only three cities. Now I can easily name ten incidents I know of where a homeowner brandished a firearm to run off an intruder. I can then tell you of only one of the incidents I know of where a firearm was used to take a relative's life in a home, and from my statistics I can conclude that a gun is 10 times more likely to be used in self defense than to commit a domestic homicide. My \"study\" would be as biased and worthless as Kellerman's. \n \n This 1998 study is not the only time Kellerman has engaged in questionable statistical sampling. His most famous study-- the one in which he used approximately 300 shootings to conclude that a gun in the home was 41 times more likely to kill a family member than an intruder--was removed from Brady Campaign publications after it was exposed as a fraudulent study. Kellerman's research is akin to arriving at a crowded cocktail party and looking over the heads of all the guests for the few friends he recognizes huddled together in the corner. His studies do not reflect what I have experienced. The vast majority of defensive gun use does not involve a homicide. \n \n Yes, I believe I can fight fire with fire. I agree with your statement that guns will always be circulated easily. With that in mind, I would prefer to be armed and prepared to fight fire with fire than be unarmed and forced to fight fire with say, a handful of straw. I've been threatened with death more than once before, and I have resolved to be armed and prepared should anyone ever attempt to act on their threats.\n \n No knowledgeable self-defense expert will recommend using a knife to hunt down an intruder over taking a stand in an easily defended area of your house with a firearm. \n \n I disagree with a frozen in time approach to civil liberties. If this view prevailed, then my bloging would be limited to a printing press, and my political speech would be limited to the reach of my voice from the top of an overturned soapbox.\n \n Your proposal for mandatory safety training would address the extraordinarily rare occurrence of accidental firearm death, but would have no impact on the rate of intentional firearm-involved homicides. Are there any other gun control measures you would support which would address that concern?\n \n Do you agree or disagree with the statement that the 2nd. Amendment recognizes an individual RKBA?", 
   {
    "post_info": {
     "post_title": "Thanks for responding, Unriggable"
    }, 
    "unicode_changes_made": true
   }, 
   268372, 
   null, 
   1181797020.0
  ], 
  [
   268602, 
   null, 
   "Master_Shake", 
   "I think you've watched too many mob movies. A lot of the weed is grown in the US, not imported. And most of the grown #### is grown by college students, small rings of adults, you know, people who aren't running entire business chains off them (as depicted in tv shows, whatever).\n\n There are other drugs, smokey.", 
   {}, 
   268572, 
   null, 
   1181797080.0
  ], 
  [
   268794, 
   null, 
   "Bryan", 
   "That should read \"21\" not \"41\" times in my previous post. Darned typewriter gremlins....\n \n ---\n \n \"And indeed, gentlemen, there exists a law, not written down anywhere but written in our hearts; a law which comes to us not by training or custom or reading but by derivation and absorption and adoption from nature itself; a law which has come to us not by theory but from practice, not by instruction but by natural intuition. I refer to the law which lays it down that, if our lives are endangered by plots or violence or armed robbers or enemies, any and every method of protecting ourselves is morally right. When weapons reduce them to silence, the laws no longer expect one to await their pronouncements. For people who decide to wait for these will have to wait for justice, too--and meanwhile they must suffer injustice first. Indeed, even the wisdom of the law itself, by a sort of tacit implication, permits self- defense, because it does not actually forbid men to kill; what it does, instead, is to forbid the bearing of a weapon with the intention to kill. When, therefore, an inquiry passes beyond the mere question of the weapon and starts to consider the motive, a man who has used arms in self-defense is not regarded as having carried them with homicidal aim.\" Cicero, Selected Political Speeches, p. 222 (M. Grant, trans. 1975)\n \n \"Among the many misdeeds of the British rule in India, history will look upon the Act depriving a whole nation of arms as the blackest. If we want the Arms Act to be repealed, if we want to learn the use of arms, here is a golden opportunity. If the middle class render voluntary help to Government in the hour of its trial, distrust will disappear, and the ban on possessing arms will be withdrawn.\" Ghandi, 2 M. Gandhi, An Autobiography of the Story of My Experiments with the Truth, p. 374 (M. Desai, trans. 1927).\n \n \"And I cannot see, why arms should be denied to any man who is not a slave, since they are the only true badges of liberty. . . .The possession of arms is the distinction between a freeman and a slave. He who has nothing, and belongs to another, must be defended by him, and needs no arms: but he who thinks he is his own master, and has anything he may call his own, ought to have arms to defend himself and what he possesses, or else he lives precariously and at discretion. And though for a while those who have the sword in their power abstain from doing him injury; yet, by degrees, he will be awed into submission to every arbitrary command. Our ancestors, by being always armed, and frequently in action, defended themselves against the Romans, Danes, and English; and maintained their liberty against encroachments of their own princes.\" Andrew Fletcher, Political Works, pp. 35 and 221 (1749).\n \n \"Make mass searches and hold executions for found arms.\" V. I. Lenin, Collected Works, Vol. 35, 4th ed., p. 286. From Congressional Record, April 28, 1970, p. H3601.\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921.\n \n \"Pick a night and cordon off a section of South Dallas. Send hundreds of police officers--however many it would take-into the area to 'vacuum it up.' Shake down everybody on the street. Search every house and apartment. Confiscate all drugs and weapons.\" Ross Perot, The Washington Post, June 6, 1992.\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Justice Louis Brandeis in Olmstead v. United States, 277 U.S. 438, 485 (1928).\n \n \"Are we at last brought to such an humiliating and debasing degradation that we cannot be trusted with arms for our own defense?\" Patrick Henry, 3 Elliot, Debates at 386", 
   {
    "post_info": {
     "post_title": "typo"
    }, 
    "unicode_changes_made": true
   }, 
   268602, 
   null, 
   1181884620.0
  ], 
  [
   268810, 
   null, 
   "Unriggable", 
   "There are other drugs, smokey.\n\n \n Yes but they are dwarfed by marijuana. The only reason people reject it is because they were taught it was a bad thing to do, similar to the Iranian attitude toward premarital sex.\n \n By the way Bryan, the same study was made by numerous other people and the same results were reached - a family with a gun is 43 times more likely to accidentally shoot a family member than a non-gun-owning one, and 5 times more likely to experience a suicide than a non-gun owning one. Look it up.", 
   {}, 
   268601, 
   null, 
   1181892360.0
  ], 
  [
   268852, 
   null, 
   "Master_Shake", 
   "Yes but they are dwarfed by marijuana. The only reason people reject it is because they were taught it was a bad thing to do, similar to the Iranian attitude toward premarital sex.\n\n I am aware that pot is the number one illegal drug in this country, but I think to say it \"dwarfs\" use of other drugs is a bit of an overstatement, especially with the sharp rise in production and use of meth in recent years, particularly in the midwest. Even if it was an accurate description, it's entirely beside the point.\n \n It's also more than a bit disingenuous to say that \"the only reason people reject it is because they were taught it was a bad thing to do\" as if you're the enlightened one and everyone else is a pack of drooling lemmings. People have all sorts of good reasons they choose to not smoke and/or choose to oppose it's legalization. Secondly, if it is a bad thing to do, there's nothing wrong with being taught it's a bad thing to do. However, I would substitute \"bad\" with \"dumb\" in this case.", 
   {}, 
   268810, 
   null, 
   1181927760.0
  ], 
  [
   268890, 
   null, 
   "Bryan", 
   "Actually, Unriggable, I didn't need to look it up. I've seen the \"43 times more likely\" claim before. It's Kellermann's as well, and it comes from an article of his published in 1986. For anyone who is interested, here is the cite for it: \n \n \"Protection or peril? An analysis of firearms related deaths in the home.\" (New Engl J Med 1986. 314: 1557-60.) Arthur Kellermann and Don Reay, authors. \n \n This is another predetermined outcome oriented study. Kellermann cherry picked 389 gun deaths for this one. His chosen time frame was 1978 to 1983, and his chosen population base was King County, Washington. There were an extremely abnormal number of firearm-involved suicides in King County during that time (suicides accounted for 333 of the 389 deaths he used, in fact) which assisted him in creating this fantasy figure. \n \n You indicate you are in favor of gun control, Unriggable, and when I asked you listed a proposed regulation for mandatory safety training you would favor. I recognize your belief that this would reduce unintentional firearm deaths. I would oppose such a law. I'll willingly talk with you about why if you want, but I don't believe accidental deaths is the primary focus of the \"gun control\" movement. In my experience in talking with supporters of gun control it is the intentional criminal misuse of firearms which is the primary evil they allege a desire to eradicate. With that in mind, let me ask you a few more questions: \n \n As a supporter of gun control, do you believe that our current regulatory scheme is sufficient? If not, then what new gun control laws would you propose, and why?\n \n I'd really like to talk about the merits of Gun Control with you, Unriggable. I believe that the 2nd. Amendment recognizes an individual RKBA, but I do not believe the RKBA should be absolute and unrestricted. I also believe that part of talking rationally with someone about gun control is understanding their position. This is why I ask you questions, Unriggable. But don't think I am the only one who can do so. Ask away if you want to understand where I come from on this issue. \n \n ---\n \n \"And that the said Constitution be never construed to authorize Congress to infringe the just liberty of the Press, or the rights of Conscience; or to prevent the people of the United States, who are peaceable citizens, from keeping their own arms. . . .\" Samuel Adams, Debates & Proceedings in the Convention of the Commonwealth of Massachusetts, 86-87 (February 6, 1788).\n \n \"And I cannot see, why arms should be denied to any man who is not a slave, since they are the only true badges of liberty. . . .The possession of arms is the distinction between a freeman and a slave. He who has nothing, and belongs to another, must be defended by him, and needs no arms: but he who thinks he is his own master, and has anything he may call his own, ought to have arms to defend himself and what he possesses, or else he lives precariously and at discretion. And though for a while those who have the sword in their power abstain from doing him injury; yet, by degrees, he will be awed into submission to every arbitrary command. Our ancestors, by being always armed, and frequently in action, defended themselves against the Romans, Danes, and English; and maintained their liberty against encroachments of their own princes.\" Andrew Fletcher, Political Works, pp. 35 and 221 (1749).\n \n \"In Mississippi rebel State forces, men who were in the rebel armies, are traversing the State, visiting the freedmen, disarming them, perpetrating murders and outrages on them. . . .\" Congressional Globe, 39th. Congress, 1st. Session, part 1, at p. 40 (December 13, 1865) [Speech of Senator Henry Wilson (Republican-Massachusetts)]\n \n \"Editor Loyal Georgian: Have colored persons a right to own and carry firearms?-A Colored Citizen\n Almost every day we are asked questions similar to the above. We answer certainly you have the same right to own and carry arms that other citizens have. You are not only free but citizens of the United States and as such entitled to the same privileges granted to other citizens by the Constitution. . . .\n Article II, of the amendments to the Constitution of the United States, gives the people the right to bear arms, and states that this right shall not be infringed. Any person, white or black, may be disarmed if convicted of making an improper or dangerous use of weapons, but no military or civil officer has the right or authority to disarm any class of people, thereby placing them at the mercy of others. All men, without distinction of color, have the right to keep and bear arms to defend their homes, families or themselves.\" From issues of the Loyal Georgian, January 20, 27 and February 3, 1866.\n \n \"Make the colored man a citizen of the United States and he has every right which you or I have as citizens of the United States under the laws and Constitution of the United States. . . .He has a defined status; he has a country and a home; a right to defend himself and his wife and children; a right to bear arms. . . .\" Congressional Globe, 39th. Congress, 1st. Session, part 2, p. 1266 (March 8, 1866) [Speech of congressman Henry J. Raymond (Republican-New York)]", 
   {
    "post_info": {
     "post_title": "Didn't need to look it up"
    }, 
    "unicode_changes_made": true
   }, 
   268852, 
   null, 
   1181936640.0
  ], 
  [
   268977, 
   null, 
   "Unriggable", 
   "Thanks for asking me what additional laws I would implement. After seeing an episode of \"It takes a theif\" a few months back, I realized it would be wise to charge every gun customer another twenty bucks for a standard gun lock. This means that when a house is robbed and firearms are stolen, they cannot be sold illegally easily (at least without some effort, more than its worth). This would make illegal gun circulation a bit harder.\n \n In addition, I think you need a permit to own a gun of any kind - they aren't hard to acquire, just takes a bit of waiting time. That way, it would be easier to link crimes to the criminals who used the guns since there is a database. Besides, no reason for guns on the go, anybody can wait a month or so.", 
   {}, 
   268890, 
   null, 
   1181959740.0
  ], 
  [
   269438, 
   null, 
   "Master_Shake", 
   "Anything unriggable?", 
   {}, 
   268977, 
   null, 
   1182289560.0
  ], 
  [
   269587, 
   null, 
   "Bryan", 
   "Thanks for asking me what additional laws I would implement. After seeing an episode of \"It takes a theif\" a few months back, I realized it would be wise to charge every gun customer another twenty bucks for a standard gun lock. This means that when a house is robbed and firearms are stolen, they cannot be sold illegally easily (at least without some effort, more than its worth). This would make illegal gun circulation a bit harder.\n \n In addition, I think you need a permit to own a gun of any kind - they aren't hard to acquire, just takes a bit of waiting time. That way, it would be easier to link crimes to the criminals who used the guns since there is a database. Besides, no reason for guns on the go, anybody can wait a month or so.\n\n \n Thanks for responding, Unriggable. Let me address the points you raise....\n \n I'm going to disagree with the idea that mandatory locks would deter gun thefts. Locks are designed primarily as a safety measure to prevent an unauthorized person (such as a child) from firing a gun. They are not designed to deter a thief, who once he has stolen the gun can take as long as he wants to cut the lock. Therefore, I a disagree that mandatory locks would create a theft deterrent. \n \n I also see no valid reason to force otherwise law abiding individuals to wait when purchasing a firearm. The claim that a waiting period deters crimes of sudden passion has always been a sham argument. The instant check system has been used for over a decade now, and there have been no reported increases in crimes committed with a gun purchased on the spur of the moment. Therefore, I see no justification for restricting access to a fundamental right when it serves no legitimate purpose.\n \n Now a permit/registration scheme is an interesting issue which comes with a few problems. The first problem would be the potential for massive passive resistance to a registration or permit scheme, like what we have seen in Canada. In my opinion it would be impossible to construct a permit or registration scheme that would cover the vast secondary (individual to individual \"street\" sales) market. The only way to enforce a permit or registration scheme would be to criminalize it and prosecute persons who get caught with a gun they did not register or did not obtain a permit for. This may be fine and good in the abstract, but in reality it would have no impact on fighting gun crime other than to make inadvertent criminals out of otherwise law-abiding gun owners.\n \n I say this because there will be a number of people who would be exempt from a permit or registration requirement. Convicted murderers, rapists, robbers, home burglars, child sexual offenders, or indeed any other convicted felon would be exempt. Also exempt would be convicted stalkers, persons found guilty of domestic violence, and persons previously involuntarily committed to a mental health institution for either past violence or the potential for future violence. We talk all the time about keeping guns out of these \"wrong\" hands, and these are the very people who would be immune from prosecution for refusing to submit to a mandatory permit or registration scheme. Here's why: \n \n It is a crime for these persons to possess a firearm. If the state mandates that they announce their possession of a firearm through obtaining permits or registering firearms then it forces them to incriminate themselves in violation of their 5th. Amendment right. \n \n This has been tried before. In 1968 Congress enacted a number of firearm restrictions under the title of the National Firearms Act. The NFA contained a mandatory firearm possession registration scheme; which required all persons to register possession of and be taxed on their possession of certain classes of firearms Congress determined were being used principally by persons engaged in unlawful activities. The registration scheme was enforced by two new criminal statutes: 26 U.S.C. § 5841 made it a crime for failure to register possession of a particular type of firearm, and 26 U.S.C. § 5851 made it a crime to possess an unregistered firearm. SCOTUS declared that prosecutions for a violation of these registration requirements was unconstitutional because registration compelled self-incrimination--See Haynes v. United States, 390 U.S. 85 (1968). Now we could try to avoid the constitutional challenge by calling it a \"permit\" scheme instead, but SCOTUS looks at the application of a law and not the title Congress gives it when deciding constitutionality, and a mandatory \"permit\" scheme is equivalent to a registration scheme in both its requirement of self-incrimination and its purpose of establishing a nationwide database.\n \n Therefore, I would oppose a permit/registration scheme because it would punish the innocent while ignoring the guilty. \n \n ---\n \n \"False is the idea of utility that sacrifices a thousand real advantages for one imaginary or trifling inconvenience; that would take fire from men because it burns, and water because one may drown in it; that has no remedy for evils, except destruction. The laws that forbid the carrying of arms are laws of such a nature. They disarm only those who are neither inclined nor determined to commit crimes. Can it be supposed that those who have the courage to violate the most sacred laws of humanity, the most important of the code, will respect the less important and arbitrary ones, which can be violated with ease and impunity, and which, if strictly obeyed, would put and end to personal liberty--so dear to men, so dear to the enlightened legislator--and subject innocent persons to all the vexations that the guilty alone ought to suffer? Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than to prevent homicides, for an unarmed man may be attacked with greater confidence than an armed man. The ought to be designated as laws not preventative but fearful of crimes, produced by the tumultuous impression of a few isolated facts, and not by thoughtful consideration of the inconveniences and advantages of a universal decree.\" Thomas Jefferson, Commonplace Book, 1774-1776, quoting 18th century criminologist Cesare Beccaria in On Crimes and Punishment, 1764.", 
   {
    "post_info": {
     "post_title": "A permit plan would be unconstitutional"
    }, 
    "unicode_changes_made": true
   }, 
   268977, 
   null, 
   1182360660.0
  ], 
  [
   272533, 
   null, 
   "Abaddon660", 
   "Thanks for asking me what additional laws I would implement. After seeing an episode of \"It takes a theif\" a few months back, I realized it would be wise to charge every gun customer another twenty bucks for a standard gun lock. This means that when a house is robbed and firearms are stolen, they cannot be sold illegally easily (at least without some effort, more than its worth). This would make illegal gun circulation a bit harder.\n \n\n \n Trigger locks are bogus. They do nothing but hinder the gun owner in an emergency. Let me make it clear... Anyone with 5 minutes to spare and a decent powerdrill can destroy any gun lock hands down.", 
   {}, 
   269587, 
   null, 
   1183742340.0
  ], 
  [
   272836, 
   null, 
   "Unriggable", 
   "Trigger locks are bogus. They do nothing but hinder the gun owner in an emergency. Let me make it clear... Anyone with 5 minutes to spare and a decent powerdrill can destroy any gun lock hands down.\n\n \n Safes are nothing more than a metal box. Anybody with time can take it apart.\n \n You guys realize that you're ignoring the police option? It takes about three minutes for a car to arrive at the door, barely any time for a theif or anybody to snag a bunch of items and run off with them.", 
   {}, 
   272533, 
   null, 
   1183954560.0
  ], 
  [
   272921, 
   null, 
   "daewoo", 
   "Safes are nothing more than a metal box. Anybody with time can take it apart.\n \n You guys realize that you're ignoring the police option? It takes about three minutes for a car to arrive at the door, barely any time for a theif or anybody to snag a bunch of items and run off with them.\n\n \n If you have a 3 minute police response time that is pretty good. The nationwide average for urban areas is 11 minutes. Of course, the response time is logged from the tame the call is dispatched, which does not come until after the operator is done, so you have to factor in 2.5 minutes for that (average 911 call from answer to dispatch is 2 minutes 27 seconds) Of course you have to keep in mind that the response tiem is based on the call, and odds are you are not going to call as the guy is breaking in...more likely your intruder will have been in the house for some time. \n \n To me that matters very little anyway because i don't live in an urban area. One time I had to call the police and it took them nearly 40 minutes to arrive. We have 5 officers that cover 778 square miles. There is almost never more than 2 officers on shift at a time, and if they happen to be on the other end of the county, you are pretty much screwed. \n \n Gun locks are designed to keep kids from playing with guns. They are pretty flimsy protection against an adult. Cable locks (the most popular) are easily cut with a pair of side cutters. That is one of their appeals...if you loose the key you can just snip the cable. Trigger locks are slighly more secure, but you can still clamp it in a vice and they pop right apart with a pipe wrench. I have done it more than once when friends have come down to hunt and realized once they got here that they left the key to their gun lock at home. The exception is the smith and wesson trigger locks. Those pop off if you hit the bottom with a rock.", 
   {}, 
   272836, 
   null, 
   1184004660.0
  ], 
  [
   272951, 
   null, 
   "Abaddon660", 
   "Safes are nothing more than a metal box. Anybody with time can take it apart.\n \n\n \n Not anybody can crack a good gunsafe. It takes a little brainpower and a nice plasmacutter in most cases.\n \n I'm all for gunsafes if I can get into it in under 3 seconds. \n \n \nYou guys realize that you're ignoring the police option? It takes about three minutes for a car to arrive at the door, barely any time for a theif or anybody to snag a bunch of items and run off with them.\n\n \n Police are useless in home invasion emergencies. And Daewoo is right. Response time is unpredictable. It takes a good thief only a couple of minutes to clean you out while you cower in a closet waiting for the police hoping the burgler isn't the violent type. Takes me about 5 seconds from being startled awake to being armed and ready to defend my family with my Glock-17. Annother few seconds if I want to grab my AK-47 to mount a more substantial defence. \n \n When someone violates you're home wether it be for simple robery for something far worse, all bets are off. That person is no loger a person. They are a threat to you and you're family. You cannot safly determine the full nature of the threat in that situation. You're duty to you're family is the eliminate said threat with any means at you're disposal. \n \n Alarm systems can be disabled, Police are too slow, non-lethal weapons that are available to the public are too in-efective. The best home security in the world available to the avarage Joe is a big dog and a big gun. \n \n I'm better armed and better suited then the Cops when it comes to the defence of my own home.", 
   {}, 
   272921, 
   null, 
   1184008680.0
  ], 
  [
   272985, 
   null, 
   "Bryan", 
   "There are two points to address with the mandatory gun locks deterrent argument. The first is whether a mandatory law would deter home burglaries to begin with, and the second is whether they would help prevent or deter gun theft in the event of a burglary.\n \n In my opinion a mandatory trigger lock law would not deter burglaries from occurring. Guns are stolen because they are portable, concealable, and have a high street value. So are TV's, DVD players, jewelry, keys to the spare car, prescription drugs, computers, etc. Burglars know we are not locking these things up, and they know they are far more likely to find these items of value in a break-in anyway. Mandatory locks designed to prevent burglars from stealing only one of 20 or more types of coveted items does not in my opinion deter the burglary from occurring. \n \n Would a mandatory trigger lock law then help prevent gun thefts from a burglary? I don't think they would. Locks do not affect the portability of firearms-and a thief can take the gun quickly from the larceny scene to another, safer location where he can work on breaking it at leisure. \n \n On the question of gun safes, they can be broken into as well, but they are far better at preventing gun loss if a burglary occurs than trigger locks. Burglars are not typically armed with the tools necessary to defeat a gun safe. If the thief does show up with the tools to \"crack\" a gun safe, then he must be prepared to spend a great deal of time exposing himself to capture at the crime scene while \"cracking\" it. The alternative is for the thief to draw attention to himself by showing up with the necessary equipment to move and transport such a heavy and difficult to conceal object. When gun safes are defeated it typically comes in break-ins where the burglar knows the home owner will be away for several days and he can take his time drilling out the lock. \n \n On the question of police response times, I believe a three minute average is too optimistic. I have seen calls responded to that quickly, but they are a lucky few. Everything has to fall in place perfectly-an unoccupied officer has to happen to be nearby when the call comes in. If we rely on the police alone then we have to pray that when we call 911 those officers are not already several miles away at another call fighting to arrest a drunk who beat his wife. It is a very rare event for officers to arrive quickly enough at a home burglary to catch the thief \"in the act.\"\n \n ---\n And indeed, gentlemen, there exists a law, not written down anywhere but written in our hearts; a law which comes to us not by training or custom or reading but by derivation and absorption and adoption from nature itself; a law which has come to us not by theory but from practice, not by instruction but by natural intuition. I refer to the law which lays it down that, if our lives are endangered by plots or violence or armed robbers or enemies, any and every method of protecting ourselves is morally right. When weapons reduce them to silence, the laws no longer expect one to await their pronouncements. For people who decide to wait for these will have to wait for justice, too--and meanwhile they must suffer injustice first. Indeed, even the wisdom of the law itself, by a sort of tacit implication, permits self- defense, because it does not actually forbid men to kill; what it does, instead, is to forbid the bearing of a weapon with the intention to kill. When, therefore, an inquiry passes beyond the mere question of the weapon and starts to consider the motive, a man who has used arms in self-defense is not regarded as having carried them with homicidal aim. Cicero , Selected Political Speeches, p. 222 (M. Grant, trans. 1975)\n Defense of habitation and justifiable self-defense overlap in the \"castle doctrine\" which states that one may, without retreating, use force, to include deadly force if necessary, to keep aggressors out of his own house. This part of the castle doctrine is one aspect of defense of habitation. . . . [T]he justification exists in the curtilage as well as the castle. Roger D. Groot, Criminal Offenses and Defenses in Virginia 114 (3rd ed. 1994)", 
   {
    "post_info": {
     "post_title": "gun locks, safes, and police reponse times"
    }, 
    "unicode_changes_made": true
   }, 
   272951, 
   null, 
   1184016120.0
  ], 
  [
   283253, 
   null, 
   "Novus", 
   "While certainly the reasons people use drugs should and must be addressed, I think it disingenuous to suggest that easy access to drugs is not part of the problem. Cutting off the supply is a justifiable goal.\n\n \n And after 40 years of the war on drugs and drug control, just how close are we to that?\n You must remove the demand for illegal drugs because as long as there is a demand there will be someone there to smuggle it, make it, or grow it and supply it.", 
   {}, 
   260954, 
   null, 
   1189475100.0
  ], 
  [
   283257, 
   null, 
   "Novus", 
   "Safes are nothing more than a metal box. Anybody with time can take it apart.\n \n You guys realize that you're ignoring the police option? It takes about three minutes for a car to arrive at the door, barely any time for a theif or anybody to snag a bunch of items and run off with them.\n\n \n Ok so let's say for a moment I am a member of the working poor with just a few items of value and I live in a poor neighborhood riddled with crime. Let's say I keep an old handgun for home protection because not only can a whole lot of violence happen to my family by a criminal in three minutes, being the high crime area I live in the cops are usually too busy anyway to arrive even close to three minutes away.\n So I would need this handgun for defense in a dangerous neighborhood and I am living paycheck to paycheck with just enough money for rent and my family to eat and you want a law that would make me buy an expensive safe for my defensive handgun or else give it up?\n \n Many gun control laws are racist or hurt the less fortunate minorities the most and they are often the ones which need guns the most for lawful self defense.\n \n By the way my brother lives in a poor neighborhood of Baltimore city and he called the cops on house theives which were actively breaking into the house accross the street. The cops arrived in three hours and didn't even get out of the car. The next day they came back for a report.\n The same brother living in the same place used to have a burglar alarm system. The thieves not only were able to break in and have plenty of time to rob his house, they stole the burglar alarm system. They sometimes arrive in three minutes for a violent crime in the act, but for theft or burglary they simply don't in most areas. A determined thief will often have plenty of time.\n \n A safe makes it harder for theives to get away with guns, but it is foolhardy to think it will stop the determined. Also it is wrong to expect all gun owners to afford a safe if there is a law passed making them have one so that only the rich or the elite can have guns.", 
   {}, 
   272836, 
   null, 
   1189476960.0
  ], 
  [
   294018, 
   null, 
   "conofguncontrol", 
   "Love the thought! But, I have one issue with Abbadon- How do we go about erasing the complete exsistence of drugs?\n And who is gonna do it?\n I sure doubt the government is gonna help...", 
   {}, 
   261337, 
   null, 
   1197776640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Take off your Blinders and Look at the Real Issues!", 
  "url": "http://www.4forums.com/political/gun-control-debates/9804-take-off-your-blinders-look-real-issues.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 9804, 
  "discussion_files": [
   [
    "6071.html", 
    "http://www.4forums.com/political/gun-control-debates/9804-take-off-your-blinders-look-real-issues-print.html"
   ], 
   [
    "6072.html", 
    "http://www.4forums.com/political/gun-control-debates/9804-take-off-your-blinders-look-real-issues-5-print.html"
   ], 
   [
    "6073.html", 
    "http://www.4forums.com/political/gun-control-debates/9804-take-off-your-blinders-look-real-issues-4-print.html"
   ], 
   [
    "6074.html", 
    "http://www.4forums.com/political/gun-control-debates/9804-take-off-your-blinders-look-real-issues-3-print.html"
   ], 
   [
    "6075.html", 
    "http://www.4forums.com/political/gun-control-debates/9804-take-off-your-blinders-look-real-issues-2-print.html"
   ]
  ], 
  "identifier": 9804
 }
]