[
 [
  [
   260175, 
   null, 
   "First1in", 
   "There are far to many fanatics out there who think not only that thier religion is right, but that every one else is wrong. So my challange to all is, with out quoting the bible, prove it.", 
   {
    "post_info": {
     "post_title": "A challange for you"
    }
   }, 
   null, 
   null, 
   1177456740.0
  ], 
  [
   260190, 
   null, 
   "obvious_child", 
   "To Jews, this is rather mundane. Jewish prophecy states that when the Messiah returns, that all will know the Torah by heart without reading it, that they will know the religion as a truth without any holy books. That's a inherently true religion. It just requires the return of the Messiah, who contrary to insane beliefs of some, hasn't arrived.", 
   {}, 
   260175, 
   null, 
   1177462380.0
  ], 
  [
   260217, 
   null, 
   "First1in", 
   "To Jews, this is rather mundane. Jewish prophecy states that when the Messiah returns, that all will know the Torah by heart without reading it, that they will know the religion as a truth without any holy books. That's a inherently true religion. It just requires the return of the Messiah, who contrary to insane beliefs of some, hasn't arrived.\n\n \n As a Jew I would tend to agree, It's those \"insane beliefs\" I'm talking about. I think they call him Jesus.", 
   {}, 
   260190, 
   null, 
   1177471380.0
  ], 
  [
   260248, 
   null, 
   "Sausabe", 
   "My religion is right because I think it is.", 
   {}, 
   260217, 
   null, 
   1177479420.0
  ], 
  [
   260251, 
   null, 
   "First1in", 
   "My religion is right because I think it is.\n\n \n Now that is funny. I posted this thread on another Debate site, and got the same answer. \n \n My response then, and now is Great Answeremoticon_xhoho", 
   {}, 
   260248, 
   null, 
   1177479660.0
  ], 
  [
   260253, 
   null, 
   "Sausabe", 
   "Now that is funny. I posted this thread on another Debate site, and got the same answer. \n \n My response then, and now is Great Answeremoticon_xhoho\n\n \n emoticon_xhoho \n \n Essentially, it is the only (rational) answer. There is no solid proof, only 'faith.' Which is why I believe religious wars, battles etc. are absolutely absurd; there is no solid proof. It is fighting over a possibility.", 
   {}, 
   260251, 
   null, 
   1177479840.0
  ], 
  [
   260258, 
   null, 
   "ShadowPikachu", 
   "emoticon_xhoho \n \n Essentially, it is the only (rational) answer. There is no solid proof, only 'faith.' Which is why I believe religious wars, battles etc. are absolutely absurd; there is no solid proof. It is fighting over a possibility.\n\n \n Nope, there are other answers: \"My Religion is right because I SAY it is\", and the ever popular \"My religion is right because my holy book says it is\".\n \n They all are spin-offs from what you first said although you can go different ways with each, and all equally absurd. ;)", 
   {}, 
   260253, 
   null, 
   1177480500.0
  ], 
  [
   260263, 
   null, 
   "First1in", 
   "Nope, there are other answers: \"My Religion is right because I SAY it is\", and the ever popular \"My religion is right because my holy book says it is\".\n \n They all are spin-offs from what you first said although you can go different ways with each, and all equally absurd. ;)\n\n \n I was with you until you brought up your \"holy book\" here is where I find fault. Depending on the author.", 
   {}, 
   260258, 
   null, 
   1177480680.0
  ], 
  [
   260264, 
   null, 
   "Sausabe", 
   "Nope, there are other answers: \"My Religion is right because I SAY it is\", and the ever popular \"My religion is right because my holy book says it is\".\n \n They all are spin-offs from what you first said although you can go different ways with each, and all equally absurd. ;)\n\n \n They are all generally spin-offs of my statement. And I agree the aforementioned statements are absurd. I am a Christian myself, but do not believe that gives me the right to tell everyone how right I am, and that they're all completely wrong, because I'm rational enough to realize that I might be wrong!", 
   {}, 
   260258, 
   null, 
   1177480740.0
  ], 
  [
   260265, 
   null, 
   "ShadowPikachu", 
   "I was with you until you brought up your \"holy book\" here is where I find fault. Depending on the author.\n\n \n I'm not sure I follow. I wasn't saying that all religions do that, just that it is a popular answer among many religions.", 
   {}, 
   260263, 
   null, 
   1177480740.0
  ], 
  [
   260270, 
   null, 
   "First1in", 
   "I'm not sure I follow. I wasn't saying that all religions do that, just that it is a popular answer among many religions.\n\n \n Yes but among those religions who authenticates the source?", 
   {}, 
   260265, 
   null, 
   1177480980.0
  ], 
  [
   260272, 
   null, 
   "ShadowPikachu", 
   "Yes but among those religions who authenticates the source?\n\n \n Ah, I think I getcha now. Among them, it is usually the holy book itself that authenticates itself (\"God exists because the Bible says he does.\" and \"The Bible is correct because it is the word of God.\") I know it's circular logic, but hey, that's the kind of thing they claim. I certainly don't agree with it.", 
   {}, 
   260270, 
   null, 
   1177481220.0
  ], 
  [
   260319, 
   null, 
   "Zardoz", 
   "Hmmm,\n \n How about...\n \n \"My religion controls more humans and has a higher body count that yours. With fanatics that zealous, it HAS to be truth...because most humans really aren't that crazy!\"\n \n Oh, and our priesthood has magical powers.\n \n emoticon_xkill", 
   {}, 
   260272, 
   null, 
   1177509120.0
  ], 
  [
   260322, 
   null, 
   "gamehuis", 
   "Hmmm,\n \n How about...\n \n \"My religion controls more humans and has a higher body count that yours. With fanatics that zealous, it HAS to be truth...because most humans really aren't that crazy!\"\n \n Oh, and our priesthood has magical powers.\n \n emoticon_xkill\n\n Well my God has a bigger penis than yours, so there. emoticon_xangel\n \n BTW my God only speaks to me, but he has assured me that he is the one true God. He has also given me permission to speak on his behalf and has appointed me to the grand position of Ayatollah Pope Clanleader Poobah.", 
   {}, 
   260319, 
   null, 
   1177512000.0
  ], 
  [
   260399, 
   null, 
   "Big Orn", 
   "There are far to many fanatics out there who think not only that thier religion is right, but that every one else is wrong. So my challange to all is, with out quoting the bible, prove it.\n\n \n Let's see...religion is a binding of the spirit of man to man's ideas of who is to be worshipped and how. Jonestown comes to mind. Heaven's Gate and Hale-Bopp. The Crusades. The entire Muslim belief system. Radical \"Christianity\", which is nothing but a \"feel good\" cult. There are literally thousands of examples of that kind of proof from fanatics.\n \n You are right, though; there are far too many fanatics out there....period.", 
   {}, 
   260175, 
   null, 
   1177542120.0
  ], 
  [
   260403, 
   null, 
   "jitobear", 
   "and has appointed me to the grand position of Ayatollah Pope Clanleader Poobah.\n\n \n \n oooooooh you must be very VERY important", 
   {}, 
   260322, 
   null, 
   1177550220.0
  ], 
  [
   260410, 
   null, 
   "Archangel", 
   "There are far to many fanatics out there who think not only that thier religion is right, but that every one else is wrong. So my challange to all is, with out quoting the bible, prove it.\n\n \n How sad, 15 responses so far and not one serious attempt to explain why and how it is the most reasonable conclusion we can make that all that exists in creation, culminating with the marvel and accomplishments of humanity in so short a period of recorded history, that only if we came from a creative, loving father who made us in his image could we have come so far in so short a time, evolutionarily speaking of course.\n \n I mean, you evolutionists claim we have been evolving for millions of years right ? Yet in a short 5000 years or so of recorded history we have evidently gone from living in caves and drawing on walls to central air and wireless computer technology which I'm communicating with you now on my MacBook. The same 5000 or so years that this so called book of myths has existed. Weird huh ? A lot of coincidences and unanswered questions but valid inquiries none the less.\n \n For further evidence just look at the perfectly balanced chain of life in creation. How each link is connected so perfectly in that each lower form compliments the one above it. As an example, just consider the overall effect on Agriculture if the simple honey bee doesn't bounce back from the mass die off that remains unexplained as yet but a scary reality to the powers that be none the less. Can any of you explain why that is happening because I can.\n \n And why did your challenge exclude the use of the bible as proof of Gods existence First1in ? Is it that you just reject it as evidence at all, or you don't want evidence that you can't refute ? I promise I wont quote verses but must refer to it for its history. I hope that's ok with you. \n \n Now consider the current Worldwide Political Chaos that exists. And without using scripture verses to convert let's just recap some early history from the Jewish Old Testament because as recorders of their own history we know they were second to none. As a Jew you know that Abraham had 2 sons. From one of those sons, Isaac, came the 12 tribes of Israel. From the other, Ishmaial, came the 12 tribes of the Arab people. Both peoples are semitic and in fact half brothers as sons of Abraham with different mothers. Those being Sarah and Hagar respectively.\n \n Now coincidentally enough, this story goes all the way back to the first book of the bible, Genesis. It is also written in Genesis that there would be a seed of bitterness between the sons of Abraham until the end of the World. And curiously we are still witnessing the evidence of the same hatred in this so called Age of Enlightenment when we have accomplished so much as a race that can't even get along with each other. Just imagine what we could accomplish if we could erase these ancient Tribal Conflicts.\n \n But can any of you worldly wise atheists explain why a so called mythical book written by ignorant men whom some here claim couldn't even determine the proper number of legs on a grasshopper could properly identify the same two peoples who they claimed in all of their prophecies regarding the end of the World more than 4000 years ago would lead to the last War, and strangely enough those are the very same 2 peoples who are engaged in this struggle today that according to the New Testament Prophecies promise will lead to Armageddon and the end of the World as we know it at the end of this current Age ? Any takers on that riddle ? \n \n Pretty incredible foresight for a mythical book huh ? If you take and study the prophecies in the Old and New Testament and truly understood them for what they say. You would see just how supernatural a document it is. And it saddens me deeply as a born again arab that I have jewish brothers right here on this sight who have forsaken not only their birthright but their inheritance as they deny who they are as God's chosen people. To not even realize that it is by way of the jew that salvation came into the World makes you the most destitute of all the scoffers and mockers who have contributed to this thread.", 
   {}, 
   260175, 
   null, 
   1177557420.0
  ], 
  [
   260414, 
   null, 
   "First1in", 
   "1.) How sad, 15 responses so far and not one serious attempt to explain why and how it is the most reasonable conclusion we can make that all that exists in creation, culminating with the marvel and accomplishments of humanity in so short a period of recorded history, that only if we came from a creative, loving father who made us in his image could we have come so far in so short a time, evolutionarily speaking of course.\n \n 2.) I mean, you evolutionists claim we have been evolving for millions of years right ? Yet in a short 5000 years or so of recorded history we have evidently gone from living in caves and drawing on walls to central air and wireless computer technology which I'm communicating with you now on my MacBook. The same 5000 or so years that this so called book of myths has existed. Weird huh ? A lot of coincidences and unanswered questions but valid inquiries none the less.\n \n 3.) For further evidence just look at the perfectly balanced chain of life in creation. How each link is connected so perfectly in that each lower form compliments the one above it. As an example, just consider the overall effect on Agriculture if the simple honey bee doesn't bounce back from the mass die off that remains unexplained as yet but a scary reality to the powers that be none the less. Can any of you explain why that is happening because I can.\n \n 4.) And why did your challenge exclude the use of the bible as proof of Gods existence First1in ? Is it that you just reject it as evidence at all, or you don't want evidence that you can't refute ? I promise I wont quote verses but must refer to it for its history. I hope that's ok with you. \n \n 5.) Now consider the current Worldwide Political Chaos that exists. And without using scripture verses to convert let's just recap some early history from the Jewish Old Testament because as recorders of their own history we know they were second to none. As a Jew you know that Abraham had 2 sons. From one of those sons, Isaac, came the 12 tribes of Israel. From the other, Ishmaial, came the 12 tribes of the Arab people. Both peoples are semitic and in fact half brothers as sons of Abraham with different mothers. Those being Sarah and Hagar respectively.\n \n 6.) Now coincidentally enough, this story goes all the way back to the first book of the bible, Genesis. It is also written in Genesis that there would be a seed of bitterness between the sons of Abraham until the end of the World. And curiously we are still witnessing the evidence of the same hatred in this so called Age of Enlightenment when we have accomplished so much as a race that can't even get along with each other. Just imagine what we could accomplish if we could erase these ancient Tribal Conflicts.\n \n 7.) But can any of you worldly wise atheists explain why a so called mythical book written by ignorant men whom some here claim couldn't even determine the proper number of legs on a grasshopper could properly identify the same two peoples who they claimed in all of their prophecies regarding the end of the World more than 4000 years ago would lead to the last War, and strangely enough those are the very same 2 peoples who are engaged in this struggle today that according to the New Testament Prophecies promise will lead to Armageddon and the end of the World as we know it at the end of this current Age ? Any takers on that riddle ? \n \n 8.) Pretty incredible foresight for a mythical book huh ? If you take and study the prophecies in the Old and New Testament and truly understood them for what they say. You would see just how supernatural a document it is. And it saddens me deeply as a born again arab that I have jewish brothers right here on this sight who have forsaken not only their birthright but their inheritance as they deny who they are as God's chosen people. To not even realize that it is by way of the jew that salvation came into the World makes you the most destitute of all the scoffers and mockers who have contributed to this thread.\n\n \n First of all, please excuse me numbering your paragraphs, it makes it easier to respond to all of your points, I understand that there is little more annoying than having a debate with someone who does not address your points. Also incase you havent noticed I am a very poor speller.\n \n 1.) My problem with your point here is your reference to \"short a period of recorded history\", History is recorded in many different ways, but besides the written, or recorded word, history is also recorded in the fossils that we find. And this time goes back millions and millions of years, I believe the oldest fossils have been dated at 3.5 billion years old.\n \n 2.) I am an evolutionist, I believe all life was evolved via mutations to a primordial ocean. Why is it so unbelievable that just in recent history (historical time would mean I'm saying last 100,00 years or so.) there have been evolutions that allowed a man to use it's brain to such an extent as current day, to learn, and remember, not to just act out of instinct.\n \n 3.) Why do you think this \"perfectly balanced chain of life\" just happened. For every benificial mutation that carried on in generations, there were many that had negative effects that didn't get passed on. Nature is more of a trial and error, than a perfect design layed out.\n \n 4.) The bible, old and new testament was written by the hands of men. Mans words are open to interpretation unless there is factual proof to back it up. If I say I am the king of Chicago, and author a book about it, does not make me the King of Chicago.\n \n 5.) Im sorry but I don't see your point here.\n \n 6.) Conflicts happens, far too many in the name of religion, but typically these people fighting the wars are just doing it because they were told to do so. I am among the beliefs that if it wasn't for religion, there would still be conflicts, just for different reasons.\n \n 7.) I am not an Atheist, and therefore will not answer for them.\n \n 8.) I guess to put my answer in words that I understand I would have to say.......HUH what are you saying here. I do not deny being a Jew, as far as being a chosen one, that is not for me to say, this will come from an authority much higher than I, but not till a time when this higher power decides to make it.\n \n \n OK I have tried to hit all of your points.", 
   {}, 
   260410, 
   null, 
   1177560480.0
  ], 
  [
   260417, 
   null, 
   "Archangel", 
   "First of all, please excuse me numbering your paragraphs, it makes it easier to respond to all of your points, I understand that there is little more annoying than having a debate with someone who does not address your points. Also incase you havent noticed I am a very poor speller.\n \n 1.) My problem with your point here is your reference to \"short a period of recorded history\", History is recorded in many different ways, but besides the written, or recorded word, history is also recorded in the fossils that we find. And this time goes back millions and millions of years, I believe the oldest fossils have been dated at 100 million years old.\n\n \n Prove it. Using any science you like, confirm beyond any shadow of a doubt that a fossil that is dated at 100 million years old is actually that old. You must, when all is said and done admit that your beliefs in evo requires as much unprovable faith as my belief in a personal God who loves us and made is in His image.\n \n And why don't we have any records of INTELLIGENT HUMAN SOCIETIES going back 100,000 or 150,000 years ? But only in the recent past as is stated by my bible ? And confirmed in all of the archeological evidence found to date. Why don't we find the remains of cities, pottery or tools reflecting the evolutionary leaps we made that show man was at least intelligent 100,000 years ago ? \n \n \n2.) I am an evolutionist, I believe all life was evolved via mutations to a primordial ocean. Why is it so unbelievable that just in recent history (historical time would mean I'm saying last 100,00 years or so.) there have been evolutions that allowed a man to use it's brain to such an extent as current day, to learn, and remember, not to just act out of instinct.\n\n \n As I said above, if what you say were true, we would have some archeological evidence of such Societies. In addition to finding just bones of the alleged missing link you evos are looking so hard for, (which you still haven't found yet either) we would also find remains of that which those people built before they died. Such as we find the remains of ancient cities, pottery, furniture, jewelry, children's toys and all kinds of daily items of life as spoken of in the Bible of Israel's past. The non existent gaps you must fill in with your imaginations in evo are so much greater than I would ever put up with in my belief in God, and still be a believer.\n \n \n3.) Why do you think this \"perfectly balanced chain of life\" just happened. For every benificial mutation that carried on in generations, there were many that had negative effects that didn't get passed on. Nature is more of a trial and error, than a perfect design layed out.\n\n \n Again, you can claim this but you can't prove it. In 20 years none of the facts that evo relies on as truth will exist as they stand today. If the science were real, some absolutes would exist, upon which the rest would add to and remain consistent. But every new discovery forces evo to back up and re-evaluate and re-adjust it original assertions in order to try to remain the least bit consistent. My Gospel doesn't change with the direction of the wind or every new archeological find. God is the same yesterday, today and forever.\n \n \n4.) The bible, old and new testament was written by the hands of men. Mans words are open to interpretation unless there is factual proof to back it up. If I say I am the king of Chicago, and author a book about it, does not make me the King of Chicago.\n\n \n The bible was written by men, yes. But it was authored by the Lord Himself. See John 1:1-5 for the bibles perspective on this fact. \n \n \n5.) Im sorry but I don't see your point here.\n\n \n That's because you separated paragraphs 5, 6 and 7 when they go together. Apart they mean nothing but together they make a point. Here, read them together and see if they don't make more sense as an organized thought.\n \n \n5.) Now consider the current Worldwide Political Chaos that exists. And without using scripture verses to convert let's just recap some early history from the Jewish Old Testament because as recorders of their own history we know they were second to none. As a Jew you know that Abraham had 2 sons. From one of those sons, Isaac, came the 12 tribes of Israel. From the other, Ishmaial, came the 12 tribes of the Arab people. Both peoples are semitic and in fact half brothers as sons of Abraham with different mothers. Those being Sarah and Hagar respectively.\n \n 6.) Now coincidentally enough, this story goes all the way back to the first book of the bible, Genesis. It is also written in Genesis that there would be a seed of bitterness between the sons of Abraham until the end of the World. And curiously we are still witnessing the evidence of the same hatred in this so called Age of Enlightenment when we have accomplished so much as a race that can't even get along with each other. Just imagine what we could accomplish if we could erase these ancient Tribal Conflicts.\n \n 7.) But can any of you worldly wise atheists explain why a so called mythical book written by ignorant men whom some here claim couldn't even determine the proper number of legs on a grasshopper could properly identify the same two peoples who they claimed in all of their prophecies regarding the end of the World more than 4000 years ago would lead to the last War, and strangely enough those are the very same 2 peoples who are engaged in this struggle today that according to the New Testament Prophecies promise will lead to Armageddon and the end of the World as we know it at the end of this current Age ? Any takers on that riddle ? \n\n \n The point i'm making is that 5000 years ago Genesis said the arabs and the jews would be major participants and the catapults leading to the last war on Earth and here we are at the end of this Age and like they're right on que, Radical Islam is declaring War on Israel and Christianity. Of course those who believe the bible is myth can't see this but that doesn't change the fact that the bible has warned us that this time in history is coming and that it's here now.\n \n \n7.) I am not an Atheist, and therefore will not answer for them.\n\n \n So you claim a knowledge of Yahweh yet deny the power there of ? How sad my friend.\n \n \n8.) I guess to put my answer in words that I understand I would have to say.......HUH what are you saying here. I do not deny being a Jew, as far as being a chosen one, that is not for me to say, this will come from an authority much higher than I, but not till a time when this higher power decides to make it.\n\n \n When you claim evolution is responsible for you being here, you must by default admit that you're denying His insistence that we acknowledge Him as the Creator of all that is and as the personal God that he is. You are rejecting that He is the God of Israel and loves you and made you in his image. You are giving the glory that God rightly deserves to the science of evolution. So whether or not you realize it, you are glorifying the religion of secular humanism, not Yahweh, the Maker of all that is.", 
   {}, 
   260414, 
   null, 
   1177564680.0
  ], 
  [
   260422, 
   null, 
   "obvious_child", 
   "First1in, you'll have to excuse arch. He's been crushed like a bug in the science & evolution forum, so he tries to go to other subforums to convince people he can tell the difference between a petri dish and a mosquito.\n \n He obviously believes that the Xia, the earliest chinese dynasty rated at the upper bound of 26 century BC didn't exist despite clear evidence. Plus he'd just rather pretend that stone tools found several million years ago simply didn't exist and it's all a giant lie by scientists. Delusion runs rampant with literal creationism. And he'd rather just pretend all of these transitional fossils simply don't exist either. \n \n \nn 20 years none of the facts that evo relies on as truth will exist as they stand today.\n\n \n I find this part particularly amusing. Creationism ruled the land for almost a thousand years, but it took evolution less then a 100 to throw it out of reasoned debate and schools. \n \n It is also amusing how arch links things that are completely independent, such as God's alleged love and evolution. \n \n If you're wondering why I'm responding to you and not him, arch doesn't like me after I blew milky way galaxy sized holes in his arguments.", 
   {}, 
   260417, 
   null, 
   1177579020.0
  ], 
  [
   260424, 
   null, 
   "obvious_child", 
   "How sad, 15 responses so far and not one serious attempt to explain why and how it is the most reasonable conclusion we can make that all that exists in creation, culminating with the marvel and accomplishments of humanity in so short a period of recorded history, that only if we came from a creative, loving father who made us in his image could we have come so far in so short a time, evolutionarily speaking of course.\n\n \n There are at least 3 different fallacies of tying there. The fact that there aren't any serious attempts to explain why one religion is correct or truer over another should tell you something: it can't be done and that the educated realize this. Besides you don't even understand. If one could prove their religion is true, they wouldn't need faith. At that point it's not a religion, it's merely a fact to join the long list of facts. You yourself cannot prove your religion is true. Even other Christians here don't accept your arguments. When followers of the same religion don't even buy your arguments, that's a pretty bad sign of how well you can 'prove' your religion. On top of that, your argument is invalided by Occam's razor. \"Entities should not be multiplied beyond necessity,\" where a Deity is thee most multiplied beyond necessity. Relying upon the supernatural to perform acts that are beyond the realm of logic, repeatability and provability renders your reasoning well beyond absurd (but everyone already knows that). \n \n \nI mean, you evolutionists claim we have been evolving for millions of years right?\n\n \n Evolution is not a religion. Furthermore your term of evolutionists is that the theory is primarily a religious belief system. That is dishonest and knowing you, intention. If evolution is a religious belief, so is geology. I noticed you did not want to discuss your extended claim that geology was a fairy tale after I linked it to the fossil fuel industry. That shows hypocrisy. Evolution and other sciences are fairy tales because they deal with billion year old subjects where geology is not even though it does the same. If evolution is a fairy tale/religion, then so is geology and you must thereby accept that your car and everything that uses fossil fuels are actually powered by God. I made this assertion and you fled from it like roaches to the light. \n \n \nYet in a short 5000 years or so of recorded history we have evidently gone from living in caves and drawing on walls to central air and wireless computer technology which I'm communicating with you now on my MacBook.\n\n \n Not quite. The oldest cave paintings we know of are 40,000 years old. That itself invalidates literal Creationism. There's a granary in Jordan that dates to 9500 BC. So that's almost 12,000 years ago. The Neolithic period, or about 10,000 years ago was the first sign of domestication of crops and animals like dogs, sheep and goats. There's a theory based around ice cores and other evidence that suggests that prior to 10,000 years ago the environment was very unstable in temperatures. Civilization requires stable environments to grow crops. Hence when the environment stabilized 10,000 years ago we see the beginnings of agriculture. So you're off by about 35,000 years.  \n \n \nThe same 5000 or so years that this so called book of myths has existed. Weird huh ? A lot of coincidences and unanswered questions but valid inquiries none the less.\n\n \n Only by those who ignore history to suit their arguments and pay no attention to anthropology and geology or archeology (you). See above as to why you're wrong as usual. It frankly isn't much of a surprise to me that you've abandoned the evolution forum after being destroyed similar to a caveman attacking the Deathstar. \n \n \nFor further evidence just look at the perfectly balanced chain of life in creation.\n\n \n How does that prove creation? More importantly how does that prove biblic creation? A number of other creation myths from other religions could easily count that as proof of their validity. A Greek or Roman Pantheon believer could argue that the balanced chain of life is proof of their religion. Native Americans could do the same. Any number of religions could use that as proof. Just because you are religiously ignorant doesn't make your arguments good or even valid. \n \n \nCan any of you explain why that is happening because I can.\n\n \n Just like your various hoaxes? How about the flying dinosaurs that were used as props for a Fox tv show? Or how about the Incan villager art you said you didn't post yet was right out of the article you did? You have no credibility here. \n \n \nAnd why did your challenge exclude the use of the bible as proof of Gods existence First1in?\n\n \n For the same reason it rejected the Hindu, Norse, Greek and other books of religion. If a religion is true, it can be proved independently of its books. Judaism does have this prophecy when the Messiah returns. Notice how it hasn't happened (hence Jesus ain't their Messiah). I made that point early on. When the Messiah returns all will know the Torah and Judaism by heart without ever reading the Torah or other holy books. \n \n \nI promise I wont quote verses but must refer to it for its history. I hope that's ok with you.\n\n \n Your use of history is rather dubious and full of gaps. The Bible doesn't talk about Chinese Civilization which predates Jesus by almost 26 Centuries. It makes no mention of American civilizations. Nothing about South East Asia. Nothing about Australia. Nothing about the Horn of Africa. \n \n \nNow consider the current Worldwide Political Chaos that exists.\n\n \n This is contradictory with your beliefs. You stated that Jesus was the Jewish Messiah. One of the key prophecies is that the Messiah would bring global peace and destroy all weapons of war. Now that you ADMIT that there is worldwide political chaos, that would explicitly argue that Jesus did NOT fulfill that key prophecy, therefore he cannot be the Messiah. (This is merely a point to prove you cannot prove other religions much less your own).\n \n \nBut can any of you worldly wise atheists explain why a so called mythical book written by ignorant men whom some here claim couldn't even determine the proper number of legs on a grasshopper could properly identify the same two peoples who they claimed in all of their prophecies regarding the end of the World more than 4000 years ago would lead to the last War, and strangely enough those are the very same 2 peoples who are engaged in this struggle today that according to the New Testament Prophecies promise will lead to Armageddon and the end of the World as we know it at the end of this current Age ? Any takers on that riddle ?\n\n \n First of all, Israel and the Arab regimes are essentially at peace. Most of the violence in the world has arisen not from religion but from windows of opportunity for states to grab power, land or economic resources. No one goes to war unless they think they can win cheaply, quickly and easily. And many Muslims in the US aren't anti-Jew and many Jews aren't anti-Islam. That would show partially that your reasoning is flawed. Furthermore the prophecies about various 20th century events are written extremely vaguely, similar to Nostradamus. Write something vague enough and plenty of events can fulfill it. And let's remember that people like you have been saying the world is going to end at the end of the current age since well, Jesus walked the Earth. It's now a bit under 2,000 years of predicting the end of the World. We're still here. Funny how that worked out. \n \n \nPretty incredible foresight for a mythical book huh ? If you take and study the prophecies in the Old and New Testament and truly understood them for what they say.\n\n \n Anything to anyone as they want to see and believe.\n \n You really, really, really need a education.", 
   {}, 
   260410, 
   null, 
   1177580820.0
  ], 
  [
   260438, 
   null, 
   "First1in", 
   "First1in, you'll have to excuse arch. He's been crushed like a bug in the science & evolution forum, so he tries to go to other subforums to convince people he can tell the difference between a petri dish and a mosquito.\n \n He obviously believes that the Xia, the earliest chinese dynasty rated at the upper bound of 26 century BC didn't exist despite clear evidence. Plus he'd just rather pretend that stone tools found several million years ago simply didn't exist and it's all a giant lie by scientists. Delusion runs rampant with literal creationism. And he'd rather just pretend all of these transitional fossils simply don't exist either. \n \n \n \n I find this part particularly amusing. Creationism ruled the land for almost a thousand years, but it took evolution less then a 100 to throw it out of reasoned debate and schools. \n \n It is also amusing how arch links things that are completely independent, such as God's alleged love and evolution. \n \n If you're wondering why I'm responding to you and not him, arch doesn't like me after I blew milky way galaxy sized holes in his arguments.\n\n \n I appreciate your support here, and love your signature.", 
   {}, 
   260422, 
   null, 
   1177602000.0
  ], 
  [
   260439, 
   null, 
   "First1in", 
   "Prove it. Using any science you like, confirm beyond any shadow of a doubt that a fossil that is dated at 100 million years old is actually that old. You must, when all is said and done admit that your beliefs in evo requires as much unprovable faith as my belief in a personal God who loves us and made is in His image.\n \n And why don't we have any records of INTELLIGENT HUMAN SOCIETIES going back 100,000 or 150,000 years ? But only in the recent past as is stated by my bible ? And confirmed in all of the archeological evidence found to date. Why don't we find the remains of cities, pottery or tools reflecting the evolutionary leaps we made that show man was at least intelligent 100,000 years ago ? \n \n \n \n As I said above, if what you say were true, we would have some archeological evidence of such Societies. In addition to finding just bones of the alleged missing link you evos are looking so hard for, (which you still haven't found yet either) we would also find remains of that which those people built before they died. Such as we find the remains of ancient cities, pottery, furniture, jewelry, children's toys and all kinds of daily items of life as spoken of in the Bible of Israel's past. The non existent gaps you must fill in with your imaginations in evo are so much greater than I would ever put up with in my belief in God, and still be a believer.\n \n \n \n Again, you can claim this but you can't prove it. In 20 years none of the facts that evo relies on as truth will exist as they stand today. If the science were real, some absolutes would exist, upon which the rest would add to and remain consistent. But every new discovery forces evo to back up and re-evaluate and re-adjust it original assertions in order to try to remain the least bit consistent. My Gospel doesn't change with the direction of the wind or every new archeological find. God is the same yesterday, today and forever.\n \n \n \n The bible was written by men, yes. But it was authored by the Lord Himself. See John 1:1-5 for the bibles perspective on this fact. \n \n \n \n That's because you separated paragraphs 5, 6 and 7 when they go together. Apart they mean nothing but together they make a point. Here, read them together and see if they don't make more sense as an organized thought.\n \n \n \n The point i'm making is that 5000 years ago Genesis said the arabs and the jews would be major participants and the catapults leading to the last war on Earth and here we are at the end of this Age and like they're right on que, Radical Islam is declaring War on Israel and Christianity. Of course those who believe the bible is myth can't see this but that doesn't change the fact that the bible has warned us that this time in history is coming and that it's here now.\n \n \n \n So you claim a knowledge of Yahweh yet deny the power there of ? How sad my friend.\n \n \n \n When you claim evolution is responsible for you being here, you must by default admit that you're denying His insistence that we acknowledge Him as the Creator of all that is and as the personal God that he is. You are rejecting that He is the God of Israel and loves you and made you in his image. You are giving the glory that God rightly deserves to the science of evolution. So whether or not you realize it, you are glorifying the religion of secular humanism, not Yahweh, the Maker of all that is.\n\n \n I will not be responding to this, Obvious Child has done a fine job, and there would be no reason to just repeat another.\n \n If you need more proof however of how the mutation of DNA is what caused man to evolve I would be happy to go there, and then the next logical step of survival of the fittest.", 
   {}, 
   260417, 
   null, 
   1177602240.0
  ], 
  [
   260445, 
   null, 
   "ShadowPikachu", 
   " In 20 years none of the facts that evo relies on as truth will exist as they stand today. If the science were real, some absolutes would exist, upon which the rest would add to and remain consistent. But every new discovery forces evo to back up and re-evaluate and re-adjust it original assertions in order to try to remain the least bit consistent. My Gospel doesn't change with the direction of the wind or every new archeological find. God is the same yesterday, today and forever.\n \n\n \n Um, dude, that's the entire POINT of science. Science is MEANT to change with the discovery of new facts. It changes WITH the facts, rather than ignoring the facts. That is what makes it so different from religion (and hence why \"Intelligent Design (AKA Creationism)\" does not belong in the classrooms of our schools). Most religions (as you just admitted), would bury their heads in the sand whenever new facts are found that contradict them. Religions like yours are like little children that stick their fingers in their ears and yell: \"Lalalalalala... I'm not listening!\"\n \n What a way to stay ignorant.", 
   {}, 
   260417, 
   null, 
   1177609440.0
  ], 
  [
   260458, 
   null, 
   "obvious_child", 
   "What a way to stay ignorant.\n\n \n Arch is merely keep inline with the commandments of Creationism.\n \n 1) Thou Shall Not Get A Education\n 2) Thou Shall Not Use Logic", 
   {}, 
   260445, 
   null, 
   1177619760.0
  ], 
  [
   260461, 
   null, 
   "First1in", 
   "Arch is merely keep inline with the commandments of Creationism.\n \n 1) Thou Shall Not Get A Education\n 2) Thou Shall Not Use Logic\n\n \n Don't forget\n \n 3) Thou shall not adapt to change\n 4) Thou shall not respect the opinions of others\n 5) Thou shall not believe in provable facts", 
   {}, 
   260458, 
   null, 
   1177621860.0
  ], 
  [
   260781, 
   null, 
   "Bradamante", 
   "\n \n You are right, though; there are far too many fanatics out there....period.\n\n \n How many should there be?", 
   {}, 
   260399, 
   null, 
   1177842180.0
  ], 
  [
   260782, 
   null, 
   "Bradamante", 
   "There are far to many fanatics out there who think not only that thier religion is right, but that every one else is wrong. So my challange to all is, with out quoting the bible, prove it.\n\n Well it's logical that if my faith claims \"A\" and someone else's claims \"B\" and if \"A\" and \"B\" are mutually exclusive claims then (whilst we BOTH might be wrong) it's 100% that at least one of us is.\n \n So your objection that someone who (might be/is) right claiming that they are is unfounded.emoticon_xclown", 
   {}, 
   260175, 
   null, 
   1177842420.0
  ], 
  [
   260802, 
   null, 
   "Mucusaur", 
   "f the science were real, some absolutes would exist, upon which the rest would add to and remain consistent.\n\n \n Like the speed of light, acceleration due to gravity, absolutes like that?", 
   {}, 
   260782, 
   null, 
   1177856820.0
  ], 
  [
   260987, 
   null, 
   "Big Orn", 
   "How many should there be?\n\n One per household, which is usually the wife since most husbands can't pick up after themselves. She sees stuff that husbands and kids can't see and then gets that \"look\"...you know the \"look\". So, my answer is at least one.\n \n Back to the OP. Since God is illogical, His teachings can't make much sense either. Both God and why He is what and who He is, is unprovable.\n \n Religion, on the other hand, has proved to be a disaster time after pathetic time.\n \n The topic is about religion...right?", 
   {}, 
   260781, 
   null, 
   1177961460.0
  ], 
  [
   261100, 
   null, 
   "pappillion001", 
   "How sad, 15 responses so far and not one serious attempt to explain why and how it is the most reasonable conclusion we can make that all that exists in creation, culminating with the marvel and accomplishments of humanity in so short a period of recorded history, that only if we came from a creative, loving father who made us in his image could we have come so far in so short a time, evolutionarily speaking of course.\n \n I mean, you evolutionists claim we have been evolving for millions of years right ? Yet in a short 5000 years or so of recorded history we have evidently gone from living in caves and drawing on walls to central air and wireless computer technology which I'm communicating with you now on my MacBook. The same 5000 or so years that this so called book of myths has existed. Weird huh ? A lot of coincidences and unanswered questions but valid inquiries none the less.\n \n For further evidence just look at the perfectly balanced chain of life in creation. How each link is connected so perfectly in that each lower form compliments the one above it. As an example, just consider the overall effect on Agriculture if the simple honey bee doesn't bounce back from the mass die off that remains unexplained as yet but a scary reality to the powers that be none the less. Can any of you explain why that is happening because I can.\n \n And why did your challenge exclude the use of the bible as proof of Gods existence First1in ? Is it that you just reject it as evidence at all, or you don't want evidence that you can't refute ? I promise I wont quote verses but must refer to it for its history. I hope that's ok with you. \n \n Now consider the current Worldwide Political Chaos that exists. And without using scripture verses to convert let's just recap some early history from the Jewish Old Testament because as recorders of their own history we know they were second to none. As a Jew you know that Abraham had 2 sons. From one of those sons, Isaac, came the 12 tribes of Israel. From the other, Ishmaial, came the 12 tribes of the Arab people. Both peoples are semitic and in fact half brothers as sons of Abraham with different mothers. Those being Sarah and Hagar respectively.\n \n Now coincidentally enough, this story goes all the way back to the first book of the bible, Genesis. It is also written in Genesis that there would be a seed of bitterness between the sons of Abraham until the end of the World. And curiously we are still witnessing the evidence of the same hatred in this so called Age of Enlightenment when we have accomplished so much as a race that can't even get along with each other. Just imagine what we could accomplish if we could erase these ancient Tribal Conflicts.\n \n But can any of you worldly wise atheists explain why a so called mythical book written by ignorant men whom some here claim couldn't even determine the proper number of legs on a grasshopper could properly identify the same two peoples who they claimed in all of their prophecies regarding the end of the World more than 4000 years ago would lead to the last War, and strangely enough those are the very same 2 peoples who are engaged in this struggle today that according to the New Testament Prophecies promise will lead to Armageddon and the end of the World as we know it at the end of this current Age ? Any takers on that riddle ? \n \n Pretty incredible foresight for a mythical book huh ? If you take and study the prophecies in the Old and New Testament and truly understood them for what they say. You would see just how supernatural a document it is. And it saddens me deeply as a born again arab that I have jewish brothers right here on this sight who have forsaken not only their birthright but their inheritance as they deny who they are as God's chosen people. To not even realize that it is by way of the jew that salvation came into the World makes you the most destitute of all the scoffers and mockers who have contributed to this thread.\n\n \n I just wanted to point out a few things regarding your statements above.\n 1) We have indeed been evolving for millions of years. Since most cave dwellers were poor at recording the events of the times, we must conclude that 5,000 years ago humans had progressed much farther than what your post suggests. Considering the advances in science, astronomy, engineering, economics etc that had been achieved thousands of years ago, we really should be much farther along than we are. I think organized religion has a lot to do with the stutter step advances our species has experienced.\n \n 2) Most of the religious books you refer to (Christain, Jewish or Muslim) have not been around for 5,000 years. Also how many cave dwellers did it take to write those books? Smart enough to have written language, but only on paper huh. Next you'll say that cave paintings were early wallpaper and that's why there is no text with the cave paintings. \n \n 3) No coincidences No valid inquiries, just lack of thought, a need to be right and a little creativity with the facts.\n \n 4) That balance is called evolution. The fact that it is adapt, survive and spread is pretty obvious. When you go to build something that you know how to build, it comes out right the first time doesn't it? Life on earth sure doesn't. What were extinct animals? Temps filling up space until God could get around to making the right creature? Where did the animals that did not exist at the time of creation, but do now come from? How come they don't add to the bible something like on the 1,236,915th day god created the the dung beetle or on the 2,309,217th day God created Hawaii because he liked pinapples and surfing?\n \n 5) Quote or reference away from the Bible all you want. Just accept the fact that it is all heresay (wow that's spelled almost like heresy) altered, forged and mistranslated. It really is in your best interest not to use it to make your case. Facing the death penalty at a trial I would counsel you to seek some other credible witnesses.\n \n 6) Oh I see Jews are the cave dwellers who recorded history. Go ask a jewish person to quote a passge from their Old Testament, see how many can do it. Oops my mistake the first jews for jesus (now they call themselves Christians or Catholics or Lutherans or Prtotestants or Mormans or one of 1200+ other names) How come so many people disagree on that book? Isn't it supposed to be you know like totally accurate and all?\n \n 7) The last major hurdle to overcome will be religion. We are well on our way when it comes to gender, getting better at race, dealing with culture and that leaves the big one religion. If your right God kills us pretty well, he doesn;t need us to do it for him or in his name (oh unless you happen to have a chariot of iron, that it seems trumps gods power of destruction. Who knew?)\n \n 8) It's sad but true throughout history everybody has had a beef with the Jews. To look at the situation today and try to imply it has always been like this is straying a little to the side of the road of facts. There could just as easily be peace between the three major religions. Maybe if you stopped wishing for the end of the world so much and people would stop using the throats of others as a step ladder to thier own glory things might be different. But religion teaches us that my God is better than yours and that better God has burdened me with the responsibility of showing you how wrong you are. You'll thank me later emoticon_xgood \n \n It does nobody any good to distort the facts to fit your ideas of what is. You can't prove there is a God I can't prove there isn't. The evidence is leaning towards there isn't, but a part of me hopes I am wrong. Take out all the man inserted ego, revenge, hatred bias that is in religion and pamphlet that is left might be nice. \n \n So I hope I have answered your questions, I doubt to your liking but that part is up to you. If doing what your doing works for you then God Blessemoticon_xgood", 
   {}, 
   260410, 
   null, 
   1178005560.0
  ], 
  [
   262128, 
   null, 
   "bmittking", 
   "Optimist's Answer:\n They're all right.\n \n Pessimist's Answer:\n They're all wrong.\n \n My Answer:\n They all are.", 
   {}, 
   261100, 
   null, 
   1178592660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A challange for you", 
  "url": "http://www.4forums.com/political/religion-debates/9810-challange-you.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9810, 
  "discussion_files": [
   [
    "4059.html", 
    "http://www.4forums.com/political/religion-debates/9810-challange-you-print.html"
   ], 
   [
    "4060.html", 
    "http://www.4forums.com/political/religion-debates/9810-challange-you-3-print.html"
   ], 
   [
    "4061.html", 
    "http://www.4forums.com/political/religion-debates/9810-challange-you-2-print.html"
   ]
  ], 
  "identifier": 9810
 }
]