[
 [
  [
   260182, 
   null, 
   "Moonlitface", 
   "Alrighty, before everyone jumps on me with hurtful words. Heh. I'd like to just give you my opinion on this matter. <3emoticon_xangel \n \n First to bat, I'm not against the gay person, I'm not homophobic I'm against the homosexuality. I don't think gay people should be damned to Hell, put in jail, or any of that stuff. That's absurd. \n \n What I do think, is that marriage is unity between a man and a woman. The *OK* For sex, and personally I believe it's origin is biblical. \n emoticon_love Jesus freak ^.vemoticon_zzzz", 
   {
    "post_info": {
     "post_title": "Anti-gay marriage"
    }
   }, 
   null, 
   null, 
   1177461480.0
  ], 
  [
   260186, 
   null, 
   "samiinh", 
   "Alrighty, before everyone jumps on me with hurtful words. Heh. I'd like to just give you my opinion on this matter. <3emoticon_xangel \n \n First to bat, I'm not against the gay person, I'm not homophobic I'm against the homosexuality. I don't think gay people should be damned to Hell, put in jail, or any of that stuff. That's absurd. \n \n What I do think, is that marriage is unity between a man and a woman. The *OK* For sex, and personally I believe it's origin is biblical. \n emoticon_love Jesus freak ^.vemoticon_zzzz\n\n \n A gay person is a homosexual, friend. He can't change that part about himself. He was wired that way. If you don't like the idea of gay sex, then I'd suggest you not participate in gay sex. That's pretty simple. If you don't want gay marriage, then don't get one.", 
   {}, 
   260182, 
   null, 
   1177462080.0
  ], 
  [
   260189, 
   null, 
   "MrWriteLA", 
   "And FYI, \"marriage\" was around long before the Bible.", 
   {}, 
   260186, 
   null, 
   1177462320.0
  ], 
  [
   260193, 
   null, 
   "Archangel", 
   "And FYI, \"marriage\" was around long before the Bible.\n\n \n And so wasn't the universal opinion that homosexuality is unnatural, wrong and to no benefit to Society at all.", 
   {}, 
   260189, 
   null, 
   1177462740.0
  ], 
  [
   260194, 
   null, 
   "bandgeek615", 
   "just because ppl thought homosexualality was considered wrong long before the bible, doesnt mean anything, just like they though fire was magic.", 
   {}, 
   260193, 
   null, 
   1177463760.0
  ], 
  [
   260195, 
   null, 
   "MrWriteLA", 
   "Ignorance has been around a long time. Of course, they didn't know any better, being primitive people, and thus had no excuse.", 
   {}, 
   260194, 
   null, 
   1177464060.0
  ], 
  [
   260196, 
   null, 
   "samiinh", 
   "Unfortunately, there are many who continue to show their ignorance.", 
   {}, 
   260195, 
   null, 
   1177464420.0
  ], 
  [
   260205, 
   null, 
   "gaetano", 
   "And so wasn't the universal opinion that homosexuality is unnatural, wrong and to no benefit to Society at all.\n\n \n \n \n \n Gaetano:\n Yes indeed, along with the universal opinion that the world was flat. Ignorance can be local and/or universal", 
   {}, 
   260193, 
   null, 
   1177468020.0
  ], 
  [
   260207, 
   null, 
   "Matthew S", 
   "Alrighty, before everyone jumps on me with hurtful words. Heh. I'd like to just give you my opinion on this matter. <3emoticon_xangel \n \n First to bat, I'm not against the gay person, I'm not homophobic I'm against the homosexuality. I don't think gay people should be damned to Hell, put in jail, or any of that stuff. That's absurd. \n \n What I do think, is that marriage is unity between a man and a woman. The *OK* For sex, and personally I believe it's origin is biblical. \n emoticon_love Jesus freak ^.vemoticon_zzzz\n\n \n 1 your beliefs should not legally define my family\n 2 you don't believe in same sex marriage......well don't have one then.\n 3 notice my signature David and Jonathan bound thier souls together making them married in the eyes of God and that is also bliblical.\n 4 we live in a secular society and your religion should not interfere with my civil and legal contracts.", 
   {}, 
   260182, 
   null, 
   1177468200.0
  ], 
  [
   260211, 
   null, 
   "MrWriteLA", 
   "If you really want a traditional \"Biblical\" marriage, go out and get yourself a couple dozen wives. Don't expect the government to sanction it, though.", 
   {}, 
   260207, 
   null, 
   1177469100.0
  ], 
  [
   260308, 
   null, 
   "Moonlitface", 
   "\n 3 notice my signature David and Jonathan bound their souls together making them married in the eyes of God and that is also biblical.\n .\n\n If you could maybe show me the verse in the bible, if you have the time.\n \n A homosexual, in my belief is not some one who was wired that way. In the case that they were, does that make it ok for that guy who shot up Virginia tech to (If he was still living) be ok, just because he had an impulse to do it and he was wired that way? I mean i'm not saying that homosexuals compare to that in any way, what i'm saying is that yes the natural thing to do is to have sex between a man and a woman. Just because of the fact that we were made to do so, whether or not your Christian. Men have a scientific part, and so do women. Which are scientifically proven to reproduce. Yet we're all entitled to our own beliefs, and I love to here what other people think on these matters. \n \n Actually I do think it started biblically, just because in Genesis, it claims that God made Eve, and Eve was Adams wife.  but if you choose not to believe in the bible it probably doesn't matter to you. That's just why I think Marriage is biblical. \n \n *A little off subject* If gay marriage is legalized, then so should multiple partners for marriage?emoticon_zzzz", 
   {}, 
   260207, 
   null, 
   1177506420.0
  ], 
  [
   260313, 
   null, 
   "Matthew S", 
   "If you could maybe show me the verse in the bible, if you have the time.\n\n \n 1 Samuel 18:1\n Here is an essay on the topic\n http://www.bridges-across.org/ba/faith/jt_add4.htm\n and another\n http://rainbowallianceopenfaith.homestead.com/GayLove3.html\n \n \n \n\n Actually I do think it started biblically, just because in Genesis, it claims that God made Eve, and Eve was Adams wife.  but if you choose not to believe in the bible it probably doesn't matter to you. That's just why I think Marriage is biblical. \n\n \n Which creation story are you refering to Gensis chap 1 or Gensis chap 2? One contradicts the other.\n \n\n *A little off subject* If gay marriage is legalized, then so should multiple partners for marriage?emoticon_zzzz\n\n \n Yes absolutely remember that polygamous marriage is not only biblical but also the biblical norm. People should be free to form any type of family structure they want to.", 
   {}, 
   260308, 
   null, 
   1177507680.0
  ], 
  [
   260315, 
   null, 
   "samiinh", 
   "If you could maybe show me the verse in the bible, if you have the time.\n \n A homosexual, in my belief is not some one who was wired that way. In the case that they were, does that make it ok for that guy who shot up Virginia tech to (If he was still living) be ok, just because he had an impulse to do it and he was wired that way? I mean i'm not saying that homosexuals compare to that in any way, what i'm saying is that yes the natural thing to do is to have sex between a man and a woman. Just because of the fact that we were made to do so, whether or not your Christian. Men have a scientific part, and so do women. Which are scientifically proven to reproduce. Yet we're all entitled to our own beliefs, and I love to here what other people think on these matters. \n \n Actually I do think it started biblically, just because in Genesis, it claims that God made Eve, and Eve was Adams wife.  but if you choose not to believe in the bible it probably doesn't matter to you. That's just why I think Marriage is biblical. \n \n *A little off subject* If gay marriage is legalized, then so should multiple partners for marriage?emoticon_zzzz\n\n \n I'd like to ask you a question. When did you decide you were heterosexual? How did you know? Why can't you believe those of us who are wired differently from you that this is just the way we are? Many of us have reproduced, if you need to know. The world's population will not suffer though if no gay person ever reproduced again.\n \n As far as polyamourous marriage or pologamy goes....if there is support for such arrangements, let them fight for the right.", 
   {}, 
   260308, 
   null, 
   1177508040.0
  ], 
  [
   260342, 
   null, 
   "MrWriteLA", 
   "Gays aren't the ones arguing for marriage as defined in the Bible, their opponents are. They are, in effect, supporting polygamy, submissiveness in women, marriages arranged for political motives, etc. That was the \"traditional\" Biblical definition 2000 years ago that they keep saying we should respect the \"sanctity\" of. \n \n Back then, \"love\" was not a major, nor even a common, component of the institution, and clearly that's peachy with the anti-gay marriage group: Bible Belt divorce rates are higher than in the one state that has legalized same-sex marriage (which has the lowest in the country), despite the fact that divorce is condemned clearly and repeatedly in the Bible, so clearly devotion to one's spouse is not one of their major priorities. And they constantly trot out that moldy canard that gays are free to marry as long as it's to someone of the opposite sex, i.e. lovelessly. Their theme song should be \"What's love got to do with it, got to do with it?\" \n \n Well, if that's what they mean by marriage, they can keep it, as far as I'm concerned.", 
   {}, 
   260315, 
   null, 
   1177519080.0
  ], 
  [
   260343, 
   null, 
   "jitobear", 
   "And so wasn't the universal opinion that homosexuality is unnatural, wrong and to no benefit to Society at all.\n\n \n Gay people most certainly have been greater benefit to me than you preaching or your sorry XXX religion.", 
   {}, 
   260193, 
   null, 
   1177519080.0
  ], 
  [
   260347, 
   null, 
   "samiinh", 
   "Gays aren't the ones arguing for the ones arguing for marriage as defined in the Bible, their opponents are. They are, in effect, supporting polygamy, submissiveness in women, marriages arranged for political motives, etc. That was the \"traditional\" Biblical definition 2000 years ago that they keep saying we should respect the \"sanctity\" of. \n \n Back then, \"love\" was not a major, nor even a common, component of the institution, and clearly that's peachy with the anti-gay marriage group: Bible Belt divorce rates are higher than in the one state that has legalized same-sex marriage (which has the lowest in the country), despite the fact that divorce is condemned clearly and repeatedly in the Bible, so clearly devotion to one's spouse is not one of their major priorities. And they constantly trot out that moldy canard that gays are free to marry as long as it's to someone of the opposite sex, i.e. lovelessly. Their theme song should be \"What's love got to do with it, got to do with it?\" \n \n Well, if that's what they mean by marriage, they can keep it, as far as I'm concerned.\n\n \n I spent the weekend in Boston at the Seaport Hotel. While waiting for a ride, we talked with one of the doormen who was from the Ivory Coast. His grandfather had had many wifes and many children, and barely knew who his grandchildren belonged to. His own marriage (he was a young man, probably in his early 30s), had been arranged by his father. This is \"traditional marriage\" in his culture. \"Traditional Marriage\" in America ends in divorce 50% of the time.", 
   {}, 
   260342, 
   null, 
   1177520220.0
  ], 
  [
   260348, 
   null, 
   "samiinh", 
   "Gay people most certainly have been greater benefit to me than you preaching or your sorry XXX religion.\n\n \n Some of the greatest artist in history were gay. Some even think Archie's blessed Jesus was gay. Most of the hierarchy in the first christian church are gay, self-loathing gays, but gay none the less.", 
   {}, 
   260343, 
   null, 
   1177520340.0
  ], 
  [
   260509, 
   null, 
   "AntDogg", 
   "Alrighty, before everyone jumps on me with hurtful words. Heh. I'd like to just give you my opinion on this matter. <3emoticon_xangel \n \n First to bat, I'm not against the gay person, I'm not homophobic I'm against the homosexuality. I don't think gay people should be damned to Hell, put in jail, or any of that stuff. That's absurd. \n \n What I do think, is that marriage is unity between a man and a woman. The *OK* For sex, and personally I believe it's origin is biblical. \n emoticon_love Jesus freak ^.vemoticon_zzzz\n\n \n *SIGH*\n \n That's good that you think marriage is a unity between a man and a woman. That is your belief, so marry someone of the opposite sex then. I believe that marriage is between two people that love each other, regardless of sex. I am attracted to men, I have dated men, have had sex with men, and will most likely marry one in the future, not if, but WHEN it is legalized.\n \n Thank you, though, for not stating that the \"biblical origin\" of sex is absolute truth or fact and that we are wrong and you are right. Some people just don't understand that there's a difference between fact and opinion. :xbanghead", 
   {}, 
   260182, 
   null, 
   1177643760.0
  ], 
  [
   261066, 
   null, 
   "Moonlitface", 
   "I'd like to ask you a question. When did you decide you were heterosexual? How did you know? Why can't you believe those of us who are wired differently from you that this is just the way we are? Many of us have reproduced, if you need to know. The world's population will not suffer though if no gay person ever reproduced again.\n -samiinh\n \n Well I didn't decide, I was born that way. It was the natural thing for me to be attracted to men. Yet you still haven't brought up the subject of some man being wired to kill because he was mentally insane. Which does not compare to gay people at all, yet by saying they were *wired* that way, it should not make it ok for a crazy man to murder. \n \n Although I must agree that we will not suffer from a population decrease. :) \n \n \n \n 1 Samuel 18:1\n -Matthew\n \n 1 Samuel 18:1-4 (NIV) \n 1 After David had finished talking with Saul, Jonathan became one in spirit with David, and he loved him as himself. \n 2 From that day Saul kept David with him and did not let him return to his father's house. \n 3 And Jonathan made a covenant with David because he loved him as himself. \n 4 Jonathan took off the robe he was wearing and gave it to David, along with his tunic, and even his sword, his bow and his belt. \n \n How do you even suppose he's gay out of this. I lov my brother as myself, my sister as myself. I love some of my friends as myself. That does not mean i'm a homosexual and want to marry my closest friends. Even so as the opposite sex, I have a friend whom I love very much, yet I don't want6 to marry him. I have in other friend to whom I'm one in the spirit with, meaning we are brother and sister in Christ... Out of all the interpretations why homosexual?\n \n I cannot find a contradiction.. Might you show me, and thank you for the other verse.\n \n \n MrWriteLA: \n \n Their theme song should be \"What's love got to do with it, got to do with it?\"\n \n Hehe I love that song.. I have to dl that to my Ipod... Funneh nice joke. Yet you are right that love played into few things back then.\n \n \n \n -Leviticus 18:22, 18:29- ///even though there is a penalty for all/// \n -1kings 14:24, Romans1:18-27 Romans 1 and 2.\n These are just a few things that it would be cool for you to read if you're able. These verses are from the New living translation, yet i'm sure they're very similar in other translations as well.\n \n \n AntDogg Quote:\n Originally Posted by Moonlitface \n Alrighty, before everyone jumps on me with hurtful words. Heh. I'd like to just give you my opinion on this matter. <3 \n \n First to bat, I'm not against the gay person, I'm not homophobic I'm against the homosexuality. I don't think gay people should be damned to Hell, put in jail, or any of that stuff. That's absurd. \n \n What I do think, is that marriage is unity between a man and a woman. The *OK* For sex, and personally I believe it's origin is biblical. \n Jesus freak ^.v \n \n \n *SIGH*\n \n That's good that you think marriage is a unity between a man and a woman. That is your belief, so marry someone of the opposite sex then. I believe that marriage is between two people that love each other, regardless of sex. I am attracted to men, I have dated men, have had sex with men, and will most likely marry one in the future, not if, but WHEN it is legalized.\n \n -You could always go to Massachusetts. (One of the reasons I don't like the politics in my Home state.) You are completely correct. I believe in marriage between a man and woman. And, I will marry a man, I hope I get married. But I do stand firm on my belief, for this country and the situation of gay marriage, because it does affect me. The more liberal we tend to get, the less we fight for freedom in this country, the youth that's growing up today, NOT EVEN STANDING FOR THE PLEDGE When this is the best country you could live in! It really saddens me to see people not keeping to the way this country was established. I wouldn't mind if woman couldn't work, I'd love to be made to be a house wife! Anything to get this country back to what it use to be. Sorreh that was just bugging me a little. I know that has nothing to do with homosexual marriage. But I have random outburst, you know? I get those a little too much heh....\n \n Thank you, though, for not stating that the \"biblical origin\" of sex is absolute truth or fact and that we are wrong and you are right. Some people just don't understand that there's a difference between fact and opinion. \n \n I'm surprised you'd say that. Sometimes people believe I'm a little bit forcing.. I completely respect your opinion, and I love to here it, debates are so fun to me! Yet I wouldn't want to make enemies because of what I believe in, therefore I try not to force it on others, I liek to share it with others and they can choose for themselves to beleive it or not. To believe or not to believe... That is the question. I want to be kind to everyone no matter what they have an opinion about. To me debating is awesome, and I also love to share my opinion with others, as you probably can tell =D It's just so frustrating, being so young and not having anyone listen at school because no one cares about topics anymore, they just usually repeat their parents. (In my school anyways) I just love to be able to share my opinion with people who I can learn from in return. <3 emoticon_zzzz emoticon_zzzz", 
   {
    "unicode_changes_made": true
   }, 
   260342, 
   null, 
   1177990620.0
  ], 
  [
   261069, 
   null, 
   "Matthew S", 
   "\n How do you even suppose he's gay out of this. I lov my brother as myself, my sister as myself. I love some of my friends as myself. That does not mean i'm a homosexual and want to marry my closest friends. Even so as the opposite sex, I have a friend whom I love very much, yet I don't want6 to marry him. I have in other friend to whom I'm one in the spirit with, meaning we are brother and sister in Christ... Out of all the interpretations why homosexual?\n \n I cannot find a contradiction.. Might you show me, and thank you for the other verse.\n \n :\n\n \n GWT: I am heartbroken over you, my brother Jonathan. You were my great delight. Your love was more wonderful to me than the love of women. Samuel 1:26\n \n Do you love them more then the love of women?", 
   {}, 
   261066, 
   null, 
   1177991400.0
  ], 
  [
   261081, 
   null, 
   "Ohioprof", 
   "[\n \n -You could always go to Massachusetts. (One of the reasons I don't like the politics in my Home state.) You are completely correct. I believe in marriage between a man and woman. And, I will marry a man, I hope I get married. But I do stand firm on my belief, for this country and the situation of gay marriage, because it does affect me. The more liberal we tend to get, the less we fight for freedom in this country, the youth that's growing up today, NOT EVEN STANDING FOR THE PLEDGE When this is the best country you could live in! It really saddens me to see people not keeping to the way this country was established. I wouldn't mind if woman couldn't work, I'd love to be made to be a house wife! Anything to get this country back to what it use to be. Sorreh that was just bugging me a little. I know that has nothing to do with homosexual marriage. But I have random outburst, you know? I get those a little too much heh....\n \n \n\n \n What do you think this country used to be? It sounds like you think the country has declined. I think the opposite is true in many respects. The country used to practice race discrimination by law. Now we still have race discrimination, but it is no longer by law, and people of all races have more opportunities. The country used to bar women from voting and from pursuing careers. Now we women can vote, hold office, earn professional degrees, and have satisfying careers. \n \n I do not stand up for the pledge, and I am not a youth. I am 52 years old. I don't believe in pledging allegiance to a government. That's one of the freedoms we have in this country, the freedom not to pledge allegiance to a government. Fight for freedom? I do fight for freedom, but I would not go to war to fight for the Bush administration's policies. I resist them. I think people should refuse to fight in Iraq, because the war is wrong. People who refused to fight in Vietnam were right; that war was wrong also. \n \n How do you know the United States is the best country to live in? I think there are plenty of other countries that are as good to live in or perhaps better in some respects. I do not intend to leave the United States to live elsewhere, but I do not presume that this is the best country. I think that many countries are fine places to live, and I would be proud to live in many countries in the world. I just happen to live here in the U.S.", 
   {}, 
   261066, 
   null, 
   1177998420.0
  ], 
  [
   261113, 
   null, 
   "pappillion001", 
   "And so wasn't the universal opinion that homosexuality is unnatural, wrong and to no benefit to Society at all.\n\n \n No. Same sex acts (I know acting gay and being gay are different, but who knows when the first homosexual popped up, Could have been Adam, Eve Cain probably not Abel or Seth. My bets on Seth.)Slight distraction, I am willing to bet there were at least a few homosexual participants who had the very important job of performing the rituals that would appease whatever God is in at that time. This was not isolated to one or two groups in a particular region, this was all thru time and all over. \n \n Which is the opinion of some why the reference to same sex acts is in the bible. Not because gays were evil or the acts were sinful, but because it was part of other religions, including the arch enemy of God, dun dun duuuun Baal. If God was that against Homosexuals \n A) He would not have made them\n B) He would let them know\n C) Oh ye of little faith. Your job is to behave, God's job is to judge. Trust God will do his Job. Do you really think he needs your help?emoticon_xdonno", 
   {}, 
   260193, 
   null, 
   1178019840.0
  ], 
  [
   261127, 
   null, 
   "Moonlitface", 
   "No. Same sex acts (I know acting gay and being gay are different, but who knows when the first homosexual popped up, Could have been Adam, Eve Cain probably not Abel or Seth. My bets on Seth.)Slight distraction, I am willing to bet there were at least a few homosexual participants who had the very important job of performing the rituals that would appease whatever God is in at that time. This was not isolated to one or two groups in a particular region, this was all thru time and all over. \n \n Which is the opinion of some why the reference to same sex acts is in the bible. Not because gays were evil or the acts were sinful, but because it was part of other religions, including the arch enemy of God, dun dun duuuun Baal. If God was that against Homosexuals \n A) He would not have made them\n B) He would let them know\n C) Oh ye of little faith. Your job is to behave, God's job is to judge. Trust God will do his Job. Do you really think he needs your help?emoticon_xdonno\n\n \n \n You throuw in some good points -tping fast on the way to school to test =P Yuck...- Although You think that God made themlike that, and they were born homosexual. Whereas I think that it's a choice to be made. Wether or not you cheat on your wfe is also a choice to be made, for I think that they probably would love multipul partners hehe. Well some anyways..\n Also it is God's jkob to judge, but throughout life throughout the bible he uses others, as he has used me to do his work through ourselves. \n Oh and what do you mean by let them know? I'm a lil' slow this morning x.x I'm so not a morning person.emoticon_zzzz", 
   {}, 
   261113, 
   null, 
   1178025960.0
  ], 
  [
   261132, 
   null, 
   "samiinh", 
   "You throuw in some good points -tping fast on the way to school to test =P Yuck...- Although You think that God made themlike that, and they were born homosexual. Whereas I think that it's a choice to be made. Wether or not you cheat on your wfe is also a choice to be made, for I think that they probably would love multipul partners hehe. Well some anyways..\n Also it is God's jkob to judge, but throughout life throughout the bible he uses others, as he has used me to do his work through ourselves. \n Oh and what do you mean by let them know? I'm a lil' slow this morning x.x I'm so not a morning person.emoticon_zzzz\n\n \n When did you choose your sexual orientation?", 
   {}, 
   261127, 
   null, 
   1178030100.0
  ], 
  [
   261135, 
   null, 
   "Matthew S", 
   "\n But I do stand firm on my belief, for this country and the situation of gay marriage, because it does affect me. The more liberal we tend to get, the less we fight for freedom in this country, the youth that's growing up today, NOT EVEN STANDING FOR THE PLEDGE When this is the best country you could live in! It really saddens me to see people not keeping to the way this country was established. \n\n \n In fact I turn my back on the flag when the pledge is being said an recite the following\n \n I will not recite the pledge as it is false in that there is no liberty and justice for all. I will not pledge allegiance to a country where I am second class citizen. I will not pledge allegiance to a country whose government and its elected representatives seek to hurt and dishonor my family.", 
   {}, 
   261066, 
   null, 
   1178031540.0
  ], 
  [
   261147, 
   null, 
   "peteratwar", 
   "In fact I turn my back on the flag when the pledge is being said an recite the following\n \n I will not recite the pledge as it is false in that there is no liberty and justice for all. I will not pledge allegiance to a country where I am second class citizen. I will not pledge allegiance to a country whose government and its elected representatives seek to hurt and dishonor my family.\n\n \n Oh come on, you have to be more adult than that surely.", 
   {}, 
   261135, 
   null, 
   1178036580.0
  ], 
  [
   261156, 
   null, 
   "Matthew S", 
   "Oh come on, you have to be more adult than that surely.\n\n \n Why should I pledge allegence to a country whose majority population, leaders, and religion hate me? Why should I pledge allegence to a country that will not accept or respect my families right to exist? Why should I pledge allegence to a country that values bigotry, hatred, injustice and intolerance towards my people? Why should I pledge allegence to a country that lies about there being liberty and justice for all except gay people?", 
   {}, 
   261147, 
   null, 
   1178039580.0
  ], 
  [
   261157, 
   null, 
   "samiinh", 
   "Why should I pledge allegence to a country whose majority population, leaders, and religion hate me? Why should I pledge allegence to a country that will not accept or respect my families right to exist? Why should I pledge allegence to a country that values bigotry, hatred, injustice and intolerance towards my people? Why should I pledge allegence to a country that lies about there being liberty and justice for all except gay people?\n\n \n I guess I'm fortunate to live where I do and receive, as I just did, a letter from the Senate President thanking me for my support for the newly passed civil unions bill.", 
   {}, 
   261156, 
   null, 
   1178039820.0
  ], 
  [
   261162, 
   null, 
   "peteratwar", 
   "Why should I pledge allegence to a country whose majority population, leaders, and religion hate me? Why should I pledge allegence to a country that will not accept or respect my families right to exist? Why should I pledge allegence to a country that values bigotry, hatred, injustice and intolerance towards my people? Why should I pledge allegence to a country that lies about there being liberty and justice for all except gay people?\n\n \n \n You live there under the protection of your laws, you pay your taxes\n \n Don't like it, emigrate to Holland OR work to change legitimately and legally through convincing people.\n \n Don't delude yourself with all this hatred c--p. You are only making excuses", 
   {}, 
   261156, 
   null, 
   1178041200.0
  ], 
  [
   261164, 
   null, 
   "jitobear", 
   "\n I hope I get married. \n\n \n I hope I don't. Actually, know I won't.\n \n \nBut I do stand firm on my belief, for this country and the situation of gay marriage, because it does affect me. \n\n \n How?\n \n \nThe more liberal we tend to get, the less we fight for freedom in this country,\n the youth that's growing up today, NOT EVEN STANDING FOR THE PLEDGE \n\n \n And the more conservative we get the less free we actually are. Do you not see the glaring contradiction in your sentence?\n \n \nWhen this is the best country you could live in! \n\n \n I like it here, too. Also love Canda and Spain.\n \n \nIt really saddens me to see people not keeping to the way this country was established. \n\n \n You mean by butchering the natives and utilizing slave labor?\n \n \nI wouldn't mind if woman couldn't work, I'd love to be made to be a house wife! \n\n \n I WOULD. But you know - you could always move to a really conservative muslim country - I am sure they would be glad to oblige you.", 
   {}, 
   261066, 
   null, 
   1178041800.0
  ], 
  [
   261170, 
   null, 
   "ShadowPikachu", 
   " You live there under the protection of your laws, you pay your taxes\n\n Yeah, they pay taxes that go to heteros like you in your little marriages while they themselves andtheir partners get none of it. Real fair there. emoticon_rolleyes\n \n \n\n Don't like it, emigrate to Holland OR work to change legitimately and legally through convincing people.\n\n If you don't like the fact that gays want to have the same marriage rights and benefits as heteros, move to a middle-eastern country - you'd fit right in there if your latest posts say anything about you.\n \n \n\n Don't delude yourself with all this hatred c--p. You are only making excuses\n\n \n Making excuses for what? :xbanghead", 
   {}, 
   261162, 
   null, 
   1178043540.0
  ], 
  [
   261256, 
   null, 
   "Matthew S", 
   "You live there under the protection of your laws, you pay your taxes\n \n Don't like it, emigrate to Holland OR work to change legitimately and legally through convincing people.\n \n Don't delude yourself with all this hatred c--p. You are only making excuses\n\n \n OH yes typical. I am expected to live up to the repsoniblities of a citizen but not given full citizenship rights. In other words I can give my money, and it will gladly be accepted, to support the banquet but I can't set foot in the banquet hall. I just don't understand why I should work to convince people to give me the rights that I allready have and are my birth right.", 
   {}, 
   261162, 
   null, 
   1178110620.0
  ], 
  [
   261277, 
   null, 
   "peteratwar", 
   " I just don't understand why I should work to convince people to give me the rights that I allready have and are my birth right.\n\n \n The question seems to be whether gay marriage is a right or not let alone a birth right.\n \n At present I guess not. Nor in fact are rights absolute. Your constitution doesn't make them absolute, merely what has been agreed as the best way forward for the people of the United States.\n \n In absolute terms there is no truly free society.\n \n Rights have to be worked for and agreed by all. At least that has been the best way forward so far. It is basically the way your constitution has arisen and been amended.", 
   {}, 
   261256, 
   null, 
   1178116380.0
  ], 
  [
   261278, 
   null, 
   "peteratwar", 
   "Yeah, they pay taxes that go to heteros like you in your little marriages while they themselves andtheir partners get none of it. Real fair there. emoticon_rolleyes\n \n \n If you don't like the fact that gays want to have the same marriage rights and benefits as heteros, move to a middle-eastern country - you'd fit right in there if your latest posts say anything about you.\n \n \n \n Making excuses for what? :xbanghead\n\n \n 1. I pay taxes just the same. I am not aware of anyone's taxes being paid to me.\n \n 2. If the country agrees to redefine marriage then that is OK. Remind you in the UK we are moving that way.\n \n 3. Being a whinger on the 'poor little me' 'everyone hates me' basis.", 
   {}, 
   261170, 
   null, 
   1178116560.0
  ], 
  [
   261291, 
   null, 
   "Ohioprof", 
   "The question seems to be whether gay marriage is a right or not let alone a birth right.\n \n At present I guess not. Nor in fact are rights absolute. Your constitution doesn't make them absolute, merely what has been agreed as the best way forward for the people of the United States.\n \n In absolute terms there is no truly free society.\n \n Rights have to be worked for and agreed by all. At least that has been the best way forward so far. It is basically the way your constitution has arisen and been amended.\n\n \n The issue is not whether gaymarriage is a right. The issue is whether marriage is a right. Marriage is marriage. \"Gay\" marriage is simply marriage between partners of the same sex. It's not fundamentally different from marriage between partners of the opposite sex. \n \n You are correct that in the United States, the Supreme Court has ruled over time that rights are not absolute; they are to be balanced against a state interest in passing laws that may limit rights. But the state has to demonstrate, when challenged in court, that it in fact has a real interest, a rational basis at least, for the enactment of laws that deny people rights.\n \n You say that \"rights have to be worked for.\" That's not the conception of rights that comes to us from Jefferson's Declaration of Independence, which he of course drew from the ideas of John Locke. Jefferson, and Locke before him, asserted that people have natural rights, given to us by the Creator, that are unalienable. It's certainly true that our U.S. society has backtracked a long way from recognizing rights as unalienable. Perhaps the principles in Jefferson's Declaration are just \"glittering generalities\" after all. But reasonable people can disagree over the source of rights, and how easily they may be taken away. \n \n I think we are better off erring on the side of protecting individual rights and limiting the power of the state to infringe on those rights. Should the state have the power to deny same-sex couples the right to marry simply because a majority of people dislike the idea of same-sex marriage? I think not. People will get over their dislike of same-sex marriage, and it won't hurt them. Look at the example of Massachusetts, where polls indicate that a majority of state residents now support same-sex marriage. Having same-sex marriage legalized did no harm to opposite-sex marriages; it did no harm to anyone at all. Denying the right to gay people to marry the person the love legally really does concrete harm, especially when the couple is raising children together.", 
   {}, 
   261277, 
   null, 
   1178121180.0
  ], 
  [
   261292, 
   null, 
   "Ohioprof", 
   "1. I pay taxes just the same. I am not aware of anyone's taxes being paid to me.\n \n 2. If the country agrees to redefine marriage then that is OK. Remind you in the UK we are moving that way.\n \n 3. Being a whinger on the 'poor little me' 'everyone hates me' basis.\n\n \n You do not seem to recognize the reality that many people DO hate gay people, especially in the United States. I do not know if the same level of hatred exists in Britain. When I have spent time in Britain, my sense has been that gay people are treated a little better there, but of course I cannot tell by spending just a month there, especially in London, where people are probably more accepting than they are in the countryside. Anyhow, there are places in the United States where gay people are accepted, but there are many other places where gay people still risk being physically attacked and even murdered. Hate crimes against gay people are still a regular occurrence, and murders of gay people because of their sexual orientation still take place. I can name you plenty of tragic examples besides the famous murder of Matt Shepherd. A gay man was just murdered a few weeks ago in Washington, DC. \n \n While it's true that focusing on how much we are hated by some people is usually not all that useful, the sense of being hated is not simply imagined by gay people. The hatred is real. Try walking down the street holding hands with, in your case, another man, and see how you are treated. Contrast that with how you are treated walking down the street holding hands with a woman.", 
   {}, 
   261278, 
   null, 
   1178121540.0
  ], 
  [
   261296, 
   null, 
   "peteratwar", 
   "You do not seem to recognize the reality that many people DO hate gay people, especially in the United States. I do not know if the same level of hatred exists in Britain. When I have spent time in Britain, my sense has been that gay people are treated a little better there, but of course I cannot tell by spending just a month there, especially in London, where people are probably more accepting than they are in the countryside. Anyhow, there are places in the United States where gay people are accepted, but there are many other places where gay people still risk being physically attacked and even murdered. Hate crimes against gay people are still a regular occurrence, and murders of gay people because of their sexual orientation still take place. I can name you plenty of tragic examples besides the famous murder of Matt Shepherd. A gay man was just murdered a few weeks ago in Washington, DC. \n \n While it's true that focusing on how much we are hated by some people is usually not all that useful, the sense of being hated is not simply imagined by gay people. The hatred is real. Try walking down the street holding hands with, in your case, another man, and see how you are treated. Contrast that with how you are treated walking down the street holding hands with a woman.\n\n \n \n I don't doubt that hatred exists - both ways. It is ultimately desctuctive. I guess things aren't so bad here in the UK but again I won't deny there are problems with some people often in certain ethnic areas.\n \n With your example I wouldn't say there is much hatred, there is possibly some distaste. This is more where people are being pushed in a direction which they may well accept but where some tact is more likely to win friends than not. Note by the way in Riyadh is was not uncommon for men to be walking along holding hands!! Not gay tho'!!\n \n But concerning marriage per se it has always been a matter for society as a whole with it always being held as between people of the opposite sex. Even some societies which tolerated/accepted or even expected homosexual liaisons, marriage was still between man and woman", 
   {}, 
   261292, 
   null, 
   1178122740.0
  ], 
  [
   261328, 
   null, 
   "Ohioprof", 
   "I don't doubt that hatred exists - both ways. It is ultimately desctuctive. I guess things aren't so bad here in the UK but again I won't deny there are problems with some people often in certain ethnic areas.\n \n With your example I wouldn't say there is much hatred, there is possibly some distaste. This is more where people are being pushed in a direction which they may well accept but where some tact is more likely to win friends than not. Note by the way in Riyadh is was not uncommon for men to be walking along holding hands!! Not gay tho'!!\n \n But concerning marriage per se it has always been a matter for society as a whole with it always being held as between people of the opposite sex. Even some societies which tolerated/accepted or even expected homosexual liaisons, marriage was still between man and woman\n\n \n As to whether there is hatred \"both ways,\" I can honestly say that I have never heard of any gay people who have tried to kill heterosexuals just because they are heterosexual, nor have I heard of any gay people who have sought to deny rights to heterosexuals. Perhaps there are some, but they are rare enough that I have never heard of them. Gay people do not murder heterosexuals for being heterosexual. Most heterosexuals do not murder gay people, but some do, and I can cite plenty of examples. Gay people do not beat up heterosexuals for being heterosexual. Most heterosexuals do not beat up gay people, but some so, and I can cite examples. I myself was beaten up some years ago after I walked out of a lesbian bar. I was attacked as I walked down the street, just because I had been in a lesbian bar. Fortunately, I was rescued by the police after a nearby resident phoned them. \n \n It really is not accurate or fair to say that there is hatred \"both ways.\" Gay people do not, except perhaps in rare instances, hate heterosexuals for being heterosexual. Gay people may hate those who practice oppression against them, but that's not the same as hating them for being heterosexual. In contrast, there are plenty of heterosexuals who hate gay people simply for being gay. Most do not, but there are still plenty who do. \n \n You suggest that walking down the street holding hands, gay people encounter \"distaste.\" Yeah, and we experience hatred too. Venomous hatred, and even threats and attacks, depending on where we happen to be. Try it. You don't know what it's like until you walk a mile in our shoes. Try living as an openly gay person for a year, and come back and tell us that we experience merely \"distaste.\" See what it feels like. See what it's really like, not just what you imagine it is like. \n \n I don't mean to sound confrontational here, but I am suggesting that you really don't know what gay people experience, and you really don't seem to grasp the level of fear that gay people have long had to live with. \n \n Marriage has always been regarded as heterosexual? My answer to that is, \"So what?\" Discrimination against unpopular minorities has existed for a long time. That is not a reason to continue the discrimination. We now have same-sex marriage in a number of countries, and it has had no negative impact on heterosexuals or on those societies. \n \n Is there any valid reason not to treat gay people as equals under the law? I can't think of any, and no one has presented any valid reasons. The only reason people seem able to muster is, \"We have never allowed that in the past,\" and \"We don't want to let gay people get married. The idea offends us.\" Those are not valid reasons to continue practicing discrimination, in my view.", 
   {}, 
   261296, 
   null, 
   1178132220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Anti-gay marriage", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9812-anti-gay-marriage.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9812, 
  "discussion_files": [
   [
    "951.html", 
    "http://www.4forums.com/political/gay-rights-debates/9812-anti-gay-marriage-print.html"
   ], 
   [
    "952.html", 
    "http://www.4forums.com/political/gay-rights-debates/9812-anti-gay-marriage-3-print.html"
   ], 
   [
    "953.html", 
    "http://www.4forums.com/political/gay-rights-debates/9812-anti-gay-marriage-2-print.html"
   ]
  ], 
  "identifier": 9812
 }
]