[
 [
  [
   260250, 
   null, 
   "Matthew S", 
   "I have a question for all those of you who are against same sex marriage. Now this takes some ability for inward perspective, a quality in short supply here sometimes.\n \n Here goes.\n \n Would you be happy to accept what you are asking gay people to accept? Would you want gay people to outlaw your marriages? Would you still support the majority decision if the majority of people were gay and it was heterosexual marriages that were being denied or banned outright? Would you accept civil unions even though they were less then marriage? Would you be happy or find it just that certain religious sects were fighting your civil rights?\n \n I know this is a futile attempt to try and get you all to think of life from a gay perspective.", 
   {
    "post_info": {
     "post_title": "To all the anti same sex marriage people."
    }
   }, 
   null, 
   null, 
   1177479480.0
  ], 
  [
   260316, 
   null, 
   "samiinh", 
   "I have a question for all those of you who are against same sex marriage. Now this takes some ability for inward perspective, a quality in short supply here sometimes.\n \n Here goes.\n \n Would you be happy to accept what you are asking gay people to accept? Would you want gay people to outlaw your marriages? Would you still support the majority decision if the majority of people were gay and it was heterosexual marriages that were being denied or banned outright? Would you accept civil unions even though they were less then marriage? Would you be happy or find it just that certain religious sects were fighting your civil rights?\n \n I know this is a futile attempt to try and get you all to think of life from a gay perspective.\n\n \n You know the answer, Matt. They'd never accept it.", 
   {}, 
   260250, 
   null, 
   1177508160.0
  ], 
  [
   260406, 
   null, 
   "Matthew S", 
   "You know the answer, Matt. They'd never accept it.\n\n \n I am not asking them to accept anything. I am asking them how they would feel it the world was the other way around and they were being treated the way they are treating gay people.", 
   {}, 
   260316, 
   null, 
   1177556460.0
  ], 
  [
   260423, 
   null, 
   "peteratwar", 
   "First the world isn't the other way around.\n \n The huge majority of people are heterosexual.\n \n Marriage since time immemorial has been about being between people of opposite genders\n \n If on the otherhand the vast majority were homosexual then we would probably have much the same as the homosexual population would have died out leaving the heterosexual community around", 
   {}, 
   260406, 
   null, 
   1177579200.0
  ], 
  [
   260430, 
   null, 
   "Matthew S", 
   "First the world isn't the other way around.\n \n The huge majority of people are heterosexual.\n \n Marriage since time immemorial has been about being between people of opposite genders\n \n If on the otherhand the vast majority were homosexual then we would probably have much the same as the homosexual population would have died out leaving the heterosexual community around\n\n \n This is not what I asked. I asked how would you feel if you were being treated the same way gay people are? Can you not answer the question? Or is it you know the way gay people are being treated is unjust and you don't want to admit it?", 
   {}, 
   260423, 
   null, 
   1177590840.0
  ], 
  [
   260434, 
   null, 
   "peteratwar", 
   "This is not what I asked. I asked how would you feel if you were being treated the same way gay people are? Can you not answer the question? Or is it you know the way gay people are being treated is unjust and you don't want to admit it?\n\n \n \n No it isn't unjust. Marriage has been between people of opposite gender. Them's the rules of the game. Doesn't make it unjust.", 
   {}, 
   260430, 
   null, 
   1177594200.0
  ], 
  [
   260450, 
   null, 
   "jitobear", 
   "No it isn't unjust. Marriage has been between people of opposite gender. Them's the rules of the game. Doesn't make it unjust.\n\n \n You did not answer his question.", 
   {}, 
   260434, 
   null, 
   1177611780.0
  ], 
  [
   260451, 
   null, 
   "E Mutz", 
   "The Question is: \"How would I feel\"\n \n Honestly, I would feel upset that I did not get something I wanted. I was dissapointed when I didn't get a pony for my birthday. My seven year old knows the feeling quite well. The feeling by itself does not imply injustice. There may be injustice at work here, but feelings....nothing more than feelings.... are a poor means of judging.\n \n I will feel upset if the Red Wings do not win the Stanley Cup. That does not mean that San Jose is evil or injust if they beat them in the play offs. \n \n I feel disappointed that I am not eligible for a scholarship to a women only school or a grant from the Rainbow Push Coalition. My inability to benefit from these does not imply sexism or racism...or does it... \n \n The mind boggles, the forehead knits...", 
   {}, 
   260450, 
   null, 
   1177613160.0
  ], 
  [
   260454, 
   null, 
   "jim's trucking", 
   "I have a question for all those of you who are against same sex marriage.\nApparently, you have five questions.\n \n \n Now this takes some ability for inward perspective, a quality in short supply here sometimes.\nIf by 'ability for inward perspective' you imply the ability to look at one's self, it is incongruent to say you are leary of our ability 'to think of life from a gay perspective'. What you are asking is for people to see your troubles from your perspective...hardly possible for many.\n \n \n\n Here goes.\n \n Would you be happy to accept what you are asking gay people to accept?\nYes. Were I a logical gay man, I would accept the fact that I cannot marry a man due to the definition of marriage. I would accept that fact and continue to demand that all legally joined couples share the same benefits now given to married couples.\n \n \n Would you want gay people to outlaw your marriages? \nOf course not.\n \n \nWould you still support the majority decision if the majority of people were gay and it was heterosexual marriages that were being denied or banned outright?\nThat is a hypothetical question. That scenario is virtually impossible unless you contend that being gay is a choice and somehow the vast majority of men chose to be gay. In your wildest dream, if this should happen, I suppose there'd be a civil uprising followed by the secession of several states to form at least two countries. While the hetero country would grow, the gay country would die out and we'd move back in a take over all your stuff.\n \n \n Would you accept civil unions even though they were less then marriage?\nNo...and you don't have to either.\n \n \n Would you be happy or find it just that certain religious sects were fighting your civil rights?\nReligious sects have the right to believe in and oppose whatever they choose as long as they stay within the law. It makes me neither happy nor comfortable to know what they fight against. I consider them wrong...but rightfully so. The Phelps Church is despicable yet has the right to protest whatever they please. We have a right to ignore them. You have a right to ignore any and all religious sects.\n \n The Radical Muslims have a right to believe their's is the only way but they do not have the right to kill people who disagree. Freedom of speech is a precious thing we have.\n \n Whatever religious sect it is that makes your jaws tight has a right to verbalize and broadcast their condemnation of homosexuality just as you have a right to condemn heterosexuality. They have a right to consider you the scum of the earth just as you have the same right toward them.\n \n It would not make me happy to know that any group opposes my having rights. However, they have the right to oppose any idea that exists.\n \n The justness of their efforts is relative. To them it is just. To you it is unjust. To me, while it would remain unjust to continue denying rights to gay couples, it is equally unjust to deny any group their right to vocalize and oppose whatever they do.\n \n \n \n\n I know this is a futile attempt to try and get you all to think of life from a gay perspective.\nDefeatist attitude...but spot on. I contend it is virtually impossible for a heterosexual to imagine life from a gay perspective...just as it is impossible for a man to understand birth pains and menopause.\n \n Looking inward, I see myself as compassionate, believing in equal rights for all people and dedicated to leaving people to their own beliefs as long as they do not interfere with my life. If I can obtain the same rights as others without harming them, I'm okay with it.", 
   {}, 
   260250, 
   null, 
   1177616700.0
  ], 
  [
   260456, 
   null, 
   "Zardoz", 
   "I have a question for all those of you who are against same sex marriage. Now this takes some ability for inward perspective, a quality in short supply here sometimes.\n \n Here goes.\n \n Would you be happy to accept what you are asking gay people to accept? Would you want gay people to outlaw your marriages? Would you still support the majority decision if the majority of people were gay and it was heterosexual marriages that were being denied or banned outright? Would you accept civil unions even though they were less then marriage? Would you be happy or find it just that certain religious sects were fighting your civil rights?\n \n I know this is a futile attempt to try and get you all to think of life from a gay perspective.\n\n \n I do not believe that one segment should be treated differently in terms of actual rights in the US.\n \n I personally think the gov't should get out of the business of marriage and institute civil unions defining and protecting rights for all parties involved provided they are able to give legal consent to enter the union.\n Religions and other institutions can be in charge of marriage, that would automatically qualify as civil unions for gov't protections.\n \n All this said, while I've been married for about 14 years (most of them Jerry Springer levels of chaos), I ONLY married legally for ease in adoption and protection of civil rights. I wanted a legal say in matters.\n I didn't even have a wedding. I performed an exchange of vows with the wife. When I needed it legal, I went to the court house, got the papers and had my pagan priestess friend sign them...a customer in her store was the witness. I tipped her $20 for her troubles.\n \n IMO, you can call anyone your spouse, mate, partner, wife or husband. Screw others opinions. Not everyone's going to like your choices.\n \n What you NEED is equal protections and rights. For example, your partner choses you to have a say in his medical cares rather than have his estranged parents come in and do it. You need rights established in the raising of children of your mate if something happens to them.\n That sort of thing.\n \n As I said, I've had plenty of Jerry Springer moments and I loved knowing that My rights are protected and the law is on my side when needed.", 
   {}, 
   260250, 
   null, 
   1177617180.0
  ], 
  [
   260489, 
   null, 
   "Matthew S", 
   "No it isn't unjust. Marriage has been between people of opposite gender. Them's the rules of the game. Doesn't make it unjust.\n\n \n Still not what I asked you. I asked you if you would like to be treated the way gay people are treated? Can you not answer a simple question?", 
   {}, 
   260434, 
   null, 
   1177634760.0
  ], 
  [
   260491, 
   null, 
   "Steeeeve", 
   "I have a question for all those of you who are against same sex marriage. Now this takes some ability for inward perspective, a quality in short supply here sometimes.\n \n Here goes.\n \n Would you be happy to accept what you are asking gay people to accept? Would you want gay people to outlaw your marriages? Would you still support the majority decision if the majority of people were gay and it was heterosexual marriages that were being denied or banned outright? Would you accept civil unions even though they were less then marriage? Would you be happy or find it just that certain religious sects were fighting your civil rights?\n \n I know this is a futile attempt to try and get you all to think of life from a gay perspective.\n\n \n I'll answer the questions in the way they are asked:\n 1) Not sure what you mean\n 2) No\n 3) Wouldn't I have to? I'd accept it as a legitimate law (if that is what you mean) but I certainly wouldn't stop trying to get that law changed by the proper means.\n 4) Not sure..probably depends but benefits don't mean much to me\n 5) Another odd question but assuming it was some made up religion then the answer would be no...i would not be happy\n \n Not sure what this proves other than a disagreement.", 
   {}, 
   260250, 
   null, 
   1177635240.0
  ], 
  [
   260511, 
   null, 
   "AntDogg", 
   "First the world isn't the other way around.\n \n The huge majority of people are heterosexual.\n \n Marriage since time immemorial has been about being between people of opposite genders\n \n If on the otherhand the vast majority were homosexual then we would probably have much the same as the homosexual population would have died out leaving the heterosexual community around\n\n \n He's asking you to think outside the closed-minded conservative Christian box for a second. Is it really that hard?", 
   {}, 
   260423, 
   null, 
   1177644960.0
  ], 
  [
   260516, 
   null, 
   "thelmoose", 
   "First the world isn't the other way around.\n \n The huge majority of people are heterosexual.\n \n Marriage since time immemorial has been about being between people of opposite genders\n \n If on the otherhand the vast majority were homosexual then we would probably have much the same as the homosexual population would have died out leaving the heterosexual community around\n\n \n How can we know anything about that which extends back beyond memory, ie, immemorial?", 
   {}, 
   260423, 
   null, 
   1177645500.0
  ], 
  [
   260525, 
   null, 
   "JakeCJB", 
   "No it isn't unjust. Marriage has been between people of opposite gender. Them's the rules of the game. Doesn't make it unjust.\n\n \n The fact that something is a rule or a tradition does not make it just.", 
   {}, 
   260434, 
   null, 
   1177649640.0
  ], 
  [
   260526, 
   null, 
   "JakeCJB", 
   "Apparently, you have five questions.\n \n If by 'ability for inward perspective' you imply the ability to look at one's self, it is incongruent to say you are leary of our ability 'to think of life from a gay perspective'. What you are asking is for people to see your troubles from your perspective...hardly possible for many.\n \n Yes. Were I a logical gay man, I would accept the fact that I cannot marry a man due to the definition of marriage. I would accept that fact and continue to demand that all legally joined couples share the same benefits now given to married couples.\n\n \n You say you cannot see it from the gay perspective, then you speak from that perspective as a gay man. This is confusing. As a heterosexual, if you are one, would you give up those rights and let gays have the rights?\n \n \nThat is a hypothetical question. That scenario is virtually impossible unless you contend that being gay is a choice and somehow the vast majority of men chose to be gay. In your wildest dream, if this should happen, I suppose there'd be a civil uprising followed by the secession of several states to form at least two countries. While the hetero country would grow, the gay country would die out and we'd move back in a take over all your stuff.\n\n \n There would be more immigration as the straight people see how superior the gay country is in every possible way(tongue-in cheek). Gays can and do also reproduce, as heterosexual identity is not required for different sex sexual actions or reproduction.", 
   {}, 
   260454, 
   null, 
   1177650720.0
  ], 
  [
   260552, 
   null, 
   "peteratwar", 
   "The fact that something is a rule or a tradition does not make it just.\n\n \n Just or unjust is irrelevent unless you can prove there has been or is an injustice.\n \n To do that please prove homosexual people have a right to marriage. Marriage is based on the conception of parties being of opposite gender if not please prove otherwise.", 
   {}, 
   260525, 
   null, 
   1177675500.0
  ], 
  [
   260562, 
   null, 
   "JakeCJB", 
   "Just or unjust is irrelevent unless you can prove there has been or is an injustice.\n\n \n The onus of proof is on those wishing to exclude or discriminate make unequal or limit rights and freedoms, that is, if your society stands for rights and freedoms. Anything other than that, is then an injustice. Imagine if women had to prove their right to vote. \n \n \nMarriage is based on the conception of parties being of opposite gender if not please prove otherwise.\n\n \n This is not true everywhere. This is the same circular debate, stating that marriage simply is heterosexual. It avoids the question, and takes us right back where we started.", 
   {}, 
   260552, 
   null, 
   1177685280.0
  ], 
  [
   260577, 
   null, 
   "jyoshu", 
   "The onus of proof is on those wishing to exclude or discriminate make unequal or limit rights and freedoms, that is, if your society stands for rights and freedoms. Anything other than that, is then an injustice. Imagine if women had to prove their right to vote. \n\n \n But in point of fact, they did. Today, women having the right to vote is specifically spelled out in a specific amendment in the constitution (the 19th). Before that amendment was put in place, women suffrage groups certainly DID go through a process of proving and convincing society of their argument. The issue of gay marriage (assuming your take on things is legit) is still in that earlier phase. It too involves the changing of the norms of society to see change inacted, and there is no amendment in place that specifies gays can have legal marriage benefits for same-sex unions. So in that sense, the onus is rather on gay rights groups. (Of course that all assumes that the comparison between gay marriage and women's suffrage is even legitimate in the first place.) I believe that is what is usually meant when people say the burden of proof is on you. It is just the reality of the situation.", 
   {}, 
   260562, 
   null, 
   1177691820.0
  ], 
  [
   260583, 
   null, 
   "davenport15", 
   " It too involves the changing of the norms of society to see change inacted, and there is no amendment in place that specifies gays can have legal marriage benefits for same-sex unions. So in that sense, the onus is rather on gay rights groups. (Of course that all assumes that the comparison between gay marriage and women's suffrage is even legitimate in the first place.) I believe that is what is usually meant when people say the burden of proof is on you. It is just the reality of the situation.\n\n \n I'll give you that. Except: same sex marriages do exist, as sanctioned by one state, several U.S. religions, and in the hearts of many gay people. And for some reason, we have a whole group of Republicans who want to amend the constitution to forbid same sex marriage. Why should they feel the need to do this if same sex marriages aren't already an inalienable right?", 
   {}, 
   260577, 
   null, 
   1177693860.0
  ], 
  [
   260601, 
   null, 
   "jyoshu", 
   "I'll give you that. Except: same sex marriages do exist, as sanctioned by one state, several U.S. religions, and in the hearts of many gay people. And for some reason, we have a whole group of Republicans who want to amend the constitution to forbid same sex marriage. Why should they feel the need to do this if same sex marriages aren't already an inalienable right?\n\n \n Well, I won't argue there. I think the idea of such an amendment is bad.", 
   {}, 
   260583, 
   null, 
   1177700100.0
  ], 
  [
   260641, 
   null, 
   "jitobear", 
   "Before that amendment was put in place, women suffrage groups certainly DID go through a process of proving and convincing society of their argument. \n\n \n And this is acceptable to you? That white, wealthy, men have always had every right and priveledge afforded to them and it is up to everyone else to prove they should have them, too?", 
   {}, 
   260577, 
   null, 
   1177727040.0
  ], 
  [
   260642, 
   null, 
   "Zardoz", 
   "And this is acceptable to you? That white, wealthy, men have always had every right and priveledge afforded to them and it is up to everyone else to prove they should have them, too?\n\n \n Oh come now boobear, you know white men spent countless centuries amassing all their power, destroying or subjugating everything in sight.\n \n If you an't do the same, you have to infiltrate and undermine their authority.\n \n Many slyly thought they could still bend the blacks to their rule and cajole votes from them (some still do, we calls em democrats) but, like the cunning humans they are, they slowly fought for their power until by clever use of the jungle beat music, they undermined a generation of wayward youth and made their stand.\n \n All women had to do with nag and cut the sex off for a few years.\n \n I'm not sure what the gays will have to do...maybe stand on the backs of the other 2 groups and say 'We're jus' likes them there! Gibus ours rights!' Well, with more lisping and a higher fashion sense.", 
   {}, 
   260641, 
   null, 
   1177728960.0
  ], 
  [
   260677, 
   null, 
   "jitobear", 
   "Oh come now boobear, you know white men spent countless centuries amassing all their power, destroying or subjugating everything in sight.\n \n If you an't do the same, you have to infiltrate and undermine their authority.\n \n Many slyly thought they could still bend the blacks to their rule and cajole votes from them (some still do, we calls em democrats) but, like the cunning humans they are, they slowly fought for their power until by clever use of the jungle beat music, they undermined a generation of wayward youth and made their stand.\n \n All women had to do with nag and cut the sex off for a few years.\n \n I'm not sure what the gays will have to do...maybe stand on the backs of the other 2 groups and say 'We're jus' likes them there! Gibus ours rights!' Well, with more lisping and a higher fashion sense.\n\n \n \n Innapropriate, insensitive, yet....funny....", 
   {}, 
   260642, 
   null, 
   1177773360.0
  ], 
  [
   260912, 
   null, 
   "peteratwar", 
   "The onus of proof is on those wishing to exclude or discriminate make unequal or limit rights and freedoms, that is, if your society stands for rights and freedoms. Anything other than that, is then an injustice. Imagine if women had to prove their right to vote. \n \n \n \n This is not true everywhere. This is the same circular debate, stating that marriage simply is heterosexual. It avoids the question, and takes us right back where we started.\n\n \n You have not answered why or given any indication that homosexuals have the right to marriage. If they have then we can discuss injustice.\n \n Apart from an obscure Bhuddist sect and MAYBE some early primitive societies (although that is doubtful) Marriage is based on opposite genders. Unfortunately for you that is the question.", 
   {}, 
   260562, 
   null, 
   1177924920.0
  ], 
  [
   260918, 
   null, 
   "Matthew S", 
   "You have not answered why or given any indication that homosexuals have the right to marriage. If they have then we can discuss injustice.\n \n Apart from an obscure Bhuddist sect and MAYBE some early primitive societies (although that is doubtful) Marriage is based on opposite genders. Unfortunately for you that is the question.\n\n \n And you have not yet answer the OP of this thread. I am waiting for an answer.", 
   {}, 
   260912, 
   null, 
   1177929420.0
  ], 
  [
   260921, 
   null, 
   "peteratwar", 
   "And you have not yet answer the OP of this thread. I am waiting for an answer.\n\n \n If you want an answer to a hypothetical question, I can give you one. However, in order to give you a reply I have to be convinced that you are being denied rights which you claim are yours and how would we feel if similarly treated.\n \n What RIGHTS are you being denied ?", 
   {}, 
   260918, 
   null, 
   1177933200.0
  ], 
  [
   260924, 
   null, 
   "Ohioprof", 
   "No it isn't unjust. Marriage has been between people of opposite gender. Them's the rules of the game. Doesn't make it unjust.\n\n \n The \"rules of the game\" used to be that marriage was limited in most states to people of the same race. Were those \"rules of the game\" not unjust either? The \"rules of the game\" used to be that women could not vote. Were those \"rules of the game\" not unjust either? \n \n Just because something IS doesn't mean it is just. Your argument seems to be that if something IS, we should never change it, that we should not even consider whether or not to change it. In this case, we proponents of marriage equality are not arguing to take away opposite-sex marriage or to do any harm at all to opposite-sex marriage. We are not arguing to change marriage, just to include more committed couples within the institution of civil marriage, for the well-being of our children and our families. And yes, many of us do have children. I will need to awaken my child soon to get her ready for pre-school.", 
   {}, 
   260434, 
   null, 
   1177937160.0
  ], 
  [
   260925, 
   null, 
   "Ohioprof", 
   "If you want an answer to a hypothetical question, I can give you one. However, in order to give you a reply I have to be convinced that you are being denied rights which you claim are yours and how would we feel if similarly treated.\n \n What RIGHTS are you being denied ?\n\n \n I am denied the right to marry legally my committed partner in order to provide my family, including my child, with the protections that families with heterosexual spouses have through legal civil marriage.", 
   {}, 
   260921, 
   null, 
   1177937220.0
  ], 
  [
   260926, 
   null, 
   "Ohioprof", 
   "You have not answered why or given any indication that homosexuals have the right to marriage. If they have then we can discuss injustice.\n \n Apart from an obscure Bhuddist sect and MAYBE some early primitive societies (although that is doubtful) Marriage is based on opposite genders. Unfortunately for you that is the question.\n\n \n In most societies until relatively recently, women did not have equal rights, or anything close to equal rights. By your reasoning, that should be grounds for continuing to deny women equal rights. Your argument is, in essence, this is how it has always been, so we should just keep it that way and never scrutinize whether the way it has always been is just for everyone or not. \n \n But we know that some social practices and institutions have been unjust in the past, and we have changed our social practices and institutions to benefit people. That's at the heart of the American republican experiment, a belief in the principles, radical in 1776, that all are created equal and are endowed with unalienable rights. The Declaration does not say that all are created equal except for gay people. \n \n We should ask whether excluding gay people from legal civil marriage benefits society and the individuals in society or whether it does harm to society and to individuals. If you ask that question, the answer is clear. Excluding gay people from legal civil marriage harms children and families as well as individuals, by undermining the efforts of couples to form stable, legally recognized families. The result is that excluding gay people from legal civil marriage harms the whole society. To include gay people within legal civil marriage will benefit the whole society, by encouraging family formation and providing protections for children and spouses.", 
   {}, 
   260912, 
   null, 
   1177937760.0
  ], 
  [
   260930, 
   null, 
   "jitobear", 
   "It seems to me that Peteratwar does believe that it is acceptable that white, wealthy, men have always had every right and priveledge afforded to them and it is up to everyone else to prove they should have those rights, too", 
   {}, 
   260926, 
   null, 
   1177942380.0
  ], 
  [
   260936, 
   null, 
   "peteratwar", 
   "In most societies until relatively recently, women did not have equal rights, or anything close to equal rights. By your reasoning, that should be grounds for continuing to deny women equal rights. Your argument is, in essence, this is how it has always been, so we should just keep it that way and never scrutinize whether the way it has always been is just for everyone or not. \n \n But we know that some social practices and institutions have been unjust in the past, and we have changed our social practices and institutions to benefit people. That's at the heart of the American republican experiment, a belief in the principles, radical in 1776, that all are created equal and are endowed with unalienable rights. The Declaration does not say that all are created equal except for gay people. \n \n We should ask whether excluding gay people from legal civil marriage benefits society and the individuals in society or whether it does harm to society and to individuals. If you ask that question, the answer is clear. Excluding gay people from legal civil marriage harms children and families as well as individuals, by undermining the efforts of couples to form stable, legally recognized families. The result is that excluding gay people from legal civil marriage harms the whole society. To include gay people within legal civil marriage will benefit the whole society, by encouraging family formation and providing protections for children and spouses.\n\n \n \n You still need to define marriage before any of the above holds water.\n \n If the concept of marriage is defined to include people of the same sex, then their rights are automatically there. If it isn't then no such right exists. No right no claim for unjustness.\n \n Ultimately even if you don't like the idea, Society defines how it wants to be, laws are put in place etc etc. Rights are defined. They are not absolute nor are they ever inalienable otherwise everything would merely stagnate. Equally they aren't changed on a whim.\n \n If you can convince people that homosexuals have a case for changing the concept of marriage to include themselves then that will be a step forward", 
   {}, 
   260926, 
   null, 
   1177944300.0
  ], 
  [
   260950, 
   null, 
   "jim's trucking", 
   "You say you cannot see it from the gay perspective, then you speak from that perspective as a gay man. This is confusing. As a heterosexual, if you are one, would you give up those rights and let gays have the rights?\nRead again. I was not speaking from a gay perspective..just a logical one. I said \"Were I a logical gay man...\"\n \n While is it virtually impossible for me to view life from the gay perspective, it is not impossible to imagine what logic should be like in the gay community. Logic transcends all groupings.\n \n \n \nThere would be more immigration as the straight people see how superior the gay country is in every possible way(tongue-in cheek). Gays can and do also reproduce, as heterosexual identity is not required for different sex sexual actions or reproduction.\nYeah...right!\n \n I don't want to get into the circular argument again about the pros and cons of gay marriage. I've answered his five questions. You can take issues with my answers if you like.", 
   {}, 
   260526, 
   null, 
   1177948980.0
  ], 
  [
   260990, 
   null, 
   "Ohioprof", 
   "You still need to define marriage before any of the above holds water.\n \n If the concept of marriage is defined to include people of the same sex, then their rights are automatically there. If it isn't then no such right exists. No right no claim for unjustness.\n \n Ultimately even if you don't like the idea, Society defines how it wants to be, laws are put in place etc etc. Rights are defined. They are not absolute nor are they ever inalienable otherwise everything would merely stagnate. Equally they aren't changed on a whim.\n \n If you can convince people that homosexuals have a case for changing the concept of marriage to include themselves then that will be a step forward\n\n \n I am talking about legal civil marriage. I don't know that this needs more definition. \n \n The problem with saying that a right exists only if it is codified specifically in law is that the Supreme Court has on numerous occasions struck down laws that the Court says violate people's rights. The Court has struck down such laws because they violate rights protected by the constitution. State supreme courts have done likewise on the basis of state constitutions. Now, reasonable people can disagree with what rights are or ought to be protected by the U.S. constitution or by state constitutions, since not all rights are enumerated in those documents. The U.S. Supreme Court has issued a variety of rulings on what rights the constitution protects. The Court has ruled that marriage is a fundamental right protected by the U.S. constitution, even though the constitution makes no mention of marriage. \n \n Are rights absolute? Not according to the U.S. Supreme Court, which often balances consideration of the rights of individuals versus the interests of states or the federal government to pass laws that serve to protect or benefit society by limiting individual rights. So legally, anyway, rights are not absolute. States and the federal government can make the case that they have an interest in restricting certain rights, for various reasons. And I agree with you that laws should not be changed on a whim. The argument for same-sex marriage is not whimsical, and our arguments are based on what will benefit society. Legalizing same-sex marriage will enhance family stability and provide greater protections for more children, specificaly the children of gay parents. That's a benefit both to our individual children and to society as a whole. \n \n As for whether we are convincing people that we have a right to marry our spouses legally, I think we are doing that. The percentage of people who say in polls that they favor equal marriage rights for same-sex couples has grown pretty steadily over the past few decades. So I think we are succeeding, gradually, in convincing people.", 
   {}, 
   260936, 
   null, 
   1177962900.0
  ], 
  [
   260991, 
   null, 
   "Ohioprof", 
   "But in point of fact, they did. Today, women having the right to vote is specifically spelled out in a specific amendment in the constitution (the 19th). Before that amendment was put in place, women suffrage groups certainly DID go through a process of proving and convincing society of their argument. The issue of gay marriage (assuming your take on things is legit) is still in that earlier phase. It too involves the changing of the norms of society to see change inacted, and there is no amendment in place that specifies gays can have legal marriage benefits for same-sex unions. So in that sense, the onus is rather on gay rights groups. (Of course that all assumes that the comparison between gay marriage and women's suffrage is even legitimate in the first place.) I believe that is what is usually meant when people say the burden of proof is on you. It is just the reality of the situation.\n\n \n Not all rights wind up being guaranteed specifically by a constitutional amendment. For example, the laws that made inter-racial marriage illegal were not overturned by constitutional amendment; they were struck down because of a Supreme Court ruling that such laws violated the 14th amendment. In the 19th century, women's rights groups brought a lawsuit to the Supreme Court in which they argued that women's right to vote was protected by the 14th amendment, and that the laws barring women from voting were therefore unconstitutional. The Supreme Court at that time ruled against them and said that there is no right to vote that is guaranteed by the U.S. constitution, and who can vote is up to the states. So they had to push either state by state for the right to vote or to push for a federal constitutional amendment to guarantee women the right to vote. Women's suffrage activists wound up doing both; they waged voting rights campaigns in individual states that very slowly and gradually succeeded around the nation, and they simultaneously worked for passage of the Susan B. Anthony amendment, which guaranteed women the right to vote nationwide. \n \n More recently the U.S. Supreme Court has ruled that voting is a fundamental right protected by the U.S. constitution, and I suspect that, if we had no Amendment 19 in place to guarantee women the right to vote, the Supreme Court would rule that the 14th amendment guarantees this right. But that won't ever come up before the Supreme Court, because it isn't necessary. \n \n Yes, it did take a long campaign by women to change popular attitudes about woman's place in order to win the vote for women. Gay people have also had to wage a campaign to change popular attitudes. This is true whether the campaign is to change laws or to win favorable court rulings. For example, the Supreme Court majority acknowledged that attitudes had changed toward gay people from the time of the ruling in Bowers v. Hardwick to the time of the ruling in Lawrence v. Texas. Court rulings do, to some extent, reflect popular attitudes of the day, but not to the degree (we hope) that popular voting does.", 
   {}, 
   260577, 
   null, 
   1177963800.0
  ], 
  [
   261033, 
   null, 
   "JakeCJB", 
   "Apart from an obscure Bhuddist sect and MAYBE some early primitive societies (although that is doubtful) Marriage is based on opposite genders. Unfortunately for you that is the question.\n\n \n Marriage includes same-sex couples in Canada, Netherlands, Belgium, Spain, and South Africa.", 
   {}, 
   260912, 
   null, 
   1177973160.0
  ], 
  [
   261034, 
   null, 
   "JakeCJB", 
   "Read again. I was not speaking from a gay perspective..just a logical one. I said \"Were I a logical gay man...\"\n \n While is it virtually impossible for me to view life from the gay perspective, it is not impossible to imagine what logic should be like in the gay community. Logic transcends all groupings.\n\n \n It's logical that humans, being very social, wish to be included where ever that is possible, barring a logical reason for exclusion.", 
   {}, 
   260950, 
   null, 
   1177973580.0
  ], 
  [
   261036, 
   null, 
   "Matthew S", 
   "If you want an answer to a hypothetical question, I can give you one. However, in order to give you a reply I have to be convinced that you are being denied rights which you claim are yours and how would we feel if similarly treated.\n \n What RIGHTS are you being denied ?\n\n \n Why can't you simply answer the question?\n Would you be happy to accept what you are asking gay people to accept? Would you want gay people to outlaw your marriages? Would you still support the majority decision if the majority of people were gay and it was heterosexual marriages that were being denied or banned outright? Would you accept civil unions even though they were less then marriage? Would you be happy or find it just that certain religious sects were fighting your civil rights?\n \n Can you tell us how you would feel if you were being denied the right to marry the one you love because some one you don't know has some out dated evil religious belief.\n \n Do you not have feelings, or emotions. Jims trucking, steeeeve, and Jyoshu have no problem answering the question. The three of them say they would not be happy being treated the way gay people are being treated.", 
   {}, 
   260921, 
   null, 
   1177975080.0
  ], 
  [
   261039, 
   null, 
   "jyoshu", 
   "In the 19th century, women's rights groups brought a lawsuit to the Supreme Court in which they argued that women's right to vote was protected by the 14th amendment, and that the laws barring women from voting were therefore unconstitutional. The Supreme Court at that time ruled against them and said that there is no right to vote that is guaranteed by the U.S. constitution, and who can vote is up to the states. So they had to push either state by state for the right to vote or to push for a federal constitutional amendment to guarantee women the right to vote. Women's suffrage activists wound up doing both; they waged voting rights campaigns in individual states that very slowly and gradually succeeded around the nation, and they simultaneously worked for passage of the Susan B. Anthony amendment, which guaranteed women the right to vote nationwide. \n \n More recently the U.S. Supreme Court has ruled that voting is a fundamental right protected by the U.S. constitution, and I suspect that, if we had no Amendment 19 in place to guarantee women the right to vote, the Supreme Court would rule that the 14th amendment guarantees this right. But that won't ever come up before the Supreme Court, because it isn't necessary.\n\n \n Yes, and this fact that SCOTUS ruled two different ways with the 14th amendment only goes to show that the 14th is not invokable by default. If the 14th had guaranteed it, then the 19th amendment wouldn't have been crafted in the first place. It shows that the real problem is that successfully trying to fit current issues into previous amendments that don't specify those issues (and prob. never intended them) is a relatively recent (in the scope of all U.S. history), and reckless, trend toward carrying out constitutional democracy. The 14th Amendment is not an amendment-to-end-all-amendments. It is not a constitution in and of itself. It was written specifically to address slaves having rights, but was written in rather broad language. But it is safe to say that the crafters of the 14th amendment in 1868 did not intend for it to be used to broaden marriage for whatever group and arrangement that comes along. It's just not that simple. And per your examples, we must also remember that just because SCOTUS used it to rule in the interracial marriage case does not mean they would do so in any other case. Everything has to be decided on it's own merit, including gay rights issues.\n \n \nYes, it did take a long campaign by women to change popular attitudes about woman's place in order to win the vote for women. Gay people have also had to wage a campaign to change popular attitudes. This is true whether the campaign is to change laws or to win favorable court rulings.\n\n \n This is exactly my point. The campaign is part of the process, and like it or not, the onus has fallen on gay rights people to do that, simply because they feel there is the need. Society isn't likely to make these changes on it's own, with no prodding, so the onus falls on the gay pride movement to convince and prove, simply by default. The court of public opinion can't be ignored.", 
   {}, 
   260991, 
   null, 
   1177976040.0
  ], 
  [
   261053, 
   null, 
   "Ohioprof", 
   "Yes, and this fact that SCOTUS ruled two different ways with the 14th amendment only goes to show that the 14th is not invokable by default. If the 14th had guaranteed it, then the 19th amendment wouldn't have been crafted in the first place. It shows that the real problem is that successfully trying to fit current issues into previous amendments that don't specify those issues (and prob. never intended them) is a relatively recent (in the scope of all U.S. history), and reckless, trend toward carrying out constitutional democracy. The 14th Amendment is not an amendment-to-end-all-amendments. It is not a constitution in and of itself. It was written specifically to address slaves having rights, but was written in rather broad language. But it is safe to say that the crafters of the 14th amendment in 1868 did not intend for it to be used to broaden marriage for whatever group and arrangement that comes along. It's just not that simple. And per your examples, we must also remember that just because SCOTUS used it to rule in the interracial marriage case does not mean they would do so in any other case. Everything has to be decided on it's own merit, including gay rights issues.\n \n \n \n This is exactly my point. The campaign is part of the process, and like it or not, the onus has fallen on gay rights people to do that, simply because they feel there is the need. Society isn't likely to make these changes on it's own, with no prodding, so the onus falls on the gay pride movement to convince and prove, simply by default. The court of public opinion can't be ignored.\n\n \n Yes, everything has to be decided on its own merits, including gay rights issues. I agree with that. It's also true that the fourteenth amendment WAS written in broad language, to prevent states from denying rights to \"persons,\" not just to freed slaves. The Supreme Court has been ruling on what those rights are, and who should be included in the category of \"persons\" since the 19th century, shortly after the 14th amendment was ratified. This is not something new, as you suggest. Beginning in the late 19th century, the Supreme Court began treating business corporations as \"persons\" protected by the 14th amendment. In the famous case of Lochner v. New York, for example, in 1905, the Supreme Court ruled that states could not regulate business corporations for the protection of workers; this, the Court said, violated the rights of business corporations and ran afoul of the due process clause of the 14th amendment. Fortunately for all of us, the Supreme Court no longer interprets the constitution in precisely this way, and states can regulate business corporations today. \n \n Is it a threat to our constitutional republic to have the Supreme Court rule on the meaning of the 14th amendment and on what rights and which people the amendment protects? I don't think so, much as I dislike the ruling by the Supreme Court in Lochner v. New York. I may disagree with how any particular Supreme Court interprets the 14th amendment, but I still think that is an appropriate role for the Supreme Court: to interpret what the law is, what the constitution means. \n \n In 1996, the Supreme Court ruled in the case of Romer v. Evans that the 14th amendment protects gay people from state actions that deny us the equal protection of the laws. This is only right, of course. We are persons no less than anyone else. \n \n Does the 14th amendment automatically eliminate every form of discrimination against everyone? No, certainly not. As I mentioned earlier, the Supreme Court regularly seeks to balance the public interest, the interest of the states in protecting the public, against the rights that are being denied to individuals. And you are right that each issue must be considered on its own merits. That's why those who argue that legalizing gay marriage will necessarily lead to polygamy being legalized are wrong. Polygamy has to be considered on its own merits also. But the arguments in one type of marriage case can certainly be considered in another type of marriage case. \n \n And yes, public opinion cannot be ignored. We are not ignoring it. We are seeking to influence public opinion and to change it.", 
   {}, 
   261039, 
   null, 
   1177982880.0
  ], 
  [
   261070, 
   null, 
   "jyoshu", 
   "Yes, everything has to be decided on its own merits, including gay rights issues. I agree with that. It's also true that the fourteenth amendment WAS written in broad language, to prevent states from denying rights to \"persons,\" not just to freed slaves. The Supreme Court has been ruling on what those rights are, and who should be included in the category of \"persons\" since the 19th century, shortly after the 14th amendment was ratified. This is not something new, as you suggest. Beginning in the late 19th century, the Supreme Court began treating business corporations as \"persons\" protected by the 14th amendment. In the famous case of Lochner v. New York, for example, in 1905, the Supreme Court ruled that states could not regulate business corporations for the protection of workers; this, the Court said, violated the rights of business corporations and ran afoul of the due process clause of the 14th amendment. Fortunately for all of us, the Supreme Court no longer interprets the constitution in precisely this way, and states can regulate business corporations today.\n\n \n Yes, but the fact that it has even been applied to businesses aptly demonstrates the problems with the 14th. I'd argue that to apply to it marriage, even gay marriage or even interracial marriage is not unlike such a liberal interpretation as applying it to something such as a corporation. That's not to say, of course, that interracial marriage should be illegal. But just as in your example of states (today) regulating corporations, states regulate marriage as well, and yet you seem to have no problem with the federal govt. stepping in when it comes to marriage. Applying the 14th to gay marriage or corporations are both (IMO) consistent with applying it to whatever, rather than for what it was originally intended for (protection of ex-slaves).\n \n \nIs it a threat to our constitutional republic to have the Supreme Court rule on the meaning of the 14th amendment and on what rights and which people the amendment protects?\n\n \n No, I agree the SCOTUS is doing it's job. I'm not saying SCOTUS shouldn't rule; I agree with you here.\n \n \nDoes the 14th amendment automatically eliminate every form of discrimination against everyone?\n\n \n No, but I think your view of it--applying it to things like same-sex marriage--seems to treat it as though it does. The use of it for the gay marriage issue is no less arbitrary than \"every form\" of discrimination there could be. So your use of it seems to attempt to use it as a catch-all amendment; the amendment-to-end-all-amendments, so to speak.", 
   {}, 
   261053, 
   null, 
   1177993440.0
  ], 
  [
   261087, 
   null, 
   "Ohioprof", 
   "Yes, but the fact that it has even been applied to businesses aptly demonstrates the problems with the 14th. I'd argue that to apply to it marriage, even gay marriage or even interracial marriage is not unlike such a liberal interpretation as applying it to something such as a corporation. That's not to say, of course, that interracial marriage should be illegal. But just as in your example of states (today) regulating corporations, states regulate marriage as well, and yet you seem to have no problem with the federal govt. stepping in when it comes to marriage. Applying the 14th to gay marriage or corporations are both (IMO) consistent with applying it to whatever, rather than for what it was originally intended for (protection of ex-slaves).\n \n No, but I think your view of it--applying it to things like same-sex marriage--seems to treat it as though it does. The use of it for the gay marriage issue is no less arbitrary than \"every form\" of discrimination there could be. So your use of it seems to attempt to use it as a catch-all amendment; the amendment-to-end-all-amendments, so to speak.\n\n \n Well, the fourteenth amendment, with its broad language IS a catch-all-amendment. It certainly was intended to apply to the freed slaves, but the framers of the amendment wrote it in broad language, so that it protects the rights of everyone. That appears to have been their intent. They did not say specifically what rights the amendment should protect, nor did they limit the amendment to protecting the rights of particular people. Instead, the framers of the 14th amendment prohibited states from denying to any person the equal protection of the laws. \n \n If you say that the Supreme Court should not apply the 14th amendment to marriage discrimination, then how is that different from saying the Supreme Court should not apply the amendment to discrimination in education? Education has also long been a state matter. And if you say that, then you are saying the Court should never have issued the Brown v. Board of Education decision. I don't think you want to go there. \n \n My position on the Lochner decision is not that the Supreme Court should not have ruled on state laws regarding worker protections. I think that state laws regarding workers can and should be scrutinized under the 14th amendment, if those laws are alleged to violate the rights of persons. My position is that the Supreme Court ruled the wrong way in the Lochner case, for two reasons. First, they ruled the wrong way when they declared that business corporations are persons, which they quite clearly are not. Second, they ruled that laws protecting workers, who are real persons, violate the rights of corporations, which are not persons and hence have no rights that can be violated. My objection to the Lochner decision is therefore not that the Supreme Court issued a ruling on the basis of the fourteenth amendment, but that the ruling itself, in my judgment, was wrong. And subsequent Court rulings have in effect overturned the Lochner ruling.", 
   {}, 
   261070, 
   null, 
   1177999500.0
  ], 
  [
   261090, 
   null, 
   "Ohioprof", 
   "Yes, but the fact that it has even been applied to businesses aptly demonstrates the problems with the 14th. I'd argue that to apply to it marriage, even gay marriage or even interracial marriage is not unlike such a liberal interpretation as applying it to something such as a corporation. That's not to say, of course, that interracial marriage should be illegal. But just as in your example of states (today) regulating corporations, states regulate marriage as well, and yet you seem to have no problem with the federal govt. stepping in when it comes to marriage. Applying the 14th to gay marriage or corporations are both (IMO) consistent with applying it to whatever, rather than for what it was originally intended for (protection of ex-slaves).\n \n \n \n \n\n \n To further clarify my argument, I do not have a problem with the Court ruling that questions of state regulation of business can be scrutinized under the 14th amendment, just as I do not have a problem with the Court ruling that questions of state marriage laws can be scrutinized under the 14th amendment, or state education laws can be scrutinized under the 14th amendment. I think that is entirely proper, and I want to see the U.S. Supreme Court rule on whether state laws discriminate against individuals in violation of the 14th amendment. My objection to the ruling in the Lochner case is with the specifics of the ruling, not with the fact that the Court issued a 14th amendment ruling in a case involving state regulation of business. I do not see the ruling as wrong because of what the framers of the amendment may have intended, because they did not write down their intentions for all circumstances, nor could they foresee all subsequent circumstances. I see the ruling as wrong in part because I think that business corporations are NOT persons with rights; they are legal entities. And I think that even if business corporations were persons, their rights under the due process clause were and are not violated by state laws protecting workers. My objection to the ruling in the case is not to the scope of the application of the 14th amendment, but to the specific ruling itself.", 
   {}, 
   261070, 
   null, 
   1178001000.0
  ], 
  [
   261106, 
   null, 
   "peteratwar", 
   "Why can't you simply answer the question?\n Would you be happy to accept what you are asking gay people to accept? Would you want gay people to outlaw your marriages? Would you still support the majority decision if the majority of people were gay and it was heterosexual marriages that were being denied or banned outright? Would you accept civil unions even though they were less then marriage? Would you be happy or find it just that certain religious sects were fighting your civil rights?\n \n Can you tell us how you would feel if you were being denied the right to marry the one you love because some one you don't know has some out dated evil religious belief.\n \n Do you not have feelings, or emotions. Jims trucking, steeeeve, and Jyoshu have no problem answering the question. The three of them say they would not be happy being treated the way gay people are being treated.\n\n \n Well firstly being in the UK we are somewhat more enlightened allowing Civil Unions. This is becoming more accepted in various other countries. The so-called treatment of Gays along the lines you talk about just don't exist or at least to that extent.\n \n Note by the way that marriage is not just a religious belief and never has been; it is basically a secular union which may be confirmed for instance by a religious ceremony.\n \n In answer to your question then I would probably try and persuade Society that gay marriages should be allowed if I was. However I very much doubt that I would take a dictatorial stance worthy of all the best tyrannies to try and achieve it.\n \n As another poster said you are trying to persuade the Court of Public Opinion", 
   {}, 
   261036, 
   null, 
   1178011920.0
  ], 
  [
   261116, 
   null, 
   "Matthew S", 
   "Well firstly being in the UK we are somewhat more enlightened allowing Civil Unions. This is becoming more accepted in various other countries. The so-called treatment of Gays along the lines you talk about just don't exist or at least to that extent.\n \n Note by the way that marriage is not just a religious belief and never has been; it is basically a secular union which may be confirmed for instance by a religious ceremony.\n \n In answer to your question then I would probably try and persuade Society that gay marriages should be allowed if I was. However I very much doubt that I would take a dictatorial stance worthy of all the best tyrannies to try and achieve it.\n \n As another poster said you are trying to persuade the Court of Public Opinion\n\n \n Still not what I asked. I didn't ask what you would do. I asked how would it make you feel? I can only conclude that you would also not be happy but are unwilling to admit it.", 
   {}, 
   261106, 
   null, 
   1178022600.0
  ], 
  [
   261119, 
   null, 
   "Ohioprof", 
   "In answer to your question then I would probably try and persuade Society that gay marriages should be allowed if I was. However I very much doubt that I would take a dictatorial stance worthy of all the best tyrannies to try and achieve it.\n \n \n\n \n I'm curious who has taken \"a dictatorial stance worthy of all the best tyrannies to try and achieve it.\" Has someone argued that a dictator should step in and require same-sex marriage? If so, I did not notice that post. \n \n People have argued that courts should rule in favor of same-sex marriage, but that's not the same as a dictator imposing something on people. Courts have a specific function and limits within which they operate.", 
   {}, 
   261106, 
   null, 
   1178023020.0
  ], 
  [
   261122, 
   null, 
   "peteratwar", 
   "I'm curious who has taken \"a dictatorial stance worthy of all the best tyrannies to try and achieve it.\" Has someone argued that a dictator should step in and require same-sex marriage? If so, I did not notice that post. \n \n People have argued that courts should rule in favor of same-sex marriage, but that's not the same as a dictator imposing something on people. Courts have a specific function and limits within which they operate.\n\n \n \n Try looking at some of Matthews post in the past, you will see what I mean.:)", 
   {}, 
   261119, 
   null, 
   1178023980.0
  ], 
  [
   261139, 
   null, 
   "jyoshu", 
   "Well, the fourteenth amendment, with its broad language IS a catch-all-amendment. It certainly was intended to apply to the freed slaves, but the framers of the amendment wrote it in broad language, so that it protects the rights of everyone. That appears to have been their intent. They did not say specifically what rights the amendment should protect, nor did they limit the amendment to protecting the rights of particular people. Instead, the framers of the 14th amendment prohibited states from denying to any person the equal protection of the laws.\n \n \n Yes, I agree--the legal protections of the laws as they are. That's exactly why I think gay marriage is over-reaching when invoking the 14th amendment; the law clearly views marriage as a union between one man and one woman. In cases where it does not, it is nothing short of a loophole. That's why conservatives have, at times, sought to clarify the law in ALL cases with an amendment saying marriage is between one man and one woman (because there are some loopholes). While I don't think that is necessary, the reason they do it is to prevent the taking advantage of legal loopholes arising because legislators never dreamed they'd need to go so far as to actually define what marriage should be long ago. Buyt even then, I think there is enough evidence in our laws to indicate that the legal understanding of marriage is that it is between one man and one woman. That's the structure by which our marriage-benefits-system operates. And even then, this may be a case where the matter should be judged heavily on the basis of the spirit of the law (which would lean against giving non-man/woman marriage arrangements marriage benefits, IMO), rather than just the letter of the law which never envisioned other forms of marriage coming along in terms of it's most basic societal and cultural definitions of one-woman/one-man.\n \n \nIf you say that the Supreme Court should not apply the 14th amendment to marriage discrimination, then how is that different from saying the Supreme Court should not apply the amendment to discrimination in education? \n\n \n I didn't say SCOTUS should not apply the 14th. But it cannot apply the 14th arbitrarily; that is why I spoke of the onus being on the gay rights movement. It is simply not suffiicient to merely say \"this is discrimination\" and \"it violates the 14th.\" The 14th amendment guarantees equal protection of laws as they are, not as we might wish them to be. Your use of the 14th is no different than any other group outside the paradigm of one-man/one-woman marriage coming along and demanding equal protection. It can't just be arbitrary; our system is set up for marriages that are between one man and one woman. That is why I believe this is a case where the more correct course of action would be for gay rights groups to pursue an amendment in the same vein as women's suffrage, which worked in getting the 19th. In that case, the law supported men being given preference.", 
   {}, 
   261087, 
   null, 
   1178032800.0
  ], 
  [
   261158, 
   null, 
   "samiinh", 
   "Yes, I agree--the legal protections of the laws as they are. That's exactly why I think gay marriage is over-reaching when invoking the 14th amendment; the law clearly views marriage as a union between one man and one woman. In cases where it does not, it is nothing short of a loophole. That's why conservatives have, at times, sought to clarify the law in ALL cases with an amendment saying marriage is between one man and one woman (because there are some loopholes). While I don't think that is necessary, the reason they do it is to prevent the taking advantage of legal loopholes arising because legislators never dreamed they'd need to go so far as to actually define what marriage should be long ago. Buyt even then, I think there is enough evidence in our laws to indicate that the legal understanding of marriage is that it is between one man and one woman. That's the structure by which our marriage-benefits-system operates. And even then, this may be a case where the matter should be judged heavily on the basis of the spirit of the law (which would lean against giving non-man/woman marriage arrangements marriage benefits, IMO), rather than just the letter of the law which never envisioned other forms of marriage coming along in terms of it's most basic societal and cultural definitions of one-woman/one-man.\n \n \n \n I didn't say SCOTUS should not apply the 14th. But it cannot apply the 14th arbitrarily; that is why I spoke of the onus being on the gay rights movement. It is simply not suffiicient to merely say \"this is discrimination\" and \"it violates the 14th.\" The 14th amendment guarantees equal protection of laws as they are, not as we might wish them to be. Your use of the 14th is no different than any other group outside the paradigm of one-man/one-woman marriage coming along and demanding equal protection. It can't just be arbitrary; our system is set up for marriages that are between one man and one woman. That is why I believe this is a case where the more correct course of action would be for gay rights groups to pursue an amendment in the same vein as women's suffrage, which worked in getting the 19th. In that case, the law supported men being given preference.\n\n \n \n There was a time not so long ago when marriage meant one man and one woman of the same race. That was wrong too, and the SCOTUS corrected it.", 
   {}, 
   261139, 
   null, 
   1178039940.0
  ], 
  [
   261161, 
   null, 
   "peteratwar", 
   "There was a time not so long ago when marriage meant one man and one woman of the same race. That was wrong too, and the SCOTUS corrected it.\n\n \n Didn't change the man-woman requirement tho'", 
   {}, 
   261158, 
   null, 
   1178041020.0
  ], 
  [
   261185, 
   null, 
   "Ohioprof", 
   "\n \n I didn't say SCOTUS should not apply the 14th. But it cannot apply the 14th arbitrarily; that is why I spoke of the onus being on the gay rights movement. It is simply not suffiicient to merely say \"this is discrimination\" and \"it violates the 14th.\" The 14th amendment guarantees equal protection of laws as they are, not as we might wish them to be.\n \n\n \n I respectfully disagree with you on this. The 14th amendment guarantees equal protection of the laws, and laws themselves can and often do deny equal protection to all people. State laws that deny people equal protection are struck down by the Supreme Court. In the case of Loving v. Virginia, the Commonwealth of Virginia argued that their law prohibiting inter-racial marriages did provide equal protection, because it treated everyone equally in denying people the right to marry someone of a different race. The Commonwealth of Virginia also argued that there was a long understanding that legal marriage should only be between people of the same race. The Supreme Court rejected those arguments and struck down the Virginia state law.\n \n It IS sufficient for a plaintiff to say and to show that a law discriminates and denies equal protection. The state has to demonstrate that it has at least a rational basis for the discriminatory law (the lowest level of scrutiny under the 14th amendment). In cases where a state law denies certain people a fundamental right, the Supreme Court requires that the state show a compelling state interest in passing the discriminatory law. \n \n In fact the onus is on the state to demonstrate that a law that discriminates against a particular group of people does not violate the 14th amendment. In the case of Romer v. Evans in 1996, Colorado failed to show that it had even a rational basis for enacting a constitutional amendment prohibiting laws that ban discrimination on the basis of sexual orientation. The Supreme Court ruled that the only reason for such a state constitutional amendment was animus toward gay people, and the Court struck down the Colorado constitutional amendment as in violation of the 14th amendment to the U.S. constitution.", 
   {}, 
   261139, 
   null, 
   1178051940.0
  ], 
  [
   261195, 
   null, 
   "Ohioprof", 
   "Didn't change the man-woman requirement tho'\n\n \n Back in 1967, many state laws did not specify that marriage had to be between a man and a woman. It has been in the past decade or so that states rushed to pass laws defining marriage as between only one man and one woman. \n \n In the Loving v. Virginia case, the Supreme Court did not address the question of one man and one woman because that was not the question before them in the case. The plaintiffs were challenging the Virginia law that barred inter-racial marriage, and that was the issue before the Supreme Court.", 
   {}, 
   261161, 
   null, 
   1178058000.0
  ], 
  [
   261196, 
   null, 
   "Kronus", 
   " Buyt even then, I think there is enough evidence in our laws to indicate that the legal understanding of marriage is that it is between one man and one woman. That's the structure by which our marriage-benefits-system operates.\n \n\n \n I believe that if you actually take a look, you'll find that isn't the case. The benefits are geared towards two adults, generally living together, sharing the responsibilities of running a home and maybe raising a family. None of the benefits I've seen are gender specific in any way, they apply equally to any sort of couple. If you have found any exceptions to this then please share, but if you can find any they will just be exceptions to the general rule. Nothing about the current structure requires mixed gendered couples.", 
   {}, 
   261139, 
   null, 
   1178058660.0
  ], 
  [
   261207, 
   null, 
   "jyoshu", 
   "I believe that if you actually take a look, you'll find that isn't the case. The benefits are geared towards two adults, generally living together, sharing the responsibilities of running a home and maybe raising a family. None of the benefits I've seen are gender specific in any way, they apply equally to any sort of couple. If you have found any exceptions to this then please share, but if you can find any they will just be exceptions to the general rule. Nothing about the current structure requires mixed gendered couples.\n\n \n Notice that I said \"laws\", not just benefits. (\"But even then, I think there is enough evidence in our laws\") In point of fact, there are numerous examples of state laws that view marriage as between a man and a woman. (http://www.stateline.org/live/ViewPage.action?siteNodeId=136&languageId=1&contentId=15576) State laws certainly are part of our current structure, so I believe you are incorrrect.", 
   {}, 
   261196, 
   null, 
   1178064060.0
  ], 
  [
   261258, 
   null, 
   "Ohioprof", 
   "In point of fact, there are numerous examples of state laws that view marriage as between a man and a woman. (http://www.stateline.org/live/ViewPage.action?siteNodeId=136&languageId=1&contentId=15576) State laws certainly are part of our current structure, so I believe you are incorrrect.\n\n \n Your argument, as I understand it, was the there is a long history of states assuming that marriage is between one man and one woman and having laws that restrict marriage to one man and one woman. The first part of that argument may be true: most state laws did not, until very recently, explicitly restrict marriage to one man and one woman probably because people simply assumed that marriage would always be between one man and one woman. The second part of your argument, that there are numerous examples of state laws that explicitly restrict marriage to one man and one woman, is true only in the last ten years, since the passage of a blizzard of so-called DOMA laws in many states. People rushed to make their state laws explicitly restrictive. There are still some states without DOMA laws. \n \n I think it's clear that, over time, marriage practices and court rulings have tended gradually to eliminate the distinction between men and women, as women have come to earn more money and as, in a few instances, men have come to take on child-rearing responsibilities. Marriage laws and court rulings in the 20th century tended to protect women, who could not earn the money that men could and who needed protections and benefits from marriage in order to raise children. As marriages became more nearly equal, and as more women were able to earn relatively high incomes through employment, the need for such protections intended specifically for women diminished. I'm not suggesting that the need is gone. Women still, as a group, earn significantly less than men, and women are still usually the ones who stop out of careers to raise children, thus eroding their earning ability. But the need for specific protections for women, as distinct from men, has gradually been disappearing, and we are seeing the growing need for protections not specifically for women, but for stay-at-home spouses and for spouses who earn less money. (These protections mainly kick in in cases of divorce.) The protections of marriage thus do not depend on whether the people involved are male or female, but rather on what role each spouse plays and the earning ability of each spouse. Marriage laws also protect children, and those protections do not depend on the sex of the spouses either. \n \n As we have seen the growth of egalitarian marriages and of women being able to earn higher incomes, we have also seen the coming out of gay couples and the increasing visibility of gay couples raising children. These couples and their children need the protections of marriage for the same reasons that heterosexual couples do. \n \n So my argument is that marriage laws provide protections that used to benefit women disproportionately (and if we go way back into the 19th century, the benefits went to men disproportionately). Today the benefits assist spouses and children whatever their sex. These protections are valuable and necessary whether a couple is male-female, female-female, or male-male. The protections are especially important when the couple is raising children.", 
   {}, 
   261207, 
   null, 
   1178111280.0
  ], 
  [
   261261, 
   null, 
   "Ohioprof", 
   "A big question, I think, for us as citizens is whether we want our laws to protect the families that actually exist or whether we want our laws to protect the families that some people think ideally should exist. Should marriage be restricted to one man and one woman only because that is what many people think should be the proper family form? Or should marriage cover the needs of actual families that exist in the society, including gay families? \n \n I will argue the latter: that marriage should provide protections for the actual families that exist. I think it is not the proper role of the state to dictate to people what their family forms ought to be, by providing legal protections and benefits to one form of family and denying legal protections and benefits to other forms of families. I think the state should be neutral when it comes to the family forms that people create. If we live in a truly free society, then it should be up to the people, not the state, how we organize our family lives. The state should respond to the needs of the people. And some people, who happen to dislike gay people, should not be allowed to use the state to aim discriminatory laws against gay people. Gay people are citizens too, and gay people have the right to the equal protection of the laws. Equal protection of the laws should include the equal right to marry our spouses and to provide our families and our children with the same benefits and protections that opposite-sex spouses can provide through legal marriage. \n \n Some argue that we should be grateful for and content with a separate category of civil unions. How dare we push for equal marriage rights? But I can think of no reason for creating a separate category of civil unions for same-sex couples other than animus against gay people and a desire to treat gay people as less-than-equal citizens. If civil unions provide the same benefits and protections as marriage, then why have a separate category of civil unions at all? There is no need for civil unions, because they provide the same benefits as marriage. If civil unions do not provide the same benefits and protections as marriage, then civil unions are clearly not equal to marriage, and again, gay people are being treated as less-than-equal citizens. Either way, there is no rational reason for civil unions other than popular resistance to treating gay people as equal citizens under the law.", 
   {}, 
   261258, 
   null, 
   1178112120.0
  ], 
  [
   261334, 
   null, 
   "Kronus", 
   "Notice that I said \"laws\", not just benefits. (\"But even then, I think there is enough evidence in our laws\") In point of fact, there are numerous examples of state laws that view marriage as between a man and a woman. (http://www.stateline.org/live/ViewPage.action?siteNodeId=136&languageId=1&contentId=15576) State laws certainly are part of our current structure, so I believe you are incorrrect.\n\n \n All you cited was a list of very recent changes defining marriage as between man and woman. You have no examples to support what you said, which was that our laws demonstrate an undestanding that marriage is between man and woman. Full quote:\n \"I think there is enough evidence in our laws to indicate that the legal understanding of marriage is that it is between one man and one woman\"\n \n While the writers may in fact have been thinking mixed gender, there is in fact nothing in the laws to show that. In particular, the \"marriage-benefits-system\", your words, work perfectly well with any commited couple, regardless of their gender. So if what you meant to say was \"many states now define marriage as between man and woman\" you would be correct. But your original statement is wrong, or at the very best unsupported by any evidence you've provided.", 
   {}, 
   261207, 
   null, 
   1178135100.0
  ], 
  [
   261344, 
   null, 
   "thelmoose", 
   "All you cited was a list of very recent changes defining marriage as between man and woman. You have no examples to support what you said, which was that our laws demonstrate an undestanding that marriage is between man and woman. Full quote:\n \"I think there is enough evidence in our laws to indicate that the legal understanding of marriage is that it is between one man and one woman\"\n \n While the writers may in fact have been thinking mixed gender, there is in fact nothing in the laws to show that. In particular, the \"marriage-benefits-system\", your words, work perfectly well with any commited couple, regardless of their gender. So if what you meant to say was \"many states now define marriage as between man and woman\" you would be correct. But your original statement is wrong, or at the very best unsupported by any evidence you've provided.\n\n \n I would add because every one of the laws that jyoshu cited were only recently enacted, this appears to be evidence that there was not a clear understanding previously that marriage was intended to be between one man and one woman. At least not in the way the laws were written. Otherwise there would have been no need for the recent legal clarifications.", 
   {}, 
   261334, 
   null, 
   1178139120.0
  ], 
  [
   261350, 
   null, 
   "jyoshu", 
   "While the writers may in fact have been thinking mixed gender, there is in fact nothing in the laws to show that. \n\n \n I cannot imagine how you could have read the cases of the link I gave you and come away with that conclusion. Unless you just didn't read them at all nor gave it even the least bit of thought. When many state laws say marriage is between a man and a woman (not all of them recent DOMAs and going back a long time, which you'd have seen if you had actually read the information), it's clear as day what they mean by that and that they, as laws, show that. You're taking the \"benefits\" word (which I happened to use once) and pretending I wasn't talking about law at all.", 
   {}, 
   261334, 
   null, 
   1178140440.0
  ], 
  [
   261360, 
   null, 
   "Kronus", 
   "I would add because every one of the laws that jyoshu cited were only recently enacted, this appears to be evidence that there was not a clear understanding previously that marriage was intended to be between one man and one woman. At least not in the way the laws were written. Otherwise there would have been no need for the recent legal clarifications.\n\n \n Excellent point.", 
   {}, 
   261344, 
   null, 
   1178143380.0
  ], 
  [
   261363, 
   null, 
   "Kronus", 
   "I cannot imagine how you could have read the cases of the link I gave you and come away with that conclusion. Unless you just didn't read them at all nor gave it even the least bit of thought. When many state laws say marriage is between a man and a woman (not all of them recent DOMAs and going back a long time, which you'd have seen if you had actually read the information),.\n\n Looks like we're not using the same definition of \"read\". What you just said is wrong, nothing in the article you cite says that. If your \"reading\" says otherwise then how about an actual quote? Or should we simply continue with the snarking that you've just started?\n \n \nYou're taking the \"benefits\" word (which I happened to use once) and pretending I wasn't talking about law at all.\n\n No, I'm not. That's just the out you're trying to generate for yourself to avoid having to admit that, shudder, you said something that wasn't true. Laws, benefits, none of it shows what you claim it does.", 
   {}, 
   261350, 
   null, 
   1178143800.0
  ], 
  [
   261367, 
   null, 
   "thelmoose", 
   "I cannot imagine how you could have read the cases of the link I gave you and come away with that conclusion. Unless you just didn't read them at all nor gave it even the least bit of thought. When many state laws say marriage is between a man and a woman (not all of them recent DOMAs and going back a long time, which you'd have seen if you had actually read the information), it's clear as day what they mean by that and that they, as laws, show that. You're taking the \"benefits\" word (which I happened to use once) and pretending I wasn't talking about law at all.\n\n \n There are only 2 states that have laws/amendments that outline the genders in marriage that pre-date the federal DOMA of 1996.\n One is Maryland from 1973 and the other is Wyoming, but I cannot figure out when this happened. \n \n Reference is from the \n Human Rights Campaign, which was one of the sources your citation used. \n \n Therefore your statement \"not all of them recent DOMAs and going back a long time\" is not accurate. It even says so in the link you provided.", 
   {}, 
   261350, 
   null, 
   1178144220.0
  ], 
  [
   261380, 
   null, 
   "jyoshu", 
   "I would add because every one of the laws that jyoshu cited were only recently enacted, this appears to be evidence that there was not a clear understanding previously that marriage was intended to be between one man and one woman. At least not in the way the laws were written. Otherwise there would have been no need for the recent legal clarifications.\n\n \n Your statement:\"I would add because every one of the laws that jyoshu cited were only recently enacted\"\n and later ...\n \n \"There are only 2 states that have laws/amendments that outline the genders in marriage that pre-date the federal DOMA of 1996.\n One is Maryland from 1973 and the other is Wyoming, but I cannot figure out when this happened. \"\n You're wrong. Here is the are the non-DOMA cases from the article, since you apparently aren't interested in actually reading it yourself ...\n - Connecticut - Current law: State adoption statute refers to marriage as a union between a man and a woman. (Not a DOMA)\n \n - Hawaii - Current law: Constitutional amendment giving the legislature the right to reserve marriage to opposite-sex couples. (Not a DOMA)\n \n - Maryland - Current law: The first state law defining marriage as a union between a man and woman was adopted by Maryland in 1973. (Not a DOMA)\n \n - New Hampshire - Current law: State law bans same-sex marriage and pre-dates DOMA laws. (Not a DOMA)\n \n - New Jersey - Current law: State law provides for a domestic partners' registry with marriage-like benefits for same-sex couples. [note: not marriage, nor a DOMA]\n \n - Vermont - Current law: State law defines marriage as union between man and woman (Not a DOMA)\n \n - Wyoming - Current law: State law bans same-sex marriage and pre-dates DOMA laws. (Not a DOMA)Yes, the rest are DOMA laws. But it is still law, and to pretend that DOMAs are invalid and don't demonstrate the way states view marriage (between a man and woman) is wishful thinking on your part. They are examples of the way the law demonstrates marriage as between a man and woman; they don't exist despite it. They ARE the law. So there are clear examples of both recent (as if that somehow invalidates it) as well as older laws demonstrating the system viewing marriage as between one man and one women.", 
   {}, 
   261344, 
   null, 
   1178146620.0
  ], 
  [
   261383, 
   null, 
   "thelmoose", 
   "Your statement:\"I would add because every one of the laws that jyoshu cited were only recently enacted\"\n and later ...\n \n \"There are only 2 states that have laws/amendments that outline the genders in marriage that pre-date the federal DOMA of 1996.\n One is Maryland from 1973 and the other is Wyoming, but I cannot figure out when this happened. \"\n You're wrong. Here is the are the non-DOMA cases from the article, since you apparently aren't interested in actually reading it yourself ...\n - Connecticut - Current law: State adoption statute refers to marriage as a union between a man and a woman. (Not a DOMA)\n \n - Hawaii - Current law: Constitutional amendment giving the legislature the right to reserve marriage to opposite-sex couples. (Not a DOMA)\n \n - Maryland - Current law: The first state law defining marriage as a union between a man and woman was adopted by Maryland in 1973. (Not a DOMA)\n \n - New Hampshire - Current law: State law bans same-sex marriage and pre-dates DOMA laws. (Not a DOMA)\n \n - New Jersey - Current law: State law provides for a domestic partners' registry with marriage-like benefits for same-sex couples. [note: not marriage, nor a DOMA]\n \n - Vermont - Current law: State law defines marriage as union between man and woman (Not a DOMA)\n \n - Wyoming - Current law: State law bans same-sex marriage and pre-dates DOMA laws. (Not a DOMA)Yes, the rest are DOMA laws. But it is still law, and to pretend that DOMAs are invalid and don't demonstrate the way states view marriage (between a man and woman) is wishful thinking on your part. They are examples of the way the law demonstrates marriage as between a man and woman; they don't exist despite the law. They ARE the law. So there are clear examples of both recent (as if that somehow invalidates it) as well as older laws demonstrating the system viewing marriage as between one man and one women.\n\n \n Are you really this obtuse or do you think I am too stupid to see what you are doing?\n The two quotes of mine are in complete agreement with each other.\n \n I said they pre-date the 1996 DOMA. Whether they are \"DOMA's\" or not is quite beside the point. The point is WHEN they were enacted, and all of them, save two, were enacted since 1996, solely in response to the federal DOMA.\n \n This is contrary to your assertion there is some longstanding clarity, statutory or constitutional, on this topic.", 
   {}, 
   261380, 
   null, 
   1178147220.0
  ], 
  [
   261385, 
   null, 
   "jyoshu", 
   "Looks like we're not using the same definition of \"read\". What you just said is wrong, nothing in the article you cite says that. If your \"reading\" says otherwise then how about an actual quote? Or should we simply continue with the snarking that you've just started?\n \n No, I'm not. That's just the out you're trying to generate for yourself to avoid having to admit that, shudder, you said something that wasn't true.\n\n \n Wow. Ok, let's review this, so you can't do your oft-used tactic of claiming I'm lying when I'm not. \n \n - First, I said, clear as day, \"I think there is enough evidence in our laws to indicate that the legal understanding of marriage is that it is between one man and one woman.\" \n \n - That's what you took issue with by claiming that isn't the case, in post #53. \n \n - Then I showed you, state-by-state, that laws demonstrate it between a man and a woman. Er, that's what it means when it says \"refers to marriage as a union between a man and a woman\" [from one of the states]\n \n - You then said \"All you cited was a list of very recent changes defining marriage as between man and woman. You have no examples to support what you said, which was that our laws demonstrate an undestanding that marriage is between man and woman.\" [even though I just GAVE you examples. DOMAs ARE laws, and those examples I gave you are about LAWS. Not just \"changes\". And there were examples there that weren't DOMAs specifically, and there were examples that pre-dated DOMAs.]\n \n If you read what I showed you, where it indicates the state laws say it is between a man and a woman, and then come away saying it doesn't show what I'm talking about, then you're either lying, or just absolutely delusional somehow. Go figure. emoticon_xdonno", 
   {}, 
   261363, 
   null, 
   1178147520.0
  ], 
  [
   261386, 
   null, 
   "jyoshu", 
   "Are you really this obtuse or do you think I am too stupid to see what you are doing?\n The two quotes of mine are in complete agreement with each other.\n \n I said they pre-date the 1996 DOMA. Whether they are \"DOMA's\" or not is quite beside the point. The point is WHEN they were enacted, and all of them, save two, were enacted since 1996, solely in response to the federal DOMA.\n \n This is contrary to your assertion there is some longstanding clarity, statutory or constitutional, on this topic.\n\n \n I did NOT assert \"longstanding clarity\", I said some of them go back a long time. You pointed out yourself some cases that went back further than DOMA, and so does the article. You're trying to steer this in a different direction; my original point is that the law demonstrates marriage as between a man and a woman. The point is that the law supports that assertion, period. It's clear as day, so I don't know why you all are taking issue with it.", 
   {}, 
   261383, 
   null, 
   1178148060.0
  ], 
  [
   261388, 
   null, 
   "E Mutz", 
   "I would add because every one of the laws that jyoshu cited were only recently enacted, this appears to be evidence that there was not a clear understanding previously that marriage was intended to be between one man and one woman. At least not in the way the laws were written. Otherwise there would have been no need for the recent legal clarifications.\n \n There were no speed limits before the 20th century. That does not imply thousands of years of uncertainty about how fast one might travel. There was no need so there was no law. \n \n Definitions do not imply wide-spread confusion. All it takes is one de-de-de to create the need for codification. Take a look at the warning labels on consumer products. The vast majority are not confused when they receive a package, yet there is someone out there right now who will eat the silica packet if it is not labeled.", 
   {}, 
   261386, 
   null, 
   1178148420.0
  ], 
  [
   261391, 
   null, 
   "thelmoose", 
   "I did NOT assert \"longstanding clarity\", I said some of them go back a long time. You pointed out yourself some cases that went back further than DOMA, and so does the article. You're trying to steer this in a different direction; my original point is that the law demonstrates marriage as between a man and a woman. The point is that the law supports that assertion, period. It's clear as day, so I don't know why you all are taking issue with it.\n\n \n None go back a long time. \n All but two, not some, were enacted after 1996. There has been a flurry of activity in 9 years or less.", 
   {}, 
   261386, 
   null, 
   1178149380.0
  ], 
  [
   261394, 
   null, 
   "thelmoose", 
   "I would add because every one of the laws that jyoshu cited were only recently enacted, this appears to be evidence that there was not a clear understanding previously that marriage was intended to be between one man and one woman. At least not in the way the laws were written. Otherwise there would have been no need for the recent legal clarifications.\n \n There were no speed limits before the 20th century. That does not imply thousands of years of uncertainty about how fast one might travel. There was no need so there was no law. \n \n Definitions do not imply wide-spread confusion. All it takes is one de-de-de to create the need for codification. Take a look at the warning labels on consumer products. The vast majority are not confused when they receive a package, yet there is someone out there right now who will eat the silica packet if it is not labeled.\n\n \n What is a de-de-de?\n \n Note I said, \"At least not in the way the laws were written.\"\n \n Both Kronus and I have stated that it was likely that marriage laws were written with the assumption that a man and a woman are involved. No one would even have thunk about two fellers nuptualizing. The point, for heavens to pete's sake, is precisely that the laws indicating explicitly that marriage is about only a man marrying only a woman are a recent phenomenon. The laws prior to that were vague in that regard. Vague enough to be successfully challenged in court. It simply wasn't mentioned, because I bet no one thought they needed to. No one thought to outlaw same-sex marriage, because no one thought such a thing would happen. This is only in response to jyoshu's incorrect assertion that this distinction has been on the books explicitly for a long time. \n \n With regard to speed limit. There was never any uncertainly about the speed one might travel, to be sure. There were no speed limit laws, however, because there was no ability for enough people to travel at sufficient speed and with sufficient proximity to create an unsafe condition. Not sure that is analagous. Similar maybe. Not sure. My head hurts from interacting with jyoshu.", 
   {}, 
   261388, 
   null, 
   1178150280.0
  ], 
  [
   261454, 
   null, 
   "Ohioprof", 
   "Your statement:\"I would add because every one of the laws that jyoshu cited were only recently enacted\"\n and later ...\n \n \"There are only 2 states that have laws/amendments that outline the genders in marriage that pre-date the federal DOMA of 1996.\n One is Maryland from 1973 and the other is Wyoming, but I cannot figure out when this happened. \"\n You're wrong. Here is the are the non-DOMA cases from the article, since you apparently aren't interested in actually reading it yourself ...\n - Connecticut - Current law: State adoption statute refers to marriage as a union between a man and a woman. (Not a DOMA)\n \n - Hawaii - Current law: Constitutional amendment giving the legislature the right to reserve marriage to opposite-sex couples. (Not a DOMA)\n \n - Maryland - Current law: The first state law defining marriage as a union between a man and woman was adopted by Maryland in 1973. (Not a DOMA)\n \n - New Hampshire - Current law: State law bans same-sex marriage and pre-dates DOMA laws. (Not a DOMA)\n \n - New Jersey - Current law: State law provides for a domestic partners' registry with marriage-like benefits for same-sex couples. [note: not marriage, nor a DOMA]\n \n - Vermont - Current law: State law defines marriage as union between man and woman (Not a DOMA)\n \n - Wyoming - Current law: State law bans same-sex marriage and pre-dates DOMA laws. (Not a DOMA)Yes, the rest are DOMA laws. But it is still law, and to pretend that DOMAs are invalid and don't demonstrate the way states view marriage (between a man and woman) is wishful thinking on your part. They are examples of the way the law demonstrates marriage as between a man and woman; they don't exist despite it. They ARE the law. So there are clear examples of both recent (as if that somehow invalidates it) as well as older laws demonstrating the system viewing marriage as between one man and one women.\n\n \n You seem to be grasping here to make your original point. The Hawaii constitutional amendment is a recent enactment, put into place after the Hawaii Supreme Court ruled that the Hawaii constitution required the recognition of marriage between same-sex partners. (This ruling came before the Mass. court ruling and before the Vermont court ruling that led to civil unions. I remember the flurry of excitement it aroused, as Hawaii was the first state to allow same-sex marriage....for about a minute. Then the state quickly passed a constitutional amendment defining marriage as between one man and one woman.)\n \n The Vermont Supreme Court subsequently held that that state's constitution required that the state recognize either same-sex marriage or something equivalent. It was at this point that the Vermont legislature created its civil unions law while limiting marriage to one man and one woman. \n \n The New Jersey laws is likewise a recent enactment, put into place as a result of the effort to win same-sex marriage rights. The court ruled, as in the Vermont case, that the state had to recognize an institution that granted the rights of marriage, although it could be called something else. So New Jersey enacted civil unions, like Vermont. \n \n The only two states with relatively longstanding marriage laws that explicitly defined marriage as between one man and one woman from your list are Maryland and Wyoming, the states named by Kronus. The other laws were enacted in response to efforts by gay rights activists to press the states to recognize same-sex marriages. The law in Connecticut refers to adoption and is not itself a marriage law. \n \n You can make your original point without trying to stretch the truth as you do here. Your original point seemed to be that the states did not explicitly define marriage as between a man and a woman for most of American history because they simply assumed, and people generally understood, marriage as between a man and a woman. I think that is true. But it's also true that the actual redefinition of marriage, the addition of terms to define marriage explicitly as limited to one man and one woman, was done recently in nearly alll the states that have made this move, in reaction to the push from gay people to have states recognize same-sex marriages. The actual legal \"redefinition\" was done by the opponents of same-sex marriage, to spell out in the state laws what they had long assumed.", 
   {}, 
   261380, 
   null, 
   1178193540.0
  ], 
  [
   261455, 
   null, 
   "Ohioprof", 
   "What is a de-de-de?\n \n With regard to speed limit. There was never any uncertainly about the speed one might travel, to be sure. There were no speed limit laws, however, because there was no ability for enough people to travel at sufficient speed and with sufficient proximity to create an unsafe condition. \n\n \n This is off topic, but in fact, driving was very unsafe in the early days. Cars could not go nearly as fast as they can now, but the roads were often unpaved and dangerous, and cars were not designed with safety in mind either. People could not drive veyr fast, but they could drive fast enough to be injured or killed, and they often were.\n \n Anyhow, your point about marriage laws is accurate, and your bigger point about speed limits is also accurate. Speed was limited by the capacity of the early cars and by the condition of the roads.", 
   {}, 
   261394, 
   null, 
   1178194020.0
  ], 
  [
   261468, 
   null, 
   "jyoshu", 
   "You seem to be grasping here to make your original point. \n\n \n This was in response to Thelmoose; this wasn't about my original point--he was taking issue with something specific (longevity of laws).\n \n \nYou can make your original point without trying to stretch the truth as you do here. Your original point seemed to be that the states did not explicitly define marriage as between a man and a woman for most of American history because they simply assumed, and people generally understood, marriage as between a man and a woman.\n\n \n That was indeed part of my point, but also that laws as they are demonstrate marriage as between a man and a woman. It doesn't matter that many of the laws are within the last 11 or 12 years, or that opponents of SSM were proponents of the laws. It is still the law, and demonstrates marriage as between one man and one woman.", 
   {}, 
   261454, 
   null, 
   1178201880.0
  ], 
  [
   261470, 
   null, 
   "Ohioprof", 
   "\n \n That was indeed part of my point, but also that laws as they are demonstrate marriage as between a man and a woman. It doesn't matter that many of the laws are within the last 11 or 12 years, or that opponents of SSM were proponents of the laws. It is still the law, and demonstrates marriage as between one man and one woman.\n\n \n Well, yeah, but we already knew this. Everyone knows that states have recently rushed to enact laws that restrict marriage to one man and one woman. This indicates that people worried that existing state laws did NOT clearly restrict marriage in this way, and so they rushed to write this restriction into the state laws. \n \n There are a number of questions that arise with the enactment of these restrictive marriage laws, one of which is whether these laws are constitutional, or whether they violate the 14th amendment. I do not think that the current conservative Supreme Court is likely to strike down these restrictive marriage laws, but a future Court may do so. The anti-miscegenation laws were on the books for a long, long time, banning inter-racial sex and inter-racial marriage. The Supreme Court eventually, in 1967, struck these laws down as unconstitutional, as violations of the 14th amendment. Similarly, the laws banning sex between people of the same sex, the \"sodomy\" laws, were on the books for a long time, and the Supreme Court first upheld them in Bowers v. Hardwick and then struck these laws down in Lawrence v. Texas. So while I doubt that the current Supreme Court is going to strike down the state laws banning same-sex marriage, we can't say what a future Supreme Court will do. \n \n The fact that we now have either civil unions or full marriage rights in all of the New England states is stunning progress for our movement, I think. Remember the howls of protest when Vermont enacted civil unions. Now opponents of same-sex marriage are arguing for civil unions as the \"reasonable\" position, whereas earlier, they howled that civil unions were a horrible acceptance of \"homosexuality.\" I did not expect to have either marirage or civil unions in my lifetime, and here they are.", 
   {}, 
   261468, 
   null, 
   1178203080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  To all the anti same sex marriage people.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9816-all-anti-same-sex-marriage-people.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9816, 
  "discussion_files": [
   [
    "18051.html", 
    "http://www.4forums.com/political/gay-rights-debates/9816-all-anti-same-sex-marriage-people-print.html"
   ], 
   [
    "18052.html", 
    "http://www.4forums.com/political/gay-rights-debates/9816-all-anti-same-sex-marriage-people-5-print.html"
   ], 
   [
    "18053.html", 
    "http://www.4forums.com/political/gay-rights-debates/9816-all-anti-same-sex-marriage-people-4-print.html"
   ], 
   [
    "18054.html", 
    "http://www.4forums.com/political/gay-rights-debates/9816-all-anti-same-sex-marriage-people-3-print.html"
   ], 
   [
    "18055.html", 
    "http://www.4forums.com/political/gay-rights-debates/9816-all-anti-same-sex-marriage-people-2-print.html"
   ]
  ], 
  "identifier": 9816
 }
]