[
 [
  [
   260300, 
   null, 
   "Big_Bear_Scot", 
   "I don't usually post in this section as I am not well versed in Economics but I would to get the opinion of those in the know(Gamehuis, Daewoo, etc) about the strong Pound against a weak Dollar and its effect on the World economy.\n \n http://news.bbc.co.uk/1/hi/business/6566715.stm\n http://news.bbc.co.uk/1/hi/business/6567821.stm\n \n Supposedly the strong pound hurts British exporters as our goods now cost more on the World market and with the USA as our main trading partner this hits UK exporters especially hard.\n \n The strong pound is supposedly good for the consumer, as imported goods should cost less and tourism especially to the US at the moment is cheaper.\n [*]Is there other good or bad points about a strong currency? [*]What are the pitfalls for the UK because of such a strong Pound against the Dollar?[*]Does this have any impact on US Economic Policy ?", 
   {
    "post_info": {
     "post_title": "Strong Pound weak Dollar"
    }
   }, 
   null, 
   null, 
   1177499940.0
  ], 
  [
   260327, 
   null, 
   "gamehuis", 
   "In very simplistic terms the currency of a country can be seen as a countries stock. If the country is doing well it will have a strong currency and vice versa.\n \n Naturally there are other fundamentals that should be taken into account like currency manipulation (i.e. the Chinese and Japanese), interest rate differences etc.\n \n A strong currency usually means that you have a strong economy, but it also means that other nations need to pay more for your exports, so it's a double edged blade.\n \n I don't see any pitfalls for the UK at this moment in time when it comes to the Pounds strength versus the dollar. The only reason why the Pound went up is because of the interest rate difference between the Pound and the dollar, not because the UK is doing economically better than the US (in fact it's the other way around).\n \n This will not have any impact on US economic policy whatsoever. The US advocates a weak dollar because there is this belief that this will increase US exports. But apparently policy makers failed to take into account that for that to work, a country actually needs to produce good that people want to buy (apart from guns).", 
   {}, 
   260300, 
   null, 
   1177515240.0
  ], 
  [
   260374, 
   null, 
   "daewoo", 
   "The primary \"rise\" in the pound is not so much pound strength as it is dollar weakness coupled with increase carry trade yields possible due to the UKs high (and climbing) interest rates.\n \n Whether this is better for consumers or not is questionable since historically importers do not pass their excess profits due to currency rates on to consumers in the short term. The importer makes more money, the consumer pays the same because decreased exports make price cuts for domestic producers difficult, so the typically do not present much by way of price competition. \n \n In the end, it can make things rougher for domestic producers, tends to be neutral for consumers, and helps importers.\n \n When it comes to the US, we have seen an inversion in the producer benifit to a lower currency since we import virtually all of our manufactured raw materials. The depressed dollar leads to increased materials prices, which leads to increased output prices. If the UK is in the same situation the high pound might actually benifit producers as it would decrease their materials costs.", 
   {}, 
   260327, 
   null, 
   1177529460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Strong Pound weak Dollar", 
  "url": "http://www.4forums.com/political/economics-debates/9818-strong-pound-weak-dollar.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 9818, 
  "discussion_files": [
   [
    "7875.html", 
    "http://www.4forums.com/political/economics-debates/9818-strong-pound-weak-dollar-print.html"
   ]
  ], 
  "identifier": 9818
 }
]