[
 [
  [
   260400, 
   null, 
   "MrWriteLA", 
   "Excerpts from a 258-year-old book written by what is thought to be the first ever advocate for gay rights have been discovered by a University of Manchester academic. Dr Hal Gladfelder from the School of Arts, Histories and Cultures found the previously unnoticed tract while doing research at the National Archive in Kew.\n \n The three by five foot scroll, which is a handwritten indictment of the printer of a book called 'Ancient and Modern Pederasty Investigated and Exemplified', had been gathering dust for two centuries. Written by Thomas Cannon in 1749 and suppressed immediately after publication, the piece is an anthology of stories and philosophical texts in defence of male homosexuality. \n \n One story deals with cross-dressing and others are translations of Greek and Latin homoerotic texts. It also includes the passage: \"Unnatural desire is a contradiction in terms; downright nonsense. Desire is an amatory impulse of the inmost human parts.\" \n \n Dr Gladfelder said: \"This must be the first substantial treatment of homosexuality ever in English. The only other discussions of homosexuality were contained in violently moralistic and homophobic attacks or in trial reports for the crime of sodomy up to and beyond 1750. \n \n \"I came across the scroll in a box of uncatalogued legal documents from 1750 at the National Archive in Kew. No copies of the document survive but on an indictment scroll there were long extracts from the book. So the eighteenth century courts - who were trying to suppress this - unwittingly helped publicise it 258 years later. \n \n \"I think what happened to Cannon paved the way for 200 years of homophobic repression. In fact, it wasn't until 1967 that homosexuality became legal in the UK. And sodomy was a capital offence punishable by death until 1861.\" \n \n He added: \" We know very little about Cannon. But we do know he had to leave the country for Europe to avoid indictment. \n \n \"Interestingly, his father was Dean of Lincoln Cathedral and his grandfather was Bishop of Norwich and Ely. He was also a sometime friend - and rival - of John Cleland, author of the erotic classic ' Fanny Hill or the Memoirs of a Woman of Pleasure' in 1748. Cleland was author of the only other text of the period containing an explicit scene of male homosexuality. \n \n \"It's a fair assumption that Cannon was writing for a gay subculture at the time - which has largely remained hidden. Though he lived in anonymity - possibly because of the notoriety of his pamphlet - I certainly regard him as a martyr. His life has many parallels with Oscar Wilde, who was persecuted by the law, forced into exile, and effectively silenced for being an apologist and advocate of same-sex love. But in Cannon's case, the silencing was more successful: virtually all traces of his life and work disappeared for 250 years.\" \n http://www.physorg.com/news96733007.html", 
   {
    "post_info": {
     "post_title": "18th century writings of first gay activist discovered"
    }
   }, 
   null, 
   null, 
   1177542360.0
  ], 
  [
   260412, 
   null, 
   "Archangel", 
   "So what ! Of course there were gays in 17th Century England. It's Europe for crying out loud. We didn't have any here yet though. emoticon_xgood Well, ok. Maybe we had a few, but 2 of them were decorators and one was a blacksmith so they got along with everyone. :) emoticon_xangel emoticon_smile emoticon_xbye emoticon_rolleyes", 
   {}, 
   260400, 
   null, 
   1177558860.0
  ], 
  [
   260415, 
   null, 
   "Matthew S", 
   "So what ! Of course there were gays in 17th Century England. It's Europe for crying out loud. We didn't have any here yet though. emoticon_xgood Well, ok. Maybe we had a few, but 2 of them were decorators and one was a blacksmith so they got along with everyone. :) emoticon_xangel emoticon_smile emoticon_xbye emoticon_rolleyes\n\n There were more then 3\n http://www.androphile.org/preview/Culture/NativeAmerica/amerindian.htm", 
   {}, 
   260412, 
   null, 
   1177561920.0
  ], 
  [
   260466, 
   null, 
   "Kronus", 
   "So what ! Of course there were gays in 17th Century England. It's Europe for crying out loud. We didn't have any here yet though. emoticon_xgood Well, ok. Maybe we had a few, but 2 of them were decorators and one was a blacksmith so they got along with everyone. :) emoticon_xangel emoticon_smile emoticon_xbye emoticon_rolleyes\n\n \n Impressive. Misses the point, biggoted, and regionalistic. You've got a whole ignorance trifecta going there! Well done. emoticon_xgood", 
   {}, 
   260412, 
   null, 
   1177625340.0
  ], 
  [
   260478, 
   null, 
   "samiinh", 
   "Impressive. Misses the point, biggoted, and regionalistic. You've got a whole ignorance trifecta going there! Well done. emoticon_xgood\n\n \n I am sure Archie made his statement with a little smile, knowing full well that it was untrue. emoticon_xangel", 
   {}, 
   260466, 
   null, 
   1177629720.0
  ], 
  [
   260759, 
   null, 
   "AntDogg", 
   "So what ! Of course there were gays in 17th Century England. It's Europe for crying out loud. We didn't have any here yet though. emoticon_xgood Well, ok. Maybe we had a few, but 2 of them were decorators and one was a blacksmith so they got along with everyone. :) emoticon_xangel emoticon_smile emoticon_xbye emoticon_rolleyes\n\n \n I am praying to the great Allah right now that he isn't serious.emoticon_wow emoticon_xdonno", 
   {}, 
   260412, 
   null, 
   1177816920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  18th century writings of first gay activist discovered", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9820-18th-century-writings-first-gay-activist-discovered.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9820, 
  "discussion_files": [
   [
    "3184.html", 
    "http://www.4forums.com/political/gay-rights-debates/9820-18th-century-writings-first-gay-activist-discovered-print.html"
   ]
  ], 
  "identifier": 9820
 }
]