[
 [
  [
   260536, 
   null, 
   "valet_dave", 
   "Have you spent many moments thinking to yourself \"you know, I'd REALLY like to see some innocent people graphically and violently maimed or slaughtered for no real rhyme or reason\"? Is it fantasy you are after, or would you just like to fuel a sick mind?\n \n Well, I guess you have a few choices. Some people might act on the voices in their head, by joining the army and heading to Iraq, while others might simply venture down to their local video/DVD store. Assuming the latter, you will obviously notice an aisle... like a ray of sunshine... titled the \"horror\" section.\n \n I find it deeply disturbing that I live amongst a group of people that have a keen interest in seeing other people slaughtered in hard core horror movies. I've noticed even the most mild mannered Clark Kent type people can have this morbid fascination. Okay, so I have no problem seeing \"The Running Man\" slice and dice his way through an aggressor who was trying to give him a rectal chainsaw-ectomy, but that was clearly self defence! Now take a film about a chainsaw operator who likes to cut people because they give off a pretty red spray, and because he likes decorating his apartment with fresh corpses, without any ridiculous one liners, but just for the beautiful purity of gore. This simply cannot be an example of well intentioned entertainment.\n \n So if you're sitting there alone thinking \"gosh, it's been hours since I've seen someone's head cut off with an angle grinder, I think I'd better go and rent a horror film\", you need therapy... FAST.", 
   {
    "post_info": {
     "post_title": "Horror flicks are for the sick"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1177654740.0
  ], 
  [
   260538, 
   null, 
   "valet_dave", 
   "I should clarify that I'm not saying people are incapable of distinguishing reality from fiction (well, the majority of people at least), but I am saying people need to question why this is seen as an acceptable form of entertainment. I've heard the convenient terms such as \"visual art\", but hard core horror films are simply products of a sick mind. Granted, the \"special effects\" in many of these films are of a professional standard, but they can never take the audience away from what is a flawed message. The only thing that makes sense, is the fact that movie makers can turn some profits by appealing to people who get off on senseless violence.\n \n Now before you cut me down with a blunt kitchen knife and gurgle my demon ridden blood in the name of your split personality, I do understand that violence surrounds our world, that is has been entrenched in our society since the beginning of existence. I can also see there are some educational uses for depicting high level violence in terms of understanding the horrible tragedy of war, persecution or criminal activity in the context of actual events, but somehow I don't think this is the focus of your average horror film. I am also not arguing that people don't have a right to watch what they want. What I am arguing is that we have a serious problem with people feeling a need to view other people senselessly killed. Is it curiosity, or just plain sadism?\n \n Surely we don't want our kids growing up watching material that essentially desensitizes them from what are heinous crimes. This is particularly relevant when the advancements in movie making technology have made these types of killings virtually indistinguishable, in the graphical sense, from actually being at the scene of such a crime. People are living these events, and more disturbingly, loving them.\n \n Now I can see there are some educational uses for depicting high level violence in terms of gaining some kind of understanding of the horrible tragedy of war, persecution or criminal activity, but somehow I don't think this is the focus of your average horror film. Sure people have a right to watch what they like, when they like, but there has to be questions asked when people feel a need to view other people being senselessly killed. Is it curiosity, or just plain sadism?\n \n I'm no pacifist, I accept that some disputes will inevitably involve bloodshed, simply because of the stubbornness, ignorance and lunacy that often provides the solid foundation for a brutal rampage. But this is hardly an activity that is worthy of promotion, even if we cloak it in true Hollywood style.", 
   {
    "unicode_changes_made": true
   }, 
   260536, 
   null, 
   1177655880.0
  ], 
  [
   260544, 
   null, 
   "Symbiote", 
   "I'm not aware of any popular films where the hero is someone involved in senseless slaughter.\n \n \nNow take a film about a chainsaw operator who likes to cut people because they give off a pretty red spray, and because he likes decorating his apartment with fresh corpses, without any ridiculous one liners, but just for the beautiful purity of gore. This simply cannot be an example of well intentioned entertainment.\n\n \n What film is this?\n \n If you're talking about the Texas Chainsaw Massacre, the villain involved is more of a plot device, its not about his story, its about the story of the people trying to avoid being killed by him.\n \n \n they can never take the audience away from what is a flawed message.\n\n \n Again, what message?\n \n I think the fact you avoid watching these films means you don't know what they are about, or what their message is.", 
   {}, 
   260538, 
   null, 
   1177660860.0
  ], 
  [
   260557, 
   null, 
   "Zardoz", 
   "Horror movies provide the fear response that humans miss from our safe and secure society.\n \n Much like how some go to amusement parks for the adrenalin rush and scare some rides provide.\n \n If you don't like it, don't go.\n \n But, for what it's worth, the special effects of deaths in the movies are seldom like it is in real life.", 
   {}, 
   260544, 
   null, 
   1177677600.0
  ], 
  [
   260565, 
   null, 
   "jitobear", 
   "Some people like to be scared out of their wits so they watch horror. Some people like puzzles so they like a good murder mystery or ghost yarn. Some people like slap stick. Some of it is art, some of it is just entertainment. There are many faucets to the human experience; love, humor, fear, violence, sex, the unknown. None of it should ever be considered not OK to pique our interest. That is what fiction is for to explore everything about us - even the taboo, even the macabre, even the gross - in a safe way.\n \n And I hate statements like the below. Reeks of censorship. I don't like horror flicks myself. Its easily not problem for me by by not watching them.\n \n \nI am saying people need to question why this is seen as an acceptable form of entertainment.\n", 
   {}, 
   260557, 
   null, 
   1177687620.0
  ], 
  [
   260578, 
   null, 
   "Archangel", 
   "The problem with the venues of violent video games and horror/slasher/violent films is that their main demographic group is young teens. It has been proven overwhelmingly in studies that those who become desensitized to violence and inflicting pain on others by these very violent mediums at a young age are much more likely to commit violent acts on others eventually. I don't think violent video games and movies should be with-held from adults, but impressionable teens should be protected from these mediums for sure in my opinion until they're old enough to understand the true impact they have on ones psyche.", 
   {}, 
   260565, 
   null, 
   1177692300.0
  ], 
  [
   260640, 
   null, 
   "jitobear", 
   "The problem with the venues of violent video games and horror/slasher/violent films is that their main demographic group is young teens. It has been proven overwhelmingly in studies that those who become desensitized to violence and inflicting pain on others by these very violent mediums at a young age are much more likely to commit violent acts on others eventually. I don't think violent video games and movies should be with-held from adults, but impressionable teens should be protected from these mediums for sure in my opinion until they're old enough to understand the true impact they have on ones psyche.\n\n \n I would tend to agree with you - and that is what the rating system is for. I also think this densitization tends to lead to problems when it is coupled with a kid who is hurting - being bullied - or being neglected at home.\n \n My son is 12 and I let him see violence depending on the context. Rambo blowing things up just for the sake of blowing things up is out. A battle scene in a film about Rome would be something else. I also consider the level of fantasy. I worry less about Star Wars and Hobits than something like the Bourne Identity.", 
   {}, 
   260578, 
   null, 
   1177726500.0
  ], 
  [
   260892, 
   null, 
   "valet_dave", 
   "I'm not aware of any popular films where the hero is someone involved in senseless slaughter.\n \n What film is this?\n\n At the moment, I don't have a particular film in mind, I am talking generally about \"slasher\" films. They need not even be popular films. I have to say, I probably wouldn't call one of the slasher types a \"hero\", so hopefully we're discussing the same genre. \n \n \n\n Again, what message?\n \n\n The message I am taking is simply, that senseless murder is an acceptable form of entertainment. I'm not rating the plot, or the special effects, just that hacking people to pieces in the context I previously described is not necessarily a healthy pursuit for segments of society.\n \n\n I think the fact you avoid watching these films means you don't know what they are about, or what their message is.\n\n I admit I do try to avoid them, but I've seen enough films and film highlights to qualify a comment. I'm not so much reviewing movies as I am commenting on the market for hard core violence.", 
   {}, 
   260544, 
   null, 
   1177911480.0
  ], 
  [
   260898, 
   null, 
   "Symbiote", 
   "The message I am taking is simply, that senseless murder is an acceptable form of entertainment.\n\n \n They don't send the message that senseless murder is acceptable entertainment.....\n \n They aren't about people who find out killing is a good old time, they're usually about escaping from killers, and in the end the killer is typically caught or killed (albeit often to be brought back for a sequel).\n \n \njust that hacking people to pieces in the context I previously described is not necessarily a healthy pursuit for segments of society.\n\n \n You're confusing reality and fiction. People who see a movie aren't \"hacking people to death\", they're watching a film in which fictional characters are hacked to death.\n \n \nI probably wouldn't call one of the slasher types a \"hero\"\n\n \n If the slasher isn't a hero, how do slasher films promote slashing? That's like saying COPS promotes stealing things, or Lord of the Rings promotes being an Orc.", 
   {}, 
   260892, 
   null, 
   1177914180.0
  ], 
  [
   260899, 
   null, 
   "valet_dave", 
   "\n And I hate statements like the below. Reeks of censorship. I don't like horror flicks myself. \n \n\n I'm not sure if I'm even asking for this stuff to be banned, but just questioning why anyone would find this entertaining and why this material has a market. Don't people get enough bloodshed in reality?\n \n \n\n Its easily not problem for me by by not watching them.\n \n\n Speaking of statements we hate! Would you perhaps consider that a disturbed individual who loves this type of simulated violence could one day make it your problem, as unlikely as it could be? Would you be a victim of crime asking why society didn't do more?", 
   {}, 
   260565, 
   null, 
   1177914300.0
  ], 
  [
   260900, 
   null, 
   "valet_dave", 
   "But, for what it's worth, the special effects of deaths in the movies are seldom like it is in real life.\n\n I agree, death in real life is much more confronting... and often a lot less spectacular. I guess one disturbing trait of some horror flicks is the way they try to minimise any real sense of loss or devastation that would normally surround an execution. Which makes perfect sense in the movie world, because grieving needs to be succinct in order to get to the revenge slaying.", 
   {}, 
   260557, 
   null, 
   1177915020.0
  ], 
  [
   260932, 
   null, 
   "jitobear", 
   "Speaking of statements we hate! Would you perhaps consider that a disturbed individual who loves this type of simulated violence could one day make it your problem, as unlikely as it could be? Would you be a victim of crime asking why society didn't do more?\n\n \n Yes - I would take that risk over living in a society where what I see and hear is dictated by others.\n \n I know two people who love gory horror flicks. Neither are sick, desensitized, murdering machines. Hell, one of them is the world's biggest sweetie.\n \n I think blaming arts/entertainment for the actions of individuals is a cop-out. My aunt blames The Who for her nephews suicide because he listened to them a lot. Give the human race a tich more credit would you? Although I do believe that being exposed to violece without guidance can lead to desensitization; the band/horror flick/etc. isn't really the problem.", 
   {}, 
   260899, 
   null, 
   1177942920.0
  ], 
  [
   261000, 
   null, 
   "sinjin", 
   "Don't people get enough bloodshed in reality?\nNo, they don't.", 
   {}, 
   260899, 
   null, 
   1177965360.0
  ], 
  [
   261349, 
   null, 
   "TANSTAAFL'07", 
   "You guys are arguing about NOTHING. Valet was stating an opinion! Move on! GOD!", 
   {
    "post_info": {
     "post_title": "Dear god..."
    }
   }, 
   261000, 
   null, 
   1178140320.0
  ], 
  [
   261355, 
   null, 
   "jim's trucking", 
   "You guys are arguing about NOTHING. Valet was stating an opinion! Move on! GOD!\ndotorg!\n \n Our propensity for viewing violence and destruction comes naturally. Likely for thousands of years, men have taught their sons to fight and kill the enemy. Just because we've substantially abandonned clan warfare and murderous rampages against those 'unknown neighbors' does not cancel our lust to watch horrible things happen to other people.\n \n Speaking of opinions, I think the electronic gaming industry breeds more violence than movies and songs...they give the user control and practice in anihilating some sort of enemy. IIRC, there's more than one game that rewards cop killing...just the thing for a young punk potential gang member!", 
   {}, 
   261349, 
   null, 
   1178141820.0
  ], 
  [
   269957, 
   null, 
   "Aivlis", 
   "I think we need to be careful when discussing the ramifications of ART. While you may not think that Texas Chainsaw Massacre is considered art, it is still a fictional movie which is considered to be an art form and therefore, it is arguably art. Art reflects/imitates life, so therefore; some art will have the macabre, comedy, tragedy, romance etc. It seems that movies are held to a higher standard, perhaps because we see ourselves performing these roles, or we associate with the actual physical characters of the people in the moving pictures. Versus of course paintings, pictures, music etc which are more removed from our daily life. We must also remember to suspend out disbelief, we must remember that these are accounts of fiction and I think most level headed people realize that. I agree with the poster who said that video games seem to be the real culprit. Not only do they perpetuate sedentary lifestyles, but they also directly involve the user to the action versus a more detached \"voyeuristic\" approach to film.\n \n I'm not particularly a fan of gory slasher films, but my two favorite movies are The Exorcist and Poltergeist. Both of these films have little or no blood in them, and while The Exorcist is probably for more mature audiences, Poltergeist is a much milder drama/mystery if you will. I have been watching these movies from a young girl and consider myself to be far removed from violence.\n \n On the other hand, my step-brother who was raised \"sheltered\" and never saw a scary movie growing up, had to cover his face and cry under the blanket while watching Jeepers' Creepers at age 12. Go figure.", 
   {
    "unicode_changes_made": true
   }, 
   261355, 
   null, 
   1182463500.0
  ], 
  [
   270013, 
   null, 
   "Phunting", 
   "Agreed. Horror is an integral part of the human makeup. The stories we tell are outlets for this. It gives us a chance to confront our fears, to live what we secretly want to live, to face death and then walk home afterwards. It is macabre wish fulfillment, and to be honest I feel a lot happier to have it there so people can vent their tensions than have them build up with no outlet but real life.\n \n And good horror personifies sociological themes; it addresses aspects of human existence and explores them just as any good art should do.\n \n I love horror, and whilst I may not be particularly into the slasher sub-set, I'll certainly defend the genre from criticism.", 
   {}, 
   269957, 
   null, 
   1182477060.0
  ], 
  [
   270015, 
   null, 
   "Phunting", 
   "I'm not aware of any popular films where the hero is someone involved in senseless slaughter.\n\"American Psycho\"? And whilst I've not seen it I think the eponymous character in \"Henry: Portrait of a Serial Killer\" also could fit the bill.", 
   {}, 
   260544, 
   null, 
   1182477300.0
  ], 
  [
   275234, 
   null, 
   "Iuris", 
   "The above arguments for why we watch horror movies explain it all.\n \n I'd only add one more thing: mostly, the gore in movies is unnecessary and indicates a director that still hasn't realized that real suspense is not helped by gore...", 
   {}, 
   270015, 
   null, 
   1185271020.0
  ], 
  [
   280347, 
   null, 
   "Jim Colyer", 
   "I tend to believe that folks who enjoy horror films are somehow mentally ill.", 
   {}, 
   260536, 
   null, 
   1187995080.0
  ], 
  [
   280379, 
   null, 
   "sinjin", 
   "I tend to believe that folks who enjoy horror films are somehow mentally ill.\nI feel the same way about fans of Abba.emoticon_xagree", 
   {}, 
   280347, 
   null, 
   1188001980.0
  ], 
  [
   280948, 
   null, 
   "chemist99a", 
   "http://www.4forums.com/political/member.php?u=1507\n \n People like to scare themselves just for the hormone flow it induces. Its the adrenalin and it does not indicate any sort of sickness. Roller coasters, base jumping, horror movies with surprises, halloween ghost houses, tales told round the campfire, haunted houses, and so forth and so on. Maybe they need a little stimulation but I don't think they are sick. We enjoy being scared when the threat is not real - its like a good cup of coffee.", 
   {}, 
   280379, 
   null, 
   1188208380.0
  ], 
  [
   304426, 
   null, 
   "Jim Colyer", 
   "I agree that there are way too many horror movies made today. It is hard to say why people desire this kind of thing. Back during the golden age of Hollywood, there were almost none. Society was healthier.", 
   {}, 
   260536, 
   null, 
   1204609080.0
  ], 
  [
   311026, 
   null, 
   "El Arte", 
   "Horror movies provide the fear response that humans miss from our safe and secure society.\n \n Much like how some go to amusement parks for the adrenalin rush and scare some rides provide.\n \n If you don't like it, don't go.\n \n But, for what it's worth, the special effects of deaths in the movies are seldom like it is in real life.\n\n \n Yeah, but there have been a few studies written that argue games, music, video, etc do have effects, positive and negative depending on the message and whether someone is sympathetic to the message or not.", 
   {}, 
   260557, 
   null, 
   1210904400.0
  ], 
  [
   311268, 
   null, 
   "DrNo", 
   "The problem with the venues of violent video games and horror/slasher/violent films is that their main demographic group is young teens. It has been proven overwhelmingly in studies that those who become desensitized to violence and inflicting pain on others by these very violent mediums at a young age are much more likely to commit violent acts on others eventually. I don't think violent video games and movies should be with-held from adults, but impressionable teens should be protected from these mediums for sure in my opinion until they're old enough to understand the true impact they have on ones psyche.\n\n \n Really? What studies have proved this? If those studies are correct (and actually exist), you wouldn't even need to know about the studies because there would be crazy desensitized teens running around murdering people everywhere. Hundreds of millions (if not billions) on this planet play violent video games, watch violent movies, listen to violent music, etc. and yet they are not out slaughtering people.\n \n If you ask me, these medium are an outlet for violence and probably prevent more violent crime than they cause.", 
   {}, 
   260578, 
   null, 
   1211221560.0
  ], 
  [
   311276, 
   null, 
   "iangb", 
   "The purpose of a rating system is to prevent young teens, your 'main demographic', from viewing inappropriate material. Whether you agree with this or not is a different matter, but currently the onus is entirely on parental/storeowner discretion and not on the film-producers themselves, given that your main worry is about youth viewing.", 
   {}, 
   311268, 
   null, 
   1211224260.0
  ], 
  [
   311387, 
   null, 
   "Peeling", 
   "I agree that there are way too many horror movies made today. It is hard to say why people desire this kind of thing. Back during the golden age of Hollywood, there were almost none. Society was healthier.\n\n Au contraire.", 
   {}, 
   304426, 
   null, 
   1211296680.0
  ], 
  [
   320020, 
   null, 
   "EchoR1", 
   "i love horror films and if saying that makes me sick in your eyes, then i'm sick.\n \n i think its facinating how people can find new ways to scare or sicken a person and then put it into film.\n \n for example, my first horror movie was the exorcism of emily rose and i wasn't too religious so the thought of an exorcism didn't have an effect on me. i saw the trailer and i did feel very afraid and scared and that amazed me because whoever created the film dug into my brain and found away to scare me.\n \n ... no worries though i saw the film and i laughed my XXX off.\n \n but if you review some of the films now: Saw is basically telling you to do good and appreciate your life or you'll get punished for it, Hostel is a bit freaky because its scary to think that you could be hunted by another man, even old werewolf and vampire stories are freaky because you cannot absolutely 100% be completely positively sure something like that can't happen.\n \n now i'm not saying that these movies are always scary, but with people finding ways to dig into our brains and make us think like that is amazing. \n \n Stay Alive: personally i never dreamt of dying like i would if i died in a video game.\n \n Bug: never once crossed my mind bugs could enter my skin\n \n Mirrors: (new) who would have thought that your reflection could be so deadly?\n \n i mean as scary, lame, or whatever you think of them, it truely is genious to come up with things like that.\n \n once again: if you think i'm sick because i think this way then i'm proud to be a sick person.", 
   {
    "post_info": {
     "post_title": "ok well..."
    }
   }, 
   260536, 
   null, 
   1218519660.0
  ], 
  [
   320025, 
   null, 
   "Shooterandproud", 
   "The problem with the venues of violent video games and horror/slasher/violent films is that their main demographic group is young teens. It has been proven overwhelmingly in studies that those who become desensitized to violence and inflicting pain on others by these very violent mediums at a young age are much more likely to commit violent acts on others eventually. I don't think violent video games and movies should be with-held from adults, but impressionable teens should be protected from these mediums for sure in my opinion until they're old enough to understand the true impact they have on ones psyche.\n\n \n I do agree that the main demographic for these films is young teens and tweens. I remember this from middle school, because everyone though it was so cool to watch the most violent movies and play the most bloody video games, because not everyone's parents allowed them to. This made them somehow think they were \"cool\". My parents were very strict about this when I was young, and they didn't let me play rated \"T\" games until I was 12, and didn't let me watch some PG-13 movies until I was a little over 11. Its disturbing. When I was eleven and twelve all of my peers were bragging about how much they play Grand Theft Auto, or how many times they've seen The Exorcist and Saw.", 
   {}, 
   260578, 
   null, 
   1218524460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Horror flicks are for the sick", 
  "url": "http://www.4forums.com/political/entertainment-debates/9823-horror-flicks-sick.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 9823, 
  "discussion_files": [
   [
    "8987.html", 
    "http://www.4forums.com/political/entertainment-debates/9823-horror-flicks-sick-print.html"
   ], 
   [
    "8988.html", 
    "http://www.4forums.com/political/entertainment-debates/9823-horror-flicks-sick-2-print.html"
   ]
  ], 
  "identifier": 9823
 }
]