[
 [
  [
   260956, 
   null, 
   "Symbiote", 
   "http://en.wikipedia.org/wiki/Phlogiston\n \n \nThe phlogiston theory (from the Ancient Greek phlogios: \"fiery\") is an obsolete scientific theory, stated initially in 1667 by Johann Joachim Becher, whereby in addition to the classical four elements of the Greeks, there was an additional fire-like element called \"phlogiston\" that was contained within combustible bodies, and released, to lesser or greater degrees, during combustion. The theory was an attempt to explain oxidation processes, such as combustion and the rusting of metals.\n \n Contents [hide]\n 1 Theory \n 2 Challenge and demise \n 3 Enduring aspects \n 4 References \n \n \n \n [edit] Theory\n The theory holds that all flammable materials contain phlogiston, a substance without color, odor, taste, or weight that is liberated in burning. Once burned, the \"dephlogisticated\" substance was held to be in its \"true\" form, the calx.\n \n \"Phlogisticated\" substances are those that contain phlogiston and are \"dephlogisticated\" when burned. Since any substance could be observed to burn for only a limited time with air (for instance in a sealed container), air was thought to have a specific capacity for phlogiston.\n \n Joseph Black's student Daniel Rutherford discovered nitrogen in 1772 and the pair used the theory to explain his results. The residue of air left after burning, in fact a mixture of nitrogen and carbon dioxide, was sometimes referred to as \"phlogisticated air\", having taken up all of the phlogiston.\n \n Conversely, when oxygen was first discovered it was thought to be \"dephlogisticated air\", capable of combining with more phlogiston and thus supporting combustion for longer than ordinary air.\n \n \n \n \n \n [edit] Challenge and demise\n Eventually, quantitative experiments revealed problems, including the fact that some metals, such as magnesium, gained weight when they burned, even though they were supposed to have lost phlogiston. Mikhail Lomonosov attempted to repeat Robert Boyle's celebrated experiment in 1753 and concluded that the phlogiston theory was false. He wrote in his diary: \"Today I made an experiment in hermetic glass vessels in order to determine whether the mass of metals increases from the action of pure heat. The experiment demonstrated that the famous Robert Boyle was deluded, for without access of air from outside, the mass of the burnt metal remains the same.\"\n \n Some phlogiston proponents explained this by concluding that phlogiston had \"negative weight\"; others, such as Louis-Bernard Guyton de Morveau, gave the more conventional argument that it was lighter than air. However, a more detailed analysis based on the Archimedean principle and the densities of magnesium and its combustion product shows that just being lighter than air cannot account for the increase in mass.\n \n Still, phlogiston remained the dominant theory until Antoine-Laurent Lavoisier showed that combustion requires oxygen, solving the weight paradox and setting the stage for the new caloric theory of combustion.\n \n In some respects, the phlogiston theory can be seen as the opposite of the modern \"oxygen theory\". The phlogiston theory states that all flammable materials contain phlogiston that is liberated in burning, leaving the \"dephlogisticated\" substance in its \"true\" calx form. In the modern theory, on the other hand, flammable materials (or unrusted metals) are \"deoxygenated\" when in their pure form and become oxygenated when burned.\n \n \n [edit] Enduring aspects\n Phlogiston theory allowed chemists to bring explanation of apparently different phenomena into a coherent structure: combustion, metabolism, and formation of rust. The recognition of the relation between combustion and metabolism was a forerunner of the recognition that the metabolism of living creatures and combustion can be understood in terms of fundamentally related chemical processes.\n \n\n \n The vitalist notion that all burning results in a loss of phlogiston is exactly the same for magnesium as for any other compound!\n \n If you do not understand how the refutal of phlogiston blatantly contradicts the fundamental principles of your vaunted \"Vitalism\", (aka, the idea that moneys can perform magic with the aid of pink sand\", in concert with the pagan 'Thor' you guys call, \"Oxygen\" '), then you really don't understand your own \"Vitalism\" all that well.\n \n Don't before responding, vitalists, your tedious explanations are a real yawn to me, either admit that you believe in Phlogiston theory so I can call you an idiot or get out of here with your pea sized brains that don't even understand your own theory.\n \n Clearly I am a superior intellect and understand \"Vitalism\" extremely well.", 
   {
    "post_info": {
     "post_title": "Phlogiston refuted, Vitalists outraged!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1177950660.0
  ], 
  [
   260964, 
   null, 
   "Archangel", 
   "Clearly I am a superior intellect and understand \"Vitalism\" extremely well.\n\n \n I don't know about Phlogiston but clearly you are a legend in your own mind. emoticon_xgood emoticon_smile", 
   {}, 
   260956, 
   null, 
   1177951620.0
  ], 
  [
   266335, 
   null, 
   "chemist99a", 
   "Sorry to hear about the demise of the mighty phlogiston. It was a hot theory in its day but you cannot stay on top forever. Perhaps it can find a room at the old theories home and talk to visiting science students as a historical fossil. Or perhaps the Creationist Museum (vitalist subsection) could adopt it for its remaining lifetime. \n \n Alas poor Phlogiston we knew thee well. Rest in peace.", 
   {}, 
   260964, 
   null, 
   1180871820.0
  ], 
  [
   266360, 
   null, 
   "lesz", 
   "Both phlogiston and oxygen are naturalistic lies! Everyone knows the Designer controls combustion through Intelligent Burning. It's right up there with the replacement of Newton and Einstein with Intelligent Falling.", 
   {}, 
   266335, 
   null, 
   1180885020.0
  ], 
  [
   266386, 
   null, 
   "GrannyM", 
   "Sorry to hear about the demise of the mighty phlogiston. . . . Perhaps it can find a room at the old theories home and talk to visiting science students as a historical fossil. Or perhaps the Creationist Museum (vitalist subsection) could adopt it for its remaining lifetime. \n \n \n\n \n http://www.daytondailynews.com/o/content/oh/index/opinions/mike-peters/cartoons/3.html", 
   {}, 
   266335, 
   null, 
   1180893600.0
  ], 
  [
   266403, 
   null, 
   "trebor", 
   "The difference between science and creationism", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   266386, 
   null, 
   1180900980.0
  ], 
  [
   266452, 
   null, 
   "chemist99a", 
   "http://www.daytondailynews.com/o/content/oh/index/opinions/mike-peters/cartoons/1.html\n \n GrannyM: That onoes better yet. More like what the public is being exposed to these days.", 
   {}, 
   266403, 
   null, 
   1180914720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Phlogiston refuted, Vitalists outraged!", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9840-phlogiston-refuted-vitalists-outraged.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9840, 
  "discussion_files": [
   [
    "2687.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9840-phlogiston-refuted-vitalists-outraged-print.html"
   ]
  ], 
  "identifier": 9840
 }
]