[
 [
  [
   261182, 
   null, 
   "huckleberry", 
   "Below is a post from a previous discussion on maternal instinct. It lead me to this question as well. Any thoughts?\n \n \nHuck, we humans generally make a distinction between ourselves and the rest of the animal world.\n \n It is true that we belong to the animal kingdom, that we are warm-blooded mammals, but having risen somewhat in the kingdom because we're probably smarter than the other beasties, other agencies rule our behavior. We have devised an intricate code of conduct that the other beasties lack.\n \n Zoologists indicate that the roots of our code are visible in other species but we have had the advantage over other species in being able to widely communicate with each other and the ability to pool our knowledge, not to mention the ability to debate and hammer out better rules of conduct.\n \n Furthermore, there is an amazing differential in the behavior of humans. Some behavior may appear to be instinctual but. . .\n \n We are still, largely, at the mercy of our hormones but again our code of behavior may serve to overrule our hormonal impulses.\n \n We are creatures of artifice. We have created ourselves. We have the power to recreate ourselves in other ways.\n \n The other beasties seem not to care much for artifice--in truth, they are so preoccupied with seeking food and reproducing and mere survival that they have little time for such pursuits--had they even the inclination.\n\n \n Women are indeed not animals and humans are not animals (in the sense you are discussing).\n \n However, please note the value that you place on humans is above the value you place on animals. You are saying that an animal life is not worth the same as a human life. (I am not trying to argue about animal rights)\n \n However, at what point does a human become a human and more than animals. This gets into the rights of the unborn or the elderly or the physically disabled. Where does that value start and stop.\n \n This would seem to be an important discussion in terms of civil rights. I shall start another thread if anyone cares to post to it.\n \n \n", 
   {
    "post_info": {
     "post_title": "At what point are civil rights conveyed or removed?"
    }
   }, 
   null, 
   null, 
   1178046900.0
  ], 
  [
   261315, 
   null, 
   "Another opinion", 
   "However, at what point does a human become a human and more than animals. This gets into the rights of the unborn or the elderly or the physically disabled. Where does that value start and stop.\n\n In the context of the abortion debate, many of us argue that rights start at the beginning of some level of mental existence - which only happens around the beginning of the third trimester when the cerebral cortex is sufficiently developed. This is the view that I hold and it stems from the view that we are not only our bodies. The existence of some level of mind is critical to our existence - as in \"I think, therefore, I am\". This would apply at the end of life as well. Once our brains are sufficiently degraded so there is no longer any sense of self, then we no longer exist as people and rights no longer apply.\n \n As for human vs animal, I think animals deserve certain rights - ex. against cruel treatment - but would not give animals the same rights as humans. Partly, my preference of humans is simply based on bias towards may own species. After all, if we gave all animals the same rights as humans, our survival would be greatly threatened. Also, animals have much lower levels of judgement and constraint of behavior, so that would limit the rights given them. \n \n An interesting question comes up which may become ever more relevant in decades to come. Namely, with the advent of genetic engineering and cloning, one could hypothetically generate a human-chimp hybrid. Indeed, I heard that a patent application had been filed for just such a creature in order to generate the debate on the patentability of life and on the rights of such creatures. I have heard that a sheep and goat have already been similarly mixed, so we are probably not too far away from such technology for mixing humans with chimps. I have also heard that, currently, certain swine have various human genes added to them so that some of their organs would be compatible with humans for organ transplants.\n \n So, the question comes up - how much human genetic content makes a creature human enough for human rights?", 
   {}, 
   261182, 
   null, 
   1178128440.0
  ], 
  [
   261395, 
   null, 
   "huckleberry", 
   "In the context of the abortion debate, many of us argue that rights start at the beginning of some level of mental existence - which only happens around the beginning of the third trimester when the cerebral cortex is sufficiently developed. This is the view that I hold and it stems from the view that we are not only our bodies. The existence of some level of mind is critical to our existence - as in \"I think, therefore, I am\". This would apply at the end of life as well. Once our brains are sufficiently degraded so there is no longer any sense of self, then we no longer exist as people and rights no longer apply.\n \n As for human vs animal, I think animals deserve certain rights - ex. against cruel treatment - but would not give animals the same rights as humans. Partly, my preference of humans is simply based on bias towards may own species. After all, if we gave all animals the same rights as humans, our survival would be greatly threatened. Also, animals have much lower levels of judgement and constraint of behavior, so that would limit the rights given them. \n \n An interesting question comes up which may become ever more relevant in decades to come. Namely, with the advent of genetic engineering and cloning, one could hypothetically generate a human-chimp hybrid. Indeed, I heard that a patent application had been filed for just such a creature in order to generate the debate on the patentability of life and on the rights of such creatures. I have heard that a sheep and goat have already been similarly mixed, so we are probably not too far away from such technology for mixing humans with chimps. I have also heard that, currently, certain swine have various human genes added to them so that some of their organs would be compatible with humans for organ transplants.\n \n So, the question comes up - how much human genetic content makes a creature human enough for human rights?\n\n \n \n These are all excellent points and questions. I agree with you largely. As for the abortion debate items, I would then also posit, is it reasonable then to assume that someone with alzheimers who cannot interact with their environment is no longer human and is no longer deserving of individual rights?\n \n Huck", 
   {}, 
   261315, 
   null, 
   1178150580.0
  ], 
  [
   261400, 
   null, 
   "Another opinion", 
   "These are all excellent points and questions. I agree with you largely. As for the abortion debate items, I would then also posit, is it reasonable then to assume that someone with alzheimers who cannot interact with their environment is no longer human and is no longer deserving of individual rights?\n \n Huck\n\n My criteria was mental existence - not whether or not they can interact with their environment - so alzheimers patients deserve rights. \n \n I admit that \"mental existence\" is not a well defined term and I was the one who coined it in the abortion forum. It generally applies to the most rudimentary sense of mind - be it a sense of self, rudimentary thoughts or emotions - either conscious or subconscious, a perception of pain, etc.", 
   {}, 
   261395, 
   null, 
   1178151900.0
  ], 
  [
   261544, 
   null, 
   "huckleberry", 
   "My criteria was mental existence - not whether or not they can interact with their environment - so alzheimers patients deserve rights. \n \n I admit that \"mental existence\" is not a well defined term and I was the one who coined it in the abortion forum. It generally applies to the most rudimentary sense of mind - be it a sense of self, rudimentary thoughts or emotions - either conscious or subconscious, a perception of pain, etc.\n\n \n I think I would need something a bit more substantial to discuss this better.", 
   {}, 
   261400, 
   null, 
   1178232000.0
  ], 
  [
   261646, 
   null, 
   "simone", 
   "Unfortunately, a human entity must prove its humanity and right to civil rights by surviving the rigors of pregnancy and passing through the birth channel--or surviving a surgical removal from the womb and managing to draw a breath, as well as managing to live at humanly functional level. One's risk as an entity to enter the ranks of human also depends upon the cooperation of the person owning the womb in which one proceeds to the human state, not to mention the intervening variables of war, starvation, storms, possible violence against the pregnant woman (violence against pregnant women appears to be the most life-threatening aspect of pregnancy) and other catastrophes.\n \n If one is not functioning at a humanly functional level one is entrusted to a guardian and may lose some civil rights commonly granted to human persons.", 
   {}, 
   261544, 
   null, 
   1178298720.0
  ], 
  [
   261652, 
   null, 
   "Zardoz", 
   "I love these requirements for being human.\n \n Mental existance.\n Survival.\n Dependency upon anothers wishes.\n \n To me, rights simply don't exist in any natural form without the cooperation of the social group that allows them.\n \n Taken away, given...wash rinse repeat.\n All at the whim of another.\n Reasoned or unreasoned.\n \n Call me paranoid...or simply evil (many do), but I can slippery slope this with progressively further requirements until only my select few are chosen.", 
   {}, 
   261646, 
   null, 
   1178299860.0
  ], 
  [
   261951, 
   null, 
   "simone", 
   "Dependence upon another's wishes?\n \n Or, dependence upon another's body?\n \n They aren't the same, you know.", 
   {}, 
   261652, 
   null, 
   1178469960.0
  ], 
  [
   261959, 
   null, 
   "Archangel", 
   "In the context of the abortion debate, many of us argue that rights start at the beginning of some level of mental existence - which only happens around the beginning of the third trimester when the cerebral cortex is sufficiently developed. This is the view that I hold and it stems from the view that we are not only our bodies. The existence of some level of mind is critical to our existence - as in \"I think, therefore, I am\". This would apply at the end of life as well. Once our brains are sufficiently degraded so there is no longer any sense of self, then we no longer exist as people and rights no longer apply.\n\n \n Then the arguments that many of you make of fundamentally flawed and lacking a true understanding of what defines life. To define value, or a right to life by ones mental existence is to propose that every human being who is lacking the ability to reason is not worthy of life and should be exterminated. And you know that view isn't acceptable. At least not yet.\n \n As to when life begins. It must be determined that life in fact begins at conception. The reason that is obvious is because if we take two stones and place them together for a million years, nothing intelligent will come from them as they are dead and lacking life. But medical science has known for many many decade precisely how when the EGG and the SPERM bond with each other, the resulting SEED then begins to grow resulting in a human infant 9 months later. Life undeniably begins at conception when growth begins and development starts to take place resulting in a sentient being.\n \n \nAs for human vs animal, I think animals deserve certain rights - ex. against cruel treatment - but would not give animals the same rights as humans. Partly, my preference of humans is simply based on bias towards may own species. After all, if we gave all animals the same rights as humans, our survival would be greatly threatened. Also, animals have much lower levels of judgement and constraint of behavior, so that would limit the rights given them.\n\n \n The fact and reality is that Man has always had dominion over the animal kingdom and therefor they exist to serve our needs. I totally agree with you though that animals deserve protection against cruel treatment from the sadistic practices of some cultures and sports. China skinning domestic dogs alive for their fur comes to mind, as does c@ck fighting and training Dogs to fight to the death for sport.\n \n \nAn interesting question comes up which may become ever more relevant in decades to come. Namely, with the advent of genetic engineering and cloning, one could hypothetically generate a human-chimp hybrid. Indeed, I heard that a patent application had been filed for just such a creature in order to generate the debate on the patentability of life and on the rights of such creatures. I have heard that a sheep and goat have already been similarly mixed, so we are probably not too far away from such technology for mixing humans with chimps. I have also heard that, currently, certain swine have various human genes added to them so that some of their organs would be compatible with humans for organ transplants.\n \n So, the question comes up - how much human genetic content makes a creature human enough for human rights?\n\n \n I ask myself what possible reason could science have for creating a human chimp hybrid except to create a servant Race. And I have no doubt that man is capable of such a lowly goal. But God will surely intervene before we are allowed to corrupt His creation in such a way, of this I am sure. As a hypothetical though, if I were alive when an actual hybrid was created that had the strength of a Chimp with the intelligence of an average human being, I would fight for its equal rights that all humans enjoy in this Country. Although I wouldn't vote for him to be able to marry other hybrid males as that would guarantee the demise of that very young species. :)", 
   {}, 
   261315, 
   null, 
   1178474400.0
  ], 
  [
   261961, 
   null, 
   "ShadowPikachu", 
   " I ask myself what possible reason could science have for creating a human chimp hybrid except to create a servant Race. And I have no doubt that man is capable of such a lowly goal. But God will surely intervene before we are allowed to corrupt His creation in such a way, of this I am sure. As a hypothetical though, if I were alive when an actual hybrid was created that had the strength of a Chimp with the intelligence of an average human being, I would fight for its equal rights that all humans enjoy in this Country. Although I wouldn't vote for him to be able to marry other hybrid males as that would guarantee the demise of that very young species. :)\n\n \n Oh, I don't know about your bolded part. Already there are some activists trying to get a chimp declared a 'person' so it gets some human rights, and if that eventually occurs (and I have heard of other similar attempts), a chimp-human hybrid would likely be fought for even more. (here's the link: Activists want chimp declared a person.\n \n As a total hypothetical, if such a hybrid were to be created (Anyone here ever read \"Next\" by Michael Crichton? It is quite interesting and involves a human-chimp hybrid). I would also fight for equal rights for the chimp, (unlike you, I would fight for it to have actual equal rights to marry whomever it wants to marry, be it a human, another hybrid, same-sex, or opposite sex).", 
   {}, 
   261959, 
   null, 
   1178476440.0
  ], 
  [
   262061, 
   null, 
   "Another opinion", 
   "Then the arguments that many of you make of fundamentally flawed and lacking a true understanding of what defines life. To define value, or a right to life by ones mental existence is to propose that every human being who is lacking the ability to reason is not worthy of life and should be exterminated. And you know that view isn't acceptable. At least not yet.\n\n You are misunderstanding what is meant by \"mental existence\". By mental existence, we do not mean the ability to reason. Mental existence, a term which I coined in this debate, is the most rudimentary sense of mind - be it merely a perception of self, rudimentary thoughts or emotions, a sense of pain, etc. Essentially, the beginnings of mental processes, not just physical ones. Science tells us that such mental processes start being possible around the beginning of the third trimester, when the cerebral cortex is sufficiently developed. The telltale signiature of the possible beginning of mental processes is the beginning of organized (as opposed to scattered and random) brain wave patterns. This means that Alzheimer patients have mental existence, we have mental existence when we sleep or are in coma, etc. All I require is that there is \"somebody home\" in the body, not just a body on its own.\n \nAs to when life begins. It must be determined that life in fact begins at conception. The reason that is obvious is because if we take two stones and place them together for a million years, nothing intelligent will come from them as they are dead and lacking life. But medical science has known for many many decade precisely how when the EGG and the SPERM bond with each other, the resulting SEED then begins to grow resulting in a human infant 9 months later. Life undeniably begins at conception when growth begins and development starts to take place resulting in a sentient being.\n\n I agree that life is traditionally said to begin at conception since that is the first time when the unique complete set of DNA comes together and the life starts to grow. Before that, the egg and sperm are both alive but, on their own, they have no chance to grow into a full human. It is just that most of us don't see that much of value in the newly fertilized zygote besides its potential to grow into that human. At that moment, it is just a single cell with no feelings, emotions, thoughts - nothing that one can empathize with. It isn't until late term that the developing human becomes one that we can empathize with since it finally gains some mental existence - it can suffer, perhaps it can feel fear, etc.\n \nThe fact and reality is that Man has always had dominion over the animal kingdom and therefor they exist to serve our needs. I totally agree with you though that animals deserve protection against cruel treatment from the sadistic practices of some cultures and sports. China skinning domestic dogs alive for their fur comes to mind, as does c@ck fighting and training Dogs to fight to the death for sport.\n\n Well, those religious views that I try to hold on to are not traditional so, though I may respect your right to view Man as always having dominion over animals, I personally disagree since I do trust the Scientific evidence of evolution and try to fit some religious beliefs around the unknowns of Science. However, as you said, I do believe that there should be laws against animal cruelty. It shocked me to read about those dogs in China that are skinned alive for their fur. Is that well documented and common or just rare cases that were prosecuted? Poor things. As for the US, I had always assumed that food animals were at least butchered humanely but fairly recent commercials and web sites have suggested otherwise. Though I am not a vegitarian, I would still advocate for humane treatment of food animals.\n \nI ask myself what possible reason could science have for creating a human chimp hybrid except to create a servant Race. And I have no doubt that man is capable of such a lowly goal. But God will surely intervene before we are allowed to corrupt His creation in such a way, of this I am sure. As a hypothetical though, if I were alive when an actual hybrid was created that had the strength of a Chimp with the intelligence of an average human being, I would fight for its equal rights that all humans enjoy in this Country. Although I wouldn't vote for him to be able to marry other hybrid males as that would guarantee the demise of that very young species. :)\n\n The person who wanted to patent a human-chimp hybrid did so for the purposes of starting the debate. I don't think that he intended to actually make one. However, I can well imagine that there may be many people in the medical research industry who would view such a creature as a perfect means of testing drugs coming onto the market for humans - i.e a hybrid medical test subject experimented on against its will. I hope that people are wise enough in the future to outlaw such genetic manipulations. If one did get created, though, it might be difficult to know how to handle him legally. Imagine a creature, looking partly human, with low level human intelligence but great human strength, and the agressiveness of a chimp. It is best to avoid such situations all together by prohibiting it by law.", 
   {}, 
   261959, 
   null, 
   1178554620.0
  ], 
  [
   268277, 
   null, 
   "Unriggable", 
   "The fact and reality is that Man has always had dominion over the animal kingdom and therefor they exist to serve our needs. I totally agree with you though that animals deserve protection against cruel treatment from the sadistic practices of some cultures and sports. China skinning domestic dogs alive for their fur comes to mind, as does c@ck fighting and training Dogs to fight to the death for sport.\n\n \n Wait wait wait. Always? The Bible clearly says that animals were around for some two days longer than men were (not that I buy that stuff). But you're right about everything else. Don't forget that 42% of seals are skinned alive, alot of them no older than infants. We just don't give a #### about the animals kingdom anymore.", 
   {}, 
   262061, 
   null, 
   1181626140.0
  ], 
  [
   272024, 
   null, 
   "Matthew S", 
   "I love these requirements for being human.\n \n Mental existance.\n Survival.\n Dependency upon anothers wishes.\n \n To me, rights simply don't exist in any natural form without the cooperation of the social group that allows them.\n \n Taken away, given...wash rinse repeat.\n All at the whim of another.\n Reasoned or unreasoned.\n \n Call me paranoid...or simply evil (many do), but I can slippery slope this with progressively further requirements until only my select few are chosen.\n\n \n Sadly you are correct. In many parts of the world civil rights either do not exisit or are bound by tribal traditions that limit freedom. In my experiance, here in the west, the majority gets to decide what civil rights are extended to minority groups.", 
   {}, 
   261652, 
   null, 
   1183372800.0
  ], 
  [
   272045, 
   null, 
   "Another opinion", 
   "Sadly you are correct. In many parts of the world civil rights either do not exisit or are bound by tribal traditions that limit freedom. In my experiance, here in the west, the majority gets to decide what civil rights are extended to minority groups.\n\n I think that even the worst tyrants try to have justifications for their actions and give reasons for divergent treatment of particular groups of people. When these justifications are not allowed to be questioned, then many attrocities or unfair treatment can happen. However, I continue to believe that when governments are subject to rational debate about their policies and when they are held accountable for presenting consistent evidence to support their policies, then there ends up being far less divergence in how people are treated. \n \n Most of the discrimination against people of various ethnic, racial, sexual groups are based on claims that are very hard to justify in a consistent manner - in that one can make claims that certain groups on average show certain traits but it is impossible to say that all people of a certain group show those traits and should thus be treated in a certain way. Hitler hated the Jews since, among other things, he blamed them for Germany's loss during World War I but he would have been hard pressed to present any evidence (in the ideal world where he would have been held accountable for his ideas) to defend his ideas that generalized to all Jews. Similarly, those who are racially prejudiced against African Americans can point to high crime rates, but they would be hard pressed to prove that there is something biologically inherent in African American people themselves (not their situation, etc.) that creates those high crime rates.\n \n The bottom line is that I think that, in the farely rare situation where reason truly prevails, there is an automatic tendency to a more generous view of human rights.", 
   {}, 
   272024, 
   null, 
   1183393980.0
  ], 
  [
   272381, 
   null, 
   "jyoshu", 
   "The bottom line is that I think that, in the farely rare situation where reason truly prevails, there is an automatic tendency to a more generous view of human rights.\n\n \n I think this is interesting, and in general probably true. However, I don't think the situation is very simple at all. I think it goes back to how one is going to define 'reason'. Personally, I think a better way of saying it is that \"where compassion truly prevails, there is an automatic tendency to a more generous view of human rights.\" Because I think there can definitely be cases where reason needs to be accompanied by compassion and empathy. Example: It may be an act of reason, for instance, to close down all art galleries because the money is needed for more pressing issues. But would it be the right thing to do? Not necessarily. Now, your idea of reason may incorporate compassion, empathy, and human expression, but in that case I don't consider that pure reason. In fact, if reason alone were used in the human rights debate, without compassion, I think a lot of minority groups would be in deep trouble, because pure reason might say that the needs of the many would trump the needs of the few, and therefore more resources might go toward the majority.", 
   {}, 
   272045, 
   null, 
   1183659960.0
  ], 
  [
   272391, 
   null, 
   "Another opinion", 
   "I think this is interesting, and in general probably true. However, I don't think the situation is very simple at all. I think it goes back to how one is going to define 'reason'. Personally, I think a better way of saying it is that \"where compassion truly prevails, there is an automatic tendency to a more generous view of human rights.\" Because I think there can definitely be cases where reason needs to be accompanied by compassion and empathy. Example: It may be an act of reason, for instance, to close down all art galleries because the money is needed for more pressing issues. But would it be the right thing to do? Not necessarily. Now, your idea of reason may incorporate compassion, empathy, and human expression, but in that case I don't consider that pure reason. In fact, if reason alone were used in the human rights debate, without compassion, I think a lot of minority groups would be in deep trouble, because pure reason might say that the needs of the many would trump the needs of the few, and therefore more resources might go toward the majority.\n\n I would agree that compassion would need to be in the mix. Reason, where morality and social policy is concerned, seems to often center around the type of rule which treats others as one expects to be treated. However, if there is someone who feels powerful and invincible and claims that a dog-eat-dog world is right and good, since it weeds out the weak, and he is also willing to live by those dog-eat-dog rules, then that might be viewed as a position which is based on reason but does not incorporate compassion. Outside of our feelings of compassion toward others, most of us would not like to live in such a purely dog-eat-dog world since we might not be ruthless enough to feel completely safe in it. We support the rights of the weak both out of compassion and out of a realization that, if situations and luck were different, we could be in the other person's shoes. After all, we are all just a bad head injury away from being helpless mentally incapacitated semi-vegetables. So, though appeals to compassion often work, if you cannot appeal to people's compassion in a certain situation, you might also appeal to their own self interest in presenting a \"what if\" scenario.", 
   {}, 
   272381, 
   null, 
   1183663440.0
  ], 
  [
   273325, 
   null, 
   "Winston Smith", 
   "Those who support dog-eat-dog ethics are those who think that they can always eat the other dog. But the moment the other dog begins to dine on them, then they scream for justice, compassion etc. It is similar in attitude to the capitalist maxim of privatizing profits and socializing losses. I have never seen a private company reject subsidies or protectionist measures if they foster their interests and profits.\n \n Why should the needs of the majority take precedence over the needs of the minority? For example if the majority elected to have a minority as slaves, would it be be moral? I don't think so. In that case all minorities would be subservient to the majority. This sounds like a step backwards to me.", 
   {
    "unicode_changes_made": true
   }, 
   272391, 
   null, 
   1184242440.0
  ], 
  [
   273382, 
   null, 
   "Another opinion", 
   "Those who support dog-eat-dog ethics are those who think that they can always eat the other dog. But the moment the other dog begins to dine on them, then they scream for justice, compassion etc. \n\n I would agree, though I would add that many of those who support a dog-eat-dog ethical system might truly be deluding themselves into thinking that they are invincible and would never have to face the down side, so they don't worry about it. They may not realize their folly until it is too late. Meanwhile, they may well succeed in convincing others of their stance. \n \n Not that this is a great example, but it reminded me of certain Republicans who wanted to take away the fillibuster. However, enough of them realized that they themselves could be out of power one day that they were wise enough to keep it. If those Republicans who pushed for getting rid of the fillibuster had succeeded, they would have now had a taste of their own medicine.\n \nIt is similar in attitude to the capitalist maxim of privatizing profits and socializing losses. I have never seen a private company reject subsidies or protectionist measures if they foster their interests and profits.\n\n Companies will take whatever they can get away with. We, the voting or not sufficiently voting public, are the ones who let them get away with it by our lack of political action and awareness. Apathy...the usual culprit. Those in power with something to lose encourage it as best they can.\n \nWhy should the needs of the majority take precedence over the needs of the minority? For example if the majority elected to have a minority as slaves, would it be be moral? I don't think so. In that case all minorities would be subservient to the majority. This sounds like a step backwards to me.\n\n I don't think that the majority rule should be absolute. Our Constitution provides a reasonable safety net to let all people have at least a minimum set of rights that cannot be taken away by a majority. Then again, we often assume that those rights outlined in the Constitution are safe - that is not guaranteed. We have to be aware of our rights and fight for them when they are threatened - being careful not to give them up for the sake of security (such as in the warrantless wiretapping issue).", 
   {
    "unicode_changes_made": true
   }, 
   273325, 
   null, 
   1184280180.0
  ], 
  [
   273401, 
   null, 
   "Winston Smith", 
   "The powers that be, specially the executive one are always on the look out to increase their powers at the expense of the rights of the citizens. Any excuse will do and the threat of terrorism has been a godsend to the US government and many others, such as in the UK and here in Australia where the government has curtailed our rights as much as it could. Australia is a police state. Only recently they arrested an Indian doctor for alleged connection with the Glasgow terrorist attack and that was 11 days ago. No charges has been laid against him but no habeas corpus. The reaction of the people: 'hold him for as long as you deemed necessary'. If he is being questioned he must be a terrorist. Most people are so stupid and selfish than play straight into the hands of the government.", 
   {
    "unicode_changes_made": true
   }, 
   273382, 
   null, 
   1184296320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  At what point are civil rights conveyed or removed?", 
  "url": "http://www.4forums.com/political/civil-rights-debates/9845-what-point-civil-rights-conveyed-removed.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 9845, 
  "discussion_files": [
   [
    "24032.html", 
    "http://www.4forums.com/political/civil-rights-debates/9845-what-point-civil-rights-conveyed-removed-print.html"
   ], 
   [
    "24033.html", 
    "http://www.4forums.com/political/civil-rights-debates/9845-what-point-civil-rights-conveyed-removed-2-print.html"
   ]
  ], 
  "identifier": 9845
 }
]