[
 [
  [
   262125, 
   null, 
   "Klown", 
   "Contradictions and Faults Within the Bible\n \n I would like to start a thread that with your assistance attempts to collect as many faults and contradictions that are found within the Bible as possible. After each opposition I'll post it to the top giving it a number and small supportive description so that all faults that we find within the Bible will be easy to find. After we have collaborated a large amount of faults and contradictions we will see if there are any scientific or logical explanations that either debunks them or shows evidence in support of the Bibles rendition. :)", 
   {
    "post_info": {
     "post_title": "Contradictions and Faults Within the Bible"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1178587620.0
  ], 
  [
   262131, 
   null, 
   "Hi_Its_Me", 
   "One reference you could use is http://www.infidels.org/library/modern/donald_morgan/inconsistencies.html.\n \n \n Here's one, just in case you would prefer suggestions:GE 6:4 There were Nephilim (giants) before the Flood.\n GE 7:21 All creatures other than Noah and his clan were annihilated by the Flood.\n NU 13:33 There were Nephilim after the Flood.", 
   {}, 
   262125, 
   null, 
   1178593980.0
  ], 
  [
   262147, 
   null, 
   "Archangel", 
   "Here is Numbers 13:33, it doesn't mention Nephilim at all.\n \n Num 13:33 And there we saw the giants, the sons of Anak, which come of the giants and we were in our own sight as grasshoppers, and so we were in their sight. These were most likely the Philistines who were a large people. But I don't have time to research it now as I'm going to bed now. G-night...", 
   {}, 
   262131, 
   null, 
   1178604480.0
  ], 
  [
   262164, 
   null, 
   "Count Otto", 
   "Here is Numbers 13:33, it doesn't mention Nephilim at all.\n \n Num 13:33 And there we saw the giants, the sons of Anak, which come of the giants and we were in our own sight as grasshoppers, and so we were in their sight. These were most likely the Philistines who were a large people. But I don't have time to research it now as I'm going to bed now. G-night...\n\n \n 'Nephilim' and 'giants' are usually interchangeable. The sons of Anak are indeed said to be descendants of the Nephilim and some of the Philistines were indeed said to be sons of Anak (notably Goliath).", 
   {}, 
   262147, 
   null, 
   1178631360.0
  ], 
  [
   263441, 
   null, 
   "PastorAL123", 
   "For two thousand years the bible has been disputed yet it still stands. Your attitude is wrong. Instead of using your mind and energies to disprove the bible you should use all your power to to learn how to obey the teachings of the Son of God and mature emotionally and in wisdom.", 
   {}, 
   262164, 
   null, 
   1179358620.0
  ], 
  [
   263448, 
   null, 
   "charlie horse", 
   "For two thousand years the bible has been disputed yet it still stands.\n\n What do you mean by 'Yet it still stands'? Are you saying that it has ultimate authority, or it is simply a cultural fairy tale that so many are frightened to discard?\n \n \nYour attitude is wrong. Instead of using your mind and energies to disprove the bible you should use all your power to to learn how to obey the teachings of the Son of God and mature emotionally and in wisdom.\n\n The 'teachings' either have no substance, or are certainly not original. Demonstrate categorically just who is the Son of God, and why this figure commands worship and obeisance.", 
   {}, 
   263441, 
   null, 
   1179359640.0
  ], 
  [
   263453, 
   null, 
   "thelmoose", 
   "\n \n Your attitude is wrong. \n\n \n Now there is some persuasive debating.", 
   {}, 
   263441, 
   null, 
   1179360600.0
  ], 
  [
   263461, 
   null, 
   "Red Dragon", 
   "Here are some common contradictions.\n \n Answer not a fool according to his folly, lest thou also be like unto him.\" Proverbs 26:4\n Answer a fool according to his folly, lest he be wise in his own conceit.\" Proverbs 26:5 \n \n \"If I bear witness of myself, my witness is not true.\" John 5:31 \n Though I bear record of myself, yet my record is true. John 8:14 \n \n God is light, and in Him is no darkness at all... God is love...[Love] thinketh no evil John 8:14\n I form the light, and create darkness: I make peace, and create evil: I the LORD do all these things. ...Do they not err that devise evil?...I know that thou [God] canst do all things. See John 1:5b, John 4:16, 1 Corinthians 13:5d / Isaiah 45:7 Proverbs 14:22a and Job 42:2 \n \n Love is not jealous or boastful \n I the Lord your God am a jealous God ... for the Lord, Whose name is Jealous, is a jealous God See 1 Corinthians 13:4 / Exodus 34:14 and 20:5\n [Love] is not arrogant or rude ... it is not irritable or resentful \n He is a jealous God, He will not forgive your transgressions nor your sins. If you forsake the Lord, then He will turn and do you hurt, and consume you... To him belong both mercy and anger, and sinners feel the weight of his retribution ... All life belongs to me; the father's life and the son's life, both alike belong to me. The man who has sinned, he is the one who shall die. See 1 Corinthians 13:5 / Joshua 24:13,14; Ecclesiasticus 5:6; and Ezekial 18:3-4 \n \n There is no such thing as Jew and Greek... male and female, for you are all one person in Christ Jesus. \n Let a woman learn in silence with all submission. And I do not permit a woman to teach or to have authority over a man, but to be in silence. For Adam was formed first, then Eve. It was not Adam who deceived; it was the woman, who, yielding to deception, fell into sin...Man is the image of God, and the mirror of his glory, whereas a woman reflects the glory of man. For man did not originally spring from woman, but woman was made out of man; and man was not created for woman's sake, but woman for the sake of man... Women should keep silent at the meeting. They have no permission to talk, but should keep their place as the law directs. If there is something they want to know, they can ask their husbands at home... Abimelech came up to a tower and attacked it, and as he approached the entrance to set fire to it, a woman threw a millstone down on his head and fractured his skull... he called hurriedly to his armour-bearer and said \"Draw your sword and dispatch me, or it will be said of me: A woman killed him.\" So the young man ran him through, and he died.  See Galatians 3:28 / 1 Corinthians 11;2-10; 14:34-35; 1 Timothy 2:11-14; and Judges 9:53-54 \n \n If someone slaps you on the right cheek, turn and offer him your left. If a man wants to sue you for your shirt, let him have your coat as well. \n Whoever strikes another man and kills him must be put to death... When anyone reviles his father and his mother, he must be put to death. Since he has reviled his father and his mother, let his blood be on his own head...But when injury ensues, you are to give life for life, eye for eye, tooth for tooth, hand for hand, foot for foot, burn for burn... If anyone injures and disfigures a fellow-country man, it must be done to him as he has done... You must show no mercy... Happy shall he be, that taketh and dasheth thy little ones against the stones See Matt 5:38 / Exodus 21:12 23-25; Leviticus 20:9 24:19; and Deuteronomy 19:21\n \n I'm pretty sure there's a lot more but I don't really read the bible that much so excuse me if I have forgotten any other obvious ones.", 
   {
    "unicode_changes_made": true
   }, 
   263453, 
   null, 
   1179362940.0
  ], 
  [
   263509, 
   null, 
   "Hi_Its_Me", 
   "Just in case you are interested, here is a list of a large number of inconsistencies within the bible.\n \n One example that I personally liked:DT 6:15, 9:7-8, 29:20, 32:21 God is sometimes angry.\n MT 5:22 Anger is a sin.", 
   {}, 
   263461, 
   null, 
   1179379260.0
  ], 
  [
   265848, 
   null, 
   "chemist99a", 
   "For a good deconstruction of the Bible read \"The Age of Reason\" by one Thomas Paine. Available online at:\n \n http://www.infidels.org/library/historical/thomas_paine/age_of_reason/part1.html", 
   {}, 
   263509, 
   null, 
   1180698780.0
  ], 
  [
   267514, 
   null, 
   "Unriggable", 
   "If I believe this text then as a rule there shouldn't be 5000 year old trees on the planet. Yet there are.", 
   {}, 
   265848, 
   null, 
   1181329020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Contradictions and Faults Within the Bible", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9870-contradictions-faults-within-bible.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9870, 
  "discussion_files": [
   [
    "3346.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9870-contradictions-faults-within-bible-print.html"
   ]
  ], 
  "identifier": 9870
 }
]