[
 [
  [
   263029, 
   null, 
   "gamehuis", 
   "It was bound to happen, but it's still big news. Chrysler has been bought by private equity firm Cerberus for a measly $7.4 billion, which is $30 billion(!) less than what Daimler paid for it during the late 90's. \n \n Cerberus also owns a controlling stake in GMAC and is in talks to buy Delphi, so maybe they're planning on actually trying to make the company profitable again. I doubt it though, but you never know.\n Personally I'd split up Chrysler and sell the parts individually for a profit. IMO Chrysler is beyond hope and it should be put out of it's misery.", 
   {
    "post_info": {
     "post_title": "Chrysler sold for chump change"
    }
   }, 
   null, 
   null, 
   1179155760.0
  ], 
  [
   263098, 
   null, 
   "E Mutz", 
   "Why shouldn't the company depreciate as fast as its cars? \n \n Would the new company have to honor all the old labour contracts?", 
   {}, 
   263029, 
   null, 
   1179184680.0
  ], 
  [
   263118, 
   null, 
   "gamehuis", 
   "Why shouldn't the company depreciate as fast as its cars? \n\n Hehe, nice one. :p\n \n \nWould the new company have to honor all the old labour contracts?\n\n The UAW contracts expire in September, so new labor contracts will have to be negotiated, but the older agreements (heathcare etc.) still stand. So basically Chrysler will still be burdened by the old legacy costs. These legacy costs total about $18 billion.\n \n What really funny is that if you look at the specifics of this buyout, Daimler is actually not receiving a single penny from Cerberus. That's because most of the money is used as Cerberus' capital infusion into the car business and when all the bookkeeping is done, Daimler will actually have a net cash outflow of around $700 million.\n \n So basically Daimler is paying $700 million to get rid of Chrysler. If the laws would have allowed it, Daimler would have given away Chrysler for free to any bum on the street. :p", 
   {}, 
   263098, 
   null, 
   1179190140.0
  ], 
  [
   263123, 
   null, 
   "Matthew S", 
   "Only a fool would not have seen this comming 9 years ago. There is a reason it was called daimler chrysler and not chrysler daimler. Here is another prediction chrysler will be sold for its parts and chrysler will no longer exist.", 
   {}, 
   263118, 
   null, 
   1179199080.0
  ], 
  [
   263132, 
   null, 
   "Archangel", 
   "As owners of GMAC Cerberus was more interested in Chrysler Financial which is what they bought the Company for. See ?\n \n http://www.bbj.hu/main/news_26341_cerberus+to+purchase+80%2525+chrysler+stake.html\n \n This is all about strengthening their hand in financing, not to get into the auto manufacturing business.", 
   {}, 
   263123, 
   null, 
   1179204240.0
  ], 
  [
   263374, 
   null, 
   "daewoo", 
   "As owners of GMAC Cerberus was more interested in Chrysler Financial which is what they bought the Company for. See ?\n \n http://www.bbj.hu/main/news_26341_cerberus+to+purchase+80%2525+chrysler+stake.html\n \n This is all about strengthening their hand in financing, not to get into the auto manufacturing business.\n\n \n Not only wrong but this does not even make sense. GMAC was a full service finacial company. They offered all types of loans, corporate credit, the works. Chrysler Finacial ONLY exists to finance vehicle purchases through Chrysler dealers (and their brands i.e jeep). If Cereberus was not interested in getting into the auto manufacturing business this would be the stupidest deal imaginable since chrysler finacial ceases to exist without vehicle production from Crysler.", 
   {}, 
   263132, 
   null, 
   1179336720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Chrysler sold for chump change", 
  "url": "http://www.4forums.com/political/current-events-debates/9889-chrysler-sold-chump-change.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 9889, 
  "discussion_files": [
   [
    "8728.html", 
    "http://www.4forums.com/political/current-events-debates/9889-chrysler-sold-chump-change-print.html"
   ]
  ], 
  "identifier": 9889
 }
]