[
 [
  [
   263827, 
   null, 
   "Matthew S", 
   "If I read between the lines is the governor shooting a warning shot to legislature that he intends to unleash a political storm if they do not vote down this amendment?\n \n http://365gay.com/Newscon07/05/051007mass.htm\n \n \n\"If this does get to a popular ballot, there is very little other business that will get done in Massachusetts politics and policy making while that is pending,\" Patrick told reporters\n \n \"Rather than turn Massachusetts into a political circus for a national debate over something which is largely settled here, my own view is that we ought to resolve this on the merits so that it stays off the ballot, and to do so at the constitutional convention,\" the governor said.\n\n \n There is also the AG statements\n http://www.365gay.com/Newscon07/05/051207mass.htm\n \n\"I think we can easily anticipate that if the proposed amendment was successful, there would be protracted, hard-fought litigation about the constitutionality of such a provision,\" Coakley said.\n\n \n and there is this more recent statement from governor Patrick\n http://www.365gay.com/Newscon07/05/051807massmarr.htm\n \n\"[I]f we don&#8217;t lay this question to rest at the constitutional convention, all the other business that you and I care about, will be eclipsed by a poisonous debate over private choices that each of us ought to make,\" said Patrick.\n", 
   {
    "post_info": {
     "post_title": "Mass. Gov. Warns Of Circus Atmosphere If Anti-Gay Amendment Goes On Ballot"
    }
   }, 
   null, 
   null, 
   1179580200.0
  ], 
  [
   263837, 
   null, 
   "samiinh", 
   "If I read between the lines is the governor shooting a warning shot to legislature that he intends to unleash a political storm if they do not vote down this amendment?\n \n http://365gay.com/Newscon07/05/051007mass.htm\n \n \n \n There is also the AG statements\n http://www.365gay.com/Newscon07/05/051207mass.htm\n \n \n and there is this more recent statement from governor Patrick\n http://www.365gay.com/Newscon07/05/051807massmarr.htm\n\n \n Amazing how the christianists feel they have a right to vote on other people's civil rights. In NH this spring there were lots of letters to the editor of the Concord Monitor supporting this notion. The Monitor printed a really good editorial as to why this was wrong thinking. It is wrong and it is evil. Those who would oppose these civil rights, relish their special rights and hate the thought that others might enjoy them as well. They are evil people.", 
   {}, 
   263827, 
   null, 
   1179585780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mass. Gov. Warns Of Circus Atmosphere If Anti-Gay Amendment Goes On Ballot", 
  "url": "http://www.4forums.com/political/gay-rights-debates/9906-mass-gov-warns-circus-atmosphere-if-anti-gay-amendment-goes-ballot.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 9906, 
  "discussion_files": [
   [
    "18122.html", 
    "http://www.4forums.com/political/gay-rights-debates/9906-mass-gov-warns-circus-atmosphere-if-anti-gay-amendment-goes-ballot-print.html"
   ]
  ], 
  "identifier": 9906
 }
]