[
 [
  [
   264440, 
   null, 
   "INRI", 
   "I am going to by pass your other concerns you have for the moment and concentrate on this one concern.\n \n \nThe Infallibility of the Pope. The Pope is a man from the seed of Adam, thus he is a sinner just like me. He is not infallible as only God is infallible. The inference that he is is blasphemy to God and it's a heretical doctrine.\n\n \n Because it is important to clarifiy the authority and infallibility of the Catholic Church through the seat of peter, if this can be accepted then we can progress onto the other doctrines.\n \n I have been working on this for quite sometime and you damn well better read it, consider it, ponder it, pray about.\n \n you have been crying out, screeming for scripture, so that is where we will start..... Just as you like it.\n \n Biblical \n \n Mt 16: 18 -19 \n \n \"I also say to you that you are Peter, and upon this rock I will build My church; and the gates of Hades will not overpower it. 19 \"I will give you the keys of the kingdom of heaven; and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven. \n \n Lk 22:32 \n \n \"I have prayed for you, that your faith may not fail; and you, when once you have turned again, strengthen your brothers\" \n \n Jn 21:17 \n \n \"He said to him the third time, \"Simon, son of John, do you love Me?\" Peter was grieved because He said to him the third time, \"Do you love Me?\" And he said to Him, \"Lord, You know all things; You know that I love You.\" Jesus said to him, \"Tend My sheep.\" \n \n Mk 16:7 \n \n Angel sends women to anounce ressurection to peter \n \n \"But go, tell His disciples and Peter, `He is going ahead of you to Galilee; there you will see Him, just as He told you.' \" \n \n Lk 24:34 \n \n Risen Jesus first appears to Peter \n \n \"saying, \"The Lord has really risen and has appeared to Simon Peter\" \n \n Acts 1: 13 -26 \n \n Peter Was head of the meeting that elected Matthias. \n \n When they had entered the city, they went up to the upper room where they were staying; that is, Peter and John and James and Andrew, Philip and Thomas, Bartholomew and Matthew, James the son of Alphaeus, and Simon the Zealot, and Judas the son of James. 14 These all with one mind were continually devoting themselves to prayer, along with the women, and Mary the mother of Jesus, and with His bretheren. \n \n 15 At this time Peter stood up in the midst of the brethren (a gathering of about one hundred and twenty persons was there together), and said, 16 \"Brethren, the Scripture had to be fulfilled, which the Holy Spirit foretold by the mouth of David concerning Judas, who became a guide to those who arrested Jesus. 17 \"For he was counted among us and received his share in this ministry.\" 18 (Now this man acquired a field with the price of his wickedness, and falling headlong, he burst open in the middle and all his intestines gushed out. 19 And it became known to all who were living in Jerusalem; so that in their own language that field was called Hakeldama, that is, Field of Blood.) 20 \"For it is written in the book of Psalms, `LET HIS HOMESTEAD BE MADE DESOLATE, AND LET NO ONE DWELL IN IT'; and, `LET ANOTHER MAN TAKE HIS OFFICE .' 21 \"Therefore it is necessary that of the men who have accompanied us all the time that the Lord Jesus went in and out among us-- 22 beginning with the baptism of John until the day that He was taken up from us--one of these must become a witness with us of His resurrection.\" 23 So they put forward two men, Joseph called Barsabbas (who was also called Justus), and Matthias. 24 And they prayed and said, \"You, Lord, who know the hearts of all men, show which one of these two You have chosen 25 to occupy this ministry and apostleship from which Judas turned aside to go to his own place.\" 26 And they drew lots for them, and the lot fell to Matthias; and he was added to the eleven apostles. \n \n Acts 2: 14 \n \n Peter leads apostals in preaching at pentecost. \n \n But Peter, taking his stand with the eleven, raised his voice and declared to them: \"Men of Judea and all you who live in Jerusalem, let this be known to you and give heed to my words. \n \n Acts 2: 38 - 41 \n \n Peter is first to recieve converts \n \n Peter said to them, \"Repent, and each of you be baptized in the name of Jesus Christ for the forgiveness of your sins; and you will receive the gift of the Holy Spirit. 39 \"For the promise is for you and your children and for all who are far off, as many as the Lord our God will call to Himself.\" 40 And with many other words he solemnly testified and kept on exhorting them, saying, \"Be saved from this perverse generation!\" 41 So then, those who had received his word were baptized; and that day there were added about three thousand souls. \n \n Acts 3; 6 -7 \n \n Peter performs the first mirical after pentecost \n \n But Peter said, \"I do not possess silver and gold, but what I do have I give to you: In the name of Jesus Christ the Nazarene--walk!\" 7 And seizing him by the right hand, he raised him up; and immediately his feet and his ankles were strengthened. \n \n Acts 5: 1-11 \n \n Peter inflicts the first punishment \n \n But a man named Ananias, with his wife Sapphira, sold a piece of property, 2 and kept back some of the price for himself, with his wife's full knowledge, and bringing a portion of it, he laid it at the apostles' feet. 3 But Peter said, \"Ananias, why has Satan filled your heart to lie to the Holy Spirit and to keep back some of the price of the land? 4 \"While it remained unsold, did it not remain your own? And after it was sold, was it not under your control? Why is it that you have conceived this deed in your heart? You have not lied to men but to God.\" 5 And as he heard these words, Ananias fell down and breathed his last; and great fear came over all who heard of it. 6 The young men got up and covered him up, and after carrying him out, they buried him. 7 Now there elapsed an interval of about three hours, and his wife came in, not knowing what had happened. 8 And Peter responded to her, \"Tell me whether you sold the land for such and such a price?\" And she said, \"Yes, that was the price.\" 9 Then Peter said to her, \"Why is it that you have agreed together to put the Spirit of the Lord to the test? Behold, the feet of those who have buried your husband are at the door, and they will carry you out as well.\" 10 And immediately she fell at his feet and breathed her last, and the young men came in and found her dead, and they carried her out and buried her beside her husband. 11 And great fear came over the whole church, and over all who heard of these things. \n \n Acts 8: 21 \n \n Peter excomunicated the first heritic \n \n \"You have no part or portion in this matter, for your heart is not right before God\" \n \n Acts 10: 44 -47 \n \n Recieved a revelation to admit gentiles into the church. \n \n While Peter was still speaking these words, the Holy Spirit fell upon all those who were listening to the message. 45 All the circumcised believers who came with Peter were amazed, because the gift of the Holy Spirit had been poured out on the Gentiles also. 46 For they were hearing them speaking with tongues and exalting God. Then Peter answered, 47 \"Surely no one can refuse the water for these to be baptized who have received the Holy Spirit just as we did, can he?\" 48 And he ordered them to be baptized in the name of Jesus Christ. \n \n Acts 15: 7 \n \n Peter led first council in Jerusalem \n \n After there had been much debate, Peter stood up and said to them, \"Brethren, you know that in the early days God made a choice among you, that by my mouth the Gentiles would hear the word of the gospel and believe. \n \n Acts 15: 19 \n \n Peter pronounces first dogmatic decision \n \n \"Therefore it is my judgment that we do not trouble those who are turning to God from among the Gentiles\" \n \n Gal 1: 18 \n \n After conversion St. Paul visits cheif apostle \n \n Then three years later I went up to Jerusalem to become acquainted with Cephas(rock), and stayed with him fifteen days. \n \n Gal 2: 11 -14 \n \n Paul tells peter of his wrong doing because he is leading the church into double standards. \n \n But when Cephas came to Antioch, I opposed him to his face, because he stood condemned. 12 For prior to the coming of certain men from James, he used to eat with the Gentiles; but when they came, he began to withdraw and hold himself aloof, fearing the party of the circumcision. 13 The rest of the Jews joined him in hypocrisy, with the result that even Barnabas was carried away by their hypocrisy. 14 But when I saw that they were not straightforward about the truth of the gospel, I said to Cephas in the presence of all, \"If you, being a Jew, live like the Gentiles and not like the Jews, how is it that you compel the Gentiles to live like Jews? \n \n Mt 10:1-4 \n \n Peter is always heads the list of the 12 apostals, the list always ends with Judus Isscariot \n \n Jesus summoned His twelve disciples and gave them authority over unclean spirits, to cast them out, and to heal every kind of disease and every kind of sickness. 2 Now the names of the twelve apostles are these: The first (cheif in greek), Simon, who is called Peter, and Andrew his brother; and James the son of Zebedee, and John his brother; 3 Philip and Bartholomew; Thomas and Matthew the tax collector; James the son of Alphaeus, and Thaddaeus; 4 Simon the Zealot, and Judas Iscariot, the one who betrayed Him. \n \n Mk 3: 16 - 19 \n \n And He appointed the twelve: Simon (to whom He gave the name Peter), 17 and James, the son of Zebedee, and John the brother of James (to them He gave the name Boanerges, which means, \"Sons of Thunder\"); 18 and Andrew, and Philip, and Bartholomew, and Matthew, and Thomas, and James the son of Alphaeus, and Thaddaeus, and Simon the Zealot; 19 and Judas Iscariot, who betrayed Him. \n \n Lk 6: 14-16 \n \n Simon, whom He also named Peter, and Andrew his brother; and James and John; and Philip and Bartholomew; 15 and Matthew and Thomas; James the son of Alphaeus, and Simon who was called the Zealot; 16 Judas the son of James, and Judas Iscariot, who became a traitor. \n \n Acts 1: 13 \n \n Without judas isscariot \n \n When they had entered the city, they went up to the upper room where they were staying; that is, Peter and John and James and Andrew, Philip and Thomas, Bartholomew and Matthew, James the son of Alphaeus, and Simon the Zealot, and Judas the son of James. \n \n Lk 9: 32 \n \n Shows the importance of Peter \n \n Now Peter and his companions had been overcome with sleep; but when they were fully awake, they saw His glory and the two men standing with Him. \n \n Mk 16:7 \n \n Also sets peter apart \n \n \"But go, tell His disciples and Peter, `He is going ahead of you to Galilee; there you will see Him, just as He told you.' \" \n \n Mt 18: 21 \n \n Peter spoke for the apostals \n \n Then Peter came and said to Him, \"Lord, how often shall my brother sin against me and I forgive him? Up to seven times?\" \n \n Also in \n \n Mk 8: 29 \n \n And He continued by questioning them, \"But who do you say that I am?\" Peter answered and said to Him, \"You are the Christ.\" 30 And He warned them to tell no one about Him. \n \n Lk 8: 45 \n \n And Jesus said, \"Who is the one who touched Me?\" And while they were all denying it, Peter said, \"Master, the people are crowding and pressing in on You.\" \n \n Lk 12: 41 \n \n Peter said, \"Lord, are You addressing this parable to us, or to everyone else as well?\" \n \n Jn 6: 68 -69 \n \n 68 Simon Peter answered Him, \"Lord, to whom shall we go? You have words of eternal life. 69 \"We have believed and have come to know that You are the Holy One of God.\" \n \n Peter is mentioned 191 times, more than all the other apostals put together 133 times, next most mentioned is St John 48 times \n \n Peter thou art a rock, upon this rock I will build my church! \n \n Many people say that JC was not building his church on peter by pointing out that in the greek text, the word used for peter is petros, a masculin noun. Petros means \"small stone\" while the word used for rock is petra, a feminine noun, they claim therefore that petra the massive rock must not mean peter but rather to peters profesion of faith or to Jesus. However, Jesus spoke arimaic , which does away with the greek petros/petra argument. In aramaic the word for rock is kepha \"you are kepha(rock) and upon this kepha(rock) I will build my church. In aramaic it is clear Jesus Identifies Peter as the rock. The greek word for rock is petra feminine, it wouldnt be apropriate to give a man a feminie name. so the translator gave petra the masculine ending and became petros. Since petros was a preexisting word meaning small stone some of the word play was lost but no early church father, including those who were greek speaking ever saw a difference between peter and the rock. They taught that peter is the rock on which christ built his church. \n \n The Keys! \n \n Jesus is using the imageory of the keys from \n \n Is 22: 19 -22 \n \n 19 I will remove you from your office; you will be ousted from your position. \n 20 \"On that day I will call for my servant, Eliakim son of Hilkiah. 21 I will clothe him with your robe and tie your sash around him. I will put your authority into his hand, and he will be like a father to the inhabitants of Jerusalem and to the House of Judah. 22 I will place the key of the House of David on his shoulder; what he opens, no one can close; what he closes, no one can open. \n \n Three important parts \n \n 1. The keys are a symbol of authority given to the \"prime minister\" of the kingdom of david. \n 2. The \"Prime Minister\" is a father figure - Pope is from the Italian word \"papa\" or father \n 3. The Office implies succesion - The PM of the kingdom of david lasted as long as the kingdom of david lasted. Catholics believe Christ is the king and that the pope who fills the office of peter is the \"prime minister\" of his heavenly kingdom, the church. Christ is the head and the pope is his earthly representitive. \n \n If protestents think peter was not infalible, why do they accept his two letters as inspired and therefore infallible? \n \n All the apostals were infalible, after that the pope as an individual and the bishops in union with the pope are infalible. \n Indeed any catholic who teaches in accordance with the Bishop of rome does so with the full authority of Christ and is infallible.\n \n When St Paul corrects St Peter there were no doctrines or dogmas involved peter had settled the doctrine involved at the council of jeruslem. It is no different from St Catherine of Siena correcting the weakness of popes in the middle ages. \n \n Infallibe means incapable of teaching in error in matters of faith and morals not impecable behaviour and incapable of sin. \n \n History \n \n The Early church always accepted the pope as head, In about 80AD The church at corinth got rid of there lawful leaders. The fourth bishop of rome, Pope Clement I was called to settle the matter even though St John the apostal was still alive and was much closer to corinth than rome. \n \n St Irenaeus, who ws taught by St Polycarp (a disciple of St John the apostle) stresses \"Christians must be united to the Church of Rome in order to maintain the appostolic tradition\" He then lists all the bishops of rome upto his time that included St Peter. \n \n For 250 years the Roman Emperors tried to destroy christianity through persicution In the first 200 years of christianity every pope but one were martyerd - The romans knew who the head of the church was! \n \n A Roman Emperors biggest fear was a rival to the throne, nevertheless emperor Decius (249 -251 AD) one of the harshest persicutors of the early church made this remark \n \" I would far rather recieve news of a rival to the throne than of another bishop of rome\" He said this after he had executed Pope Fabian in 250 AD. \n \n Finally I ask a question! \n \n Imagine a owner of a company called all of the employees together and announced that he would be going away for a while and tha in his absence he was going to give Joe bloggs (UK verson of John Doe) the keys to the company and whatever joe bloggs commanded would be backed by him. Would you have any doubt that Joe Bloggs was going to be in charge of the company while the boss was away? \n \n This is exactly what is described in \n \n Mt 16: 13 -19\n \n \n What Christ entrusted to the apostles, they in turn \n handed on by their preaching and writing, under the \n inspiration of the Holy Spirit, to all generations, until \n Christ returns in glory. \n \n Sacred Tradition and Sacred Scripture make up a \n single sacred deposit of the Word of God in \n which, as in a mirror, the pilgrim Church contemplates \n God, the source of all her riches. \n \n The Church, in her doctrine, life, and worship, perpetuates \n and transmits to every generation all that she \n herself is, all that she believes\"\n \n Thanks to its supernatural sense of faith, the People of \n God as a whole never ceases to welcome, to penetrate \n more deeply, and to live more fully from the gift of \n divine Revelation. \n \n The task of interpreting the Word of God authentically \n has been entrusted solely to the Magisterium of the \n Church, that is, to the Pope and to the bishops in \n communion with him.", 
   {
    "post_info": {
     "post_title": "Thread for Arcangel"
    }
   }, 
   null, 
   null, 
   1179968400.0
  ], 
  [
   264457, 
   null, 
   "Archangel", 
   "I just spent 2 hours responding to this on my other computer and it just froze up so I lost it all. I need a cooling off period. emoticon_angry", 
   {}, 
   264440, 
   null, 
   1179975780.0
  ], 
  [
   264483, 
   null, 
   "Archangel", 
   "I am going to by pass your other concerns you have for the moment and concentrate on this one concern.\n Because it is important to clarifiy the authority and infallibility of the Catholic Church through the seat of peter, if this can be accepted then we can progress onto the other doctrines.\n\n \n This can not be accepted at all in that Peter was no more infallible than I am.\n \n \nPeter thou art a rock, upon this rock I will build my church! \n \n Many people say that JC was not building his church on peter by pointing out that in the greek text, the word used for peter is petros, a masculin noun. Petros means \"small stone\" while the word used for rock is petra, a feminine noun, they claim therefore that petra the massive rock must not mean peter but rather to peters profesion of faith or to Jesus. However, Jesus spoke arimaic , which does away with the greek petros/petra argument. In aramaic the word for rock is kepha \"you are kepha(rock) and upon this kepha(rock) I will build my church. In aramaic it is clear Jesus Identifies Peter as the rock. The greek word for rock is petra feminine, it wouldnt be apropriate to give a man a feminie name. so the translator gave petra the masculine ending and became petros. Since petros was a preexisting word meaning small stone some of the word play was lost but no early church father, including those who were greek speaking ever saw a difference between peter and the rock. They taught that peter is the rock on which christ built his church.\n \n \n \n Mat 16:18 And I also say to you that you are Peter, and on this rock I will build My church, and the gates of Hades shall not prevail against it. \n \n This verse is very different than what you say here: \n \nPeter thou art a rock, upon this rock I will build my church! \n\n \n And could I get a link to your interpretations of the Greek for ROCK as it doesn't jive with what I know to be true. And how do you deal with these verses that Say Christ is the rock of the Church ?\n \n Rom 9:33 As it is written: \"Behold, I lay in Zion a stumbling stone and rock of offense, And whoever believes on Him will not be put to shame.\" \n 1Cr 10:4 and all drank the same spiritual drink. For they drank of that spiritual Rock that followed them, and that Rock was Christ. \n \n *And how do you explain Peter himself refering to the Lord as the Rock of our Faith and Salvation ? \n \n \n 1Pe 2:1 THEREFORE, laying aside all malice, all deceit, hypocrisy, envy, and all evil speaking, \n 1Pe 2:2 as newborn babes, desire the pure milk of the word, that you may grow thereby,[fn1] \n 1Pe 2:3 if indeed you have tasted that the Lord is gracious. \n 1Pe 2:4 Coming to Him as to a living stone, rejected indeed by men, but chosen by God and precious, \n 1Pe 2:5 you also, as living stones, are being built up a spiritual house, a holy priesthood, to offer up spiritual sacrifices acceptable to God through Jesus Christ. \n 1Pe 2:6 Therefore it is also contained in the Scripture,\n \n \n \"Behold, I lay in Zion\n A chief cornerstone, elect, precious,\n And he who believes on Him will by no means be put to shame.\"[fn2]\n \n 1Pe 2:7 Therefore, to you who believe, He is precious; but to those who are disobedient,[fn3]\n \n \n \"The stone which the builders rejected\n Has become the chief cornerstone,\"[fn4]\n \n 1Pe 2:8 and\n \n \n \"A stone of stumbling\n And a rock of offense.\"[fn5]\n \n \n They stumble, being disobedient to the word, to which they also were appointed. \n 1Pe 2:9 But you are a chosen generation, a royal priesthood, a holy nation, His own special people, that you may proclaim the praises of Him who called you out of darkness into His marvelous light; \n 1Pe 2:10 who once were not a people but are now the people of God, who had not obtained mercy but now have obtained mercy. \n 1Pe 2:11 Beloved, I beg you as sojourners and pilgrims, abstain from fleshly lusts which war against the soul, \n 1Pe 2:12 having your conduct honorable among the Gentiles, that when they speak against you as evildoers, they may, by your good works which they observe, glorify God in the day of visitation. \n 1Pe 2:13 Therefore submit yourselves to every ordinance of man for the Lord's sake, whether to the king as supreme, \n \n \nIf protestents think peter was not infalible, why do they accept his two letters as inspired and therefore infallible? \n \n All the apostals were infalible, after that the pope as an individual and the bishops in union with the pope are infalible. \n Indeed any catholic who teaches in accordance with the Bishop of rome does so with the full authority of Christ and is infallible.\n \n Infallibe means incapable of teaching in error in matters of faith and morals not impecable behaviour and incapable of sin. \n\n \n Here is what infallible means, note the bolded.\n \n in·fal·li·ble /&#618;n&#712;fæl&#601;b&#601;l/ Pronunciation Key - Show Spelled Pronunciation[in-fal-uh-buhl] Pronunciation Key - Show IPA Pronunciation \n -adjective 1. absolutely trustworthy or sure: an infallible rule. \n 2. unfailing in effectiveness or operation; certain: an infallible remedy. \n 3. not fallible; exempt from liability to error, as persons, their judgment, or pronouncements: an infallible principle. \n 4. Roman Catholic Church. immune from fallacy or liability to error in expounding matters of faith or morals by virtue of the promise made by Christ to the Church. \n -noun 5. an infallible person or thing. \n \n \n Were the OT Prophets also infallible because of the books they wrote ? Was King David infallible when he had bathshebas husband killed in battle so he could have her for his own ? We all know how God dealt with that sin. And was Moses infallible when he broke the ten Commandments God had just cut for him ? And was Peter infallible when he cut the ear off of the Centurian when they came to arrest jesus in the garden ? Or when he denied Jesus 3 times as Jesus prophesied he would do ? Peter was a ainner in need of salvation just as we all are and if he was infallible according to your definition then every believer in Christ is also infallible. And I submit to you, speaking for myself that I am not, even though Gods Holy Spirit lives within me.\n \n Here is what infallible means again in regard to the RCC, note the bolded.\n \n in·fal·li·ble /&#618;n&#712;fæl&#601;b&#601;l/ Pronunciation Key - Show Spelled Pronunciation[in-fal-uh-buhl] Pronunciation Key - Show IPA Pronunciation \n -adjective 1. absolutely trustworthy or sure: an infallible rule. \n 4. Roman Catholic Church. immune from fallacy or liability to error in expounding matters of faith or morals by virtue of the promise made by Christ to the Church. \n -noun 5. an infallible person or thing. \n \n \n The crimes of the popes prove their fallibility clearly according to reason and common sense. The problen the RCC has is that they have tried, and are trying to justify and defend their doctrines while never acknowledging the power, strength and presence of the Holy Spirit in Gods church on Earth, And for this reason the RCC has become an obsenity in Gods sight. Here are verses about the Holy Spirits part in our salvation. If you read these and are so moved, receive Jesus with a sincere heart and you will receive His Holy Spirit to indwell you which is the act of being born again. Only then will you understand the personal nature of our relationship with the living God through Christ our savior.\n \n Luk 3:22 And the Holy Spirit descended in bodily form like a dove upon Him, and a voice came from heaven which said, \"You are My beloved Son; in You I am well pleased.\" \n Luk 4:1 Then Jesus, being filled with the Holy Spirit, returned from the Jordan and was led by the Spirit *into the wilderness, \n Luk 11:13 If you then, being evil, know how to give good gifts to your children, how much more will [your] heavenly Father give the Holy Spirit to those who ask Him!\" \n Luk 12:10 \"And anyone who speaks a word against the Son of Man, it will be forgiven him; but to him who blasphemes against the Holy Spirit, it will not be forgiven. \n Luk 12:12 For the Holy Spirit will teach you in that very hour what you ought to say.\" \n Jhn 1:33 I did not know Him, but He who sent me to baptize with water said to me, 'Upon whom you see the Spirit descending, and remaining on Him, this is He who baptizes with the Holy Spirit.' \n Jhn 7:39 But this He spoke concerning the Spirit, whom those *believing in Him would receive; for the Holy Spirit was not yet [given], because Jesus was not yet glorified. \n Jhn 14:26 But the Helper, the Holy Spirit, whom the Father will send in My name, He will teach you all things, and bring to your remembrance all things that I said to you. \n Jhn 20:22 And when He had said this, He breathed on [them], and said to them, \"Receive the Holy Spirit. \n Act 1:2 until the day in which He was taken up, after He through the Holy Spirit had given commandments to the apostles whom He had chosen, \n Act 1:5 for John truly baptized with water, but you shall be baptized with the Holy Spirit not many days from now.\" \n Act 1:8 But you shall receive power when the Holy Spirit has come upon you; and you shall be *witnesses to Me in Jerusalem, and in all Judea and Samaria, and to the end of the earth.\" \n Act 1:16 \"Men [and] brethren, this Scripture had to be fulfilled, which the Holy Spirit spoke before by the mouth of David concerning Judas, who became a guide to those who arrested Jesus; \n Act 2:4 And they were all filled with the Holy Spirit and began to speak with other tongues, as the Spirit gave them utterance. \n Act 2:33 Therefore being exalted to the right hand of God, and having received from the Father the promise of the Holy Spirit, He poured out this which you now see and hear. \n Act 2:38 Then Peter said to them, \"Repent, and let every one of you be baptized in the name of Jesus Christ for the remission of sins; and you shall receive the gift of the Holy Spirit. \n Act 4:8 Then Peter, filled with the Holy Spirit, said to them, \"Rulers of the people and elders of Israel: \n Act 4:31 And when they had prayed, the place where they were assembled together was shaken; and they were all filled with the Holy Spirit, and they spoke the word of God with boldness. \n Act 5:3 But Peter said, \"Ananias, why has Satan filled your heart to lie to the Holy Spirit and keep back part of the price of the land for yourself? \n Act 5:32 And we are His witnesses to these things, and [so] also [is] the Holy Spirit whom God has given to those who obey Him.\" \n Act 6:3 Therefore, brethren, seek out from among you seven men of good reputation, full of the Holy Spirit and wisdom, whom we may appoint over this business; \n Act 6:5 And the saying pleased the whole multitude. And they chose Stephen, a man full of faith and the Holy Spirit, and Philip, Prochorus, Nicanor, Timon, Parmenas, and Nicolas, a proselyte from Antioch, \n Act 7:51 \"[You] stiff-necked and uncircumcised in heart and ears! You always resist the Holy Spirit; as your fathers [did], so [do] you. \n Act 7:55 But he, being full of the Holy Spirit, gazed into heaven and saw the glory of God, and Jesus standing at the right hand of God, \n Act 8:15 who, when they had come down, prayed for them that they might receive the Holy Spirit.\n Act 8:17 Then they laid hands on them, and they received the Holy Spirit. \n Act 8:18 And when Simon saw that through the laying on of the apostles' hands the Holy Spirit was given, he offered them money, \n Act 8:19 saying, \"Give me this power also, that anyone on whom I lay hands may receive the Holy Spirit.\" \n Act 9:17 And Ananias went his way and entered the house; and laying his hands on him he said, \"Brother Saul, the Lord *Jesus, who appeared to you on the road as you came, has sent me that you may receive your sight and be filled with the Holy Spirit.\" \n Act 9:31 Then the *churches throughout all Judea, Galilee, and Samaria had peace and were edified. And walking in the fear of the Lord and in the comfort of the Holy Spirit, they were multiplied. \n Act 10:38 how God anointed Jesus of Nazareth with the Holy Spirit and with power, who went about doing good and healing all who were oppressed by the devil, for God was with Him. \n Act 10:44 While Peter was still speaking these words, the Holy Spirit fell upon all those who heard the word. \n Act 10:45 And those of the circumcision who believed were astonished, as many as came with Peter, because the gift of the Holy Spirit had been poured out on the Gentiles also. \n Act 10:47 \"Can anyone forbid water, that these should not be baptized who have received the Holy Spirit just as we [have]?\" \n Act 11:15 And as I began to speak, the Holy Spirit fell upon them, as upon us at the beginning. \n Act 11:16 Then I remembered the word of the Lord, how He said, 'John indeed baptized with water, but you shall be baptized with the Holy Spirit.' \n Act 11:24 For he was a good man, full of the Holy Spirit and of faith. And a great many people were added to the Lord. \n Act 13:2 As they ministered to the Lord and fasted, the Holy Spirit said, \"Now separate to Me Barnabas and Saul for the work to which I have called them.\" \n Act 13:4 So, being sent out by the Holy Spirit, they went down to Seleucia, and from there they sailed to Cyprus. \n Act 13:9 Then Saul, who also [is called] Paul, filled with the Holy Spirit, looked intently at him \n Act 13:52 And the disciples were filled with joy and with the Holy Spirit. \n Act 15:8 So God, who knows the heart, !g2acknowledged them by giving them the Holy Spirit, just as [He did] to us, \n Act 15:28 For it seemed good to the Holy Spirit, and to us, to lay upon you no greater burden than these necessary things: \n Act 16:6 Now when they had gone through Phrygia and the region of Galatia, they were forbidden by the Holy Spirit to preach the word in Asia. \n Act 19:2 he said to them, \"Did you receive the Holy Spirit when you believed?\" So they said to him, \"We have not so much as heard whether there is a Holy Spirit.\" \n Act 19:6 And when Paul had laid hands on them, the Holy Spirit came upon them, and they spoke with tongues and prophesied. \n Act 20:23 except that the Holy Spirit testifies in every city, saying that chains and tribulations await me. \n Act 20:28 Therefore take heed to yourselves and to all the flock, among which the Holy Spirit has made you overseers, to shepherd the church *of God which He purchased with His own blood. \n Act 21:11 When he had come to us, he took Paul's belt, bound his [own] hands and feet, and said, \"Thus says the Holy Spirit, 'So shall the Jews at Jerusalem bind the man who owns this belt, and deliver [him] into the hands of the Gentiles.' \" \n Act 28:25 So when they did not agree among themselves, they departed after Paul had said one word: \"The Holy Spirit spoke rightly through Isaiah the prophet to *our fathers, \n ", 
   {
    "unicode_changes_made": true
   }, 
   264440, 
   null, 
   1180012080.0
  ], 
  [
   264537, 
   null, 
   "Zardoz", 
   "Ephesians 2:19-22\n Consequently, you are no longer foreigners and aliens, but fellow citizens with God's people and members of God's household, built on the foundation of the apostles and prophets, with Christ Jesus himself as the chief cornerstone. In him the whole building is joined together and rises to become a holy temple in the Lord. And in him you too are being built together to become a dwelling in which God lives by his Spirit.\n \n The foundation is the apostles and prophets with Jesus being the corner stone.\n \n See also 1 Corinthians 3:10-11 \n By the grace God has given me, I laid a foundation as an expert builder, and someone else is building on it. But each one should be careful how he builds. For no one can lay any foundation other than the one already laid, which is Jesus Christ. \n \n Also note that Peter means 'rock' as does the Aramaic word Cephas which Jesus called Simon-Peter in John 1:42\n \n In Matthew 16:18\n Peter is Petros (detached rock) vs 'rock' used a few words later in Mt16:18 is Petra (bedrock).\n \n So, is Jesus making a play on words?\n Attempting to confuse people...including his own follower Peter who went on to help form congregations of all peoples (jew and gentile) and passed his work on to a successor...which forms the line of popes.\n \n Also note for history, honorific titles are used at times. Thus, you get the honorific title of Father as a possiblity just as you had god (small g) being used.\n Recall when the pharasies wanted to kill Jesus for calling himself God; John 10:33-36\n \"We are not stoning you for any of these,\" replied the Jews, \"but for blasphemy, because you, a mere man, claim to be God.\" \n Jesus answered them, \"Is it not written in your Law, 'I have said you are gods'? If he called them 'gods,' to whom the word of God came-and the Scripture cannot be broken- \n \n Psalms 82:6-7\n \"I said, 'You are \"gods\"; you are all sons of the Most High.' But you will die like mere men; you will fall like every other ruler.\" \n \n This title of god here is honorific.\n \n Much like honorary doctorates are passed out. They hold little weight and should not be refered to in proper etiquette. So, I would agree that 'Father' is an honorific. Much like a parent...remember Arch, the commandment to Honor thy Father...refers to a parent?\n Confusing isn't it?\n You have parts of the bible refer to not calling anyone a Father...then other parts commanding you to honor the earthly one you call father...\n \n As to infallibility.\n I need remind you both, this Papal infallability is ONLY on DOCTRINE and NOTHING ELSE.\n Not dogma, not tradition, not opinions.\n \n To date, I can't personally recall any DOCTRINE that (most)Protestants disagree with as the (Roman)Catholics believe. \n One must believe in Christ and his spilt blood at the crucifiction for salvation.\n One must accept God's triune nature (even if they have personal dificulties understanding this mystery of faith).\n One must believe in the resurrection from the grave of Jesus who then ascended to heaven.\n One must believe in a 2nd coming, a final judgement for ALL of mankind...\n One must follow the teachings of Christ, accept the Holy Spirit, Repent of any and all sin and seek to live a better life in faith with works born of that faith as the only sign that they have it (being known by the good fruit).\n \n I'm sure there might be a few others lik the Virgin birth, but those are the essentials. Unchanging save via apostacy and heresy...which is just fancy words for being damned.\n \n When it comes to dogma like purgatory, limbo for cildren, those are not infallable and are subject to change. Often times, the Church IS too militant is sticking with some of these that CAN get in the way of correct doctrine.\n Recently, the Church dropped Limbo for children as an example.\n \n Same with things like the end time rapture beliefs of some Protestants.\n Pre, mid, post tribulation beliefs as well as even belief in the concept at all will not prevent you from getting into heave or ensure you get there if you believe in one over the other.\n It really DOES NOT MATTER.\n \n Often times, I see a protestant thesis on why the Catholic Church is wrong. Most of the points, from my perspective, don't show an understanding of Catholicism at all. Some of the points shown should be heeded as they are the dogmatic stances that could violate correct doctrine.\n \n For example, the Mary veneration is dangerous as it could lead to idolotry (and has done so before) it also detracts from the worship of God and places a middleman between you and God.\n \n Having icons for a focus of worship is dangerous in most sects Catholic and Protestant alike as it could lead to idolotry. Even a mere cross of fishy to mark yourself as a Christian amongst strangers (assuming you're lazy and have no good fruit to bear ATM).\n \n Some seeing ones focus on bearing good fruit born of their faith is twisted by others to mean that you seek to get into heaven by works alone which is not what Catholicism teaches (at least none that I've ever witnessed).\n Remember Works without faith is pointless and Faith without works is dead.\n Too many churchs think they have 'faith' because they say so, yet don't really engage is meaningful works...individually or corporatly. \n \n Even Pentecostals believe (by scripture twisting) that all must have the gift of tongues to prove that they have the Holy Spirit. IF the Holy Spirit gifts you with that, fine. But remember all get gifts as the Spirit pleases and they can differ. For not all are heads or mouths and not all are hands or feet.\n Believing you must have gifts can cause problems if you feel the need to fake it. You could end up turning from a Spiritual church into one lead by emotionalism and desiring personal gratification and approval from other humans, chasing like an adulturous nation after a sign rather than chasing after the prize which should be salvation and praise of God.\n \n In the end, bigotry by both sides blinds you to over look essential simularities in doctrinal beliefs and confuse tradition, culture, and dogma for outright apostacy and heresy.\n As the bible commands, you should not seek to cause disharmony but to seek to correct your believing brethern when you think they err. With a kind and loving spirit and gentle yet firm approach. With open ears and a prayerful tongue, seek to understand rather than jump to conclusions.\n \n Do I personally agree with the heirarchy of the Catholic Church? Not really. But, I can understand some biblical stances on why it exists.\n \n Do not let your body master your spirit, have not two masters, focus all your heart, mind and body on God (toss in spirit and soul too). Seek ye the ways of God and the Path of the Christ.\n Sell all of your goods and give all away to follow God least you be shackled to material things that perish to the moth and rust.\n \n These and more can explain the reasoning of celebacy, remaining unmarried and taking vows of poverty.\n \n Arch, when you stake your faith on your beliefs, you do so infallably, no?\n because you place faith in the promises of the Christ to the Church (which we all know means people who follow, not a building or institution).\n Despite all you have been told in other threads, many times over...do you still believe?\n When you RECITE scruipture do you do so infallably. Or, do you look at the words, and say 'I think this says x...but, I don't know for sure 'cause I can't read.'\n If the Pope says \"One must repent of sin and accept the Christ as his savior.\" is that an infallable statement? or one of his bogus opinions? Did he easily come to that essential doctrinal truth or, did he have to twist scripture to make it fit?\n \n \n Really...why do you need an unbeliever to say this?\n \n Never mind...keep fighting...\n \n emoticon_xangel", 
   {
    "unicode_changes_made": true
   }, 
   264483, 
   null, 
   1180048680.0
  ], 
  [
   264556, 
   null, 
   "INRI", 
   "I need remind you both, this Papal infallability is ONLY on DOCTRINE and NOTHING ELSE.Not dogma, not tradition, not opinions.\n\n \n infallibility is extended to Dogma, not sure about Tradition but I think it is.\n \n \n \nWhen it comes to dogma like purgatory, limbo for cildren\n\n \n Purgatory is to be believed and can not be changed, this is an infallible dogma, however you are correct about limbo, infact limbo has been dropped by the Church, it was never a doctrine or a dogma but a mere theological explination that was given to be accepted or rejected by the faithful.\n \n \nReally...why do you need an unbeliever to say this?\n\n \n zardoz, your a very well informed non believer and I have a lot of respect for you for that.\n \n Arcangel, first off I would like to say it is good that we are making progress, obviously you have voiced one or two issues with the original post but its a long way short of what I was expecting, so it seems some headway has been made.\n \n 1st Concern..... This can not be accepted at all in that Peter was no more infallible than I am.\n \n you have not wrote any scripture \n \n So the fact that peter penned two infallible books and you have not means that we should be able to agree that he was \"more\" infallible than you.\n \n To not accept it is willful ignorance.\n \n \nMat 16:18 And I also say to you that you are Peter, and on this rock I will build My church, and the gates of Hades shall not prevail against it. \n \n This verse is very different than what you say here: \n\n \n I agree, thank you for pointing out my mistake.\n \n I will change that to \n \n And I also say to you (simon) that you are rock, and on this rock I will build My church, and the gates of Hades shall not prevail against it.\n \n \nAnd could I get a link to your interpretations of the Greek for ROCK as it doesn't jive with what I know to be true. And how do you deal with these verses that Say Christ is the rock of the Church ?\n\n \n Or I could give you this non biased link dealing with the name peter from the Gospel of Mathew and also the name Cephas from Johns Gospel \n \n http://en.wikipedia.org/wiki/Aramaic_of_Jesus\n \n \nThe apostle's given name appears to be Simon, and he is given the Aramaic nickname, kêfâ or kîfâ, meaning 'rock'. The final sigma (s) is added in Greek to make the name masculine rather than feminine. That the meaning of the name was more important than the name itself is evidenced by the universal acceptance of the Greek translation, &#928;&#941;&#964;&#961;&#959;&#962; (Petros). It is not known why Paul uses the Aramaic name rather than the Greek name for Simon Peter when he writes to the churches in Galatia and Corinth [4]. Perhaps, he is writing at a time before Cephas came to be popularly known as Peter.\n\n \n I can hazard a guess as to why paul used the word Cephas because the Holy spirit is an eternal spirit and forsaw all the disagrement of the passage in mathew and about Peter meaning \"rock\" or \"small stone\" and under the inspiration of the Holy Spirit, Paul made it clear for all to know that Peter was Cephas...ROCK.\n \n \n Jesus is the Rock of the church, never said he wasnt, the fact that peter is also a Rock doesn make Christ anyless of a rock, infact, it is only through Christ that Peter is a rock, because he is not a rock by his own ability but through the holy spirit whom Christ ask his father to send to him.. compare Simon before he recieved the holy spirit to after when he became \"peter\"\n \n \nAnd how do you explain Peter himself refering to the Lord as the Rock of our Faith and Salvation ? \n\n \n \n because he is.... like I have said peter gets his strengh through Christ.... it was Christ who prayed for him, it was Christ who sent the holy spirit.\n \n Christ is our rock of faith and salvation, it is through peter that he manifests his authority on earth.\n \n Peter is the foundation rock, Jesus is the cornerstone.... peter does nothing but upholds the faith, Jesus as the cornerstone stops our faith from falling in on itself.\n \n \n \nHere is what infallible means\n\n \n Here what it means to the Catholic faith.\n \n it means the Church can not err in matters of faith and morals, when a doctrine or dogma has been proclaimed by the succesor of peter or the magestirum that is a doctrine or dogma proclaimed by the bishops in conjuction with the seat of peter.\n \n \n It does not mean that any individual is infallible in his or her personal life.... The pope may proclaim the use of drugs (morals) is wrong and he would be right, yet he may still use drugs, he is not a sinless man, he is fallible in that sense but the office of peter is protected by the promise of christ.... for all the crimes of the popes, it is safe to say by the power of Christ the faith of the church was preserved throughout.... for one of the popes was quite fond of rape so I am told, yet not one doctrine on the \"holiness of rape\" \n \n \n \n\"The problen the RCC has is that they have tried, and are trying to justify and defend their doctrines while never acknowledging the power, strength and presence of the Holy Spirit in Gods church on Earth\"\n\n \n That is simply not true, the whole notion of the infallibility of the petrine office is completely reliant on the presnece, strengh and power of the holy spirit and the eternal promise of Christ.\n \n Even when the pope is elected it is the Holy Spirit who elects him by working in the Cardinals.\n \n \nWere the OT Prophets also infallible because of the books they wrote ?\n\n \n Yes they were infallible in what they wrote in those books, however I am sure they were equally as fallible as you, me, peter and his succesors in their own personal lives.\n \n \nPeter was a ainner in need of salvation just as we all are \n\n \n agreed and I will also say the same thing about everyone of his succesors!\n \n \n \nif he was infallible according to your definition then every believer in Christ is also infallible.\n\n \n not infallible in the sense that he was protected from sinning but from proclaiming false doctrine and false moral teaching .\n \n this is what we mean when we say \"infallible in matters of faith and morals\" not that he himself has an infallible faith or infallible morals...lolI think I understand your misunderstanding and why your so opposed to infallibility now when you quote.....\n \n \n \n4. Roman Catholic Church. immune from fallacy or liability to error in expounding matters of faith or morals by virtue of the promise made by Christ to the Church. \n\n \n .....and then italic \"morals\" and go into a tirade about the crimes of the popes, lol\n \n \"Expounding\" is a word I assume your unfamiliar with or simply overlooked by accident\n \n expounding \n \n http://dictionary.reference.com/browse/expounding%20\n \n noun \n a systematic interpretation or explanation \n \n To explain in detail; elucidate\n \n To give a detailed statement of; set forth\n \n \n If you read these and are so moved, receive Jesus with a sincere heart and you will receive His Holy Spirit to indwell you which is the act of being born again. Only then will you understand the personal nature of our relationship with the living God through Christ our savior.\n\n \n A personal relationship with our lord, hmm I remember those days, when all the world was a spring day, new romance was in the air and I had so much joy I could leap over the house tops, ah yes those days!\n \n I admit I would call what I have with the lord a \"personal relationship\" any longer but a marriage a holy marriage a sacramental relationship, a Covenant relationship its no longer just a \"personal relationship\" I am one with him and through him one with the father.... its not a personal relationship, its a family relationship...Archangel there is so much for you to learn and I am still on the learning curve, I meet people in the Catholic faith every day who can teach me something new, In the Catholic church I am never hungery and I am never thirsty, the cup is filled to over flowing, the Church is a spring of living water that flowed from Christs side.\n \n I hope I have eased some of your concerns.", 
   {}, 
   264537, 
   null, 
   1180057920.0
  ], 
  [
   264576, 
   null, 
   "Archangel", 
   "Arch, when you stake your faith on your beliefs, you do so infallably, no?\n because you place faith in the promises of the Christ to the Church (which we all know means people who follow, not a building or institution).\n\n \n To the bolded: Yes I do Zardoz, but that faith is based in the infallibility of God's Word, not in me for believing it. And I believe in God because of personal revelations He has revealed to me that by any himan definition would be called supernatural. So as I've said before, I don't hope He is alive, well, and a personal God. I know it from personal experience.\n \n \n\n If the Pope says \"One must repent of sin and accept the Christ as his savior.\" is that an infallable statement? or one of his bogus opinions? Did he easily come to that essential doctrinal truth or, did he have to twist scripture to make it fit?\n \n\n \n If the RCC taught that to every church member then I wouldn't have a problem with it. But their false doctrines keep people from specifically knowing the Lord in a personal way. By corrupting the Gospel they deceive people and distort the simplicity of the redemptive Work of Christ. That is the problem protestants have with the RCC.", 
   {}, 
   264556, 
   null, 
   1180063800.0
  ], 
  [
   264587, 
   null, 
   "Archangel", 
   "A personal relationship with our lord, hmm I remember those days, when all the world was a spring day, new romance was in the air and I had so much joy I could leap over the house tops, ah yes those days!\n \n I admit I would call what I have with the lord a \"personal relationship\" any longer but a marriage a holy marriage a sacramental relationship, a Covenant relationship its no longer just a \"personal relationship\" I am one with him and through him one with the father.... its not a personal relationship, its a family relationship...Archangel there is so much for you to learn and I am still on the learning curve, I meet people in the Catholic faith every day who can teach me something new, In the Catholic church I am never hungery and I am never thirsty, the cup is filled to over flowing, the Church is a spring of living water that flowed from Christs side.\n \n I hope I have eased some of your concerns.\n\n \n Eased my concerns for your spiritual condition ? Not really INRI. You're way too pompous for a believer who has been humbled by being in the actual presence of Gods Glory and unconditional Love. But I know when I'm wasting my time attempting to debate with someone. So blessings in your spiritual walk. I hope you're as spiritually fulfilled as you think you are.", 
   {}, 
   264556, 
   null, 
   1180066440.0
  ], 
  [
   264601, 
   null, 
   "INRI", 
   "no response to my response to your concerns then......I am plaesed.\n \n \n \nI can move forward now, your lack of response means either you have accepted it or you would rather remain in wilful ignorance than accept that you may have made a mistake about the Catholic faith \n\n \n \nYes I do Zardoz, but that faith is based in the infallibility of God's Word\n\n \n So everyone should listen to you.....why should anyone listen to you.... again match the things that testify to your authority against those things that testify to the authority of the seat of peter...yet you denounce the petrine office setting yourself up in his place..... ever heard of adam and eve?\n \n also I loved your infalible odctrine on the \"sinful nature of Christ\" your really protected by the holy spirit and the promise of Christ from teaching error in matters of faith", 
   {}, 
   264587, 
   null, 
   1180086060.0
  ], 
  [
   264688, 
   null, 
   "Archangel", 
   "No, not me. But if everyone on Earth listened to the Holy Spirit because He dwelled within them, this World wouldn't now be at the point of totally imploding as it is now. So believe what you will INRI. I have never debated with anyone before who totally ignored every point made against them while continuing on as if they're winning the debate. When you could no longer deal with the overwhelming evidence produced on the \"What Catholics Believe\" thread, you started this one which I responded to on faith that you would actually debate what you believe.\n \n But you are an empty suit with no depth of knowledge outside of what your church notes tell you what you may believe. And with that very limited arsenal you have the nerve to act superior and sanctimonious. So unless you go back to the other thread and actually deal with the issues I raised in my very first post, and while you're at it, the Crimes of the Popes too. Only then will I respond to you. Otherwise you just want to inflate your own ego and I want no part of that exercise. Seleh, and be at peace.", 
   {}, 
   264601, 
   null, 
   1180142280.0
  ], 
  [
   264691, 
   null, 
   "INRI", 
   "So believe what you will INRI. I have never debated with anyone before who totally ignored every point made against them while continuing on as if they're winning the debate.\n\n \n is that what its about \"winning a debate\" and here I was, I thought it was about finding truth.\n \n \nWhen you could no longer deal with the overwhelming evidence produced on the \"What Catholics Believe\" thread,\n\n \n overwhelming evidence of what.... that catholics do bad $hit...no really do they...you dont say!\n \n \nBut you are an empty suit with no depth of knowledge outside of what your church notes tell you what you may believe. And with that very limited arsenal you have the nerve to act superior and sanctimonious. So unless you go back to the other thread and actually deal with the issues I raised in my very first post, and while you're at it, the Crimes of the Popes too. Only then will I respond to you. Otherwise you just want to inflate your own ego and I want no part of that exercise. Seleh, and be at peace.\n\n \n as a matter of fact I started this thread to adress the issues you are concerned with, indeed, does not the posts i have made deal with my first response to issue no 4?\n \n what is it you want me to do regarding the Crimes of the popes, sheesh in one of my posts I openely acknowledge the fondness of rape of one of the popes what do you want me to do regarding the crimes of the popes have them dug up and beheaded.... i have adressed your concerns and your misunderstandings and you have not response to them, you will not accept what I say not because it is true or false but because it dosnt as you put it \"jive\" with what you want to believe and this is what I said from the very outset when you asked to be enlightened as to how catholic doctrines are biblical and then stated that the church doctrines are a distortion and corruption of scripture.... How could I believe I was \"winning\" anythingwith you let alone this debate, from the very outset the cards have been stacked against the church, there was never any way I could \"win\" all I could do was be ready to have an answer regarding my faith and put my trust in Jesus that my response would not be a waste of time and I dont think it has been because most people will see the way I was left with no alternitive but to adress your concerns even though I was condemned even before I adressed them. I have adressed this issue of papal infallibility and even non believers are recognising that it holds water in light of scripture even though they dont believe in scripture....I have not won any debate with you, I was never able to...however at least my position has found recognition...you have done your possition...no favours at all.", 
   {}, 
   264688, 
   null, 
   1180144080.0
  ], 
  [
   264874, 
   null, 
   "INRI", 
   "Ok now I am going to move on to a topic you dont mention specifically as one of your concerns but still implicate it your post...\"distorting and corruption\" of scripture.\n \n So we are going to deal with the bible.\n \n Thinking Christians, those who have enough brains to think for themselves apart from doctrine, dogma ect realise that if God has revealed himself to man, we must be able to know with assurance where that revelation can be found. Since we are staking our salvation on the truth of God's word, we need to know EXACTLY which books contain divine truth..... Otherwise your concerns maybe realised that we look to the words of men for the word of God. Thus we need an authoritive list (canon) of inspired books. the \"canon of scripture\" refers to a standard, or offical list of inspired books that make up the bible.\n \n At this point I have a question for you, if you would be so gracious in answering it.\n \n Why do Catholic and Protestant Bibles have a different number of Books in the OT?\n \n The protestant OT is based on the Palestinian or Hebrew Canon used by Hebrew speaking Jews in palestine. The Catholic OT is based on the Alexandrian (or Greek) canon used by the Greek speaking Jews throuhout the mediterranian, including palastine.\n \n The City of Alexandria in Egypt possessed the greatest libary in the ancient world and durring the reign of Ptolemy II Philadlphus (285-246 BC) a translation of the entire Hebrew Bible into Greek was begun by 70 or 72 Jewish scholars - According to the tradition, six from each of the twelve tribes. From this Alexandrian translation (Completed between 250 - 125 BC) we get the term \"Spetuagent\" latin for 70 (LXX), the number of translators.\n \n This greek translation was very popularbecause Greek was the common language of the entire Mediterranean world by the time of Christ, hebrew was a dying language (jews in palestine spoke Aramaic) and so it is not supprising that the Septuagent wasthe translation used bt Jesus and the NT writers.\n \n The great majority of the OT Quotations found in the NT are from the spetuagent. protestant authors Archer and Chirichigno, for example list 340 places where the NT cites from the septuagent but only 33 places where it cites the hebrew canon rather than the septuagent. By this count NT writers quoted from the septuigent over 90% of the time.... remember also the entire NT is wrote in greek.\n \n The Hebrew canon was established at Jemnia, in palestine about the year 100Ad in Reaction to the Christian Church which was using the Alexandrian Canon. The jews at jamnia rejectedseven books found in the septuigent - Wisdom, Sirach, judith, baruch, tobit and 1st and 2nd Maccabees(as well as portions of daniel and esther) - Cheifly on the grounds that they could not find any \"hebrew versions\" of these books, which the 70 scholers supposedly translated into greek. \n \n The council used 4 criteria to determine the hebrew canon.\n \n 1, Written in hebrew\n \n 2, In conformity with the torah\n \n 3, older than ezra\n \n 4, written in palestine\n \n After the hebrew canon was decided by the Jews The Christian Church continued to use the septuigent. The Late and great evangelical protestant scholar F.F Bruce confirms:\n \n \"So thoroughly, indeed, did Christian appropriate the septuigent as their version of scriptures that the Jews became increasingly disenchanted with it\" \n \n When the church officially decided which books comprise the canon of scripture (councils of hippo, 393 Ad and Carthage 397AD) it approved the 46 books of the alexandrian canon of the OT. for sixteen centuries the Alexandrian canon was a matter of uncontested faith. Each of the seven rejected books is quoted by the early Church fathers as \"scripture\" or as \"inspired\" right along with the remaining books.\n \n In 1529 Marin luther proposed the palestinian canon of 39 book as OT Canon. Luther found justification for removing the 7 books (why seven...seven lambs, seven colors of the rainbow, seven lampstands, seven days,ect) in the old concerns of St Jerome and the council of Jemania that the greek books had no hebrew counter parts. However research into the dead sea scrolls have found ancient hebrew copies of the disputed books thus making their rejection unsportable on those grounds.\n \n But Here is the REAL question for you.\n \n Which OT would you rather use - The OT used by Jesus, the NT writers and the Early church....or the OT used b the Jews who Rejected Christ and persecuted the Early church\n \n Arcangel I want you to pick up your bible and Check to see if it includes the seven books.... Wisdom - Sirach, judith, baruch, Tobit and 1 &2 Maccabees. \n \n We need to know with assurance the word of God that you posses is the fullness of revealed truth\n \n If your bible has those in you follow the authority given to it by Jesus and the Early church- if it does not you follow the authority of the Jews who rejected Christ and persecuted the Church as well as Martin Luther a man who lived some 1500 ears after Christ and also wanted to throw out James, Esther and revelationand deliberatly without any authority except his own delusions added the word \"alone\" to sacred scripture in his German translation of Romans 3:28\n \n A man who quite clearly through his own delusions has offended Christ....\n \n \"This is my solemn attestation to all who hear the prophecies in this book: if anyone adds anything to them, God will add to him every plague mentioned in the book; if anyone cuts anything out of the prophecies in this book, God will cut off his share of the tree of life and of the holy city, which are described in the book.\n \n The first word of the New Testiment was wrote about 50Ad (1 htess) the last word between 90- 100AD (REV) a total of 27 books and are accepted as scripture by both protestants and catholics alike.... The Question is who determined the NT Canon?\n \n We need to know with assurance that these books are the word of God...so we need to know who determined the canon of the NT so we can know to trust every book in the NT.\n \n Various Bishops developed lists of inspired books, Mieto, bishop of Sardis c 175AD\n \n St Irenaneus Bishop of Lyons 185AD\n \n Eusebius, bishop of Caesarea c 325AD\n \n Pope Damasus, Bishop of Rome in 382 AD prompted by the council of Rome, wrote a decree listing the Present OT and NT Canon of 73 books\n \n What you posted about Pope Damasus (not a saint btw) \n \n \nST. DAMASUS (366-84). He was the first to assume the title of Pontiff. His election was opposed by Ursicinus, whose partisans accused Damasus of adultery. [122:1] Riddle says: \n \n \"After some deadly conflicts between the followers of the two rivals, Ursicinus was banished from the city; and a similar sentence was about to be carried into effect against seven presbyters of his party, when the people interfered, and lodged them for safety in one of the churches. But even here they found no shelter from the fury of their opponents. Armed with fire and sword, Damasus, with some of his adherents, both of the clergy and of the laity, proceeded to the place of refuge, and left no less than a hundred and sixty of their adversaries dead within the sacred precincts.\" [122:2] \n That this was a massacre and not a faction fight is shown by the fact that on the side of Damasus not a single person was killed. [123:3] Ammianus Marcellinus, the contemporary historian of the event, says of the contention between Damasus and Ursicinus: \n \n \"I do not deny, when I consider the ostentation that reigns at Rome, that those who desire such rank and power may be justified in laboring with all possible exertions and vehemence to obtain their wishes; since after they have succeeded, they will be secure for the future, being enriched by offerings from matrons, riding in carriages, dressing splendidly, and feasting luxuriously, so that their entertainment surpassed even royal banquets. [123:4] \n Damasus gained the title of Auriscalpius Matronarum, ladies' ear-scratcher. [123:5] He died of fever, and the Romish Church still invokes the aid of this saintly vicar of God in fever cases. [123:6] \n\n \n Is the NT you follow truely the word of God, was this pope infallible in his decree? - yet sinful in his personal life?\n \n Or is the NT Corrupt as well?\n \n The council of hippo (N Africa) 1n 39AD Aproved the popes decree of the OT and NT Canon of 73 books\n \n The council of Carthage (N Africa) in 397 Ad again approved the Same OT and NT Canon.... this is the council which many protestants and evangelicals take as authority of the NT canon.\n \n Pope St Innocent I (401 - 417) in 405 AD approved the 73 book canon and closed the canon of the bible.\n \n The canon of the bible was offically determined by Catholic bishops , Catholic Popes and Catholic councils. For 1100 years the canon was never contested and then came the Reformation.\n \n historically the Catholic Church used her authority to determine which books belonged to scripture and to assure us that everything in the bible is inspired... apart from the catholic church we have no way of knowing which books belong to the bible or if it really is inspired.\n \n Martin luther himself admits:\n \n \"We are obliged to yield many things to the papists(Catholics) - they they possess the word of God, which we recieve from them otherwise we should have known nothing about it\"\n \n St Augustine says:\n \n \"I would put no faith in the gospels unless the authority of the CAtholic Church directed me to do so\" \n \n St Augustine recognises the only way to determine which books are inspired is to accept the teaching authoriity of the Catholic church.\n \n Historically the bible is a Catholic Book. The NT was written, coppied and collected by Catholics, The offical Canon of the books was authoritativly determined by the Catholic Church.\n \n Logically the church with the Authority to determine the infallible word of god must have the infallibel authority and guidance of the holy spirit.... In short to trust the bible is to trust the authority of the Catholic Church who Gaurentees the bible..... protestants should not quote the bible as authoritive, for they have no way of determining which books are inspired - unless of course they accept the teaching authority of the Catholic Church.", 
   {}, 
   264691, 
   null, 
   1180232700.0
  ], 
  [
   268815, 
   null, 
   "Unriggable", 
   "Archangel, you should feel proud. You know you're famous on this site when a thread is dedicated to you. Congrats. emoticon_xgood emoticon_xgood emoticon_xgood", 
   {}, 
   264874, 
   null, 
   1181893080.0
  ], 
  [
   268832, 
   null, 
   "peteratwar", 
   "A word on Papal Infallibility. This has never been part of the long Christian Heritage. It was an idea invented by a Pope in the 18th/119th century. Nearly 2000 years later! Power grabbing", 
   {}, 
   268815, 
   null, 
   1181912280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Thread for Arcangel", 
  "url": "http://www.4forums.com/political/religion-debates/9921-thread-arcangel.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 9921, 
  "discussion_files": [
   [
    "13897.html", 
    "http://www.4forums.com/political/religion-debates/9921-thread-arcangel-print.html"
   ]
  ], 
  "identifier": 9921
 }
]