[
 [
  [
   264554, 
   null, 
   "chloe", 
   "June 16, 2006\n Planned Parenthood Celebration Jolted by Abortion Survivor\n by Ted Harvey, assistant minority leader, Colorado House\n \n \n She sings the anthem to applause, then her secret is revealed to stunned silence.\n I want to share with you an awesome experience I had in the Colorado House of Representatives on May 8. It is a humbling experience to look back and realize that God used me to play a role in His divine orchestration.\n \n I was leaving the House chambers for the weekend when our Democrat speaker of the House announced that the coming Monday would be the final day of this year's General Assembly. He went on to state that there were still numerous resolutions on the calendar which we would need to be addressed prior to the summer adjournment. Interestingly, he specifically mentioned that one of the resolutions we would be hearing was being carried by the House Majority Leader Alice Madden, honoring the 90th anniversary of Planned Parenthood of the Rocky Mountains.\n \n As a strong pro-life legislator I was disgusted by the idea that we would pass a resolution honoring this 90-year legacy of genocide. I drove home that night wondering what I could say that might pierce the darkness during the debate on this heinous resolution.\n \n On Saturday morning, I took my 8-year-old son up to the mountains to go white-water rafting. The trip lasted all day. As we were driving home, exhausted and hungry, I remembered that I had accepted an invitation to attend a fundraising dinner that night for a local pro-life organization. One of my most respected mentors had personally called me several weeks earlier and asked me to attend, so I knew I'd have to clean up and head over.\n \n After our meal, the executive director of the organization introduced the keynote speaker. I looked up and saw walking to the stage a handicapped young lady being assisted to the microphone by a young man holding a guitar.\n \n Her name was Gianna Jessen.\n \n Gianna said \"Hello,\" welcomed everyone, and then sang three of the most beautiful Christian songs I have ever heard.\n \n She then began to give her testimony. When her biological mother was 17 years old and seven and a half months pregnant, she went to a Planned Parenthood clinic to have an abortion. As God would have it, the abortion failed and a beautiful 2-pound baby girl was brought into the world. Unfortunately, she was born with cerebral palsy and the doctors thought that she would never survive. The doctors were wrong.\n \n Imagine the timing! A survivor of a Planned Parenthood abortion arrived in town just days before the Colorado House of Representatives was to celebrate Planned Parenthood's \"wonderful\" work.\n As I listened to Gianna's amazing testimony, the Lord inspired me to ask her if she could stay in Denver until Monday morning so that I could introduce her on the floor of the House and tell her story. Perhaps she could even begin the final day's session by singing our country's national anthem!\n \n To my surprise she said she would seriously consider it. If she were to agree, she wanted her accompanying guitarist to stay as well. A lady standing in line behind me waiting to meet Gianna overheard our conversation and said that she would be willing to pay for the guitarist's room. Gianna then said that she would think about it.\n \n As I was driving home from the banquet, my cell phone rang. It was Gianna, and she immediately said, \"I'm in, let's ruin this celebration.\" Praise God!\n \n When Monday morning came, I awoke at 6 a.m. to write my speech before heading to the Capitol. As I wrote down the words, I could sense God's help and I knew that this was going to be a powerful moment for the pro-life movement.\n \n Following a committee hearing, I rushed into the House chambers just as the opening morning prayer was about to be given. Between the prayer and the Pledge of Allegiance, I wrote a quick note to the speaker of the House explaining that Gianna is an advocate for cerebral palsy. I took the note to the speaker and asked if I could have my friend open the last day of session by singing the national anthem. Without any hesitation the speaker took the microphone and said, \"Before we begin, Representative Harvey has made available for us Gianna Jessen to sing the national anthem.\"\n \n Gianna sang the most amazing rendition of The Star Spangled Banner that you could possibly imagine. Every person in the entire chamber was completely still, quiet and in awe of this frail young lady's voice.\n \n Due to her cerebral palsy, Gianna often loses her balance, and shortly after starting to sing she grabbed my arm to stabilize herself, and I could tell that she was shaking. Suddenly, midway through the song, she forgot the words and began to hum and then said, \"Please forgive me; I am so nervous.\" She then immediately began singing again and every House member and every guest throughout the chambers began to sing along with her to give her encouragement and to lift her up.\n \n As I looked around the huge hall I listened to the unbelievable melody of Gianna's voice being accompanied by a choir of over 100 voices. I had chills running all over my body, and I knew that I had just witnessed an act of God.\n \n As the song concluded the speaker of the House explained that Gianna has cerebral palsy and is an activist to bring awareness to the disease. \"Let us give her a hand not only for her performance today, but also for her advocacy work,\" he said. The chamber immediately exploded into applause -- she had them all in the palm of her hand.\n \n The speaker then called the House to order, and we proceeded as usual to allow members to make any announcements or introductions of guests. For dramatic effect, I waited until I was the last person remaining before I introduced Gianna.\n \n As I waited for my turn, I nervously paced back and forth praying to God that he would give me the peace, confidence and the courage necessary to pull off what I knew would be one of the most dramatic and controversial moments of my political career.\n \n While I waited, a prominent reporter from one of the major Denver newspapers walked over to Gianna and told her that her rendition captured the spirit of the national anthem more powerfully than any she had ever heard before.\n \n Finally, I was the last person remaining. So, I proceeded to the microphone and began my speech.\n \n Members, I would like to introduce you to a new friend and hero of mine -- her name is Gianna Jessen. She is visiting us today from Nashville, Tennessee, where she is an accomplished recording artist.\n \n She has cerebral palsy and was raised in foster homes before being adopted at the age of four She was born prematurely and weighed only 2 pounds at birth. She remained in the hospital for almost three months. A doctor once said she had a great will to live and that she fought for her life. Eventually she was able to leave the hospital and be placed in foster care.\n \n Because of her cerebral palsy, her foster mother was told that it was doubtful that she would ever crawl or walk. She could not sit up independently. Through the prayers and dedication of her foster mother, she eventually learned to sit up, crawl, then stand. Shortly before her fourth birthday, she began to walk with leg braces and a walker.\n \n She continued in physical therapy and after a total of four surgeries, she was able to walk without assistance.\n \n She still falls sometimes, but she says she has learned how to fall gracefully after falling for 29 years.\n \n Two years ago, she walked into a local health club and said she wanted a private trainer. At the time her legs could not lift 30 pounds. Today she can leg press 200 pounds.\n She became so physically fit that she began running marathons to raise money and awareness for cerebral palsy. She just returned last week from England where she ran in the London Marathon. It took her more than eight-and-a-half hours to complete. They were taking down the course by the time she made it to the finish line. But she made it, nonetheless. With bloody feet and aching joints, she finished the race.\n \n Members would you help me recognize a modern-day hero -- Gianna Jessen?\n \n At this point the chamber exploded into applause which lasted for 15-to-20 seconds. Gianna had touched their souls.\n \n Ironically, Alice Madden, the majority leader and sponsor of the Planned Parenthood resolution, walked over to Gianna and congratulated her.\n \n As the applause began to die down, I raised my hand to be recognized one more time.\n Mr. Speaker, members, if you would allow me just a few more moments I would appreciate your time.\n \n My name is Ted Harvey, not Paul Harvey, but, please, let me tell you the rest of the story.\n The cause of Gianna's cerebral palsy is not because of some biological freak of nature, but rather the choice of her mother.\n You see when her biological mother was 17-years-old and 7-and-a-half months pregnant, she went to a Planned Parenthood clinic to seek a late-term abortion. The abortionist performed a saline abortion on this 17-year-old girl. This procedure requires the injection of a high concentration of saline into the mother's womb, which the fetus is then bathed in and swallows, which results in the fetus being burned to death, inside and out. Within 24 hours the results are normally an induced, still-born abortion.\n \n As Gianna can testify, the procedure is not always 100 percent effective. Gianna is an aborted late-term fetus who was born alive. The high concentration of saline in the womb for 24 hours resulted in a lack of oxygen to her brain and is the cause of her cerebral palsy.\n Members, today, we are going to recognize the 90th anniversary of Rocky Mountain Planned Parenthood...\"\n BANG! The gavel came down.\n \n Just as I was finishing the last sentence of my speech -- the climax of the morning -- the speaker of the House gaveled me down and said, \"Representative Harvey, I will allow you to continue your introduction, but not for the purposes of debating a measure now pending before the House.\"\n \n At which point I said, \"Mr. Speaker, I understand. I just wanted to put a face to what we are celebrating today.\"\n \n Silence.\n \n Deafening silence.\n \n I then walked back to my chair shaking like a leaf. The Democrats wouldn't look at me. They were fuming. It was beautiful. I have been in the Legislature for five tough years, and this made it all worthwhile.\n \n The House majority leader wouldn't talk to me the rest of the day.\n \n Was it because I introduced an abortion survivor, or was it because we touched her soul? She could congratulate an inspirational cerebral palsy victim and advocate, but was outraged when she discovered that the person she congratulated was also an abortion survivor.\n The headline in The Denver Post the next day read \"Abortion Jab Earns Rebuke.\" The majority leader is quoted as saying, \"I think it was amazingly rude to use a human being as an example of his personal politics.\"\n \n Yes, Representative Madden, Gianna Jessen is a human being. She was when she was in her mother's womb, and she was when she sang the national anthem on the floor of the Colorado House of Representatives.\n \n The paper went on to quote Gianna, stating she was glad I told her story.\n \"We need to discuss the humanity of it. I'm glad to be able to speak up for children in the womb,\" she said. \"If abortion is about women's rights, where were my rights?\"\n \n All I can say is, \"Glory to God!\" He orchestrated it all, every minute of it, and I was so honored to have been chosen to play a part. May we all continue to be filled with and to fight for the passion of our Lord Jesus Christ!", 
   {
    "post_info": {
     "post_title": "Here you go..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1180057620.0
  ], 
  [
   264569, 
   null, 
   "Symbiote", 
   "I often have difficulty believing the testimony of religious zealots! Praise the Lord! They remind me a little too much of television evangelists, who substitute interjecting mindless religious phrases for any real demonstration of their honesty or faith. Amen, oh Lord, Amen! \n \n Halleleujah! So this guy takes on a fake name, and takes a girl with cerebral palsy on stage, who proceeds to sing the greatest star spangled banner anyone has ever heard, even though partway through she forgot the words and started humming. Praise God!\n \n Truly God was working with him this day, because elaborate practical jokes are an example of how unbelievers can be converted to the cause of the righteous!\n \n Like Michael Moore in Bowling for Columbine, when he took the disabled kids who had been shot into Walmart to demand they stop stocking certain products! Praise be to the use of the disabled to try and shame the wicked!", 
   {}, 
   264554, 
   null, 
   1180061100.0
  ], 
  [
   264572, 
   null, 
   "chloe", 
   "I often have difficulty believing the testimony of religious zealots! Praise the Lord! They remind me a little too much of television evangelists, who substitute interjecting mindless religious phrases for any real demonstration of their honesty or faith. Amen, oh Lord, Amen! \n \n Halleleujah! So this guy takes on a fake name, and takes a girl with cerebral palsy on stage, who proceeds to sing the greatest star spangled banner anyone has ever heard, even though partway through she forgot the words and started humming. Praise God!\n \n Truly God was working with him this day, because elaborate practical jokes are an example of how unbelievers can be converted to the cause of the righteous!\n \n Like Michael Moore in Bowling for Columbine, when he took the disabled kids who had been shot into Walmart to demand they stop stocking certain products! Praise be to the use of the disabled to try and shame the wicked!\n\n \n Harvey\n At which point I said, \"Mr. Speaker, I understand. I just wanted to put a face to what we are celebrating today.\"\n \n Silence.\n \n Deafening silence.\n \n I then walked back to my chair shaking like a leaf. The Democrats wouldn't look at me. They were fuming. It was beautiful. I have been in the Legislature for five tough years, and this made it all worthwhile.\n \n The House majority leader wouldn't talk to me the rest of the day.\n \n Was it because I introduced an abortion survivor, or was it because we touched her soul? She could congratulate an inspirational cerebral palsy victim and advocate, but was outraged when she discovered that the person she congratulated was also an abortion survivor.\n The headline in The Denver Post the next day read \"Abortion Jab Earns Rebuke.\" The majority leader is quoted as saying, \"I think it was amazingly rude to use a human being as an example of his personal politics.\"\n \n Yes, Representative Madden, Gianna Jessen is a human being. She was when she was in her mother's womb, and she was when she sang the national anthem on the floor of the Colorado House of Representatives.\n \n The paper went on to quote Gianna, stating she was glad I told her story.\n \"We need to discuss the humanity of it. I'm glad to be able to speak up for children in the womb,\" she said. \"If abortion is about women's rights, where were my rights?\"\n \n chloe\n Why should something like this put a damper on the celebration? Why does it bring about a reaction? I am not talking about the invocation of deity. I am talking about the fact that the display and personal testimony of one abortion survivor brings about such a strong reaction. Why shouldn't she be able to share her story at the celebration? It is a great example of survival and the power of a disabled woman's will and choice to live. Yes, a celebration of choice.", 
   {}, 
   264569, 
   null, 
   1180061760.0
  ], 
  [
   264574, 
   null, 
   "Symbiote", 
   "Firstly, I don't quite follow how this event is a celebration. Did they hand out cake and balloons? Was there an atmosphere of jubilation? It's a state government seating, one of the most boring and dry places in the world.\n \n \n \nWhy does it bring about a reaction? \n\n \n Why do you think it brings about a reaction? That's more the question. Do you think people in favour of legalised abortion secretly realise they're doing evil but just try to ignore it?\n \n That's what is so sad, your idea of what advocates of legalised abortion are thinking.\n \n \nWhy shouldn't she be able to share her story\n\n \n As far as I can tell, she did share her story. Praise the Lord!", 
   {}, 
   264572, 
   null, 
   1180062900.0
  ], 
  [
   264577, 
   null, 
   "chloe", 
   "Firstly, I don't quite follow how this event is a celebration. Did they hand out cake and balloons? Was there an atmosphere of jubilation? \n\n \n I don't know. Thats a good question.\n \n \nWhy do you think it brings about a reaction? Do you think people in favour of legalised abortion secretly realise they're doing evil but just try to ignore it?\n \n\n \n Some do. Some don't.\n \n I don't think the issue is really about choice, though planned parenthood has spun this line to enough women to ease their anxieties (consciences). \n \n Most people do not like to feel bad. No doubt that many women and men involved with abortions do not want feel bad about it and want society to see it as normal and ok. Judging by the national statistics, there are a lot of women walking around who have had abortions. Some have risen to levels of power in our government and leadership positions in organizations such as planned parenthood. These are no doubt a large force behind abortion advocacy and activism.", 
   {}, 
   264574, 
   null, 
   1180064100.0
  ], 
  [
   264581, 
   null, 
   "gman", 
   "A pleasant story. Not often Planned Parenthood gets to look their victims in the eye and consider how many like Gianna have been burned to death. \n How weird is that? Abortion specialist carrying a name like \"planned parenthood\".\n planned get out of parenthood payed for by taxpayers would be more appropriate.", 
   {}, 
   264572, 
   null, 
   1180064820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Here you go...", 
  "url": "http://www.4forums.com/political/abortion-debates/9926-here-you-go.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 9926, 
  "discussion_files": [
   [
    "14444.html", 
    "http://www.4forums.com/political/abortion-debates/9926-here-you-go-print.html"
   ]
  ], 
  "identifier": 9926
 }
]