[
 [
  [
   265175, 
   null, 
   "GiantOreo", 
   "Well, today the propaganda machine opened up for the Creationist organization AnswersinGenesis led by \"Dr.\" Ken Ham. This is an early tour that someone recieved, and it shows you the kind of lies and garbage this place is going to show: http://studentweb.eku.edu/zachary_lynn/museum/index.html\n \n \n I find it so sad that so many people in this country believe these things - it's so unreal that I think most of them are not mentally living in the real world.\n \n -------\n Here's an excellent editorial on it from the Cincinnati Enquirer which can be found here: Museum of misinformation.\n \n \n ------\n Apparently, Ken Ham will be debating DefCon (an organization which is a Campaign to protect the Constitution) on the O'Reilly Factor. I encourage all of you to sign the DefCon petition against this \"museum\" to protect science in america - it is found here. So far, 4,384 teachers and professors from all 50 states have signed the educators petition, while another 18,966 regular Americans have signed the citizens petition.\n \n \n ------\n Also, any of you creationists planning on going here (or anyone else planning on going for a laugh), research it before bringing your children, as some of the things here are definitely not kid-friendly - attached here is a picture of one of the displays as an example (a skinned and bleeding lamb, if you can't tell):", 
   {
    "post_info": {
     "attachments": 1, 
     "post_title": "A look at the Creationist Propaganda Museum"
    }
   }, 
   null, 
   null, 
   1180401000.0
  ], 
  [
   265177, 
   null, 
   "obvious_child", 
   "Spend enough money and most people can't tell you're lying.", 
   {}, 
   265175, 
   null, 
   1180401120.0
  ], 
  [
   265210, 
   null, 
   "Archangel", 
   "I'm going to have to plan a trip there next time I go skiing out west. Thanks for the tour. :)", 
   {}, 
   265177, 
   null, 
   1180415400.0
  ], 
  [
   265215, 
   null, 
   "GiantOreo", 
   "I am actually planning on going here this summer. I'll be going with the wife and kids - one 12, the other 16 (If you go, I'll be the guy with the \"I think therefore I'm an Atheist\" T-shirt - I would wear the one with the hand with the middle finger pointing at the cross, but my kids'll be along).\n \n The wife and I are going to make it an educational field-trip (sorta like the ones creationists do at actual museums?) to show my children how sad the human state is among some people, and the sort of fairy-tales that even some adults believe in. We'll go to every display, and my wife and I will take turns explaining to them the half-truths and outright lies and ignorance written on each display. After that, we're going out to cleanse our minds at Cincinnati Museum Center down the road which actually shows science without lies and deception.", 
   {}, 
   265210, 
   null, 
   1180417260.0
  ], 
  [
   265241, 
   null, 
   "Ripskar", 
   "LOL!\n \"Dragon Hall\" and \"Dragon theatre\", classic!\n What most suprises me though are the plaques of \"Human Reason\" vs. \"God's Word\", especially the floating island concept, which seems to be a distortion of the dissappearing lakes, but with extremely large trees and doesn't seem anchored to the shore. Of course the fact that there's a size limit for trees in those conditions doesn't seem to have occured to them, but since when do creationists consider facts?\n emoticon_xhoho", 
   {}, 
   265215, 
   null, 
   1180442520.0
  ], 
  [
   265286, 
   null, 
   "Waxy", 
   "That is down right scary.\n \n Floating island forests........emoticon_wow \n \n I'm speechless really, I can't fathom people actually touring that \"museum\" as an educational experience. How gullible and blind to reality must one be in order to accept it? I know it's not politically correct and likely to offend some, but I would have to seriously question the intelligence and sanity of anyone that believes anything that's on display in there, and in particular the \"science\" displays.\n \n Ken Ham is truly a fanatical man. I can't imagine the time and money (none of it his I'm sure) that has been poured into this incredibly blatant exercise in propaganda.\n \n Waxy", 
   {}, 
   265241, 
   null, 
   1180461480.0
  ], 
  [
   265319, 
   null, 
   "chemist99a", 
   "I'm speechless really, I can't fathom people actually touring that \"museum\" as an educational experience. How gullible and blind to reality must one be in order to accept it? I know it's not politically correct and likely to offend some, but I would have to seriously question the intelligence and sanity of anyone that believes anything that's on display in there, and in particular the \"science\" displays.\n Well you have to remember that being connected to reality is not the strong point of most fundamentalists. You should remember that these folk include an awful lot of those who think Iraq launched the 9/11 attack and that SH presented such a imminent threat to the United States that we had to go to war in a big way to save ourselves from him and his evil minions (not to mention WMDs etc). Surely you could no longer be surprised at human ignorance and willingness to believe that which is comforting or in line with ones preconceptions.", 
   {}, 
   265286, 
   null, 
   1180473900.0
  ], 
  [
   265352, 
   null, 
   "pandion", 
   "I'm speechless really, I can't fathom people actually touring that \"museum\" as an educational experience. How gullible and blind to reality must one be in order to accept it? I know it's not politically correct and likely to offend some, but I would have to seriously question the intelligence and sanity of anyone that believes anything that's on display in there, and in particular the \"science\" displays.\n Well you have to remember that being connected to reality is not the strong point of most fundamentalists. You should remember that these folk include an awful lot of those who think Iraq launched the 9/11 attack and that SH presented such a imminent threat to the United States that we had to go to war in a big way to save ourselves from him and his evil minions (not to mention WMDs etc). Surely you could no longer be surprised at human ignorance and willingness to believe that which is comforting or in line with ones preconceptions.\nAnd then there those christians whose mythology of the \"end times\" includes the belief that the \"end times\" will be begin with a war in the middle east. Thus, they do everything in their power to bring about such wars and do all they can to support them. These christians claim to serve the \"Prince of Peace\" and will wage war with anyone who disagrees with them.", 
   {}, 
   265319, 
   null, 
   1180488720.0
  ], 
  [
   265369, 
   null, 
   "obvious_child", 
   "And then there those christians whose mythology of the \"end times\" includes the belief that the \"end times\" will be begin with a war in the middle east. Thus, they do everything in their power to bring about such wars and do all they can to support them. These christians claim to serve the \"Prince of Peace\" and will wage war with anyone who disagrees with them.\n\n \n Has the thought of the prophecy being fulfilled by those who believe it ever crossed your mind?", 
   {}, 
   265352, 
   null, 
   1180497960.0
  ], 
  [
   265382, 
   null, 
   "pandion", 
   "Has the thought of the prophecy being fulfilled by those who believe it ever crossed your mind?\nOnly if the christian encouragement of war in the Levant foments a wider war that eventually results in multiple nuclear detonations. We would then, very likely, be at the \"end times\". But I would venture to say that it wouldn't be quite as fundamentalists visualize. While dying from radiation burns, radiation poisoning, and starvation isn't quite the \"rapture,\" it most certainly would be a significant extinction event. I think that earth and life on earth would go on without us, populated by organisms that evolve from the survivors for another 4 billion years or so.", 
   {}, 
   265369, 
   null, 
   1180504620.0
  ], 
  [
   265844, 
   null, 
   "chemist99a", 
   "A thought has reached the surface of my creaky brain.\n Why don't the scientists get together and protest en-mass outside the place.\n Sign waving geologists etc standing outside chanting darwinist slogans, harrasment of visitors etc. should put a crimp in the box-office. Hand out contravailing literature, put on a film in a tent outside etc etc etc. Get Dawkins to stand on a soap box and abuse the audineces? Some kind of disruptive lectures in front of the exhibits? etc. Maybe sneak in and reprogram the dinos to attack the customers as in J. Park? Should be fun.", 
   {}, 
   265382, 
   null, 
   1180696140.0
  ], 
  [
   265937, 
   null, 
   "Waxy", 
   "I just saw on article on the museum on MSN.com.\n \n Total cost was over 27 MILLION dollars.\n \n Imagine the good works that could have been done in the name of Christianity with $27,000,000. Instead it was spent on a museum of ridiculousness that caters to a VERY small segment of the population.\n \n Somehow, I don't Jesus would approve.\n \n Waxy", 
   {}, 
   265844, 
   null, 
   1180726020.0
  ], 
  [
   265939, 
   null, 
   "GiantOreo", 
   "I just saw on article on the museum on MSN.com.\n \n Total cost was over 27 MILLION dollars.\n \n Imagine the good works that could have been done in the name of Christianity with $27,000,000. Instead it was spent on a museum of ridiculousness that caters to a VERY small segment of the population.\n \n Somehow, I don't Jesus would approve.\n \n Waxy\n\n \n That was exactly my first thought as well. Then I dismissed it when I realised that such a thing would be against their particular brand of Christianity. The mere THOUGHT of using 27 million dollars to HELP people probably makes them violently nauseous.", 
   {}, 
   265937, 
   null, 
   1180726440.0
  ], 
  [
   265952, 
   null, 
   "Hi_Its_Me", 
   "A thought has reached the surface of my creaky brain.\n Why don't the scientists get together and protest en-mass outside the place.\n Sign waving geologists etc standing outside chanting darwinist slogans, harrasment of visitors etc. should put a crimp in the box-office. Hand out contravailing literature, put on a film in a tent outside etc etc etc. Get Dawkins to stand on a soap box and abuse the audineces? Some kind of disruptive lectures in front of the exhibits? etc. Maybe sneak in and reprogram the dinos to attack the customers as in J. Park? Should be fun.\n\n The only problem with that is that that will make scientists look bad. Maybe instead they could just hand out copies of the Counter-Creationism Handbook? (talk.origins offline)", 
   {}, 
   265844, 
   null, 
   1180731240.0
  ], 
  [
   266044, 
   null, 
   "ShadowPikachu", 
   "How very very sad. Not just the fact that they wasted 37 million dollars or so on this garbage when that money could be used to help so many people. No, not just that, but the fact that they are lying to and decieving other Christians with this garbage - it's disgusting.", 
   {}, 
   265952, 
   null, 
   1180753020.0
  ], 
  [
   266233, 
   null, 
   "Falsefaith", 
   "I believe the guy that made the museum is also the person who made the dinosaurs for Jurassic Park. \n \n They freaking have Adam and Eve walking around with the Dinosaurs in there! That's one thing I believe the bible left out.\n \n Millions of dollars wasted. All that money could have gone to something useful... like saving dieing children all over the world, but instead it is going towards teaching children that the earth is about 6000 years old. It's great stuff... lets teach kids to be ignorant of facts they will learn in school - teachers will love that.", 
   {}, 
   266044, 
   null, 
   1180820040.0
  ], 
  [
   266700, 
   null, 
   "chemist99a", 
   "I believe the guy that made the museum is also the person who made the dinosaurs for Jurassic Park. \n \n They freaking have Adam and Eve walking around with the Dinosaurs in there! That's one thing I believe the bible left out.\n \n Millions of dollars wasted. All that money could have gone to something useful... like saving dieing children all over the world, but instead it is going towards teaching children that the earth is about 6000 years old. It's great stuff... lets teach kids to be ignorant of facts they will learn in school - teachers will love that.\n\n \n Many have noted that an ignorant population is much easier to manipulate than an educated one. Consider the advantage of those in power when the voters are reduced to the level of being ignorant of the world around them. We see this every day in the media. The illogical and non-factual hold sway in public issue after public issue. Do you really think the high level of support organizations like the Discovery Institute and Creationist museums have is a conincdence? Look at the funders - its hardly grass roots.", 
   {}, 
   266233, 
   null, 
   1180996140.0
  ], 
  [
   267521, 
   null, 
   "Unriggable", 
   "Is this the museum that says that the flood drowned all dinosaurs and other no-longer-alive creatures such as fish, that all the meteor craters happened in the last 6,000 years (because thats how old the earth is), that tyrannosaurus rexes were vegetarians even though they couldn't chew, that humans migrated and diversified in a matter of just a few thousand years, and that the continents that made up Pangaea split apart almost instantly?", 
   {}, 
   266044, 
   null, 
   1181332320.0
  ], 
  [
   267522, 
   null, 
   "johnhanks", 
   "Is this the museum that says that the flood drowned all dinosaurs and other no-longer-alive creatures such as fish, that all the meteor craters happened in the last 6,000 years (because thats how old the earth is), that tyrannosaurus rexes were vegetarians even though they couldn't chew, that humans migrated and diversified in a matter of just a few thousand years, and that the continents that made up Pangaea split apart almost instantly?\n\n Yes. I have to add these extra words to make my response long enough to register. But the only word that matters is 'yes'.", 
   {}, 
   267521, 
   null, 
   1181333100.0
  ], 
  [
   267523, 
   null, 
   "MrWriteLA", 
   "By the way, it seems they've been hit with a sex scandal:\nIn a video shown at a new museum purporting to demonstrate how God created the universe, actor Eric Linden portrays Adam breathing life's first breath.\n \n A jaunt around the Internet shows Linden posing alongside a drag queen on an explicit Web site he owned called Bedroom Acrobat, the Associated Press reports. The Web site allows its network of members to post explicit stories and photos, AP reports.\n \n When it learned of Linden's activities with the Web site, the Creation Museum in Kentucky pulled the 40-second video in which he appears.\nhttp://rawstory.com/news/2007/Creationist_actors_porno_past_0608.html", 
   {}, 
   267522, 
   null, 
   1181333820.0
  ], 
  [
   267524, 
   null, 
   "smiley", 
   "Is this the museum that says that the flood drowned all dinosaurs and other no-longer-alive creatures such as fish, that all the meteor craters happened in the last 6,000 years (because thats how old the earth is), that tyrannosaurus rexes were vegetarians even though they couldn't chew, that humans migrated and diversified in a matter of just a few thousand years, and that the continents that made up Pangaea split apart almost instantly?\n\n \n Of course Tyrannosaurus Rexes were vegetarian. That's what all those sharp teeth are for (tearing up vegetables). You should not question these 'facts' as god might get a bit miffed and smite you or something.\n \n The only problem with your explanation is the word 'diversified' when applied to humans. This might suggest some sort of evolution, which we all know could not possibly have happened.\n \n It was all done by MAAAaagic.\n \n Smiley", 
   {}, 
   267521, 
   null, 
   1181333880.0
  ], 
  [
   267539, 
   null, 
   "Ripskar", 
   "Well technically the museum takes the position that dinosaurs survived into the medieval period (Dragons) Pangea never existed and the world never had periods of glaciation.", 
   {}, 
   267524, 
   null, 
   1181342520.0
  ], 
  [
   267549, 
   null, 
   "chemist99a", 
   "Of course Tyrannosaurus Rexes were vegetarian. That's what all those sharp teeth are for (tearing up vegetables). You should not question these 'facts' as god might get a bit miffed and smite you or something.\n Yep they could and did devour truckloads of tomatos in a few seconds per load. Afterwards they were often mistaken for predators due to the tomato juice running down their chins. Actually they were as friendly as dogs just too large and too hungry all the time - takes an awful lot of veggies to keep all that muscle and bone going. But many cavemen kept one or two of them around as pets - space permitting of course.", 
   {}, 
   267539, 
   null, 
   1181346780.0
  ], 
  [
   267562, 
   null, 
   "Unriggable", 
   "Well technically the museum takes the position that dinosaurs survived into the medieval period (Dragons) Pangea never existed and the world never had periods of glaciation.\n\n \n Thanks god we sorted that out! I mean, the whole South America - Africa thing is just a coincidence right? Right?", 
   {}, 
   267539, 
   null, 
   1181351820.0
  ], 
  [
   267576, 
   null, 
   "wascallywabbit", 
   "**\n Chronic ignorance is the U.S.A.'s most prized cultural achievement.", 
   {}, 
   267562, 
   null, 
   1181355180.0
  ], 
  [
   267590, 
   null, 
   "chemist99a", 
   "**\n Chronic ignorance is the U.S.A.'s most prized cultural achievement.\n\n \n Are you setting yourself up as an exemplar of such achievement? One would think you would make a good candidate seeing that you are a vitalist and cannot read a simple scientific report and understand its contents.", 
   {}, 
   267576, 
   null, 
   1181357040.0
  ], 
  [
   267752, 
   null, 
   "Unriggable", 
   "**\n Chronic ignorance is the U.S.A.'s most prized cultural achievement.\n\n \n Perfect prize for the 40% of us who don't believe in evolution...", 
   {}, 
   267576, 
   null, 
   1181425620.0
  ], 
  [
   267849, 
   null, 
   "ShadowPikachu", 
   "Just found this blog. It details a visit by several people to the Creation Propaganda Museum, complete with pictures of the stupidity represented there (not to mention the graphic images shown at the museum - definitely not a kid-friendly place).", 
   {}, 
   267752, 
   null, 
   1181457240.0
  ], 
  [
   268014, 
   null, 
   "Unriggable", 
   "So disappointing...", 
   {}, 
   266233, 
   null, 
   1181527080.0
  ], 
  [
   268038, 
   null, 
   "pandion", 
   "But what would you expect from faux-christians but faux-science?", 
   {}, 
   268014, 
   null, 
   1181537280.0
  ], 
  [
   268112, 
   null, 
   "Unriggable", 
   "But what would you expect from faux-christians but faux-science?\n\n \n I mean its dissapointing that the churches get this much money and rather than spend it on aid of some sort they decide to do this...", 
   {}, 
   268038, 
   null, 
   1181583660.0
  ], 
  [
   268139, 
   null, 
   "chemist99a", 
   "Tax free at that! And the proceeds are also untaxed etc. At least the churches should be required to fund the schools!", 
   {}, 
   268112, 
   null, 
   1181592000.0
  ], 
  [
   268271, 
   null, 
   "Unriggable", 
   "Tax free at that! And the proceeds are also untaxed etc. At least the churches should be required to fund the schools!\n\n \n Not to mention how much influence these guys have on capitol hill...using this museum as an example, many lobbyists could use this as a pretext to construct other sites.", 
   {}, 
   268139, 
   null, 
   1181625180.0
  ], 
  [
   268349, 
   null, 
   "jitobear", 
   "Just found this blog. It details a visit by several people to the Creation Propaganda Museum, complete with pictures of the stupidity represented there (not to mention the graphic images shown at the museum - definitely not a kid-friendly place).\n\n \n That blog was HYSTERICAL. I wanna go to this place now. It sounds like an absolute HOOT!", 
   {}, 
   267849, 
   null, 
   1181669100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A look at the Creationist Propaganda Museum", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9938-look-creationist-propaganda-museum.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 9938, 
  "discussion_files": [
   [
    "11370.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9938-look-creationist-propaganda-museum-print.html"
   ], 
   [
    "11371.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9938-look-creationist-propaganda-museum-3-print.html"
   ], 
   [
    "11372.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/9938-look-creationist-propaganda-museum-2-print.html"
   ]
  ], 
  "identifier": 9938
 }
]