[
 [
  [
   265662, 
   null, 
   "Symbiote", 
   "So who has been watching these? \n \n My interest has been drawn largely by the presence of Ron Paul, probably the only honest man among the lot, not that there's a chance in hell he'll get the nomination, but it's satisfying to see him speaking.\n \n I have a feeling it might be Giuliani who gets the nomination in the end, although polls do vary widely, but there's something about that guy that really creeps me out, like he is concealing any actual beliefs or plans he has and essentially trying to ride to power on a wave of popular prejudices and false patriotism, and in a much more calculated way than even many other politicians, with the exception of Hillary.", 
   {
    "post_info": {
     "post_title": "Republican party presidential nominations 2008"
    }
   }, 
   null, 
   null, 
   1180618620.0
  ], 
  [
   265675, 
   null, 
   "Matthew S", 
   "Ron Paul is one of the most dangerous and evil men in the race.\n http://www.lewrockwell.com/paul/paul207.html\n \n \nThis Congress, I was an original cosponsor of the Marriage Protection Act, HR 3313, that removes challenges to the Defense of Marriage Act from federal courts&#8217; jurisdiction\n\n \n Which would remove my 1st amendment rights \"to petition the government for a redress of grievances.\"\n If I can't challenge an act of congress in the federal courts then my rights are taken away. The state courts have no jurisdiction over the federal government. This is another example of the rebublican war upon the civil rights of gay americans. Ron Paul is just another republinazi willing to oppress gay people to preserve his heterosexual privledge.\n \n \n \nInstead, I plan to continue working to enact the Marriage Protection Act and protect each state&#8217;s right not to be forced to recognize a same sex marriage.\n\n \n Does this mean that if a state does not want to recognise the marriages of hetero couples he also supports the states right not to? What if does not want to honor another states drivers licenses, IDs, licesnse plates and car registration, or certificates of incorporation? Does this mean that he supports the removal or elimination of the full faith and credit clause?", 
   {}, 
   265662, 
   null, 
   1180623240.0
  ], 
  [
   265676, 
   null, 
   "Symbiote", 
   "This comment strikes me as laughably ignorant, if you would take the time to actually understand his position you would see that he has consistently voted on the basis of the constitutionality of laws and the principles on which America was founded.\n \n For the same reasons he supports a measure you deem anti-gay, he also opposes a constitutional amendment defining marriage as between a man and a woman.\n \n Though I doubt such a nuanced approach is comprehensible to you, in your world everyone is divided into pro-gay and anti-gay camps and makes all their decisions on the basis of whether they like gays or not.", 
   {}, 
   265675, 
   null, 
   1180624380.0
  ], 
  [
   265677, 
   null, 
   "Matthew S", 
   "This comment strikes me as laughably ignorant, if you would take the time to actually understand his position you would see that he has consistently voted on the basis of the constitutionality of laws and the principles on which America was founded.\n \n For the same reasons he supports a measure you deem anti-gay, he also opposes a constitutional amendment defining marriage as between a man and a woman.\n \n Though I doubt such a nuanced approach is comprehensible to you, in your world everyone is divided into pro-gay and anti-gay camps and makes all their decisions on the basis of whether they like gays or not.\n\n \n NO I believe in equality for all. This means that if a hetero can do something legally a gay person should be able to do the same thing and have the same legal rights.\n \n \n \n\n Ironically, liberal social engineers who wish to use federal government power to redefine marriage will be able to point to the constitutional marriage amendment as proof that the definition of marriage is indeed a federal matter! I am unwilling either to cede to federal courts the authority to redefine marriage, or to deny a state&#8217;s ability to preserve the traditional definition of marriage. Instead, I believe it is time for Congress and state legislatures to reassert their authority by refusing to enforce judicial usurpations of power.\n\n \n Why, if he is not in the anti gay camp, would he want to protect marriage? Who is he protecting it from? Why does it matter if marriage is \"redefined\" If he was nuetral or pro gay it wouldn't matter. He wants to protect his privledge so that when someone says a person is married he can assume that if a male the spouce if female and visa versa if a woman. \n \n The United States was founded as a nation that codified slavery into the law. Does this mean that he wants to see the reinstitution of slavery? \n \n So the removal of my 1st amendment rights is constituional?", 
   {}, 
   265676, 
   null, 
   1180624620.0
  ], 
  [
   265679, 
   null, 
   "Symbiote", 
   "Neither the constitution of the US nor the principles on which it were founded endorsed slavery, however the politicians and people of the US at that time were guilty of the inconsistent application of those principles.\n \n \nSo the removal of my 1st amendment rights is constituional?\n\n \n If you believe the 1st amendment means \"If you don't like a state law, the federal government has the legitimate power to change it\", you are misinterpreting the 1st amendment. The constitution deals with the legal powers of the federal government, and the phrase you are referring to makes it clear that it is unconstitutional to create laws prohibiting people from complaining to the government about some matter. \n \n It does not give it the power to create any law it likes so long as someone has complained about it, such an interpretation would have absurd implications and essentially render the rest of the constitution meaningless.\n \n While his personal views certainly appear to be that marriage is something between a man and a woman, as a matter of policy his stance is consistently that it is not the business of the federal government to decide, that it is a matter instead for the states. In this sense I would consider him neutral with regard to gay rights, certainly pro gay rights when compared to those who support a constitutional amendment defining marriage as between a man and a woman.", 
   {}, 
   265677, 
   null, 
   1180625940.0
  ], 
  [
   265685, 
   null, 
   "Matthew S", 
   "Neither the constitution of the US nor the principles on which it were founded endorsed slavery, however the politicians and people of the US at that time were guilty of the inconsistent application of those principles.\n \n \n \n If you believe the 1st amendment means \"If you don't like a state law, the federal government has the legitimate power to change it\", you are misinterpreting the 1st amendment. The constitution deals with the legal powers of the federal government, and the phrase you are referring to makes it clear that it is unconstitutional to create laws prohibiting people from complaining to the government about some matter. \n\n \n \n Amendment I\n \n Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances.\n \n \n \n \n \n`No court created by Act of Congress shall have any jurisdiction, and the Supreme Court shall have no appellate jurisdiction, to hear or determine any question pertaining to the interpretation of section 1738c of this title or of this section. Neither the Supreme Court nor any court created by Act of Congress shall have any appellate jurisdiction to hear or determine any question pertaining to the interpretation of section 7 of title 1.'.\n\n \n So if congress takes any challenges to DOMA out of the federal courts how then can I redress that grevience? How is congress by making it impossible for a citizen to challenge a grievence in the courts not making a law and taking away the 1st amendment rights of of gay americans?\n \n \n \n\n It does not give it the power to create any law it likes so long as someone has complained about it, such an interpretation would have absurd implications and essentially render the rest of the constitution meaningless.\n\n \n No it says congress shall make no law. I have used the arguement, and been rebuffed, that congress is restricted from making laws that restrict religious freedom. That the states could ban religion if they wanted to. Now you are saying that congress has the power to restrict peoples access to the courts when the congress is strictly forbidden by the constitution from doing exactly that? How do you reconcile your arguement that Ron Pual is a protector of constituional rights when he is leading to tkae the constituional rights of citizens away. What if it were a different issue say, worker safety or consumer safety? What if congress stripped away the rights of citizens to sue in federal court over the death of their child from negligence. What if they had stripped the federal courts from hearing cases about segegation?\n \n \n\n While his personal views certainly appear to be that marriage is something between a man and a woman, as a matter of policy his stance is consistently that it is not the business of the federal government to decide, that it is a matter instead for the states. In this sense I would consider him neutral with regard to gay rights, certainly pro gay rights when compared to those who support a constitutional amendment defining marriage as between a man and a woman.\n\n \n So your arguement is that the devil that only cuts me is better then the devil that flays me?\n \n So wouldn't you argue that if California want to ban all baptists they could and that congress could strip the courts from hearing cases related to California's laws.", 
   {}, 
   265679, 
   null, 
   1180628220.0
  ], 
  [
   265688, 
   null, 
   "Symbiote", 
   "So if congress takes any challenges to DOMA out of the federal courts how then can I redress that grevience?\n\n \n The 1st amendment does not guarantee your right to have your grievances redressed, it forbids laws prohibiting petitioning the government. For example, a law which jailed gay rights activists, or people who wanted to sue the federal government for one reason or another.\n \n \nNo it says congress shall make no law.\n\n \n DOMA isn't a law that prohibits you from petitioning.\n \n \nWhat if it were a different issue say, worker safety or consumer safety? What if congress stripped away the rights of citizens to sue in federal court over the death of their child from negligence. What if they had stripped the federal courts from hearing cases about segegation?\n \n\n \n Then they would be an issue for the states instead? I don't see why you think the federal government is an inherently superior place to resolve disputes, does being more powerful make you more \"good\"?\n \n There is a strong argument in the classical liberal tradition for the decentralisation of power, one reason is that if a particular state makes laws the people there find oppressive or unjust, they at least have the option of living in a different state, whereas if the federal government institutes a blanket law concerning such a matter, there are few options available. Furthermore, the view of this tradition of thought is that government is at best an untrustworthy guardian, and that power corrupts, and for this reason it is best to have government power be as diffuse and localised as possible.\n \n And I find it completely absurd you call this man one of the most \"dangerous and evil\" in the race, when he is the only candidate who opposes and has consistently opposed the war in iraq, has a remarkable record of voting consistently constitutionally in his years in congress, and a personal and public history as clean as a whistle. I believe you hadn't even heard of him before, you haven't watched the debates, and simply googled his name when I mentioned him and made up your mind based on a few paragraphs you skimmed with regards to his stance on gay marriage. Indeed if I google \"ron paul gay marriage\", the first result is the very one you referenced, which indicates to me a remarkably narrow view on politics. You'd vote for Stalin if he promised universal legalisation of gay marriage.\n \n Which other republican candidates do you think are better, when this one you call \"one of the most dangerous and evil\"?", 
   {}, 
   265685, 
   null, 
   1180629180.0
  ], 
  [
   265690, 
   null, 
   "gamehuis", 
   "Setting aside Matthews ignorant rant, I'd like to say that if I were an American, I'd vote for Ron Paul. He's the only one that consistently looks at the constitutionality of each bill before voting. He's also a strong proponent of States rights.\n His libertarian views also mirror my views on how government should act and how people should take responsibility for their own lives instead of looking for a government handout.\n \n Giuliani on the other hand is a scumbag. If you look closely at the things he says and does (especially his \"law\" firm), it's quite clear that he's basically a new Il Duce.", 
   {}, 
   265685, 
   null, 
   1180630380.0
  ], 
  [
   265716, 
   null, 
   "Matthew S", 
   "To answer your question. There is no rebuplican candidate that is better then the rest they are all evil and vile. So just his being a republican and thereby supporting the republican platform is his discredit. Several months ago we had a thread about Ron Paul and I emailed his campaign about his stance on gay rights but never got an answer. So yes you are right when first reading this thread I did google his name and found out his evil vile stance against gay rights.\n \n For the record this is my priority list about issues\n \n 1 gay rights\n 2 social justice\n 3 enviornment\n 4 war in Iraq\n \n So I don't care that he is anti war if he opposes my other 3 more important issues. What difference does it make if he stops the war or opposes the war if I am not equal and free.", 
   {}, 
   265690, 
   null, 
   1180635900.0
  ], 
  [
   265718, 
   null, 
   "Master_Shake", 
   "The real irony in your stance in general Matthew, is that when you refuse to recognize real differences between people because they aren't a crusader for everything you believe in you, in effect, shut out the possibility of causing any real change.", 
   {}, 
   265716, 
   null, 
   1180636620.0
  ], 
  [
   265719, 
   null, 
   "Master_Shake", 
   "On another note, it looks like Mr. Law and Order may actually run. He's no longer going to be on the show, which may indicate he is working on running.", 
   {}, 
   265718, 
   null, 
   1180636740.0
  ], 
  [
   265721, 
   null, 
   "Matthew S", 
   "Lets take segagation as an example. By Ron Pauls own admission he would be support segregation. After all if the states law is that the races can not mix then why would he suppot the federal court telling the people in one state they can't segregate.\n \n \nIf I were a member of the Texas legislature, I would do all I could to oppose any attempt by rogue judges to impose a new definition of marriage on the people of my state.\n\n \n At one time those \"rouge judges\" were ruling that segregation was unconstitutional. \n \n \nI also am concerned that the proposed amendment, by telling the individual states how their state constitutions are to be interpreted, is a major usurpation of the states&#8217; power. The division of power between the federal government and the states is one of the virtues of the American political system. Altering that balance endangers self-government and individual liberty. However, if federal judges wrongly interfere and attempt to compel a state to recognize the marriage licenses of another state, that would be the proper time for me to consider new legislative or constitutional approaches.\n\n \n \n So then what he is saying is that the federal government should have no power to protect the rights of citizens and those that have been wronged by the states should have no right to correct that wrong.", 
   {}, 
   265716, 
   null, 
   1180636860.0
  ], 
  [
   265722, 
   null, 
   "Matthew S", 
   "The real irony in your stance in general Matthew, is that when you refuse to recognize real differences between people because they aren't a crusader for everything you believe in you, in effect, shut out the possibility of causing any real change.\n\n \n So you are saying that Ron Paul is different? Some how he would come to support the issues I believe in? That I should support him because he is less evil then say Romney or Brownback?\n \n I have looked at the man I have seen his stance. I ask again what difference does it make to me if he is anti war.\n \n It is a choice between the devil that will only cut me (and I should be gratefull right?) and the devil that will flay me.\n \n \n \n Is he in support of any of the following?\n \n \n Impeaching bush and chaney.\n Putting restictions on the religious right to shut them up.\n Regulating the price of oil.\n Increasing taxes on corporations by 100%\n Regulating corporations to protect workers and the environment.\n Raising the minimum wage to 12$ an hour.\n Instituting national health care.\n Sending to the states my privacy amendement.\n Getting rid of DOMA, and Don't ask Don't Tell.\n Sending to the states an Equal marriage amendment.", 
   {}, 
   265718, 
   null, 
   1180637340.0
  ], 
  [
   265726, 
   null, 
   "Master_Shake", 
   "So you are saying that Ron Paul is different? Some how he would come to support the issues I believe in? That I should support him because he is less evil then say Romney or Brownback?\n \n I have looked at the man I have seen his stance. I ask again what difference does it make to me if he is anti war.\n \n It is a choice between the devil that will only cut me (and I should be gratefull right?) and the devil that will flay me.\n \n \n \n Is he in support of any of the following?\n\n I didn't say support him or don't support him, and I wasn't just talking about Ron Paul here Matthew. I'm talking about the stance you take on everything. If you can't work with, listen to, discuss with, or even not hate someone who isn't a zealot, you're never going to help your cause and you're only going to hurt it.", 
   {}, 
   265722, 
   null, 
   1180638780.0
  ], 
  [
   265745, 
   null, 
   "conservative", 
   "he is less evil \n\n \n This mindset is your problem...\n In one of your posts you said that being a Republican makes him evil; so does that make me evil? I'm a republican. You shouldn't generalize like that, you seem like Hitler or Stalin mentality. There are plenty of liberal democrats that I don't like (some I hate their guts.....*cough*hillary*cough*) but I am still friends with a lot of people that agree with them. You talk about supporting social rights, isn't one of those rights you talk about the ability to do something without being automatically judged? So why judge others... it just makes you a hypocrite.\n \n \nPutting restictions on the religious right to shut them up.\n\n \n Wasn't the first amendment what you were just ranting about protecting?\n \n Anyway, in my opinion, Giuliani isnt even worth considering. He screwed up New York and his life before 9/11, and that date should not be used by anyone as a political steppingstone.", 
   {}, 
   265726, 
   null, 
   1180646160.0
  ], 
  [
   265753, 
   null, 
   "Steeeeve", 
   "NO I believe in equality for all. \nNo you don't...and you even admit this from time to time.", 
   {}, 
   265677, 
   null, 
   1180647600.0
  ], 
  [
   265755, 
   null, 
   "Steeeeve", 
   "Haha, Matthew's rant is rather funny :) Ron is right when he says it should be a state issue. I don't mind this. With segregation..assuming no constitutional issues...then I would have said it should be a state issue as well. In the very rare case that you end up having a large number of states end segregation (as an example) and only a few that don't then I support the federal government cutting funding to that state or just passing an amendment. This is rarely needed though as most issues should follow a state by state basis..even more so for the evenly divided issues like abortion and gay marriage. Federal interaction has just made it worse and more heated.\n \n As for good candidates I don't really think Ron Paul is the best guy. He has some good ideas but he doesn't seem like he has leadership skills.\n \n Romney looks a little to \"slick\" and acts it too. I have a hard time believing he is true to what he says. Rudy and McCain are just no good. \n \n The only one I kinda like is Mike Huckabee. He seems a little more reasonable and even is willing to raise taxes if that is what it takes. I am not in favor of some of his ideas but he has shown good leadership in Arkansas and seems to be willing to actually work with people instead of playing politics all day long. One time he spoke about how democrat Mark Warner would be a good president which I find pretty admirable coming from a fairly conservative republican. Overall I think Governors do a better job as president anyway so that limits my field. \n \n It seems now you can't just look at ideas but rather you have to look at what the candidate might be like as a leader. The candidates will tell you anything now a days but they can't run from how they have led in the past :)", 
   {}, 
   265753, 
   null, 
   1180648680.0
  ], 
  [
   265793, 
   null, 
   "Matthew S", 
   "So if I understand Ron Pauls position, after reading through his writtings, he would support a state that closed its borders then made all non state residents stop and take get a drivers license before entering the state. Also he would support one state refusing to honor contracts interacted in another state if the former state's legislature outlawed such contracts. For instance if Alaska decided to not honor incorporation papers from Utah. Ron Paul would support Alaska's right to make the Utah company reincorporate in Alaska.", 
   {}, 
   265755, 
   null, 
   1180664580.0
  ], 
  [
   265807, 
   null, 
   "Symbiote", 
   "Again, Matthew, why do you think the federal government is superior to the states in determining right from wrong? Saying the federal government should decide these things seems rather ironic when there's currently a federal initiative in place to universally ban gay marriage.", 
   {}, 
   265793, 
   null, 
   1180670160.0
  ], 
  [
   265812, 
   null, 
   "Matthew S", 
   "Again, Matthew, why do you think the federal government is superior to the states in determining right from wrong? Saying the federal government should decide these things seems rather ironic when there's currently a federal initiative in place to universally ban gay marriage.\n\n \n So then what is the purpose of the federal governmant? So then is my assement of Ron Pauls position correct? It would then be allright for a state to close its borders to out of state drivers with out of state drivers licenses? So then you think it would be allright for the Mass. legislature to say to the other states either you recognise all our marriage contracts or we will not recognise any of yours? So then I as a citizen of Michigan could go to Mass. and get married, once they do away with the 1913 law. Then sue the state of Michigan in Mass courts to have either Michigan recognise my marriage or the state of Mass not recognise Michigan marriages. See without the federal government interstate relations turn into chaos. What Ron Paul wants is 50 independent nations held loosely together by articles of confederation.", 
   {}, 
   265807, 
   null, 
   1180671300.0
  ], 
  [
   265814, 
   null, 
   "Steeeeve", 
   "So then what is the purpose of the federal governmant?\n\n \n What is the purpose of the federal government you ask. Try reading the ideas of James Madison and a few other folks that wrote the constitution and perhaps you can get an idea. Maybe even the federalists papers are a good start.", 
   {}, 
   265812, 
   null, 
   1180671600.0
  ], 
  [
   265817, 
   null, 
   "Symbiote", 
   "I don't know specifically regarding driving licenses, but the idea that some states would start prohibiting drivers from other states from using their roads without the feds forcing the issue seems kind of ridiculous to me.\n \n You said previously that your top priority was gay rights, but it seems to me your real top priority is consolidation of power in the federal government. Maybe you should vote Giuliani, here's a quote from him.\n \n \"Freedom is about authority. Freedom is about the willingness of every single human being to cede to lawful authority a great deal of discretion about what you do.\"\n \n Now I know why I find this guy creepy.", 
   {}, 
   265814, 
   null, 
   1180672200.0
  ], 
  [
   265853, 
   null, 
   "Matthew S", 
   "I don't know specifically regarding driving licenses, but the idea that some states would start prohibiting drivers from other states from using their roads without the feds forcing the issue seems kind of ridiculous to me.\n\n \n I mean look at what Ron Paul is saying. He is a states rights over the federal government. So he would support a state closing its borders to other drivers until they were licensed to drive in that state.\n \n \n \n \n \n\n You said previously that your top priority was gay rights, but it seems to me your real top priority is consolidation of power in the federal government. Maybe you should vote Giuliani, here's a quote from him.\n\n \n I support any system that would ensure that I and my family are treated the same as a heteros and hetero families. If it takes the federal government to say to the states that you can not discriminate against gays and our families then so be it. Just as with interracial issues that is what it is going to take. That is what Ron Paul does not understand . If the congress in 1964 were full of Ron Pauls there would never have been any civil rights legislation. Then again maybe you think that was a bad idea too?\n I support the candidate that supports gay rights the most. I will be supporting Edwards if he gets the nomination. I will always support the democrat over the republican. Now if only a green were a major contender.\n \n \n \n \n \n \n\n \"Freedom is about authority. Freedom is about the willingness of every single human being to cede to lawful authority a great deal of discretion about what you do.\"\n\n \n Isn't this a typical evangelical christian statement? After all the kingdom of God is not a democracy.\n \n \n \n \n\n Now I know why I find this guy creepy.\n\n \n I find all republicans creepy but you are right the scariest one in the race is\n Tom Tancredo and not Ron Paul.\n http://civilliberty.about.com/od/profiles/ig/2008-Republican-Candidates/Tom-Tancredo.htm\n \n \n \nWar on Terror:\n Has called for nuclear strikes on Saudi Arabia in the event of another al-Qaeda attack. When asked about the likely civilian death toll, Tancredo responded: \"When we bombed Hiroshima, when we bombed Dresden, we punished a lot of people who were not necessarily [guilty] ... You do things in war that are ugly.\"\n", 
   {}, 
   265817, 
   null, 
   1180701900.0
  ], 
  [
   266695, 
   null, 
   "conservative", 
   "He is a states rights over the federal government. So he would support a state closing its borders to other drivers until they were licensed to drive in that state.\n\n \n That's blowing things way out of proportion... It's like saying those that support federal over state rights want to make the country into a USSR-like political layout... (many states, with them and their leaders having no power whatsoever under a dictatorial federal government)\n \n Do you think an overly radical, all-power-to-the-states legislation would ever get through Congress?", 
   {}, 
   265853, 
   null, 
   1180995540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Republican party presidential nominations 2008", 
  "url": "http://www.4forums.com/political/politics-debates/9952-republican-party-presidential-nominations-2008-a.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 9952, 
  "discussion_files": [
   [
    "31789.html", 
    "http://www.4forums.com/political/politics-debates/9952-republican-party-presidential-nominations-2008-a-print.html"
   ], 
   [
    "31790.html", 
    "http://www.4forums.com/political/politics-debates/9952-republican-party-presidential-nominations-2008-a-2-print.html"
   ]
  ], 
  "identifier": 9952
 }
]