[
 [
  [
   266128, 
   null, 
   "BeHereNow", 
   "Suffering causes unhappiness. \n \n Desire is the cause of all suffering.\n \n Eliminate desire, and you will eliminate suffering,and thus unhappines.\n \n If I desire to eat, I will suffer hunger. If I have no desire to eat, I will have no hunger.\n \n If I desire to be warm, I will suffer cold.\n If I desire to be cool, I will suffer heat.\n \n If I desire wealth, I will suffer poverty.\n If I desire poverty, I will suffer wealth.\n \n If my arm is missing, and I desire a new arm, I will suffer the loss of an arm. If I desire no arm, I will not suffer a loss.\n \n If I am injured physically or emotionally, and I desire that there was no injury, I will suffer pain.\n \n If a loved one dies, and I desire that they were alive, I will suffer the loss of a loved one.", 
   {
    "post_info": {
     "post_title": "Desire and Suffering"
    }
   }, 
   null, 
   null, 
   1180792140.0
  ], 
  [
   266145, 
   null, 
   "gman", 
   "Suffering causes unhappiness. \n \n Desire is the cause of all suffering.\n \n Eliminate desire, and you will eliminate suffering,and thus unhappines. \n\n \n Is it our desire to become robots? Feigning happiness, ignoring natural reactions to natural life events?", 
   {}, 
   266128, 
   null, 
   1180797120.0
  ], 
  [
   266152, 
   null, 
   "BeHereNow", 
   "gman Is it our desire to become robots? Feigning happiness, ignoring natural reactions to natural life events?\nIs what our desire to become robots? (What is this \"it\" you refer to?)\n Lacking full understaning of your comment/question, my reply would be that a desire to become a robot would lead to suffering.\n \n Happiness is not desire, happiness is not suffering.\n Happiness is a lack of desire, a lack of suffering.\n It is best for persons to give their full attention to natural reactions and natural events. Dare I say, to Be...Here...Now.\n \n It seems we agree on much.", 
   {
    "unicode_changes_made": true
   }, 
   266145, 
   null, 
   1180798320.0
  ], 
  [
   266160, 
   null, 
   "BeHereNow", 
   "Here is one who would disagree: \n \"One does not live sincerely until he has a taste for suffering.\" ~ ~ ~Luigi Guanella\n \n The Christian faith is heavily dependent on desire and suffering as a way of life.", 
   {}, 
   266152, 
   null, 
   1180799820.0
  ], 
  [
   266243, 
   null, 
   "Zardoz", 
   "Any other idiotic thing you want to present?\n \n If you want to stop desiring, let be work on your brain with a power drill.\n \n If you're content with little, you will have little.\n You will suffer because of this...as will your descendants.\n So, be content with your hovel right up until the time I plow it down to make a new super mega-mart palace of spiritual desire incarnate. Then be content in the dirt next to it until I pave over that too for a parking lot for worshipers of the above given palace. \n If you've mastered the art of meditation, affecting the part of your brain that differentiats self from, say a dirt clod in the ground, and are one with the universe in perfect contentment, free from all desire...you'll probably not care if you are part of said parking lot.\n \n \n BeHereNow...part of the eternal apathy.\n \n Not quite as good as BeHereNow, enjoy the memories of the Past and seek to create new ones with goals and desires for a better Tomorrow for self and possibly for all.", 
   {}, 
   266160, 
   null, 
   1180822440.0
  ], 
  [
   266246, 
   null, 
   "BeHereNow", 
   "zardoz\n \n Logic such as that requires no reply.", 
   {}, 
   266243, 
   null, 
   1180823100.0
  ], 
  [
   266587, 
   null, 
   "sinjin", 
   "A preference for happiness over suffering is a form of desire.", 
   {}, 
   266246, 
   null, 
   1180976640.0
  ], 
  [
   266614, 
   null, 
   "E Mutz", 
   "Suffering causes unhappiness. \n \n Desire is the cause of all suffering.\n \n Eliminate desire, and you will eliminate suffering,and thus unhappines.\n \n If I desire to eat, I will suffer hunger. If I have no desire to eat, I will have no hunger.\n \n If I desire to be warm, I will suffer cold.\n If I desire to be cool, I will suffer heat.\n \n If I desire wealth, I will suffer poverty.\n If I desire poverty, I will suffer wealth.\n \n If my arm is missing, and I desire a new arm, I will suffer the loss of an arm. If I desire no arm, I will not suffer a loss.\n \n If I am injured physically or emotionally, and I desire that there was no injury, I will suffer pain.\n \n If a loved one dies, and I desire that they were alive, I will suffer the loss of a loved one.\n\n \n So what happens if ye desire suffering? Do ye get what ye want and therefore become satisfied, the satisfaction thereof negating the suffering? Or do you not suffer, therefore not getting what you wanted which then results in suffering which fulfils your desire?\n \n A humdrum conundrum.\n \n If this philosophy is true, Matthew should turn heterosexual any moment now...", 
   {}, 
   266128, 
   null, 
   1180980360.0
  ], 
  [
   266697, 
   null, 
   "Another opinion", 
   "Though I agree with the general trend of the thread here in that the philosophy of getting rid of all desires is a bit self-fulfilling. One needs to have some level of ambition to progress in various directions in one's life. However, I think that one can adapt that philosophy to say that desiring that which one cannot have (or cannot have without sacrificing other desired things) leads to suffering and can be avoided if one learns to tailor one's expectations based on what is realistically acheivable in one's situation.\n \n I always liked the saying (religious as it is):\n \"God grant me the serenity to accept the things I cannot change... courage to change the things I can and wisdom to know the difference...\"", 
   {
    "unicode_changes_made": true
   }, 
   266614, 
   null, 
   1180995600.0
  ], 
  [
   266887, 
   null, 
   "peteratwar", 
   "Suffering causes unhappiness. \n \n Desire is the cause of all suffering.\n \n Eliminate desire, and you will eliminate suffering,and thus unhappines.\n \n If I desire to eat, I will suffer hunger. If I have no desire to eat, I will have no hunger.\n \n If I desire to be warm, I will suffer cold.\n If I desire to be cool, I will suffer heat.\n \n If I desire wealth, I will suffer poverty.\n If I desire poverty, I will suffer wealth.\n \n If my arm is missing, and I desire a new arm, I will suffer the loss of an arm. If I desire no arm, I will not suffer a loss.\n \n If I am injured physically or emotionally, and I desire that there was no injury, I will suffer pain.\n \n If a loved one dies, and I desire that they were alive, I will suffer the loss of a loved one.\n\n \n Not many of the above actuall hold together.\n \n Desire is the cause of all suffering - not necessarily true\n \n \n The rest have too many 'if's", 
   {}, 
   266128, 
   null, 
   1181063760.0
  ], 
  [
   266895, 
   null, 
   "BeHereNow", 
   " peteratwar Desire is the cause of all suffering - not necessarily true\nAn example to demonstrate your case would be appropriate. Otherwise, my assertion stands.\n \n \n \nThe rest have too many 'if's\nHow many \"if's\" would be acceptable?", 
   {
    "unicode_changes_made": true
   }, 
   266887, 
   null, 
   1181066160.0
  ], 
  [
   266916, 
   null, 
   "Another opinion", 
   "Suffering causes unhappiness. \n \n Desire is the cause of all suffering.\n \n Eliminate desire, and you will eliminate suffering,and thus unhappines.\n \n If I desire to eat, I will suffer hunger. If I have no desire to eat, I will have no hunger.\n \n If I desire to be warm, I will suffer cold.\n If I desire to be cool, I will suffer heat.\n \n If I desire wealth, I will suffer poverty.\n If I desire poverty, I will suffer wealth.\n \n If my arm is missing, and I desire a new arm, I will suffer the loss of an arm. If I desire no arm, I will not suffer a loss.\n \n If I am injured physically or emotionally, and I desire that there was no injury, I will suffer pain.\n \n If a loved one dies, and I desire that they were alive, I will suffer the loss of a loved one.\n\n You seem to be making a case that one should avoid desire altogether. Yes, that might reduce emotional suffering but:\n 1) It ignores all the positive emotions and joy one can get from a fulfilled desire or from making progress in reaching a desired goal.\n 2) It limits what one can achieve in life. If one has no desires, then one has no ambitions or goals to achieve - life is just survival.\n \n Overall, I would say that it is unfulfilled desire or desire which cannot be fulfilled which causes suffering and which should be avoided. That is why it is important for us to set our goals realistically and accept those things which we cannot change.\n \n Also, there is a point which can be made that, if one does not know suffering, one cannot know real joy. I think some degree of suffering in life actually makes it richer.", 
   {}, 
   266128, 
   null, 
   1181070780.0
  ], 
  [
   266986, 
   null, 
   "BeHereNow", 
   "another opinion You seem to be making a case that one should avoid desire altogether. Yes, that might reduce emotional suffering but:\n 1) It ignores all the positive emotions and joy one can get from a fulfilled desire or from making progress in reaching a desired goal.\nAs they say, no free rides.\n I would say any belief system, limits the life of the believer, deprives them of some \"benefit\" offered by competing system.\n For every fulfilled desire and joy, there is an unfilled desire, and disappointment. Can it be any other way?\n Those who seek the way, find fulfillment in finding the way.\n Who is to say which is the greater fulfillment, that of (material) desire, or that of enlightenment. The answer of course is you.\n \n \n \nanother opinion 2) It limits what one can achieve in life. If one has no desires, then one has no ambitions or goals to achieve - life is just survival.\nWell, I would disagree. Life is just living would be the correct conclusion.\n For some of us, the joy of life is in just living.\n This does not mean I want to stop increasing my knowledge or understanding. I do not \"desire\" to be more knowledgeable. It is just that I find that in living my life the way I choose, my knowledge and understanding increases. \n \n \n \n[another opinion[/b] Overall, I would say that it is unfulfilled desire or desire which cannot be fulfilled which causes suffering and which should be avoided. That is why it is important for us to set our goals realistically and accept those things which we cannot change.\nYes. \n One might accept the teachings of The Buddha and have desires for a successful family and the materialism that is inevitable.\n If we have suffering in our lives, the fault is in ourselves. Even Jesus taught us this.\n The Buddha teaches us that it is desire which cause this suffering, and if we would rid ourselves of this suffering we need only remove the desire.\n \n \nanother opinion Also, there is a point which can be made that, if one does not know suffering, one cannot know real joy. I think some degree of suffering in life actually makes it richer.\nWell, ridding oneself of all desires and all suffering would be nearly like a Christian being sin free, it ain't goin' to happen. If comparison is needed, it will be available.\n Whether this is a reason to seek out suffering is another issue.\n If my neighbor has great desires, and suffers greatly, and also has great joys, it will not offend me.\n The man Siddhartha Gautama experience much suffering. As the enlightened Buddha he was able to cease all desires. The enlightenment he experienced, I believe, was equal to any and all \"real joy\" experiences you have or will experience. \n Why settle for a bite, when I can have the whole pie. \n \n ~ ~ ~ ~\n e Mutz\n \n I believe we met in a previous life, although it might not have been me after all.", 
   {
    "unicode_changes_made": true
   }, 
   266916, 
   null, 
   1181097720.0
  ], 
  [
   266988, 
   null, 
   "BeHereNow", 
   "another opinion Though I agree with the general trend of the thread here in that the philosophy of getting rid of all desires is a bit self-fulfilling. One needs to have some level of ambition to progress in various directions in one's life. However, I think that one can adapt that philosophy to say that desiring that which one cannot have (or cannot have without sacrificing other desired things) leads to suffering and can be avoided if one learns to tailor one's expectations based on what is realistically acheivable in one's situation.\n \n I always liked the saying (religious as it is):\n \"God grant me the serenity to accept the things I cannot change... courage to change the things I can and wisdom to know the difference...\"\nYes.\n This idea of ambition, does imply desires, thus is better to be avoided.\n If a person lives a simple life, has family and friend, food in his belly, a dry and warm place to sleep, what is lost?\n If they are content with this, and their life is not lacking, what is lost?\n There is of course the argument of \"Well if everyone did that, what kind of world would this be!\"\n What kind of place would this be if everyone choose to be an artist, and yet we do not discourage artists.\n And the same for any avocation or profession. \n If I live my life as if I expect to eat tomorrow, am I desirous of food, do I have an ambition to eat daily. Although this might be true, it is not necessarily true.\n This idea of cessation of desires to eliminate suffering is a teaching of The Buddha. Like any belief system a person adopts, it can be lived to varying degrees.", 
   {
    "unicode_changes_made": true
   }, 
   266986, 
   null, 
   1181098080.0
  ], 
  [
   267047, 
   null, 
   "peteratwar", 
   "An example to demonstrate your case would be appropriate. Otherwise, my assertion stands.\n \n \n How many \"if's\" would be acceptable?\n\n \n As you are making no qualifications to 'desire', then this is not too difficult.\n \n I might desire to win on the Lottery, do I suffer if I don't, answer No. Maybe I'm just being greedy in my desire.\n \n No if's allowed", 
   {
    "unicode_changes_made": true
   }, 
   266895, 
   null, 
   1181134440.0
  ], 
  [
   267051, 
   null, 
   "BeHereNow", 
   "What is the different between suffering and disappointment? \n If you desired to win the lottery and did, surely you would be disappointed.\n Suffering does not have to be sackcloth and ashes. \n \n Disappointment causes suffering. If you do not agree with that, you are using '\"suffering\" to mean something different than I am. Certainly you are entitled to do that. It just changes the meaning of your reply. You are not disagreeing with my comments as much as you are disagreeing with my use of the word \"suffering\".\n \n Explain what suffering means to you.", 
   {}, 
   267047, 
   null, 
   1181135520.0
  ], 
  [
   267072, 
   null, 
   "peteratwar", 
   "Pain, Torment, agony", 
   {}, 
   267051, 
   null, 
   1181142780.0
  ], 
  [
   267074, 
   null, 
   "BeHereNow", 
   "Okay then, I'll change my statement based on your acceptable usage of \"suffering\".\n \n Instead of \"desire causes suffering\", I will say \"Suffering is caused by desire\".\n \n You may now disagree based on our common usage of \"suffering\".", 
   {
    "unicode_changes_made": true
   }, 
   267072, 
   null, 
   1181143380.0
  ], 
  [
   267083, 
   null, 
   "peteratwar", 
   "'is' = 'may be'", 
   {}, 
   267074, 
   null, 
   1181147400.0
  ], 
  [
   267084, 
   null, 
   "BeHereNow", 
   "is = must be", 
   {}, 
   267083, 
   null, 
   1181147640.0
  ], 
  [
   267089, 
   null, 
   "Another opinion", 
   "As they say, no free rides.\n I would say any belief system, limits the life of the believer, deprives them of some \"benefit\" offered by competing system.\n For every fulfilled desire and joy, there is an unfilled desire, and disappointment. Can it be any other way?\n\n Yes, it can. If one limits ones desires to that which is reasonably achievable and that which is necessary (ex. one desires to eat because one will starve otherwise), then one can generally have a happy and fulfilled life.\n \nWell, I would disagree. Life is just living would be the correct conclusion.\n For some of us, the joy of life is in just living.\n This does not mean I want to stop increasing my knowledge or understanding. I do not \"desire\" to be more knowledgeable. It is just that I find that in living my life the way I choose, my knowledge and understanding increases. \n\n The knowledge and understanding that comes from simple, core living is very limited compared to what one can get from actively seeking out reading material on a subject of one's interest. Any time one makes an effort that is not absolutely necessary for survival, it generally is due to some desire. If you take care that your children are healthy and happy, it is because of a desire for them to be so. Complete lack of desire would mean that one would be indifferent to their suffering. I think, then, that one has to be more specific than to condemn all desire. Some desires are positive.\n \nYes. \n One might accept the teachings of The Buddha and have desires for a successful family and the materialism that is inevitable.\n If we have suffering in our lives, the fault is in ourselves. Even Jesus taught us this.\n The Buddha teaches us that it is desire which cause this suffering, and if we would rid ourselves of this suffering we need only remove the desire.\n\n Again, one needs to be more specific. It is unfulfilled or unfulfillable desires which cause us suffering. Fulfilled desires give us joy, as does success on the road to fulfillment of a desire. Also, there are necessary desires (such as desires for the health of one's children, or the desire to eat in order to survive) that help us and our species to survive. I would rephrase your assertion in saying that one must carefully screen what one desires so as not to set unrealistic expectations.\n \nYes.\n This idea of ambition, does imply desires, thus is better to be avoided.\n If a person lives a simple life, has family and friend, food in his belly, a dry and warm place to sleep, what is lost?\n If they are content with this, and their life is not lacking, what is lost?\n There is of course the argument of \"Well if everyone did that, what kind of world would this be!\"\n What kind of place would this be if everyone choose to be an artist, and yet we do not discourage artists.\n And the same for any avocation or profession. \n If I live my life as if I expect to eat tomorrow, am I desirous of food, do I have an ambition to eat daily. Although this might be true, it is not necessarily true.\n This idea of cessation of desires to eliminate suffering is a teaching of The Buddha. Like any belief system a person adopts, it can be lived to varying degrees.\n\n But your arguement seems to recommend the extreme - i.e. ceasing all desires. I simply do not view that extreme as the best case situation since it excludes those desires which do bring us happiness and since it excludes the necessary or good desires (such as desiring the best for one's children). \n \n I understand your arguements about the farmer or the artist but that is a separate issue. If one thinks that it is insufficient to be a farmer or an artist, then that is a case of ambition being imposed externally. If the farmer or artist have no desire to be otherwise, then I am happy for them. However, the farmer certainly must have desire for healthy crops, a healthy and happy family, etc. The artist has desires that he will be successfull in capturing his idea onto canvas, or that others will appreciate his work. Just because one lives a simple life does not mean that it is not filled with desires.\n \n Again, my bottom line is that I think that it is not ALL desires that one should try to eliminate. One should simply exercise wisdom in excluding those desires that lead to unhappiness - ex. unrealistic desires, or desires for something because it is expected of one (peer pressure), etc.", 
   {
    "unicode_changes_made": true
   }, 
   266986, 
   null, 
   1181149080.0
  ], 
  [
   267125, 
   null, 
   "Master_Shake", 
   "I have admittedly not read every post, but what I saw so far befuddled me.\n \n People are responding to this idea as if it's some newfangled weirdo concoction. This is, in a nutshell, one of the foundational ideas of Buddhism and as such goes back 2400 years. This is not new, nor is it absurd or unreasonable.", 
   {}, 
   267047, 
   null, 
   1181160540.0
  ], 
  [
   267127, 
   null, 
   "Master_Shake", 
   "Amother note: I think a lot of this is getting bogged down in the word \"desire.\" Maybe I can help with a little suggestion. Maybe it will make things clearer, maybe not.\n \n I have found, that in a discussion of the four noble truths that \"attachement\" is a better word than \"desire.\"", 
   {}, 
   267047, 
   null, 
   1181160840.0
  ], 
  [
   267128, 
   null, 
   "Master_Shake", 
   "The knowledge and understanding that comes from simple, core living is very limited compared to what one can get from actively seeking out reading material on a subject of one's interest.\n\n Who are you to say someone who lives a simple life has less understanding (understanding of what would be the question here I suppose) than someone else?\n And I don't think leading a simple life necessarily excludes reading.", 
   {}, 
   267089, 
   null, 
   1181161260.0
  ], 
  [
   267156, 
   null, 
   "Another opinion", 
   "Who are you to say someone who lives a simple life has less understanding (understanding of what would be the question here I suppose) than someone else?\n And I don't think leading a simple life necessarily excludes reading.\n\n You are misunderstanding what I am saying. BeHereNow was advocating for a simple life with no desires:\n \nThis does not mean I want to stop increasing my knowledge or understanding. I do not \"desire\" to be more knowledgeable. It is just that I find that in living my life the way I choose, my knowledge and understanding increases. \n\n The knowledge and understanding that comes from simple, core living is very limited compared to what one can get from actively seeking out reading material on a subject of one's interest. Any time one makes an effort that is not absolutely necessary for survival, it generally is due to some desire. If you take care that your children are healthy and happy, it is because of a desire for them to be so. Complete lack of desire would mean that one would be indifferent to their suffering. I think, then, that one has to be more specific than to condemn all desire. Some desires are positive.\n\n In this response to BeHereNow (the response which you protested against), I am simply stating that, if one wants to gain knowledge beyond simple, core living, one has to have a desire for gaining knowledge. Basically, if you make no extra effort to learn (out of desire), then you are very limited in what you can learn - you only learn that which life itself thrusts upon you. To pick up a book and learn from it, one needs the desire to do that since there is no survival necessity for you to pick up that book. \n \n My response says nothing about the level of education or financial reward of a profession a person follows - i.e. \"simple lives\" in the sense that I think you mean. You are simply misinterpreting and taking my statement out of context.", 
   {
    "unicode_changes_made": true
   }, 
   267128, 
   null, 
   1181169960.0
  ], 
  [
   267236, 
   null, 
   "Master_Shake", 
   "You are misunderstanding what I am saying. BeHereNow was advocating for a simple life with no desires:\n \n In this response to BeHereNow (the response which you protested against), I am simply stating that, if one wants to gain knowledge beyond simple, core living, one has to have a desire for gaining knowledge. Basically, if you make no extra effort to learn (out of desire), then you are very limited in what you can learn - you only learn that which life itself thrusts upon you. To pick up a book and learn from it, one needs the desire to do that since there is no survival necessity for you to pick up that book. \n \n My response says nothing about the level of education or financial reward of a profession a person follows - i.e. \"simple lives\" in the sense that I think you mean. You are simply misinterpreting and taking my statement out of context.\n\n I had not intention of taking anything out of context.\n This is exactly why I think we should be discussing \"attachment\" and not \n \"desire.\" \"Attachment is truer to the meaning of what is being discussed here. Truer to the precepts of Buddhism.", 
   {}, 
   267156, 
   null, 
   1181193960.0
  ], 
  [
   267255, 
   null, 
   "Inyx", 
   "Though I agree with the general trend of the thread here in that the philosophy of getting rid of all desires is a bit self-fulfilling. One needs to have some level of ambition to progress in various directions in one's life. However, I think that one can adapt that philosophy to say that desiring that which one cannot have (or cannot have without sacrificing other desired things) leads to suffering and can be avoided if one learns to tailor one's expectations based on what is realistically acheivable in one's situation.\n \n I always liked the saying (religious as it is):\n \"God grant me the serenity to accept the things I cannot change... courage to change the things I can and wisdom to know the difference...\"\n\n \n Just what I was thinking. If you leave out the religious part, since God has little or nothing to do with it.", 
   {
    "unicode_changes_made": true
   }, 
   266697, 
   null, 
   1181216820.0
  ], 
  [
   267279, 
   null, 
   "BeHereNow", 
   "Master Shake I had not intention of taking anything out of context.\n This is exactly why I think we should be discussing \"attachment\" and not \n \"desire.\" \"Attachment is truer to the meaning of what is being discussed here.\n\n \n If this were a discussion of Buddhism, I would agree. (but it isn't, not really)\n If our readers understood the concept of \"attachment\", I would agree. \n \n If you want to explain \"attachment\", have at it.\n It may clear things up, or it may muddle things even more.", 
   {
    "unicode_changes_made": true
   }, 
   267255, 
   null, 
   1181223120.0
  ], 
  [
   267354, 
   null, 
   "Another opinion", 
   "I had not intention of taking anything out of context.\n This is exactly why I think we should be discussing \"attachment\" and not \n \"desire.\" \"Attachment is truer to the meaning of what is being discussed here. Truer to the precepts of Buddhism.\n\n I agree that \"attachment\" would probably be more relevant from a Buddhist perspective. However, BeHereNow, despite his post appearing to be Buddhist oriented (his personal icon doesn't help), claims that he started this thread not specifically to talk about Buddhism. You may want to hash that out with him. For the time being, I will respect his choice of term, since he started the thread.", 
   {}, 
   267236, 
   null, 
   1181249820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Desire and Suffering", 
  "url": "http://www.4forums.com/political/philosophy-debates/9964-desire-suffering.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 9964, 
  "discussion_files": [
   [
    "23078.html", 
    "http://www.4forums.com/political/philosophy-debates/9964-desire-suffering-print.html"
   ], 
   [
    "23079.html", 
    "http://www.4forums.com/political/philosophy-debates/9964-desire-suffering-2-print.html"
   ]
  ], 
  "identifier": 9964
 }
]