[
 [
  [
   266293, 
   null, 
   "marc9000", 
   "With Ward Churchill back in the news recently, we are again reminded of a controversy that has been going on for several years now - more and more concern about university professors using classrooms as soapboxes for far left political agendas, and controlling other expressions of opinion on the campus, through speech codes and selective invitations of speakers and guests. A few years ago, the http://en.wikipedia.org/wiki/Academic_Bill_of_Rights was written. It has achieved some success - naturally not enough for some, and too much for others. I believe it's a good thing, and would be willing to argue the affirmative for the following resolution;\n \n The Academic Bill of Rights should be established in all taxpayer funded universities in the U.S. \n \n If anyone here is in agreement with those who oppose it (the American Association of University Professors, and others) and would like to take the negative position, I think it could be a good discussion.\n \n I'll suggest the following guidelines, and a potential opponent / moderator(s) can determine if adjustments need to be made - I'm sure we can come together on them. \n \n *The usual 5/4 post format, with me beginning and ending the debate. \n \n *96 hours maximum time between posts (busy time of the year for me)\n \n *1500 word limit per post, with ALL copy/pastes and link bars counting as words. \n \n *Final posts by each should be a recap of why they believe they won. \n \n Only one judge would be fine with me this time, and I can't accept anyone who has previously judged for me. \n \n Any takers? :)", 
   {
    "post_info": {
     "post_title": "Academic Bill of Rights"
    }
   }, 
   null, 
   null, 
   1180844280.0
  ], 
  [
   266306, 
   null, 
   "JPSartre12", 
   "Sounds like it could make a good topic for debate. I hope that you get a taker. emoticon_xgood", 
   {}, 
   266293, 
   null, 
   1180850820.0
  ], 
  [
   266812, 
   null, 
   "zachvac", 
   "Interesting debate, I can't do that because I completely agree with you. My only argument would be that we shouldn't need this which is pretty much just a cop-out. Good luck if you find someone to take the other side.", 
   {}, 
   266306, 
   null, 
   1181031660.0
  ], 
  [
   267081, 
   null, 
   "Another opinion", 
   "I also think this would be an interesting topic of discussion. However, my concern is that the Academic Bill of Rights is worded in such a way that the controversy would concentrate on its interpretation and potential misuse - which can be more based on opinion than on demonstratable logic and fact. \n \n I personally agree with the general statements of the bill but do have concerns about such misuse. For example, this bill could be used to try to force intelligent design (which is essentially bad science) into an Evolution classroom out of the necessity of presenting a wide range of views. This is just an example of differences in interpretation - differences again based more on opinion than fact or evidence. My main point is that the debate might get boggled down in such differences in interpretation - which are hard to prove one way or the other.", 
   {}, 
   266812, 
   null, 
   1181145660.0
  ], 
  [
   267218, 
   null, 
   "marc9000", 
   "I also think this would be an interesting topic of discussion. However, my concern is that the Academic Bill of Rights is worded in such a way that the controversy would concentrate on its interpretation and potential misuse - which can be more based on opinion than on demonstratable logic and fact. \n \n I personally agree with the general statements of the bill but do have concerns about such misuse. For example, this bill could be used to try to force intelligent design (which is essentially bad science) into an Evolution classroom out of the necessity of presenting a wide range of views. This is just an example of differences in interpretation - differences again based more on opinion than fact or evidence. My main point is that the debate might get boggled down in such differences in interpretation - which are hard to prove one way or the other.\n\n \n If you believe that it would cause more problems than we have NOW, you should take the negative. I wish you would - you would be a very worthy opponent. \n \n I haven't even come close to starting on an opening post, but I have much more in mind than just parrotting David Horowitz. I hope to generalize it and broaden it, yet condense it and make it easy to read in this limited format. \n \n I hope you'll take some time and study up on the AAUP's position, and consider representing them. May the best man not get bogged down! :)", 
   {}, 
   267081, 
   null, 
   1181189280.0
  ], 
  [
   267299, 
   null, 
   "Another opinion", 
   "If you believe that it would cause more problems than we have NOW, you should take the negative. I wish you would - you would be a very worthy opponent. \n \n I haven't even come close to starting on an opening post, but I have much more in mind than just parrotting David Horowitz. I hope to generalize it and broaden it, yet condense it and make it easy to read in this limited format. \n \n I hope you'll take some time and study up on the AAUP's position, and consider representing them. May the best man not get bogged down! :)\n\n I have mixed views on the subject - which would make it hard to take the opposing view since I am \"straddling the fence\" on this subject. I agree with the intention of the bill in trying to prevent professors from using their classrooms as a bully pullpit to preach one-sided political views without presenting the arguements of the opposing views. It is not the general trend or goal of the bill that I oppose and I would not support getting rid of such a bill all together. I think it would simply need to include some phrasing that would prevent its misuse - so that professors need not be paranoid of that misuse, thus curtailing their academic freedom. I would be willing to hold a casual discussion on this subject in a general thread, but I am not one-sided enough on this subject to hold a formal debate.", 
   {}, 
   267218, 
   null, 
   1181232120.0
  ], 
  [
   267364, 
   null, 
   "marc9000", 
   "I have mixed views on the subject - which would make it hard to take the opposing view since I am \"straddling the fence\" on this subject. I agree with the intention of the bill in trying to prevent professors from using their classrooms as a bully pullpit to preach one-sided political views without presenting the arguements of the opposing views. It is not the general trend or goal of the bill that I oppose and I would not support getting rid of such a bill all together. I think it would simply need to include some phrasing that would prevent its misuse - so that professors need not be paranoid of that misuse, thus curtailing their academic freedom. I would be willing to hold a casual discussion on this subject in a general thread, but I am not one-sided enough on this subject to hold a formal debate.\n\n \n That's fine, I understand. We'll keep waiting to see if anyone else wants to do it. Would you consider judging it? Sometimes judges are harder to find than opponents, and I'd certainly accept you as a judge.", 
   {}, 
   267299, 
   null, 
   1181255520.0
  ], 
  [
   267479, 
   null, 
   "Another opinion", 
   "That's fine, I understand. We'll keep waiting to see if anyone else wants to do it. Would you consider judging it? Sometimes judges are harder to find than opponents, and I'd certainly accept you as a judge.\n\n I would be willing to judge it - as long as the resolution is stated clearly enough. It might be hard for you to get someone to argue against all aspects of the bill since even its critics, according to your link to Wikipedia, support the general principles of academic freedom, equality, and pluralism that the bill tries to pursue. The resolution might end up having to revolve around the question of how effectively this bill pursues that goal, whether it can be misused, etc.", 
   {}, 
   267364, 
   null, 
   1181322480.0
  ], 
  [
   267563, 
   null, 
   "marc9000", 
   "I would be willing to judge it - as long as the resolution is stated clearly enough. It might be hard for you to get someone to argue against all aspects of the bill since even its critics, according to your link to Wikipedia, support the general principles of academic freedom, equality, and pluralism that the bill tries to pursue. The resolution might end up having to revolve around the question of how effectively this bill pursues that goal, whether it can be misused, etc.\n\n \n Its critics support the general principles, but don't seem to believe that any of the Bill is necessary. It was written 4+ years ago, and I don't think it's been changed at all since then. I believe it was carefully thought out and written in a neutral way, and to water it down, rendering it ineffective, would be worse than rejecting it. \n \n I think the debate should concern a full acceptance or a full rejection. That should make it easier on the person taking the negative IMO, if they could convince the reader of one major flaw, they would win. The debate would probably mainly concern only one or two of the Bills eight sections. \n \n We'll wait for an opponent and go from there. Thanks for considering judging. It's up to the moderators of course, but I'm sure the job will be yours if you and the opponent (and I emoticon_xangel )agree on everything.", 
   {}, 
   267479, 
   null, 
   1181352060.0
  ], 
  [
   270079, 
   null, 
   "Ohioprof", 
   "I am a college professor, and I strongly oppose the so-called \"Academic Bill of Rights,\" which I think would simply interfere with and undermine academic freedom. However, it sounds like people in this forum organize a formal debate on topics, and I do not have time to take part in a formal debate right now. I'm sorry about that. \n \n On the subject you are considering, I know of no fellow professors who support this bill. I am sure there are some, but they are not at my institution. Beyond being unnecessary, the bill would undermine the freedom of universities to determine academic policies and the freedom of faculty members to teach their subjects. The government should not be telling professors what they can and cannot teach or how they should run their classes. The process of hiring and tenure review is the appropriate process by which universities judge the competence and classroom performance of professors. We don't need this law, and it's just a way for extreme right wingers like David Horowitz to try to force their ideology into academic classrooms. \n \n Professors are trained in their disciplines through many years of graduate study. Professors are judged by peers through the process of academic review and tenure, and many institutions also have procedures for post-tenure review. Most professors teach their discipline effectively and professionally. That some faculty members present radical or very challenging viewpoints in the classroom is a strength of our current academic process, not a weakness. We need professors who push the boundaries of discourse and who challenge currently accepted beliefs. If professors cannot do this, then who can? Academia is where people are supposed to be free to challenge all kinds of orthodoxies and to present new and seemingly radical ideas. If a professor presents a viewpoint with which students disagree, then the students will learn from it. And they can and will take other courses where they are exposed to other viewpoints. One purpose of college is to expose students to a wide range of viewpoints, including viewpoints that challenge the beliefs of the students. \n \n There may be some students who think that their professors are punishing them for their viewpoints with bad grades. This may happen occasionally, but mostly it does not. Students may not understand why they are getting bad grades, or they may not want to understand why. It's often easier to claim that a professor is giving the student a bad grade because the professor disagrees with the student's opinion than it is to recognize that the student received a bad grade because of poor writing or because of the student's failure to present credible evidence. When it comes to grading, students understandably have strong emotions, and some who get poor grades will try to blame the professors for being biased rather than looking honestly at how hard they actually worked in the class and whether they demonstrated knowledge of the subject or the ability to present a clear argument supported by evidence. \n \n The professors that I know personally, and this is anecdotal, try very hard to be fair to all students and to use clear grading standards. Most bend over backwards not to judge students on their opinions, but rather to judge how well the students achieve the learning objectives for the class. Students may not always recognize this.\n \n In my own classes, I encourage students to present different viewpoints, and I organize formal debates on questions that emerge from the subject under study. I encourage students to argue positions in the debates with which they disagree, in order to learn the opponents' viewpoints and to see different positions on issues. I had a student a few years ago who was the leading conservative activist on our campus. I, in contrast, am no conservative. Despite our different views on most subjects, this student loved my classes, and I became his mentor. He wrote that I was his favorite professor. He went on to law school, and he is a successful lawyer today. The fact that we disagreed about issues made no difference, because the point of education is not to force conformity of thinking. It's to encourage thinking and the expression of all viewpoints and to teach the use of evidence and scholarship. I have always told my students that I do not care what they believe or what they think. I do care whether they research the positions they take in their papers and debates, whether they assemble and interpret and use evidence effectively, and whether they present their positions clearly and effectively through writing or speaking. \n \n For the most part, our colleges and universities already do an effective job of teaching students to think, research, reflect, gather evidence, and write. Students have academic freedom and rights already, largely because faculty have academic freedom. We should always seek to improve the education of our students, but we need to do this internally, through faculty development and through better means of assessment, which are currently being put in place in many institutions. We do not need, and we should reject, efforts to pass laws that undermine academic freedom in the name of enhancing it.", 
   {}, 
   267563, 
   null, 
   1182521940.0
  ], 
  [
   270160, 
   null, 
   "marc9000", 
   "I am a college professor, and I strongly oppose the so-called \"Academic Bill of Rights,\" which I think would simply interfere with and undermine academic freedom. However, it sounds like people in this forum organize a formal debate on topics, and I do not have time to take part in a formal debate right now. I'm sorry about that. \n\n \n The formal debates that are organized here are actually a very small percentage of the other \"free-for-all\" debates that you are obviously aware of, as you are currently participating in one in the gay rights section. I'm not condemning them, a lot of people like them and they can be interesting and informative, but surely you've noticed that the \"why homophobic\" thread that you are participating in has largely become you and.... 7 or 8 others against just one, Archangel. While it doesn't seem to be on the collegiate \"fallacy\" lists, (imagine that :p )several people with time on their hands hammering on only one persons time constraints could be considered a fallacy, don't you think? :) \n \n Most, but not all, of the formal debates here have come about as a grudge match from a free-for-all discussion, but rather than introduce this in the education forum here and suddenly have 8 or more posters opposing me, I decided to start this one in a clean, two person structured manner. I'm glad this caught the eye of you, a college professor. \n \n You've outlined the standard talking points of those who oppose the Academic Bill of Rights, and I can take issue with everything you've said. If you'd like to think it over, reword it and expand it to get near the 1500 word count, I'll take the negative position on it, and you would then have the beginning and ending posts (5 posts for you, 4 for me). Or if you'd like me to take the affirmative as I've proposed above, I'll still do that. Or if you have other ideas about word limits and/or other guidelines, please start negotiating. \n \n If you still maintain that you're too busy, I hope you'll find an associate that will register up here and take me on. I can assure you that I'm busy too, and would stay up all night a time or two to do this. If you find an associate who is willing to do it, we must note that dependable newbies who will actually fulfill their obligations have been rare in formal debates here. He/she would have to convince the moderator(s) of his or her ability to do that. You yourself have 100+ posts in 2+ months, you'd probably be readily accepted. \n \n Why don't you sacrifice some time and do it? \"Soapbox\" statements like yours above come easy. Can you back them up if they are challanged? emoticon_xkill \n \n :)", 
   {}, 
   270079, 
   null, 
   1182542520.0
  ], 
  [
   270192, 
   null, 
   "Ohioprof", 
   "Marc,\n \n The problem is that it's quick and easy to dash off a response in a informal posting setting. A formal debate would take preparation time, which I honestly don't have right now. I do hope you are able to find someone to engage in a formal debate on this topic, because it is a good topic.", 
   {}, 
   270160, 
   null, 
   1182546060.0
  ], 
  [
   270224, 
   null, 
   "Another opinion", 
   "Marc9000,\n \n I would hate to see this topic dropped altogether for lack of a formal opponent. Would you be open to a time limit for finding such an opponent - ex. a few weeks from now? If none is found by that point, then the topic could move to a general thread for open discussion. What do you think?", 
   {}, 
   270192, 
   null, 
   1182552660.0
  ], 
  [
   270240, 
   null, 
   "marc9000", 
   "Marc9000,\n \n I would hate to see this topic dropped altogether for lack of a formal opponent. Would you be open to a time limit for finding such an opponent - ex. a few weeks from now? If none is found by that point, then the topic could move to a general thread for open discussion. What do you think?\n\n \n I was a little surprised when I did a quick check of the education forum back in late May, and saw no evidence that this has ever been discussed here before. Of course I appreciate no one starting something about it there now while this is pending, and I'm glad to see yours and others interest in it. \n \n I'm guessing that this time of year (June & July) would be the most likely months when someone in academia would have the time to do it. I'm hoping Ohioprof may mention it to another professor or student that would be able to do it, or that some regular poster here that's been absent for a month or more will see it for the first time, and feel as strongly about it as Ohioprof does. \n \n If no one comes around by August 1st, I'd say it's safe to say it won't happen. Let's give it until then, okay? :)", 
   {}, 
   270224, 
   null, 
   1182561540.0
  ], 
  [
   270685, 
   null, 
   "Another opinion", 
   "I was a little surprised when I did a quick check of the education forum back in late May, and saw no evidence that this has ever been discussed here before. Of course I appreciate no one starting something about it there now while this is pending, and I'm glad to see yours and others interest in it. \n \n I'm guessing that this time of year (June & July) would be the most likely months when someone in academia would have the time to do it. I'm hoping Ohioprof may mention it to another professor or student that would be able to do it, or that some regular poster here that's been absent for a month or more will see it for the first time, and feel as strongly about it as Ohioprof does. \n \n If no one comes around by August 1st, I'd say it's safe to say it won't happen. Let's give it until then, okay? :)\n\n That sounds good to me. A formal debate would most likely be more comprehensive in its structure than an informal one and would be enjoyable to read. Hopefully, you will be able to find a formal opponent before that August 1st date.\n \n If it did come into a general thread, I would certainly enjoy participating as well and, I would presume that Ohioprof would also participate.", 
   {}, 
   270240, 
   null, 
   1182784260.0
  ], 
  [
   270855, 
   null, 
   "JPSartre12", 
   "I am a college professor, and I strongly oppose the so-called \"Academic Bill of Rights,\" which I think would simply interfere with and undermine academic freedom. However, it sounds like people in this forum organize a formal debate on topics, and I do not have time to take part in a formal debate right now. I'm sorry about that. \n \n On the subject you are considering, I know of no fellow professors who support this bill. I am sure there are some, but they are not at my institution. Beyond being unnecessary, the bill would undermine the freedom of universities to determine academic policies and the freedom of faculty members to teach their subjects. The government should not be telling professors what they can and cannot teach or how they should run their classes. The process of hiring and tenure review is the appropriate process by which universities judge the competence and classroom performance of professors. We don't need this law, and it's just a way for extreme right wingers like David Horowitz to try to force their ideology into academic classrooms. \n \n Professors are trained in their disciplines through many years of graduate study. Professors are judged by peers through the process of academic review and tenure, and many institutions also have procedures for post-tenure review. Most professors teach their discipline effectively and professionally. That some faculty members present radical or very challenging viewpoints in the classroom is a strength of our current academic process, not a weakness. We need professors who push the boundaries of discourse and who challenge currently accepted beliefs. If professors cannot do this, then who can? Academia is where people are supposed to be free to challenge all kinds of orthodoxies and to present new and seemingly radical ideas. If a professor presents a viewpoint with which students disagree, then the students will learn from it. And they can and will take other courses where they are exposed to other viewpoints. One purpose of college is to expose students to a wide range of viewpoints, including viewpoints that challenge the beliefs of the students. \n \n There may be some students who think that their professors are punishing them for their viewpoints with bad grades. This may happen occasionally, but mostly it does not. Students may not understand why they are getting bad grades, or they may not want to understand why. It's often easier to claim that a professor is giving the student a bad grade because the professor disagrees with the student's opinion than it is to recognize that the student received a bad grade because of poor writing or because of the student's failure to present credible evidence. When it comes to grading, students understandably have strong emotions, and some who get poor grades will try to blame the professors for being biased rather than looking honestly at how hard they actually worked in the class and whether they demonstrated knowledge of the subject or the ability to present a clear argument supported by evidence. \n \n The professors that I know personally, and this is anecdotal, try very hard to be fair to all students and to use clear grading standards. Most bend over backwards not to judge students on their opinions, but rather to judge how well the students achieve the learning objectives for the class. Students may not always recognize this.\n \n In my own classes, I encourage students to present different viewpoints, and I organize formal debates on questions that emerge from the subject under study. I encourage students to argue positions in the debates with which they disagree, in order to learn the opponents' viewpoints and to see different positions on issues. I had a student a few years ago who was the leading conservative activist on our campus. I, in contrast, am no conservative. Despite our different views on most subjects, this student loved my classes, and I became his mentor. He wrote that I was his favorite professor. He went on to law school, and he is a successful lawyer today. The fact that we disagreed about issues made no difference, because the point of education is not to force conformity of thinking. It's to encourage thinking and the expression of all viewpoints and to teach the use of evidence and scholarship. I have always told my students that I do not care what they believe or what they think. I do care whether they research the positions they take in their papers and debates, whether they assemble and interpret and use evidence effectively, and whether they present their positions clearly and effectively through writing or speaking. \n \n For the most part, our colleges and universities already do an effective job of teaching students to think, research, reflect, gather evidence, and write. Students have academic freedom and rights already, largely because faculty have academic freedom. We should always seek to improve the education of our students, but we need to do this internally, through faculty development and through better means of assessment, which are currently being put in place in many institutions. We do not need, and we should reject, efforts to pass laws that undermine academic freedom in the name of enhancing it.\n\n \n \n So, the fact that there are professors like Ward Churchill out there spreading his anti-American hate speech and passing it off as American history doesn't bother you?", 
   {}, 
   270079, 
   null, 
   1182832560.0
  ], 
  [
   276007, 
   null, 
   "Waxy", 
   "Firstly, I have ZERO interest in entering any kind of formal debate with marc9000. On top of that, I barely have the time to respond informally in a continous manner to one post on the forum, let alone to engage in a formal debate of any kind.\n \n As an off the hip response -\n \n I side with Ohioprof on the issue. I support the right of proffessors to be able to teach what and how they like in their own classrooms. \n \n However, my support has little to do with the academic bill of rights itself, and rests almost entirely on my dislike of \"big brother\".\n \n I support less gov't involvement and smaller gov't, not legislating my beliefs through even more red tape, and beaurocrat laden rules and regulations. Why don't we just go to the courts and have some judges push it through? The ends justify the means right?\n \n Every profession on earth had it's bad apples and every person on earth has their personal opinions and biases, are we to legislate them out of existence too? Give me a break. I think we all know how realistic that notion is.\n \n Quite frankly I'm surprised that people like JPSartre are on board with this kind of thing. What happened to free market ideals and freedom of speech? Since when is it the responsibility of a university professor to expose students to any and all possible explanations or viewpoints? Is that even possible? What's the role of student in all of this? Do they have no responsibility?\n \n Ward Churchill can do and say whatever he wants in his classroom, I could care less. If I don't like it, I don't sign up for his classes. If no one signs up for his classes, he's out of a job. If you choose to take his class and can get something out of it, good for you. Hopefully at the same time you are learning to think critically and you're capable of examing what Churchill and others like him are presenting and form your own educated opinion, that's the essence of a university education, not being spoon fed like a grade schooler. \n \n Last I checked, there's more than one class being offered at universities, obtaining a degree requires far more than one class, and students are largely free to choose their own courses. Students are responsible for their own educations. \n \n Waxy", 
   {}, 
   270855, 
   null, 
   1186009260.0
  ], 
  [
   276074, 
   null, 
   "Another opinion", 
   "I was a little surprised when I did a quick check of the education forum back in late May, and saw no evidence that this has ever been discussed here before. Of course I appreciate no one starting something about it there now while this is pending, and I'm glad to see yours and others interest in it. \n \n I'm guessing that this time of year (June & July) would be the most likely months when someone in academia would have the time to do it. I'm hoping Ohioprof may mention it to another professor or student that would be able to do it, or that some regular poster here that's been absent for a month or more will see it for the first time, and feel as strongly about it as Ohioprof does. \n \n If no one comes around by August 1st, I'd say it's safe to say it won't happen. Let's give it until then, okay? :)\n\n It is August 2nd today. Unfortunately, it doesn't look like anyone is going to take up the challenge. Would you be ok then with starting a general thread on this subject or bringing it up as a sub-topic within the \"College Bias\" thread of the \"Education\" forum? It is up to you. Again, it would be a pity if this subject was not addressed in any sort of continued debate or discussion. \n \n If you do open it up to a general thread, then I would recommend PMing those who have expressed interest (such as Ohioprof) to tell them about the thread , in order to get a good discussion going.", 
   {}, 
   270240, 
   null, 
   1186071240.0
  ], 
  [
   276415, 
   null, 
   "marc9000", 
   "Firstly, I have ZERO interest in entering any kind of formal debate with marc9000. \n\n \n From the \"college bias\" thread, a few days ago;\n \n \nLMAO, I'm not an American citizen and I'd put my knowledge of the USA and American politics up against yours, any time, any place. \n\n \n emoticon_wow", 
   {}, 
   276007, 
   null, 
   1186276320.0
  ], 
  [
   276416, 
   null, 
   "marc9000", 
   "It is August 2nd today. Unfortunately, it doesn't look like anyone is going to take up the challenge. Would you be ok then with starting a general thread on this subject or bringing it up as a sub-topic within the \"College Bias\" thread of the \"Education\" forum? It is up to you. Again, it would be a pity if this subject was not addressed in any sort of continued debate or discussion. \n\n \n IMO the \"college bias\" thread was going okay, but so far wasn't getting near the Academic Bill of Rights, and wasn't showing signs of swerving in that direction. So I'll start a new thread on it, similar to the way I would have started off a formal debate, and in a few weeks when it all winds down maybe we'll have a look at how it could compare (as far as being interesting, informative, or \"good\", if you will) with what a word limited, structured debate would have been. I should have it up in an hour or two from this posts time stamp. \n \n \n \n \nIf you do open it up to a general thread, then I would recommend PMing those who have expressed interest (such as Ohioprof) to tell them about the thread , in order to get a good discussion going.\n\n \n I'm not sure a PM would get anyones attention any more than a thread in the education forum titled \"Academic Bill of Rights\". They have to log in to see PM's and they should notice that title if they log in. PM them if you want. :) I'm looking forward to your comments on my opening post.", 
   {}, 
   276074, 
   null, 
   1186277040.0
  ], 
  [
   277010, 
   null, 
   "JPSartre12", 
   "Firstly, I have ZERO interest in entering any kind of formal debate with marc9000. On top of that, I barely have the time to respond informally in a continous manner to one post on the forum, let alone to engage in a formal debate of any kind.\n \n As an off the hip response -\n \n I side with Ohioprof on the issue. I support the right of proffessors to be able to teach what and how they like in their own classrooms. \n \n However, my support has little to do with the academic bill of rights itself, and rests almost entirely on my dislike of \"big brother\".\n \n I support less gov't involvement and smaller gov't, not legislating my beliefs through even more red tape, and beaurocrat laden rules and regulations. Why don't we just go to the courts and have some judges push it through? The ends justify the means right?\n \n Every profession on earth had it's bad apples and every person on earth has their personal opinions and biases, are we to legislate them out of existence too? Give me a break. I think we all know how realistic that notion is.\n \n Quite frankly I'm surprised that people like JPSartre are on board with this kind of thing. What happened to free market ideals and freedom of speech? Since when is it the responsibility of a university professor to expose students to any and all possible explanations or viewpoints? Is that even possible? What's the role of student in all of this? Do they have no responsibility?\n \n Ward Churchill can do and say whatever he wants in his classroom, I could care less. If I don't like it, I don't sign up for his classes. If no one signs up for his classes, he's out of a job. If you choose to take his class and can get something out of it, good for you. Hopefully at the same time you are learning to think critically and you're capable of examing what Churchill and others like him are presenting and form your own educated opinion, that's the essence of a university education, not being spoon fed like a grade schooler. \n \n Last I checked, there's more than one class being offered at universities, obtaining a degree requires far more than one class, and students are largely free to choose their own courses. Students are responsible for their own educations. \n \n Waxy\n\n \n Ward Churchill was more than a leftist professor, he was a plaigerist. For that reason, he should have been fired and was. \n My biggest knock, in general, is that there is no balance of ideas in colleges today. Conservatives are forced to be silent or booted out of academia.", 
   {}, 
   276007, 
   null, 
   1186549620.0
  ], 
  [
   277038, 
   null, 
   "Jo Bennett", 
   "Ward Churchill was more than a leftist professor, he was a plaigerist. For that reason, he should have been fired and was. \n My biggest knock, in general, is that there is no balance of ideas in colleges today. Conservatives are forced to be silent or booted out of academia.\n\n \n Oh please, have you looked in any economics, business or law departments recently?", 
   {}, 
   277010, 
   null, 
   1186573440.0
  ], 
  [
   277102, 
   null, 
   "JPSartre12", 
   "Oh please, have you looked in any economics, business or law departments recently?\n\n \n In the UK?emoticon_confused", 
   {}, 
   277038, 
   null, 
   1186598820.0
  ], 
  [
   277105, 
   null, 
   "Jo Bennett", 
   "Certainly in the UK, but I doubt US academic economics departments have been purged of Friedmannites or business schools of capitalists. I doubt many business school frankly discuss the merits of cooperative versus corporate organisations as ways of doing business.", 
   {}, 
   277102, 
   null, 
   1186599180.0
  ], 
  [
   277467, 
   null, 
   "JPSartre12", 
   "Certainly in the UK, but I doubt US academic economics departments have been purged of Friedmannites or business schools of capitalists. I doubt many business school frankly discuss the merits of cooperative versus corporate organisations as ways of doing business.\n\n \n I can't answer that. All of my college age kids are in sciences.;)", 
   {}, 
   277105, 
   null, 
   1186720620.0
  ], 
  [
   281013, 
   null, 
   "Waxy", 
   "Ward Churchill was more than a leftist professor, he was a plaigerist. For that reason, he should have been fired and was.\n\n \n No problems with that.\n \n \nMy biggest knock, in general, is that there is no balance of ideas in colleges today.\n \n \n Balances are a matter of choice, not only of majors, but of individual classes. Everything is available to the student should they so desire in my experience.\n \n \nConservatives are forced to be silent or booted out of academia.\n\n \n This is a real stretch. \n \n Quite frankly, my BS meter is buzzing off the charts.\n \n OC", 
   {}, 
   277010, 
   null, 
   1188256980.0
  ], 
  [
   281795, 
   null, 
   "JPSartre12", 
   "No problems with that.\n \n \n \n Balances are a matter of choice, not only of majors, but of individual classes. Everything is available to the student should they so desire in my experience.\n \n \n \n This is a real stretch. \n \n Quite frankly, my BS meter is buzzing off the charts.\n \n OC\n\n \n Read this:\n http://www.denverpost.com/ci_5834103?source=rss", 
   {}, 
   281013, 
   null, 
   1188670500.0
  ], 
  [
   281806, 
   null, 
   "Waxy", 
   "Read this:\n http://www.denverpost.com/ci_5834103?source=rss\n\n \n I did, and it only proves my point.\n \n I think you're seeing something that's not there if you believe that news story supports your assertions. In fact, I'd say it goes out of its way NOT to support your assertions, but to instead suggest avoiding to jumping to conclusions as you've done.\n \n Waxy", 
   {}, 
   281795, 
   null, 
   1188681540.0
  ], 
  [
   281978, 
   null, 
   "JPSartre12", 
   "I did, and it only proves my point.\n \n I think you're seeing something that's not there if you believe that news story supports your assertions. In fact, I'd say it goes out of its way NOT to support your assertions, but to instead suggest avoiding to jumping to conclusions as you've done.\n \n Waxy\n\n \n \n\n \n A couple of years back, the University of Colorado forged a nonbinding agreement with legislators, promising to protect and nurture ideological diversity on campus.\n \n In fact, it was only last month that CU president Hank Brown expressed his apprehension to regents about the lack of movement on this front.\n \n Well, if Brown is serious about this endeavor, he should make it a priority to investigate the firing of social conservative CU instructor Phil Mitchell - and not for the reasons you may suspect. \n \n\n \n The President admitted that there is a lack of movement in nurturing and protecting ideological diversity.\n \n Later in the article \"Sure, if CU featured more political flavors on the faculty, few would have any reason to wonder why administrators fired one of the few right-wing faculty members on campus.\"\n \n That tells me that the school is failing their commitment to \"protect and nurture ideological diversity on campus\" since there are \"few right-wing faculty members on campus\". What don't you understand about that? emoticon_confused", 
   {}, 
   281806, 
   null, 
   1188794700.0
  ], 
  [
   282021, 
   null, 
   "Waxy", 
   "What don't you understand about these quotes, taken from the same article?\n \n \nThen again, Mitchell could very easily hold social conservative values, be a wonderful person and deserve to be let go. \n\n \n \n\"We've never contested that Dr. Mitchell was a popular instructor and that he's (an) immensely likable gentleman. That's how most people around here would characterize him,\" CU spokesman Bronson Hilliard tells me. \"The issue is something else. He has not carried out his responsibilities in a consistent manner.\" \n \n The university claims that Mitchell did not meet fundamental standards on his recent faculty evaluations. And because Mitchell is not tenured, his at-will status means the university can say ciao without much of a fuss. \n\n \n \nThe question is: Do those incidents mean there is a conspiracy to remove him from CU? It may be convenient for conservatives to say yes. But we don't really know. \n\n \n and finally - \n \n \nSo conservatives should resist the lure of crusading (excuse the term) - even if their underlying point regarding the ideologically one-sidedness of university facilities remains true. \n\n \n Even when the author of the article lets his own bias shine brightly through, he warns against doing exactly what you've done.\n \n You don't know why Mitchell was fired. CU claims to have very valid reasons for doing so according to their guidelines for un-tenured faculty.\n \n Playing the \"conservative\" card without any knowledge or evidence of the specifics of the case puts you in the same camp as Sharpton and Jackson, who love to play their cards with no knowledge either, often in much the same \"we're being persecuted\" manner.\n \n The biggest issue of all for me, is that these are rare, isolated cases, if in fact they are valid cases at all, from what I've seen and heard. I'm sure that for every one of these you can dredge up, I can dredge one up to off set it.\n \n It's a far cry from \"Conservatives are forced to be silent or booted out of academia.\" \n \n Waxy", 
   {}, 
   281978, 
   null, 
   1188839640.0
  ], 
  [
   283801, 
   null, 
   "JPSartre12", 
   "......\n The biggest issue of all for me, is that these are rare, isolated cases, if in fact they are valid cases at all, from what I've seen and heard. I'm sure that for every one of these you can dredge up, I can dredge one up to off set it.\n \n It's a far cry from \"Conservatives are forced to be silent or booted out of academia.\" \n \n Waxy\n\n \n Professor Sues College for Partisan Firing\n \n By Katrina Irwin--WROC-TV--11/01/04 \n A former professor at Monroe Community College says he was fired because he showed his support for President Bush. Dr. Michael Filozof says he was fired from his job as a political science professor after he was harassed by a predominantly left-wing department. Monday morning he filed suit against MCC and now he wants a payback.\n \"It was an American flag. I didn't think it was too controversial, but apparently at MCC it was.\" \n Filozof says his colleagues at MCC attacked his political views. It came as quite a shock, considering many professors decorate their office doors with political messages. The difference between his and others, he says, is that he's conservative while the others are liberal. \n \"The faculty at many institutions are not balanced. They live in a bubble, they don't live in the real world, and they've got views out of the mainstream. If you bring mainstream views into academia, you get discriminated against.\" \n Filozof's contract wasn't renewed at the beginning of this year. Now he's filed a lawsuit claiming he was fired because of his political views.\n His attorney Nelson Thomas says it amounts to a violation of constitutional rights. \"Being a government-run institution, you have to respect your employees' First Amendment rights and that's what they didn't do here.\" \n An MCC spokesperson tells News 8 they are aware of the lawsuit but it's their policy not to comment on pending litigation.\n Filozof is suing for lost pay, and the pain and suffering he says he endured. In the meantime, he's been teaching part time at other schools in Western New York but says he took a severe pay cut. He also says that he never brought his views into the classroom.\n \"I never was accused by anyone, faculty or students, of being overly political, no.\" The lawsuit was filed Monday morning and MCC has 20 days to respond.\n http://www.studentsforacademicfreedom.org/archive/November2004/MCCproffiredFilozof110304.htm\n \n by Grant Swank \n Fired: Conservative on College Staff \n March 06, 2007 12:00 PM EST\n \n If you are a consistent, vocal conservative on a fundamentally liberal college staff, watch out. Eventually the liberals will pin you up against the wall, no matter what reason you have on your side. No matter what rights you have.\n Liberals claim to be open minded to all opinions. That's what makes them liberals. However, those who have existed alongside liberals know that they are the most closed-minded mortals breathing. Disagree with a liberal and you get the scowl, putdown glare and eventually fired, that is, if you happen to collect a salary check from them.\n Liberals are the most hypocritical of all lots in that the very definition of what they proclaim profiles them is the exact opposite of what they live out. The more the liberal, the more entrenched in closed-mindedness.\n Conservative Anson Rohr at Front Range Community College has been let go of his administrative assistant position due to \"insubordination.\" If all else fails, liberals can pull that one on a conservative. Insubordination.\n Per Valerie Richardson of The Washington Times, Rohr consistently let it be known regarding his conservative positions on politics, social issues and religion. Liberals on staff consistently let it be known regarding their positions on like issues. Both sides posted posters, bumper stickers and the like in order to make known their convictions to staff and students. In other words, it was part of being on a campus where ideas were exchanged, debated and held tightly.\n But if one happened to be a conservative, fair rules did not apply. How many others have gone through the same paddling machine on campuses or in churches or whatever? Their numbers are limitless.\n \"Anson Rohr is known as an outspoken critic of global terrorism. Ordinarily, that wouldn't be enough to get a person fired. \n \"But Mr. Rohr says that's what happened after he hung an anti-terrorism poster at his work space, urged a religion professor to present a balanced view of Islam and generally made no secret of his conservative views at Front Range Community College. \n \"After he was fired last year from his job as an administrative assistant, Mr. Rohr sued college officials for violating his free-speech rights. Last week, he agreed to accept an undisclosed financial settlement. \n \n \"In return, Mr. Rohr, 50, is prohibited from working again at the Westminster, Colo., college. Although he misses the flexible schedule and paycheck, he said, saying goodbye won't be a problem. \n \"'It was pretty awful to work there because of the radical-left bent,' said Mr. Rohr. 'I was the token conservative.'\"\n Many theological conservatives are going through the same fireball in theologically liberal denominations. What does one think a theological, biblically conservative clergyperson must endure trying to minister inside a liberal denomination such as the Episcopal Church US or the United Church of Christ? Practically impossible. \n The same for biblical parishioners trying to exist, let alone minister, within a liberal church. They are experiencing daily the liberals robbing them of their home church, their denomination. It's happening all over the world wherever the liberals aggressively pursue ridding their conclaves of every biblical believer.\n \"Mr. Rohr cited a bumper sticker with the slogan 'Bush Lied, People Died' on one administrator's office door. One hallway near Ms. Voss' office had graphic pictures of Vietnam War victims, Holocaust survivors and Civil War carnage, he said. \n \"Mr. Rohr had regularly received positive job reviews.\n \"However, he was placed on administrative leave and fired. In his letter of termination, administrators said he was guilty of insubordination.\n Mr. Rohr has called the whole incident \"'a big setup.'\" \n Last word: \"'I was happy with the results,' he said. 'As soon as I get my check, I'm going to e-mail them and say, \"Maybe next time, you'll think about the First Amendment first.\"'\" \n Visit www.washtimes.com/national/20070305-113012-8524r.htm", 
   {
    "unicode_changes_made": true
   }, 
   282021, 
   null, 
   1189794360.0
  ], 
  [
   283803, 
   null, 
   "Waxy", 
   "emoticon_zzzz emoticon_zzzz \n \n I am impressed at your dedication in dredging those up to keep the thread alive though...reaching all the way back to 2004 for your second example. :p :p\n \n Here's two in return, took all of about 1 minute...\n \n http://blogs.wsj.com/law/2007/09/12/the-oc-law-school-edition/\n \n http://atheism.about.com/b/a/084436.htm\n \n Waxy", 
   {}, 
   283801, 
   null, 
   1189795380.0
  ], 
  [
   283897, 
   null, 
   "JPSartre12", 
   "emoticon_zzzz emoticon_zzzz \n \n I am impressed at your dedication in dredging those up to keep the thread alive though...reaching all the way back to 2004 for your second example. :p :p\n \n Here's two in return, took all of about 1 minute...\n \n http://blogs.wsj.com/law/2007/09/12/the-oc-law-school-edition/\n \n http://atheism.about.com/b/a/084436.htm\n \n Waxy\n\n \n Both of those are examples of professors biting the hand that feeds them. They were attacking the beliefs of those that pay their salaries. I don't see the similarities between a public university professor being fired for his views and a professor funded by a religious organization going against their religion.", 
   {}, 
   283803, 
   null, 
   1189824660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Academic Bill of Rights", 
  "url": "http://www.4forums.com/political/debate-challenges/9966-academic-bill-rights.html", 
  "breadcrumbs": [
   "Debate Challenges"
  ], 
  "id_number": 9966, 
  "discussion_files": [
   [
    "23211.html", 
    "http://www.4forums.com/political/debate-challenges/9966-academic-bill-rights-print.html"
   ], 
   [
    "23212.html", 
    "http://www.4forums.com/political/debate-challenges/9966-academic-bill-rights-3-print.html"
   ], 
   [
    "23213.html", 
    "http://www.4forums.com/political/debate-challenges/9966-academic-bill-rights-2-print.html"
   ]
  ], 
  "identifier": 9966
 }
]