[
 [
  [
   266581, 
   null, 
   "Steeeeve", 
   "This story can bring up talking points for the pro-life group including the ones that think euthanasia is wrong. \n \n A Polish railway worker who woke up after 19 years in a coma is learning to live again and to understand a politically altered Poland, his wife said Sunday.\n \n http://www.foxnews.com/story/0,2933,277475,00.html\n \n Despite doctors' advice that he would not live, his wife never gave up hope and took care of him at home.\n \n \"He was a living corpse,\" she said on TVN24.\n \n \"Now he can sit in his wheelchair and we have breakfast and coffee together,\" she said.\n \n \"I would fly into a rage every time someone would say that people like him should be euthanized, so they don't suffer,\" she told local daily Gazeta Dzialdowska. \"I believed Janek would recover,\" she said, using an affectionate version of his name.\n \n \"This is my great reward for all the care, faith and love,\" she told the AP, weeping.\n \n A showing of true love for sure...not the perverted love of \"mercy killing\" which is an oxymoron.", 
   {
    "post_info": {
     "post_title": "'Living Corpse' Wakes After 19-Year Coma"
    }
   }, 
   null, 
   null, 
   1180975140.0
  ], 
  [
   326750, 
   null, 
   "Undeterred", 
   "I'm in favour of euthanasia because I would want the choice for myself. Surely we're intelligent enough to ensure that checks and balances are in place so that we can look after the wishes of cognisant people who want to die with peace and dignity.\n \n Why would anybody call euthanasing a coma patient a \"mercy killing\" anyway? Coma patients don't suffer.", 
   {}, 
   266581, 
   null, 
   1223437320.0
  ], 
  [
   326799, 
   null, 
   "thelmoose", 
   "This story can bring up talking points for the pro-life group including the ones that think euthanasia is wrong. \n \n A Polish railway worker who woke up after 19 years in a coma is learning to live again and to understand a politically altered Poland, his wife said Sunday.\n \n \n\n \n 1. No one is performing euthanasia in the US. Euthanasia is not the same thing as assisted suicide, or letting those with a fatal illness and little chance of survival die naturally. \n 2. \"Pro-life\" refers to the legal abortions, again unrelated to euthanasia.\n 3. This example is one in gillion. It would not have been newsworthy if it had been commonplace. It is foolish to consider the extremely rare exceptions when discussing public policy.", 
   {}, 
   266581, 
   null, 
   1223480580.0
  ], 
  [
   329169, 
   null, 
   "CUNxTime", 
   "I have to agree with UD. Everyone should be able to let their wishes be known and have those wishes followed!", 
   {}, 
   326799, 
   null, 
   1224610200.0
  ], 
  [
   330061, 
   null, 
   "Shooterandproud", 
   "This is the position I take in most of my debates, and it is the position I am choosing here. Let the individual decide. No one, including the government, knows whats best for a (mentally sane) individual better than him/herself.", 
   {}, 
   329169, 
   null, 
   1225164420.0
  ], 
  [
   330318, 
   null, 
   "Jim Colyer", 
   "This is an amazing story.", 
   {}, 
   330061, 
   null, 
   1225331100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  'Living Corpse' Wakes After 19-Year Coma", 
  "url": "http://www.4forums.com/political/health-debates/9970-living-corpse-wakes-after-19-year-coma.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 9970, 
  "discussion_files": [
   [
    "30703.html", 
    "http://www.4forums.com/political/health-debates/9970-living-corpse-wakes-after-19-year-coma-print.html"
   ]
  ], 
  "identifier": 9970
 }
]