[
 [
  [
   15924, 
   null, 
   "montalban", 
   "I ended another thread on this thought....\n \n \n Dawkins claims that the human eye is not the product of intelligent design. He cites as a reason that it is so poorly put together.\n \n The inference from this though is that if you can detect poor design - as proof that there is no 'creator', then we can also look for good design, as proof that there is!\n \n Thanks to Mr Dawkins raising the issue.", 
   {
    "post_info": {
     "post_title": "Looking for intelligence"
    }
   }, 
   null, 
   null, 
   1063883640.0
  ], 
  [
   15927, 
   null, 
   "TheoMorphic", 
   "Poor design is not his only supporting argument as to why the eye probably was not created. he is offering a rebuttal to Paley's argument that the eye must be designed because it is 1) too complex, and 2) too perfect.\n \n dawkins points out at how a complex eye can be produced by successive small mutations, and how the eye isn't all that perfect to begin with.\n \n so i guess in a childish sense i could say \"he (paley) started it\".", 
   {}, 
   15924, 
   null, 
   1063887180.0
  ], 
  [
   15931, 
   null, 
   "montalban", 
   "Poor design is not his only supporting argument as to why the eye probably was not created. he is offering a rebuttal to Paley's argument that the eye must be designed because it is 1) too complex, and 2) too perfect.\n \n dawkins points out at how a complex eye can be produced by successive small mutations, and how the eye isn't all that perfect to begin with.\n \n so i guess in a childish sense i could say \"he (paley) started it\".\n\n \n \n Ah, well here is another example of 'subjective' evidence. It is an opinion based on a criteria for 'adequate' function.\n \n But anyway...\n If you look for the thread \"AN EYR FOR MAKE BELIEVE\" which I wrote... it begins like this...\n An eye for make believe.\n Some people have declared that our eyes, if the part of a designer, are poorly designed. I don't see this. What I do see is an eye that allows us to enjoy beauty, art etc. Sure, we don't have X-ray vision, but our eyes are good enough. (I mention X-ray vision; what basis do people lay claim that our eyes aren't good enough; that we can't see through walls?)\n If we can now focus on possible evolutionary path-ways for the eye, we will see that evolutionaries have an eye for make believe.\n The classic case (http://www.pbs.org/wgbh/evolution/l...1/l_011_01.html) Darwin looked at several existing eye structures, and suggested that this progression of simplest to more complex types of eyes might be suggestive of a path taken in human eye evolution.\n Firstly, the core word is 'might'. Thus it is not the all conclusive proof Darwinists would suggest. Where is the evidence that random changes did occur as they say? What caused these changes? Why were they only positive changes? As Michael Behe points out there's enormous complexity in re-arranging the DNA just to get a depression...Behe, M, \"Darwin's Black Box\", p16ff. Where is the molecular explanation?\n The Darwinist say...\"Every change had to confer a survival advantage, no matter how slight.\" Why? What about dead-ends? What about negative mutations?\n What Darwin has shown is what we can call 'conceptual evolution'.The logic behind this is akin to showing a series of pictures: skateboard, bicycle, motor-bike, motor car, etc. We can see that they get more complex, but did the design for a car stem from that of a skateboard? We see the connection between these things (eyes, vehicles etc) because we organise it in our brains... but I'm not going to explain perceptual organisation. \n There are other explanations (http://www.biol.lu.se/funkmorf/vision/evolution.html) The Lund Vision Group shows computer modelling to suggest how a complex human eye could evolve (see under Computer Modelling)\n \"the structures of a focused camera type eye can evolve in less than half a million generations\" (Ibid.)\n Wow that's quick... so in all that time we're to assume that they went around with mutations that still hadn't quite produced a working eye. It's a shot in the dark, but it might work, providing that the intervening generations didn't need proper vision! \n In just six diagrams we get a model of the eye. This is again a case of conceptual evolution... seeing patterns that are meaningless unless you draw a connexion between them. Richard Dawkins is so impressed with this that he features the image on his web-page.\n The fraud is more clearly seen at http://www.don-lindsay-archive.org/...eye_stages.html\n If you look at the few diagrams here, starting with a light sensitive patch, moving to a more complex eye, we can see the deception of using a rubbery model. The thin line at the top of the light-sensitive spot does not change in each model, yet in the end is the lens! The light-sensitive spot wouldn't have a lens... so the one little line which remains the same in each picture represents in fact vastly different things.", 
   {}, 
   15927, 
   null, 
   1063890360.0
  ], 
  [
   15943, 
   null, 
   "SLP", 
   "I ended another thread on this thought....\n \n \n Dawkins claims that the human eye is not the product of intelligent design. He cites as a reason that it is so poorly put together.\n \n The inference from this though is that if you can detect poor design - as proof that there is no 'creator', then we can also look for good design, as proof that there is!\n \n Thanks to Mr Dawkins raising the issue.\n\n Yes, he threw the ID camp a bone.\n \n Tell us, Monty - what have the ID 'scientists' been doing to look for design?\n \n I mean besides reading other people's research and proclaiming \"See! Design!\"?", 
   {}, 
   15924, 
   null, 
   1063895040.0
  ], 
  [
   15956, 
   null, 
   "AMD4EVER", 
   "Being that this is the first look I've had at your 'eye' debate, I'll be shocked if someone hasn't already used the argument I'm about to put forth.\n \n Why are trying to prove that God exists or does not exist based on the design of our eye? First of all if you want proof that our bodies are poorly designed you can look at more things than just our eye. The same goes for the complexities of our bodies design although I would think that the downsides are much worse and more common.\n \n The appendix is a good one. Who ever thought of putting that in there? Our inability to take advantage of almost all the energy that we take into our bodies. Our primal mind sure is basic as if a carry over from previous evolution. I hate to even bring up that our brain doesn't work or store at full capacity since I know so little about the subject but if I'm wrong I'm sure I'll be corrected. (So much for public education)\n \n However one thing that works against evolution is this. It is just amazing that every creature on this planet didn't evolve to use the sun as a source of energy and food in some way or another. That is one negative I see to the side of evolution as any species who could use the sun for energy could survive almost anything just as plants have. Carbon dioxide producing animals could even feed themselves with their own breathe! Not to get off the subject too far but if we could find a way to splice this into our own genetics we could cure world hunger and make it much easier to colonize other planets.\n \n Anyways I don't hold it against God for creating us the way we are if indeed he did create us. However we were created I think it did a pretty poor job of it and it is time for us to begin redesigning ourselves.", 
   {}, 
   15943, 
   null, 
   1063902840.0
  ], 
  [
   15967, 
   null, 
   "TheoMorphic", 
   "\n Firstly, the core word is 'might'. Thus it is not the all conclusive proof Darwinists would suggest. Where is the evidence that random changes did occur as they say? What caused these changes? Why were they only positive changes? \n\n \n of course he says \"might\", science always tentative. any time you see something along the lines of \"it happened this way\" there is always an implied, but unseen \"probably\" between the \"it\" and the \"happened\".\n \n Look... you made a comment about how Dawkin's observation that the eye is flawed is actually support ID because it actually justifies a creationist's argument that it's ok to look for well designed aspects. I responded by putting your accusation in context (He was criticizing Paley, and he never actually used this as evidence, just showing that it could go both ways). \n \n Now you go off on a tangent about how dawkins' logic is flawed, and how behe's logic is accurate... i don't want to get into that because, both dawkins' and behe's make much better arguments themselves (anyone reading, go out and get these books... behe is much more technical and raises some questions that must be answered, however makes (imo) some unwarranted conclusions at the end of his book. Dawkins is much less technical, however provides logical reasoning as to why evolution is possible and how it works)\n \n but i do want to point out that while this is an example of 2 different interpretations (good/bad designs in the eye) given the same thing, it is NOT used as any kind of scientific proof of anything. opinions are not objective scientific evidence because they are subjective.", 
   {
    "unicode_changes_made": true
   }, 
   15931, 
   null, 
   1063915620.0
  ], 
  [
   15979, 
   null, 
   "Vindex Urvogel", 
   "I ended another thread on this thought....\n \n \n Dawkins claims that the human eye is not the product of intelligent design. He cites as a reason that it is so poorly put together.\n \n \n\n \n \n While the eye is a well enough example, it puzzles me that in an age in which genomes are being sequenced, we should rely so heavily on the eye in this way. Anyone looking at the human genome, or any other for that matter, will be most hard pressed to argue that this is an \"intelligently designed\" structure--it is replete with repetitve junk, nonsensical extraneous DNA, non-coding segments that have no relation to other genes on their shared chromosome, genetic parasites, and so on and so forth. And adrift in this sea of rubbish, are scattered a few clusters of sense, coding for amino acids and regulating the process. I think Paley, had he seen the genome, would have been berfet with grief for the death of his argument.\n \n Vindex Urvogel", 
   {}, 
   15924, 
   null, 
   1063925460.0
  ], 
  [
   15987, 
   null, 
   "lurch", 
   "Why are trying to prove that God exists or does not exist based on the design of our eye? First of all if you want proof that our bodies are poorly designed you can look at more things than just our eye. The same goes for the complexities of our bodies design although I would think that the downsides are much worse and more common.\n\n Except for possible exception of a couple evangelistic atheists, the design argument is from the creationist side. It is pretty old being first stated by William Paley. Darwin respected Paley and thought his arguments beautiful until he actually started looking at reality (Darwin also lived in that same rooms at Christ's College, Cambridge that Paley did). The argument from design is presented as \"proof\" of God or an \"intelligent\" designer for those who want to pretend that intelligent design creationism ins't creationism. But the argument on the other side is that it is flawed design and therefore isn't \"proof\". Evolutionary biologists don't assert that there is not god, only that there is no evidence from nature that there is one.\n \n Science is naturalistic. Even if some scientists (and others) are philosophical naturalists, science doesn't work that way. It is methodological naturalism simply because there are no tools by which science can examine or quantify the supernatural. It sounds silly when some claim that scientists are wrong when they fail to consider the supernatural in naturalism.\n \nThe appendix is a good one. Who ever thought of putting that in there?\n\n Well, if you were a herbavore it might be a good place to temporarily store plant matter to allow bacteria to break it down so that nutrients would be available to you. But of course you aren't and so it is neither good nor bad until infected. Well, actually it's good since it does seem to have a role in the immune system, a role that is shared with the rest of the small intestine. But the small intestine has a different, more obvious role too.\n \nOur inability to take advantage of almost all the energy that we take into our bodies.\n\n Well, that's generally true of any process that uses energy. Some is wasted.\n \nOur primal mind sure is basic as if a carry over from previous evolution.\n\n Check out the monkies and their sense of justice.\n \nI hate to even bring up that our brain doesn't work or store at full capacity since I know so little about the subject but if I'm wrong I'm sure I'll be corrected. (So much for public education)\n\n They used to tell us that in school a long time ago. Then they started doing EEGs and other types of brain scans and they found that everyone uses all of their brain. I'm not sure how I could use more of my brain.\n \nHowever one thing that works against evolution is this. It is just amazing that every creature on this planet didn't evolve to use the sun as a source of energy and food in some way or another.\n\n Almost all did. In fact, probably all that you are aware of did. Even the energy in the steak that you eat came from the sun ultimately. The thing is that evolution seems to have resulted in an organism to take advantage of almost every form of available energy. And what energy is left by \"higher\" animals is used by others - insects, microbes - until there is little usable energy left. That even goes so far that there are some organisms that get their energy from geothermal sources - no light involved.\n \nThat is one negative I see to the side of evolution as any species who could use the sun for energy could survive almost anything just as plants have.\n\n And so have animals. Plants have been wiped out in the great extinctions too.\n [quote]Carbon dioxide producing animals could even feed themselves with their own breathe![/quot]\n Huh? You produce carbon dioxide. How do you propose to feed yourself with that?\n \nNot to get off the subject too far but if we could find a way to splice this into our own genetics we could cure world hunger and make it much easier to colonize other planets.\n\n We don't live on carbon dioxide. We live from the energy stored in carbon compounds when we break them down.\n \nAnyways I don't hold it against God for creating us the way we are if indeed he did create us. However we were created I think it did a pretty poor job of it and it is time for us to begin redesigning ourselves.\n\n Well, evolution by natural selection makes things look as if they were designed for the environment in which they live. I don't presume to give God instructions on how he should go about His work. I only observe it.", 
   {}, 
   15979, 
   null, 
   1063928700.0
  ], 
  [
   15996, 
   null, 
   "AMD4EVER", 
   "Except for possible exception of a couple evangelistic atheists, the design argument is from the creationist side. It is pretty old being first stated by William Paley. Darwin respected Paley and thought his arguments beautiful until he actually started looking at reality (Darwin also lived in that same rooms at Christ's College, Cambridge that Paley did). The argument from design is presented as \"proof\" of God or an \"intelligent\" designer for those who want to pretend that intelligent design creationism ins't creationism. But the argument on the other side is that it is flawed design and therefore isn't \"proof\". Evolutionary biologists don't assert that there is not god, only that there is no evidence from nature that there is one.\n \n Science is naturalistic. Even if some scientists (and others) are philosophical naturalists, science doesn't work that way. It is methodological naturalism simply because there are no tools by which science can examine or quantify the supernatural. It sounds silly when some claim that scientists are wrong when they fail to consider the supernatural in naturalism.\n\n \n If we were to debate whether God made us perfect as he could have, then of course we can make the point that he obviously doesn't exist.\n \n \nWell, if you were a herbavore it might be a good place to temporarily store plant matter to allow bacteria to break it down so that nutrients would be available to you. But of course you aren't and so it is neither good nor bad until infected. Well, actually it's good since it does seem to have a role in the immune system, a role that is shared with the rest of the small intestine. But the small intestine has a different, more obvious role too.\n\n \n Still it is a good example for a flaw in our body that God wouldn't have put there for any good reason other than to cause pain and death in the unfortunate few.\n \n \nWell, that's generally true of any process that uses energy. Some is wasted.\n\n \n Some? 90% is more than some in my opinion. That is a horrible waste. Just think if we could retain 50% of the energy we consumed. We could start eating 1/5th of what we normally eat.\n \n \nCheck out the monkies and their sense of justice.\n\n \n Yeah I seen that article, pretty interesting :)\n \n \nThey used to tell us that in school a long time ago. Then they started doing EEGs and other types of brain scans and they found that everyone uses all of their brain. I'm not sure how I could use more of my brain.\n\n \n I kind of figured that was the case but I wasn't sure.\n \n \nAlmost all did. In fact, probably all that you are aware of did. Even the energy in the steak that you eat came from the sun ultimately. The thing is that evolution seems to have resulted in an organism to take advantage of almost every form of available energy. And what energy is left by \"higher\" animals is used by others - insects, microbes - until there is little usable energy left. That even goes so far that there are some organisms that get their energy from geothermal sources - no light involved.\n\n \n Yes I understand that eventually the energy from the sun makes it's way down the food chain into us, but wouldn't it just make sense for us to be able to harness that power directly? I'm just surprised that animal life never broke off and started using some of the same stuff plants use or that plants didn't break off and begin becoming more like animals. A mix like that would have been efficient and successful.\n \n \nHuh? You produce carbon dioxide. How do you propose to feed yourself with that? We don't live on carbon dioxide. We live from the energy stored in carbon compounds when we break them down.\n\n \n Assuming you carried the characteristics of an animal in that you produce carbon dioxide and the characteristics of a plant in that you consume carbon dioxide, you would essentially be able to feed off your own breathe.\n \n \nWell, evolution by natural selection makes things look as if they were designed for the environment in which they live. I don't presume to give God instructions on how he should go about His work. I only observe it.\n\n \n If anyone was going to use the argument that our bodies are flawed to prove that God doesn't exist, that would be a debate that could be won. No one would debate that our bodies were made all that well although it is amazing that life could have started at just a single cell and worked it's way up to where it is today. So either God did a poor job or evolution did an absolutely spectacular job. Just how did evolution know that light existed and that it could be seen before creating the eye? How do we know that there are not many other senses that exist which evolution will show us one day?", 
   {}, 
   15987, 
   null, 
   1063930020.0
  ], 
  [
   16009, 
   null, 
   "TheoMorphic", 
   "If anyone was going to use the argument that our bodies are flawed to prove that God doesn't exist, that would be a debate that could be won. No one would debate that our bodies were made all that well although it is amazing that life could have started at just a single cell and worked it's way up to where it is today. So either God did a poor job or evolution did an absolutely spectacular job. Just how did evolution know that light existed and that it could be seen before creating the eye? How do we know that there are not many other senses that exist which evolution will show us one day?\n\n \n you're looking at evolution in way too much of a magical and mystical way. Evolution doesn't \"know\" anything. It doesn't have any desires... and... i lack the eloquence to briefly state mechanical (and complete lack of desire) aspects of evolution. i suggest you do research as to how there are no conscious thinking elements in evolution.\n \n Science will never be able to disprove any god because of some flaw science happens to point out. The best individuals can do is, when people try to reason that such perfect organs imply a designer, point out that the design isn't all that perfect after all. \n \n If you want to try and debate flaws in design are evidence against a god... well go ahead... but then i'll just know if i'm ever looking for an easy debate victory i'll just try to find you. At the very best all you are doing is showing that the idea that God created all things perfectly probably isn't true... and even then someone can just point out that apparent flaws we see are simply the ineffable will of god.", 
   {}, 
   15996, 
   null, 
   1063934220.0
  ], 
  [
   16010, 
   null, 
   "TheoMorphic", 
   "How do we know that there are not many other senses that exist which evolution will show us one day?\n\n \n I believe there are a few fish that rely on electro magnetic fields to detect what is around them.", 
   {}, 
   15996, 
   null, 
   1063934340.0
  ], 
  [
   16033, 
   null, 
   "montalban", 
   "Yes, he threw the ID camp a bone.\n \n Tell us, Monty - what have the ID 'scientists' been doing to look for design?\n \n I mean besides reading other people's research and proclaiming \"See! Design!\"?\n\n \n I'm glad you asked... William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not. See p171ff of \"Doubts about Darwin: A History of Intelligent Design\" by Thomas Woodward.", 
   {}, 
   15943, 
   null, 
   1063942800.0
  ], 
  [
   16036, 
   null, 
   "montalban", 
   "While the eye is a well enough example, it puzzles me that in an age in which genomes are being sequenced, we should rely so heavily on the eye in this way. Anyone looking at the human genome, or any other for that matter, will be most hard pressed to argue that this is an \"intelligently designed\" structure--it is replete with repetitve junk, nonsensical extraneous DNA, non-coding segments that have no relation to other genes on their shared chromosome, genetic parasites, and so on and so forth. And adrift in this sea of rubbish, are scattered a few clusters of sense, coding for amino acids and regulating the process. I think Paley, had he seen the genome, would have been berfet with grief for the death of his argument.\n \n Vindex Urvogel\n\n \n Be wary of names. 'junk' DNA is not rubbish ... it's called 'junk' because we don't know entirely what it is used for... But just look at all the blank spaces on this post. They are nothing, but they are keeping the words in order.\n \n Evolutionaries are putting too much faith in names of words - such as human embryonic 'gill slits'\n or\n 'transitional' fossil", 
   {}, 
   15979, 
   null, 
   1063943040.0
  ], 
  [
   16039, 
   null, 
   "montalban", 
   "I believe there are a few fish that rely on electro magnetic fields to detect what is around them.\n\n \n I am no expert on 'paranormal sciences' but I don't believe that magnetism is put forward as a 'sixth sense' It would come under sight or sound, like bats sonar/radar.", 
   {}, 
   16010, 
   null, 
   1063943220.0
  ], 
  [
   16040, 
   null, 
   "AMD4EVER", 
   "you're looking at evolution in way too much of a magical and mystical way. Evolution doesn't \"know\" anything. It doesn't have any desires... and... i lack the eloquence to briefly state mechanical (and complete lack of desire) aspects of evolution. i suggest you do research as to how there are no conscious thinking elements in evolution.\n\n \n OK, I'll grant you that I did make it sound like evolution was a conscious being. But I thought you would understand that I meant that something triggered an evolutionary decision to grow eyes when there was seemingly no reason to do so. It isn't exactly conscious thought, but that is the closest thing I could relate it to.\n \n \nScience will never be able to disprove any god because of some flaw science happens to point out. The best individuals can do is, when people try to reason that such perfect organs imply a designer, point out that the design isn't all that perfect after all. \n\n \n Exactly. Trying to prove that God, if he exists, didn't make us as good as an all powerful being should have made us doesn't prove anything in the God debate. I could always debate that since God is all powerful and all knowing he could have always thought of something better to do. If he made those changes, then of course there would still be something better he could have thought of. This would be an endless loop of creating something better and better until finally he would have to stop and say that is good enough. But even then this debate that he didn't make us as good as he could have would be valid in my view.\n \n \nIf you want to try and debate flaws in design are evidence against a god... well go ahead... but then i'll just know if i'm ever looking for an easy debate victory i'll just try to find you. At the very best all you are doing is showing that the idea that God created all things perfectly probably isn't true... and even then someone can just point out that apparent flaws we see are simply the ineffable will of god.\n\n \n Nah I'm not debating this. I'm trying to show that this debate doesn't really prove anything. But I'm sure you can get the names of those who are willing to debate this and look them up in the future if you ever want an easy debate victory :)", 
   {}, 
   16009, 
   null, 
   1063943220.0
  ], 
  [
   16042, 
   null, 
   "AMD4EVER", 
   "I am no expert on 'paranormal sciences' but I don't believe that magnetism is put forward as a 'sixth sense' It would come under sight or sound, like bats sonar/radar.\n\n \n I think a sixth sense would be more like being able to see a 4th dimension or something like that. Telepathy would be a sixth sense. Predicting the future would be as well, but that may be the same as the 4th dimension idea. Hmmm, can't think of anymore obvious ones.", 
   {}, 
   16039, 
   null, 
   1063943400.0
  ], 
  [
   16043, 
   null, 
   "Vindex Urvogel", 
   "Be wary of names. 'junk' DNA is not rubbish ... it's called 'junk' because we don't know entirely what it is used for... But just look at all the blank spaces on this post. They are nothing, but they are keeping the words in order.\n \n Evolutionaries are putting too much faith in names of words - such as human embryonic 'gill slits'\n or\n 'transitional' fossil\n\n \n \n Junk DNA is called such because it is non-coding and is difficult to explain in any other context than the idea of selfish genes, as most eloquently outlined by Dawkins. And even a sensu stricto interpretation of what \"junk DNA\" means, it still leaves all manner of things which are most incongruous with an intelligently designed genome, such as: pseudogenes, retropseudogenes, satellites, minisatellits, microsatellits, transposons, retrotransposons, etc, for which you offered no explanation whatsoever (the same goes for discounting transitionals, for which nothing but distortions, dissimulations, and ad hominem have been offered). \n \n Vindex Urvogel", 
   {}, 
   16036, 
   null, 
   1063944120.0
  ], 
  [
   16084, 
   null, 
   "montalban", 
   "Junk DNA is called such because it is non-coding and is difficult to explain in any other context than the idea of selfish genes, as most eloquently outlined by Dawkins. And even a sensu stricto interpretation of what \"junk DNA\" means, it still leaves all manner of things which are most incongruous with an intelligently designed genome, such as: pseudogenes, retropseudogenes, satellites, minisatellits, microsatellits, transposons, retrotransposons, etc, for which you offered no explanation whatsoever (the same goes for discounting transitionals, for which nothing but distortions, dissimulations, and ad hominem have been offered). \n \n Vindex Urvogel\n\n \n I'm amazed you didn't use 'strawman agrument' as well...\n \n Never-the-less 'junk' DNA is very important.\n \n http://www.abc.net.au/catalyst/stories/s898887.htm", 
   {}, 
   16043, 
   null, 
   1063952820.0
  ], 
  [
   16089, 
   null, 
   "TheoMorphic", 
   "I am no expert on 'paranormal sciences' but I don't believe that magnetism is put forward as a 'sixth sense' It would come under sight or sound, like bats sonar/radar.\n\n \n http://www.bbc.co.uk/dna/h2g2/alabaster/A735004\n \n it's not \"paranormal science\"... i guess the use of \"sixth sense\" is usually attached to some psychic phenomenon, but fish being able to detect electric fields has been observed. \n \n I'm thinking another possible sense would be one that could detect magnetic fields... actually... ok now this is a total guess, but isn't it suggested that pigeons rely on the earth's magnetic field to navigate? \n \n so that could be seven senses.", 
   {}, 
   16039, 
   null, 
   1063954200.0
  ], 
  [
   16092, 
   null, 
   "montalban", 
   "so that could be seven senses.\n\n \n \n A sequel to that Bruce Willis film, now has a title!", 
   {}, 
   16089, 
   null, 
   1063954560.0
  ], 
  [
   16109, 
   null, 
   "lurch", 
   "Be wary of names. 'junk' DNA is not rubbish ... it's called 'junk' because we don't know entirely what it is used for...\n\n No. It is called junk because it is junk. If you think that all of that junk actually will be found to have a function some day, you'd probably be gullible enough to believe in Noah's ark.\n \nBut just look at all the blank spaces on this post. They are nothing, but they are keeping the words in order.\n\n Explain then the equivalent words in a chain of amino acids that form a protein. Which sequences of amino acids that are incorporated into a protein are meaningful words? In fact, the introns that space segements of a functional gene are not assumed to be non-functional. In fact, there is no evidence one way or the other but some function is presumed.\n \n But the repetitive sequences that go on and on, that are sometimes lengthened and sometimes shortened without apparent effect are junk. Telomeres aren't junk. Centromeres aren't junk. Introns may not be junk. Even some redundant pseudogenes my not be junk if they are transcribed (most aren't). But non-coding endogenous retroviral inserts are junk. Most junk DNA is junk.\n \n You see. You can tell that it is junk if you can throw it away without any effect.\n \nEvolutionaries are putting too much faith in names of words - such as human embryonic 'gill slits' or 'transitional' fossil\n\n Do you men like the word \"species.\" Pick a horse and ride it, please.\n \n And creationaries put too much faith in the mythology of ancient, bronze age nomadic herdsmen.\n \n I knew what gill slits were before you dirtied your first nappy. It is you who is placing faith in \"names of words\", whatever that means. It is ignorant in the extreme to think that gill slits in the embryo of a land vertebrate actually refer to gills. The same structures are sometimes called gill arches, gill pouches, pharyngeal pouches, pharyngeal arches or branchial arches. Wow! That's putting faith in names, isn't it. So many for the same structures that seem to be a matter of preference or first learning. (Kinda reminds you of the tens of thousands of christian faiths, doesn't it?) In fish, these actually develop into the gills. In other vertebrates they eventually form other structures (never actually becoming gills) like the eustachian tube, middle ear, tonsils, parathyroid, and thymus. It seems that you aren't aware that a name is just a lable for convenience.\n \n And you don't even know what a transitional fossil is. You have demonstrated that. You are the one who wants to put faith in a label. You require that every ancestor and every descendant be known. In reality, a transitional answers the prediction of forms that lie between two lineages. If between the thousands of species of dinosaurs that we know of and the thousands of species of birds there is a connection, then we should find many examples of fossils that represent several lines of diversification - one of these lines eventually became birds. Some lineages go extinct and others diversify to fill the nitch.\n \n But I'm still waiting for some evidence that supports your position. A statement of theory and the evidence that supports it. You can follow that with predictions that are a consequence of your theory and how they were tested.", 
   {}, 
   16040, 
   null, 
   1063956060.0
  ], 
  [
   16113, 
   null, 
   "montalban", 
   "No. It is called junk because it is junk. If you think that all of that junk actually will be found to have a function some day, you'd probably be gullible enough to believe in Noah's ark.\n \n Explain then the equivalent words in a chain of amino acids that form a protein. Which sequences of amino acids that are incorporated into a protein are meaningful words? In fact, the introns that space segements of a functional gene are not assumed to be non-functional. In fact, there is no evidence one way or the other but some function is presumed.\n \n But the repetitive sequences that go on and on, that are sometimes lengthened and sometimes shortened without apparent effect are junk. Telomeres aren't junk. Centromeres aren't junk. Introns may not be junk. Even some redundant pseudogenes my not be junk if they are transcribed (most aren't). But non-coding endogenous retroviral inserts are junk. Most junk DNA is junk.\n \n You see. You can tell that it is junk if you can throw it away without any effect.\n \n Do you men like the word \"species.\" Pick a horse and ride it, please.\n \n And creationaries put too much faith in the mythology of ancient, bronze age nomadic herdsmen.\n\n \n Jesus wasn't a herdsman. But in relation to junk, check out the web-site cited by moi.\n \n \nI knew what gill slits were before you dirtied your first nappy. It is ignorant in the extreme to think that gill slits in the embryo of a land vertebrate actually refer to gills. \n\n \n Er, no because of Haeckel, they were called gill slits because he wanted to show the similar nature of all verterbrate embryos.\n \n \nIt is you who is placing faith in \"names of words\", whatever that means. \n\n \n If you don't know what it means, how do you I'm doing it?\n \n \nAnd you don't even know what a transitional fossil is. You have demonstrated that. You are the one who wants to put faith in a label. You require that every ancestor and every descendant be known. In reality, a transitional answers the prediction of forms that lie between two lineages. If between the thousands of species of dinosaurs that we know of and the thousands of species of birds there is a connection, then we should find many examples of fossils that represent several lines of diversification - one of these lines eventually became birds. Some lineages go extinct and others diversify to fill the nitch.\n\n \n I do know what a transitioanl fossil is, it's something that is in transition. In other words its as hollow a statement as survival of the fittest.\n \n Look at the evidence that show that man evolved in China.\n Or that apes evolved from men...\n \n Transtional fossils feature in the works of both, so transitioanl fossils are so plastic in their nature that they can be slotted into any evoutionary theory.", 
   {}, 
   16109, 
   null, 
   1063956900.0
  ], 
  [
   16239, 
   null, 
   "Vindex Urvogel", 
   "\n \n Look at the evidence that show that man evolved in China.\n Or that apes evolved from men...\n \n Transtional fossils feature in the works of both, so transitioanl fossils are so plastic in their nature that they can be slotted into any evoutionary theory.\n\n \n I seem to recall a basic tenet of defining something, being that one should not use the term being defined, in the definition. It would be not unlike me defining cladistics as the practice which models cladistic relationships.\n \n Vindex Urvogel", 
   {}, 
   16113, 
   null, 
   1064022780.0
  ], 
  [
   16278, 
   null, 
   "montalban", 
   "I seem to recall a basic tenet of defining something, being that one should not use the term being defined, in the definition. It would be not unlike me defining cladistics as the practice which models cladistic relationships.\n \n Vindex Urvogel\n\n \n Whatever.\n \n Transitionals are so rubbery that they can fit into a theory of 'A' going to 'B' or of 'B' going to 'A'.\n \n Or 'A' going to 'B' but via 'C'.\n \n That's the best part about evolutionary evidence... it's available for everyone to use, even if all their theories conflict. As long as they are all still showing 'evolution' you guys don't seem to mind.\n \n \n \n \n Of course it looks rather ridiculous in the eyes of an outsider.", 
   {}, 
   16239, 
   null, 
   1064034480.0
  ], 
  [
   16289, 
   null, 
   "Vindex Urvogel", 
   "Whatever.\n \n Transitionals are so rubbery that they can fit into a theory of 'A' going to 'B' or of 'B' going to 'A'.\n \n Or 'A' going to 'B' but via 'C'.\n \n That's the best part about evolutionary evidence... it's available for everyone to use, even if all their theories conflict. As long as they are all still showing 'evolution' you guys don't seem to mind.\n \n \n \n \n Of course it looks rather ridiculous in the eyes of an outsider.\n\n \n \n Transitionals are \"rubbery?\" Curious, since paleontology and evolution as a whole makes explicit predictions and hypotheses as to what any given transitional should look like, from the outset. A transitional is a taxon which displays a character state intermediary between its nearest phylogenetic outgroup, and its sister clade, to put it in cladistic terms.\n \n Vindex Urvogel", 
   {}, 
   16278, 
   null, 
   1064036700.0
  ], 
  [
   16291, 
   null, 
   "montalban", 
   "But it's like looking at a junction in a street, you don't know which way the street 'runs' - it 'runs' in both directions... hence there is evidence that apes came from men, men came from apes\n \n man evolved through stages 'z', 'y', 'x'\n man evolved through stages 'z', 'x', 'y'\n or\n man evolved through stages 'x', 'y', 'z'\n \n But you want specifis...\n \n Ammonites...\n 1870 Hyatt says that a group of ammonites went aegoceras (oldest)-Androgynoceras-Liparoceras (youngest) \n 1938 L F Spath said they went in the exact opposite way \n 1963 Blockely said that they were all part of the same species and the differences were because of sexual dimorphism. \n \n They had the same evidence. You could just say that the most recent is right (or more correct) but it's just another guess\n \n The ascent of man...\n Unilinear School \n Polyphyletic School, \n Preneanderthal School** \n Presapiens School*** \n The evidence is there for all these theories, plus any new ones that have come about since the book was published. For all I know one, or all of these have been superseded by one or a number of other schools of thought... but at the time the textbook was written, with the same evidence before all, we have several different theories! So much for having evidence leading to theory huh?\n \n Same evidence, different interpretations. There is a strong rhetorical ploy at work here. It is difficult to argue against evolution because by claiming that evolution is true, but not being able to agree about which possibility is the evidence to back up that claim, the counter argument is 'well it might be possible'. Such semantics win out, yes something might be possible, and some things can never truly be ruled out. It is difficult to prove a negative. Evolution because a truth without proofs. What other system allows for so much conflicting evidence to be admissible? \n What could motivate different interpretations? How about fame or money? There's a book out called...\" Adventures in the Bone Trade: The Race to Discover Human Ancestors in Ethiopia's Afar Depression \n By: Jon E. Kalb \n In the last few hundred years, Africa has witnessed the slave trade, the ivory trade, the diamond trade, and the rubber trade, each representing a separate chapter of discovery and exploitation. In the 1920s, another type of \"trade\" burst onto the stage with the discovery of our oldest human ancestors, beginning with the Taung Child, Australopithecus africanus, found in South Africa in 1924. Then came the sensational discoveries in East Africa made by Louis and Mary Leakey in the 1950s and 1960s, and by their son in the late 1960s. Their discoveries produced unprecedented scientific \"wealth\" about our origins and instantly captured the public's attention. Although trafficking in humans and extracting minerals can hardly be equated with the pursuit of human origins, their respective quests have followed a similar trajectory: exploration, discovery, territorial competition, and personal gain. When the search for fossil hominids shifted to the Horn of Africa in the 1970sÑspecifically, the Afar Depression of EthiopiaÑthe stream of fossil and artifact discoveries that followed produced the longest and most complete single record of human fossil or artifact remains in the world. This book takes us behind the scenes of the explorations in this unique desert area, focusing especially on the 1970s, when the valley was first mapped and many fossils and archaeological sites were discovered, but continuing to the present. As co-founder of the expedition that discovered Lucy and leader of most of the first site-surveys in the Afar, Jon Kalb has years of experience with the region, its politics, and the scientists involved in the excavations. A participant himself in the \"bone wars\" that accompanied these discoveries, Kalb recounts the cut-throat competition and back stabbing that often were part of the media-highlighted race to find the oldest hominid fossil. He weaves this story in the rich fabric of Ethiopian society and politics, including the overthrow of Haile Sellassie (whose neighbor he was for a time), the brutal dictatorship that followed, the plight of the region's peoples, and the international maneuverings for control of the fossil finds. \" \n http://www.versiontech.com/origins/books/index.asp?movie_id=68&book_tab=1 \n Evidence does not point to a theory... except in the minds of theoreticians... as such it is but an artificial construct. \n *It says descent, Poirier, F E, \"In Search of Ourselves: An Introduction to Physical Anthropology\", p346ff \n **Preneanderthal Hypothesis: The theory, mainly applied to Europe, that proposes two separate lineages can be found in the Middle or Late Pleistocene. It posits that Neanderthals diverged from a line leading to modern Europeans just before they became specialized. \n http://www.modernhumanorigins.com/p.html \n ***Presapiens Hypothesis: The theory, mainly applied to Europe, that proposes two separate human lineages can be found in the Middle Pleistocene. One lineage (presapiens) evolved directly into modern H. sapiens populations and closely resembles these modern forms at an early date. The second lineage (preneanderthals) evolved into the European Neanderthal populations of the earlier Wurm glaciation and subsequently became extinct. \n (Ibid) \n \n archaeopteryx originally was on the direct line from dinosaurs to modern birds, now many say it is not...\n \n Maybe 'plastic' would be a better word than rubbery? Fit in the 'objective' evidence into any one of your theories.", 
   {}, 
   16289, 
   null, 
   1064037660.0
  ], 
  [
   16396, 
   null, 
   "Vindex Urvogel", 
   "But it's like looking at a junction in a street, you don't know which way the street 'runs' - it 'runs' in both directions... hence there is evidence that apes came from men, men came from apes\n \n man evolved through stages 'z', 'y', 'x'\n man evolved through stages 'z', 'x', 'y'\n or\n man evolved through stages 'x', 'y', 'z'\n \n But you want specifis...\n \n Ammonites...\n 1870 Hyatt says that a group of ammonites went aegoceras (oldest)-Androgynoceras-Liparoceras (youngest) \n 1938 L F Spath said they went in the exact opposite way \n 1963 Blockely said that they were all part of the same species and the differences were because of sexual dimorphism. \n \n They had the same evidence. You could just say that the most recent is right (or more correct) but it's just another guess\n \n The ascent of man...\n Unilinear School \n Polyphyletic School, \n Preneanderthal School** \n Presapiens School*** \n The evidence is there for all these theories, plus any new ones that have come about since the book was published. For all I know one, or all of these have been superseded by one or a number of other schools of thought... but at the time the textbook was written, with the same evidence before all, we have several different theories! So much for having evidence leading to theory huh?\n \n Same evidence, different interpretations. There is a strong rhetorical ploy at work here. It is difficult to argue against evolution because by claiming that evolution is true, but not being able to agree about which possibility is the evidence to back up that claim, the counter argument is 'well it might be possible'. Such semantics win out, yes something might be possible, and some things can never truly be ruled out. It is difficult to prove a negative. Evolution because a truth without proofs. What other system allows for so much conflicting evidence to be admissible? \n What could motivate different interpretations? How about fame or money? There's a book out called...\" Adventures in the Bone Trade: The Race to Discover Human Ancestors in Ethiopia's Afar Depression \n By: Jon E. Kalb \n In the last few hundred years, Africa has witnessed the slave trade, the ivory trade, the diamond trade, and the rubber trade, each representing a separate chapter of discovery and exploitation. In the 1920s, another type of \"trade\" burst onto the stage with the discovery of our oldest human ancestors, beginning with the Taung Child, Australopithecus africanus, found in South Africa in 1924. Then came the sensational discoveries in East Africa made by Louis and Mary Leakey in the 1950s and 1960s, and by their son in the late 1960s. Their discoveries produced unprecedented scientific \"wealth\" about our origins and instantly captured the public's attention. Although trafficking in humans and extracting minerals can hardly be equated with the pursuit of human origins, their respective quests have followed a similar trajectory: exploration, discovery, territorial competition, and personal gain. When the search for fossil hominids shifted to the Horn of Africa in the 1970sÑspecifically, the Afar Depression of EthiopiaÑthe stream of fossil and artifact discoveries that followed produced the longest and most complete single record of human fossil or artifact remains in the world. This book takes us behind the scenes of the explorations in this unique desert area, focusing especially on the 1970s, when the valley was first mapped and many fossils and archaeological sites were discovered, but continuing to the present. As co-founder of the expedition that discovered Lucy and leader of most of the first site-surveys in the Afar, Jon Kalb has years of experience with the region, its politics, and the scientists involved in the excavations. A participant himself in the \"bone wars\" that accompanied these discoveries, Kalb recounts the cut-throat competition and back stabbing that often were part of the media-highlighted race to find the oldest hominid fossil. He weaves this story in the rich fabric of Ethiopian society and politics, including the overthrow of Haile Sellassie (whose neighbor he was for a time), the brutal dictatorship that followed, the plight of the region's peoples, and the international maneuverings for control of the fossil finds. \" \n http://www.versiontech.com/origins/books/index.asp?movie_id=68&book_tab=1 \n Evidence does not point to a theory... except in the minds of theoreticians... as such it is but an artificial construct. \n *It says descent, Poirier, F E, \"In Search of Ourselves: An Introduction to Physical Anthropology\", p346ff \n **Preneanderthal Hypothesis: The theory, mainly applied to Europe, that proposes two separate lineages can be found in the Middle or Late Pleistocene. It posits that Neanderthals diverged from a line leading to modern Europeans just before they became specialized. \n http://www.modernhumanorigins.com/p.html \n ***Presapiens Hypothesis: The theory, mainly applied to Europe, that proposes two separate human lineages can be found in the Middle Pleistocene. One lineage (presapiens) evolved directly into modern H. sapiens populations and closely resembles these modern forms at an early date. The second lineage (preneanderthals) evolved into the European Neanderthal populations of the earlier Wurm glaciation and subsequently became extinct. \n (Ibid) \n \n archaeopteryx originally was on the direct line from dinosaurs to modern birds, now many say it is not...\n \n Maybe 'plastic' would be a better word than rubbery? Fit in the 'objective' evidence into any one of your theories.\n\n \n You cite problems of anatomy dependent vs. time dependent phylogeny, morphologic species limits, and the fact that the practitioners of phylogenetic systematics are human and make as many errors either genuine or biased, as any other person does. I find the claim that due to its lack of uniformity, evolution is thus invalid, most curious, since creationism is even more fraught with internal conflict and ideological dispute. You have your YECs, OECs, non-Christian creationists, non-theological anti-evolutionists riding the creationist bandwagon, etc, ad nauseum. And so your logic can work equally well against creationism, since due to a complete lack of uniformity, basic creationist dogma is entirely \"rubbery,\" \"plastic\" and filled with \"rhetorical ploys.\" After all, if it were so correct and valid there should be unilateral agreement amongst creationists--at least, according to the standard you apply to evolutionary biology. Clearly then creationism is most tenuous and subjective idea, barely kept together in the midst of internal strife. Creationist scenarios are equally valid, according to them, when rendered as: \n \n stages 'z', 'y', 'x'\n stages 'z', 'x', 'y'\n stages 'x', 'y', 'z'\n \n As a side note, I would point out that anagenetic progression from Archaeopteryx to modern birds was proposed only in the latter half of the 19th Century, and even one of its principal proponents, Huxley, later argued that Archaeopteryx was a side-branch of avian evolution. \n \n Vindex Urvogel", 
   {}, 
   16291, 
   null, 
   1064104080.0
  ], 
  [
   16399, 
   null, 
   "montalban", 
   "You cite problems of anatomy dependent vs. time dependent phylogeny, morphologic species limits, and the fact that the practitioners of phylogenetic systematics are human and make as many errors either genuine or biased, as any other person does. I find the claim that due to its lack of uniformity, evolution is thus invalid, most curious, since creationism is even more fraught with internal conflict and ideological dispute. You have your YECs, OECs, non-Christian creationists, non-theological anti-evolutionists riding the creationist bandwagon, etc, ad nauseum. And so your logic can work equally well against creationism, since due to a complete lack of uniformity, basic creationist dogma is entirely \"rubbery,\" \"plastic\" and filled with \"rhetorical ploys.\" After all, if it were so correct and valid there should be unilateral agreement amongst creationists--at least, according to the standard you apply to evolutionary biology. Clearly then creationism is most tenuous and subjective idea, barely kept together in the midst of internal strife. Creationist scenarios are equally valid, according to them, when rendered as: \n \n stages 'z', 'y', 'x'\n stages 'z', 'x', 'y'\n stages 'x', 'y', 'z'\n \n As a side note, I would point out that anagenetic progression from Archaeopteryx to modern birds was proposed only in the latter half of the 19th Century, and even one of its principal proponents, Huxley, later argued that Archaeopteryx was a side-branch of avian evolution. \n \n Vindex Urvogel\n\n \n I am quite happy to say that we are all basing our interpretations of evidence on a priori beliefs regarding the existence of God. You'd be the first of many evolutionaries to conceed this point. Creationist do it, so do evolutionaries.\n \n It shows that evolution is not about putting 'objective' evidence together.\n \n You're a brave person to make such a concession.", 
   {}, 
   16396, 
   null, 
   1064108040.0
  ], 
  [
   16716, 
   null, 
   "SLP", 
   "I'm glad you asked... William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not. See p171ff of \"Doubts about Darwin: A History of Intelligent Design\" by Thomas Woodward.\n\n \n Unfortunately, Dembski and his \"explanatory\" filter are more hot air than substance. He has claiming to have 'discovered' desing in nature by using the 'filter', but for some strange reason, he has yet to publish his amazing discovery. he said he was going to do it in \"Mere Creation\", then he said it would be iun \"No Free Lunch\" - so tell us , IS IT actually in his newest collection of apocryphal tall tales, or is is just assumed that he has done so?\n \n Common tactic - keep claiming that you will do something, then claim to have already done it later on, without, of course, actually doing it.\n \n The only times Dembski has acxtually applied it, he did it to things1. we know were the product of design and 2. never did it on anything biological.\n \n It is all fluff and hot air.", 
   {}, 
   16033, 
   null, 
   1064261220.0
  ], 
  [
   16737, 
   null, 
   "montalban", 
   "Unfortunately, Dembski and his \"explanatory\" filter are more hot air than substance. He has claiming to have 'discovered' desing in nature by using the 'filter', but for some strange reason, he has yet to publish his amazing discovery. he said he was going to do it in \"Mere Creation\", then he said it would be iun \"No Free Lunch\" - so tell us , IS IT actually in his newest collection of apocryphal tall tales, or is is just assumed that he has done so?\n \n Common tactic - keep claiming that you will do something, then claim to have already done it later on, without, of course, actually doing it.\n \n The only times Dembski has acxtually applied it, he did it to things1. we know were the product of design and 2. never did it on anything biological.\n \n It is all fluff and hot air.\n\n \n So how long did Darwin take to publish?", 
   {}, 
   16716, 
   null, 
   1064276700.0
  ], 
  [
   16870, 
   null, 
   "SLP", 
   "So how long did Darwin take to publish?\n\n \n A while. But that was because he was afraid of the repercussions.\n \n Demsbki, unlike Darwin, has been a vocal, politically active proponant of the efficacy of his supposed filter.\n \n So, I take it that he did not actually use the filter in this latest collection of creationist essays, lest you would have just said so.\n \n How does it feel to be lead along like so many lemmings?", 
   {}, 
   16737, 
   null, 
   1064325000.0
  ], 
  [
   16875, 
   null, 
   "montalban", 
   "A while. But that was because he was afraid of the repercussions.\n \n Dembski, unlike Darwin, has been a vocal, politically active proponent of the efficacy of his supposed filter.\n \n So, I take it that he did not actually use the filter in this latest collection of creationist essays, lest you would have just said so.\n\n \n Simply put, the proposition was made that because he hasn't 'published', he's wrong.\n \n By an extension of that logic, Darwin was also wrong, until he published.\n \n Another assumption you make is that Dembski isn't concerned over strife.\n \n \nHow does it feel to be lead along like so many lemmings?\n\n \n I don't know? Would you care to tell me?\n \n \n But even worse an assumption is that Dembski is hiding something, by keeping all this information to himself, or his clique. You asserted this, I believe.\n \n Simply, this is not the case...\n http://www.arn.org/docs/dembski/wd_explfilter.htm\n and\n http://www.windowview.org/ARNfiles/ExplanatoryFilterDembski.html\n and\n http://www-acs.ucsd.edu/~idea/dembski.htm\n \n \n OR\n \n If the information wasn't out there, then this negative critique could never have been drawn up...\n http://www.nctimes.net/~mark/bibl_science/dembski.htm\n and\n http://www.talkorigins.org/origins/postmonth/sept98.html\n and\n http://www.talkreason.org/articles/dem_nfl.cfm\n \n \n So, there is already a debate raging. I'm sorry you missed it.", 
   {}, 
   16870, 
   null, 
   1064327880.0
  ], 
  [
   16912, 
   null, 
   "SLP", 
   "A while. But that was because he was afraid of the repercussions.\n \n Dembski, unlike Darwin, has been a vocal, politically active proponent of the efficacy of his supposed filter.\n \n So, I take it that he did not actually use the filter in this latest collection of creationist essays, lest you would have just said so.\nSimply put, the proposition was made that because he hasn't 'published', he's wrong.\n\n \n Wrong again. Darwin, as best I can tell, did not write essay after essay, book after book, make press release after press release, claiming to have already 'solved' the problems. That is what Dembski has been doing. He has been trotting out his silly 'filter' as a way of 'proving' Intelligent Design in Nature (well, bacterial flagella, anyway) for several years, yet he has essentially refused to actually apply the filter to any biological structure.\n So no, the proposition is not that he has not published therefore he is wrong, the proposition is thathe and his followers keep claiming that he has definitely done something for which there is actually no documentation.\n \n \n \n\n \n By an extension of that logic, Darwin was also wrong, until he published.\n \n Another assumption you make is that Dembski isn't concerned over strife.\n\n \n On the contrary, Dembski seems to relish creating strife. Observe his asinine antics at Baylor - did he really think that he would garner support by insulting the President of the university? The guy who made the Polyani Center a reality?\n \n Have you read his many bombastic \"rebuttals\" to his critics? The ones that usually do not even address their criticisms, but instead launch into personal attacks and conspiratorial nonsense? No, Monty, Dembski invites strife. His career has been built on it.\nOriginally Posted by SLP\n How does it feel to be lead along like so many lemmings?\n\n \n \n \n \n I don't know? Would you care to tell me?\n\n \n I wouldn't knoiw, as I am not the one who seems to believe that reading 'witness' essays by a bunch of religious conservatives equates to \"proof\" that evolutiuon is false. I am not the one that actually seems to believe that Dembski has done something that he keeps aying he will do or has done, yet will not or cannot actually point out where this is documented.\n \n Again, please stop projecting.\n\n \n \n But even worse an assumption is that Dembski is hiding something, by keeping all this information to himself, or his clique. You asserted this, I believe.\n\n \n I asserted that Dembski has not actually applied his filter to biological structures/phenomena as he has been promising to do for years, not that he has done it and is keeping it secret. That would be plain stupid, for Demsbki's biggest criticisms often revolve around the fact that he and his allies have yet to produce anything of substance.\n\n \n Simply, this is not the case...\n http://www.arn.org/docs/dembski/wd_explfilter.htm\n and\n http://www.windowview.org/ARNfiles/ExplanatoryFilterDembski.html\n and\n http://www-acs.ucsd.edu/~idea/dembski.htm\n\n \n Amazingly, your links actually support MY claim, and I'll bet that you simply do not understand that.\n \n I know all about the Caputo case. That is Dembski's old standard 'example.' But human contrivances are not biological structures, are they? \n \n By the way - did YOU even read the links? Did you not realize that they were all basically different versions of the same essay? Repackaging XXXX just gives you different versions of the same XXXX.\n\n \n \n OR\n \n If the information wasn't out there, then this negative critique could never have been drawn up...\n http://www.nctimes.net/~mark/bibl_science/dembski.htm\n and\n http://www.talkorigins.org/origins/postmonth/sept98.html\n and\n http://www.talkreason.org/articles/dem_nfl.cfm\n \n \n So, there is already a debate raging. I'm sorry you missed it.\n\n \n I'm sorry that you failed to understand simple terms and phrases.\n \n Where in those articles has Dembski applied his filter to anything biological?\n \n From one of the links:\n \n \"To my knowledge, this is at least the sixth time Dembski published a description of the device which allegedly enables one to reliably distinguish among the three causal antecedent of an event &#8211; necessity (also referred to as regularity or law), chance and design.\"\n \n Funny - there is no mention of an actual specific instance in whihc this 'filter' has worked, much less been applied to, biological phenomena.\n \n So again, MY point is supported.\n \n You do seem to be a bit like Dembski, I will say.\n \n he too often feels the need to respond with something whenever a critic points out the failings of his claims. And you, like Dembski, usually miss the mark in your 'rebuttals'....", 
   {}, 
   16875, 
   null, 
   1064342400.0
  ], 
  [
   16962, 
   null, 
   "montalban", 
   "You're original assertion was Dembski hadn't published anything, you were implying that he was frightened of criticism because his model was wrong.\n \n Now you are changing tact by adding the qualifier that he's not published in a book, and you compare this with Dawrin because Darwin didn't release Media info? Huh? I doubt that they even had press agents in his day.\n \n The rest of your argument is a rant against Dembski. That is in fact another argument. You suggested he'd gone shy and was hiding.\n \n I wish you'd actually try and stick to a point.\n \n \n I have presented both pro and con arguments. This has amazed you.", 
   {}, 
   16912, 
   null, 
   1064360100.0
  ], 
  [
   17047, 
   null, 
   "wja", 
   "You're original assertion was Dembski hadn't published anything, you were implying that he was frightened of criticism because his model was wrong.\n\n \n SLP's actual assertion was:\n \nHe has claiming to have 'discovered' desing in nature by using the 'filter', but for some strange reason, he has yet to publish his amazing discovery.\n\n \n Now monty, can you address this issue or not? Anyone can make the assertion that they have discovered something. However if they are not prepared to back it up with evidence and subject it to peer review then one would have to be doubtful of their assertion. Dembski knows how to get a paper published in a peer-reviewed journal. Has he done so with his filter yet?\n \n \n\n Now you are changing tact by adding the qualifier that he's not published in a book, and you compare this with Dawrin because Darwin didn't release Media info? Huh? I doubt that they even had press agents in his day.\n\n Darwin and Wallace first published in the scientific media, later Darwin published The Origin of Species in the popular media. Dembski seems to be following a different path. Why?\n \n\n The rest of your argument is a rant against Dembski. That is in fact another argument. You suggested he'd gone shy and was hiding.\n \n I wish you'd actually try and stick to a point.\n\n \n \n \nI have presented both pro and con arguments. This has amazed you.\n\n You seem to be prevaricating now. Don't you remember boldly asserting; \n \"William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not. See p171ff of \"Doubts about Darwin: A History of Intelligent Design\" by Thomas Woodward.\"? You seem to have reverted to providing pros and cons after having your assertion challenged. And I note that you were originally specific about naturally occurring events. Do you now resile from your original assertion?", 
   {}, 
   16962, 
   null, 
   1064385180.0
  ], 
  [
   17076, 
   null, 
   "montalban", 
   "\n \n Originally Posted by montalban\n You're original assertion was Dembski hadn't published anything, you were implying that he was frightened of criticism because his model was wrong.\n \n WJA: SLP's actual assertion was:Quote:\n He has claiming to have 'discovered' design in nature by using the 'filter', but for some strange reason, he has yet to publish his amazing discovery.\n\n \n Exactly! He has yet to 'publish' was the assertion.\n \n But he has! Otherwise how would these pro-evolutionary sites be able to engage him in debate? Or are they just guessing what he believes?\n \n He has published on the Internet for starters.\n \n Sorry, WJA, but just repeating a stupid allegation doesn't make it any better.\n \n \n \nDarwin and Wallace first published in the scientific media, later Darwin published The Origin of Species in the popular media. Dembski seems to be following a different path. Why?\n\n \n Are you asking me or telling me? If you're asking me well, I don't know the guy. I know you want to makes something of 'no evidence' but that's up to you.\n \n [/QUOTE]You seem to be prevaricating now. Don't you remember boldly asserting; \n \"William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not. See p171ff of \"Doubts about Darwin: A History of Intelligent Design\" by Thomas Woodward.\"? You seem to have reverted to providing pros and cons after having your assertion challenged. And I note that you were originally specific about naturally occurring events. Do you now resile from your original assertion?[/QUOTE]\n \n First off, the book by Thomas Woodward is a 'published' item, not just something in the ether, so again, this seems to have escaped you attention. That book was 'published'.\n \n Secondly, that book and several of those sites talk about it.\n \n Why can't you see it if it's there in front of your eyes?\n \n But why stop this 'conspiracy' theory now.\n \n Anyway, you too probably debunk Dembski, based on his 'non-existent' theory too!\n \n \n \n As always, I look forward to your next oddity.\n \n \n \n I am attempting to cut back on debates, but your's is such a howler I had to write.", 
   {}, 
   17047, 
   null, 
   1064410620.0
  ], 
  [
   17089, 
   null, 
   "SLP", 
   "You're original assertion was Dembski hadn't published anything, you were implying that he was frightened of criticism because his model was wrong.\n\n \n I thought Christians were supposed to disdain bearing false witness?\n \n Actually, as Wja points out, that was NOT my original claim, and I thought that I explained that failry clearly. But that doesnot seem to matter to the creationist - after all, they have heros to protect and ideologies to prop up...\n \n No, Monty, AGAIN, I said that Dembski HAS published, and published plenty. Essays, books, etc., but despite that fact, he has yet to produce an actual instance in whihc he has applied his 'filter' - which he hawks ALL THE TIME - to an actual biological phenomenon, which he contrived the filter to do in the first place!\n\n \n Now you are changing tact by adding the qualifier that he's not published in a book, and you compare this with Dawrin because Darwin didn't release Media info? Huh? \n\n Are you really this dense or are you being purposefully argumentative?\n \n I wrote - did I not - that he has in fact published SEVERAL books. He has been claiming for years that his filter will find 'design', and in fact had 'promised' his critics he would demonstrate this in his book \"No Free Lunch\", yet there is no such thing in that book.\n \n \n\n \n I doubt that they even had press agents in his day.\n\n True, but I am sure that Wilberforce had plenty of derelicts and dullards cheering hin from the streets..\n\n \n The rest of your argument is a rant against Dembski. That is in fact another argument. You suggested he'd gone shy and was hiding.\n\n \n Again, are you really this dense? Did you even read my post?\n\n \n I wish you'd actually try and stick to a point.\n \n \n I have presented both pro and con arguments. This has amazed you.\n\n \n LOL!\n \n What amazes me is how utterly you have twisted and distorted what I wrote in a laughable attempt to placate your megalomania.", 
   {}, 
   16962, 
   null, 
   1064414820.0
  ], 
  [
   17092, 
   null, 
   "SLP", 
   "Exactly! He has yet to 'publish' was the assertion.\n \n\n \n WRONG.\n \n He has publishged his assertion over and over and over. He has yet to provide the actual evidence.\n \n \n Can you understand the difference?\n \n \n Billy X: The moon is made of green cheese, I have developed a way to test this and I can prove it!\n \n Skeptic: Ok, prove it.\n \n Billy X: Oh, uh.... OK, I um... Here - here is an essay on the subject. \n \n Skeptic: (reads the essay.. notices no proof) Say, um, there is no proof in here at all. I thought you said you could prove it?\n \n Billy X: Why, that is absurd! I have already provided the means to do it! Didn't you hear me say so before?\n \n Skeptic: Well, yes, but you have yet to provide the actual proof. The way you presented your means of testing it provides us no way to do it ourselves, and besides, YOU said that YOU would provide the proof.\n \n Billy X: That will be in my next book. I will show you all. All you critics!\n \n [three book later]\n \n Skeptic: Say, Bill? I thought you were going to provide the proof three books ago. Where is it?\n \n Billy X; I already proved it! Didn't you read that essay I wrote before I wrote the 3 books? the one descibing my methods? If I describe my methods, well, that is the proof!\n \n Skeptic: Well, no, not really, but - \n \n Billy X: Silence you critic! You are part of an evil conspiracy to keep the MoonCheese People from overturning your non-cheese m0oon paradigm!!\n \n \n \n \n Well, you see whats going on. Sadly, that is actually not too far from what has really been going on with Dembski and his 'filter' and his 'Desing' in Nature...\n\n \n But he has! Otherwise how would these pro-evolutionary sites be able to engage him in debate? Or are they just guessing what he believes?\n \n He has published on the Internet for starters.\n \n Sorry, WJA, but just repeating a stupid allegation doesn't make it any better.\n \n Nor does engagiung is stupid and dishonest tactics. The assertion - and it is true - was that Dembski has not published his 'proof' that the filter has detected 'design' in Nature. He has published voluminously on the supposed unimpeachability of his filter (which, interestingly, no mathematicians seem to feel the need to use), yet he has yet to publish his demonstration of what it supposedly can do as far as finding 'design' in Nature.\n\n \n \nYou seem to be prevaricating now. Don't you remember boldly asserting; \n \"William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not. See p171ff of \"Doubts about Darwin: A History of Intelligent Design\" by Thomas Woodward.\"? You seem to have reverted to providing pros and cons after having your assertion challenged. And I note that you were originally specific about naturally occurring events. Do you now resile from your original assertion?\n\n \n First off, the book by Thomas Woodward is a 'published' item, not just something in the ether, so again, this seems to have escaped you attention. That book was 'published'.\n \n\n \n Did it contain Dembski's application of his filter to a biological phenomenon and demonstrate that it must have been designed? Or did it contain more mention of the filter's existence and offer up vague assertions about what it can and has done?\n\n \n I am attempting to cut back on debates, but your's is such a howler I had to write.\n\n \n And there it is - the 'excuse'!", 
   {}, 
   17076, 
   null, 
   1064415660.0
  ], 
  [
   17096, 
   null, 
   "montalban", 
   "WJA,*\n There's a claim that Dembski hasn't published.\n \n I have shown that he has.\n \n However you claim that he hasn't.\n \n But you don't believe in design anyway, so even the things he's published can't by your rationale prove design. SO, you could claim he hasn't published anything that proves his filter works.\n \n But he has published and he has applied it.\n Dembski has applied his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them. \n But in a detailed critique of Dembski's filter theory, published in the current issue of the magazine the Skeptical Inquirer, Dr. Taner Edis, a physicist at Truman State University in Kirksville, Mo., said that while Dembski's mathematics were impressive, his analysis was probably detecting only the complexity that evolution itself would normally produce.\"\n http://www.sfgate.com/cgi-bin/article.cgi?file=/chronicle/archive/2001/04/08/MN146337.DTL\n \n It is one thing to say he hasn't published. And another to say you disagree with his findings.\n \n The suggestion was made that he hadn't published. Further, that because he hadn't he's running away.\n \n \n *I address this to you because another poster has made it know that I've upset him by actually replying. I've upset a great many people on this forum.", 
   {}, 
   17092, 
   null, 
   1064416740.0
  ], 
  [
   17101, 
   null, 
   "SLP", 
   "WJA,*\n There's a claim that Dembski hasn't published.\n \n I have shown that he has.\n \n However you claim that he hasn't.\n \n But you don't believe in design anyway, so even the things he's published can't by your rationale prove design. SO, you could claim he hasn't published anything that proves his filter works.\n \n But he has published and he has applied it.\n Dembski has applied his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them. \n But in a detailed critique of Dembski's filter theory, published in the current issue of the magazine the Skeptical Inquirer, Dr. Taner Edis, a physicist at Truman State University in Kirksville, Mo., said that while Dembski's mathematics were impressive, his analysis was probably detecting only the complexity that evolution itself would normally produce.\"\n http://www.sfgate.com/cgi-bin/article.cgi?file=/chronicle/archive/2001/04/08/MN146337.DTL\n \n It is one thing to say he hasn't published. And another to say you disagree with his findings.\n \n The suggestion was made that he hadn't published. Further, that because he hadn't he's running away.\n \n \n *I address this to you because another poster has made it know that I've upset him by actually replying. I've upset a great many people on this forum.\n\n \n \n Try reading Edis' actual paper:\n \n http://www.csicop.org/si/2001-03/intelligent-design.html\n \n \n There is no mention of Dembski doing this. Dembski had the opportunity to present his evidence when he addressed the society of skpetics in 2001, but for some reason, declined.\n \n So, why not produce the citation for where Dembski actually has done this. Again, newspaper articles are notoriously blurry when it comes to issues like this.", 
   {}, 
   17096, 
   null, 
   1064421840.0
  ], 
  [
   17195, 
   null, 
   "wja", 
   "It looks like this kitchen has also gotten too hot for monty. It seems a good indication that if monty has posted 80% of the latest messages on a board then he has departed for fresh pastures.", 
   {}, 
   17101, 
   null, 
   1064463360.0
  ], 
  [
   17208, 
   null, 
   "Robbie", 
   "What an unfun thread! Please lets stop taliking about what's his name.\n \n \nIf anyone was going to use the argument that our bodies are flawed to prove that God doesn't exist, that would be a debate that could be won. No one would debate that our bodies were made all that well although it is amazing that life could have started at just a single cell and worked it's way up to where it is today. So either God did a poor job or evolution did an absolutely spectacular job. Just how did evolution know that light existed and that it could be seen before creating the eye? How do we know that there are not many other senses that exist which evolution will show us one day?\n\n \n There is a theory that adresses this... It says that the six days of creation actually meant six ages. The seventh day began after Man and Woman had been created, and from then till now is still the seventh day - the day of rest. God made humans steward over nature, but we have failed. So nature begins to be ruined. Also, when Adam and Eve ate the apple, it had consequences. First of all, they would no longer be immortal. (accomplished by having teleomeres cut off at each cell divide) So the human race was no longer perfect, and continued to degenerate by random mutation and the effect of sin. I think this would explain the instances of imperfection, as well as explain why there were occasional bursts of new species in the past, while none appear now, and thousands dissapear. I think that the cases of imperfections seem pretty niggardly compared to what I consider the miracle of life. \n \n An interesting note is that the Bible says 'in the end times' knowledge will increase. Could be a good description of our times.", 
   {}, 
   17195, 
   null, 
   1064472000.0
  ], 
  [
   17218, 
   null, 
   "montalban", 
   "Once again we find people arguing past the main point. Dembski has claimed that he can test for intelligence. He has stated so, and he has given examples of where he tests. As I showed on my previous post, and also when I quoted \"Doubts about Darwin: A History of Inttligent Design\"\n \n One poster on this forum, rather than addressing the pros or cons of Dembski's argument, claims that he hasn't even stated his argument. Suprisingly, most evolutionaries seem to disagree, as they are arguing aginst his findings (which I've also cited)\n \n The same poster suggests you read \n http://www.csicop.org/si/2001-03/intelligent-design.html\n \n \"Intelligent Design and William Dembski\n Enter William Dembski. Already known as one of the better ID proponents, he has recently gathered his arguments in a book that claims to put ID on a solid footing (Dembski 1999). Surprisingly, he is often correct. Though dead wrong in his overall conclusions, he makes interesting mistakes, and his errors highlight how powerful an idea Darwinian evolution is, in biology and beyond. \"\n \n Obviously this site recognises that Dembski has a theory that has been published.\n \n The issue again remains for these people is that they don't recognise that he has.\n \n The problem for these people, is they mean to argue that he hasn't proven his case, not that he hasn't attempted to. They have suggested that he hasn't done the latter, and this is bunk.\n \n \"Dembski eventually developed what he called a mathematical \"explanatory filter\" that he asserted can distinguish randomness from complexity designed by an intelligent agent. He explained this idea in \"The Design Inference\" (Cambridge University Press, 1998). \n Dembski has applied his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them \n \"But in a detailed critique of Dembski's filter theory, published in the current issue of the magazine the Skeptical Inquirer, Dr. Taner Edis, a physicist at Truman State University in Kirksville, Mo., said that while Dembski's mathematics were impressive, his analysis was probably detecting only the complexity that evolution itself would normally produce.\"\n http://www.sfgate.com/cgi-bin/artic...08/MN146337.DTL\n \n This too suggests that he has put his theory to the test, applied his filter as it were. How do they critique his filter?\n \n So, we've got Dembski who's put his theory to the test, and we've got evolutionaries who show where this test does not work. This is totally different from arguing that he hasn't actually applied his filter.", 
   {}, 
   17208, 
   null, 
   1064482560.0
  ], 
  [
   17275, 
   null, 
   "SLP", 
   "Once again we find people arguing past the main point. Dembski has claimed that he can test for intelligence. He has stated so, and he has given examples of where he tests. As I showed on my previous post, and also when I quoted \"Doubts about Darwin: A History of Inttligent Design\"\n \n One poster on this forum, rather than addressing the pros or cons of Dembski's argument, claims that he hasn't even stated his argument. Suprisingly, most evolutionaries seem to disagree, as they are arguing aginst his findings (which I've also cited)\n \n The same poster suggests you read \n http://www.csicop.org/si/2001-03/intelligent-design.html\n \n \"Intelligent Design and William Dembski\n Enter William Dembski. Already known as one of the better ID proponents, he has recently gathered his arguments in a book that claims to put ID on a solid footing (Dembski 1999). Surprisingly, he is often correct. Though dead wrong in his overall conclusions, he makes interesting mistakes, and his errors highlight how powerful an idea Darwinian evolution is, in biology and beyond. \"\n \n Obviously this site recognises that Dembski has a theory that has been published.\n \n The issue again remains for these people is that they don't recognise that he has.\n \n The problem for these people, is they mean to argue that he hasn't proven his case, not that he hasn't attempted to. They have suggested that he hasn't done the latter, and this is bunk.\n \n \"Dembski eventually developed what he called a mathematical \"explanatory filter\" that he asserted can distinguish randomness from complexity designed by an intelligent agent. He explained this idea in \"The Design Inference\" (Cambridge University Press, 1998). \n Dembski has applied his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them \n \"But in a detailed critique of Dembski's filter theory, published in the current issue of the magazine the Skeptical Inquirer, Dr. Taner Edis, a physicist at Truman State University in Kirksville, Mo., said that while Dembski's mathematics were impressive, his analysis was probably detecting only the complexity that evolution itself would normally produce.\"\n http://www.sfgate.com/cgi-bin/artic...08/MN146337.DTL\n \n This too suggests that he has put his theory to the test, applied his filter as it were. How do they critique his filter?\n\n \n You still don't get it - again, are you doing this on purpose?\n \n Applying his 'filter' to rigged elections and coin tosses and such is not emonstrating \"design\" in nature. The criticisms revolve around his methodology - you did read the Edis article, right?\n \n or, try this one:\n http://www.users.bigpond.com/thewilkins/papers/dembski/index.html\n \n Or, you can read thisd hypocritical diatribe by Dembski in 2001:\n \n http://www-acs.ucsd.edu/~idea/dembskipr.htm\n \n It is about Edward Kennedy's remarks that ID is not science. Would that not have been a grand time to announce that his filter has detected \"design\" in nature? Of course! But Dembski does nothing of the sort.\n \n Or this one:\n \n http://www.leaderu.com/real/ri9602/dembski.html\n \n In this essay, updated in 2002, Demsbki explains how his filter works. He claims that it is relevant to biology. His example?\n Why, once again, the Caputo rigged election debacle.\n \n Why, oh why, Monty, if Dembski has in fact used his filter to discover 'design' IN NATURE, does he never actually provide THOSE examples? Even to 'friendly' audiences (that is, people that do not have the knowledge of wherewithal to know that his explanations are piffle)?\n\n \n So, we've got Dembski who's put his theory to the test, and we've got evolutionaries who show where this test does not work. This is totally different from arguing that he hasn't actually applied his filter.\n\n \n He has not applied his filter to biological structures. You continue to be unable to understand this.\n \n If he has done so, it should be EASY for you to prove me wrong.", 
   {}, 
   17218, 
   null, 
   1064510400.0
  ], 
  [
   17461, 
   null, 
   "montalban", 
   "There is a subtle difference here in arguments over Dembski.\n \n There seems to be one person repeating the same thing, but hinting at another. If SLP were to say that filter can't be applied, that is totally different from saying that he hasn't attempted to do so.\n \n SLP said...\n Post 33: I asserted that Dembski has not actually applied his filter to biological structures/phenomena as he has been promising to do for years...\n \n and again at the same post\n \n Post 33: That is what Dembski has been doing. He has been trotting out his silly 'filter' as a way of 'proving' Intelligent Design in Nature (well, bacterial flagella, anyway) for several years, yet he has essentially refused to actually apply the filter to any biological structure.\n \n repeated again...\n \n Post 37: he has yet to produce an actual instance in which he has applied his 'filter'\n \n and again\n \n Post 40: There is no mention of Dembski doing this. Dembski had the opportunity to present his evidence when he addressed the society of sceptics in 2001, but for some reason, declined.\n \n and again\n \n Post 44: Further: He has not applied his filter to biological structures. You continue to be unable to understand this.\n If he has done so, it should be EASY for you to prove me wrong.\n \n \n HOWEVER\n I said (Post 39)\n \"Dembski has applied his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them.\"\n http://www.sfgate.com/cgi-bin/artic...08/MN146337.DTL\n \n Quite clearly this refutes the assertion that Dembski has not attempted to apply his filter.\n \n Again I must stress the difference in the arguments. He has attempted to apply it (which disproves the allegation made by SLP). It is not the same as saying that the filter could not be applied, because the filter does not work! That poster will always argue that it can't be successfully applied. But to say that Dembski is in hiding, nor that he has applied the filter and that he's not published is ludicrous.\n \n Thus a critique of Dembski says \"So information theory can be applied to DNA, but it is powerless precisely where Dembski needs it most.\"\n http://home.wxs.nl/~gkorthof/kortho44.htm\n \n This is saying that his filter can't be applied successfully - that is, it doesn't work. Not that he hasn't been attempted to apply it; which was the criticism of that poster: recall \"he has essentially refused to actually apply the filter.\"\n \n However, in post 33 this same writer says \"Funny - there is no mention of an actual specific instance in which this 'filter' has worked, much less been applied to, biological phenomena.\"\n \n Well, if it hasn't been applied, then if couldn't be shown to work.\n \n It would be easy to prove this poster wrong, if he actually read the reference I gave.", 
   {}, 
   17275, 
   null, 
   1064592480.0
  ], 
  [
   17527, 
   null, 
   "SLP", 
   "This is truly incredible....\n \n \n \nThere seems to be one person repeating the same thing, but hinting at another. If SLP were to say that filter can't be applied, that is totally different from saying that he hasn't attempted to do so.\n\n \n If one actually understands the argument, there is no confusion. The 'filter' fails on a number of levels, I did not feel the need to elucidate them all. AGAIN - for the LAST TIME - Dembski has been claiming for YEARS that his filter can detect design in Nature. DETECT DESIGN in NATURE.\n NOT that it can theoretically deduce 'design' in DNA if one appends all sorts of contingent paramters.\n But anyway...\n\n SLP said...\n Post 33: I asserted that Dembski has not actually applied his filter to biological structures/phenomena as he has been promising to do for years...\n \n and again at the same post\n \n Post 33: That is what Dembski has been doing. He has been trotting out his silly 'filter' as a way of 'proving' Intelligent Design in Nature (well, bacterial flagella, anyway) for several years, yet he has essentially refused to actually apply the filter to any biological structure.\n \n repeated again...\n \n Post 37: he has yet to produce an actual instance in which he has applied his 'filter'\n \n and again\n \n Post 40: There is no mention of Dembski doing this. Dembski had the opportunity to present his evidence when he addressed the society of sceptics in 2001, but for some reason, declined.\n \n and again\n \n Post 44: Further: He has not applied his filter to biological structures. You continue to be unable to understand this.\n If he has done so, it should be EASY for you to prove me wrong.\n\n \n All quite correct. Whats your point? That old 'win by volume' schtick?\n\n \n \n HOWEVER\n I said (Post 39)\n \"Dembski has applied his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them.\"\n http://www.sfgate.com/cgi-bin/artic...08/MN146337.DTL\n \n Quite clearly this refutes the assertion that Dembski has not attempted to apply his filter.\n\n No, it doesn't, because you obvioulsy did not actually read that article, nor especially the article it referred to.\n\n But to say that Dembski is in hiding, nor that he has applied the filter and that he's not published is ludicrous.\n\n \n Yes, that would be ludicrous. Good thing I never wrote anything remotely like that, and to imply otherwise is indicative of some sort of antisocial disorder.\n\n \n Thus a critique of Dembski says \"So information theory can be applied to DNA, but it is powerless precisely where Dembski needs it most.\"\n http://home.wxs.nl/~gkorthof/kortho44.htm\n \n This is saying that his filter can't be applied successfully - that is, it doesn't work. Not that he hasn't been attempted to apply it; which was the criticism of that poster: recall \"he has essentially refused to actually apply the filter.\"\n\n \n Did you read THAT link?\n \n \"Dembski defines Complex Specified Information, CSI, as \"any specified information whose complexity exceeds 500 bits of information\" (p166). Chance cannot generate CSI. However he didn't translate that into a concrete DNA sequence length. I did not find it in his book [20]. If he consulted Yockey [11] he would have noticed that the cytochrome-c family of genes (113 amino acids, 339 bases long) has an information content of 233 - 373 bits. This is clearly lower than 500 bits. So although cytochrome-c undoubtedly contains information, it does not classify as CSI. \"\n \n \"According to Dembski's own criteria a specified pattern needs to be independent of the event. The event is the observed DNA sequence. So we cannot use the observed DNA sequence to construct the specification for that DNA sequence. The specification must be constructed without recourse to the event. A typical example of a specification is the Fibonacci algorithm that generates an endless row of numbers, but the algorithm itself is very short (see paragraph below). This kind of algorithm can definitely not generate the information in DNA! It seems that neither a mathematical nor a non-mathematical specification of DNA is possible.\"\n \n You will also notice that in Dembski's response to Korthof's critique, he does not even bother to mention these major problems, but instead focuses on Korthof's section on false positives. Gotta write SOMETHING to make it look like he's right!\n \n So sorry, Monty - if he cannot even get the parameters right, if he needs to use contrived and utterly ridiculous preconditions, then no, he has NOT applied his filter, certainly not in any meaningful way.\n \n Here is a challenge. Consider this sequence of DNA:\n \n GTAAGTACATTCTAATTGTGGAGATTCTTTCTT\n \n Now consider this one:\n \n GACAGAAGGTTAGTATTCTCGATCTTCAAACTT\n \n \n \n One of those is an actual DNA sequence from the human genome. The other I just made up.\n \n The filter should be able to tell.\n \n Could it? Of course not. Why? Because one needs to know a bit more information than would be available from just looking at the sequences. And that is the whole point! If you need to feed ina nd consider a bunch of extra information, the filter becomes little more than a biased propaganda tool. Korthof's devastating critique points out that Dembski cannot even provide a specification for any sequence of DNA - which is required by the 'filter' - so any results are specious. \n \n In the end, does it matter? He has yet to publish his application of the filter to a bacterial flagellum - considering his arbitrary assignments of bits and such, I can see why - and even if he had, in order to do so requires an utterly biased and arbitrary set of constraints that would renders the filter's output meaningless. And here you are, carrying on as if I had claimed that van Gogh had never really cut his ear off....\n You are just churning away, afraid to admit that you have been misled by yet another creationist hero.\n\n \n However, in post 33 this same writer says \"Funny - there is no mention of an actual specific instance in which this 'filter' has worked, much less been applied to, biological phenomena.\"\n \n Well, if it hasn't been applied, then if couldn't be shown to work.\n\n Indeed, especially since it does not work. Do you understand the difference between hypothetical and empirical?\n\n \n It would be easy to prove this poster wrong, if he actually read the reference I gave.\n\n \n I did, it seems that you did not.\n \n But let's say for the sake of argument that Dembski did apply his filter to DNA, using REALISTIC criteria. YOUR own links, in fact, demonstrate that the filter is inapplicable for a variety of reasons.\n One really has to wonder why you would spend - waste - so much energy trying to fight this losing battle.", 
   {}, 
   17461, 
   null, 
   1064617560.0
  ], 
  [
   17547, 
   null, 
   "montalban", 
   "SLP is wrong.\n \n Again this writer has no idea of the implication of his words...\n \n Indeed, especially since it does not work. Do you understand the difference between hypothetical and empirical?\n \n If it does not work, it must have been tested. SLP's claim was that he hadn't even attempted to apply the filter. Not that he could not apply it. That this writer claims that it does not work means that it is not 'empirical'. But this writers said that Dembski had never published an instance where he had tried to apply his filter.\n \n Again, that is a different thing entirely from saying that you don't agree that it works!\n \n SLP said \"I asserted that Dembski has not actually applied his filter to biological structures/phenomena as he has been promising to do for years...\"\n and\n \"Dembski had the opportunity to present his evidence \" NOT THAT THE FILTER DOES NOT WORK.\n \n The suggestion was quite clear. Dembski had come up with a hypothetical, but had never attempted to apply this to real life.\n \n \"Dembski HAS APPLIED his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them.\"\n \n It is quite clear, 'has applied' means that he has applied it, what could be simpler. Then SLP says that this isn't what it says at all. Quite clearly SLP is wrong. This is because SLP still thinks that not attempting to apply something and not being able to apply something are the same thing. He accused Dembski of the former, and uses the later as proof. He is wrong to do so and exhibits a basic flaw of logic. His smugness was that based on the belief that Dembski was in hiding and had never published.\n \n Quite clearly Dembski could seach for intelligence on SLP's post, and the filter would not work there either.\n \n Then he has the gall to say \"let's say for the sake of argument that Dembski did apply his filter to DNA, using REALISTIC criteria. YOUR own links, in fact, demonstrate that the filter is inapplicable for a variety of reasons.\"\n \n Obviously you'd only know it didn't work by attempting to apply it! Obviously Dembski has come up with a hypothetical. How would he and they know wether it works or not? They must attempt to apply it to real situations. My quote earlier says he has applied the filter to biochemical structures in cells.\n \n How this writer can keep saying that he hasn't applied it when all the evidence, even from his own side say otherwise. I must repeat his accusation was that Dembski had come up with a hypothetical and was in hiding, and that he never attempted to publish an instance where he had applied his hypothetical. Quite clearly that assumption is flawed.", 
   {}, 
   17527, 
   null, 
   1064624820.0
  ], 
  [
   17598, 
   null, 
   "wja", 
   "I must repeat his accusation was that Dembski had come up with a hypothetical and was in hiding, and that he never attempted to publish an instance where he had applied his hypothetical. Quite clearly that assumption is flawed.\n\n \n Let's not deal with assumptions, Monty, although I don't think that's the word you mean.\n \n Cite precisely where Dembski has published an application of his explanatory filter which has detected design in nature. Let's progress from you referring to a second hand report to the actual published paper.", 
   {}, 
   17547, 
   null, 
   1064667120.0
  ], 
  [
   17605, 
   null, 
   "montalban", 
   "Let's not deal with assumptions, Monty, although I don't think that's the word you mean.\n \n Cite precisely where Dembski has published an application of his explanatory filter which has detected design in nature. Let's progress from you referring to a second hand report to the actual published paper.\n\n \n Oh, WJA, what a neat little trick. The claim had been made by your side... that he hadn't published an attempt to apply his filter. And, that he was running scarred. Are you now asking me to show where he has successfully demonstrated his filter, or are you asking me if he's attempted to demonstrate his filter...? And now you want his publication in a particular form too! Another slight of hand.\n \n Despite this I countered that he has published.\n \n I said Dembski had come up with a filter\n \n The accusation was that he hadn't applied this to a biological system.\n \n Yet everyone seems to be able to critique this 'invisible' application.\n \n Now with typical aplomb WJA chimes in and you don't go down the path of SLP in actually making any claim. You want me to come up with the goods.\n \n This is the neat trick. You've diverted things away from SLP's ludicrous and biased claim.\n \n The claim was made by SLP without any proof.\n \n The onus is on SLP to provide such proof. I have shown otherwise even if it is 'second hand evidence'. The inference from all the critiques quite clearly suggest that they have seen it applied, and reject it as a failure.\n \n Nice try WJA. A small shift again of the argument.\n \n \n However, because I'm trying to educate you I suggest your read the following.\n \n \"In the actual encounter, Dembski began by overviewing his methods for design detection as developed in The Design Inference. He then  sketched how these methods apply to biology  and why he thought they provided in-principle objections to undirected natural causes, including Kauffman's self-organizational processes, generating the key item that his methods detect, namely, specified complexity or complex specified information. Dembski developed his argument as follows: the only way for self-organizational, Darwinian, and other naturalistic methods to generate specified complexity is by in essence dissolving the actual complexity (or improbability). What seems highly improbable is therefore no longer improbable once one knows the right naturalistic process. Dembski indicated that there were good reasons to think that no such reduction of complexity or improbability would be possible in the case of systems like the bacterial flagellum.  He also adverted to some of the techniques developed in his forthcoming book titled \"No Free Lunch\" for computing the probabilities of discrete combinatorial objects like the bacterial flagellum. \"\n http://www.arn.org/docs/pjweekly/pj_weekly_011119.htm\n \n This suggests that a book is about to appear mysteriously out of the ether...\n \n So, go read the book  \"No Free Lunch: Why Specified Complexity Cannot Be Purchased Without Intelligence\". Unless you think it's not 'published'.\n Oh, look it has been published! It's a miracle.\n \n \n As far back as post 29 the answer was provided for one and all by SLP who wrote:\n \"Unfortunately, Dembski and his \"explanatory\" filter are more hot air than substance. He has claiming to have 'discovered' desing (sic) in nature by using the 'filter', but for some strange reason, he has yet to publish his amazing discovery. he said he was going to do it in \"Mere Creation\", then he said it would be iun (sic)  No Free Lunch  - so tell us , IS IT actually in his newest collection of apocryphal tall tales, or is is (sic) just assumed that he has done so?\"\n \n The simple answer is 'yes he has'.\n \n This mystery book exists. It's even been criticised by people on your side \"In his book, No Free Lunch,  Dembski presents the bacterial flagellum as the premier example of a biological system that, because he judges it to be both complex and specified, must have been actualized by the form-conferring action of an unembodied intelligent agent. However, a critical examination of Dembski?s case reveals that, 1) is is built  on unorthodox and inconsistently applied definitions of both ?complex? and ?specified,? 2) it employs a concept of the flagellum?s assembly that is radically out of touch with contemporary genetics and developmental biology, and 3)  it fails to demonstrate  that the flagellum is either ?complex? or ?specified? in the manner required to make his case. If the bacterial flagellum is supposed to demonstrate ID, then ID is a failure.\"\n http://www.iscid.org/ubbcgi/ultimatebb.cgi?ubb=get_topic;f=1;t=000057;p=\n \n As I said, people on your side are out there criticising him all the time. How could they unless he had published?\n \n Also, it is one thing to say that he hasn't attempted to apply the filter, then to say that he has attempted to apply it and failed.\n \n ;) Game, set and match", 
   {}, 
   16737, 
   null, 
   1064673360.0
  ], 
  [
   17611, 
   null, 
   "wja", 
   "Monty, do you know the difference between publishing something in a book for popular consumption (such as No Free Lunch) and in a peer reviewed scientific journal? \n \n It appears that publishing in a peer reviewed scientific journal is what SLP means when he refers to \"publishing\". You seem to think that Dembski publishing a book for popular consumption is \"publishing\". \n \n Has Dembski published his explanatory filter and an application of it to a biological system in a peer reviewed journal? If so, provide the citation. Otherwise Dembski has as much credibility as Von Daniken's chariots of the gods.\n \n BTW, this is not switching the onus of proof, as you try to portray it. You originally made the assertion \"William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not.\" True, he has come up with it. But is it correct? Does it actually work? You infer yes to these questionz but you need to provide supporting evidence. Anyone can make unsupported assertions.", 
   {}, 
   17605, 
   null, 
   1064676660.0
  ], 
  [
   17625, 
   null, 
   "montalban", 
   "Monty, do you know the difference between publishing something in a book for popular consumption (such as No Free Lunch) and in a peer reviewed scientific journal? \n \n It appears that publishing in a peer reviewed scientific journal is what SLP means when he refers to \"publishing\". You seem to think that Dembski publishing a book for popular consumption is \"publishing\". \n \n Has Dembski published his explanatory filter and an application of it to a biological system in a peer reviewed journal? If so, provide the citation. Otherwise Dembski has as much credibility as Von Daniken's chariots of the gods.\n\n \n Firstly my claim was only that he had published it. You all berated and badgered me now for some days over this. I made no claim above this... because I 'suspect' that he has actually done this. I don't 'know' that he has.\n \n But as to what SLP wrote...We are now both having to second guess what SLP means, because what he said was that he had not published period! The inference was clear that he thought Dembski was afraid.\n \n It has been published. It has been applied. As far as I'm concerned this should be the end of this distracting issue.\n \n You mentioning of von Daniken is irrelevant. And, quite frankly is a red-herring. The fact that Dembski has been published means that he is laying his ideas on the table - not hiding them as alleged. The fact that scientists of all shades can pick this up and criticise it - and in fact have also circumvents your smears. I know you'd like to weave this mist of deceit around Dembski too; looking for a sign of scandal where there isn't one; hence you're linking him to von Daniken. It is a poor rhetorical ploy. \n \n Remember that Crick has published in peer-reviews his belief in aliens as the cause of life on earth. Publication does not imply feasibility, therefore not publishing can not imply that something is wrong.\n \n Deep down both you and SLP are clasping at straws by doing this. Rather than actually arguing over the presentation of Dembski you're now seeking not just that he present his argument, not just that he applies it to biological instances, not just that it has been criticised, but that he publishes it in one of your favourite magazines. Not all scientific discourse travels the same path. However you can read Dembski if you want, and disagree with him if you want. My intention on starting this thread was not to discuss the actual merits of Dembski, but to state that there is a growing field of science that is looking for intelligent design.\n \n Most scientist presenting some scientific argument could not in fact have their ideas published in a popular book form because it would be commercially untenable. The fact that Dembski can and does is probably what's really XXXXXXX you off. But likewise, if Barnes & noble carry it, it doesn't imply ridiculousness. You actually sound very much like someone supporting high art funding over sport. If it's popular it's dirty!\n \n However, I said earlier that I suspect that he has published in a journal. As far as I'm aware Dembski continually publishes for an Intelligence Design journal; would this be 'peer reviewed'? I have stated elsewhere the difficulty faced by people on my side from getting things published in other journals and periodicals.\n \n \nBTW, this is not switching the onus of proof, as you try to portray it. You originally made the assertion \"William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not.\" True, he has come up with it. But is it correct? Does it actually work? You infer yes to these questionz but you need to provide supporting evidence. Anyone can make unsupported assertions.\n\n \n Sure, I can concede that - I made the statement. I believe however that I have now proved\n a) that he has come up with an Filter\n b) that the filter is used to explain a naturally occurring event\n \n Whether any of you agree that it works is a totally different argument.\n \n SO, now that that's all over we can finally get back to the origins of this entire thread... Looking for Intelligent Design.\n \n Dawkins had claimed that he could find proof of there being no God. He did so by announcing that he'd discovered many things in biology that would appear to be poorly designed.\n \n Ipso facto, if one could find a system 'well designed' it might suggest an intelligence. If Dawkins can do this, then the search for intelligent design is a legitimate pursuit.\n \n Leading onto Dembski who claims that he has come with a Filter that can do just this.\n \n Other scientists look for signs of intelligence...\n Cryptographers look for meaning and patterns in seemingly meaningless groups of information\n \n Forensic scientists look for non-natural causes in death\n \n SETI, similar to cryptographers look for meaning coming from the stars.\n \n All up it seems a perfectly valid pursuit for scientists.\n \n Dembski claims in \"No Free Lunch\" to come up with a series of experiments for scientists to undertake. Excepting as shown by the responses on this post there seems to be a lot of hostility towards such pursuits.", 
   {}, 
   16040, 
   null, 
   1064716740.0
  ], 
  [
   17690, 
   null, 
   "SLP", 
   "Briefly, as I am on my way home:\n \n \nSLP is wrong.\n \n Again this writer has no idea of the implication of his words...\n\n \n More projection. \n\n \n Indeed, especially since it does not work. Do you understand the difference between hypothetical and empirical?\n \n If it does not work, it must have been tested. SLP's claim was that he hadn't even attempted to apply the filter. Not that he could not apply it. That this writer claims that it does not work means that it is not 'empirical'. But this writers said that Dembski had never published an instance where he had tried to apply his filter.\n\n \n My goodness.... It does not follow that the filter had to have been applied to biotic structures to show that it fails. It fails even on simple tests of non-biological knowns (spy codes, for example). If the filter fails to do what it is purported to be able to do even in simulations, then it would not have needed to have been applied to living things to be a failure. That much should be obvious even to the simplest of minds.\n\n Again, that is a different thing entirely from saying that you don't agree that it works!\n \n SLP said \"I asserted that Dembski has not actually applied his filter to biological structures/phenomena as he has been promising to do for years...\"\n and\n \"Dembski had the opportunity to present his evidence \" NOT THAT THE FILTER DOES NOT WORK.\n \n The suggestion was quite clear. Dembski had come up with a hypothetical, but had never attempted to apply this to real life.\n\n \n Read your own words and tell me if you really think they make sense. \n\n \n \"Dembski HAS APPLIED his explanatory filter to the biochemical structures in cells -- and concluded that blind natural selection could not have created them.\"\n \n It is quite clear, 'has applied' means that he has applied it, what could be simpler. Then SLP says that this isn't what it says at all. Quite clearly SLP is wrong. This is because SLP still thinks that not attempting to apply something and not being able to apply something are the same thing. He accused Dembski of the former, and uses the later as proof. He is wrong to do so and exhibits a basic flaw of logic. His smugness was that based on the belief that Dembski was in hiding and had never published.\n\n Your repeated purposeful distortion of what I clearly and repeatedly wrote tells me that you are dishonest, desperate, and ignorant. Upon finishing this post, I see little reason to continue becauser of this sad and obvious chgaracter flaw - one, unfortunatley, very common in creationists.\n\n \n Quite clearly Dembski could seach for intelligence on SLP's post, and the filter would not work there either.\n\n \n I find it stunningly ironic that Monty would use such insults in an arena wherein one need only read a handful of his posts to see the irony...\n\n \n Then he has the gall to say \"let's say for the sake of argument that Dembski did apply his filter to DNA, using REALISTIC criteria. YOUR own links, in fact, demonstrate that the filter is inapplicable for a variety of reasons.\"\n \n Obviously you'd only know it didn't work by attempting to apply it! \n\n Again, you must not have read your own links. The 'news' article did say that he had applied to biochemicals, however, the article that THAT referred to - Edis' - mentioned no such thing. One of the pitfalls of relying on second or third hand sources, as most internet creationists seem to do.\n\n \n \n Obviously Dembski has come up with a hypothetical.\n\n \n What do you really mean? \"A hypothetical\"? A hypothetical what? he has used his 'filter' to detect 'intellignece' behind a rigged election. Wow. I guess that means life was designed...\n\n \n How would he and they know wether it works or not? They must attempt to apply it to real situations. My quote earlier says he has applied the filter to biochemical structures in cells.\n\n \n I know it does. And I already pointed out how that quote was misleading.\n\n \n How this writer can keep saying that he hasn't applied it when all the evidence, even from his own side say otherwise.\n\n Sadly, that is not what I said nor was it what 'my side' said.[quote]\n \n Here is Monty the creationist's twisted recollection:\n \n\n I must repeat his accusation was that Dembski had come up with a hypothetical and was in hiding, and that he never attempted to publish an instance where he had applied his hypothetical. Quite clearly that assumption is flawed.\n\n \n Here is my first post, verbatim, on this topic, IN this thread (page 2):\n \n \n ***********************************\n Unfortunately, Dembski and his \"explanatory\" filter are more hot air than substance. He has claiming to have 'discovered' desing in nature by using the 'filter', but for some strange reason, he has yet to publish his amazing discovery. he said he was going to do it in \"Mere Creation\", then he said it would be iun \"No Free Lunch\" - so tell us , IS IT actually in his newest collection of apocryphal tall tales, or is is just assumed that he has done so?\n \n Common tactic - keep claiming that you will do something, then claim to have already done it later on, without, of course, actually doing it.\n \n The only times Dembski has acxtually applied it, he did it to things1. we know were the product of design and 2. never did it on anything biological.\n \n ***************************************\n \n The interested reader can compare my actual post with Monty's appraisal of it and consider whether or not his account is premised on an understanding of simple language.", 
   {}, 
   17547, 
   null, 
   1064782800.0
  ], 
  [
   17691, 
   null, 
   "SLP", 
   "\n But as to what SLP wrote...We are now both having to second guess what SLP means, because what he said was that he had not published period! The inference was clear that he thought Dembski was afraid.\n\n \n I really cannot put words together to explain the exasperation I am feeling at reading the Christian creationist Monty continue to utterly lie about what I wrote and/or implied - and I am not fond of referring to people on these forums as liars, but the repeated nature of this claim by Monty, despite the fact that I have repeatedly explained that that is not what I meant or implied, leaves few options.\n Afraid? Of what? It is an utter and obvious lie that I claimed that Dembski had not published at all. I simply cannot comprehend how this poster can continue to write such blatantly false gibberish.\nDeep down both you and SLP are clasping at straws by doing this. Rather than actually arguing over the presentation of Dembski you're now seeking not just that he present his argument, not just that he applies it to biological instances, not just that it has been criticised, but that he publishes it in one of your favourite magazines.\n\n How, pray tell, can W or I be \"clasping at straws\" when Demsbki's filter 1. does not work as claimed and 2. cannot detect design in Nature as it was claimed to do? Why on earth would WE be doing the straw grasping? Would noit the persoin claiming that it does work, it has detect4ed design, etc., even when it is obvious that this is not true, be the one that is really grasping and desperate? My gosh the creationist can project...[quote]\nDembski claims in \"No Free Lunch\" to come up with a series of experiments for scientists to undertake. Excepting as shown by the responses on this post there seems to be a lot of hostility towards such pursuits.\n\n \n So Dembski actually thinks that other scientists should do his experiments for him?\n \n Why doesn't HE do them? Why don't his well-funded pals at the DI do them? Why don't his colleagues at Baylor do them?\n \n Incredible....", 
   {}, 
   17625, 
   null, 
   1064783220.0
  ], 
  [
   17692, 
   null, 
   "SLP", 
   "Monty, do you know the difference between publishing something in a book for popular consumption (such as No Free Lunch) and in a peer reviewed scientific journal? \n \n It appears that publishing in a peer reviewed scientific journal is what SLP means when he refers to \"publishing\". You seem to think that Dembski publishing a book for popular consumption is \"publishing\". \n\n \n The fact that Dembski and his cohorts prefer targeting their 'science' at the scientifially illiterate pro-religion masses in self-published books, while damning in and of itself, is not really what I meant.\n I was referring to the fact that Dembski has, for years, been claiming to be able to/to have already detected 'design' in nature by applying his filter.\n This despite the fact that his filter was shown to be flawed long ago, and that he has yet to present (publish) his application of said filter. Apparently, in NFL, he has done this, or at least claimed to, the reviews I have read of it indicate that he did not go into much detail on this, instead regarded the issue as a 'done deal.' Hence the universal skepticism.\n\n \n Has Dembski published his explanatory filter and an application of it to a biological system in a peer reviewed journal? If so, provide the citation. Otherwise Dembski has as much credibility as Von Daniken's chariots of the gods.\n \n BTW, this is not switching the onus of proof, as you try to portray it. You originally made the assertion \"William Dembski has come up with the \"Explanatory Filter\" to determine if something is a natural occurring event, or not.\" True, he has come up with it. But is it correct? Does it actually work? You infer yes to these questionz but you need to provide supporting evidence. Anyone can make unsupported assertions.\nIndeed. Ironically, Monty has linked ot several devastating critiques of Dembski's work, and does so for reasons that I cannot fathom. He seems to think that if he can prove me wrong on whether or not it has been 'published' that it will somehow be a plus for anti-evolutionism.\n \n Strange indeed....", 
   {}, 
   17611, 
   null, 
   1064783580.0
  ], 
  [
   17715, 
   null, 
   "montalban", 
   "The fact that Dembski and his cohorts prefer targeting their 'science' at the scientifially illiterate pro-religion masses in self-published books, while damning in and of itself, is not really what I meant.\n I was referring to the fact that Dembski has, for years, been claiming to be able to/to have already detected 'design' in nature by applying his filter.\n This despite the fact that his filter was shown to be flawed long ago, and that he has yet to present (publish) his application of said filter.  Apparently, in NFL, he has done this, or at least claimed to,  the reviews I have read of it indicate that he did not go into much detail on this, instead regarded the issue as a 'done deal.' Hence the universal skepticism.Indeed.\n\n \n (Emphasis my own - He has published his filter.) End of story.\n \n Your scepticism is based on your own a priori belief that all 'natural' systems were arrived at through natural materialistic processes. Even now, rather than just cut your losses you still want to go on with this in an effort to at least see if a small amount of mud can stick.\n \n I had moved on, to deal with the issue of science looking into intelligent design, but you want to keep to this, well fine.\n \n \nIronically, Monty has linked ot several devastating critiques of Dembski's work, and does so for reasons that I cannot fathom. He seems to think that if he can prove me wrong on whether or not it has been 'published' that it will somehow be a plus for anti-evolutionism.\n \n Strange indeed....\n\n \n There is irony, but not where you think.\n \n I have repeatedly quoted conflicting ideas. Everyone knows what I think - or some believe that I don't think. Letting people see arguments from all sides enables other people to think. If you cast your eye on posts re: speciation and Darwin's Finch I have done so there. I did so on www.creationtalk.com* The strangeness then comes from people such as yourself 'free-thinkers' that you claim to be who dogmatically accept every fact posited by other people post on your side.\n \n This might seem strange to you, but then you like WJA are judging me by how you see yourself on these matters. \"Honi soit qui mal y pense\"**\n \n The irony however stems from this. I had no idea of the exact location of Dembski's publication. But I knew that he had. The first instances of proof that I could find came from your own side; that is numerous critiques of Dembski's idea, and how the filter doesn't work.\n \n I concluded that either all these people\n a) have actually read what he stated (therefore it was 'published')\n or\n b) made up an argument without actually knowing what he has said.\n \n I chose to believe a). Therefore the irony was that you chose to believe b) because you still couldn't accept that he had published. Therefore all these people critique Dembski - including why the filter could not be applied to specifics, were making it up!\n \n Thus this really does say a lot for your own lack of insight, because you are so dead-set on the idea that regardless what stuff I'd bring forward, even from people who are anti-Dembski it's now taken several days to convince you, and even now your statements are highly qualified.\n \n If you want to continue to lampoon or deride Dembski, fair enough, I will take you on regardless if I believe you are wrong.\n \n *In doing so I got exactly the same response. Like 'what sort of person provides evidence against his argument'?\n \n ** \"Evil be to him who thinks evil.\" It stems from a dinner held by Edward I. A lady dropped her garter. Edward bent down to roll it back up her leg. He then noticed a number of lewd looks from onlookers who all imagined he was doing it for other reasons. He had in fact just wanted to be chivalrous, but when he realised that people were thinking the act evil, he said \"Honi soit qui mal y pense.\"\n Edward then established a fraternity of knights, still in existence today, the Knights of The Garter.", 
   {}, 
   17692, 
   null, 
   1064809260.0
  ], 
  [
   17749, 
   null, 
   "SLP", 
   "Why do I keep doing this...\n(Emphasis my own - He has published his filter.) End of story.\n \n\n \n I know Dembski has published his'filter.' Never said he didn't. How can a poster continue to imply that I had claimed otherwise despite being told explicitly that I had not done so on several occasions? truly amazing...\n\n Your scepticism is based on your own a priori belief that all 'natural' systems were arrived at through natural materialistic processes. \n\n \n \n No, my skepticism is based on the fact that 1. his filter has been shown to produce false positives (despite his shrill protestations), 2. it has been shown not to work, 3. it has been shown to require tyhe input of parameters that he has no way of knowing the values of, etc.\n\n \n Even now, rather than just cut your losses you still want to go on with this in an effort to at least see if a small amount of mud can stick.\n\n \n More staggering irony...\n\n \n I had moved on, to deal with the issue of science looking into intelligent design, but you want to keep to this, well fine.\n\n You did? where did you do this? Last I saw you were repeatedly desperately trying to salvage Dembski's failed propaganda.\nI have repeatedly quoted conflicting ideas. Everyone knows what I think - or some believe that I don't think. Letting people see arguments from all sides enables other people to think. If you cast your eye on posts re: speciation and Darwin's Finch I have done so there. I did so on www.creationtalk.com* The strangeness then comes from people such as yourself 'free-thinkers' that you claim to be who dogmatically accept every fact posited by other people post on your side.\n\n I have seen just the opposite. You are the one touting Dembski's filter even though it fails on all counts. You are the one touting a book of 'witness' essays by religious zealots as 'proof' evolution is false. Etc. \n\n \n This might seem strange to you, but then you like WJA are judging me by how you see yourself on these matters. \"Honi soit qui mal y pense\"**\n\n I cannot speak for WJA, but I am judging you on the fact that you have repeatedly misrepresented my claims in this thread despite the fact that I have corrected you on several occasions and that a reasonable person reading my posts could not possibly conclude what you have been doing.\n\n \n The irony however stems from this. I had no idea of the exact location of Dembski's publication. But I knew that he had. The first instances of proof that I could find came from your own side; that is numerous critiques of Dembski's idea, and how the filter doesn't work.\n\n YTes, on many levels, none of which were his application to living things. You seem to be having a terribly tough time grasping that.\n\n \n I concluded that either all these people\n a) have actually read what he stated (therefore it was 'published')\n or\n b) made up an argument without actually knowing what he has said.\n \n I chose to believe a). Therefore the irony was that you chose to believe b) because you still couldn't accept that he had published. Therefore all these people critique Dembski - including why the filter could not be applied to specifics, were making it up!\n\n \n And you do it yet again.\n Does this lying come naturally to you, or do you sit down and practice? I HAVE NEVER SAID THAT DEMBSKI DID NOT PUBLISH HIS 'FILTER'. Not one. Ever. YOU have been claiming that I did this, despite the fact that I have repeatedly explained otherwise. It is really quite telling of the stability of your position.\n I am really having a hard time understanding why someone would commit so many blatant acts of dishonesty on a topic suchg as this, in so public a way. It is truly an interesting psychological phenomenon.\n \n You go on believing that Dembski has discovered 'design' in Nature. You will join the company of other similarly dishonest and deluded nut jobs around the world...", 
   {}, 
   17715, 
   null, 
   1064845680.0
  ], 
  [
   17856, 
   null, 
   "montalban", 
   "Why do I keep doing this...\n\n \n Indeed, why. You lost. Get over it.\n \n \nYou go on believing that Dembski has discovered 'design' in Nature. You will join the company of other similarly dishonest and deluded nut jobs around the world...\n\n \n He claims he has, you claim he hasn't. News at 10!\n \n You said he hadn't published (I've cited a book), application of filter or not. I've shown he has, he did. You are wrong, and what's worse is the horse you're floggin has long died.", 
   {}, 
   17749, 
   null, 
   1064899620.0
  ], 
  [
   17915, 
   null, 
   "SLP", 
   "Indeed, why. You lost. Get over it.\n \n \n \n He claims he has, you claim he hasn't. News at 10!\n \n You said he hadn't published (I've cited a book), application of filter or not. I've shown he has, he did. You are wrong, and what's worse is the horse you're floggin has long died.\n\n \n You're right, Monty. You are right about everything you write about. Always and without question. It is truly amazing how you are constantly correct and everyone else is always wrong.\n \n \n \n Its funny though - if someone claims to have done something and NOBODY accepots that claim and in fact many have soundly refuted the claim, what do you call someone that keeps on referring to that claim as though it were legitimate?", 
   {}, 
   17856, 
   null, 
   1065018660.0
  ], 
  [
   17966, 
   null, 
   "montalban", 
   "You're right, Monty. You are right about everything you write about. Always and without question. It is truly amazing how you are constantly correct and everyone else is always wrong.\n \n \n \n Its funny though - if someone claims to have done something and NOBODY accepots that claim and in fact many have soundly refuted the claim, what do you call someone that keeps on referring to that claim as though it were legitimate?\n\n \n Thank you SLP, now can we move on to talk about the legitimate search for intelligent design, by science?", 
   {}, 
   17915, 
   null, 
   1065089700.0
  ], 
  [
   17981, 
   null, 
   "lurch", 
   "...the legitimate search for intelligent design, by science\n \n Great! Please begin by citing the peer reviewed literature. I wasn't aware that there was a \"legitimate\" search for intelligent design by science. I am only aware of intelligent design creationism wherein creationaries pretend that their incredulity is somehow scientific.", 
   {}, 
   17966, 
   null, 
   1065108360.0
  ], 
  [
   17985, 
   null, 
   "SLP", 
   "Thank you SLP, now can we move on to talk about the legitimate search for intelligent design, by science?\n\n \n No prolem. I so enjoy pumping the egos of internet creationists. It makes them feel special, and it makes the enjoyment of their ultimate intellectual decimation so much more sweet.\n \n Anyway, yes, I too would enjoy taling about the legitimate search for Intelligent Design in Nature.\n \n By that statement, I conclude that you consider Dembski's antics to be illegitimate? Good, so do most scientists.", 
   {}, 
   17966, 
   null, 
   1065115260.0
  ], 
  [
   18089, 
   null, 
   "montalban", 
   "No prolem. I so enjoy pumping the egos of internet creationists. It makes them feel special, and it makes the enjoyment of their ultimate intellectual decimation so much more sweet.\n \n Anyway, yes, I too would enjoy taling about the legitimate search for Intelligent Design in Nature.\n \n By that statement, I conclude that you consider Dembski's antics to be illegitimate? Good, so do most scientists.\n\n \n Ho ho.\n \n No but I think it's about time we put that little tantrum of yours to bed now don't you think -the one where you wrongly claimed Dembski hadn't published his application...\n \n \n Anyway....\n \n As I posted at the very beginning... Dawkins has opened the door for the search for intelligent design. By insisting that something is 'badly designed' therefore not part of a creator, ipso facto we can now look for something well designed as proof of a creator.\n \n Of course, what Dawkins claims is 'poor' design is wholly subjective.", 
   {}, 
   17985, 
   null, 
   1065226440.0
  ], 
  [
   18105, 
   null, 
   "TheoMorphic", 
   "dawkin's was showing that paley's argument that seemingly good design is proof of creations is just as valid as seemingly bad design is proof of no creator... i.e. both arguments are bad. \n \n i'm not sure exactly which logical fallacy could be applied here... little help please from anyone interested. maybe non sequitur, or faulty cause and effect. \n \n anyway, do you still want to use dawkins pointing to bad design as an open door to go ahead and find good design as proof of intelligent design, or do you want to explore another avenue?", 
   {}, 
   18089, 
   null, 
   1065236460.0
  ], 
  [
   18112, 
   null, 
   "montalban", 
   "dawkin's was showing that paley's argument that seemingly good design is proof of creations is just as valid as seemingly bad design is proof of no creator... i.e. both arguments are bad. \n \n i'm not sure exactly which logical fallacy could be applied here... little help please from anyone interested. maybe non sequitur, or faulty cause and effect. \n \n anyway, do you still want to use dawkins pointing to bad design as an open door to go ahead and find good design as proof of intelligent design, or do you want to explore another avenue?\n\n \n Actually the door's already open to science\n SETI looks for ID\n Cryptographers do to\n Forensic scientists do.", 
   {}, 
   18105, 
   null, 
   1065240060.0
  ], 
  [
   18132, 
   null, 
   "TheoMorphic", 
   "Actually the door's already open to science\n SETI looks for ID\n Cryptographers do to\n Forensic scientists do.\n\n \n SETI is trying to find patterns among the random noise in space. Patterns in space however do not mean they are intelligently designed. Pulsars emit energy in a pattern that is un-random, however it is not attributed to intelligent design. In our experience most things with patterns have been intelligently designed; but this does not extend to all things with patterns. fallacy of composition. \n \n it is not unusual for people to create coded strings of letters, so cryptographers guessing that a seemingly random string of letters are intelligently designed is not jumping to any conclusions. Likewise for forensic scientists. \n \n At any rate, the groups you mentioned above do not assume the things they are examining were intelligently designed. They just allow for the possibility that they were intelligently designed, and go about making observations to see if what they are examining could have occurred naturally/randomly. Do you allow for the possibility that life as you know it was not intelligently designed? As soon as you admit that, and explain how intelligent design could be falsified you will dwell in the land of religion (well there are a few more requirements, but that's a good first step).", 
   {
    "unicode_changes_made": true
   }, 
   18112, 
   null, 
   1065245340.0
  ], 
  [
   18155, 
   null, 
   "montalban", 
   "SETI is trying to find patterns among the random noise in space. Patterns in space however do not mean they are intelligently designed. Pulsars emit energy in a pattern that is un-random, however it is not attributed to intelligent design. In our experience most things with patterns have been intelligently designed; but this does not extend to all things with patterns. fallacy of composition. \n\n \n They are searching for intelligent design. Therefore it is a 'legitimate' process for science to undertake.\n \n \nAt any rate, the groups you mentioned above do not assume the things they are examining were intelligently designed. They just allow for the possibility that they were intelligently designed, and go about making observations to see if what they are examining could have occurred naturally/randomly. Do you allow for the possibility that life as you know it was not intelligently designed? As soon as you admit that, and explain how intelligent design could be falsified you will dwell in the land of religion (well there are a few more requirements, but that?s a good first step).\n\n \n So, you're only concerned that someone might expect to find intelligence, and is therefore looking for it.\n \n Ooops, so much for having a hypothesis and then testing it. I guess that is rather un-scientific.", 
   {}, 
   18132, 
   null, 
   1065257460.0
  ], 
  [
   18175, 
   null, 
   "TheoMorphic", 
   "They are searching for intelligent design. Therefore it is a 'legitimate' process for science to undertake.\n\n \n so how are you going to go about looking for intelligent design in nature?\n \n \nSo, you're only concerned that someone might expect to find intelligence, and is therefore looking for it.\n \n Ooops, so much for having a hypothesis and then testing it. I guess that is rather un-scientific.\n\n \n i don't quite get what you mean by this. SETI isn't proclaiming there is extraterrestrial life. They are looking for something they can work with. Paleontologists didn't proclaim they knew dinosaurs existed before they found fossils.", 
   {}, 
   18155, 
   null, 
   1065272640.0
  ], 
  [
   18207, 
   null, 
   "montalban", 
   "so how are you going to go about looking for intelligent design in nature?\n\n \n I don't need to.\n \n However, Dembski proposes several experiments, he's the one you might want to consult.\n \n \nPaleontologists didn't proclaim they knew dinosaurs existed before they found fossils.\n\n \n They found fossils first and by accident. Your anaology fails\n \n \ni don't quite get what you mean by this. SETI isn't proclaiming there is extraterrestrial life. They are looking for something they can work with. \n\n \n Nice attempt at juggling words again.\n \n No, you excluded the search for ID on the basis that cretionists have an a priori belief in a creator.\n \n As scientists often have a belief before experimenting, then an a priori belief is not an excuse to exclude anyone from experimenting/searching.\n \n Secondly, SETI believes that there is a strong chance of Extra-terra life; that's what they're looking for. That's what they use to worm $$$ from everyone for. They aren't just poiting their telescopes into the air and hoping, they have a reasoned process behind this. They will even direct their telescopes to areas that they think might be more heavily 'populated' by aliens!", 
   {}, 
   18175, 
   null, 
   1065314580.0
  ], 
  [
   18225, 
   null, 
   "TheoMorphic", 
   " They found fossils first and by accident. Your anaology fails\n\n \n paleontologists didn't assume there were dinosaurs to begin with. SETI does not assume the existence of alien life. They may be looking for evidence of it, but any little blip on their radar is not attributed to aliens. Even when they decipher patterns that are unexplained they do not automatically attribute this to aliens (\"wow\" signal). \n \n \nNo, you excluded the search for ID on the basis that cretionists have an a priori belief in a creator.\n\n \n yup, they assume to have the answers, instead of taking a guess, and then trying to find evidence that supports it. \n \n \nAs scientists often have a belief before experimenting, then an a priori belief is not an excuse to exclude anyone from experimenting/searching.\n\n \n What's wrong with being biased? Scientists are only human. But after conducting their tests and getting favorable results, they open their tests up to the scientific community so it can be verified, or falsified. If their bias seeped into their work then it will show.. \n \n \nSecondly, SETI believes that there is a strong chance of Extra-terra life; that's what they're looking for. That's what they use to worm $$$ from everyone for. They aren't just poiting their telescopes into the air and hoping, they have a reasoned process behind this. They will even direct their telescopes to areas that they think might be more heavily 'populated' by aliens!\n\n \n wow... you actually said it. Are you going to turn around and say there is a \"strong chance\" of your god... or will you say you absolutely know your god exists. I doubt it you'll say the first. \n \n So what if they are biased. So what if they guess that some areas of the sky will more likely produce a message than others. As long as they don't proclaiming there actually is alien life they are in the clear. \n \n Do you want to be tentative about your intelligent designer? Do you allow the possibility that the universe and humans were not intelligently designed?", 
   {
    "unicode_changes_made": true
   }, 
   18207, 
   null, 
   1065332760.0
  ], 
  [
   18306, 
   null, 
   "SLP", 
   "Ho ho.\n \n No but I think it's about time we put that little tantrum of yours to bed now don't you think -the one where you wrongly claimed Dembski hadn't published his application...\n\n \n Oh, so now you are claiming that I said he hadn't published an application of his failed filter?\n Did you not previously lie and claim - repeatedly - that I had claimed that he had not published his 'filter'? Which is it, credibility-boy?\n\n \n \n Anyway....\n \n As I posted at the very beginning... Dawkins has opened the door for the search for intelligent design. By insisting that something is 'badly designed' therefore not part of a creator, ipso facto we can now look for something well designed as proof of a creator.\n\n As usual, Monty the cretin gets it backwards. It was easily awed creationists that blabber on about how 'perfect' this or that was \"designed.\" As the argument form 'perfection' was actually being employed, it was reasonable for the 'not-so-oerfect' design argument to be used. Of course the creationists, being the logical beings they are, merely dismissed such arguments since, after all, weho can know what the designer's plans were? Not to mention that everything WAS perfect at one time, and anything non-perfect now is the result of SIN!\n How rational!\n\n \n Of course, what Dawkins claims is 'poor' design is wholly subjective.\n\n \n Like I said...\n \n As is what is 'good' design..", 
   {}, 
   18089, 
   null, 
   1065450000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Looking for intelligence", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/999-looking-intelligence.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 999, 
  "discussion_files": [
   [
    "26645.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/999-looking-intelligence-print.html"
   ], 
   [
    "26646.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/999-looking-intelligence-5-print.html"
   ], 
   [
    "26647.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/999-looking-intelligence-4-print.html"
   ], 
   [
    "26648.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/999-looking-intelligence-3-print.html"
   ], 
   [
    "26649.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/999-looking-intelligence-2-print.html"
   ]
  ], 
  "identifier": 999
 }
]