[
 [
  [
   268042, 
   null, 
   "VTCruiser", 
   "http://www.foxnews.com/story/0,2933,280215,00.html\n \n Anti-death penalty forces have gained momentum in the past few years, with a moratorium in Illinois, court disputes over lethal injection in more than a half-dozen states and progress toward outright abolishment in New Jersey.\n \n The steady drumbeat of DNA exonerations - pointing out flaws in the justice system - has weighed against capital punishment. The moral opposition is loud, too, echoed in Europe and the rest of the industrialized world, where all but a few countries banned executions years ago.\n \n What gets little notice, however, is a series of academic studies over the last half-dozen years that claim to settle a once hotly debated argument - whether the death penalty acts as a deterrent to murder. The analyses say yes. They count between three and 18 lives that would be saved by the execution of each convicted killer.\n \n The reports have horrified death penalty opponents and several scientists, who vigorously question the data and its implications.\n \n So far, the studies have had little impact on public policy. New Jersey's commission on the death penalty this year dismissed the body of knowledge on deterrence as \"inconclusive.\"\n \n But the ferocious argument in academic circles could eventually spread to a wider audience, as it has in the past.\n \n \"Science does really draw a conclusion. It did. There is no question about it,\" said Naci Mocan, an economics professor at the University of Colorado at Denver. \"The conclusion is there is a deterrent effect.\"\n \n A 2003 study he co-authored, and a 2006 study that re-examined the data, found that each execution results in five fewer homicides, and commuting a death sentence means five more homicides. \"The results are robust, they don't really go away,\" he said. \"I oppose the death penalty. But my results show that the death penalty (deters) - what am I going to do, hide them?\"\n \n Statistical studies like his are among a dozen papers since 2001 that capital punishment has deterrent effects. They all explore the same basic theory - if the cost of something (be it the purchase of an apple or the act of killing someone) becomes too high, people will change their behavior (forego apples or shy from murder).\n \n To explore the question, they look at executions and homicides, by year and by state or county, trying to tease out the impact of the death penalty on homicides by accounting for other factors, such as unemployment data and per capita income, the probabilities of arrest and conviction, and more.\n \n Among the conclusions:\n \n \u0095 Each execution deters an average of 18 murders, according to a 2003 nationwide study by professors at Emory University. (Other studies have estimated the deterred murders per execution at three, five and 14).\n \n \u0095 The Illinois moratorium on executions in 2000 led to 150 additional homicides over four years following, according to a 2006 study by professors at the University of Houston.\n \n \u0095 Speeding up executions would strengthen the deterrent effect. For every 2.75 years cut from time spent on death row, one murder would be prevented, according to a 2004 study by an Emory University professor.\n \n In 2005, there were 16,692 cases of murder and nonnegligent manslaughter nationally. There were 60 executions.\n \n The studies' conclusions drew a philosophical response from a well-known liberal law professor, University of Chicago's Cass Sunstein. A critic of the death penalty, in 2005 he co-authored a paper titled \"Is capital punishment morally required?\"\n \n \"If it's the case that executing murderers prevents the execution of innocents by murderers, then the moral evaluation is not simple,\" he told The Associated Press. \"Abolitionists or others, like me, who are skeptical about the death penalty haven't given adequate consideration to the possibility that innocent life is saved by the death penalty.\"\n \n Sunstein said that moral questions aside, the data needs more study.\n \n Critics of the findings have been vociferous.\n \n Some claim that the pro-deterrent studies made profound mistakes in their methodology, so their results are untrustworthy. Another critic argues that the studies wrongly count all homicides, rather than just those homicides where a conviction could bring the death penalty. And several argue that there are simply too few executions each year in the United States to make a judgment.\n \n \"We just don't have enough data to say anything,\" said Justin Wolfers, an economist at the Wharton School of Business who last year co-authored a sweeping critique of several studies, and said they were \"flimsy\" and appeared in \"second-tier journals.\"\n \n \"This isn't left vs. right. This is a nerdy statistician saying it's too hard to tell,\" Wolfers said. \"Within the advocacy community and legal scholars who are not as statistically adept, they will tell you it's still an open question. Among the small number of economists at leading universities whose bread and butter is statistical analysis, the argument is finished.\"\n \n Several authors of the pro-deterrent reports said they welcome criticism in the interests of science, but said their work is being attacked by opponents of capital punishment for their findings, not their flaws.\n \n \"Instead of people sitting down and saying 'let's see what the data shows,' it's people sitting down and saying 'let's show this is wrong,'\" said Paul Rubin, an economist and co-author of an Emory University study. \"Some scientists are out seeking the truth, and some of them have a position they would like to defend.\"\n \n The latest arguments replay a 1970s debate that had an impact far beyond academic circles.\n \n Then, economist Isaac Ehrlich had also concluded that executions deterred future crimes. His 1975 report was the subject of mainstream news articles and public debate, and was cited in papers before the U.S. Supreme Court arguing for a reversal of the court's 1972 suspension of executions. (The court, in 1976, reinstated the death penalty.)\n \n Ultimately, a panel was set up by the National Academy of Sciences which decided that Ehrlich's conclusions were flawed. But the new pro-deterrent studies haven't gotten that kind of scrutiny.\n \n At least not yet. The academic debate, and the larger national argument about the death penalty itself - with questions about racial and economic disparities in its implementation - shows no signs of fading away.\n \n Steven Shavell, a professor of law and economics at Harvard Law School and co-editor-in-chief of the American Law and Economics Review, said in an e-mail exchange that his journal intends to publish several articles on the statistical studies on deterrence in an upcoming issue", 
   {
    "post_info": {
     "post_title": "Death Penalty Decreases Crime"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1181538480.0
  ], 
  [
   268056, 
   null, 
   "chemist99a", 
   "Even if the death penalty does decrease crime the error rate in capital cases is too great to tolerate in a civilized society. We make too many mistakes and execute too many who are not guilty.", 
   {}, 
   268042, 
   null, 
   1181543100.0
  ], 
  [
   268066, 
   null, 
   "Symbiote", 
   "Many economists are so obsessed with statistics that they lose sight of meaning. A study of cause and effect requires experimental design in which a single variable is manipulated or allowed to vary, correlational design can at best hint at relationships between variables, even when sophisticated factor analytic techniques are employed.\n \n In this case what we have is a correlation, and the very likely possibility that a third, fourth or fifth factor results in both decreased murder rates and increased executions.\n \n By the same logic many economists use, we could find any number of absurd things. For example there is a well known correlation between skyscraper construction and economic downturn, we could conclude from this that tall buildings depress economies and that recessions can be avoided if we disallow the construction of record-height buildings.\n \n The other thing economists need to realise is that economic statistics are entirely historical, they provide empirical information about a particular group at a particular time, not universal truths about mankinds' behaviour in general. Even if we run an experimental design in the realm of human action showing X causes Y, differing social and cultural norms may result in the precise opposite effect at another period of time.", 
   {}, 
   268056, 
   null, 
   1181548920.0
  ], 
  [
   268071, 
   null, 
   "snakespit", 
   "Even if the death penalty does decrease crime the error rate in capital cases is too great to tolerate in a civilized society. We make too many mistakes and execute too many who are not guilty.\n\n \n Name 5 and provide the links.", 
   {}, 
   268056, 
   null, 
   1181555400.0
  ], 
  [
   268108, 
   null, 
   "VTCruiser", 
   "Even if the death penalty does decrease crime the error rate in capital cases is too great to tolerate in a civilized society. We make too many mistakes and execute too many who are not guilty.\n\n \n Considering the avg number of capital punishments a year is around 70..... think of the 4000 babies in the womb that arent guilty of any crimes that are everyday being slaughtered through abortion..... \n \n Just putting some things in perspective for you......\n \n Just as many people died in the world trade center attack on September 11th, thats how many babies die from abortion everyday in America.... \n There have been 2000 soldiers that have died in Iraq... thats only half the number of babies that die everyday from abortion on our own soil....\n \n What a shame for the \"land of the free\" that has \"life, liberty, and the pursuit of happiness\"... \n \n THERE IS GENOCIDE HAPPENING AND NO ONE IS STANDING UP FOR THE TRUE INNOCENT AMONG US! in fact the ones against the death penalty ARE FOR ABORTION! Truly they are for the life of the innocent right.... ???? (said sarcatically)", 
   {}, 
   268056, 
   null, 
   1181582100.0
  ], 
  [
   268117, 
   null, 
   "smiley", 
   "Name 5 and provide the links.\n\n \n I'm afraid I have no examples, but isn't ONE too many?", 
   {}, 
   268071, 
   null, 
   1181586180.0
  ], 
  [
   268129, 
   null, 
   "JPSartre12", 
   "Many economists are so obsessed with statistics that they lose sight of meaning. A study of cause and effect requires experimental design in which a single variable is manipulated or allowed to vary, correlational design can at best hint at relationships between variables, even when sophisticated factor analytic techniques are employed.\n\n \n It appears that they have done just that.\n \"To explore the question, they look at executions and homicides, by year and by state or county, trying to tease out the impact of the death penalty on homicides by accounting for other factors, such as unemployment data and per capita income, the probabilities of arrest and conviction, and more.\"\n \n\n In this case what we have is a correlation, and the very likely possibility that a third, fourth or fifth factor results in both decreased murder rates and increased executions.\n\n Any statistician worth his salt knows about multivariate statistics and doesn't need to design an experiment with only ONE variable. With enough of a population size, you can check the effects of dozens of variables at once. \n \n\n By the same logic many economists use, we could find any number of absurd things. For example there is a well known correlation between skyscraper construction and economic downturn, we could conclude from this that tall buildings depress economies and that recessions can be avoided if we disallow the construction of record-height buildings.\n \n The other thing economists need to realise is that economic statistics are entirely historical, they provide empirical information about a particular group at a particular time, not universal truths about mankinds' behaviour in general. Even if we run an experimental design in the realm of human action showing X causes Y, differing social and cultural norms may result in the precise opposite effect at another period of time.\n\n So, the cavaet is \"The death penalty is a deterrent in the USA TODAY!\" I can live with that.emoticon_xgood", 
   {}, 
   268066, 
   null, 
   1181589000.0
  ], 
  [
   268174, 
   null, 
   "snakespit", 
   "I'm afraid I have no examples, but isn't ONE too many?\n\n Exactly.\n \n 1 innocent person given a life term in prison is too many, but it happens. I would even be willing to bet that the margin for error is greater in non-death cases, due to the close scrutiny that death cases recieve. I am all for minimizing the chances that an innocent person is given the sentence, however I am not willing to throw out a useful and effective means of punishment simply because the system which issues it is somewhat flawed. \n \n \n Problem is, everyone keeps talking about all of these innocent people that we have put to death, yet coming up with concrete examples seems to be a bit of a problem. Where is this massive horde of innocent people that have been put to death? \n \n And by the way, are you chemist99a's other personality?", 
   {}, 
   268117, 
   null, 
   1181599320.0
  ], 
  [
   268270, 
   null, 
   "Unriggable", 
   "I'd like to use this thread to think out loud about how stupid lethal injection is. Why do they swap the patient's arm with alcohol?", 
   {}, 
   268042, 
   null, 
   1181625000.0
  ], 
  [
   268285, 
   null, 
   "Shooterandproud", 
   "http://www.foxnews.com/story/0,2933,280215,00.html\n \n Anti-death penalty forces have gained momentum in the past few years, with a moratorium in Illinois, court disputes over lethal injection in more than a half-dozen states and progress toward outright abolishment in New Jersey.\n \n The steady drumbeat of DNA exonerations - pointing out flaws in the justice system - has weighed against capital punishment. The moral opposition is loud, too, echoed in Europe and the rest of the industrialized world, where all but a few countries banned executions years ago.\n \n What gets little notice, however, is a series of academic studies over the last half-dozen years that claim to settle a once hotly debated argument - whether the death penalty acts as a deterrent to murder. The analyses say yes. They count between three and 18 lives that would be saved by the execution of each convicted killer.\n \n The reports have horrified death penalty opponents and several scientists, who vigorously question the data and its implications.\n \n So far, the studies have had little impact on public policy. New Jersey's commission on the death penalty this year dismissed the body of knowledge on deterrence as \"inconclusive.\"\n \n But the ferocious argument in academic circles could eventually spread to a wider audience, as it has in the past.\n \n \"Science does really draw a conclusion. It did. There is no question about it,\" said Naci Mocan, an economics professor at the University of Colorado at Denver. \"The conclusion is there is a deterrent effect.\"\n \n A 2003 study he co-authored, and a 2006 study that re-examined the data, found that each execution results in five fewer homicides, and commuting a death sentence means five more homicides. \"The results are robust, they don't really go away,\" he said. \"I oppose the death penalty. But my results show that the death penalty (deters) - what am I going to do, hide them?\"\n \n Statistical studies like his are among a dozen papers since 2001 that capital punishment has deterrent effects. They all explore the same basic theory - if the cost of something (be it the purchase of an apple or the act of killing someone) becomes too high, people will change their behavior (forego apples or shy from murder).\n \n To explore the question, they look at executions and homicides, by year and by state or county, trying to tease out the impact of the death penalty on homicides by accounting for other factors, such as unemployment data and per capita income, the probabilities of arrest and conviction, and more.\n \n Among the conclusions:\n \n \u0095 Each execution deters an average of 18 murders, according to a 2003 nationwide study by professors at Emory University. (Other studies have estimated the deterred murders per execution at three, five and 14).\n \n \u0095 The Illinois moratorium on executions in 2000 led to 150 additional homicides over four years following, according to a 2006 study by professors at the University of Houston.\n \n \u0095 Speeding up executions would strengthen the deterrent effect. For every 2.75 years cut from time spent on death row, one murder would be prevented, according to a 2004 study by an Emory University professor.\n \n In 2005, there were 16,692 cases of murder and nonnegligent manslaughter nationally. There were 60 executions.\n \n The studies' conclusions drew a philosophical response from a well-known liberal law professor, University of Chicago's Cass Sunstein. A critic of the death penalty, in 2005 he co-authored a paper titled \"Is capital punishment morally required?\"\n \n \"If it's the case that executing murderers prevents the execution of innocents by murderers, then the moral evaluation is not simple,\" he told The Associated Press. \"Abolitionists or others, like me, who are skeptical about the death penalty haven't given adequate consideration to the possibility that innocent life is saved by the death penalty.\"\n \n Sunstein said that moral questions aside, the data needs more study.\n \n Critics of the findings have been vociferous.\n \n Some claim that the pro-deterrent studies made profound mistakes in their methodology, so their results are untrustworthy. Another critic argues that the studies wrongly count all homicides, rather than just those homicides where a conviction could bring the death penalty. And several argue that there are simply too few executions each year in the United States to make a judgment.\n \n \"We just don't have enough data to say anything,\" said Justin Wolfers, an economist at the Wharton School of Business who last year co-authored a sweeping critique of several studies, and said they were \"flimsy\" and appeared in \"second-tier journals.\"\n \n \"This isn't left vs. right. This is a nerdy statistician saying it's too hard to tell,\" Wolfers said. \"Within the advocacy community and legal scholars who are not as statistically adept, they will tell you it's still an open question. Among the small number of economists at leading universities whose bread and butter is statistical analysis, the argument is finished.\"\n \n Several authors of the pro-deterrent reports said they welcome criticism in the interests of science, but said their work is being attacked by opponents of capital punishment for their findings, not their flaws.\n \n \"Instead of people sitting down and saying 'let's see what the data shows,' it's people sitting down and saying 'let's show this is wrong,'\" said Paul Rubin, an economist and co-author of an Emory University study. \"Some scientists are out seeking the truth, and some of them have a position they would like to defend.\"\n \n The latest arguments replay a 1970s debate that had an impact far beyond academic circles.\n \n Then, economist Isaac Ehrlich had also concluded that executions deterred future crimes. His 1975 report was the subject of mainstream news articles and public debate, and was cited in papers before the U.S. Supreme Court arguing for a reversal of the court's 1972 suspension of executions. (The court, in 1976, reinstated the death penalty.)\n \n Ultimately, a panel was set up by the National Academy of Sciences which decided that Ehrlich's conclusions were flawed. But the new pro-deterrent studies haven't gotten that kind of scrutiny.\n \n At least not yet. The academic debate, and the larger national argument about the death penalty itself - with questions about racial and economic disparities in its implementation - shows no signs of fading away.\n \n Steven Shavell, a professor of law and economics at Harvard Law School and co-editor-in-chief of the American Law and Economics Review, said in an e-mail exchange that his journal intends to publish several articles on the statistical studies on deterrence in an upcoming issue\n\n \n Wait, so lemme get this straight. You think that we should cherish every single embryo out there even if it means denying a woman a right to her own body, but you have no trouble executing people that actually exist? Wow, you conservatives are very intelligent thinkers. How can I deny your impeccable logic?", 
   {
    "unicode_changes_made": true
   }, 
   268042, 
   null, 
   1181633280.0
  ], 
  [
   268287, 
   null, 
   "Symbiote", 
   "With enough of a population size, you can check the effects of dozens of variables at once. \n\n \n You can check the statistical relationship between dozens of variables, not the effects of them.\n \n For example if I correlated left hand strength with right hand strength across a billion individuals I would probably find a correlation of about 0.93, however this relationship is not causal, cutting off one hand will not result in a 90% strength reduction in the other.\n \n Correlational studies like this one can not determine cause and effect.\n \n \nSo, the cavaet is \"The death penalty is a deterrent in the USA TODAY!\" I can live with that\n\n \n That would (almost) be a valid conclusion if the study employed experimental rather than correlational design, a very difficult thing with regard to broad social trends, but the only way such a conclusion could be validated. Even if that were true, it would not say \"death penalty is a deterrent TODAY\", it would say \"death penalty was a deterrent on average over the period in which the study took place\"", 
   {}, 
   268129, 
   null, 
   1181635800.0
  ], 
  [
   268294, 
   null, 
   "chemist99a", 
   "Problem is, everyone keeps talking about all of these innocent people that we have put to death, yet coming up with concrete examples seems to be a bit of a problem. Where is this massive horde of innocent people that have been put to death?\n The problem is that once the prisoner is executed there is no reason whatsoever to examine his guilt or innocence. If he was innocent there is nothing to be done and nobody is interested in rocking the boat. If he was guilty there is also no interest. What we do have is a number of cases which otherwise would have proceeded to execution except for last minute DNA evidence which proved exculpatory. Too many mistakes.", 
   {}, 
   268287, 
   null, 
   1181637540.0
  ], 
  [
   268325, 
   null, 
   "Steeeeve", 
   "I'm afraid I have no examples, but isn't ONE too many?\n\n \n Is one too many people wrongfully convicted and sent to life in prison where they died behind bars?", 
   {}, 
   268117, 
   null, 
   1181660760.0
  ], 
  [
   268339, 
   null, 
   "jitobear", 
   "Frankly I don't care what the stats say. I don't want my government to have the power to execute.\n \n And IF we are. Everyone on death row gets the same level of representation. I am sick of the rich being able to buy themselves off with better representation.\n \n Actually - that kind of ticks me off period. The idea that money should purchase you better counsel for the same crime (or a worse crime) than the poor slob using a public defender.\n \n An attorney friend of mine thought it might be helpful if ALL attorneys were required to do 1-2 years of public defender service and that it was then part of their record as an attorney.", 
   {}, 
   268325, 
   null, 
   1181668020.0
  ], 
  [
   268348, 
   null, 
   "snakespit", 
   "The problem is that once the prisoner is executed there is no reason whatsoever to examine his guilt or innocence. If he was innocent there is nothing to be done and nobody is interested in rocking the boat. If he was guilty there is also no interest. \n\n \n That's why we hold the trial before the execution, not after. \n \n \nWhat we do have is a number of cases which otherwise would have proceeded to execution except for last minute DNA evidence which proved exculpatory. Too many mistakes.\n\n \n Wow, the system works. Almost executed is not the same thing as executed. And again, while i know it does happen from time to time, how many cases can you provide as examples where someone was sentenced to death, and later exhonerated from all charges? I bet not too many. \n \n ~\"We have executed too many innocent people in this country!\"\n \n *\"Who?\"\n \n ~\"Well, we almost executed them.\"\n \n LOL, I love it. :)", 
   {}, 
   268294, 
   null, 
   1181669100.0
  ], 
  [
   268382, 
   null, 
   "VTCruiser", 
   "Wait, so lemme get this straight. You think that we should cherish every single embryo out there even if it means denying a woman a right to her own body, but you have no trouble executing people that actually exist? Wow, you conservatives are very intelligent thinkers. How can I deny your impeccable logic?\n\n \n You should read my 2nd comment i stated above.....", 
   {}, 
   268285, 
   null, 
   1181680260.0
  ], 
  [
   268385, 
   null, 
   "VTCruiser", 
   "Considering the avg number of capital punishments a year is around 70..... think of the 4000 babies in the womb that arent guilty of any crimes that are everyday being slaughtered through abortion..... \n \n Just putting some things in perspective for you......\n \n Just as many people died in the world trade center attack on September 11th, thats how many babies die from abortion everyday in America.... \n There have been 2000 soldiers that have died in Iraq... thats only half the number of babies that die everyday from abortion on our own soil....\n \n What a shame for the \"land of the free\" that has \"life, liberty, and the pursuit of happiness\"... \n \n THERE IS GENOCIDE HAPPENING AND NO ONE IS STANDING UP FOR THE TRUE INNOCENT AMONG US! in fact the ones against the death penalty ARE FOR ABORTION! Truly they are for the life of the innocent right.... ???? (said sarcatically)\n\n \n just bumping this because it seems to have been overlooked...", 
   {}, 
   268108, 
   null, 
   1181680380.0
  ], 
  [
   268419, 
   null, 
   "andjustice4all", 
   "http://www.foxnews.com/story/0,2933,280215,00.html\n \n \"We just don't have enough data to say anything,\" said Justin Wolfers, an economist at the Wharton School of Business who last year co-authored a sweeping critique of several studies, and said they were \"flimsy\" and appeared in \"second-tier journals.\"\n \n \"This isn't left vs. right. This is a nerdy statistician saying it's too hard to tell,\" Wolfers said. \"Within the advocacy community and legal scholars who are not as statistically adept, they will tell you it's still an open question. Among the small number of economists at leading universities whose bread and butter is statistical analysis, the argument is finished.\"\n\n \n Although I agree with this researcher's opinion, I would be hesitant to consider any of the numbers or researchers cited in this article as reliable. Why? It seems more relevant to ask the opinion of sociologists and criminologists about the death penalty serving as a deterrent. But again, this article was printed by Fox news, who simply provide conservative propaganda and not factual information. And that is not an opinion but an observation after watching several Fox news shows.\n \n Additionally, the fact remains that \"Relatively few crimes committed in the U.S. are eligible for the death penalty...[Therefore,] by definition, the death penalty cannot have much of an effect on the overall U.S. crime rate\" (Mays & Winfree, 2005, p. 396).\n \n And in regards to the effect the death penalty has on the murder rate in the U.S., \"...we simply do not know. The death penalty might be a deterrent, but we have no way of knowing the number of murders that did not occur. However, if executions did lower the murder rate, we would expect Texas [who by far has executed more people than any other jurisdiction in the U.S. since the reinstatement of the death penalty in 1976] to have the nation's lowest per capita murder rate\" (Mays & Winfree, 2005, p. 396). But, it does not!\n \n \n Source: Mays, G.L., & Winfree, L.T. (2005). Essentials of corrections(3rd edition). Belmont, CA: Thomson Wadsworth.", 
   {}, 
   268042, 
   null, 
   1181693460.0
  ], 
  [
   268606, 
   null, 
   "Shooterandproud", 
   "Steve: Is one too many people wrongfully convicted and sent to life in prison where they died behind bars?\n \n Yes.", 
   {}, 
   268325, 
   null, 
   1181797680.0
  ], 
  [
   268636, 
   null, 
   "Another opinion", 
   "Name 5 and provide the links.\n\n Here is a link about people who were released prior to the death penalty due to being shown to be innocent (124 people since 1973). It also lists at least seven people who were executed despite strong doubts about their guilt. Of course, it is difficult to officially prove innocence after death since there are no criminal court proceedings for the dead.\n \n http://www.deathpenaltyinfo.org/article.php?did=412&scid=6", 
   {}, 
   268071, 
   null, 
   1181837400.0
  ], 
  [
   268638, 
   null, 
   "Another opinion", 
   "There is an important point that hasn't been made here yet.\n \n Namely, even if a particular punishment can be proven to reduce certain types of crimes, the punishment itself still has to be analyzed for the morality / ethics of its use. Reducing crime is not a sufficient reason to install a particular punishment. After all, in some repressive countries of this world (ex. in Saudi Arabia), people have their hands cut off if they steal. Certainly, that would reduce the amount of theft, but does that make the punishment right and moral? The bottom line is that reduction of crime (which still has yet to be fully proven for the death penalty) is not enough - the punishment has to be judged on its own merits and morality.", 
   {}, 
   268636, 
   null, 
   1181838240.0
  ], 
  [
   268639, 
   null, 
   "Another opinion", 
   "Is one too many people wrongfully convicted and sent to life in prison where they died behind bars?\n\n At least with life in prison, they have the maximum chance of being proven innocent. You can't give them any more time for proving their innocence than their natural lifetime. With the death penalty, you cut short that chance.", 
   {}, 
   268325, 
   null, 
   1181838480.0
  ], 
  [
   268715, 
   null, 
   "obvious_child", 
   "just bumping this because it seems to have been overlooked...\n\n \n And perhaps you have overlooked the issue of abortion relating to crime. Who knows if were actually aborting future murderers? Aren't you for crime prevention?", 
   {}, 
   268385, 
   null, 
   1181856180.0
  ], 
  [
   268952, 
   null, 
   "snakespit", 
   "There is an important point that hasn't been made here yet.\n \n Namely, even if a particular punishment can be proven to reduce certain types of crimes, the punishment itself still has to be analyzed for the morality / ethics of its use. Reducing crime is not a sufficient reason to install a particular punishment. After all, in some repressive countries of this world (ex. in Saudi Arabia), people have their hands cut off if they steal. Certainly, that would reduce the amount of theft, but does that make the punishment right and moral? The bottom line is that reduction of crime (which still has yet to be fully proven for the death penalty) is not enough - the punishment has to be judged on its own merits and morality.\n\n \n I would say that it has. It seems that there is still a majority in this country who is for the death penalty. Just because you do not agree with the penalty and do not find it to be a moral act does not mean that those of us who support it have not weighed the morality of the issue. Until majority opinion changes, I suspect the death penalty will continue to exist. I give it about 20 more years, as our country slides a little farther left each year.", 
   {}, 
   268638, 
   null, 
   1181949720.0
  ], 
  [
   268954, 
   null, 
   "JPSartre12", 
   "Wait, so lemme get this straight. You think that we should cherish every single embryo out there even if it means denying a woman a right to her own body, but you have no trouble executing people that actually exist? Wow, you conservatives are very intelligent thinkers. How can I deny your impeccable logic?\n\n \n You can't. Do you not understand the difference between punishing the guilty and not punishing the innocent? emoticon_confused", 
   {}, 
   268285, 
   null, 
   1181950800.0
  ], 
  [
   268961, 
   null, 
   "snakespit", 
   "Here is a link about people who were released prior to the death penalty due to being shown to be innocent (124 people since 1973). It also lists at least seven people who were executed despite strong doubts about their guilt. Of course, it is difficult to officially prove innocence after death since there are no criminal court proceedings for the dead.\n \n http://www.deathpenaltyinfo.org/article.php?did=412&scid=6\n\n \n So again, this points to the fact that the appeals system is effective at preventing \"innocent\" people from being executed? I had asked for 5 examples of innocent people who were executed. Chemist99a stated that \"we execute too many innocent people\". Someone has yet to give me 5 examples of innocents that we have executed. \n \n And by the way: The information about the seven \"potentially innocent\" people that have been executed is quite laughable in some cases.", 
   {}, 
   268636, 
   null, 
   1181952840.0
  ], 
  [
   269958, 
   null, 
   "Another opinion", 
   "So again, this points to the fact that the appeals system is effective at preventing \"innocent\" people from being executed? I had asked for 5 examples of innocent people who were executed. Chemist99a stated that \"we execute too many innocent people\". Someone has yet to give me 5 examples of innocents that we have executed. \n \n And by the way: The information about the seven \"potentially innocent\" people that have been executed is quite laughable in some cases.\n\n The web site which I referenced did site those eight cases that were executed despite strong doubts about their guilt. What specifically makes you think some of those cases are laughable? Also, what proof of innocence would be sufficient for you? Do you claim that there are trials for the dead that can officially determine innocence after execution? I have heard of no such trial.\n \n Also, if I remember correctly, I believe you were in favor of executing almost immediately after sentence - which would have left those 124 innocent people dead (~10% of those executed, as I remember).", 
   {}, 
   268961, 
   null, 
   1182463740.0
  ], 
  [
   269969, 
   null, 
   "Another opinion", 
   "I would say that it has. It seems that there is still a majority in this country who is for the death penalty. Just because you do not agree with the penalty and do not find it to be a moral act does not mean that those of us who support it have not weighed the morality of the issue. Until majority opinion changes, I suspect the death penalty will continue to exist. I give it about 20 more years, as our country slides a little farther left each year.\n\n My main objection against the death penalty is that the major reason which I hear coming out of supporters is basically the desire for state sponsored vengeance. The reasons given most often for supporting the death penalty are emotional reasons of retribution for the heinous acts of the criminal. I continue to feel very uncomfortable basing a system of morality on vengeance.", 
   {}, 
   268952, 
   null, 
   1182468360.0
  ], 
  [
   270012, 
   null, 
   "snakespit", 
   "The web site which I referenced did site those eight cases that were executed despite strong doubts about their guilt. What specifically makes you think some of those cases are laughable? Also, what proof of innocence would be sufficient for you? Do you claim that there are trials for the dead that can officially determine innocence after execution? I have heard of no such trial.\n\n The DPIC is also a strongly biased anti-death penalty site. And yes, I saw the 8 \"executed but possibly innocent\", however I have still not been given 5 examples of innocents executed. \n \n And no, I do not claim that there are trials that can determine innocence after execution...we hold those while they are alive, and before they are sentenced to death. In the absense of being able to examine all evidence, and hear all testimony in a death case, I am forced to defer to the decision of the jury who was presented with all the evidence and heard all of the testimony. I don't sit back and try to Monday morning QB death cases when I don't have all the facts. \n \n \nAlso, if I remember correctly, I believe you were in favor of executing almost immediately after sentence - which would have left those 124 innocent people dead (~10% of those executed, as I remember).\n\n \n \n3. Eliminate the rediculous appeals that have no new evidence lending to the innocence of the convicted. This only serves to delay the just and prescribed punishment, and wastes taxpayer money. \n \n 4. Anyone awarded a second trial who is found guilty a second time should be executed the same day as the verdict.\n\n \n Is that what you are referring to?", 
   {}, 
   269958, 
   null, 
   1182476460.0
  ], 
  [
   270014, 
   null, 
   "snakespit", 
   "My main objection against the death penalty is that the major reason which I hear coming out of supporters is basically the desire for state sponsored vengeance. The reasons given most often for supporting the death penalty are emotional reasons of retribution for the heinous acts of the criminal. I continue to feel very uncomfortable basing a system of morality on vengeance.\n\n \n How nice for you. \n \n I look at it as punishment, not vengeance. And as for everyone's reasons for or against the death penalty...I could care less. I like to...wait for it...THINK FOR MYSELF, and I personally have no moral objection to punishing someone, even if that punishment is death.", 
   {}, 
   269969, 
   null, 
   1182477240.0
  ], 
  [
   270016, 
   null, 
   "Nwarth", 
   "My major complaint against the death penalty is that it is quite permanent. If later exculpatory evidence comes out... there is no reversing the punishment.", 
   {}, 
   270014, 
   null, 
   1182478140.0
  ], 
  [
   270092, 
   null, 
   "Another opinion", 
   "The DPIC is also a strongly biased anti-death penalty site. And yes, I saw the 8 \"executed but possibly innocent\", however I have still not been given 5 examples of innocents executed. \n \n And no, I do not claim that there are trials that can determine innocence after execution...we hold those while they are alive, and before they are sentenced to death. In the absense of being able to examine all evidence, and hear all testimony in a death case, I am forced to defer to the decision of the jury who was presented with all the evidence and heard all of the testimony. I don't sit back and try to Monday morning QB death cases when I don't have all the facts. \n\n I still don't see how you can be convinced that someone who was executed was innocent. You apparently only trust the judgement of the jury yet admit that there are no trials that can determine innocence after execution. Obviously, if someone were found innocent before execution, they would not be executed. Really, what evidence are you looking for and, once again, what is it that you don't find reasonable in the arguements presented for those eight cases in the web site that I referenced. Is it that you automatically distrust everything in that web site because it is anti-death penalty?\n \nIs that what you are referring to?\n\n I thought you had put a harsher condition in another thread, but I don't have time to look for it. This will have to do for now.", 
   {}, 
   270012, 
   null, 
   1182528000.0
  ], 
  [
   270095, 
   null, 
   "Another opinion", 
   "How nice for you. \n \n I look at it as punishment, not vengeance. And as for everyone's reasons for or against the death penalty...I could care less. I like to...wait for it...THINK FOR MYSELF, and I personally have no moral objection to punishing someone, even if that punishment is death.\n\n I remember an earlier discussion we had in another thread where you thought that vengeance is only relevant if it is the victim or people who know the victim that are exacting retribution. So, much of our disagreement was on the definition of what we labelled as vengeance. Do you disagree, though, that it is mainly retribution that you are looking for in supporting the death penalty?", 
   {}, 
   270014, 
   null, 
   1182528600.0
  ], 
  [
   270129, 
   null, 
   "snakespit", 
   "I still don't see how you can be convinced that someone who was executed was innocent. You apparently only trust the judgement of the jury yet admit that there are no trials that can determine innocence after execution. Obviously, if someone were found innocent before execution, they would not be executed.\n\n I trust the jury, and the trial / appeals process that we use prior to execution (although the appeals process needs some streamlining). Why do we need trials after execution? Why do I need to be convinced at all? Why do I need to search for evidence of their innocence? \n \n If they were convicted in a courtof law by a jury of their peers, so be it. They get a fair appeals process, and in most cases (unless you are in Texas or Florida) stand little chance of being executed any time soon anyway. Even in Texas the average time on death row is 10.26 years. If you can't get it together and cast some doubt on your conviction in that amount of time...too bad. \n \n \n \n Really, what evidence are you looking for and, once again, what is it that you don't find reasonable in the arguements presented for those eight cases in the web site that I referenced. Is it that you automatically distrust everything in that web site because it is anti-death penalty\n\n Well, I don't distrust everything that I see on the DPIC website. I do however realize that with their anti-capitol punishment agenda that they tend to only present information and facts that coincide with their agenda, rather than those that go against them.\n \n And what is it that I find laughable about some of the cases presented? Take the case of Cameron Willingham. Now listen, I'm sure that the Chicago Tribune has a well educated and experienced staff of criminal investigators and arson investigators, but I think I will stick with the boots on the ground. For the right amount of money, you can find people to say anything that you want them to say, just look at the Terri Schiavo case. Just because the Chicago Tribune finds some \"expert\" in the field of arson investigation who examines paper evidence and says their may be cause for doubt does not mean that the man was innocent. The evidence was enough to convince a jury, and every court of appeals that it was presented to. I am comfortable with that. \n \n \n \nDate of Execution: \n April 26, 2007 \n Offender: \n Dickson, Ryan \n Last Statement: \n Yes, Sir I do. I'd like to say I love my mother, brother, sister, grandmother, cousins, and nieces, and my brothers and sisters I have never met. I do apologize to the Surace family. I am responsible for them losing their mother, their father, and their grandmother. I never meant for them to be taken. I am sorry for what I did and I take responsibility for what I did. That is all Warden. \n\n http://www.tdcj.state.tx.us/stat/dicksonryanlast.htm\n Since many people seem concerned about innocent people being put to death, would anyone hear have a problem executing this one?", 
   {}, 
   270092, 
   null, 
   1182536520.0
  ], 
  [
   271033, 
   null, 
   "snakespit", 
   "Do you disagree, though, that it is mainly retribution that you are looking for in supporting the death penalty?\n\n Yes...I do.", 
   {}, 
   270095, 
   null, 
   1182897240.0
  ], 
  [
   271326, 
   null, 
   "Winston Smith", 
   "I trust the jury, and the trial / appeals process that we use prior to execution (although the appeals process needs some streamlining). Why do we need trials after execution? Why do I need to be convinced at all? Why do I need to search for evidence of their innocence? \n \n If they were convicted in a courtof law by a jury of their peers, so be it. They get a fair appeals process, and in most cases (unless you are in Texas or Florida) stand little chance of being executed any time soon anyway. Even in Texas the average time on death row is 10.26 years. If you can't get it together and cast some doubt on your conviction in that amount of time...too bad. \n \n \n \n Well, I don't distrust everything that I see on the DPIC website. I do however realize that with their anti-capitol punishment agenda that they tend to only present information and facts that coincide with their agenda, rather than those that go against them.\n \n And what is it that I find laughable about some of the cases presented? Take the case of Cameron Willingham. Now listen, I'm sure that the Chicago Tribune has a well educated and experienced staff of criminal investigators and arson investigators, but I think I will stick with the boots on the ground. For the right amount of money, you can find people to say anything that you want them to say, just look at the Terri Schiavo case. Just because the Chicago Tribune finds some \"expert\" in the field of arson investigation who examines paper evidence and says their may be cause for doubt does not mean that the man was innocent. The evidence was enough to convince a jury, and every court of appeals that it was presented to. I am comfortable with that. \n \n \n \n http://www.tdcj.state.tx.us/stat/dicksonryanlast.htm\n Since many people seem concerned about innocent people being put to death, would anyone hear have a problem executing this one?\n\n \n Yes! Murder is murder and those who execute the death penalty are murderers as well.\n \n Not because it is state approved murder is moral.\n \n THOU SHALL NOT KILL", 
   {}, 
   270129, 
   null, 
   1183021380.0
  ], 
  [
   271481, 
   null, 
   "JPSartre12", 
   "Yes! Murder is murder and those who execute the death penalty are murderers as well.\n \n Not because it is state approved murder is moral.\n \n THOU SHALL NOT KILL\n\n \n Get yourself a newer Bible. It says \"Thou shall not commit murder\".emoticon_xkill", 
   {}, 
   271326, 
   null, 
   1183075500.0
  ], 
  [
   271490, 
   null, 
   "Winston Smith", 
   "Thanks! \n Execution of prisoners is murder, state sanctioned murder\n \n murder: to intentionally kill a person", 
   {}, 
   271481, 
   null, 
   1183081320.0
  ], 
  [
   271504, 
   null, 
   "JPSartre12", 
   "Thanks! \n Execution of prisoners is murder, state sanctioned murder\n \n murder: to intentionally kill a person\n\n \n That's YOUR interpretation. Is every dead soldier in a war a murder victim whose killer should be prosecuted?", 
   {}, 
   271490, 
   null, 
   1183087800.0
  ], 
  [
   271526, 
   null, 
   "snakespit", 
   "Get yourself a newer Bible. It says \"Thou shall not commit murder\".emoticon_xkill\n\n \n Isn't it funny how it changes from 'thou shall not kill' to 'thou shall not commit murder' depending on the argument?", 
   {}, 
   271481, 
   null, 
   1183106940.0
  ], 
  [
   271529, 
   null, 
   "peteratwar", 
   "Thanks! \n Execution of prisoners is murder, state sanctioned murder\n \n murder: to intentionally kill a person\n\n \n \n substitute or add 'Unlawfully' where you have put 'intentionally' then you might be more accurate and therefore make your first sentence irrelevant", 
   {}, 
   271490, 
   null, 
   1183108800.0
  ], 
  [
   271560, 
   null, 
   "JPSartre12", 
   "Isn't it funny how it changes from 'thou shall not kill' to 'thou shall not commit murder' depending on the argument?\n\n \n It's necessary when disengenuous people quote the Bible out of context to support their own agendas. :xcensored", 
   {}, 
   271526, 
   null, 
   1183126440.0
  ], 
  [
   280724, 
   null, 
   "Shooterandproud", 
   "So let me get this straight, you would violate a womans civil rights to save a fertilized egg, but have no problem killing real people? Wow.", 
   {}, 
   268348, 
   null, 
   1188156060.0
  ], 
  [
   281105, 
   null, 
   "thecap0", 
   "snakespit,\n \n Yes...I do.\n \n I do also!", 
   {
    "post_info": {
     "post_title": "Life is too short to live it in Texas!"
    }
   }, 
   280724, 
   null, 
   1188273720.0
  ], 
  [
   281322, 
   null, 
   "Winston Smith", 
   "substitute or add 'Unlawfully' where you have put 'intentionally' then you might be more accurate and therefore make your first sentence irrelevant\n\n \n execution of prisoners is lawful murder but murder nevertheless", 
   {}, 
   271529, 
   null, 
   1188357240.0
  ], 
  [
   281392, 
   null, 
   "peteratwar", 
   "execution of prisoners is lawful murder but murder nevertheless\n\n \n No, murder is UNLAWFUL killing. Execution is lawful killing.", 
   {}, 
   281322, 
   null, 
   1188397980.0
  ], 
  [
   281623, 
   null, 
   "Winston Smith", 
   "murder \n noun [C or U] \n the crime of intentionally killing a person:\n \n (Cambridge Dictionary)\n \n to execute a prisoner is murder, for it is an intentional killing. It is State sanctioned murder. They make it legal that's all.", 
   {}, 
   281392, 
   null, 
   1188526020.0
  ], 
  [
   281655, 
   null, 
   "Axolotl", 
   "Last I read, the death penalty was not considered an effective deterrant. I think that is mainstream accepted position on the issue.\n \n I'm kind of borderline myself, thinking of some of the worst crimes, and victims' families, but swing decidedly towards getting rid of it. It just doesn't work the way it's supposed to. In order to have a democratic society, we need the appeals process that exists. But that same process is tortuous to both victims and offenders. Better for both sides to have closure. Also, even the appeals process doesn't *out the truth* the way it always should. The system is imperfect. Even cursed as a bureaucratic and unfair mess. So I think getting rid of the death penalty is a more humble position. It acknowledges that our knowledge of life, death and judgement belongs to eyes we do not possess.\n \n Finally, there is the globalization matter. How can we tell, say, an Islamic theocracy not to execute our children or theirs, when we don't follow such laws ourselves?\n \n I think getting rid of the death penalty helps move the entire planet towards a more humane vision for living, and probably, our own violent society as well.", 
   {}, 
   268382, 
   null, 
   1188543660.0
  ], 
  [
   281657, 
   null, 
   "Axolotl", 
   "In a way, I think the death penalty is our own abdication of responsibility as a society. When we don't execute people, we acknowledge that their existence, as criminals, is due in respects to our failures to solve certain problems.\n \n Is it really justice to execute some sick soul like the young man who killed so many of his classmates at Virginia Tech?\n \n What created such monstrous behavior?\n \n Maybe we get rid of such people, not because we seek justice, not because we care about the victims and their families, but because we don't want the answers to such questions.\n \n Dead men don't talk.", 
   {}, 
   281655, 
   null, 
   1188547680.0
  ], 
  [
   281658, 
   null, 
   "Axolotl", 
   "How do people honestly feel about the fact that this criminal took his own life at the end?\n \n My guess is that his suicide makes sense to many, but for me, frankly, I feel RELIEVED. We've been spared, we don't have to REALLY deal with him, and surely, in some way, he knew this when he took his own life. He was doing us the favor we, America, wanted ... which was not to deal with him at all.\n \n So, instead, we can listen to media pundits elaborate on the mysteries of why students execute large numbers of peers in America. And argue about who we can safely blame (besides ourselves) since he's no longer around.\n \n We can pretend we care about why these things happen. We can pretend we want to know WHY.\n \n But we don't.", 
   {}, 
   281392, 
   null, 
   1188548940.0
  ], 
  [
   281691, 
   null, 
   "Steeeeve", 
   "murder \n noun [C or U] \n the crime of intentionally killing a person:\n \n (Cambridge Dictionary)\n \n to execute a prisoner is murder, for it is an intentional killing. It is State sanctioned murder. They make it legal that's all.\n\n \n By that definition if it is legal then it is not murder. Notice it says \"the crime\".", 
   {}, 
   281623, 
   null, 
   1188579840.0
  ], 
  [
   281774, 
   null, 
   "samiinh", 
   "Most murders are crimes of passion and not pre-mediated. How does the death penalty deter these crimes?", 
   {}, 
   281691, 
   null, 
   1188655860.0
  ], 
  [
   282431, 
   null, 
   "richbrmly", 
   "I have no problem with taking the life of someone that will harm people in the future. I don't look at it as punishment. I look at it as self defense. A person that harms people can't be placed with other people, that would be far more criminal than killing them.\n \n If people are in prison to change. Placing a killing machine in with them would be nuts. There are people that enjoy hurting people. Their living is a direct threat to us and the ones we love. Defense is NEVER a crime.", 
   {}, 
   281392, 
   null, 
   1189044540.0
  ], 
  [
   283966, 
   null, 
   "Winston Smith", 
   "How can you predict the future? what if you get your head examined and some shrink decides that you are a potential killer and puts you in jail and you end up executed?\n \n It doesn't sound like self defense it sounds more like fascism to me.", 
   {}, 
   282431, 
   null, 
   1189864140.0
  ], 
  [
   283968, 
   null, 
   "Winston Smith", 
   "Most murders are crimes of passion and not pre-mediated. How does the death penalty deter these crimes?\n\n \n punishment only deters those who never would commit a crime in the first place.\n \n I worked for years with a guy who was quiet and never argued with anybody and who in a fit of passion killed his wife lover.\n \n who could have predicted he would snap one day?", 
   {}, 
   281774, 
   null, 
   1189864320.0
  ], 
  [
   283970, 
   null, 
   "Winston Smith", 
   "How do people honestly feel about the fact that this criminal took his own life at the end?\n \n My guess is that his suicide makes sense to many, but for me, frankly, I feel RELIEVED. We've been spared, we don't have to REALLY deal with him, and surely, in some way, he knew this when he took his own life. He was doing us the favor we, America, wanted ... which was not to deal with him at all.\n \n So, instead, we can listen to media pundits elaborate on the mysteries of why students execute large numbers of peers in America. And argue about who we can safely blame (besides ourselves) since he's no longer around.\n \n We can pretend we care about why these things happen. We can pretend we want to know WHY.\n \n But we don't.\n\n \n and if you cared what difference would it make?", 
   {}, 
   281658, 
   null, 
   1189864380.0
  ], 
  [
   283973, 
   null, 
   "Winston Smith", 
   "By that definition if it is legal then it is not murder. Notice it says \"the crime\".\n\n \n \n murder is intentional killing whether it is legal or not it is irrelevant, for it is the intention that counts, not the perprator.\n \n What if a State murders millions of people as during the Holocaust, is it legal?\n \n if yes then why after the war the authors were also executed (murdered) by the occupying powers?\n \n why? because there is a moral law that says that murder is murder whether it is state sanctioned or not.\n \n Technicalities will not save your a-s-s when the day of reckonning comes", 
   {}, 
   281691, 
   null, 
   1189864740.0
  ], 
  [
   283996, 
   null, 
   "E Mutz", 
   "murder \n noun [C or U] \n the crime of intentionally killing a person:\n \n (Cambridge Dictionary)\n \n to execute a prisoner is murder, for it is an intentional killing. It is State sanctioned murder. They make it legal that's all.\n\n \n Merriam Webster disagrees with Cambridge:\n \n 1 : the crime of unlawfully killing a person especially with malice aforethought\n \n As does Dictionary.com:\n \n 1. Law. the killing of another human being under conditions specifically covered in law. In the U.S., special statutory definitions include murder committed with malice aforethought, characterized by deliberation or premeditation or occurring during the commission of another serious crime, as robbery or arson (first-degree murder), and murder by intent but without deliberation or premeditation (second-degree murder). \n \n As does American Heritage Dictionary:\n \n The unlawful killing of one human by another, especially with premeditated malice. \n \n Interesingly, Cambridge Dictionary describes a murderer as\n \n someone who illegally and intentionally kills another person\n \n Since no one but a murderer can commit murder, it would necessarily follow that Cambridge Dictionary agrees with the other cited sources that murder is intentional and unlawful. \n \n \n What if a State murders millions of people as during the Holocaust, is it legal?\n \n No, because murder is, by definition, illegal. \n \n \n if yes then why after the war the authors were also executed (murdered) by the occupying powers?\n \n See above\n \n \n why? because there is a moral law that says that murder is murder whether it is state sanctioned or not.\n \n Using the same logic I could claim that robbery is robbery whether it is state sanctioned or not to avoid paying taxes. Precisely whose absolute moral truth do you claim? That of Islam which advocates the death of the infidel, or the Bible which justifies death for various crimes? Or do you possess your own set of golden tablets which allows you to decide issues on the basis or morality versus legality?\n \n \n Technicalities will not save your a-s-s when the day of reckonning comes\n \n Only if you come before Winston Smith in the afterlife. The odds are pretty good for those of other faiths.", 
   {}, 
   281623, 
   null, 
   1189878300.0
  ], 
  [
   284053, 
   null, 
   "Winston Smith", 
   "It is correct that other dictionaries define murder as: The unlawful killing of one human by another, especially with premeditated malice. The unlawful killing of one human by another, especially with premeditated malice. The unlawful killing of one human by another, especially with premeditated malice.\n \n But you missed the point and the point is that what is legal today can be illegal tomorrow due to a change in circumstances such as in the case of the defeat of Germany and subsequent occupation by the Allies. What was lawful killing one day became murder tomorrow.\n \n The only difference in killing by the state and killing by an individual is that the State killing is that one can not be punished and the other can.\n \n However if there is God both in my opinion are contrary to His moral law and that moral law speaks to us thru our conscience.\n \n Semantics and legal technicalities can not hide the crime and the State's crime is the most heinous for it is committed in cold blood and sometimes decades after the convicted man was imprisoned this constitutes in my view cruel and unfair punishment.", 
   {
    "unicode_changes_made": true
   }, 
   283996, 
   null, 
   1189913820.0
  ], 
  [
   284137, 
   null, 
   "VTCruiser", 
   "if you had a brother in the military and a muslim chopped off his head with and axe by cutting it like he would a steak...... would that muslim be deserving of the death penalty??", 
   {}, 
   284053, 
   null, 
   1189959840.0
  ], 
  [
   284157, 
   null, 
   "ShadowPikachu", 
   "if you had a brother in the military and a muslim chopped off his head with and axe by cutting it like he would a steak...... would that muslim be deserving of the death penalty??\n\n \n If a muslim had a brother in a city, and a soldier shot him dead for \"looking suspicious\", would that soldier be deserving of the death penalty? emoticon_rolleyes", 
   {}, 
   284137, 
   null, 
   1189965660.0
  ], 
  [
   284179, 
   null, 
   "E Mutz", 
   "It is correct that other dictionaries define murder as: The unlawful killing of one human by another, especially with premeditated malice. The unlawful killing of one human by another, especially with premeditated malice. The unlawful killing of one human by another, especially with premeditated malice.\n \n But you missed the point and the point is that what is legal today can be illegal tomorrow due to a change in circumstances such as in the case of the defeat of Germany and subsequent occupation by the Allies. What was lawful killing one day became murder tomorrow.\n \n The only difference in killing by the state and killing by an individual is that the State killing is that one can not be punished and the other can.\n \n However if there is God both in my opinion are contrary to His moral law and that moral law speaks to us thru our conscience.\n \n Semantics and legal technicalities can not hide the crime and the State's crime is the most heinous for it is committed in cold blood and sometimes decades after the convicted man was imprisoned this constitutes in my view cruel and unfair punishment.\n\n \n The moral law, speaking through my conscience has no problem with the death penalty. So presumably, God is telling us two separate things? Is your God right or is mine? How about Joe's God speaking through his conscience? What was God telling the axe murderer? Morality is individual and separate from legality. Eating pork is perfectly legal for all members of society and moral for the vast majority. For those strict adherants to Orthodoxy, the eating of pork is immoral. I would not have you use your morality to deprive me of bacon any more than I would allow your morality to serve as a litmus test to what is just for our society.\n \n It is precisely because the moral law is subject to change that we have laws. What was immoral yesterday is moral today, and vice versa. A societies laws represent its collective view of what is right and what is wrong based upon the needs of the society and the individual. As such, there is nothing inherently immoral about deleting a member of society who has killed others. You remove the disease from the body politic.", 
   {
    "unicode_changes_made": true
   }, 
   284053, 
   null, 
   1189977960.0
  ], 
  [
   284215, 
   null, 
   "Winston Smith", 
   "My conscience says that it the death penalty is immoral. To eat or not eat pork has nothing to do with morality it is just a human stricture.", 
   {}, 
   284179, 
   null, 
   1190002500.0
  ], 
  [
   284227, 
   null, 
   "peteratwar", 
   "Winston, your conscience is yours to cherish and love.\n \n It does not necessarily agree with everyone else.\n \n \n If you kill someone unlawfully that is murder.\n \n If you execute someone, that is in accordance with the law hence not illegal and so not a crime hence not murder.\n \n Holocaust comes under genocide", 
   {}, 
   284215, 
   null, 
   1190023620.0
  ], 
  [
   284230, 
   null, 
   "chemist99a", 
   "At one time the death penalty made sense and was in that respect moral. Today it makes no sense and is in that respect immoral.", 
   {}, 
   284227, 
   null, 
   1190025540.0
  ], 
  [
   284231, 
   null, 
   "chemist99a", 
   "Problem is, everyone keeps talking about all of these innocent people that we have put to death, yet coming up with concrete examples seems to be a bit of a problem. Where is this massive horde of innocent people that have been put to death?\n\n \n http://www.innocenceproject.org/\n \n Will provide some indication to you of the error rates involved in convictions of people for crimes. Some of these are in fact for murder and some of those were for death sentences. You might read the current case they are working on in which they are about to test a hair for DNA to determine whether an person executed for murder was innocent or not. \n \n And if you want to see how the system can abusively treat people read John Grishams \"An Innocent Man\".", 
   {}, 
   268348, 
   null, 
   1190026080.0
  ], 
  [
   284232, 
   null, 
   "peteratwar", 
   "At one time the death penalty made sense and was in that respect moral. Today it makes no sense and is in that respect immoral.\n\n \n Don't see the connections here. What is the 'no sense' ? and even if so why does that make it immoral ?", 
   {}, 
   284230, 
   null, 
   1190026620.0
  ], 
  [
   284242, 
   null, 
   "Winston Smith", 
   "Winston, your conscience is yours to cherish and love.\n \n It does not necessarily agree with everyone else.\n \n \n If you kill someone unlawfully that is murder.\n \n If you execute someone, that is in accordance with the law hence not illegal and so not a crime hence not murder.\n \n Holocaust comes under genocide\n\n \n The Holocaust was legal under the Nazis, if Germany would have won the war, it would be still be legal and according to you not murder.\n \n The SS also executed prisoners of war, was that murder or not? Remember it was legal.", 
   {}, 
   284227, 
   null, 
   1190032260.0
  ], 
  [
   284243, 
   null, 
   "Winston Smith", 
   "Don't see the connections here. What is the 'no sense' ? and even if so why does that make it immoral ?\n\n \n \n to execute somebody makes sense to you? then you are on the side of all murderers for I am sure to murder someone makes sense to them, otherwise why would they do it?\n \n so what is your excuse to legally kill somebody?", 
   {}, 
   284232, 
   null, 
   1190032800.0
  ], 
  [
   284244, 
   null, 
   "peteratwar", 
   "Winston\n \n You are perfectly correct.\n \n However they didn't win the war.", 
   {}, 
   284242, 
   null, 
   1190032800.0
  ], 
  [
   284245, 
   null, 
   "peteratwar", 
   "to execute somebody makes sense to you? then you are on the side of all murderers for I am sure to murder someone makes sense to them, otherwise why would they do it?\n \n so what is your excuse to legally kill somebody?\n\n \n Self protection", 
   {}, 
   284243, 
   null, 
   1190032860.0
  ], 
  [
   284287, 
   null, 
   "JPSartre12", 
   "At one time the death penalty made sense and was in that respect moral. Today it makes no sense and is in that respect immoral.\n\n \n It makes MORE sense now that one sentenced to life in prison almost never serves his whole sentence and recidivism rates are very high amongst criminals.", 
   {}, 
   284230, 
   null, 
   1190054400.0
  ], 
  [
   284298, 
   null, 
   "chemist99a", 
   "It makes MORE sense now that one sentenced to life in prison almost never serves his whole sentence and recidivism rates are very high amongst criminals.\n\n \n Yes many criminals revert to their previous behaviors when released. However you must narrow your focus here to people convicted of capital crimes. Do you know the recidivism rates for that select group?", 
   {}, 
   284287, 
   null, 
   1190056380.0
  ], 
  [
   284303, 
   null, 
   "JPSartre12", 
   "Yes many criminals revert to their previous behaviors when released. However you must narrow your focus here to people convicted of capital crimes. Do you know the recidivism rates for that select group?\n\n \n It really doesn't matter. The reality is that the person is taking up space in a prison that could be used to house another criminal. But since he's there, the other criminal gets an \"early out\" and he's likely to commit more crimes. In reality, prison population is a zero sum game because nobody wants a new prison in their back yard (NIMBY principle). So, to incarcerate one, you have to let one out. If you're housing a lot of death row inmates, they can't house other criminals, so some are getting released too early and committing more crimes.", 
   {}, 
   284298, 
   null, 
   1190056740.0
  ], 
  [
   284317, 
   null, 
   "samiinh", 
   "It makes MORE sense now that one sentenced to life in prison almost never serves his whole sentence and recidivism rates are very high amongst criminals.\n\n \n Why am I not surprised that someone who is anti-choice person would also support the death penalty, even though there is no evidence that the DP deters any crime. What a joke you rightwingers are. Culture of Life, my XXX.", 
   {}, 
   284287, 
   null, 
   1190062320.0
  ], 
  [
   284319, 
   null, 
   "chemist99a", 
   "It really doesn't matter. The reality is that the person is taking up space in a prison that could be used to house another criminal. But since he's there, the other criminal gets an \"early out\" and he's likely to commit more crimes. In reality, prison population is a zero sum game because nobody wants a new prison in their back yard (NIMBY principle). So, to incarcerate one, you have to let one out. If you're housing a lot of death row inmates, they can't house other criminals, so some are getting released too early and committing more crimes.\n\n \n Well lets see - we have had about 70 executions in the last few years, people held on death row. Facilities which are generally NOT used for the general prison populations. But you dodged the actual issue. You argued that because of the high rate of recidivism among criminals in general that life sentences (which might not be served in full) for capital crimes were inappropriate. But of course what you did not quote is the actual recividism rate for those specific types of criminals its vital you quote the correct rates you realize its very possible that murders are a lot less likely to repeat their crimes than say drug addicts or drug dealers!!! You should not compare apples and organges.", 
   {}, 
   284317, 
   null, 
   1190062980.0
  ], 
  [
   284350, 
   null, 
   "Winston Smith", 
   "Self protection\n\n \n how can a person behind bars present a threat to you?\n \n to execute a prisoner is just revenge enacted by the State on behalf of the people so that the people do not get blood in their hands.\n \n It is not justice it is not self defence, but simply a savage crime no matter what words you use or technicalities you hide behind", 
   {}, 
   284245, 
   null, 
   1190072220.0
  ], 
  [
   284351, 
   null, 
   "Winston Smith", 
   "Winston\n \n You are perfectly correct.\n \n However they didn't win the war.\n\n \n \n So because Germany lost the war, the Holocaust is a crime, but if it had won you would consider it OK?\n Do you have any sense of morality of what is wrong and what is right?", 
   {}, 
   284244, 
   null, 
   1190072460.0
  ], 
  [
   284394, 
   null, 
   "peteratwar", 
   "So because Germany lost the war, the Holocaust is a crime, but if it had won you would consider it OK?\n Do you have any sense of morality of what is wrong and what is right?\n\n \n \n Legality and morals are not the same thing'\n \n Yes if Germany had won the war the Holocaust would have been legal according to the laws they would have been implementing.\n \n Of course it was wholly immoral by most people's standards and that stance was enforced by the fact that the Allies won the war and enshrining their standards of morality as being the law. Quite correctly in my view.\n \n However in the terms of the universe as opposed to humankind on this planet morality is not an absolute.", 
   {}, 
   284351, 
   null, 
   1190107500.0
  ], 
  [
   284517, 
   null, 
   "JPSartre12", 
   "Why am I not surprised that someone who is anti-choice person would also support the death penalty, even though there is no evidence that the DP deters any crime. What a joke you rightwingers are. Culture of Life, my XXX.\n\n \n You really need to tone down your personal attacks. It's getting a little irritating.\n Now, that said, there's a world of difference between killing the innocent and killing the guilty. I am intelligent enough to know the difference. ;) \n \n \nWell lets see - we have had about 70 executions in the last few years, people held on death row. Facilities which are generally NOT used for the general prison populations. But you dodged the actual issue. You argued that because of the high rate of recidivism among criminals in general that life sentences (which might not be served in full) for capital crimes were inappropriate. But of course what you did not quote is the actual recividism rate for those specific types of criminals its vital you quote the correct rates you realize its very possible that murders are a lot less likely to repeat their crimes than say drug addicts or drug dealers!!! You should not compare apples and organges.\n\n I actually gave two reasons. 1. Lifers rarely serve their entire sentence. 2. Lifers that do take up space that could be used for other criminals, so they wouldn't be out on the street committing more crimes. \n \n \nhow can a person behind bars present a threat to you?\n \n to execute a prisoner is just revenge enacted by the State on behalf of the people so that the people do not get blood in their hands.\n \n It is not justice it is not self defence, but simply a savage crime no matter what words you use or technicalities you hide behind\n\n Prison guards, other inmates, etc., are all potential victims of lifers behind bars.", 
   {}, 
   284394, 
   null, 
   1190172180.0
  ], 
  [
   284519, 
   null, 
   "chemist99a", 
   "Prison guards, other inmates, etc., are all potential victims of lifers behind bars.\n\n \n And vice versa, but do you have any actual rates of assualts on gaurds by lifers as compared to say drug dealers in for 20years? Really I would like to see the numbers!", 
   {}, 
   284517, 
   null, 
   1190173200.0
  ], 
  [
   284729, 
   null, 
   "thecap0", 
   "jps,\n \n Now, that said, there's a world of difference between killing the innocent and killing the guilty. I am intelligent enough to know the difference. \n \n Then at least have the maturity to say that you are Pro-choice - as long as you get to choose who lives and who dies.:xbanghead", 
   {
    "post_info": {
     "post_title": "Life is too short to live in Tejas or in ignorance - but I repeat myself!"
    }
   }, 
   284519, 
   null, 
   1190327040.0
  ], 
  [
   288473, 
   null, 
   "snakespit", 
   "But of course what you did not quote is the actual recividism rate for those specific types of criminals its vital you quote the correct rates you realize its very possible that murders are a lot less likely to repeat their crimes than say drug addicts or drug dealers!!! You should not compare apples and organges.\n\n \n And drug dealers are non-violent offenders who operate on the consent of their \"victims\". Murderers are violent offenders who do not seek the consent of their victims. Talk about apples and oranges.\n \n Here at least is one correct statistic for you:\n \n Executed Violent Offender Recidivism Rate: 0.00%", 
   {}, 
   284319, 
   null, 
   1192983480.0
  ], 
  [
   288514, 
   null, 
   "thecap0", 
   "snakespit,\n \n Executed Violent Offender Recidivism Rate: 0.00%\n \n And unless the error rate for executing the possibly innocent is the same, the DP will continue to be an inhumane crapshoot.emoticon_idea", 
   {
    "post_info": {
     "post_title": "Life is too short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288473, 
   null, 
   1193009580.0
  ], 
  [
   288527, 
   null, 
   "snakespit", 
   "snakespit,\n \n Executed Violent Offender Recidivism Rate: 0.00%\n \n And unless the error rate for executing the possibly innocent is the same, the DP will continue to be an inhumane crapshoot.emoticon_idea\n\n \n But yet people trust the justice system enough to sentence people to life in prison with no chance of parole, and never think twice about it. It's this kind of hypocrisy that makes me doubt the motivations of the vast majority of the anti death penalty crowd. If the system is good enough to send someone to prison for life, it should be good enough to send them to death row. Otherwise, let's just open all the gates and let them go free. \n \n I asked before but nobody seemed to want to answer this...Who would have a problem executing this one...since there is no doubt regarding his guilt?", 
   {}, 
   288514, 
   null, 
   1193016420.0
  ], 
  [
   288567, 
   null, 
   "thecap0", 
   "snakespit,\n \n If the system is good enough to send someone to prison for life, it should be good enough to send them to death row. \n \n That's just dumb. As long as there is life in the prisoner, there is a chance that evidence will be brought to bear that will lead to that person's ultimate exoneration and freedom/ Once they are executed, it's too late.\n \n Are you willing to push the plunger on one who just might possibly have been convicted of a murder (s)he did not commit?\n \n If not, why should society take that risk? \n \n If you are, what does it say about you?\n \n Otherwise, let's just open all the gates and let them go free.\n \n That's even dumber. Care to try any other false choices?:xbanghead", 
   {
    "post_info": {
     "post_title": "Life is to short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288527, 
   null, 
   1193061600.0
  ], 
  [
   288569, 
   null, 
   "snakespit", 
   "That's just dumb. As long as there is life in the prisoner, there is a chance that evidence will be brought to bear that will lead to that person's ultimate exoneration and freedom/ Once they are executed, it's too late.\n\n I think it's about time you learn to use the quote feature. My point is that the anti-death crowd will stand up and scream to the heavens about the \"innocence\" of a condemned prisoner, but if that prisoners sentence was commuted to life in prison they would forget all about that prisoner. If that same prisoner had been given LWOP initially, nobody would know that prisoners name at all. Remember...even in a capitol case innocence or guilt is decided first...before the defendant is sentenced. \n \n \nAre you willing to push the plunger on one who just might possibly have been convicted of a murder (s)he did not commit?\n \n If not, why should society take that risk? \n \n If you are, what does it say about you?\n\n I would be willing to \"push the plunger\" on every single prisoner on death row today provided that they were found guilty in a court of law by a jury of their peers and were given their fair chance in the appellate system.", 
   {}, 
   288567, 
   null, 
   1193065620.0
  ], 
  [
   288575, 
   null, 
   "thecap0", 
   "My point is that the anti-death crowd will stand up and scream to the heavens about the \"innocence\" of a condemned prisoner, but if that prisoners sentence was commuted to life in prison they would forget all about that prisoner. \n \n I'll use the method of quotation that I prefer, thank you.\n Last time I checked, no one named you the net nanny.\n \n Nice to see you're still confused. An innocent person does not get her/his sentence commuted. silly child; that person is FREED because (s)he is as innocent as you, I, or OJ.emoticon_idea", 
   {
    "post_info": {
     "post_title": "Life is too short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288569, 
   null, 
   1193070000.0
  ], 
  [
   288577, 
   null, 
   "snakespit", 
   "Nice to see you're still confused. An innocent person does not get her/his sentence commuted. silly child; that person is FREED because (s)he is as innocent as you, I, or OJ.emoticon_idea\n\n \n I'm confused about nothing. You implied that I meant the person was innocent. I meant that the anti-crowd could give a hoot less about the innocence or guilt of someone serving life in prison, but place the same prisoner on death row and suddenly everyone is interested. \n \n Please refrain from calling me \"silly child\" or any other cute name you can think of.", 
   {}, 
   288575, 
   null, 
   1193070900.0
  ], 
  [
   288593, 
   null, 
   "thecap0", 
   "snake,\n \n You implied that I meant the person was innocent. I meant that the anti-crowd could give a hoot less about the innocence or guilt of someone serving life in prison, but place the same prisoner on death row and suddenly everyone is interested. \n \n \n That's just demonstrqably false. The Innocence Projectis just as concerned with freeijng wrongfully convicted people found \"guilty\" of other than capital crimes as it has been with those wrongfuly convicted of murder.\n Be that as it may, the questions still remain, \" Should society push the plunger on one whose guilt is not proved beyond not only beyond a reasonable doubt but beyond ALL doubt? Would you?\":xbanghead", 
   {
    "post_info": {
     "post_title": "Life is too short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288577, 
   null, 
   1193077380.0
  ], 
  [
   288646, 
   null, 
   "snakespit", 
   "Be that as it may, the questions still remain, \" Should society push the plunger on one whose guilt is not proved beyond not only beyond a reasonable doubt but beyond ALL doubt? Would you?\":xbanghead\n\n Beyond a reasonable doubt is the standard used in the US for criminal prosecution. \n \n There is a reason that the phrase includes the term \"reasonable doubt\". All doubt would be a rediculous standard that could not realistically be implemented into the US judicial system. I could look at someone and decide that he does not look like a killer...that would be doubt. If the standard burdon of proof is not enough for you, too bad. It's the system that is used in this country. \n \n As I said before, if they were convicted in a court of law by a jury of their peers and were given lawful access to the appellate process, yes, I would push the plunger. The jury has already decided the matter of guilt or innocence to the level required by law. The question is, would the convicted criminal's case get the same scrutiny if he were given LWOP vs. the death penalty? I doubt it.", 
   {}, 
   288593, 
   null, 
   1193110740.0
  ], 
  [
   288665, 
   null, 
   "thecap0", 
   "sspit,\n \n There is a reason that the phrase includes the term \"reasonable doubt\". All doubt would be a rediculous standard that could not realistically be implemented into the US judicial system. I could look at someone and decide that he does not look like a killer...that would be doubt. If the standard burdon (sic.) of proof is not enough for you, too bad. It's the system that is used in this country.\n \n NOT SO!!\n \n \"Beyond a reasonable doubt\" is the standard used for CONVICTION.\n \n If the state is going to take life, I think that the bar must be raised before it contemplates such an act.\n \n Do you really not believe that the standard for execution should be higher, in fact MUCH higher?\n \n BTW, your comments about LWOP are a strawman. The issue is capital punishment.\n \n Even so, the Innocence Project and others have worked to free many persons convicted and given non-capital sentences.\n \n Don't you find it passing strange that many states are fighting tooth and nail against the introduction of DNA evidence that has been is storage for many years?\n \n One wonders what they are hiding in the name of \"getting tough on crime\".emoticon_idea", 
   {
    "post_info": {
     "post_title": "Life is too short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288646, 
   null, 
   1193134860.0
  ], 
  [
   288730, 
   null, 
   "snakespit", 
   "If the state is going to take life, I think that the bar must be raised before it contemplates such an act.\n \n Do you really not believe that the standard for execution should be higher, in fact MUCH higher?\n\n What exactly then do you consider sufficient for the death penalty? I myself am comfortable with the current system. I've asked before, but apparently it needs to be asked again. Name 5 innocent people that have been put to death in the US. \n \n \nBTW, your comments about LWOP are a strawman. The issue is capital punishment.\n\n Not really. The same process is used to arrive at the verdict. The only difference is in the sentence. Are you sayng that to find someone guilty and sentence them to death should have a higher burden of proof than to find that same person guilty of the same crime and give them LWOP? Remember, the verdict is made before sentencing begins. What I have been trying to point out to you is that the case of the man given death for a crime will get considerably more scrutiny than the same man given LWOP.", 
   {}, 
   288665, 
   null, 
   1193176020.0
  ], 
  [
   288733, 
   null, 
   "thecap0", 
   "snake,\n \n  Are you sayng that to find someone guilty and sentence them to death should have a higher burden of proof than to find that same person guilty of the same crime and give them LWOP?\n \n Not at all. The SCOTUS has made it plain that only the jury may, once it has convicted an accused, make the choice between the DP and LWOP. Judges are permitted absolutely no input.\n \n What I am saying is that the second choice must meet a MUCH higher burden of proof than the first. For me ANY mitigating evidence whatsoever is sufficient for me to vote for LWOP.emoticon_idea", 
   {
    "post_info": {
     "post_title": "Life is too short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288730, 
   null, 
   1193181060.0
  ], 
  [
   288734, 
   null, 
   "thecap0", 
   "snake,\n \n Name 5 innocent people that have been put to death in the US. \n \n That's just one more in a string of stupid statements from you, pld boy.\n \n Once the prisoner is executed, the case ends.\n \n The more proper inquiry will be, \"How many people who have been convicted and sentenced to the DP were later exonerated and walked out of prison free people?\"\n \n Get this: Juries err!emoticon_angry ", 
   {
    "post_info": {
     "post_title": "Life is too short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288733, 
   null, 
   1193181300.0
  ], 
  [
   288758, 
   null, 
   "snakespit", 
   "The more proper inquiry will be, \"How many people who have been convicted and sentenced to the DP were later exonerated and walked out of prison free people?\"\n \n Get this: Juries err!emoticon_angry \n\n So the appellate process works? emoticon_ic", 
   {}, 
   288734, 
   null, 
   1193196420.0
  ], 
  [
   288764, 
   null, 
   "snakespit", 
   "Not at all. The SCOTUS has made it plain that only the jury may, once it has convicted an accused, make the choice between the DP and LWOP. Judges are permitted absolutely no input.\n\n I know that, but thanks for the update.\n \n \nWhat I am saying is that the second choice must meet a MUCH higher burden of proof than the first. For me ANY mitigating evidence whatsoever is sufficient for me to vote for LWOP.emoticon_idea\n\n The prosecutorial burden in homicide refers to the conditions required to obtain a conviction. If the burden of proof is met, a conviction can be obtained. \n \n Mitigating and aggravating circumstances are used to determine the sentence that will be handed down and have nothing to do with the determination of guilt or innocence. That has already been accomplished.", 
   {}, 
   288733, 
   null, 
   1193199360.0
  ], 
  [
   288804, 
   null, 
   "thecap0", 
   "sspit,\n \n So the appellate process works? \n emoticon_mad emoticon_mad \n Not necessarily.\n \n The appellate process has worked for some individuals.\n \n How many more it has failed to work for is still the question.\n \n One still wonders why so many states are still resisting DNA analysis of physical evidence used against those who have been convicted in the past.\n \n What is it that the states' prosecutors are trying so hard to hide?emoticon_mad", 
   {
    "post_info": {
     "post_title": "Life is too short to be lived in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   288764, 
   null, 
   1193225640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Death Penalty Decreases Crime", 
  "url": "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 9995, 
  "discussion_files": [
   [
    "15380.html", 
    "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime-print.html"
   ], 
   [
    "15381.html", 
    "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime-7-print.html"
   ], 
   [
    "15382.html", 
    "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime-5-print.html"
   ], 
   [
    "15383.html", 
    "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime-4-print.html"
   ], 
   [
    "15384.html", 
    "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime-6-print.html"
   ], 
   [
    "15385.html", 
    "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime-3-print.html"
   ], 
   [
    "15386.html", 
    "http://www.4forums.com/political/crime-debates/9995-death-penalty-decreases-crime-2-print.html"
   ]
  ], 
  "identifier": 9995
 }
]